{"position": "Segment Manager", "company": "Intel Corporation", "profiles": ["Experience Director Product Management and Marketing Intel Corporation January 2013  –  December 2014  (2 years) Phoenix, Arizona Area Internet of Things Group \nApplication Ready Platforms Industrial and Energy Segment Manager Intel Corporation January 2012  –  December 2013  (2 years) Phoenix, Arizona Area Internet of Things Group Energy Market Segment Manager Intel September 2010  –  December 2011  (1 year 4 months) Smart Grid and Home Energy Management \nEmbedded and Communications Group Accelerated Leadership Program Associate Intel August 2008  –  October 2010  (2 years 3 months) Product Management Intern Symantec Corporation 2007  –  2007  (less than a year) VERITAS Server Foundation Team Technical Assistant IBM July 2005  –  June 2006  (1 year) Cell Broadband Engine and Emerging Workload Strategy Team Director Product Management and Marketing Intel Corporation January 2013  –  December 2014  (2 years) Phoenix, Arizona Area Internet of Things Group \nApplication Ready Platforms Director Product Management and Marketing Intel Corporation January 2013  –  December 2014  (2 years) Phoenix, Arizona Area Internet of Things Group \nApplication Ready Platforms Industrial and Energy Segment Manager Intel Corporation January 2012  –  December 2013  (2 years) Phoenix, Arizona Area Internet of Things Group Industrial and Energy Segment Manager Intel Corporation January 2012  –  December 2013  (2 years) Phoenix, Arizona Area Internet of Things Group Energy Market Segment Manager Intel September 2010  –  December 2011  (1 year 4 months) Smart Grid and Home Energy Management \nEmbedded and Communications Group Energy Market Segment Manager Intel September 2010  –  December 2011  (1 year 4 months) Smart Grid and Home Energy Management \nEmbedded and Communications Group Accelerated Leadership Program Associate Intel August 2008  –  October 2010  (2 years 3 months) Accelerated Leadership Program Associate Intel August 2008  –  October 2010  (2 years 3 months) Product Management Intern Symantec Corporation 2007  –  2007  (less than a year) VERITAS Server Foundation Team Product Management Intern Symantec Corporation 2007  –  2007  (less than a year) VERITAS Server Foundation Team Technical Assistant IBM July 2005  –  June 2006  (1 year) Cell Broadband Engine and Emerging Workload Strategy Team Technical Assistant IBM July 2005  –  June 2006  (1 year) Cell Broadband Engine and Emerging Workload Strategy Team Skills Skills     Education Stanford University Graduate School of Business Master of Business Administration (MBA) 2006  – 2008 Duke University BS 1998  – 2002 Stanford University Graduate School of Business Master of Business Administration (MBA) 2006  – 2008 Stanford University Graduate School of Business Master of Business Administration (MBA) 2006  – 2008 Stanford University Graduate School of Business Master of Business Administration (MBA) 2006  – 2008 Duke University BS 1998  – 2002 Duke University BS 1998  – 2002 Duke University BS 1998  – 2002 ", "Skills Strategy Marketing Mobile Devices Product Management Digital Media Segmentation Go-to-market Strategy Product Marketing Strategic Partnerships Mobile Applications Management SaaS Cloud Computing Skills  Strategy Marketing Mobile Devices Product Management Digital Media Segmentation Go-to-market Strategy Product Marketing Strategic Partnerships Mobile Applications Management SaaS Cloud Computing Strategy Marketing Mobile Devices Product Management Digital Media Segmentation Go-to-market Strategy Product Marketing Strategic Partnerships Mobile Applications Management SaaS Cloud Computing Strategy Marketing Mobile Devices Product Management Digital Media Segmentation Go-to-market Strategy Product Marketing Strategic Partnerships Mobile Applications Management SaaS Cloud Computing ", "Summary Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Summary Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Successful track record of growing business revenues and market segment share for new products and solutions. My leadership style is to focus on developmental coaching in conjunction with hands on experience to achieve sustainable business results.  \n \n18 yrs experience of Leadership and Management in the Asia Pacific Region. Develop business strategies for the practical adoption of innovative solutions in ERP, CRM and Supply Chain through to Multimedia Based Learning Management Systems. Sydney Australia is my base of operations. \n \nBusiness Goal - To lead a business from $5m to $100m in the next years. \n \nSpecialties: Business Leadership, Executive Coaching, Change Management, Technology Strategy, Market Share Growth. Experience Aus/NZ Tablet Category Manager Intel Corporation January 2014  – Present (1 year 8 months) To own the Strategy Development and Channel to Market execution plans that grow the penetration of Intel-based tablets in Australia and New Zealand. The critical outcome is developing the tablet category through all levels of our customer base, from hardware manufacturers who are increasingly opting for Intel processors inside their tablet designs, through large format retailers and in to our channel reseller base and key end-user customers. Executive - Digital Economy Enablement Intel Corporation September 2010  – Present (5 years) The scope of this role is to work with businesses and the public sector to identify and act on opportunities arising from Australia’s new National Broadband Network. He leads the company’s digital economy initiatives in this country. Aus/NZ Segment Manager - Mobility Devices Intel Corporation October 2002  – Present (12 years 11 months) ANZ Group Manager, Enterprise Business Development Intel Corporation November 2006  –  September 2010  (3 years 11 months) In his role, Corey is responsible for establishing rapid time to adoption of Intel standards-based computing technology, with a particular focus in the Top 100 of Enterprises and Government agencies. The Enterprise Solutions team maintains strategic relationships with these customers to ensure they realise the full benefits of Intel-based solutions in the enterprise environment. Financial Services Industry Business Development Manager Intel Corporation December 2004  –  November 2006  (2 years) Retail Industry Business Development Manager Intel Corporation July 2003  –  December 2004  (1 year 6 months) Business Development Manager, High Performance Computing Intel Corporation October 2002  –  July 2003  (10 months) Commerical Industry Manager Sun Microsystems September 2000  –  August 2002  (2 years) Asia Pacific Regional Manager NETg (Harcourt Brace) March 1998  –  August 2000  (2 years 6 months) Supply Chain Senior Acount Executive i2 Technologies July 1996  –  March 1998  (1 year 9 months) Manufacturing Industry Account Executive J.D. Edwards & Co February 1994  –  July 1996  (2 years 6 months) Open Systems Division Manager Stott & Hoare (IBM VAR) March 1988  –  December 1993  (5 years 10 months) Aus/NZ Tablet Category Manager Intel Corporation January 2014  – Present (1 year 8 months) To own the Strategy Development and Channel to Market execution plans that grow the penetration of Intel-based tablets in Australia and New Zealand. The critical outcome is developing the tablet category through all levels of our customer base, from hardware manufacturers who are increasingly opting for Intel processors inside their tablet designs, through large format retailers and in to our channel reseller base and key end-user customers. Aus/NZ Tablet Category Manager Intel Corporation January 2014  – Present (1 year 8 months) To own the Strategy Development and Channel to Market execution plans that grow the penetration of Intel-based tablets in Australia and New Zealand. The critical outcome is developing the tablet category through all levels of our customer base, from hardware manufacturers who are increasingly opting for Intel processors inside their tablet designs, through large format retailers and in to our channel reseller base and key end-user customers. Executive - Digital Economy Enablement Intel Corporation September 2010  – Present (5 years) The scope of this role is to work with businesses and the public sector to identify and act on opportunities arising from Australia’s new National Broadband Network. He leads the company’s digital economy initiatives in this country. Executive - Digital Economy Enablement Intel Corporation September 2010  – Present (5 years) The scope of this role is to work with businesses and the public sector to identify and act on opportunities arising from Australia’s new National Broadband Network. He leads the company’s digital economy initiatives in this country. Aus/NZ Segment Manager - Mobility Devices Intel Corporation October 2002  – Present (12 years 11 months) Aus/NZ Segment Manager - Mobility Devices Intel Corporation October 2002  – Present (12 years 11 months) ANZ Group Manager, Enterprise Business Development Intel Corporation November 2006  –  September 2010  (3 years 11 months) In his role, Corey is responsible for establishing rapid time to adoption of Intel standards-based computing technology, with a particular focus in the Top 100 of Enterprises and Government agencies. The Enterprise Solutions team maintains strategic relationships with these customers to ensure they realise the full benefits of Intel-based solutions in the enterprise environment. ANZ Group Manager, Enterprise Business Development Intel Corporation November 2006  –  September 2010  (3 years 11 months) In his role, Corey is responsible for establishing rapid time to adoption of Intel standards-based computing technology, with a particular focus in the Top 100 of Enterprises and Government agencies. The Enterprise Solutions team maintains strategic relationships with these customers to ensure they realise the full benefits of Intel-based solutions in the enterprise environment. Financial Services Industry Business Development Manager Intel Corporation December 2004  –  November 2006  (2 years) Financial Services Industry Business Development Manager Intel Corporation December 2004  –  November 2006  (2 years) Retail Industry Business Development Manager Intel Corporation July 2003  –  December 2004  (1 year 6 months) Retail Industry Business Development Manager Intel Corporation July 2003  –  December 2004  (1 year 6 months) Business Development Manager, High Performance Computing Intel Corporation October 2002  –  July 2003  (10 months) Business Development Manager, High Performance Computing Intel Corporation October 2002  –  July 2003  (10 months) Commerical Industry Manager Sun Microsystems September 2000  –  August 2002  (2 years) Commerical Industry Manager Sun Microsystems September 2000  –  August 2002  (2 years) Asia Pacific Regional Manager NETg (Harcourt Brace) March 1998  –  August 2000  (2 years 6 months) Asia Pacific Regional Manager NETg (Harcourt Brace) March 1998  –  August 2000  (2 years 6 months) Supply Chain Senior Acount Executive i2 Technologies July 1996  –  March 1998  (1 year 9 months) Supply Chain Senior Acount Executive i2 Technologies July 1996  –  March 1998  (1 year 9 months) Manufacturing Industry Account Executive J.D. Edwards & Co February 1994  –  July 1996  (2 years 6 months) Manufacturing Industry Account Executive J.D. Edwards & Co February 1994  –  July 1996  (2 years 6 months) Open Systems Division Manager Stott & Hoare (IBM VAR) March 1988  –  December 1993  (5 years 10 months) Open Systems Division Manager Stott & Hoare (IBM VAR) March 1988  –  December 1993  (5 years 10 months) Languages French French French Skills ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less Skills  ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less ERP Business Strategy Program Management Strategic Planning Strategy Development Start-ups New Business Development Sales Management Business Planning Team Leadership Go-to-market Strategy Strategy Strategic Partnerships Change Management Business Intelligence Executive Coaching Life Coaching Federal Government Enterprise Software Team Management Channel Partners Direct Sales Management Business Development Sales Product Marketing Product Management IT Strategy Cloud Computing Solution Selling SaaS Business Alliances See 17+     See less Education Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Lewis and Clark College BA,  Communication 1984  – 1987 Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Macquarie Graduate School of Management (MGSM) MBA,  M&A , Finance, Marketing,  Operations 2004  – 2006 Activities and Societies:  MGSM Logistics Management Award Lewis and Clark College BA,  Communication 1984  – 1987 Lewis and Clark College BA,  Communication 1984  – 1987 Lewis and Clark College BA,  Communication 1984  – 1987 ", "Summary Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Summary Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Experience Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Defining next generation Xeon CPU and platform capabilities supporting key Datacenter segments, including Cloud, Enterprise, Technical Computing and Intelligent Systems. All-in-One Segment Manager Intel Corporation March 2012  –  July 2013  (1 year 5 months) Portland, Oregon Area Led a cross-organizational effort to reinvigorate the desktop PC market and accelerate consumer refresh. Engaged with OEM customers to identify compelling user experiences which fulfill consumers’ unmet needs. Defined product specifications that deliver targeted experiences, based upon customer input and feedback. Won multiple designs with each of the top All-in-One OEMs worldwide. Managed AIO business for Intel (including a direct report team of Product Marketing Engineers), coordinating efforts of Engineering, Customer Enabling, Product Marketing, Corporate Marketing and Strategic Planning. Established volume goals and drove cross-Intel execution to meet them. PCCG Director of Compute Continuum Intel January 2011  –  March 2012  (1 year 3 months) Hillsboro, OR Lead Intel-wide initiative to deliver cross-device user experiences. Forged executive consensus on strategies to increase PC relevance, gain marketshare in adjacent markets and grow revenue beyond silicon via Compute Continuum CSD. Delivered products to market (Common Connectivity Framework middleware, Intel® Pair & Share, Intel® TelePort Extender) by managing engineering execution and product marketing. Defined next-generation solutions for device-to-device connectivity (CCF2.0) and showcase app (My Media Library); aligned PCCG via PLBP and scoped budgets via Plan process. Desktop Platform Roadmap Manager Intel June 2006  –  January 2011  (4 years 8 months) Drove strategies and plans to maximize margins for Intel’s $12B Desktop platform business. Defined and championed the “Differentiated Desktop” business segmentation strategy. Secured funding and drove execution; met or exceeded business goals. Transformed Intel’s internal Desktop CPU Roadmap into a competitive performance analysis engine and utilized it to drive business strategies and product capabilities. Product Manager Intel August 2005  –  June 2006  (11 months) Drove Product Development Teams to bring new CPUs to market and meet customer requirements. Led Problem Response Teams to contain and determine root cause of escaped discrepant material. Managed external communications with customers. Process Technology Program Manager Intel Corporation February 2003  –  August 2005  (2 years 7 months) Hillsboro, OR Matrix managed TME (1000 person org) to deliver affordable, ramp-ready process technologies. Created systems and business processes to collect affordability data, measure performance-to-goal and provide closed loop feedback to customers and stakeholders. Drove ramp readiness risk assessment and gap closure for each toolset in the process flow. Group Leader Intel April 1999  –  August 2005  (6 years 5 months) Managed a team of 6-8 engineers to select, develop and ramp metal deposition equipment. Facilitated employee development and growth, wrote and delivered performance reviews, managed staffing and employee performance to meet group deliverables. Managed Intel/supplier business relationships and negotiated commercial deals. Sr. Process Engineer Intel February 1995  –  April 1999  (4 years 3 months) Santa Clara, CA Selected, developed and ramped plasma etch, CVD and PVD process equipment for advanced semiconductor process nodes. Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Defining next generation Xeon CPU and platform capabilities supporting key Datacenter segments, including Cloud, Enterprise, Technical Computing and Intelligent Systems. Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Defining next generation Xeon CPU and platform capabilities supporting key Datacenter segments, including Cloud, Enterprise, Technical Computing and Intelligent Systems. All-in-One Segment Manager Intel Corporation March 2012  –  July 2013  (1 year 5 months) Portland, Oregon Area Led a cross-organizational effort to reinvigorate the desktop PC market and accelerate consumer refresh. Engaged with OEM customers to identify compelling user experiences which fulfill consumers’ unmet needs. Defined product specifications that deliver targeted experiences, based upon customer input and feedback. Won multiple designs with each of the top All-in-One OEMs worldwide. Managed AIO business for Intel (including a direct report team of Product Marketing Engineers), coordinating efforts of Engineering, Customer Enabling, Product Marketing, Corporate Marketing and Strategic Planning. Established volume goals and drove cross-Intel execution to meet them. All-in-One Segment Manager Intel Corporation March 2012  –  July 2013  (1 year 5 months) Portland, Oregon Area Led a cross-organizational effort to reinvigorate the desktop PC market and accelerate consumer refresh. Engaged with OEM customers to identify compelling user experiences which fulfill consumers’ unmet needs. Defined product specifications that deliver targeted experiences, based upon customer input and feedback. Won multiple designs with each of the top All-in-One OEMs worldwide. Managed AIO business for Intel (including a direct report team of Product Marketing Engineers), coordinating efforts of Engineering, Customer Enabling, Product Marketing, Corporate Marketing and Strategic Planning. Established volume goals and drove cross-Intel execution to meet them. PCCG Director of Compute Continuum Intel January 2011  –  March 2012  (1 year 3 months) Hillsboro, OR Lead Intel-wide initiative to deliver cross-device user experiences. Forged executive consensus on strategies to increase PC relevance, gain marketshare in adjacent markets and grow revenue beyond silicon via Compute Continuum CSD. Delivered products to market (Common Connectivity Framework middleware, Intel® Pair & Share, Intel® TelePort Extender) by managing engineering execution and product marketing. Defined next-generation solutions for device-to-device connectivity (CCF2.0) and showcase app (My Media Library); aligned PCCG via PLBP and scoped budgets via Plan process. PCCG Director of Compute Continuum Intel January 2011  –  March 2012  (1 year 3 months) Hillsboro, OR Lead Intel-wide initiative to deliver cross-device user experiences. Forged executive consensus on strategies to increase PC relevance, gain marketshare in adjacent markets and grow revenue beyond silicon via Compute Continuum CSD. Delivered products to market (Common Connectivity Framework middleware, Intel® Pair & Share, Intel® TelePort Extender) by managing engineering execution and product marketing. Defined next-generation solutions for device-to-device connectivity (CCF2.0) and showcase app (My Media Library); aligned PCCG via PLBP and scoped budgets via Plan process. Desktop Platform Roadmap Manager Intel June 2006  –  January 2011  (4 years 8 months) Drove strategies and plans to maximize margins for Intel’s $12B Desktop platform business. Defined and championed the “Differentiated Desktop” business segmentation strategy. Secured funding and drove execution; met or exceeded business goals. Transformed Intel’s internal Desktop CPU Roadmap into a competitive performance analysis engine and utilized it to drive business strategies and product capabilities. Desktop Platform Roadmap Manager Intel June 2006  –  January 2011  (4 years 8 months) Drove strategies and plans to maximize margins for Intel’s $12B Desktop platform business. Defined and championed the “Differentiated Desktop” business segmentation strategy. Secured funding and drove execution; met or exceeded business goals. Transformed Intel’s internal Desktop CPU Roadmap into a competitive performance analysis engine and utilized it to drive business strategies and product capabilities. Product Manager Intel August 2005  –  June 2006  (11 months) Drove Product Development Teams to bring new CPUs to market and meet customer requirements. Led Problem Response Teams to contain and determine root cause of escaped discrepant material. Managed external communications with customers. Product Manager Intel August 2005  –  June 2006  (11 months) Drove Product Development Teams to bring new CPUs to market and meet customer requirements. Led Problem Response Teams to contain and determine root cause of escaped discrepant material. Managed external communications with customers. Process Technology Program Manager Intel Corporation February 2003  –  August 2005  (2 years 7 months) Hillsboro, OR Matrix managed TME (1000 person org) to deliver affordable, ramp-ready process technologies. Created systems and business processes to collect affordability data, measure performance-to-goal and provide closed loop feedback to customers and stakeholders. Drove ramp readiness risk assessment and gap closure for each toolset in the process flow. Process Technology Program Manager Intel Corporation February 2003  –  August 2005  (2 years 7 months) Hillsboro, OR Matrix managed TME (1000 person org) to deliver affordable, ramp-ready process technologies. Created systems and business processes to collect affordability data, measure performance-to-goal and provide closed loop feedback to customers and stakeholders. Drove ramp readiness risk assessment and gap closure for each toolset in the process flow. Group Leader Intel April 1999  –  August 2005  (6 years 5 months) Managed a team of 6-8 engineers to select, develop and ramp metal deposition equipment. Facilitated employee development and growth, wrote and delivered performance reviews, managed staffing and employee performance to meet group deliverables. Managed Intel/supplier business relationships and negotiated commercial deals. Group Leader Intel April 1999  –  August 2005  (6 years 5 months) Managed a team of 6-8 engineers to select, develop and ramp metal deposition equipment. Facilitated employee development and growth, wrote and delivered performance reviews, managed staffing and employee performance to meet group deliverables. Managed Intel/supplier business relationships and negotiated commercial deals. Sr. Process Engineer Intel February 1995  –  April 1999  (4 years 3 months) Santa Clara, CA Selected, developed and ramped plasma etch, CVD and PVD process equipment for advanced semiconductor process nodes. Sr. Process Engineer Intel February 1995  –  April 1999  (4 years 3 months) Santa Clara, CA Selected, developed and ramped plasma etch, CVD and PVD process equipment for advanced semiconductor process nodes. Skills Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Skills  Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Education University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi Honors & Awards Additional Honors & Awards Intel Achievement Award, 2011 Additional Honors & Awards Intel Achievement Award, 2011 Additional Honors & Awards Intel Achievement Award, 2011 Additional Honors & Awards Intel Achievement Award, 2011 ", "Skills Casual Games Video Games Online Gaming Monetization MMO Interactive... Mobile Games Game Development Digital Distribution Social Games Computer Games Game Design Console MMORPG Gaming Game Mechanics See 1+     See less Skills  Casual Games Video Games Online Gaming Monetization MMO Interactive... Mobile Games Game Development Digital Distribution Social Games Computer Games Game Design Console MMORPG Gaming Game Mechanics See 1+     See less Casual Games Video Games Online Gaming Monetization MMO Interactive... Mobile Games Game Development Digital Distribution Social Games Computer Games Game Design Console MMORPG Gaming Game Mechanics See 1+     See less Casual Games Video Games Online Gaming Monetization MMO Interactive... Mobile Games Game Development Digital Distribution Social Games Computer Games Game Design Console MMORPG Gaming Game Mechanics See 1+     See less ", "Summary • Leadership experience in software product planning as measured by requirements collection and prioritization, product definition with multi-disciplinary teams, pricing, channel planning, marketing materials preparation, product launch and driving business success.  \n \n• Disciplined quantitative & qualitative research, analysis and planning skills, including market analysis, forecasting, segmentation, requirements organization and more.  \n \n• Excellent communications and negotiating skills with strong customer orientation.  \n \n• Strong team skills focused on organizing, leading & participating in long- and short-term teams. Specialties:Classic product marketing -- the 4Ps -- as applied to software products, with focus on requirements identification, product definition, pricing, product launch and business tracking. Summary • Leadership experience in software product planning as measured by requirements collection and prioritization, product definition with multi-disciplinary teams, pricing, channel planning, marketing materials preparation, product launch and driving business success.  \n \n• Disciplined quantitative & qualitative research, analysis and planning skills, including market analysis, forecasting, segmentation, requirements organization and more.  \n \n• Excellent communications and negotiating skills with strong customer orientation.  \n \n• Strong team skills focused on organizing, leading & participating in long- and short-term teams. Specialties:Classic product marketing -- the 4Ps -- as applied to software products, with focus on requirements identification, product definition, pricing, product launch and business tracking. • Leadership experience in software product planning as measured by requirements collection and prioritization, product definition with multi-disciplinary teams, pricing, channel planning, marketing materials preparation, product launch and driving business success.  \n \n• Disciplined quantitative & qualitative research, analysis and planning skills, including market analysis, forecasting, segmentation, requirements organization and more.  \n \n• Excellent communications and negotiating skills with strong customer orientation.  \n \n• Strong team skills focused on organizing, leading & participating in long- and short-term teams. Specialties:Classic product marketing -- the 4Ps -- as applied to software products, with focus on requirements identification, product definition, pricing, product launch and business tracking. • Leadership experience in software product planning as measured by requirements collection and prioritization, product definition with multi-disciplinary teams, pricing, channel planning, marketing materials preparation, product launch and driving business success.  \n \n• Disciplined quantitative & qualitative research, analysis and planning skills, including market analysis, forecasting, segmentation, requirements organization and more.  \n \n• Excellent communications and negotiating skills with strong customer orientation.  \n \n• Strong team skills focused on organizing, leading & participating in long- and short-term teams. Specialties:Classic product marketing -- the 4Ps -- as applied to software products, with focus on requirements identification, product definition, pricing, product launch and business tracking. Experience Product Marketing Manager Intel Corporation October 2004  – Present (10 years 11 months) Product Marketing Manager for various Intel software development products. Responsibilities include product planning, pricing, positioning, launching, promotion and channel strategy -- classic 4Ps of marketing -- along with forecasting and tracking business. Compiler Product Marketing Manager Intel Corporation September 1999  –  October 2004  (5 years 2 months) Product planning for Intel® Compilers for Intel® platforms running Windows and Linux. Planned and executed multiple releases. Identified, drove, closed and integrated the acquisition of KAI, a threading-tools software company (received Division Recognition Award). Drove planning and execution for the first use of electronic license keys for software and Intel web site for sales and fulfillment of software products (received Division Recognition Award). Set up our Account Development team, which led to an order of magnitude improvement in product sales in one year. Market Segment Manager Intel Corporation July 1997  –  September 1999  (2 years 3 months) Planned and executed multi-processor workstation software marketing program. Marketing content highlighted by PC Magazine as Editor’s Choice (received Division Recognition Award). Negotiated with and drove software companies to deliver threaded applications supporting Intel multiprocessor platforms. Product Manager Digital Equipment 1987  –  1997  (10 years) Product Marketing: Product definition/requirements, pricing, launch, forecasting, segmentation, positioning -- classic 4Ps marketing. Product Marketing Manager Intel Corporation October 2004  – Present (10 years 11 months) Product Marketing Manager for various Intel software development products. Responsibilities include product planning, pricing, positioning, launching, promotion and channel strategy -- classic 4Ps of marketing -- along with forecasting and tracking business. Product Marketing Manager Intel Corporation October 2004  – Present (10 years 11 months) Product Marketing Manager for various Intel software development products. Responsibilities include product planning, pricing, positioning, launching, promotion and channel strategy -- classic 4Ps of marketing -- along with forecasting and tracking business. Compiler Product Marketing Manager Intel Corporation September 1999  –  October 2004  (5 years 2 months) Product planning for Intel® Compilers for Intel® platforms running Windows and Linux. Planned and executed multiple releases. Identified, drove, closed and integrated the acquisition of KAI, a threading-tools software company (received Division Recognition Award). Drove planning and execution for the first use of electronic license keys for software and Intel web site for sales and fulfillment of software products (received Division Recognition Award). Set up our Account Development team, which led to an order of magnitude improvement in product sales in one year. Compiler Product Marketing Manager Intel Corporation September 1999  –  October 2004  (5 years 2 months) Product planning for Intel® Compilers for Intel® platforms running Windows and Linux. Planned and executed multiple releases. Identified, drove, closed and integrated the acquisition of KAI, a threading-tools software company (received Division Recognition Award). Drove planning and execution for the first use of electronic license keys for software and Intel web site for sales and fulfillment of software products (received Division Recognition Award). Set up our Account Development team, which led to an order of magnitude improvement in product sales in one year. Market Segment Manager Intel Corporation July 1997  –  September 1999  (2 years 3 months) Planned and executed multi-processor workstation software marketing program. Marketing content highlighted by PC Magazine as Editor’s Choice (received Division Recognition Award). Negotiated with and drove software companies to deliver threaded applications supporting Intel multiprocessor platforms. Market Segment Manager Intel Corporation July 1997  –  September 1999  (2 years 3 months) Planned and executed multi-processor workstation software marketing program. Marketing content highlighted by PC Magazine as Editor’s Choice (received Division Recognition Award). Negotiated with and drove software companies to deliver threaded applications supporting Intel multiprocessor platforms. Product Manager Digital Equipment 1987  –  1997  (10 years) Product Marketing: Product definition/requirements, pricing, launch, forecasting, segmentation, positioning -- classic 4Ps marketing. Product Manager Digital Equipment 1987  –  1997  (10 years) Product Marketing: Product definition/requirements, pricing, launch, forecasting, segmentation, positioning -- classic 4Ps marketing. Skills Product Development Pricing Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Product Lifecycle... Product Launch Sales Enablement Semiconductors Demand Generation Competitive Analysis Multi-channel Marketing Business Alliances Strategic Partnerships Intel Segmentation Oracle Enterprise... SaaS Positioning Software Development Marketing Strategy Marketing Management Program Management Marketing High Performance... Strategy Business Development Market Analysis Mobile Devices Partner Management Integrated Marketing See 17+     See less Skills  Product Development Pricing Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Product Lifecycle... Product Launch Sales Enablement Semiconductors Demand Generation Competitive Analysis Multi-channel Marketing Business Alliances Strategic Partnerships Intel Segmentation Oracle Enterprise... SaaS Positioning Software Development Marketing Strategy Marketing Management Program Management Marketing High Performance... Strategy Business Development Market Analysis Mobile Devices Partner Management Integrated Marketing See 17+     See less Product Development Pricing Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Product Lifecycle... Product Launch Sales Enablement Semiconductors Demand Generation Competitive Analysis Multi-channel Marketing Business Alliances Strategic Partnerships Intel Segmentation Oracle Enterprise... SaaS Positioning Software Development Marketing Strategy Marketing Management Program Management Marketing High Performance... Strategy Business Development Market Analysis Mobile Devices Partner Management Integrated Marketing See 17+     See less Product Development Pricing Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Product Lifecycle... Product Launch Sales Enablement Semiconductors Demand Generation Competitive Analysis Multi-channel Marketing Business Alliances Strategic Partnerships Intel Segmentation Oracle Enterprise... SaaS Positioning Software Development Marketing Strategy Marketing Management Program Management Marketing High Performance... Strategy Business Development Market Analysis Mobile Devices Partner Management Integrated Marketing See 17+     See less Education Michigan State University BA,  Political Science , Econ Was accepted into and graduated from James Madison College, a residential college that is part of Michigan State University on the East Lansing campus. The environment provided the benefits of a small college atmosphere, such as smaller class sizes and more focused students and professors, along side the benefits of a larger, Big-10 university. Activities and Societies:  Graduated with Honors. Boston College MA,  Economics/Sociology Master's thesis was a 4 equation econometric model forecasting welfare caseload dynamics in North Carolina. The model was used to predict demand for services by modeling incoming applicants (incoming 'customers') and those leaving the system (departing or lost 'customers') depending on general economic conditions, secular and seasonal factors and administrative effects. It also was used to forecast budgets. This research led to a life-long interest in data-driven decision making. Activities and Societies:  Master's Degree \"With Distinction.\" Stanford University Graduate School of Business, Executive Education,  Leading Change and Organizational Renewal , Certificate 2001  – 2001 University of California, Berkeley, Haas School of Business Product Management Certificate,  Business Administration 2009  – 2009 Michigan State University BA,  Political Science , Econ Was accepted into and graduated from James Madison College, a residential college that is part of Michigan State University on the East Lansing campus. The environment provided the benefits of a small college atmosphere, such as smaller class sizes and more focused students and professors, along side the benefits of a larger, Big-10 university. Activities and Societies:  Graduated with Honors. Michigan State University BA,  Political Science , Econ Was accepted into and graduated from James Madison College, a residential college that is part of Michigan State University on the East Lansing campus. The environment provided the benefits of a small college atmosphere, such as smaller class sizes and more focused students and professors, along side the benefits of a larger, Big-10 university. Activities and Societies:  Graduated with Honors. Michigan State University BA,  Political Science , Econ Was accepted into and graduated from James Madison College, a residential college that is part of Michigan State University on the East Lansing campus. The environment provided the benefits of a small college atmosphere, such as smaller class sizes and more focused students and professors, along side the benefits of a larger, Big-10 university. Activities and Societies:  Graduated with Honors. Boston College MA,  Economics/Sociology Master's thesis was a 4 equation econometric model forecasting welfare caseload dynamics in North Carolina. The model was used to predict demand for services by modeling incoming applicants (incoming 'customers') and those leaving the system (departing or lost 'customers') depending on general economic conditions, secular and seasonal factors and administrative effects. It also was used to forecast budgets. This research led to a life-long interest in data-driven decision making. Activities and Societies:  Master's Degree \"With Distinction.\" Boston College MA,  Economics/Sociology Master's thesis was a 4 equation econometric model forecasting welfare caseload dynamics in North Carolina. The model was used to predict demand for services by modeling incoming applicants (incoming 'customers') and those leaving the system (departing or lost 'customers') depending on general economic conditions, secular and seasonal factors and administrative effects. It also was used to forecast budgets. This research led to a life-long interest in data-driven decision making. Activities and Societies:  Master's Degree \"With Distinction.\" Boston College MA,  Economics/Sociology Master's thesis was a 4 equation econometric model forecasting welfare caseload dynamics in North Carolina. The model was used to predict demand for services by modeling incoming applicants (incoming 'customers') and those leaving the system (departing or lost 'customers') depending on general economic conditions, secular and seasonal factors and administrative effects. It also was used to forecast budgets. This research led to a life-long interest in data-driven decision making. Activities and Societies:  Master's Degree \"With Distinction.\" Stanford University Graduate School of Business, Executive Education,  Leading Change and Organizational Renewal , Certificate 2001  – 2001 Stanford University Graduate School of Business, Executive Education,  Leading Change and Organizational Renewal , Certificate 2001  – 2001 Stanford University Graduate School of Business, Executive Education,  Leading Change and Organizational Renewal , Certificate 2001  – 2001 University of California, Berkeley, Haas School of Business Product Management Certificate,  Business Administration 2009  – 2009 University of California, Berkeley, Haas School of Business Product Management Certificate,  Business Administration 2009  – 2009 University of California, Berkeley, Haas School of Business Product Management Certificate,  Business Administration 2009  – 2009 ", "Languages Russian German Russian German Russian German Skills Strategic Planning Product Development Cross-functional Team... Market Analysis Start-ups Strategy Management Product Marketing Product Management Competitive Analysis New Business Development Business Strategy Marketing Strategy Business Development Sales Management Leadership Change Management Sales Investments Portfolio Management Analysis Strategic Partnerships Business Planning Mergers & Acquisitions Travel Photography Management Consulting CRM Entrepreneurship Finance Segmentation Asset Management Securities Risk Management Analytics Marketing Program Management Financial Analysis Investment Advisory Asset Allocation Series 7 Series 63 Investment Strategies 401k Alternative Investments B2B Strategic Financial... See 32+     See less Skills  Strategic Planning Product Development Cross-functional Team... Market Analysis Start-ups Strategy Management Product Marketing Product Management Competitive Analysis New Business Development Business Strategy Marketing Strategy Business Development Sales Management Leadership Change Management Sales Investments Portfolio Management Analysis Strategic Partnerships Business Planning Mergers & Acquisitions Travel Photography Management Consulting CRM Entrepreneurship Finance Segmentation Asset Management Securities Risk Management Analytics Marketing Program Management Financial Analysis Investment Advisory Asset Allocation Series 7 Series 63 Investment Strategies 401k Alternative Investments B2B Strategic Financial... See 32+     See less Strategic Planning Product Development Cross-functional Team... Market Analysis Start-ups Strategy Management Product Marketing Product Management Competitive Analysis New Business Development Business Strategy Marketing Strategy Business Development Sales Management Leadership Change Management Sales Investments Portfolio Management Analysis Strategic Partnerships Business Planning Mergers & Acquisitions Travel Photography Management Consulting CRM Entrepreneurship Finance Segmentation Asset Management Securities Risk Management Analytics Marketing Program Management Financial Analysis Investment Advisory Asset Allocation Series 7 Series 63 Investment Strategies 401k Alternative Investments B2B Strategic Financial... See 32+     See less Strategic Planning Product Development Cross-functional Team... Market Analysis Start-ups Strategy Management Product Marketing Product Management Competitive Analysis New Business Development Business Strategy Marketing Strategy Business Development Sales Management Leadership Change Management Sales Investments Portfolio Management Analysis Strategic Partnerships Business Planning Mergers & Acquisitions Travel Photography Management Consulting CRM Entrepreneurship Finance Segmentation Asset Management Securities Risk Management Analytics Marketing Program Management Financial Analysis Investment Advisory Asset Allocation Series 7 Series 63 Investment Strategies 401k Alternative Investments B2B Strategic Financial... See 32+     See less Honors & Awards 2012 Schwab CEO Award for Business Excellence Charles Schwab & Co. 2013 Schwab Chairman's Club Award Charles Schwab & Co. Top Financial Advisor in Arizona 2014 Five Star Professionals Top Financial Advisor in Arizona 2015 Five Star Professionals 2012 Schwab CEO Award for Business Excellence Charles Schwab & Co. 2012 Schwab CEO Award for Business Excellence Charles Schwab & Co. 2012 Schwab CEO Award for Business Excellence Charles Schwab & Co. 2013 Schwab Chairman's Club Award Charles Schwab & Co. 2013 Schwab Chairman's Club Award Charles Schwab & Co. 2013 Schwab Chairman's Club Award Charles Schwab & Co. Top Financial Advisor in Arizona 2014 Five Star Professionals Top Financial Advisor in Arizona 2014 Five Star Professionals Top Financial Advisor in Arizona 2014 Five Star Professionals Top Financial Advisor in Arizona 2015 Five Star Professionals Top Financial Advisor in Arizona 2015 Five Star Professionals Top Financial Advisor in Arizona 2015 Five Star Professionals ", "Languages Spanish English Hebrew Spanish English Hebrew Spanish English Hebrew Skills Business Strategy Marketing Strategy Market Analysis New Business Development Cross-functional Team... Team Leadership Embedded Systems Semiconductors Influencer Marketing Storage Solutions Wireless Networking Alliance Development Diversity Training Intercultural... IP Networking Wireline Business Development IP Strategic Alliances Pre-sales Wireless Telecommunications Management Product Management Strategic Partnerships Go-to-market Strategy See 11+     See less Skills  Business Strategy Marketing Strategy Market Analysis New Business Development Cross-functional Team... Team Leadership Embedded Systems Semiconductors Influencer Marketing Storage Solutions Wireless Networking Alliance Development Diversity Training Intercultural... IP Networking Wireline Business Development IP Strategic Alliances Pre-sales Wireless Telecommunications Management Product Management Strategic Partnerships Go-to-market Strategy See 11+     See less Business Strategy Marketing Strategy Market Analysis New Business Development Cross-functional Team... Team Leadership Embedded Systems Semiconductors Influencer Marketing Storage Solutions Wireless Networking Alliance Development Diversity Training Intercultural... IP Networking Wireline Business Development IP Strategic Alliances Pre-sales Wireless Telecommunications Management Product Management Strategic Partnerships Go-to-market Strategy See 11+     See less Business Strategy Marketing Strategy Market Analysis New Business Development Cross-functional Team... Team Leadership Embedded Systems Semiconductors Influencer Marketing Storage Solutions Wireless Networking Alliance Development Diversity Training Intercultural... IP Networking Wireline Business Development IP Strategic Alliances Pre-sales Wireless Telecommunications Management Product Management Strategic Partnerships Go-to-market Strategy See 11+     See less ", "Skills New Business Development Marketing Strategy Account Management Strategic Partnerships Lead Generation Go-to-market Strategy Business Strategy International Sales Strategy Pricing Market Research Product Management SaaS Cold Calling CRM Sales Management Product Marketing Direct Sales Sales Operations Key Account Management Selling Competitive Analysis See 8+     See less Skills  New Business Development Marketing Strategy Account Management Strategic Partnerships Lead Generation Go-to-market Strategy Business Strategy International Sales Strategy Pricing Market Research Product Management SaaS Cold Calling CRM Sales Management Product Marketing Direct Sales Sales Operations Key Account Management Selling Competitive Analysis See 8+     See less New Business Development Marketing Strategy Account Management Strategic Partnerships Lead Generation Go-to-market Strategy Business Strategy International Sales Strategy Pricing Market Research Product Management SaaS Cold Calling CRM Sales Management Product Marketing Direct Sales Sales Operations Key Account Management Selling Competitive Analysis See 8+     See less New Business Development Marketing Strategy Account Management Strategic Partnerships Lead Generation Go-to-market Strategy Business Strategy International Sales Strategy Pricing Market Research Product Management SaaS Cold Calling CRM Sales Management Product Marketing Direct Sales Sales Operations Key Account Management Selling Competitive Analysis See 8+     See less ", "Experience IoTG Segment Manager - Agriculture Intel Corporation July 2015  – Present (2 months) Business Development Strategist - Accelerated Leadership Program (ALP) Intel Corporation June 2014  –  August 2014  (3 months) Internet of Things (IoT) Strategy Business Development Scratch | Micropayments Modernized March 2014  –  May 2014  (3 months) Utah Venture Finance Due Diligence Auxano Funding December 2012  –  March 2014  (1 year 4 months) Senior Associate - Technology Sector PwC 2009  –  2013  (4 years) Project Manager Applied Materials May 2008  –  September 2008  (5 months) Austin, Texas Area Business Development Account Manager Dell April 2006  –  September 2007  (1 year 6 months) Austin, Texas Area IoTG Segment Manager - Agriculture Intel Corporation July 2015  – Present (2 months) IoTG Segment Manager - Agriculture Intel Corporation July 2015  – Present (2 months) Business Development Strategist - Accelerated Leadership Program (ALP) Intel Corporation June 2014  –  August 2014  (3 months) Internet of Things (IoT) Strategy Business Development Strategist - Accelerated Leadership Program (ALP) Intel Corporation June 2014  –  August 2014  (3 months) Internet of Things (IoT) Strategy Business Development Scratch | Micropayments Modernized March 2014  –  May 2014  (3 months) Utah Business Development Scratch | Micropayments Modernized March 2014  –  May 2014  (3 months) Utah Venture Finance Due Diligence Auxano Funding December 2012  –  March 2014  (1 year 4 months) Venture Finance Due Diligence Auxano Funding December 2012  –  March 2014  (1 year 4 months) Senior Associate - Technology Sector PwC 2009  –  2013  (4 years) Senior Associate - Technology Sector PwC 2009  –  2013  (4 years) Project Manager Applied Materials May 2008  –  September 2008  (5 months) Austin, Texas Area Project Manager Applied Materials May 2008  –  September 2008  (5 months) Austin, Texas Area Business Development Account Manager Dell April 2006  –  September 2007  (1 year 6 months) Austin, Texas Area Business Development Account Manager Dell April 2006  –  September 2007  (1 year 6 months) Austin, Texas Area Languages Korean French Korean French Korean French Skills Financial Analysis Accounting Leadership Strategy Management Project Management Cross-functional Team... Marketing Strategy Product Marketing Start-ups Entrepreneurship Coaching Social Media Marketing Market Research Public Speaking Marketing Microsoft Excel Consultative Sales Relationship Management Financial Reporting Teaching and Training Venture Financing Strategic Consulting Web Analytics Thought Leadership Social Networking Presentations SWOT analysis See 13+     See less Skills  Financial Analysis Accounting Leadership Strategy Management Project Management Cross-functional Team... Marketing Strategy Product Marketing Start-ups Entrepreneurship Coaching Social Media Marketing Market Research Public Speaking Marketing Microsoft Excel Consultative Sales Relationship Management Financial Reporting Teaching and Training Venture Financing Strategic Consulting Web Analytics Thought Leadership Social Networking Presentations SWOT analysis See 13+     See less Financial Analysis Accounting Leadership Strategy Management Project Management Cross-functional Team... Marketing Strategy Product Marketing Start-ups Entrepreneurship Coaching Social Media Marketing Market Research Public Speaking Marketing Microsoft Excel Consultative Sales Relationship Management Financial Reporting Teaching and Training Venture Financing Strategic Consulting Web Analytics Thought Leadership Social Networking Presentations SWOT analysis See 13+     See less Financial Analysis Accounting Leadership Strategy Management Project Management Cross-functional Team... Marketing Strategy Product Marketing Start-ups Entrepreneurship Coaching Social Media Marketing Market Research Public Speaking Marketing Microsoft Excel Consultative Sales Relationship Management Financial Reporting Teaching and Training Venture Financing Strategic Consulting Web Analytics Thought Leadership Social Networking Presentations SWOT analysis See 13+     See less Education Duke University - Fuqua School of Business Master of Business Administration (MBA) 2013  – 2015 London Business School Master of Business Administration (MBA),  International Exchange Programme 2014  – 2014 The University of Texas at Austin - The Red McCombs School of Business Master of Professional Accounting,  Financial Reporting and Assurance 2009 Brigham Young University Bachelor of Arts,  Comparative Literature , cum laude 2006 Duke University - Fuqua School of Business Master of Business Administration (MBA) 2013  – 2015 Duke University - Fuqua School of Business Master of Business Administration (MBA) 2013  – 2015 Duke University - Fuqua School of Business Master of Business Administration (MBA) 2013  – 2015 London Business School Master of Business Administration (MBA),  International Exchange Programme 2014  – 2014 London Business School Master of Business Administration (MBA),  International Exchange Programme 2014  – 2014 London Business School Master of Business Administration (MBA),  International Exchange Programme 2014  – 2014 The University of Texas at Austin - The Red McCombs School of Business Master of Professional Accounting,  Financial Reporting and Assurance 2009 The University of Texas at Austin - The Red McCombs School of Business Master of Professional Accounting,  Financial Reporting and Assurance 2009 The University of Texas at Austin - The Red McCombs School of Business Master of Professional Accounting,  Financial Reporting and Assurance 2009 Brigham Young University Bachelor of Arts,  Comparative Literature , cum laude 2006 Brigham Young University Bachelor of Arts,  Comparative Literature , cum laude 2006 Brigham Young University Bachelor of Arts,  Comparative Literature , cum laude 2006 Honors & Awards Additional Honors & Awards - AICPA John L. Carey Scholarship Award Winner, 2008-2009 \n- Outstanding Traditional MPA Student (Awarded by the 2009 Graduating Class) \n- Sommerfeld Scholar, McCombs School of Business \n- Dean's Award for Academic Excellence, Red McCombs School of Business Master in Professional Accounting Additional Honors & Awards - AICPA John L. Carey Scholarship Award Winner, 2008-2009 \n- Outstanding Traditional MPA Student (Awarded by the 2009 Graduating Class) \n- Sommerfeld Scholar, McCombs School of Business \n- Dean's Award for Academic Excellence, Red McCombs School of Business Master in Professional Accounting Additional Honors & Awards - AICPA John L. Carey Scholarship Award Winner, 2008-2009 \n- Outstanding Traditional MPA Student (Awarded by the 2009 Graduating Class) \n- Sommerfeld Scholar, McCombs School of Business \n- Dean's Award for Academic Excellence, Red McCombs School of Business Master in Professional Accounting Additional Honors & Awards - AICPA John L. Carey Scholarship Award Winner, 2008-2009 \n- Outstanding Traditional MPA Student (Awarded by the 2009 Graduating Class) \n- Sommerfeld Scholar, McCombs School of Business \n- Dean's Award for Academic Excellence, Red McCombs School of Business Master in Professional Accounting ", "Summary Looking to deliver compelling usages for business user, making things simpler and more efficient to use everyday... Summary Looking to deliver compelling usages for business user, making things simpler and more efficient to use everyday... Looking to deliver compelling usages for business user, making things simpler and more efficient to use everyday... Looking to deliver compelling usages for business user, making things simpler and more efficient to use everyday... Experience Mobile Security Segment Manager Intel Corporation April 2014  – Present (1 year 5 months) Software and Services Group Looking to foster new business relationships with mobile management and security ISVs to offer with Intel-based tablet and phone devices, bringing out the best overall solutions for enterprise customers looking to deploy these IA-based mobile devices. Work business agreements to help bring these new platform/product portfolios to market, while also developing key strategies with business groups to meet business goals. Solutions Marketing Manager Intel Corporation March 2010  –  March 2014  (4 years 1 month) Mobile Client Platforms Marketing for entertainment-related activities around media consumption, 3D, and innovative ways to interact with the PC to deliver an outstanding experience. Activities focus on utilizing the Ultrabook capabilities and overall making the PC more personal. Remote PC Assist Product Planner Intel Corporation June 2008  –  March 2010  (1 year 10 months) Intel Services Product and services marketing for services offered for MSPs & OEMs. Responsible for planning future services and capabilities with the Remote PC Assist Technology on Intel platforms. Product Marketing Manager Intel Corporation June 2007  –  June 2008  (1 year 1 month) Mobile Client Marketing Manage overall hardware SKU planning and marketing for 2009 graphics, storage, and other key components to the platform. Product Marketing Engineer Intel Corporation March 2004  –  June 2007  (3 years 4 months) Chipset & Graphics Marketing Provided product management for desktop chipset graphics software, delivering feature set requirements and setting business priorities for the product through various decision-making bodies. Gathered customer feature requirements and managed platform alignment. Drove key marketing messages while delivering platform ingredient training at Intel forums. Sr. Technical Consultant Intel Corporation January 2000  –  February 2004  (4 years 2 months) Intel Solution Services Built business relationships with external customers (primarily Fortune 100 companies) to provide architectural planning and strategies for Intel-based solutions to business problems. Managed a team of consultants responsible for delivering on a variety of projects. Developed contracts defining technical, strategic, and business objectives of projects, along with product requirement documents in support of overall project plans. As senior technical architect on large projects, was responsible for the execution of project deliverables. Systems Engineer Intel Corporation January 1993  –  December 1999  (7 years) Intel Information Technology Worked with product managers to define overall architecture, strategy and usage of current and future remote access products at Intel. Led worldwide deployment efforts for remote access products, and created training materials for use by supporting organizations. Worked with external vendors during unit testing cycles to ensure the products met customer requirements. Mobile Security Segment Manager Intel Corporation April 2014  – Present (1 year 5 months) Software and Services Group Looking to foster new business relationships with mobile management and security ISVs to offer with Intel-based tablet and phone devices, bringing out the best overall solutions for enterprise customers looking to deploy these IA-based mobile devices. Work business agreements to help bring these new platform/product portfolios to market, while also developing key strategies with business groups to meet business goals. Mobile Security Segment Manager Intel Corporation April 2014  – Present (1 year 5 months) Software and Services Group Looking to foster new business relationships with mobile management and security ISVs to offer with Intel-based tablet and phone devices, bringing out the best overall solutions for enterprise customers looking to deploy these IA-based mobile devices. Work business agreements to help bring these new platform/product portfolios to market, while also developing key strategies with business groups to meet business goals. Solutions Marketing Manager Intel Corporation March 2010  –  March 2014  (4 years 1 month) Mobile Client Platforms Marketing for entertainment-related activities around media consumption, 3D, and innovative ways to interact with the PC to deliver an outstanding experience. Activities focus on utilizing the Ultrabook capabilities and overall making the PC more personal. Solutions Marketing Manager Intel Corporation March 2010  –  March 2014  (4 years 1 month) Mobile Client Platforms Marketing for entertainment-related activities around media consumption, 3D, and innovative ways to interact with the PC to deliver an outstanding experience. Activities focus on utilizing the Ultrabook capabilities and overall making the PC more personal. Remote PC Assist Product Planner Intel Corporation June 2008  –  March 2010  (1 year 10 months) Intel Services Product and services marketing for services offered for MSPs & OEMs. Responsible for planning future services and capabilities with the Remote PC Assist Technology on Intel platforms. Remote PC Assist Product Planner Intel Corporation June 2008  –  March 2010  (1 year 10 months) Intel Services Product and services marketing for services offered for MSPs & OEMs. Responsible for planning future services and capabilities with the Remote PC Assist Technology on Intel platforms. Product Marketing Manager Intel Corporation June 2007  –  June 2008  (1 year 1 month) Mobile Client Marketing Manage overall hardware SKU planning and marketing for 2009 graphics, storage, and other key components to the platform. Product Marketing Manager Intel Corporation June 2007  –  June 2008  (1 year 1 month) Mobile Client Marketing Manage overall hardware SKU planning and marketing for 2009 graphics, storage, and other key components to the platform. Product Marketing Engineer Intel Corporation March 2004  –  June 2007  (3 years 4 months) Chipset & Graphics Marketing Provided product management for desktop chipset graphics software, delivering feature set requirements and setting business priorities for the product through various decision-making bodies. Gathered customer feature requirements and managed platform alignment. Drove key marketing messages while delivering platform ingredient training at Intel forums. Product Marketing Engineer Intel Corporation March 2004  –  June 2007  (3 years 4 months) Chipset & Graphics Marketing Provided product management for desktop chipset graphics software, delivering feature set requirements and setting business priorities for the product through various decision-making bodies. Gathered customer feature requirements and managed platform alignment. Drove key marketing messages while delivering platform ingredient training at Intel forums. Sr. Technical Consultant Intel Corporation January 2000  –  February 2004  (4 years 2 months) Intel Solution Services Built business relationships with external customers (primarily Fortune 100 companies) to provide architectural planning and strategies for Intel-based solutions to business problems. Managed a team of consultants responsible for delivering on a variety of projects. Developed contracts defining technical, strategic, and business objectives of projects, along with product requirement documents in support of overall project plans. As senior technical architect on large projects, was responsible for the execution of project deliverables. Sr. Technical Consultant Intel Corporation January 2000  –  February 2004  (4 years 2 months) Intel Solution Services Built business relationships with external customers (primarily Fortune 100 companies) to provide architectural planning and strategies for Intel-based solutions to business problems. Managed a team of consultants responsible for delivering on a variety of projects. Developed contracts defining technical, strategic, and business objectives of projects, along with product requirement documents in support of overall project plans. As senior technical architect on large projects, was responsible for the execution of project deliverables. Systems Engineer Intel Corporation January 1993  –  December 1999  (7 years) Intel Information Technology Worked with product managers to define overall architecture, strategy and usage of current and future remote access products at Intel. Led worldwide deployment efforts for remote access products, and created training materials for use by supporting organizations. Worked with external vendors during unit testing cycles to ensure the products met customer requirements. Systems Engineer Intel Corporation January 1993  –  December 1999  (7 years) Intel Information Technology Worked with product managers to define overall architecture, strategy and usage of current and future remote access products at Intel. Led worldwide deployment efforts for remote access products, and created training materials for use by supporting organizations. Worked with external vendors during unit testing cycles to ensure the products met customer requirements. Languages   Skills Product Management Product Marketing Go-to-market Strategy Mobile Devices Project Management Management Program Management Hardware Project Coordination Product Development Intel Storage Messaging Competitive Analysis Project Planning Cross-functional Team... See 1+     See less Skills  Product Management Product Marketing Go-to-market Strategy Mobile Devices Project Management Management Program Management Hardware Project Coordination Product Development Intel Storage Messaging Competitive Analysis Project Planning Cross-functional Team... See 1+     See less Product Management Product Marketing Go-to-market Strategy Mobile Devices Project Management Management Program Management Hardware Project Coordination Product Development Intel Storage Messaging Competitive Analysis Project Planning Cross-functional Team... See 1+     See less Product Management Product Marketing Go-to-market Strategy Mobile Devices Project Management Management Program Management Hardware Project Coordination Product Development Intel Storage Messaging Competitive Analysis Project Planning Cross-functional Team... See 1+     See less Education Arizona State University MBA,  Business Admin , Supply Chain 2005  – 2006 Purdue University EE,  Electrical Engineering 1988  – 1992 Activities and Societies:  Intramural sports Arizona State University MBA,  Business Admin , Supply Chain 2005  – 2006 Arizona State University MBA,  Business Admin , Supply Chain 2005  – 2006 Arizona State University MBA,  Business Admin , Supply Chain 2005  – 2006 Purdue University EE,  Electrical Engineering 1988  – 1992 Activities and Societies:  Intramural sports Purdue University EE,  Electrical Engineering 1988  – 1992 Activities and Societies:  Intramural sports Purdue University EE,  Electrical Engineering 1988  – 1992 Activities and Societies:  Intramural sports Honors & Awards ", "Skills Start-ups Semiconductors Product Marketing Marketing Strategy Product Development Product Management Cross-functional Team... Strategic Partnerships Sales Manufacturing Sales Operations Business Development Wireless Competitive Analysis International Sales Skills  Start-ups Semiconductors Product Marketing Marketing Strategy Product Development Product Management Cross-functional Team... Strategic Partnerships Sales Manufacturing Sales Operations Business Development Wireless Competitive Analysis International Sales Start-ups Semiconductors Product Marketing Marketing Strategy Product Development Product Management Cross-functional Team... Strategic Partnerships Sales Manufacturing Sales Operations Business Development Wireless Competitive Analysis International Sales Start-ups Semiconductors Product Marketing Marketing Strategy Product Development Product Management Cross-functional Team... Strategic Partnerships Sales Manufacturing Sales Operations Business Development Wireless Competitive Analysis International Sales ", "Summary 20 years experience in a variety of marketing and management roles, with focus on new businesses and innovation. Recent experience building and managing marketing and innovation teams in China and India, focused on new product opportunities in emerging markets. Experienced product line and business manager on hardware, software, and complete platform products in a variety of markets and channels, including retail branded, OEM, and reseller. Summary 20 years experience in a variety of marketing and management roles, with focus on new businesses and innovation. Recent experience building and managing marketing and innovation teams in China and India, focused on new product opportunities in emerging markets. Experienced product line and business manager on hardware, software, and complete platform products in a variety of markets and channels, including retail branded, OEM, and reseller. 20 years experience in a variety of marketing and management roles, with focus on new businesses and innovation. Recent experience building and managing marketing and innovation teams in China and India, focused on new product opportunities in emerging markets. Experienced product line and business manager on hardware, software, and complete platform products in a variety of markets and channels, including retail branded, OEM, and reseller. 20 years experience in a variety of marketing and management roles, with focus on new businesses and innovation. Recent experience building and managing marketing and innovation teams in China and India, focused on new product opportunities in emerging markets. Experienced product line and business manager on hardware, software, and complete platform products in a variety of markets and channels, including retail branded, OEM, and reseller. Experience Product Line Manager, Education Tablets Intel Corporation, Mobile Communications Group April 2012  –  April 2013  (1 year 1 month) Hillsboro, OR Technical Program Manager, Tablet Innovation Intel Corporation, Netbooks and Tablets Group September 2011  –  April 2012  (8 months) Hillsboro, OR Director, Ecosystem Enabling Intel Corporation January 2008  –  July 2009  (1 year 7 months) Shanghai City, China Based in Shanghai, directed a new classmate PC ecosystem enabling team, responsible for strategic definition, implementation and management of an education-focused alliance program for software and service companies, resulting in 150 member companies after six months. Director, Asia Platform Definition Center Intel Corporation September 2005  –  January 2008  (2 years 5 months) Managed teams in India and China responsible for early platform planning using a combination of ethnographic research, product ideation, market assessment, and architectural exploration. Marketing Director Intel Corporation February 2002  –  September 2005  (3 years 8 months) Managed a team of product and technical marketing responsible for researching, defining, and driving innovative products intended to grow the market for Intel products. Teams were based in the US and China, and resulted in products being brought to market by leading PC and consumer electronics company around the world. Business Segment Manager Intel Corporation October 1999  –  February 2002  (2 years 5 months) Managed Intel's branded PC camera product line and then business, as part of an organization looking for new business ventures for Intel to invest in. Product Line Manager, Education Tablets Intel Corporation, Mobile Communications Group April 2012  –  April 2013  (1 year 1 month) Hillsboro, OR Product Line Manager, Education Tablets Intel Corporation, Mobile Communications Group April 2012  –  April 2013  (1 year 1 month) Hillsboro, OR Technical Program Manager, Tablet Innovation Intel Corporation, Netbooks and Tablets Group September 2011  –  April 2012  (8 months) Hillsboro, OR Technical Program Manager, Tablet Innovation Intel Corporation, Netbooks and Tablets Group September 2011  –  April 2012  (8 months) Hillsboro, OR Director, Ecosystem Enabling Intel Corporation January 2008  –  July 2009  (1 year 7 months) Shanghai City, China Based in Shanghai, directed a new classmate PC ecosystem enabling team, responsible for strategic definition, implementation and management of an education-focused alliance program for software and service companies, resulting in 150 member companies after six months. Director, Ecosystem Enabling Intel Corporation January 2008  –  July 2009  (1 year 7 months) Shanghai City, China Based in Shanghai, directed a new classmate PC ecosystem enabling team, responsible for strategic definition, implementation and management of an education-focused alliance program for software and service companies, resulting in 150 member companies after six months. Director, Asia Platform Definition Center Intel Corporation September 2005  –  January 2008  (2 years 5 months) Managed teams in India and China responsible for early platform planning using a combination of ethnographic research, product ideation, market assessment, and architectural exploration. Director, Asia Platform Definition Center Intel Corporation September 2005  –  January 2008  (2 years 5 months) Managed teams in India and China responsible for early platform planning using a combination of ethnographic research, product ideation, market assessment, and architectural exploration. Marketing Director Intel Corporation February 2002  –  September 2005  (3 years 8 months) Managed a team of product and technical marketing responsible for researching, defining, and driving innovative products intended to grow the market for Intel products. Teams were based in the US and China, and resulted in products being brought to market by leading PC and consumer electronics company around the world. Marketing Director Intel Corporation February 2002  –  September 2005  (3 years 8 months) Managed a team of product and technical marketing responsible for researching, defining, and driving innovative products intended to grow the market for Intel products. Teams were based in the US and China, and resulted in products being brought to market by leading PC and consumer electronics company around the world. Business Segment Manager Intel Corporation October 1999  –  February 2002  (2 years 5 months) Managed Intel's branded PC camera product line and then business, as part of an organization looking for new business ventures for Intel to invest in. Business Segment Manager Intel Corporation October 1999  –  February 2002  (2 years 5 months) Managed Intel's branded PC camera product line and then business, as part of an organization looking for new business ventures for Intel to invest in. Languages Chinese Chinese Chinese Skills Program Management Start-ups Go-to-market Strategy Product Management Product Marketing Business Alliances Management Mobile Devices Cross-functional Team... Competitive Analysis Semiconductors Strategic Partnerships Strategic Planning Consumer Electronics Leadership Emerging Markets Line Management Enterprise Software Intel Product Planning Business Development Product Lifecycle... Project Management Product Launch Market Research Cloud Computing Strategy Marketing Business Strategy Global Business... See 15+     See less Skills  Program Management Start-ups Go-to-market Strategy Product Management Product Marketing Business Alliances Management Mobile Devices Cross-functional Team... Competitive Analysis Semiconductors Strategic Partnerships Strategic Planning Consumer Electronics Leadership Emerging Markets Line Management Enterprise Software Intel Product Planning Business Development Product Lifecycle... Project Management Product Launch Market Research Cloud Computing Strategy Marketing Business Strategy Global Business... See 15+     See less Program Management Start-ups Go-to-market Strategy Product Management Product Marketing Business Alliances Management Mobile Devices Cross-functional Team... Competitive Analysis Semiconductors Strategic Partnerships Strategic Planning Consumer Electronics Leadership Emerging Markets Line Management Enterprise Software Intel Product Planning Business Development Product Lifecycle... Project Management Product Launch Market Research Cloud Computing Strategy Marketing Business Strategy Global Business... See 15+     See less Program Management Start-ups Go-to-market Strategy Product Management Product Marketing Business Alliances Management Mobile Devices Cross-functional Team... Competitive Analysis Semiconductors Strategic Partnerships Strategic Planning Consumer Electronics Leadership Emerging Markets Line Management Enterprise Software Intel Product Planning Business Development Product Lifecycle... Project Management Product Launch Market Research Cloud Computing Strategy Marketing Business Strategy Global Business... See 15+     See less Education University of Oregon - Charles H. Lundquist College of Business MBA,  Business 1996  – 1998 Portland State University BS,  Electrical Engineering 1985  – 1988 University of Oregon - Charles H. Lundquist College of Business MBA,  Business 1996  – 1998 University of Oregon - Charles H. Lundquist College of Business MBA,  Business 1996  – 1998 University of Oregon - Charles H. Lundquist College of Business MBA,  Business 1996  – 1998 Portland State University BS,  Electrical Engineering 1985  – 1988 Portland State University BS,  Electrical Engineering 1985  – 1988 Portland State University BS,  Electrical Engineering 1985  – 1988 ", "Summary Demonstrated leadership in multiple functional and general management roles. Experience leading through start-up, turn-around, growth and sustaining business environments. Thrives in complex and dynamic situations where breadth of experience and knowledge together with pragmatic tenacity achieves high impact results. Broad experience across manufacturing, engineering, product development, IT, software and services, marketing, HR and operations management.  Summary Demonstrated leadership in multiple functional and general management roles. Experience leading through start-up, turn-around, growth and sustaining business environments. Thrives in complex and dynamic situations where breadth of experience and knowledge together with pragmatic tenacity achieves high impact results. Broad experience across manufacturing, engineering, product development, IT, software and services, marketing, HR and operations management.  Demonstrated leadership in multiple functional and general management roles. Experience leading through start-up, turn-around, growth and sustaining business environments. Thrives in complex and dynamic situations where breadth of experience and knowledge together with pragmatic tenacity achieves high impact results. Broad experience across manufacturing, engineering, product development, IT, software and services, marketing, HR and operations management.  Demonstrated leadership in multiple functional and general management roles. Experience leading through start-up, turn-around, growth and sustaining business environments. Thrives in complex and dynamic situations where breadth of experience and knowledge together with pragmatic tenacity achieves high impact results. Broad experience across manufacturing, engineering, product development, IT, software and services, marketing, HR and operations management.  Experience IoT Strategic Segment Manager Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Internet of Things Segment Manager bringing end-to-end remote monitoring solutions to market. Director HR Strategy Office Intel Corporation December 2014  –  May 2015  (6 months) Portland, Oregon Area Manage strategic priorities across the spectrum of talent, capabilities and leadership. Ensuring HR strategies are aligned and connected to corporate strategy. Driving cross-enterprise strategic execution, connections and insights. Director of Executive and Accelerated Development Programs Intel Corporation August 2012  –  December 2014  (2 years 5 months) San Francisco Bay Area Manage Executive Leadership Development program team to accelerate the development and advancement of senior leaders and executives across Intel Corporation. Scope includes high potential/high performing general management, functional managers and corporate leaders. This includes being the Director of the Accelerated Leadership Program (ALP), Intel's premier MBA leadership development and executive pipeline program. Strategist, Executive Office Intel Corporation December 2013  –  June 2014  (7 months) Santa Clara, CA On assignment to develop aspects of Intel's corporate strategy on behalf of and in frequent consultation with both the CEO & President of Intel. Analyzed and recommended platform growth strategies across all computing segments. Market dynamics, competitive analysis, financial modeling and risk analysis. Global Operations Manager, Software and Services Group Intel March 2010  –  August 2012  (2 years 6 months) Portland, Oregon Area Manage all aspects of SSG’s worldwide core operational activities including: All aspects of business operations; operational excellence, continuous improvement and quality controls; worldwide sites management in over 30 countries; manage centralized risk & controls, information security, and business continuity policies and procedures. Innovation and Concept Planner Intel Corporation December 2009  –  March 2010  (4 months) Formalizing innovation processes for advanced concept development. Defining business models to enable innovative platform and system solutions built on Intel silicon. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Intel Health Product Marketing Intel Corporation March 2009  –  December 2009  (10 months) Intel Health Guide provides remote patient monitoring and chronic disease management solutions. My focus while in Intel Health was the definition of the Intel Health Guide user community strategy and supporting the value added reseller enablement processes to accelerate product acceptance in telehealth markets.  \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Supply Chain Solution Manager Intel Corporation August 2008  –  March 2009  (8 months) A member of the Customer Planning and Logistics Group this assignment reported to the Director of Supply Planning Operations with a focus on supply chain reengineering and program management structures and governance. Responsible for definition and communication of organizational roles and responsibilities, development of project priorities and portfolio management strategies and the formation of operational forums to enable ongoing management of resource allocations. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Business Manager Intel Corporation January 2008  –  August 2008  (8 months) Innovation Centre at Intel Ireland. Focused on systemic innovation processes, business value of IT systems and Green IT services. Contributed to the basic research and framework definition for the Innovation Value Institute. Refined framework for systemic innovation capabilities and assisted in the launch of the Innovation Advocates Network within Intel. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Human Resource Manager Intel Corporation July 2007  –  January 2008  (7 months) Selected as one of the first members of the Accelerated Leadership Program, Intel’s executive development program. Developed systems and structures to support long term success of the program. Ongoing responsibilities to act as a peer mentor for new employees. Recruited the first class of MBA graduates from top tier business schools. Graduate Intern Harley-Davidson Motor Company June 2006  –  December 2006  (7 months) Focused on determining the business value of manufacturing flexibility through analysis of enterprise, manufacturing network and individual plants. Modeling and simulation of heavy weight motorcycle demand and Harley-Davidson's manufacturing capability led to recommendations for maximizing demand fulfillment and capacity utilization. Staff Engineer Intel Corporation January 2003  –  June 2005  (2 years 6 months) - Led and maintained strategic roadmap for 300mm automated semiconductor manufacturing \n- Led operational resources on team developing fully automated semiconductor manufacturing systems \n- Designed and managed the implemenation of the remote operations center that monitors and controls the automated factory \n- Responsible for specification, validation and implementation of human supervisory control systems, structures and policies Manufacturing Supervisor Intel January 2001  –  January 2003  (2 years 1 month) 300mm factory startup and ramp, diffusion and implant functional area supervisor, factory operation manager, ICS operations officer Equipment Engineer Intel Corporation January 2000  –  January 2001  (1 year 1 month) Lithography equipment, precision servo control, process improvement Automation Engineer Intel Corporation June 1997  –  January 2000  (2 years 8 months) Automated material handling system, project management, vendor management IoT Strategic Segment Manager Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Internet of Things Segment Manager bringing end-to-end remote monitoring solutions to market. IoT Strategic Segment Manager Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Internet of Things Segment Manager bringing end-to-end remote monitoring solutions to market. Director HR Strategy Office Intel Corporation December 2014  –  May 2015  (6 months) Portland, Oregon Area Manage strategic priorities across the spectrum of talent, capabilities and leadership. Ensuring HR strategies are aligned and connected to corporate strategy. Driving cross-enterprise strategic execution, connections and insights. Director HR Strategy Office Intel Corporation December 2014  –  May 2015  (6 months) Portland, Oregon Area Manage strategic priorities across the spectrum of talent, capabilities and leadership. Ensuring HR strategies are aligned and connected to corporate strategy. Driving cross-enterprise strategic execution, connections and insights. Director of Executive and Accelerated Development Programs Intel Corporation August 2012  –  December 2014  (2 years 5 months) San Francisco Bay Area Manage Executive Leadership Development program team to accelerate the development and advancement of senior leaders and executives across Intel Corporation. Scope includes high potential/high performing general management, functional managers and corporate leaders. This includes being the Director of the Accelerated Leadership Program (ALP), Intel's premier MBA leadership development and executive pipeline program. Director of Executive and Accelerated Development Programs Intel Corporation August 2012  –  December 2014  (2 years 5 months) San Francisco Bay Area Manage Executive Leadership Development program team to accelerate the development and advancement of senior leaders and executives across Intel Corporation. Scope includes high potential/high performing general management, functional managers and corporate leaders. This includes being the Director of the Accelerated Leadership Program (ALP), Intel's premier MBA leadership development and executive pipeline program. Strategist, Executive Office Intel Corporation December 2013  –  June 2014  (7 months) Santa Clara, CA On assignment to develop aspects of Intel's corporate strategy on behalf of and in frequent consultation with both the CEO & President of Intel. Analyzed and recommended platform growth strategies across all computing segments. Market dynamics, competitive analysis, financial modeling and risk analysis. Strategist, Executive Office Intel Corporation December 2013  –  June 2014  (7 months) Santa Clara, CA On assignment to develop aspects of Intel's corporate strategy on behalf of and in frequent consultation with both the CEO & President of Intel. Analyzed and recommended platform growth strategies across all computing segments. Market dynamics, competitive analysis, financial modeling and risk analysis. Global Operations Manager, Software and Services Group Intel March 2010  –  August 2012  (2 years 6 months) Portland, Oregon Area Manage all aspects of SSG’s worldwide core operational activities including: All aspects of business operations; operational excellence, continuous improvement and quality controls; worldwide sites management in over 30 countries; manage centralized risk & controls, information security, and business continuity policies and procedures. Global Operations Manager, Software and Services Group Intel March 2010  –  August 2012  (2 years 6 months) Portland, Oregon Area Manage all aspects of SSG’s worldwide core operational activities including: All aspects of business operations; operational excellence, continuous improvement and quality controls; worldwide sites management in over 30 countries; manage centralized risk & controls, information security, and business continuity policies and procedures. Innovation and Concept Planner Intel Corporation December 2009  –  March 2010  (4 months) Formalizing innovation processes for advanced concept development. Defining business models to enable innovative platform and system solutions built on Intel silicon. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Innovation and Concept Planner Intel Corporation December 2009  –  March 2010  (4 months) Formalizing innovation processes for advanced concept development. Defining business models to enable innovative platform and system solutions built on Intel silicon. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Intel Health Product Marketing Intel Corporation March 2009  –  December 2009  (10 months) Intel Health Guide provides remote patient monitoring and chronic disease management solutions. My focus while in Intel Health was the definition of the Intel Health Guide user community strategy and supporting the value added reseller enablement processes to accelerate product acceptance in telehealth markets.  \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Intel Health Product Marketing Intel Corporation March 2009  –  December 2009  (10 months) Intel Health Guide provides remote patient monitoring and chronic disease management solutions. My focus while in Intel Health was the definition of the Intel Health Guide user community strategy and supporting the value added reseller enablement processes to accelerate product acceptance in telehealth markets.  \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Supply Chain Solution Manager Intel Corporation August 2008  –  March 2009  (8 months) A member of the Customer Planning and Logistics Group this assignment reported to the Director of Supply Planning Operations with a focus on supply chain reengineering and program management structures and governance. Responsible for definition and communication of organizational roles and responsibilities, development of project priorities and portfolio management strategies and the formation of operational forums to enable ongoing management of resource allocations. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Supply Chain Solution Manager Intel Corporation August 2008  –  March 2009  (8 months) A member of the Customer Planning and Logistics Group this assignment reported to the Director of Supply Planning Operations with a focus on supply chain reengineering and program management structures and governance. Responsible for definition and communication of organizational roles and responsibilities, development of project priorities and portfolio management strategies and the formation of operational forums to enable ongoing management of resource allocations. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Business Manager Intel Corporation January 2008  –  August 2008  (8 months) Innovation Centre at Intel Ireland. Focused on systemic innovation processes, business value of IT systems and Green IT services. Contributed to the basic research and framework definition for the Innovation Value Institute. Refined framework for systemic innovation capabilities and assisted in the launch of the Innovation Advocates Network within Intel. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Business Manager Intel Corporation January 2008  –  August 2008  (8 months) Innovation Centre at Intel Ireland. Focused on systemic innovation processes, business value of IT systems and Green IT services. Contributed to the basic research and framework definition for the Innovation Value Institute. Refined framework for systemic innovation capabilities and assisted in the launch of the Innovation Advocates Network within Intel. \n \nThis role was part of my rotational Accelerated Leadership Program, an executive development program with assignments in product management, manufacturing and business support organizations. Human Resource Manager Intel Corporation July 2007  –  January 2008  (7 months) Selected as one of the first members of the Accelerated Leadership Program, Intel’s executive development program. Developed systems and structures to support long term success of the program. Ongoing responsibilities to act as a peer mentor for new employees. Recruited the first class of MBA graduates from top tier business schools. Human Resource Manager Intel Corporation July 2007  –  January 2008  (7 months) Selected as one of the first members of the Accelerated Leadership Program, Intel’s executive development program. Developed systems and structures to support long term success of the program. Ongoing responsibilities to act as a peer mentor for new employees. Recruited the first class of MBA graduates from top tier business schools. Graduate Intern Harley-Davidson Motor Company June 2006  –  December 2006  (7 months) Focused on determining the business value of manufacturing flexibility through analysis of enterprise, manufacturing network and individual plants. Modeling and simulation of heavy weight motorcycle demand and Harley-Davidson's manufacturing capability led to recommendations for maximizing demand fulfillment and capacity utilization. Graduate Intern Harley-Davidson Motor Company June 2006  –  December 2006  (7 months) Focused on determining the business value of manufacturing flexibility through analysis of enterprise, manufacturing network and individual plants. Modeling and simulation of heavy weight motorcycle demand and Harley-Davidson's manufacturing capability led to recommendations for maximizing demand fulfillment and capacity utilization. Staff Engineer Intel Corporation January 2003  –  June 2005  (2 years 6 months) - Led and maintained strategic roadmap for 300mm automated semiconductor manufacturing \n- Led operational resources on team developing fully automated semiconductor manufacturing systems \n- Designed and managed the implemenation of the remote operations center that monitors and controls the automated factory \n- Responsible for specification, validation and implementation of human supervisory control systems, structures and policies Staff Engineer Intel Corporation January 2003  –  June 2005  (2 years 6 months) - Led and maintained strategic roadmap for 300mm automated semiconductor manufacturing \n- Led operational resources on team developing fully automated semiconductor manufacturing systems \n- Designed and managed the implemenation of the remote operations center that monitors and controls the automated factory \n- Responsible for specification, validation and implementation of human supervisory control systems, structures and policies Manufacturing Supervisor Intel January 2001  –  January 2003  (2 years 1 month) 300mm factory startup and ramp, diffusion and implant functional area supervisor, factory operation manager, ICS operations officer Manufacturing Supervisor Intel January 2001  –  January 2003  (2 years 1 month) 300mm factory startup and ramp, diffusion and implant functional area supervisor, factory operation manager, ICS operations officer Equipment Engineer Intel Corporation January 2000  –  January 2001  (1 year 1 month) Lithography equipment, precision servo control, process improvement Equipment Engineer Intel Corporation January 2000  –  January 2001  (1 year 1 month) Lithography equipment, precision servo control, process improvement Automation Engineer Intel Corporation June 1997  –  January 2000  (2 years 8 months) Automated material handling system, project management, vendor management Automation Engineer Intel Corporation June 1997  –  January 2000  (2 years 8 months) Automated material handling system, project management, vendor management Skills Manufacturing Operations Operations Management Lean Manufacturing Strategic Planning Business Strategy Operational Excellence Innovation Management Problem Solving Program Management Process Improvement Systems Engineering Cross-functional Team... Leadership Development Organizational Design Start-ups Continuous Improvement IT Management Product Management Manufacturing IT Strategy Business Operations Management See 7+     See less Skills  Manufacturing Operations Operations Management Lean Manufacturing Strategic Planning Business Strategy Operational Excellence Innovation Management Problem Solving Program Management Process Improvement Systems Engineering Cross-functional Team... Leadership Development Organizational Design Start-ups Continuous Improvement IT Management Product Management Manufacturing IT Strategy Business Operations Management See 7+     See less Manufacturing Operations Operations Management Lean Manufacturing Strategic Planning Business Strategy Operational Excellence Innovation Management Problem Solving Program Management Process Improvement Systems Engineering Cross-functional Team... Leadership Development Organizational Design Start-ups Continuous Improvement IT Management Product Management Manufacturing IT Strategy Business Operations Management See 7+     See less Manufacturing Operations Operations Management Lean Manufacturing Strategic Planning Business Strategy Operational Excellence Innovation Management Problem Solving Program Management Process Improvement Systems Engineering Cross-functional Team... Leadership Development Organizational Design Start-ups Continuous Improvement IT Management Product Management Manufacturing IT Strategy Business Operations Management See 7+     See less Education Massachusetts Institute of Technology SM,  Engineering Systems 2005  – 2007 Massachusetts Institute of Technology - Sloan School of Management Master of Science (MS),  Business Administration and Management , General 2005  – 2007 Activities and Societies:  Leaders for Global Operations Fellow (formerly Leaders for Manufacturing) University of Washington MS,  Electrical Engineering 1995  – 1997 The University of New Mexico BS,  Electrical Engineering 1991  – 1995 The School of the Art Institute of Chicago NA,  Fine Art ,  Sculpture 1989  – 1991 Massachusetts Institute of Technology SM,  Engineering Systems 2005  – 2007 Massachusetts Institute of Technology SM,  Engineering Systems 2005  – 2007 Massachusetts Institute of Technology SM,  Engineering Systems 2005  – 2007 Massachusetts Institute of Technology - Sloan School of Management Master of Science (MS),  Business Administration and Management , General 2005  – 2007 Activities and Societies:  Leaders for Global Operations Fellow (formerly Leaders for Manufacturing) Massachusetts Institute of Technology - Sloan School of Management Master of Science (MS),  Business Administration and Management , General 2005  – 2007 Activities and Societies:  Leaders for Global Operations Fellow (formerly Leaders for Manufacturing) Massachusetts Institute of Technology - Sloan School of Management Master of Science (MS),  Business Administration and Management , General 2005  – 2007 Activities and Societies:  Leaders for Global Operations Fellow (formerly Leaders for Manufacturing) University of Washington MS,  Electrical Engineering 1995  – 1997 University of Washington MS,  Electrical Engineering 1995  – 1997 University of Washington MS,  Electrical Engineering 1995  – 1997 The University of New Mexico BS,  Electrical Engineering 1991  – 1995 The University of New Mexico BS,  Electrical Engineering 1991  – 1995 The University of New Mexico BS,  Electrical Engineering 1991  – 1995 The School of the Art Institute of Chicago NA,  Fine Art ,  Sculpture 1989  – 1991 The School of the Art Institute of Chicago NA,  Fine Art ,  Sculpture 1989  – 1991 The School of the Art Institute of Chicago NA,  Fine Art ,  Sculpture 1989  – 1991 ", "Summary Senior marketing and communication professional with over 20 years experience in marketing automation, digital marketing, program management, retail marketing, campaigns, training and advertising. Summary Senior marketing and communication professional with over 20 years experience in marketing automation, digital marketing, program management, retail marketing, campaigns, training and advertising. Senior marketing and communication professional with over 20 years experience in marketing automation, digital marketing, program management, retail marketing, campaigns, training and advertising. Senior marketing and communication professional with over 20 years experience in marketing automation, digital marketing, program management, retail marketing, campaigns, training and advertising. Experience APJ Lead - Global Demand Center Intel Corporation February 2015  – Present (7 months) Bengaluru Area, India As part of Intel’s Customer Experience organization (Global Demand Center team), My role is to focus on modernizing the customer experience as they engage through the pipeline of activities from Event / lead gen through content and information delivery to Product, Service, and Support delivery. APJ Head - Channel Digital Engagement & Partner Program Marketing Intel Corporation January 2011  –  February 2015  (4 years 2 months) Bangalore I owned Channel Digital Engagement for APJ Region. I am responsible for launching and running online go-to-market campaigns which bring partners/resellers together on one common platform to drive sales and facilitate collaboration. I am also responsible for evangelizing the adoption of marketing automation in my focus geography and and am now helping drive the global adoption of the platform across the company. Till recently I was also running the APJ Retail Sales Person Advocacy engine which had elements such as social media, rewards programs and training curriculum development. Consumer Segment Manager Intel Corporation January 2004  –  December 2010  (7 years) Bengaluru Area, India As Program Manager Consumer & Gaming APAC region of Intel Corporation I was responsible for evangelising and driving intel technology adoption by consumer ISV and game studio ecosystem in APAC. I also was instrumental in setting up the program manager practise for the team and was responsible for planning ISV readiness for Consumer Segment in APAC. I collaborated with marketing to device go to market strategies with key ISV partners such as CyberLink, Corel, Adobe, Hungama and game studios such as NCSoft Marketing Program Manager Intel Corporation October 2001  –  December 2003  (2 years 3 months) I drove marketing and ecosystem program's for the APAC Alliances Team, working with OEM and ISV alliance partners such as Microsoft, Oracle, BEA, Lenovo, IBM, Langchao, NIIT Business Manager ICMG January 2000  –  October 2001  (1 year 10 months) Bengaluru Area, India I was Product Manager for Component Education Server and was responsible for conceptualizing the product and then taking the product to the market building the pipeline of customers for the product Web Analyst Vsplash.com January 1999  –  January 2000  (1 year 1 month) Hyderabad Area, India Led a team of Imagineers to create a flash based online website/portal creation service, focused on the travel, SMB and professional segments. Also drove dealer recruitment across india and helped setup the operations in Bangalore Project Leader Kirloskar Computer Services 1997  –  1998  (1 year) Project Managed a team of multimedia experts to create CBT's and multimedia marketing material for key customers such as Biocon, Briggs & Stratton, Britannia GM Operations Communico Graphique 1995  –  1997  (2 years) Bengaluru Area, India I was a key member of the team driving business development, client service and visualisation in multimedia, advertising, online marketing, retail activation, event management APJ Lead - Global Demand Center Intel Corporation February 2015  – Present (7 months) Bengaluru Area, India As part of Intel’s Customer Experience organization (Global Demand Center team), My role is to focus on modernizing the customer experience as they engage through the pipeline of activities from Event / lead gen through content and information delivery to Product, Service, and Support delivery. APJ Lead - Global Demand Center Intel Corporation February 2015  – Present (7 months) Bengaluru Area, India As part of Intel’s Customer Experience organization (Global Demand Center team), My role is to focus on modernizing the customer experience as they engage through the pipeline of activities from Event / lead gen through content and information delivery to Product, Service, and Support delivery. APJ Head - Channel Digital Engagement & Partner Program Marketing Intel Corporation January 2011  –  February 2015  (4 years 2 months) Bangalore I owned Channel Digital Engagement for APJ Region. I am responsible for launching and running online go-to-market campaigns which bring partners/resellers together on one common platform to drive sales and facilitate collaboration. I am also responsible for evangelizing the adoption of marketing automation in my focus geography and and am now helping drive the global adoption of the platform across the company. Till recently I was also running the APJ Retail Sales Person Advocacy engine which had elements such as social media, rewards programs and training curriculum development. APJ Head - Channel Digital Engagement & Partner Program Marketing Intel Corporation January 2011  –  February 2015  (4 years 2 months) Bangalore I owned Channel Digital Engagement for APJ Region. I am responsible for launching and running online go-to-market campaigns which bring partners/resellers together on one common platform to drive sales and facilitate collaboration. I am also responsible for evangelizing the adoption of marketing automation in my focus geography and and am now helping drive the global adoption of the platform across the company. Till recently I was also running the APJ Retail Sales Person Advocacy engine which had elements such as social media, rewards programs and training curriculum development. Consumer Segment Manager Intel Corporation January 2004  –  December 2010  (7 years) Bengaluru Area, India As Program Manager Consumer & Gaming APAC region of Intel Corporation I was responsible for evangelising and driving intel technology adoption by consumer ISV and game studio ecosystem in APAC. I also was instrumental in setting up the program manager practise for the team and was responsible for planning ISV readiness for Consumer Segment in APAC. I collaborated with marketing to device go to market strategies with key ISV partners such as CyberLink, Corel, Adobe, Hungama and game studios such as NCSoft Consumer Segment Manager Intel Corporation January 2004  –  December 2010  (7 years) Bengaluru Area, India As Program Manager Consumer & Gaming APAC region of Intel Corporation I was responsible for evangelising and driving intel technology adoption by consumer ISV and game studio ecosystem in APAC. I also was instrumental in setting up the program manager practise for the team and was responsible for planning ISV readiness for Consumer Segment in APAC. I collaborated with marketing to device go to market strategies with key ISV partners such as CyberLink, Corel, Adobe, Hungama and game studios such as NCSoft Marketing Program Manager Intel Corporation October 2001  –  December 2003  (2 years 3 months) I drove marketing and ecosystem program's for the APAC Alliances Team, working with OEM and ISV alliance partners such as Microsoft, Oracle, BEA, Lenovo, IBM, Langchao, NIIT Marketing Program Manager Intel Corporation October 2001  –  December 2003  (2 years 3 months) I drove marketing and ecosystem program's for the APAC Alliances Team, working with OEM and ISV alliance partners such as Microsoft, Oracle, BEA, Lenovo, IBM, Langchao, NIIT Business Manager ICMG January 2000  –  October 2001  (1 year 10 months) Bengaluru Area, India I was Product Manager for Component Education Server and was responsible for conceptualizing the product and then taking the product to the market building the pipeline of customers for the product Business Manager ICMG January 2000  –  October 2001  (1 year 10 months) Bengaluru Area, India I was Product Manager for Component Education Server and was responsible for conceptualizing the product and then taking the product to the market building the pipeline of customers for the product Web Analyst Vsplash.com January 1999  –  January 2000  (1 year 1 month) Hyderabad Area, India Led a team of Imagineers to create a flash based online website/portal creation service, focused on the travel, SMB and professional segments. Also drove dealer recruitment across india and helped setup the operations in Bangalore Web Analyst Vsplash.com January 1999  –  January 2000  (1 year 1 month) Hyderabad Area, India Led a team of Imagineers to create a flash based online website/portal creation service, focused on the travel, SMB and professional segments. Also drove dealer recruitment across india and helped setup the operations in Bangalore Project Leader Kirloskar Computer Services 1997  –  1998  (1 year) Project Managed a team of multimedia experts to create CBT's and multimedia marketing material for key customers such as Biocon, Briggs & Stratton, Britannia Project Leader Kirloskar Computer Services 1997  –  1998  (1 year) Project Managed a team of multimedia experts to create CBT's and multimedia marketing material for key customers such as Biocon, Briggs & Stratton, Britannia GM Operations Communico Graphique 1995  –  1997  (2 years) Bengaluru Area, India I was a key member of the team driving business development, client service and visualisation in multimedia, advertising, online marketing, retail activation, event management GM Operations Communico Graphique 1995  –  1997  (2 years) Bengaluru Area, India I was a key member of the team driving business development, client service and visualisation in multimedia, advertising, online marketing, retail activation, event management Languages English, Hindi, Kannada Native or bilingual proficiency English, Hindi, Kannada Native or bilingual proficiency English, Hindi, Kannada Native or bilingual proficiency Native or bilingual proficiency Skills Program Management Strategic Alliances Product Marketing Go-to-market Strategy Multi-channel Marketing Demand Generation Digital Marketing Marketing Communications Lead Generation Solution Selling Online Marketing Social Media Marketing E-commerce Integrated Marketing Product Development Channel Partners Mobile Devices Business Alliances Channel Project Planning Marketing Marketing Strategy Advertising Strategic Partnerships Marketing Management Competitive Analysis Product Management Strategy Leadership Cross-functional Team... Product Launch Partner Management Business Development Start-ups Segmentation CRM Sales Enablement Management Business Strategy Sales Team Management New Business Development See 27+     See less Skills  Program Management Strategic Alliances Product Marketing Go-to-market Strategy Multi-channel Marketing Demand Generation Digital Marketing Marketing Communications Lead Generation Solution Selling Online Marketing Social Media Marketing E-commerce Integrated Marketing Product Development Channel Partners Mobile Devices Business Alliances Channel Project Planning Marketing Marketing Strategy Advertising Strategic Partnerships Marketing Management Competitive Analysis Product Management Strategy Leadership Cross-functional Team... Product Launch Partner Management Business Development Start-ups Segmentation CRM Sales Enablement Management Business Strategy Sales Team Management New Business Development See 27+     See less Program Management Strategic Alliances Product Marketing Go-to-market Strategy Multi-channel Marketing Demand Generation Digital Marketing Marketing Communications Lead Generation Solution Selling Online Marketing Social Media Marketing E-commerce Integrated Marketing Product Development Channel Partners Mobile Devices Business Alliances Channel Project Planning Marketing Marketing Strategy Advertising Strategic Partnerships Marketing Management Competitive Analysis Product Management Strategy Leadership Cross-functional Team... Product Launch Partner Management Business Development Start-ups Segmentation CRM Sales Enablement Management Business Strategy Sales Team Management New Business Development See 27+     See less Program Management Strategic Alliances Product Marketing Go-to-market Strategy Multi-channel Marketing Demand Generation Digital Marketing Marketing Communications Lead Generation Solution Selling Online Marketing Social Media Marketing E-commerce Integrated Marketing Product Development Channel Partners Mobile Devices Business Alliances Channel Project Planning Marketing Marketing Strategy Advertising Strategic Partnerships Marketing Management Competitive Analysis Product Management Strategy Leadership Cross-functional Team... Product Launch Partner Management Business Development Start-ups Segmentation CRM Sales Enablement Management Business Strategy Sales Team Management New Business Development See 27+     See less Education Bharatiya Vidya Bhavan, Mumbai Post Graduate Diploma in Marketing & Sales management,  Marketing ,  Advertising ,  Marketing Research 1995  – 1996 Gold Medal in Marketing Research Activities and Societies:  Gold Medal in Marketing Research Delhi University BA (Honours),  English 1991  – 1994 Writing Poetry, Singing Activities and Societies:  English Literature Club Manav Sthali School Manav Sthali School Activities and Societies:  Singing ,  Elocution ,  Drawing Bharatiya Vidya Bhavan, Mumbai Post Graduate Diploma in Marketing & Sales management,  Marketing ,  Advertising ,  Marketing Research 1995  – 1996 Gold Medal in Marketing Research Activities and Societies:  Gold Medal in Marketing Research Bharatiya Vidya Bhavan, Mumbai Post Graduate Diploma in Marketing & Sales management,  Marketing ,  Advertising ,  Marketing Research 1995  – 1996 Gold Medal in Marketing Research Activities and Societies:  Gold Medal in Marketing Research Bharatiya Vidya Bhavan, Mumbai Post Graduate Diploma in Marketing & Sales management,  Marketing ,  Advertising ,  Marketing Research 1995  – 1996 Gold Medal in Marketing Research Activities and Societies:  Gold Medal in Marketing Research Delhi University BA (Honours),  English 1991  – 1994 Writing Poetry, Singing Activities and Societies:  English Literature Club Delhi University BA (Honours),  English 1991  – 1994 Writing Poetry, Singing Activities and Societies:  English Literature Club Delhi University BA (Honours),  English 1991  – 1994 Writing Poetry, Singing Activities and Societies:  English Literature Club Manav Sthali School Manav Sthali School Manav Sthali School Manav Sthali School Activities and Societies:  Singing ,  Elocution ,  Drawing Manav Sthali School Activities and Societies:  Singing ,  Elocution ,  Drawing Manav Sthali School Activities and Societies:  Singing ,  Elocution ,  Drawing Honors & Awards Division Recognition Award GM APJ, Intel Corporation August 2014 For the successful roll out of a joint online reseller campaign between Intel and Microsoft APJ GM's Award APJ GM, Intel Corporation February 2014 For rolling out a successful competitive response Retail campaign in APJ Consumer Channel Innovation Finalist 2011 Worldwide VP and Director, Consumer Channels Group February 2012 For launching and running a unique RSP Training & Certification Program across APJ Markie Awards 2013 Finalist - Best integration of Marketing and Sales Oracle Corporation October 2013 For implementing the best example of integrating marketing and sales in an online campaign leveraging Eloqua marketing automation platform Division Recognition Award VP Sales Enablement Group & Director Customer Experience Group July 2015 For the successful roll out of CX Roadshow targetted at B2B marketers in Asia Pacific & Japan Division Recognition Award GM APJ, Intel Corporation August 2014 For the successful roll out of a joint online reseller campaign between Intel and Microsoft Division Recognition Award GM APJ, Intel Corporation August 2014 For the successful roll out of a joint online reseller campaign between Intel and Microsoft Division Recognition Award GM APJ, Intel Corporation August 2014 For the successful roll out of a joint online reseller campaign between Intel and Microsoft APJ GM's Award APJ GM, Intel Corporation February 2014 For rolling out a successful competitive response Retail campaign in APJ APJ GM's Award APJ GM, Intel Corporation February 2014 For rolling out a successful competitive response Retail campaign in APJ APJ GM's Award APJ GM, Intel Corporation February 2014 For rolling out a successful competitive response Retail campaign in APJ Consumer Channel Innovation Finalist 2011 Worldwide VP and Director, Consumer Channels Group February 2012 For launching and running a unique RSP Training & Certification Program across APJ Consumer Channel Innovation Finalist 2011 Worldwide VP and Director, Consumer Channels Group February 2012 For launching and running a unique RSP Training & Certification Program across APJ Consumer Channel Innovation Finalist 2011 Worldwide VP and Director, Consumer Channels Group February 2012 For launching and running a unique RSP Training & Certification Program across APJ Markie Awards 2013 Finalist - Best integration of Marketing and Sales Oracle Corporation October 2013 For implementing the best example of integrating marketing and sales in an online campaign leveraging Eloqua marketing automation platform Markie Awards 2013 Finalist - Best integration of Marketing and Sales Oracle Corporation October 2013 For implementing the best example of integrating marketing and sales in an online campaign leveraging Eloqua marketing automation platform Markie Awards 2013 Finalist - Best integration of Marketing and Sales Oracle Corporation October 2013 For implementing the best example of integrating marketing and sales in an online campaign leveraging Eloqua marketing automation platform Division Recognition Award VP Sales Enablement Group & Director Customer Experience Group July 2015 For the successful roll out of CX Roadshow targetted at B2B marketers in Asia Pacific & Japan Division Recognition Award VP Sales Enablement Group & Director Customer Experience Group July 2015 For the successful roll out of CX Roadshow targetted at B2B marketers in Asia Pacific & Japan Division Recognition Award VP Sales Enablement Group & Director Customer Experience Group July 2015 For the successful roll out of CX Roadshow targetted at B2B marketers in Asia Pacific & Japan ", "Skills Go-to-market Strategy Competitive Analysis Business Development Product Management Product Marketing Embedded Systems Ethernet Marketing Strategy Cloud Computing Segmentation New Business Development Network Security Networking Strategic Thinking Enterprise Architecture Virtualization Virtual Appliances Telecommunications Network Appliance SDN NFV Cloud Security Solution Focused Wireless SaaS Strategic Partnerships Start-ups Product Development Strategy Distributed Systems Embedded Software Intel Program Management Cross-functional Team... Channel Partners Enterprise Software See 21+     See less Skills  Go-to-market Strategy Competitive Analysis Business Development Product Management Product Marketing Embedded Systems Ethernet Marketing Strategy Cloud Computing Segmentation New Business Development Network Security Networking Strategic Thinking Enterprise Architecture Virtualization Virtual Appliances Telecommunications Network Appliance SDN NFV Cloud Security Solution Focused Wireless SaaS Strategic Partnerships Start-ups Product Development Strategy Distributed Systems Embedded Software Intel Program Management Cross-functional Team... Channel Partners Enterprise Software See 21+     See less Go-to-market Strategy Competitive Analysis Business Development Product Management Product Marketing Embedded Systems Ethernet Marketing Strategy Cloud Computing Segmentation New Business Development Network Security Networking Strategic Thinking Enterprise Architecture Virtualization Virtual Appliances Telecommunications Network Appliance SDN NFV Cloud Security Solution Focused Wireless SaaS Strategic Partnerships Start-ups Product Development Strategy Distributed Systems Embedded Software Intel Program Management Cross-functional Team... Channel Partners Enterprise Software See 21+     See less Go-to-market Strategy Competitive Analysis Business Development Product Management Product Marketing Embedded Systems Ethernet Marketing Strategy Cloud Computing Segmentation New Business Development Network Security Networking Strategic Thinking Enterprise Architecture Virtualization Virtual Appliances Telecommunications Network Appliance SDN NFV Cloud Security Solution Focused Wireless SaaS Strategic Partnerships Start-ups Product Development Strategy Distributed Systems Embedded Software Intel Program Management Cross-functional Team... Channel Partners Enterprise Software See 21+     See less ", "Summary I am a high energy, senior level, Marketing professional with 18+ years experience in Marketing, Sales, Business Development, and Engineering in Intel client and server computing solutions across Enterprise and SMB market segments. I gravitate toward cutting edge ventures with a passion and thirst for learning, adapting, and succeeding at each one. My deep, technical expertise, combined with an engaging, straight forward communications style allows me to clearly translate and convey complex technical solutions into high impact marketing strategies and tactics. I am highly adept at leading change through superior problem solving and an aptitude for balanced decision making under pressure. I cultivate influential partnerships with key ecosystem players to take advantage of market opportunities. \n \nMarketing & Sales Experience Includes: \n•\tProduct Marketing\t \n•\tSoftware & Services Marketing \n•\tPlatform Marketing \n•\tTechnology Marketing \n•\tHigh Tech Account Sales \n•\tBusiness Development \n•\tEnterprise & Small Business IT Market Expertise \n•\tInitiative Marketing – Desktop Virtualization\t \n•\tOEM & ISV Account Management  \n•\tMarketing Campaign Development \n•\tMarketing Plan Development \n•\tUsages & Personas Development \n•\tPolished & Seasoned Public Speaker Summary I am a high energy, senior level, Marketing professional with 18+ years experience in Marketing, Sales, Business Development, and Engineering in Intel client and server computing solutions across Enterprise and SMB market segments. I gravitate toward cutting edge ventures with a passion and thirst for learning, adapting, and succeeding at each one. My deep, technical expertise, combined with an engaging, straight forward communications style allows me to clearly translate and convey complex technical solutions into high impact marketing strategies and tactics. I am highly adept at leading change through superior problem solving and an aptitude for balanced decision making under pressure. I cultivate influential partnerships with key ecosystem players to take advantage of market opportunities. \n \nMarketing & Sales Experience Includes: \n•\tProduct Marketing\t \n•\tSoftware & Services Marketing \n•\tPlatform Marketing \n•\tTechnology Marketing \n•\tHigh Tech Account Sales \n•\tBusiness Development \n•\tEnterprise & Small Business IT Market Expertise \n•\tInitiative Marketing – Desktop Virtualization\t \n•\tOEM & ISV Account Management  \n•\tMarketing Campaign Development \n•\tMarketing Plan Development \n•\tUsages & Personas Development \n•\tPolished & Seasoned Public Speaker I am a high energy, senior level, Marketing professional with 18+ years experience in Marketing, Sales, Business Development, and Engineering in Intel client and server computing solutions across Enterprise and SMB market segments. I gravitate toward cutting edge ventures with a passion and thirst for learning, adapting, and succeeding at each one. My deep, technical expertise, combined with an engaging, straight forward communications style allows me to clearly translate and convey complex technical solutions into high impact marketing strategies and tactics. I am highly adept at leading change through superior problem solving and an aptitude for balanced decision making under pressure. I cultivate influential partnerships with key ecosystem players to take advantage of market opportunities. \n \nMarketing & Sales Experience Includes: \n•\tProduct Marketing\t \n•\tSoftware & Services Marketing \n•\tPlatform Marketing \n•\tTechnology Marketing \n•\tHigh Tech Account Sales \n•\tBusiness Development \n•\tEnterprise & Small Business IT Market Expertise \n•\tInitiative Marketing – Desktop Virtualization\t \n•\tOEM & ISV Account Management  \n•\tMarketing Campaign Development \n•\tMarketing Plan Development \n•\tUsages & Personas Development \n•\tPolished & Seasoned Public Speaker I am a high energy, senior level, Marketing professional with 18+ years experience in Marketing, Sales, Business Development, and Engineering in Intel client and server computing solutions across Enterprise and SMB market segments. I gravitate toward cutting edge ventures with a passion and thirst for learning, adapting, and succeeding at each one. My deep, technical expertise, combined with an engaging, straight forward communications style allows me to clearly translate and convey complex technical solutions into high impact marketing strategies and tactics. I am highly adept at leading change through superior problem solving and an aptitude for balanced decision making under pressure. I cultivate influential partnerships with key ecosystem players to take advantage of market opportunities. \n \nMarketing & Sales Experience Includes: \n•\tProduct Marketing\t \n•\tSoftware & Services Marketing \n•\tPlatform Marketing \n•\tTechnology Marketing \n•\tHigh Tech Account Sales \n•\tBusiness Development \n•\tEnterprise & Small Business IT Market Expertise \n•\tInitiative Marketing – Desktop Virtualization\t \n•\tOEM & ISV Account Management  \n•\tMarketing Campaign Development \n•\tMarketing Plan Development \n•\tUsages & Personas Development \n•\tPolished & Seasoned Public Speaker Experience Cloud Storage Segment Manager Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Drive strategy and competitive response for Cloud Storage segment targeting Top 7 Cloud Service Providers (CSPs), including Amazon, Microsoft, Facebook, Google, Alibaba, Baidu, and Tencent and Enterprise private cloud. \n \nDevelop Open Storage Platform for public and private cloud to enable Intel technologies at key SW partners. \n \nEngage key private cloud customers with Proof-of-Concept (PoC) platforms to demonstrate Intel thought leadership in Cloud Storage. Software Partner Marketing Manager Intel Corporation 2010  –  July 2013  (3 years) Portland, Oregon Area Recruit key software companies to join Intel AppUp SMB Service program  \n \nDevelop joint GTM plans to drive adotion of Intel AppUp SMB Service & SW Partner sales \n \nCreated creative marketing campaign (Protect Your Data) targeting ISVs to sell Intel AppUp SMB Service to their channel (extended sales force) Desktop Virtualization Initiative Marketing Intel Corporation 2009  –  2010  (1 year) Portland, Oregon Area Worked with industry leaders to position Intel's Desktop Virtualization strategy as a positive thought leadership role with partner ISVs and the general desktop virtualization industry \n \nCreative marketing programs to make Intel message \"stick\" with fortune cookies laptop giveaways and user-perspective animations Platform Marketing Manager Intel Corporation 2007  –  2009  (2 years) Portland, Oregon Area Intel first WW virtual platform launch highlighting the McCreary platform resulting in 46 major press articles on launch day with 100% of the articles with positive to neutral tone and on message \n \nExecuted all customer marketing for Dell & HP OEM accounts for business PCs HP Global Account Manager Intel Corporation 2007  –  2007  (less than a year) Houston, Texas Area Responsible for sales and design wins and competitive bids for Intel silicon on HP business PCs Technology Marketing Manager Intel 2002  –  2006  (4 years) Sacramento, California Area Promoted Intel® Active Technology Management & Intel® Virtualization Technology solution for desktop chipset business ($3.8B business) through market & ROI analysis, pricing analysis, product SKUing, design win activities and tracking, H/W & S/W engineering direction, and go-to-market related plans to drive Enterprise IT adoption Field Sales Engineer Altera 2000  –  2002  (2 years) Sacramento, California Area Delivered sales in Northern California and Northern Nevada and managed Altera’s 8 person distribution sales team at Arrow Electronics \n \nIncreased \"effective\" sales force through \"Altera-pro\" contractors in Northern California and Northern Nevada region by developing Altera’s first monthly contractor training seminars Engineering Level One Communications 1998  –  2000  (2 years) Sacramento, California Area Managed multi-faceted 8 member team in design automation enabling the reduction of design layout turnaround by 3X for a very successful Media Switch product \n \nPioneered an engineering and mentor program to ensure career growth for team members and valuable cross training to reduce downtime Application Engineer, Marketing Altera 1996  –  1998  (2 years) San Francisco Bay Area Pioneered Altera’s first designated Account Application Engineer, responsible for driving design wins of $88.3M at top-tier accounts (Cisco & Nortel) Cloud Storage Segment Manager Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Drive strategy and competitive response for Cloud Storage segment targeting Top 7 Cloud Service Providers (CSPs), including Amazon, Microsoft, Facebook, Google, Alibaba, Baidu, and Tencent and Enterprise private cloud. \n \nDevelop Open Storage Platform for public and private cloud to enable Intel technologies at key SW partners. \n \nEngage key private cloud customers with Proof-of-Concept (PoC) platforms to demonstrate Intel thought leadership in Cloud Storage. Cloud Storage Segment Manager Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Drive strategy and competitive response for Cloud Storage segment targeting Top 7 Cloud Service Providers (CSPs), including Amazon, Microsoft, Facebook, Google, Alibaba, Baidu, and Tencent and Enterprise private cloud. \n \nDevelop Open Storage Platform for public and private cloud to enable Intel technologies at key SW partners. \n \nEngage key private cloud customers with Proof-of-Concept (PoC) platforms to demonstrate Intel thought leadership in Cloud Storage. Software Partner Marketing Manager Intel Corporation 2010  –  July 2013  (3 years) Portland, Oregon Area Recruit key software companies to join Intel AppUp SMB Service program  \n \nDevelop joint GTM plans to drive adotion of Intel AppUp SMB Service & SW Partner sales \n \nCreated creative marketing campaign (Protect Your Data) targeting ISVs to sell Intel AppUp SMB Service to their channel (extended sales force) Software Partner Marketing Manager Intel Corporation 2010  –  July 2013  (3 years) Portland, Oregon Area Recruit key software companies to join Intel AppUp SMB Service program  \n \nDevelop joint GTM plans to drive adotion of Intel AppUp SMB Service & SW Partner sales \n \nCreated creative marketing campaign (Protect Your Data) targeting ISVs to sell Intel AppUp SMB Service to their channel (extended sales force) Desktop Virtualization Initiative Marketing Intel Corporation 2009  –  2010  (1 year) Portland, Oregon Area Worked with industry leaders to position Intel's Desktop Virtualization strategy as a positive thought leadership role with partner ISVs and the general desktop virtualization industry \n \nCreative marketing programs to make Intel message \"stick\" with fortune cookies laptop giveaways and user-perspective animations Desktop Virtualization Initiative Marketing Intel Corporation 2009  –  2010  (1 year) Portland, Oregon Area Worked with industry leaders to position Intel's Desktop Virtualization strategy as a positive thought leadership role with partner ISVs and the general desktop virtualization industry \n \nCreative marketing programs to make Intel message \"stick\" with fortune cookies laptop giveaways and user-perspective animations Platform Marketing Manager Intel Corporation 2007  –  2009  (2 years) Portland, Oregon Area Intel first WW virtual platform launch highlighting the McCreary platform resulting in 46 major press articles on launch day with 100% of the articles with positive to neutral tone and on message \n \nExecuted all customer marketing for Dell & HP OEM accounts for business PCs Platform Marketing Manager Intel Corporation 2007  –  2009  (2 years) Portland, Oregon Area Intel first WW virtual platform launch highlighting the McCreary platform resulting in 46 major press articles on launch day with 100% of the articles with positive to neutral tone and on message \n \nExecuted all customer marketing for Dell & HP OEM accounts for business PCs HP Global Account Manager Intel Corporation 2007  –  2007  (less than a year) Houston, Texas Area Responsible for sales and design wins and competitive bids for Intel silicon on HP business PCs HP Global Account Manager Intel Corporation 2007  –  2007  (less than a year) Houston, Texas Area Responsible for sales and design wins and competitive bids for Intel silicon on HP business PCs Technology Marketing Manager Intel 2002  –  2006  (4 years) Sacramento, California Area Promoted Intel® Active Technology Management & Intel® Virtualization Technology solution for desktop chipset business ($3.8B business) through market & ROI analysis, pricing analysis, product SKUing, design win activities and tracking, H/W & S/W engineering direction, and go-to-market related plans to drive Enterprise IT adoption Technology Marketing Manager Intel 2002  –  2006  (4 years) Sacramento, California Area Promoted Intel® Active Technology Management & Intel® Virtualization Technology solution for desktop chipset business ($3.8B business) through market & ROI analysis, pricing analysis, product SKUing, design win activities and tracking, H/W & S/W engineering direction, and go-to-market related plans to drive Enterprise IT adoption Field Sales Engineer Altera 2000  –  2002  (2 years) Sacramento, California Area Delivered sales in Northern California and Northern Nevada and managed Altera’s 8 person distribution sales team at Arrow Electronics \n \nIncreased \"effective\" sales force through \"Altera-pro\" contractors in Northern California and Northern Nevada region by developing Altera’s first monthly contractor training seminars Field Sales Engineer Altera 2000  –  2002  (2 years) Sacramento, California Area Delivered sales in Northern California and Northern Nevada and managed Altera’s 8 person distribution sales team at Arrow Electronics \n \nIncreased \"effective\" sales force through \"Altera-pro\" contractors in Northern California and Northern Nevada region by developing Altera’s first monthly contractor training seminars Engineering Level One Communications 1998  –  2000  (2 years) Sacramento, California Area Managed multi-faceted 8 member team in design automation enabling the reduction of design layout turnaround by 3X for a very successful Media Switch product \n \nPioneered an engineering and mentor program to ensure career growth for team members and valuable cross training to reduce downtime Engineering Level One Communications 1998  –  2000  (2 years) Sacramento, California Area Managed multi-faceted 8 member team in design automation enabling the reduction of design layout turnaround by 3X for a very successful Media Switch product \n \nPioneered an engineering and mentor program to ensure career growth for team members and valuable cross training to reduce downtime Application Engineer, Marketing Altera 1996  –  1998  (2 years) San Francisco Bay Area Pioneered Altera’s first designated Account Application Engineer, responsible for driving design wins of $88.3M at top-tier accounts (Cisco & Nortel) Application Engineer, Marketing Altera 1996  –  1998  (2 years) San Francisco Bay Area Pioneered Altera’s first designated Account Application Engineer, responsible for driving design wins of $88.3M at top-tier accounts (Cisco & Nortel) Skills Marketing Business Development Strategic Partner... Intel Product Marketing Technology Marketing Platform Marketing Public Speaking Cloud Computing Cloud Applications Virtualization Semiconductors Go-to-market Strategy Long-term Customer... Program Management Enterprise Software Strategy Product Management Account Management Cross-functional Team... IC Processors Leadership See 8+     See less Skills  Marketing Business Development Strategic Partner... Intel Product Marketing Technology Marketing Platform Marketing Public Speaking Cloud Computing Cloud Applications Virtualization Semiconductors Go-to-market Strategy Long-term Customer... Program Management Enterprise Software Strategy Product Management Account Management Cross-functional Team... IC Processors Leadership See 8+     See less Marketing Business Development Strategic Partner... Intel Product Marketing Technology Marketing Platform Marketing Public Speaking Cloud Computing Cloud Applications Virtualization Semiconductors Go-to-market Strategy Long-term Customer... Program Management Enterprise Software Strategy Product Management Account Management Cross-functional Team... IC Processors Leadership See 8+     See less Marketing Business Development Strategic Partner... Intel Product Marketing Technology Marketing Platform Marketing Public Speaking Cloud Computing Cloud Applications Virtualization Semiconductors Go-to-market Strategy Long-term Customer... Program Management Enterprise Software Strategy Product Management Account Management Cross-functional Team... IC Processors Leadership See 8+     See less Education University of California, Davis - Graduate School of Management Master of Business Administration (M.B.A.),  Strategic Marketing & Forecasting 1999  – 2003 University of California, Davis Bachelor of Applied Science (B.A.Sc.),  Electrical and Electronics Engineering 1996 University of California, Davis - Graduate School of Management Master of Business Administration (M.B.A.),  Strategic Marketing & Forecasting 1999  – 2003 University of California, Davis - Graduate School of Management Master of Business Administration (M.B.A.),  Strategic Marketing & Forecasting 1999  – 2003 University of California, Davis - Graduate School of Management Master of Business Administration (M.B.A.),  Strategic Marketing & Forecasting 1999  – 2003 University of California, Davis Bachelor of Applied Science (B.A.Sc.),  Electrical and Electronics Engineering 1996 University of California, Davis Bachelor of Applied Science (B.A.Sc.),  Electrical and Electronics Engineering 1996 University of California, Davis Bachelor of Applied Science (B.A.Sc.),  Electrical and Electronics Engineering 1996 ", "Experience Digital Marketing and Social Media Manager Intel Corporation / Internet of Things (IoT) Group August 2014  – Present (1 year 1 month) Portland, Oregon Area Responsible for the oversight and management of the worldwide Internet of Things (IoT) social media team to develop and orchestrate digital initiatives across every facet of our interactions with customers and developers. A key member of the Social Media Center of Excellence, with responsibilities for developing the Internet of Things Group social media readiness, real-time social listening, annual plans and budget requirements, establishing social media campaign goals, campaign reporting and executive management share of voice analytics.  \n \nI’m fully entrenched in social media technology and understand the fine line of being edgy and managing a professional and effective social media presence. This includes, but is not limited to developing and executing Intel’s IoT social media channel strategies, creating new social content (video, photo, cinemagraph, infographic, etc.) for marketing initiatives, developing end-to-end social media campaigns for events, product launches and managing cross-agency integration.  \n \nThis is accomplished in partnership and teamwork with our IT organization and stewarding the overall relationships with various business units and geo teams to ensure social media is optimized across the worldwide marketing organization. Marketing Strategy Manager Intel Corporation August 2011  –  August 2014  (3 years 1 month) Portland, Oregon Area Responsible for the Digital Content Creation (DCC) market segment in the PC Client Group. Responsibilities include leading the definition and execution of the Premium notebook go-to-market strategy and marketing programs in support of segment business goals. Primary responsibilities include, but are not limited to, developing product positioning and sales collateral, defining and deploying marketing programs with customers and partners, planning and executing Intel presence at key DCC events and working with Intel corporate marketing groups to influence consumer messaging, campaign strategy, and branding. Strategic Business Development Manager Intel Corporation / Software and Services Group 2009  –  August 2011  (2 years) Portland, Oregon Area Responsible for all aspects of Intel’s strategic evangelism, technical, marketing, and executive engagements with companies in the Digital Content Creation (DCC) ecosystem. Responsible to analyze the ecosystem, identify key trends, and develop and drive partner collaborations that will accelerate the adoption of new usage models or technologies that will, in turn, accelerate the adoption of, or preference for, Intel platforms. Responsibilities also include the ongoing crafting and execution of specific technical and marketing programs that infuse content into the sales process for Intel platform technologies. Innovation Accelerator Manager Intel Corporation / Software and Services Group 2006  –  2009  (3 years) Portland, Oregon Area Responsible for identifying innovative applications and engaging emerging software companies and institutions that are developing new solutions or technologies which support Intel's strategic and tactical platform objectives. Responsible to develop and drive collaborations that will accelerate the adoption of new usage models or technologies that will, in turn, accelerate the adoption of, or preference for, Intel platforms. Manager, Strategic Relations Intel Corporation/Sales and Marketing Group 2000  –  2005  (5 years) Portland, Oregon Area Responsible for accelerating Content, Digital Home and Platform initiatives with key accounts and/or Worldwide ISV partners. Drove the porting, enabling and optimizing of applications on Intel architecture as well as executed joint sales, business development and marketing activities aimed to align content, services and platforms in the delivery of the digital home experience. \n \nSales accomplishment resulted in receiving “Intel Top Achievement Award” (the highest award given at Intel) for efforts in driving the adoption of Intel technology. EDA Market Segment Manager Intel Corporation/Workstation Products Group 1998  –  2000  (2 years) Portland, Oregon Area Responsible for developing and driving Intel’s strategy to increase sales of high-end systems (workstations and servers) into the Electronic Design Automation (EDA) industry. This included defining the Linux strategy in the high-end ASIC flow and how Intel worked with Independent Software Vendors (ISV) and end user code developers in the EDA community, as well as marketing activities targeting the EDA press, analyst, and tradeshow community. \n \nEfforts resulted in the mass adoption of Intel/Linux-based products in EDA, and my receiving Division recognition for efforts in driving the adoption of Intel technology in the sector. Technology Development Manager Mentor Graphics 1996  –  1998  (2 years) Portland, Oregon Area Responsible for leading the Information Systems, Technology Development team. The team was responsible for developing and deployment of innovative advanced technology and technical methodologies into the company. Also responsible for driving the architecture, development, and ongoing improvements of the corporate web sites. Projects included developing an internal sales intranet, creation of a customer support VPN, upgrading corporate firewall systems, incorporation of multimedia materials per department projects, CGI scripting for on-line forms, interactive user sessions, standards and policy directions. Chaired the corporate web committee. Workstation Marketing Manager Mentor Graphics 1993  –  1996  (3 years) Portland, Oregon Area Responsible for development and execution of marketing strategies and overall business relationships with SUN (Solaris), IBM (AIX), and NEC (MIPS/UX). Specific areas of expertise include: Development of product positioning/porting strategies; Advertising, direct mail, tradeshow and PR development; Pricing strategies; Development of strategic marketing business relationships; Sales presentation materials development; Competitive analysis; Sales literature development; Porting proposal development and engineering technology agreements; Sales force training; and Market research. Customer Support Manager - APAC Mentor Graphics 1985  –  1993  (8 years) Portland, Oregon Area Responsible for multiple Support Groups including Strategic Account Services and Training. Based in Singapore (1990-1993), the support organization was a P&L center with bookings and profit targets used as a metric for the group's operations.  \n \nDirected multiple Application Software Support functions, including Field Technical Support, Internal Network/System Administration, Service Training, Technical Documentation and New Product Introduction strategies. Manufacturing Manager Spacelabs Medical, Inc 1981  –  1985  (4 years) Portland, Oregon Area Directed worldwide manufacturing operations in the production of highly complex patient monitoring devices and clinical information systems for hospitals. The systems/devices are used to monitor the vital signs of adults and children during and after surgery, during emergency illness, or while in intensive care. Development/Staff Engineer Tektronix, Inc 1977  –  1981  (4 years) Portland, Oregon Area Responsible for designing high frequency RF measurement test systems with maximum reuse and minimum cost in direct support of production activities. Also developed firmware test routines for the isolation of software, and hardware problems. Digital Marketing and Social Media Manager Intel Corporation / Internet of Things (IoT) Group August 2014  – Present (1 year 1 month) Portland, Oregon Area Responsible for the oversight and management of the worldwide Internet of Things (IoT) social media team to develop and orchestrate digital initiatives across every facet of our interactions with customers and developers. A key member of the Social Media Center of Excellence, with responsibilities for developing the Internet of Things Group social media readiness, real-time social listening, annual plans and budget requirements, establishing social media campaign goals, campaign reporting and executive management share of voice analytics.  \n \nI’m fully entrenched in social media technology and understand the fine line of being edgy and managing a professional and effective social media presence. This includes, but is not limited to developing and executing Intel’s IoT social media channel strategies, creating new social content (video, photo, cinemagraph, infographic, etc.) for marketing initiatives, developing end-to-end social media campaigns for events, product launches and managing cross-agency integration.  \n \nThis is accomplished in partnership and teamwork with our IT organization and stewarding the overall relationships with various business units and geo teams to ensure social media is optimized across the worldwide marketing organization. Digital Marketing and Social Media Manager Intel Corporation / Internet of Things (IoT) Group August 2014  – Present (1 year 1 month) Portland, Oregon Area Responsible for the oversight and management of the worldwide Internet of Things (IoT) social media team to develop and orchestrate digital initiatives across every facet of our interactions with customers and developers. A key member of the Social Media Center of Excellence, with responsibilities for developing the Internet of Things Group social media readiness, real-time social listening, annual plans and budget requirements, establishing social media campaign goals, campaign reporting and executive management share of voice analytics.  \n \nI’m fully entrenched in social media technology and understand the fine line of being edgy and managing a professional and effective social media presence. This includes, but is not limited to developing and executing Intel’s IoT social media channel strategies, creating new social content (video, photo, cinemagraph, infographic, etc.) for marketing initiatives, developing end-to-end social media campaigns for events, product launches and managing cross-agency integration.  \n \nThis is accomplished in partnership and teamwork with our IT organization and stewarding the overall relationships with various business units and geo teams to ensure social media is optimized across the worldwide marketing organization. Marketing Strategy Manager Intel Corporation August 2011  –  August 2014  (3 years 1 month) Portland, Oregon Area Responsible for the Digital Content Creation (DCC) market segment in the PC Client Group. Responsibilities include leading the definition and execution of the Premium notebook go-to-market strategy and marketing programs in support of segment business goals. Primary responsibilities include, but are not limited to, developing product positioning and sales collateral, defining and deploying marketing programs with customers and partners, planning and executing Intel presence at key DCC events and working with Intel corporate marketing groups to influence consumer messaging, campaign strategy, and branding. Marketing Strategy Manager Intel Corporation August 2011  –  August 2014  (3 years 1 month) Portland, Oregon Area Responsible for the Digital Content Creation (DCC) market segment in the PC Client Group. Responsibilities include leading the definition and execution of the Premium notebook go-to-market strategy and marketing programs in support of segment business goals. Primary responsibilities include, but are not limited to, developing product positioning and sales collateral, defining and deploying marketing programs with customers and partners, planning and executing Intel presence at key DCC events and working with Intel corporate marketing groups to influence consumer messaging, campaign strategy, and branding. Strategic Business Development Manager Intel Corporation / Software and Services Group 2009  –  August 2011  (2 years) Portland, Oregon Area Responsible for all aspects of Intel’s strategic evangelism, technical, marketing, and executive engagements with companies in the Digital Content Creation (DCC) ecosystem. Responsible to analyze the ecosystem, identify key trends, and develop and drive partner collaborations that will accelerate the adoption of new usage models or technologies that will, in turn, accelerate the adoption of, or preference for, Intel platforms. Responsibilities also include the ongoing crafting and execution of specific technical and marketing programs that infuse content into the sales process for Intel platform technologies. Strategic Business Development Manager Intel Corporation / Software and Services Group 2009  –  August 2011  (2 years) Portland, Oregon Area Responsible for all aspects of Intel’s strategic evangelism, technical, marketing, and executive engagements with companies in the Digital Content Creation (DCC) ecosystem. Responsible to analyze the ecosystem, identify key trends, and develop and drive partner collaborations that will accelerate the adoption of new usage models or technologies that will, in turn, accelerate the adoption of, or preference for, Intel platforms. Responsibilities also include the ongoing crafting and execution of specific technical and marketing programs that infuse content into the sales process for Intel platform technologies. Innovation Accelerator Manager Intel Corporation / Software and Services Group 2006  –  2009  (3 years) Portland, Oregon Area Responsible for identifying innovative applications and engaging emerging software companies and institutions that are developing new solutions or technologies which support Intel's strategic and tactical platform objectives. Responsible to develop and drive collaborations that will accelerate the adoption of new usage models or technologies that will, in turn, accelerate the adoption of, or preference for, Intel platforms. Innovation Accelerator Manager Intel Corporation / Software and Services Group 2006  –  2009  (3 years) Portland, Oregon Area Responsible for identifying innovative applications and engaging emerging software companies and institutions that are developing new solutions or technologies which support Intel's strategic and tactical platform objectives. Responsible to develop and drive collaborations that will accelerate the adoption of new usage models or technologies that will, in turn, accelerate the adoption of, or preference for, Intel platforms. Manager, Strategic Relations Intel Corporation/Sales and Marketing Group 2000  –  2005  (5 years) Portland, Oregon Area Responsible for accelerating Content, Digital Home and Platform initiatives with key accounts and/or Worldwide ISV partners. Drove the porting, enabling and optimizing of applications on Intel architecture as well as executed joint sales, business development and marketing activities aimed to align content, services and platforms in the delivery of the digital home experience. \n \nSales accomplishment resulted in receiving “Intel Top Achievement Award” (the highest award given at Intel) for efforts in driving the adoption of Intel technology. Manager, Strategic Relations Intel Corporation/Sales and Marketing Group 2000  –  2005  (5 years) Portland, Oregon Area Responsible for accelerating Content, Digital Home and Platform initiatives with key accounts and/or Worldwide ISV partners. Drove the porting, enabling and optimizing of applications on Intel architecture as well as executed joint sales, business development and marketing activities aimed to align content, services and platforms in the delivery of the digital home experience. \n \nSales accomplishment resulted in receiving “Intel Top Achievement Award” (the highest award given at Intel) for efforts in driving the adoption of Intel technology. EDA Market Segment Manager Intel Corporation/Workstation Products Group 1998  –  2000  (2 years) Portland, Oregon Area Responsible for developing and driving Intel’s strategy to increase sales of high-end systems (workstations and servers) into the Electronic Design Automation (EDA) industry. This included defining the Linux strategy in the high-end ASIC flow and how Intel worked with Independent Software Vendors (ISV) and end user code developers in the EDA community, as well as marketing activities targeting the EDA press, analyst, and tradeshow community. \n \nEfforts resulted in the mass adoption of Intel/Linux-based products in EDA, and my receiving Division recognition for efforts in driving the adoption of Intel technology in the sector. EDA Market Segment Manager Intel Corporation/Workstation Products Group 1998  –  2000  (2 years) Portland, Oregon Area Responsible for developing and driving Intel’s strategy to increase sales of high-end systems (workstations and servers) into the Electronic Design Automation (EDA) industry. This included defining the Linux strategy in the high-end ASIC flow and how Intel worked with Independent Software Vendors (ISV) and end user code developers in the EDA community, as well as marketing activities targeting the EDA press, analyst, and tradeshow community. \n \nEfforts resulted in the mass adoption of Intel/Linux-based products in EDA, and my receiving Division recognition for efforts in driving the adoption of Intel technology in the sector. Technology Development Manager Mentor Graphics 1996  –  1998  (2 years) Portland, Oregon Area Responsible for leading the Information Systems, Technology Development team. The team was responsible for developing and deployment of innovative advanced technology and technical methodologies into the company. Also responsible for driving the architecture, development, and ongoing improvements of the corporate web sites. Projects included developing an internal sales intranet, creation of a customer support VPN, upgrading corporate firewall systems, incorporation of multimedia materials per department projects, CGI scripting for on-line forms, interactive user sessions, standards and policy directions. Chaired the corporate web committee. Technology Development Manager Mentor Graphics 1996  –  1998  (2 years) Portland, Oregon Area Responsible for leading the Information Systems, Technology Development team. The team was responsible for developing and deployment of innovative advanced technology and technical methodologies into the company. Also responsible for driving the architecture, development, and ongoing improvements of the corporate web sites. Projects included developing an internal sales intranet, creation of a customer support VPN, upgrading corporate firewall systems, incorporation of multimedia materials per department projects, CGI scripting for on-line forms, interactive user sessions, standards and policy directions. Chaired the corporate web committee. Workstation Marketing Manager Mentor Graphics 1993  –  1996  (3 years) Portland, Oregon Area Responsible for development and execution of marketing strategies and overall business relationships with SUN (Solaris), IBM (AIX), and NEC (MIPS/UX). Specific areas of expertise include: Development of product positioning/porting strategies; Advertising, direct mail, tradeshow and PR development; Pricing strategies; Development of strategic marketing business relationships; Sales presentation materials development; Competitive analysis; Sales literature development; Porting proposal development and engineering technology agreements; Sales force training; and Market research. Workstation Marketing Manager Mentor Graphics 1993  –  1996  (3 years) Portland, Oregon Area Responsible for development and execution of marketing strategies and overall business relationships with SUN (Solaris), IBM (AIX), and NEC (MIPS/UX). Specific areas of expertise include: Development of product positioning/porting strategies; Advertising, direct mail, tradeshow and PR development; Pricing strategies; Development of strategic marketing business relationships; Sales presentation materials development; Competitive analysis; Sales literature development; Porting proposal development and engineering technology agreements; Sales force training; and Market research. Customer Support Manager - APAC Mentor Graphics 1985  –  1993  (8 years) Portland, Oregon Area Responsible for multiple Support Groups including Strategic Account Services and Training. Based in Singapore (1990-1993), the support organization was a P&L center with bookings and profit targets used as a metric for the group's operations.  \n \nDirected multiple Application Software Support functions, including Field Technical Support, Internal Network/System Administration, Service Training, Technical Documentation and New Product Introduction strategies. Customer Support Manager - APAC Mentor Graphics 1985  –  1993  (8 years) Portland, Oregon Area Responsible for multiple Support Groups including Strategic Account Services and Training. Based in Singapore (1990-1993), the support organization was a P&L center with bookings and profit targets used as a metric for the group's operations.  \n \nDirected multiple Application Software Support functions, including Field Technical Support, Internal Network/System Administration, Service Training, Technical Documentation and New Product Introduction strategies. Manufacturing Manager Spacelabs Medical, Inc 1981  –  1985  (4 years) Portland, Oregon Area Directed worldwide manufacturing operations in the production of highly complex patient monitoring devices and clinical information systems for hospitals. The systems/devices are used to monitor the vital signs of adults and children during and after surgery, during emergency illness, or while in intensive care. Manufacturing Manager Spacelabs Medical, Inc 1981  –  1985  (4 years) Portland, Oregon Area Directed worldwide manufacturing operations in the production of highly complex patient monitoring devices and clinical information systems for hospitals. The systems/devices are used to monitor the vital signs of adults and children during and after surgery, during emergency illness, or while in intensive care. Development/Staff Engineer Tektronix, Inc 1977  –  1981  (4 years) Portland, Oregon Area Responsible for designing high frequency RF measurement test systems with maximum reuse and minimum cost in direct support of production activities. Also developed firmware test routines for the isolation of software, and hardware problems. Development/Staff Engineer Tektronix, Inc 1977  –  1981  (4 years) Portland, Oregon Area Responsible for designing high frequency RF measurement test systems with maximum reuse and minimum cost in direct support of production activities. Also developed firmware test routines for the isolation of software, and hardware problems. Skills Strategy Competitive Analysis Business Development Management Product Development Business Strategy Product Marketing Digital Media Marketing Strategy Market Research Program Management Marketing CRM Social Media Blogging Product Management Skills  Strategy Competitive Analysis Business Development Management Product Development Business Strategy Product Marketing Digital Media Marketing Strategy Market Research Program Management Marketing CRM Social Media Blogging Product Management Strategy Competitive Analysis Business Development Management Product Development Business Strategy Product Marketing Digital Media Marketing Strategy Market Research Program Management Marketing CRM Social Media Blogging Product Management Strategy Competitive Analysis Business Development Management Product Development Business Strategy Product Marketing Digital Media Marketing Strategy Market Research Program Management Marketing CRM Social Media Blogging Product Management Honors & Awards Additional Honors & Awards Mazama Summit Certificate (Mt Hood) - South Side Additional Honors & Awards Mazama Summit Certificate (Mt Hood) - South Side Additional Honors & Awards Mazama Summit Certificate (Mt Hood) - South Side Additional Honors & Awards Mazama Summit Certificate (Mt Hood) - South Side ", "Skills Enterprise Software Virtualization IT Strategy Hardware Strategy Telecommunications Strategic Planning VoIP Intel Product Management Management Security Product Development Team Building Training Sales Process Business Development Leadership Cross-functional Team... Sales Solution Architecture Cloud Computing Storage Semiconductors Computer Security Channel Solution Selling Network Administration Go-to-market Strategy Unified Communications Sales Operations Selling Data Center Team Management See 19+     See less Skills  Enterprise Software Virtualization IT Strategy Hardware Strategy Telecommunications Strategic Planning VoIP Intel Product Management Management Security Product Development Team Building Training Sales Process Business Development Leadership Cross-functional Team... Sales Solution Architecture Cloud Computing Storage Semiconductors Computer Security Channel Solution Selling Network Administration Go-to-market Strategy Unified Communications Sales Operations Selling Data Center Team Management See 19+     See less Enterprise Software Virtualization IT Strategy Hardware Strategy Telecommunications Strategic Planning VoIP Intel Product Management Management Security Product Development Team Building Training Sales Process Business Development Leadership Cross-functional Team... Sales Solution Architecture Cloud Computing Storage Semiconductors Computer Security Channel Solution Selling Network Administration Go-to-market Strategy Unified Communications Sales Operations Selling Data Center Team Management See 19+     See less Enterprise Software Virtualization IT Strategy Hardware Strategy Telecommunications Strategic Planning VoIP Intel Product Management Management Security Product Development Team Building Training Sales Process Business Development Leadership Cross-functional Team... Sales Solution Architecture Cloud Computing Storage Semiconductors Computer Security Channel Solution Selling Network Administration Go-to-market Strategy Unified Communications Sales Operations Selling Data Center Team Management See 19+     See less ", "Skills Product management Strategic Planning Building Customer... CRM Product Management Networking Leadership Marketing Strategy Strategic Partnerships Marketing Management Start-ups Account Management Sales Strategy Cross-functional Team... Forecasting Product Development Lean Manufacturing New Business Development Management SaaS Project Management Product Marketing Segmentation Manufacturing Go-to-market Strategy Competitive Analysis Sales Operations Program Management Business Strategy Sales Management Business Development Solution Selling Channel Product Launch Channel Partners Multi-channel Marketing Event Management Social Media Marketing Marketing Semiconductors Team Leadership Training See 28+     See less Skills  Product management Strategic Planning Building Customer... CRM Product Management Networking Leadership Marketing Strategy Strategic Partnerships Marketing Management Start-ups Account Management Sales Strategy Cross-functional Team... Forecasting Product Development Lean Manufacturing New Business Development Management SaaS Project Management Product Marketing Segmentation Manufacturing Go-to-market Strategy Competitive Analysis Sales Operations Program Management Business Strategy Sales Management Business Development Solution Selling Channel Product Launch Channel Partners Multi-channel Marketing Event Management Social Media Marketing Marketing Semiconductors Team Leadership Training See 28+     See less Product management Strategic Planning Building Customer... CRM Product Management Networking Leadership Marketing Strategy Strategic Partnerships Marketing Management Start-ups Account Management Sales Strategy Cross-functional Team... Forecasting Product Development Lean Manufacturing New Business Development Management SaaS Project Management Product Marketing Segmentation Manufacturing Go-to-market Strategy Competitive Analysis Sales Operations Program Management Business Strategy Sales Management Business Development Solution Selling Channel Product Launch Channel Partners Multi-channel Marketing Event Management Social Media Marketing Marketing Semiconductors Team Leadership Training See 28+     See less Product management Strategic Planning Building Customer... CRM Product Management Networking Leadership Marketing Strategy Strategic Partnerships Marketing Management Start-ups Account Management Sales Strategy Cross-functional Team... Forecasting Product Development Lean Manufacturing New Business Development Management SaaS Project Management Product Marketing Segmentation Manufacturing Go-to-market Strategy Competitive Analysis Sales Operations Program Management Business Strategy Sales Management Business Development Solution Selling Channel Product Launch Channel Partners Multi-channel Marketing Event Management Social Media Marketing Marketing Semiconductors Team Leadership Training See 28+     See less ", "Skills Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Skills  Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Honors & Awards ", "Languages Russian Spanish Russian Spanish Russian Spanish Skills Intel Go-to-market Strategy Semiconductors Product Management Product Marketing Program Management Mobile Applications Strategic Partnerships Cross-functional Team... Marketing Strategy Business Strategy Leadership People-oriented Connecting People Inspiring People Cause Marketing Digital Marketing Film Production Independent Film Management Creative Strategy Mobile Devices Marketing Integration Processors Start-ups Technical Marketing Strategy Enterprise Software Business Development Business Alliances See 16+     See less Skills  Intel Go-to-market Strategy Semiconductors Product Management Product Marketing Program Management Mobile Applications Strategic Partnerships Cross-functional Team... Marketing Strategy Business Strategy Leadership People-oriented Connecting People Inspiring People Cause Marketing Digital Marketing Film Production Independent Film Management Creative Strategy Mobile Devices Marketing Integration Processors Start-ups Technical Marketing Strategy Enterprise Software Business Development Business Alliances See 16+     See less Intel Go-to-market Strategy Semiconductors Product Management Product Marketing Program Management Mobile Applications Strategic Partnerships Cross-functional Team... Marketing Strategy Business Strategy Leadership People-oriented Connecting People Inspiring People Cause Marketing Digital Marketing Film Production Independent Film Management Creative Strategy Mobile Devices Marketing Integration Processors Start-ups Technical Marketing Strategy Enterprise Software Business Development Business Alliances See 16+     See less Intel Go-to-market Strategy Semiconductors Product Management Product Marketing Program Management Mobile Applications Strategic Partnerships Cross-functional Team... Marketing Strategy Business Strategy Leadership People-oriented Connecting People Inspiring People Cause Marketing Digital Marketing Film Production Independent Film Management Creative Strategy Mobile Devices Marketing Integration Processors Start-ups Technical Marketing Strategy Enterprise Software Business Development Business Alliances See 16+     See less Honors & Awards ", "Skills Product Marketing Semiconductors Product Management Project Planning Program Management Intel Digital Marketing Product Launch Go-to-market Strategy Cross-functional Team... Marketing Communications Marketing Strategy Integration Strategic Partnerships Skills  Product Marketing Semiconductors Product Management Project Planning Program Management Intel Digital Marketing Product Launch Go-to-market Strategy Cross-functional Team... Marketing Communications Marketing Strategy Integration Strategic Partnerships Product Marketing Semiconductors Product Management Project Planning Program Management Intel Digital Marketing Product Launch Go-to-market Strategy Cross-functional Team... Marketing Communications Marketing Strategy Integration Strategic Partnerships Product Marketing Semiconductors Product Management Project Planning Program Management Intel Digital Marketing Product Launch Go-to-market Strategy Cross-functional Team... Marketing Communications Marketing Strategy Integration Strategic Partnerships "]}