{"position": "Senior Research Engineer", "company": "Intel Corporation", "profiles": ["Skills Machine Learning Computer Science Algorithms Algorithm Design Computer Vision Multithreading Image Processing C/C++ Perl CUDA OpenCV Pattern Recognition Data Structures GPU Software Engineering Software Design Python Artificial Intelligence See 3+     See less Skills  Machine Learning Computer Science Algorithms Algorithm Design Computer Vision Multithreading Image Processing C/C++ Perl CUDA OpenCV Pattern Recognition Data Structures GPU Software Engineering Software Design Python Artificial Intelligence See 3+     See less Machine Learning Computer Science Algorithms Algorithm Design Computer Vision Multithreading Image Processing C/C++ Perl CUDA OpenCV Pattern Recognition Data Structures GPU Software Engineering Software Design Python Artificial Intelligence See 3+     See less Machine Learning Computer Science Algorithms Algorithm Design Computer Vision Multithreading Image Processing C/C++ Perl CUDA OpenCV Pattern Recognition Data Structures GPU Software Engineering Software Design Python Artificial Intelligence See 3+     See less Honors & Awards IEEE Senior Member IEEE June 2014 Invitee, Frontier of Engineering Symposium U.S. National Academy of Engineering June 2015 IEEE Senior Member IEEE June 2014 IEEE Senior Member IEEE June 2014 IEEE Senior Member IEEE June 2014 Invitee, Frontier of Engineering Symposium U.S. National Academy of Engineering June 2015 Invitee, Frontier of Engineering Symposium U.S. National Academy of Engineering June 2015 Invitee, Frontier of Engineering Symposium U.S. National Academy of Engineering June 2015 ", "Skills Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less Skills  Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less ", "Summary Experienced Engineer, Physicist, and a Mathematician with interest in: \n \n•\tDesign-technology integration, device development and characterization, and classical and quantum-based semiconductor process modeling. \n•\tApplied computational quantum physics for nano-devices characterization and patterning process modeling. \n•\tQuantum theory of transport phenomena in mesoscopic atomic/molecular systems. \n•\tPhoton-material quantum/ molecular-based dynamic interaction modeling for photoresist for sub-10 nm patterning process. \n \nAdditional interests include: \n \n•\tGeo-political perturbation on economic dynamics. \n•\tFinancial markets modeling and options pricing. \n•\tThe psychology of the markets. Summary Experienced Engineer, Physicist, and a Mathematician with interest in: \n \n•\tDesign-technology integration, device development and characterization, and classical and quantum-based semiconductor process modeling. \n•\tApplied computational quantum physics for nano-devices characterization and patterning process modeling. \n•\tQuantum theory of transport phenomena in mesoscopic atomic/molecular systems. \n•\tPhoton-material quantum/ molecular-based dynamic interaction modeling for photoresist for sub-10 nm patterning process. \n \nAdditional interests include: \n \n•\tGeo-political perturbation on economic dynamics. \n•\tFinancial markets modeling and options pricing. \n•\tThe psychology of the markets. Experienced Engineer, Physicist, and a Mathematician with interest in: \n \n•\tDesign-technology integration, device development and characterization, and classical and quantum-based semiconductor process modeling. \n•\tApplied computational quantum physics for nano-devices characterization and patterning process modeling. \n•\tQuantum theory of transport phenomena in mesoscopic atomic/molecular systems. \n•\tPhoton-material quantum/ molecular-based dynamic interaction modeling for photoresist for sub-10 nm patterning process. \n \nAdditional interests include: \n \n•\tGeo-political perturbation on economic dynamics. \n•\tFinancial markets modeling and options pricing. \n•\tThe psychology of the markets. Experienced Engineer, Physicist, and a Mathematician with interest in: \n \n•\tDesign-technology integration, device development and characterization, and classical and quantum-based semiconductor process modeling. \n•\tApplied computational quantum physics for nano-devices characterization and patterning process modeling. \n•\tQuantum theory of transport phenomena in mesoscopic atomic/molecular systems. \n•\tPhoton-material quantum/ molecular-based dynamic interaction modeling for photoresist for sub-10 nm patterning process. \n \nAdditional interests include: \n \n•\tGeo-political perturbation on economic dynamics. \n•\tFinancial markets modeling and options pricing. \n•\tThe psychology of the markets. Languages   Skills Skills     ", "Skills Simulations Computer Architecture Perl C++ Computer Engineering Algorithms Programming Linux Java High Performance... Embedded Systems C Software Engineering Operating Systems Matlab Systems Engineering LaTeX See 2+     See less Skills  Simulations Computer Architecture Perl C++ Computer Engineering Algorithms Programming Linux Java High Performance... Embedded Systems C Software Engineering Operating Systems Matlab Systems Engineering LaTeX See 2+     See less Simulations Computer Architecture Perl C++ Computer Engineering Algorithms Programming Linux Java High Performance... Embedded Systems C Software Engineering Operating Systems Matlab Systems Engineering LaTeX See 2+     See less Simulations Computer Architecture Perl C++ Computer Engineering Algorithms Programming Linux Java High Performance... Embedded Systems C Software Engineering Operating Systems Matlab Systems Engineering LaTeX See 2+     See less ", "Languages Turkish Turkish Turkish Skills Algorithms Distributed Systems Software Engineering C++ Simulations C Software Design Device Drivers Embedded Systems Computer Architecture Object Oriented Design C# High Performance... Cloud Computing Cloud Applications Skills  Algorithms Distributed Systems Software Engineering C++ Simulations C Software Design Device Drivers Embedded Systems Computer Architecture Object Oriented Design C# High Performance... Cloud Computing Cloud Applications Algorithms Distributed Systems Software Engineering C++ Simulations C Software Design Device Drivers Embedded Systems Computer Architecture Object Oriented Design C# High Performance... Cloud Computing Cloud Applications Algorithms Distributed Systems Software Engineering C++ Simulations C Software Design Device Drivers Embedded Systems Computer Architecture Object Oriented Design C# High Performance... Cloud Computing Cloud Applications ", "Summary Javier Lira es Ingeniero Informático con PhD en arquitectura de computadores. Es un Ingeniero de Software experimentado que disfruta con la programación consciente del hardware y con aplicaciones que tengan requerimientos de alto rendimiento. También tiene experiencia en técnicas y metodologías de investigación: propuesta de nuevos diseños o conceptos, su prototipaje, y análisis para discernir el impacto en un sistema en términos tanto de rendimiento, consumo y coste. Entre sus cualidades personales destacan el saber trabajar en equipo, querer aprender constantemente y resolver nuevos retos, ser metódico en su trabajo, y ser una persona que aprende y se adapta muy rápido a nuevas situaciones. \n \nPalabras clave: C++, C, Java, Hw-aware programming, scripting, Python, Linux, innovación, arquitectura de computadores, NUCA, memoria. Summary Javier Lira es Ingeniero Informático con PhD en arquitectura de computadores. Es un Ingeniero de Software experimentado que disfruta con la programación consciente del hardware y con aplicaciones que tengan requerimientos de alto rendimiento. También tiene experiencia en técnicas y metodologías de investigación: propuesta de nuevos diseños o conceptos, su prototipaje, y análisis para discernir el impacto en un sistema en términos tanto de rendimiento, consumo y coste. Entre sus cualidades personales destacan el saber trabajar en equipo, querer aprender constantemente y resolver nuevos retos, ser metódico en su trabajo, y ser una persona que aprende y se adapta muy rápido a nuevas situaciones. \n \nPalabras clave: C++, C, Java, Hw-aware programming, scripting, Python, Linux, innovación, arquitectura de computadores, NUCA, memoria. Javier Lira es Ingeniero Informático con PhD en arquitectura de computadores. Es un Ingeniero de Software experimentado que disfruta con la programación consciente del hardware y con aplicaciones que tengan requerimientos de alto rendimiento. También tiene experiencia en técnicas y metodologías de investigación: propuesta de nuevos diseños o conceptos, su prototipaje, y análisis para discernir el impacto en un sistema en términos tanto de rendimiento, consumo y coste. Entre sus cualidades personales destacan el saber trabajar en equipo, querer aprender constantemente y resolver nuevos retos, ser metódico en su trabajo, y ser una persona que aprende y se adapta muy rápido a nuevas situaciones. \n \nPalabras clave: C++, C, Java, Hw-aware programming, scripting, Python, Linux, innovación, arquitectura de computadores, NUCA, memoria. Javier Lira es Ingeniero Informático con PhD en arquitectura de computadores. Es un Ingeniero de Software experimentado que disfruta con la programación consciente del hardware y con aplicaciones que tengan requerimientos de alto rendimiento. También tiene experiencia en técnicas y metodologías de investigación: propuesta de nuevos diseños o conceptos, su prototipaje, y análisis para discernir el impacto en un sistema en términos tanto de rendimiento, consumo y coste. Entre sus cualidades personales destacan el saber trabajar en equipo, querer aprender constantemente y resolver nuevos retos, ser metódico en su trabajo, y ser una persona que aprende y se adapta muy rápido a nuevas situaciones. \n \nPalabras clave: C++, C, Java, Hw-aware programming, scripting, Python, Linux, innovación, arquitectura de computadores, NUCA, memoria. Experience Senior Software Engineer and Technical Lead Qumram AG October 2014  – Present (11 months) Barcelona Area, Spain Leading architecture definition and development of a high-performance component to capture HTTP requests from web servers and proxy services. Senior Research Scientist Intel Corporation August 2011  –  May 2014  (2 years 10 months) His research in Intel has focused on managing emerging memory technologies and designing heterogeneous architectures on SoC and high-end processors. PhD Candidate Universitat Politècnica de Catalunya January 2008  –  November 2011  (3 years 11 months) Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). Visiting Researcher Harvard University February 2010  –  July 2010  (6 months) Cambridge, MA, USA During my PhD studies, I worked as visiting researcher in the School of Engineering and Applied Sciences of Harvard University, under the supervision of Prof. David Brooks. Software Engineer Hewlett-Packard under contract of Tenea Tecnologías March 2006  –  December 2007  (1 year 10 months) Working for Hewlett-Packard. I worked as Java programmer for an end-to-end printing management application for big retailers. Internship Hewlett-Packard June 2004  –  March 2006  (1 year 10 months) Part-time job. I was developing internal tools for an end-to-end printing management application for big retailers. Senior Software Engineer and Technical Lead Qumram AG October 2014  – Present (11 months) Barcelona Area, Spain Leading architecture definition and development of a high-performance component to capture HTTP requests from web servers and proxy services. Senior Software Engineer and Technical Lead Qumram AG October 2014  – Present (11 months) Barcelona Area, Spain Leading architecture definition and development of a high-performance component to capture HTTP requests from web servers and proxy services. Senior Research Scientist Intel Corporation August 2011  –  May 2014  (2 years 10 months) His research in Intel has focused on managing emerging memory technologies and designing heterogeneous architectures on SoC and high-end processors. Senior Research Scientist Intel Corporation August 2011  –  May 2014  (2 years 10 months) His research in Intel has focused on managing emerging memory technologies and designing heterogeneous architectures on SoC and high-end processors. PhD Candidate Universitat Politècnica de Catalunya January 2008  –  November 2011  (3 years 11 months) Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). PhD Candidate Universitat Politècnica de Catalunya January 2008  –  November 2011  (3 years 11 months) Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). Visiting Researcher Harvard University February 2010  –  July 2010  (6 months) Cambridge, MA, USA During my PhD studies, I worked as visiting researcher in the School of Engineering and Applied Sciences of Harvard University, under the supervision of Prof. David Brooks. Visiting Researcher Harvard University February 2010  –  July 2010  (6 months) Cambridge, MA, USA During my PhD studies, I worked as visiting researcher in the School of Engineering and Applied Sciences of Harvard University, under the supervision of Prof. David Brooks. Software Engineer Hewlett-Packard under contract of Tenea Tecnologías March 2006  –  December 2007  (1 year 10 months) Working for Hewlett-Packard. I worked as Java programmer for an end-to-end printing management application for big retailers. Software Engineer Hewlett-Packard under contract of Tenea Tecnologías March 2006  –  December 2007  (1 year 10 months) Working for Hewlett-Packard. I worked as Java programmer for an end-to-end printing management application for big retailers. Internship Hewlett-Packard June 2004  –  March 2006  (1 year 10 months) Part-time job. I was developing internal tools for an end-to-end printing management application for big retailers. Internship Hewlett-Packard June 2004  –  March 2006  (1 year 10 months) Part-time job. I was developing internal tools for an end-to-end printing management application for big retailers. Languages Español Native or bilingual proficiency Inglés Full professional proficiency Catalán Native or bilingual proficiency Español Native or bilingual proficiency Inglés Full professional proficiency Catalán Native or bilingual proficiency Español Native or bilingual proficiency Inglés Full professional proficiency Catalán Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Computer Architecture Programming Data Analysis Memory Management High Performance... Multithreading Computer Hardware Computer Science Amazon Web Services... Jenkins System Monitoring Nagios Chef Simulation Software Multi-core Cache Coherency Processors Multi-core Programming Parallel Programming See 4+     See less Skills  Computer Architecture Programming Data Analysis Memory Management High Performance... Multithreading Computer Hardware Computer Science Amazon Web Services... Jenkins System Monitoring Nagios Chef Simulation Software Multi-core Cache Coherency Processors Multi-core Programming Parallel Programming See 4+     See less Computer Architecture Programming Data Analysis Memory Management High Performance... Multithreading Computer Hardware Computer Science Amazon Web Services... Jenkins System Monitoring Nagios Chef Simulation Software Multi-core Cache Coherency Processors Multi-core Programming Parallel Programming See 4+     See less Computer Architecture Programming Data Analysis Memory Management High Performance... Multithreading Computer Hardware Computer Science Amazon Web Services... Jenkins System Monitoring Nagios Chef Simulation Software Multi-core Cache Coherency Processors Multi-core Programming Parallel Programming See 4+     See less Education Universitat Politècnica de Catalunya Doctor of Philosophy (PhD),  Computer Architecture , Cum Laude 2008  – 2011 Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). During his PhD, he spent six months in the Harvard University where he worked under the supervision of Prof. David Brooks. Universitat Politècnica de Catalunya Master of Computer Architecture, Networks and Systems,  Computer Architecture 2007  – 2008 Universitat Politècnica de Catalunya Computer Engineer 2001  – 2006 Universitat Politècnica de Catalunya Doctor of Philosophy (PhD),  Computer Architecture , Cum Laude 2008  – 2011 Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). During his PhD, he spent six months in the Harvard University where he worked under the supervision of Prof. David Brooks. Universitat Politècnica de Catalunya Doctor of Philosophy (PhD),  Computer Architecture , Cum Laude 2008  – 2011 Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). During his PhD, he spent six months in the Harvard University where he worked under the supervision of Prof. David Brooks. Universitat Politècnica de Catalunya Doctor of Philosophy (PhD),  Computer Architecture , Cum Laude 2008  – 2011 Javier Lira started his PhD with the ARCO group in January 2008 in the field of memory management for multi-core architectures, focusing on Non-Uniform Cache Architectures (NUCA), under the supervision of Prof. Carlos Molina (URV) and Prof. Antonio González (Intel and UPC). During his PhD, he spent six months in the Harvard University where he worked under the supervision of Prof. David Brooks. Universitat Politècnica de Catalunya Master of Computer Architecture, Networks and Systems,  Computer Architecture 2007  – 2008 Universitat Politècnica de Catalunya Master of Computer Architecture, Networks and Systems,  Computer Architecture 2007  – 2008 Universitat Politècnica de Catalunya Master of Computer Architecture, Networks and Systems,  Computer Architecture 2007  – 2008 Universitat Politècnica de Catalunya Computer Engineer 2001  – 2006 Universitat Politècnica de Catalunya Computer Engineer 2001  – 2006 Universitat Politècnica de Catalunya Computer Engineer 2001  – 2006 Honors & Awards ", "Summary 17+ years of experience in the high tech industry, having worked in the USA, United Kingdom, and Spain. \n7+ years experience building cloud computing environments from the ground up. \nExperienced in digging through large datasets and working in Big Data environments. \nAmerican citizen authorized to work in the USA and Europe. \n Summary 17+ years of experience in the high tech industry, having worked in the USA, United Kingdom, and Spain. \n7+ years experience building cloud computing environments from the ground up. \nExperienced in digging through large datasets and working in Big Data environments. \nAmerican citizen authorized to work in the USA and Europe. \n 17+ years of experience in the high tech industry, having worked in the USA, United Kingdom, and Spain. \n7+ years experience building cloud computing environments from the ground up. \nExperienced in digging through large datasets and working in Big Data environments. \nAmerican citizen authorized to work in the USA and Europe. \n 17+ years of experience in the high tech industry, having worked in the USA, United Kingdom, and Spain. \n7+ years experience building cloud computing environments from the ground up. \nExperienced in digging through large datasets and working in Big Data environments. \nAmerican citizen authorized to work in the USA and Europe. \n Experience CTO Knox Media Hub, SL June 2015  – Present (3 months) Barcelona Area, Spain Co-founder and CTO InsightSplash Limited August 2013  – Present (2 years 1 month) Barcelona Area, Spain Bootstrapped a new business focusing on customer feedback capture and insight generation for the hospitality industry.  \n \nArchitected and implemented a fully scalable backend management system in the cloud.  \n \nDesigned and implemented Android application for guest facing feedback system \n \nDeveloped critical component that captures all user interactions with tablets as well as reports essential diagnostic information crucial for improving the capabilities of the product.  \n \nBuilt client side data analytics packages capable of identifying key insights to guest behavior as well as service quality monitoring, allowing the client to understand in real-time possible problem areas within their premises.  \n \nBuilt client requested Video Help Desk (VHD) solution allowing guests to make a one-way video call to the front desk. Innovation Lead Telefónica Digital January 2013  –  August 2013  (8 months) Barcelona Area, Spain Telefonica data are a vast pool of potential knowledge that currently is not exploiting to its full potential. Many issues remain unsolved about how to create new technologies and services around this resource. Fundamental to this problem is gaining the trust of the operating business’ to grant access to the data, understand how we use this data with regard to privacy,and delivering this data in a secure, anonymous, and reliable manner.  \n \nLed the innovation product proposal, definition, and implementation of this fundamental system component. The idea is to provide a data spigot where any innovator \nin the company can gain access to any data that we can collect, allowing them to see \nwhat data we have to spark ideas for new products and services. In addition to visibility of the \nsources, the system allows for easy requisition of data while providing a mechanism for data owners and operating businesses to maintain control over what data is being accessed, by who, and for what \nperiod of time. Once all the proper requests have been granted, the system is responsible of \nthe delivery of the data in a secure, anonymous, and continuous way directly from the source to the innovator or an actively running service. Senior Technology Expert, Area Technical Leader - User Modelling Telefonica Digital April 2011  –  December 2012  (1 year 9 months) Barcelona Area, Spain Area technical leader for the user modelling area within Telefonica Digitial focusing on BigData architecture and strategy. Responsible for all technical decisions of the area which consisted of 7 different products groups and around 80 engineers \n \nLead the design and build-out of the Big Data architecture solution for the mobile \nvirtual network operator (MVNO), giffgaff \n \nBuilt prototype architecture allowing business units to understand potential of using Big Data analytics with their products  \n \nInvolved at the inception of the O2 as an information company initiative that \nwished to create a fast innovation pipeline for new products and services. Proposed \nthe initial end-to-end architecture that would be used to handle the demands of this initiative, \ncreated the first isolated BigData testbed in Barcelona where the analytics team proved their \nalgorithms, and worked with the teams to meet the aggressive deadlines for the project. \n \nDesigned and built a shared private cloud architecture for Big Data processing Senior Research Engineer Intel Labs Pittsburgh December 2006  –  March 2011  (4 years 4 months) Greater Pittsburgh Area Senior research engineer working on a variety of research problems in the areas of computer networking, opportunistic communications, computer vision, BigData and cloud computing. Started Intel career in Cambridge, UK (June 2004 - December 2006) and was lastly based in Pittsburgh, PA., spending a small amount of time working out of the Berkeley, CA lab. Responsibilities spanned BigData architecture design and processing, development, project management, purchasing, and also highly visible technology transfers within Intel and external entities. While working full time at Intel, managed to finish the requirements of a Ph.D. in computer science showing extreme dedication, determination, and discipline.  \n \nActed as an ambassador to Intel’s efforts in the cloud computing and BigData research \ndomain since 2007 and is an active member of the Open Cirrus cloud computing initiative. This \ninitiative brought together a community of 12 institutions in the design and implementation of \nan open source software stack for large scale data centers. Led the development effort on Intel’s side and also closely collaborated with Open Cirrus members from Yahoo, HP Labs, MIMOS (Malaysia), ETRI (Korea), and Georgia Institute of Technology. Presented multiple talks and tutorials at leading universities, high profile conferences in the area (e.g., Supercomputing 2010), and organizations within Intel corporation. \n \nEarned four divisional recognition awards for excellence in the execution of the following initiatives: BigData and cloud computing research, melanoma detection and interactive search of medical repositories, and next generation network services. \n \nWhile in Pittsburgh, architected, built and managed the 1500+ core Open Cirrus Cloud Computing Research Platform with a particular focus on creating an infrastructure management system to dynamically provision and allocate physical nodes on demand. Currently have built BigData and cloud infrastructures on three continents. Senior Research Engineer Intel Corporation July 2004  –  March 2011  (6 years 9 months) Senior Research Engineer Intel Research Cambridge June 2004  –  December 2006  (2 years 7 months) Cambridge, United Kingdom Principal Member of Technical Staff Sprint June 2001  –  June 2004  (3 years 1 month) San Francisco Bay Area Lead engineer supporting the activities for the IP & Security research group.  \n \nDeployed a 40+ node data cluster (large for that time) for the collection, archival, and processing of all data collected from the Sprint operational backbone network.  \n \nDeployed and managed the backbone wide monitoring system for Sprint's operational IP network (IPMon). This platform consisted of nodes equipped with specialized network interface cards capable of monitoring links with speeds ranging from OC-3 to OC-192.  \n \nDeveloped a number of tools that were transferred to Sprint’s network operations group. Systems and Network Administrator Taos September 2000  –  June 2001  (10 months) San Francisco Bay Area Contractor NetSuite October 2000  –  May 2001  (8 months) San Francisco Bay Area CTO Knox Media Hub, SL June 2015  – Present (3 months) Barcelona Area, Spain CTO Knox Media Hub, SL June 2015  – Present (3 months) Barcelona Area, Spain Co-founder and CTO InsightSplash Limited August 2013  – Present (2 years 1 month) Barcelona Area, Spain Bootstrapped a new business focusing on customer feedback capture and insight generation for the hospitality industry.  \n \nArchitected and implemented a fully scalable backend management system in the cloud.  \n \nDesigned and implemented Android application for guest facing feedback system \n \nDeveloped critical component that captures all user interactions with tablets as well as reports essential diagnostic information crucial for improving the capabilities of the product.  \n \nBuilt client side data analytics packages capable of identifying key insights to guest behavior as well as service quality monitoring, allowing the client to understand in real-time possible problem areas within their premises.  \n \nBuilt client requested Video Help Desk (VHD) solution allowing guests to make a one-way video call to the front desk. Co-founder and CTO InsightSplash Limited August 2013  – Present (2 years 1 month) Barcelona Area, Spain Bootstrapped a new business focusing on customer feedback capture and insight generation for the hospitality industry.  \n \nArchitected and implemented a fully scalable backend management system in the cloud.  \n \nDesigned and implemented Android application for guest facing feedback system \n \nDeveloped critical component that captures all user interactions with tablets as well as reports essential diagnostic information crucial for improving the capabilities of the product.  \n \nBuilt client side data analytics packages capable of identifying key insights to guest behavior as well as service quality monitoring, allowing the client to understand in real-time possible problem areas within their premises.  \n \nBuilt client requested Video Help Desk (VHD) solution allowing guests to make a one-way video call to the front desk. Innovation Lead Telefónica Digital January 2013  –  August 2013  (8 months) Barcelona Area, Spain Telefonica data are a vast pool of potential knowledge that currently is not exploiting to its full potential. Many issues remain unsolved about how to create new technologies and services around this resource. Fundamental to this problem is gaining the trust of the operating business’ to grant access to the data, understand how we use this data with regard to privacy,and delivering this data in a secure, anonymous, and reliable manner.  \n \nLed the innovation product proposal, definition, and implementation of this fundamental system component. The idea is to provide a data spigot where any innovator \nin the company can gain access to any data that we can collect, allowing them to see \nwhat data we have to spark ideas for new products and services. In addition to visibility of the \nsources, the system allows for easy requisition of data while providing a mechanism for data owners and operating businesses to maintain control over what data is being accessed, by who, and for what \nperiod of time. Once all the proper requests have been granted, the system is responsible of \nthe delivery of the data in a secure, anonymous, and continuous way directly from the source to the innovator or an actively running service. Innovation Lead Telefónica Digital January 2013  –  August 2013  (8 months) Barcelona Area, Spain Telefonica data are a vast pool of potential knowledge that currently is not exploiting to its full potential. Many issues remain unsolved about how to create new technologies and services around this resource. Fundamental to this problem is gaining the trust of the operating business’ to grant access to the data, understand how we use this data with regard to privacy,and delivering this data in a secure, anonymous, and reliable manner.  \n \nLed the innovation product proposal, definition, and implementation of this fundamental system component. The idea is to provide a data spigot where any innovator \nin the company can gain access to any data that we can collect, allowing them to see \nwhat data we have to spark ideas for new products and services. In addition to visibility of the \nsources, the system allows for easy requisition of data while providing a mechanism for data owners and operating businesses to maintain control over what data is being accessed, by who, and for what \nperiod of time. Once all the proper requests have been granted, the system is responsible of \nthe delivery of the data in a secure, anonymous, and continuous way directly from the source to the innovator or an actively running service. Senior Technology Expert, Area Technical Leader - User Modelling Telefonica Digital April 2011  –  December 2012  (1 year 9 months) Barcelona Area, Spain Area technical leader for the user modelling area within Telefonica Digitial focusing on BigData architecture and strategy. Responsible for all technical decisions of the area which consisted of 7 different products groups and around 80 engineers \n \nLead the design and build-out of the Big Data architecture solution for the mobile \nvirtual network operator (MVNO), giffgaff \n \nBuilt prototype architecture allowing business units to understand potential of using Big Data analytics with their products  \n \nInvolved at the inception of the O2 as an information company initiative that \nwished to create a fast innovation pipeline for new products and services. Proposed \nthe initial end-to-end architecture that would be used to handle the demands of this initiative, \ncreated the first isolated BigData testbed in Barcelona where the analytics team proved their \nalgorithms, and worked with the teams to meet the aggressive deadlines for the project. \n \nDesigned and built a shared private cloud architecture for Big Data processing Senior Technology Expert, Area Technical Leader - User Modelling Telefonica Digital April 2011  –  December 2012  (1 year 9 months) Barcelona Area, Spain Area technical leader for the user modelling area within Telefonica Digitial focusing on BigData architecture and strategy. Responsible for all technical decisions of the area which consisted of 7 different products groups and around 80 engineers \n \nLead the design and build-out of the Big Data architecture solution for the mobile \nvirtual network operator (MVNO), giffgaff \n \nBuilt prototype architecture allowing business units to understand potential of using Big Data analytics with their products  \n \nInvolved at the inception of the O2 as an information company initiative that \nwished to create a fast innovation pipeline for new products and services. Proposed \nthe initial end-to-end architecture that would be used to handle the demands of this initiative, \ncreated the first isolated BigData testbed in Barcelona where the analytics team proved their \nalgorithms, and worked with the teams to meet the aggressive deadlines for the project. \n \nDesigned and built a shared private cloud architecture for Big Data processing Senior Research Engineer Intel Labs Pittsburgh December 2006  –  March 2011  (4 years 4 months) Greater Pittsburgh Area Senior research engineer working on a variety of research problems in the areas of computer networking, opportunistic communications, computer vision, BigData and cloud computing. Started Intel career in Cambridge, UK (June 2004 - December 2006) and was lastly based in Pittsburgh, PA., spending a small amount of time working out of the Berkeley, CA lab. Responsibilities spanned BigData architecture design and processing, development, project management, purchasing, and also highly visible technology transfers within Intel and external entities. While working full time at Intel, managed to finish the requirements of a Ph.D. in computer science showing extreme dedication, determination, and discipline.  \n \nActed as an ambassador to Intel’s efforts in the cloud computing and BigData research \ndomain since 2007 and is an active member of the Open Cirrus cloud computing initiative. This \ninitiative brought together a community of 12 institutions in the design and implementation of \nan open source software stack for large scale data centers. Led the development effort on Intel’s side and also closely collaborated with Open Cirrus members from Yahoo, HP Labs, MIMOS (Malaysia), ETRI (Korea), and Georgia Institute of Technology. Presented multiple talks and tutorials at leading universities, high profile conferences in the area (e.g., Supercomputing 2010), and organizations within Intel corporation. \n \nEarned four divisional recognition awards for excellence in the execution of the following initiatives: BigData and cloud computing research, melanoma detection and interactive search of medical repositories, and next generation network services. \n \nWhile in Pittsburgh, architected, built and managed the 1500+ core Open Cirrus Cloud Computing Research Platform with a particular focus on creating an infrastructure management system to dynamically provision and allocate physical nodes on demand. Currently have built BigData and cloud infrastructures on three continents. Senior Research Engineer Intel Labs Pittsburgh December 2006  –  March 2011  (4 years 4 months) Greater Pittsburgh Area Senior research engineer working on a variety of research problems in the areas of computer networking, opportunistic communications, computer vision, BigData and cloud computing. Started Intel career in Cambridge, UK (June 2004 - December 2006) and was lastly based in Pittsburgh, PA., spending a small amount of time working out of the Berkeley, CA lab. Responsibilities spanned BigData architecture design and processing, development, project management, purchasing, and also highly visible technology transfers within Intel and external entities. While working full time at Intel, managed to finish the requirements of a Ph.D. in computer science showing extreme dedication, determination, and discipline.  \n \nActed as an ambassador to Intel’s efforts in the cloud computing and BigData research \ndomain since 2007 and is an active member of the Open Cirrus cloud computing initiative. This \ninitiative brought together a community of 12 institutions in the design and implementation of \nan open source software stack for large scale data centers. Led the development effort on Intel’s side and also closely collaborated with Open Cirrus members from Yahoo, HP Labs, MIMOS (Malaysia), ETRI (Korea), and Georgia Institute of Technology. Presented multiple talks and tutorials at leading universities, high profile conferences in the area (e.g., Supercomputing 2010), and organizations within Intel corporation. \n \nEarned four divisional recognition awards for excellence in the execution of the following initiatives: BigData and cloud computing research, melanoma detection and interactive search of medical repositories, and next generation network services. \n \nWhile in Pittsburgh, architected, built and managed the 1500+ core Open Cirrus Cloud Computing Research Platform with a particular focus on creating an infrastructure management system to dynamically provision and allocate physical nodes on demand. Currently have built BigData and cloud infrastructures on three continents. Senior Research Engineer Intel Corporation July 2004  –  March 2011  (6 years 9 months) Senior Research Engineer Intel Corporation July 2004  –  March 2011  (6 years 9 months) Senior Research Engineer Intel Research Cambridge June 2004  –  December 2006  (2 years 7 months) Cambridge, United Kingdom Senior Research Engineer Intel Research Cambridge June 2004  –  December 2006  (2 years 7 months) Cambridge, United Kingdom Principal Member of Technical Staff Sprint June 2001  –  June 2004  (3 years 1 month) San Francisco Bay Area Lead engineer supporting the activities for the IP & Security research group.  \n \nDeployed a 40+ node data cluster (large for that time) for the collection, archival, and processing of all data collected from the Sprint operational backbone network.  \n \nDeployed and managed the backbone wide monitoring system for Sprint's operational IP network (IPMon). This platform consisted of nodes equipped with specialized network interface cards capable of monitoring links with speeds ranging from OC-3 to OC-192.  \n \nDeveloped a number of tools that were transferred to Sprint’s network operations group. Principal Member of Technical Staff Sprint June 2001  –  June 2004  (3 years 1 month) San Francisco Bay Area Lead engineer supporting the activities for the IP & Security research group.  \n \nDeployed a 40+ node data cluster (large for that time) for the collection, archival, and processing of all data collected from the Sprint operational backbone network.  \n \nDeployed and managed the backbone wide monitoring system for Sprint's operational IP network (IPMon). This platform consisted of nodes equipped with specialized network interface cards capable of monitoring links with speeds ranging from OC-3 to OC-192.  \n \nDeveloped a number of tools that were transferred to Sprint’s network operations group. Systems and Network Administrator Taos September 2000  –  June 2001  (10 months) San Francisco Bay Area Systems and Network Administrator Taos September 2000  –  June 2001  (10 months) San Francisco Bay Area Contractor NetSuite October 2000  –  May 2001  (8 months) San Francisco Bay Area Contractor NetSuite October 2000  –  May 2001  (8 months) San Francisco Bay Area Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Cloud Computing System Architecture Virtualization Linux Hadoop Python IP High Performance... Networking Programming C Network Architecture Bash Software Development Entrepreneurship Architectures MongoDB System Administration Perl Scalability Datacenter... OS Virtualization Network Engineering Unix Shell Scripting Storage Area Networks Storage Virtualization Data Warehousing Software Engineering Private Cloud Network Design Wireless Networking Research Hardware Architecture Linux KVM Amazon Web Services... Network Administration System Design Hardware Virtualization Amazon Cloud Hive Data Center QEMU Unix Operating Systems innovation Android Development Architecture Business Innovation Unix See 33+     See less Skills  Cloud Computing System Architecture Virtualization Linux Hadoop Python IP High Performance... Networking Programming C Network Architecture Bash Software Development Entrepreneurship Architectures MongoDB System Administration Perl Scalability Datacenter... OS Virtualization Network Engineering Unix Shell Scripting Storage Area Networks Storage Virtualization Data Warehousing Software Engineering Private Cloud Network Design Wireless Networking Research Hardware Architecture Linux KVM Amazon Web Services... Network Administration System Design Hardware Virtualization Amazon Cloud Hive Data Center QEMU Unix Operating Systems innovation Android Development Architecture Business Innovation Unix See 33+     See less Cloud Computing System Architecture Virtualization Linux Hadoop Python IP High Performance... Networking Programming C Network Architecture Bash Software Development Entrepreneurship Architectures MongoDB System Administration Perl Scalability Datacenter... OS Virtualization Network Engineering Unix Shell Scripting Storage Area Networks Storage Virtualization Data Warehousing Software Engineering Private Cloud Network Design Wireless Networking Research Hardware Architecture Linux KVM Amazon Web Services... Network Administration System Design Hardware Virtualization Amazon Cloud Hive Data Center QEMU Unix Operating Systems innovation Android Development Architecture Business Innovation Unix See 33+     See less Cloud Computing System Architecture Virtualization Linux Hadoop Python IP High Performance... Networking Programming C Network Architecture Bash Software Development Entrepreneurship Architectures MongoDB System Administration Perl Scalability Datacenter... OS Virtualization Network Engineering Unix Shell Scripting Storage Area Networks Storage Virtualization Data Warehousing Software Engineering Private Cloud Network Design Wireless Networking Research Hardware Architecture Linux KVM Amazon Web Services... Network Administration System Design Hardware Virtualization Amazon Cloud Hive Data Center QEMU Unix Operating Systems innovation Android Development Architecture Business Innovation Unix See 33+     See less Education Université Pierre et Marie Curie (Paris VI) PhD,  Computer Science 2004  – 2010 Southern Illinois University MS,  Computer Science August 1998  – August 2000 Southern Illinois University BS,  Electronics Management August 1996  – May 1998 Illinois Valley Community College AAS,  Electronics Technology 1994  – 1996 Activities and Societies:  Student ambassador Université Pierre et Marie Curie (Paris VI) PhD,  Computer Science 2004  – 2010 Université Pierre et Marie Curie (Paris VI) PhD,  Computer Science 2004  – 2010 Université Pierre et Marie Curie (Paris VI) PhD,  Computer Science 2004  – 2010 Southern Illinois University MS,  Computer Science August 1998  – August 2000 Southern Illinois University MS,  Computer Science August 1998  – August 2000 Southern Illinois University MS,  Computer Science August 1998  – August 2000 Southern Illinois University BS,  Electronics Management August 1996  – May 1998 Southern Illinois University BS,  Electronics Management August 1996  – May 1998 Southern Illinois University BS,  Electronics Management August 1996  – May 1998 Illinois Valley Community College AAS,  Electronics Technology 1994  – 1996 Activities and Societies:  Student ambassador Illinois Valley Community College AAS,  Electronics Technology 1994  – 1996 Activities and Societies:  Student ambassador Illinois Valley Community College AAS,  Electronics Technology 1994  – 1996 Activities and Societies:  Student ambassador Honors & Awards Additional Honors & Awards Lab Recognition Awards (2) \nDivisional Recognition Awards (4) \n* Intel Labs Divisional Recognition Award 2009: Building the infrastructure for the Open Cirrus cloud computing research testbed \n* Intel Research Divisional Recognition Award 2008: Cross organizational teamwork in porting the DermFind application to a new Intel medical tablet and presenting to vendors \n* Intel Research Divisional Recognition Award 2007: Creating the DermFind application and integrating in the clinical work-flow of dermatologist at the University of Pittsburgh Medical \nCenter \n* Intel Research Divisional Recognition Award 2006: Bringing a radical architecture to reality in less than 3 months Additional Honors & Awards Lab Recognition Awards (2) \nDivisional Recognition Awards (4) \n* Intel Labs Divisional Recognition Award 2009: Building the infrastructure for the Open Cirrus cloud computing research testbed \n* Intel Research Divisional Recognition Award 2008: Cross organizational teamwork in porting the DermFind application to a new Intel medical tablet and presenting to vendors \n* Intel Research Divisional Recognition Award 2007: Creating the DermFind application and integrating in the clinical work-flow of dermatologist at the University of Pittsburgh Medical \nCenter \n* Intel Research Divisional Recognition Award 2006: Bringing a radical architecture to reality in less than 3 months Additional Honors & Awards Lab Recognition Awards (2) \nDivisional Recognition Awards (4) \n* Intel Labs Divisional Recognition Award 2009: Building the infrastructure for the Open Cirrus cloud computing research testbed \n* Intel Research Divisional Recognition Award 2008: Cross organizational teamwork in porting the DermFind application to a new Intel medical tablet and presenting to vendors \n* Intel Research Divisional Recognition Award 2007: Creating the DermFind application and integrating in the clinical work-flow of dermatologist at the University of Pittsburgh Medical \nCenter \n* Intel Research Divisional Recognition Award 2006: Bringing a radical architecture to reality in less than 3 months Additional Honors & Awards Lab Recognition Awards (2) \nDivisional Recognition Awards (4) \n* Intel Labs Divisional Recognition Award 2009: Building the infrastructure for the Open Cirrus cloud computing research testbed \n* Intel Research Divisional Recognition Award 2008: Cross organizational teamwork in porting the DermFind application to a new Intel medical tablet and presenting to vendors \n* Intel Research Divisional Recognition Award 2007: Creating the DermFind application and integrating in the clinical work-flow of dermatologist at the University of Pittsburgh Medical \nCenter \n* Intel Research Divisional Recognition Award 2006: Bringing a radical architecture to reality in less than 3 months "]}