{"position": "Senior Analog Design Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Analog Design Engineer Intel Corporation July 2006  – Present (9 years 2 months) Bangalore Worked on Voltage Regulators, Clock Distribution Circuits , Memories and currently working on High Speed Serial Interfaces Senior Analog Design Engineer Intel Corporation July 2006  – Present (9 years 2 months) Bangalore Worked on Voltage Regulators, Clock Distribution Circuits , Memories and currently working on High Speed Serial Interfaces Senior Analog Design Engineer Intel Corporation July 2006  – Present (9 years 2 months) Bangalore Worked on Voltage Regulators, Clock Distribution Circuits , Memories and currently working on High Speed Serial Interfaces ", "Experience Senior Analog Design Engineer Intel Corporation April 2011  – Present (4 years 5 months) Folsom, ca Design lead for high performance low power Digital PLL development. Senior Engineer Oracle America, Inc November 2000  –  March 2011  (10 years 5 months) 14+ of Industry experience  \n• Worked on several successful projects under aggressive schedules with high quality deliverables. \n•Excellent verbal and written communication skills. \n•Strong technical and presentation skills.  \n•Strong background in low jitter PLL design, phase noise analysis, high speed IO design including circuit design, system level simulations, floorplanning and integration. \n•Successfully worked across several teams to successfully complete several projects \n \nSpecialties: \n \nVery Low jitter, wide tuning range PLL design and validation, phase noise and jitter analysis, High speed clock distribution, High speed serdes IO design and system level simulations Senior Engineer LSI Logic January 2000  –  November 2000  (11 months) • Worked on High speed IO interface Lead Design Engineer Spike Technologies August 1997  –  January 2000  (2 years 6 months) • Worked on several IO design projects  \n• Designed and implemented a memory compiler from scratch \n• Worked on several library developement projects Senior Engineer Temic Usha April 1995  –  August 1997  (2 years 5 months) • Lead a team of engineers to develope new library of CMOS cells. Senior Analog Design Engineer Intel Corporation April 2011  – Present (4 years 5 months) Folsom, ca Design lead for high performance low power Digital PLL development. Senior Analog Design Engineer Intel Corporation April 2011  – Present (4 years 5 months) Folsom, ca Design lead for high performance low power Digital PLL development. Senior Engineer Oracle America, Inc November 2000  –  March 2011  (10 years 5 months) 14+ of Industry experience  \n• Worked on several successful projects under aggressive schedules with high quality deliverables. \n•Excellent verbal and written communication skills. \n•Strong technical and presentation skills.  \n•Strong background in low jitter PLL design, phase noise analysis, high speed IO design including circuit design, system level simulations, floorplanning and integration. \n•Successfully worked across several teams to successfully complete several projects \n \nSpecialties: \n \nVery Low jitter, wide tuning range PLL design and validation, phase noise and jitter analysis, High speed clock distribution, High speed serdes IO design and system level simulations Senior Engineer Oracle America, Inc November 2000  –  March 2011  (10 years 5 months) 14+ of Industry experience  \n• Worked on several successful projects under aggressive schedules with high quality deliverables. \n•Excellent verbal and written communication skills. \n•Strong technical and presentation skills.  \n•Strong background in low jitter PLL design, phase noise analysis, high speed IO design including circuit design, system level simulations, floorplanning and integration. \n•Successfully worked across several teams to successfully complete several projects \n \nSpecialties: \n \nVery Low jitter, wide tuning range PLL design and validation, phase noise and jitter analysis, High speed clock distribution, High speed serdes IO design and system level simulations Senior Engineer LSI Logic January 2000  –  November 2000  (11 months) • Worked on High speed IO interface Senior Engineer LSI Logic January 2000  –  November 2000  (11 months) • Worked on High speed IO interface Lead Design Engineer Spike Technologies August 1997  –  January 2000  (2 years 6 months) • Worked on several IO design projects  \n• Designed and implemented a memory compiler from scratch \n• Worked on several library developement projects Lead Design Engineer Spike Technologies August 1997  –  January 2000  (2 years 6 months) • Worked on several IO design projects  \n• Designed and implemented a memory compiler from scratch \n• Worked on several library developement projects Senior Engineer Temic Usha April 1995  –  August 1997  (2 years 5 months) • Lead a team of engineers to develope new library of CMOS cells. Senior Engineer Temic Usha April 1995  –  August 1997  (2 years 5 months) • Lead a team of engineers to develope new library of CMOS cells. Skills Circuit Design PLL Floorplanning CMOS SERDES Simulations ASIC Skills  Circuit Design PLL Floorplanning CMOS SERDES Simulations ASIC Circuit Design PLL Floorplanning CMOS SERDES Simulations ASIC Circuit Design PLL Floorplanning CMOS SERDES Simulations ASIC Education Indian Institute of Technology, Bombay MTech,  Microelectronics 1993  – 1995 Indian Institute of Technology, Kanpur Masters,  Physics 1990  – 1992 Indian Institute of Technology, Bombay MTech,  Microelectronics 1993  – 1995 Indian Institute of Technology, Bombay MTech,  Microelectronics 1993  – 1995 Indian Institute of Technology, Bombay MTech,  Microelectronics 1993  – 1995 Indian Institute of Technology, Kanpur Masters,  Physics 1990  – 1992 Indian Institute of Technology, Kanpur Masters,  Physics 1990  – 1992 Indian Institute of Technology, Kanpur Masters,  Physics 1990  – 1992 ", "Summary Over 18 years of hands-on experience in digital and analog silicon design. Proficient in vertical design from architecture definition, through pre-silicon execution to post-silicon validation. Vast experience in bringing innovative designs to fruition using test chip vehicles as prototypes. Quick turnaround to make prototypes into HVM compliant products. Significant knowledge in fabrication technology while working on leading edge process nodes (including fin-FET). \n- designed various special circuits like low power LCPLL, spread spectrum unit, HDMI 1.3 compliant PHY, Audio ADC and Video DAC, high speed serial IOs for comm PHYs. \n- part of a select group of technical leaders in a big organization. \n- skilled in hiring, mentoring and managing efficient execution teams. \n- strong oral and written communication skills \n- significant experience with platform bring up for reference design boards and customer boards. \n- skilled in program management across different geo locations Summary Over 18 years of hands-on experience in digital and analog silicon design. Proficient in vertical design from architecture definition, through pre-silicon execution to post-silicon validation. Vast experience in bringing innovative designs to fruition using test chip vehicles as prototypes. Quick turnaround to make prototypes into HVM compliant products. Significant knowledge in fabrication technology while working on leading edge process nodes (including fin-FET). \n- designed various special circuits like low power LCPLL, spread spectrum unit, HDMI 1.3 compliant PHY, Audio ADC and Video DAC, high speed serial IOs for comm PHYs. \n- part of a select group of technical leaders in a big organization. \n- skilled in hiring, mentoring and managing efficient execution teams. \n- strong oral and written communication skills \n- significant experience with platform bring up for reference design boards and customer boards. \n- skilled in program management across different geo locations Over 18 years of hands-on experience in digital and analog silicon design. Proficient in vertical design from architecture definition, through pre-silicon execution to post-silicon validation. Vast experience in bringing innovative designs to fruition using test chip vehicles as prototypes. Quick turnaround to make prototypes into HVM compliant products. Significant knowledge in fabrication technology while working on leading edge process nodes (including fin-FET). \n- designed various special circuits like low power LCPLL, spread spectrum unit, HDMI 1.3 compliant PHY, Audio ADC and Video DAC, high speed serial IOs for comm PHYs. \n- part of a select group of technical leaders in a big organization. \n- skilled in hiring, mentoring and managing efficient execution teams. \n- strong oral and written communication skills \n- significant experience with platform bring up for reference design boards and customer boards. \n- skilled in program management across different geo locations Over 18 years of hands-on experience in digital and analog silicon design. Proficient in vertical design from architecture definition, through pre-silicon execution to post-silicon validation. Vast experience in bringing innovative designs to fruition using test chip vehicles as prototypes. Quick turnaround to make prototypes into HVM compliant products. Significant knowledge in fabrication technology while working on leading edge process nodes (including fin-FET). \n- designed various special circuits like low power LCPLL, spread spectrum unit, HDMI 1.3 compliant PHY, Audio ADC and Video DAC, high speed serial IOs for comm PHYs. \n- part of a select group of technical leaders in a big organization. \n- skilled in hiring, mentoring and managing efficient execution teams. \n- strong oral and written communication skills \n- significant experience with platform bring up for reference design boards and customer boards. \n- skilled in program management across different geo locations Skills Debugging Mixed Signal SoC VLSI Integrated Circuit... ASIC Testing Analog Semiconductors Simulations PCB design Team Leadership Integration Circuit Design Analog Circuit Design Microprocessors PCB Design See 2+     See less Skills  Debugging Mixed Signal SoC VLSI Integrated Circuit... ASIC Testing Analog Semiconductors Simulations PCB design Team Leadership Integration Circuit Design Analog Circuit Design Microprocessors PCB Design See 2+     See less Debugging Mixed Signal SoC VLSI Integrated Circuit... ASIC Testing Analog Semiconductors Simulations PCB design Team Leadership Integration Circuit Design Analog Circuit Design Microprocessors PCB Design See 2+     See less Debugging Mixed Signal SoC VLSI Integrated Circuit... ASIC Testing Analog Semiconductors Simulations PCB design Team Leadership Integration Circuit Design Analog Circuit Design Microprocessors PCB Design See 2+     See less ", "Summary Experienced hardware design engineer with successful track record in product release of Intel yearly cadence of platform development \n•\tStorage IO specialist in SATA and eMMC including cable and connector development with successful enabling of many industry leading product  \n•\tPackage development lead for PCH with yearly cadence of product release with increasing complexity \n•\tSeven years in team management; leading and developing a productive and motivated team \n•\tRF design and power converter experience combined for eleven years with successful design and development of burn in system and seamless product introduction \n Summary Experienced hardware design engineer with successful track record in product release of Intel yearly cadence of platform development \n•\tStorage IO specialist in SATA and eMMC including cable and connector development with successful enabling of many industry leading product  \n•\tPackage development lead for PCH with yearly cadence of product release with increasing complexity \n•\tSeven years in team management; leading and developing a productive and motivated team \n•\tRF design and power converter experience combined for eleven years with successful design and development of burn in system and seamless product introduction \n Experienced hardware design engineer with successful track record in product release of Intel yearly cadence of platform development \n•\tStorage IO specialist in SATA and eMMC including cable and connector development with successful enabling of many industry leading product  \n•\tPackage development lead for PCH with yearly cadence of product release with increasing complexity \n•\tSeven years in team management; leading and developing a productive and motivated team \n•\tRF design and power converter experience combined for eleven years with successful design and development of burn in system and seamless product introduction \n Experienced hardware design engineer with successful track record in product release of Intel yearly cadence of platform development \n•\tStorage IO specialist in SATA and eMMC including cable and connector development with successful enabling of many industry leading product  \n•\tPackage development lead for PCH with yearly cadence of product release with increasing complexity \n•\tSeven years in team management; leading and developing a productive and motivated team \n•\tRF design and power converter experience combined for eleven years with successful design and development of burn in system and seamless product introduction \n Experience Staff Analog Hardware Design Engineer Intel January 2008  –  July 2015  (7 years 7 months) Penang Lead Platform Signal Integrity team for Intel PCH (Platform Controller Hub) chipset, responsible for overall execution of Intel annual chipset offering of package and platform development \n•\tStorage IO Specialist in Serial ATA (SATA), SATA Express, eMMC, and SD Card  \nEnabling industry first SATA 6Gb/s platform IO development from board design to full chip to chip solutions including redriver and docking topology \nSATA dual stack connector development and electrical specification definition  \nPlatform design correlation for SATA platform to confirm tools and platform design reliability, first Intel SI to EV correlation for SATA 6Gb/s IO \nElectrical qualification team lead for SATA for qualification decision with extensive statistical analysis \nFirst platform enabler of eMMC 5.0 HS400 on small core products with SI/PI (Signal Integrity)/(Power Integrity) circuit level co-simulation environment \nPassive (VNA & TDR) and active (full power-on & real time oscilloscope) electrical validation and characterization for SATA IO \n•\tCable and connector solution for IVCAM camera module and platform SI development; part of Intel Real Sense 3D depth camera enabling team \n•\tPath finding and early engagement for Intel 2nd Level Memory development and Fast Memory IO SI owner (DDR4 based) \n•\tIntel Electrical Margining Tool (Intel EMT) Engineering lead  \nIEMT is Target based margining tool for customer early validation stage \nArchitect of EMT engineering requirement and specification; in-depth knowledge of AHCI controller workings and SATA IO protocol \nTool qualification based on device and platform testing especially for HDD, SSD and PCIe Gen 3 devices \nCollaborate with drive industry vendors in tool improvement and SSD/HDD device qualification \n•\tLead the planning and running of Intel Asia Electrical Summit 2012 as as conference chair with successful 250-attendees-conference with 25 technical leaders across Asia and US \n SI Design Manager Intel Corporation June 2010  –  June 2012  (2 years 1 month) Penang, Malaysia SI Design Manager (2010-2012) & Package SI/PI Team Manager  \n•\tLed electrical design team for Intel board and customer design enabling \n•\tPerformance management and technical development of SI team \n Package SI/PI Team Design Manager Intel Corporation December 2005  –  December 2007  (2 years 1 month) Penang, Malaysia Lead/Manage package signal integrity and power integrity \nPerformance management and personal development package SI and PI team Senior Analog Design Engineer Intel Corporation January 2004  –  December 2005  (2 years) Penang, Malaysia Package electrical design requirement and electrical analysis for package feasibility \nPackage electrical modeling for early generation PCHs \nPlatform power integrity analysis for package design study and path finding \n Design Engineer/Expert Agilent Technologies August 2001  –  December 2003  (2 years 5 months) Lead the product transfer team for Storage Area Network (SAN) tester  \n•\tRun product qualification in area physical packaging, reliability, EMC testing for SAN tester module resulting in successful launch at contract manufacturer \n•\tSix months relocation to Colorado Springs, USA for co-development \nParticipated in design team for oscilloscope product accessories and component of electrical module. Responsible for hardware design of \n•\tHigh impedance probe http://www.keysight.com/en/pd-269279-pn-E2697A/high-impedance-adapter-includes-500-mhz-passive-probe?cc=MY&lc=eng \n•\tLow end oscilloscope graphics card (partial) \n \n Senior Product Engineer Astec March 2001  –  July 2001  (5 months) Penang, Malaysia Lead product engineering team in switched mode power supply products, monitoring boards and RF boards products for telecommunication Assistant Manager - Test Development Sapura Thales Electronics Sdn Bhd May 1998  –  February 2000  (1 year 10 months) Test Engineering Group Lead, Assistant Manager \nTeam leader & program manager for functional test system design and development for RF military products \nDesign and completed from ground up automated burn-in test system within a year of conception \n Senior Research Engineer Alcatel-Lucent December 1994  –  April 1998  (3 years 5 months) Penang, Malaysia Design engineer for switch mode power supply (SMPS) for terrestrial and satellite communication products \nQualification testing, EMC, reliability, and stress test for SMPS product Product Engineer Nortel Networks August 1990  –  November 1994  (4 years 4 months) Penang, Malaysia Product/NPI Engineer responsible for existing and new product development \nProduct transfer from R & D site to manufacturing for switch mode power supply and RF boards Staff Analog Hardware Design Engineer Intel January 2008  –  July 2015  (7 years 7 months) Penang Lead Platform Signal Integrity team for Intel PCH (Platform Controller Hub) chipset, responsible for overall execution of Intel annual chipset offering of package and platform development \n•\tStorage IO Specialist in Serial ATA (SATA), SATA Express, eMMC, and SD Card  \nEnabling industry first SATA 6Gb/s platform IO development from board design to full chip to chip solutions including redriver and docking topology \nSATA dual stack connector development and electrical specification definition  \nPlatform design correlation for SATA platform to confirm tools and platform design reliability, first Intel SI to EV correlation for SATA 6Gb/s IO \nElectrical qualification team lead for SATA for qualification decision with extensive statistical analysis \nFirst platform enabler of eMMC 5.0 HS400 on small core products with SI/PI (Signal Integrity)/(Power Integrity) circuit level co-simulation environment \nPassive (VNA & TDR) and active (full power-on & real time oscilloscope) electrical validation and characterization for SATA IO \n•\tCable and connector solution for IVCAM camera module and platform SI development; part of Intel Real Sense 3D depth camera enabling team \n•\tPath finding and early engagement for Intel 2nd Level Memory development and Fast Memory IO SI owner (DDR4 based) \n•\tIntel Electrical Margining Tool (Intel EMT) Engineering lead  \nIEMT is Target based margining tool for customer early validation stage \nArchitect of EMT engineering requirement and specification; in-depth knowledge of AHCI controller workings and SATA IO protocol \nTool qualification based on device and platform testing especially for HDD, SSD and PCIe Gen 3 devices \nCollaborate with drive industry vendors in tool improvement and SSD/HDD device qualification \n•\tLead the planning and running of Intel Asia Electrical Summit 2012 as as conference chair with successful 250-attendees-conference with 25 technical leaders across Asia and US \n Staff Analog Hardware Design Engineer Intel January 2008  –  July 2015  (7 years 7 months) Penang Lead Platform Signal Integrity team for Intel PCH (Platform Controller Hub) chipset, responsible for overall execution of Intel annual chipset offering of package and platform development \n•\tStorage IO Specialist in Serial ATA (SATA), SATA Express, eMMC, and SD Card  \nEnabling industry first SATA 6Gb/s platform IO development from board design to full chip to chip solutions including redriver and docking topology \nSATA dual stack connector development and electrical specification definition  \nPlatform design correlation for SATA platform to confirm tools and platform design reliability, first Intel SI to EV correlation for SATA 6Gb/s IO \nElectrical qualification team lead for SATA for qualification decision with extensive statistical analysis \nFirst platform enabler of eMMC 5.0 HS400 on small core products with SI/PI (Signal Integrity)/(Power Integrity) circuit level co-simulation environment \nPassive (VNA & TDR) and active (full power-on & real time oscilloscope) electrical validation and characterization for SATA IO \n•\tCable and connector solution for IVCAM camera module and platform SI development; part of Intel Real Sense 3D depth camera enabling team \n•\tPath finding and early engagement for Intel 2nd Level Memory development and Fast Memory IO SI owner (DDR4 based) \n•\tIntel Electrical Margining Tool (Intel EMT) Engineering lead  \nIEMT is Target based margining tool for customer early validation stage \nArchitect of EMT engineering requirement and specification; in-depth knowledge of AHCI controller workings and SATA IO protocol \nTool qualification based on device and platform testing especially for HDD, SSD and PCIe Gen 3 devices \nCollaborate with drive industry vendors in tool improvement and SSD/HDD device qualification \n•\tLead the planning and running of Intel Asia Electrical Summit 2012 as as conference chair with successful 250-attendees-conference with 25 technical leaders across Asia and US \n SI Design Manager Intel Corporation June 2010  –  June 2012  (2 years 1 month) Penang, Malaysia SI Design Manager (2010-2012) & Package SI/PI Team Manager  \n•\tLed electrical design team for Intel board and customer design enabling \n•\tPerformance management and technical development of SI team \n SI Design Manager Intel Corporation June 2010  –  June 2012  (2 years 1 month) Penang, Malaysia SI Design Manager (2010-2012) & Package SI/PI Team Manager  \n•\tLed electrical design team for Intel board and customer design enabling \n•\tPerformance management and technical development of SI team \n Package SI/PI Team Design Manager Intel Corporation December 2005  –  December 2007  (2 years 1 month) Penang, Malaysia Lead/Manage package signal integrity and power integrity \nPerformance management and personal development package SI and PI team Package SI/PI Team Design Manager Intel Corporation December 2005  –  December 2007  (2 years 1 month) Penang, Malaysia Lead/Manage package signal integrity and power integrity \nPerformance management and personal development package SI and PI team Senior Analog Design Engineer Intel Corporation January 2004  –  December 2005  (2 years) Penang, Malaysia Package electrical design requirement and electrical analysis for package feasibility \nPackage electrical modeling for early generation PCHs \nPlatform power integrity analysis for package design study and path finding \n Senior Analog Design Engineer Intel Corporation January 2004  –  December 2005  (2 years) Penang, Malaysia Package electrical design requirement and electrical analysis for package feasibility \nPackage electrical modeling for early generation PCHs \nPlatform power integrity analysis for package design study and path finding \n Design Engineer/Expert Agilent Technologies August 2001  –  December 2003  (2 years 5 months) Lead the product transfer team for Storage Area Network (SAN) tester  \n•\tRun product qualification in area physical packaging, reliability, EMC testing for SAN tester module resulting in successful launch at contract manufacturer \n•\tSix months relocation to Colorado Springs, USA for co-development \nParticipated in design team for oscilloscope product accessories and component of electrical module. Responsible for hardware design of \n•\tHigh impedance probe http://www.keysight.com/en/pd-269279-pn-E2697A/high-impedance-adapter-includes-500-mhz-passive-probe?cc=MY&lc=eng \n•\tLow end oscilloscope graphics card (partial) \n \n Design Engineer/Expert Agilent Technologies August 2001  –  December 2003  (2 years 5 months) Lead the product transfer team for Storage Area Network (SAN) tester  \n•\tRun product qualification in area physical packaging, reliability, EMC testing for SAN tester module resulting in successful launch at contract manufacturer \n•\tSix months relocation to Colorado Springs, USA for co-development \nParticipated in design team for oscilloscope product accessories and component of electrical module. Responsible for hardware design of \n•\tHigh impedance probe http://www.keysight.com/en/pd-269279-pn-E2697A/high-impedance-adapter-includes-500-mhz-passive-probe?cc=MY&lc=eng \n•\tLow end oscilloscope graphics card (partial) \n \n Senior Product Engineer Astec March 2001  –  July 2001  (5 months) Penang, Malaysia Lead product engineering team in switched mode power supply products, monitoring boards and RF boards products for telecommunication Senior Product Engineer Astec March 2001  –  July 2001  (5 months) Penang, Malaysia Lead product engineering team in switched mode power supply products, monitoring boards and RF boards products for telecommunication Assistant Manager - Test Development Sapura Thales Electronics Sdn Bhd May 1998  –  February 2000  (1 year 10 months) Test Engineering Group Lead, Assistant Manager \nTeam leader & program manager for functional test system design and development for RF military products \nDesign and completed from ground up automated burn-in test system within a year of conception \n Assistant Manager - Test Development Sapura Thales Electronics Sdn Bhd May 1998  –  February 2000  (1 year 10 months) Test Engineering Group Lead, Assistant Manager \nTeam leader & program manager for functional test system design and development for RF military products \nDesign and completed from ground up automated burn-in test system within a year of conception \n Senior Research Engineer Alcatel-Lucent December 1994  –  April 1998  (3 years 5 months) Penang, Malaysia Design engineer for switch mode power supply (SMPS) for terrestrial and satellite communication products \nQualification testing, EMC, reliability, and stress test for SMPS product Senior Research Engineer Alcatel-Lucent December 1994  –  April 1998  (3 years 5 months) Penang, Malaysia Design engineer for switch mode power supply (SMPS) for terrestrial and satellite communication products \nQualification testing, EMC, reliability, and stress test for SMPS product Product Engineer Nortel Networks August 1990  –  November 1994  (4 years 4 months) Penang, Malaysia Product/NPI Engineer responsible for existing and new product development \nProduct transfer from R & D site to manufacturing for switch mode power supply and RF boards Product Engineer Nortel Networks August 1990  –  November 1994  (4 years 4 months) Penang, Malaysia Product/NPI Engineer responsible for existing and new product development \nProduct transfer from R & D site to manufacturing for switch mode power supply and RF boards Languages English Bahasa Malaysia English Bahasa Malaysia English Bahasa Malaysia Skills Electronics Semiconductors Product Management Engineering Debugging Leadership Project Management Testing SoC RF Embedded Systems Hardware Architecture Analog Skills  Electronics Semiconductors Product Management Engineering Debugging Leadership Project Management Testing SoC RF Embedded Systems Hardware Architecture Analog Electronics Semiconductors Product Management Engineering Debugging Leadership Project Management Testing SoC RF Embedded Systems Hardware Architecture Analog Electronics Semiconductors Product Management Engineering Debugging Leadership Project Management Testing SoC RF Embedded Systems Hardware Architecture Analog Education Universiti Kebangsaan Malaysia Master of Engineering (M.Eng.),  Electrical , Electronics and Communications Engineering 2001  – 2003 Design of Direct Conversion Receiver for GSM Applications University of Massachusetts, Amherst Bachelor of Science (B.Sc.),  Electrical , Electronics and Communications Engineering 1987  – 1990 Microwave Engineering and Microelectronics Fabrication Activities and Societies:  Minor in Applied Mathematics Universiti Kebangsaan Malaysia Master of Engineering (M.Eng.),  Electrical , Electronics and Communications Engineering 2001  – 2003 Design of Direct Conversion Receiver for GSM Applications Universiti Kebangsaan Malaysia Master of Engineering (M.Eng.),  Electrical , Electronics and Communications Engineering 2001  – 2003 Design of Direct Conversion Receiver for GSM Applications Universiti Kebangsaan Malaysia Master of Engineering (M.Eng.),  Electrical , Electronics and Communications Engineering 2001  – 2003 Design of Direct Conversion Receiver for GSM Applications University of Massachusetts, Amherst Bachelor of Science (B.Sc.),  Electrical , Electronics and Communications Engineering 1987  – 1990 Microwave Engineering and Microelectronics Fabrication Activities and Societies:  Minor in Applied Mathematics University of Massachusetts, Amherst Bachelor of Science (B.Sc.),  Electrical , Electronics and Communications Engineering 1987  – 1990 Microwave Engineering and Microelectronics Fabrication Activities and Societies:  Minor in Applied Mathematics University of Massachusetts, Amherst Bachelor of Science (B.Sc.),  Electrical , Electronics and Communications Engineering 1987  – 1990 Microwave Engineering and Microelectronics Fabrication Activities and Societies:  Minor in Applied Mathematics Honors & Awards Department Recognition Awards HIP Engineering September 2012 Intel mentor and project advisor for 2 Graduate students for Master of Engineering in local university Department Recognition Awards HIP Engineering September 2012 Intel mentor and project advisor for 2 Graduate students for Master of Engineering in local university Department Recognition Awards HIP Engineering September 2012 Intel mentor and project advisor for 2 Graduate students for Master of Engineering in local university Department Recognition Awards HIP Engineering September 2012 Intel mentor and project advisor for 2 Graduate students for Master of Engineering in local university ", "Summary 1. 10 bit Segmented current steering DAC and Resistive-string DAC for ADC Reference generation \n2. Sub Blocks of 8bit 1MSps SAR ADC like Sample and Hold, Latched Comparator, Capacitive Charge Distribution DAC etc. \n3. USB 3.0 Analog PHY Transmitter blocks design in 65nm and 90nm processes (Retiming, Serializer, Pre-driver, Main Driver with De-emphasis, Rx detect, Termination control and calibration circuit). \n4. USB 3.0 Receiver blocks design in 65nm and 90nm processes (FFE, DFE Combined with PFD etc). \n5. Transmission line modeling of USB 3.0 cable, FR4 trace. \n6. 2.5GHz Charge Pump PLL \n7. Feasibility Study of AFE sub blocks like 4th order Gm-C Butterworth Filter, PGA etc. \n8. General Analog blocks like Opamps, Comparators, OTAs, Voltage Reference, Current Reference circuits etc. \n9. RF CMOS LNA design for Bluetooth Transceiver \n10. 2.4GHz RF PLL design \n11. USB 2.0 OTG Transceiver Design (Blocks: Full-Speed Receiver, High Speed Receiver, Squelch Detect, Disconnect Detect, VBUS Detect, 12 Phase Clock Generator for CDR) \n12. Mobile Phone Low Power IO Design. \n \nEDA Tools Experience: \nCADENCE (Virtuoso Schematic Editor, Analog Design Environment, Spectre , SpectreRF, Virtuoso Layout Editor and Assura); Mentor Graphics (ICStudio, ICstation, ELDO/ELDO-RF, Calibre. Ezwave); Laker ADP and its Simulation Console; MATLAB \n \nProcess Technology: 350nm to 28nm (Generic, Low Power and RF) \n \nSpecialties: High speed Serial Interface (USB3.0, Gigabit SERDES) and I/O interface design for different standards. Clock generation and Recovery PLL's. Comfortable in RF Transceiver blocks like LNA, Mixer, PLL, Filter, Envelop detector and RSSI. Summary 1. 10 bit Segmented current steering DAC and Resistive-string DAC for ADC Reference generation \n2. Sub Blocks of 8bit 1MSps SAR ADC like Sample and Hold, Latched Comparator, Capacitive Charge Distribution DAC etc. \n3. USB 3.0 Analog PHY Transmitter blocks design in 65nm and 90nm processes (Retiming, Serializer, Pre-driver, Main Driver with De-emphasis, Rx detect, Termination control and calibration circuit). \n4. USB 3.0 Receiver blocks design in 65nm and 90nm processes (FFE, DFE Combined with PFD etc). \n5. Transmission line modeling of USB 3.0 cable, FR4 trace. \n6. 2.5GHz Charge Pump PLL \n7. Feasibility Study of AFE sub blocks like 4th order Gm-C Butterworth Filter, PGA etc. \n8. General Analog blocks like Opamps, Comparators, OTAs, Voltage Reference, Current Reference circuits etc. \n9. RF CMOS LNA design for Bluetooth Transceiver \n10. 2.4GHz RF PLL design \n11. USB 2.0 OTG Transceiver Design (Blocks: Full-Speed Receiver, High Speed Receiver, Squelch Detect, Disconnect Detect, VBUS Detect, 12 Phase Clock Generator for CDR) \n12. Mobile Phone Low Power IO Design. \n \nEDA Tools Experience: \nCADENCE (Virtuoso Schematic Editor, Analog Design Environment, Spectre , SpectreRF, Virtuoso Layout Editor and Assura); Mentor Graphics (ICStudio, ICstation, ELDO/ELDO-RF, Calibre. Ezwave); Laker ADP and its Simulation Console; MATLAB \n \nProcess Technology: 350nm to 28nm (Generic, Low Power and RF) \n \nSpecialties: High speed Serial Interface (USB3.0, Gigabit SERDES) and I/O interface design for different standards. Clock generation and Recovery PLL's. Comfortable in RF Transceiver blocks like LNA, Mixer, PLL, Filter, Envelop detector and RSSI. 1. 10 bit Segmented current steering DAC and Resistive-string DAC for ADC Reference generation \n2. Sub Blocks of 8bit 1MSps SAR ADC like Sample and Hold, Latched Comparator, Capacitive Charge Distribution DAC etc. \n3. USB 3.0 Analog PHY Transmitter blocks design in 65nm and 90nm processes (Retiming, Serializer, Pre-driver, Main Driver with De-emphasis, Rx detect, Termination control and calibration circuit). \n4. USB 3.0 Receiver blocks design in 65nm and 90nm processes (FFE, DFE Combined with PFD etc). \n5. Transmission line modeling of USB 3.0 cable, FR4 trace. \n6. 2.5GHz Charge Pump PLL \n7. Feasibility Study of AFE sub blocks like 4th order Gm-C Butterworth Filter, PGA etc. \n8. General Analog blocks like Opamps, Comparators, OTAs, Voltage Reference, Current Reference circuits etc. \n9. RF CMOS LNA design for Bluetooth Transceiver \n10. 2.4GHz RF PLL design \n11. USB 2.0 OTG Transceiver Design (Blocks: Full-Speed Receiver, High Speed Receiver, Squelch Detect, Disconnect Detect, VBUS Detect, 12 Phase Clock Generator for CDR) \n12. Mobile Phone Low Power IO Design. \n \nEDA Tools Experience: \nCADENCE (Virtuoso Schematic Editor, Analog Design Environment, Spectre , SpectreRF, Virtuoso Layout Editor and Assura); Mentor Graphics (ICStudio, ICstation, ELDO/ELDO-RF, Calibre. Ezwave); Laker ADP and its Simulation Console; MATLAB \n \nProcess Technology: 350nm to 28nm (Generic, Low Power and RF) \n \nSpecialties: High speed Serial Interface (USB3.0, Gigabit SERDES) and I/O interface design for different standards. Clock generation and Recovery PLL's. Comfortable in RF Transceiver blocks like LNA, Mixer, PLL, Filter, Envelop detector and RSSI. 1. 10 bit Segmented current steering DAC and Resistive-string DAC for ADC Reference generation \n2. Sub Blocks of 8bit 1MSps SAR ADC like Sample and Hold, Latched Comparator, Capacitive Charge Distribution DAC etc. \n3. USB 3.0 Analog PHY Transmitter blocks design in 65nm and 90nm processes (Retiming, Serializer, Pre-driver, Main Driver with De-emphasis, Rx detect, Termination control and calibration circuit). \n4. USB 3.0 Receiver blocks design in 65nm and 90nm processes (FFE, DFE Combined with PFD etc). \n5. Transmission line modeling of USB 3.0 cable, FR4 trace. \n6. 2.5GHz Charge Pump PLL \n7. Feasibility Study of AFE sub blocks like 4th order Gm-C Butterworth Filter, PGA etc. \n8. General Analog blocks like Opamps, Comparators, OTAs, Voltage Reference, Current Reference circuits etc. \n9. RF CMOS LNA design for Bluetooth Transceiver \n10. 2.4GHz RF PLL design \n11. USB 2.0 OTG Transceiver Design (Blocks: Full-Speed Receiver, High Speed Receiver, Squelch Detect, Disconnect Detect, VBUS Detect, 12 Phase Clock Generator for CDR) \n12. Mobile Phone Low Power IO Design. \n \nEDA Tools Experience: \nCADENCE (Virtuoso Schematic Editor, Analog Design Environment, Spectre , SpectreRF, Virtuoso Layout Editor and Assura); Mentor Graphics (ICStudio, ICstation, ELDO/ELDO-RF, Calibre. Ezwave); Laker ADP and its Simulation Console; MATLAB \n \nProcess Technology: 350nm to 28nm (Generic, Low Power and RF) \n \nSpecialties: High speed Serial Interface (USB3.0, Gigabit SERDES) and I/O interface design for different standards. Clock generation and Recovery PLL's. Comfortable in RF Transceiver blocks like LNA, Mixer, PLL, Filter, Envelop detector and RSSI. Experience Senior Analog Design Engineer Intel Corporation September 2013  – Present (2 years) Bengaluru Area, India Worked on RX path and Monitor blocks of 10.4Gbps Serial Link PHY. \nCurrently working on TX path of 11.2Gbps Serial Link PHY. Senior Member Technical Staff (SMTS) KPIT Cummins Infosystems Limited December 2011  –  September 2013  (1 year 10 months) Bangalore Group: Semiconductor Systems Group - Analog/Mixed Signal Circuit Design \nWork done so far: 1) Low Power Mixed-Voltage Mobile Phone IO design at 65nm, 40nm and 28nm  \nlow power process \n2) USB 2.0 OTG Transceiver Design at 28nm low power process Senior Design Engineer Terminus Circuits Pvt Ltd July 2010  –  April 2011  (10 months) Bangalore, India Worked on receiver design of USB 3.0 Analog PHY Member Technical Staff Manthan Semiconductors Pvt. Ltd. September 2007  –  November 2009  (2 years 3 months) Bangalore, India Worked on Analog PHY design of USB 3.0 Project Engineer Wipro Technologies August 2006  –  September 2007  (1 year 2 months) Senior Analog Design Engineer Intel Corporation September 2013  – Present (2 years) Bengaluru Area, India Worked on RX path and Monitor blocks of 10.4Gbps Serial Link PHY. \nCurrently working on TX path of 11.2Gbps Serial Link PHY. Senior Analog Design Engineer Intel Corporation September 2013  – Present (2 years) Bengaluru Area, India Worked on RX path and Monitor blocks of 10.4Gbps Serial Link PHY. \nCurrently working on TX path of 11.2Gbps Serial Link PHY. Senior Member Technical Staff (SMTS) KPIT Cummins Infosystems Limited December 2011  –  September 2013  (1 year 10 months) Bangalore Group: Semiconductor Systems Group - Analog/Mixed Signal Circuit Design \nWork done so far: 1) Low Power Mixed-Voltage Mobile Phone IO design at 65nm, 40nm and 28nm  \nlow power process \n2) USB 2.0 OTG Transceiver Design at 28nm low power process Senior Member Technical Staff (SMTS) KPIT Cummins Infosystems Limited December 2011  –  September 2013  (1 year 10 months) Bangalore Group: Semiconductor Systems Group - Analog/Mixed Signal Circuit Design \nWork done so far: 1) Low Power Mixed-Voltage Mobile Phone IO design at 65nm, 40nm and 28nm  \nlow power process \n2) USB 2.0 OTG Transceiver Design at 28nm low power process Senior Design Engineer Terminus Circuits Pvt Ltd July 2010  –  April 2011  (10 months) Bangalore, India Worked on receiver design of USB 3.0 Analog PHY Senior Design Engineer Terminus Circuits Pvt Ltd July 2010  –  April 2011  (10 months) Bangalore, India Worked on receiver design of USB 3.0 Analog PHY Member Technical Staff Manthan Semiconductors Pvt. Ltd. September 2007  –  November 2009  (2 years 3 months) Bangalore, India Worked on Analog PHY design of USB 3.0 Member Technical Staff Manthan Semiconductors Pvt. Ltd. September 2007  –  November 2009  (2 years 3 months) Bangalore, India Worked on Analog PHY design of USB 3.0 Project Engineer Wipro Technologies August 2006  –  September 2007  (1 year 2 months) Project Engineer Wipro Technologies August 2006  –  September 2007  (1 year 2 months) Languages Hindi Full professional proficiency Bengali Native or bilingual proficiency Hindi Full professional proficiency Bengali Native or bilingual proficiency Hindi Full professional proficiency Bengali Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills SERDES PLL VCO High Speed Design I/O PHY Equalization Mixed Signal Analog Circuit Design RFIC Wireless Analog Cadence Virtuoso CMOS LNA Mixer IC SoC Circuit Design EDA VLSI ASIC RF USB Simulations Bluetooth See 11+     See less Skills  SERDES PLL VCO High Speed Design I/O PHY Equalization Mixed Signal Analog Circuit Design RFIC Wireless Analog Cadence Virtuoso CMOS LNA Mixer IC SoC Circuit Design EDA VLSI ASIC RF USB Simulations Bluetooth See 11+     See less SERDES PLL VCO High Speed Design I/O PHY Equalization Mixed Signal Analog Circuit Design RFIC Wireless Analog Cadence Virtuoso CMOS LNA Mixer IC SoC Circuit Design EDA VLSI ASIC RF USB Simulations Bluetooth See 11+     See less SERDES PLL VCO High Speed Design I/O PHY Equalization Mixed Signal Analog Circuit Design RFIC Wireless Analog Cadence Virtuoso CMOS LNA Mixer IC SoC Circuit Design EDA VLSI ASIC RF USB Simulations Bluetooth See 11+     See less Education Indian Institute of Technology, Kharagpur MS,  Electronics & Electrical Communication Engg. 2003  – 2006 Activities and Societies:  Student Member IEEE Netaji Subhash Engineering College/Kalyani University BTech,  Electronics and Telecommunication 1999  – 2003 Scottish Church Collegiate School Higher Secondary,  Science 1996  – 1998 Ramkrishna Mission Ashrama High School, Baranagar Secondary 1990  – 1996 Indian Institute of Technology, Kharagpur MS,  Electronics & Electrical Communication Engg. 2003  – 2006 Activities and Societies:  Student Member IEEE Indian Institute of Technology, Kharagpur MS,  Electronics & Electrical Communication Engg. 2003  – 2006 Activities and Societies:  Student Member IEEE Indian Institute of Technology, Kharagpur MS,  Electronics & Electrical Communication Engg. 2003  – 2006 Activities and Societies:  Student Member IEEE Netaji Subhash Engineering College/Kalyani University BTech,  Electronics and Telecommunication 1999  – 2003 Netaji Subhash Engineering College/Kalyani University BTech,  Electronics and Telecommunication 1999  – 2003 Netaji Subhash Engineering College/Kalyani University BTech,  Electronics and Telecommunication 1999  – 2003 Scottish Church Collegiate School Higher Secondary,  Science 1996  – 1998 Scottish Church Collegiate School Higher Secondary,  Science 1996  – 1998 Scottish Church Collegiate School Higher Secondary,  Science 1996  – 1998 Ramkrishna Mission Ashrama High School, Baranagar Secondary 1990  – 1996 Ramkrishna Mission Ashrama High School, Baranagar Secondary 1990  – 1996 Ramkrishna Mission Ashrama High School, Baranagar Secondary 1990  – 1996 ", "Skills Analog Circuit Design High Speed Serial IO DDR IO PCIe Receiver Analog... Clocking Circuits... Bandgap References Voltage Regulator Analog LP and PC DDR2, DDR3,... DDR Clocking Circuits PLL PCIE Gen1/2/3 CSI QPI SMI2/SMI2/FBD Biasing Circuitry DDR Phy See 3+     See less Skills  Analog Circuit Design High Speed Serial IO DDR IO PCIe Receiver Analog... Clocking Circuits... Bandgap References Voltage Regulator Analog LP and PC DDR2, DDR3,... DDR Clocking Circuits PLL PCIE Gen1/2/3 CSI QPI SMI2/SMI2/FBD Biasing Circuitry DDR Phy See 3+     See less Analog Circuit Design High Speed Serial IO DDR IO PCIe Receiver Analog... Clocking Circuits... Bandgap References Voltage Regulator Analog LP and PC DDR2, DDR3,... DDR Clocking Circuits PLL PCIE Gen1/2/3 CSI QPI SMI2/SMI2/FBD Biasing Circuitry DDR Phy See 3+     See less Analog Circuit Design High Speed Serial IO DDR IO PCIe Receiver Analog... Clocking Circuits... Bandgap References Voltage Regulator Analog LP and PC DDR2, DDR3,... DDR Clocking Circuits PLL PCIE Gen1/2/3 CSI QPI SMI2/SMI2/FBD Biasing Circuitry DDR Phy See 3+     See less ", "Experience Graduate Research and Teaching Assistant Oregon State University 2007  –  2012  (5 years) Design Engineer Mentor Graphics 2006  –  2007  (1 year) Research and Teaching Assistant Faculty of Engineering, Ain Shams University 2003  –  2007  (4 years) VLSI Design Engineer AIAT 2003  –  2006  (3 years) Graduate Research and Teaching Assistant Oregon State University 2007  –  2012  (5 years) Graduate Research and Teaching Assistant Oregon State University 2007  –  2012  (5 years) Design Engineer Mentor Graphics 2006  –  2007  (1 year) Design Engineer Mentor Graphics 2006  –  2007  (1 year) Research and Teaching Assistant Faculty of Engineering, Ain Shams University 2003  –  2007  (4 years) Research and Teaching Assistant Faculty of Engineering, Ain Shams University 2003  –  2007  (4 years) VLSI Design Engineer AIAT 2003  –  2006  (3 years) VLSI Design Engineer AIAT 2003  –  2006  (3 years) Education Oregon State University Ph.D.. 2007  – 2012 Ain Shams University BS.c, and M.Sc. Oregon State University Ph.D.. 2007  – 2012 Oregon State University Ph.D.. 2007  – 2012 Oregon State University Ph.D.. 2007  – 2012 Ain Shams University BS.c, and M.Sc. Ain Shams University BS.c, and M.Sc. Ain Shams University BS.c, and M.Sc. Honors & Awards ", "Experience Owner Manager Butterfly Belly LLC October 2012  – Present (2 years 11 months) 6036 SE Division Street Portland Oregon I'm the owner and operator responsible for the various areas of marketing, managing, quality control and process improvements as listed below:  \n \n- Electricity, gas & water conservation by use of better insulation, timers, and converting to more efficient appliances. \n \n- Meat, produce, and supplies cost cutting via a home grown inventory program which reduced the number of grocery trips from 13 down to about 4 per. month which reduced labor cost and gasoline expenses by more than 80%. \n \n- Streamlining and reducing the number of to-go supplies which freed up shelves and counter spaces. \n \n- Work area layout and selective equipment changes to improve work flow, efficiency, and communication between the kitchen and hosting staff.  \n \n- Training System which anchored around an easy to learn menu for new Employee Training. This help reduce learning time by 90%. \n \nWebsites: \n \nhttp://www.yelp.com/biz/butterfly-belly-asian-cuisine-Portland \nhttp://www.butterflybellyme.com Founder One of Kindness Non-Profit May 2012  –  August 2012  (4 months) Portland, Oregon Area This non-profit for youth leadership development through mentoring and job placement is put on hold waiting for more funding. The restaurant that I'm starting aims to be the major funding source for this NPO. \n \nhttp://www.facebook.com/oneofkindness HDMI Signal Integrity Individual Contributor Intel Corporation March 2011  –  February 2012  (1 year) Hillsboro, Oregon I have hands on clock, asynchronous, DDR1, DDR2, FSB and various SI experience under my belt. HDMI is a serial differential interface and is area of development that I wanted some hands on experience on. I have led and chaired DDR2 E-KIT forums, signal integrity work groups, and also have been the chair person who coordinated and overseen the overall signal integrity development of the various interfaces on the platform. One of my recent steep ramp up was through the technical review support for a customer which I reviewed various serial differential board routing without having the years of in-depth knowledge of the nuances of these type of interfaces but with a lot experiences on other type of signalling I was able to manage. This has been a great year of learning for me and now I also have HDMI on my tool belt.  \n \nTop Mentions: Apple Mac Book Air. I was the signal integrity lead for Intel supporting Apple on what was later known as the very first Mac Book Air. For several years, I was the Intel SIE Notebook representative to the DDR2 JEDEC workgroup and co-owned the Unbuffered SODIMM Specification with the workgroup. Analog SI Design Engineer Intel Corporation January 2004  –  February 2012  (8 years 2 months) Signal Integrity Analysis and Application Engineer of various interfaces below:  \n \n- Signal Analysis for the mobile SDRAM PC100, DDR1, and DDR2. \n- JEDEC Intel Unbuffered SDRAM Specification Owner for PC100, DDR1, and DDR2. \n- SIE Lead for the mobile DDR2 and also responsible for initial ramping up and training of Intel India SIE team. \n- Signal Analysis for Asynchronous Signal Group. \n- Signal Analysis for System Clock and BCLK.  \n- Signal Analysis for Front Side Data and Strobes. \n- Signal Analysis for the differential serial HDMI bus. Platform Signal Integrity Lead (PIF) Intel Corporation January 2009  –  February 2011  (2 years 2 months) Hillsboro, Oregon Analog Design (Signal Integrity) Engineer. Coordinated the signal integrity forum (PIF) at Intel which oversees design guidelines development for the various interfaces for the platform. I worked with the different group from package, validation, board design, technical marketing, power delivery, signal integrity, electromagnetic compliant (EMC), and etc. to ensure signal integrity for the internal and external customer designs. Senior Analog Design Engineer Intel Corporation July 2003  –  2009  (6 years) Beaverton, Oregon More details later \nMobile DDR1 Signal Integrity Lead, Mobile DDR2 Signal Integrity Lead \nIndividual Contributor to the Analysis of the CMD, CTL, Data and Strobe signal groups. \nContent owner of the DDR1 and DDR2 Mobile Platform Design Guidelines. \nIntel Representative DDR1/DDR2 Unbuffered JEDEC SODIMM Specifications. \nLead and mentor to the Intel India's DDR1 and DDR2 Signal Integrity teams.  \n....... Electrical Design Engineer Intel Corporation June 1997  –  2003  (6 years) Hillsboro, Oregon From 1997-2003, I was part of a team responsible for the PCB and MB design of an product in the form of the mobile CPU cartridge aka Intel Mobile Module for accelerated notebook OEMs enabling. I was a co board design lead on the first mobile customer reference board (CRB) which the later generation CRB helped enabled Centrino based notebooks. \n \nThe skills I picked up included: \n- Chairing daily meetings to coordinate activities across various board design, manufacturing, validation, marketing and BIOS teams.  \n- Schematics design of the FSB(Front Side Bus), VR(voltage regulator), SDRAM, Thermal Sensor, ISA (South Bridge), L2 Cache(North Bridge) \n- Vendor sourcing, validation and verification of production parts. \n- Boot up Camp Trainer, EMI, Acoustic Testing \n- Working knowledge of LAI, Oscilloscope, and ITPs. \n- Library creation of Schematic symbols, CAD symbols, writing and implementing BKMs.  \n- Bill of materials(BOM), Q&R and validation of the module, ICs, and passives. \n- Coordinate and co-author of the Platform Design Guidelines with our Technical Marketing teams. Owner Manager Butterfly Belly LLC October 2012  – Present (2 years 11 months) 6036 SE Division Street Portland Oregon I'm the owner and operator responsible for the various areas of marketing, managing, quality control and process improvements as listed below:  \n \n- Electricity, gas & water conservation by use of better insulation, timers, and converting to more efficient appliances. \n \n- Meat, produce, and supplies cost cutting via a home grown inventory program which reduced the number of grocery trips from 13 down to about 4 per. month which reduced labor cost and gasoline expenses by more than 80%. \n \n- Streamlining and reducing the number of to-go supplies which freed up shelves and counter spaces. \n \n- Work area layout and selective equipment changes to improve work flow, efficiency, and communication between the kitchen and hosting staff.  \n \n- Training System which anchored around an easy to learn menu for new Employee Training. This help reduce learning time by 90%. \n \nWebsites: \n \nhttp://www.yelp.com/biz/butterfly-belly-asian-cuisine-Portland \nhttp://www.butterflybellyme.com Owner Manager Butterfly Belly LLC October 2012  – Present (2 years 11 months) 6036 SE Division Street Portland Oregon I'm the owner and operator responsible for the various areas of marketing, managing, quality control and process improvements as listed below:  \n \n- Electricity, gas & water conservation by use of better insulation, timers, and converting to more efficient appliances. \n \n- Meat, produce, and supplies cost cutting via a home grown inventory program which reduced the number of grocery trips from 13 down to about 4 per. month which reduced labor cost and gasoline expenses by more than 80%. \n \n- Streamlining and reducing the number of to-go supplies which freed up shelves and counter spaces. \n \n- Work area layout and selective equipment changes to improve work flow, efficiency, and communication between the kitchen and hosting staff.  \n \n- Training System which anchored around an easy to learn menu for new Employee Training. This help reduce learning time by 90%. \n \nWebsites: \n \nhttp://www.yelp.com/biz/butterfly-belly-asian-cuisine-Portland \nhttp://www.butterflybellyme.com Founder One of Kindness Non-Profit May 2012  –  August 2012  (4 months) Portland, Oregon Area This non-profit for youth leadership development through mentoring and job placement is put on hold waiting for more funding. The restaurant that I'm starting aims to be the major funding source for this NPO. \n \nhttp://www.facebook.com/oneofkindness Founder One of Kindness Non-Profit May 2012  –  August 2012  (4 months) Portland, Oregon Area This non-profit for youth leadership development through mentoring and job placement is put on hold waiting for more funding. The restaurant that I'm starting aims to be the major funding source for this NPO. \n \nhttp://www.facebook.com/oneofkindness HDMI Signal Integrity Individual Contributor Intel Corporation March 2011  –  February 2012  (1 year) Hillsboro, Oregon I have hands on clock, asynchronous, DDR1, DDR2, FSB and various SI experience under my belt. HDMI is a serial differential interface and is area of development that I wanted some hands on experience on. I have led and chaired DDR2 E-KIT forums, signal integrity work groups, and also have been the chair person who coordinated and overseen the overall signal integrity development of the various interfaces on the platform. One of my recent steep ramp up was through the technical review support for a customer which I reviewed various serial differential board routing without having the years of in-depth knowledge of the nuances of these type of interfaces but with a lot experiences on other type of signalling I was able to manage. This has been a great year of learning for me and now I also have HDMI on my tool belt.  \n \nTop Mentions: Apple Mac Book Air. I was the signal integrity lead for Intel supporting Apple on what was later known as the very first Mac Book Air. For several years, I was the Intel SIE Notebook representative to the DDR2 JEDEC workgroup and co-owned the Unbuffered SODIMM Specification with the workgroup. HDMI Signal Integrity Individual Contributor Intel Corporation March 2011  –  February 2012  (1 year) Hillsboro, Oregon I have hands on clock, asynchronous, DDR1, DDR2, FSB and various SI experience under my belt. HDMI is a serial differential interface and is area of development that I wanted some hands on experience on. I have led and chaired DDR2 E-KIT forums, signal integrity work groups, and also have been the chair person who coordinated and overseen the overall signal integrity development of the various interfaces on the platform. One of my recent steep ramp up was through the technical review support for a customer which I reviewed various serial differential board routing without having the years of in-depth knowledge of the nuances of these type of interfaces but with a lot experiences on other type of signalling I was able to manage. This has been a great year of learning for me and now I also have HDMI on my tool belt.  \n \nTop Mentions: Apple Mac Book Air. I was the signal integrity lead for Intel supporting Apple on what was later known as the very first Mac Book Air. For several years, I was the Intel SIE Notebook representative to the DDR2 JEDEC workgroup and co-owned the Unbuffered SODIMM Specification with the workgroup. Analog SI Design Engineer Intel Corporation January 2004  –  February 2012  (8 years 2 months) Signal Integrity Analysis and Application Engineer of various interfaces below:  \n \n- Signal Analysis for the mobile SDRAM PC100, DDR1, and DDR2. \n- JEDEC Intel Unbuffered SDRAM Specification Owner for PC100, DDR1, and DDR2. \n- SIE Lead for the mobile DDR2 and also responsible for initial ramping up and training of Intel India SIE team. \n- Signal Analysis for Asynchronous Signal Group. \n- Signal Analysis for System Clock and BCLK.  \n- Signal Analysis for Front Side Data and Strobes. \n- Signal Analysis for the differential serial HDMI bus. Analog SI Design Engineer Intel Corporation January 2004  –  February 2012  (8 years 2 months) Signal Integrity Analysis and Application Engineer of various interfaces below:  \n \n- Signal Analysis for the mobile SDRAM PC100, DDR1, and DDR2. \n- JEDEC Intel Unbuffered SDRAM Specification Owner for PC100, DDR1, and DDR2. \n- SIE Lead for the mobile DDR2 and also responsible for initial ramping up and training of Intel India SIE team. \n- Signal Analysis for Asynchronous Signal Group. \n- Signal Analysis for System Clock and BCLK.  \n- Signal Analysis for Front Side Data and Strobes. \n- Signal Analysis for the differential serial HDMI bus. Platform Signal Integrity Lead (PIF) Intel Corporation January 2009  –  February 2011  (2 years 2 months) Hillsboro, Oregon Analog Design (Signal Integrity) Engineer. Coordinated the signal integrity forum (PIF) at Intel which oversees design guidelines development for the various interfaces for the platform. I worked with the different group from package, validation, board design, technical marketing, power delivery, signal integrity, electromagnetic compliant (EMC), and etc. to ensure signal integrity for the internal and external customer designs. Platform Signal Integrity Lead (PIF) Intel Corporation January 2009  –  February 2011  (2 years 2 months) Hillsboro, Oregon Analog Design (Signal Integrity) Engineer. Coordinated the signal integrity forum (PIF) at Intel which oversees design guidelines development for the various interfaces for the platform. I worked with the different group from package, validation, board design, technical marketing, power delivery, signal integrity, electromagnetic compliant (EMC), and etc. to ensure signal integrity for the internal and external customer designs. Senior Analog Design Engineer Intel Corporation July 2003  –  2009  (6 years) Beaverton, Oregon More details later \nMobile DDR1 Signal Integrity Lead, Mobile DDR2 Signal Integrity Lead \nIndividual Contributor to the Analysis of the CMD, CTL, Data and Strobe signal groups. \nContent owner of the DDR1 and DDR2 Mobile Platform Design Guidelines. \nIntel Representative DDR1/DDR2 Unbuffered JEDEC SODIMM Specifications. \nLead and mentor to the Intel India's DDR1 and DDR2 Signal Integrity teams.  \n....... Senior Analog Design Engineer Intel Corporation July 2003  –  2009  (6 years) Beaverton, Oregon More details later \nMobile DDR1 Signal Integrity Lead, Mobile DDR2 Signal Integrity Lead \nIndividual Contributor to the Analysis of the CMD, CTL, Data and Strobe signal groups. \nContent owner of the DDR1 and DDR2 Mobile Platform Design Guidelines. \nIntel Representative DDR1/DDR2 Unbuffered JEDEC SODIMM Specifications. \nLead and mentor to the Intel India's DDR1 and DDR2 Signal Integrity teams.  \n....... Electrical Design Engineer Intel Corporation June 1997  –  2003  (6 years) Hillsboro, Oregon From 1997-2003, I was part of a team responsible for the PCB and MB design of an product in the form of the mobile CPU cartridge aka Intel Mobile Module for accelerated notebook OEMs enabling. I was a co board design lead on the first mobile customer reference board (CRB) which the later generation CRB helped enabled Centrino based notebooks. \n \nThe skills I picked up included: \n- Chairing daily meetings to coordinate activities across various board design, manufacturing, validation, marketing and BIOS teams.  \n- Schematics design of the FSB(Front Side Bus), VR(voltage regulator), SDRAM, Thermal Sensor, ISA (South Bridge), L2 Cache(North Bridge) \n- Vendor sourcing, validation and verification of production parts. \n- Boot up Camp Trainer, EMI, Acoustic Testing \n- Working knowledge of LAI, Oscilloscope, and ITPs. \n- Library creation of Schematic symbols, CAD symbols, writing and implementing BKMs.  \n- Bill of materials(BOM), Q&R and validation of the module, ICs, and passives. \n- Coordinate and co-author of the Platform Design Guidelines with our Technical Marketing teams. Electrical Design Engineer Intel Corporation June 1997  –  2003  (6 years) Hillsboro, Oregon From 1997-2003, I was part of a team responsible for the PCB and MB design of an product in the form of the mobile CPU cartridge aka Intel Mobile Module for accelerated notebook OEMs enabling. I was a co board design lead on the first mobile customer reference board (CRB) which the later generation CRB helped enabled Centrino based notebooks. \n \nThe skills I picked up included: \n- Chairing daily meetings to coordinate activities across various board design, manufacturing, validation, marketing and BIOS teams.  \n- Schematics design of the FSB(Front Side Bus), VR(voltage regulator), SDRAM, Thermal Sensor, ISA (South Bridge), L2 Cache(North Bridge) \n- Vendor sourcing, validation and verification of production parts. \n- Boot up Camp Trainer, EMI, Acoustic Testing \n- Working knowledge of LAI, Oscilloscope, and ITPs. \n- Library creation of Schematic symbols, CAD symbols, writing and implementing BKMs.  \n- Bill of materials(BOM), Q&R and validation of the module, ICs, and passives. \n- Coordinate and co-author of the Platform Design Guidelines with our Technical Marketing teams. Languages Vietnamese Vietnamese Vietnamese Skills Signal Integrity Intel Analog Semiconductors Analog Design Board Development Application Engineers Management Program Management Analog Circuit Design HDMI Electromagnetics Technical Marketing DDR2 Hardware Architecture SoC Processors Debugging Embedded Systems PCB Design Testing See 6+     See less Skills  Signal Integrity Intel Analog Semiconductors Analog Design Board Development Application Engineers Management Program Management Analog Circuit Design HDMI Electromagnetics Technical Marketing DDR2 Hardware Architecture SoC Processors Debugging Embedded Systems PCB Design Testing See 6+     See less Signal Integrity Intel Analog Semiconductors Analog Design Board Development Application Engineers Management Program Management Analog Circuit Design HDMI Electromagnetics Technical Marketing DDR2 Hardware Architecture SoC Processors Debugging Embedded Systems PCB Design Testing See 6+     See less Signal Integrity Intel Analog Semiconductors Analog Design Board Development Application Engineers Management Program Management Analog Circuit Design HDMI Electromagnetics Technical Marketing DDR2 Hardware Architecture SoC Processors Debugging Embedded Systems PCB Design Testing See 6+     See less Education Portland State University BS,  EE ,  Physics ,  and Math 1992  – 1997 Activities and Societies:  VSA Portland State University BS,  EE ,  Physics ,  and Math 1992  – 1997 Activities and Societies:  VSA Portland State University BS,  EE ,  Physics ,  and Math 1992  – 1997 Activities and Societies:  VSA Portland State University BS,  EE ,  Physics ,  and Math 1992  – 1997 Activities and Societies:  VSA ", "Experience Senior Analog Design Engineer Intel Corporation July 1999  – Present (16 years 2 months) Chandler, AZ Electrical Engineering Intern Hewlett-Packard June 1998  –  August 1998  (3 months) Electrical Engineering Intern Ball Aerospace June 1997  –  August 1997  (3 months) Senior Analog Design Engineer Intel Corporation July 1999  – Present (16 years 2 months) Chandler, AZ Senior Analog Design Engineer Intel Corporation July 1999  – Present (16 years 2 months) Chandler, AZ Electrical Engineering Intern Hewlett-Packard June 1998  –  August 1998  (3 months) Electrical Engineering Intern Hewlett-Packard June 1998  –  August 1998  (3 months) Electrical Engineering Intern Ball Aerospace June 1997  –  August 1997  (3 months) Electrical Engineering Intern Ball Aerospace June 1997  –  August 1997  (3 months) Skills Electrical Engineering ASIC IC Analog Circuit Design Semiconductors Skills  Electrical Engineering ASIC IC Analog Circuit Design Semiconductors Electrical Engineering ASIC IC Analog Circuit Design Semiconductors Electrical Engineering ASIC IC Analog Circuit Design Semiconductors Education Arizona State University Master of Science (MS),  Electrical and Electronics Engineering 2000  – 2003 University of Wyoming Bachelor of Science (BS),  Electrical Engineering 1995  – 1999 Arizona State University Master of Science (MS),  Electrical and Electronics Engineering 2000  – 2003 Arizona State University Master of Science (MS),  Electrical and Electronics Engineering 2000  – 2003 Arizona State University Master of Science (MS),  Electrical and Electronics Engineering 2000  – 2003 University of Wyoming Bachelor of Science (BS),  Electrical Engineering 1995  – 1999 University of Wyoming Bachelor of Science (BS),  Electrical Engineering 1995  – 1999 University of Wyoming Bachelor of Science (BS),  Electrical Engineering 1995  – 1999 ", "Summary RF/Analog and Mixed Signal Design Engineer Summary RF/Analog and Mixed Signal Design Engineer RF/Analog and Mixed Signal Design Engineer RF/Analog and Mixed Signal Design Engineer Experience Principal RF/Mixed Signal Design Engineer MaxLinear May 2015  – Present (4 months) Irvine, California Senior Staff Analog Design Engineer Entropic Communications June 2013  –  May 2015  (2 years) Orange County, California Area Involved in the design of >10GHz, >9-bits DAC, PLL, SerDes, IO and transmitters. Senior Analog Design Engineer Mobius Semiconductor October 2010  –  June 2013  (2 years 9 months) Orange County, California Area A startup set out to develop and supply high speed, such as 45GHz, 65GHz AD/DA converters IP or chips. \n \nAcquired by Entropic Communications. Senior Analog Design Engineer Intel Corporation August 2008  –  October 2010  (2 years 3 months) Portland, Oregon Area Involved in the design of serial links with focus on adaptive equalizers in the multi-gigabit range. Intern Qualcomm August 2007  –  December 2007  (5 months) Greater San Diego Area Involved in the design of a high speed pipelined ADC Analog Design Engineer Ittiam Systems Pvt Ltd May 2004  –  April 2005  (1 year) Bangaon Area, India Principal RF/Mixed Signal Design Engineer MaxLinear May 2015  – Present (4 months) Irvine, California Principal RF/Mixed Signal Design Engineer MaxLinear May 2015  – Present (4 months) Irvine, California Senior Staff Analog Design Engineer Entropic Communications June 2013  –  May 2015  (2 years) Orange County, California Area Involved in the design of >10GHz, >9-bits DAC, PLL, SerDes, IO and transmitters. Senior Staff Analog Design Engineer Entropic Communications June 2013  –  May 2015  (2 years) Orange County, California Area Involved in the design of >10GHz, >9-bits DAC, PLL, SerDes, IO and transmitters. Senior Analog Design Engineer Mobius Semiconductor October 2010  –  June 2013  (2 years 9 months) Orange County, California Area A startup set out to develop and supply high speed, such as 45GHz, 65GHz AD/DA converters IP or chips. \n \nAcquired by Entropic Communications. Senior Analog Design Engineer Mobius Semiconductor October 2010  –  June 2013  (2 years 9 months) Orange County, California Area A startup set out to develop and supply high speed, such as 45GHz, 65GHz AD/DA converters IP or chips. \n \nAcquired by Entropic Communications. Senior Analog Design Engineer Intel Corporation August 2008  –  October 2010  (2 years 3 months) Portland, Oregon Area Involved in the design of serial links with focus on adaptive equalizers in the multi-gigabit range. Senior Analog Design Engineer Intel Corporation August 2008  –  October 2010  (2 years 3 months) Portland, Oregon Area Involved in the design of serial links with focus on adaptive equalizers in the multi-gigabit range. Intern Qualcomm August 2007  –  December 2007  (5 months) Greater San Diego Area Involved in the design of a high speed pipelined ADC Intern Qualcomm August 2007  –  December 2007  (5 months) Greater San Diego Area Involved in the design of a high speed pipelined ADC Analog Design Engineer Ittiam Systems Pvt Ltd May 2004  –  April 2005  (1 year) Bangaon Area, India Analog Design Engineer Ittiam Systems Pvt Ltd May 2004  –  April 2005  (1 year) Bangaon Area, India Languages English Telugu Hindi English Telugu Hindi English Telugu Hindi Skills Analog Circuit Design Low-power Design ADCs Semiconductors Mixed Signal SERDES DAC PLL CMOS PCIe Analog Circuit Design Spectre ASIC Cadence Spectre VLSI See 1+     See less Skills  Analog Circuit Design Low-power Design ADCs Semiconductors Mixed Signal SERDES DAC PLL CMOS PCIe Analog Circuit Design Spectre ASIC Cadence Spectre VLSI See 1+     See less Analog Circuit Design Low-power Design ADCs Semiconductors Mixed Signal SERDES DAC PLL CMOS PCIe Analog Circuit Design Spectre ASIC Cadence Spectre VLSI See 1+     See less Analog Circuit Design Low-power Design ADCs Semiconductors Mixed Signal SERDES DAC PLL CMOS PCIe Analog Circuit Design Spectre ASIC Cadence Spectre VLSI See 1+     See less Education Oregon State University Ph.D,  Analog Circuit Design 2005  – 2009 Thesis focused on low power high speed Nyquist rate ADCs in the 10-bit range. Activities and Societies:  Badminton Indian Institute of Technology, Madras B.Tech,  Electrical Engineering 2000  – 2004 Worked on a low power flash ADC for final year project with typical application in disk drive read channels. Activities and Societies:  Badminton Oregon State University Ph.D,  Analog Circuit Design 2005  – 2009 Thesis focused on low power high speed Nyquist rate ADCs in the 10-bit range. Activities and Societies:  Badminton Oregon State University Ph.D,  Analog Circuit Design 2005  – 2009 Thesis focused on low power high speed Nyquist rate ADCs in the 10-bit range. Activities and Societies:  Badminton Oregon State University Ph.D,  Analog Circuit Design 2005  – 2009 Thesis focused on low power high speed Nyquist rate ADCs in the 10-bit range. Activities and Societies:  Badminton Indian Institute of Technology, Madras B.Tech,  Electrical Engineering 2000  – 2004 Worked on a low power flash ADC for final year project with typical application in disk drive read channels. Activities and Societies:  Badminton Indian Institute of Technology, Madras B.Tech,  Electrical Engineering 2000  – 2004 Worked on a low power flash ADC for final year project with typical application in disk drive read channels. Activities and Societies:  Badminton Indian Institute of Technology, Madras B.Tech,  Electrical Engineering 2000  – 2004 Worked on a low power flash ADC for final year project with typical application in disk drive read channels. Activities and Societies:  Badminton ", "Experience Senior Analog Design Engineer Intel Corporation June 2003  – Present (12 years 3 months) Portland, Oregon Area Component Design Engineer Intel Corporation June 1995  –  June 2003  (8 years 1 month) Portland, Oregon Area Senior Analog Design Engineer Intel Corporation June 2003  – Present (12 years 3 months) Portland, Oregon Area Senior Analog Design Engineer Intel Corporation June 2003  – Present (12 years 3 months) Portland, Oregon Area Component Design Engineer Intel Corporation June 1995  –  June 2003  (8 years 1 month) Portland, Oregon Area Component Design Engineer Intel Corporation June 1995  –  June 2003  (8 years 1 month) Portland, Oregon Area Skills Analog Cadence Virtuoso Testing Intel VLSI Static Timing Analysis Semiconductors Microprocessors Analog Circuit Design Hardware Architecture Verilog SoC C++ Embedded Systems JavaScript Circuit Design C Logic Design Simulations ASIC Physical Design Software Engineering IC Java Processors CMOS Integrated Circuit... EDA Mixed Signal FPGA Computer Architecture Microarchitecture Power Management LVS Signal Integrity Low-power Design ModelSim PCIe See 23+     See less Skills  Analog Cadence Virtuoso Testing Intel VLSI Static Timing Analysis Semiconductors Microprocessors Analog Circuit Design Hardware Architecture Verilog SoC C++ Embedded Systems JavaScript Circuit Design C Logic Design Simulations ASIC Physical Design Software Engineering IC Java Processors CMOS Integrated Circuit... EDA Mixed Signal FPGA Computer Architecture Microarchitecture Power Management LVS Signal Integrity Low-power Design ModelSim PCIe See 23+     See less Analog Cadence Virtuoso Testing Intel VLSI Static Timing Analysis Semiconductors Microprocessors Analog Circuit Design Hardware Architecture Verilog SoC C++ Embedded Systems JavaScript Circuit Design C Logic Design Simulations ASIC Physical Design Software Engineering IC Java Processors CMOS Integrated Circuit... EDA Mixed Signal FPGA Computer Architecture Microarchitecture Power Management LVS Signal Integrity Low-power Design ModelSim PCIe See 23+     See less Analog Cadence Virtuoso Testing Intel VLSI Static Timing Analysis Semiconductors Microprocessors Analog Circuit Design Hardware Architecture Verilog SoC C++ Embedded Systems JavaScript Circuit Design C Logic Design Simulations ASIC Physical Design Software Engineering IC Java Processors CMOS Integrated Circuit... EDA Mixed Signal FPGA Computer Architecture Microarchitecture Power Management LVS Signal Integrity Low-power Design ModelSim PCIe See 23+     See less Education Oregon Graduate Institute MSEE 慶応義塾大学 / Keio University Oregon Graduate Institute MSEE Oregon Graduate Institute MSEE Oregon Graduate Institute MSEE 慶応義塾大学 / Keio University 慶応義塾大学 / Keio University 慶応義塾大学 / Keio University ", "Summary A Silicon Design Architect with 7+ years of analog integration expertize - pioneering and productizing new mixed signal methodologies. Background as an Analog Engineer includes 10+ years of experience in complete lifecycle of analog circuits with emphasis on clocking, preamps, ADCs – from architecture choice, design, validation, silicon test and debug to yield improvement for PRQ. Summary A Silicon Design Architect with 7+ years of analog integration expertize - pioneering and productizing new mixed signal methodologies. Background as an Analog Engineer includes 10+ years of experience in complete lifecycle of analog circuits with emphasis on clocking, preamps, ADCs – from architecture choice, design, validation, silicon test and debug to yield improvement for PRQ. A Silicon Design Architect with 7+ years of analog integration expertize - pioneering and productizing new mixed signal methodologies. Background as an Analog Engineer includes 10+ years of experience in complete lifecycle of analog circuits with emphasis on clocking, preamps, ADCs – from architecture choice, design, validation, silicon test and debug to yield improvement for PRQ. A Silicon Design Architect with 7+ years of analog integration expertize - pioneering and productizing new mixed signal methodologies. Background as an Analog Engineer includes 10+ years of experience in complete lifecycle of analog circuits with emphasis on clocking, preamps, ADCs – from architecture choice, design, validation, silicon test and debug to yield improvement for PRQ. Experience Silicon Design Architect Intel Corporation 2011  – Present (4 years) Hillsboro, OR Integration lead for Knight Landing's DDR I/O owning timing convergence, driving backend and UPF related RTL edits, spec'ing IP collateral and delivering all partitions  \nTechnical Integration Lead for integration of clock generation units in Knight’s Corner. Mentored new-hires and provided training to ramp them up on challenges of Analog Integration. \nResponsible for the pioneering and integration of the Video-Interface PLL, core PLL and the DDR \nPLL into the processor i.e. synthesis of the digital logic, backend APR and timing convergence. Senior Analog Design Engineer Intel Corporation 2007  –  2011  (4 years) Hillsboro, OR Owned the system-level jitter analysis and budgeting for reference clock on multi-core GPU \ncodenamed Knight’s Corner. Implemented a low-jitter reference clock distribution on-die. \nDesigned a 6GHz programmable 50% duty cycle divider and high speed debug IO to view VCO \nsignals upto 4GHz.  \nDesigned sideband IO interfaces for Intel’s new graphic processor codenamed Larrabee. This involved design of the IO buffers and timing convergence with the remainder of the chip. Preamp Design Engineer Agere Systems Inc 2004  –  2007  (3 years) Mendota Heights, MN Designed and supervised IC layout of multiple generations of low-power SiGe reader preamp for a fast write-to-read recovery in the Current- and Voltage-Sense Mode for T/GMR heads with 6X variation. Involved in test and silicon-debug to identify top contributors to yield-loss. Some of the issues \nwere traced to process issues. Proposed and implemented design fixes to improve yield numbers. Mixed Signal Design Engineer Texas Instruments 2000  –  2002  (2 years) Bengaluru Area, India Designed a 15-bit 50MSPS Pipeline ADC and implemented the 3-bit first stage of the ADC using \nswitched capacitor circuit technique. Designed low-noise digital pad-output buffers at 40MSPS with DDR clocking at 3V CMOS levels to prevent supply/substrate noise coupling to on-chip analog circuitry. Designed a μV resolution DAC employing charge accumulation technique which is used for the feedback path of a control system for channel parameters. \nArchitected and implemented a 15K gate digital control sub-system including modules for serial \ncommunication, feedback-based control for channel parameters and digital filters. \n Silicon Design Architect Intel Corporation 2011  – Present (4 years) Hillsboro, OR Integration lead for Knight Landing's DDR I/O owning timing convergence, driving backend and UPF related RTL edits, spec'ing IP collateral and delivering all partitions  \nTechnical Integration Lead for integration of clock generation units in Knight’s Corner. Mentored new-hires and provided training to ramp them up on challenges of Analog Integration. \nResponsible for the pioneering and integration of the Video-Interface PLL, core PLL and the DDR \nPLL into the processor i.e. synthesis of the digital logic, backend APR and timing convergence. Silicon Design Architect Intel Corporation 2011  – Present (4 years) Hillsboro, OR Integration lead for Knight Landing's DDR I/O owning timing convergence, driving backend and UPF related RTL edits, spec'ing IP collateral and delivering all partitions  \nTechnical Integration Lead for integration of clock generation units in Knight’s Corner. Mentored new-hires and provided training to ramp them up on challenges of Analog Integration. \nResponsible for the pioneering and integration of the Video-Interface PLL, core PLL and the DDR \nPLL into the processor i.e. synthesis of the digital logic, backend APR and timing convergence. Senior Analog Design Engineer Intel Corporation 2007  –  2011  (4 years) Hillsboro, OR Owned the system-level jitter analysis and budgeting for reference clock on multi-core GPU \ncodenamed Knight’s Corner. Implemented a low-jitter reference clock distribution on-die. \nDesigned a 6GHz programmable 50% duty cycle divider and high speed debug IO to view VCO \nsignals upto 4GHz.  \nDesigned sideband IO interfaces for Intel’s new graphic processor codenamed Larrabee. This involved design of the IO buffers and timing convergence with the remainder of the chip. Senior Analog Design Engineer Intel Corporation 2007  –  2011  (4 years) Hillsboro, OR Owned the system-level jitter analysis and budgeting for reference clock on multi-core GPU \ncodenamed Knight’s Corner. Implemented a low-jitter reference clock distribution on-die. \nDesigned a 6GHz programmable 50% duty cycle divider and high speed debug IO to view VCO \nsignals upto 4GHz.  \nDesigned sideband IO interfaces for Intel’s new graphic processor codenamed Larrabee. This involved design of the IO buffers and timing convergence with the remainder of the chip. Preamp Design Engineer Agere Systems Inc 2004  –  2007  (3 years) Mendota Heights, MN Designed and supervised IC layout of multiple generations of low-power SiGe reader preamp for a fast write-to-read recovery in the Current- and Voltage-Sense Mode for T/GMR heads with 6X variation. Involved in test and silicon-debug to identify top contributors to yield-loss. Some of the issues \nwere traced to process issues. Proposed and implemented design fixes to improve yield numbers. Preamp Design Engineer Agere Systems Inc 2004  –  2007  (3 years) Mendota Heights, MN Designed and supervised IC layout of multiple generations of low-power SiGe reader preamp for a fast write-to-read recovery in the Current- and Voltage-Sense Mode for T/GMR heads with 6X variation. Involved in test and silicon-debug to identify top contributors to yield-loss. Some of the issues \nwere traced to process issues. Proposed and implemented design fixes to improve yield numbers. Mixed Signal Design Engineer Texas Instruments 2000  –  2002  (2 years) Bengaluru Area, India Designed a 15-bit 50MSPS Pipeline ADC and implemented the 3-bit first stage of the ADC using \nswitched capacitor circuit technique. Designed low-noise digital pad-output buffers at 40MSPS with DDR clocking at 3V CMOS levels to prevent supply/substrate noise coupling to on-chip analog circuitry. Designed a μV resolution DAC employing charge accumulation technique which is used for the feedback path of a control system for channel parameters. \nArchitected and implemented a 15K gate digital control sub-system including modules for serial \ncommunication, feedback-based control for channel parameters and digital filters. \n Mixed Signal Design Engineer Texas Instruments 2000  –  2002  (2 years) Bengaluru Area, India Designed a 15-bit 50MSPS Pipeline ADC and implemented the 3-bit first stage of the ADC using \nswitched capacitor circuit technique. Designed low-noise digital pad-output buffers at 40MSPS with DDR clocking at 3V CMOS levels to prevent supply/substrate noise coupling to on-chip analog circuitry. Designed a μV resolution DAC employing charge accumulation technique which is used for the feedback path of a control system for channel parameters. \nArchitected and implemented a 15K gate digital control sub-system including modules for serial \ncommunication, feedback-based control for channel parameters and digital filters. \n Languages English Full professional proficiency Kannada Native or bilingual proficiency Hindi Elementary proficiency English Full professional proficiency Kannada Native or bilingual proficiency Hindi Elementary proficiency English Full professional proficiency Kannada Native or bilingual proficiency Hindi Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Analog Simulations Mixed Signal Semiconductors IC Analog Circuit Design FPGA Circuit Design Integration Perl Matlab VLSI ASIC Verilog SoC Skills  Analog Simulations Mixed Signal Semiconductors IC Analog Circuit Design FPGA Circuit Design Integration Perl Matlab VLSI ASIC Verilog SoC Analog Simulations Mixed Signal Semiconductors IC Analog Circuit Design FPGA Circuit Design Integration Perl Matlab VLSI ASIC Verilog SoC Analog Simulations Mixed Signal Semiconductors IC Analog Circuit Design FPGA Circuit Design Integration Perl Matlab VLSI ASIC Verilog SoC Education University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Electrical Engineering 2004  – 2011 Research Topics: \nMulti-rate Sigma Delta ADC with better anti-aliasing than the traditional Sigma Delta ADC. \nLow-power N-Tone Sigma Delta ADC for efficient spectral use in an UWB communication system. \nMulti-Lane 12Gbps CMOS PRBS generator to test transceiver with cross-talk cancellation \n University of Minnesota-Twin Cities M.S.,  Electrical Engineering 2002  – 2004 Teaching Assistant for graduate and undergraduate Analog and RF Design courses and labs \n Activities and Societies:  Analog Design Group R. V. College of Engineering, Bangalore B.E.,  Electronics and Communications 1996  – 2000 University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Electrical Engineering 2004  – 2011 Research Topics: \nMulti-rate Sigma Delta ADC with better anti-aliasing than the traditional Sigma Delta ADC. \nLow-power N-Tone Sigma Delta ADC for efficient spectral use in an UWB communication system. \nMulti-Lane 12Gbps CMOS PRBS generator to test transceiver with cross-talk cancellation \n University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Electrical Engineering 2004  – 2011 Research Topics: \nMulti-rate Sigma Delta ADC with better anti-aliasing than the traditional Sigma Delta ADC. \nLow-power N-Tone Sigma Delta ADC for efficient spectral use in an UWB communication system. \nMulti-Lane 12Gbps CMOS PRBS generator to test transceiver with cross-talk cancellation \n University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Electrical Engineering 2004  – 2011 Research Topics: \nMulti-rate Sigma Delta ADC with better anti-aliasing than the traditional Sigma Delta ADC. \nLow-power N-Tone Sigma Delta ADC for efficient spectral use in an UWB communication system. \nMulti-Lane 12Gbps CMOS PRBS generator to test transceiver with cross-talk cancellation \n University of Minnesota-Twin Cities M.S.,  Electrical Engineering 2002  – 2004 Teaching Assistant for graduate and undergraduate Analog and RF Design courses and labs \n Activities and Societies:  Analog Design Group University of Minnesota-Twin Cities M.S.,  Electrical Engineering 2002  – 2004 Teaching Assistant for graduate and undergraduate Analog and RF Design courses and labs \n Activities and Societies:  Analog Design Group University of Minnesota-Twin Cities M.S.,  Electrical Engineering 2002  – 2004 Teaching Assistant for graduate and undergraduate Analog and RF Design courses and labs \n Activities and Societies:  Analog Design Group R. V. College of Engineering, Bangalore B.E.,  Electronics and Communications 1996  – 2000 R. V. College of Engineering, Bangalore B.E.,  Electronics and Communications 1996  – 2000 R. V. College of Engineering, Bangalore B.E.,  Electronics and Communications 1996  – 2000 ", "Languages   Skills Verilog Wireless VLSI ASIC Analog Analog Circuit Design IC Sensors CMOS Mixed Signal SoC EDA Semiconductors Circuit Design Integrated Circuit... PLL RTL design SystemVerilog Power Management Low-power Design Microprocessors Processors Hardware Architecture Project Management Team Leadership See 10+     See less Skills  Verilog Wireless VLSI ASIC Analog Analog Circuit Design IC Sensors CMOS Mixed Signal SoC EDA Semiconductors Circuit Design Integrated Circuit... PLL RTL design SystemVerilog Power Management Low-power Design Microprocessors Processors Hardware Architecture Project Management Team Leadership See 10+     See less Verilog Wireless VLSI ASIC Analog Analog Circuit Design IC Sensors CMOS Mixed Signal SoC EDA Semiconductors Circuit Design Integrated Circuit... PLL RTL design SystemVerilog Power Management Low-power Design Microprocessors Processors Hardware Architecture Project Management Team Leadership See 10+     See less Verilog Wireless VLSI ASIC Analog Analog Circuit Design IC Sensors CMOS Mixed Signal SoC EDA Semiconductors Circuit Design Integrated Circuit... PLL RTL design SystemVerilog Power Management Low-power Design Microprocessors Processors Hardware Architecture Project Management Team Leadership See 10+     See less Honors & Awards ", "Summary I am looking for challenging career opportunities in the field of Analog, RF or Mixed-Signal VLSI Circuit Design. Summary I am looking for challenging career opportunities in the field of Analog, RF or Mixed-Signal VLSI Circuit Design. I am looking for challenging career opportunities in the field of Analog, RF or Mixed-Signal VLSI Circuit Design. I am looking for challenging career opportunities in the field of Analog, RF or Mixed-Signal VLSI Circuit Design. Experience Analog Design Engineer Intel Corporation May 2012  – Present (3 years 4 months) San Francisco Bay Area Designing Analog Circuits for High-speed I/O applications. Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford, CA Teaching Assistant for Fundamentals of Analog Integrated Circuit Design course. Intern Intel Corporation June 2011  –  September 2011  (4 months) Hillsboro, OR Analog Modeling Engineer Project Intern Texas Instruments January 2010  –  June 2010  (6 months) Bengaluru Area, India 'Improving Path-delay ATPG Using Directed Transition Fault Modeling':Implemented a new Fault Model - Directed Transition Fault Model, enabling testing of previously untestable timing-critical paths.Research Paper \"Hazard-aware Directed Transition Fault ATPG for Effective Critical Path Test\" accepted in 2011 International Conference on VLSI Design. Summer Trainee IGCAR May 2008  –  July 2008  (3 months) Kalpakkam, India 'Demodulator for Non-contact DVRT sensor using PSoC': Implemented signal processing for input signal generation, output signal demodulation, PSoC chip – LABVIEW interface and GUI for the user. Analog Design Engineer Intel Corporation May 2012  – Present (3 years 4 months) San Francisco Bay Area Designing Analog Circuits for High-speed I/O applications. Analog Design Engineer Intel Corporation May 2012  – Present (3 years 4 months) San Francisco Bay Area Designing Analog Circuits for High-speed I/O applications. Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford, CA Teaching Assistant for Fundamentals of Analog Integrated Circuit Design course. Teaching Assistant Stanford University September 2011  –  December 2011  (4 months) Stanford, CA Teaching Assistant for Fundamentals of Analog Integrated Circuit Design course. Intern Intel Corporation June 2011  –  September 2011  (4 months) Hillsboro, OR Analog Modeling Engineer Intern Intel Corporation June 2011  –  September 2011  (4 months) Hillsboro, OR Analog Modeling Engineer Project Intern Texas Instruments January 2010  –  June 2010  (6 months) Bengaluru Area, India 'Improving Path-delay ATPG Using Directed Transition Fault Modeling':Implemented a new Fault Model - Directed Transition Fault Model, enabling testing of previously untestable timing-critical paths.Research Paper \"Hazard-aware Directed Transition Fault ATPG for Effective Critical Path Test\" accepted in 2011 International Conference on VLSI Design. Project Intern Texas Instruments January 2010  –  June 2010  (6 months) Bengaluru Area, India 'Improving Path-delay ATPG Using Directed Transition Fault Modeling':Implemented a new Fault Model - Directed Transition Fault Model, enabling testing of previously untestable timing-critical paths.Research Paper \"Hazard-aware Directed Transition Fault ATPG for Effective Critical Path Test\" accepted in 2011 International Conference on VLSI Design. Summer Trainee IGCAR May 2008  –  July 2008  (3 months) Kalpakkam, India 'Demodulator for Non-contact DVRT sensor using PSoC': Implemented signal processing for input signal generation, output signal demodulation, PSoC chip – LABVIEW interface and GUI for the user. Summer Trainee IGCAR May 2008  –  July 2008  (3 months) Kalpakkam, India 'Demodulator for Non-contact DVRT sensor using PSoC': Implemented signal processing for input signal generation, output signal demodulation, PSoC chip – LABVIEW interface and GUI for the user. Languages Hindi Gujarati English Hindi Gujarati English Hindi Gujarati English Skills VLSI Circuit Design Mixed Signal Analog Cadence Virtuoso Verilog SPICE Analog Circuit Design ModelSim Matlab Integrated Circuit... Pspice Spectre Cadence C CMOS Sensors ASIC Labview RTL design FPGA SystemVerilog EDA See 8+     See less Skills  VLSI Circuit Design Mixed Signal Analog Cadence Virtuoso Verilog SPICE Analog Circuit Design ModelSim Matlab Integrated Circuit... Pspice Spectre Cadence C CMOS Sensors ASIC Labview RTL design FPGA SystemVerilog EDA See 8+     See less VLSI Circuit Design Mixed Signal Analog Cadence Virtuoso Verilog SPICE Analog Circuit Design ModelSim Matlab Integrated Circuit... Pspice Spectre Cadence C CMOS Sensors ASIC Labview RTL design FPGA SystemVerilog EDA See 8+     See less VLSI Circuit Design Mixed Signal Analog Cadence Virtuoso Verilog SPICE Analog Circuit Design ModelSim Matlab Integrated Circuit... Pspice Spectre Cadence C CMOS Sensors ASIC Labview RTL design FPGA SystemVerilog EDA See 8+     See less Education Stanford University M.S.,  Electronics Engineering , 4.092/4.0 2010  – 2012 Birla Institute of Technology and Science B.E. (Hons.),  Electrical and Electronics Engineering , 10.0/10.0 2006  – 2010 Stanford University M.S.,  Electronics Engineering , 4.092/4.0 2010  – 2012 Stanford University M.S.,  Electronics Engineering , 4.092/4.0 2010  – 2012 Stanford University M.S.,  Electronics Engineering , 4.092/4.0 2010  – 2012 Birla Institute of Technology and Science B.E. (Hons.),  Electrical and Electronics Engineering , 10.0/10.0 2006  – 2010 Birla Institute of Technology and Science B.E. (Hons.),  Electrical and Electronics Engineering , 10.0/10.0 2006  – 2010 Birla Institute of Technology and Science B.E. (Hons.),  Electrical and Electronics Engineering , 10.0/10.0 2006  – 2010 ", "Experience Senior Analog Design Engineer Intel Corporation October 2011  – Present (3 years 11 months) Greater Boston Area DDR3/4 Analog IO PHY circuit design for server processors in 22nm and 14nm. Integrated voltage regulator design in 10nm technology. Senior Analog Engineer Intel GmbH April 2006  –  October 2011  (5 years 7 months) Braunschweig Area, Germany Senior ASIC Mixed Signal Design Engineer Toshiba Electronics Europe GmbH January 2001  –  March 2006  (5 years 3 months) Design Engineer Fraunhofer Institute for Microelectronic Circuits and Systems, Duisburg, Germany April 1999  –  December 2000  (1 year 9 months) Senior Analog Design Engineer Intel Corporation October 2011  – Present (3 years 11 months) Greater Boston Area DDR3/4 Analog IO PHY circuit design for server processors in 22nm and 14nm. Integrated voltage regulator design in 10nm technology. Senior Analog Design Engineer Intel Corporation October 2011  – Present (3 years 11 months) Greater Boston Area DDR3/4 Analog IO PHY circuit design for server processors in 22nm and 14nm. Integrated voltage regulator design in 10nm technology. Senior Analog Engineer Intel GmbH April 2006  –  October 2011  (5 years 7 months) Braunschweig Area, Germany Senior Analog Engineer Intel GmbH April 2006  –  October 2011  (5 years 7 months) Braunschweig Area, Germany Senior ASIC Mixed Signal Design Engineer Toshiba Electronics Europe GmbH January 2001  –  March 2006  (5 years 3 months) Senior ASIC Mixed Signal Design Engineer Toshiba Electronics Europe GmbH January 2001  –  March 2006  (5 years 3 months) Design Engineer Fraunhofer Institute for Microelectronic Circuits and Systems, Duisburg, Germany April 1999  –  December 2000  (1 year 9 months) Design Engineer Fraunhofer Institute for Microelectronic Circuits and Systems, Duisburg, Germany April 1999  –  December 2000  (1 year 9 months) Languages German Native or bilingual proficiency English Full professional proficiency German Native or bilingual proficiency English Full professional proficiency German Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills ASIC CMOS Verilog Analog Circuit Design Circuit Design Static Timing Analysis Spectre Semiconductors Cadence SERDES SPICE DRC LVS Simulations Skills  ASIC CMOS Verilog Analog Circuit Design Circuit Design Static Timing Analysis Spectre Semiconductors Cadence SERDES SPICE DRC LVS Simulations ASIC CMOS Verilog Analog Circuit Design Circuit Design Static Timing Analysis Spectre Semiconductors Cadence SERDES SPICE DRC LVS Simulations ASIC CMOS Verilog Analog Circuit Design Circuit Design Static Timing Analysis Spectre Semiconductors Cadence SERDES SPICE DRC LVS Simulations Education Universität Duisburg-Essen, Standort Duisburg Dipl.-Ing. (eq. to M.S.+B.S.),  Electrical Engineering - Microelectronic 1995  – 1999 Universität Duisburg-Essen, Standort Duisburg Dipl.-Ing. (eq. to M.S.+B.S.),  Electrical Engineering - Microelectronic 1995  – 1999 Universität Duisburg-Essen, Standort Duisburg Dipl.-Ing. (eq. to M.S.+B.S.),  Electrical Engineering - Microelectronic 1995  – 1999 Universität Duisburg-Essen, Standort Duisburg Dipl.-Ing. (eq. to M.S.+B.S.),  Electrical Engineering - Microelectronic 1995  – 1999 Honors & Awards ", "Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Cadence Virtuoso Silicon Debug Analog Design Electrical Engineering Mixed Signal Circuit Design VLSI Analog Circuit Design CDR SERDES I/O Transmitters Debugging Analog IC CMOS See 1+     See less Skills  Cadence Virtuoso Silicon Debug Analog Design Electrical Engineering Mixed Signal Circuit Design VLSI Analog Circuit Design CDR SERDES I/O Transmitters Debugging Analog IC CMOS See 1+     See less Cadence Virtuoso Silicon Debug Analog Design Electrical Engineering Mixed Signal Circuit Design VLSI Analog Circuit Design CDR SERDES I/O Transmitters Debugging Analog IC CMOS See 1+     See less Cadence Virtuoso Silicon Debug Analog Design Electrical Engineering Mixed Signal Circuit Design VLSI Analog Circuit Design CDR SERDES I/O Transmitters Debugging Analog IC CMOS See 1+     See less ", "Experience senior analog design engineer Intel Corporation senior analog design engineer Intel Corporation senior analog design engineer Intel Corporation ", "Experience Analog Design Engineer & Member of Group Technical Staff Texas Instruments December 2013  – Present (1 year 9 months) Analog Design Manager Texas Instruments June 2011  –  November 2013  (2 years 6 months) Managing a group of 6-8 analog design and layout engineers. Lead designer. Senior Analog Design Engineer Texas Instruments June 2003  –  May 2011  (8 years) Dallas, TX Power Management - LDO, buck DC-DC controller, Shunt reference in bipolar, BCD process. Precision op amp. \nHigh Speed Interface - USB / DisplayPort / SATA / HDMI / Thunderbolt / LVDS  \n Senior Analog Design Engineer Intel Corporation January 2003  –  June 2003  (6 months) Chandler, AZ ADSL Analog Front End Analog Design Engineer & Member of Group Technical Staff Texas Instruments December 2013  – Present (1 year 9 months) Analog Design Engineer & Member of Group Technical Staff Texas Instruments December 2013  – Present (1 year 9 months) Analog Design Manager Texas Instruments June 2011  –  November 2013  (2 years 6 months) Managing a group of 6-8 analog design and layout engineers. Lead designer. Analog Design Manager Texas Instruments June 2011  –  November 2013  (2 years 6 months) Managing a group of 6-8 analog design and layout engineers. Lead designer. Senior Analog Design Engineer Texas Instruments June 2003  –  May 2011  (8 years) Dallas, TX Power Management - LDO, buck DC-DC controller, Shunt reference in bipolar, BCD process. Precision op amp. \nHigh Speed Interface - USB / DisplayPort / SATA / HDMI / Thunderbolt / LVDS  \n Senior Analog Design Engineer Texas Instruments June 2003  –  May 2011  (8 years) Dallas, TX Power Management - LDO, buck DC-DC controller, Shunt reference in bipolar, BCD process. Precision op amp. \nHigh Speed Interface - USB / DisplayPort / SATA / HDMI / Thunderbolt / LVDS  \n Senior Analog Design Engineer Intel Corporation January 2003  –  June 2003  (6 months) Chandler, AZ ADSL Analog Front End Senior Analog Design Engineer Intel Corporation January 2003  –  June 2003  (6 months) Chandler, AZ ADSL Analog Front End Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Analog Circuit Design Skills  Analog Circuit Design Analog Circuit Design Analog Circuit Design Education Iowa State University Ph.D.,  Analog and Mixed-signal VLSI 1997  – 2002 Iowa State University Ph.D.,  Analog and Mixed-signal VLSI 1997  – 2002 Iowa State University Ph.D.,  Analog and Mixed-signal VLSI 1997  – 2002 Iowa State University Ph.D.,  Analog and Mixed-signal VLSI 1997  – 2002 ", "Experience Senior Analog Design Engineer Dialog Semiconductor January 2014  – Present (1 year 8 months) Munich Area, Germany Senior Analog Design Engineer Dialog Semiconductor January 2014  – Present (1 year 8 months) Munich Area, Germany Senior Analog Design Engineer Dialog Semiconductor January 2014  – Present (1 year 8 months) Munich Area, Germany Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills VLSI Analog Circuit Design Analog Integrated Circuit... Mixed Signal SoC Static Timing Analysis PLL Power Supplies Debugging RTL design Semiconductors Processors PCIe Microprocessors ASIC Microarchitecture Verilog Physical Design Computer Architecture RTL coding SystemVerilog Functional Verification EDA Logic Design See 10+     See less Skills  VLSI Analog Circuit Design Analog Integrated Circuit... Mixed Signal SoC Static Timing Analysis PLL Power Supplies Debugging RTL design Semiconductors Processors PCIe Microprocessors ASIC Microarchitecture Verilog Physical Design Computer Architecture RTL coding SystemVerilog Functional Verification EDA Logic Design See 10+     See less VLSI Analog Circuit Design Analog Integrated Circuit... Mixed Signal SoC Static Timing Analysis PLL Power Supplies Debugging RTL design Semiconductors Processors PCIe Microprocessors ASIC Microarchitecture Verilog Physical Design Computer Architecture RTL coding SystemVerilog Functional Verification EDA Logic Design See 10+     See less VLSI Analog Circuit Design Analog Integrated Circuit... Mixed Signal SoC Static Timing Analysis PLL Power Supplies Debugging RTL design Semiconductors Processors PCIe Microprocessors ASIC Microarchitecture Verilog Physical Design Computer Architecture RTL coding SystemVerilog Functional Verification EDA Logic Design See 10+     See less ", "Languages English Native or bilingual proficiency Russian Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Matlab Signal Processing Radar Simulations Electrical Engineering Algorithms Statistical Signal... VLSI C Simulink Circuit Design Sensors IC Electromagnetics Analog Circuit Design CMOS Computer Architecture Fortran Mathematical Modeling Machine Learning Cadence Virtuoso Electronics Image Processing High Performance... Statistical Modeling Pattern Recognition LaTeX Linux Physics Numerical Analysis Optimization Digital Signal... Digital Signal... Labview Mathematica Programming See 21+     See less Skills  Matlab Signal Processing Radar Simulations Electrical Engineering Algorithms Statistical Signal... VLSI C Simulink Circuit Design Sensors IC Electromagnetics Analog Circuit Design CMOS Computer Architecture Fortran Mathematical Modeling Machine Learning Cadence Virtuoso Electronics Image Processing High Performance... Statistical Modeling Pattern Recognition LaTeX Linux Physics Numerical Analysis Optimization Digital Signal... Digital Signal... Labview Mathematica Programming See 21+     See less Matlab Signal Processing Radar Simulations Electrical Engineering Algorithms Statistical Signal... VLSI C Simulink Circuit Design Sensors IC Electromagnetics Analog Circuit Design CMOS Computer Architecture Fortran Mathematical Modeling Machine Learning Cadence Virtuoso Electronics Image Processing High Performance... Statistical Modeling Pattern Recognition LaTeX Linux Physics Numerical Analysis Optimization Digital Signal... Digital Signal... Labview Mathematica Programming See 21+     See less Matlab Signal Processing Radar Simulations Electrical Engineering Algorithms Statistical Signal... VLSI C Simulink Circuit Design Sensors IC Electromagnetics Analog Circuit Design CMOS Computer Architecture Fortran Mathematical Modeling Machine Learning Cadence Virtuoso Electronics Image Processing High Performance... Statistical Modeling Pattern Recognition LaTeX Linux Physics Numerical Analysis Optimization Digital Signal... Digital Signal... Labview Mathematica Programming See 21+     See less Honors & Awards 2014 IEEE-HKN C. Holmes MacDonald Outstanding Teacher Award IEEE-HKN November 2014 \"...for outstanding teaching performance, demonstrating exemplary ability in conveying understanding of complex material to his students while also stimulating deep interest in the subject matter.\" 2014 IEEE-HKN C. Holmes MacDonald Outstanding Teacher Award IEEE-HKN November 2014 \"...for outstanding teaching performance, demonstrating exemplary ability in conveying understanding of complex material to his students while also stimulating deep interest in the subject matter.\" 2014 IEEE-HKN C. Holmes MacDonald Outstanding Teacher Award IEEE-HKN November 2014 \"...for outstanding teaching performance, demonstrating exemplary ability in conveying understanding of complex material to his students while also stimulating deep interest in the subject matter.\" 2014 IEEE-HKN C. Holmes MacDonald Outstanding Teacher Award IEEE-HKN November 2014 \"...for outstanding teaching performance, demonstrating exemplary ability in conveying understanding of complex material to his students while also stimulating deep interest in the subject matter.\" ", "Experience Analog Designer 2 AMD October 2011  –  January 2014  (2 years 4 months) Toronto, Canada Area Analog Designer 1 AMD April 2010  –  October 2011  (1 year 7 months) AMD Research Analyst Versentech Holdings Inc. September 2006  –  December 2006  (4 months) Analog Designer 2 AMD October 2011  –  January 2014  (2 years 4 months) Toronto, Canada Area Analog Designer 2 AMD October 2011  –  January 2014  (2 years 4 months) Toronto, Canada Area Analog Designer 1 AMD April 2010  –  October 2011  (1 year 7 months) AMD Analog Designer 1 AMD April 2010  –  October 2011  (1 year 7 months) AMD Research Analyst Versentech Holdings Inc. September 2006  –  December 2006  (4 months) Research Analyst Versentech Holdings Inc. September 2006  –  December 2006  (4 months) Skills C++ Java JavaScript CSS C Skills  C++ Java JavaScript CSS C C++ Java JavaScript CSS C C++ Java JavaScript CSS C Education Seneca College Graduate Certificate 2009  – 2010 McGill University Bachelor of Engineering 2003  – 2008 Seneca College Graduate Certificate 2009  – 2010 Seneca College Graduate Certificate 2009  – 2010 Seneca College Graduate Certificate 2009  – 2010 McGill University Bachelor of Engineering 2003  – 2008 McGill University Bachelor of Engineering 2003  – 2008 McGill University Bachelor of Engineering 2003  – 2008 "]}