{"position": "Senior Program Manager", "company": "Intel Corporation", "profiles": ["Summary Over 15 years of experience in marketing, business development, corporate strategy, and software development. Demonstrated ability to succeed and get results in both large and small corporate environments. Summary Over 15 years of experience in marketing, business development, corporate strategy, and software development. Demonstrated ability to succeed and get results in both large and small corporate environments. Over 15 years of experience in marketing, business development, corporate strategy, and software development. Demonstrated ability to succeed and get results in both large and small corporate environments. Over 15 years of experience in marketing, business development, corporate strategy, and software development. Demonstrated ability to succeed and get results in both large and small corporate environments. Experience Product Manager Google March 2007  – Present (8 years 6 months) Founder and CEO Koonji, Inc. March 2006  –  March 2007  (1 year 1 month) Koonji (www.koonji.com) is changing the way how-to guides are created and used on the internet. Even as innovations have changed most of the other online tools, guides have stayed mostly the same for over a decade - static articles that are difficult to update and do not allow any interaction with the users. Koonji changes all that by focusing on the usage of the guides and incorporating the latest web 2.0 features to make it more collaborative and fun. Director Product Marketing Siperian November 2004  –  March 2006  (1 year 5 months) Strategy Consultant neoCortex May 2003  –  April 2004  (1 year) Provide consulting services in product strategy and product management (both inbound and outbound) to software companies of all sizes. Senior Director, Strategy and Business Development Peregrine Systems December 2001  –  June 2002  (7 months) Responsible for defining and implementing strategic partnership strategy (for portals, application servers etc.) for technology platform group. Analyzing business and financial analysis for entire company product portfolio to make grow-sell-harvest decisions. Vice President, Marketing and Business Development Bodha, Inc. (Acquired by Peregrine) November 1999  –  December 2001  (2 years 2 months) Responsible for all aspects of marketing, product management and strategic partnerships for the company. Business plans, MRD, white papers, product positioning, product strategy, market research and competitive analysis. Presenting to analysts, investors, shareholders and potential customers and partners. Senior Program Manager Intel Corporation December 1991  –  January 2000  (8 years 2 months) Develop strategy and form alliances with Microsoft, IBM, HP etc. to accelerate e-business adoption in the marketplace. Manage software stack readiness for Intel's first 64-bit processor platform launch. Develop CAD tools and platform for internal design engineers. Product Manager Google March 2007  – Present (8 years 6 months) Product Manager Google March 2007  – Present (8 years 6 months) Founder and CEO Koonji, Inc. March 2006  –  March 2007  (1 year 1 month) Koonji (www.koonji.com) is changing the way how-to guides are created and used on the internet. Even as innovations have changed most of the other online tools, guides have stayed mostly the same for over a decade - static articles that are difficult to update and do not allow any interaction with the users. Koonji changes all that by focusing on the usage of the guides and incorporating the latest web 2.0 features to make it more collaborative and fun. Founder and CEO Koonji, Inc. March 2006  –  March 2007  (1 year 1 month) Koonji (www.koonji.com) is changing the way how-to guides are created and used on the internet. Even as innovations have changed most of the other online tools, guides have stayed mostly the same for over a decade - static articles that are difficult to update and do not allow any interaction with the users. Koonji changes all that by focusing on the usage of the guides and incorporating the latest web 2.0 features to make it more collaborative and fun. Director Product Marketing Siperian November 2004  –  March 2006  (1 year 5 months) Director Product Marketing Siperian November 2004  –  March 2006  (1 year 5 months) Strategy Consultant neoCortex May 2003  –  April 2004  (1 year) Provide consulting services in product strategy and product management (both inbound and outbound) to software companies of all sizes. Strategy Consultant neoCortex May 2003  –  April 2004  (1 year) Provide consulting services in product strategy and product management (both inbound and outbound) to software companies of all sizes. Senior Director, Strategy and Business Development Peregrine Systems December 2001  –  June 2002  (7 months) Responsible for defining and implementing strategic partnership strategy (for portals, application servers etc.) for technology platform group. Analyzing business and financial analysis for entire company product portfolio to make grow-sell-harvest decisions. Senior Director, Strategy and Business Development Peregrine Systems December 2001  –  June 2002  (7 months) Responsible for defining and implementing strategic partnership strategy (for portals, application servers etc.) for technology platform group. Analyzing business and financial analysis for entire company product portfolio to make grow-sell-harvest decisions. Vice President, Marketing and Business Development Bodha, Inc. (Acquired by Peregrine) November 1999  –  December 2001  (2 years 2 months) Responsible for all aspects of marketing, product management and strategic partnerships for the company. Business plans, MRD, white papers, product positioning, product strategy, market research and competitive analysis. Presenting to analysts, investors, shareholders and potential customers and partners. Vice President, Marketing and Business Development Bodha, Inc. (Acquired by Peregrine) November 1999  –  December 2001  (2 years 2 months) Responsible for all aspects of marketing, product management and strategic partnerships for the company. Business plans, MRD, white papers, product positioning, product strategy, market research and competitive analysis. Presenting to analysts, investors, shareholders and potential customers and partners. Senior Program Manager Intel Corporation December 1991  –  January 2000  (8 years 2 months) Develop strategy and form alliances with Microsoft, IBM, HP etc. to accelerate e-business adoption in the marketplace. Manage software stack readiness for Intel's first 64-bit processor platform launch. Develop CAD tools and platform for internal design engineers. Senior Program Manager Intel Corporation December 1991  –  January 2000  (8 years 2 months) Develop strategy and form alliances with Microsoft, IBM, HP etc. to accelerate e-business adoption in the marketplace. Manage software stack readiness for Intel's first 64-bit processor platform launch. Develop CAD tools and platform for internal design engineers. Education Santa Clara University MBA,  Marketing ,  Finance ,  Entrepreneurship September 1994  – August 1996 Activities and Societies:  Beta Gamma Sigma University of Rochester Masters,  Computer Science August 1989  – May 1991 Indian Institute of Technology, Kanpur Bachelor of Technology,  Computer Science August 1985  – June 1989 Indian Institute Of Technology B. Tech.,  Computer Science 1985  – 1989 Santa Clara University MBA,  Marketing ,  Finance ,  Entrepreneurship September 1994  – August 1996 Activities and Societies:  Beta Gamma Sigma Santa Clara University MBA,  Marketing ,  Finance ,  Entrepreneurship September 1994  – August 1996 Activities and Societies:  Beta Gamma Sigma Santa Clara University MBA,  Marketing ,  Finance ,  Entrepreneurship September 1994  – August 1996 Activities and Societies:  Beta Gamma Sigma University of Rochester Masters,  Computer Science August 1989  – May 1991 University of Rochester Masters,  Computer Science August 1989  – May 1991 University of Rochester Masters,  Computer Science August 1989  – May 1991 Indian Institute of Technology, Kanpur Bachelor of Technology,  Computer Science August 1985  – June 1989 Indian Institute of Technology, Kanpur Bachelor of Technology,  Computer Science August 1985  – June 1989 Indian Institute of Technology, Kanpur Bachelor of Technology,  Computer Science August 1985  – June 1989 Indian Institute Of Technology B. Tech.,  Computer Science 1985  – 1989 Indian Institute Of Technology B. Tech.,  Computer Science 1985  – 1989 Indian Institute Of Technology B. Tech.,  Computer Science 1985  – 1989 ", "Skills Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less Skills  Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less Operational Excellence Program Management Cross-functional Team... Process Improvement Six Sigma Business Process... Project Management PMP Vendor Management Process Engineering Lean Manufacturing Operations Management Project Portfolio... Management Product Management SDLC Product Development Integration Leadership Change Management Manufacturing Testing Project Planning Business Process Business Strategy Strategy PMO Continuous Improvement Engineering Management MS Project Strategic Planning Quality Assurance Semiconductors Business Analysis Supply Chain Management Quality Management Team Leadership Supply Chain Analysis Software Project... Process Simulation Visio DMAIC Root Cause Analysis SPC Theory of Constraints Design of Experiments Value Stream Mapping Manufacturing Operations Electronics See 35+     See less ", "Languages   Skills Hardware Networking Aerospace PMP Cross-functional Team... SDLC Telecommunications Change Management Program Management Requirements Analysis Mergers Divestitures Product Management Strategy Project Management Business Process... System Architecture Agile Project Management Product Development VoIP Process Improvement Leadership MS Project Mergers & Acquisitions Team Leadership Embedded Systems Business Analysis PMO Resource Management Process Engineering Testing Visio Project Portfolio... Systems Engineering Vendor Management Agile Methodologies Wireless Unix Cloud Computing Mobile Devices Business Process Project Planning Management CRM Integration Quality Assurance Software Engineering SaaS Software Development Software Project... See 35+     See less Skills  Hardware Networking Aerospace PMP Cross-functional Team... SDLC Telecommunications Change Management Program Management Requirements Analysis Mergers Divestitures Product Management Strategy Project Management Business Process... System Architecture Agile Project Management Product Development VoIP Process Improvement Leadership MS Project Mergers & Acquisitions Team Leadership Embedded Systems Business Analysis PMO Resource Management Process Engineering Testing Visio Project Portfolio... Systems Engineering Vendor Management Agile Methodologies Wireless Unix Cloud Computing Mobile Devices Business Process Project Planning Management CRM Integration Quality Assurance Software Engineering SaaS Software Development Software Project... See 35+     See less Hardware Networking Aerospace PMP Cross-functional Team... SDLC Telecommunications Change Management Program Management Requirements Analysis Mergers Divestitures Product Management Strategy Project Management Business Process... System Architecture Agile Project Management Product Development VoIP Process Improvement Leadership MS Project Mergers & Acquisitions Team Leadership Embedded Systems Business Analysis PMO Resource Management Process Engineering Testing Visio Project Portfolio... Systems Engineering Vendor Management Agile Methodologies Wireless Unix Cloud Computing Mobile Devices Business Process Project Planning Management CRM Integration Quality Assurance Software Engineering SaaS Software Development Software Project... See 35+     See less Hardware Networking Aerospace PMP Cross-functional Team... SDLC Telecommunications Change Management Program Management Requirements Analysis Mergers Divestitures Product Management Strategy Project Management Business Process... System Architecture Agile Project Management Product Development VoIP Process Improvement Leadership MS Project Mergers & Acquisitions Team Leadership Embedded Systems Business Analysis PMO Resource Management Process Engineering Testing Visio Project Portfolio... Systems Engineering Vendor Management Agile Methodologies Wireless Unix Cloud Computing Mobile Devices Business Process Project Planning Management CRM Integration Quality Assurance Software Engineering SaaS Software Development Software Project... See 35+     See less Honors & Awards ", "Languages Hebrew English Hebrew English Hebrew English Skills Wireless Embedded Linux Embedded Software Debugging IP Program Management Technical Marketing Software Project... Embedded Systems Integration Device Drivers WLAN C Cross-functional Team... Semiconductors Linux WiFi See 2+     See less Skills  Wireless Embedded Linux Embedded Software Debugging IP Program Management Technical Marketing Software Project... Embedded Systems Integration Device Drivers WLAN C Cross-functional Team... Semiconductors Linux WiFi See 2+     See less Wireless Embedded Linux Embedded Software Debugging IP Program Management Technical Marketing Software Project... Embedded Systems Integration Device Drivers WLAN C Cross-functional Team... Semiconductors Linux WiFi See 2+     See less Wireless Embedded Linux Embedded Software Debugging IP Program Management Technical Marketing Software Project... Embedded Systems Integration Device Drivers WLAN C Cross-functional Team... Semiconductors Linux WiFi See 2+     See less ", "Summary Dynamic Senior Technology Leader with proven record in effectively directing technology projects, programs, and departments that expand reach across the enterprise, create greater efficiencies and facilitate sustainable growth. Recognized for improving profitability and performance by translating challenging business objectives into technology solutions. Cross-functional motivator leads top-performing teams through mission-critical initiatives, operational improvements and application development. Expert project and financial manager with excellent problem solving skills bridges gap between technology and business units to reverse negative trends and turn around underperforming programs.  \n \nSelect accomplishments: \n\tCost Reductions – Reduced manufacturing costs 30% for critical multi-function printer at Xerox. \n\tFacilitating Growth – Enabled more than $450M in office printer sales for Xerox since 2009. \n\tIncreased Efficiencies – Reduced product costs 30% and maintenance costs 15% by leading design, development, and implementation of hardware and software improvements. \n \nCore Competencies that Facilitate Growth: \n\tStrategy and Planning \n\tTechnical Operations Management \n\tTechnology Design and Deployment \n\tProcess Reengineering \n\tTechnology Integration \n\tProgram Integration  \n\tChange Management \n\tGo-to-Market Operations \n\tBenchmarking and Best Practices \n\tUser Experience \n\tSoftware Development \n\tInternational Program Leadership Summary Dynamic Senior Technology Leader with proven record in effectively directing technology projects, programs, and departments that expand reach across the enterprise, create greater efficiencies and facilitate sustainable growth. Recognized for improving profitability and performance by translating challenging business objectives into technology solutions. Cross-functional motivator leads top-performing teams through mission-critical initiatives, operational improvements and application development. Expert project and financial manager with excellent problem solving skills bridges gap between technology and business units to reverse negative trends and turn around underperforming programs.  \n \nSelect accomplishments: \n\tCost Reductions – Reduced manufacturing costs 30% for critical multi-function printer at Xerox. \n\tFacilitating Growth – Enabled more than $450M in office printer sales for Xerox since 2009. \n\tIncreased Efficiencies – Reduced product costs 30% and maintenance costs 15% by leading design, development, and implementation of hardware and software improvements. \n \nCore Competencies that Facilitate Growth: \n\tStrategy and Planning \n\tTechnical Operations Management \n\tTechnology Design and Deployment \n\tProcess Reengineering \n\tTechnology Integration \n\tProgram Integration  \n\tChange Management \n\tGo-to-Market Operations \n\tBenchmarking and Best Practices \n\tUser Experience \n\tSoftware Development \n\tInternational Program Leadership Dynamic Senior Technology Leader with proven record in effectively directing technology projects, programs, and departments that expand reach across the enterprise, create greater efficiencies and facilitate sustainable growth. Recognized for improving profitability and performance by translating challenging business objectives into technology solutions. Cross-functional motivator leads top-performing teams through mission-critical initiatives, operational improvements and application development. Expert project and financial manager with excellent problem solving skills bridges gap between technology and business units to reverse negative trends and turn around underperforming programs.  \n \nSelect accomplishments: \n\tCost Reductions – Reduced manufacturing costs 30% for critical multi-function printer at Xerox. \n\tFacilitating Growth – Enabled more than $450M in office printer sales for Xerox since 2009. \n\tIncreased Efficiencies – Reduced product costs 30% and maintenance costs 15% by leading design, development, and implementation of hardware and software improvements. \n \nCore Competencies that Facilitate Growth: \n\tStrategy and Planning \n\tTechnical Operations Management \n\tTechnology Design and Deployment \n\tProcess Reengineering \n\tTechnology Integration \n\tProgram Integration  \n\tChange Management \n\tGo-to-Market Operations \n\tBenchmarking and Best Practices \n\tUser Experience \n\tSoftware Development \n\tInternational Program Leadership Dynamic Senior Technology Leader with proven record in effectively directing technology projects, programs, and departments that expand reach across the enterprise, create greater efficiencies and facilitate sustainable growth. Recognized for improving profitability and performance by translating challenging business objectives into technology solutions. Cross-functional motivator leads top-performing teams through mission-critical initiatives, operational improvements and application development. Expert project and financial manager with excellent problem solving skills bridges gap between technology and business units to reverse negative trends and turn around underperforming programs.  \n \nSelect accomplishments: \n\tCost Reductions – Reduced manufacturing costs 30% for critical multi-function printer at Xerox. \n\tFacilitating Growth – Enabled more than $450M in office printer sales for Xerox since 2009. \n\tIncreased Efficiencies – Reduced product costs 30% and maintenance costs 15% by leading design, development, and implementation of hardware and software improvements. \n \nCore Competencies that Facilitate Growth: \n\tStrategy and Planning \n\tTechnical Operations Management \n\tTechnology Design and Deployment \n\tProcess Reengineering \n\tTechnology Integration \n\tProgram Integration  \n\tChange Management \n\tGo-to-Market Operations \n\tBenchmarking and Best Practices \n\tUser Experience \n\tSoftware Development \n\tInternational Program Leadership Experience Senior Engineering Manager Intel Corporation January 2015  – Present (8 months) Client Computing Group Senior Program Manager Intel Corporation January 2014  –  January 2015  (1 year 1 month) Client Computing Group Innovation Co-Development: System level product delivery, accountable for driving co-design and delivery of new 2 in 1 Tablet/PCs. Engineering Manager Intel Corporation 2014  –  2015  (1 year) Engineering Manager Intel Corporation 2014  –  2015  (1 year) Senior Program Manager Intel Corporation November 2012  –  January 2014  (1 year 3 months) Intel Media Deliver bluetooth and connected accessories in close partnership witih ODMs and direct engineering. Accountable for delivery of remote and wired controls and adapters. Accountable for delivery of system packaging out of box experience to ID intent design. \nAchieved high volume production readiness with multiple ODM suppliers on aggressive schedules. Senior Program Manager Xerox (formerly Tektronix Printer Business) 2009  –  November 2012  (3 years) Promoted to lead development and delivery of new clean-sheet redesign of one of company's top-selling products, including 900-part printer and controller-based software. Oversee product delivery, strategy development, product definition and capability determination, customer satisfaction, and procedure development. Provide support for teams involved in maintaining other products. Direct Program Office of four technical program managers and more than 100 indirect, matrixed reports. Decision authority on acceptance and usability requirements. \n\tBuilt management team and monitored software and hardware team performance. \n\tAchieved 30% decrease in energy usage for product in field. \n\tResolved several definition-phase issues and delivered product projected to produce $300M in first year. \n\tImproved development effectiveness by program integration of Agile team methodologies. Program Manager Xerox (formerly Tektronix Printer Business) 2005  –  2009  (4 years) Selected to lead program operations for design, development, and delivery of company's groundbreaking first solid-ink, clean-sheet technology platform. Program included directing hardware and software design efforts in US, England, and Canada, with additional contract software development partners in Singapore and Shanghai. Oversaw scheduling, validation, beta testing, transition to manufacturing, and delivery to market. Coordinated testing at beta customer sites. Managed Program Office. Supervised seven technical program managers and more than 100 engineers in matrixed environment. Completed three-month software customer release cycles by utilizing Sprint teams. \n\tDeveloped and implemented highly effective product validation customer feedback processes. \n\tEnabled $450M in sales from 2009 to 2011. \n\tSaved $1M by delivering product that performed 20% better than projected in first six months. \n\tDelivered product that achieved 100% of year-one sales plan ($90M) in first six months following release. \n\tMaximized software development efficiency by program integration of SCRUM teams. \n\tAchieved better than 90% customer satisfaction in Americas, Europe, and Asia. Master Black Belt - Lean Process Xerox 2002  –  2005  (3 years) Member of Corporate Lean Six Sigma (LSS) team that spearheaded company's transition to Lean Six Sigma. Instructed classes, coached Green and Black belts, and led LSS projects. Developed class materials and assisted with development corporate LSS strategy.  \n\tFacilitated implementation of global LSS culture in US, Europe, Brazil, and other markets. \n\tContributed to millions of dollars in savings by coaching and training more than 500 Green and Black belts over two-year period. \n\tSaved more than $500K in two-years by leading cross-organizational projects. \n\tAchieved better than 95% student satisfaction in training classes. Technical Program Manager - International Delivery Team Xerox 2000  –  2002  (2 years) Led design and delivery of follow-on product to innovative multi-function office printer designed and released in 1992. Supervised five design and technical managers, 15 engineers, and 25 matrixed engineers in US and Canada. Developed and managed joint design team. Created team and program structure. \n\tSaved $450K by improving reliability two times and thereby reducing service calls. \n\tDelivered five software solutions, utilizing CIM Level 3 methodologies to reduce bugs, increase delivery speeds, and ensure all critical content ready for launches. \n\tConsistently achieved 9% or better customer satisfaction. Technical Program Manager - New Product Variant/Asia Launch Xerox 1996  –  2000  (4 years) Built and led team that designed and delivered first variants of multi-function office printer product. Coordinated integration of design and technical resources in Brazil, Mexico, Canada, and New York. \n\tMet 100% of all first-year requirements and transitioned product to manufacturing on time. \n\tDelivered product whose customer satisfaction was consistently 8% higher than average. \n \nMember of team charged with expanding office printer release to worldwide markets. Translated international requirements to US-designed platform. Led product performance validations. \n\tSelected to lead launch of product in Japan. System Integration Manager Xerox 1992  –  1996  (4 years) Actively involved in all aspects of product design and development for multi-function printer, including software, electrical, and mechanical design, image quality, requirements, and manufacturability. Supervised team of seven. Software Debug Engineer - Mfg Quality/Test Engineer Xerox 1987  –  1992  (5 years) Co-op Engineering Student Delphi - General Motors 1982  –  1987  (5 years) Kokomo, IN Senior Engineering Manager Intel Corporation January 2015  – Present (8 months) Client Computing Group Senior Engineering Manager Intel Corporation January 2015  – Present (8 months) Client Computing Group Senior Program Manager Intel Corporation January 2014  –  January 2015  (1 year 1 month) Client Computing Group Innovation Co-Development: System level product delivery, accountable for driving co-design and delivery of new 2 in 1 Tablet/PCs. Senior Program Manager Intel Corporation January 2014  –  January 2015  (1 year 1 month) Client Computing Group Innovation Co-Development: System level product delivery, accountable for driving co-design and delivery of new 2 in 1 Tablet/PCs. Engineering Manager Intel Corporation 2014  –  2015  (1 year) Engineering Manager Intel Corporation 2014  –  2015  (1 year) Engineering Manager Intel Corporation 2014  –  2015  (1 year) Engineering Manager Intel Corporation 2014  –  2015  (1 year) Senior Program Manager Intel Corporation November 2012  –  January 2014  (1 year 3 months) Intel Media Deliver bluetooth and connected accessories in close partnership witih ODMs and direct engineering. Accountable for delivery of remote and wired controls and adapters. Accountable for delivery of system packaging out of box experience to ID intent design. \nAchieved high volume production readiness with multiple ODM suppliers on aggressive schedules. Senior Program Manager Intel Corporation November 2012  –  January 2014  (1 year 3 months) Intel Media Deliver bluetooth and connected accessories in close partnership witih ODMs and direct engineering. Accountable for delivery of remote and wired controls and adapters. Accountable for delivery of system packaging out of box experience to ID intent design. \nAchieved high volume production readiness with multiple ODM suppliers on aggressive schedules. Senior Program Manager Xerox (formerly Tektronix Printer Business) 2009  –  November 2012  (3 years) Promoted to lead development and delivery of new clean-sheet redesign of one of company's top-selling products, including 900-part printer and controller-based software. Oversee product delivery, strategy development, product definition and capability determination, customer satisfaction, and procedure development. Provide support for teams involved in maintaining other products. Direct Program Office of four technical program managers and more than 100 indirect, matrixed reports. Decision authority on acceptance and usability requirements. \n\tBuilt management team and monitored software and hardware team performance. \n\tAchieved 30% decrease in energy usage for product in field. \n\tResolved several definition-phase issues and delivered product projected to produce $300M in first year. \n\tImproved development effectiveness by program integration of Agile team methodologies. Senior Program Manager Xerox (formerly Tektronix Printer Business) 2009  –  November 2012  (3 years) Promoted to lead development and delivery of new clean-sheet redesign of one of company's top-selling products, including 900-part printer and controller-based software. Oversee product delivery, strategy development, product definition and capability determination, customer satisfaction, and procedure development. Provide support for teams involved in maintaining other products. Direct Program Office of four technical program managers and more than 100 indirect, matrixed reports. Decision authority on acceptance and usability requirements. \n\tBuilt management team and monitored software and hardware team performance. \n\tAchieved 30% decrease in energy usage for product in field. \n\tResolved several definition-phase issues and delivered product projected to produce $300M in first year. \n\tImproved development effectiveness by program integration of Agile team methodologies. Program Manager Xerox (formerly Tektronix Printer Business) 2005  –  2009  (4 years) Selected to lead program operations for design, development, and delivery of company's groundbreaking first solid-ink, clean-sheet technology platform. Program included directing hardware and software design efforts in US, England, and Canada, with additional contract software development partners in Singapore and Shanghai. Oversaw scheduling, validation, beta testing, transition to manufacturing, and delivery to market. Coordinated testing at beta customer sites. Managed Program Office. Supervised seven technical program managers and more than 100 engineers in matrixed environment. Completed three-month software customer release cycles by utilizing Sprint teams. \n\tDeveloped and implemented highly effective product validation customer feedback processes. \n\tEnabled $450M in sales from 2009 to 2011. \n\tSaved $1M by delivering product that performed 20% better than projected in first six months. \n\tDelivered product that achieved 100% of year-one sales plan ($90M) in first six months following release. \n\tMaximized software development efficiency by program integration of SCRUM teams. \n\tAchieved better than 90% customer satisfaction in Americas, Europe, and Asia. Program Manager Xerox (formerly Tektronix Printer Business) 2005  –  2009  (4 years) Selected to lead program operations for design, development, and delivery of company's groundbreaking first solid-ink, clean-sheet technology platform. Program included directing hardware and software design efforts in US, England, and Canada, with additional contract software development partners in Singapore and Shanghai. Oversaw scheduling, validation, beta testing, transition to manufacturing, and delivery to market. Coordinated testing at beta customer sites. Managed Program Office. Supervised seven technical program managers and more than 100 engineers in matrixed environment. Completed three-month software customer release cycles by utilizing Sprint teams. \n\tDeveloped and implemented highly effective product validation customer feedback processes. \n\tEnabled $450M in sales from 2009 to 2011. \n\tSaved $1M by delivering product that performed 20% better than projected in first six months. \n\tDelivered product that achieved 100% of year-one sales plan ($90M) in first six months following release. \n\tMaximized software development efficiency by program integration of SCRUM teams. \n\tAchieved better than 90% customer satisfaction in Americas, Europe, and Asia. Master Black Belt - Lean Process Xerox 2002  –  2005  (3 years) Member of Corporate Lean Six Sigma (LSS) team that spearheaded company's transition to Lean Six Sigma. Instructed classes, coached Green and Black belts, and led LSS projects. Developed class materials and assisted with development corporate LSS strategy.  \n\tFacilitated implementation of global LSS culture in US, Europe, Brazil, and other markets. \n\tContributed to millions of dollars in savings by coaching and training more than 500 Green and Black belts over two-year period. \n\tSaved more than $500K in two-years by leading cross-organizational projects. \n\tAchieved better than 95% student satisfaction in training classes. Master Black Belt - Lean Process Xerox 2002  –  2005  (3 years) Member of Corporate Lean Six Sigma (LSS) team that spearheaded company's transition to Lean Six Sigma. Instructed classes, coached Green and Black belts, and led LSS projects. Developed class materials and assisted with development corporate LSS strategy.  \n\tFacilitated implementation of global LSS culture in US, Europe, Brazil, and other markets. \n\tContributed to millions of dollars in savings by coaching and training more than 500 Green and Black belts over two-year period. \n\tSaved more than $500K in two-years by leading cross-organizational projects. \n\tAchieved better than 95% student satisfaction in training classes. Technical Program Manager - International Delivery Team Xerox 2000  –  2002  (2 years) Led design and delivery of follow-on product to innovative multi-function office printer designed and released in 1992. Supervised five design and technical managers, 15 engineers, and 25 matrixed engineers in US and Canada. Developed and managed joint design team. Created team and program structure. \n\tSaved $450K by improving reliability two times and thereby reducing service calls. \n\tDelivered five software solutions, utilizing CIM Level 3 methodologies to reduce bugs, increase delivery speeds, and ensure all critical content ready for launches. \n\tConsistently achieved 9% or better customer satisfaction. Technical Program Manager - International Delivery Team Xerox 2000  –  2002  (2 years) Led design and delivery of follow-on product to innovative multi-function office printer designed and released in 1992. Supervised five design and technical managers, 15 engineers, and 25 matrixed engineers in US and Canada. Developed and managed joint design team. Created team and program structure. \n\tSaved $450K by improving reliability two times and thereby reducing service calls. \n\tDelivered five software solutions, utilizing CIM Level 3 methodologies to reduce bugs, increase delivery speeds, and ensure all critical content ready for launches. \n\tConsistently achieved 9% or better customer satisfaction. Technical Program Manager - New Product Variant/Asia Launch Xerox 1996  –  2000  (4 years) Built and led team that designed and delivered first variants of multi-function office printer product. Coordinated integration of design and technical resources in Brazil, Mexico, Canada, and New York. \n\tMet 100% of all first-year requirements and transitioned product to manufacturing on time. \n\tDelivered product whose customer satisfaction was consistently 8% higher than average. \n \nMember of team charged with expanding office printer release to worldwide markets. Translated international requirements to US-designed platform. Led product performance validations. \n\tSelected to lead launch of product in Japan. Technical Program Manager - New Product Variant/Asia Launch Xerox 1996  –  2000  (4 years) Built and led team that designed and delivered first variants of multi-function office printer product. Coordinated integration of design and technical resources in Brazil, Mexico, Canada, and New York. \n\tMet 100% of all first-year requirements and transitioned product to manufacturing on time. \n\tDelivered product whose customer satisfaction was consistently 8% higher than average. \n \nMember of team charged with expanding office printer release to worldwide markets. Translated international requirements to US-designed platform. Led product performance validations. \n\tSelected to lead launch of product in Japan. System Integration Manager Xerox 1992  –  1996  (4 years) Actively involved in all aspects of product design and development for multi-function printer, including software, electrical, and mechanical design, image quality, requirements, and manufacturability. Supervised team of seven. System Integration Manager Xerox 1992  –  1996  (4 years) Actively involved in all aspects of product design and development for multi-function printer, including software, electrical, and mechanical design, image quality, requirements, and manufacturability. Supervised team of seven. Software Debug Engineer - Mfg Quality/Test Engineer Xerox 1987  –  1992  (5 years) Software Debug Engineer - Mfg Quality/Test Engineer Xerox 1987  –  1992  (5 years) Co-op Engineering Student Delphi - General Motors 1982  –  1987  (5 years) Kokomo, IN Co-op Engineering Student Delphi - General Motors 1982  –  1987  (5 years) Kokomo, IN Skills Program Management Product Delivery Cross-functional Team... Complexity Management Product Strategy Business Case Coaching System Integration Consumer Research Organizational... Matrix Management Lean Six Sigma Process Re-engineering System Validation Manufacturing... Program & Project... Situational Leadership Mentoring/Coaching Technology Integration Technology Operations... Revenue & Profit Growth Change Management Go-to-market Operations Usability Requirements International Program... Program Integration... Strategic Technology... Leadership Six Sigma Integration Product Development Training Lean Manufacturing Strategic Planning Process Improvement Software Development Project Planning Product Management Manufacturing Systems Engineering Business Process... Operations Management Design for Manufacturing Marketing Research Computer System... Business Process... See 31+     See less Skills  Program Management Product Delivery Cross-functional Team... Complexity Management Product Strategy Business Case Coaching System Integration Consumer Research Organizational... Matrix Management Lean Six Sigma Process Re-engineering System Validation Manufacturing... Program & Project... Situational Leadership Mentoring/Coaching Technology Integration Technology Operations... Revenue & Profit Growth Change Management Go-to-market Operations Usability Requirements International Program... Program Integration... Strategic Technology... Leadership Six Sigma Integration Product Development Training Lean Manufacturing Strategic Planning Process Improvement Software Development Project Planning Product Management Manufacturing Systems Engineering Business Process... Operations Management Design for Manufacturing Marketing Research Computer System... Business Process... See 31+     See less Program Management Product Delivery Cross-functional Team... Complexity Management Product Strategy Business Case Coaching System Integration Consumer Research Organizational... Matrix Management Lean Six Sigma Process Re-engineering System Validation Manufacturing... Program & Project... Situational Leadership Mentoring/Coaching Technology Integration Technology Operations... Revenue & Profit Growth Change Management Go-to-market Operations Usability Requirements International Program... Program Integration... Strategic Technology... Leadership Six Sigma Integration Product Development Training Lean Manufacturing Strategic Planning Process Improvement Software Development Project Planning Product Management Manufacturing Systems Engineering Business Process... Operations Management Design for Manufacturing Marketing Research Computer System... Business Process... See 31+     See less Program Management Product Delivery Cross-functional Team... Complexity Management Product Strategy Business Case Coaching System Integration Consumer Research Organizational... Matrix Management Lean Six Sigma Process Re-engineering System Validation Manufacturing... Program & Project... Situational Leadership Mentoring/Coaching Technology Integration Technology Operations... Revenue & Profit Growth Change Management Go-to-market Operations Usability Requirements International Program... Program Integration... Strategic Technology... Leadership Six Sigma Integration Product Development Training Lean Manufacturing Strategic Planning Process Improvement Software Development Project Planning Product Management Manufacturing Systems Engineering Business Process... Operations Management Design for Manufacturing Marketing Research Computer System... Business Process... See 31+     See less Education Rochester Institute of Technology MBA,  Finance 1987  – 1992 Kettering University BSEE,  Electrical Engineering; Minor - Optics 1982  – 1987 Rochester Institute of Technology MBA,  Finance 1987  – 1992 Rochester Institute of Technology MBA,  Finance 1987  – 1992 Rochester Institute of Technology MBA,  Finance 1987  – 1992 Kettering University BSEE,  Electrical Engineering; Minor - Optics 1982  – 1987 Kettering University BSEE,  Electrical Engineering; Minor - Optics 1982  – 1987 Kettering University BSEE,  Electrical Engineering; Minor - Optics 1982  – 1987 Honors & Awards Additional Honors & Awards Nominee - Outstanding Young Electrical Engineer - Eta Kappa Nu Electrical Engineering Honor Society, 1995 \nPass with Distinction - Degree Thesis: \"Statistical Process Control for Digital IC Devices\", 1987 Additional Honors & Awards Nominee - Outstanding Young Electrical Engineer - Eta Kappa Nu Electrical Engineering Honor Society, 1995 \nPass with Distinction - Degree Thesis: \"Statistical Process Control for Digital IC Devices\", 1987 Additional Honors & Awards Nominee - Outstanding Young Electrical Engineer - Eta Kappa Nu Electrical Engineering Honor Society, 1995 \nPass with Distinction - Degree Thesis: \"Statistical Process Control for Digital IC Devices\", 1987 Additional Honors & Awards Nominee - Outstanding Young Electrical Engineer - Eta Kappa Nu Electrical Engineering Honor Society, 1995 \nPass with Distinction - Degree Thesis: \"Statistical Process Control for Digital IC Devices\", 1987 ", "Languages   Skills Mobile Devices Mobile Applications Mobile Technology Mobile Communications Software Project... Product Management Program Management Software Development Android Embedded Systems Testing Smartphones GSM Consumer Electronics Integration Project Management Product Development Agile Project Management Windows Phone Software OEM Mobile Device... Vendor Management Supply Chain System Architecture Windows Mobile C Contract Management Handsets Strategic Partnerships Product Lifecycle... LTE Content Acquisition Application Management Feature Definition Commercialization Engineering Management Partner Management Software Design Product Launch MS Project Statement of Work Software Quality Hardware and Software... Feature Development... Vendor Relations Cost Model Development Windows Mobile Devices Wireless Cellular Communications Test Automation See 35+     See less Skills  Mobile Devices Mobile Applications Mobile Technology Mobile Communications Software Project... Product Management Program Management Software Development Android Embedded Systems Testing Smartphones GSM Consumer Electronics Integration Project Management Product Development Agile Project Management Windows Phone Software OEM Mobile Device... Vendor Management Supply Chain System Architecture Windows Mobile C Contract Management Handsets Strategic Partnerships Product Lifecycle... LTE Content Acquisition Application Management Feature Definition Commercialization Engineering Management Partner Management Software Design Product Launch MS Project Statement of Work Software Quality Hardware and Software... Feature Development... Vendor Relations Cost Model Development Windows Mobile Devices Wireless Cellular Communications Test Automation See 35+     See less Mobile Devices Mobile Applications Mobile Technology Mobile Communications Software Project... Product Management Program Management Software Development Android Embedded Systems Testing Smartphones GSM Consumer Electronics Integration Project Management Product Development Agile Project Management Windows Phone Software OEM Mobile Device... Vendor Management Supply Chain System Architecture Windows Mobile C Contract Management Handsets Strategic Partnerships Product Lifecycle... LTE Content Acquisition Application Management Feature Definition Commercialization Engineering Management Partner Management Software Design Product Launch MS Project Statement of Work Software Quality Hardware and Software... Feature Development... Vendor Relations Cost Model Development Windows Mobile Devices Wireless Cellular Communications Test Automation See 35+     See less Mobile Devices Mobile Applications Mobile Technology Mobile Communications Software Project... Product Management Program Management Software Development Android Embedded Systems Testing Smartphones GSM Consumer Electronics Integration Project Management Product Development Agile Project Management Windows Phone Software OEM Mobile Device... Vendor Management Supply Chain System Architecture Windows Mobile C Contract Management Handsets Strategic Partnerships Product Lifecycle... LTE Content Acquisition Application Management Feature Definition Commercialization Engineering Management Partner Management Software Design Product Launch MS Project Statement of Work Software Quality Hardware and Software... Feature Development... Vendor Relations Cost Model Development Windows Mobile Devices Wireless Cellular Communications Test Automation See 35+     See less Honors & Awards ", "Summary Value to the Organization# \n* Proven Leadership ability\t \n* Experienced People Manager\t \n* Adept at Program Management  \n* Team-conscious  \n* Learn Quickly  \n* Skilled Communicator  \n* Able to work to Deadline\t \n* Successfully execute tasks in high-pressure environment \n* Talent for conflict resolution\t \n* Excellent Inter-personal skills \n* Proficient with software engineering tools and Processes\t \n* Effective during both pre- and post-sales stages\t \n* Practiced in working with Mission-Critical Applications \n* Specialist in the Computer-Aided Dispatch (CAD) and Public Safety industry \n* Strong knowledge and experience in Semi-conductor industry \n* Work productively with Local, State and Federal officials  \n \nSelect Achievements#\t \n* Implemented/Used Lean/SCRUM methodologies \n* Received several awards and Bonuses in recognition for Performance Above & Beyond  \n* Have satisfying experience of mentoring and providing leadership to R&D Teams \n* Have successfully translated business needs into High-Level System requirements \n* Take pride in successfully mitigating issues and grievances of customers. \n* Ability to work with executives and communicate effectively to upper management \n* Work effectively with Captains and Chiefs of Police and Fire Departments \n \nSpecialties: \n* People management \n* Manage major projects and programs \n* Public Safety \n* Semi-conductor industry \n* AGILE/WATERFALL/SCRUM Methodologies \n* PMP Certified \n* Scrum certified Product owner and Scrum Master Summary Value to the Organization# \n* Proven Leadership ability\t \n* Experienced People Manager\t \n* Adept at Program Management  \n* Team-conscious  \n* Learn Quickly  \n* Skilled Communicator  \n* Able to work to Deadline\t \n* Successfully execute tasks in high-pressure environment \n* Talent for conflict resolution\t \n* Excellent Inter-personal skills \n* Proficient with software engineering tools and Processes\t \n* Effective during both pre- and post-sales stages\t \n* Practiced in working with Mission-Critical Applications \n* Specialist in the Computer-Aided Dispatch (CAD) and Public Safety industry \n* Strong knowledge and experience in Semi-conductor industry \n* Work productively with Local, State and Federal officials  \n \nSelect Achievements#\t \n* Implemented/Used Lean/SCRUM methodologies \n* Received several awards and Bonuses in recognition for Performance Above & Beyond  \n* Have satisfying experience of mentoring and providing leadership to R&D Teams \n* Have successfully translated business needs into High-Level System requirements \n* Take pride in successfully mitigating issues and grievances of customers. \n* Ability to work with executives and communicate effectively to upper management \n* Work effectively with Captains and Chiefs of Police and Fire Departments \n \nSpecialties: \n* People management \n* Manage major projects and programs \n* Public Safety \n* Semi-conductor industry \n* AGILE/WATERFALL/SCRUM Methodologies \n* PMP Certified \n* Scrum certified Product owner and Scrum Master Value to the Organization# \n* Proven Leadership ability\t \n* Experienced People Manager\t \n* Adept at Program Management  \n* Team-conscious  \n* Learn Quickly  \n* Skilled Communicator  \n* Able to work to Deadline\t \n* Successfully execute tasks in high-pressure environment \n* Talent for conflict resolution\t \n* Excellent Inter-personal skills \n* Proficient with software engineering tools and Processes\t \n* Effective during both pre- and post-sales stages\t \n* Practiced in working with Mission-Critical Applications \n* Specialist in the Computer-Aided Dispatch (CAD) and Public Safety industry \n* Strong knowledge and experience in Semi-conductor industry \n* Work productively with Local, State and Federal officials  \n \nSelect Achievements#\t \n* Implemented/Used Lean/SCRUM methodologies \n* Received several awards and Bonuses in recognition for Performance Above & Beyond  \n* Have satisfying experience of mentoring and providing leadership to R&D Teams \n* Have successfully translated business needs into High-Level System requirements \n* Take pride in successfully mitigating issues and grievances of customers. \n* Ability to work with executives and communicate effectively to upper management \n* Work effectively with Captains and Chiefs of Police and Fire Departments \n \nSpecialties: \n* People management \n* Manage major projects and programs \n* Public Safety \n* Semi-conductor industry \n* AGILE/WATERFALL/SCRUM Methodologies \n* PMP Certified \n* Scrum certified Product owner and Scrum Master Value to the Organization# \n* Proven Leadership ability\t \n* Experienced People Manager\t \n* Adept at Program Management  \n* Team-conscious  \n* Learn Quickly  \n* Skilled Communicator  \n* Able to work to Deadline\t \n* Successfully execute tasks in high-pressure environment \n* Talent for conflict resolution\t \n* Excellent Inter-personal skills \n* Proficient with software engineering tools and Processes\t \n* Effective during both pre- and post-sales stages\t \n* Practiced in working with Mission-Critical Applications \n* Specialist in the Computer-Aided Dispatch (CAD) and Public Safety industry \n* Strong knowledge and experience in Semi-conductor industry \n* Work productively with Local, State and Federal officials  \n \nSelect Achievements#\t \n* Implemented/Used Lean/SCRUM methodologies \n* Received several awards and Bonuses in recognition for Performance Above & Beyond  \n* Have satisfying experience of mentoring and providing leadership to R&D Teams \n* Have successfully translated business needs into High-Level System requirements \n* Take pride in successfully mitigating issues and grievances of customers. \n* Ability to work with executives and communicate effectively to upper management \n* Work effectively with Captains and Chiefs of Police and Fire Departments \n \nSpecialties: \n* People management \n* Manage major projects and programs \n* Public Safety \n* Semi-conductor industry \n* AGILE/WATERFALL/SCRUM Methodologies \n* PMP Certified \n* Scrum certified Product owner and Scrum Master Experience Senior Program Manager Intel Corporation March 2011  – Present (4 years 6 months) chandler, arizona - Manage engineering teams \n- Budgeting and planning \n- Resource planning \n- Program management \n- Release management \n- Transition and move teams to AGILE methodology \n- Scrum master/ Scrum of Scrum \n- Chief Product Owner (software development) and Product Manager \n- Customer relationship management \n- Manage multiple projects through external vendors and internal teams \n- Content/UX design for engaging developer community Senior Manager, Engineering Tiburon July 2010  –  April 2011  (10 months) - Running the Hillsboro office \n- Managing multiple teams of software engineers, leads and architects Manager, Software Development LETG December 2009  –  August 2010  (9 months) Managing a team of software engineers and helping develop software for public safety. Technologies used: .NET 3.5 Framework, WPF, Silverlight, Web services and others in the Microsoft stack. Senior Manager, Software Development Intrado February 2005  –  December 2009  (4 years 11 months) Duties: \n* Create a R&D team \n* Help successfully develop, design and architect new products \n* Design, Architected and developed several applications and interfaces  \nusing Spring Framework, C#, WPF, Silverlight, XMPP Framework,  \nExpression Blend and other .NET technologies. Some examples include  \nInstant Messaging application, XML OUT interface etc. \n* Convert products from Visual studio 6 to .NET \n* Project management and Customer Management responsibilities \n* Manage customer calls, and from time to time appear at customer sites  \nto help resolve issues \n* Handle project deliverables and planning using MS Project and other  \ntools \n* Deal with multiple projects at the same time \n* Motivate team members to meet aggressive project deadlines \n* Plan and allocate resources \n* Handle Management responsibilities including hiring and firing,  \ninterview prospective candidates, Performance reviews and appraisals \n* Plan product roadmap and provide technical direction for the products \n* Analyze and review the QA process for many products for Positron \n* Develop test plans for all product lines. Test planning includes  \nfunctional, load testing, etc. \n* Help marketing team with several RFP review and replies \n* Lead engineers and support personnel in several projects and assist  \nthem in solving problems in areas of support, development and  \nstandards.  \n* Train new people on technology, in-house development practices and  \nmethodologies \n* Redesign database, next generation products using ORM or Multi- \nDimensional Database, Test-Driven Development and Agile techniques \n* Start and successfully implement sprint and scrum activities / Agile  \nDevelopment techniques \n* Organize and conduct technical training for developers \n* Knowledge transfer to Upper Management as well as peers and other team  \nmembers \n* Work effectively with comparable remote team in Montreal\t \n* Organize fun, team-bonding activities for the office Senior/Lead Software Engineer Intrado February 2002  –  February 2005  (3 years 1 month) Duties: \n* Led a team of 6 developers \n* Worked on architecting, designing and developing next generation  \nComputer-Aided Dispatch and related products. The system is built on a multi-tier architecture, with strategic integration of Web/Com-based technologies and a sophisticated map engine. It was accomplished using VB, VB.NET, C#, Mapobjects, ASP.NET, AJAX, Spring Framework and other .NET technologies.  \n* Designed and worked on a next generation Mapping DLL that can be used in CAD as well as the other products that need a map and map related features using VB, ArcObjects and C#. This product was released as a web service as well as a Windows-class library.  \n* Worked on the existing CAD (Computer-Aided Dispatch) product using VB and VC++. Many features were added and existing codes re-written for performance purposes and to support new and old customers. Wrote more than 80,000 lines of code on this product suite alone. \n* Wrote many interfaces so that CAD can communicate with other 3rd party- and Intrado-products. This includes Radio, Phone, Printer and Paging interfaces etc.  \n* Worked on CADVisor, a web tool for Users to query and edit data that was put in using the CADPro product. This was written using Asp and Asp.Net. \n* Worked on WebRelayServer. It serves as an interface between Windows applications and ASP Clients \n* Was Involved in Testing/QA several product lines. \n* Designed and developed SSM (System Status Management Tool), Bolo Server Alarm Server and several other applications and services from inception using VB6, C#, ASP, ASP.NET. Software Engineer Motorola January 2000  –  February 2002  (2 years 2 months) Duties: \n* Worked on designing and developing the Advanced Tactical Map (ATM)  \nproduct using Visual C++, MapObjects and NetEngine.  \n* Worked to enhance the Graphic Geofile Manager, which is used to build  \nand maintain map data that supports the Computer-Aided Dispatch System  \nusing VC++. It’s Motorola’s Version of ESRI Arc/Info, which does all  \nkind of Map related work.  \n* Worked to enhance the product named “AVL Server”, using ATL COM and  \nVC++. This product receives, stores, distributes all unit (Police car,  \nAmbulance &Fire units, etc.) information to clients.  \n* Wrote Interfaces to many switches that AVL Server uses to communicate  \nto the vehicles with GPS/Laptops, using various communication protocols  \n(TCP/UDP/Serial connections) \n* Worked on developing AtmNetworkEditor, which is used for updating the  \nroad networks used in ATM (Advanced Tactical Map). This was developed  \nusing Delphi, MapObjects and NetEngine. Senior Program Manager Intel Corporation March 2011  – Present (4 years 6 months) chandler, arizona - Manage engineering teams \n- Budgeting and planning \n- Resource planning \n- Program management \n- Release management \n- Transition and move teams to AGILE methodology \n- Scrum master/ Scrum of Scrum \n- Chief Product Owner (software development) and Product Manager \n- Customer relationship management \n- Manage multiple projects through external vendors and internal teams \n- Content/UX design for engaging developer community Senior Program Manager Intel Corporation March 2011  – Present (4 years 6 months) chandler, arizona - Manage engineering teams \n- Budgeting and planning \n- Resource planning \n- Program management \n- Release management \n- Transition and move teams to AGILE methodology \n- Scrum master/ Scrum of Scrum \n- Chief Product Owner (software development) and Product Manager \n- Customer relationship management \n- Manage multiple projects through external vendors and internal teams \n- Content/UX design for engaging developer community Senior Manager, Engineering Tiburon July 2010  –  April 2011  (10 months) - Running the Hillsboro office \n- Managing multiple teams of software engineers, leads and architects Senior Manager, Engineering Tiburon July 2010  –  April 2011  (10 months) - Running the Hillsboro office \n- Managing multiple teams of software engineers, leads and architects Manager, Software Development LETG December 2009  –  August 2010  (9 months) Managing a team of software engineers and helping develop software for public safety. Technologies used: .NET 3.5 Framework, WPF, Silverlight, Web services and others in the Microsoft stack. Manager, Software Development LETG December 2009  –  August 2010  (9 months) Managing a team of software engineers and helping develop software for public safety. Technologies used: .NET 3.5 Framework, WPF, Silverlight, Web services and others in the Microsoft stack. Senior Manager, Software Development Intrado February 2005  –  December 2009  (4 years 11 months) Duties: \n* Create a R&D team \n* Help successfully develop, design and architect new products \n* Design, Architected and developed several applications and interfaces  \nusing Spring Framework, C#, WPF, Silverlight, XMPP Framework,  \nExpression Blend and other .NET technologies. Some examples include  \nInstant Messaging application, XML OUT interface etc. \n* Convert products from Visual studio 6 to .NET \n* Project management and Customer Management responsibilities \n* Manage customer calls, and from time to time appear at customer sites  \nto help resolve issues \n* Handle project deliverables and planning using MS Project and other  \ntools \n* Deal with multiple projects at the same time \n* Motivate team members to meet aggressive project deadlines \n* Plan and allocate resources \n* Handle Management responsibilities including hiring and firing,  \ninterview prospective candidates, Performance reviews and appraisals \n* Plan product roadmap and provide technical direction for the products \n* Analyze and review the QA process for many products for Positron \n* Develop test plans for all product lines. Test planning includes  \nfunctional, load testing, etc. \n* Help marketing team with several RFP review and replies \n* Lead engineers and support personnel in several projects and assist  \nthem in solving problems in areas of support, development and  \nstandards.  \n* Train new people on technology, in-house development practices and  \nmethodologies \n* Redesign database, next generation products using ORM or Multi- \nDimensional Database, Test-Driven Development and Agile techniques \n* Start and successfully implement sprint and scrum activities / Agile  \nDevelopment techniques \n* Organize and conduct technical training for developers \n* Knowledge transfer to Upper Management as well as peers and other team  \nmembers \n* Work effectively with comparable remote team in Montreal\t \n* Organize fun, team-bonding activities for the office Senior Manager, Software Development Intrado February 2005  –  December 2009  (4 years 11 months) Duties: \n* Create a R&D team \n* Help successfully develop, design and architect new products \n* Design, Architected and developed several applications and interfaces  \nusing Spring Framework, C#, WPF, Silverlight, XMPP Framework,  \nExpression Blend and other .NET technologies. Some examples include  \nInstant Messaging application, XML OUT interface etc. \n* Convert products from Visual studio 6 to .NET \n* Project management and Customer Management responsibilities \n* Manage customer calls, and from time to time appear at customer sites  \nto help resolve issues \n* Handle project deliverables and planning using MS Project and other  \ntools \n* Deal with multiple projects at the same time \n* Motivate team members to meet aggressive project deadlines \n* Plan and allocate resources \n* Handle Management responsibilities including hiring and firing,  \ninterview prospective candidates, Performance reviews and appraisals \n* Plan product roadmap and provide technical direction for the products \n* Analyze and review the QA process for many products for Positron \n* Develop test plans for all product lines. Test planning includes  \nfunctional, load testing, etc. \n* Help marketing team with several RFP review and replies \n* Lead engineers and support personnel in several projects and assist  \nthem in solving problems in areas of support, development and  \nstandards.  \n* Train new people on technology, in-house development practices and  \nmethodologies \n* Redesign database, next generation products using ORM or Multi- \nDimensional Database, Test-Driven Development and Agile techniques \n* Start and successfully implement sprint and scrum activities / Agile  \nDevelopment techniques \n* Organize and conduct technical training for developers \n* Knowledge transfer to Upper Management as well as peers and other team  \nmembers \n* Work effectively with comparable remote team in Montreal\t \n* Organize fun, team-bonding activities for the office Senior/Lead Software Engineer Intrado February 2002  –  February 2005  (3 years 1 month) Duties: \n* Led a team of 6 developers \n* Worked on architecting, designing and developing next generation  \nComputer-Aided Dispatch and related products. The system is built on a multi-tier architecture, with strategic integration of Web/Com-based technologies and a sophisticated map engine. It was accomplished using VB, VB.NET, C#, Mapobjects, ASP.NET, AJAX, Spring Framework and other .NET technologies.  \n* Designed and worked on a next generation Mapping DLL that can be used in CAD as well as the other products that need a map and map related features using VB, ArcObjects and C#. This product was released as a web service as well as a Windows-class library.  \n* Worked on the existing CAD (Computer-Aided Dispatch) product using VB and VC++. Many features were added and existing codes re-written for performance purposes and to support new and old customers. Wrote more than 80,000 lines of code on this product suite alone. \n* Wrote many interfaces so that CAD can communicate with other 3rd party- and Intrado-products. This includes Radio, Phone, Printer and Paging interfaces etc.  \n* Worked on CADVisor, a web tool for Users to query and edit data that was put in using the CADPro product. This was written using Asp and Asp.Net. \n* Worked on WebRelayServer. It serves as an interface between Windows applications and ASP Clients \n* Was Involved in Testing/QA several product lines. \n* Designed and developed SSM (System Status Management Tool), Bolo Server Alarm Server and several other applications and services from inception using VB6, C#, ASP, ASP.NET. Senior/Lead Software Engineer Intrado February 2002  –  February 2005  (3 years 1 month) Duties: \n* Led a team of 6 developers \n* Worked on architecting, designing and developing next generation  \nComputer-Aided Dispatch and related products. The system is built on a multi-tier architecture, with strategic integration of Web/Com-based technologies and a sophisticated map engine. It was accomplished using VB, VB.NET, C#, Mapobjects, ASP.NET, AJAX, Spring Framework and other .NET technologies.  \n* Designed and worked on a next generation Mapping DLL that can be used in CAD as well as the other products that need a map and map related features using VB, ArcObjects and C#. This product was released as a web service as well as a Windows-class library.  \n* Worked on the existing CAD (Computer-Aided Dispatch) product using VB and VC++. Many features were added and existing codes re-written for performance purposes and to support new and old customers. Wrote more than 80,000 lines of code on this product suite alone. \n* Wrote many interfaces so that CAD can communicate with other 3rd party- and Intrado-products. This includes Radio, Phone, Printer and Paging interfaces etc.  \n* Worked on CADVisor, a web tool for Users to query and edit data that was put in using the CADPro product. This was written using Asp and Asp.Net. \n* Worked on WebRelayServer. It serves as an interface between Windows applications and ASP Clients \n* Was Involved in Testing/QA several product lines. \n* Designed and developed SSM (System Status Management Tool), Bolo Server Alarm Server and several other applications and services from inception using VB6, C#, ASP, ASP.NET. Software Engineer Motorola January 2000  –  February 2002  (2 years 2 months) Duties: \n* Worked on designing and developing the Advanced Tactical Map (ATM)  \nproduct using Visual C++, MapObjects and NetEngine.  \n* Worked to enhance the Graphic Geofile Manager, which is used to build  \nand maintain map data that supports the Computer-Aided Dispatch System  \nusing VC++. It’s Motorola’s Version of ESRI Arc/Info, which does all  \nkind of Map related work.  \n* Worked to enhance the product named “AVL Server”, using ATL COM and  \nVC++. This product receives, stores, distributes all unit (Police car,  \nAmbulance &Fire units, etc.) information to clients.  \n* Wrote Interfaces to many switches that AVL Server uses to communicate  \nto the vehicles with GPS/Laptops, using various communication protocols  \n(TCP/UDP/Serial connections) \n* Worked on developing AtmNetworkEditor, which is used for updating the  \nroad networks used in ATM (Advanced Tactical Map). This was developed  \nusing Delphi, MapObjects and NetEngine. Software Engineer Motorola January 2000  –  February 2002  (2 years 2 months) Duties: \n* Worked on designing and developing the Advanced Tactical Map (ATM)  \nproduct using Visual C++, MapObjects and NetEngine.  \n* Worked to enhance the Graphic Geofile Manager, which is used to build  \nand maintain map data that supports the Computer-Aided Dispatch System  \nusing VC++. It’s Motorola’s Version of ESRI Arc/Info, which does all  \nkind of Map related work.  \n* Worked to enhance the product named “AVL Server”, using ATL COM and  \nVC++. This product receives, stores, distributes all unit (Police car,  \nAmbulance &Fire units, etc.) information to clients.  \n* Wrote Interfaces to many switches that AVL Server uses to communicate  \nto the vehicles with GPS/Laptops, using various communication protocols  \n(TCP/UDP/Serial connections) \n* Worked on developing AtmNetworkEditor, which is used for updating the  \nroad networks used in ATM (Advanced Tactical Map). This was developed  \nusing Delphi, MapObjects and NetEngine. Skills Public Safety PMP Agile Methodologies Software Development Scrum .NET Web Services Databases C# XML Visual Studio MS Project ASP.NET Quality Assurance VB.NET Project Management Visual Basic Management Project Planning Spring Analysis Leadership WPF Software Project... Windows Wireless Mobile Applications Program Management See 13+     See less Skills  Public Safety PMP Agile Methodologies Software Development Scrum .NET Web Services Databases C# XML Visual Studio MS Project ASP.NET Quality Assurance VB.NET Project Management Visual Basic Management Project Planning Spring Analysis Leadership WPF Software Project... Windows Wireless Mobile Applications Program Management See 13+     See less Public Safety PMP Agile Methodologies Software Development Scrum .NET Web Services Databases C# XML Visual Studio MS Project ASP.NET Quality Assurance VB.NET Project Management Visual Basic Management Project Planning Spring Analysis Leadership WPF Software Project... Windows Wireless Mobile Applications Program Management See 13+     See less Public Safety PMP Agile Methodologies Software Development Scrum .NET Web Services Databases C# XML Visual Studio MS Project ASP.NET Quality Assurance VB.NET Project Management Visual Basic Management Project Planning Spring Analysis Leadership WPF Software Project... Windows Wireless Mobile Applications Program Management See 13+     See less Education University of Minnesota-Twin Cities Masters,  GIS , Computer Science 1998  – 1999 Anna University B.E,  Geo-Informatics 1994  – 1998 AVM higher secondary school high school 1992  – 1994 bhavans rajaji vidyashram high school 1981  – 1992 University of Minnesota-Twin Cities Masters,  GIS , Computer Science 1998  – 1999 University of Minnesota-Twin Cities Masters,  GIS , Computer Science 1998  – 1999 University of Minnesota-Twin Cities Masters,  GIS , Computer Science 1998  – 1999 Anna University B.E,  Geo-Informatics 1994  – 1998 Anna University B.E,  Geo-Informatics 1994  – 1998 Anna University B.E,  Geo-Informatics 1994  – 1998 AVM higher secondary school high school 1992  – 1994 AVM higher secondary school high school 1992  – 1994 AVM higher secondary school high school 1992  – 1994 bhavans rajaji vidyashram high school 1981  – 1992 bhavans rajaji vidyashram high school 1981  – 1992 bhavans rajaji vidyashram high school 1981  – 1992 ", "Summary Experienced Program Manager with extensive experience in Hardware and Software Development in the Defense, Telecommunications and Semiconductor industries. Experienced at managing large demanding customers worldwide to ensure we exceed their expectations with respect to performance, price and quality. Experienced in product development, quality management, cost management, life cycle support, contracts, statements of work, and supplier management. Summary Experienced Program Manager with extensive experience in Hardware and Software Development in the Defense, Telecommunications and Semiconductor industries. Experienced at managing large demanding customers worldwide to ensure we exceed their expectations with respect to performance, price and quality. Experienced in product development, quality management, cost management, life cycle support, contracts, statements of work, and supplier management. Experienced Program Manager with extensive experience in Hardware and Software Development in the Defense, Telecommunications and Semiconductor industries. Experienced at managing large demanding customers worldwide to ensure we exceed their expectations with respect to performance, price and quality. Experienced in product development, quality management, cost management, life cycle support, contracts, statements of work, and supplier management. Experienced Program Manager with extensive experience in Hardware and Software Development in the Defense, Telecommunications and Semiconductor industries. Experienced at managing large demanding customers worldwide to ensure we exceed their expectations with respect to performance, price and quality. Experienced in product development, quality management, cost management, life cycle support, contracts, statements of work, and supplier management. Experience Senior Program Manager Intel Corporation November 2000  – Present (14 years 10 months) Started at Intel Dialogic as a Customer Program Manager to ensure focus on our largest customers. Worked with largest customer (Interactive Intelligence Incorporated) to provide a software upgrade required in advance of planned feature releases. Delivered software on time despite an aggressive schedule, changing requirements and a history of delayed deliveries. As a result of this success I was asked to become the Development Program Manager responsible for the System Release SW (Windows and Linux based) for the entire telephony product portfolio and distinguished myself by delivering all products on time for the next 3 years.  \n \nTransitioned back to managing high profile/high touch customers (Cisco/Alcatel-Lucent) in Telecom programs providing them with cPCI Chassis and Servers. Managed master purchasing agreements, technical specifications, communications, executive business reviews, quality/delivery issues, and new product development/modifications. \n \nCurrently working in Embedded Sales Group with the biggest customers establishing rebate programs (Strategic Growth Program), handling contracts, funding Non-Recurring Engineering programs and developing long term strategic partnerships all over the world. Working with the Intelligent Systems Group to deliver Intel's first Machine to Machine (M2M) gateway developers kit for the Internet of Things (IOT). Program Manager Lockheed Martin 1997  –  2000  (3 years) Program Manager on Defensive Aids Subsystem (DASS) program for RAF. Responsible for antennas and radar warning system. Prepared proposals, evaluated/selected suppliers and managed development/production. Extensive supplier management work on this program to ensure that we delivered compliant products on schedule. Prepared follow on proposal for Astor Program for a DASS system for Raytheon and negotiated the deal and helped win the job. Program Manager Loral Corporation 1995  –  1997  (2 years) Managed Cockpit Color Television Camera (CCTVS) Programs for Loral in Syosset, NY. Oversaw design/development/delivery of small cameras used for taping Heads Up Displays on F-14, F-15, F-16, F-18 and numerous foreign military aircraft. Prepared proposals, negotiated deals with customers and suppliers, managed supplier issues, managed factory schedules and budgets. Engineer/Program Manager Unisys 1986  –  1995  (9 years) Sperry merged with Burroughs to become Unisys in 1986. Continued work with Strategic Project Alterations. Took on new role of Microcircuit management for Trident II Nav System, evaluating the availability of critical IC's and ensuring the availability of materials for future builds by making large purchases of parts and storing them in bunkers in the midwest in dry nitrogen. Continuously monitored suppliers to ensure that we had multiple sources and when only one supplier remained we made Life of Type Buys. Spent a full year on site managing a critical supplier (General Electric, Syracuse NY) to ensure they took all measures necessary to meet our critical deliveries. We met our schedule. Selected by management in 1990 from thousands of candidates (only candidate selected from Engineers Union) to be in the Program Manager Development Program where we received extensive training in order to fill a gap in Program Management skills at the company. This training covered legal, configuration management, product development, finance, etc. and provided an overview of all the skills required to be a successful Program Manager (similar to PMP training). I was then assigned to the NEXRAD Doppler Weather Radar Program as program manager for changes to the antenna polarization techniques. In addition, I worked with the business operations team managing the programs finances. I worked with legal/finance to generate documentation to support our claims to millions in additional funding. Engineer Sperry Corporation 1984  –  1986  (2 years) Worked with the legendary Frank Layburn and Ed Gaus on Strategic Systems Project Alterations to the Trident I and Trident II Navigation Systems . This role ensured that all proposed modifications to the nav system were fully vetted and all ramifications of changes were understood and planned for in advance. Senior Program Manager Intel Corporation November 2000  – Present (14 years 10 months) Started at Intel Dialogic as a Customer Program Manager to ensure focus on our largest customers. Worked with largest customer (Interactive Intelligence Incorporated) to provide a software upgrade required in advance of planned feature releases. Delivered software on time despite an aggressive schedule, changing requirements and a history of delayed deliveries. As a result of this success I was asked to become the Development Program Manager responsible for the System Release SW (Windows and Linux based) for the entire telephony product portfolio and distinguished myself by delivering all products on time for the next 3 years.  \n \nTransitioned back to managing high profile/high touch customers (Cisco/Alcatel-Lucent) in Telecom programs providing them with cPCI Chassis and Servers. Managed master purchasing agreements, technical specifications, communications, executive business reviews, quality/delivery issues, and new product development/modifications. \n \nCurrently working in Embedded Sales Group with the biggest customers establishing rebate programs (Strategic Growth Program), handling contracts, funding Non-Recurring Engineering programs and developing long term strategic partnerships all over the world. Working with the Intelligent Systems Group to deliver Intel's first Machine to Machine (M2M) gateway developers kit for the Internet of Things (IOT). Senior Program Manager Intel Corporation November 2000  – Present (14 years 10 months) Started at Intel Dialogic as a Customer Program Manager to ensure focus on our largest customers. Worked with largest customer (Interactive Intelligence Incorporated) to provide a software upgrade required in advance of planned feature releases. Delivered software on time despite an aggressive schedule, changing requirements and a history of delayed deliveries. As a result of this success I was asked to become the Development Program Manager responsible for the System Release SW (Windows and Linux based) for the entire telephony product portfolio and distinguished myself by delivering all products on time for the next 3 years.  \n \nTransitioned back to managing high profile/high touch customers (Cisco/Alcatel-Lucent) in Telecom programs providing them with cPCI Chassis and Servers. Managed master purchasing agreements, technical specifications, communications, executive business reviews, quality/delivery issues, and new product development/modifications. \n \nCurrently working in Embedded Sales Group with the biggest customers establishing rebate programs (Strategic Growth Program), handling contracts, funding Non-Recurring Engineering programs and developing long term strategic partnerships all over the world. Working with the Intelligent Systems Group to deliver Intel's first Machine to Machine (M2M) gateway developers kit for the Internet of Things (IOT). Program Manager Lockheed Martin 1997  –  2000  (3 years) Program Manager on Defensive Aids Subsystem (DASS) program for RAF. Responsible for antennas and radar warning system. Prepared proposals, evaluated/selected suppliers and managed development/production. Extensive supplier management work on this program to ensure that we delivered compliant products on schedule. Prepared follow on proposal for Astor Program for a DASS system for Raytheon and negotiated the deal and helped win the job. Program Manager Lockheed Martin 1997  –  2000  (3 years) Program Manager on Defensive Aids Subsystem (DASS) program for RAF. Responsible for antennas and radar warning system. Prepared proposals, evaluated/selected suppliers and managed development/production. Extensive supplier management work on this program to ensure that we delivered compliant products on schedule. Prepared follow on proposal for Astor Program for a DASS system for Raytheon and negotiated the deal and helped win the job. Program Manager Loral Corporation 1995  –  1997  (2 years) Managed Cockpit Color Television Camera (CCTVS) Programs for Loral in Syosset, NY. Oversaw design/development/delivery of small cameras used for taping Heads Up Displays on F-14, F-15, F-16, F-18 and numerous foreign military aircraft. Prepared proposals, negotiated deals with customers and suppliers, managed supplier issues, managed factory schedules and budgets. Program Manager Loral Corporation 1995  –  1997  (2 years) Managed Cockpit Color Television Camera (CCTVS) Programs for Loral in Syosset, NY. Oversaw design/development/delivery of small cameras used for taping Heads Up Displays on F-14, F-15, F-16, F-18 and numerous foreign military aircraft. Prepared proposals, negotiated deals with customers and suppliers, managed supplier issues, managed factory schedules and budgets. Engineer/Program Manager Unisys 1986  –  1995  (9 years) Sperry merged with Burroughs to become Unisys in 1986. Continued work with Strategic Project Alterations. Took on new role of Microcircuit management for Trident II Nav System, evaluating the availability of critical IC's and ensuring the availability of materials for future builds by making large purchases of parts and storing them in bunkers in the midwest in dry nitrogen. Continuously monitored suppliers to ensure that we had multiple sources and when only one supplier remained we made Life of Type Buys. Spent a full year on site managing a critical supplier (General Electric, Syracuse NY) to ensure they took all measures necessary to meet our critical deliveries. We met our schedule. Selected by management in 1990 from thousands of candidates (only candidate selected from Engineers Union) to be in the Program Manager Development Program where we received extensive training in order to fill a gap in Program Management skills at the company. This training covered legal, configuration management, product development, finance, etc. and provided an overview of all the skills required to be a successful Program Manager (similar to PMP training). I was then assigned to the NEXRAD Doppler Weather Radar Program as program manager for changes to the antenna polarization techniques. In addition, I worked with the business operations team managing the programs finances. I worked with legal/finance to generate documentation to support our claims to millions in additional funding. Engineer/Program Manager Unisys 1986  –  1995  (9 years) Sperry merged with Burroughs to become Unisys in 1986. Continued work with Strategic Project Alterations. Took on new role of Microcircuit management for Trident II Nav System, evaluating the availability of critical IC's and ensuring the availability of materials for future builds by making large purchases of parts and storing them in bunkers in the midwest in dry nitrogen. Continuously monitored suppliers to ensure that we had multiple sources and when only one supplier remained we made Life of Type Buys. Spent a full year on site managing a critical supplier (General Electric, Syracuse NY) to ensure they took all measures necessary to meet our critical deliveries. We met our schedule. Selected by management in 1990 from thousands of candidates (only candidate selected from Engineers Union) to be in the Program Manager Development Program where we received extensive training in order to fill a gap in Program Management skills at the company. This training covered legal, configuration management, product development, finance, etc. and provided an overview of all the skills required to be a successful Program Manager (similar to PMP training). I was then assigned to the NEXRAD Doppler Weather Radar Program as program manager for changes to the antenna polarization techniques. In addition, I worked with the business operations team managing the programs finances. I worked with legal/finance to generate documentation to support our claims to millions in additional funding. Engineer Sperry Corporation 1984  –  1986  (2 years) Worked with the legendary Frank Layburn and Ed Gaus on Strategic Systems Project Alterations to the Trident I and Trident II Navigation Systems . This role ensured that all proposed modifications to the nav system were fully vetted and all ramifications of changes were understood and planned for in advance. Engineer Sperry Corporation 1984  –  1986  (2 years) Worked with the legendary Frank Layburn and Ed Gaus on Strategic Systems Project Alterations to the Trident I and Trident II Navigation Systems . This role ensured that all proposed modifications to the nav system were fully vetted and all ramifications of changes were understood and planned for in advance. Skills PMP Management Program Management Telecommunications Cross-functional Team... Process Improvement FPGA Quality Management Embedded Systems Engineering Strategy Strategic Partnerships Product Development Software Development Software Documentation Team Management Integration Product Management Six Sigma Engineering Management Systems Engineering Testing Manufacturing Leadership Proposal Writing Continuous Improvement DoD SDLC Electronics Earned Value Management Process Engineering Requirements Management Project Portfolio... Wireless Hardware Quality Assurance Vendor Management Semiconductors Training Project Management MS Project Software Project... Software Engineering Intel R&D Internet of Things Machine to Machine (M2M) See 32+     See less Skills  PMP Management Program Management Telecommunications Cross-functional Team... Process Improvement FPGA Quality Management Embedded Systems Engineering Strategy Strategic Partnerships Product Development Software Development Software Documentation Team Management Integration Product Management Six Sigma Engineering Management Systems Engineering Testing Manufacturing Leadership Proposal Writing Continuous Improvement DoD SDLC Electronics Earned Value Management Process Engineering Requirements Management Project Portfolio... Wireless Hardware Quality Assurance Vendor Management Semiconductors Training Project Management MS Project Software Project... Software Engineering Intel R&D Internet of Things Machine to Machine (M2M) See 32+     See less PMP Management Program Management Telecommunications Cross-functional Team... Process Improvement FPGA Quality Management Embedded Systems Engineering Strategy Strategic Partnerships Product Development Software Development Software Documentation Team Management Integration Product Management Six Sigma Engineering Management Systems Engineering Testing Manufacturing Leadership Proposal Writing Continuous Improvement DoD SDLC Electronics Earned Value Management Process Engineering Requirements Management Project Portfolio... Wireless Hardware Quality Assurance Vendor Management Semiconductors Training Project Management MS Project Software Project... Software Engineering Intel R&D Internet of Things Machine to Machine (M2M) See 32+     See less PMP Management Program Management Telecommunications Cross-functional Team... Process Improvement FPGA Quality Management Embedded Systems Engineering Strategy Strategic Partnerships Product Development Software Development Software Documentation Team Management Integration Product Management Six Sigma Engineering Management Systems Engineering Testing Manufacturing Leadership Proposal Writing Continuous Improvement DoD SDLC Electronics Earned Value Management Process Engineering Requirements Management Project Portfolio... Wireless Hardware Quality Assurance Vendor Management Semiconductors Training Project Management MS Project Software Project... Software Engineering Intel R&D Internet of Things Machine to Machine (M2M) See 32+     See less Education Manhattan College BEEE,  Electrical Engineering 1979  – 1983 Manhattan College BEEE,  Electrical Engineering 1979  – 1983 Manhattan College BEEE,  Electrical Engineering 1979  – 1983 Manhattan College BEEE,  Electrical Engineering 1979  – 1983 ", "Experience Outsource Manufacturing Senior Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Chandler, AZ Business program manager for two outsource manufacturing programs; one for Silicon outsourcing and the other for Boards & Systems. \n \nSi Outsource objective is to enable one standard planning and procurement system which supports a combination of outsource and in house manufacturing for Silicon products. Technical architecture is internal SAP and custom solutions. \n \nBoards & Systems objective is to improve leveraging the capabilities of the subcon, minimizing redundant internal activities and to implement direct ship capabilities. Technical architecture is internal SAP with a supplier collaboration tool called E2OPEN. Shopping Cart Senior Program Manager Intel Corporation August 2007  –  August 2014  (7 years 1 month) Chandler, AZ Business program manager of Indirect Procurement shopping cart program. Global implementation of custom HTML 5.0 user interface on top of SAP SRM 5.0 backend to 100k internal employees. Program critical success indicators include 8 hr shopping experience (shopping cart created, approved and PO released), low ticket volumes, \"A\" rating for end user experience. Walk up usability a key item for program success as no mandatory training. \n \nProgram spanned 3 years and multiple iterations. All CSI's achieved with a short, 8 week stabilization period. Corporate Quality Network IT Co-Manager Intel Corporation February 1992  –  August 2007  (15 years 7 months) Chandler Managed an IT team of ~40 people to deliver process and system solutions to the Quality Organization. Computer programmer Gulf Canada 1990  –  1992  (2 years) Outsource Manufacturing Senior Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Chandler, AZ Business program manager for two outsource manufacturing programs; one for Silicon outsourcing and the other for Boards & Systems. \n \nSi Outsource objective is to enable one standard planning and procurement system which supports a combination of outsource and in house manufacturing for Silicon products. Technical architecture is internal SAP and custom solutions. \n \nBoards & Systems objective is to improve leveraging the capabilities of the subcon, minimizing redundant internal activities and to implement direct ship capabilities. Technical architecture is internal SAP with a supplier collaboration tool called E2OPEN. Outsource Manufacturing Senior Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Chandler, AZ Business program manager for two outsource manufacturing programs; one for Silicon outsourcing and the other for Boards & Systems. \n \nSi Outsource objective is to enable one standard planning and procurement system which supports a combination of outsource and in house manufacturing for Silicon products. Technical architecture is internal SAP and custom solutions. \n \nBoards & Systems objective is to improve leveraging the capabilities of the subcon, minimizing redundant internal activities and to implement direct ship capabilities. Technical architecture is internal SAP with a supplier collaboration tool called E2OPEN. Shopping Cart Senior Program Manager Intel Corporation August 2007  –  August 2014  (7 years 1 month) Chandler, AZ Business program manager of Indirect Procurement shopping cart program. Global implementation of custom HTML 5.0 user interface on top of SAP SRM 5.0 backend to 100k internal employees. Program critical success indicators include 8 hr shopping experience (shopping cart created, approved and PO released), low ticket volumes, \"A\" rating for end user experience. Walk up usability a key item for program success as no mandatory training. \n \nProgram spanned 3 years and multiple iterations. All CSI's achieved with a short, 8 week stabilization period. Shopping Cart Senior Program Manager Intel Corporation August 2007  –  August 2014  (7 years 1 month) Chandler, AZ Business program manager of Indirect Procurement shopping cart program. Global implementation of custom HTML 5.0 user interface on top of SAP SRM 5.0 backend to 100k internal employees. Program critical success indicators include 8 hr shopping experience (shopping cart created, approved and PO released), low ticket volumes, \"A\" rating for end user experience. Walk up usability a key item for program success as no mandatory training. \n \nProgram spanned 3 years and multiple iterations. All CSI's achieved with a short, 8 week stabilization period. Corporate Quality Network IT Co-Manager Intel Corporation February 1992  –  August 2007  (15 years 7 months) Chandler Managed an IT team of ~40 people to deliver process and system solutions to the Quality Organization. Corporate Quality Network IT Co-Manager Intel Corporation February 1992  –  August 2007  (15 years 7 months) Chandler Managed an IT team of ~40 people to deliver process and system solutions to the Quality Organization. Computer programmer Gulf Canada 1990  –  1992  (2 years) Computer programmer Gulf Canada 1990  –  1992  (2 years) Skills System Architecture Semiconductors Cross-functional Team... Business Process Integration Vendor Management Go-to-market Strategy SAP ERP SAP BW Strategic Planning Problem Solving Outsourced Solutions Outsourcing Skills  System Architecture Semiconductors Cross-functional Team... Business Process Integration Vendor Management Go-to-market Strategy SAP ERP SAP BW Strategic Planning Problem Solving Outsourced Solutions Outsourcing System Architecture Semiconductors Cross-functional Team... Business Process Integration Vendor Management Go-to-market Strategy SAP ERP SAP BW Strategic Planning Problem Solving Outsourced Solutions Outsourcing System Architecture Semiconductors Cross-functional Team... Business Process Integration Vendor Management Go-to-market Strategy SAP ERP SAP BW Strategic Planning Problem Solving Outsourced Solutions Outsourcing Education The University of Calgary Bachelor of Science (BSc),  Computer Science 1986  – 1990 The University of Calgary Bachelor of Science (BSc),  Computer Science 1986  – 1990 The University of Calgary Bachelor of Science (BSc),  Computer Science 1986  – 1990 The University of Calgary Bachelor of Science (BSc),  Computer Science 1986  – 1990 ", "Skills Start-ups Strategic Planning Change Management Business Strategy Healthcare Information... Healthcare Cross-functional Team... Business Analysis Business Development Project Management Process Improvement Sales Management Management Consulting Leadership Account Management Sales Process Management Product Management Sales See 4+     See less Skills  Start-ups Strategic Planning Change Management Business Strategy Healthcare Information... Healthcare Cross-functional Team... Business Analysis Business Development Project Management Process Improvement Sales Management Management Consulting Leadership Account Management Sales Process Management Product Management Sales See 4+     See less Start-ups Strategic Planning Change Management Business Strategy Healthcare Information... Healthcare Cross-functional Team... Business Analysis Business Development Project Management Process Improvement Sales Management Management Consulting Leadership Account Management Sales Process Management Product Management Sales See 4+     See less Start-ups Strategic Planning Change Management Business Strategy Healthcare Information... Healthcare Cross-functional Team... Business Analysis Business Development Project Management Process Improvement Sales Management Management Consulting Leadership Account Management Sales Process Management Product Management Sales See 4+     See less ", "Skills Program Management Cross-functional Team... Product Management IC Project Management Integration Intel Process Improvement Electronics Skills  Program Management Cross-functional Team... Product Management IC Project Management Integration Intel Process Improvement Electronics Program Management Cross-functional Team... Product Management IC Project Management Integration Intel Process Improvement Electronics Program Management Cross-functional Team... Product Management IC Project Management Integration Intel Process Improvement Electronics ", "Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Architecture Avionics Leadership Management Product Management R Requirements Analysis Software Engineering System Architecture Team Management Embedded Systems Skills  Architecture Avionics Leadership Management Product Management R Requirements Analysis Software Engineering System Architecture Team Management Embedded Systems Architecture Avionics Leadership Management Product Management R Requirements Analysis Software Engineering System Architecture Team Management Embedded Systems Architecture Avionics Leadership Management Product Management R Requirements Analysis Software Engineering System Architecture Team Management Embedded Systems Honors & Awards ", "Summary OVERVIEW \n \n• Engineering program manager who delivers solutions that delight stakeholders by directing global technical teams. \n• Expert in program management, product development, lean six sigma process improvement and quality systems for platforms, SoCs, IT applications and manufacturing.  \n• Accomplished in design, supply chain, sales, marketing, mergers and aquisitions. \n \nSTRENGTHS \n \n• Customer Focusing \n• Strategic Influencing \n• Motivationally Leading \n \n• Globally Collaborating \n• Relationship Building \n• Team Energizing \n \n• Goal Directing \n• Smart Planning  \n• On-time Executing  \n \n• Effective Presenting \n• Risk Mitigating \n• Issue Resolving  \n \nCERTIFICATIONS \n \n• Program Management Professional (PMP)  \n• Lean Six Sigma Green Belt \n• ITIL Expert, Service Lifecycle v3 (Certified in IT Foundations, Strategy, Design, Transition, Operation, Continuous Improvement and Managing Across the Lifecycle.) \n• Advanced Leader & Communicator (ALB & ACS), President of Club, Toastmasters International \n• Microsoft Certified Technology Specialist (MCTS), Microsoft Office Project \n• Certified Quality Engineer (CQE)  \n• Certified Texas Educator (Math) \n \n* RITA: Relating, Inspiring, Transforming, Achieving \n* LEADS: Leading, Empowering, Accelerating, Directing, Supporting \n* TEAMS: Thinking, Executing, Advancing, Maximizing, Solutioning \n \n• Myers‐Briggs: ENTJ : Extravert, Intuititive, Thinking and Judging \n• Strength Finder: Achieving, Maximizing, Relating, Learning and Arranging  Summary OVERVIEW \n \n• Engineering program manager who delivers solutions that delight stakeholders by directing global technical teams. \n• Expert in program management, product development, lean six sigma process improvement and quality systems for platforms, SoCs, IT applications and manufacturing.  \n• Accomplished in design, supply chain, sales, marketing, mergers and aquisitions. \n \nSTRENGTHS \n \n• Customer Focusing \n• Strategic Influencing \n• Motivationally Leading \n \n• Globally Collaborating \n• Relationship Building \n• Team Energizing \n \n• Goal Directing \n• Smart Planning  \n• On-time Executing  \n \n• Effective Presenting \n• Risk Mitigating \n• Issue Resolving  \n \nCERTIFICATIONS \n \n• Program Management Professional (PMP)  \n• Lean Six Sigma Green Belt \n• ITIL Expert, Service Lifecycle v3 (Certified in IT Foundations, Strategy, Design, Transition, Operation, Continuous Improvement and Managing Across the Lifecycle.) \n• Advanced Leader & Communicator (ALB & ACS), President of Club, Toastmasters International \n• Microsoft Certified Technology Specialist (MCTS), Microsoft Office Project \n• Certified Quality Engineer (CQE)  \n• Certified Texas Educator (Math) \n \n* RITA: Relating, Inspiring, Transforming, Achieving \n* LEADS: Leading, Empowering, Accelerating, Directing, Supporting \n* TEAMS: Thinking, Executing, Advancing, Maximizing, Solutioning \n \n• Myers‐Briggs: ENTJ : Extravert, Intuititive, Thinking and Judging \n• Strength Finder: Achieving, Maximizing, Relating, Learning and Arranging  OVERVIEW \n \n• Engineering program manager who delivers solutions that delight stakeholders by directing global technical teams. \n• Expert in program management, product development, lean six sigma process improvement and quality systems for platforms, SoCs, IT applications and manufacturing.  \n• Accomplished in design, supply chain, sales, marketing, mergers and aquisitions. \n \nSTRENGTHS \n \n• Customer Focusing \n• Strategic Influencing \n• Motivationally Leading \n \n• Globally Collaborating \n• Relationship Building \n• Team Energizing \n \n• Goal Directing \n• Smart Planning  \n• On-time Executing  \n \n• Effective Presenting \n• Risk Mitigating \n• Issue Resolving  \n \nCERTIFICATIONS \n \n• Program Management Professional (PMP)  \n• Lean Six Sigma Green Belt \n• ITIL Expert, Service Lifecycle v3 (Certified in IT Foundations, Strategy, Design, Transition, Operation, Continuous Improvement and Managing Across the Lifecycle.) \n• Advanced Leader & Communicator (ALB & ACS), President of Club, Toastmasters International \n• Microsoft Certified Technology Specialist (MCTS), Microsoft Office Project \n• Certified Quality Engineer (CQE)  \n• Certified Texas Educator (Math) \n \n* RITA: Relating, Inspiring, Transforming, Achieving \n* LEADS: Leading, Empowering, Accelerating, Directing, Supporting \n* TEAMS: Thinking, Executing, Advancing, Maximizing, Solutioning \n \n• Myers‐Briggs: ENTJ : Extravert, Intuititive, Thinking and Judging \n• Strength Finder: Achieving, Maximizing, Relating, Learning and Arranging  OVERVIEW \n \n• Engineering program manager who delivers solutions that delight stakeholders by directing global technical teams. \n• Expert in program management, product development, lean six sigma process improvement and quality systems for platforms, SoCs, IT applications and manufacturing.  \n• Accomplished in design, supply chain, sales, marketing, mergers and aquisitions. \n \nSTRENGTHS \n \n• Customer Focusing \n• Strategic Influencing \n• Motivationally Leading \n \n• Globally Collaborating \n• Relationship Building \n• Team Energizing \n \n• Goal Directing \n• Smart Planning  \n• On-time Executing  \n \n• Effective Presenting \n• Risk Mitigating \n• Issue Resolving  \n \nCERTIFICATIONS \n \n• Program Management Professional (PMP)  \n• Lean Six Sigma Green Belt \n• ITIL Expert, Service Lifecycle v3 (Certified in IT Foundations, Strategy, Design, Transition, Operation, Continuous Improvement and Managing Across the Lifecycle.) \n• Advanced Leader & Communicator (ALB & ACS), President of Club, Toastmasters International \n• Microsoft Certified Technology Specialist (MCTS), Microsoft Office Project \n• Certified Quality Engineer (CQE)  \n• Certified Texas Educator (Math) \n \n* RITA: Relating, Inspiring, Transforming, Achieving \n* LEADS: Leading, Empowering, Accelerating, Directing, Supporting \n* TEAMS: Thinking, Executing, Advancing, Maximizing, Solutioning \n \n• Myers‐Briggs: ENTJ : Extravert, Intuititive, Thinking and Judging \n• Strength Finder: Achieving, Maximizing, Relating, Learning and Arranging  Experience Senior Program Manager Intel Corporation July 2015  – Present (2 months) Austin, Texas * Accelerating Pre-Silicon Platform Validation for the Client Systems Group. Senior Program Manager AMD August 2013  –  July 2015  (2 years) Austin, Texas • Launched Bhavani Advanced Processor Unit (APU) platform ahead of committed schedule with better than 300 DPPM quality level. \n• Directed Carrizo Advanced Processor Unit (APU) platform team to reduce R&D cost without reducing power and performance goals. \n• Led IT application improvements for Graphic Processor Unit (GPU) to enable automatic single pay point for fully processed wafers. \n• Implemented Lean Six Sigma process to reduce cycle time by 2 weeks on engineering requests for foundry purchases. \n• Achieved financial revenue goals by leading research teams to deliver technical presentations and reports to our customer, The Department of Energy. Senior Program Manager Dell November 2010  –  August 2013  (2 years 10 months) •\tDelivered 14 global deployments of software improvements over 6 interdependent IT applications to increase business automation in creating Supply Chain Bill of Materials.  \n•\tReduced cost and cycle time of global logistics for new Acquisition by reducing shipment locations and carriers. \n•\tEnabled fulfillment site to provide Configuration Services on Notebook platforms by delivering 2 deployments of software improvements and resolving issues. Program Management Consultant Remarkable Results June 2009  –  November 2010  (1 year 6 months) •\tAchieved remarkable results and exceeded goals for individuals and companies by applying program management expertise to unique needs. Succeeded with mission: \"You want it : You got it!\" Senior Program Manager Freescale Semiconductor July 2008  –  June 2009  (1 year) •\tDelivered new microprocessor platforms for the Multimedia Applications Division. \n•\tLed i.MX38 design development on schedule. Approved scope changes to expand the feature set to include 720p Pixel Pipeline, D1 Video Encode and Decode, 128K OCRAM and 4 App UARTS. Senior Program Manager SigmaTel July 2005  –  July 2008  (3 years 1 month) •\tDelivered System on a Chip development for Portable Media Player products. \n•\tLaunched FM tuner 3 months ahead of goal. Expanded scope for compatibility with 3500 and 3600 SoC’s. \n•\tSucceeded with first silicon Blue Tooth solution. Partnered with Infineon and Sigmatel design teams in Germany, Sweden and Austin. \n•\tAchieved schedule, financial and performance goals on 3780 design, 3700 revision, 3600 shrink and two 3500 fab transfers. Senior Program Manager Freescale Semiconductor January 2001  –  July 2005  (4 years 7 months) •\tDelivered new microcontroller development for Transportation Product Group. \n•\tWon “Product of the Year Award” by Electronic News by providing Nitron Classic four months ahead of goal. Global collaboration included Brazil, China, Japan and US. \n•\tLaunched Nitron 4 months ahead and Nitron 2V 3 months ahead of goal.  \n•\tAccelerated derivative design to achieve 2 month cycle time from concept to production on 2 Nitron Classic derivatives by directing sales and design teams throughout project.  \n•\tReduced product cost below plan by 15% on Nitron ROM and 12% on Nitron LIN. Released both to production one month ahead of goal. \n•\tExpanded scope to increase return, lower cost and improve features on Nitron SOG and launched one month ahead of goal. Program Manager Motorola January 1999  –  January 2001  (2 years 1 month) •\tDirected strategic process development for SoC Development Technology (SoCDT). \n•\tDeveloped sector-wide design verification environment “FlexBench” by creating strategic supplier alliance to create best-in-market joint technology solution. \n•\tChampioned Performance Excellence by expanding training and driving quality system improvements. \n•\tDrove strategic planning by managing technology roadmaps and business intelligence. Program Manager Motorola January 1997  –  January 1999  (2 years 1 month) •\tExceeded customer expectations with $5M cost savings and 5% quality improvement through conversion to tape and reel packaging on all WMSD products.  \n•\tReduced manufacturing costs by $3M and drove a 30% wireless market learning curve by leading a comprehensive cost reduction program that included 15 specific projects. Program Manager Motorola January 1995  –  January 1997  (2 years 1 month) •\tImproved production of assembly, test and burn-in at external contract final manufacturing sites. \n•\tReduced manufacturing cycle time by five days and test cost by $1.4M/year by integrating final test into a highly automated assembly line at a Japanese contract manufacturing site. \n•\tReduced cost by $1.2M/year plus $334K initial savings by creating a new Hong Kong burn-in contract site in three month time from concept to production. \n•\tIncreased Assembly capacity at worldwide contract sites by 600K/wk and improved many contractor quality systems and manufacturing planning systems. Quality Engineering Manager Motorola January 1990  –  January 1995  (5 years 1 month) •\tDirected team of five professionals for quality improvement of packages sourced from suppliers. \n•\tImproved production sourcing acceptable quality level from 77% to 100%. \n•\tReduced inspection cycle time from five days to four hours. \n•\tExceeded all organization goals for five years by forming a motivated group with clear mission and goals; developing partnering relationships with six Japanese and eleven domestic suppliers; leading eleven Quality System Review teams and participating in an additional thirteen teams. Marketing Engineer Motorola January 1987  –  January 1990  (3 years 1 month) •\tMarketed microprocessors for strategic customers as well as Eastern and Western US and Canada. \n•\tWon numerous design-ins with strategic and geographic customers.  \n•\tIncreased market share and improved profitability by negotiating strategic contracts. Field Sales Engineering Fairchild January 1985  –  January 1987  (2 years 1 month) •\tImproved customer relationships with strategic OEM customers and channel distributers.  \n•\tWon design-ins with microprocessors, ASIC's, and special function digital and logic devices. \n•\tIncreased market share 25% and added 30 new customers to the territory. Packaging Design Engineer Motorola January 1984  –  January 1985  (1 year 1 month) •\tDelivered package development of new assembly processes. \n•\tResearched, developed and implemented new epoxy die bond process. \n•\tIncreased quality through process improvements in Malaysia and Korea assembly sites. \n•\tDesigned new packaging leadframes. Senior Program Manager Intel Corporation July 2015  – Present (2 months) Austin, Texas * Accelerating Pre-Silicon Platform Validation for the Client Systems Group. Senior Program Manager Intel Corporation July 2015  – Present (2 months) Austin, Texas * Accelerating Pre-Silicon Platform Validation for the Client Systems Group. Senior Program Manager AMD August 2013  –  July 2015  (2 years) Austin, Texas • Launched Bhavani Advanced Processor Unit (APU) platform ahead of committed schedule with better than 300 DPPM quality level. \n• Directed Carrizo Advanced Processor Unit (APU) platform team to reduce R&D cost without reducing power and performance goals. \n• Led IT application improvements for Graphic Processor Unit (GPU) to enable automatic single pay point for fully processed wafers. \n• Implemented Lean Six Sigma process to reduce cycle time by 2 weeks on engineering requests for foundry purchases. \n• Achieved financial revenue goals by leading research teams to deliver technical presentations and reports to our customer, The Department of Energy. Senior Program Manager AMD August 2013  –  July 2015  (2 years) Austin, Texas • Launched Bhavani Advanced Processor Unit (APU) platform ahead of committed schedule with better than 300 DPPM quality level. \n• Directed Carrizo Advanced Processor Unit (APU) platform team to reduce R&D cost without reducing power and performance goals. \n• Led IT application improvements for Graphic Processor Unit (GPU) to enable automatic single pay point for fully processed wafers. \n• Implemented Lean Six Sigma process to reduce cycle time by 2 weeks on engineering requests for foundry purchases. \n• Achieved financial revenue goals by leading research teams to deliver technical presentations and reports to our customer, The Department of Energy. Senior Program Manager Dell November 2010  –  August 2013  (2 years 10 months) •\tDelivered 14 global deployments of software improvements over 6 interdependent IT applications to increase business automation in creating Supply Chain Bill of Materials.  \n•\tReduced cost and cycle time of global logistics for new Acquisition by reducing shipment locations and carriers. \n•\tEnabled fulfillment site to provide Configuration Services on Notebook platforms by delivering 2 deployments of software improvements and resolving issues. Senior Program Manager Dell November 2010  –  August 2013  (2 years 10 months) •\tDelivered 14 global deployments of software improvements over 6 interdependent IT applications to increase business automation in creating Supply Chain Bill of Materials.  \n•\tReduced cost and cycle time of global logistics for new Acquisition by reducing shipment locations and carriers. \n•\tEnabled fulfillment site to provide Configuration Services on Notebook platforms by delivering 2 deployments of software improvements and resolving issues. Program Management Consultant Remarkable Results June 2009  –  November 2010  (1 year 6 months) •\tAchieved remarkable results and exceeded goals for individuals and companies by applying program management expertise to unique needs. Succeeded with mission: \"You want it : You got it!\" Program Management Consultant Remarkable Results June 2009  –  November 2010  (1 year 6 months) •\tAchieved remarkable results and exceeded goals for individuals and companies by applying program management expertise to unique needs. Succeeded with mission: \"You want it : You got it!\" Senior Program Manager Freescale Semiconductor July 2008  –  June 2009  (1 year) •\tDelivered new microprocessor platforms for the Multimedia Applications Division. \n•\tLed i.MX38 design development on schedule. Approved scope changes to expand the feature set to include 720p Pixel Pipeline, D1 Video Encode and Decode, 128K OCRAM and 4 App UARTS. Senior Program Manager Freescale Semiconductor July 2008  –  June 2009  (1 year) •\tDelivered new microprocessor platforms for the Multimedia Applications Division. \n•\tLed i.MX38 design development on schedule. Approved scope changes to expand the feature set to include 720p Pixel Pipeline, D1 Video Encode and Decode, 128K OCRAM and 4 App UARTS. Senior Program Manager SigmaTel July 2005  –  July 2008  (3 years 1 month) •\tDelivered System on a Chip development for Portable Media Player products. \n•\tLaunched FM tuner 3 months ahead of goal. Expanded scope for compatibility with 3500 and 3600 SoC’s. \n•\tSucceeded with first silicon Blue Tooth solution. Partnered with Infineon and Sigmatel design teams in Germany, Sweden and Austin. \n•\tAchieved schedule, financial and performance goals on 3780 design, 3700 revision, 3600 shrink and two 3500 fab transfers. Senior Program Manager SigmaTel July 2005  –  July 2008  (3 years 1 month) •\tDelivered System on a Chip development for Portable Media Player products. \n•\tLaunched FM tuner 3 months ahead of goal. Expanded scope for compatibility with 3500 and 3600 SoC’s. \n•\tSucceeded with first silicon Blue Tooth solution. Partnered with Infineon and Sigmatel design teams in Germany, Sweden and Austin. \n•\tAchieved schedule, financial and performance goals on 3780 design, 3700 revision, 3600 shrink and two 3500 fab transfers. Senior Program Manager Freescale Semiconductor January 2001  –  July 2005  (4 years 7 months) •\tDelivered new microcontroller development for Transportation Product Group. \n•\tWon “Product of the Year Award” by Electronic News by providing Nitron Classic four months ahead of goal. Global collaboration included Brazil, China, Japan and US. \n•\tLaunched Nitron 4 months ahead and Nitron 2V 3 months ahead of goal.  \n•\tAccelerated derivative design to achieve 2 month cycle time from concept to production on 2 Nitron Classic derivatives by directing sales and design teams throughout project.  \n•\tReduced product cost below plan by 15% on Nitron ROM and 12% on Nitron LIN. Released both to production one month ahead of goal. \n•\tExpanded scope to increase return, lower cost and improve features on Nitron SOG and launched one month ahead of goal. Senior Program Manager Freescale Semiconductor January 2001  –  July 2005  (4 years 7 months) •\tDelivered new microcontroller development for Transportation Product Group. \n•\tWon “Product of the Year Award” by Electronic News by providing Nitron Classic four months ahead of goal. Global collaboration included Brazil, China, Japan and US. \n•\tLaunched Nitron 4 months ahead and Nitron 2V 3 months ahead of goal.  \n•\tAccelerated derivative design to achieve 2 month cycle time from concept to production on 2 Nitron Classic derivatives by directing sales and design teams throughout project.  \n•\tReduced product cost below plan by 15% on Nitron ROM and 12% on Nitron LIN. Released both to production one month ahead of goal. \n•\tExpanded scope to increase return, lower cost and improve features on Nitron SOG and launched one month ahead of goal. Program Manager Motorola January 1999  –  January 2001  (2 years 1 month) •\tDirected strategic process development for SoC Development Technology (SoCDT). \n•\tDeveloped sector-wide design verification environment “FlexBench” by creating strategic supplier alliance to create best-in-market joint technology solution. \n•\tChampioned Performance Excellence by expanding training and driving quality system improvements. \n•\tDrove strategic planning by managing technology roadmaps and business intelligence. Program Manager Motorola January 1999  –  January 2001  (2 years 1 month) •\tDirected strategic process development for SoC Development Technology (SoCDT). \n•\tDeveloped sector-wide design verification environment “FlexBench” by creating strategic supplier alliance to create best-in-market joint technology solution. \n•\tChampioned Performance Excellence by expanding training and driving quality system improvements. \n•\tDrove strategic planning by managing technology roadmaps and business intelligence. Program Manager Motorola January 1997  –  January 1999  (2 years 1 month) •\tExceeded customer expectations with $5M cost savings and 5% quality improvement through conversion to tape and reel packaging on all WMSD products.  \n•\tReduced manufacturing costs by $3M and drove a 30% wireless market learning curve by leading a comprehensive cost reduction program that included 15 specific projects. Program Manager Motorola January 1997  –  January 1999  (2 years 1 month) •\tExceeded customer expectations with $5M cost savings and 5% quality improvement through conversion to tape and reel packaging on all WMSD products.  \n•\tReduced manufacturing costs by $3M and drove a 30% wireless market learning curve by leading a comprehensive cost reduction program that included 15 specific projects. Program Manager Motorola January 1995  –  January 1997  (2 years 1 month) •\tImproved production of assembly, test and burn-in at external contract final manufacturing sites. \n•\tReduced manufacturing cycle time by five days and test cost by $1.4M/year by integrating final test into a highly automated assembly line at a Japanese contract manufacturing site. \n•\tReduced cost by $1.2M/year plus $334K initial savings by creating a new Hong Kong burn-in contract site in three month time from concept to production. \n•\tIncreased Assembly capacity at worldwide contract sites by 600K/wk and improved many contractor quality systems and manufacturing planning systems. Program Manager Motorola January 1995  –  January 1997  (2 years 1 month) •\tImproved production of assembly, test and burn-in at external contract final manufacturing sites. \n•\tReduced manufacturing cycle time by five days and test cost by $1.4M/year by integrating final test into a highly automated assembly line at a Japanese contract manufacturing site. \n•\tReduced cost by $1.2M/year plus $334K initial savings by creating a new Hong Kong burn-in contract site in three month time from concept to production. \n•\tIncreased Assembly capacity at worldwide contract sites by 600K/wk and improved many contractor quality systems and manufacturing planning systems. Quality Engineering Manager Motorola January 1990  –  January 1995  (5 years 1 month) •\tDirected team of five professionals for quality improvement of packages sourced from suppliers. \n•\tImproved production sourcing acceptable quality level from 77% to 100%. \n•\tReduced inspection cycle time from five days to four hours. \n•\tExceeded all organization goals for five years by forming a motivated group with clear mission and goals; developing partnering relationships with six Japanese and eleven domestic suppliers; leading eleven Quality System Review teams and participating in an additional thirteen teams. Quality Engineering Manager Motorola January 1990  –  January 1995  (5 years 1 month) •\tDirected team of five professionals for quality improvement of packages sourced from suppliers. \n•\tImproved production sourcing acceptable quality level from 77% to 100%. \n•\tReduced inspection cycle time from five days to four hours. \n•\tExceeded all organization goals for five years by forming a motivated group with clear mission and goals; developing partnering relationships with six Japanese and eleven domestic suppliers; leading eleven Quality System Review teams and participating in an additional thirteen teams. Marketing Engineer Motorola January 1987  –  January 1990  (3 years 1 month) •\tMarketed microprocessors for strategic customers as well as Eastern and Western US and Canada. \n•\tWon numerous design-ins with strategic and geographic customers.  \n•\tIncreased market share and improved profitability by negotiating strategic contracts. Marketing Engineer Motorola January 1987  –  January 1990  (3 years 1 month) •\tMarketed microprocessors for strategic customers as well as Eastern and Western US and Canada. \n•\tWon numerous design-ins with strategic and geographic customers.  \n•\tIncreased market share and improved profitability by negotiating strategic contracts. Field Sales Engineering Fairchild January 1985  –  January 1987  (2 years 1 month) •\tImproved customer relationships with strategic OEM customers and channel distributers.  \n•\tWon design-ins with microprocessors, ASIC's, and special function digital and logic devices. \n•\tIncreased market share 25% and added 30 new customers to the territory. Field Sales Engineering Fairchild January 1985  –  January 1987  (2 years 1 month) •\tImproved customer relationships with strategic OEM customers and channel distributers.  \n•\tWon design-ins with microprocessors, ASIC's, and special function digital and logic devices. \n•\tIncreased market share 25% and added 30 new customers to the territory. Packaging Design Engineer Motorola January 1984  –  January 1985  (1 year 1 month) •\tDelivered package development of new assembly processes. \n•\tResearched, developed and implemented new epoxy die bond process. \n•\tIncreased quality through process improvements in Malaysia and Korea assembly sites. \n•\tDesigned new packaging leadframes. Packaging Design Engineer Motorola January 1984  –  January 1985  (1 year 1 month) •\tDelivered package development of new assembly processes. \n•\tResearched, developed and implemented new epoxy die bond process. \n•\tIncreased quality through process improvements in Malaysia and Korea assembly sites. \n•\tDesigned new packaging leadframes. Languages Spanish Spanish Spanish Skills Cross-functional Team... PMP Product Development Project Planning Continuous Improvement Program Management Engineering Management Project Management Semiconductors Software Project... Process Improvement Vendor Management MS Project Six Sigma Product Management Integration Requirements Analysis Supply Chain Management Process Engineering Software Development Mergers Aquisition International Logistics Software Services Lean Manufacturing Quality System Platform Development Value Stream Mapping Kaizen SPC Strategy Visio Process Simulation CRM Business Intelligence Management Electronics Business Process... See 23+     See less Skills  Cross-functional Team... PMP Product Development Project Planning Continuous Improvement Program Management Engineering Management Project Management Semiconductors Software Project... Process Improvement Vendor Management MS Project Six Sigma Product Management Integration Requirements Analysis Supply Chain Management Process Engineering Software Development Mergers Aquisition International Logistics Software Services Lean Manufacturing Quality System Platform Development Value Stream Mapping Kaizen SPC Strategy Visio Process Simulation CRM Business Intelligence Management Electronics Business Process... See 23+     See less Cross-functional Team... PMP Product Development Project Planning Continuous Improvement Program Management Engineering Management Project Management Semiconductors Software Project... Process Improvement Vendor Management MS Project Six Sigma Product Management Integration Requirements Analysis Supply Chain Management Process Engineering Software Development Mergers Aquisition International Logistics Software Services Lean Manufacturing Quality System Platform Development Value Stream Mapping Kaizen SPC Strategy Visio Process Simulation CRM Business Intelligence Management Electronics Business Process... See 23+     See less Cross-functional Team... PMP Product Development Project Planning Continuous Improvement Program Management Engineering Management Project Management Semiconductors Software Project... Process Improvement Vendor Management MS Project Six Sigma Product Management Integration Requirements Analysis Supply Chain Management Process Engineering Software Development Mergers Aquisition International Logistics Software Services Lean Manufacturing Quality System Platform Development Value Stream Mapping Kaizen SPC Strategy Visio Process Simulation CRM Business Intelligence Management Electronics Business Process... See 23+     See less Education The University of Texas at Austin Bachelor of Science (BS),  Mechanical Engineering 1979  – 1983 National Technological University Master of Science (MS),  Engineering Management 1998  – 2000 The University of Texas at Austin Bachelor of Science (BS),  Mechanical Engineering 1979  – 1983 The University of Texas at Austin Bachelor of Science (BS),  Mechanical Engineering 1979  – 1983 The University of Texas at Austin Bachelor of Science (BS),  Mechanical Engineering 1979  – 1983 National Technological University Master of Science (MS),  Engineering Management 1998  – 2000 National Technological University Master of Science (MS),  Engineering Management 1998  – 2000 National Technological University Master of Science (MS),  Engineering Management 1998  – 2000 Honors & Awards ", "Experience Senior Program Manager Intel Corporation Senior Program Manager Intel Corporation Senior Program Manager Intel Corporation ", "Skills Semiconductors Engineering Management Fiber Optics Optics ASIC IC EDA Electronics Product Lifecycle... Testing Engineering Telecommunications RF Product Engineering Ethernet Wireless Technology Management Business Development Program Management See 4+     See less Skills  Semiconductors Engineering Management Fiber Optics Optics ASIC IC EDA Electronics Product Lifecycle... Testing Engineering Telecommunications RF Product Engineering Ethernet Wireless Technology Management Business Development Program Management See 4+     See less Semiconductors Engineering Management Fiber Optics Optics ASIC IC EDA Electronics Product Lifecycle... Testing Engineering Telecommunications RF Product Engineering Ethernet Wireless Technology Management Business Development Program Management See 4+     See less Semiconductors Engineering Management Fiber Optics Optics ASIC IC EDA Electronics Product Lifecycle... Testing Engineering Telecommunications RF Product Engineering Ethernet Wireless Technology Management Business Development Program Management See 4+     See less ", "Summary A dedicated and results-driven technical Senior Program Manager with 21 years’ of experience in manufacturing and engineering who specialises in program management and is recognised as global transformation leader and authority in the field of lean manufacturing, smart manufacturing, internet of things, project management, product start-up, process re-engineering and supply chain optimization in a fast pace, quick turn and complex operation environment at Intel Corporation. Certified VSM Coach and Lean Workshop Instructor, holds a Bachelor in Mechanical Engineering (Major in Industrial Engineering) with a highly successful background in the achievement of profitable business growth and significant productivity improvements through the application of lean manufacturing strategies in high tech production engineering processes and shop floor control. Experienced in working internationally in the US and the Philippines, possesses excellent interpersonal, communication and negotiation skills and the ability to develop and maintain mutually beneficial internal and external relationships. Enjoys being part of, as well as leading, managing, empowering, motivating and training, a successful and productive team, and thrives in highly pressurised and challenging working environments. Summary A dedicated and results-driven technical Senior Program Manager with 21 years’ of experience in manufacturing and engineering who specialises in program management and is recognised as global transformation leader and authority in the field of lean manufacturing, smart manufacturing, internet of things, project management, product start-up, process re-engineering and supply chain optimization in a fast pace, quick turn and complex operation environment at Intel Corporation. Certified VSM Coach and Lean Workshop Instructor, holds a Bachelor in Mechanical Engineering (Major in Industrial Engineering) with a highly successful background in the achievement of profitable business growth and significant productivity improvements through the application of lean manufacturing strategies in high tech production engineering processes and shop floor control. Experienced in working internationally in the US and the Philippines, possesses excellent interpersonal, communication and negotiation skills and the ability to develop and maintain mutually beneficial internal and external relationships. Enjoys being part of, as well as leading, managing, empowering, motivating and training, a successful and productive team, and thrives in highly pressurised and challenging working environments. A dedicated and results-driven technical Senior Program Manager with 21 years’ of experience in manufacturing and engineering who specialises in program management and is recognised as global transformation leader and authority in the field of lean manufacturing, smart manufacturing, internet of things, project management, product start-up, process re-engineering and supply chain optimization in a fast pace, quick turn and complex operation environment at Intel Corporation. Certified VSM Coach and Lean Workshop Instructor, holds a Bachelor in Mechanical Engineering (Major in Industrial Engineering) with a highly successful background in the achievement of profitable business growth and significant productivity improvements through the application of lean manufacturing strategies in high tech production engineering processes and shop floor control. Experienced in working internationally in the US and the Philippines, possesses excellent interpersonal, communication and negotiation skills and the ability to develop and maintain mutually beneficial internal and external relationships. Enjoys being part of, as well as leading, managing, empowering, motivating and training, a successful and productive team, and thrives in highly pressurised and challenging working environments. A dedicated and results-driven technical Senior Program Manager with 21 years’ of experience in manufacturing and engineering who specialises in program management and is recognised as global transformation leader and authority in the field of lean manufacturing, smart manufacturing, internet of things, project management, product start-up, process re-engineering and supply chain optimization in a fast pace, quick turn and complex operation environment at Intel Corporation. Certified VSM Coach and Lean Workshop Instructor, holds a Bachelor in Mechanical Engineering (Major in Industrial Engineering) with a highly successful background in the achievement of profitable business growth and significant productivity improvements through the application of lean manufacturing strategies in high tech production engineering processes and shop floor control. Experienced in working internationally in the US and the Philippines, possesses excellent interpersonal, communication and negotiation skills and the ability to develop and maintain mutually beneficial internal and external relationships. Enjoys being part of, as well as leading, managing, empowering, motivating and training, a successful and productive team, and thrives in highly pressurised and challenging working environments. Experience Senior Program Manager Intel Corporation April 2013  – Present (2 years 5 months) Penang, Malaysia Program manager responsible for High Precision Maintenance (HPM) for Intel Worldwide Manufacturing & Internet of Things (IoT) division in Penang Assembly Test. Test Engineering Manager Intel Corporation April 2006  –  April 2013  (7 years 1 month) Penang, Malaysia Manage Penang Test Engineering operations consist of 255 engineers and technicians in introducing new test process technology and sustaining excellence through the application of safety early reporting process, PCS/SPC tools, structured problem solving, DOE, FMEA, Lean rules and principles. Senior Program Manager Intel Corporation April 2013  – Present (2 years 5 months) Penang, Malaysia Program manager responsible for High Precision Maintenance (HPM) for Intel Worldwide Manufacturing & Internet of Things (IoT) division in Penang Assembly Test. Senior Program Manager Intel Corporation April 2013  – Present (2 years 5 months) Penang, Malaysia Program manager responsible for High Precision Maintenance (HPM) for Intel Worldwide Manufacturing & Internet of Things (IoT) division in Penang Assembly Test. Test Engineering Manager Intel Corporation April 2006  –  April 2013  (7 years 1 month) Penang, Malaysia Manage Penang Test Engineering operations consist of 255 engineers and technicians in introducing new test process technology and sustaining excellence through the application of safety early reporting process, PCS/SPC tools, structured problem solving, DOE, FMEA, Lean rules and principles. Test Engineering Manager Intel Corporation April 2006  –  April 2013  (7 years 1 month) Penang, Malaysia Manage Penang Test Engineering operations consist of 255 engineers and technicians in introducing new test process technology and sustaining excellence through the application of safety early reporting process, PCS/SPC tools, structured problem solving, DOE, FMEA, Lean rules and principles. Languages English Full professional proficiency Malay Full professional proficiency Chinese Limited working proficiency English Full professional proficiency Malay Full professional proficiency Chinese Limited working proficiency English Full professional proficiency Malay Full professional proficiency Chinese Limited working proficiency Full professional proficiency Full professional proficiency Limited working proficiency Skills Semiconductors Design of Experiments Lean Manufacturing Manufacturing Program Management Cross-functional Team... Testing Management Lean Management Lean Thinking People Management FMEA Engineering SPC Process Improvement Continuous Improvement Six Sigma Product Development Internet of Things People Development Training & Development Process Control structured problem... Smart Manufacturing Big Data Analytics Agile Project Management See 11+     See less Skills  Semiconductors Design of Experiments Lean Manufacturing Manufacturing Program Management Cross-functional Team... Testing Management Lean Management Lean Thinking People Management FMEA Engineering SPC Process Improvement Continuous Improvement Six Sigma Product Development Internet of Things People Development Training & Development Process Control structured problem... Smart Manufacturing Big Data Analytics Agile Project Management See 11+     See less Semiconductors Design of Experiments Lean Manufacturing Manufacturing Program Management Cross-functional Team... Testing Management Lean Management Lean Thinking People Management FMEA Engineering SPC Process Improvement Continuous Improvement Six Sigma Product Development Internet of Things People Development Training & Development Process Control structured problem... Smart Manufacturing Big Data Analytics Agile Project Management See 11+     See less Semiconductors Design of Experiments Lean Manufacturing Manufacturing Program Management Cross-functional Team... Testing Management Lean Management Lean Thinking People Management FMEA Engineering SPC Process Improvement Continuous Improvement Six Sigma Product Development Internet of Things People Development Training & Development Process Control structured problem... Smart Manufacturing Big Data Analytics Agile Project Management See 11+     See less Education Universiti Teknologi Malaysia Bachelor's Degree,  Mechanical Engineering , 3.4 1989  – 1994 Elected as Deputy Director of the Merbau Hostel Activities and Societies:  Students Association Universiti Teknologi Malaysia Bachelor's Degree,  Mechanical Engineering , 3.4 1989  – 1994 Elected as Deputy Director of the Merbau Hostel Activities and Societies:  Students Association Universiti Teknologi Malaysia Bachelor's Degree,  Mechanical Engineering , 3.4 1989  – 1994 Elected as Deputy Director of the Merbau Hostel Activities and Societies:  Students Association Universiti Teknologi Malaysia Bachelor's Degree,  Mechanical Engineering , 3.4 1989  – 1994 Elected as Deputy Director of the Merbau Hostel Activities and Societies:  Students Association Honors & Awards Divisional Awards Intel Corporation January 2015 Various divisional awards from Technology Manufacturing Group, Assembly Test Manufacturing and Internet of Things Group. Also received factory recognition award for Lean role model in 2010. \n Divisional Awards Intel Corporation January 2015 Various divisional awards from Technology Manufacturing Group, Assembly Test Manufacturing and Internet of Things Group. Also received factory recognition award for Lean role model in 2010. \n Divisional Awards Intel Corporation January 2015 Various divisional awards from Technology Manufacturing Group, Assembly Test Manufacturing and Internet of Things Group. Also received factory recognition award for Lean role model in 2010. \n Divisional Awards Intel Corporation January 2015 Various divisional awards from Technology Manufacturing Group, Assembly Test Manufacturing and Internet of Things Group. Also received factory recognition award for Lean role model in 2010. \n ", "Experience Senior Program Manager - SoC enabling Intel Corporation 2014  – Present (1 year) Haifa, Israel Senior Program Manager Intel Corporation 2009  –  2014  (5 years) Sacramento, California Area Program manager for Intel Security and manageability IP \n \nManager of chipset Firmware/software program office Software/Firmware engineeirng Manager Intel Corporation 1998  –  2009  (11 years) Jerusalem, Israel LAN Networking drivers engineering manager (1998-2004) - Managed team delivering kernel LAN net working drivers in Intels LAN group, focusing on Windows Operating Systems. \n \nManageability firmware engineering manager (2004-2005) - Managed delivery of first generation of embedded Intel chipset manageability firmware for enterprise systems. \n \nWireless LAN software group engineering manager (2005-2007) - Managed group delivering WiFi kernel and embedded drivers for Intel's Centrino WiFi products. \n \nManageability & Security firmware and Software engineering manager (2007-2009) - Managed group delivering firmware and software for Intel's manageability and security solutions for Intel's VPro and consumer platforms. Senior Program Manager - SoC enabling Intel Corporation 2014  – Present (1 year) Haifa, Israel Senior Program Manager - SoC enabling Intel Corporation 2014  – Present (1 year) Haifa, Israel Senior Program Manager Intel Corporation 2009  –  2014  (5 years) Sacramento, California Area Program manager for Intel Security and manageability IP \n \nManager of chipset Firmware/software program office Senior Program Manager Intel Corporation 2009  –  2014  (5 years) Sacramento, California Area Program manager for Intel Security and manageability IP \n \nManager of chipset Firmware/software program office Software/Firmware engineeirng Manager Intel Corporation 1998  –  2009  (11 years) Jerusalem, Israel LAN Networking drivers engineering manager (1998-2004) - Managed team delivering kernel LAN net working drivers in Intels LAN group, focusing on Windows Operating Systems. \n \nManageability firmware engineering manager (2004-2005) - Managed delivery of first generation of embedded Intel chipset manageability firmware for enterprise systems. \n \nWireless LAN software group engineering manager (2005-2007) - Managed group delivering WiFi kernel and embedded drivers for Intel's Centrino WiFi products. \n \nManageability & Security firmware and Software engineering manager (2007-2009) - Managed group delivering firmware and software for Intel's manageability and security solutions for Intel's VPro and consumer platforms. Software/Firmware engineeirng Manager Intel Corporation 1998  –  2009  (11 years) Jerusalem, Israel LAN Networking drivers engineering manager (1998-2004) - Managed team delivering kernel LAN net working drivers in Intels LAN group, focusing on Windows Operating Systems. \n \nManageability firmware engineering manager (2004-2005) - Managed delivery of first generation of embedded Intel chipset manageability firmware for enterprise systems. \n \nWireless LAN software group engineering manager (2005-2007) - Managed group delivering WiFi kernel and embedded drivers for Intel's Centrino WiFi products. \n \nManageability & Security firmware and Software engineering manager (2007-2009) - Managed group delivering firmware and software for Intel's manageability and security solutions for Intel's VPro and consumer platforms. Languages English Hebrew English Hebrew English Hebrew Skills Device Drivers Embedded Systems Embedded Software Software Engineering System Architecture Software Development Firmware Semiconductors SoC C Program Management Project Management management Skills  Device Drivers Embedded Systems Embedded Software Software Engineering System Architecture Software Development Firmware Semiconductors SoC C Program Management Project Management management Device Drivers Embedded Systems Embedded Software Software Engineering System Architecture Software Development Firmware Semiconductors SoC C Program Management Project Management management Device Drivers Embedded Systems Embedded Software Software Engineering System Architecture Software Development Firmware Semiconductors SoC C Program Management Project Management management Education The Hebrew University Master of Science (M.Sc.),  Computer Science 1994  – 1997 The Hebrew University Bachelor's degree,  Mathematics and Economics 1991  – 1993 The Hebrew University Master of Science (M.Sc.),  Computer Science 1994  – 1997 The Hebrew University Master of Science (M.Sc.),  Computer Science 1994  – 1997 The Hebrew University Master of Science (M.Sc.),  Computer Science 1994  – 1997 The Hebrew University Bachelor's degree,  Mathematics and Economics 1991  – 1993 The Hebrew University Bachelor's degree,  Mathematics and Economics 1991  – 1993 The Hebrew University Bachelor's degree,  Mathematics and Economics 1991  – 1993 ", "Experience Senior Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Director of Products Security Industry February 2013  –  March 2014  (1 year 2 months) Product Line Manager Wavion April 2008  –  February 2013  (4 years 11 months) Solutions product line manager. Managing products life-cycle (MRD to EOL) \nManaging OEM/ODM programs. Castomer Project Manager Texas Instruments October 2004  –  January 2008  (3 years 4 months) Managing customers programs from North America (Motorola and RIM) SW Application Engineer Marvell January 2002  –  September 2004  (2 years 9 months) Leading the SW integration with major customers Project Manager APAC Surf Communication Solutions 2000  –  2002  (2 years) Responsible to all programs in APAC including pre-sale, project management and delivery DSP SW Engineer Surf Communication Solutions 1998  –  2000  (2 years) VoIP SW developer Senior Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Senior Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Director of Products Security Industry February 2013  –  March 2014  (1 year 2 months) Director of Products Security Industry February 2013  –  March 2014  (1 year 2 months) Product Line Manager Wavion April 2008  –  February 2013  (4 years 11 months) Solutions product line manager. Managing products life-cycle (MRD to EOL) \nManaging OEM/ODM programs. Product Line Manager Wavion April 2008  –  February 2013  (4 years 11 months) Solutions product line manager. Managing products life-cycle (MRD to EOL) \nManaging OEM/ODM programs. Castomer Project Manager Texas Instruments October 2004  –  January 2008  (3 years 4 months) Managing customers programs from North America (Motorola and RIM) Castomer Project Manager Texas Instruments October 2004  –  January 2008  (3 years 4 months) Managing customers programs from North America (Motorola and RIM) SW Application Engineer Marvell January 2002  –  September 2004  (2 years 9 months) Leading the SW integration with major customers SW Application Engineer Marvell January 2002  –  September 2004  (2 years 9 months) Leading the SW integration with major customers Project Manager APAC Surf Communication Solutions 2000  –  2002  (2 years) Responsible to all programs in APAC including pre-sale, project management and delivery Project Manager APAC Surf Communication Solutions 2000  –  2002  (2 years) Responsible to all programs in APAC including pre-sale, project management and delivery DSP SW Engineer Surf Communication Solutions 1998  –  2000  (2 years) VoIP SW developer DSP SW Engineer Surf Communication Solutions 1998  –  2000  (2 years) VoIP SW developer Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills WiFi Wireless Product Management Wireless Networking WLAN IEEE 802.11 Wireless Broadband Pre-sales Project Management Program Management OEMs ODM RF Ethernet Embedded Systems Embedded Software Mobile Devices IP Cellular Communications Telecommunications Integration SoC WiMAX System Architecture Mobile Communications Go-to-market Strategy See 11+     See less Skills  WiFi Wireless Product Management Wireless Networking WLAN IEEE 802.11 Wireless Broadband Pre-sales Project Management Program Management OEMs ODM RF Ethernet Embedded Systems Embedded Software Mobile Devices IP Cellular Communications Telecommunications Integration SoC WiMAX System Architecture Mobile Communications Go-to-market Strategy See 11+     See less WiFi Wireless Product Management Wireless Networking WLAN IEEE 802.11 Wireless Broadband Pre-sales Project Management Program Management OEMs ODM RF Ethernet Embedded Systems Embedded Software Mobile Devices IP Cellular Communications Telecommunications Integration SoC WiMAX System Architecture Mobile Communications Go-to-market Strategy See 11+     See less WiFi Wireless Product Management Wireless Networking WLAN IEEE 802.11 Wireless Broadband Pre-sales Project Management Program Management OEMs ODM RF Ethernet Embedded Systems Embedded Software Mobile Devices IP Cellular Communications Telecommunications Integration SoC WiMAX System Architecture Mobile Communications Go-to-market Strategy See 11+     See less Education Haifa University Executive MBA,  International program 2013  – 2014 Technion-Machon Technologi Le' Israel Bachelor of Science (BSc),  Computer Science 2001  – 2005 Haifa University Executive MBA,  International program 2013  – 2014 Haifa University Executive MBA,  International program 2013  – 2014 Haifa University Executive MBA,  International program 2013  – 2014 Technion-Machon Technologi Le' Israel Bachelor of Science (BSc),  Computer Science 2001  – 2005 Technion-Machon Technologi Le' Israel Bachelor of Science (BSc),  Computer Science 2001  – 2005 Technion-Machon Technologi Le' Israel Bachelor of Science (BSc),  Computer Science 2001  – 2005 Honors & Awards ", "Skills Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Skills  Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less ", "Experience PM Intel Senior Program Manager Intel Corporation December 1978  – Present (36 years 9 months) Folsom, ca PM Intel PM Intel Senior Program Manager Intel Corporation December 1978  – Present (36 years 9 months) Folsom, ca Senior Program Manager Intel Corporation December 1978  – Present (36 years 9 months) Folsom, ca ", "Experience Senior Program manager Intel Corporation 2000  – Present (15 years) Senior Program manager Intel Corporation 2000  – Present (15 years) Senior Program manager Intel Corporation 2000  – Present (15 years) Education Arizona State University Master of Science (M.S.),  Computer Engineering , 3.9 1998  – 2000 Activities and Societies:  Alpha phi gamma society for outstanding academic achievement Arizona State University Master of Science (M.S.),  Computer Engineering , 3.9 1998  – 2000 Activities and Societies:  Alpha phi gamma society for outstanding academic achievement Arizona State University Master of Science (M.S.),  Computer Engineering , 3.9 1998  – 2000 Activities and Societies:  Alpha phi gamma society for outstanding academic achievement Arizona State University Master of Science (M.S.),  Computer Engineering , 3.9 1998  – 2000 Activities and Societies:  Alpha phi gamma society for outstanding academic achievement ", "Experience senior program manager Intel Corporation senior program manager Intel Corporation senior program manager Intel Corporation Skills Program Management Cross-functional Team... Semiconductors Product Management Testing Software Development Manufacturing Process Improvement Embedded Systems Product Development Skills  Program Management Cross-functional Team... Semiconductors Product Management Testing Software Development Manufacturing Process Improvement Embedded Systems Product Development Program Management Cross-functional Team... Semiconductors Product Management Testing Software Development Manufacturing Process Improvement Embedded Systems Product Development Program Management Cross-functional Team... Semiconductors Product Management Testing Software Development Manufacturing Process Improvement Embedded Systems Product Development ", "Summary High Technology Professional, with Duke MS and MBA, with diverse experience in team leadership, project management, product development, and customer relationships for Fortune 500 Technology Companies. Ingenious and tenacious problem solver dedicated to continuous learning. Successfully negotiated to ensure reduced material costs. Analyzed and presented business cases designed to reduce product costs. Key player in critical situation discovery, debug, and resolution. Experienced in managing virtual teams. Specialties:project management, team leadership, product development, problem solving, customer service, negotiation, relationship building, translation of complex technical information Summary High Technology Professional, with Duke MS and MBA, with diverse experience in team leadership, project management, product development, and customer relationships for Fortune 500 Technology Companies. Ingenious and tenacious problem solver dedicated to continuous learning. Successfully negotiated to ensure reduced material costs. Analyzed and presented business cases designed to reduce product costs. Key player in critical situation discovery, debug, and resolution. Experienced in managing virtual teams. Specialties:project management, team leadership, product development, problem solving, customer service, negotiation, relationship building, translation of complex technical information High Technology Professional, with Duke MS and MBA, with diverse experience in team leadership, project management, product development, and customer relationships for Fortune 500 Technology Companies. Ingenious and tenacious problem solver dedicated to continuous learning. Successfully negotiated to ensure reduced material costs. Analyzed and presented business cases designed to reduce product costs. Key player in critical situation discovery, debug, and resolution. Experienced in managing virtual teams. Specialties:project management, team leadership, product development, problem solving, customer service, negotiation, relationship building, translation of complex technical information High Technology Professional, with Duke MS and MBA, with diverse experience in team leadership, project management, product development, and customer relationships for Fortune 500 Technology Companies. Ingenious and tenacious problem solver dedicated to continuous learning. Successfully negotiated to ensure reduced material costs. Analyzed and presented business cases designed to reduce product costs. Key player in critical situation discovery, debug, and resolution. Experienced in managing virtual teams. Specialties:project management, team leadership, product development, problem solving, customer service, negotiation, relationship building, translation of complex technical information Experience Senior Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Greater Philadelphia Area Data Center Group Fabrics Program Management Strategic Relationship Manager Agilent Technologies 2009  –  July 2014  (5 years) Strategic Supplier relationship owner for strategic High Voltage, Printed Circuit Assembly, and Interconnect spend. Project Manager IBM 2007  –  2009  (2 years) Raleigh-Durham, North Carolina Area Technical Project Manager for xSeries Systems Management Hardware Development Circuit Design Engineer IBM 2003  –  2007  (4 years) Raleigh-Durham, North Carolina Area Digital Circuit Designer for Custom Memory Arrays and High Speed Address Lookup Tables for the Embedded PowerPC Core Offerings Applications Engineer IBM 2001  –  2003  (2 years) Raleigh-Durham, North Carolina Area Represented IBM's Electronic Design Automation Group for the Raleigh ASIC Design Center specializing in Timing, Placement, and Wiring tools Verification Engineer IBM 2000  –  2001  (1 year) Raleigh-Durham, North Carolina Area Provided Fixed and Random Functional Verification of the Data Side Memory Array for Embedded PowerPC Core Development Software Engineer Xerox May 1999  –  August 1999  (4 months) Software Engineer Xerox May 1998  –  August 1998  (4 months) Senior Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Greater Philadelphia Area Data Center Group Fabrics Program Management Senior Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Greater Philadelphia Area Data Center Group Fabrics Program Management Strategic Relationship Manager Agilent Technologies 2009  –  July 2014  (5 years) Strategic Supplier relationship owner for strategic High Voltage, Printed Circuit Assembly, and Interconnect spend. Strategic Relationship Manager Agilent Technologies 2009  –  July 2014  (5 years) Strategic Supplier relationship owner for strategic High Voltage, Printed Circuit Assembly, and Interconnect spend. Project Manager IBM 2007  –  2009  (2 years) Raleigh-Durham, North Carolina Area Technical Project Manager for xSeries Systems Management Hardware Development Project Manager IBM 2007  –  2009  (2 years) Raleigh-Durham, North Carolina Area Technical Project Manager for xSeries Systems Management Hardware Development Circuit Design Engineer IBM 2003  –  2007  (4 years) Raleigh-Durham, North Carolina Area Digital Circuit Designer for Custom Memory Arrays and High Speed Address Lookup Tables for the Embedded PowerPC Core Offerings Circuit Design Engineer IBM 2003  –  2007  (4 years) Raleigh-Durham, North Carolina Area Digital Circuit Designer for Custom Memory Arrays and High Speed Address Lookup Tables for the Embedded PowerPC Core Offerings Applications Engineer IBM 2001  –  2003  (2 years) Raleigh-Durham, North Carolina Area Represented IBM's Electronic Design Automation Group for the Raleigh ASIC Design Center specializing in Timing, Placement, and Wiring tools Applications Engineer IBM 2001  –  2003  (2 years) Raleigh-Durham, North Carolina Area Represented IBM's Electronic Design Automation Group for the Raleigh ASIC Design Center specializing in Timing, Placement, and Wiring tools Verification Engineer IBM 2000  –  2001  (1 year) Raleigh-Durham, North Carolina Area Provided Fixed and Random Functional Verification of the Data Side Memory Array for Embedded PowerPC Core Development Verification Engineer IBM 2000  –  2001  (1 year) Raleigh-Durham, North Carolina Area Provided Fixed and Random Functional Verification of the Data Side Memory Array for Embedded PowerPC Core Development Software Engineer Xerox May 1999  –  August 1999  (4 months) Software Engineer Xerox May 1999  –  August 1999  (4 months) Software Engineer Xerox May 1998  –  August 1998  (4 months) Software Engineer Xerox May 1998  –  August 1998  (4 months) Skills Product Development Problem Solving PowerPC Processors Hardware Design Circuit Simulation Circuit Design Simulation Circuit Analysis Low Power Design Electronics Hardware Development Optimization High Performance... Embedded Systems Server Hardware IBM Servers Semiconductors Analysis Perl Computer Hardware EDA IC Strategic Planning Business Strategy Operations Management Contract Negotiation Cost Reduction Negotiation Cost Supplier Management Supply Chain Management Strategy Development Vendor Strategic Sourcing Planning Process Development Cross-functional Team... Team Leadership Highly Adaptable Innovative Thinking ASIC Verilog Strategy Simulations Hardware Architecture Supply Management Debugging Project Management Program Management See 35+     See less Skills  Product Development Problem Solving PowerPC Processors Hardware Design Circuit Simulation Circuit Design Simulation Circuit Analysis Low Power Design Electronics Hardware Development Optimization High Performance... Embedded Systems Server Hardware IBM Servers Semiconductors Analysis Perl Computer Hardware EDA IC Strategic Planning Business Strategy Operations Management Contract Negotiation Cost Reduction Negotiation Cost Supplier Management Supply Chain Management Strategy Development Vendor Strategic Sourcing Planning Process Development Cross-functional Team... Team Leadership Highly Adaptable Innovative Thinking ASIC Verilog Strategy Simulations Hardware Architecture Supply Management Debugging Project Management Program Management See 35+     See less Product Development Problem Solving PowerPC Processors Hardware Design Circuit Simulation Circuit Design Simulation Circuit Analysis Low Power Design Electronics Hardware Development Optimization High Performance... Embedded Systems Server Hardware IBM Servers Semiconductors Analysis Perl Computer Hardware EDA IC Strategic Planning Business Strategy Operations Management Contract Negotiation Cost Reduction Negotiation Cost Supplier Management Supply Chain Management Strategy Development Vendor Strategic Sourcing Planning Process Development Cross-functional Team... Team Leadership Highly Adaptable Innovative Thinking ASIC Verilog Strategy Simulations Hardware Architecture Supply Management Debugging Project Management Program Management See 35+     See less Product Development Problem Solving PowerPC Processors Hardware Design Circuit Simulation Circuit Design Simulation Circuit Analysis Low Power Design Electronics Hardware Development Optimization High Performance... Embedded Systems Server Hardware IBM Servers Semiconductors Analysis Perl Computer Hardware EDA IC Strategic Planning Business Strategy Operations Management Contract Negotiation Cost Reduction Negotiation Cost Supplier Management Supply Chain Management Strategy Development Vendor Strategic Sourcing Planning Process Development Cross-functional Team... Team Leadership Highly Adaptable Innovative Thinking ASIC Verilog Strategy Simulations Hardware Architecture Supply Management Debugging Project Management Program Management See 35+     See less Education Duke University - The Fuqua School of Business MBA,  Business 2007  – 2008 Duke University MS,  Electrical Engineering 1999  – 2001 Syracuse University BS,  Computer Engineering 1995  – 1999 Duke University - The Fuqua School of Business MBA,  Business 2007  – 2008 Duke University - The Fuqua School of Business MBA,  Business 2007  – 2008 Duke University - The Fuqua School of Business MBA,  Business 2007  – 2008 Duke University MS,  Electrical Engineering 1999  – 2001 Duke University MS,  Electrical Engineering 1999  – 2001 Duke University MS,  Electrical Engineering 1999  – 2001 Syracuse University BS,  Computer Engineering 1995  – 1999 Syracuse University BS,  Computer Engineering 1995  – 1999 Syracuse University BS,  Computer Engineering 1995  – 1999 Honors & Awards Additional Honors & Awards Engineering Graduate Student Teacher of the Year 2001 \nEagle Scout Award Additional Honors & Awards Engineering Graduate Student Teacher of the Year 2001 \nEagle Scout Award Additional Honors & Awards Engineering Graduate Student Teacher of the Year 2001 \nEagle Scout Award Additional Honors & Awards Engineering Graduate Student Teacher of the Year 2001 \nEagle Scout Award "]}