{"position": "Senior Attorney", "company": "Intel Corporation", "profiles": ["Summary WHO AM I: A driven legal eagle passionate to lead and manage talented cross-functional teams to create win-win projects/deals and to foster a supportive work-environment for others. \n \nBIOGRAPHY: A international multi-lingual corpprate in-house attorney and business partner with over 15+ years experience in Intellectual Property licensing, Commercial negotiations, and Compliance (Anti-Trust, Security and Privacy) policy creation/training within the industries of Technology (Semiconductors) and Arts/Entertainment. My work addresses legal boundaries to a company's strategic goals. Present transactions I support include a R&D amd manufacturing joint venture, business development proposals, pricing strategies, and complex commercial negotiations. Experience includes positions as a adjunct aw lecturer in Frankfurt Germany, in-house counsel for an international entertainment company, law firm associate, I-Banking intern, and even a senior financial analyst. Summary WHO AM I: A driven legal eagle passionate to lead and manage talented cross-functional teams to create win-win projects/deals and to foster a supportive work-environment for others. \n \nBIOGRAPHY: A international multi-lingual corpprate in-house attorney and business partner with over 15+ years experience in Intellectual Property licensing, Commercial negotiations, and Compliance (Anti-Trust, Security and Privacy) policy creation/training within the industries of Technology (Semiconductors) and Arts/Entertainment. My work addresses legal boundaries to a company's strategic goals. Present transactions I support include a R&D amd manufacturing joint venture, business development proposals, pricing strategies, and complex commercial negotiations. Experience includes positions as a adjunct aw lecturer in Frankfurt Germany, in-house counsel for an international entertainment company, law firm associate, I-Banking intern, and even a senior financial analyst. WHO AM I: A driven legal eagle passionate to lead and manage talented cross-functional teams to create win-win projects/deals and to foster a supportive work-environment for others. \n \nBIOGRAPHY: A international multi-lingual corpprate in-house attorney and business partner with over 15+ years experience in Intellectual Property licensing, Commercial negotiations, and Compliance (Anti-Trust, Security and Privacy) policy creation/training within the industries of Technology (Semiconductors) and Arts/Entertainment. My work addresses legal boundaries to a company's strategic goals. Present transactions I support include a R&D amd manufacturing joint venture, business development proposals, pricing strategies, and complex commercial negotiations. Experience includes positions as a adjunct aw lecturer in Frankfurt Germany, in-house counsel for an international entertainment company, law firm associate, I-Banking intern, and even a senior financial analyst. WHO AM I: A driven legal eagle passionate to lead and manage talented cross-functional teams to create win-win projects/deals and to foster a supportive work-environment for others. \n \nBIOGRAPHY: A international multi-lingual corpprate in-house attorney and business partner with over 15+ years experience in Intellectual Property licensing, Commercial negotiations, and Compliance (Anti-Trust, Security and Privacy) policy creation/training within the industries of Technology (Semiconductors) and Arts/Entertainment. My work addresses legal boundaries to a company's strategic goals. Present transactions I support include a R&D amd manufacturing joint venture, business development proposals, pricing strategies, and complex commercial negotiations. Experience includes positions as a adjunct aw lecturer in Frankfurt Germany, in-house counsel for an international entertainment company, law firm associate, I-Banking intern, and even a senior financial analyst. Experience Senior Attorney - Intel Corporation Intel Corporation February 2010  – Present (5 years 7 months) Folsom, Calinfora Technology & Manufacturing Group/ NVM Solutions Group. Senior Attorney supporting Intel's joint venture relationship with Micron.  \n \nSales and Marketing Legal. Senior Attorney for Intel sales teams for a major server OEMs, our world-wide embedded sales team, and Intel's on-line sales efforts. In this role, I provide antitrust, privacy, pricing and compliance counseling. Act as co-chair for the pro bono legal program at this Intel location. Senior Attorney - Intel Corporation Intel Corporation February 2010  – Present (5 years 7 months) Folsom, Calinfora Technology & Manufacturing Group/ NVM Solutions Group. Senior Attorney supporting Intel's joint venture relationship with Micron.  \n \nSales and Marketing Legal. Senior Attorney for Intel sales teams for a major server OEMs, our world-wide embedded sales team, and Intel's on-line sales efforts. In this role, I provide antitrust, privacy, pricing and compliance counseling. Act as co-chair for the pro bono legal program at this Intel location. Senior Attorney - Intel Corporation Intel Corporation February 2010  – Present (5 years 7 months) Folsom, Calinfora Technology & Manufacturing Group/ NVM Solutions Group. Senior Attorney supporting Intel's joint venture relationship with Micron.  \n \nSales and Marketing Legal. Senior Attorney for Intel sales teams for a major server OEMs, our world-wide embedded sales team, and Intel's on-line sales efforts. In this role, I provide antitrust, privacy, pricing and compliance counseling. Act as co-chair for the pro bono legal program at this Intel location. Languages German Professional working proficiency Italian Limited working proficiency French Elementary proficiency Spanish Elementary proficiency German Professional working proficiency Italian Limited working proficiency French Elementary proficiency Spanish Elementary proficiency German Professional working proficiency Italian Limited working proficiency French Elementary proficiency Spanish Elementary proficiency Professional working proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills Intellectual Property Licensing Mergers & Acquisitions Joint Ventures Entertainment Law Entertainment Industry Contract Negotiation Cross-functional Team... Trade Secrets Privacy Law Strategy Software Licensing Patents Corporate Governance Antitrust Counseling Commercial Litigation Legal Compliance Mergers Financial Analysis Patent Litigation M&A experience Legal Writing Patent Prosecution Privacy Issues IP Licensing Corporate Law Management Media & Entertainment Digital Media See 14+     See less Skills  Intellectual Property Licensing Mergers & Acquisitions Joint Ventures Entertainment Law Entertainment Industry Contract Negotiation Cross-functional Team... Trade Secrets Privacy Law Strategy Software Licensing Patents Corporate Governance Antitrust Counseling Commercial Litigation Legal Compliance Mergers Financial Analysis Patent Litigation M&A experience Legal Writing Patent Prosecution Privacy Issues IP Licensing Corporate Law Management Media & Entertainment Digital Media See 14+     See less Intellectual Property Licensing Mergers & Acquisitions Joint Ventures Entertainment Law Entertainment Industry Contract Negotiation Cross-functional Team... Trade Secrets Privacy Law Strategy Software Licensing Patents Corporate Governance Antitrust Counseling Commercial Litigation Legal Compliance Mergers Financial Analysis Patent Litigation M&A experience Legal Writing Patent Prosecution Privacy Issues IP Licensing Corporate Law Management Media & Entertainment Digital Media See 14+     See less Intellectual Property Licensing Mergers & Acquisitions Joint Ventures Entertainment Law Entertainment Industry Contract Negotiation Cross-functional Team... Trade Secrets Privacy Law Strategy Software Licensing Patents Corporate Governance Antitrust Counseling Commercial Litigation Legal Compliance Mergers Financial Analysis Patent Litigation M&A experience Legal Writing Patent Prosecution Privacy Issues IP Licensing Corporate Law Management Media & Entertainment Digital Media See 14+     See less ", "Summary ► US (NY) and EU (French and UK) qualified attorney with recognized expertise in US and International laws, a MBA degree, and over 15 years of law firm and in-house experience in both large and medium size US publicly-listed corporations in the technology sector  \n► Expertise in both civil law and common law legal systems  \n► Broad range of US and international legal and compliance expertise  \n► Strong business acumen; entrepreneurial, leadership and technology expertise \n \nMain areas of practice include technology law, software law, cyberlaw, internet law, computer, e-commerce, IP and IT law, as well as social media law, privacy and data security law, under French, UK and US law. Summary ► US (NY) and EU (French and UK) qualified attorney with recognized expertise in US and International laws, a MBA degree, and over 15 years of law firm and in-house experience in both large and medium size US publicly-listed corporations in the technology sector  \n► Expertise in both civil law and common law legal systems  \n► Broad range of US and international legal and compliance expertise  \n► Strong business acumen; entrepreneurial, leadership and technology expertise \n \nMain areas of practice include technology law, software law, cyberlaw, internet law, computer, e-commerce, IP and IT law, as well as social media law, privacy and data security law, under French, UK and US law. ► US (NY) and EU (French and UK) qualified attorney with recognized expertise in US and International laws, a MBA degree, and over 15 years of law firm and in-house experience in both large and medium size US publicly-listed corporations in the technology sector  \n► Expertise in both civil law and common law legal systems  \n► Broad range of US and international legal and compliance expertise  \n► Strong business acumen; entrepreneurial, leadership and technology expertise \n \nMain areas of practice include technology law, software law, cyberlaw, internet law, computer, e-commerce, IP and IT law, as well as social media law, privacy and data security law, under French, UK and US law. ► US (NY) and EU (French and UK) qualified attorney with recognized expertise in US and International laws, a MBA degree, and over 15 years of law firm and in-house experience in both large and medium size US publicly-listed corporations in the technology sector  \n► Expertise in both civil law and common law legal systems  \n► Broad range of US and international legal and compliance expertise  \n► Strong business acumen; entrepreneurial, leadership and technology expertise \n \nMain areas of practice include technology law, software law, cyberlaw, internet law, computer, e-commerce, IP and IT law, as well as social media law, privacy and data security law, under French, UK and US law. Experience Owner Law Office of S. Grynwajc, PLLC January 2011  – Present (4 years 8 months) Greater New York City Area Admitted as a lawyer in France, the UK and the US (NY), I advise entrepreneurs, start ups and small to mid-size companies in their operations in Europe and in the US.  \n \nI serve as acting General Counsel to a number of small and medium size companies that require dedicated, in-house legal management and resources, but are not yet large enough to justify hiring a full-time in-house counsel.  \n \nI also provide my services in support of established in-house legal departments of all sizes which need temporary additional resources on a part time basis to support their operations. \n \nIn either of the above capacities, my former 15 years of experience as in-house counsel in the EU and the US advising corporations in their international operations, together with my ability to draft/negotiate agreements and provide legal expertise under both US and European laws is a strong asset, particularly in the following situations: \n \n1. Company A is US-based and is looking to do business in Europe but does not have a presence there. Company A needs a lawyer who can localize its contract templates to EU laws, but also negotiate these contracts in the local language and under local laws in the foreign country.  \n \n2. Company B is EU-based or recently opened an office in the US. Company B wants a lawyer who can localize its EU-modeled contracts for use in the US, but who can also negotiate these contracts with US-based suppliers, customers and partners.  \n \nIn these situations many companies can't afford to retain the services of a foreign office of a large law firm. This is where I come in. My services offer the following benefits: \n \nCOST EFFECTIVENESS: Through outsourcing, companies can significantly reduce their fixed costs, such as employee staff costs \n \nSCALABILITY: Companies can flexibly scale their operations on an as needed basis \n \nEXPERTISE: Many years of experience for an affordable cost Director, Legal and Head of Compliance EMEA Symantec Corporation October 2004  –  December 2010  (6 years 3 months) London, United Kingdom Regional Head of Legal and Compliance Lead Counsel for EMEA \n \n* Lead Legal Support to International Sales and Services operations \n* Drafting/negotiating technology agreements (e.g. end-user licenses, consulting, outsourcing, support); \n* Developed and managed the localization of contracts negotiation playbooks. Assisted in development of multi-jurisdictional online tool for contract negotiation. \n \n* Overall responsibility for international Privacy compliance: \n- strategic development and implementation of global privacy programs; \n- monitoring of continued compliance with US and international laws; \n- drafting global and region/country-specific policies, procedures and guidelines; \n- managing cross-border data flows in compliance with international legal requirements; \n- developing and delivering various cross-regional training and awareness programs; \n- overseeing up-to-date registration and filings with local authorities; \n- conducting PRAs of all BU initiatives involving the process \n \n* Overall responsibility for international FCPA/Anti-Corruption efforts: \n- reviewing/localizing corporate policies against local anti-corruption legislation  \n- implementing various regional/localized employee trainings on FCPA, UK Bribery Act and other national legislations and corporate policies; \n- conducting compliance risk assessments of employee, third party and company business activity; \n- supervising revisions, issuance and dissemination of Code of Conduct and corporate policies on a global basis, and associated training; \n- conducting investigations, and drafting reports regarding potential violations of company policies; \n- advising on and assisting with the development, adaptation, localization and maintenance of global compliance online information resources; \n- implementing complaint procedures/whistleblower mechanisms on a global basis. \n \n* Overall responsibility for monitoring other international compliance areas (e.g., insider trading, antitrust, gifts, expenses, anti-harassement). General Counsel, EMEA Altiris, Inc. October 2004  –  June 2007  (2 years 9 months) London, United Kingdom Overseeing all legal activity in EMEA. Secondary legal support to US operations. \n- Set up and managed an internationally-based legal team to support all EMEA business operations \n- Set up and managed the EMEA Legal budget \n- Key member of the company's EMEA management \n \n* Drafted and negotiated numerous software licensing and associated support and services agreements under various laws (e.g. US, UK, French, German). Ensured the up-to-date localization of all agreement templates to various local EU laws \n \n* Responsible for all IP matters in EMEA, e.g. brand protection, trademark registration and enforcement, and general international/in-country litigation. Trained software developers and other R&D staff on various aspects of IP (e.g. patents and other IP rights, Open Source/Linux, Use of 3rd party code) and assisted US patent prosecution team with securing invention disclosures from engineers and developing the company's patent portfolio. Supported the group's EMEA R&D activities. \n \n* Provided lead international support to the channel and marketing organizations, reviewing press releases, documentation and other materials for truth in advertising, ensuring proper TM usage and general compliance with national advertising legislations. Drafted and negotiated agreements with PR agencies across Europe. Supervised the creation of local websites/web portals in Europe. \n \n* Managed the day-to-day corporate administration of the various legal entities in EMEA. Oversaw the corporate integration in EMEA of the company's acquisitions, handled TUPE transfers, drafted intercompany asset purchase agreements,etc. Assisted in the review and drafting of the merger documentation with Symantec, and assisted with post-merger integration issues \n \n* Advised on all labor and employment-related issues in EMEA. Assisted with drafting employment policies and with implementing the company's Code of Conduct in Europe \n \n* Managed all HR and commercial litigation in EMEA Senior Attorney Intel Corporation August 2000  –  October 2004  (4 years 3 months) Swindon, United Kingdom EMEA Lead Business Counsel, Intel Communications Group \n \n* Advised business unit management on legal strategy, and directly resolved legal issues, with a particular focus on commercial and business law, technology and IP licensing and contract negotiations under common law (US/UK) as well as continental Europe's civil laws. Provided regular training to clients on IP and software licensing, SIG participation, GPL/LGPL, CPL and other Open Source licensing issues. Designed and implemented IP protection programs across EMEA, conducted patent harvestings at over 30 engineering sites, trained over 600 engineers and assisted in the submission of over 400 invention disclosure forms in support of EPO/PCT and/or US patent prosecution \n \n* Provided support to clients on major sales negotiations with key US and EMEA-based accounts. Supported the company's EMEA channel organization and managed contract relationships with pan-EMEA and in-country distributors of networking and communications products and technologies in the geography.  \n \n* Advised on marketing issues, reviewing marketing and sales material for truth in advertising, ensuring proper TM usage and compliance with EU and national advertising legislations. Advised on issues relating to promotions and contests across Europe. \n \n* Designed and implemented customized legal integration plans for the company's European-based acquisitions, and delivered inductive legal training (e.g. IP, Privacy, Antitrust, Confidentiality) to new employees in English, Spanish and French. Managed entity mergers/liquidations and any associated contract assignments and/or terminations. Oversaw the corporate integration and bookkeeping of the various acquired legal entities. \n \n* Managed litigation and/or ADR in the geography, and reporting out to corporate HQ on the status of various court proceedings. Drafted and negotiated several out-of-court settlements. Legal Counsel EMEA Schlumberger Technologies September 1997  –  May 2000  (2 years 9 months) Paris Area, France * Drafted and negotiated various domestic and international contracts (e.g. sales, maintenance, OEM, reseller, agency, distribution, licensing, consortia, technology and other IP-related agreements) under various EU national laws. Reviewed public and private procurements, as well as bids for state and local government contracts.  \n \n* Trained clients on various aspects of contracts and other agreement forms, as well as on branding and the use of the company's trademarks \n \n* Maintained the subsidiary/branch office database in over 20 jurisdictions, and provided legal support on M&A related activity \n \n* Managed litigation and alternative dispute resolution across EMEA Associate Anderson Kill & Olick February 1997  –  August 1997  (7 months) Greater New York City Area Lecturer of English Law University of Paris X School of Law September 1992  –  June 1995  (2 years 10 months) Paris Area, France Lectured over 600 French law students on the English legal system and fundamentals of English law Associate, M&A Practice Group Shearman & Sterling June 1994  –  May 1995  (1 year) Paris Area, France * Negotiated various corporate reorganizations and participated in the preparatory documentation for the privatisation of two French multinationals \n \n* Conducted due diligence reviews and extensive legal research in various areas of corporate and securities laws \n \n* Drafted several offering prospectuses and corporate memoranda \n \n* Performed work involving Public and Rule 144A Offerings and other compliance issues in French and US securities laws Summer Associate Freshfields Bruckhaus Deringer October 1993  –  December 1993  (3 months) Paris Area, France Arbitration department Summer Associate Autorité des marchés financiers (French equivalent of the US SEC) June 1993  –  September 1993  (4 months) Paris Area, France * Participated in the negotiation and conclusion of mutual assistance and recognition agreements between the French and several foreign financial markets' regulatory authorities \n \n* Drafted a comparataive analysis of the rules governing futures markets in France and Germany \n \n* Conducted a survey of the world's main emerging financial markets Owner Law Office of S. Grynwajc, PLLC January 2011  – Present (4 years 8 months) Greater New York City Area Admitted as a lawyer in France, the UK and the US (NY), I advise entrepreneurs, start ups and small to mid-size companies in their operations in Europe and in the US.  \n \nI serve as acting General Counsel to a number of small and medium size companies that require dedicated, in-house legal management and resources, but are not yet large enough to justify hiring a full-time in-house counsel.  \n \nI also provide my services in support of established in-house legal departments of all sizes which need temporary additional resources on a part time basis to support their operations. \n \nIn either of the above capacities, my former 15 years of experience as in-house counsel in the EU and the US advising corporations in their international operations, together with my ability to draft/negotiate agreements and provide legal expertise under both US and European laws is a strong asset, particularly in the following situations: \n \n1. Company A is US-based and is looking to do business in Europe but does not have a presence there. Company A needs a lawyer who can localize its contract templates to EU laws, but also negotiate these contracts in the local language and under local laws in the foreign country.  \n \n2. Company B is EU-based or recently opened an office in the US. Company B wants a lawyer who can localize its EU-modeled contracts for use in the US, but who can also negotiate these contracts with US-based suppliers, customers and partners.  \n \nIn these situations many companies can't afford to retain the services of a foreign office of a large law firm. This is where I come in. My services offer the following benefits: \n \nCOST EFFECTIVENESS: Through outsourcing, companies can significantly reduce their fixed costs, such as employee staff costs \n \nSCALABILITY: Companies can flexibly scale their operations on an as needed basis \n \nEXPERTISE: Many years of experience for an affordable cost Owner Law Office of S. Grynwajc, PLLC January 2011  – Present (4 years 8 months) Greater New York City Area Admitted as a lawyer in France, the UK and the US (NY), I advise entrepreneurs, start ups and small to mid-size companies in their operations in Europe and in the US.  \n \nI serve as acting General Counsel to a number of small and medium size companies that require dedicated, in-house legal management and resources, but are not yet large enough to justify hiring a full-time in-house counsel.  \n \nI also provide my services in support of established in-house legal departments of all sizes which need temporary additional resources on a part time basis to support their operations. \n \nIn either of the above capacities, my former 15 years of experience as in-house counsel in the EU and the US advising corporations in their international operations, together with my ability to draft/negotiate agreements and provide legal expertise under both US and European laws is a strong asset, particularly in the following situations: \n \n1. Company A is US-based and is looking to do business in Europe but does not have a presence there. Company A needs a lawyer who can localize its contract templates to EU laws, but also negotiate these contracts in the local language and under local laws in the foreign country.  \n \n2. Company B is EU-based or recently opened an office in the US. Company B wants a lawyer who can localize its EU-modeled contracts for use in the US, but who can also negotiate these contracts with US-based suppliers, customers and partners.  \n \nIn these situations many companies can't afford to retain the services of a foreign office of a large law firm. This is where I come in. My services offer the following benefits: \n \nCOST EFFECTIVENESS: Through outsourcing, companies can significantly reduce their fixed costs, such as employee staff costs \n \nSCALABILITY: Companies can flexibly scale their operations on an as needed basis \n \nEXPERTISE: Many years of experience for an affordable cost Director, Legal and Head of Compliance EMEA Symantec Corporation October 2004  –  December 2010  (6 years 3 months) London, United Kingdom Regional Head of Legal and Compliance Lead Counsel for EMEA \n \n* Lead Legal Support to International Sales and Services operations \n* Drafting/negotiating technology agreements (e.g. end-user licenses, consulting, outsourcing, support); \n* Developed and managed the localization of contracts negotiation playbooks. Assisted in development of multi-jurisdictional online tool for contract negotiation. \n \n* Overall responsibility for international Privacy compliance: \n- strategic development and implementation of global privacy programs; \n- monitoring of continued compliance with US and international laws; \n- drafting global and region/country-specific policies, procedures and guidelines; \n- managing cross-border data flows in compliance with international legal requirements; \n- developing and delivering various cross-regional training and awareness programs; \n- overseeing up-to-date registration and filings with local authorities; \n- conducting PRAs of all BU initiatives involving the process \n \n* Overall responsibility for international FCPA/Anti-Corruption efforts: \n- reviewing/localizing corporate policies against local anti-corruption legislation  \n- implementing various regional/localized employee trainings on FCPA, UK Bribery Act and other national legislations and corporate policies; \n- conducting compliance risk assessments of employee, third party and company business activity; \n- supervising revisions, issuance and dissemination of Code of Conduct and corporate policies on a global basis, and associated training; \n- conducting investigations, and drafting reports regarding potential violations of company policies; \n- advising on and assisting with the development, adaptation, localization and maintenance of global compliance online information resources; \n- implementing complaint procedures/whistleblower mechanisms on a global basis. \n \n* Overall responsibility for monitoring other international compliance areas (e.g., insider trading, antitrust, gifts, expenses, anti-harassement). Director, Legal and Head of Compliance EMEA Symantec Corporation October 2004  –  December 2010  (6 years 3 months) London, United Kingdom Regional Head of Legal and Compliance Lead Counsel for EMEA \n \n* Lead Legal Support to International Sales and Services operations \n* Drafting/negotiating technology agreements (e.g. end-user licenses, consulting, outsourcing, support); \n* Developed and managed the localization of contracts negotiation playbooks. Assisted in development of multi-jurisdictional online tool for contract negotiation. \n \n* Overall responsibility for international Privacy compliance: \n- strategic development and implementation of global privacy programs; \n- monitoring of continued compliance with US and international laws; \n- drafting global and region/country-specific policies, procedures and guidelines; \n- managing cross-border data flows in compliance with international legal requirements; \n- developing and delivering various cross-regional training and awareness programs; \n- overseeing up-to-date registration and filings with local authorities; \n- conducting PRAs of all BU initiatives involving the process \n \n* Overall responsibility for international FCPA/Anti-Corruption efforts: \n- reviewing/localizing corporate policies against local anti-corruption legislation  \n- implementing various regional/localized employee trainings on FCPA, UK Bribery Act and other national legislations and corporate policies; \n- conducting compliance risk assessments of employee, third party and company business activity; \n- supervising revisions, issuance and dissemination of Code of Conduct and corporate policies on a global basis, and associated training; \n- conducting investigations, and drafting reports regarding potential violations of company policies; \n- advising on and assisting with the development, adaptation, localization and maintenance of global compliance online information resources; \n- implementing complaint procedures/whistleblower mechanisms on a global basis. \n \n* Overall responsibility for monitoring other international compliance areas (e.g., insider trading, antitrust, gifts, expenses, anti-harassement). General Counsel, EMEA Altiris, Inc. October 2004  –  June 2007  (2 years 9 months) London, United Kingdom Overseeing all legal activity in EMEA. Secondary legal support to US operations. \n- Set up and managed an internationally-based legal team to support all EMEA business operations \n- Set up and managed the EMEA Legal budget \n- Key member of the company's EMEA management \n \n* Drafted and negotiated numerous software licensing and associated support and services agreements under various laws (e.g. US, UK, French, German). Ensured the up-to-date localization of all agreement templates to various local EU laws \n \n* Responsible for all IP matters in EMEA, e.g. brand protection, trademark registration and enforcement, and general international/in-country litigation. Trained software developers and other R&D staff on various aspects of IP (e.g. patents and other IP rights, Open Source/Linux, Use of 3rd party code) and assisted US patent prosecution team with securing invention disclosures from engineers and developing the company's patent portfolio. Supported the group's EMEA R&D activities. \n \n* Provided lead international support to the channel and marketing organizations, reviewing press releases, documentation and other materials for truth in advertising, ensuring proper TM usage and general compliance with national advertising legislations. Drafted and negotiated agreements with PR agencies across Europe. Supervised the creation of local websites/web portals in Europe. \n \n* Managed the day-to-day corporate administration of the various legal entities in EMEA. Oversaw the corporate integration in EMEA of the company's acquisitions, handled TUPE transfers, drafted intercompany asset purchase agreements,etc. Assisted in the review and drafting of the merger documentation with Symantec, and assisted with post-merger integration issues \n \n* Advised on all labor and employment-related issues in EMEA. Assisted with drafting employment policies and with implementing the company's Code of Conduct in Europe \n \n* Managed all HR and commercial litigation in EMEA General Counsel, EMEA Altiris, Inc. October 2004  –  June 2007  (2 years 9 months) London, United Kingdom Overseeing all legal activity in EMEA. Secondary legal support to US operations. \n- Set up and managed an internationally-based legal team to support all EMEA business operations \n- Set up and managed the EMEA Legal budget \n- Key member of the company's EMEA management \n \n* Drafted and negotiated numerous software licensing and associated support and services agreements under various laws (e.g. US, UK, French, German). Ensured the up-to-date localization of all agreement templates to various local EU laws \n \n* Responsible for all IP matters in EMEA, e.g. brand protection, trademark registration and enforcement, and general international/in-country litigation. Trained software developers and other R&D staff on various aspects of IP (e.g. patents and other IP rights, Open Source/Linux, Use of 3rd party code) and assisted US patent prosecution team with securing invention disclosures from engineers and developing the company's patent portfolio. Supported the group's EMEA R&D activities. \n \n* Provided lead international support to the channel and marketing organizations, reviewing press releases, documentation and other materials for truth in advertising, ensuring proper TM usage and general compliance with national advertising legislations. Drafted and negotiated agreements with PR agencies across Europe. Supervised the creation of local websites/web portals in Europe. \n \n* Managed the day-to-day corporate administration of the various legal entities in EMEA. Oversaw the corporate integration in EMEA of the company's acquisitions, handled TUPE transfers, drafted intercompany asset purchase agreements,etc. Assisted in the review and drafting of the merger documentation with Symantec, and assisted with post-merger integration issues \n \n* Advised on all labor and employment-related issues in EMEA. Assisted with drafting employment policies and with implementing the company's Code of Conduct in Europe \n \n* Managed all HR and commercial litigation in EMEA Senior Attorney Intel Corporation August 2000  –  October 2004  (4 years 3 months) Swindon, United Kingdom EMEA Lead Business Counsel, Intel Communications Group \n \n* Advised business unit management on legal strategy, and directly resolved legal issues, with a particular focus on commercial and business law, technology and IP licensing and contract negotiations under common law (US/UK) as well as continental Europe's civil laws. Provided regular training to clients on IP and software licensing, SIG participation, GPL/LGPL, CPL and other Open Source licensing issues. Designed and implemented IP protection programs across EMEA, conducted patent harvestings at over 30 engineering sites, trained over 600 engineers and assisted in the submission of over 400 invention disclosure forms in support of EPO/PCT and/or US patent prosecution \n \n* Provided support to clients on major sales negotiations with key US and EMEA-based accounts. Supported the company's EMEA channel organization and managed contract relationships with pan-EMEA and in-country distributors of networking and communications products and technologies in the geography.  \n \n* Advised on marketing issues, reviewing marketing and sales material for truth in advertising, ensuring proper TM usage and compliance with EU and national advertising legislations. Advised on issues relating to promotions and contests across Europe. \n \n* Designed and implemented customized legal integration plans for the company's European-based acquisitions, and delivered inductive legal training (e.g. IP, Privacy, Antitrust, Confidentiality) to new employees in English, Spanish and French. Managed entity mergers/liquidations and any associated contract assignments and/or terminations. Oversaw the corporate integration and bookkeeping of the various acquired legal entities. \n \n* Managed litigation and/or ADR in the geography, and reporting out to corporate HQ on the status of various court proceedings. Drafted and negotiated several out-of-court settlements. Senior Attorney Intel Corporation August 2000  –  October 2004  (4 years 3 months) Swindon, United Kingdom EMEA Lead Business Counsel, Intel Communications Group \n \n* Advised business unit management on legal strategy, and directly resolved legal issues, with a particular focus on commercial and business law, technology and IP licensing and contract negotiations under common law (US/UK) as well as continental Europe's civil laws. Provided regular training to clients on IP and software licensing, SIG participation, GPL/LGPL, CPL and other Open Source licensing issues. Designed and implemented IP protection programs across EMEA, conducted patent harvestings at over 30 engineering sites, trained over 600 engineers and assisted in the submission of over 400 invention disclosure forms in support of EPO/PCT and/or US patent prosecution \n \n* Provided support to clients on major sales negotiations with key US and EMEA-based accounts. Supported the company's EMEA channel organization and managed contract relationships with pan-EMEA and in-country distributors of networking and communications products and technologies in the geography.  \n \n* Advised on marketing issues, reviewing marketing and sales material for truth in advertising, ensuring proper TM usage and compliance with EU and national advertising legislations. Advised on issues relating to promotions and contests across Europe. \n \n* Designed and implemented customized legal integration plans for the company's European-based acquisitions, and delivered inductive legal training (e.g. IP, Privacy, Antitrust, Confidentiality) to new employees in English, Spanish and French. Managed entity mergers/liquidations and any associated contract assignments and/or terminations. Oversaw the corporate integration and bookkeeping of the various acquired legal entities. \n \n* Managed litigation and/or ADR in the geography, and reporting out to corporate HQ on the status of various court proceedings. Drafted and negotiated several out-of-court settlements. Legal Counsel EMEA Schlumberger Technologies September 1997  –  May 2000  (2 years 9 months) Paris Area, France * Drafted and negotiated various domestic and international contracts (e.g. sales, maintenance, OEM, reseller, agency, distribution, licensing, consortia, technology and other IP-related agreements) under various EU national laws. Reviewed public and private procurements, as well as bids for state and local government contracts.  \n \n* Trained clients on various aspects of contracts and other agreement forms, as well as on branding and the use of the company's trademarks \n \n* Maintained the subsidiary/branch office database in over 20 jurisdictions, and provided legal support on M&A related activity \n \n* Managed litigation and alternative dispute resolution across EMEA Legal Counsel EMEA Schlumberger Technologies September 1997  –  May 2000  (2 years 9 months) Paris Area, France * Drafted and negotiated various domestic and international contracts (e.g. sales, maintenance, OEM, reseller, agency, distribution, licensing, consortia, technology and other IP-related agreements) under various EU national laws. Reviewed public and private procurements, as well as bids for state and local government contracts.  \n \n* Trained clients on various aspects of contracts and other agreement forms, as well as on branding and the use of the company's trademarks \n \n* Maintained the subsidiary/branch office database in over 20 jurisdictions, and provided legal support on M&A related activity \n \n* Managed litigation and alternative dispute resolution across EMEA Associate Anderson Kill & Olick February 1997  –  August 1997  (7 months) Greater New York City Area Associate Anderson Kill & Olick February 1997  –  August 1997  (7 months) Greater New York City Area Lecturer of English Law University of Paris X School of Law September 1992  –  June 1995  (2 years 10 months) Paris Area, France Lectured over 600 French law students on the English legal system and fundamentals of English law Lecturer of English Law University of Paris X School of Law September 1992  –  June 1995  (2 years 10 months) Paris Area, France Lectured over 600 French law students on the English legal system and fundamentals of English law Associate, M&A Practice Group Shearman & Sterling June 1994  –  May 1995  (1 year) Paris Area, France * Negotiated various corporate reorganizations and participated in the preparatory documentation for the privatisation of two French multinationals \n \n* Conducted due diligence reviews and extensive legal research in various areas of corporate and securities laws \n \n* Drafted several offering prospectuses and corporate memoranda \n \n* Performed work involving Public and Rule 144A Offerings and other compliance issues in French and US securities laws Associate, M&A Practice Group Shearman & Sterling June 1994  –  May 1995  (1 year) Paris Area, France * Negotiated various corporate reorganizations and participated in the preparatory documentation for the privatisation of two French multinationals \n \n* Conducted due diligence reviews and extensive legal research in various areas of corporate and securities laws \n \n* Drafted several offering prospectuses and corporate memoranda \n \n* Performed work involving Public and Rule 144A Offerings and other compliance issues in French and US securities laws Summer Associate Freshfields Bruckhaus Deringer October 1993  –  December 1993  (3 months) Paris Area, France Arbitration department Summer Associate Freshfields Bruckhaus Deringer October 1993  –  December 1993  (3 months) Paris Area, France Arbitration department Summer Associate Autorité des marchés financiers (French equivalent of the US SEC) June 1993  –  September 1993  (4 months) Paris Area, France * Participated in the negotiation and conclusion of mutual assistance and recognition agreements between the French and several foreign financial markets' regulatory authorities \n \n* Drafted a comparataive analysis of the rules governing futures markets in France and Germany \n \n* Conducted a survey of the world's main emerging financial markets Summer Associate Autorité des marchés financiers (French equivalent of the US SEC) June 1993  –  September 1993  (4 months) Paris Area, France * Participated in the negotiation and conclusion of mutual assistance and recognition agreements between the French and several foreign financial markets' regulatory authorities \n \n* Drafted a comparataive analysis of the rules governing futures markets in France and Germany \n \n* Conducted a survey of the world's main emerging financial markets Languages English Native or bilingual proficiency French Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Intellectual Property International Law Corporate Law Privacy Law Licensing Legal Advice Data Privacy Software Licensing Contract Negotiation French Law English Law European Law International Business... International Business International... Copyright Law Comparative Law Trademarks Start-ups Information Technology Personal Data Protection Legal Compliance IT law Data Protection Act Transactional Law FCPA Contract Law Legal Assistance Due Diligence Entrepreneurship Mergers Global Operations UK Bribery Act Patents Global Compliance Social Media Anti-corruption Sarbanes-Oxley Internet Law Electronic Signatures Digital Law Data Security Cyberlaw Open Source SaaS Cloud Computing Big Data GLBA Mobile Applications Computer Law See 35+     See less Skills  Intellectual Property International Law Corporate Law Privacy Law Licensing Legal Advice Data Privacy Software Licensing Contract Negotiation French Law English Law European Law International Business... International Business International... Copyright Law Comparative Law Trademarks Start-ups Information Technology Personal Data Protection Legal Compliance IT law Data Protection Act Transactional Law FCPA Contract Law Legal Assistance Due Diligence Entrepreneurship Mergers Global Operations UK Bribery Act Patents Global Compliance Social Media Anti-corruption Sarbanes-Oxley Internet Law Electronic Signatures Digital Law Data Security Cyberlaw Open Source SaaS Cloud Computing Big Data GLBA Mobile Applications Computer Law See 35+     See less Intellectual Property International Law Corporate Law Privacy Law Licensing Legal Advice Data Privacy Software Licensing Contract Negotiation French Law English Law European Law International Business... International Business International... Copyright Law Comparative Law Trademarks Start-ups Information Technology Personal Data Protection Legal Compliance IT law Data Protection Act Transactional Law FCPA Contract Law Legal Assistance Due Diligence Entrepreneurship Mergers Global Operations UK Bribery Act Patents Global Compliance Social Media Anti-corruption Sarbanes-Oxley Internet Law Electronic Signatures Digital Law Data Security Cyberlaw Open Source SaaS Cloud Computing Big Data GLBA Mobile Applications Computer Law See 35+     See less Intellectual Property International Law Corporate Law Privacy Law Licensing Legal Advice Data Privacy Software Licensing Contract Negotiation French Law English Law European Law International Business... International Business International... Copyright Law Comparative Law Trademarks Start-ups Information Technology Personal Data Protection Legal Compliance IT law Data Protection Act Transactional Law FCPA Contract Law Legal Assistance Due Diligence Entrepreneurship Mergers Global Operations UK Bribery Act Patents Global Compliance Social Media Anti-corruption Sarbanes-Oxley Internet Law Electronic Signatures Digital Law Data Security Cyberlaw Open Source SaaS Cloud Computing Big Data GLBA Mobile Applications Computer Law See 35+     See less Education New York University School of Law LL.M.,  Corporation Law 1995  – 1996 Courses included: Securities Regulation, Developing Issues in Securities Regulation, Advanced Analysis of Accounting Information, Income Taxation, Corporate Taxation, Corporate Finance: Legal Aspects, Accounting for Lawyers, Corporations, Close Corporations Activities and Societies:  Fulbright Scholar ESCP Europe MBA,  International Business Administration 1992  – 1994 Courses included: U.S. Investments Regulation, Foreign Investments Regulation, Corporate Accounting, International Taxation, French Accounting, Basic Accounting, Marketing, French Taxation, Financial Analysis, Corporate Management and Internal Organization, Corporate Finance, and Mergers & Acquisitions American University of Paris PhD,  International Trade Law 1991  – 1992 Courses included: U.S. Civil Procedure, U.S. Corporate Law, U.S. Property Law, U.S. Agency Law, U.S. Contract Law, International Contracts, International Sales of Goods (CISG), International Business Transactions, U.S. Antitrust, Incoterms, International Transport Law, Export Finance, Letter of Credit, International Joint Ventures, Notes, Guarantees and Secured Transactions Law, Promissory Notes, International Dispute Resolution, Arbitration, International Finance, International Loan Transactions, Export Licensing, International Franchise Law, Franchising in Europe, Income Taxation, International Taxation, Import and Export Law, Countervailing and Anti-Dumping Duties, Escape Clause Proceedings, U.S. Trade Laws, International Transfers of Personnel, International Patent, Trademark and Copyright Law, and U.S. Partnership Law Université Panthéon Sorbonne (Paris I) PhD (DEA),  English & North-American Business Law 1991  – 1992 Courses included: Contracts under U.S. Law, U.S. Civil Procedure, U.S. Tort Law, U.S. Evidence, U.S. Agency Law, U.S Constitutional Law, Commercial Paper under U.S. Law, U.S. Corporations, U.S. Securities Regulation, English Company Law, Contracts under English Law, and Securities Regulation in the UK Université Paris X Nanterre PhD (DESS),  International Business Law 1991  – 1992 Courses included: E.U. Competition Law, Joint Ventures and other inter-company agreements, Mergers & Acquisitions, International Taxation, Introduction to English and North American Business Law, International Trade Law, International Investments, International Sales of Goods, Distribution Agreements, International Transport Contracts, Intellectual Property, technology transfers, International Arbitration, Securities Regulation, International Financings, Project Finance, International Payments and Secured Transactions Université Paris X Nanterre LL.M. (Maitrise),  Business Law 1990  – 1991 Université Paris X Nanterre JD (Licence),  Law 1987  – 1990 Sciences Po 1985  – 1987 Ecole Active Bilingue 1973  – 1984 Bilingual French/English elementary, middle school and high school education New York University School of Law LL.M.,  Corporation Law 1995  – 1996 Courses included: Securities Regulation, Developing Issues in Securities Regulation, Advanced Analysis of Accounting Information, Income Taxation, Corporate Taxation, Corporate Finance: Legal Aspects, Accounting for Lawyers, Corporations, Close Corporations Activities and Societies:  Fulbright Scholar New York University School of Law LL.M.,  Corporation Law 1995  – 1996 Courses included: Securities Regulation, Developing Issues in Securities Regulation, Advanced Analysis of Accounting Information, Income Taxation, Corporate Taxation, Corporate Finance: Legal Aspects, Accounting for Lawyers, Corporations, Close Corporations Activities and Societies:  Fulbright Scholar New York University School of Law LL.M.,  Corporation Law 1995  – 1996 Courses included: Securities Regulation, Developing Issues in Securities Regulation, Advanced Analysis of Accounting Information, Income Taxation, Corporate Taxation, Corporate Finance: Legal Aspects, Accounting for Lawyers, Corporations, Close Corporations Activities and Societies:  Fulbright Scholar ESCP Europe MBA,  International Business Administration 1992  – 1994 Courses included: U.S. Investments Regulation, Foreign Investments Regulation, Corporate Accounting, International Taxation, French Accounting, Basic Accounting, Marketing, French Taxation, Financial Analysis, Corporate Management and Internal Organization, Corporate Finance, and Mergers & Acquisitions ESCP Europe MBA,  International Business Administration 1992  – 1994 Courses included: U.S. Investments Regulation, Foreign Investments Regulation, Corporate Accounting, International Taxation, French Accounting, Basic Accounting, Marketing, French Taxation, Financial Analysis, Corporate Management and Internal Organization, Corporate Finance, and Mergers & Acquisitions ESCP Europe MBA,  International Business Administration 1992  – 1994 Courses included: U.S. Investments Regulation, Foreign Investments Regulation, Corporate Accounting, International Taxation, French Accounting, Basic Accounting, Marketing, French Taxation, Financial Analysis, Corporate Management and Internal Organization, Corporate Finance, and Mergers & Acquisitions American University of Paris PhD,  International Trade Law 1991  – 1992 Courses included: U.S. Civil Procedure, U.S. Corporate Law, U.S. Property Law, U.S. Agency Law, U.S. Contract Law, International Contracts, International Sales of Goods (CISG), International Business Transactions, U.S. Antitrust, Incoterms, International Transport Law, Export Finance, Letter of Credit, International Joint Ventures, Notes, Guarantees and Secured Transactions Law, Promissory Notes, International Dispute Resolution, Arbitration, International Finance, International Loan Transactions, Export Licensing, International Franchise Law, Franchising in Europe, Income Taxation, International Taxation, Import and Export Law, Countervailing and Anti-Dumping Duties, Escape Clause Proceedings, U.S. Trade Laws, International Transfers of Personnel, International Patent, Trademark and Copyright Law, and U.S. Partnership Law American University of Paris PhD,  International Trade Law 1991  – 1992 Courses included: U.S. Civil Procedure, U.S. Corporate Law, U.S. Property Law, U.S. Agency Law, U.S. Contract Law, International Contracts, International Sales of Goods (CISG), International Business Transactions, U.S. Antitrust, Incoterms, International Transport Law, Export Finance, Letter of Credit, International Joint Ventures, Notes, Guarantees and Secured Transactions Law, Promissory Notes, International Dispute Resolution, Arbitration, International Finance, International Loan Transactions, Export Licensing, International Franchise Law, Franchising in Europe, Income Taxation, International Taxation, Import and Export Law, Countervailing and Anti-Dumping Duties, Escape Clause Proceedings, U.S. Trade Laws, International Transfers of Personnel, International Patent, Trademark and Copyright Law, and U.S. Partnership Law American University of Paris PhD,  International Trade Law 1991  – 1992 Courses included: U.S. Civil Procedure, U.S. Corporate Law, U.S. Property Law, U.S. Agency Law, U.S. Contract Law, International Contracts, International Sales of Goods (CISG), International Business Transactions, U.S. Antitrust, Incoterms, International Transport Law, Export Finance, Letter of Credit, International Joint Ventures, Notes, Guarantees and Secured Transactions Law, Promissory Notes, International Dispute Resolution, Arbitration, International Finance, International Loan Transactions, Export Licensing, International Franchise Law, Franchising in Europe, Income Taxation, International Taxation, Import and Export Law, Countervailing and Anti-Dumping Duties, Escape Clause Proceedings, U.S. Trade Laws, International Transfers of Personnel, International Patent, Trademark and Copyright Law, and U.S. Partnership Law Université Panthéon Sorbonne (Paris I) PhD (DEA),  English & North-American Business Law 1991  – 1992 Courses included: Contracts under U.S. Law, U.S. Civil Procedure, U.S. Tort Law, U.S. Evidence, U.S. Agency Law, U.S Constitutional Law, Commercial Paper under U.S. Law, U.S. Corporations, U.S. Securities Regulation, English Company Law, Contracts under English Law, and Securities Regulation in the UK Université Panthéon Sorbonne (Paris I) PhD (DEA),  English & North-American Business Law 1991  – 1992 Courses included: Contracts under U.S. Law, U.S. Civil Procedure, U.S. Tort Law, U.S. Evidence, U.S. Agency Law, U.S Constitutional Law, Commercial Paper under U.S. Law, U.S. Corporations, U.S. Securities Regulation, English Company Law, Contracts under English Law, and Securities Regulation in the UK Université Panthéon Sorbonne (Paris I) PhD (DEA),  English & North-American Business Law 1991  – 1992 Courses included: Contracts under U.S. Law, U.S. Civil Procedure, U.S. Tort Law, U.S. Evidence, U.S. Agency Law, U.S Constitutional Law, Commercial Paper under U.S. Law, U.S. Corporations, U.S. Securities Regulation, English Company Law, Contracts under English Law, and Securities Regulation in the UK Université Paris X Nanterre PhD (DESS),  International Business Law 1991  – 1992 Courses included: E.U. Competition Law, Joint Ventures and other inter-company agreements, Mergers & Acquisitions, International Taxation, Introduction to English and North American Business Law, International Trade Law, International Investments, International Sales of Goods, Distribution Agreements, International Transport Contracts, Intellectual Property, technology transfers, International Arbitration, Securities Regulation, International Financings, Project Finance, International Payments and Secured Transactions Université Paris X Nanterre PhD (DESS),  International Business Law 1991  – 1992 Courses included: E.U. Competition Law, Joint Ventures and other inter-company agreements, Mergers & Acquisitions, International Taxation, Introduction to English and North American Business Law, International Trade Law, International Investments, International Sales of Goods, Distribution Agreements, International Transport Contracts, Intellectual Property, technology transfers, International Arbitration, Securities Regulation, International Financings, Project Finance, International Payments and Secured Transactions Université Paris X Nanterre PhD (DESS),  International Business Law 1991  – 1992 Courses included: E.U. Competition Law, Joint Ventures and other inter-company agreements, Mergers & Acquisitions, International Taxation, Introduction to English and North American Business Law, International Trade Law, International Investments, International Sales of Goods, Distribution Agreements, International Transport Contracts, Intellectual Property, technology transfers, International Arbitration, Securities Regulation, International Financings, Project Finance, International Payments and Secured Transactions Université Paris X Nanterre LL.M. (Maitrise),  Business Law 1990  – 1991 Université Paris X Nanterre LL.M. (Maitrise),  Business Law 1990  – 1991 Université Paris X Nanterre LL.M. (Maitrise),  Business Law 1990  – 1991 Université Paris X Nanterre JD (Licence),  Law 1987  – 1990 Université Paris X Nanterre JD (Licence),  Law 1987  – 1990 Université Paris X Nanterre JD (Licence),  Law 1987  – 1990 Sciences Po 1985  – 1987 Sciences Po 1985  – 1987 Sciences Po 1985  – 1987 Ecole Active Bilingue 1973  – 1984 Bilingual French/English elementary, middle school and high school education Ecole Active Bilingue 1973  – 1984 Bilingual French/English elementary, middle school and high school education Ecole Active Bilingue 1973  – 1984 Bilingual French/English elementary, middle school and high school education Honors & Awards Additional Honors & Awards Fulbright Scholarship (1995) Additional Honors & Awards Fulbright Scholarship (1995) Additional Honors & Awards Fulbright Scholarship (1995) Additional Honors & Awards Fulbright Scholarship (1995) ", "Experience Senior Attorney Intel Corporation August 2000  – Present (15 years 1 month) Associate Holland & Hart LLP 1998  –  2000  (2 years) Associate Holme Roberts & Owen LLP January 1996  –  July 1998  (2 years 7 months) Clerk to Justice Leonard H. Russon Utah Supreme Court September 1996  –  August 1997  (1 year) Senior Attorney Intel Corporation August 2000  – Present (15 years 1 month) Senior Attorney Intel Corporation August 2000  – Present (15 years 1 month) Associate Holland & Hart LLP 1998  –  2000  (2 years) Associate Holland & Hart LLP 1998  –  2000  (2 years) Associate Holme Roberts & Owen LLP January 1996  –  July 1998  (2 years 7 months) Associate Holme Roberts & Owen LLP January 1996  –  July 1998  (2 years 7 months) Clerk to Justice Leonard H. Russon Utah Supreme Court September 1996  –  August 1997  (1 year) Clerk to Justice Leonard H. Russon Utah Supreme Court September 1996  –  August 1997  (1 year) Skills Antitrust Law Antitrust Counseling Competition Law Business Counsel Corporate Law Corporate Governance Contract Negotiation Marketing Law Intellectual Property Licensing Software Licensing Privacy Law Legal Writing Contract Law Legal M&A experience Trademarks Copyright Law See 3+     See less Skills  Antitrust Law Antitrust Counseling Competition Law Business Counsel Corporate Law Corporate Governance Contract Negotiation Marketing Law Intellectual Property Licensing Software Licensing Privacy Law Legal Writing Contract Law Legal M&A experience Trademarks Copyright Law See 3+     See less Antitrust Law Antitrust Counseling Competition Law Business Counsel Corporate Law Corporate Governance Contract Negotiation Marketing Law Intellectual Property Licensing Software Licensing Privacy Law Legal Writing Contract Law Legal M&A experience Trademarks Copyright Law See 3+     See less Antitrust Law Antitrust Counseling Competition Law Business Counsel Corporate Law Corporate Governance Contract Negotiation Marketing Law Intellectual Property Licensing Software Licensing Privacy Law Legal Writing Contract Law Legal M&A experience Trademarks Copyright Law See 3+     See less Education University of Michigan Law School J.D.,  Law 1993  – 1995 Cum Laude Brigham Young University B.A.,  Classical Studies 1988  – 1993 University of Michigan Law School J.D.,  Law 1993  – 1995 Cum Laude University of Michigan Law School J.D.,  Law 1993  – 1995 Cum Laude University of Michigan Law School J.D.,  Law 1993  – 1995 Cum Laude Brigham Young University B.A.,  Classical Studies 1988  – 1993 Brigham Young University B.A.,  Classical Studies 1988  – 1993 Brigham Young University B.A.,  Classical Studies 1988  – 1993 ", "Summary Seasoned legal, transactional, privacy/security, compliance, and business development experience in several industries including healthcare, technology, telecommunications, and energy. Drafted, negotiated, and managed transactions with several Fortune 500 companies that involved complex international issues involving data protection, intellectual property, and software licensing, Labored three years as a legal team leader/mgr in the EU to hire and develop a business unit legal support team (grew the team from 0 to 8 attorneys) covering the EU/EEA, Middle East, Africa and Russia. Ten years of post-high school education, graduating with Masters of Business Administration from the University of Oxford, Juris Doctorate from the University of Utah, and double BAs from Brigham Young University (all in top 20% of graduating class). \n \nSpecialties: transactions; privacy/security; intellectual property; international; regulatory compliance (including FDA, HIPAA, PPACA, GINA, FCC, FERC, and other country/state equivalents); fraud and abuse; M/A; licensing; government contracts and procurement; specialized industry focus in healthcare, technology, telecommunications, and energy Summary Seasoned legal, transactional, privacy/security, compliance, and business development experience in several industries including healthcare, technology, telecommunications, and energy. Drafted, negotiated, and managed transactions with several Fortune 500 companies that involved complex international issues involving data protection, intellectual property, and software licensing, Labored three years as a legal team leader/mgr in the EU to hire and develop a business unit legal support team (grew the team from 0 to 8 attorneys) covering the EU/EEA, Middle East, Africa and Russia. Ten years of post-high school education, graduating with Masters of Business Administration from the University of Oxford, Juris Doctorate from the University of Utah, and double BAs from Brigham Young University (all in top 20% of graduating class). \n \nSpecialties: transactions; privacy/security; intellectual property; international; regulatory compliance (including FDA, HIPAA, PPACA, GINA, FCC, FERC, and other country/state equivalents); fraud and abuse; M/A; licensing; government contracts and procurement; specialized industry focus in healthcare, technology, telecommunications, and energy Seasoned legal, transactional, privacy/security, compliance, and business development experience in several industries including healthcare, technology, telecommunications, and energy. Drafted, negotiated, and managed transactions with several Fortune 500 companies that involved complex international issues involving data protection, intellectual property, and software licensing, Labored three years as a legal team leader/mgr in the EU to hire and develop a business unit legal support team (grew the team from 0 to 8 attorneys) covering the EU/EEA, Middle East, Africa and Russia. Ten years of post-high school education, graduating with Masters of Business Administration from the University of Oxford, Juris Doctorate from the University of Utah, and double BAs from Brigham Young University (all in top 20% of graduating class). \n \nSpecialties: transactions; privacy/security; intellectual property; international; regulatory compliance (including FDA, HIPAA, PPACA, GINA, FCC, FERC, and other country/state equivalents); fraud and abuse; M/A; licensing; government contracts and procurement; specialized industry focus in healthcare, technology, telecommunications, and energy Seasoned legal, transactional, privacy/security, compliance, and business development experience in several industries including healthcare, technology, telecommunications, and energy. Drafted, negotiated, and managed transactions with several Fortune 500 companies that involved complex international issues involving data protection, intellectual property, and software licensing, Labored three years as a legal team leader/mgr in the EU to hire and develop a business unit legal support team (grew the team from 0 to 8 attorneys) covering the EU/EEA, Middle East, Africa and Russia. Ten years of post-high school education, graduating with Masters of Business Administration from the University of Oxford, Juris Doctorate from the University of Utah, and double BAs from Brigham Young University (all in top 20% of graduating class). \n \nSpecialties: transactions; privacy/security; intellectual property; international; regulatory compliance (including FDA, HIPAA, PPACA, GINA, FCC, FERC, and other country/state equivalents); fraud and abuse; M/A; licensing; government contracts and procurement; specialized industry focus in healthcare, technology, telecommunications, and energy Experience Global Group Counsel for IT, Privacy & Security Intel Corporation May 2014  – Present (1 year 4 months) Privacy and Security Legal Intel Corporation May 2012  –  May 2014  (2 years 1 month) Provides legal support for all global privacy and security matters at Intel, including data breach response, data loss prevention, data collection and usage, online and offline marketing, digital media, ecommerce and social media, privacy by design, privacy policy/notice development, M/A and acquisition support, and global law and regulation tracking. Assistant General Counsel and Privacy Officer NantWorks/NantHealth June 2010  –  May 2012  (2 years) Greater Los Angeles Area Managed legal and privacy affairs of healthcare IT start up focused on health transformation including regulatory compliance, transactions, technology, software licensing, and intellectual property. Acting General Counsel and Corporate Secretary National Coalition for Health Integration (501c3 non-profit) July 2010  –  November 2011  (1 year 5 months) Los Angeles, California Appointed as general counsel and corporate secretary of NCHI which was organized in 2005 as a non-profit coalition dedicated to integrate health data in order to promote healthcare cost and availability transformation. Board of Directors WaveConnex July 2010  –  October 2011  (1 year 4 months) UCLA Served on Board of Directors for Waveconnex, a cutting-edge wireless chip technology company incubated at UCLA. Professorship BYU-Idaho June 2011  –  September 2011  (4 months) Rexburg, Idaho Labor as an online instructor/professor teaching business/legal cou/international courses for BYU-Idaho. Digital Health Group Counsel and Senior Attorney Intel Corporation November 2005  –  June 2010  (4 years 8 months) Hillsboro, Oregon From 2005-2010 provided legal/compliance/privacy support to Intel Digital Health Group (dedicated to creating and manufacturing regulated devices and services in the healthcare space). Responsibilities included transactions, privacy, security, regulatory compliance (e.g. HIPAA, FDA and other country equivalents), intellectual property, fraud and abuse, and technology/strategy. \nFrom 2003-2005 appointed to live in the EU (UK-based) and create a team of EMEA attorneys and biz dev support for new intellectual property and transactional work on the business unit level in EMEA (EU, Africa, Russia, Middle East). \nFrom 2000-2003, labored as counsel for Intel Capital (ICAP) and its New Business Group (NBI) dedicated to incubating and investing in small businesses for the benefit of Intel. Acting General Counsel and Corporate Secretary Dossia Consortium January 2006  –  September 2009  (3 years 9 months) http://www.dossia.org/ While at Intel, worked with then Intel Chairman, Dr. Craig Barrett, to develop the Dossia Personal Health Record (PHR) system. Grew the organization to three separate entities: Dossia Service Corporation (for profit), Dossia Foundation (501c6), and Dossia Consortium (501c3), and added Dossia Fortune 500 members including Wal-Mart, AT&T, Pitney-Bowes, sanofi-aventis, and Cardinal Health. Senior Counsel The Williams Companies January 1996  –  February 2000  (4 years 2 months) Greater Salt Lake City Area As primary attorney for the western US, I provided legal support for Williams' telecommunications, fiber optics, and energy efforts. Acting General Counsel and Corporate Secretary FTV Communications, LLC January 1998  –  January 2000  (2 years 1 month) Greater Salt Lake City Area While at Williams, I was appointed acting general counsel and corporate secretary for a $190M fiber optics joint venture with two other Fortune 500 companies. Duties included transactions, construction agreements and IRUs, regulatory compliance, secretarial and organizational duties at the board level (e.g. creation/amendment of LLC bylaws, minutes). Federal Externship Federal District Court, District of Utah January 1995  –  December 1995  (1 year) Greater Salt Lake City Area Drafted judicial opinions. Global Group Counsel for IT, Privacy & Security Intel Corporation May 2014  – Present (1 year 4 months) Global Group Counsel for IT, Privacy & Security Intel Corporation May 2014  – Present (1 year 4 months) Privacy and Security Legal Intel Corporation May 2012  –  May 2014  (2 years 1 month) Provides legal support for all global privacy and security matters at Intel, including data breach response, data loss prevention, data collection and usage, online and offline marketing, digital media, ecommerce and social media, privacy by design, privacy policy/notice development, M/A and acquisition support, and global law and regulation tracking. Privacy and Security Legal Intel Corporation May 2012  –  May 2014  (2 years 1 month) Provides legal support for all global privacy and security matters at Intel, including data breach response, data loss prevention, data collection and usage, online and offline marketing, digital media, ecommerce and social media, privacy by design, privacy policy/notice development, M/A and acquisition support, and global law and regulation tracking. Assistant General Counsel and Privacy Officer NantWorks/NantHealth June 2010  –  May 2012  (2 years) Greater Los Angeles Area Managed legal and privacy affairs of healthcare IT start up focused on health transformation including regulatory compliance, transactions, technology, software licensing, and intellectual property. Assistant General Counsel and Privacy Officer NantWorks/NantHealth June 2010  –  May 2012  (2 years) Greater Los Angeles Area Managed legal and privacy affairs of healthcare IT start up focused on health transformation including regulatory compliance, transactions, technology, software licensing, and intellectual property. Acting General Counsel and Corporate Secretary National Coalition for Health Integration (501c3 non-profit) July 2010  –  November 2011  (1 year 5 months) Los Angeles, California Appointed as general counsel and corporate secretary of NCHI which was organized in 2005 as a non-profit coalition dedicated to integrate health data in order to promote healthcare cost and availability transformation. Acting General Counsel and Corporate Secretary National Coalition for Health Integration (501c3 non-profit) July 2010  –  November 2011  (1 year 5 months) Los Angeles, California Appointed as general counsel and corporate secretary of NCHI which was organized in 2005 as a non-profit coalition dedicated to integrate health data in order to promote healthcare cost and availability transformation. Board of Directors WaveConnex July 2010  –  October 2011  (1 year 4 months) UCLA Served on Board of Directors for Waveconnex, a cutting-edge wireless chip technology company incubated at UCLA. Board of Directors WaveConnex July 2010  –  October 2011  (1 year 4 months) UCLA Served on Board of Directors for Waveconnex, a cutting-edge wireless chip technology company incubated at UCLA. Professorship BYU-Idaho June 2011  –  September 2011  (4 months) Rexburg, Idaho Labor as an online instructor/professor teaching business/legal cou/international courses for BYU-Idaho. Professorship BYU-Idaho June 2011  –  September 2011  (4 months) Rexburg, Idaho Labor as an online instructor/professor teaching business/legal cou/international courses for BYU-Idaho. Digital Health Group Counsel and Senior Attorney Intel Corporation November 2005  –  June 2010  (4 years 8 months) Hillsboro, Oregon From 2005-2010 provided legal/compliance/privacy support to Intel Digital Health Group (dedicated to creating and manufacturing regulated devices and services in the healthcare space). Responsibilities included transactions, privacy, security, regulatory compliance (e.g. HIPAA, FDA and other country equivalents), intellectual property, fraud and abuse, and technology/strategy. \nFrom 2003-2005 appointed to live in the EU (UK-based) and create a team of EMEA attorneys and biz dev support for new intellectual property and transactional work on the business unit level in EMEA (EU, Africa, Russia, Middle East). \nFrom 2000-2003, labored as counsel for Intel Capital (ICAP) and its New Business Group (NBI) dedicated to incubating and investing in small businesses for the benefit of Intel. Digital Health Group Counsel and Senior Attorney Intel Corporation November 2005  –  June 2010  (4 years 8 months) Hillsboro, Oregon From 2005-2010 provided legal/compliance/privacy support to Intel Digital Health Group (dedicated to creating and manufacturing regulated devices and services in the healthcare space). Responsibilities included transactions, privacy, security, regulatory compliance (e.g. HIPAA, FDA and other country equivalents), intellectual property, fraud and abuse, and technology/strategy. \nFrom 2003-2005 appointed to live in the EU (UK-based) and create a team of EMEA attorneys and biz dev support for new intellectual property and transactional work on the business unit level in EMEA (EU, Africa, Russia, Middle East). \nFrom 2000-2003, labored as counsel for Intel Capital (ICAP) and its New Business Group (NBI) dedicated to incubating and investing in small businesses for the benefit of Intel. Acting General Counsel and Corporate Secretary Dossia Consortium January 2006  –  September 2009  (3 years 9 months) http://www.dossia.org/ While at Intel, worked with then Intel Chairman, Dr. Craig Barrett, to develop the Dossia Personal Health Record (PHR) system. Grew the organization to three separate entities: Dossia Service Corporation (for profit), Dossia Foundation (501c6), and Dossia Consortium (501c3), and added Dossia Fortune 500 members including Wal-Mart, AT&T, Pitney-Bowes, sanofi-aventis, and Cardinal Health. Acting General Counsel and Corporate Secretary Dossia Consortium January 2006  –  September 2009  (3 years 9 months) http://www.dossia.org/ While at Intel, worked with then Intel Chairman, Dr. Craig Barrett, to develop the Dossia Personal Health Record (PHR) system. Grew the organization to three separate entities: Dossia Service Corporation (for profit), Dossia Foundation (501c6), and Dossia Consortium (501c3), and added Dossia Fortune 500 members including Wal-Mart, AT&T, Pitney-Bowes, sanofi-aventis, and Cardinal Health. Senior Counsel The Williams Companies January 1996  –  February 2000  (4 years 2 months) Greater Salt Lake City Area As primary attorney for the western US, I provided legal support for Williams' telecommunications, fiber optics, and energy efforts. Senior Counsel The Williams Companies January 1996  –  February 2000  (4 years 2 months) Greater Salt Lake City Area As primary attorney for the western US, I provided legal support for Williams' telecommunications, fiber optics, and energy efforts. Acting General Counsel and Corporate Secretary FTV Communications, LLC January 1998  –  January 2000  (2 years 1 month) Greater Salt Lake City Area While at Williams, I was appointed acting general counsel and corporate secretary for a $190M fiber optics joint venture with two other Fortune 500 companies. Duties included transactions, construction agreements and IRUs, regulatory compliance, secretarial and organizational duties at the board level (e.g. creation/amendment of LLC bylaws, minutes). Acting General Counsel and Corporate Secretary FTV Communications, LLC January 1998  –  January 2000  (2 years 1 month) Greater Salt Lake City Area While at Williams, I was appointed acting general counsel and corporate secretary for a $190M fiber optics joint venture with two other Fortune 500 companies. Duties included transactions, construction agreements and IRUs, regulatory compliance, secretarial and organizational duties at the board level (e.g. creation/amendment of LLC bylaws, minutes). Federal Externship Federal District Court, District of Utah January 1995  –  December 1995  (1 year) Greater Salt Lake City Area Drafted judicial opinions. Federal Externship Federal District Court, District of Utah January 1995  –  December 1995  (1 year) Greater Salt Lake City Area Drafted judicial opinions. Languages Italian Italian Italian Skills Non-profits Healthcare IT Data Privacy Intellectual Property Telecommunications HIPAA Compliance Licensing Healthcare Privacy Software Licensing Contract Negotiation Corporate Governance Government Relations Negotiation Corporate Law International Law Healthcare Information... Privacy Law Start-ups Business Strategy Strategy Mergers & Acquisitions Joint Ventures Patents Nonprofits Business Development Trademarks Due Diligence Patent Prosecution Strategic Planning Strategic Partnerships Management Venture Capital Copyright Law Trade Secrets Leadership E-commerce Patent Litigation Commercial Litigation Legal Compliance Policy Outsourcing Litigation Employment Law Competition Law Cyberlaw Legal Writing Litigation Management Legal Research See 35+     See less Skills  Non-profits Healthcare IT Data Privacy Intellectual Property Telecommunications HIPAA Compliance Licensing Healthcare Privacy Software Licensing Contract Negotiation Corporate Governance Government Relations Negotiation Corporate Law International Law Healthcare Information... Privacy Law Start-ups Business Strategy Strategy Mergers & Acquisitions Joint Ventures Patents Nonprofits Business Development Trademarks Due Diligence Patent Prosecution Strategic Planning Strategic Partnerships Management Venture Capital Copyright Law Trade Secrets Leadership E-commerce Patent Litigation Commercial Litigation Legal Compliance Policy Outsourcing Litigation Employment Law Competition Law Cyberlaw Legal Writing Litigation Management Legal Research See 35+     See less Non-profits Healthcare IT Data Privacy Intellectual Property Telecommunications HIPAA Compliance Licensing Healthcare Privacy Software Licensing Contract Negotiation Corporate Governance Government Relations Negotiation Corporate Law International Law Healthcare Information... Privacy Law Start-ups Business Strategy Strategy Mergers & Acquisitions Joint Ventures Patents Nonprofits Business Development Trademarks Due Diligence Patent Prosecution Strategic Planning Strategic Partnerships Management Venture Capital Copyright Law Trade Secrets Leadership E-commerce Patent Litigation Commercial Litigation Legal Compliance Policy Outsourcing Litigation Employment Law Competition Law Cyberlaw Legal Writing Litigation Management Legal Research See 35+     See less Non-profits Healthcare IT Data Privacy Intellectual Property Telecommunications HIPAA Compliance Licensing Healthcare Privacy Software Licensing Contract Negotiation Corporate Governance Government Relations Negotiation Corporate Law International Law Healthcare Information... Privacy Law Start-ups Business Strategy Strategy Mergers & Acquisitions Joint Ventures Patents Nonprofits Business Development Trademarks Due Diligence Patent Prosecution Strategic Planning Strategic Partnerships Management Venture Capital Copyright Law Trade Secrets Leadership E-commerce Patent Litigation Commercial Litigation Legal Compliance Policy Outsourcing Litigation Employment Law Competition Law Cyberlaw Legal Writing Litigation Management Legal Research See 35+     See less Education University of Oxford MBA,  Business 2005  – 2006 Oxford was and is an unparalleled cultural and networking experience. Some of my closest friends today are drawn from the pool of classmates from my MBA class. Activities and Societies:  Member of New College (est 1379 A.D.) University of Utah S.J. Quinney College of Law Juris Doctorate,  Law 1992  – 1995 Top 20% (Leary Scholar) Activities and Societies:  Top 20%\nWilliam H. Leary Scholar Brigham Young University Double BA,  International Relations and Italian 1988  – 1991 Double bachelors degrees \nInvolvement Office - BYUSA student government Activities and Societies:  BYUSA (Student Government) -- Involvement Office\nItalian ACTFL Fluency Rating - Superior University of Oxford MBA,  Business 2005  – 2006 Oxford was and is an unparalleled cultural and networking experience. Some of my closest friends today are drawn from the pool of classmates from my MBA class. Activities and Societies:  Member of New College (est 1379 A.D.) University of Oxford MBA,  Business 2005  – 2006 Oxford was and is an unparalleled cultural and networking experience. Some of my closest friends today are drawn from the pool of classmates from my MBA class. Activities and Societies:  Member of New College (est 1379 A.D.) University of Oxford MBA,  Business 2005  – 2006 Oxford was and is an unparalleled cultural and networking experience. Some of my closest friends today are drawn from the pool of classmates from my MBA class. Activities and Societies:  Member of New College (est 1379 A.D.) University of Utah S.J. Quinney College of Law Juris Doctorate,  Law 1992  – 1995 Top 20% (Leary Scholar) Activities and Societies:  Top 20%\nWilliam H. Leary Scholar University of Utah S.J. Quinney College of Law Juris Doctorate,  Law 1992  – 1995 Top 20% (Leary Scholar) Activities and Societies:  Top 20%\nWilliam H. Leary Scholar University of Utah S.J. Quinney College of Law Juris Doctorate,  Law 1992  – 1995 Top 20% (Leary Scholar) Activities and Societies:  Top 20%\nWilliam H. Leary Scholar Brigham Young University Double BA,  International Relations and Italian 1988  – 1991 Double bachelors degrees \nInvolvement Office - BYUSA student government Activities and Societies:  BYUSA (Student Government) -- Involvement Office\nItalian ACTFL Fluency Rating - Superior Brigham Young University Double BA,  International Relations and Italian 1988  – 1991 Double bachelors degrees \nInvolvement Office - BYUSA student government Activities and Societies:  BYUSA (Student Government) -- Involvement Office\nItalian ACTFL Fluency Rating - Superior Brigham Young University Double BA,  International Relations and Italian 1988  – 1991 Double bachelors degrees \nInvolvement Office - BYUSA student government Activities and Societies:  BYUSA (Student Government) -- Involvement Office\nItalian ACTFL Fluency Rating - Superior Honors & Awards Additional Honors & Awards Multiple awards from each employer and academic institution, Eagle Scout Additional Honors & Awards Multiple awards from each employer and academic institution, Eagle Scout Additional Honors & Awards Multiple awards from each employer and academic institution, Eagle Scout Additional Honors & Awards Multiple awards from each employer and academic institution, Eagle Scout ", "Experience Senior Attorney Intel Corporation January 2012  – Present (3 years 8 months) Acting in the role of general counsel providing legal supporting to a sales management organization focused sales of Intel product to global embedded customers; supporting the corporations sales enablement organization comprising online/digital sales, creating and developming demand generation technologies; and supporting the corporate sales account team for a leading customer selling hardware and software systems. Business Unit Attorney Intel March 2006  –  July 2010  (4 years 5 months) Acting as general counsel for a $500M revenue Intel business manufacturing and selling NAND flash memory based solution products worldwide providing legal advice and counsel on all aspects of the business, including marketing collateral approval, support of business development, and technology licensing activities. Associate Attorney Klein DeNatale Goldner June 2004  –  November 2004  (6 months) Advised business clients on legal matters including real estate transactions, copyright registration procedures, tax matters and civil litigation; researched and drafted legal memos on international law, federal taxation, and civil law; drafted and revised various corporate agreements, trusts, and civil complaints. Senior Attorney Intel Corporation January 2012  – Present (3 years 8 months) Acting in the role of general counsel providing legal supporting to a sales management organization focused sales of Intel product to global embedded customers; supporting the corporations sales enablement organization comprising online/digital sales, creating and developming demand generation technologies; and supporting the corporate sales account team for a leading customer selling hardware and software systems. Senior Attorney Intel Corporation January 2012  – Present (3 years 8 months) Acting in the role of general counsel providing legal supporting to a sales management organization focused sales of Intel product to global embedded customers; supporting the corporations sales enablement organization comprising online/digital sales, creating and developming demand generation technologies; and supporting the corporate sales account team for a leading customer selling hardware and software systems. Business Unit Attorney Intel March 2006  –  July 2010  (4 years 5 months) Acting as general counsel for a $500M revenue Intel business manufacturing and selling NAND flash memory based solution products worldwide providing legal advice and counsel on all aspects of the business, including marketing collateral approval, support of business development, and technology licensing activities. Business Unit Attorney Intel March 2006  –  July 2010  (4 years 5 months) Acting as general counsel for a $500M revenue Intel business manufacturing and selling NAND flash memory based solution products worldwide providing legal advice and counsel on all aspects of the business, including marketing collateral approval, support of business development, and technology licensing activities. Associate Attorney Klein DeNatale Goldner June 2004  –  November 2004  (6 months) Advised business clients on legal matters including real estate transactions, copyright registration procedures, tax matters and civil litigation; researched and drafted legal memos on international law, federal taxation, and civil law; drafted and revised various corporate agreements, trusts, and civil complaints. Associate Attorney Klein DeNatale Goldner June 2004  –  November 2004  (6 months) Advised business clients on legal matters including real estate transactions, copyright registration procedures, tax matters and civil litigation; researched and drafted legal memos on international law, federal taxation, and civil law; drafted and revised various corporate agreements, trusts, and civil complaints. Languages German German German Skills Contract Negotiation Legal Compliance Privacy Law Online Privacy Antitrust Counseling Cross-border M&A Entertainment Law Joint Ventures Intellectual Property... Renegotiations Skills  Contract Negotiation Legal Compliance Privacy Law Online Privacy Antitrust Counseling Cross-border M&A Entertainment Law Joint Ventures Intellectual Property... Renegotiations Contract Negotiation Legal Compliance Privacy Law Online Privacy Antitrust Counseling Cross-border M&A Entertainment Law Joint Ventures Intellectual Property... Renegotiations Contract Negotiation Legal Compliance Privacy Law Online Privacy Antitrust Counseling Cross-border M&A Entertainment Law Joint Ventures Intellectual Property... Renegotiations Education Thunderbird School of Global Management Master of Business Administration (M.B.A.),  Global Finance 2002  – 2004 University of California, Los Angeles - School of Law Juris Doctorate,  Law 1995  – 1998 Thunderbird School of Global Management Master of Business Administration (M.B.A.),  Global Finance 2002  – 2004 Thunderbird School of Global Management Master of Business Administration (M.B.A.),  Global Finance 2002  – 2004 Thunderbird School of Global Management Master of Business Administration (M.B.A.),  Global Finance 2002  – 2004 University of California, Los Angeles - School of Law Juris Doctorate,  Law 1995  – 1998 University of California, Los Angeles - School of Law Juris Doctorate,  Law 1995  – 1998 University of California, Los Angeles - School of Law Juris Doctorate,  Law 1995  – 1998 ", "Skills Licensing Intellectual Property Patents Mergers & Acquisitions Trademarks Contract Negotiation Patent Prosecution Software Licensing Patent Litigation Joint Ventures Corporate Governance Trade Secrets Due Diligence Litigation Corporate Law Start-ups See 1+     See less Skills  Licensing Intellectual Property Patents Mergers & Acquisitions Trademarks Contract Negotiation Patent Prosecution Software Licensing Patent Litigation Joint Ventures Corporate Governance Trade Secrets Due Diligence Litigation Corporate Law Start-ups See 1+     See less Licensing Intellectual Property Patents Mergers & Acquisitions Trademarks Contract Negotiation Patent Prosecution Software Licensing Patent Litigation Joint Ventures Corporate Governance Trade Secrets Due Diligence Litigation Corporate Law Start-ups See 1+     See less Licensing Intellectual Property Patents Mergers & Acquisitions Trademarks Contract Negotiation Patent Prosecution Software Licensing Patent Litigation Joint Ventures Corporate Governance Trade Secrets Due Diligence Litigation Corporate Law Start-ups See 1+     See less ", "Summary Specialties:Software licensing (inbound and outbound), open source licensing, procurement, development, IP due diligence (M&A), channels, OEM, supply chain management Summary Specialties:Software licensing (inbound and outbound), open source licensing, procurement, development, IP due diligence (M&A), channels, OEM, supply chain management Specialties:Software licensing (inbound and outbound), open source licensing, procurement, development, IP due diligence (M&A), channels, OEM, supply chain management Specialties:Software licensing (inbound and outbound), open source licensing, procurement, development, IP due diligence (M&A), channels, OEM, supply chain management Experience Senior Attorney Intel Corporation December 2011  – Present (3 years 9 months) Santa Clara, CA Senior Corporate Counsel NetApp, Inc June 2009  –  December 2011  (2 years 7 months) * Supported NetApp's Channel Sales organization by successfully negotiating reseller, distributor, systems integrator and professional services subcontracting agreements with NetApp's channel partners.  \n \n* Counseled clients on creating supporting program documentation and customer facing literature detailing the benefits of NetApp's Partner Program. \n \n* Supported NetApp's Western Region Sales team by counseling clients on revenue recognition, intellectual property, software licensing and a variety of contract issues. \n \n* Negotiated sales, licensing, support, and professional services agreements. \n \n* Negotiated a design and development agreement with NetApp's largest manufacturing partner for a jointly developed storage appliance. \n \n* Managed two senior contract administrators, including performance management, team building, skills training and work product supervision. Senior Counsel Sun Microsystems, Inc September 2005  –  June 2009  (3 years 10 months) * Provided primary legal support to four hardware and software product R&D divisions, two testing and quality assurance groups and one supply chain management group for all day-to-day legal matters including inbound licensing, technology development, OEM transactions and engineering services. \n \n* Advised engineering clients on the use and integration of third party open source software in Sun products, the selection of open source licenses for outbound licensing of Sun products, and interactions with open source developer communities.  \n \n* Negotiated the outsourcing of manufacturing operations for Sun's tape, disk and library storage products to a large contract manufacturer who will produce more than $200 million of Sun's storage products each year. \n \n* Created and delivered training to engineering clients on open source software, treatment of confidential information and various legal processes that impact product development. \n \n* Negotiated an agreement to license the design of a next-generation networking ASIC, which is integral to Sun's High Performance Computing and Enterprise Computing strategy. \n \n* Negotiated a marketing and development agreement with an operating system supplier to port the supplier's open source, carrier grade operating system to Sun's networking and microprocessor products.  \n \n* Negotiated several detailed amendments to agreements with Sun's CAD vendors to allow for expanded use and sublicensing of the vendor software, as well as renewing existing licenses. \n \n* Act as primary IP counsel on M&A transactions performing due diligence, negotiating the definitive agreement and managing integration of the acquired company or technology. Consultant Opcentric 2004  –  2005  (1 year) Project Attorney Wyse Technology Inc May 2003  –  April 2004  (1 year) Provided legal support for software licensing, distribution, source code licensing and purchasing agreements. Negotiated several inbound licensing agreements and provided guidance to Sales on legal and revenue recognition issues. \n \nManaged real estate leasing issues, including the sublease of office space on company's main campus and the resolution of a dispute with a warehouse service. Corporate Counsel Aspect Communications Corporation December 1999  –  July 2002  (2 years 8 months) Law Clerk Melvin & Melvin 1997  –  1999  (2 years) Senior Attorney Intel Corporation December 2011  – Present (3 years 9 months) Santa Clara, CA Senior Attorney Intel Corporation December 2011  – Present (3 years 9 months) Santa Clara, CA Senior Corporate Counsel NetApp, Inc June 2009  –  December 2011  (2 years 7 months) * Supported NetApp's Channel Sales organization by successfully negotiating reseller, distributor, systems integrator and professional services subcontracting agreements with NetApp's channel partners.  \n \n* Counseled clients on creating supporting program documentation and customer facing literature detailing the benefits of NetApp's Partner Program. \n \n* Supported NetApp's Western Region Sales team by counseling clients on revenue recognition, intellectual property, software licensing and a variety of contract issues. \n \n* Negotiated sales, licensing, support, and professional services agreements. \n \n* Negotiated a design and development agreement with NetApp's largest manufacturing partner for a jointly developed storage appliance. \n \n* Managed two senior contract administrators, including performance management, team building, skills training and work product supervision. Senior Corporate Counsel NetApp, Inc June 2009  –  December 2011  (2 years 7 months) * Supported NetApp's Channel Sales organization by successfully negotiating reseller, distributor, systems integrator and professional services subcontracting agreements with NetApp's channel partners.  \n \n* Counseled clients on creating supporting program documentation and customer facing literature detailing the benefits of NetApp's Partner Program. \n \n* Supported NetApp's Western Region Sales team by counseling clients on revenue recognition, intellectual property, software licensing and a variety of contract issues. \n \n* Negotiated sales, licensing, support, and professional services agreements. \n \n* Negotiated a design and development agreement with NetApp's largest manufacturing partner for a jointly developed storage appliance. \n \n* Managed two senior contract administrators, including performance management, team building, skills training and work product supervision. Senior Counsel Sun Microsystems, Inc September 2005  –  June 2009  (3 years 10 months) * Provided primary legal support to four hardware and software product R&D divisions, two testing and quality assurance groups and one supply chain management group for all day-to-day legal matters including inbound licensing, technology development, OEM transactions and engineering services. \n \n* Advised engineering clients on the use and integration of third party open source software in Sun products, the selection of open source licenses for outbound licensing of Sun products, and interactions with open source developer communities.  \n \n* Negotiated the outsourcing of manufacturing operations for Sun's tape, disk and library storage products to a large contract manufacturer who will produce more than $200 million of Sun's storage products each year. \n \n* Created and delivered training to engineering clients on open source software, treatment of confidential information and various legal processes that impact product development. \n \n* Negotiated an agreement to license the design of a next-generation networking ASIC, which is integral to Sun's High Performance Computing and Enterprise Computing strategy. \n \n* Negotiated a marketing and development agreement with an operating system supplier to port the supplier's open source, carrier grade operating system to Sun's networking and microprocessor products.  \n \n* Negotiated several detailed amendments to agreements with Sun's CAD vendors to allow for expanded use and sublicensing of the vendor software, as well as renewing existing licenses. \n \n* Act as primary IP counsel on M&A transactions performing due diligence, negotiating the definitive agreement and managing integration of the acquired company or technology. Senior Counsel Sun Microsystems, Inc September 2005  –  June 2009  (3 years 10 months) * Provided primary legal support to four hardware and software product R&D divisions, two testing and quality assurance groups and one supply chain management group for all day-to-day legal matters including inbound licensing, technology development, OEM transactions and engineering services. \n \n* Advised engineering clients on the use and integration of third party open source software in Sun products, the selection of open source licenses for outbound licensing of Sun products, and interactions with open source developer communities.  \n \n* Negotiated the outsourcing of manufacturing operations for Sun's tape, disk and library storage products to a large contract manufacturer who will produce more than $200 million of Sun's storage products each year. \n \n* Created and delivered training to engineering clients on open source software, treatment of confidential information and various legal processes that impact product development. \n \n* Negotiated an agreement to license the design of a next-generation networking ASIC, which is integral to Sun's High Performance Computing and Enterprise Computing strategy. \n \n* Negotiated a marketing and development agreement with an operating system supplier to port the supplier's open source, carrier grade operating system to Sun's networking and microprocessor products.  \n \n* Negotiated several detailed amendments to agreements with Sun's CAD vendors to allow for expanded use and sublicensing of the vendor software, as well as renewing existing licenses. \n \n* Act as primary IP counsel on M&A transactions performing due diligence, negotiating the definitive agreement and managing integration of the acquired company or technology. Consultant Opcentric 2004  –  2005  (1 year) Consultant Opcentric 2004  –  2005  (1 year) Project Attorney Wyse Technology Inc May 2003  –  April 2004  (1 year) Provided legal support for software licensing, distribution, source code licensing and purchasing agreements. Negotiated several inbound licensing agreements and provided guidance to Sales on legal and revenue recognition issues. \n \nManaged real estate leasing issues, including the sublease of office space on company's main campus and the resolution of a dispute with a warehouse service. Project Attorney Wyse Technology Inc May 2003  –  April 2004  (1 year) Provided legal support for software licensing, distribution, source code licensing and purchasing agreements. Negotiated several inbound licensing agreements and provided guidance to Sales on legal and revenue recognition issues. \n \nManaged real estate leasing issues, including the sublease of office space on company's main campus and the resolution of a dispute with a warehouse service. Corporate Counsel Aspect Communications Corporation December 1999  –  July 2002  (2 years 8 months) Corporate Counsel Aspect Communications Corporation December 1999  –  July 2002  (2 years 8 months) Law Clerk Melvin & Melvin 1997  –  1999  (2 years) Law Clerk Melvin & Melvin 1997  –  1999  (2 years) Skills Open Source Licensing Supply Chain Management Procurement Software Licensing OEM Resellers Inbound Outbound Due Diligence Channel Strategic Sourcing Supply Chain Negotiation Purchasing Contract Negotiation Alliances Sourcing Contract Management ODM Acquisition Integration ISV M&A experience Technical Standards Open Standards Business Alliances Intellectual Property Patents Licensing Mergers & Acquisitions See 14+     See less Skills  Open Source Licensing Supply Chain Management Procurement Software Licensing OEM Resellers Inbound Outbound Due Diligence Channel Strategic Sourcing Supply Chain Negotiation Purchasing Contract Negotiation Alliances Sourcing Contract Management ODM Acquisition Integration ISV M&A experience Technical Standards Open Standards Business Alliances Intellectual Property Patents Licensing Mergers & Acquisitions See 14+     See less Open Source Licensing Supply Chain Management Procurement Software Licensing OEM Resellers Inbound Outbound Due Diligence Channel Strategic Sourcing Supply Chain Negotiation Purchasing Contract Negotiation Alliances Sourcing Contract Management ODM Acquisition Integration ISV M&A experience Technical Standards Open Standards Business Alliances Intellectual Property Patents Licensing Mergers & Acquisitions See 14+     See less Open Source Licensing Supply Chain Management Procurement Software Licensing OEM Resellers Inbound Outbound Due Diligence Channel Strategic Sourcing Supply Chain Negotiation Purchasing Contract Negotiation Alliances Sourcing Contract Management ODM Acquisition Integration ISV M&A experience Technical Standards Open Standards Business Alliances Intellectual Property Patents Licensing Mergers & Acquisitions See 14+     See less Education Syracuse University College of Law JD,  Law 1996  – 1999 Gustavus Adolphus College BA,  History 1992  – 1996 Syracuse University College of Law JD,  Law 1996  – 1999 Syracuse University College of Law JD,  Law 1996  – 1999 Syracuse University College of Law JD,  Law 1996  – 1999 Gustavus Adolphus College BA,  History 1992  – 1996 Gustavus Adolphus College BA,  History 1992  – 1996 Gustavus Adolphus College BA,  History 1992  – 1996 ", "Experience Senior Attorney Intel Corporation Senior Attorney Intel Corporation Senior Attorney Intel Corporation ", "Experience Senior Attorney Intel Corporation March 2006  – Present (9 years 6 months) Senior attorney for \n- South East Asia sales and marketing activities \n- Intel's marketing activities in Asia \n- Technology manufacturing group: sole attorney in Asia for all of Intel’s construction activities (both new projects and retrofit of existing plants) Senior Associate Rodyk & Davidson April 2005  –  February 2006  (11 months) General corporate \nProject finance \nMerger and acquisition Legal Counsel Shell February 2003  –  March 2005  (2 years 2 months) Legal Adviser (petrochemicals business): corporate, commercial and contentious legal matters Senior Associate Rajah & Tann March 1998  –  January 2003  (4 years 11 months) Singapore Litigation Senior Attorney Intel Corporation March 2006  – Present (9 years 6 months) Senior attorney for \n- South East Asia sales and marketing activities \n- Intel's marketing activities in Asia \n- Technology manufacturing group: sole attorney in Asia for all of Intel’s construction activities (both new projects and retrofit of existing plants) Senior Attorney Intel Corporation March 2006  – Present (9 years 6 months) Senior attorney for \n- South East Asia sales and marketing activities \n- Intel's marketing activities in Asia \n- Technology manufacturing group: sole attorney in Asia for all of Intel’s construction activities (both new projects and retrofit of existing plants) Senior Associate Rodyk & Davidson April 2005  –  February 2006  (11 months) General corporate \nProject finance \nMerger and acquisition Senior Associate Rodyk & Davidson April 2005  –  February 2006  (11 months) General corporate \nProject finance \nMerger and acquisition Legal Counsel Shell February 2003  –  March 2005  (2 years 2 months) Legal Adviser (petrochemicals business): corporate, commercial and contentious legal matters Legal Counsel Shell February 2003  –  March 2005  (2 years 2 months) Legal Adviser (petrochemicals business): corporate, commercial and contentious legal matters Senior Associate Rajah & Tann March 1998  –  January 2003  (4 years 11 months) Singapore Litigation Senior Associate Rajah & Tann March 1998  –  January 2003  (4 years 11 months) Singapore Litigation Languages Chinese Chinese Chinese Skills Lawyer Skills  Lawyer Lawyer Lawyer Education National University of Singapore Bachelor of Laws (LL.B.),  Law 1994  – 1997 Anglo Chinese Junior College Anglo Chinese Junior School Anglo Chinese School National University of Singapore Bachelor of Laws (LL.B.),  Law 1994  – 1997 National University of Singapore Bachelor of Laws (LL.B.),  Law 1994  – 1997 National University of Singapore Bachelor of Laws (LL.B.),  Law 1994  – 1997 Anglo Chinese Junior College Anglo Chinese Junior College Anglo Chinese Junior College Anglo Chinese Junior School Anglo Chinese Junior School Anglo Chinese Junior School Anglo Chinese School Anglo Chinese School Anglo Chinese School ", "Summary Senior attorney with broad experience in marketing law (including digital and traditional media, social media, privacy, targeted advertising, truth-in-advertising, content licensing, copyright, branding/sponsorship, contests/sweepstakes/promotions, event marketing) and trademark law (including clearance, prosecution, enforcement, licensing). Summary Senior attorney with broad experience in marketing law (including digital and traditional media, social media, privacy, targeted advertising, truth-in-advertising, content licensing, copyright, branding/sponsorship, contests/sweepstakes/promotions, event marketing) and trademark law (including clearance, prosecution, enforcement, licensing). Senior attorney with broad experience in marketing law (including digital and traditional media, social media, privacy, targeted advertising, truth-in-advertising, content licensing, copyright, branding/sponsorship, contests/sweepstakes/promotions, event marketing) and trademark law (including clearance, prosecution, enforcement, licensing). Senior attorney with broad experience in marketing law (including digital and traditional media, social media, privacy, targeted advertising, truth-in-advertising, content licensing, copyright, branding/sponsorship, contests/sweepstakes/promotions, event marketing) and trademark law (including clearance, prosecution, enforcement, licensing). Experience Senior Attorney Intel Corporation 2002  – Present (13 years) Marketing counsel: Counsel for consumer insights, digital and social media, creative services, agency procurement/management, and brand identity. I’ve negotiated agreements for talent/entertainment, sponsorships and co-marketing, marketing agency services, and events (like the Intel Developer Forum). I’ve counseled clients on privacy issues (right of publicity, collection of personal information via mobile apps, intel.com, Intel events, compliance with U.S. and international laws, COPPA); false advertising; endorsements and disclosures; copyright and trademark usage and protection; development of terms of use, social media guidelines, privacy/cookies notices, and contest/sweepstakes/promotion rules. \n \nTrademark counsel: Managed hundreds of enforcement matters in the U.S. and abroad; managed clearance and prosecution of trademarks worldwide; negotiated trademark licenses. Attorney Coudert Brothers 2000  –  2002  (2 years) San Francisco Enforced famous trademarks, including pre-litigation disputes and administrative proceedings; managed clearance and prosecution of famous and non-famous trademarks; drafted trademark licenses. Senior Attorney Intel Corporation 2002  – Present (13 years) Marketing counsel: Counsel for consumer insights, digital and social media, creative services, agency procurement/management, and brand identity. I’ve negotiated agreements for talent/entertainment, sponsorships and co-marketing, marketing agency services, and events (like the Intel Developer Forum). I’ve counseled clients on privacy issues (right of publicity, collection of personal information via mobile apps, intel.com, Intel events, compliance with U.S. and international laws, COPPA); false advertising; endorsements and disclosures; copyright and trademark usage and protection; development of terms of use, social media guidelines, privacy/cookies notices, and contest/sweepstakes/promotion rules. \n \nTrademark counsel: Managed hundreds of enforcement matters in the U.S. and abroad; managed clearance and prosecution of trademarks worldwide; negotiated trademark licenses. Senior Attorney Intel Corporation 2002  – Present (13 years) Marketing counsel: Counsel for consumer insights, digital and social media, creative services, agency procurement/management, and brand identity. I’ve negotiated agreements for talent/entertainment, sponsorships and co-marketing, marketing agency services, and events (like the Intel Developer Forum). I’ve counseled clients on privacy issues (right of publicity, collection of personal information via mobile apps, intel.com, Intel events, compliance with U.S. and international laws, COPPA); false advertising; endorsements and disclosures; copyright and trademark usage and protection; development of terms of use, social media guidelines, privacy/cookies notices, and contest/sweepstakes/promotion rules. \n \nTrademark counsel: Managed hundreds of enforcement matters in the U.S. and abroad; managed clearance and prosecution of trademarks worldwide; negotiated trademark licenses. Attorney Coudert Brothers 2000  –  2002  (2 years) San Francisco Enforced famous trademarks, including pre-litigation disputes and administrative proceedings; managed clearance and prosecution of famous and non-famous trademarks; drafted trademark licenses. Attorney Coudert Brothers 2000  –  2002  (2 years) San Francisco Enforced famous trademarks, including pre-litigation disputes and administrative proceedings; managed clearance and prosecution of famous and non-famous trademarks; drafted trademark licenses. Skills Trademarks False Advertising Privacy Law Social Media Marketing Trademark Infringement Copyright Law Licensing Intellectual Property Trade Secrets Prosecution International Law Digital Media Skills  Trademarks False Advertising Privacy Law Social Media Marketing Trademark Infringement Copyright Law Licensing Intellectual Property Trade Secrets Prosecution International Law Digital Media Trademarks False Advertising Privacy Law Social Media Marketing Trademark Infringement Copyright Law Licensing Intellectual Property Trade Secrets Prosecution International Law Digital Media Trademarks False Advertising Privacy Law Social Media Marketing Trademark Infringement Copyright Law Licensing Intellectual Property Trade Secrets Prosecution International Law Digital Media Education University of San Francisco School of Law Juris Doctor (J.D.) 1996  – 1999 Washington University in St. Louis Bachelor's Degree,  English 1992  – 1996 University of San Francisco School of Law Juris Doctor (J.D.) 1996  – 1999 University of San Francisco School of Law Juris Doctor (J.D.) 1996  – 1999 University of San Francisco School of Law Juris Doctor (J.D.) 1996  – 1999 Washington University in St. Louis Bachelor's Degree,  English 1992  – 1996 Washington University in St. Louis Bachelor's Degree,  English 1992  – 1996 Washington University in St. Louis Bachelor's Degree,  English 1992  – 1996 ", "Summary Specialties:Intellectual property licensing, corporate transactions, advertising and marketing law, copyright and trademark law Summary Specialties:Intellectual property licensing, corporate transactions, advertising and marketing law, copyright and trademark law Specialties:Intellectual property licensing, corporate transactions, advertising and marketing law, copyright and trademark law Specialties:Intellectual property licensing, corporate transactions, advertising and marketing law, copyright and trademark law Experience VP, General Counsel and Corporate Secretary Shutterfly, Inc. April 2010  – Present (5 years 5 months) Secretary and General Counsel Future US, Inc. June 2008  –  April 2010  (1 year 11 months) Associate General Counsel Netflix, Inc. October 2005  –  April 2008  (2 years 7 months) Legal Director Aspect Communications November 2004  –  October 2005  (1 year) Director of Licensing Immersion Corporation June 2002  –  November 2004  (2 years 6 months) Senior Attorney Intel Corporation August 1996  –  July 2001  (5 years) Associate Vedder Price, P.C. 1990  –  1993  (3 years) VP, General Counsel and Corporate Secretary Shutterfly, Inc. April 2010  – Present (5 years 5 months) VP, General Counsel and Corporate Secretary Shutterfly, Inc. April 2010  – Present (5 years 5 months) Secretary and General Counsel Future US, Inc. June 2008  –  April 2010  (1 year 11 months) Secretary and General Counsel Future US, Inc. June 2008  –  April 2010  (1 year 11 months) Associate General Counsel Netflix, Inc. October 2005  –  April 2008  (2 years 7 months) Associate General Counsel Netflix, Inc. October 2005  –  April 2008  (2 years 7 months) Legal Director Aspect Communications November 2004  –  October 2005  (1 year) Legal Director Aspect Communications November 2004  –  October 2005  (1 year) Director of Licensing Immersion Corporation June 2002  –  November 2004  (2 years 6 months) Director of Licensing Immersion Corporation June 2002  –  November 2004  (2 years 6 months) Senior Attorney Intel Corporation August 1996  –  July 2001  (5 years) Senior Attorney Intel Corporation August 1996  –  July 2001  (5 years) Associate Vedder Price, P.C. 1990  –  1993  (3 years) Associate Vedder Price, P.C. 1990  –  1993  (3 years) Skills Marketing Intellectual Property Corporate Law Patents Trademarks Copyright Law Litigation Licensing Strategy Start-ups Mergers Management Patent Litigation Software Licensing Securities Regulation Corporate Governance Trade Secrets Mergers & Acquisitions Venture Capital Privacy Law See 5+     See less Skills  Marketing Intellectual Property Corporate Law Patents Trademarks Copyright Law Litigation Licensing Strategy Start-ups Mergers Management Patent Litigation Software Licensing Securities Regulation Corporate Governance Trade Secrets Mergers & Acquisitions Venture Capital Privacy Law See 5+     See less Marketing Intellectual Property Corporate Law Patents Trademarks Copyright Law Litigation Licensing Strategy Start-ups Mergers Management Patent Litigation Software Licensing Securities Regulation Corporate Governance Trade Secrets Mergers & Acquisitions Venture Capital Privacy Law See 5+     See less Marketing Intellectual Property Corporate Law Patents Trademarks Copyright Law Litigation Licensing Strategy Start-ups Mergers Management Patent Litigation Software Licensing Securities Regulation Corporate Governance Trade Secrets Mergers & Acquisitions Venture Capital Privacy Law See 5+     See less Education Harvard Law School JD September 1987  – June 1990 National Louis University M.A.,  Elementary and Special Education University of Illinois at Urbana-Champaign B.A.,  Ancient Near Eastern Studies Activities and Societies:  Bronze Tablet ,  Phi Beta Kappa Harvard Law School JD September 1987  – June 1990 Harvard Law School JD September 1987  – June 1990 Harvard Law School JD September 1987  – June 1990 National Louis University M.A.,  Elementary and Special Education National Louis University M.A.,  Elementary and Special Education National Louis University M.A.,  Elementary and Special Education University of Illinois at Urbana-Champaign B.A.,  Ancient Near Eastern Studies Activities and Societies:  Bronze Tablet ,  Phi Beta Kappa University of Illinois at Urbana-Champaign B.A.,  Ancient Near Eastern Studies Activities and Societies:  Bronze Tablet ,  Phi Beta Kappa University of Illinois at Urbana-Champaign B.A.,  Ancient Near Eastern Studies Activities and Societies:  Bronze Tablet ,  Phi Beta Kappa ", "Skills Patent Litigation Patents Patent Prosecution Intellectual Property Prosecution Trade Secrets Registered Patent... Patentability Licensing Joint Ventures Trademarks Software Licensing IP Mergers & Acquisitions Software Patents Privacy Law Due Diligence Invention Patent Applications Open Source Licensing Copyright Law Semiconductors Litigation Commercial Litigation Wireless Legal Writing Corporate Law See 12+     See less Skills  Patent Litigation Patents Patent Prosecution Intellectual Property Prosecution Trade Secrets Registered Patent... Patentability Licensing Joint Ventures Trademarks Software Licensing IP Mergers & Acquisitions Software Patents Privacy Law Due Diligence Invention Patent Applications Open Source Licensing Copyright Law Semiconductors Litigation Commercial Litigation Wireless Legal Writing Corporate Law See 12+     See less Patent Litigation Patents Patent Prosecution Intellectual Property Prosecution Trade Secrets Registered Patent... Patentability Licensing Joint Ventures Trademarks Software Licensing IP Mergers & Acquisitions Software Patents Privacy Law Due Diligence Invention Patent Applications Open Source Licensing Copyright Law Semiconductors Litigation Commercial Litigation Wireless Legal Writing Corporate Law See 12+     See less Patent Litigation Patents Patent Prosecution Intellectual Property Prosecution Trade Secrets Registered Patent... Patentability Licensing Joint Ventures Trademarks Software Licensing IP Mergers & Acquisitions Software Patents Privacy Law Due Diligence Invention Patent Applications Open Source Licensing Copyright Law Semiconductors Litigation Commercial Litigation Wireless Legal Writing Corporate Law See 12+     See less ", "Experience Senior Attorney Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara, CA Senior Director - Legal Services Jawbone July 2010  – Present (5 years 2 months) Sole In-House Counsel. Responsibilities include:  \n \nLicensing & Technology Transactions – license agreements for hardware and software; legal issues relating to EULAs, national and international data privacy concerns, and open source licensing. \n \nIP - develop and enforce international trademark portfolio; mine product development for patentable inventions; coordinate prosecution of patent applications; develop defensive and offensive IP portfolio strategies. \n \nSales, Marketing and Distribution – national and international distribution agreements; anti-gray market strategies; safety, IP and labeling compliance; strategies to halt social media attacks on company brand and reputation.  \n \nManufacturing and Product Development – global supply, product development and product manufacturing agreements; address compliance requirements for global sale of consumer electronics. \n \nInfrastructure – Contracts: develop company standard NDAs and independent contractor agreements; HR: develop FCPA, data privacy, employee training, and invention assignment policies; Real Estate - draft and negotiate real estate leases and subleases; address building management and hazardous waste legal issues; Finance: diligence in support of financing and internal and external audits; Governance: prepare board resolutions and meeting minutes and coordinate shareholder consent activities.  \n \nLitigation – direct outside counsel on litigation matters including patent, trademark, trade secret and employment issues; manage outside counsel litigation budgets and develop litigation strategies to minimize fees; advise on strategies for risk management, litigation avoidance and dispute resolution; negotiate and enforce indemnification agreements; address cease and desist letters. Associate Morrison & Foerster LLP October 2005  –  July 2010  (4 years 10 months) Associate Bingham McCutchen November 2002  –  October 2005  (3 years) Senior Scientist URS Corporation August 1988  –  August 1999  (11 years 1 month) Senior Attorney Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara, CA Senior Attorney Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara, CA Senior Director - Legal Services Jawbone July 2010  – Present (5 years 2 months) Sole In-House Counsel. Responsibilities include:  \n \nLicensing & Technology Transactions – license agreements for hardware and software; legal issues relating to EULAs, national and international data privacy concerns, and open source licensing. \n \nIP - develop and enforce international trademark portfolio; mine product development for patentable inventions; coordinate prosecution of patent applications; develop defensive and offensive IP portfolio strategies. \n \nSales, Marketing and Distribution – national and international distribution agreements; anti-gray market strategies; safety, IP and labeling compliance; strategies to halt social media attacks on company brand and reputation.  \n \nManufacturing and Product Development – global supply, product development and product manufacturing agreements; address compliance requirements for global sale of consumer electronics. \n \nInfrastructure – Contracts: develop company standard NDAs and independent contractor agreements; HR: develop FCPA, data privacy, employee training, and invention assignment policies; Real Estate - draft and negotiate real estate leases and subleases; address building management and hazardous waste legal issues; Finance: diligence in support of financing and internal and external audits; Governance: prepare board resolutions and meeting minutes and coordinate shareholder consent activities.  \n \nLitigation – direct outside counsel on litigation matters including patent, trademark, trade secret and employment issues; manage outside counsel litigation budgets and develop litigation strategies to minimize fees; advise on strategies for risk management, litigation avoidance and dispute resolution; negotiate and enforce indemnification agreements; address cease and desist letters. Senior Director - Legal Services Jawbone July 2010  – Present (5 years 2 months) Sole In-House Counsel. Responsibilities include:  \n \nLicensing & Technology Transactions – license agreements for hardware and software; legal issues relating to EULAs, national and international data privacy concerns, and open source licensing. \n \nIP - develop and enforce international trademark portfolio; mine product development for patentable inventions; coordinate prosecution of patent applications; develop defensive and offensive IP portfolio strategies. \n \nSales, Marketing and Distribution – national and international distribution agreements; anti-gray market strategies; safety, IP and labeling compliance; strategies to halt social media attacks on company brand and reputation.  \n \nManufacturing and Product Development – global supply, product development and product manufacturing agreements; address compliance requirements for global sale of consumer electronics. \n \nInfrastructure – Contracts: develop company standard NDAs and independent contractor agreements; HR: develop FCPA, data privacy, employee training, and invention assignment policies; Real Estate - draft and negotiate real estate leases and subleases; address building management and hazardous waste legal issues; Finance: diligence in support of financing and internal and external audits; Governance: prepare board resolutions and meeting minutes and coordinate shareholder consent activities.  \n \nLitigation – direct outside counsel on litigation matters including patent, trademark, trade secret and employment issues; manage outside counsel litigation budgets and develop litigation strategies to minimize fees; advise on strategies for risk management, litigation avoidance and dispute resolution; negotiate and enforce indemnification agreements; address cease and desist letters. Associate Morrison & Foerster LLP October 2005  –  July 2010  (4 years 10 months) Associate Morrison & Foerster LLP October 2005  –  July 2010  (4 years 10 months) Associate Bingham McCutchen November 2002  –  October 2005  (3 years) Associate Bingham McCutchen November 2002  –  October 2005  (3 years) Senior Scientist URS Corporation August 1988  –  August 1999  (11 years 1 month) Senior Scientist URS Corporation August 1988  –  August 1999  (11 years 1 month) Education University of California, Hastings College of the Law J.D. 1999  – 2002 University of Miami M.S.,  Marine and Atmospheric Chemistry 1985  – 1988 Texas A&M University B.S.,  Chemical Engineering 1979  – 1984 University of California, Hastings College of the Law J.D. 1999  – 2002 University of California, Hastings College of the Law J.D. 1999  – 2002 University of California, Hastings College of the Law J.D. 1999  – 2002 University of Miami M.S.,  Marine and Atmospheric Chemistry 1985  – 1988 University of Miami M.S.,  Marine and Atmospheric Chemistry 1985  – 1988 University of Miami M.S.,  Marine and Atmospheric Chemistry 1985  – 1988 Texas A&M University B.S.,  Chemical Engineering 1979  – 1984 Texas A&M University B.S.,  Chemical Engineering 1979  – 1984 Texas A&M University B.S.,  Chemical Engineering 1979  – 1984 ", "Experience Commodore Santa Cruz Yacht Club January 2015  – Present (8 months) Santa Cruz, California Elected volunteer executive of yacht club. Responsible for management of officers and committee chairs who organize regattas, social events, educational programs and club maintenance and finances. Formerly Secretary (2010-2012), Rear Commodore (2012-2013), Vice Commodore (2013-2014). Senior Attorney Intel Corporation July 1994  – Present (21 years 2 months) Santa Clara, California Attorney FMC Corporation 1989  –  1994  (5 years) Associate Attorney Wilson Sonsini Goodrich & Rosati August 1986  –  May 1989  (2 years 10 months) Commodore Santa Cruz Yacht Club January 2015  – Present (8 months) Santa Cruz, California Elected volunteer executive of yacht club. Responsible for management of officers and committee chairs who organize regattas, social events, educational programs and club maintenance and finances. Formerly Secretary (2010-2012), Rear Commodore (2012-2013), Vice Commodore (2013-2014). Commodore Santa Cruz Yacht Club January 2015  – Present (8 months) Santa Cruz, California Elected volunteer executive of yacht club. Responsible for management of officers and committee chairs who organize regattas, social events, educational programs and club maintenance and finances. Formerly Secretary (2010-2012), Rear Commodore (2012-2013), Vice Commodore (2013-2014). Senior Attorney Intel Corporation July 1994  – Present (21 years 2 months) Santa Clara, California Senior Attorney Intel Corporation July 1994  – Present (21 years 2 months) Santa Clara, California Attorney FMC Corporation 1989  –  1994  (5 years) Attorney FMC Corporation 1989  –  1994  (5 years) Associate Attorney Wilson Sonsini Goodrich & Rosati August 1986  –  May 1989  (2 years 10 months) Associate Attorney Wilson Sonsini Goodrich & Rosati August 1986  –  May 1989  (2 years 10 months) Languages French French French Skills Contract Negotiation Competition Law Product Development... Advertising Law General Business... Intellectual Property Software Licensing Legal Compliance International Law Corporate Governance Mergers & Acquisitions Consumer Law Cyberlaw Licensing Trade Secrets Legal Research Counseling Psychology Privacy Law Patent Prosecution Copyright Law Trademarks See 6+     See less Skills  Contract Negotiation Competition Law Product Development... Advertising Law General Business... Intellectual Property Software Licensing Legal Compliance International Law Corporate Governance Mergers & Acquisitions Consumer Law Cyberlaw Licensing Trade Secrets Legal Research Counseling Psychology Privacy Law Patent Prosecution Copyright Law Trademarks See 6+     See less Contract Negotiation Competition Law Product Development... Advertising Law General Business... Intellectual Property Software Licensing Legal Compliance International Law Corporate Governance Mergers & Acquisitions Consumer Law Cyberlaw Licensing Trade Secrets Legal Research Counseling Psychology Privacy Law Patent Prosecution Copyright Law Trademarks See 6+     See less Contract Negotiation Competition Law Product Development... Advertising Law General Business... Intellectual Property Software Licensing Legal Compliance International Law Corporate Governance Mergers & Acquisitions Consumer Law Cyberlaw Licensing Trade Secrets Legal Research Counseling Psychology Privacy Law Patent Prosecution Copyright Law Trademarks See 6+     See less Education University of California, Hastings College of the Law Doctor of Law (J.D.),  Law 1980  – 1983 University of California, Berkeley B. A.,  History and Economics 1975  – 1980 University of California, Hastings College of the Law Doctor of Law (J.D.),  Law 1980  – 1983 University of California, Hastings College of the Law Doctor of Law (J.D.),  Law 1980  – 1983 University of California, Hastings College of the Law Doctor of Law (J.D.),  Law 1980  – 1983 University of California, Berkeley B. A.,  History and Economics 1975  – 1980 University of California, Berkeley B. A.,  History and Economics 1975  – 1980 University of California, Berkeley B. A.,  History and Economics 1975  – 1980 Honors & Awards Additional Honors & Awards Intel Achievement Award, 1996 Additional Honors & Awards Intel Achievement Award, 1996 Additional Honors & Awards Intel Achievement Award, 1996 Additional Honors & Awards Intel Achievement Award, 1996 ", "Languages Russian Native or bilingual proficiency French Professional working proficiency Russian Native or bilingual proficiency French Professional working proficiency Russian Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills intellectual property licensing open source outsourcing data privacy data security M&A experience cloud computing Due Diligence E-commerce Financial Modeling Licensing Intellectual Property SaaS Contract Negotiation Start-ups Outsourcing Cloud Computing Data Privacy Corporate Law Commercial Transactions Privacy Law Commercial Litigation Venture Capital Private Equity Mergers & Acquisitions Legal Research Trademark Infringement Joint Ventures Legal Compliance Corporate Governance Civil Litigation Mediation Open Source Trade Secrets Data Security Cyberlaw Copyright Law Trademarks Patent Litigation Software Licensing Securities Regulation See 27+     See less Skills  intellectual property licensing open source outsourcing data privacy data security M&A experience cloud computing Due Diligence E-commerce Financial Modeling Licensing Intellectual Property SaaS Contract Negotiation Start-ups Outsourcing Cloud Computing Data Privacy Corporate Law Commercial Transactions Privacy Law Commercial Litigation Venture Capital Private Equity Mergers & Acquisitions Legal Research Trademark Infringement Joint Ventures Legal Compliance Corporate Governance Civil Litigation Mediation Open Source Trade Secrets Data Security Cyberlaw Copyright Law Trademarks Patent Litigation Software Licensing Securities Regulation See 27+     See less intellectual property licensing open source outsourcing data privacy data security M&A experience cloud computing Due Diligence E-commerce Financial Modeling Licensing Intellectual Property SaaS Contract Negotiation Start-ups Outsourcing Cloud Computing Data Privacy Corporate Law Commercial Transactions Privacy Law Commercial Litigation Venture Capital Private Equity Mergers & Acquisitions Legal Research Trademark Infringement Joint Ventures Legal Compliance Corporate Governance Civil Litigation Mediation Open Source Trade Secrets Data Security Cyberlaw Copyright Law Trademarks Patent Litigation Software Licensing Securities Regulation See 27+     See less intellectual property licensing open source outsourcing data privacy data security M&A experience cloud computing Due Diligence E-commerce Financial Modeling Licensing Intellectual Property SaaS Contract Negotiation Start-ups Outsourcing Cloud Computing Data Privacy Corporate Law Commercial Transactions Privacy Law Commercial Litigation Venture Capital Private Equity Mergers & Acquisitions Legal Research Trademark Infringement Joint Ventures Legal Compliance Corporate Governance Civil Litigation Mediation Open Source Trade Secrets Data Security Cyberlaw Copyright Law Trademarks Patent Litigation Software Licensing Securities Regulation See 27+     See less ", "Experience Senior Attorney Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Counsel IBM March 2010  –  November 2013  (3 years 9 months) Bethesda, MD Associate Attorney Sheppard Mullin Richter & Hampton LLP August 2006  –  March 2010  (3 years 8 months) Senior Attorney Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Senior Attorney Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Counsel IBM March 2010  –  November 2013  (3 years 9 months) Bethesda, MD Counsel IBM March 2010  –  November 2013  (3 years 9 months) Bethesda, MD Associate Attorney Sheppard Mullin Richter & Hampton LLP August 2006  –  March 2010  (3 years 8 months) Associate Attorney Sheppard Mullin Richter & Hampton LLP August 2006  –  March 2010  (3 years 8 months) Education University of Minnesota Law School 2001  – 2004 University of Minnesota Law School 2001  – 2004 University of Minnesota Law School 2001  – 2004 University of Minnesota Law School 2001  – 2004 ", "Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Litigation Intellectual Property Licensing Trade Secrets Patents Commercial Litigation Legal Research Software Licensing Legal Writing Semiconductors Contract Negotiation Licensing Negotiations Contract Law Client Counseling Strategic Alliances Environmental Law Patent Litigation Trademarks Copyright Law See 4+     See less Skills  Litigation Intellectual Property Licensing Trade Secrets Patents Commercial Litigation Legal Research Software Licensing Legal Writing Semiconductors Contract Negotiation Licensing Negotiations Contract Law Client Counseling Strategic Alliances Environmental Law Patent Litigation Trademarks Copyright Law See 4+     See less Litigation Intellectual Property Licensing Trade Secrets Patents Commercial Litigation Legal Research Software Licensing Legal Writing Semiconductors Contract Negotiation Licensing Negotiations Contract Law Client Counseling Strategic Alliances Environmental Law Patent Litigation Trademarks Copyright Law See 4+     See less Litigation Intellectual Property Licensing Trade Secrets Patents Commercial Litigation Legal Research Software Licensing Legal Writing Semiconductors Contract Negotiation Licensing Negotiations Contract Law Client Counseling Strategic Alliances Environmental Law Patent Litigation Trademarks Copyright Law See 4+     See less "]}