{"position": "Senior Network Engineer", "company": "Intel Corporation", "profiles": ["Summary Firewall, Web Security and Authentication product installer and trainer. Responsible for on-site training and installation for a variety of security products in many difference sectors like banking, health care, government and military. \n \nPublisher of many enterprise training courses both taught in classroom and in online formats as well as pure electronic learning. Specialties:Firewall installation and maintenance, Web security, two factor authentication, networking and routing topology, troubleshooting, training and delivery, virtualization. Summary Firewall, Web Security and Authentication product installer and trainer. Responsible for on-site training and installation for a variety of security products in many difference sectors like banking, health care, government and military. \n \nPublisher of many enterprise training courses both taught in classroom and in online formats as well as pure electronic learning. Specialties:Firewall installation and maintenance, Web security, two factor authentication, networking and routing topology, troubleshooting, training and delivery, virtualization. Firewall, Web Security and Authentication product installer and trainer. Responsible for on-site training and installation for a variety of security products in many difference sectors like banking, health care, government and military. \n \nPublisher of many enterprise training courses both taught in classroom and in online formats as well as pure electronic learning. Specialties:Firewall installation and maintenance, Web security, two factor authentication, networking and routing topology, troubleshooting, training and delivery, virtualization. Firewall, Web Security and Authentication product installer and trainer. Responsible for on-site training and installation for a variety of security products in many difference sectors like banking, health care, government and military. \n \nPublisher of many enterprise training courses both taught in classroom and in online formats as well as pure electronic learning. Specialties:Firewall installation and maintenance, Web security, two factor authentication, networking and routing topology, troubleshooting, training and delivery, virtualization. Experience Senior Network Engineer Intel Corporation February 2011  – Present (4 years 7 months) Saint Paul, MN Senior Network Engineer McAfee December 2008  –  February 2011  (2 years 3 months) Senior Network Engineer Secure Computing October 1999  –  December 2008  (9 years 3 months) Senior Network Engineer Intel Corporation February 2011  – Present (4 years 7 months) Saint Paul, MN Senior Network Engineer Intel Corporation February 2011  – Present (4 years 7 months) Saint Paul, MN Senior Network Engineer McAfee December 2008  –  February 2011  (2 years 3 months) Senior Network Engineer McAfee December 2008  –  February 2011  (2 years 3 months) Senior Network Engineer Secure Computing October 1999  –  December 2008  (9 years 3 months) Senior Network Engineer Secure Computing October 1999  –  December 2008  (9 years 3 months) Skills Firewalls Virtualization Security Network Security Troubleshooting Routing CISSP IPS VPN Two-factor... McAfee Computer Security TCP/IP Encryption VMware Technical Writing IDS Technical Course... Web Filtering Malware Analysis Incident Management Switches Information Security... See 8+     See less Skills  Firewalls Virtualization Security Network Security Troubleshooting Routing CISSP IPS VPN Two-factor... McAfee Computer Security TCP/IP Encryption VMware Technical Writing IDS Technical Course... Web Filtering Malware Analysis Incident Management Switches Information Security... See 8+     See less Firewalls Virtualization Security Network Security Troubleshooting Routing CISSP IPS VPN Two-factor... McAfee Computer Security TCP/IP Encryption VMware Technical Writing IDS Technical Course... Web Filtering Malware Analysis Incident Management Switches Information Security... See 8+     See less Firewalls Virtualization Security Network Security Troubleshooting Routing CISSP IPS VPN Two-factor... McAfee Computer Security TCP/IP Encryption VMware Technical Writing IDS Technical Course... Web Filtering Malware Analysis Incident Management Switches Information Security... See 8+     See less Education Carleton College Bachelor of Arts,  Chemistry 1995  – 1999 Carleton College Bachelor of Arts,  Chemistry 1995  – 1999 Carleton College Bachelor of Arts,  Chemistry 1995  – 1999 Carleton College Bachelor of Arts,  Chemistry 1995  – 1999 ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Telugu Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Telugu Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Telugu Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Network Security Firewalls Security CISSP Data Center Cloud Computing Virtualization Network Design Managed Hosting Network Services Load Balancing Application Delivery... Hybrid Cloud Network Architecture VPN System Architecture Unix Information Security Networking TCP/IP Computer Security WAN Cisco Technologies Network Engineering Cisco IOS Switches Ethernet See 12+     See less Skills  Network Security Firewalls Security CISSP Data Center Cloud Computing Virtualization Network Design Managed Hosting Network Services Load Balancing Application Delivery... Hybrid Cloud Network Architecture VPN System Architecture Unix Information Security Networking TCP/IP Computer Security WAN Cisco Technologies Network Engineering Cisco IOS Switches Ethernet See 12+     See less Network Security Firewalls Security CISSP Data Center Cloud Computing Virtualization Network Design Managed Hosting Network Services Load Balancing Application Delivery... Hybrid Cloud Network Architecture VPN System Architecture Unix Information Security Networking TCP/IP Computer Security WAN Cisco Technologies Network Engineering Cisco IOS Switches Ethernet See 12+     See less Network Security Firewalls Security CISSP Data Center Cloud Computing Virtualization Network Design Managed Hosting Network Services Load Balancing Application Delivery... Hybrid Cloud Network Architecture VPN System Architecture Unix Information Security Networking TCP/IP Computer Security WAN Cisco Technologies Network Engineering Cisco IOS Switches Ethernet See 12+     See less ", "Summary Very experienced IT Engineer and Architect who provides cost effective solutions that enhance business objectives and outcomes. Summary Very experienced IT Engineer and Architect who provides cost effective solutions that enhance business objectives and outcomes. Very experienced IT Engineer and Architect who provides cost effective solutions that enhance business objectives and outcomes. Very experienced IT Engineer and Architect who provides cost effective solutions that enhance business objectives and outcomes. Experience Senior Network Engineer Woolworths May 2006  – Present (9 years 4 months) Bella Vista , Sydney Network service owner and architect for all Woolworths stores, Distribution Centres, Corporate Offices, International Offices covering LAN, WAN, Voice, Security and specializing in WiFi. Global Network Manager P&O Ports June 2003  –  September 2005  (2 years 4 months) Sydney Area, Australia Manager of a team of network engineers responsible for the implementation and support of a global network covering 70 locations over 7 countries./ Senior Network Engineer Intel Corporation February 2001  –  August 2003  (2 years 7 months) Sydney Area, Australia Installation and commissioning of network and server infrastructure for hosting customers Senior Network Engineer Woolworths May 2006  – Present (9 years 4 months) Bella Vista , Sydney Network service owner and architect for all Woolworths stores, Distribution Centres, Corporate Offices, International Offices covering LAN, WAN, Voice, Security and specializing in WiFi. Senior Network Engineer Woolworths May 2006  – Present (9 years 4 months) Bella Vista , Sydney Network service owner and architect for all Woolworths stores, Distribution Centres, Corporate Offices, International Offices covering LAN, WAN, Voice, Security and specializing in WiFi. Global Network Manager P&O Ports June 2003  –  September 2005  (2 years 4 months) Sydney Area, Australia Manager of a team of network engineers responsible for the implementation and support of a global network covering 70 locations over 7 countries./ Global Network Manager P&O Ports June 2003  –  September 2005  (2 years 4 months) Sydney Area, Australia Manager of a team of network engineers responsible for the implementation and support of a global network covering 70 locations over 7 countries./ Senior Network Engineer Intel Corporation February 2001  –  August 2003  (2 years 7 months) Sydney Area, Australia Installation and commissioning of network and server infrastructure for hosting customers Senior Network Engineer Intel Corporation February 2001  –  August 2003  (2 years 7 months) Sydney Area, Australia Installation and commissioning of network and server infrastructure for hosting customers Languages English English English Skills Customer Service IT Strategy Microsoft Office Team Leadership IT Service Management Security IT Management Networking Management Skills  Customer Service IT Strategy Microsoft Office Team Leadership IT Service Management Security IT Management Networking Management Customer Service IT Strategy Microsoft Office Team Leadership IT Service Management Security IT Management Networking Management Customer Service IT Strategy Microsoft Office Team Leadership IT Service Management Security IT Management Networking Management Education Parkes High School HSC Parkes High School HSC Parkes High School HSC Parkes High School HSC ", "Summary Familiar with all IT infrastructures , very proficient in project management and good interpersonal skills. Always be a good team lead and good at mentoring and coaching team members, over 15 years IT/ telecom infrastructure engineering and project management experience. Specialties:PMP, CCNA,CCNP, ITIL foundation, multinational and multiculture working environment, project team management.  \nRoger is a Canadian citizen from Vancouver, Canada, currently resides in Shanghai, China (as a permanent resident). He has also lived in the United States, Japan, China, and of course, Canada. Summary Familiar with all IT infrastructures , very proficient in project management and good interpersonal skills. Always be a good team lead and good at mentoring and coaching team members, over 15 years IT/ telecom infrastructure engineering and project management experience. Specialties:PMP, CCNA,CCNP, ITIL foundation, multinational and multiculture working environment, project team management.  \nRoger is a Canadian citizen from Vancouver, Canada, currently resides in Shanghai, China (as a permanent resident). He has also lived in the United States, Japan, China, and of course, Canada. Familiar with all IT infrastructures , very proficient in project management and good interpersonal skills. Always be a good team lead and good at mentoring and coaching team members, over 15 years IT/ telecom infrastructure engineering and project management experience. Specialties:PMP, CCNA,CCNP, ITIL foundation, multinational and multiculture working environment, project team management.  \nRoger is a Canadian citizen from Vancouver, Canada, currently resides in Shanghai, China (as a permanent resident). He has also lived in the United States, Japan, China, and of course, Canada. Familiar with all IT infrastructures , very proficient in project management and good interpersonal skills. Always be a good team lead and good at mentoring and coaching team members, over 15 years IT/ telecom infrastructure engineering and project management experience. Specialties:PMP, CCNA,CCNP, ITIL foundation, multinational and multiculture working environment, project team management.  \nRoger is a Canadian citizen from Vancouver, Canada, currently resides in Shanghai, China (as a permanent resident). He has also lived in the United States, Japan, China, and of course, Canada. Experience ENS technical project manager, PMP Intel Corporation January 2012  – Present (3 years 8 months) Shanghai City, China Start to manage Inter Company Connections projects in China from January, 2012. Overall managing of different ODCs(Offshore Development Center)outsourcing vendors's securely connecting with Intel and complete several new vendor's ODC start ups in different cities in China. Overall managing the Checkpoint firewall and Cisco routers in these projects. WAN project manager, PMP Intel Corporation February 2006  –  January 2012  (6 years) Shanghai, China Managed WAN(Wide Area Network) project team (over 10 people) to finish several huge network WAN redesign project inside China and GAR region in 2009 and 2011. Got PMP certified in 2010. Overall project managing the migration whole Intel China network from ATM to MPLS , including 2 major factories ,15 sales offices, 1 research center, 3 mobile devision companies. IT construction project manager Intel Corporation October 2003  –  February 2006  (2 years 5 months) Shanghai and Chengdu Worked as Project Manager in China in IT, managing A7T7 factory IT startup in Chengdu and FAB68 IT WAN startup in Dalian, which include computer room design and build, IT infrastructure build up, IT telecom infrastructure including WAN/LAN build up. Senior WAN Engineer 360networks March 2001  –  May 2003  (2 years 3 months) Vancouver, Canada Area Worked in 360networks NOC in Vancouver, managing the DCN network and IP network with outside telecom vendors like Telus and AT&T, 360networks in Canada were merged into Bell Canada as of today. Got CCNP certified in 2001. Senior Network engineer Global Media Corporation November 1999  –  June 2000  (8 months) Vancouver, Canada Area Work in NOC as network engineer and managing IT and IP broadcast network Senior Network Engineer Intel Corporation July 1997  –  September 1999  (2 years 3 months) Shanghai, China Work as senior network engineer for company , managing the whole IT network infrastructure for business growth in China including help to set up over 10 remote sales offices IT inside China. IT engineer Cargill July 1996  –  July 1997  (1 year 1 month) Shanghai Work as IT engineer and help to build IT for new offcies and factories inside China ENS technical project manager, PMP Intel Corporation January 2012  – Present (3 years 8 months) Shanghai City, China Start to manage Inter Company Connections projects in China from January, 2012. Overall managing of different ODCs(Offshore Development Center)outsourcing vendors's securely connecting with Intel and complete several new vendor's ODC start ups in different cities in China. Overall managing the Checkpoint firewall and Cisco routers in these projects. ENS technical project manager, PMP Intel Corporation January 2012  – Present (3 years 8 months) Shanghai City, China Start to manage Inter Company Connections projects in China from January, 2012. Overall managing of different ODCs(Offshore Development Center)outsourcing vendors's securely connecting with Intel and complete several new vendor's ODC start ups in different cities in China. Overall managing the Checkpoint firewall and Cisco routers in these projects. WAN project manager, PMP Intel Corporation February 2006  –  January 2012  (6 years) Shanghai, China Managed WAN(Wide Area Network) project team (over 10 people) to finish several huge network WAN redesign project inside China and GAR region in 2009 and 2011. Got PMP certified in 2010. Overall project managing the migration whole Intel China network from ATM to MPLS , including 2 major factories ,15 sales offices, 1 research center, 3 mobile devision companies. WAN project manager, PMP Intel Corporation February 2006  –  January 2012  (6 years) Shanghai, China Managed WAN(Wide Area Network) project team (over 10 people) to finish several huge network WAN redesign project inside China and GAR region in 2009 and 2011. Got PMP certified in 2010. Overall project managing the migration whole Intel China network from ATM to MPLS , including 2 major factories ,15 sales offices, 1 research center, 3 mobile devision companies. IT construction project manager Intel Corporation October 2003  –  February 2006  (2 years 5 months) Shanghai and Chengdu Worked as Project Manager in China in IT, managing A7T7 factory IT startup in Chengdu and FAB68 IT WAN startup in Dalian, which include computer room design and build, IT infrastructure build up, IT telecom infrastructure including WAN/LAN build up. IT construction project manager Intel Corporation October 2003  –  February 2006  (2 years 5 months) Shanghai and Chengdu Worked as Project Manager in China in IT, managing A7T7 factory IT startup in Chengdu and FAB68 IT WAN startup in Dalian, which include computer room design and build, IT infrastructure build up, IT telecom infrastructure including WAN/LAN build up. Senior WAN Engineer 360networks March 2001  –  May 2003  (2 years 3 months) Vancouver, Canada Area Worked in 360networks NOC in Vancouver, managing the DCN network and IP network with outside telecom vendors like Telus and AT&T, 360networks in Canada were merged into Bell Canada as of today. Got CCNP certified in 2001. Senior WAN Engineer 360networks March 2001  –  May 2003  (2 years 3 months) Vancouver, Canada Area Worked in 360networks NOC in Vancouver, managing the DCN network and IP network with outside telecom vendors like Telus and AT&T, 360networks in Canada were merged into Bell Canada as of today. Got CCNP certified in 2001. Senior Network engineer Global Media Corporation November 1999  –  June 2000  (8 months) Vancouver, Canada Area Work in NOC as network engineer and managing IT and IP broadcast network Senior Network engineer Global Media Corporation November 1999  –  June 2000  (8 months) Vancouver, Canada Area Work in NOC as network engineer and managing IT and IP broadcast network Senior Network Engineer Intel Corporation July 1997  –  September 1999  (2 years 3 months) Shanghai, China Work as senior network engineer for company , managing the whole IT network infrastructure for business growth in China including help to set up over 10 remote sales offices IT inside China. Senior Network Engineer Intel Corporation July 1997  –  September 1999  (2 years 3 months) Shanghai, China Work as senior network engineer for company , managing the whole IT network infrastructure for business growth in China including help to set up over 10 remote sales offices IT inside China. IT engineer Cargill July 1996  –  July 1997  (1 year 1 month) Shanghai Work as IT engineer and help to build IT for new offcies and factories inside China IT engineer Cargill July 1996  –  July 1997  (1 year 1 month) Shanghai Work as IT engineer and help to build IT for new offcies and factories inside China Skills PMP CCNP WAN Teamwork Project Management Interpersonal Skill Checkpoint Security Firewall-1 Cisco IOS Telecommunications Routing and Switching ITIL Certified Skills  PMP CCNP WAN Teamwork Project Management Interpersonal Skill Checkpoint Security Firewall-1 Cisco IOS Telecommunications Routing and Switching ITIL Certified PMP CCNP WAN Teamwork Project Management Interpersonal Skill Checkpoint Security Firewall-1 Cisco IOS Telecommunications Routing and Switching ITIL Certified PMP CCNP WAN Teamwork Project Management Interpersonal Skill Checkpoint Security Firewall-1 Cisco IOS Telecommunications Routing and Switching ITIL Certified Education East China Normal University Bachelor of Science (BSc),  Computer Science and Engineering 1991  – 1995 Major in Computer Science and Engineering East China Normal University Bachelor of Economics(BEc),  International Economy 1991  – 1995 Studied and got 2nd Degree in University East China Normal University Bachelor of Science (BSc),  Computer Science and Engineering 1991  – 1995 Major in Computer Science and Engineering East China Normal University Bachelor of Science (BSc),  Computer Science and Engineering 1991  – 1995 Major in Computer Science and Engineering East China Normal University Bachelor of Science (BSc),  Computer Science and Engineering 1991  – 1995 Major in Computer Science and Engineering East China Normal University Bachelor of Economics(BEc),  International Economy 1991  – 1995 Studied and got 2nd Degree in University East China Normal University Bachelor of Economics(BEc),  International Economy 1991  – 1995 Studied and got 2nd Degree in University East China Normal University Bachelor of Economics(BEc),  International Economy 1991  – 1995 Studied and got 2nd Degree in University ", "Experience Senior Network Engineer Intel Corporation November 1993  – Present (21 years 10 months) Design and Implement Global Wide Area Network Solutions Network Engineer Digital Equipment Corporation June 1984  –  November 1993  (9 years 6 months) Design PC networking solutions Software Systems Engineer Scripps League Newspapers May 1983  –  June 1984  (1 year 2 months) Central Data Processing manager responsibloe for managing the central data processing and remote site computer systems. Responisible for all software development and implementation. Software Programmer CBA Computers May 1979  –  May 1983  (4 years 1 month) Customized OEM business applications to meet customer requirements. Senior Network Engineer Intel Corporation November 1993  – Present (21 years 10 months) Design and Implement Global Wide Area Network Solutions Senior Network Engineer Intel Corporation November 1993  – Present (21 years 10 months) Design and Implement Global Wide Area Network Solutions Network Engineer Digital Equipment Corporation June 1984  –  November 1993  (9 years 6 months) Design PC networking solutions Network Engineer Digital Equipment Corporation June 1984  –  November 1993  (9 years 6 months) Design PC networking solutions Software Systems Engineer Scripps League Newspapers May 1983  –  June 1984  (1 year 2 months) Central Data Processing manager responsibloe for managing the central data processing and remote site computer systems. Responisible for all software development and implementation. Software Systems Engineer Scripps League Newspapers May 1983  –  June 1984  (1 year 2 months) Central Data Processing manager responsibloe for managing the central data processing and remote site computer systems. Responisible for all software development and implementation. Software Programmer CBA Computers May 1979  –  May 1983  (4 years 1 month) Customized OEM business applications to meet customer requirements. Software Programmer CBA Computers May 1979  –  May 1983  (4 years 1 month) Customized OEM business applications to meet customer requirements. Skills Enterprise Architecture Data Center Management Networking Network Security Virtualization Security IT Management Cloud Computing TCP/IP WAN ITIL Cisco Technologies Disaster Recovery Switches Network Engineering VPN Network Design Network Architecture Software Development Firewalls Servers See 7+     See less Skills  Enterprise Architecture Data Center Management Networking Network Security Virtualization Security IT Management Cloud Computing TCP/IP WAN ITIL Cisco Technologies Disaster Recovery Switches Network Engineering VPN Network Design Network Architecture Software Development Firewalls Servers See 7+     See less Enterprise Architecture Data Center Management Networking Network Security Virtualization Security IT Management Cloud Computing TCP/IP WAN ITIL Cisco Technologies Disaster Recovery Switches Network Engineering VPN Network Design Network Architecture Software Development Firewalls Servers See 7+     See less Enterprise Architecture Data Center Management Networking Network Security Virtualization Security IT Management Cloud Computing TCP/IP WAN ITIL Cisco Technologies Disaster Recovery Switches Network Engineering VPN Network Design Network Architecture Software Development Firewalls Servers See 7+     See less Education California State University-Chico B.S,  Computer Sciences 1969  – 1972 California State University-Chico B.S,  Computer Sciences 1969  – 1972 California State University-Chico B.S,  Computer Sciences 1969  – 1972 California State University-Chico B.S,  Computer Sciences 1969  – 1972 ", "Summary Having worked in IT all of my adult life, my experience in IT Operations and Engineering is extensive. \n \nMy technical experience ranges from entry level PC support to 3rd level global WAN engineering/support for over 100,000 employees. I have contributed at all functional levels from consultant through corporate management. \n \nI have worked with all sizes of organizations from the very small local office to very large global organizations. I have worked in technology companies as well as several other types of businesses. \n \nI have been exposed to a wide array of corporate cultures and team environments including strong national and international experience.  \n \nI’m currently focusing on IT Operations management covering a broad range of technologies used throughout California as well as other areas in US. \n \nSpecialties:  \n \n- Able to effectively and easily communicate with all levels of technology professionals through senior level business leaders \n \n- IT management and team leadership \n \n- Project and department budgeting \n \n- Network infrastructure design and support focusing on Cisco solutions \n \n- Information Security \n \n- Data center design and support \n \n- Acquisition integration  \n \n- Able to learn and provide solutions to most any challenge I encounter Summary Having worked in IT all of my adult life, my experience in IT Operations and Engineering is extensive. \n \nMy technical experience ranges from entry level PC support to 3rd level global WAN engineering/support for over 100,000 employees. I have contributed at all functional levels from consultant through corporate management. \n \nI have worked with all sizes of organizations from the very small local office to very large global organizations. I have worked in technology companies as well as several other types of businesses. \n \nI have been exposed to a wide array of corporate cultures and team environments including strong national and international experience.  \n \nI’m currently focusing on IT Operations management covering a broad range of technologies used throughout California as well as other areas in US. \n \nSpecialties:  \n \n- Able to effectively and easily communicate with all levels of technology professionals through senior level business leaders \n \n- IT management and team leadership \n \n- Project and department budgeting \n \n- Network infrastructure design and support focusing on Cisco solutions \n \n- Information Security \n \n- Data center design and support \n \n- Acquisition integration  \n \n- Able to learn and provide solutions to most any challenge I encounter Having worked in IT all of my adult life, my experience in IT Operations and Engineering is extensive. \n \nMy technical experience ranges from entry level PC support to 3rd level global WAN engineering/support for over 100,000 employees. I have contributed at all functional levels from consultant through corporate management. \n \nI have worked with all sizes of organizations from the very small local office to very large global organizations. I have worked in technology companies as well as several other types of businesses. \n \nI have been exposed to a wide array of corporate cultures and team environments including strong national and international experience.  \n \nI’m currently focusing on IT Operations management covering a broad range of technologies used throughout California as well as other areas in US. \n \nSpecialties:  \n \n- Able to effectively and easily communicate with all levels of technology professionals through senior level business leaders \n \n- IT management and team leadership \n \n- Project and department budgeting \n \n- Network infrastructure design and support focusing on Cisco solutions \n \n- Information Security \n \n- Data center design and support \n \n- Acquisition integration  \n \n- Able to learn and provide solutions to most any challenge I encounter Having worked in IT all of my adult life, my experience in IT Operations and Engineering is extensive. \n \nMy technical experience ranges from entry level PC support to 3rd level global WAN engineering/support for over 100,000 employees. I have contributed at all functional levels from consultant through corporate management. \n \nI have worked with all sizes of organizations from the very small local office to very large global organizations. I have worked in technology companies as well as several other types of businesses. \n \nI have been exposed to a wide array of corporate cultures and team environments including strong national and international experience.  \n \nI’m currently focusing on IT Operations management covering a broad range of technologies used throughout California as well as other areas in US. \n \nSpecialties:  \n \n- Able to effectively and easily communicate with all levels of technology professionals through senior level business leaders \n \n- IT management and team leadership \n \n- Project and department budgeting \n \n- Network infrastructure design and support focusing on Cisco solutions \n \n- Information Security \n \n- Data center design and support \n \n- Acquisition integration  \n \n- Able to learn and provide solutions to most any challenge I encounter Experience Director, IT Network and Infrastructure California Dental Association February 2004  – Present (11 years 7 months) Responsible for managing the IT Operations team. This team provides all design, maintenance, and support for the entire IT infrastructure including the building-specific network infrastructure, the data center, telecommunications (VoIP and cellular), security, and audiovisual environments as well as general help desk tasks. Responsibilities also include forecasting and maintenance of the capital and operating IT budget.  \n \nThe California Dental Association is a diverse organization that includes an insurance company, an insurance brokerage, a philanthropic foundation, and a property management company for the CDA-owned high-rise in downtown Sacramento. \n \nMy team and I have: \n• Relocated a data center of more than 150 servers without production downtime for our users. \n• Upgraded our core networking technologies to support newer technologies. \n• Migrated an antiquated phone system to a state-of-the-art VoIP system, including three call centers. \n• Enabled the organization to reduce travel expenses by implementing virtual meeting solutions. \n• Significantly reduced costs and added features for our annual meetings by taking ownership of the technology in use. \n• Reduced technology-related costs by renegotiating maintenance and service contracts, migrating from older technology, enabling virtualization, enhancing remote access, and providing a mechanism for the re-sale of our retired equipment. \n• Designed a comprehensive disaster recovery solution to support the organization’s business continuity plan. Network and Security Consultant Pilkington Consulting August 2002  –  August 2006  (4 years 1 month) Provide support to multiple small companies to include infrastructure, security and remote connectivity support. Senior Network Engineer - Global Engineering - WAN Transport Intel Corporation May 2000  –  April 2003  (3 years) Responsible for the integration and security of new acquisitions and new sites globally. Requirements range from initial (first day) connectivity to the design for the final network connectivity with little or no downtime for either company. Also functioned in the capacity of third level support engineer for enterprise WAN switching and routing. Senior Network Engineer Intel Corporation November 1996  –  April 2003  (6 years 6 months) Working as a Senior Network Engineer in a diverse environment involving LAN and WAN design implementation and third level support ranging from a single small local site to the global enterprise focusing on acquisition integration. Senior Network Engineer - Aquisition Integration Specialist Intel Corporation April 1998  –  May 2000  (2 years 2 months) Working in a team environment, responsible for planning, coordinating and installing networking technology for all acquisitions globally. This position required heavy domestic and foreign travel. My focus was network infrastructure using Cisco hardware however, the entire team functioned in all areas of IT during these projects. Senior Network Engineer - Folsom Site IT Support Intel Corporation November 1996  –  April 1998  (1 year 6 months) Responsible for network design, implementation and support for the Folsom Campus consisting of over 180 multi-protocol subnets and more than 5000 users in a campus setting of 6 inter-connected buildings and multiple enterprise class data centers. Network Manager California Dental Association July 1989  –  November 1996  (7 years 5 months) I was originally hired as the PC Coordinator reporting to the CFO. The 200 employee organization had only two PCs and used mostly midrange terminals, IBM Displaywriters and typewriters.  \n \nIn just over seven years, my title changed several times and I enjoyed many technical challenges and successes which are highlighted below: \n \n- Replaced all terminals, Displaywriters and typewriters with over 250 PCs \n \n- Designed, authored and supported the first computer registration system (Sess) for CDA Scientific Sessions which hosted more than 20,000 attendees – twice every year. This system which, replaced a manual typewriter registration system, became the foundation for registration systems used over the next few decades \n \n- Designed, authored and supported several other specialty applications which were used in the organization over several years \n \n- Relocated the organization from an old 4 story building to a new 19 story high-rise building including the design and implementation of the first CDA datacenter \n \n- Designed and installed the first organization wide network with connectivity to two satellite claims offices \n \n- Added the midrange system to the network and beta tested several systems to integrate the AS/400 into the networked environment \n \n- Introduced the Internet and Email to CDA for the first time, registered the first domain name (cda.org), installed the first Internet circuit and installed the first email system \n \n- Created, filled and managed 3 support technician positions and created a helpdesk system to better support staff’s needs \n \n- Selected, installed and supported the first imaging system (which is still in use) \n \n- Designed and authored a set of data conversion tools to extract IBM EBCDIC/ZDFdata from the midrange finance system, convert it to native data formats for Platinum and import (and balance) 5 years of data into the newly selected Platinum finance package. This saved months of time for the finance system consultant’s implementation schedule Systems Manager System Integrators Inc. March 1988  –  July 1989  (1 year 5 months) Responsible for the maintenance and operation of multiple Tandem based systems linked to hundreds of other Tandem systems worldwide via satellite computer network. Duties included system configuration, hardware/software conversions, backups and troubleshooting. EDP Supervisor Price Company July 1984  –  March 1988  (3 years 9 months) Supervised EDP operators. Responsible for the daily maintenance and operation of data processing equipment as well as employee scheduling and training. Other responsibilities included training other EDP supervisors statewide. Coordinated data center relocations while supervising operators and normal operations at both locations. Computer Consultant Pilkington Professional Services April 1982  –  August 1984  (2 years 5 months) Provide computer hardware and software support and maintenance as well as application development focusing mostly in the legal and real estate communities. Director, IT Network and Infrastructure California Dental Association February 2004  – Present (11 years 7 months) Responsible for managing the IT Operations team. This team provides all design, maintenance, and support for the entire IT infrastructure including the building-specific network infrastructure, the data center, telecommunications (VoIP and cellular), security, and audiovisual environments as well as general help desk tasks. Responsibilities also include forecasting and maintenance of the capital and operating IT budget.  \n \nThe California Dental Association is a diverse organization that includes an insurance company, an insurance brokerage, a philanthropic foundation, and a property management company for the CDA-owned high-rise in downtown Sacramento. \n \nMy team and I have: \n• Relocated a data center of more than 150 servers without production downtime for our users. \n• Upgraded our core networking technologies to support newer technologies. \n• Migrated an antiquated phone system to a state-of-the-art VoIP system, including three call centers. \n• Enabled the organization to reduce travel expenses by implementing virtual meeting solutions. \n• Significantly reduced costs and added features for our annual meetings by taking ownership of the technology in use. \n• Reduced technology-related costs by renegotiating maintenance and service contracts, migrating from older technology, enabling virtualization, enhancing remote access, and providing a mechanism for the re-sale of our retired equipment. \n• Designed a comprehensive disaster recovery solution to support the organization’s business continuity plan. Director, IT Network and Infrastructure California Dental Association February 2004  – Present (11 years 7 months) Responsible for managing the IT Operations team. This team provides all design, maintenance, and support for the entire IT infrastructure including the building-specific network infrastructure, the data center, telecommunications (VoIP and cellular), security, and audiovisual environments as well as general help desk tasks. Responsibilities also include forecasting and maintenance of the capital and operating IT budget.  \n \nThe California Dental Association is a diverse organization that includes an insurance company, an insurance brokerage, a philanthropic foundation, and a property management company for the CDA-owned high-rise in downtown Sacramento. \n \nMy team and I have: \n• Relocated a data center of more than 150 servers without production downtime for our users. \n• Upgraded our core networking technologies to support newer technologies. \n• Migrated an antiquated phone system to a state-of-the-art VoIP system, including three call centers. \n• Enabled the organization to reduce travel expenses by implementing virtual meeting solutions. \n• Significantly reduced costs and added features for our annual meetings by taking ownership of the technology in use. \n• Reduced technology-related costs by renegotiating maintenance and service contracts, migrating from older technology, enabling virtualization, enhancing remote access, and providing a mechanism for the re-sale of our retired equipment. \n• Designed a comprehensive disaster recovery solution to support the organization’s business continuity plan. Network and Security Consultant Pilkington Consulting August 2002  –  August 2006  (4 years 1 month) Provide support to multiple small companies to include infrastructure, security and remote connectivity support. Network and Security Consultant Pilkington Consulting August 2002  –  August 2006  (4 years 1 month) Provide support to multiple small companies to include infrastructure, security and remote connectivity support. Senior Network Engineer - Global Engineering - WAN Transport Intel Corporation May 2000  –  April 2003  (3 years) Responsible for the integration and security of new acquisitions and new sites globally. Requirements range from initial (first day) connectivity to the design for the final network connectivity with little or no downtime for either company. Also functioned in the capacity of third level support engineer for enterprise WAN switching and routing. Senior Network Engineer - Global Engineering - WAN Transport Intel Corporation May 2000  –  April 2003  (3 years) Responsible for the integration and security of new acquisitions and new sites globally. Requirements range from initial (first day) connectivity to the design for the final network connectivity with little or no downtime for either company. Also functioned in the capacity of third level support engineer for enterprise WAN switching and routing. Senior Network Engineer Intel Corporation November 1996  –  April 2003  (6 years 6 months) Working as a Senior Network Engineer in a diverse environment involving LAN and WAN design implementation and third level support ranging from a single small local site to the global enterprise focusing on acquisition integration. Senior Network Engineer Intel Corporation November 1996  –  April 2003  (6 years 6 months) Working as a Senior Network Engineer in a diverse environment involving LAN and WAN design implementation and third level support ranging from a single small local site to the global enterprise focusing on acquisition integration. Senior Network Engineer - Aquisition Integration Specialist Intel Corporation April 1998  –  May 2000  (2 years 2 months) Working in a team environment, responsible for planning, coordinating and installing networking technology for all acquisitions globally. This position required heavy domestic and foreign travel. My focus was network infrastructure using Cisco hardware however, the entire team functioned in all areas of IT during these projects. Senior Network Engineer - Aquisition Integration Specialist Intel Corporation April 1998  –  May 2000  (2 years 2 months) Working in a team environment, responsible for planning, coordinating and installing networking technology for all acquisitions globally. This position required heavy domestic and foreign travel. My focus was network infrastructure using Cisco hardware however, the entire team functioned in all areas of IT during these projects. Senior Network Engineer - Folsom Site IT Support Intel Corporation November 1996  –  April 1998  (1 year 6 months) Responsible for network design, implementation and support for the Folsom Campus consisting of over 180 multi-protocol subnets and more than 5000 users in a campus setting of 6 inter-connected buildings and multiple enterprise class data centers. Senior Network Engineer - Folsom Site IT Support Intel Corporation November 1996  –  April 1998  (1 year 6 months) Responsible for network design, implementation and support for the Folsom Campus consisting of over 180 multi-protocol subnets and more than 5000 users in a campus setting of 6 inter-connected buildings and multiple enterprise class data centers. Network Manager California Dental Association July 1989  –  November 1996  (7 years 5 months) I was originally hired as the PC Coordinator reporting to the CFO. The 200 employee organization had only two PCs and used mostly midrange terminals, IBM Displaywriters and typewriters.  \n \nIn just over seven years, my title changed several times and I enjoyed many technical challenges and successes which are highlighted below: \n \n- Replaced all terminals, Displaywriters and typewriters with over 250 PCs \n \n- Designed, authored and supported the first computer registration system (Sess) for CDA Scientific Sessions which hosted more than 20,000 attendees – twice every year. This system which, replaced a manual typewriter registration system, became the foundation for registration systems used over the next few decades \n \n- Designed, authored and supported several other specialty applications which were used in the organization over several years \n \n- Relocated the organization from an old 4 story building to a new 19 story high-rise building including the design and implementation of the first CDA datacenter \n \n- Designed and installed the first organization wide network with connectivity to two satellite claims offices \n \n- Added the midrange system to the network and beta tested several systems to integrate the AS/400 into the networked environment \n \n- Introduced the Internet and Email to CDA for the first time, registered the first domain name (cda.org), installed the first Internet circuit and installed the first email system \n \n- Created, filled and managed 3 support technician positions and created a helpdesk system to better support staff’s needs \n \n- Selected, installed and supported the first imaging system (which is still in use) \n \n- Designed and authored a set of data conversion tools to extract IBM EBCDIC/ZDFdata from the midrange finance system, convert it to native data formats for Platinum and import (and balance) 5 years of data into the newly selected Platinum finance package. This saved months of time for the finance system consultant’s implementation schedule Network Manager California Dental Association July 1989  –  November 1996  (7 years 5 months) I was originally hired as the PC Coordinator reporting to the CFO. The 200 employee organization had only two PCs and used mostly midrange terminals, IBM Displaywriters and typewriters.  \n \nIn just over seven years, my title changed several times and I enjoyed many technical challenges and successes which are highlighted below: \n \n- Replaced all terminals, Displaywriters and typewriters with over 250 PCs \n \n- Designed, authored and supported the first computer registration system (Sess) for CDA Scientific Sessions which hosted more than 20,000 attendees – twice every year. This system which, replaced a manual typewriter registration system, became the foundation for registration systems used over the next few decades \n \n- Designed, authored and supported several other specialty applications which were used in the organization over several years \n \n- Relocated the organization from an old 4 story building to a new 19 story high-rise building including the design and implementation of the first CDA datacenter \n \n- Designed and installed the first organization wide network with connectivity to two satellite claims offices \n \n- Added the midrange system to the network and beta tested several systems to integrate the AS/400 into the networked environment \n \n- Introduced the Internet and Email to CDA for the first time, registered the first domain name (cda.org), installed the first Internet circuit and installed the first email system \n \n- Created, filled and managed 3 support technician positions and created a helpdesk system to better support staff’s needs \n \n- Selected, installed and supported the first imaging system (which is still in use) \n \n- Designed and authored a set of data conversion tools to extract IBM EBCDIC/ZDFdata from the midrange finance system, convert it to native data formats for Platinum and import (and balance) 5 years of data into the newly selected Platinum finance package. This saved months of time for the finance system consultant’s implementation schedule Systems Manager System Integrators Inc. March 1988  –  July 1989  (1 year 5 months) Responsible for the maintenance and operation of multiple Tandem based systems linked to hundreds of other Tandem systems worldwide via satellite computer network. Duties included system configuration, hardware/software conversions, backups and troubleshooting. Systems Manager System Integrators Inc. March 1988  –  July 1989  (1 year 5 months) Responsible for the maintenance and operation of multiple Tandem based systems linked to hundreds of other Tandem systems worldwide via satellite computer network. Duties included system configuration, hardware/software conversions, backups and troubleshooting. EDP Supervisor Price Company July 1984  –  March 1988  (3 years 9 months) Supervised EDP operators. Responsible for the daily maintenance and operation of data processing equipment as well as employee scheduling and training. Other responsibilities included training other EDP supervisors statewide. Coordinated data center relocations while supervising operators and normal operations at both locations. EDP Supervisor Price Company July 1984  –  March 1988  (3 years 9 months) Supervised EDP operators. Responsible for the daily maintenance and operation of data processing equipment as well as employee scheduling and training. Other responsibilities included training other EDP supervisors statewide. Coordinated data center relocations while supervising operators and normal operations at both locations. Computer Consultant Pilkington Professional Services April 1982  –  August 1984  (2 years 5 months) Provide computer hardware and software support and maintenance as well as application development focusing mostly in the legal and real estate communities. Computer Consultant Pilkington Professional Services April 1982  –  August 1984  (2 years 5 months) Provide computer hardware and software support and maintenance as well as application development focusing mostly in the legal and real estate communities. Skills Information Technology Information Security Network Security Acquisition Integration IT Infrastructure... Data Center Disaster Recovery Network Architecture Security Project Management Network Engineering Business Continuity Cisco Technologies Infrastructure Non-profits Fundraising Vendor Management IT Strategy IT Operations Management Strategic Planning Team Building Capital Budgeting Operating Budgets Staff Management Event Planning Event Management Cisco Firewall Security Firewalls Cisco Routers Nonprofits Troubleshooting Networking Integration Network Administration WAN Technical Support Network Design VoIP IT Operations Telecommunications Routing Management Enterprise Software Software Installation DNS IT Management See 31+     See less Skills  Information Technology Information Security Network Security Acquisition Integration IT Infrastructure... Data Center Disaster Recovery Network Architecture Security Project Management Network Engineering Business Continuity Cisco Technologies Infrastructure Non-profits Fundraising Vendor Management IT Strategy IT Operations Management Strategic Planning Team Building Capital Budgeting Operating Budgets Staff Management Event Planning Event Management Cisco Firewall Security Firewalls Cisco Routers Nonprofits Troubleshooting Networking Integration Network Administration WAN Technical Support Network Design VoIP IT Operations Telecommunications Routing Management Enterprise Software Software Installation DNS IT Management See 31+     See less Information Technology Information Security Network Security Acquisition Integration IT Infrastructure... Data Center Disaster Recovery Network Architecture Security Project Management Network Engineering Business Continuity Cisco Technologies Infrastructure Non-profits Fundraising Vendor Management IT Strategy IT Operations Management Strategic Planning Team Building Capital Budgeting Operating Budgets Staff Management Event Planning Event Management Cisco Firewall Security Firewalls Cisco Routers Nonprofits Troubleshooting Networking Integration Network Administration WAN Technical Support Network Design VoIP IT Operations Telecommunications Routing Management Enterprise Software Software Installation DNS IT Management See 31+     See less Information Technology Information Security Network Security Acquisition Integration IT Infrastructure... Data Center Disaster Recovery Network Architecture Security Project Management Network Engineering Business Continuity Cisco Technologies Infrastructure Non-profits Fundraising Vendor Management IT Strategy IT Operations Management Strategic Planning Team Building Capital Budgeting Operating Budgets Staff Management Event Planning Event Management Cisco Firewall Security Firewalls Cisco Routers Nonprofits Troubleshooting Networking Integration Network Administration WAN Technical Support Network Design VoIP IT Operations Telecommunications Routing Management Enterprise Software Software Installation DNS IT Management See 31+     See less Education Del Campo Del Campo Del Campo Del Campo Honors & Awards Additional Honors & Awards Cisco Certified Design Professional (CCDP)\t10/02 \nCisco Certified Design Associate (CCDA)\t10/02 \nCisco Certified Network Professional (CCNP) 7/02 \nCisco Certified Network Associate (CCNA) 5/00 \nNovell Certified Netware Engineer (CNE)\t3/94 Additional Honors & Awards Cisco Certified Design Professional (CCDP)\t10/02 \nCisco Certified Design Associate (CCDA)\t10/02 \nCisco Certified Network Professional (CCNP) 7/02 \nCisco Certified Network Associate (CCNA) 5/00 \nNovell Certified Netware Engineer (CNE)\t3/94 Additional Honors & Awards Cisco Certified Design Professional (CCDP)\t10/02 \nCisco Certified Design Associate (CCDA)\t10/02 \nCisco Certified Network Professional (CCNP) 7/02 \nCisco Certified Network Associate (CCNA) 5/00 \nNovell Certified Netware Engineer (CNE)\t3/94 Additional Honors & Awards Cisco Certified Design Professional (CCDP)\t10/02 \nCisco Certified Design Associate (CCDA)\t10/02 \nCisco Certified Network Professional (CCNP) 7/02 \nCisco Certified Network Associate (CCNA) 5/00 \nNovell Certified Netware Engineer (CNE)\t3/94 ", "Summary Accomplished Network and Systems Engineer with a successful track record of over 20 years in wired and wireless networking strategic planning, design, installation, technical support, and presales support. Extensive training and Certifications in systems, security and infrastructure. Experienced in customer facing activities at the CxO and technical lead levels. \n \nSpecialties: Strategic planning, design and tactical activities \nCustomer interface at technical and CxO levels \nCustomer facing presentation and training \nNetwork design - Data Center core to access layer. \nClient device implementation - mobile applications, UI, device drivers, etc. \nSecurity, QoS, and VoIP \nWireless Technologies design and support \n- Enterprise WiFi \n- Meshed WiFi \n- UWB, Sensor Nets, ZigBee, etc. \n- 4G (RAN, backhaul, and infrastructure) \n- WiGig Summary Accomplished Network and Systems Engineer with a successful track record of over 20 years in wired and wireless networking strategic planning, design, installation, technical support, and presales support. Extensive training and Certifications in systems, security and infrastructure. Experienced in customer facing activities at the CxO and technical lead levels. \n \nSpecialties: Strategic planning, design and tactical activities \nCustomer interface at technical and CxO levels \nCustomer facing presentation and training \nNetwork design - Data Center core to access layer. \nClient device implementation - mobile applications, UI, device drivers, etc. \nSecurity, QoS, and VoIP \nWireless Technologies design and support \n- Enterprise WiFi \n- Meshed WiFi \n- UWB, Sensor Nets, ZigBee, etc. \n- 4G (RAN, backhaul, and infrastructure) \n- WiGig Accomplished Network and Systems Engineer with a successful track record of over 20 years in wired and wireless networking strategic planning, design, installation, technical support, and presales support. Extensive training and Certifications in systems, security and infrastructure. Experienced in customer facing activities at the CxO and technical lead levels. \n \nSpecialties: Strategic planning, design and tactical activities \nCustomer interface at technical and CxO levels \nCustomer facing presentation and training \nNetwork design - Data Center core to access layer. \nClient device implementation - mobile applications, UI, device drivers, etc. \nSecurity, QoS, and VoIP \nWireless Technologies design and support \n- Enterprise WiFi \n- Meshed WiFi \n- UWB, Sensor Nets, ZigBee, etc. \n- 4G (RAN, backhaul, and infrastructure) \n- WiGig Accomplished Network and Systems Engineer with a successful track record of over 20 years in wired and wireless networking strategic planning, design, installation, technical support, and presales support. Extensive training and Certifications in systems, security and infrastructure. Experienced in customer facing activities at the CxO and technical lead levels. \n \nSpecialties: Strategic planning, design and tactical activities \nCustomer interface at technical and CxO levels \nCustomer facing presentation and training \nNetwork design - Data Center core to access layer. \nClient device implementation - mobile applications, UI, device drivers, etc. \nSecurity, QoS, and VoIP \nWireless Technologies design and support \n- Enterprise WiFi \n- Meshed WiFi \n- UWB, Sensor Nets, ZigBee, etc. \n- 4G (RAN, backhaul, and infrastructure) \n- WiGig Experience Sr. Wireless Network Engineer Intel Corporation 2010  – Present (5 years) San Diego Vince is responsible for supporting Intel’s OEM/ODM customers in their pre- and post-design win efforts for module integration of Intel's mobile WiFi/BT/WiGig/4G products. Senior Network Engineer Intel Corporation 2008  –  2010  (2 years) Vince is responsible for supporting Intel’s OEM customers in their pre- and post-design win efforts for module integration of Intel's mobile 4G products as well as working directly with 4G Operators to drive OEM requirements into their organizations, services and offerings. Sr. Consulting Network Engineer Intel Solution Services 2005  –  2008  (3 years) Vince’s responsibilities encompass the planning, designing, development and deployment of enterprise solutions based on Intel Architecture at ISS’ customers – with a focus on wireless technologies (4G, WiFi). Vince takes a lead role in negotiations with customers and is responsible for instilling customer confidence in proposed Intel Wireless Architecture solutions. Vince is also responsible for developing and delivering presentations to customers, outlining findings and strategic recommendations to guide the design, implementation, and management of solutions. Vince serves as both a process facilitator and solution implementer. Network Engineer & Consultant Intel Corporation June 2000  –  2005  (5 years) Vince was an early member of the engineering and product development team formed in San Diego in 2000 to launch Intel into the WiFi/802.11 arena. The group led early with retail client and access point products, then activities morphed into the first Centrino notebook platform and early WiMAX/802.16 activities. Vince acted as a liaison, consultant, and technical support point for OEM and enterprise customers, as well as supporting groups internal to Intel. \n \nVince provided customer perspective strategic input to the MRD/PRD process. As a active member of PDTs Vince contributed to the delivery of many Intel products. Once in production Vince provided product strategic implementation consulting, tactical technical support, and training to customers. Vince’s impact in the product life cycle extended from early definition stages to end of life and beyond. Computer Information Systems Architect CTI Services (VAR) 1985  –  2000  (15 years) Principle architect for SMB and Enterprise clients with responsibilities for presales consulting, systems analysis, design, installation, and support of Novell, Unix, and Microsoft computer networks. Sr. Field Engineer Storage Technology (StorageTek) 1983  –  1985  (2 years) IBM Mainframe Environment Systems Support Field Engineer Telex Computer Corporation 1979  –  1983  (4 years) IBM Mainframe Support and Services Sr. Wireless Network Engineer Intel Corporation 2010  – Present (5 years) San Diego Vince is responsible for supporting Intel’s OEM/ODM customers in their pre- and post-design win efforts for module integration of Intel's mobile WiFi/BT/WiGig/4G products. Sr. Wireless Network Engineer Intel Corporation 2010  – Present (5 years) San Diego Vince is responsible for supporting Intel’s OEM/ODM customers in their pre- and post-design win efforts for module integration of Intel's mobile WiFi/BT/WiGig/4G products. Senior Network Engineer Intel Corporation 2008  –  2010  (2 years) Vince is responsible for supporting Intel’s OEM customers in their pre- and post-design win efforts for module integration of Intel's mobile 4G products as well as working directly with 4G Operators to drive OEM requirements into their organizations, services and offerings. Senior Network Engineer Intel Corporation 2008  –  2010  (2 years) Vince is responsible for supporting Intel’s OEM customers in their pre- and post-design win efforts for module integration of Intel's mobile 4G products as well as working directly with 4G Operators to drive OEM requirements into their organizations, services and offerings. Sr. Consulting Network Engineer Intel Solution Services 2005  –  2008  (3 years) Vince’s responsibilities encompass the planning, designing, development and deployment of enterprise solutions based on Intel Architecture at ISS’ customers – with a focus on wireless technologies (4G, WiFi). Vince takes a lead role in negotiations with customers and is responsible for instilling customer confidence in proposed Intel Wireless Architecture solutions. Vince is also responsible for developing and delivering presentations to customers, outlining findings and strategic recommendations to guide the design, implementation, and management of solutions. Vince serves as both a process facilitator and solution implementer. Sr. Consulting Network Engineer Intel Solution Services 2005  –  2008  (3 years) Vince’s responsibilities encompass the planning, designing, development and deployment of enterprise solutions based on Intel Architecture at ISS’ customers – with a focus on wireless technologies (4G, WiFi). Vince takes a lead role in negotiations with customers and is responsible for instilling customer confidence in proposed Intel Wireless Architecture solutions. Vince is also responsible for developing and delivering presentations to customers, outlining findings and strategic recommendations to guide the design, implementation, and management of solutions. Vince serves as both a process facilitator and solution implementer. Network Engineer & Consultant Intel Corporation June 2000  –  2005  (5 years) Vince was an early member of the engineering and product development team formed in San Diego in 2000 to launch Intel into the WiFi/802.11 arena. The group led early with retail client and access point products, then activities morphed into the first Centrino notebook platform and early WiMAX/802.16 activities. Vince acted as a liaison, consultant, and technical support point for OEM and enterprise customers, as well as supporting groups internal to Intel. \n \nVince provided customer perspective strategic input to the MRD/PRD process. As a active member of PDTs Vince contributed to the delivery of many Intel products. Once in production Vince provided product strategic implementation consulting, tactical technical support, and training to customers. Vince’s impact in the product life cycle extended from early definition stages to end of life and beyond. Network Engineer & Consultant Intel Corporation June 2000  –  2005  (5 years) Vince was an early member of the engineering and product development team formed in San Diego in 2000 to launch Intel into the WiFi/802.11 arena. The group led early with retail client and access point products, then activities morphed into the first Centrino notebook platform and early WiMAX/802.16 activities. Vince acted as a liaison, consultant, and technical support point for OEM and enterprise customers, as well as supporting groups internal to Intel. \n \nVince provided customer perspective strategic input to the MRD/PRD process. As a active member of PDTs Vince contributed to the delivery of many Intel products. Once in production Vince provided product strategic implementation consulting, tactical technical support, and training to customers. Vince’s impact in the product life cycle extended from early definition stages to end of life and beyond. Computer Information Systems Architect CTI Services (VAR) 1985  –  2000  (15 years) Principle architect for SMB and Enterprise clients with responsibilities for presales consulting, systems analysis, design, installation, and support of Novell, Unix, and Microsoft computer networks. Computer Information Systems Architect CTI Services (VAR) 1985  –  2000  (15 years) Principle architect for SMB and Enterprise clients with responsibilities for presales consulting, systems analysis, design, installation, and support of Novell, Unix, and Microsoft computer networks. Sr. Field Engineer Storage Technology (StorageTek) 1983  –  1985  (2 years) IBM Mainframe Environment Systems Support Sr. Field Engineer Storage Technology (StorageTek) 1983  –  1985  (2 years) IBM Mainframe Environment Systems Support Field Engineer Telex Computer Corporation 1979  –  1983  (4 years) IBM Mainframe Support and Services Field Engineer Telex Computer Corporation 1979  –  1983  (4 years) IBM Mainframe Support and Services Skills VoIP Network Design Security Device Drivers Infrastructure Strategic Planning Mobile Applications ZigBee User Interface Backhaul UWB Wireless Networking WiFi WLAN Intel Data Center Wireless See 2+     See less Skills  VoIP Network Design Security Device Drivers Infrastructure Strategic Planning Mobile Applications ZigBee User Interface Backhaul UWB Wireless Networking WiFi WLAN Intel Data Center Wireless See 2+     See less VoIP Network Design Security Device Drivers Infrastructure Strategic Planning Mobile Applications ZigBee User Interface Backhaul UWB Wireless Networking WiFi WLAN Intel Data Center Wireless See 2+     See less VoIP Network Design Security Device Drivers Infrastructure Strategic Planning Mobile Applications ZigBee User Interface Backhaul UWB Wireless Networking WiFi WLAN Intel Data Center Wireless See 2+     See less Education 1) Ball State University General Academic Studies 2) University of California, San Diego Communications Engineering 3) Tulane University - Freeman School of Business MBA Certificate Program 4) Vendor Training Cisco, Microsoft, Intel, Motorola, Tropos, Redline, and others... 5) Industry Certifications & Training Computer Systems and Networking CISSP - Certified Information Systems Security Professional \nWiMAX Forum RF Network Engineer \nWiMAX Forum Network Associate \nMCSE - Microsoft Certified System Engineer \nMCT - Microsoft Certified Trainer \nCCNA - Cisco Certified Network Associate \nCCDA - Cisco Certified Design Associate \nCCNP - Cisco Certified Network Professional \nCCDP - Cisco Certified Network Design Professional \nCWNA - Certified Wireless Network Admin \nCWAP - Certified Wireless Analysis Professional \nCQS/WLAN - Cisco Qualified Specialist / WLAN Support \nCQS/WLAN - Cisco Qualified Specialist / WLAN Design \nSecurity +\tComptia Security Plus Certified \nNetwork +\tComptia Network Plus Certified \nLinux +\tComptia Linux Plus Certified \nIntel Wireless Network Professional \nTropos - Mesh Networking Design Associate 1) Ball State University General Academic Studies 1) Ball State University General Academic Studies 1) Ball State University General Academic Studies 2) University of California, San Diego Communications Engineering 2) University of California, San Diego Communications Engineering 2) University of California, San Diego Communications Engineering 3) Tulane University - Freeman School of Business MBA Certificate Program 3) Tulane University - Freeman School of Business MBA Certificate Program 3) Tulane University - Freeman School of Business MBA Certificate Program 4) Vendor Training Cisco, Microsoft, Intel, Motorola, Tropos, Redline, and others... 4) Vendor Training Cisco, Microsoft, Intel, Motorola, Tropos, Redline, and others... 4) Vendor Training Cisco, Microsoft, Intel, Motorola, Tropos, Redline, and others... 5) Industry Certifications & Training Computer Systems and Networking CISSP - Certified Information Systems Security Professional \nWiMAX Forum RF Network Engineer \nWiMAX Forum Network Associate \nMCSE - Microsoft Certified System Engineer \nMCT - Microsoft Certified Trainer \nCCNA - Cisco Certified Network Associate \nCCDA - Cisco Certified Design Associate \nCCNP - Cisco Certified Network Professional \nCCDP - Cisco Certified Network Design Professional \nCWNA - Certified Wireless Network Admin \nCWAP - Certified Wireless Analysis Professional \nCQS/WLAN - Cisco Qualified Specialist / WLAN Support \nCQS/WLAN - Cisco Qualified Specialist / WLAN Design \nSecurity +\tComptia Security Plus Certified \nNetwork +\tComptia Network Plus Certified \nLinux +\tComptia Linux Plus Certified \nIntel Wireless Network Professional \nTropos - Mesh Networking Design Associate 5) Industry Certifications & Training Computer Systems and Networking CISSP - Certified Information Systems Security Professional \nWiMAX Forum RF Network Engineer \nWiMAX Forum Network Associate \nMCSE - Microsoft Certified System Engineer \nMCT - Microsoft Certified Trainer \nCCNA - Cisco Certified Network Associate \nCCDA - Cisco Certified Design Associate \nCCNP - Cisco Certified Network Professional \nCCDP - Cisco Certified Network Design Professional \nCWNA - Certified Wireless Network Admin \nCWAP - Certified Wireless Analysis Professional \nCQS/WLAN - Cisco Qualified Specialist / WLAN Support \nCQS/WLAN - Cisco Qualified Specialist / WLAN Design \nSecurity +\tComptia Security Plus Certified \nNetwork +\tComptia Network Plus Certified \nLinux +\tComptia Linux Plus Certified \nIntel Wireless Network Professional \nTropos - Mesh Networking Design Associate 5) Industry Certifications & Training Computer Systems and Networking CISSP - Certified Information Systems Security Professional \nWiMAX Forum RF Network Engineer \nWiMAX Forum Network Associate \nMCSE - Microsoft Certified System Engineer \nMCT - Microsoft Certified Trainer \nCCNA - Cisco Certified Network Associate \nCCDA - Cisco Certified Design Associate \nCCNP - Cisco Certified Network Professional \nCCDP - Cisco Certified Network Design Professional \nCWNA - Certified Wireless Network Admin \nCWAP - Certified Wireless Analysis Professional \nCQS/WLAN - Cisco Qualified Specialist / WLAN Support \nCQS/WLAN - Cisco Qualified Specialist / WLAN Design \nSecurity +\tComptia Security Plus Certified \nNetwork +\tComptia Network Plus Certified \nLinux +\tComptia Linux Plus Certified \nIntel Wireless Network Professional \nTropos - Mesh Networking Design Associate ", "Summary 6 years of experience in software engineering, unit testing, system integration, deployment and program/project management \n \nSubject Knowledge: \nNetwork programming, software unit test, system integration & deployment, web development, \nJave, C/C++ Summary 6 years of experience in software engineering, unit testing, system integration, deployment and program/project management \n \nSubject Knowledge: \nNetwork programming, software unit test, system integration & deployment, web development, \nJave, C/C++ 6 years of experience in software engineering, unit testing, system integration, deployment and program/project management \n \nSubject Knowledge: \nNetwork programming, software unit test, system integration & deployment, web development, \nJave, C/C++ 6 years of experience in software engineering, unit testing, system integration, deployment and program/project management \n \nSubject Knowledge: \nNetwork programming, software unit test, system integration & deployment, web development, \nJave, C/C++ Experience Program Administrator NAAC 2008  –  2014  (6 years) San Diego, CA Program administrator for the Keep Your Home California Program & HOPE Loan Port portal \nManaged the organization's Credit Counseling Program \nConducted workshops for internal and external clients \nWrote work plans to implement fraud & identity thief policies \nManaged the company's telephony & networking infrastructure Fundraising Manager Santa Barbara Civic Development Foundation Group 2003  –  2009  (6 years) Founding member of a non-profit organization focused on building a sports facility in the Philippines. \nManage organization's finances and fundraising operation Senior Software Developer - Contract Accelrys Inc February 2002  –  November 2002  (10 months) Developed and deployed distributed computing platform to process bio-informatics solutions \nCompiled and integrated open-source software library on Linux platform \nPorted software from SGI to AIX platform Senior Network Engineer Intel Corporation 2000  –  2001  (1 year) San Diego, CA Designed, developed, and integrated software programs for the server-load balancing and SSL-accelrator appliance \nWrote software to configure system firewall on network appliance \nWrote software to configure SSL revocation list and SSH configuration Senior Software Engineer / Product Manager ESSCOR 1997  –  January 2000  (3 years) Solana Beach, CA Managed the company's modeling and simulation back-end platform for command-and-control system. \nPorted modeling software from the x86 architecture to the SUN Sparc platform \nWrote, integrated, and deployed command-and-control software and hardware platform Software Engineer Northrop Grumman Corporation (Formerly TRW Avionics & Systems Division) 1996  –  1997  (1 year) San Diego, CA Developed, tested, maintained and integrated SEI Level III-conforming embedded software application for the Communication, Navigation, and Identification (CNI) for the F-22 project. Technical Support Engineer AT&T Global Information Systems 1994  –  1996  (2 years) Provided technical support for the company's massively parallel database platform. Technical support provided includes networking support, UNIX system administration, database configuration, field support deployment, hardware and software upgrade. Program Administrator NAAC 2008  –  2014  (6 years) San Diego, CA Program administrator for the Keep Your Home California Program & HOPE Loan Port portal \nManaged the organization's Credit Counseling Program \nConducted workshops for internal and external clients \nWrote work plans to implement fraud & identity thief policies \nManaged the company's telephony & networking infrastructure Program Administrator NAAC 2008  –  2014  (6 years) San Diego, CA Program administrator for the Keep Your Home California Program & HOPE Loan Port portal \nManaged the organization's Credit Counseling Program \nConducted workshops for internal and external clients \nWrote work plans to implement fraud & identity thief policies \nManaged the company's telephony & networking infrastructure Fundraising Manager Santa Barbara Civic Development Foundation Group 2003  –  2009  (6 years) Founding member of a non-profit organization focused on building a sports facility in the Philippines. \nManage organization's finances and fundraising operation Fundraising Manager Santa Barbara Civic Development Foundation Group 2003  –  2009  (6 years) Founding member of a non-profit organization focused on building a sports facility in the Philippines. \nManage organization's finances and fundraising operation Senior Software Developer - Contract Accelrys Inc February 2002  –  November 2002  (10 months) Developed and deployed distributed computing platform to process bio-informatics solutions \nCompiled and integrated open-source software library on Linux platform \nPorted software from SGI to AIX platform Senior Software Developer - Contract Accelrys Inc February 2002  –  November 2002  (10 months) Developed and deployed distributed computing platform to process bio-informatics solutions \nCompiled and integrated open-source software library on Linux platform \nPorted software from SGI to AIX platform Senior Network Engineer Intel Corporation 2000  –  2001  (1 year) San Diego, CA Designed, developed, and integrated software programs for the server-load balancing and SSL-accelrator appliance \nWrote software to configure system firewall on network appliance \nWrote software to configure SSL revocation list and SSH configuration Senior Network Engineer Intel Corporation 2000  –  2001  (1 year) San Diego, CA Designed, developed, and integrated software programs for the server-load balancing and SSL-accelrator appliance \nWrote software to configure system firewall on network appliance \nWrote software to configure SSL revocation list and SSH configuration Senior Software Engineer / Product Manager ESSCOR 1997  –  January 2000  (3 years) Solana Beach, CA Managed the company's modeling and simulation back-end platform for command-and-control system. \nPorted modeling software from the x86 architecture to the SUN Sparc platform \nWrote, integrated, and deployed command-and-control software and hardware platform Senior Software Engineer / Product Manager ESSCOR 1997  –  January 2000  (3 years) Solana Beach, CA Managed the company's modeling and simulation back-end platform for command-and-control system. \nPorted modeling software from the x86 architecture to the SUN Sparc platform \nWrote, integrated, and deployed command-and-control software and hardware platform Software Engineer Northrop Grumman Corporation (Formerly TRW Avionics & Systems Division) 1996  –  1997  (1 year) San Diego, CA Developed, tested, maintained and integrated SEI Level III-conforming embedded software application for the Communication, Navigation, and Identification (CNI) for the F-22 project. Software Engineer Northrop Grumman Corporation (Formerly TRW Avionics & Systems Division) 1996  –  1997  (1 year) San Diego, CA Developed, tested, maintained and integrated SEI Level III-conforming embedded software application for the Communication, Navigation, and Identification (CNI) for the F-22 project. Technical Support Engineer AT&T Global Information Systems 1994  –  1996  (2 years) Provided technical support for the company's massively parallel database platform. Technical support provided includes networking support, UNIX system administration, database configuration, field support deployment, hardware and software upgrade. Technical Support Engineer AT&T Global Information Systems 1994  –  1996  (2 years) Provided technical support for the company's massively parallel database platform. Technical support provided includes networking support, UNIX system administration, database configuration, field support deployment, hardware and software upgrade. Languages English Tagalog English Tagalog English Tagalog Skills Microsoft Office Management Web Development Software Development Program Management Programming Network Administration Compliance Program... Public Speaking Workshop Presentation Software Testing Technical Support Skills  Microsoft Office Management Web Development Software Development Program Management Programming Network Administration Compliance Program... Public Speaking Workshop Presentation Software Testing Technical Support Microsoft Office Management Web Development Software Development Program Management Programming Network Administration Compliance Program... Public Speaking Workshop Presentation Software Testing Technical Support Microsoft Office Management Web Development Software Development Program Management Programming Network Administration Compliance Program... Public Speaking Workshop Presentation Software Testing Technical Support Education California State University San Marcos BS Computer Science 1994 California State University San Marcos BS Computer Science 1994 California State University San Marcos BS Computer Science 1994 California State University San Marcos BS Computer Science 1994 ", "Experience Senior Manager IBM June 2010  – Present (5 years 3 months) Bengaluru Area, India As Offshore Delivery Head for Test Factory, managed end-to-end operations of Test factory ,owned and maintained the Test Factory Handbook, been a thought Leader and provided ways and means to improve factory performance year on year,represented Test Factory in Steering Committee reviews, was the Single point-of-contact for client for off-shore delivery escalations.In addition,performed the following tasks :  \nTest Factory Delivery management - Collaborate and support Delivery Lead to estimate, plan, manage and deliver projects and overall accountable for all services delivered from the Test Factory,Ensure adherence to Test Factory processes and standards,Work closely with Demand Manager to refine demand at regular intervals,Accountable for overall Demand Management and Staffing & Capacity Planning to fulfill service request,Drive compliance for performance management KPIs and ensure they are published to relevant stakeholders,Responsible for skill management, training and enabling the factory team,Manage Customer Satisfaction  \nService Offerings development - Work with onsite Delivery lead to identify, plan and roll out new service offerings,Review and improvise existing offerings \nPlayed the role of Test Service Area Lead – Emerging Disciplines (Application Virtualization, Test Data Management, Cross Browser Testing : Community and Capability building,trainings, Resourcing, Knowledge base creation and client visits support- Responsible to grow skills, assets, accelerator and build a community of practitioners \nTest Process SME– Defined transformation related processes,worked with Process Transformation Team on definition of Engagement Delivery and Operational Processes,Conducted workshops on Delivery Processes and assets/accelerators,Participated in MAW for Process, Methods and Tool Adoption,Understood client deliverables and provided input on Testing Delivery Processes including changes/adoption for the engagement,Defined Operational Processes for the project/account. Project Manager Infosys Technologies Ltd December 2006  –  May 2010  (3 years 6 months) Senior Network Engineer Intel Corporation October 2005  –  November 2006  (1 year 2 months) Lead QA Engineer Integral Development Corporation December 2003  –  September 2005  (1 year 10 months) Senior Software Engineer Symphony Services February 2003  –  November 2003  (10 months) Technical Lead Eximsoft Technologies Pvt Ltd. May 2001  –  January 2003  (1 year 9 months) Technical Lead CyberCash November 2000  –  April 2001  (6 months) Senior Software Engineer SkyTech Solutions Pvt Ltd July 1999  –  October 2000  (1 year 4 months) Software Engineer Zensar Technologies July 1997  –  June 1999  (2 years) Senior Manager IBM June 2010  – Present (5 years 3 months) Bengaluru Area, India As Offshore Delivery Head for Test Factory, managed end-to-end operations of Test factory ,owned and maintained the Test Factory Handbook, been a thought Leader and provided ways and means to improve factory performance year on year,represented Test Factory in Steering Committee reviews, was the Single point-of-contact for client for off-shore delivery escalations.In addition,performed the following tasks :  \nTest Factory Delivery management - Collaborate and support Delivery Lead to estimate, plan, manage and deliver projects and overall accountable for all services delivered from the Test Factory,Ensure adherence to Test Factory processes and standards,Work closely with Demand Manager to refine demand at regular intervals,Accountable for overall Demand Management and Staffing & Capacity Planning to fulfill service request,Drive compliance for performance management KPIs and ensure they are published to relevant stakeholders,Responsible for skill management, training and enabling the factory team,Manage Customer Satisfaction  \nService Offerings development - Work with onsite Delivery lead to identify, plan and roll out new service offerings,Review and improvise existing offerings \nPlayed the role of Test Service Area Lead – Emerging Disciplines (Application Virtualization, Test Data Management, Cross Browser Testing : Community and Capability building,trainings, Resourcing, Knowledge base creation and client visits support- Responsible to grow skills, assets, accelerator and build a community of practitioners \nTest Process SME– Defined transformation related processes,worked with Process Transformation Team on definition of Engagement Delivery and Operational Processes,Conducted workshops on Delivery Processes and assets/accelerators,Participated in MAW for Process, Methods and Tool Adoption,Understood client deliverables and provided input on Testing Delivery Processes including changes/adoption for the engagement,Defined Operational Processes for the project/account. Senior Manager IBM June 2010  – Present (5 years 3 months) Bengaluru Area, India As Offshore Delivery Head for Test Factory, managed end-to-end operations of Test factory ,owned and maintained the Test Factory Handbook, been a thought Leader and provided ways and means to improve factory performance year on year,represented Test Factory in Steering Committee reviews, was the Single point-of-contact for client for off-shore delivery escalations.In addition,performed the following tasks :  \nTest Factory Delivery management - Collaborate and support Delivery Lead to estimate, plan, manage and deliver projects and overall accountable for all services delivered from the Test Factory,Ensure adherence to Test Factory processes and standards,Work closely with Demand Manager to refine demand at regular intervals,Accountable for overall Demand Management and Staffing & Capacity Planning to fulfill service request,Drive compliance for performance management KPIs and ensure they are published to relevant stakeholders,Responsible for skill management, training and enabling the factory team,Manage Customer Satisfaction  \nService Offerings development - Work with onsite Delivery lead to identify, plan and roll out new service offerings,Review and improvise existing offerings \nPlayed the role of Test Service Area Lead – Emerging Disciplines (Application Virtualization, Test Data Management, Cross Browser Testing : Community and Capability building,trainings, Resourcing, Knowledge base creation and client visits support- Responsible to grow skills, assets, accelerator and build a community of practitioners \nTest Process SME– Defined transformation related processes,worked with Process Transformation Team on definition of Engagement Delivery and Operational Processes,Conducted workshops on Delivery Processes and assets/accelerators,Participated in MAW for Process, Methods and Tool Adoption,Understood client deliverables and provided input on Testing Delivery Processes including changes/adoption for the engagement,Defined Operational Processes for the project/account. Project Manager Infosys Technologies Ltd December 2006  –  May 2010  (3 years 6 months) Project Manager Infosys Technologies Ltd December 2006  –  May 2010  (3 years 6 months) Senior Network Engineer Intel Corporation October 2005  –  November 2006  (1 year 2 months) Senior Network Engineer Intel Corporation October 2005  –  November 2006  (1 year 2 months) Lead QA Engineer Integral Development Corporation December 2003  –  September 2005  (1 year 10 months) Lead QA Engineer Integral Development Corporation December 2003  –  September 2005  (1 year 10 months) Senior Software Engineer Symphony Services February 2003  –  November 2003  (10 months) Senior Software Engineer Symphony Services February 2003  –  November 2003  (10 months) Technical Lead Eximsoft Technologies Pvt Ltd. May 2001  –  January 2003  (1 year 9 months) Technical Lead Eximsoft Technologies Pvt Ltd. May 2001  –  January 2003  (1 year 9 months) Technical Lead CyberCash November 2000  –  April 2001  (6 months) Technical Lead CyberCash November 2000  –  April 2001  (6 months) Senior Software Engineer SkyTech Solutions Pvt Ltd July 1999  –  October 2000  (1 year 4 months) Senior Software Engineer SkyTech Solutions Pvt Ltd July 1999  –  October 2000  (1 year 4 months) Software Engineer Zensar Technologies July 1997  –  June 1999  (2 years) Software Engineer Zensar Technologies July 1997  –  June 1999  (2 years) Skills Pre-sales Requirements Analysis IT Strategy Quality Assurance Agile Methodologies Management Program Management Solution Architecture Software Project... Testing SDLC Unix ERP Integration Cloud Computing Team Building Global Delivery See 2+     See less Skills  Pre-sales Requirements Analysis IT Strategy Quality Assurance Agile Methodologies Management Program Management Solution Architecture Software Project... Testing SDLC Unix ERP Integration Cloud Computing Team Building Global Delivery See 2+     See less Pre-sales Requirements Analysis IT Strategy Quality Assurance Agile Methodologies Management Program Management Solution Architecture Software Project... Testing SDLC Unix ERP Integration Cloud Computing Team Building Global Delivery See 2+     See less Pre-sales Requirements Analysis IT Strategy Quality Assurance Agile Methodologies Management Program Management Solution Architecture Software Project... Testing SDLC Unix ERP Integration Cloud Computing Team Building Global Delivery See 2+     See less Education Indian Institute of Technology, Kharagpur 1992  – 1997 Kendriya Vidyalaya IIT Kharagpur 1985  – 1992 St Agnes School IIT Kharagpur 1978  – 1985 Indian Institute of Technology, Kharagpur 1992  – 1997 Indian Institute of Technology, Kharagpur 1992  – 1997 Indian Institute of Technology, Kharagpur 1992  – 1997 Kendriya Vidyalaya IIT Kharagpur 1985  – 1992 Kendriya Vidyalaya IIT Kharagpur 1985  – 1992 Kendriya Vidyalaya IIT Kharagpur 1985  – 1992 St Agnes School IIT Kharagpur 1978  – 1985 St Agnes School IIT Kharagpur 1978  – 1985 St Agnes School IIT Kharagpur 1978  – 1985 ", "Summary An IT professional with fifteen years of work experience in manufacturing and investment banking. A leader who specializes in data networking technologies, substantial skills on ITIL best practices such as change, incident, and problem management, release and vendor management and hands-on experiences on team and project management. A dedicated, innovative, and diligent worker who constantly thrives strong working relationship and encourages team spirit. \n \nCertifications: \n* ITIL Foundation v3 Certified \n* PMG’s Cross Technology Certified NetAnalyst Summary An IT professional with fifteen years of work experience in manufacturing and investment banking. A leader who specializes in data networking technologies, substantial skills on ITIL best practices such as change, incident, and problem management, release and vendor management and hands-on experiences on team and project management. A dedicated, innovative, and diligent worker who constantly thrives strong working relationship and encourages team spirit. \n \nCertifications: \n* ITIL Foundation v3 Certified \n* PMG’s Cross Technology Certified NetAnalyst An IT professional with fifteen years of work experience in manufacturing and investment banking. A leader who specializes in data networking technologies, substantial skills on ITIL best practices such as change, incident, and problem management, release and vendor management and hands-on experiences on team and project management. A dedicated, innovative, and diligent worker who constantly thrives strong working relationship and encourages team spirit. \n \nCertifications: \n* ITIL Foundation v3 Certified \n* PMG’s Cross Technology Certified NetAnalyst An IT professional with fifteen years of work experience in manufacturing and investment banking. A leader who specializes in data networking technologies, substantial skills on ITIL best practices such as change, incident, and problem management, release and vendor management and hands-on experiences on team and project management. A dedicated, innovative, and diligent worker who constantly thrives strong working relationship and encourages team spirit. \n \nCertifications: \n* ITIL Foundation v3 Certified \n* PMG’s Cross Technology Certified NetAnalyst Experience Network Operations - Change/Resource Manager Macquarie Group July 2012  –  June 2013  (1 year) Philippines Networks Change Manager  \nDefines, innovates, implements and maintains the change management process within networks space. Insures all aspects of the cycle are being carried out end to end on all network changes. Communicates KPI to management, stakeholders and partners.  \n \nKey Accomplishments: \n• Supervised and evaluated the performance of network engineers who administers and implements changes on the production environment that identified solutions on concerns that resulted to accurate scheduling and zero rejection/ cancellation of planned activities thereby achieving a 100% successful turn out of change implementation with 100% customer and stakeholders’ satisfaction. \n• Provided a reliable a feedback procedure and innovation to global change management process, designed usable tricks for tools concerning changes thus earned the first identified SME (subject matter expert) on Change Management. \n \nResource Manager (WorkForce) \nInsures all BCPs, power-downs, incidents, request, problem and changes are accounted on agreeable timeline and resourced with appropriate skill set necessary for each activity to be accomplished. Roster management for both Manila and Gurgaon Staffs and the global resource on-call. Administers trainings and welfare of the staff in the workplace and provides balanced opportunities.  \n \nKey Accomplishments: \n• Developed, defined, and executed activity handling such as BCPs and power-downs, that included engagement process on stakeholders, local support, carriers, vendors and resource handling. Such process resulted a zero issue activities with 100% documentation and established as adopted process in the operation management team. \n• Defined shift windows for both Manila and Gurgaon staffs in reference for both countries labour codes which resulted on zero sick leaves from staffs thus higher productivity of the team. Schedules have been discussed to the all operations team and established as standard pattern to all teams. Network Operations/ITG Executive – Infra Support Engineer Macquarie Group September 2010  –  July 2012  (1 year 11 months) Philippines Handles Service Management of the Global Network Operations Team which comprises Incident, Problem and Change Management. Duties include Manila Capacity Planning which gathers data and coordinates planning for all Manila IT Infrastructure Services, Situation Management which oversee whole ITS Services Incidents and Vendor management which insures all Manila infrastructure are well maintained and updated. \n \nKey Accomplishments: \n• Led Aged Ticket closure on the Team’s queue which resulted on redefinition of commit dates on request management. Team had lowered our oldest ticket from a year up to two week-old tickets thereby reduced turnaround time and achieved higher productivity of the team.  \n• Monitored bandwidth consumptions, and predicting possibilities via Driving Capacity Upgrade for the Manila MAN link by conducting upgrade from active-active 10 mbps links to active-active 100mbps links it prevented possible congestion thereby led to 100% stakeholder satisfaction.  \n• Re-evaluated a process on handling VPN (Virtual Private Network) issues, Trending incidents encountered in EMEA region on VPN infrastructure that defined common issues and resolutions which driven engineering/service management team to provide solution based on business accepted proposal. This resulted to more reliable network infrastructure in EMEA network design. Senior Network Engineer Intel Corporation January 2007  –  January 2008  (1 year 1 month) Philippines Handles complex repairs and problem management on Intel’s Global WAN, acted as second level support on maintaining operation on the WAN. Conducted training for Site WAN support engineers of WAN technologies, new implementations and tools usage. Maintained WAN tools data integrity. \n \nKey Accomplishments: \n•\tInstructed carrier suppliers in Philippines to provide an underground fibre instead of aerial fibre as part of information security and infrastructure reliability that resulted to a reliable network infrastructure. \n•\tConducted a complex analysis on Russia connectivity issue which prevented downtime on a design engineering site thereby achieving higher efficiency on operation. Sr Network Operations Engineer Intel Corporation August 2006  –  January 2007  (6 months) Philippines Implements, maintain and troubleshoot complex problems on the network infrastructure for use by internal employees and outsourced companies. Lead and support regional/global IT initiatives to ensure product integrity and business continuity. \n \nKey Accomplishments: \n•\tImplemented an interim data and voice network for 300 employees which maintained factory operation during the course of the typhoon ‘Milenyo’ that struck Cavite in 2006. \n•\tPlanned and implemented a manage downtime process which offered solution that prevented connectivity loss and if bugs persist in the equipment, thus, enabling a smooth running of operation. Network Analyst – Network&Application Characterization Engg Intel Corporation 2005  –  August 2006  (1 year) Philippines Provides solution and recommendation based on infrastructure impact analysis, application analysis, network analysis, protocol analysis and escalated 3-level performance issues on PPV and Non-PPV projects that influences any redesign for either/both application and infrastructure.  \n \nKey Accomplishments: \n•\tAnalysed application and Network performance in Melbourne/Sydney that resulted to a fast and more redundant and reliable connectivity. LAN/WLAN Engineer – Global Network Engineering Intel Corporation 1999  –  2004  (5 years) Philippines Provides best and cost effective LAN/WLAN designs and products to use in Asia and factories while partnering with different organizations at Intel globally. Conducts product evaluation and designs on different environments that suits current need of the company. \n \nKey Accomplishments: \n•\tImplemented network monitoring tools across Asia sites and conducted training to sites operation folks on the functionality of the said tools that resulted to higher security measures on the environment and higher staff efficiency and productivity in the operations. \n•\tDesigned and implemented LAN/WLAN networks for large scale campuses in Bangalore-India, Chengdu-China, Korea, Kulim-Malaysia that achieved a cost-effective, efficient, reliable and robust network designs. Site Network Engineer – Philippines Intel Corporation June 1997  –  1999  (2 years) Philippines Responsible for distribution, installation, operations, proactive maintenance and troubleshooting of site distributed computing environment. Monitored and performed capacity/feasibility studies and resolved network capacity issues. Identified, developed, and deployed tools supporting network server services. Performed impact analysis of new technologies on environment. Network Operations - Change/Resource Manager Macquarie Group July 2012  –  June 2013  (1 year) Philippines Networks Change Manager  \nDefines, innovates, implements and maintains the change management process within networks space. Insures all aspects of the cycle are being carried out end to end on all network changes. Communicates KPI to management, stakeholders and partners.  \n \nKey Accomplishments: \n• Supervised and evaluated the performance of network engineers who administers and implements changes on the production environment that identified solutions on concerns that resulted to accurate scheduling and zero rejection/ cancellation of planned activities thereby achieving a 100% successful turn out of change implementation with 100% customer and stakeholders’ satisfaction. \n• Provided a reliable a feedback procedure and innovation to global change management process, designed usable tricks for tools concerning changes thus earned the first identified SME (subject matter expert) on Change Management. \n \nResource Manager (WorkForce) \nInsures all BCPs, power-downs, incidents, request, problem and changes are accounted on agreeable timeline and resourced with appropriate skill set necessary for each activity to be accomplished. Roster management for both Manila and Gurgaon Staffs and the global resource on-call. Administers trainings and welfare of the staff in the workplace and provides balanced opportunities.  \n \nKey Accomplishments: \n• Developed, defined, and executed activity handling such as BCPs and power-downs, that included engagement process on stakeholders, local support, carriers, vendors and resource handling. Such process resulted a zero issue activities with 100% documentation and established as adopted process in the operation management team. \n• Defined shift windows for both Manila and Gurgaon staffs in reference for both countries labour codes which resulted on zero sick leaves from staffs thus higher productivity of the team. Schedules have been discussed to the all operations team and established as standard pattern to all teams. Network Operations - Change/Resource Manager Macquarie Group July 2012  –  June 2013  (1 year) Philippines Networks Change Manager  \nDefines, innovates, implements and maintains the change management process within networks space. Insures all aspects of the cycle are being carried out end to end on all network changes. Communicates KPI to management, stakeholders and partners.  \n \nKey Accomplishments: \n• Supervised and evaluated the performance of network engineers who administers and implements changes on the production environment that identified solutions on concerns that resulted to accurate scheduling and zero rejection/ cancellation of planned activities thereby achieving a 100% successful turn out of change implementation with 100% customer and stakeholders’ satisfaction. \n• Provided a reliable a feedback procedure and innovation to global change management process, designed usable tricks for tools concerning changes thus earned the first identified SME (subject matter expert) on Change Management. \n \nResource Manager (WorkForce) \nInsures all BCPs, power-downs, incidents, request, problem and changes are accounted on agreeable timeline and resourced with appropriate skill set necessary for each activity to be accomplished. Roster management for both Manila and Gurgaon Staffs and the global resource on-call. Administers trainings and welfare of the staff in the workplace and provides balanced opportunities.  \n \nKey Accomplishments: \n• Developed, defined, and executed activity handling such as BCPs and power-downs, that included engagement process on stakeholders, local support, carriers, vendors and resource handling. Such process resulted a zero issue activities with 100% documentation and established as adopted process in the operation management team. \n• Defined shift windows for both Manila and Gurgaon staffs in reference for both countries labour codes which resulted on zero sick leaves from staffs thus higher productivity of the team. Schedules have been discussed to the all operations team and established as standard pattern to all teams. Network Operations/ITG Executive – Infra Support Engineer Macquarie Group September 2010  –  July 2012  (1 year 11 months) Philippines Handles Service Management of the Global Network Operations Team which comprises Incident, Problem and Change Management. Duties include Manila Capacity Planning which gathers data and coordinates planning for all Manila IT Infrastructure Services, Situation Management which oversee whole ITS Services Incidents and Vendor management which insures all Manila infrastructure are well maintained and updated. \n \nKey Accomplishments: \n• Led Aged Ticket closure on the Team’s queue which resulted on redefinition of commit dates on request management. Team had lowered our oldest ticket from a year up to two week-old tickets thereby reduced turnaround time and achieved higher productivity of the team.  \n• Monitored bandwidth consumptions, and predicting possibilities via Driving Capacity Upgrade for the Manila MAN link by conducting upgrade from active-active 10 mbps links to active-active 100mbps links it prevented possible congestion thereby led to 100% stakeholder satisfaction.  \n• Re-evaluated a process on handling VPN (Virtual Private Network) issues, Trending incidents encountered in EMEA region on VPN infrastructure that defined common issues and resolutions which driven engineering/service management team to provide solution based on business accepted proposal. This resulted to more reliable network infrastructure in EMEA network design. Network Operations/ITG Executive – Infra Support Engineer Macquarie Group September 2010  –  July 2012  (1 year 11 months) Philippines Handles Service Management of the Global Network Operations Team which comprises Incident, Problem and Change Management. Duties include Manila Capacity Planning which gathers data and coordinates planning for all Manila IT Infrastructure Services, Situation Management which oversee whole ITS Services Incidents and Vendor management which insures all Manila infrastructure are well maintained and updated. \n \nKey Accomplishments: \n• Led Aged Ticket closure on the Team’s queue which resulted on redefinition of commit dates on request management. Team had lowered our oldest ticket from a year up to two week-old tickets thereby reduced turnaround time and achieved higher productivity of the team.  \n• Monitored bandwidth consumptions, and predicting possibilities via Driving Capacity Upgrade for the Manila MAN link by conducting upgrade from active-active 10 mbps links to active-active 100mbps links it prevented possible congestion thereby led to 100% stakeholder satisfaction.  \n• Re-evaluated a process on handling VPN (Virtual Private Network) issues, Trending incidents encountered in EMEA region on VPN infrastructure that defined common issues and resolutions which driven engineering/service management team to provide solution based on business accepted proposal. This resulted to more reliable network infrastructure in EMEA network design. Senior Network Engineer Intel Corporation January 2007  –  January 2008  (1 year 1 month) Philippines Handles complex repairs and problem management on Intel’s Global WAN, acted as second level support on maintaining operation on the WAN. Conducted training for Site WAN support engineers of WAN technologies, new implementations and tools usage. Maintained WAN tools data integrity. \n \nKey Accomplishments: \n•\tInstructed carrier suppliers in Philippines to provide an underground fibre instead of aerial fibre as part of information security and infrastructure reliability that resulted to a reliable network infrastructure. \n•\tConducted a complex analysis on Russia connectivity issue which prevented downtime on a design engineering site thereby achieving higher efficiency on operation. Senior Network Engineer Intel Corporation January 2007  –  January 2008  (1 year 1 month) Philippines Handles complex repairs and problem management on Intel’s Global WAN, acted as second level support on maintaining operation on the WAN. Conducted training for Site WAN support engineers of WAN technologies, new implementations and tools usage. Maintained WAN tools data integrity. \n \nKey Accomplishments: \n•\tInstructed carrier suppliers in Philippines to provide an underground fibre instead of aerial fibre as part of information security and infrastructure reliability that resulted to a reliable network infrastructure. \n•\tConducted a complex analysis on Russia connectivity issue which prevented downtime on a design engineering site thereby achieving higher efficiency on operation. Sr Network Operations Engineer Intel Corporation August 2006  –  January 2007  (6 months) Philippines Implements, maintain and troubleshoot complex problems on the network infrastructure for use by internal employees and outsourced companies. Lead and support regional/global IT initiatives to ensure product integrity and business continuity. \n \nKey Accomplishments: \n•\tImplemented an interim data and voice network for 300 employees which maintained factory operation during the course of the typhoon ‘Milenyo’ that struck Cavite in 2006. \n•\tPlanned and implemented a manage downtime process which offered solution that prevented connectivity loss and if bugs persist in the equipment, thus, enabling a smooth running of operation. Sr Network Operations Engineer Intel Corporation August 2006  –  January 2007  (6 months) Philippines Implements, maintain and troubleshoot complex problems on the network infrastructure for use by internal employees and outsourced companies. Lead and support regional/global IT initiatives to ensure product integrity and business continuity. \n \nKey Accomplishments: \n•\tImplemented an interim data and voice network for 300 employees which maintained factory operation during the course of the typhoon ‘Milenyo’ that struck Cavite in 2006. \n•\tPlanned and implemented a manage downtime process which offered solution that prevented connectivity loss and if bugs persist in the equipment, thus, enabling a smooth running of operation. Network Analyst – Network&Application Characterization Engg Intel Corporation 2005  –  August 2006  (1 year) Philippines Provides solution and recommendation based on infrastructure impact analysis, application analysis, network analysis, protocol analysis and escalated 3-level performance issues on PPV and Non-PPV projects that influences any redesign for either/both application and infrastructure.  \n \nKey Accomplishments: \n•\tAnalysed application and Network performance in Melbourne/Sydney that resulted to a fast and more redundant and reliable connectivity. Network Analyst – Network&Application Characterization Engg Intel Corporation 2005  –  August 2006  (1 year) Philippines Provides solution and recommendation based on infrastructure impact analysis, application analysis, network analysis, protocol analysis and escalated 3-level performance issues on PPV and Non-PPV projects that influences any redesign for either/both application and infrastructure.  \n \nKey Accomplishments: \n•\tAnalysed application and Network performance in Melbourne/Sydney that resulted to a fast and more redundant and reliable connectivity. LAN/WLAN Engineer – Global Network Engineering Intel Corporation 1999  –  2004  (5 years) Philippines Provides best and cost effective LAN/WLAN designs and products to use in Asia and factories while partnering with different organizations at Intel globally. Conducts product evaluation and designs on different environments that suits current need of the company. \n \nKey Accomplishments: \n•\tImplemented network monitoring tools across Asia sites and conducted training to sites operation folks on the functionality of the said tools that resulted to higher security measures on the environment and higher staff efficiency and productivity in the operations. \n•\tDesigned and implemented LAN/WLAN networks for large scale campuses in Bangalore-India, Chengdu-China, Korea, Kulim-Malaysia that achieved a cost-effective, efficient, reliable and robust network designs. LAN/WLAN Engineer – Global Network Engineering Intel Corporation 1999  –  2004  (5 years) Philippines Provides best and cost effective LAN/WLAN designs and products to use in Asia and factories while partnering with different organizations at Intel globally. Conducts product evaluation and designs on different environments that suits current need of the company. \n \nKey Accomplishments: \n•\tImplemented network monitoring tools across Asia sites and conducted training to sites operation folks on the functionality of the said tools that resulted to higher security measures on the environment and higher staff efficiency and productivity in the operations. \n•\tDesigned and implemented LAN/WLAN networks for large scale campuses in Bangalore-India, Chengdu-China, Korea, Kulim-Malaysia that achieved a cost-effective, efficient, reliable and robust network designs. Site Network Engineer – Philippines Intel Corporation June 1997  –  1999  (2 years) Philippines Responsible for distribution, installation, operations, proactive maintenance and troubleshooting of site distributed computing environment. Monitored and performed capacity/feasibility studies and resolved network capacity issues. Identified, developed, and deployed tools supporting network server services. Performed impact analysis of new technologies on environment. Site Network Engineer – Philippines Intel Corporation June 1997  –  1999  (2 years) Philippines Responsible for distribution, installation, operations, proactive maintenance and troubleshooting of site distributed computing environment. Monitored and performed capacity/feasibility studies and resolved network capacity issues. Identified, developed, and deployed tools supporting network server services. Performed impact analysis of new technologies on environment. Languages Tagalog Native or bilingual proficiency English Full professional proficiency Tagalog Native or bilingual proficiency English Full professional proficiency Tagalog Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Leadership Team-oriented Workforce Management Project Management ITIL v3 Foundations... IT Service Management Incident Management Change Management Problem Management Cultural Awareness Customer Service Networking NetAnalysis Network Monitoring Tools Analytic Problem Solving Capacity Planning Network Engineering Global Network... ITIL Network Design Outsourcing WAN VPN Business Continuity See 9+     See less Skills  Leadership Team-oriented Workforce Management Project Management ITIL v3 Foundations... IT Service Management Incident Management Change Management Problem Management Cultural Awareness Customer Service Networking NetAnalysis Network Monitoring Tools Analytic Problem Solving Capacity Planning Network Engineering Global Network... ITIL Network Design Outsourcing WAN VPN Business Continuity See 9+     See less Leadership Team-oriented Workforce Management Project Management ITIL v3 Foundations... IT Service Management Incident Management Change Management Problem Management Cultural Awareness Customer Service Networking NetAnalysis Network Monitoring Tools Analytic Problem Solving Capacity Planning Network Engineering Global Network... ITIL Network Design Outsourcing WAN VPN Business Continuity See 9+     See less Leadership Team-oriented Workforce Management Project Management ITIL v3 Foundations... IT Service Management Incident Management Change Management Problem Management Cultural Awareness Customer Service Networking NetAnalysis Network Monitoring Tools Analytic Problem Solving Capacity Planning Network Engineering Global Network... ITIL Network Design Outsourcing WAN VPN Business Continuity See 9+     See less Education Pamantasan ng Lungsod ng Maynila Bachelor of Science in Computer Engineering,  Computer Engineering 1992  – 1997 Activities and Societies:  Philippine Computer Engineering Society Pamantasan ng Lungsod ng Maynila Bachelor of Science in Computer Engineering,  Computer Engineering 1992  – 1997 Activities and Societies:  Philippine Computer Engineering Society Pamantasan ng Lungsod ng Maynila Bachelor of Science in Computer Engineering,  Computer Engineering 1992  – 1997 Activities and Societies:  Philippine Computer Engineering Society Pamantasan ng Lungsod ng Maynila Bachelor of Science in Computer Engineering,  Computer Engineering 1992  – 1997 Activities and Societies:  Philippine Computer Engineering Society ", "Summary Jabin Trapp is an Information Technology Manager with immediate experience working as a full time network engineer for Wells Fargo Bank. He provides expertise in several areas of networking design including enterprise network architecture, high speed/bandwidth network engineering, network firewall, network security, network vulnerability, enterprise wireless design, enterprise wireless security, and campus facilities support. \n \nJabin has twenty four years of experience in Information Technology (IT) and specialized technology, including fifteen years in high bandwidth network design supporting CADD graphical applications, high bandwidth compute servers and super-computing clusters, Fifteen years in data center and facilities operations, twelve years of network routing and switching engineering, ten years of direct report management experience, ten years of network diagramming and documentation, eight years of large IT project management experience, eight years of enterprise class wireless networking, also five years of network security and firewall experience. Summary Jabin Trapp is an Information Technology Manager with immediate experience working as a full time network engineer for Wells Fargo Bank. He provides expertise in several areas of networking design including enterprise network architecture, high speed/bandwidth network engineering, network firewall, network security, network vulnerability, enterprise wireless design, enterprise wireless security, and campus facilities support. \n \nJabin has twenty four years of experience in Information Technology (IT) and specialized technology, including fifteen years in high bandwidth network design supporting CADD graphical applications, high bandwidth compute servers and super-computing clusters, Fifteen years in data center and facilities operations, twelve years of network routing and switching engineering, ten years of direct report management experience, ten years of network diagramming and documentation, eight years of large IT project management experience, eight years of enterprise class wireless networking, also five years of network security and firewall experience. Jabin Trapp is an Information Technology Manager with immediate experience working as a full time network engineer for Wells Fargo Bank. He provides expertise in several areas of networking design including enterprise network architecture, high speed/bandwidth network engineering, network firewall, network security, network vulnerability, enterprise wireless design, enterprise wireless security, and campus facilities support. \n \nJabin has twenty four years of experience in Information Technology (IT) and specialized technology, including fifteen years in high bandwidth network design supporting CADD graphical applications, high bandwidth compute servers and super-computing clusters, Fifteen years in data center and facilities operations, twelve years of network routing and switching engineering, ten years of direct report management experience, ten years of network diagramming and documentation, eight years of large IT project management experience, eight years of enterprise class wireless networking, also five years of network security and firewall experience. Jabin Trapp is an Information Technology Manager with immediate experience working as a full time network engineer for Wells Fargo Bank. He provides expertise in several areas of networking design including enterprise network architecture, high speed/bandwidth network engineering, network firewall, network security, network vulnerability, enterprise wireless design, enterprise wireless security, and campus facilities support. \n \nJabin has twenty four years of experience in Information Technology (IT) and specialized technology, including fifteen years in high bandwidth network design supporting CADD graphical applications, high bandwidth compute servers and super-computing clusters, Fifteen years in data center and facilities operations, twelve years of network routing and switching engineering, ten years of direct report management experience, ten years of network diagramming and documentation, eight years of large IT project management experience, eight years of enterprise class wireless networking, also five years of network security and firewall experience. Experience Network Engineer Wells Fargo September 2013  – Present (2 years) Columbia, SC Network Engineer with Secure Connectivity Services Team managing Extranets, Enclave, Tunnels, VPN, iVPN, secure proxy, firewalls, FWAM, DMZ and perimeter network links with Extranet customers. Utilize HPNA and CLI to establish BGP peering with vendors using AS dynamic routing with MPLS multiple site fail-overs for redundancy. Configure via HPNA Automated Scripts and via command line, both private addressing, public addressing, NAT and validate ARIN compliance. Utilize established ITIL practices to provide secure standard datacenter and firewall connectivity Senior Network Engineer Intel Corporation November 2000  –  September 2013  (12 years 11 months) Manage Cisco based LAN/WAN routing MPLS, BGP, EIGRP and OSPF and switching infrastructure for some 8000 nodes within numerous geographic Intel locations. Project manager for several global impacting long term projects, manage teams of up to 15 personnel. Participate in global working groups engage in key strategic decisions affecting some 120k employees. Manage Data Centers and Network rooms overseeing security standards, electrical, UPS, and HVAC. Work with vendors to provide power and cooling requirements. Manage new and expansion office fit-ups for network, telecom, wireless, audio/visual and facility security. Provided first and second level firewall support, administration and installation. Chief Information Officer CEEUS Inc November 1997  –  November 2000  (3 years 1 month) Wholesale Distribution \nCIO for an electrical distribution company. Reported directly to CEO and Managed IT direct report staff. Presented to board of directors the corporation’s IT strategic objectives and budget. Managed Projects in line with corporate Web/E-Business and B2B strategy. Created Web based integrated online catalogs, sales and customer service and B2B links. Provided Data Center hosting services for customers. Worked with multiple software vendors. Key accomplishment is sales increased 25% due specifically to B2B Links and Technology Systems Analyst Fleet Mortgage October 1996  –  November 1997  (1 year 2 months) Performed desktop, notebook and server maintenance with Windows 95, Microsoft NT 4.0, Network maintenance with Cisco switches & Network General Sniffer analyzation. Worked to standardize desktop and mobile environment using ghost and other applications Information Systems Consultant II South Carolina September 1989  –  October 1996  (7 years 2 months) Government / Transportation Engineering \nImplemented and installed new network fiber, cat5 and WAN Link infrastructure in seventy state offices throughout South Carolina. Tested Windows NT workstation 3.1 and 3.5 for use in CADD environment. Beta tested applications recently ported to Windows NT from Unix and VAX systems. Worked with software engineers to provide feedback, supported Civil Engineers using Microstation and AutoCAD in a production environment. Create visual charts and graphs, used manual drafting techniques and CADD systems for civil engineering Draftsman Independent Fire Protection October 1988  –  August 1989  (11 months) Mechanical Engineering \nUsed manual drafting techniques and AutoCAD to design commercial fire sprinkler systems in accordance with NFPA standards Network Engineer Wells Fargo September 2013  – Present (2 years) Columbia, SC Network Engineer with Secure Connectivity Services Team managing Extranets, Enclave, Tunnels, VPN, iVPN, secure proxy, firewalls, FWAM, DMZ and perimeter network links with Extranet customers. Utilize HPNA and CLI to establish BGP peering with vendors using AS dynamic routing with MPLS multiple site fail-overs for redundancy. Configure via HPNA Automated Scripts and via command line, both private addressing, public addressing, NAT and validate ARIN compliance. Utilize established ITIL practices to provide secure standard datacenter and firewall connectivity Network Engineer Wells Fargo September 2013  – Present (2 years) Columbia, SC Network Engineer with Secure Connectivity Services Team managing Extranets, Enclave, Tunnels, VPN, iVPN, secure proxy, firewalls, FWAM, DMZ and perimeter network links with Extranet customers. Utilize HPNA and CLI to establish BGP peering with vendors using AS dynamic routing with MPLS multiple site fail-overs for redundancy. Configure via HPNA Automated Scripts and via command line, both private addressing, public addressing, NAT and validate ARIN compliance. Utilize established ITIL practices to provide secure standard datacenter and firewall connectivity Senior Network Engineer Intel Corporation November 2000  –  September 2013  (12 years 11 months) Manage Cisco based LAN/WAN routing MPLS, BGP, EIGRP and OSPF and switching infrastructure for some 8000 nodes within numerous geographic Intel locations. Project manager for several global impacting long term projects, manage teams of up to 15 personnel. Participate in global working groups engage in key strategic decisions affecting some 120k employees. Manage Data Centers and Network rooms overseeing security standards, electrical, UPS, and HVAC. Work with vendors to provide power and cooling requirements. Manage new and expansion office fit-ups for network, telecom, wireless, audio/visual and facility security. Provided first and second level firewall support, administration and installation. Senior Network Engineer Intel Corporation November 2000  –  September 2013  (12 years 11 months) Manage Cisco based LAN/WAN routing MPLS, BGP, EIGRP and OSPF and switching infrastructure for some 8000 nodes within numerous geographic Intel locations. Project manager for several global impacting long term projects, manage teams of up to 15 personnel. Participate in global working groups engage in key strategic decisions affecting some 120k employees. Manage Data Centers and Network rooms overseeing security standards, electrical, UPS, and HVAC. Work with vendors to provide power and cooling requirements. Manage new and expansion office fit-ups for network, telecom, wireless, audio/visual and facility security. Provided first and second level firewall support, administration and installation. Chief Information Officer CEEUS Inc November 1997  –  November 2000  (3 years 1 month) Wholesale Distribution \nCIO for an electrical distribution company. Reported directly to CEO and Managed IT direct report staff. Presented to board of directors the corporation’s IT strategic objectives and budget. Managed Projects in line with corporate Web/E-Business and B2B strategy. Created Web based integrated online catalogs, sales and customer service and B2B links. Provided Data Center hosting services for customers. Worked with multiple software vendors. Key accomplishment is sales increased 25% due specifically to B2B Links and Technology Chief Information Officer CEEUS Inc November 1997  –  November 2000  (3 years 1 month) Wholesale Distribution \nCIO for an electrical distribution company. Reported directly to CEO and Managed IT direct report staff. Presented to board of directors the corporation’s IT strategic objectives and budget. Managed Projects in line with corporate Web/E-Business and B2B strategy. Created Web based integrated online catalogs, sales and customer service and B2B links. Provided Data Center hosting services for customers. Worked with multiple software vendors. Key accomplishment is sales increased 25% due specifically to B2B Links and Technology Systems Analyst Fleet Mortgage October 1996  –  November 1997  (1 year 2 months) Performed desktop, notebook and server maintenance with Windows 95, Microsoft NT 4.0, Network maintenance with Cisco switches & Network General Sniffer analyzation. Worked to standardize desktop and mobile environment using ghost and other applications Systems Analyst Fleet Mortgage October 1996  –  November 1997  (1 year 2 months) Performed desktop, notebook and server maintenance with Windows 95, Microsoft NT 4.0, Network maintenance with Cisco switches & Network General Sniffer analyzation. Worked to standardize desktop and mobile environment using ghost and other applications Information Systems Consultant II South Carolina September 1989  –  October 1996  (7 years 2 months) Government / Transportation Engineering \nImplemented and installed new network fiber, cat5 and WAN Link infrastructure in seventy state offices throughout South Carolina. Tested Windows NT workstation 3.1 and 3.5 for use in CADD environment. Beta tested applications recently ported to Windows NT from Unix and VAX systems. Worked with software engineers to provide feedback, supported Civil Engineers using Microstation and AutoCAD in a production environment. Create visual charts and graphs, used manual drafting techniques and CADD systems for civil engineering Information Systems Consultant II South Carolina September 1989  –  October 1996  (7 years 2 months) Government / Transportation Engineering \nImplemented and installed new network fiber, cat5 and WAN Link infrastructure in seventy state offices throughout South Carolina. Tested Windows NT workstation 3.1 and 3.5 for use in CADD environment. Beta tested applications recently ported to Windows NT from Unix and VAX systems. Worked with software engineers to provide feedback, supported Civil Engineers using Microstation and AutoCAD in a production environment. Create visual charts and graphs, used manual drafting techniques and CADD systems for civil engineering Draftsman Independent Fire Protection October 1988  –  August 1989  (11 months) Mechanical Engineering \nUsed manual drafting techniques and AutoCAD to design commercial fire sprinkler systems in accordance with NFPA standards Draftsman Independent Fire Protection October 1988  –  August 1989  (11 months) Mechanical Engineering \nUsed manual drafting techniques and AutoCAD to design commercial fire sprinkler systems in accordance with NFPA standards Languages English English English Skills Data Center Servers Firewalls Network Design Routing Troubleshooting Security Unix Hardware Operating Systems Active Directory Linux Virtualization Integration VMware Solaris TCP/IP Intel Microsoft SQL Server System Architecture SQL OSPF EIGRP Checkpoint Crossbeam XOS BGP Cisco Technologies Cisco IOS Cisco Routers Cisco Nexus HPNA Secure CRT ITIL EAP HSRP RADIUS See 21+     See less Skills  Data Center Servers Firewalls Network Design Routing Troubleshooting Security Unix Hardware Operating Systems Active Directory Linux Virtualization Integration VMware Solaris TCP/IP Intel Microsoft SQL Server System Architecture SQL OSPF EIGRP Checkpoint Crossbeam XOS BGP Cisco Technologies Cisco IOS Cisco Routers Cisco Nexus HPNA Secure CRT ITIL EAP HSRP RADIUS See 21+     See less Data Center Servers Firewalls Network Design Routing Troubleshooting Security Unix Hardware Operating Systems Active Directory Linux Virtualization Integration VMware Solaris TCP/IP Intel Microsoft SQL Server System Architecture SQL OSPF EIGRP Checkpoint Crossbeam XOS BGP Cisco Technologies Cisco IOS Cisco Routers Cisco Nexus HPNA Secure CRT ITIL EAP HSRP RADIUS See 21+     See less Data Center Servers Firewalls Network Design Routing Troubleshooting Security Unix Hardware Operating Systems Active Directory Linux Virtualization Integration VMware Solaris TCP/IP Intel Microsoft SQL Server System Architecture SQL OSPF EIGRP Checkpoint Crossbeam XOS BGP Cisco Technologies Cisco IOS Cisco Routers Cisco Nexus HPNA Secure CRT ITIL EAP HSRP RADIUS See 21+     See less Education Strayer University-South Carolina Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General , 3.9 2006  – 2011 Bachelor Business Administration Major in Management/IT Strayer University Bachelor of Business Administration (BBA),  Information Technology 2005  – 2010 Strayer University-South Carolina Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General , 3.9 2006  – 2011 Bachelor Business Administration Major in Management/IT Strayer University-South Carolina Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General , 3.9 2006  – 2011 Bachelor Business Administration Major in Management/IT Strayer University-South Carolina Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General , 3.9 2006  – 2011 Bachelor Business Administration Major in Management/IT Strayer University Bachelor of Business Administration (BBA),  Information Technology 2005  – 2010 Strayer University Bachelor of Business Administration (BBA),  Information Technology 2005  – 2010 Strayer University Bachelor of Business Administration (BBA),  Information Technology 2005  – 2010 ", "Summary Information Systems professional with focus on all aspects of Datacenter Management & Operations, network design & configuration, and systems audit & business continuity planning. Specialties:Network configuration & troubleshooting, Technical Editor of technology publications, Information Systems Audit, Consultation and Business Continuity Planning. Summary Information Systems professional with focus on all aspects of Datacenter Management & Operations, network design & configuration, and systems audit & business continuity planning. Specialties:Network configuration & troubleshooting, Technical Editor of technology publications, Information Systems Audit, Consultation and Business Continuity Planning. Information Systems professional with focus on all aspects of Datacenter Management & Operations, network design & configuration, and systems audit & business continuity planning. Specialties:Network configuration & troubleshooting, Technical Editor of technology publications, Information Systems Audit, Consultation and Business Continuity Planning. Information Systems professional with focus on all aspects of Datacenter Management & Operations, network design & configuration, and systems audit & business continuity planning. Specialties:Network configuration & troubleshooting, Technical Editor of technology publications, Information Systems Audit, Consultation and Business Continuity Planning. Experience Technical Marketing Engineer Intel Corporation October 2005  – Present (9 years 11 months) Assist in the development of our new server product demo concepts. Drive our Press Publication enabling workshops and provide the Publication Reviewers with equipment so they can evaluate new server and workstation products with independent industry accepted benchmark tests. Lab and Network Engineering Manager Intel Corporation August 2002  –  October 2005  (3 years 3 months) Built and managed the labs located in our California, Oregon and Russia locations for engineering and developing our groups firmware. Managed the network services between the labs and their corporate network interface points. Senior Network Engineer Intel Corporation January 2002  –  August 2002  (8 months) Designed the enterprise network for a new business group Enterprise Security Solutions. Group shutdown in August 2002. Broadcast Operations Manager Intel Corporation February 2001  –  January 2002  (1 year) Created and managed the Broadcast Operations Center to support new business group working to develop a service to provide a subscription service for movie package downloads to local client desktop box. Group also was designing and developing the desktop box to receive the movie packages for storage and playback. Group shutdown in January 2002. Hosting Services Manager - Intel Online Services Intel Corporation April 1999  –  February 2001  (1 year 11 months) Managed the Hosting Services Team in the Intel Online Services Engineering organization. Team created the OS and Application platforms loaded on servers to support clients looking for hosting services. Intel Online Services shutdown in early 2002. Oregon / Utah Server Operations Manager Intel Corporation March 1995  –  April 1999  (4 years 2 months) Managed the Server Operations team for both Oregon and Utah Intel locations (40 professional and technical personnel). Served on the Americas Regional Operations Management Team, Enterprise Change Control Development Team, and Datacenter Design Team. Senior IS Auditor Sisters of Providence Health System February 1994  –  March 1995  (1 year 2 months) Created the IS Audit position and audited the Health System IS systems and business continuity plans. Senior IS Auditor First Interstate Bank June 1992  –  February 1994  (1 year 9 months) Audited bank financial systems and supported Financial Audit teams in IS audits. Technical Services Operations Manager San Jacinto Savings Association August 1990  –  March 1992  (1 year 8 months) Managed the Help Desk, Client Desktop Technical Support, Network and Telecom Engineers and Server Operations teams. Senior IS Auditor San Jacinto Savings Association January 1989  –  August 1990  (1 year 8 months) Audited the financial banking systems indepently and provided IS audit support to the Financial Audit team. Corporate Disaster Recovery Administrator Enron December 1986  –  December 1988  (2 years 1 month) Created, maintained and coordinated tests of coporate information system business continuity plans. Started with seven individual plans and created a uniform plan template to span all seven datacenters. Coordinated the business continuity plans for corporate datacenter consolidation from seven to three. Coordinated the preparation and execution of the recovery process in preparation for hurricane Gilbert. Senior IS Auditor Allied Bancshares June 1984  –  December 1986  (2 years 7 months) Audit MVS and VM mainframe operating systems and modeled financial systems and third party bond calculation systems for correctness and accuracy. Senior IS Auditor Gulf Oil September 1981  –  June 1984  (2 years 10 months) Audited MVS and VM mainframe operating system and related security controls. Supported Financial Audit team with Oil & Gas Lease Royalty system controls and security. Modeled in FOCUS, CARS, STRATA and CULPRIT applications that simulated production applications to support Financial Audit in assurance production applications were processing data correctly and accurately. Audited automated fuel dispensing terminals and related controls and security systems. Information Systems (IS) Auditor Capital Bank, NA January 1981  –  September 1981  (9 months) Information Systems Audit within the Internal Audit department. Audited financial systems related to Commercial Lending, Foreign Currency and general bank Financial automated systems. Technical Marketing Engineer Intel Corporation October 2005  – Present (9 years 11 months) Assist in the development of our new server product demo concepts. Drive our Press Publication enabling workshops and provide the Publication Reviewers with equipment so they can evaluate new server and workstation products with independent industry accepted benchmark tests. Technical Marketing Engineer Intel Corporation October 2005  – Present (9 years 11 months) Assist in the development of our new server product demo concepts. Drive our Press Publication enabling workshops and provide the Publication Reviewers with equipment so they can evaluate new server and workstation products with independent industry accepted benchmark tests. Lab and Network Engineering Manager Intel Corporation August 2002  –  October 2005  (3 years 3 months) Built and managed the labs located in our California, Oregon and Russia locations for engineering and developing our groups firmware. Managed the network services between the labs and their corporate network interface points. Lab and Network Engineering Manager Intel Corporation August 2002  –  October 2005  (3 years 3 months) Built and managed the labs located in our California, Oregon and Russia locations for engineering and developing our groups firmware. Managed the network services between the labs and their corporate network interface points. Senior Network Engineer Intel Corporation January 2002  –  August 2002  (8 months) Designed the enterprise network for a new business group Enterprise Security Solutions. Group shutdown in August 2002. Senior Network Engineer Intel Corporation January 2002  –  August 2002  (8 months) Designed the enterprise network for a new business group Enterprise Security Solutions. Group shutdown in August 2002. Broadcast Operations Manager Intel Corporation February 2001  –  January 2002  (1 year) Created and managed the Broadcast Operations Center to support new business group working to develop a service to provide a subscription service for movie package downloads to local client desktop box. Group also was designing and developing the desktop box to receive the movie packages for storage and playback. Group shutdown in January 2002. Broadcast Operations Manager Intel Corporation February 2001  –  January 2002  (1 year) Created and managed the Broadcast Operations Center to support new business group working to develop a service to provide a subscription service for movie package downloads to local client desktop box. Group also was designing and developing the desktop box to receive the movie packages for storage and playback. Group shutdown in January 2002. Hosting Services Manager - Intel Online Services Intel Corporation April 1999  –  February 2001  (1 year 11 months) Managed the Hosting Services Team in the Intel Online Services Engineering organization. Team created the OS and Application platforms loaded on servers to support clients looking for hosting services. Intel Online Services shutdown in early 2002. Hosting Services Manager - Intel Online Services Intel Corporation April 1999  –  February 2001  (1 year 11 months) Managed the Hosting Services Team in the Intel Online Services Engineering organization. Team created the OS and Application platforms loaded on servers to support clients looking for hosting services. Intel Online Services shutdown in early 2002. Oregon / Utah Server Operations Manager Intel Corporation March 1995  –  April 1999  (4 years 2 months) Managed the Server Operations team for both Oregon and Utah Intel locations (40 professional and technical personnel). Served on the Americas Regional Operations Management Team, Enterprise Change Control Development Team, and Datacenter Design Team. Oregon / Utah Server Operations Manager Intel Corporation March 1995  –  April 1999  (4 years 2 months) Managed the Server Operations team for both Oregon and Utah Intel locations (40 professional and technical personnel). Served on the Americas Regional Operations Management Team, Enterprise Change Control Development Team, and Datacenter Design Team. Senior IS Auditor Sisters of Providence Health System February 1994  –  March 1995  (1 year 2 months) Created the IS Audit position and audited the Health System IS systems and business continuity plans. Senior IS Auditor Sisters of Providence Health System February 1994  –  March 1995  (1 year 2 months) Created the IS Audit position and audited the Health System IS systems and business continuity plans. Senior IS Auditor First Interstate Bank June 1992  –  February 1994  (1 year 9 months) Audited bank financial systems and supported Financial Audit teams in IS audits. Senior IS Auditor First Interstate Bank June 1992  –  February 1994  (1 year 9 months) Audited bank financial systems and supported Financial Audit teams in IS audits. Technical Services Operations Manager San Jacinto Savings Association August 1990  –  March 1992  (1 year 8 months) Managed the Help Desk, Client Desktop Technical Support, Network and Telecom Engineers and Server Operations teams. Technical Services Operations Manager San Jacinto Savings Association August 1990  –  March 1992  (1 year 8 months) Managed the Help Desk, Client Desktop Technical Support, Network and Telecom Engineers and Server Operations teams. Senior IS Auditor San Jacinto Savings Association January 1989  –  August 1990  (1 year 8 months) Audited the financial banking systems indepently and provided IS audit support to the Financial Audit team. Senior IS Auditor San Jacinto Savings Association January 1989  –  August 1990  (1 year 8 months) Audited the financial banking systems indepently and provided IS audit support to the Financial Audit team. Corporate Disaster Recovery Administrator Enron December 1986  –  December 1988  (2 years 1 month) Created, maintained and coordinated tests of coporate information system business continuity plans. Started with seven individual plans and created a uniform plan template to span all seven datacenters. Coordinated the business continuity plans for corporate datacenter consolidation from seven to three. Coordinated the preparation and execution of the recovery process in preparation for hurricane Gilbert. Corporate Disaster Recovery Administrator Enron December 1986  –  December 1988  (2 years 1 month) Created, maintained and coordinated tests of coporate information system business continuity plans. Started with seven individual plans and created a uniform plan template to span all seven datacenters. Coordinated the business continuity plans for corporate datacenter consolidation from seven to three. Coordinated the preparation and execution of the recovery process in preparation for hurricane Gilbert. Senior IS Auditor Allied Bancshares June 1984  –  December 1986  (2 years 7 months) Audit MVS and VM mainframe operating systems and modeled financial systems and third party bond calculation systems for correctness and accuracy. Senior IS Auditor Allied Bancshares June 1984  –  December 1986  (2 years 7 months) Audit MVS and VM mainframe operating systems and modeled financial systems and third party bond calculation systems for correctness and accuracy. Senior IS Auditor Gulf Oil September 1981  –  June 1984  (2 years 10 months) Audited MVS and VM mainframe operating system and related security controls. Supported Financial Audit team with Oil & Gas Lease Royalty system controls and security. Modeled in FOCUS, CARS, STRATA and CULPRIT applications that simulated production applications to support Financial Audit in assurance production applications were processing data correctly and accurately. Audited automated fuel dispensing terminals and related controls and security systems. Senior IS Auditor Gulf Oil September 1981  –  June 1984  (2 years 10 months) Audited MVS and VM mainframe operating system and related security controls. Supported Financial Audit team with Oil & Gas Lease Royalty system controls and security. Modeled in FOCUS, CARS, STRATA and CULPRIT applications that simulated production applications to support Financial Audit in assurance production applications were processing data correctly and accurately. Audited automated fuel dispensing terminals and related controls and security systems. Information Systems (IS) Auditor Capital Bank, NA January 1981  –  September 1981  (9 months) Information Systems Audit within the Internal Audit department. Audited financial systems related to Commercial Lending, Foreign Currency and general bank Financial automated systems. Information Systems (IS) Auditor Capital Bank, NA January 1981  –  September 1981  (9 months) Information Systems Audit within the Internal Audit department. Audited financial systems related to Commercial Lending, Foreign Currency and general bank Financial automated systems. Education Houston Baptist University MS,  Management of Computer Science 1983  – 1985 University of Houston BS,  Accounting 1978  – 1982 Activities and Societies:  Beta Alpha Psi National Accounting Honor Fraternity University of Houston BBA,  Finance 1974  – 1977 Activities and Societies:  Army ROTC ,  Alpha Phi Omega Fraternity Houston Baptist University MS,  Management of Computer Science 1983  – 1985 Houston Baptist University MS,  Management of Computer Science 1983  – 1985 Houston Baptist University MS,  Management of Computer Science 1983  – 1985 University of Houston BS,  Accounting 1978  – 1982 Activities and Societies:  Beta Alpha Psi National Accounting Honor Fraternity University of Houston BS,  Accounting 1978  – 1982 Activities and Societies:  Beta Alpha Psi National Accounting Honor Fraternity University of Houston BS,  Accounting 1978  – 1982 Activities and Societies:  Beta Alpha Psi National Accounting Honor Fraternity University of Houston BBA,  Finance 1974  – 1977 Activities and Societies:  Army ROTC ,  Alpha Phi Omega Fraternity University of Houston BBA,  Finance 1974  – 1977 Activities and Societies:  Army ROTC ,  Alpha Phi Omega Fraternity University of Houston BBA,  Finance 1974  – 1977 Activities and Societies:  Army ROTC ,  Alpha Phi Omega Fraternity Honors & Awards Additional Honors & Awards CCNP, MCSE, CISA Additional Honors & Awards CCNP, MCSE, CISA Additional Honors & Awards CCNP, MCSE, CISA Additional Honors & Awards CCNP, MCSE, CISA ", "Skills Active Directory Linux Perl Project Management Management DNS Microsoft Exchange Data Center DHCP Cloud Computing Security Enterprise Software Strategy Virtualization Networking Skills  Active Directory Linux Perl Project Management Management DNS Microsoft Exchange Data Center DHCP Cloud Computing Security Enterprise Software Strategy Virtualization Networking Active Directory Linux Perl Project Management Management DNS Microsoft Exchange Data Center DHCP Cloud Computing Security Enterprise Software Strategy Virtualization Networking Active Directory Linux Perl Project Management Management DNS Microsoft Exchange Data Center DHCP Cloud Computing Security Enterprise Software Strategy Virtualization Networking ", "Experience Senior Network Specialist Intel Corp IT September 1996  – Present (19 years) Network management application specialist for global corporate network. Senior Network Engineer Intel Corporation 1996  – Present (19 years) Various network support postions. Senior network engineer for large scale LAN designs. IT Construction Project Manager Intel Corp IT April 1999  –  January 2002  (2 years 10 months) Responsible for construction schecule and budget (>$10M). Design consultantant and approver for IT, network, voice and AV for large construction projects. Network Engineer Boeing Commercial Airplanes January 1985  –  September 1997  (12 years 9 months) All levels of network support from operations to network design to network product certification. Senior Network Specialist Intel Corp IT September 1996  – Present (19 years) Network management application specialist for global corporate network. Senior Network Specialist Intel Corp IT September 1996  – Present (19 years) Network management application specialist for global corporate network. Senior Network Engineer Intel Corporation 1996  – Present (19 years) Various network support postions. Senior network engineer for large scale LAN designs. Senior Network Engineer Intel Corporation 1996  – Present (19 years) Various network support postions. Senior network engineer for large scale LAN designs. IT Construction Project Manager Intel Corp IT April 1999  –  January 2002  (2 years 10 months) Responsible for construction schecule and budget (>$10M). Design consultantant and approver for IT, network, voice and AV for large construction projects. IT Construction Project Manager Intel Corp IT April 1999  –  January 2002  (2 years 10 months) Responsible for construction schecule and budget (>$10M). Design consultantant and approver for IT, network, voice and AV for large construction projects. Network Engineer Boeing Commercial Airplanes January 1985  –  September 1997  (12 years 9 months) All levels of network support from operations to network design to network product certification. Network Engineer Boeing Commercial Airplanes January 1985  –  September 1997  (12 years 9 months) All levels of network support from operations to network design to network product certification. Education University of California, Santa Barbara 1966  – 1970 University of California, Santa Barbara 1966  – 1970 University of California, Santa Barbara 1966  – 1970 University of California, Santa Barbara 1966  – 1970 ", "Experience Senior Systems Engineer Specialist ManpowerGroup October 2010  –  March 2014  (3 years 6 months) Maintain/ Manage/ Design enterprise solutions for data center, remote offices (400+) within NAFTA. Support for Cisco Unified platform version 4 thru 9.1.2.10000-28, Wireless, Security, and many customized solutions in a 24x7 environment. 30% travel for large projects to implement full enterprise solution of Voice, Wireless, and infrastructure. Maintain/ Manage/ Design BIGIP F5, Brocades, Netapp, EMC - Clarion, Cisco Enterprise HA Wireless, Prime Suite, Cisco SNTC - Collector.  \nCisco Devices 6500, 7200, 3700, 3600, 3500, 1800, 2600, 2900 series, FWSM, PIX, ASA, WLC, WCS, ACS, CUCM, CCX, UCCX CUP (Presence Server). \nSpecialties - CCNA, CCNP, CCVP, BICSI, VMWARE ESXi, NET+, A+, Lucent Fiber Master, AT&T Systemax Senior Network Engineer Leoni October 2009  –  October 2010  (1 year 1 month) Support Cisco wireless with account creation with WLAN controller for enterprise and vendor access. \nDiagnose network problem with AT&T, Verizon, Sprint with contractual service level agreements. \nUse current technology (Blackberry, Remedy ticket system, Voice Mail, Email, etc..) for resolution, follow-ups, 24x7 environment, escalations \nCoach and Mentor T1, and T2 associates aprox (8-12 associates) with processes, training, any updates in fast changing environments. \nCisco devices 6500, 4500, 7200, 3750, and 3600 series switches, routers, FWSM, PIX. Senior Network Engineer Intel Corporation April 2005  –  January 2009  (3 years 10 months) Develop and strengthen working relationships with other IT and internal units, customers and partners. \nEnsure daily activities are aligned with Network Operations Division priorities and objectives \nSupervise and trained technical staff; aided staff to troubleshoot complex customer issues. \nSupported and maintained local network, VOIP, wireless, and security intrusion. \nProvided support in 24 X 7 global supports within corporate guidelines. \nProvided Wireless support and network security Network Engineer AAA NCNU 2008  –  2008  (less than a year) Network Engineer AT&T March 1997  –  March 2005  (8 years 1 month) Maintained security to corporate network with firewalls, Cisco Network Intrusion Detection system.  \nUpdated Cat OS and IOS systems to meet corporate requirements and active changes in environment. Senior Systems Engineer Specialist ManpowerGroup October 2010  –  March 2014  (3 years 6 months) Maintain/ Manage/ Design enterprise solutions for data center, remote offices (400+) within NAFTA. Support for Cisco Unified platform version 4 thru 9.1.2.10000-28, Wireless, Security, and many customized solutions in a 24x7 environment. 30% travel for large projects to implement full enterprise solution of Voice, Wireless, and infrastructure. Maintain/ Manage/ Design BIGIP F5, Brocades, Netapp, EMC - Clarion, Cisco Enterprise HA Wireless, Prime Suite, Cisco SNTC - Collector.  \nCisco Devices 6500, 7200, 3700, 3600, 3500, 1800, 2600, 2900 series, FWSM, PIX, ASA, WLC, WCS, ACS, CUCM, CCX, UCCX CUP (Presence Server). \nSpecialties - CCNA, CCNP, CCVP, BICSI, VMWARE ESXi, NET+, A+, Lucent Fiber Master, AT&T Systemax Senior Systems Engineer Specialist ManpowerGroup October 2010  –  March 2014  (3 years 6 months) Maintain/ Manage/ Design enterprise solutions for data center, remote offices (400+) within NAFTA. Support for Cisco Unified platform version 4 thru 9.1.2.10000-28, Wireless, Security, and many customized solutions in a 24x7 environment. 30% travel for large projects to implement full enterprise solution of Voice, Wireless, and infrastructure. Maintain/ Manage/ Design BIGIP F5, Brocades, Netapp, EMC - Clarion, Cisco Enterprise HA Wireless, Prime Suite, Cisco SNTC - Collector.  \nCisco Devices 6500, 7200, 3700, 3600, 3500, 1800, 2600, 2900 series, FWSM, PIX, ASA, WLC, WCS, ACS, CUCM, CCX, UCCX CUP (Presence Server). \nSpecialties - CCNA, CCNP, CCVP, BICSI, VMWARE ESXi, NET+, A+, Lucent Fiber Master, AT&T Systemax Senior Network Engineer Leoni October 2009  –  October 2010  (1 year 1 month) Support Cisco wireless with account creation with WLAN controller for enterprise and vendor access. \nDiagnose network problem with AT&T, Verizon, Sprint with contractual service level agreements. \nUse current technology (Blackberry, Remedy ticket system, Voice Mail, Email, etc..) for resolution, follow-ups, 24x7 environment, escalations \nCoach and Mentor T1, and T2 associates aprox (8-12 associates) with processes, training, any updates in fast changing environments. \nCisco devices 6500, 4500, 7200, 3750, and 3600 series switches, routers, FWSM, PIX. Senior Network Engineer Leoni October 2009  –  October 2010  (1 year 1 month) Support Cisco wireless with account creation with WLAN controller for enterprise and vendor access. \nDiagnose network problem with AT&T, Verizon, Sprint with contractual service level agreements. \nUse current technology (Blackberry, Remedy ticket system, Voice Mail, Email, etc..) for resolution, follow-ups, 24x7 environment, escalations \nCoach and Mentor T1, and T2 associates aprox (8-12 associates) with processes, training, any updates in fast changing environments. \nCisco devices 6500, 4500, 7200, 3750, and 3600 series switches, routers, FWSM, PIX. Senior Network Engineer Intel Corporation April 2005  –  January 2009  (3 years 10 months) Develop and strengthen working relationships with other IT and internal units, customers and partners. \nEnsure daily activities are aligned with Network Operations Division priorities and objectives \nSupervise and trained technical staff; aided staff to troubleshoot complex customer issues. \nSupported and maintained local network, VOIP, wireless, and security intrusion. \nProvided support in 24 X 7 global supports within corporate guidelines. \nProvided Wireless support and network security Senior Network Engineer Intel Corporation April 2005  –  January 2009  (3 years 10 months) Develop and strengthen working relationships with other IT and internal units, customers and partners. \nEnsure daily activities are aligned with Network Operations Division priorities and objectives \nSupervise and trained technical staff; aided staff to troubleshoot complex customer issues. \nSupported and maintained local network, VOIP, wireless, and security intrusion. \nProvided support in 24 X 7 global supports within corporate guidelines. \nProvided Wireless support and network security Network Engineer AAA NCNU 2008  –  2008  (less than a year) Network Engineer AAA NCNU 2008  –  2008  (less than a year) Network Engineer AT&T March 1997  –  March 2005  (8 years 1 month) Maintained security to corporate network with firewalls, Cisco Network Intrusion Detection system.  \nUpdated Cat OS and IOS systems to meet corporate requirements and active changes in environment. Network Engineer AT&T March 1997  –  March 2005  (8 years 1 month) Maintained security to corporate network with firewalls, Cisco Network Intrusion Detection system.  \nUpdated Cat OS and IOS systems to meet corporate requirements and active changes in environment. Skills VoIP Network Engineering Network Administration Network Security Wireless Networking Data Center Avaya Cisco Technologies ESXi Linux Fiber Optics Networking Routers Switches Firewalls Cisco Call Manager VMware ESX See 2+     See less Skills  VoIP Network Engineering Network Administration Network Security Wireless Networking Data Center Avaya Cisco Technologies ESXi Linux Fiber Optics Networking Routers Switches Firewalls Cisco Call Manager VMware ESX See 2+     See less VoIP Network Engineering Network Administration Network Security Wireless Networking Data Center Avaya Cisco Technologies ESXi Linux Fiber Optics Networking Routers Switches Firewalls Cisco Call Manager VMware ESX See 2+     See less VoIP Network Engineering Network Administration Network Security Wireless Networking Data Center Avaya Cisco Technologies ESXi Linux Fiber Optics Networking Routers Switches Firewalls Cisco Call Manager VMware ESX See 2+     See less Education Buena High Western International University Buena High Buena High Buena High Western International University Western International University Western International University ", "Experience Principal Software Engineer Covidien 2005  – Present (10 years) Senior Network Engineer Intel Corporation April 2003  –  December 2004  (1 year 9 months) Senior Software Engineer VxTel Inc. (Intel buyout) August 2000  –  April 2003  (2 years 9 months) Senior Software Engineer Marquette Electronics January 1978  –  January 2000  (22 years 1 month) Milwaukee, WI Principal Software Engineer Covidien 2005  – Present (10 years) Principal Software Engineer Covidien 2005  – Present (10 years) Senior Network Engineer Intel Corporation April 2003  –  December 2004  (1 year 9 months) Senior Network Engineer Intel Corporation April 2003  –  December 2004  (1 year 9 months) Senior Software Engineer VxTel Inc. (Intel buyout) August 2000  –  April 2003  (2 years 9 months) Senior Software Engineer VxTel Inc. (Intel buyout) August 2000  –  April 2003  (2 years 9 months) Senior Software Engineer Marquette Electronics January 1978  –  January 2000  (22 years 1 month) Milwaukee, WI Senior Software Engineer Marquette Electronics January 1978  –  January 2000  (22 years 1 month) Milwaukee, WI Skills Testing System Architecture Debugging Embedded Software Device Drivers Hardware Architecture Firmware C TCP/IP Embedded Systems VxWorks Software Engineering RTOS Design Control Software Development Software Design See 1+     See less Skills  Testing System Architecture Debugging Embedded Software Device Drivers Hardware Architecture Firmware C TCP/IP Embedded Systems VxWorks Software Engineering RTOS Design Control Software Development Software Design See 1+     See less Testing System Architecture Debugging Embedded Software Device Drivers Hardware Architecture Firmware C TCP/IP Embedded Systems VxWorks Software Engineering RTOS Design Control Software Development Software Design See 1+     See less Testing System Architecture Debugging Embedded Software Device Drivers Hardware Architecture Firmware C TCP/IP Embedded Systems VxWorks Software Engineering RTOS Design Control Software Development Software Design See 1+     See less Education Marquette University Master of Science (MS),  Electrical Engineering University of Wisconsin-Madison Bachelor of Science (BS),  Applied Mathematics & Engineering Physics Marquette University Master of Science (MS),  Electrical Engineering Marquette University Master of Science (MS),  Electrical Engineering Marquette University Master of Science (MS),  Electrical Engineering University of Wisconsin-Madison Bachelor of Science (BS),  Applied Mathematics & Engineering Physics University of Wisconsin-Madison Bachelor of Science (BS),  Applied Mathematics & Engineering Physics University of Wisconsin-Madison Bachelor of Science (BS),  Applied Mathematics & Engineering Physics ", "Experience Senior Network Engineer Intel Corporation Network Telecom Specialist Intel Corporation November 2011  – Present (3 years 10 months) VN Providing support for the IT network infrastructure. Diagnosing and troubleshooting complex network and infrastructure issues, network capacity management, standard network expansion activities and hardware and/or software upgrades. Be responsible to work with the network team to improve reliability and performance of all network services or processes using statistical process control methods, LAN implementation and infrastructure upgrades, participate in on call rotation to provide 24x7 on call support.  Automation Engineer Intel Corporation June 2009  –  November 2011  (2 years 6 months) Vietnam Responsible for the distribution, installation, operations, and troubleshooting of site distributed computing environment. Participate in hardware/software projects and deployment plans. Analyze work group systems and recommend solutions. Execute production processes. Perform/manage changes to servers/environment. Manage virus protection procedures on server. Drive day to day business needs by managing processes and/or workflow. Responds to customer/client requests or events as they occur. Develops solutions to problems utilizing formal education and judgment. Support 24x7 for any incidents at Factory Automation systems. Senior Network Engineer Intel Corporation Senior Network Engineer Intel Corporation Network Telecom Specialist Intel Corporation November 2011  – Present (3 years 10 months) VN Providing support for the IT network infrastructure. Diagnosing and troubleshooting complex network and infrastructure issues, network capacity management, standard network expansion activities and hardware and/or software upgrades. Be responsible to work with the network team to improve reliability and performance of all network services or processes using statistical process control methods, LAN implementation and infrastructure upgrades, participate in on call rotation to provide 24x7 on call support.  Network Telecom Specialist Intel Corporation November 2011  – Present (3 years 10 months) VN Providing support for the IT network infrastructure. Diagnosing and troubleshooting complex network and infrastructure issues, network capacity management, standard network expansion activities and hardware and/or software upgrades. Be responsible to work with the network team to improve reliability and performance of all network services or processes using statistical process control methods, LAN implementation and infrastructure upgrades, participate in on call rotation to provide 24x7 on call support.  Automation Engineer Intel Corporation June 2009  –  November 2011  (2 years 6 months) Vietnam Responsible for the distribution, installation, operations, and troubleshooting of site distributed computing environment. Participate in hardware/software projects and deployment plans. Analyze work group systems and recommend solutions. Execute production processes. Perform/manage changes to servers/environment. Manage virus protection procedures on server. Drive day to day business needs by managing processes and/or workflow. Responds to customer/client requests or events as they occur. Develops solutions to problems utilizing formal education and judgment. Support 24x7 for any incidents at Factory Automation systems. Automation Engineer Intel Corporation June 2009  –  November 2011  (2 years 6 months) Vietnam Responsible for the distribution, installation, operations, and troubleshooting of site distributed computing environment. Participate in hardware/software projects and deployment plans. Analyze work group systems and recommend solutions. Execute production processes. Perform/manage changes to servers/environment. Manage virus protection procedures on server. Drive day to day business needs by managing processes and/or workflow. Responds to customer/client requests or events as they occur. Develops solutions to problems utilizing formal education and judgment. Support 24x7 for any incidents at Factory Automation systems. ", "Summary Senior Network and Security Engineer with 15+ years experience supporting a global enterprise network for Intel Corporation, the National Institute of Health Hosting division, and classified government networks. As the Datacenter and Internet DMZ Service Owner at Intel, I led a team to maintain the enterprise datacenter and Internet DMZ network environments, which houses numerous mission critical applications. As a subject matter expert with Northrop Grumman, I managed and supported the BIG IP and firewall environments at NIH. In a classified network environment, I have designed and architected the next generation data center network infrastructure and next generation Mobility IT infrastructure. I have a Master’s Degree in Telecommunications and several industry certifications (Cisco CCNP and CCDP, CISSP, PMP, CWNA and F5 PCL). Summary Senior Network and Security Engineer with 15+ years experience supporting a global enterprise network for Intel Corporation, the National Institute of Health Hosting division, and classified government networks. As the Datacenter and Internet DMZ Service Owner at Intel, I led a team to maintain the enterprise datacenter and Internet DMZ network environments, which houses numerous mission critical applications. As a subject matter expert with Northrop Grumman, I managed and supported the BIG IP and firewall environments at NIH. In a classified network environment, I have designed and architected the next generation data center network infrastructure and next generation Mobility IT infrastructure. I have a Master’s Degree in Telecommunications and several industry certifications (Cisco CCNP and CCDP, CISSP, PMP, CWNA and F5 PCL). Senior Network and Security Engineer with 15+ years experience supporting a global enterprise network for Intel Corporation, the National Institute of Health Hosting division, and classified government networks. As the Datacenter and Internet DMZ Service Owner at Intel, I led a team to maintain the enterprise datacenter and Internet DMZ network environments, which houses numerous mission critical applications. As a subject matter expert with Northrop Grumman, I managed and supported the BIG IP and firewall environments at NIH. In a classified network environment, I have designed and architected the next generation data center network infrastructure and next generation Mobility IT infrastructure. I have a Master’s Degree in Telecommunications and several industry certifications (Cisco CCNP and CCDP, CISSP, PMP, CWNA and F5 PCL). Senior Network and Security Engineer with 15+ years experience supporting a global enterprise network for Intel Corporation, the National Institute of Health Hosting division, and classified government networks. As the Datacenter and Internet DMZ Service Owner at Intel, I led a team to maintain the enterprise datacenter and Internet DMZ network environments, which houses numerous mission critical applications. As a subject matter expert with Northrop Grumman, I managed and supported the BIG IP and firewall environments at NIH. In a classified network environment, I have designed and architected the next generation data center network infrastructure and next generation Mobility IT infrastructure. I have a Master’s Degree in Telecommunications and several industry certifications (Cisco CCNP and CCDP, CISSP, PMP, CWNA and F5 PCL). Experience System Engineer Aruba Networks October 2014  – Present (11 months) Maryland System Engineer covering the DOD space working on the CSFC solution for connectivity. Chief Engineer/Network Architect/SME Northrop Grumman August 2008  –  October 2014  (6 years 3 months) Maryland Manage and support National Institute of Health hosting network and DOD government network environments. \nChief Engineer/Network Architect for large DOD Network program. \nSME on F5 BIG IP for National Institute of Health Senior Network Engineer National Institutes of Health 2008  –  2010  (2 years) Senior Network Engineer National Institutes of Health 2008  –  2010  (2 years) Senior Network Engineer Intel Corporation July 1998  –  July 2008  (10 years 1 month) Lead, Managed, and supported Intel's Internet DMZ and Enterprise DMZ. DMZ Service Owner Intel Corperation July 1998  –  July 2008  (10 years 1 month) Lead, manage and supported Intel's Internet DMZ, globally. System Engineer Aruba Networks October 2014  – Present (11 months) Maryland System Engineer covering the DOD space working on the CSFC solution for connectivity. System Engineer Aruba Networks October 2014  – Present (11 months) Maryland System Engineer covering the DOD space working on the CSFC solution for connectivity. Chief Engineer/Network Architect/SME Northrop Grumman August 2008  –  October 2014  (6 years 3 months) Maryland Manage and support National Institute of Health hosting network and DOD government network environments. \nChief Engineer/Network Architect for large DOD Network program. \nSME on F5 BIG IP for National Institute of Health Chief Engineer/Network Architect/SME Northrop Grumman August 2008  –  October 2014  (6 years 3 months) Maryland Manage and support National Institute of Health hosting network and DOD government network environments. \nChief Engineer/Network Architect for large DOD Network program. \nSME on F5 BIG IP for National Institute of Health Senior Network Engineer National Institutes of Health 2008  –  2010  (2 years) Senior Network Engineer National Institutes of Health 2008  –  2010  (2 years) Senior Network Engineer National Institutes of Health 2008  –  2010  (2 years) Senior Network Engineer National Institutes of Health 2008  –  2010  (2 years) Senior Network Engineer Intel Corporation July 1998  –  July 2008  (10 years 1 month) Lead, Managed, and supported Intel's Internet DMZ and Enterprise DMZ. Senior Network Engineer Intel Corporation July 1998  –  July 2008  (10 years 1 month) Lead, Managed, and supported Intel's Internet DMZ and Enterprise DMZ. DMZ Service Owner Intel Corperation July 1998  –  July 2008  (10 years 1 month) Lead, manage and supported Intel's Internet DMZ, globally. DMZ Service Owner Intel Corperation July 1998  –  July 2008  (10 years 1 month) Lead, manage and supported Intel's Internet DMZ, globally. Skills CISSP Skills  CISSP CISSP CISSP Education University of Maryland College Park Masters,  Telecommunications 1997  – 1998 University of Maryland College Park B.S.,  Electrical Engineering University of Maryland College Park B.S.,  Mechanical Engineering University of Maryland College Park Masters,  Telecommunications 1997  – 1998 University of Maryland College Park Masters,  Telecommunications 1997  – 1998 University of Maryland College Park Masters,  Telecommunications 1997  – 1998 University of Maryland College Park B.S.,  Electrical Engineering University of Maryland College Park B.S.,  Electrical Engineering University of Maryland College Park B.S.,  Electrical Engineering University of Maryland College Park B.S.,  Mechanical Engineering University of Maryland College Park B.S.,  Mechanical Engineering University of Maryland College Park B.S.,  Mechanical Engineering ", "Summary Local and Wide Area Network Infrastructure Design and Implementation - LAN and WAN protocols and topologies; Wireless Networks (802.11a/b/g/n); VOIP/VOFR; Experience at trouble shooting the Physical, Data Link and Network layers; Experienced at managing both local and national level carrier issues; Project Management; Bandwidth analysis. \n \nCisco router/switch implementation/configuration – Including IOS installation/upgrades; IP Sub-netting and Super-netting; Routing protocols (IBGP, EIGRP, OSPF, BGP); VLAN Implementation; NAT and VPN; QOS/PBM; NEXT Generation ASA Firewalls; Experienced at troubleshooting routing problems; Nortel, Enterasys & 3 Com Switches; Watch Guard Firewalls; Nokia/Checkpoint and Palo Alto NG Firewalls. \n \nCisco Wireless Network Design and Implementation – Including 802.11a/b/g, WCS, WPA2; Radius authentication; Lightweight and autonomous modes; Site survey processes and tools; Wireless bridging; Security concerns; Proxim Certified Wireless Engineer. \n \nCisco ASA, WAAS and ACE load balancer Design and Implementation – ; Rule impact analysis; TCP flow optimization; WAN bandwidth reduction; Application acceleration and High availability.  \n \nEnterprise Network Security – Cisco Security Architecture; Security Policy Development; Bluecoat™ Proxy Server; SCADA, SOX, PCI and HIPAA compliance. \n \nEnterprise Network Management/Administration – Support of multiple vendor implementations, performance measurement, Network monitoring tools ie .PRTG, Info Vista, Solar Winds etc.; IP subnet management and DHCP structure; DNS services; Infolblox™ DNS Server \n \nProject Management - Development of Implementation plans; Development of Installation Procedures; Resource tracking; Coordination between teams; Gantts Charts; Project status reporting; Growth and capacity planning. \n \nNetwork Infrastructure in both data center and harsh environments, cable plant design/Implementation ; distribution/computer room layout; power/environmental considerations; premises distribution. Specialties:Cisco Certified Network Professional Summary Local and Wide Area Network Infrastructure Design and Implementation - LAN and WAN protocols and topologies; Wireless Networks (802.11a/b/g/n); VOIP/VOFR; Experience at trouble shooting the Physical, Data Link and Network layers; Experienced at managing both local and national level carrier issues; Project Management; Bandwidth analysis. \n \nCisco router/switch implementation/configuration – Including IOS installation/upgrades; IP Sub-netting and Super-netting; Routing protocols (IBGP, EIGRP, OSPF, BGP); VLAN Implementation; NAT and VPN; QOS/PBM; NEXT Generation ASA Firewalls; Experienced at troubleshooting routing problems; Nortel, Enterasys & 3 Com Switches; Watch Guard Firewalls; Nokia/Checkpoint and Palo Alto NG Firewalls. \n \nCisco Wireless Network Design and Implementation – Including 802.11a/b/g, WCS, WPA2; Radius authentication; Lightweight and autonomous modes; Site survey processes and tools; Wireless bridging; Security concerns; Proxim Certified Wireless Engineer. \n \nCisco ASA, WAAS and ACE load balancer Design and Implementation – ; Rule impact analysis; TCP flow optimization; WAN bandwidth reduction; Application acceleration and High availability.  \n \nEnterprise Network Security – Cisco Security Architecture; Security Policy Development; Bluecoat™ Proxy Server; SCADA, SOX, PCI and HIPAA compliance. \n \nEnterprise Network Management/Administration – Support of multiple vendor implementations, performance measurement, Network monitoring tools ie .PRTG, Info Vista, Solar Winds etc.; IP subnet management and DHCP structure; DNS services; Infolblox™ DNS Server \n \nProject Management - Development of Implementation plans; Development of Installation Procedures; Resource tracking; Coordination between teams; Gantts Charts; Project status reporting; Growth and capacity planning. \n \nNetwork Infrastructure in both data center and harsh environments, cable plant design/Implementation ; distribution/computer room layout; power/environmental considerations; premises distribution. Specialties:Cisco Certified Network Professional Local and Wide Area Network Infrastructure Design and Implementation - LAN and WAN protocols and topologies; Wireless Networks (802.11a/b/g/n); VOIP/VOFR; Experience at trouble shooting the Physical, Data Link and Network layers; Experienced at managing both local and national level carrier issues; Project Management; Bandwidth analysis. \n \nCisco router/switch implementation/configuration – Including IOS installation/upgrades; IP Sub-netting and Super-netting; Routing protocols (IBGP, EIGRP, OSPF, BGP); VLAN Implementation; NAT and VPN; QOS/PBM; NEXT Generation ASA Firewalls; Experienced at troubleshooting routing problems; Nortel, Enterasys & 3 Com Switches; Watch Guard Firewalls; Nokia/Checkpoint and Palo Alto NG Firewalls. \n \nCisco Wireless Network Design and Implementation – Including 802.11a/b/g, WCS, WPA2; Radius authentication; Lightweight and autonomous modes; Site survey processes and tools; Wireless bridging; Security concerns; Proxim Certified Wireless Engineer. \n \nCisco ASA, WAAS and ACE load balancer Design and Implementation – ; Rule impact analysis; TCP flow optimization; WAN bandwidth reduction; Application acceleration and High availability.  \n \nEnterprise Network Security – Cisco Security Architecture; Security Policy Development; Bluecoat™ Proxy Server; SCADA, SOX, PCI and HIPAA compliance. \n \nEnterprise Network Management/Administration – Support of multiple vendor implementations, performance measurement, Network monitoring tools ie .PRTG, Info Vista, Solar Winds etc.; IP subnet management and DHCP structure; DNS services; Infolblox™ DNS Server \n \nProject Management - Development of Implementation plans; Development of Installation Procedures; Resource tracking; Coordination between teams; Gantts Charts; Project status reporting; Growth and capacity planning. \n \nNetwork Infrastructure in both data center and harsh environments, cable plant design/Implementation ; distribution/computer room layout; power/environmental considerations; premises distribution. Specialties:Cisco Certified Network Professional Local and Wide Area Network Infrastructure Design and Implementation - LAN and WAN protocols and topologies; Wireless Networks (802.11a/b/g/n); VOIP/VOFR; Experience at trouble shooting the Physical, Data Link and Network layers; Experienced at managing both local and national level carrier issues; Project Management; Bandwidth analysis. \n \nCisco router/switch implementation/configuration – Including IOS installation/upgrades; IP Sub-netting and Super-netting; Routing protocols (IBGP, EIGRP, OSPF, BGP); VLAN Implementation; NAT and VPN; QOS/PBM; NEXT Generation ASA Firewalls; Experienced at troubleshooting routing problems; Nortel, Enterasys & 3 Com Switches; Watch Guard Firewalls; Nokia/Checkpoint and Palo Alto NG Firewalls. \n \nCisco Wireless Network Design and Implementation – Including 802.11a/b/g, WCS, WPA2; Radius authentication; Lightweight and autonomous modes; Site survey processes and tools; Wireless bridging; Security concerns; Proxim Certified Wireless Engineer. \n \nCisco ASA, WAAS and ACE load balancer Design and Implementation – ; Rule impact analysis; TCP flow optimization; WAN bandwidth reduction; Application acceleration and High availability.  \n \nEnterprise Network Security – Cisco Security Architecture; Security Policy Development; Bluecoat™ Proxy Server; SCADA, SOX, PCI and HIPAA compliance. \n \nEnterprise Network Management/Administration – Support of multiple vendor implementations, performance measurement, Network monitoring tools ie .PRTG, Info Vista, Solar Winds etc.; IP subnet management and DHCP structure; DNS services; Infolblox™ DNS Server \n \nProject Management - Development of Implementation plans; Development of Installation Procedures; Resource tracking; Coordination between teams; Gantts Charts; Project status reporting; Growth and capacity planning. \n \nNetwork Infrastructure in both data center and harsh environments, cable plant design/Implementation ; distribution/computer room layout; power/environmental considerations; premises distribution. Specialties:Cisco Certified Network Professional Skills Skills     "]}