{"position": "Senior Research Scientist", "company": "Intel Corporation", "profiles": ["Experience Senior Research Scientist Intel Corporation August 2013  – Present (2 years 1 month) Plano, TX Member of Technical Staff Alcatel-Lucent March 2009  –  August 2013  (4 years 6 months) Member of scientific staff Nortel April 2007  –  February 2009  (1 year 11 months) Senior Standards Engineer Samsung Electronics December 2004  –  March 2007  (2 years 4 months) Grad student University of Alberta 2000  –  2004  (4 years) Senior Research Scientist Intel Corporation August 2013  – Present (2 years 1 month) Plano, TX Senior Research Scientist Intel Corporation August 2013  – Present (2 years 1 month) Plano, TX Member of Technical Staff Alcatel-Lucent March 2009  –  August 2013  (4 years 6 months) Member of Technical Staff Alcatel-Lucent March 2009  –  August 2013  (4 years 6 months) Member of scientific staff Nortel April 2007  –  February 2009  (1 year 11 months) Member of scientific staff Nortel April 2007  –  February 2009  (1 year 11 months) Senior Standards Engineer Samsung Electronics December 2004  –  March 2007  (2 years 4 months) Senior Standards Engineer Samsung Electronics December 2004  –  March 2007  (2 years 4 months) Grad student University of Alberta 2000  –  2004  (4 years) Grad student University of Alberta 2000  –  2004  (4 years) Skills Wireless Telecommunications LTE CDMA UMTS 3G 4G WiMAX 3GPP WCDMA RF GSM OFDM Skills  Wireless Telecommunications LTE CDMA UMTS 3G 4G WiMAX 3GPP WCDMA RF GSM OFDM Wireless Telecommunications LTE CDMA UMTS 3G 4G WiMAX 3GPP WCDMA RF GSM OFDM Wireless Telecommunications LTE CDMA UMTS 3G 4G WiMAX 3GPP WCDMA RF GSM OFDM Education University of Alberta Ph.D.,  Wireless Communications 2000  – 2004 The University of Hong Kong MPhil,  Telecommunications 1997  – 2000 University of Peradeniya BSc Eng,  Electrial and Electronics Engineering 1992  – 1996 University of Alberta Ph.D.,  Wireless Communications 2000  – 2004 University of Alberta Ph.D.,  Wireless Communications 2000  – 2004 University of Alberta Ph.D.,  Wireless Communications 2000  – 2004 The University of Hong Kong MPhil,  Telecommunications 1997  – 2000 The University of Hong Kong MPhil,  Telecommunications 1997  – 2000 The University of Hong Kong MPhil,  Telecommunications 1997  – 2000 University of Peradeniya BSc Eng,  Electrial and Electronics Engineering 1992  – 1996 University of Peradeniya BSc Eng,  Electrial and Electronics Engineering 1992  – 1996 University of Peradeniya BSc Eng,  Electrial and Electronics Engineering 1992  – 1996 ", "Experience Senior Research Scientist Intel Corporation Senior Research Scientist Intel Corporation Senior Research Scientist Intel Corporation Skills Simulations Design of Experiments Physics Algorithms Thin Films Semiconductors Characterization VLSI ASIC Verilog Management Skills  Simulations Design of Experiments Physics Algorithms Thin Films Semiconductors Characterization VLSI ASIC Verilog Management Simulations Design of Experiments Physics Algorithms Thin Films Semiconductors Characterization VLSI ASIC Verilog Management Simulations Design of Experiments Physics Algorithms Thin Films Semiconductors Characterization VLSI ASIC Verilog Management ", "Summary Research and advanced development in stimulating problems around distributed systems, security, fault tolerance, and programmability of complex systems. Specialties:distributed systems, security, fault tolerance Summary Research and advanced development in stimulating problems around distributed systems, security, fault tolerance, and programmability of complex systems. Specialties:distributed systems, security, fault tolerance Research and advanced development in stimulating problems around distributed systems, security, fault tolerance, and programmability of complex systems. Specialties:distributed systems, security, fault tolerance Research and advanced development in stimulating problems around distributed systems, security, fault tolerance, and programmability of complex systems. Specialties:distributed systems, security, fault tolerance Experience Senior Research Scientist Intel Corporation September 2003  –  August 2014  (11 years) Berkeley, CA, USA Basic research in conjunction with academic groups at several universities, as well as with R&D. Target of research is primarily to break new ground, communicate results openly to the research community, and provide the company with new directions. Researcher UC Berkeley 2010  –  2011  (1 year) Research Assistant Stanford University September 1995  –  September 2003  (8 years 1 month) Conducted basic computer science research in mobile computing, distributed systems, security, and fault tolerance. Advised by Mary Baker. Summer Intern International Computer Science Institute May 2001  –  October 2001  (6 months) Perform research on peer-to-peer applications in the face of benign and malicious attacks, study denial-of-service attacks against content distribution networks, implement and simulate the CAN distributed hash table. Supervised by Scott Shenker and Mark Handley. Summer Intern XEROX Palo Alto Research Center June 1996  –  June 1997  (1 year 1 month) Built a software framework for user-directed image segmentation, under David Marimont and Leo Guibas. Research Assistant Ethnikon kai Kapodistriakon Panepistimion Athinon, Department of Informatics June 1994  –  September 1995  (1 year 4 months) Designed and built a software system for airline crew scheduling using a constraint satisfaction programming framework. Targeted airline was Greece's national carrier, Olympic Airways. Work sponsored under a European Union grant. Supervised by Costas Halatsis and Afrodite Tsalgatidou. Senior Research Scientist Intel Corporation September 2003  –  August 2014  (11 years) Berkeley, CA, USA Basic research in conjunction with academic groups at several universities, as well as with R&D. Target of research is primarily to break new ground, communicate results openly to the research community, and provide the company with new directions. Senior Research Scientist Intel Corporation September 2003  –  August 2014  (11 years) Berkeley, CA, USA Basic research in conjunction with academic groups at several universities, as well as with R&D. Target of research is primarily to break new ground, communicate results openly to the research community, and provide the company with new directions. Researcher UC Berkeley 2010  –  2011  (1 year) Researcher UC Berkeley 2010  –  2011  (1 year) Research Assistant Stanford University September 1995  –  September 2003  (8 years 1 month) Conducted basic computer science research in mobile computing, distributed systems, security, and fault tolerance. Advised by Mary Baker. Research Assistant Stanford University September 1995  –  September 2003  (8 years 1 month) Conducted basic computer science research in mobile computing, distributed systems, security, and fault tolerance. Advised by Mary Baker. Summer Intern International Computer Science Institute May 2001  –  October 2001  (6 months) Perform research on peer-to-peer applications in the face of benign and malicious attacks, study denial-of-service attacks against content distribution networks, implement and simulate the CAN distributed hash table. Supervised by Scott Shenker and Mark Handley. Summer Intern International Computer Science Institute May 2001  –  October 2001  (6 months) Perform research on peer-to-peer applications in the face of benign and malicious attacks, study denial-of-service attacks against content distribution networks, implement and simulate the CAN distributed hash table. Supervised by Scott Shenker and Mark Handley. Summer Intern XEROX Palo Alto Research Center June 1996  –  June 1997  (1 year 1 month) Built a software framework for user-directed image segmentation, under David Marimont and Leo Guibas. Summer Intern XEROX Palo Alto Research Center June 1996  –  June 1997  (1 year 1 month) Built a software framework for user-directed image segmentation, under David Marimont and Leo Guibas. Research Assistant Ethnikon kai Kapodistriakon Panepistimion Athinon, Department of Informatics June 1994  –  September 1995  (1 year 4 months) Designed and built a software system for airline crew scheduling using a constraint satisfaction programming framework. Targeted airline was Greece's national carrier, Olympic Airways. Work sponsored under a European Union grant. Supervised by Costas Halatsis and Afrodite Tsalgatidou. Research Assistant Ethnikon kai Kapodistriakon Panepistimion Athinon, Department of Informatics June 1994  –  September 1995  (1 year 4 months) Designed and built a software system for airline crew scheduling using a constraint satisfaction programming framework. Targeted airline was Greece's national carrier, Olympic Airways. Work sponsored under a European Union grant. Supervised by Costas Halatsis and Afrodite Tsalgatidou. Skills Distributed Systems Algorithms Computer Science Programming Security Research Software Engineering C C++ Perl Linux Skills  Distributed Systems Algorithms Computer Science Programming Security Research Software Engineering C C++ Perl Linux Distributed Systems Algorithms Computer Science Programming Security Research Software Engineering C C++ Perl Linux Distributed Systems Algorithms Computer Science Programming Security Research Software Engineering C C++ Perl Linux Education Stanford University Ph.D.,  Computer Science 1997  – 2003 Dissertation title: \"Historic Integrity in Distributed Systems\" \nAdvisor: Mary Baker Stanford University MS,  Computer Science 1995  – 1997 Ethnikon kai Kapodistriakon Panepistimion Athinon BS,  Informatics 1990  – 1994 Stanford University Ph.D.,  Computer Science 1997  – 2003 Dissertation title: \"Historic Integrity in Distributed Systems\" \nAdvisor: Mary Baker Stanford University Ph.D.,  Computer Science 1997  – 2003 Dissertation title: \"Historic Integrity in Distributed Systems\" \nAdvisor: Mary Baker Stanford University Ph.D.,  Computer Science 1997  – 2003 Dissertation title: \"Historic Integrity in Distributed Systems\" \nAdvisor: Mary Baker Stanford University MS,  Computer Science 1995  – 1997 Stanford University MS,  Computer Science 1995  – 1997 Stanford University MS,  Computer Science 1995  – 1997 Ethnikon kai Kapodistriakon Panepistimion Athinon BS,  Informatics 1990  – 1994 Ethnikon kai Kapodistriakon Panepistimion Athinon BS,  Informatics 1990  – 1994 Ethnikon kai Kapodistriakon Panepistimion Athinon BS,  Informatics 1990  – 1994 Honors & Awards Additional Honors & Awards Best paper award at the 2003 ACM Symposium on Operating System Principles. \n2nd place at ACM-wide Student Research Contest 2003-2004. Additional Honors & Awards Best paper award at the 2003 ACM Symposium on Operating System Principles. \n2nd place at ACM-wide Student Research Contest 2003-2004. Additional Honors & Awards Best paper award at the 2003 ACM Symposium on Operating System Principles. \n2nd place at ACM-wide Student Research Contest 2003-2004. Additional Honors & Awards Best paper award at the 2003 ACM Symposium on Operating System Principles. \n2nd place at ACM-wide Student Research Contest 2003-2004. ", "Experience Senior Research Scientist Intel Corporation September 2013  – Present (2 years) Algorithms, image processing, pattern recognition Assistant Professor American University of Beirut September 2011  –  September 2013  (2 years 1 month) Beirut-Lebanon Research Scientist Intel February 2009  –  February 2012  (3 years 1 month) I recently joined the microprocessor technology lab at Intel, santa Clara. Graduate intern Intel May 2006  –  August 2006  (4 months) I pursued an internship at Intel research lab in Santa Clara, California. I worked on content based image retrieval under the supervision of Dr. Ara Nefian and Dr. Igor Kozintsev. Senior Research Scientist Intel Corporation September 2013  – Present (2 years) Algorithms, image processing, pattern recognition Senior Research Scientist Intel Corporation September 2013  – Present (2 years) Algorithms, image processing, pattern recognition Assistant Professor American University of Beirut September 2011  –  September 2013  (2 years 1 month) Beirut-Lebanon Assistant Professor American University of Beirut September 2011  –  September 2013  (2 years 1 month) Beirut-Lebanon Research Scientist Intel February 2009  –  February 2012  (3 years 1 month) I recently joined the microprocessor technology lab at Intel, santa Clara. Research Scientist Intel February 2009  –  February 2012  (3 years 1 month) I recently joined the microprocessor technology lab at Intel, santa Clara. Graduate intern Intel May 2006  –  August 2006  (4 months) I pursued an internship at Intel research lab in Santa Clara, California. I worked on content based image retrieval under the supervision of Dr. Ara Nefian and Dr. Igor Kozintsev. Graduate intern Intel May 2006  –  August 2006  (4 months) I pursued an internship at Intel research lab in Santa Clara, California. I worked on content based image retrieval under the supervision of Dr. Ara Nefian and Dr. Igor Kozintsev. Languages French Arabic French Arabic French Arabic Skills Computer Architecture Data Mining Signal Processing Research Information Theory Matlab Machine Learning Algorithms Simulations Computer Vision Image Processing Pattern Recognition Skills  Computer Architecture Data Mining Signal Processing Research Information Theory Matlab Machine Learning Algorithms Simulations Computer Vision Image Processing Pattern Recognition Computer Architecture Data Mining Signal Processing Research Information Theory Matlab Machine Learning Algorithms Simulations Computer Vision Image Processing Pattern Recognition Computer Architecture Data Mining Signal Processing Research Information Theory Matlab Machine Learning Algorithms Simulations Computer Vision Image Processing Pattern Recognition Education University of Illinois at Urbana-Champaign Ph. D.,  Electrical Engineering 2005  – 2008 • PhD graduate from one of the top 5 Electrical and Computer Engineering departments in the US with GPA 4.0. Activities and Societies:  IEEE ,  SWE University of Illinois at Urbana-Champaign Master of Science,  Electrical Engineering 2003  – 2005 GPA 4.0 Activities and Societies:  IEEE ,  SWE American University of Beirut Bachelor of Engineering,  Computer and Communication Engineering 1998  – 2003 GPA 4.0 Activities and Societies:  IEEE ,  Jewett Dorms Society University of Illinois at Urbana-Champaign Ph. D.,  Electrical Engineering 2005  – 2008 • PhD graduate from one of the top 5 Electrical and Computer Engineering departments in the US with GPA 4.0. Activities and Societies:  IEEE ,  SWE University of Illinois at Urbana-Champaign Ph. D.,  Electrical Engineering 2005  – 2008 • PhD graduate from one of the top 5 Electrical and Computer Engineering departments in the US with GPA 4.0. Activities and Societies:  IEEE ,  SWE University of Illinois at Urbana-Champaign Ph. D.,  Electrical Engineering 2005  – 2008 • PhD graduate from one of the top 5 Electrical and Computer Engineering departments in the US with GPA 4.0. Activities and Societies:  IEEE ,  SWE University of Illinois at Urbana-Champaign Master of Science,  Electrical Engineering 2003  – 2005 GPA 4.0 Activities and Societies:  IEEE ,  SWE University of Illinois at Urbana-Champaign Master of Science,  Electrical Engineering 2003  – 2005 GPA 4.0 Activities and Societies:  IEEE ,  SWE University of Illinois at Urbana-Champaign Master of Science,  Electrical Engineering 2003  – 2005 GPA 4.0 Activities and Societies:  IEEE ,  SWE American University of Beirut Bachelor of Engineering,  Computer and Communication Engineering 1998  – 2003 GPA 4.0 Activities and Societies:  IEEE ,  Jewett Dorms Society American University of Beirut Bachelor of Engineering,  Computer and Communication Engineering 1998  – 2003 GPA 4.0 Activities and Societies:  IEEE ,  Jewett Dorms Society American University of Beirut Bachelor of Engineering,  Computer and Communication Engineering 1998  – 2003 GPA 4.0 Activities and Societies:  IEEE ,  Jewett Dorms Society Honors & Awards ", "Languages English Full professional proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Italian Native or bilingual proficiency French Limited working proficiency Spanish Elementary proficiency English Full professional proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Italian Native or bilingual proficiency French Limited working proficiency Spanish Elementary proficiency English Full professional proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Italian Native or bilingual proficiency French Limited working proficiency Spanish Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Computer Vision Information Retrieval Video Compression Machine Learning Image Processing Video Processing Computational Geometry Pattern Recognition Face Recognition Video Algorithms OpenCV H.264 Signal Processing Video Coding 3D reconstruction Digital Image Processing Object Recognition Computer Graphics Algorithm Design Numerical Analysis R&D ARM FPGA Object Oriented Design Image Analysis LaTeX Start-ups Data Mining Computer Science Distributed Systems System Architecture Digital Signal... Embedded Systems Computer Architecture Matlab Sensors Simulations Programming Verilog CUDA Parallel Computing Applied Mathematics Artificial Intelligence R Digital Signal... High Performance... Software Design Optimization Software Engineering See 35+     See less Skills  Computer Vision Information Retrieval Video Compression Machine Learning Image Processing Video Processing Computational Geometry Pattern Recognition Face Recognition Video Algorithms OpenCV H.264 Signal Processing Video Coding 3D reconstruction Digital Image Processing Object Recognition Computer Graphics Algorithm Design Numerical Analysis R&D ARM FPGA Object Oriented Design Image Analysis LaTeX Start-ups Data Mining Computer Science Distributed Systems System Architecture Digital Signal... Embedded Systems Computer Architecture Matlab Sensors Simulations Programming Verilog CUDA Parallel Computing Applied Mathematics Artificial Intelligence R Digital Signal... High Performance... Software Design Optimization Software Engineering See 35+     See less Computer Vision Information Retrieval Video Compression Machine Learning Image Processing Video Processing Computational Geometry Pattern Recognition Face Recognition Video Algorithms OpenCV H.264 Signal Processing Video Coding 3D reconstruction Digital Image Processing Object Recognition Computer Graphics Algorithm Design Numerical Analysis R&D ARM FPGA Object Oriented Design Image Analysis LaTeX Start-ups Data Mining Computer Science Distributed Systems System Architecture Digital Signal... Embedded Systems Computer Architecture Matlab Sensors Simulations Programming Verilog CUDA Parallel Computing Applied Mathematics Artificial Intelligence R Digital Signal... High Performance... Software Design Optimization Software Engineering See 35+     See less Computer Vision Information Retrieval Video Compression Machine Learning Image Processing Video Processing Computational Geometry Pattern Recognition Face Recognition Video Algorithms OpenCV H.264 Signal Processing Video Coding 3D reconstruction Digital Image Processing Object Recognition Computer Graphics Algorithm Design Numerical Analysis R&D ARM FPGA Object Oriented Design Image Analysis LaTeX Start-ups Data Mining Computer Science Distributed Systems System Architecture Digital Signal... Embedded Systems Computer Architecture Matlab Sensors Simulations Programming Verilog CUDA Parallel Computing Applied Mathematics Artificial Intelligence R Digital Signal... High Performance... Software Design Optimization Software Engineering See 35+     See less Honors & Awards ", "Experience Senior Research Scientist Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area I am looking forward to working with a new team! Adjunct Professor of Physics and Environmental Science Portland State University March 2011  – Present (4 years 6 months) Secured more than $500,000 in federal, state, county and private research funding for the Science Department. \n \nInitiated NSF funded undergraduate research opportunity at PSU, resulting in diversity in biology, chemistry and physic labs \n \nCreated Flipped Larger Lecture courses; Implemented the use of technology to create active environment \n Senior Research Scientist Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area I am looking forward to working with a new team! Senior Research Scientist Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area I am looking forward to working with a new team! Adjunct Professor of Physics and Environmental Science Portland State University March 2011  – Present (4 years 6 months) Secured more than $500,000 in federal, state, county and private research funding for the Science Department. \n \nInitiated NSF funded undergraduate research opportunity at PSU, resulting in diversity in biology, chemistry and physic labs \n \nCreated Flipped Larger Lecture courses; Implemented the use of technology to create active environment \n Adjunct Professor of Physics and Environmental Science Portland State University March 2011  – Present (4 years 6 months) Secured more than $500,000 in federal, state, county and private research funding for the Science Department. \n \nInitiated NSF funded undergraduate research opportunity at PSU, resulting in diversity in biology, chemistry and physic labs \n \nCreated Flipped Larger Lecture courses; Implemented the use of technology to create active environment \n Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Research Science Spectroscopy Environmental Science Program Management Physics Statistics Data Analysis University Teaching Teaching Python Entrepreneurship Environmental Awareness Analysis Higher Education Public Speaking Data Science Instrument Design Communication Skills Technical Writing Grants Qualitative Research SPSS Instructional Design Grant Writing See 10+     See less Skills  Research Science Spectroscopy Environmental Science Program Management Physics Statistics Data Analysis University Teaching Teaching Python Entrepreneurship Environmental Awareness Analysis Higher Education Public Speaking Data Science Instrument Design Communication Skills Technical Writing Grants Qualitative Research SPSS Instructional Design Grant Writing See 10+     See less Research Science Spectroscopy Environmental Science Program Management Physics Statistics Data Analysis University Teaching Teaching Python Entrepreneurship Environmental Awareness Analysis Higher Education Public Speaking Data Science Instrument Design Communication Skills Technical Writing Grants Qualitative Research SPSS Instructional Design Grant Writing See 10+     See less Research Science Spectroscopy Environmental Science Program Management Physics Statistics Data Analysis University Teaching Teaching Python Entrepreneurship Environmental Awareness Analysis Higher Education Public Speaking Data Science Instrument Design Communication Skills Technical Writing Grants Qualitative Research SPSS Instructional Design Grant Writing See 10+     See less Education Portland State University PhD,  Applied Physics-Atmospheric 2004  – 2012 Developed novel IP for measuring NO2 under ambient conditions \n \nOriginal Hardware and Software development \n \nCompleted advanced research into the use of spectroscopy for urban surface chemistry \n \nQuantum and Classical Mechanics, Fluid Dynamics, Optics and Chemistry at the doctoral level  Activities and Societies:  McNair Scholar Portland State University B.S.,  Mathematics 2000  – 2004 Activities and Societies:  I attended Baylor University and Pacific University studying philosophy for three years before moving to PSU to finish a B.S. in mathematics. Portland State University PhD,  Applied Physics-Atmospheric 2004  – 2012 Developed novel IP for measuring NO2 under ambient conditions \n \nOriginal Hardware and Software development \n \nCompleted advanced research into the use of spectroscopy for urban surface chemistry \n \nQuantum and Classical Mechanics, Fluid Dynamics, Optics and Chemistry at the doctoral level  Activities and Societies:  McNair Scholar Portland State University PhD,  Applied Physics-Atmospheric 2004  – 2012 Developed novel IP for measuring NO2 under ambient conditions \n \nOriginal Hardware and Software development \n \nCompleted advanced research into the use of spectroscopy for urban surface chemistry \n \nQuantum and Classical Mechanics, Fluid Dynamics, Optics and Chemistry at the doctoral level  Activities and Societies:  McNair Scholar Portland State University PhD,  Applied Physics-Atmospheric 2004  – 2012 Developed novel IP for measuring NO2 under ambient conditions \n \nOriginal Hardware and Software development \n \nCompleted advanced research into the use of spectroscopy for urban surface chemistry \n \nQuantum and Classical Mechanics, Fluid Dynamics, Optics and Chemistry at the doctoral level  Activities and Societies:  McNair Scholar Portland State University B.S.,  Mathematics 2000  – 2004 Activities and Societies:  I attended Baylor University and Pacific University studying philosophy for three years before moving to PSU to finish a B.S. in mathematics. Portland State University B.S.,  Mathematics 2000  – 2004 Activities and Societies:  I attended Baylor University and Pacific University studying philosophy for three years before moving to PSU to finish a B.S. in mathematics. Portland State University B.S.,  Mathematics 2000  – 2004 Activities and Societies:  I attended Baylor University and Pacific University studying philosophy for three years before moving to PSU to finish a B.S. in mathematics. Honors & Awards Additional Honors & Awards Ronald E. McNair Scholar Additional Honors & Awards Ronald E. McNair Scholar Additional Honors & Awards Ronald E. McNair Scholar Additional Honors & Awards Ronald E. McNair Scholar ", "Experience Senior Research Scientist Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara Sensors and Systems Research Lab, Intel Labs \n \nTeam lead in research and development projects involving sensors, sensor back-end & sensing systems and actuators. \n \n• Focusing on optical sensors for environmental sensing. Investigating miniaturization feasibility of the sensing concepts for wearable and portable form factor devices\t \n \n• Defining technology limits for miniaturization with prototyping as well as developing trade off analysis between performance, size, cost, and power with experimental characterization in conjunction with numerical modeling. \n \n• Hands-on work on: \n- Miniature optomechanical design, fabrication and assembly \n- Application of fast turn around traditional as well as novel fabrication methods in proof-of-concept prototype development: Machining, additive fabrication (3D printing, DMLS), sheet metal, injection molding, LDS, conformal and optical coatings, laser cutting \n- Back-end analog circuit design with help of analog engineers, SPICE simulations, and circuit validation measurements (noise, BW) for a high speed, high gain, low noise transimpendance amplifier in photodetector measurements \n- Custom test setup development to characterize environmental sensors and proof-of-concept prototypes (aerosolizing known particulates, delivery and metering of different gasses...etc) \n Senior Research Scientist Intel Corporation April 2013  –  April 2014  (1 year 1 month) Santa Clara Integrated Biosystems Lab, Circuits and Systems Lab, Intel Labs \n \nResponsible for the architecture design and system development of automated microfluidic DNA sequencing platforms to test and validate integrated silicon biosensors \n \n• Worked with electrochemists, biochemists and integrated circuit designers to define requirements of the sequencing platform. Architected, built and then deployed automated assay systems to be used in device validation, biochemistry research and development, electrochemical sensor validation, as well as root causing failures in integrated circuitry, packaging, and tooling.  \n \n• Wrote system controller software to: deliver reagents, run cleaning cycles, control pumps and valves, temperature control of the device, interface with the electrical measurement hardware to conduct sequencing assay electrochemical measurements, and manage recipes for automated runs of different assays. \n \n• Used rapid prototyping techniques such as 3D printing and open source SW/HW platforms to significantly reduce time to data from weeks to days. Designed and deployed a custom embedded temperature controller to set the integrated biosensor temperature during sequencing assays using a thermoelectric device without negatively impacting sensitive electrochemical measurements. \n R&D Test Engineer Intel Corporation September 2007  –  April 2013  (5 years 8 months) Chandler, AZ Sort Test Technology Development, TMG \n \nWorked on numerous aspects of equipment development, taking a concept of a superior thermal management technology from paper study to a manufacturing ready tool for testing Intel’s microprocessor products \n \n• Demonstrated the technical feasibility of a novel, cost effective direct-liquid contact microchannel concept for the thermal management of test modules. Optimized and evolved the microchannel concept for high volume manufacturing environments using CFD.  \n \n• Lead an agile and lean technical hardware team responsible to deploy a manufacturing ready prototype tool in factory to enable direct liquid cooling microchannel technology.  \n \n• Designed the hardware system architecture of the tool, developed fixtures and metrologies for conducting reliability testing of the tool and drove design of experiments for capability characterization.  \n \n• Engaged in commercial and technical discussion with supplier(s): created technical specifications and requirements, engineering CAD models, logic diagrams, SOWs, and came up with should costs based on BOM of the internally developed prototypes for commercial negotiations with the supplier.  \n \n• Hands-on work on: Overall system fluidics and power delivery design, design and development of the communication and automation system interface, mechanical design of hardware, embedded system design and development of system controller (i.e. PID controllers, stepper motor control...), firmware programming, circuit and PCB design, development of an engineering GUI for the control of the tool, data acquisition setups to ensure the tool meets the target criteria\t \n \n• Lead Thermal Working Group in the department (STTD); work group charter: peer review and guidance on the thermal aspects of numerous pathfinding and development projects ranging from TIMs to TECs to dynamic thermal characterization methodologies \n \n Research Assistant Purdue University August 2000  –  September 2007  (7 years 2 months) Cooling Technologies Research Center \n \nResearch and development of piezoelectric fans for thermal management Thermal Analyst Intel Corporation May 2004  –  August 2004  (4 months) Senior Research Scientist Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara Sensors and Systems Research Lab, Intel Labs \n \nTeam lead in research and development projects involving sensors, sensor back-end & sensing systems and actuators. \n \n• Focusing on optical sensors for environmental sensing. Investigating miniaturization feasibility of the sensing concepts for wearable and portable form factor devices\t \n \n• Defining technology limits for miniaturization with prototyping as well as developing trade off analysis between performance, size, cost, and power with experimental characterization in conjunction with numerical modeling. \n \n• Hands-on work on: \n- Miniature optomechanical design, fabrication and assembly \n- Application of fast turn around traditional as well as novel fabrication methods in proof-of-concept prototype development: Machining, additive fabrication (3D printing, DMLS), sheet metal, injection molding, LDS, conformal and optical coatings, laser cutting \n- Back-end analog circuit design with help of analog engineers, SPICE simulations, and circuit validation measurements (noise, BW) for a high speed, high gain, low noise transimpendance amplifier in photodetector measurements \n- Custom test setup development to characterize environmental sensors and proof-of-concept prototypes (aerosolizing known particulates, delivery and metering of different gasses...etc) \n Senior Research Scientist Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara Sensors and Systems Research Lab, Intel Labs \n \nTeam lead in research and development projects involving sensors, sensor back-end & sensing systems and actuators. \n \n• Focusing on optical sensors for environmental sensing. Investigating miniaturization feasibility of the sensing concepts for wearable and portable form factor devices\t \n \n• Defining technology limits for miniaturization with prototyping as well as developing trade off analysis between performance, size, cost, and power with experimental characterization in conjunction with numerical modeling. \n \n• Hands-on work on: \n- Miniature optomechanical design, fabrication and assembly \n- Application of fast turn around traditional as well as novel fabrication methods in proof-of-concept prototype development: Machining, additive fabrication (3D printing, DMLS), sheet metal, injection molding, LDS, conformal and optical coatings, laser cutting \n- Back-end analog circuit design with help of analog engineers, SPICE simulations, and circuit validation measurements (noise, BW) for a high speed, high gain, low noise transimpendance amplifier in photodetector measurements \n- Custom test setup development to characterize environmental sensors and proof-of-concept prototypes (aerosolizing known particulates, delivery and metering of different gasses...etc) \n Senior Research Scientist Intel Corporation April 2013  –  April 2014  (1 year 1 month) Santa Clara Integrated Biosystems Lab, Circuits and Systems Lab, Intel Labs \n \nResponsible for the architecture design and system development of automated microfluidic DNA sequencing platforms to test and validate integrated silicon biosensors \n \n• Worked with electrochemists, biochemists and integrated circuit designers to define requirements of the sequencing platform. Architected, built and then deployed automated assay systems to be used in device validation, biochemistry research and development, electrochemical sensor validation, as well as root causing failures in integrated circuitry, packaging, and tooling.  \n \n• Wrote system controller software to: deliver reagents, run cleaning cycles, control pumps and valves, temperature control of the device, interface with the electrical measurement hardware to conduct sequencing assay electrochemical measurements, and manage recipes for automated runs of different assays. \n \n• Used rapid prototyping techniques such as 3D printing and open source SW/HW platforms to significantly reduce time to data from weeks to days. Designed and deployed a custom embedded temperature controller to set the integrated biosensor temperature during sequencing assays using a thermoelectric device without negatively impacting sensitive electrochemical measurements. \n Senior Research Scientist Intel Corporation April 2013  –  April 2014  (1 year 1 month) Santa Clara Integrated Biosystems Lab, Circuits and Systems Lab, Intel Labs \n \nResponsible for the architecture design and system development of automated microfluidic DNA sequencing platforms to test and validate integrated silicon biosensors \n \n• Worked with electrochemists, biochemists and integrated circuit designers to define requirements of the sequencing platform. Architected, built and then deployed automated assay systems to be used in device validation, biochemistry research and development, electrochemical sensor validation, as well as root causing failures in integrated circuitry, packaging, and tooling.  \n \n• Wrote system controller software to: deliver reagents, run cleaning cycles, control pumps and valves, temperature control of the device, interface with the electrical measurement hardware to conduct sequencing assay electrochemical measurements, and manage recipes for automated runs of different assays. \n \n• Used rapid prototyping techniques such as 3D printing and open source SW/HW platforms to significantly reduce time to data from weeks to days. Designed and deployed a custom embedded temperature controller to set the integrated biosensor temperature during sequencing assays using a thermoelectric device without negatively impacting sensitive electrochemical measurements. \n R&D Test Engineer Intel Corporation September 2007  –  April 2013  (5 years 8 months) Chandler, AZ Sort Test Technology Development, TMG \n \nWorked on numerous aspects of equipment development, taking a concept of a superior thermal management technology from paper study to a manufacturing ready tool for testing Intel’s microprocessor products \n \n• Demonstrated the technical feasibility of a novel, cost effective direct-liquid contact microchannel concept for the thermal management of test modules. Optimized and evolved the microchannel concept for high volume manufacturing environments using CFD.  \n \n• Lead an agile and lean technical hardware team responsible to deploy a manufacturing ready prototype tool in factory to enable direct liquid cooling microchannel technology.  \n \n• Designed the hardware system architecture of the tool, developed fixtures and metrologies for conducting reliability testing of the tool and drove design of experiments for capability characterization.  \n \n• Engaged in commercial and technical discussion with supplier(s): created technical specifications and requirements, engineering CAD models, logic diagrams, SOWs, and came up with should costs based on BOM of the internally developed prototypes for commercial negotiations with the supplier.  \n \n• Hands-on work on: Overall system fluidics and power delivery design, design and development of the communication and automation system interface, mechanical design of hardware, embedded system design and development of system controller (i.e. PID controllers, stepper motor control...), firmware programming, circuit and PCB design, development of an engineering GUI for the control of the tool, data acquisition setups to ensure the tool meets the target criteria\t \n \n• Lead Thermal Working Group in the department (STTD); work group charter: peer review and guidance on the thermal aspects of numerous pathfinding and development projects ranging from TIMs to TECs to dynamic thermal characterization methodologies \n \n R&D Test Engineer Intel Corporation September 2007  –  April 2013  (5 years 8 months) Chandler, AZ Sort Test Technology Development, TMG \n \nWorked on numerous aspects of equipment development, taking a concept of a superior thermal management technology from paper study to a manufacturing ready tool for testing Intel’s microprocessor products \n \n• Demonstrated the technical feasibility of a novel, cost effective direct-liquid contact microchannel concept for the thermal management of test modules. Optimized and evolved the microchannel concept for high volume manufacturing environments using CFD.  \n \n• Lead an agile and lean technical hardware team responsible to deploy a manufacturing ready prototype tool in factory to enable direct liquid cooling microchannel technology.  \n \n• Designed the hardware system architecture of the tool, developed fixtures and metrologies for conducting reliability testing of the tool and drove design of experiments for capability characterization.  \n \n• Engaged in commercial and technical discussion with supplier(s): created technical specifications and requirements, engineering CAD models, logic diagrams, SOWs, and came up with should costs based on BOM of the internally developed prototypes for commercial negotiations with the supplier.  \n \n• Hands-on work on: Overall system fluidics and power delivery design, design and development of the communication and automation system interface, mechanical design of hardware, embedded system design and development of system controller (i.e. PID controllers, stepper motor control...), firmware programming, circuit and PCB design, development of an engineering GUI for the control of the tool, data acquisition setups to ensure the tool meets the target criteria\t \n \n• Lead Thermal Working Group in the department (STTD); work group charter: peer review and guidance on the thermal aspects of numerous pathfinding and development projects ranging from TIMs to TECs to dynamic thermal characterization methodologies \n \n Research Assistant Purdue University August 2000  –  September 2007  (7 years 2 months) Cooling Technologies Research Center \n \nResearch and development of piezoelectric fans for thermal management Research Assistant Purdue University August 2000  –  September 2007  (7 years 2 months) Cooling Technologies Research Center \n \nResearch and development of piezoelectric fans for thermal management Thermal Analyst Intel Corporation May 2004  –  August 2004  (4 months) Thermal Analyst Intel Corporation May 2004  –  August 2004  (4 months) Skills R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less Skills  R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less Education Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 ", "Experience Senior Research Scientist Intel Corporation September 2012  – Present (3 years) Hillsboro, OR, US Post doctor researcher Utah State University June 2011  –  September 2012  (1 year 4 months) LTE systems, cross-layer design for wireless communication networks, cognitive radio networks Research Associate Nanyang Technological University March 2010  –  May 2011  (1 year 3 months) Information theoretical study on wireless communication networks, interference channel, cooperative communication Senior Research Scientist Intel Corporation September 2012  – Present (3 years) Hillsboro, OR, US Senior Research Scientist Intel Corporation September 2012  – Present (3 years) Hillsboro, OR, US Post doctor researcher Utah State University June 2011  –  September 2012  (1 year 4 months) LTE systems, cross-layer design for wireless communication networks, cognitive radio networks Post doctor researcher Utah State University June 2011  –  September 2012  (1 year 4 months) LTE systems, cross-layer design for wireless communication networks, cognitive radio networks Research Associate Nanyang Technological University March 2010  –  May 2011  (1 year 3 months) Information theoretical study on wireless communication networks, interference channel, cooperative communication Research Associate Nanyang Technological University March 2010  –  May 2011  (1 year 3 months) Information theoretical study on wireless communication networks, interference channel, cooperative communication Skills Wireless communication... information theory communication theory LTE system Wireless Information Theory LaTeX Matlab Algorithms Communication Theory LTE Signal Processing MIMO Simulations Optimization Skills  Wireless communication... information theory communication theory LTE system Wireless Information Theory LaTeX Matlab Algorithms Communication Theory LTE Signal Processing MIMO Simulations Optimization Wireless communication... information theory communication theory LTE system Wireless Information Theory LaTeX Matlab Algorithms Communication Theory LTE Signal Processing MIMO Simulations Optimization Wireless communication... information theory communication theory LTE system Wireless Information Theory LaTeX Matlab Algorithms Communication Theory LTE Signal Processing MIMO Simulations Optimization Education Nanyang Technological University Doctor of Philosophy (Ph.D.),  Electrical , Electronics and Communications Engineering 2006  – 2010 Nanjing University of Posts and Telecommunications Master's degree,  Electrical , Electronics and Communications Engineering 2003  – 2006 Nanjing University of Posts and Telecommunications Bachelor's degree,  Electrical , Electronics and Communications Engineering 1999  – 2003 Nanyang Technological University Doctor of Philosophy (Ph.D.),  Electrical , Electronics and Communications Engineering 2006  – 2010 Nanyang Technological University Doctor of Philosophy (Ph.D.),  Electrical , Electronics and Communications Engineering 2006  – 2010 Nanyang Technological University Doctor of Philosophy (Ph.D.),  Electrical , Electronics and Communications Engineering 2006  – 2010 Nanjing University of Posts and Telecommunications Master's degree,  Electrical , Electronics and Communications Engineering 2003  – 2006 Nanjing University of Posts and Telecommunications Master's degree,  Electrical , Electronics and Communications Engineering 2003  – 2006 Nanjing University of Posts and Telecommunications Master's degree,  Electrical , Electronics and Communications Engineering 2003  – 2006 Nanjing University of Posts and Telecommunications Bachelor's degree,  Electrical , Electronics and Communications Engineering 1999  – 2003 Nanjing University of Posts and Telecommunications Bachelor's degree,  Electrical , Electronics and Communications Engineering 1999  – 2003 Nanjing University of Posts and Telecommunications Bachelor's degree,  Electrical , Electronics and Communications Engineering 1999  – 2003 ", "Summary Technical software product leader, with: \n* extensive experience of both enterprise and consumer product development; \n* a strong combination of technical, commercial and leadership skills; \n* a track record of building, leading and improving global R&D teams. Summary Technical software product leader, with: \n* extensive experience of both enterprise and consumer product development; \n* a strong combination of technical, commercial and leadership skills; \n* a track record of building, leading and improving global R&D teams. Technical software product leader, with: \n* extensive experience of both enterprise and consumer product development; \n* a strong combination of technical, commercial and leadership skills; \n* a track record of building, leading and improving global R&D teams. Technical software product leader, with: \n* extensive experience of both enterprise and consumer product development; \n* a strong combination of technical, commercial and leadership skills; \n* a track record of building, leading and improving global R&D teams. Experience Senior Product Manager Google February 2014  – Present (1 year 7 months) London, United Kingdom * Leading team of PMs developing Google search/comparison products in the finance vertical \n* Global responsibility for all consumer banking comparison products Director of Studies for Computer Science and Fellow Robinson College, University of Cambridge 2005  – Present (10 years) * Responsible for admission, teaching and general academic well-being of Cambridge University CS undergraduates at Robinson College. \n* Supervising CS undergraduates for a wide range of courses including programming languages, compiler design, logic and proof, digital electronics, data structures and algorithms, concurrent systems, computer architecture and operating systems. Vice President of Product Development, Cloud Platforms Group Citrix Systems April 2013  –  February 2014  (11 months) Cambridge, United Kingdom * Led the global engineering team for the XenServer Product Group within Citrix Systems; comprising approx. 120 headcount + outsourced development teams distributed across 5 sites in UK, US, India and China \n* Accountable for R&D, software development, quality assurance, product delivery, lifecycle maintenance, ecosystem/partner management, IT/engineering services, open source development and supplier management; with budget of c. $20M. Senior Director of Engineering Citrix Systems August 2011  –  March 2013  (1 year 8 months) * Led the global engineering team for the XenServer Product Group within Citrix Systems (UK, US, India) Director of Software Production Citrix Systems September 2007  –  August 2011  (4 years) * Built Project Office from scratch and delivered 10 consecutive releases of the XenServer virtualization platform on schedule while meeting demanding quality criteria \n* Co-authored and filed 3 patents in the field of virtualization technology Principal Engineer XenSource 2006  –  September 2007  (1 year) * Led a team of engineers in architecting and implementing the server-side management software for the 'Xen Enterprise 4.0' virtualization product, while making a large personal contribution to the product's code base, architecture and design of public APIs \n* Co-authored and filed 3 patents in the field of virtualization technology Senior Research Scientist Intel Corporation 2002  –  2006  (4 years) * Initiated, led and contributed to a variety of Computer Science research projects in the fields of programming languages, compilers, networking and ubiquitous computing. \n* Co-authored 15 published papers in top-tier international conferences and journals. \n* Co-authored and filed 1 patent Research Engineer AT&T Laboratories 1999  –  2000  (1 year) * Designed and implemented high-level Hardware Description Languages based on functional languages. Senior Product Manager Google February 2014  – Present (1 year 7 months) London, United Kingdom * Leading team of PMs developing Google search/comparison products in the finance vertical \n* Global responsibility for all consumer banking comparison products Senior Product Manager Google February 2014  – Present (1 year 7 months) London, United Kingdom * Leading team of PMs developing Google search/comparison products in the finance vertical \n* Global responsibility for all consumer banking comparison products Director of Studies for Computer Science and Fellow Robinson College, University of Cambridge 2005  – Present (10 years) * Responsible for admission, teaching and general academic well-being of Cambridge University CS undergraduates at Robinson College. \n* Supervising CS undergraduates for a wide range of courses including programming languages, compiler design, logic and proof, digital electronics, data structures and algorithms, concurrent systems, computer architecture and operating systems. Director of Studies for Computer Science and Fellow Robinson College, University of Cambridge 2005  – Present (10 years) * Responsible for admission, teaching and general academic well-being of Cambridge University CS undergraduates at Robinson College. \n* Supervising CS undergraduates for a wide range of courses including programming languages, compiler design, logic and proof, digital electronics, data structures and algorithms, concurrent systems, computer architecture and operating systems. Vice President of Product Development, Cloud Platforms Group Citrix Systems April 2013  –  February 2014  (11 months) Cambridge, United Kingdom * Led the global engineering team for the XenServer Product Group within Citrix Systems; comprising approx. 120 headcount + outsourced development teams distributed across 5 sites in UK, US, India and China \n* Accountable for R&D, software development, quality assurance, product delivery, lifecycle maintenance, ecosystem/partner management, IT/engineering services, open source development and supplier management; with budget of c. $20M. Vice President of Product Development, Cloud Platforms Group Citrix Systems April 2013  –  February 2014  (11 months) Cambridge, United Kingdom * Led the global engineering team for the XenServer Product Group within Citrix Systems; comprising approx. 120 headcount + outsourced development teams distributed across 5 sites in UK, US, India and China \n* Accountable for R&D, software development, quality assurance, product delivery, lifecycle maintenance, ecosystem/partner management, IT/engineering services, open source development and supplier management; with budget of c. $20M. Senior Director of Engineering Citrix Systems August 2011  –  March 2013  (1 year 8 months) * Led the global engineering team for the XenServer Product Group within Citrix Systems (UK, US, India) Senior Director of Engineering Citrix Systems August 2011  –  March 2013  (1 year 8 months) * Led the global engineering team for the XenServer Product Group within Citrix Systems (UK, US, India) Director of Software Production Citrix Systems September 2007  –  August 2011  (4 years) * Built Project Office from scratch and delivered 10 consecutive releases of the XenServer virtualization platform on schedule while meeting demanding quality criteria \n* Co-authored and filed 3 patents in the field of virtualization technology Director of Software Production Citrix Systems September 2007  –  August 2011  (4 years) * Built Project Office from scratch and delivered 10 consecutive releases of the XenServer virtualization platform on schedule while meeting demanding quality criteria \n* Co-authored and filed 3 patents in the field of virtualization technology Principal Engineer XenSource 2006  –  September 2007  (1 year) * Led a team of engineers in architecting and implementing the server-side management software for the 'Xen Enterprise 4.0' virtualization product, while making a large personal contribution to the product's code base, architecture and design of public APIs \n* Co-authored and filed 3 patents in the field of virtualization technology Principal Engineer XenSource 2006  –  September 2007  (1 year) * Led a team of engineers in architecting and implementing the server-side management software for the 'Xen Enterprise 4.0' virtualization product, while making a large personal contribution to the product's code base, architecture and design of public APIs \n* Co-authored and filed 3 patents in the field of virtualization technology Senior Research Scientist Intel Corporation 2002  –  2006  (4 years) * Initiated, led and contributed to a variety of Computer Science research projects in the fields of programming languages, compilers, networking and ubiquitous computing. \n* Co-authored 15 published papers in top-tier international conferences and journals. \n* Co-authored and filed 1 patent Senior Research Scientist Intel Corporation 2002  –  2006  (4 years) * Initiated, led and contributed to a variety of Computer Science research projects in the fields of programming languages, compilers, networking and ubiquitous computing. \n* Co-authored 15 published papers in top-tier international conferences and journals. \n* Co-authored and filed 1 patent Research Engineer AT&T Laboratories 1999  –  2000  (1 year) * Designed and implemented high-level Hardware Description Languages based on functional languages. Research Engineer AT&T Laboratories 1999  –  2000  (1 year) * Designed and implemented high-level Hardware Description Languages based on functional languages. Skills Product Development Technical Leadership Software Project... Engineering Management Software Development Agile Methodologies Software Engineering Computer Science Software Design Virtualization Cloud Computing Program Management Enterprise Software Architecture Algorithms Distributed Systems Architectures Product Management Project Management Linux Management See 6+     See less Skills  Product Development Technical Leadership Software Project... Engineering Management Software Development Agile Methodologies Software Engineering Computer Science Software Design Virtualization Cloud Computing Program Management Enterprise Software Architecture Algorithms Distributed Systems Architectures Product Management Project Management Linux Management See 6+     See less Product Development Technical Leadership Software Project... Engineering Management Software Development Agile Methodologies Software Engineering Computer Science Software Design Virtualization Cloud Computing Program Management Enterprise Software Architecture Algorithms Distributed Systems Architectures Product Management Project Management Linux Management See 6+     See less Product Development Technical Leadership Software Project... Engineering Management Software Development Agile Methodologies Software Engineering Computer Science Software Design Virtualization Cloud Computing Program Management Enterprise Software Architecture Algorithms Distributed Systems Architectures Product Management Project Management Linux Management See 6+     See less Education Judge Business School (University of Cambridge) MBA 2010  – 2012 * Received 'Directors Award' for academic achievement; ranked top in class. \n* Received prize for outstanding contribution to class dynamic. (Awarded on basis of class vote) \n* Received prize for outstanding result in Management Science University of Cambridge PhD,  Computer Science (Programming Language Design and Hardware Synthesis) 2000  – 2002 * Thesis published by Springer-Verlag (LNCS vol. 2963) \n* Co-authored 11 published papers in top-tier international conferences and journals \n* Applied advanced programming language and compilation techniques to behavioural hardware synthesis, implementing a compiler to transform high-level functional specifications to FPGAs while exploiting global analysis and optimization techniques not possible in the domain of conventional behavioural HDLs (e.g. Verilog or VHDL) University of Cambridge Computer Science 1996  – 1999 * First Class Honours. \n* Awarded Intel Scholarship and elected College Senior Scholar. Judge Business School (University of Cambridge) MBA 2010  – 2012 * Received 'Directors Award' for academic achievement; ranked top in class. \n* Received prize for outstanding contribution to class dynamic. (Awarded on basis of class vote) \n* Received prize for outstanding result in Management Science Judge Business School (University of Cambridge) MBA 2010  – 2012 * Received 'Directors Award' for academic achievement; ranked top in class. \n* Received prize for outstanding contribution to class dynamic. (Awarded on basis of class vote) \n* Received prize for outstanding result in Management Science Judge Business School (University of Cambridge) MBA 2010  – 2012 * Received 'Directors Award' for academic achievement; ranked top in class. \n* Received prize for outstanding contribution to class dynamic. (Awarded on basis of class vote) \n* Received prize for outstanding result in Management Science University of Cambridge PhD,  Computer Science (Programming Language Design and Hardware Synthesis) 2000  – 2002 * Thesis published by Springer-Verlag (LNCS vol. 2963) \n* Co-authored 11 published papers in top-tier international conferences and journals \n* Applied advanced programming language and compilation techniques to behavioural hardware synthesis, implementing a compiler to transform high-level functional specifications to FPGAs while exploiting global analysis and optimization techniques not possible in the domain of conventional behavioural HDLs (e.g. Verilog or VHDL) University of Cambridge PhD,  Computer Science (Programming Language Design and Hardware Synthesis) 2000  – 2002 * Thesis published by Springer-Verlag (LNCS vol. 2963) \n* Co-authored 11 published papers in top-tier international conferences and journals \n* Applied advanced programming language and compilation techniques to behavioural hardware synthesis, implementing a compiler to transform high-level functional specifications to FPGAs while exploiting global analysis and optimization techniques not possible in the domain of conventional behavioural HDLs (e.g. Verilog or VHDL) University of Cambridge PhD,  Computer Science (Programming Language Design and Hardware Synthesis) 2000  – 2002 * Thesis published by Springer-Verlag (LNCS vol. 2963) \n* Co-authored 11 published papers in top-tier international conferences and journals \n* Applied advanced programming language and compilation techniques to behavioural hardware synthesis, implementing a compiler to transform high-level functional specifications to FPGAs while exploiting global analysis and optimization techniques not possible in the domain of conventional behavioural HDLs (e.g. Verilog or VHDL) University of Cambridge Computer Science 1996  – 1999 * First Class Honours. \n* Awarded Intel Scholarship and elected College Senior Scholar. University of Cambridge Computer Science 1996  – 1999 * First Class Honours. \n* Awarded Intel Scholarship and elected College Senior Scholar. University of Cambridge Computer Science 1996  – 1999 * First Class Honours. \n* Awarded Intel Scholarship and elected College Senior Scholar. Honors & Awards Additional Honors & Awards Received ACM WWW2002 Best Paper Award for work on 'application-level web security' Additional Honors & Awards Received ACM WWW2002 Best Paper Award for work on 'application-level web security' Additional Honors & Awards Received ACM WWW2002 Best Paper Award for work on 'application-level web security' Additional Honors & Awards Received ACM WWW2002 Best Paper Award for work on 'application-level web security' ", "Experience Senior Research Scientist Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Research on 5G wireless technology and mobile computing Research Scientist Intel Corporation May 2013  –  March 2015  (1 year 11 months) Hillsboro Research on 5G wireless technology and mobile computing Software Engineer Amazon August 2011  –  May 2013  (1 year 10 months) Greater Seattle Area Research Intern Intel Corporation January 2008  –  July 2008  (7 months) Hillsboro, OR Graduate Student Researcher (part-time) Telecommunications Research Labs May 2002  –  April 2004  (2 years) Winnipeg, MB Senior Research Scientist Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Research on 5G wireless technology and mobile computing Senior Research Scientist Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Research on 5G wireless technology and mobile computing Research Scientist Intel Corporation May 2013  –  March 2015  (1 year 11 months) Hillsboro Research on 5G wireless technology and mobile computing Research Scientist Intel Corporation May 2013  –  March 2015  (1 year 11 months) Hillsboro Research on 5G wireless technology and mobile computing Software Engineer Amazon August 2011  –  May 2013  (1 year 10 months) Greater Seattle Area Software Engineer Amazon August 2011  –  May 2013  (1 year 10 months) Greater Seattle Area Research Intern Intel Corporation January 2008  –  July 2008  (7 months) Hillsboro, OR Research Intern Intel Corporation January 2008  –  July 2008  (7 months) Hillsboro, OR Graduate Student Researcher (part-time) Telecommunications Research Labs May 2002  –  April 2004  (2 years) Winnipeg, MB Graduate Student Researcher (part-time) Telecommunications Research Labs May 2002  –  April 2004  (2 years) Winnipeg, MB Skills Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Skills  Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Education The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Buet The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Buet Buet Buet ", "Experience Social Sciences and Humanities Research Associate The University of Texas at Austin August 2010  –  August 2013  (3 years 1 month) Postdoctoral Fellow The University of Texas at Austin August 2009  –  August 2010  (1 year 1 month) Social Sciences and Humanities Research Associate The University of Texas at Austin August 2010  –  August 2013  (3 years 1 month) Social Sciences and Humanities Research Associate The University of Texas at Austin August 2010  –  August 2013  (3 years 1 month) Postdoctoral Fellow The University of Texas at Austin August 2009  –  August 2010  (1 year 1 month) Postdoctoral Fellow The University of Texas at Austin August 2009  –  August 2010  (1 year 1 month) Skills Algorithms Characterization Natural Language... Simulations SPSS Quantitative Research Experimental Design Social Psychology R&D Statistical Modeling Statistics Mathematical Modeling Science Research Design Research Data Analysis See 1+     See less Skills  Algorithms Characterization Natural Language... Simulations SPSS Quantitative Research Experimental Design Social Psychology R&D Statistical Modeling Statistics Mathematical Modeling Science Research Design Research Data Analysis See 1+     See less Algorithms Characterization Natural Language... Simulations SPSS Quantitative Research Experimental Design Social Psychology R&D Statistical Modeling Statistics Mathematical Modeling Science Research Design Research Data Analysis See 1+     See less Algorithms Characterization Natural Language... Simulations SPSS Quantitative Research Experimental Design Social Psychology R&D Statistical Modeling Statistics Mathematical Modeling Science Research Design Research Data Analysis See 1+     See less Education The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Social and Personality Psychology 2003  – 2009 The University of Toronto Bachelor of Science (B.Sc.),  Psychology 1997  – 2001 The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Social and Personality Psychology 2003  – 2009 The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Social and Personality Psychology 2003  – 2009 The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Social and Personality Psychology 2003  – 2009 The University of Toronto Bachelor of Science (B.Sc.),  Psychology 1997  – 2001 The University of Toronto Bachelor of Science (B.Sc.),  Psychology 1997  – 2001 The University of Toronto Bachelor of Science (B.Sc.),  Psychology 1997  – 2001 ", "Summary Qualifications & Expertises \n• 14 years of experience in wireless networks architectures and protocols (Local Area Network “WLAN”, Personal Area Network “WPAN”, Ad hoc & Sensor Networks). \n• 8 years of experience in Internet architecture, IP stack, authentication and services authorization. \n• 6 years of experience in services platforms, IPTV, Video Streaming and Optimized Content Delivery. \n• Active participation and contribution to the Internet Engineering Task Force (IETF) standardization for Internet, real-time and application areas.  \n• Technical lead for projects on context-awareness for services personalization, services convergence for next generation network and advanced services for multi-hop WLANs.  \n \n \n \nSpecialties: Computer and Networks Summary Qualifications & Expertises \n• 14 years of experience in wireless networks architectures and protocols (Local Area Network “WLAN”, Personal Area Network “WPAN”, Ad hoc & Sensor Networks). \n• 8 years of experience in Internet architecture, IP stack, authentication and services authorization. \n• 6 years of experience in services platforms, IPTV, Video Streaming and Optimized Content Delivery. \n• Active participation and contribution to the Internet Engineering Task Force (IETF) standardization for Internet, real-time and application areas.  \n• Technical lead for projects on context-awareness for services personalization, services convergence for next generation network and advanced services for multi-hop WLANs.  \n \n \n \nSpecialties: Computer and Networks Qualifications & Expertises \n• 14 years of experience in wireless networks architectures and protocols (Local Area Network “WLAN”, Personal Area Network “WPAN”, Ad hoc & Sensor Networks). \n• 8 years of experience in Internet architecture, IP stack, authentication and services authorization. \n• 6 years of experience in services platforms, IPTV, Video Streaming and Optimized Content Delivery. \n• Active participation and contribution to the Internet Engineering Task Force (IETF) standardization for Internet, real-time and application areas.  \n• Technical lead for projects on context-awareness for services personalization, services convergence for next generation network and advanced services for multi-hop WLANs.  \n \n \n \nSpecialties: Computer and Networks Qualifications & Expertises \n• 14 years of experience in wireless networks architectures and protocols (Local Area Network “WLAN”, Personal Area Network “WPAN”, Ad hoc & Sensor Networks). \n• 8 years of experience in Internet architecture, IP stack, authentication and services authorization. \n• 6 years of experience in services platforms, IPTV, Video Streaming and Optimized Content Delivery. \n• Active participation and contribution to the Internet Engineering Task Force (IETF) standardization for Internet, real-time and application areas.  \n• Technical lead for projects on context-awareness for services personalization, services convergence for next generation network and advanced services for multi-hop WLANs.  \n \n \n \nSpecialties: Computer and Networks Experience Senior Research Scientist Intel Corporation October 2012  – Present (2 years 11 months) Hillsboro, Oregon Working on Video Delivery Optimization over Wireless Networks. Senior R&D Engineer Orange Labs January 2005  –  September 2012  (7 years 9 months) Paris Area, France Worked on services convergence for next generation networks, services personalization and Authorization, Authorization and Accounting (AAA) for service in wireless networks. Research Assistant Telecom Paris Tech September 2001  –  December 2004  (3 years 4 months) Paris Area, France Senior Research Scientist Intel Corporation October 2012  – Present (2 years 11 months) Hillsboro, Oregon Working on Video Delivery Optimization over Wireless Networks. Senior Research Scientist Intel Corporation October 2012  – Present (2 years 11 months) Hillsboro, Oregon Working on Video Delivery Optimization over Wireless Networks. Senior R&D Engineer Orange Labs January 2005  –  September 2012  (7 years 9 months) Paris Area, France Worked on services convergence for next generation networks, services personalization and Authorization, Authorization and Accounting (AAA) for service in wireless networks. Senior R&D Engineer Orange Labs January 2005  –  September 2012  (7 years 9 months) Paris Area, France Worked on services convergence for next generation networks, services personalization and Authorization, Authorization and Accounting (AAA) for service in wireless networks. Research Assistant Telecom Paris Tech September 2001  –  December 2004  (3 years 4 months) Paris Area, France Research Assistant Telecom Paris Tech September 2001  –  December 2004  (3 years 4 months) Paris Area, France Education University of Paris XI HDR (Habilitation à Diriger des Recherches): Research Director Qualification,  Wireless Communication and Multimedia 2010 Ecole nationale supérieure des Télécommunications / Telecom Paris PhD,  Computer and Networks 2004 University of Paris XI Master,  Distributed Systems 2001 Arab Academy for Science, Technology and Maritime Transport Master of Science (M.Sc.),  Networks 2000 Traffic Control in ATM Networks Arab Academy for Science, Technology and Maritime Transport Bachelor's degree,  Computer Engineering 1997 University of Paris XI HDR (Habilitation à Diriger des Recherches): Research Director Qualification,  Wireless Communication and Multimedia 2010 University of Paris XI HDR (Habilitation à Diriger des Recherches): Research Director Qualification,  Wireless Communication and Multimedia 2010 University of Paris XI HDR (Habilitation à Diriger des Recherches): Research Director Qualification,  Wireless Communication and Multimedia 2010 Ecole nationale supérieure des Télécommunications / Telecom Paris PhD,  Computer and Networks 2004 Ecole nationale supérieure des Télécommunications / Telecom Paris PhD,  Computer and Networks 2004 Ecole nationale supérieure des Télécommunications / Telecom Paris PhD,  Computer and Networks 2004 University of Paris XI Master,  Distributed Systems 2001 University of Paris XI Master,  Distributed Systems 2001 University of Paris XI Master,  Distributed Systems 2001 Arab Academy for Science, Technology and Maritime Transport Master of Science (M.Sc.),  Networks 2000 Traffic Control in ATM Networks Arab Academy for Science, Technology and Maritime Transport Master of Science (M.Sc.),  Networks 2000 Traffic Control in ATM Networks Arab Academy for Science, Technology and Maritime Transport Master of Science (M.Sc.),  Networks 2000 Traffic Control in ATM Networks Arab Academy for Science, Technology and Maritime Transport Bachelor's degree,  Computer Engineering 1997 Arab Academy for Science, Technology and Maritime Transport Bachelor's degree,  Computer Engineering 1997 Arab Academy for Science, Technology and Maritime Transport Bachelor's degree,  Computer Engineering 1997 ", "Experience Senior Research Scientist Intel Corporation August 2010  – Present (5 years 1 month) Advanced lithography research within Intel's Components Research and Pathfinding organization. IMEC Assignee / Senior Researcher Intel May 2007  –  August 2010  (3 years 4 months) Although my job is based within Intel's Components Research organization in Hillsboro Oregon, I am currently on a long term temporary assignment at the IMEC consortium in Leuven Belgium. My recent research is focused on advanced photoresist materials for EUV lithography and other novel patterning approaches. Senior Research Engineer Intel January 2005  –  April 2007  (2 years 4 months) Components Research and Pathfinding. Photoresists for EUV Ltihography. Litho and Polymer Process Development Intel 2002  –  December 2004  (2 years) Research and process development for both lithography and integration of novel components / layers for a new type of semiconductor device. Senior Process Engineer - Lithography Intel August 1998  –  December 2001  (3 years 5 months) Manufacturing process transfer from development to high volume production - Lithography. Senior Research Scientist Intel Corporation August 2010  – Present (5 years 1 month) Advanced lithography research within Intel's Components Research and Pathfinding organization. Senior Research Scientist Intel Corporation August 2010  – Present (5 years 1 month) Advanced lithography research within Intel's Components Research and Pathfinding organization. IMEC Assignee / Senior Researcher Intel May 2007  –  August 2010  (3 years 4 months) Although my job is based within Intel's Components Research organization in Hillsboro Oregon, I am currently on a long term temporary assignment at the IMEC consortium in Leuven Belgium. My recent research is focused on advanced photoresist materials for EUV lithography and other novel patterning approaches. IMEC Assignee / Senior Researcher Intel May 2007  –  August 2010  (3 years 4 months) Although my job is based within Intel's Components Research organization in Hillsboro Oregon, I am currently on a long term temporary assignment at the IMEC consortium in Leuven Belgium. My recent research is focused on advanced photoresist materials for EUV lithography and other novel patterning approaches. Senior Research Engineer Intel January 2005  –  April 2007  (2 years 4 months) Components Research and Pathfinding. Photoresists for EUV Ltihography. Senior Research Engineer Intel January 2005  –  April 2007  (2 years 4 months) Components Research and Pathfinding. Photoresists for EUV Ltihography. Litho and Polymer Process Development Intel 2002  –  December 2004  (2 years) Research and process development for both lithography and integration of novel components / layers for a new type of semiconductor device. Litho and Polymer Process Development Intel 2002  –  December 2004  (2 years) Research and process development for both lithography and integration of novel components / layers for a new type of semiconductor device. Senior Process Engineer - Lithography Intel August 1998  –  December 2001  (3 years 5 months) Manufacturing process transfer from development to high volume production - Lithography. Senior Process Engineer - Lithography Intel August 1998  –  December 2001  (3 years 5 months) Manufacturing process transfer from development to high volume production - Lithography. Skills Chemistry Design of Experiments Lithography Mathematical Modeling Materials Science Semiconductors Photolithography Polymers Process Simulation Thin Films Nanotechnology Experimentation Characterization Intel Materials Semiconductor Device Silicon See 2+     See less Skills  Chemistry Design of Experiments Lithography Mathematical Modeling Materials Science Semiconductors Photolithography Polymers Process Simulation Thin Films Nanotechnology Experimentation Characterization Intel Materials Semiconductor Device Silicon See 2+     See less Chemistry Design of Experiments Lithography Mathematical Modeling Materials Science Semiconductors Photolithography Polymers Process Simulation Thin Films Nanotechnology Experimentation Characterization Intel Materials Semiconductor Device Silicon See 2+     See less Chemistry Design of Experiments Lithography Mathematical Modeling Materials Science Semiconductors Photolithography Polymers Process Simulation Thin Films Nanotechnology Experimentation Characterization Intel Materials Semiconductor Device Silicon See 2+     See less Education The University of Texas at Austin PhD,  Organic Chemistry 1993  – 1998 Advisor C. Grant Willson \nPhotoresist chemistry Boston University The University of Texas at Austin PhD,  Organic Chemistry 1993  – 1998 Advisor C. Grant Willson \nPhotoresist chemistry The University of Texas at Austin PhD,  Organic Chemistry 1993  – 1998 Advisor C. Grant Willson \nPhotoresist chemistry The University of Texas at Austin PhD,  Organic Chemistry 1993  – 1998 Advisor C. Grant Willson \nPhotoresist chemistry Boston University Boston University Boston University ", "Experience Senior Research Staff Intel January 2011  – Present (4 years 8 months) Santa Clara, CA Senior Research Scientist Intel Corporation September 2007  –  December 2010  (3 years 4 months) Santa Clara, CA Research Scientist IBM T. J. Watson July 2006  –  July 2007  (1 year 1 month) PostDoc Research Associate University of California, San Diego August 2004  –  July 2006  (2 years) Research Engineer IRISA 2000  –  2001  (1 year) Undergrad intern Fraunhofer FIRST 1999  –  2000  (1 year) Senior Research Staff Intel January 2011  – Present (4 years 8 months) Santa Clara, CA Senior Research Staff Intel January 2011  – Present (4 years 8 months) Santa Clara, CA Senior Research Scientist Intel Corporation September 2007  –  December 2010  (3 years 4 months) Santa Clara, CA Senior Research Scientist Intel Corporation September 2007  –  December 2010  (3 years 4 months) Santa Clara, CA Research Scientist IBM T. J. Watson July 2006  –  July 2007  (1 year 1 month) Research Scientist IBM T. J. Watson July 2006  –  July 2007  (1 year 1 month) PostDoc Research Associate University of California, San Diego August 2004  –  July 2006  (2 years) PostDoc Research Associate University of California, San Diego August 2004  –  July 2006  (2 years) Research Engineer IRISA 2000  –  2001  (1 year) Research Engineer IRISA 2000  –  2001  (1 year) Undergrad intern Fraunhofer FIRST 1999  –  2000  (1 year) Undergrad intern Fraunhofer FIRST 1999  –  2000  (1 year) Skills Computer Architecture Compiler Optimization Parallel Programming Processors MPI Parallel Computing Distributed Systems Multi-core GPGPU Debugging C++ Algorithm Design Compilers Algorithms Fortran Microprocessors Programming See 2+     See less Skills  Computer Architecture Compiler Optimization Parallel Programming Processors MPI Parallel Computing Distributed Systems Multi-core GPGPU Debugging C++ Algorithm Design Compilers Algorithms Fortran Microprocessors Programming See 2+     See less Computer Architecture Compiler Optimization Parallel Programming Processors MPI Parallel Computing Distributed Systems Multi-core GPGPU Debugging C++ Algorithm Design Compilers Algorithms Fortran Microprocessors Programming See 2+     See less Computer Architecture Compiler Optimization Parallel Programming Processors MPI Parallel Computing Distributed Systems Multi-core GPGPU Debugging C++ Algorithm Design Compilers Algorithms Fortran Microprocessors Programming See 2+     See less ", "Summary I am a senior researcher and project manager with more than fifteen years of experience in the area of Information Technology, as a combination of post-graduate education, a successful academic career, and a position as senior principal investigator in a large corporation. This career spans multiple geographical locations and cultures, in Europe and North America. Summary I am a senior researcher and project manager with more than fifteen years of experience in the area of Information Technology, as a combination of post-graduate education, a successful academic career, and a position as senior principal investigator in a large corporation. This career spans multiple geographical locations and cultures, in Europe and North America. I am a senior researcher and project manager with more than fifteen years of experience in the area of Information Technology, as a combination of post-graduate education, a successful academic career, and a position as senior principal investigator in a large corporation. This career spans multiple geographical locations and cultures, in Europe and North America. I am a senior researcher and project manager with more than fifteen years of experience in the area of Information Technology, as a combination of post-graduate education, a successful academic career, and a position as senior principal investigator in a large corporation. This career spans multiple geographical locations and cultures, in Europe and North America. Experience Senior Research Scientist Intel Corporation August 2011  – Present (4 years 1 month) Braunschweig Area, Germany Over three years of experience co-leading a team of highly qualified R&D engineers in a Fortune 500 company. Responsibilities included setting technical directions and priorities, bridging R&D and product teams through IP and technology transfer, and liaising with research teams in academia. Professor University of Edinburgh March 2001  –  2013  (12 years) Over ten years of experience leading a team of post-graduate researchers in a world-class University and collaborating with academic research leaders in Europe and North America. Responsibilities included identifying and pursuing research in open grand challenges in computer science and computer engineering, managing a research team, and co-leading with academic peers a set of State and industry funded research grants. Research Assistant University of Illinois at Urbana-Champaign 1996  –  2001  (5 years) Senior Research Scientist Intel Corporation August 2011  – Present (4 years 1 month) Braunschweig Area, Germany Over three years of experience co-leading a team of highly qualified R&D engineers in a Fortune 500 company. Responsibilities included setting technical directions and priorities, bridging R&D and product teams through IP and technology transfer, and liaising with research teams in academia. Senior Research Scientist Intel Corporation August 2011  – Present (4 years 1 month) Braunschweig Area, Germany Over three years of experience co-leading a team of highly qualified R&D engineers in a Fortune 500 company. Responsibilities included setting technical directions and priorities, bridging R&D and product teams through IP and technology transfer, and liaising with research teams in academia. Professor University of Edinburgh March 2001  –  2013  (12 years) Over ten years of experience leading a team of post-graduate researchers in a world-class University and collaborating with academic research leaders in Europe and North America. Responsibilities included identifying and pursuing research in open grand challenges in computer science and computer engineering, managing a research team, and co-leading with academic peers a set of State and industry funded research grants. Professor University of Edinburgh March 2001  –  2013  (12 years) Over ten years of experience leading a team of post-graduate researchers in a world-class University and collaborating with academic research leaders in Europe and North America. Responsibilities included identifying and pursuing research in open grand challenges in computer science and computer engineering, managing a research team, and co-leading with academic peers a set of State and industry funded research grants. Research Assistant University of Illinois at Urbana-Champaign 1996  –  2001  (5 years) Research Assistant University of Illinois at Urbana-Champaign 1996  –  2001  (5 years) Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency German Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Algorithms Computer Science LaTeX Machine Learning Parallel Computing High Performance... Computer Architecture Simulations Parallel Programming Matlab Signal Processing Image Processing Distributed Systems Artificial Intelligence Software Engineering Skills  Algorithms Computer Science LaTeX Machine Learning Parallel Computing High Performance... Computer Architecture Simulations Parallel Programming Matlab Signal Processing Image Processing Distributed Systems Artificial Intelligence Software Engineering Algorithms Computer Science LaTeX Machine Learning Parallel Computing High Performance... Computer Architecture Simulations Parallel Programming Matlab Signal Processing Image Processing Distributed Systems Artificial Intelligence Software Engineering Algorithms Computer Science LaTeX Machine Learning Parallel Computing High Performance... Computer Architecture Simulations Parallel Programming Matlab Signal Processing Image Processing Distributed Systems Artificial Intelligence Software Engineering Education University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Computer Engineering 1996  – 2001 Universidade de São Paulo / USP Master of Science (MSc),  Computer Engineering 1994  – 1996 Universidade de São Paulo / USP Bachelor of Science (BSc),  Electrical and Electronics Engineering 1988  – 1992 University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Computer Engineering 1996  – 2001 University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Computer Engineering 1996  – 2001 University of Illinois at Urbana-Champaign Doctor of Philosophy (PhD),  Computer Engineering 1996  – 2001 Universidade de São Paulo / USP Master of Science (MSc),  Computer Engineering 1994  – 1996 Universidade de São Paulo / USP Master of Science (MSc),  Computer Engineering 1994  – 1996 Universidade de São Paulo / USP Master of Science (MSc),  Computer Engineering 1994  – 1996 Universidade de São Paulo / USP Bachelor of Science (BSc),  Electrical and Electronics Engineering 1988  – 1992 Universidade de São Paulo / USP Bachelor of Science (BSc),  Electrical and Electronics Engineering 1988  – 1992 Universidade de São Paulo / USP Bachelor of Science (BSc),  Electrical and Electronics Engineering 1988  – 1992 Honors & Awards ACM Senior Member Association for Computing Machinery IEEE Senior Member Institute of Electrical and Electronics Engineers Award of Research Excellence Intel Corporation February 2012 Award of Research Excellence Intel Corporation November 2012 Divisional Recognition Award Intel Corporation May 2013 ACM Senior Member Association for Computing Machinery ACM Senior Member Association for Computing Machinery ACM Senior Member Association for Computing Machinery IEEE Senior Member Institute of Electrical and Electronics Engineers IEEE Senior Member Institute of Electrical and Electronics Engineers IEEE Senior Member Institute of Electrical and Electronics Engineers Award of Research Excellence Intel Corporation February 2012 Award of Research Excellence Intel Corporation February 2012 Award of Research Excellence Intel Corporation February 2012 Award of Research Excellence Intel Corporation November 2012 Award of Research Excellence Intel Corporation November 2012 Award of Research Excellence Intel Corporation November 2012 Divisional Recognition Award Intel Corporation May 2013 Divisional Recognition Award Intel Corporation May 2013 Divisional Recognition Award Intel Corporation May 2013 ", "Summary Kathi R. Kitner is a cultural anthropologist and UX Strategist with Intel Labs' Interaction and Experience Research (IXR) group. She has always been focused on uncovering sustainable pathways for improving economic livelihoods, and analyzing how certain cultural practices around, for example, social class and gender can open or constrain such opportunities.  \n \nKathi is now working on a project encompassing the topics of visual culture, creativity, urban food security, and smart phone adoption in South Africa in collaboration with colleagues at the University of Johannesburg.  \n \nPreviously, Kathi led the project Smart Phone Anywhere, looking at mobile phone use in Indonesia and India. She continues to draw insights for her work at the intersection of new technologies and culture from another project, Consumerization, which documented the interplay between class, consumption, shifting world economies and technology adoption. \n \nWhile focusing on the social and cultural aspect of technology adoption and use, she retains a strong interest and expertise in the focus area of political ecology and the social qualities of environmental change.  \n \nSome of her earlier research has focused on the uneven process of globalization in Venezuela, pathways to heroin addiction in Miami, and social impact assessments in US and Caribben fishing communities. Kitner holds a Ph.D. in Anthropology and Latin American Studies from the University of Florida. \n \nSpecialties: Latin America \nFluency in Spanish \nSocial Impact Assessment \nMonitoring and Evaluation \nTechnologies for Community Development Summary Kathi R. Kitner is a cultural anthropologist and UX Strategist with Intel Labs' Interaction and Experience Research (IXR) group. She has always been focused on uncovering sustainable pathways for improving economic livelihoods, and analyzing how certain cultural practices around, for example, social class and gender can open or constrain such opportunities.  \n \nKathi is now working on a project encompassing the topics of visual culture, creativity, urban food security, and smart phone adoption in South Africa in collaboration with colleagues at the University of Johannesburg.  \n \nPreviously, Kathi led the project Smart Phone Anywhere, looking at mobile phone use in Indonesia and India. She continues to draw insights for her work at the intersection of new technologies and culture from another project, Consumerization, which documented the interplay between class, consumption, shifting world economies and technology adoption. \n \nWhile focusing on the social and cultural aspect of technology adoption and use, she retains a strong interest and expertise in the focus area of political ecology and the social qualities of environmental change.  \n \nSome of her earlier research has focused on the uneven process of globalization in Venezuela, pathways to heroin addiction in Miami, and social impact assessments in US and Caribben fishing communities. Kitner holds a Ph.D. in Anthropology and Latin American Studies from the University of Florida. \n \nSpecialties: Latin America \nFluency in Spanish \nSocial Impact Assessment \nMonitoring and Evaluation \nTechnologies for Community Development Kathi R. Kitner is a cultural anthropologist and UX Strategist with Intel Labs' Interaction and Experience Research (IXR) group. She has always been focused on uncovering sustainable pathways for improving economic livelihoods, and analyzing how certain cultural practices around, for example, social class and gender can open or constrain such opportunities.  \n \nKathi is now working on a project encompassing the topics of visual culture, creativity, urban food security, and smart phone adoption in South Africa in collaboration with colleagues at the University of Johannesburg.  \n \nPreviously, Kathi led the project Smart Phone Anywhere, looking at mobile phone use in Indonesia and India. She continues to draw insights for her work at the intersection of new technologies and culture from another project, Consumerization, which documented the interplay between class, consumption, shifting world economies and technology adoption. \n \nWhile focusing on the social and cultural aspect of technology adoption and use, she retains a strong interest and expertise in the focus area of political ecology and the social qualities of environmental change.  \n \nSome of her earlier research has focused on the uneven process of globalization in Venezuela, pathways to heroin addiction in Miami, and social impact assessments in US and Caribben fishing communities. Kitner holds a Ph.D. in Anthropology and Latin American Studies from the University of Florida. \n \nSpecialties: Latin America \nFluency in Spanish \nSocial Impact Assessment \nMonitoring and Evaluation \nTechnologies for Community Development Kathi R. Kitner is a cultural anthropologist and UX Strategist with Intel Labs' Interaction and Experience Research (IXR) group. She has always been focused on uncovering sustainable pathways for improving economic livelihoods, and analyzing how certain cultural practices around, for example, social class and gender can open or constrain such opportunities.  \n \nKathi is now working on a project encompassing the topics of visual culture, creativity, urban food security, and smart phone adoption in South Africa in collaboration with colleagues at the University of Johannesburg.  \n \nPreviously, Kathi led the project Smart Phone Anywhere, looking at mobile phone use in Indonesia and India. She continues to draw insights for her work at the intersection of new technologies and culture from another project, Consumerization, which documented the interplay between class, consumption, shifting world economies and technology adoption. \n \nWhile focusing on the social and cultural aspect of technology adoption and use, she retains a strong interest and expertise in the focus area of political ecology and the social qualities of environmental change.  \n \nSome of her earlier research has focused on the uneven process of globalization in Venezuela, pathways to heroin addiction in Miami, and social impact assessments in US and Caribben fishing communities. Kitner holds a Ph.D. in Anthropology and Latin American Studies from the University of Florida. \n \nSpecialties: Latin America \nFluency in Spanish \nSocial Impact Assessment \nMonitoring and Evaluation \nTechnologies for Community Development Experience Cultural Anthropologist/Senior Research Scientist Intel Corporation March 2006  – Present (9 years 6 months) Oregon, USA My work has focused a good deal on Information and Communication Technology for Development, or how new technologies - and new media forms - can help or hinder local quality of life. I am particularly interested in the social constructs of gender and class and how those act as a conduit for different types of technology usage and adoption. \n \nCurrently I am engaged in exploring the changing work practices that are emanating from the latest iteration of the Internet of Things, or the instrumentation of the material world.  \n \nI have conducted development research globally in urban and rural settings, looking at mobile and smart phone technology adoption.My most recent project in this sphere was focused on mobile technology in Sub-Saharan Africa, and in collaboration with the University of Johannesburg, examined how different social and economic groups have begun to use smart phones in day to day urban practices. Cultural Anthropologist South Atlantic Fishery Mgt Council (SAFMC) July 1999  –  January 2006  (6 years 7 months) Conducted anthropological field research among fishing communities and crafted social impact assessments. Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Secretary American Anthropological Association 1999  –  2003  (4 years) Served as Editor of the monthly short column for the National Association for the Practice of Anthropology. Research Asst Professor University of Miami 1996  –  1999  (3 years) Coral Gables, FL Position as the lead ethnographer on a NIDA-funded research program studying HIV interventions and transmission behaviors among non-injecting and injecting heroin users in Miami, FL.  \n \nAlso taught Cultures of the Caribbean at UM and Introduction to Anthropology at Florida International University. Teaching Asst. University of Florida 1986  –  1996  (10 years) Taught Human Sexuality and Biological Anthropology while working on a MA and PhD. Cultural Anthropologist/Senior Research Scientist Intel Corporation March 2006  – Present (9 years 6 months) Oregon, USA My work has focused a good deal on Information and Communication Technology for Development, or how new technologies - and new media forms - can help or hinder local quality of life. I am particularly interested in the social constructs of gender and class and how those act as a conduit for different types of technology usage and adoption. \n \nCurrently I am engaged in exploring the changing work practices that are emanating from the latest iteration of the Internet of Things, or the instrumentation of the material world.  \n \nI have conducted development research globally in urban and rural settings, looking at mobile and smart phone technology adoption.My most recent project in this sphere was focused on mobile technology in Sub-Saharan Africa, and in collaboration with the University of Johannesburg, examined how different social and economic groups have begun to use smart phones in day to day urban practices. Cultural Anthropologist/Senior Research Scientist Intel Corporation March 2006  – Present (9 years 6 months) Oregon, USA My work has focused a good deal on Information and Communication Technology for Development, or how new technologies - and new media forms - can help or hinder local quality of life. I am particularly interested in the social constructs of gender and class and how those act as a conduit for different types of technology usage and adoption. \n \nCurrently I am engaged in exploring the changing work practices that are emanating from the latest iteration of the Internet of Things, or the instrumentation of the material world.  \n \nI have conducted development research globally in urban and rural settings, looking at mobile and smart phone technology adoption.My most recent project in this sphere was focused on mobile technology in Sub-Saharan Africa, and in collaboration with the University of Johannesburg, examined how different social and economic groups have begun to use smart phones in day to day urban practices. Cultural Anthropologist South Atlantic Fishery Mgt Council (SAFMC) July 1999  –  January 2006  (6 years 7 months) Conducted anthropological field research among fishing communities and crafted social impact assessments. Cultural Anthropologist South Atlantic Fishery Mgt Council (SAFMC) July 1999  –  January 2006  (6 years 7 months) Conducted anthropological field research among fishing communities and crafted social impact assessments. Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Mentor Coordinator National Association of Practicing Anthropologists 2003  –  2006  (3 years) Secretary American Anthropological Association 1999  –  2003  (4 years) Served as Editor of the monthly short column for the National Association for the Practice of Anthropology. Secretary American Anthropological Association 1999  –  2003  (4 years) Served as Editor of the monthly short column for the National Association for the Practice of Anthropology. Research Asst Professor University of Miami 1996  –  1999  (3 years) Coral Gables, FL Position as the lead ethnographer on a NIDA-funded research program studying HIV interventions and transmission behaviors among non-injecting and injecting heroin users in Miami, FL.  \n \nAlso taught Cultures of the Caribbean at UM and Introduction to Anthropology at Florida International University. Research Asst Professor University of Miami 1996  –  1999  (3 years) Coral Gables, FL Position as the lead ethnographer on a NIDA-funded research program studying HIV interventions and transmission behaviors among non-injecting and injecting heroin users in Miami, FL.  \n \nAlso taught Cultures of the Caribbean at UM and Introduction to Anthropology at Florida International University. Teaching Asst. University of Florida 1986  –  1996  (10 years) Taught Human Sexuality and Biological Anthropology while working on a MA and PhD. Teaching Asst. University of Florida 1986  –  1996  (10 years) Taught Human Sexuality and Biological Anthropology while working on a MA and PhD. Languages Spanish Full professional proficiency Portuguese Limited working proficiency Spanish Full professional proficiency Portuguese Limited working proficiency Spanish Full professional proficiency Portuguese Limited working proficiency Full professional proficiency Limited working proficiency Skills Latin America Spanish Ethnography Social Impact Assessment Research Design Qualitative Research Data Analysis Research User-centered Design User Experience Program Management Community Development Contextual Inquiry Teaching User Research Usability Testing Human Computer... Quantitative Research Focus Groups Heuristic Evaluation Analysis Design Research Mobile Devices Public Speaking University Teaching Grant Writing Editing Program Evaluation See 13+     See less Skills  Latin America Spanish Ethnography Social Impact Assessment Research Design Qualitative Research Data Analysis Research User-centered Design User Experience Program Management Community Development Contextual Inquiry Teaching User Research Usability Testing Human Computer... Quantitative Research Focus Groups Heuristic Evaluation Analysis Design Research Mobile Devices Public Speaking University Teaching Grant Writing Editing Program Evaluation See 13+     See less Latin America Spanish Ethnography Social Impact Assessment Research Design Qualitative Research Data Analysis Research User-centered Design User Experience Program Management Community Development Contextual Inquiry Teaching User Research Usability Testing Human Computer... Quantitative Research Focus Groups Heuristic Evaluation Analysis Design Research Mobile Devices Public Speaking University Teaching Grant Writing Editing Program Evaluation See 13+     See less Latin America Spanish Ethnography Social Impact Assessment Research Design Qualitative Research Data Analysis Research User-centered Design User Experience Program Management Community Development Contextual Inquiry Teaching User Research Usability Testing Human Computer... Quantitative Research Focus Groups Heuristic Evaluation Analysis Design Research Mobile Devices Public Speaking University Teaching Grant Writing Editing Program Evaluation See 13+     See less Education University of Florida Ph.D.,  Anthropology ,  Latin American Studies 1989  – 1996 Kent State University BA,  Latin American Studies ,  Anthropology 1976  – 1979 University of Florida Ph.D.,  Anthropology ,  Latin American Studies 1989  – 1996 University of Florida Ph.D.,  Anthropology ,  Latin American Studies 1989  – 1996 University of Florida Ph.D.,  Anthropology ,  Latin American Studies 1989  – 1996 Kent State University BA,  Latin American Studies ,  Anthropology 1976  – 1979 Kent State University BA,  Latin American Studies ,  Anthropology 1976  – 1979 Kent State University BA,  Latin American Studies ,  Anthropology 1976  – 1979 ", "Summary My research focusses on high performance energy-efficient hardware accelerator circuits and system design. More specifically, my expertise is in platform scalable accelerator design based on algorithm, micro-architecture and circuit co-optimization. My research ideas have led to orders of magnitude improvement in throughput and energy-efficiency of many mainstream applications in the areas of security (AES, SHA, SMS4, PUFs, RNG), on-die interconnects (NoCs, Swizzle switches, bi-directional signaling, 3D networks), lossless data compression/decompression (DEFLATE, Snappy, LZ variants), as well as futuristic techniques like compressive sensing. I have published 25 articles in peer reviewed conferences/journals and hold 6 patents with 14 more pending in these areas of research. Summary My research focusses on high performance energy-efficient hardware accelerator circuits and system design. More specifically, my expertise is in platform scalable accelerator design based on algorithm, micro-architecture and circuit co-optimization. My research ideas have led to orders of magnitude improvement in throughput and energy-efficiency of many mainstream applications in the areas of security (AES, SHA, SMS4, PUFs, RNG), on-die interconnects (NoCs, Swizzle switches, bi-directional signaling, 3D networks), lossless data compression/decompression (DEFLATE, Snappy, LZ variants), as well as futuristic techniques like compressive sensing. I have published 25 articles in peer reviewed conferences/journals and hold 6 patents with 14 more pending in these areas of research. My research focusses on high performance energy-efficient hardware accelerator circuits and system design. More specifically, my expertise is in platform scalable accelerator design based on algorithm, micro-architecture and circuit co-optimization. My research ideas have led to orders of magnitude improvement in throughput and energy-efficiency of many mainstream applications in the areas of security (AES, SHA, SMS4, PUFs, RNG), on-die interconnects (NoCs, Swizzle switches, bi-directional signaling, 3D networks), lossless data compression/decompression (DEFLATE, Snappy, LZ variants), as well as futuristic techniques like compressive sensing. I have published 25 articles in peer reviewed conferences/journals and hold 6 patents with 14 more pending in these areas of research. My research focusses on high performance energy-efficient hardware accelerator circuits and system design. More specifically, my expertise is in platform scalable accelerator design based on algorithm, micro-architecture and circuit co-optimization. My research ideas have led to orders of magnitude improvement in throughput and energy-efficiency of many mainstream applications in the areas of security (AES, SHA, SMS4, PUFs, RNG), on-die interconnects (NoCs, Swizzle switches, bi-directional signaling, 3D networks), lossless data compression/decompression (DEFLATE, Snappy, LZ variants), as well as futuristic techniques like compressive sensing. I have published 25 articles in peer reviewed conferences/journals and hold 6 patents with 14 more pending in these areas of research. Experience Senior Research Scientist Intel Corporation February 2012  – Present (3 years 7 months) Hillsboro In my current role, I lead research on high throughput energy-efficient lossless data compression/decompression, hardware security and compressive sensing accelerator circuits. Many of these technologies have been transferred to multiple products. My research has produced 11 patent filings, 7 conference/journal publications and six test-prototypes (PUF, NoC, AES, SM4, Compressive Sensing, Random Number Generator) fabricated in advanced Intel process technologies. Graduate Student Research Assistant University of Michigan August 2007  –  December 2011  (4 years 5 months) Ann Arbor My research on swizzle switches and high radix on-die permutation networks resulted in the development of 4 test prototypes, 7 patent filings in the US, 5 in the UK, and 5 in Japan apart from 11 publications 6 of which featured in ISSCC and VLSI Symposium. 2 of my projects have won student design contest awards (one of them as the lead designer). As a member of MICL (Michigan Integrated Circuits Lab), I contributed to many successful funding expeditions from NSF, DARPA, Intel Corporation, Quallcom, ARM Ltd. etc. I was leading the research on on-die interconnect fabrics from Umich and drove joint collaboration with researchers from a UK based company called ARM Ltd. in a 5 year funded research program.  Graduate Technical Intern Intel Corporation April 2011  –  August 2011  (5 months) Hillsboro Proposed novel circuit techniques to improve latency and energy efficiency of on chip routers and improve scalability using source synchronous and priority based communication circuits. My work resulted in two invention disclosures. Undergraduate Intern Infineon Technologies April 2006  –  July 2006  (4 months) Munich Area, Germany Working with the Chip-Card design group, I designed the testing board and set up the testing environment in Lab-View for the first lot of test-chips of a novel floating gate based Flash memory cell. My set up could uncover a flaw in the design layout that was rectified in the successive lot of flash cells. Senior Research Scientist Intel Corporation February 2012  – Present (3 years 7 months) Hillsboro In my current role, I lead research on high throughput energy-efficient lossless data compression/decompression, hardware security and compressive sensing accelerator circuits. Many of these technologies have been transferred to multiple products. My research has produced 11 patent filings, 7 conference/journal publications and six test-prototypes (PUF, NoC, AES, SM4, Compressive Sensing, Random Number Generator) fabricated in advanced Intel process technologies. Senior Research Scientist Intel Corporation February 2012  – Present (3 years 7 months) Hillsboro In my current role, I lead research on high throughput energy-efficient lossless data compression/decompression, hardware security and compressive sensing accelerator circuits. Many of these technologies have been transferred to multiple products. My research has produced 11 patent filings, 7 conference/journal publications and six test-prototypes (PUF, NoC, AES, SM4, Compressive Sensing, Random Number Generator) fabricated in advanced Intel process technologies. Graduate Student Research Assistant University of Michigan August 2007  –  December 2011  (4 years 5 months) Ann Arbor My research on swizzle switches and high radix on-die permutation networks resulted in the development of 4 test prototypes, 7 patent filings in the US, 5 in the UK, and 5 in Japan apart from 11 publications 6 of which featured in ISSCC and VLSI Symposium. 2 of my projects have won student design contest awards (one of them as the lead designer). As a member of MICL (Michigan Integrated Circuits Lab), I contributed to many successful funding expeditions from NSF, DARPA, Intel Corporation, Quallcom, ARM Ltd. etc. I was leading the research on on-die interconnect fabrics from Umich and drove joint collaboration with researchers from a UK based company called ARM Ltd. in a 5 year funded research program.  Graduate Student Research Assistant University of Michigan August 2007  –  December 2011  (4 years 5 months) Ann Arbor My research on swizzle switches and high radix on-die permutation networks resulted in the development of 4 test prototypes, 7 patent filings in the US, 5 in the UK, and 5 in Japan apart from 11 publications 6 of which featured in ISSCC and VLSI Symposium. 2 of my projects have won student design contest awards (one of them as the lead designer). As a member of MICL (Michigan Integrated Circuits Lab), I contributed to many successful funding expeditions from NSF, DARPA, Intel Corporation, Quallcom, ARM Ltd. etc. I was leading the research on on-die interconnect fabrics from Umich and drove joint collaboration with researchers from a UK based company called ARM Ltd. in a 5 year funded research program.  Graduate Technical Intern Intel Corporation April 2011  –  August 2011  (5 months) Hillsboro Proposed novel circuit techniques to improve latency and energy efficiency of on chip routers and improve scalability using source synchronous and priority based communication circuits. My work resulted in two invention disclosures. Graduate Technical Intern Intel Corporation April 2011  –  August 2011  (5 months) Hillsboro Proposed novel circuit techniques to improve latency and energy efficiency of on chip routers and improve scalability using source synchronous and priority based communication circuits. My work resulted in two invention disclosures. Undergraduate Intern Infineon Technologies April 2006  –  July 2006  (4 months) Munich Area, Germany Working with the Chip-Card design group, I designed the testing board and set up the testing environment in Lab-View for the first lot of test-chips of a novel floating gate based Flash memory cell. My set up could uncover a flaw in the design layout that was rectified in the successive lot of flash cells. Undergraduate Intern Infineon Technologies April 2006  –  July 2006  (4 months) Munich Area, Germany Working with the Chip-Card design group, I designed the testing board and set up the testing environment in Lab-View for the first lot of test-chips of a novel floating gate based Flash memory cell. My set up could uncover a flaw in the design layout that was rectified in the successive lot of flash cells. Languages English Hindi Oriya English Hindi Oriya English Hindi Oriya Skills Matlab C++ C Machine Learning Nanotechnology Business Strategy Engineering Semiconductors Embedded Systems Simulations R&D Cadence Synopsys tools RTL Design VHDL Integrated Circuit... Microarchitecture FPGA prototyping SoC Validation Debugging See 6+     See less Skills  Matlab C++ C Machine Learning Nanotechnology Business Strategy Engineering Semiconductors Embedded Systems Simulations R&D Cadence Synopsys tools RTL Design VHDL Integrated Circuit... Microarchitecture FPGA prototyping SoC Validation Debugging See 6+     See less Matlab C++ C Machine Learning Nanotechnology Business Strategy Engineering Semiconductors Embedded Systems Simulations R&D Cadence Synopsys tools RTL Design VHDL Integrated Circuit... Microarchitecture FPGA prototyping SoC Validation Debugging See 6+     See less Matlab C++ C Machine Learning Nanotechnology Business Strategy Engineering Semiconductors Embedded Systems Simulations R&D Cadence Synopsys tools RTL Design VHDL Integrated Circuit... Microarchitecture FPGA prototyping SoC Validation Debugging See 6+     See less Education University of Michigan Doctor of Philosophy (Ph.D.),  Electrical Engineering 2007  – 2011 High throughput energy efficient on-die switch fabric design. University of Michigan - Rackham Graduate School Master’s Degree,  Electrical and Electronics Engineering , 8.6/9.0 2007  – 2010 Indian Institute of Technology, Kanpur BS,  Electrical Engineering , 9.4/10.0 2003  – 2007 Bachelor of Technology, Electrical Engineering National University of Singapore Bachelor’s Degree,  Electrical and Electronics Engineering 2006  – 2006 Attended a semester under the IITK-NUS Student exchange program. University of Michigan Doctor of Philosophy (Ph.D.),  Electrical Engineering 2007  – 2011 High throughput energy efficient on-die switch fabric design. University of Michigan Doctor of Philosophy (Ph.D.),  Electrical Engineering 2007  – 2011 High throughput energy efficient on-die switch fabric design. University of Michigan Doctor of Philosophy (Ph.D.),  Electrical Engineering 2007  – 2011 High throughput energy efficient on-die switch fabric design. University of Michigan - Rackham Graduate School Master’s Degree,  Electrical and Electronics Engineering , 8.6/9.0 2007  – 2010 University of Michigan - Rackham Graduate School Master’s Degree,  Electrical and Electronics Engineering , 8.6/9.0 2007  – 2010 University of Michigan - Rackham Graduate School Master’s Degree,  Electrical and Electronics Engineering , 8.6/9.0 2007  – 2010 Indian Institute of Technology, Kanpur BS,  Electrical Engineering , 9.4/10.0 2003  – 2007 Bachelor of Technology, Electrical Engineering Indian Institute of Technology, Kanpur BS,  Electrical Engineering , 9.4/10.0 2003  – 2007 Bachelor of Technology, Electrical Engineering Indian Institute of Technology, Kanpur BS,  Electrical Engineering , 9.4/10.0 2003  – 2007 Bachelor of Technology, Electrical Engineering National University of Singapore Bachelor’s Degree,  Electrical and Electronics Engineering 2006  – 2006 Attended a semester under the IITK-NUS Student exchange program. National University of Singapore Bachelor’s Degree,  Electrical and Electronics Engineering 2006  – 2006 Attended a semester under the IITK-NUS Student exchange program. National University of Singapore Bachelor’s Degree,  Electrical and Electronics Engineering 2006  – 2006 Attended a semester under the IITK-NUS Student exchange program. ", "Summary Wireless Architect and 4G/LTE expert with extensive industry experience over both radio access network and modem chipset for architecture/algorithm design, standardization research, and performance verification in various domains (PHY/MAC/RRC/RRM/Power optimization). Self-motivated technical lead with excellent problem-solving, idea-generating, and team-working skills. Summary Wireless Architect and 4G/LTE expert with extensive industry experience over both radio access network and modem chipset for architecture/algorithm design, standardization research, and performance verification in various domains (PHY/MAC/RRC/RRM/Power optimization). Self-motivated technical lead with excellent problem-solving, idea-generating, and team-working skills. Wireless Architect and 4G/LTE expert with extensive industry experience over both radio access network and modem chipset for architecture/algorithm design, standardization research, and performance verification in various domains (PHY/MAC/RRC/RRM/Power optimization). Self-motivated technical lead with excellent problem-solving, idea-generating, and team-working skills. Wireless Architect and 4G/LTE expert with extensive industry experience over both radio access network and modem chipset for architecture/algorithm design, standardization research, and performance verification in various domains (PHY/MAC/RRC/RRM/Power optimization). Self-motivated technical lead with excellent problem-solving, idea-generating, and team-working skills. Experience Senior Research Scientist Intel Corporation December 2014  – Present (9 months) Santa Clara, California 5G Research for Wireless Communication Systems at Intel Labs \nLTE Machine Type Communications (MTC) \nCellular Internet of Things (IoT) \n3GPP RAN1 standardization \n Engineering Manager Synapse Design December 2013  –  November 2014  (1 year) San Francisco Bay Area Conducting wireless system architecture design with low cost low power, and leading the LTE modem SoC development for MTC applications in a pioneering project on Cellular IoT (Internet of Things). Principal Engineer - Systems Design Broadcom April 2011  –  December 2013  (2 years 9 months) San Francisco Bay Area Wireless modem system design and protocol stack architecture for 4G LTE FDD and TD-LTE. End-to-end knowledge of both control plane and data plane for mobile phone systems.  \n- System requirements, feature design, RFI response, GCF testing and IOT planning for tier-1 operators and infra vendors \n- In-depth knowledge on PHY/MAC/RRC functions and procedures: OFDMA frame structure, various MIMO modes, RACH, cell selection/reselection, radio setup and configuration, radio resource management especially uplink power control, mobility management, DL/UL data and control channels \n- Protocol stack architecture and API design, code review, signaling debugging and protocol analysis, performance verification /optimization, for Access Stratum (AS) and NAS \n- Modem power management, optimization, analysis and measurement \n- Hands-on lab experience for verification and debugging with various BS simulators and test equipment  \n- Participated in 3GPP RAN meetings for Rel11/12 development Consultant Engineer AT&T Labs, Inc. 2011  –  2011  (less than a year) Systems Engineer Huawei Technologies (USA) 2006  –  2010  (4 years) Greater San Diego Area Responsible for PHY/MAC layer product algorithm design and standardization support for LTE/WiMAX OFDMA systems. Leading advanced research on next-gen cellular networks, defining and managing projects independently \n- Developed algorithms/protocols and led the projects on Radio Resource Management including power control and coordinated scheduling, MIMO precoding/beamforming schemes, novel framework of distributed antenna systems, two-way relaying scheme, coordinated transmission/reception (CoMP), eICIC and SON  \n- Carried out comprehensive OFDMA system level simulations for performance analysis and prototype development. Proficiency with Matlab and C. In-depth understanding of cellular systems evaluation methodology and implementation details \n- Participated in /contributed to major wireless industry standards, including 3GPP2/UMB (2006), WiMAX (2007) and 3GPP/LTE (2008-2010), with innovative contributions present and adopted in standards \n- Led internal and external collaboration projects with strong team-working skills Staff Engineer Ericsson 2000  –  2006  (6 years) Greater San Diego Area Air interface expert on CDMA Base Station radio networks algorithm designs, and comprehensive system level simulations. Represented Ericsson at 3GPP2 for standardization.  \n- Radio function design for developing CDMA2000 cellular systems, including standard analysis, architecture defining, use case deriving and system requirements/specifications writing. Major algorithms include power control, resource scheduling, and soft handoff \n- Produced a large number of standard contributions, patent applications and paper publications on development of CDMA2000 1xEV-DV and DO at 3GPP2 TSG-C WG3. Major contributor to the Ericsson CDMA/WiMAX tutorials at IEEE conferences \n- Strong simulation expertise by creating the Ericsson system level simulators for CDMA2000 1x. using Matlab and C. Carried out all the baseline simulations and various functionality studies for 3GPP2 standardization work and product algorithm development Senior Research Scientist Intel Corporation December 2014  – Present (9 months) Santa Clara, California 5G Research for Wireless Communication Systems at Intel Labs \nLTE Machine Type Communications (MTC) \nCellular Internet of Things (IoT) \n3GPP RAN1 standardization \n Senior Research Scientist Intel Corporation December 2014  – Present (9 months) Santa Clara, California 5G Research for Wireless Communication Systems at Intel Labs \nLTE Machine Type Communications (MTC) \nCellular Internet of Things (IoT) \n3GPP RAN1 standardization \n Engineering Manager Synapse Design December 2013  –  November 2014  (1 year) San Francisco Bay Area Conducting wireless system architecture design with low cost low power, and leading the LTE modem SoC development for MTC applications in a pioneering project on Cellular IoT (Internet of Things). Engineering Manager Synapse Design December 2013  –  November 2014  (1 year) San Francisco Bay Area Conducting wireless system architecture design with low cost low power, and leading the LTE modem SoC development for MTC applications in a pioneering project on Cellular IoT (Internet of Things). Principal Engineer - Systems Design Broadcom April 2011  –  December 2013  (2 years 9 months) San Francisco Bay Area Wireless modem system design and protocol stack architecture for 4G LTE FDD and TD-LTE. End-to-end knowledge of both control plane and data plane for mobile phone systems.  \n- System requirements, feature design, RFI response, GCF testing and IOT planning for tier-1 operators and infra vendors \n- In-depth knowledge on PHY/MAC/RRC functions and procedures: OFDMA frame structure, various MIMO modes, RACH, cell selection/reselection, radio setup and configuration, radio resource management especially uplink power control, mobility management, DL/UL data and control channels \n- Protocol stack architecture and API design, code review, signaling debugging and protocol analysis, performance verification /optimization, for Access Stratum (AS) and NAS \n- Modem power management, optimization, analysis and measurement \n- Hands-on lab experience for verification and debugging with various BS simulators and test equipment  \n- Participated in 3GPP RAN meetings for Rel11/12 development Principal Engineer - Systems Design Broadcom April 2011  –  December 2013  (2 years 9 months) San Francisco Bay Area Wireless modem system design and protocol stack architecture for 4G LTE FDD and TD-LTE. End-to-end knowledge of both control plane and data plane for mobile phone systems.  \n- System requirements, feature design, RFI response, GCF testing and IOT planning for tier-1 operators and infra vendors \n- In-depth knowledge on PHY/MAC/RRC functions and procedures: OFDMA frame structure, various MIMO modes, RACH, cell selection/reselection, radio setup and configuration, radio resource management especially uplink power control, mobility management, DL/UL data and control channels \n- Protocol stack architecture and API design, code review, signaling debugging and protocol analysis, performance verification /optimization, for Access Stratum (AS) and NAS \n- Modem power management, optimization, analysis and measurement \n- Hands-on lab experience for verification and debugging with various BS simulators and test equipment  \n- Participated in 3GPP RAN meetings for Rel11/12 development Consultant Engineer AT&T Labs, Inc. 2011  –  2011  (less than a year) Consultant Engineer AT&T Labs, Inc. 2011  –  2011  (less than a year) Systems Engineer Huawei Technologies (USA) 2006  –  2010  (4 years) Greater San Diego Area Responsible for PHY/MAC layer product algorithm design and standardization support for LTE/WiMAX OFDMA systems. Leading advanced research on next-gen cellular networks, defining and managing projects independently \n- Developed algorithms/protocols and led the projects on Radio Resource Management including power control and coordinated scheduling, MIMO precoding/beamforming schemes, novel framework of distributed antenna systems, two-way relaying scheme, coordinated transmission/reception (CoMP), eICIC and SON  \n- Carried out comprehensive OFDMA system level simulations for performance analysis and prototype development. Proficiency with Matlab and C. In-depth understanding of cellular systems evaluation methodology and implementation details \n- Participated in /contributed to major wireless industry standards, including 3GPP2/UMB (2006), WiMAX (2007) and 3GPP/LTE (2008-2010), with innovative contributions present and adopted in standards \n- Led internal and external collaboration projects with strong team-working skills Systems Engineer Huawei Technologies (USA) 2006  –  2010  (4 years) Greater San Diego Area Responsible for PHY/MAC layer product algorithm design and standardization support for LTE/WiMAX OFDMA systems. Leading advanced research on next-gen cellular networks, defining and managing projects independently \n- Developed algorithms/protocols and led the projects on Radio Resource Management including power control and coordinated scheduling, MIMO precoding/beamforming schemes, novel framework of distributed antenna systems, two-way relaying scheme, coordinated transmission/reception (CoMP), eICIC and SON  \n- Carried out comprehensive OFDMA system level simulations for performance analysis and prototype development. Proficiency with Matlab and C. In-depth understanding of cellular systems evaluation methodology and implementation details \n- Participated in /contributed to major wireless industry standards, including 3GPP2/UMB (2006), WiMAX (2007) and 3GPP/LTE (2008-2010), with innovative contributions present and adopted in standards \n- Led internal and external collaboration projects with strong team-working skills Staff Engineer Ericsson 2000  –  2006  (6 years) Greater San Diego Area Air interface expert on CDMA Base Station radio networks algorithm designs, and comprehensive system level simulations. Represented Ericsson at 3GPP2 for standardization.  \n- Radio function design for developing CDMA2000 cellular systems, including standard analysis, architecture defining, use case deriving and system requirements/specifications writing. Major algorithms include power control, resource scheduling, and soft handoff \n- Produced a large number of standard contributions, patent applications and paper publications on development of CDMA2000 1xEV-DV and DO at 3GPP2 TSG-C WG3. Major contributor to the Ericsson CDMA/WiMAX tutorials at IEEE conferences \n- Strong simulation expertise by creating the Ericsson system level simulators for CDMA2000 1x. using Matlab and C. Carried out all the baseline simulations and various functionality studies for 3GPP2 standardization work and product algorithm development Staff Engineer Ericsson 2000  –  2006  (6 years) Greater San Diego Area Air interface expert on CDMA Base Station radio networks algorithm designs, and comprehensive system level simulations. Represented Ericsson at 3GPP2 for standardization.  \n- Radio function design for developing CDMA2000 cellular systems, including standard analysis, architecture defining, use case deriving and system requirements/specifications writing. Major algorithms include power control, resource scheduling, and soft handoff \n- Produced a large number of standard contributions, patent applications and paper publications on development of CDMA2000 1xEV-DV and DO at 3GPP2 TSG-C WG3. Major contributor to the Ericsson CDMA/WiMAX tutorials at IEEE conferences \n- Strong simulation expertise by creating the Ericsson system level simulators for CDMA2000 1x. using Matlab and C. Carried out all the baseline simulations and various functionality studies for 3GPP2 standardization work and product algorithm development Skills LTE WiMAX 3GPP OFDM CDMA 4G Cellular Communications 3G MIMO Simulations Power Control Protocol Stacks WCDMA EVDO CDMA2000 HSPA Optimizations 3GPP2 Signal Processing Wireless Modems M2M Distributed Antenna... See 8+     See less Skills  LTE WiMAX 3GPP OFDM CDMA 4G Cellular Communications 3G MIMO Simulations Power Control Protocol Stacks WCDMA EVDO CDMA2000 HSPA Optimizations 3GPP2 Signal Processing Wireless Modems M2M Distributed Antenna... See 8+     See less LTE WiMAX 3GPP OFDM CDMA 4G Cellular Communications 3G MIMO Simulations Power Control Protocol Stacks WCDMA EVDO CDMA2000 HSPA Optimizations 3GPP2 Signal Processing Wireless Modems M2M Distributed Antenna... See 8+     See less LTE WiMAX 3GPP OFDM CDMA 4G Cellular Communications 3G MIMO Simulations Power Control Protocol Stacks WCDMA EVDO CDMA2000 HSPA Optimizations 3GPP2 Signal Processing Wireless Modems M2M Distributed Antenna... See 8+     See less Education University of Utah Shanghai Jiao Tong University University of Utah University of Utah University of Utah Shanghai Jiao Tong University Shanghai Jiao Tong University Shanghai Jiao Tong University Honors & Awards 2013 Best Paper-Award IEEE Signal Processing Society \"Multiuser MIMO in Distributed Antenna Systems with Out-of-Cell Interference\" \nIEEE Transactions on Signal Processing 59(10): 4885-4899 (2011) 2013 Best Paper-Award IEEE Signal Processing Society \"Multiuser MIMO in Distributed Antenna Systems with Out-of-Cell Interference\" \nIEEE Transactions on Signal Processing 59(10): 4885-4899 (2011) 2013 Best Paper-Award IEEE Signal Processing Society \"Multiuser MIMO in Distributed Antenna Systems with Out-of-Cell Interference\" \nIEEE Transactions on Signal Processing 59(10): 4885-4899 (2011) 2013 Best Paper-Award IEEE Signal Processing Society \"Multiuser MIMO in Distributed Antenna Systems with Out-of-Cell Interference\" \nIEEE Transactions on Signal Processing 59(10): 4885-4899 (2011) ", "Languages Swedish Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC Skills  IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC Education Stanford University Ph.D. 2004 KTH Royal Institute of Technology 2000  – 2003 University of Chicago Bachelor of Science (B.Sc.) Stanford University Ph.D. 2004 Stanford University Ph.D. 2004 Stanford University Ph.D. 2004 KTH Royal Institute of Technology 2000  – 2003 KTH Royal Institute of Technology 2000  – 2003 KTH Royal Institute of Technology 2000  – 2003 University of Chicago Bachelor of Science (B.Sc.) University of Chicago Bachelor of Science (B.Sc.) University of Chicago Bachelor of Science (B.Sc.) ", "Skills Mass Spectrometry Spectroscopy AFM Characterization Nanotechnology Chemistry Surface Chemistry Analytical Methods... Microscopy Self-assembled... Organic Chemistry R&D Electrochemistry Thin Films Nanoparticles Skills  Mass Spectrometry Spectroscopy AFM Characterization Nanotechnology Chemistry Surface Chemistry Analytical Methods... Microscopy Self-assembled... Organic Chemistry R&D Electrochemistry Thin Films Nanoparticles Mass Spectrometry Spectroscopy AFM Characterization Nanotechnology Chemistry Surface Chemistry Analytical Methods... Microscopy Self-assembled... Organic Chemistry R&D Electrochemistry Thin Films Nanoparticles Mass Spectrometry Spectroscopy AFM Characterization Nanotechnology Chemistry Surface Chemistry Analytical Methods... Microscopy Self-assembled... Organic Chemistry R&D Electrochemistry Thin Films Nanoparticles ", "Experience Director of Marketing Jinfonet Software February 2012  – Present (3 years 7 months) San Francisco Bay Area Sr. Product Manager Nimbula, Inc. September 2010  –  January 2012  (1 year 5 months) Mountain View, CA Sr. Technical Marketing Manager VMware, Inc. March 2007  –  September 2010  (3 years 7 months) July 2008 – September 2010 \n- Drove the creation and delivery of best practices and use cases to customers and partners for all clustering-related technologies (eg, fault tolerance, high availability, distributed power management, and distributed resource scheduling). Numerous speaking engagements at conferences, seminars, and customer briefings. \n \nMarch 2007 – July 2008 \n- Architected data center for the VMware Briefing Center. The data center is used to give live demos on all our products to visiting customers. Gave product demos and overviews to customers. \n- Enabled and supported sales teams with technical and roadmap details across our entire product line-up through close collaboration with product management. Product Marketing Engineer Intel Corporation November 2005  –  October 2006  (1 year) - Managed the Intel Desktop Platform Roadmap for Intel’s highest volume processor and chipset product lines. Drove roadmap strategies and positioning by closing with engineering and validation teams, gaining monthly internal VP&GM approval, and training world-wide field sales teams. Created product messaging to optimize strategies and positioning, and to hone alignment between product strategies, pricing, and factory supply guidance. \n- Led Intel’s desktop processor and chipset compatibility strategy, including internal and customer-facing Compatibility Matrix, which communicates validated platform combinations. Senior Research Scientist Intel Corporation April 2004  –  November 2005  (1 year 8 months) - Primary architect for the Scale-Out Virtualization research project, which allows platform resources (e.g., CPU, storage, etc.) to be partitioned into multiple, dynamic virtual machines. Key components: dynamic platform-based provisioning for resource cataloging, runtime resource re-provisioning, and process migration capabilities. \n- Established collaborative processes with Intel China Research Center for project completion, as well as with Intel’s Digital Enterprise Group and Software Solutions Group. Gained GM-level approval for project to continue to next phase. Director of Marketing Jinfonet Software February 2012  – Present (3 years 7 months) San Francisco Bay Area Director of Marketing Jinfonet Software February 2012  – Present (3 years 7 months) San Francisco Bay Area Sr. Product Manager Nimbula, Inc. September 2010  –  January 2012  (1 year 5 months) Mountain View, CA Sr. Product Manager Nimbula, Inc. September 2010  –  January 2012  (1 year 5 months) Mountain View, CA Sr. Technical Marketing Manager VMware, Inc. March 2007  –  September 2010  (3 years 7 months) July 2008 – September 2010 \n- Drove the creation and delivery of best practices and use cases to customers and partners for all clustering-related technologies (eg, fault tolerance, high availability, distributed power management, and distributed resource scheduling). Numerous speaking engagements at conferences, seminars, and customer briefings. \n \nMarch 2007 – July 2008 \n- Architected data center for the VMware Briefing Center. The data center is used to give live demos on all our products to visiting customers. Gave product demos and overviews to customers. \n- Enabled and supported sales teams with technical and roadmap details across our entire product line-up through close collaboration with product management. Sr. Technical Marketing Manager VMware, Inc. March 2007  –  September 2010  (3 years 7 months) July 2008 – September 2010 \n- Drove the creation and delivery of best practices and use cases to customers and partners for all clustering-related technologies (eg, fault tolerance, high availability, distributed power management, and distributed resource scheduling). Numerous speaking engagements at conferences, seminars, and customer briefings. \n \nMarch 2007 – July 2008 \n- Architected data center for the VMware Briefing Center. The data center is used to give live demos on all our products to visiting customers. Gave product demos and overviews to customers. \n- Enabled and supported sales teams with technical and roadmap details across our entire product line-up through close collaboration with product management. Product Marketing Engineer Intel Corporation November 2005  –  October 2006  (1 year) - Managed the Intel Desktop Platform Roadmap for Intel’s highest volume processor and chipset product lines. Drove roadmap strategies and positioning by closing with engineering and validation teams, gaining monthly internal VP&GM approval, and training world-wide field sales teams. Created product messaging to optimize strategies and positioning, and to hone alignment between product strategies, pricing, and factory supply guidance. \n- Led Intel’s desktop processor and chipset compatibility strategy, including internal and customer-facing Compatibility Matrix, which communicates validated platform combinations. Product Marketing Engineer Intel Corporation November 2005  –  October 2006  (1 year) - Managed the Intel Desktop Platform Roadmap for Intel’s highest volume processor and chipset product lines. Drove roadmap strategies and positioning by closing with engineering and validation teams, gaining monthly internal VP&GM approval, and training world-wide field sales teams. Created product messaging to optimize strategies and positioning, and to hone alignment between product strategies, pricing, and factory supply guidance. \n- Led Intel’s desktop processor and chipset compatibility strategy, including internal and customer-facing Compatibility Matrix, which communicates validated platform combinations. Senior Research Scientist Intel Corporation April 2004  –  November 2005  (1 year 8 months) - Primary architect for the Scale-Out Virtualization research project, which allows platform resources (e.g., CPU, storage, etc.) to be partitioned into multiple, dynamic virtual machines. Key components: dynamic platform-based provisioning for resource cataloging, runtime resource re-provisioning, and process migration capabilities. \n- Established collaborative processes with Intel China Research Center for project completion, as well as with Intel’s Digital Enterprise Group and Software Solutions Group. Gained GM-level approval for project to continue to next phase. Senior Research Scientist Intel Corporation April 2004  –  November 2005  (1 year 8 months) - Primary architect for the Scale-Out Virtualization research project, which allows platform resources (e.g., CPU, storage, etc.) to be partitioned into multiple, dynamic virtual machines. Key components: dynamic platform-based provisioning for resource cataloging, runtime resource re-provisioning, and process migration capabilities. \n- Established collaborative processes with Intel China Research Center for project completion, as well as with Intel’s Digital Enterprise Group and Software Solutions Group. Gained GM-level approval for project to continue to next phase. Languages   Skills Skills     Education University of Southern California Ph.D., M.S.,  Computer Science 1998  – 2003 Ph.D. Dissertation – \"Scalable Randomization for Dynamic Data Storage\" – Developed and analyzed efficient storage scaling algorithms with fast data retrieval, load balancing, and low overhead of storage expansion with a wide range of applications in distributed storage networks, general file systems, and application-specific storage such as media servers. Activities and Societies:  Graduate Tech Alliance ,  Entrepreneur Venture Management Association University of California, Berkeley B.S.,  Electrical Engineering and Computer Science 1993  – 1997 Activities and Societies:  Sigma Phi Epsilon Montgomery Blair High School University of Southern California Ph.D., M.S.,  Computer Science 1998  – 2003 Ph.D. Dissertation – \"Scalable Randomization for Dynamic Data Storage\" – Developed and analyzed efficient storage scaling algorithms with fast data retrieval, load balancing, and low overhead of storage expansion with a wide range of applications in distributed storage networks, general file systems, and application-specific storage such as media servers. Activities and Societies:  Graduate Tech Alliance ,  Entrepreneur Venture Management Association University of Southern California Ph.D., M.S.,  Computer Science 1998  – 2003 Ph.D. Dissertation – \"Scalable Randomization for Dynamic Data Storage\" – Developed and analyzed efficient storage scaling algorithms with fast data retrieval, load balancing, and low overhead of storage expansion with a wide range of applications in distributed storage networks, general file systems, and application-specific storage such as media servers. Activities and Societies:  Graduate Tech Alliance ,  Entrepreneur Venture Management Association University of Southern California Ph.D., M.S.,  Computer Science 1998  – 2003 Ph.D. Dissertation – \"Scalable Randomization for Dynamic Data Storage\" – Developed and analyzed efficient storage scaling algorithms with fast data retrieval, load balancing, and low overhead of storage expansion with a wide range of applications in distributed storage networks, general file systems, and application-specific storage such as media servers. Activities and Societies:  Graduate Tech Alliance ,  Entrepreneur Venture Management Association University of California, Berkeley B.S.,  Electrical Engineering and Computer Science 1993  – 1997 Activities and Societies:  Sigma Phi Epsilon University of California, Berkeley B.S.,  Electrical Engineering and Computer Science 1993  – 1997 Activities and Societies:  Sigma Phi Epsilon University of California, Berkeley B.S.,  Electrical Engineering and Computer Science 1993  – 1997 Activities and Societies:  Sigma Phi Epsilon Montgomery Blair High School Montgomery Blair High School Montgomery Blair High School "]}