{"position": "Senior Staff Architect", "company": "Intel Corporation", "profiles": ["Experience Senior Staff Architect Intel Corporation Senior Staff Architect Intel Corporation Senior Staff Architect Intel Corporation Education University of Delaware BSEE,  Electrical Engineering 1986  – 1990 Georgia Institute of Technology University of Delaware BSEE,  Electrical Engineering 1986  – 1990 University of Delaware BSEE,  Electrical Engineering 1986  – 1990 University of Delaware BSEE,  Electrical Engineering 1986  – 1990 Georgia Institute of Technology Georgia Institute of Technology Georgia Institute of Technology ", "Summary Design and development engineer in embedded systems software with with experience in software architecture and technical leadership. \n \n15+ years experience in design and development of Linux based embedded systems software, both user space applications and kernel space device drivers. \n10+ years experience as a technical lead of multi-site software teams based in Asia and US. \nExperience in design and development of Windows and Windows 8.X based apps, applications and WDF based device drivers. \n \nSpecialties: Specialize in telecom architectures AdvancedTCA (ATCA) and Compact PCI (CPCI). \nExpertise in ATCA, HPI (Hardware Platform Interface) and IPMI (Intelligent Platform Monitoring Interface), I2C, SPI4.2, L2 switching and SNMP. \nProgramming experience in C, C++, Java, C#/.NET, Perl, Python, shell scripting. \nWell versed in object-oriented programming concepts. Summary Design and development engineer in embedded systems software with with experience in software architecture and technical leadership. \n \n15+ years experience in design and development of Linux based embedded systems software, both user space applications and kernel space device drivers. \n10+ years experience as a technical lead of multi-site software teams based in Asia and US. \nExperience in design and development of Windows and Windows 8.X based apps, applications and WDF based device drivers. \n \nSpecialties: Specialize in telecom architectures AdvancedTCA (ATCA) and Compact PCI (CPCI). \nExpertise in ATCA, HPI (Hardware Platform Interface) and IPMI (Intelligent Platform Monitoring Interface), I2C, SPI4.2, L2 switching and SNMP. \nProgramming experience in C, C++, Java, C#/.NET, Perl, Python, shell scripting. \nWell versed in object-oriented programming concepts. Design and development engineer in embedded systems software with with experience in software architecture and technical leadership. \n \n15+ years experience in design and development of Linux based embedded systems software, both user space applications and kernel space device drivers. \n10+ years experience as a technical lead of multi-site software teams based in Asia and US. \nExperience in design and development of Windows and Windows 8.X based apps, applications and WDF based device drivers. \n \nSpecialties: Specialize in telecom architectures AdvancedTCA (ATCA) and Compact PCI (CPCI). \nExpertise in ATCA, HPI (Hardware Platform Interface) and IPMI (Intelligent Platform Monitoring Interface), I2C, SPI4.2, L2 switching and SNMP. \nProgramming experience in C, C++, Java, C#/.NET, Perl, Python, shell scripting. \nWell versed in object-oriented programming concepts. Design and development engineer in embedded systems software with with experience in software architecture and technical leadership. \n \n15+ years experience in design and development of Linux based embedded systems software, both user space applications and kernel space device drivers. \n10+ years experience as a technical lead of multi-site software teams based in Asia and US. \nExperience in design and development of Windows and Windows 8.X based apps, applications and WDF based device drivers. \n \nSpecialties: Specialize in telecom architectures AdvancedTCA (ATCA) and Compact PCI (CPCI). \nExpertise in ATCA, HPI (Hardware Platform Interface) and IPMI (Intelligent Platform Monitoring Interface), I2C, SPI4.2, L2 switching and SNMP. \nProgramming experience in C, C++, Java, C#/.NET, Perl, Python, shell scripting. \nWell versed in object-oriented programming concepts. Skills Embedded Systems Embedded Software C++ C Device Drivers Linux Android Biometrics Two-factor... Crypto Java C# ATCA Shell Scripting Kernel SNMP I2C Operating Systems Programming OOP Telecommunications See 6+     See less Skills  Embedded Systems Embedded Software C++ C Device Drivers Linux Android Biometrics Two-factor... Crypto Java C# ATCA Shell Scripting Kernel SNMP I2C Operating Systems Programming OOP Telecommunications See 6+     See less Embedded Systems Embedded Software C++ C Device Drivers Linux Android Biometrics Two-factor... Crypto Java C# ATCA Shell Scripting Kernel SNMP I2C Operating Systems Programming OOP Telecommunications See 6+     See less Embedded Systems Embedded Software C++ C Device Drivers Linux Android Biometrics Two-factor... Crypto Java C# ATCA Shell Scripting Kernel SNMP I2C Operating Systems Programming OOP Telecommunications See 6+     See less ", "Experience IO Architect API Networks 2000  –  2002  (2 years) IO Architect API Networks 2000  –  2002  (2 years) IO Architect API Networks 2000  –  2002  (2 years) Skills SoC Architecture PCIe, SATA, SAS Product Security... Server platform... RTL design SoC PCIe High Performance... SATA RTL Design ASIC Embedded Systems Skills  SoC Architecture PCIe, SATA, SAS Product Security... Server platform... RTL design SoC PCIe High Performance... SATA RTL Design ASIC Embedded Systems SoC Architecture PCIe, SATA, SAS Product Security... Server platform... RTL design SoC PCIe High Performance... SATA RTL Design ASIC Embedded Systems SoC Architecture PCIe, SATA, SAS Product Security... Server platform... RTL design SoC PCIe High Performance... SATA RTL Design ASIC Embedded Systems Education Korea University PhD,  Computer Engineering 1995 Korea University PhD,  Computer Engineering 1995 Korea University PhD,  Computer Engineering 1995 Korea University PhD,  Computer Engineering 1995 ", "Summary Demonstrated strategic and technical leadership in multiprocessor computer architecture, on-chip and off-chip networks and protocols, cache organization and coherency, performance modeling and analysis, system architecture, and power-efficient microarchitecture and implementations. Summary Demonstrated strategic and technical leadership in multiprocessor computer architecture, on-chip and off-chip networks and protocols, cache organization and coherency, performance modeling and analysis, system architecture, and power-efficient microarchitecture and implementations. Demonstrated strategic and technical leadership in multiprocessor computer architecture, on-chip and off-chip networks and protocols, cache organization and coherency, performance modeling and analysis, system architecture, and power-efficient microarchitecture and implementations. Demonstrated strategic and technical leadership in multiprocessor computer architecture, on-chip and off-chip networks and protocols, cache organization and coherency, performance modeling and analysis, system architecture, and power-efficient microarchitecture and implementations. Experience Principal Engineer and Manager Intel January 2006  – Present (9 years 8 months) Santa Clara, CA Manager and technical leader of a small research team to architect, develop and prototype network-on-chip, cache organization, and coherency protocol for scalable high-performance multi-core architectures Principal Engineer Intel Corporation April 2003  –  December 2005  (2 years 9 months) Santa Clara, CA Part of Intel's QuickPath System Interface definition and specification team responsible for several system architecture features of the protocol Senior Staff Architect Intel Corporation April 2000  –  April 2003  (3 years 1 month) Santa Clara, CA Developed and specified link, protocol and system architecture features of a cache-coherent point-to-point multiprocessor system interface working with product architecture/design and system partners Staff Computer Architect Intel Corporation October 1997  –  April 2000  (2 years 7 months) Santa Clara, CA Defined and specified link and coherency protocol for a point-to-point cache-coherent multiprocessor system interface. Developed a multi-level cache model and analysis tool to analyze cache access behavior of on-line transaction processing workload. System Performance Architect Intel Corporation April 1996  –  October 1997  (1 year 7 months) Santa Clara, CA Performance modeling and evaluation of cache hierarchy on SPEC benchmark to set cache parameters for a processor design Principal Engineer and Manager Intel January 2006  – Present (9 years 8 months) Santa Clara, CA Manager and technical leader of a small research team to architect, develop and prototype network-on-chip, cache organization, and coherency protocol for scalable high-performance multi-core architectures Principal Engineer and Manager Intel January 2006  – Present (9 years 8 months) Santa Clara, CA Manager and technical leader of a small research team to architect, develop and prototype network-on-chip, cache organization, and coherency protocol for scalable high-performance multi-core architectures Principal Engineer Intel Corporation April 2003  –  December 2005  (2 years 9 months) Santa Clara, CA Part of Intel's QuickPath System Interface definition and specification team responsible for several system architecture features of the protocol Principal Engineer Intel Corporation April 2003  –  December 2005  (2 years 9 months) Santa Clara, CA Part of Intel's QuickPath System Interface definition and specification team responsible for several system architecture features of the protocol Senior Staff Architect Intel Corporation April 2000  –  April 2003  (3 years 1 month) Santa Clara, CA Developed and specified link, protocol and system architecture features of a cache-coherent point-to-point multiprocessor system interface working with product architecture/design and system partners Senior Staff Architect Intel Corporation April 2000  –  April 2003  (3 years 1 month) Santa Clara, CA Developed and specified link, protocol and system architecture features of a cache-coherent point-to-point multiprocessor system interface working with product architecture/design and system partners Staff Computer Architect Intel Corporation October 1997  –  April 2000  (2 years 7 months) Santa Clara, CA Defined and specified link and coherency protocol for a point-to-point cache-coherent multiprocessor system interface. Developed a multi-level cache model and analysis tool to analyze cache access behavior of on-line transaction processing workload. Staff Computer Architect Intel Corporation October 1997  –  April 2000  (2 years 7 months) Santa Clara, CA Defined and specified link and coherency protocol for a point-to-point cache-coherent multiprocessor system interface. Developed a multi-level cache model and analysis tool to analyze cache access behavior of on-line transaction processing workload. System Performance Architect Intel Corporation April 1996  –  October 1997  (1 year 7 months) Santa Clara, CA Performance modeling and evaluation of cache hierarchy on SPEC benchmark to set cache parameters for a processor design System Performance Architect Intel Corporation April 1996  –  October 1997  (1 year 7 months) Santa Clara, CA Performance modeling and evaluation of cache hierarchy on SPEC benchmark to set cache parameters for a processor design Skills Computer Architecture Microarchitecture SoC Network on Chip Multiprocessor... Cache Memory Cache Coherency System Architecture System Protocols Coherency Protocols Performance Modeling Performance Analysis Technical Leadership Technical Management Parallel Computing Processors Microprocessors See 2+     See less Skills  Computer Architecture Microarchitecture SoC Network on Chip Multiprocessor... Cache Memory Cache Coherency System Architecture System Protocols Coherency Protocols Performance Modeling Performance Analysis Technical Leadership Technical Management Parallel Computing Processors Microprocessors See 2+     See less Computer Architecture Microarchitecture SoC Network on Chip Multiprocessor... Cache Memory Cache Coherency System Architecture System Protocols Coherency Protocols Performance Modeling Performance Analysis Technical Leadership Technical Management Parallel Computing Processors Microprocessors See 2+     See less Computer Architecture Microarchitecture SoC Network on Chip Multiprocessor... Cache Memory Cache Coherency System Architecture System Protocols Coherency Protocols Performance Modeling Performance Analysis Technical Leadership Technical Management Parallel Computing Processors Microprocessors See 2+     See less Education Texas A&M University PhD,  Computer Science 1991  – 1996 Indian Institute of Technology, Kharagpur MTech,  Electronics & Communication Engg. 1989  – 1991 Sardar Vallabhbhai National Institute of Technology, Surat BE,  Electronics Engg. 1984  – 1988 Texas A&M University PhD,  Computer Science 1991  – 1996 Texas A&M University PhD,  Computer Science 1991  – 1996 Texas A&M University PhD,  Computer Science 1991  – 1996 Indian Institute of Technology, Kharagpur MTech,  Electronics & Communication Engg. 1989  – 1991 Indian Institute of Technology, Kharagpur MTech,  Electronics & Communication Engg. 1989  – 1991 Indian Institute of Technology, Kharagpur MTech,  Electronics & Communication Engg. 1989  – 1991 Sardar Vallabhbhai National Institute of Technology, Surat BE,  Electronics Engg. 1984  – 1988 Sardar Vallabhbhai National Institute of Technology, Surat BE,  Electronics Engg. 1984  – 1988 Sardar Vallabhbhai National Institute of Technology, Surat BE,  Electronics Engg. 1984  – 1988 ", "Summary Experienced Design, Pre-Silicon Verification, Post Silicon Validation, Emulation Engineer with wide range of experience in multi-core processor and SoC technologies. \n \nMulti-project experience utilizing simulation, verification and emulation technologies. \nHands-on knowledge in the development and execution of verification environments and test plans utilizing various design, scripting, verification high-level languages. \nDeveloped and Implemented verification plans for multiple processor and chipset designs utilizing both simulation and emulation technologies. \nDeveloped primary silicon debug methodology and tool utilized by Intel X86 processors for nearly a decade incorporating emulation as an essential facet of processor verification methodology. Summary Experienced Design, Pre-Silicon Verification, Post Silicon Validation, Emulation Engineer with wide range of experience in multi-core processor and SoC technologies. \n \nMulti-project experience utilizing simulation, verification and emulation technologies. \nHands-on knowledge in the development and execution of verification environments and test plans utilizing various design, scripting, verification high-level languages. \nDeveloped and Implemented verification plans for multiple processor and chipset designs utilizing both simulation and emulation technologies. \nDeveloped primary silicon debug methodology and tool utilized by Intel X86 processors for nearly a decade incorporating emulation as an essential facet of processor verification methodology. Experienced Design, Pre-Silicon Verification, Post Silicon Validation, Emulation Engineer with wide range of experience in multi-core processor and SoC technologies. \n \nMulti-project experience utilizing simulation, verification and emulation technologies. \nHands-on knowledge in the development and execution of verification environments and test plans utilizing various design, scripting, verification high-level languages. \nDeveloped and Implemented verification plans for multiple processor and chipset designs utilizing both simulation and emulation technologies. \nDeveloped primary silicon debug methodology and tool utilized by Intel X86 processors for nearly a decade incorporating emulation as an essential facet of processor verification methodology. Experienced Design, Pre-Silicon Verification, Post Silicon Validation, Emulation Engineer with wide range of experience in multi-core processor and SoC technologies. \n \nMulti-project experience utilizing simulation, verification and emulation technologies. \nHands-on knowledge in the development and execution of verification environments and test plans utilizing various design, scripting, verification high-level languages. \nDeveloped and Implemented verification plans for multiple processor and chipset designs utilizing both simulation and emulation technologies. \nDeveloped primary silicon debug methodology and tool utilized by Intel X86 processors for nearly a decade incorporating emulation as an essential facet of processor verification methodology. Experience Adjunct Faculty California State University, Fullerton January 2014  – Present (1 year 8 months) Verification Architect Cadence Design Systems 2005  –  2008  (3 years) Solutions Architect Mentor Graphics November 2003  –  May 2005  (1 year 7 months) Senior Staff Architect Intel Corporation 1991  –  2003  (12 years) Adjunct Faculty California State University, Fullerton January 2014  – Present (1 year 8 months) Adjunct Faculty California State University, Fullerton January 2014  – Present (1 year 8 months) Verification Architect Cadence Design Systems 2005  –  2008  (3 years) Verification Architect Cadence Design Systems 2005  –  2008  (3 years) Solutions Architect Mentor Graphics November 2003  –  May 2005  (1 year 7 months) Solutions Architect Mentor Graphics November 2003  –  May 2005  (1 year 7 months) Senior Staff Architect Intel Corporation 1991  –  2003  (12 years) Senior Staff Architect Intel Corporation 1991  –  2003  (12 years) Skills Simulations Matlab Algorithms C++ Programming FPGA Software Engineering IC VLSI Debugging Skills  Simulations Matlab Algorithms C++ Programming FPGA Software Engineering IC VLSI Debugging Simulations Matlab Algorithms C++ Programming FPGA Software Engineering IC VLSI Debugging Simulations Matlab Algorithms C++ Programming FPGA Software Engineering IC VLSI Debugging Education University of Minnesota-Twin Cities Master's Degree,  Electrical and Electronics Engineering 1989  – 1991 South Dakota School of Mines and Technology Bachelor of Science,  Electrical and Electronics Engineering 1986  – 1989 University of Minnesota-Twin Cities Master's Degree,  Electrical and Electronics Engineering 1989  – 1991 University of Minnesota-Twin Cities Master's Degree,  Electrical and Electronics Engineering 1989  – 1991 University of Minnesota-Twin Cities Master's Degree,  Electrical and Electronics Engineering 1989  – 1991 South Dakota School of Mines and Technology Bachelor of Science,  Electrical and Electronics Engineering 1986  – 1989 South Dakota School of Mines and Technology Bachelor of Science,  Electrical and Electronics Engineering 1986  – 1989 South Dakota School of Mines and Technology Bachelor of Science,  Electrical and Electronics Engineering 1986  – 1989 ", "Skills Processors Intel Computer Architecture Algorithms Machine Learning Microprocessors Architectures Microarchitecture Embedded Systems Software Engineering System Architecture Simulations High Performance... Skills  Processors Intel Computer Architecture Algorithms Machine Learning Microprocessors Architectures Microarchitecture Embedded Systems Software Engineering System Architecture Simulations High Performance... Processors Intel Computer Architecture Algorithms Machine Learning Microprocessors Architectures Microarchitecture Embedded Systems Software Engineering System Architecture Simulations High Performance... Processors Intel Computer Architecture Algorithms Machine Learning Microprocessors Architectures Microarchitecture Embedded Systems Software Engineering System Architecture Simulations High Performance... ", "Experience Senior Staff Architect Intel Corporation Senior Staff Architect Intel Corporation Senior Staff Architect Intel Corporation ", "Summary Green Building Japan (GBJ) Co-Chair of the Board \n \nIntel Corporate Services Regional Engineering Senior Staff Architect Summary Green Building Japan (GBJ) Co-Chair of the Board \n \nIntel Corporate Services Regional Engineering Senior Staff Architect Green Building Japan (GBJ) Co-Chair of the Board \n \nIntel Corporate Services Regional Engineering Senior Staff Architect Green Building Japan (GBJ) Co-Chair of the Board \n \nIntel Corporate Services Regional Engineering Senior Staff Architect Experience Green Building Japan (GBJ) Co-Chair of the Board Green Building Japan March 2013  – Present (2 years 6 months) Chiyoda-ku, Japan Shigeru co-founded Green Building Japan (GBJ) - LEED Professional Group in Japan, as a member of LEED International Roundtable from Japan on March 2013. \nGBJ contracted with U.S. Green Building Council (USGBC) on LEED promotion in Japan and sustainability technology & service transfer from Japan to global market through LEED as a global common sustainbility platform. \nGBJ Co-founders are Mr. Hiroki Hiramatsu, Ms. Ayako Omura and Mr. Kentaro Suga. Intel Corporate Services Regional Engineering Senior Staff Architect Intel Corporation July 2000  – Present (15 years 2 months) Tokyo, Japan Leading Regional Green Initiatives in Intel on LEED and Energy Conservation Projects \n- Registered Architect in Japan \n- LEED Accredited Professional \n- USGBC (U.S. Green Building Council) Faculty \n- Project Manager for major construction project in Intel Japan. \n \nJoined Intel 2000, Civil, Structural and Architectural (CSA) Design Lead for all major projects in Asia. \nPrior to joining Intel,  \n- Facilities Manager for the Apple Japan operations \n- Facilities Management at Morgan Stanley, Tokyo. Green Building Japan (GBJ) Co-Chair of the Board Green Building Japan March 2013  – Present (2 years 6 months) Chiyoda-ku, Japan Shigeru co-founded Green Building Japan (GBJ) - LEED Professional Group in Japan, as a member of LEED International Roundtable from Japan on March 2013. \nGBJ contracted with U.S. Green Building Council (USGBC) on LEED promotion in Japan and sustainability technology & service transfer from Japan to global market through LEED as a global common sustainbility platform. \nGBJ Co-founders are Mr. Hiroki Hiramatsu, Ms. Ayako Omura and Mr. Kentaro Suga. Green Building Japan (GBJ) Co-Chair of the Board Green Building Japan March 2013  – Present (2 years 6 months) Chiyoda-ku, Japan Shigeru co-founded Green Building Japan (GBJ) - LEED Professional Group in Japan, as a member of LEED International Roundtable from Japan on March 2013. \nGBJ contracted with U.S. Green Building Council (USGBC) on LEED promotion in Japan and sustainability technology & service transfer from Japan to global market through LEED as a global common sustainbility platform. \nGBJ Co-founders are Mr. Hiroki Hiramatsu, Ms. Ayako Omura and Mr. Kentaro Suga. Intel Corporate Services Regional Engineering Senior Staff Architect Intel Corporation July 2000  – Present (15 years 2 months) Tokyo, Japan Leading Regional Green Initiatives in Intel on LEED and Energy Conservation Projects \n- Registered Architect in Japan \n- LEED Accredited Professional \n- USGBC (U.S. Green Building Council) Faculty \n- Project Manager for major construction project in Intel Japan. \n \nJoined Intel 2000, Civil, Structural and Architectural (CSA) Design Lead for all major projects in Asia. \nPrior to joining Intel,  \n- Facilities Manager for the Apple Japan operations \n- Facilities Management at Morgan Stanley, Tokyo. Intel Corporate Services Regional Engineering Senior Staff Architect Intel Corporation July 2000  – Present (15 years 2 months) Tokyo, Japan Leading Regional Green Initiatives in Intel on LEED and Energy Conservation Projects \n- Registered Architect in Japan \n- LEED Accredited Professional \n- USGBC (U.S. Green Building Council) Faculty \n- Project Manager for major construction project in Intel Japan. \n \nJoined Intel 2000, Civil, Structural and Architectural (CSA) Design Lead for all major projects in Asia. \nPrior to joining Intel,  \n- Facilities Manager for the Apple Japan operations \n- Facilities Management at Morgan Stanley, Tokyo. Skills Green Building LEED Project Planning Energy Conservation Management Engineering Management Facilities Management Sustainability LEED AP Engineering Construction USGBC Skills  Green Building LEED Project Planning Energy Conservation Management Engineering Management Facilities Management Sustainability LEED AP Engineering Construction USGBC Green Building LEED Project Planning Energy Conservation Management Engineering Management Facilities Management Sustainability LEED AP Engineering Construction USGBC Green Building LEED Project Planning Energy Conservation Management Engineering Management Facilities Management Sustainability LEED AP Engineering Construction USGBC "]}