{"position": "Senior Design Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Design Engineer Intel Corporation September 2012  – Present (3 years) Senior Design Engineer V Semiconductor January 2012  –  September 2012  (9 months) Senior Analog Designer Gennum Corporation November 2007  –  January 2012  (4 years 3 months) Analog Designer Snowbush Inc. June 2002  –  November 2007  (5 years 6 months) R&D Engineer inSilicon November 2001  –  June 2002  (8 months) Senior Design Engineer Intel Corporation September 2012  – Present (3 years) Senior Design Engineer Intel Corporation September 2012  – Present (3 years) Senior Design Engineer V Semiconductor January 2012  –  September 2012  (9 months) Senior Design Engineer V Semiconductor January 2012  –  September 2012  (9 months) Senior Analog Designer Gennum Corporation November 2007  –  January 2012  (4 years 3 months) Senior Analog Designer Gennum Corporation November 2007  –  January 2012  (4 years 3 months) Analog Designer Snowbush Inc. June 2002  –  November 2007  (5 years 6 months) Analog Designer Snowbush Inc. June 2002  –  November 2007  (5 years 6 months) R&D Engineer inSilicon November 2001  –  June 2002  (8 months) R&D Engineer inSilicon November 2001  –  June 2002  (8 months) Skills SERDES Equalizers Magnetic Read Channels IC Mixed Signal ASIC Analog Cadence Virtuoso VLSI Skills  SERDES Equalizers Magnetic Read Channels IC Mixed Signal ASIC Analog Cadence Virtuoso VLSI SERDES Equalizers Magnetic Read Channels IC Mixed Signal ASIC Analog Cadence Virtuoso VLSI SERDES Equalizers Magnetic Read Channels IC Mixed Signal ASIC Analog Cadence Virtuoso VLSI Education University of Toronto PhD,  Electronics 1997  – 2001 Sharif University of Technology Master of Science (M.Sc.),  Electrical and Electronics Engineering 1986 University of Toronto PhD,  Electronics 1997  – 2001 University of Toronto PhD,  Electronics 1997  – 2001 University of Toronto PhD,  Electronics 1997  – 2001 Sharif University of Technology Master of Science (M.Sc.),  Electrical and Electronics Engineering 1986 Sharif University of Technology Master of Science (M.Sc.),  Electrical and Electronics Engineering 1986 Sharif University of Technology Master of Science (M.Sc.),  Electrical and Electronics Engineering 1986 ", "Languages English Hindi English Hindi English Hindi Skills ASIC Synthesis PnR CPU Design Microprocessors TCL Processors EDA Static Timing Analysis IC Logic Synthesis CPU design PNR Perl Timing Closure Synopsys tools VLSI Computer Architecture See 3+     See less Skills  ASIC Synthesis PnR CPU Design Microprocessors TCL Processors EDA Static Timing Analysis IC Logic Synthesis CPU design PNR Perl Timing Closure Synopsys tools VLSI Computer Architecture See 3+     See less ASIC Synthesis PnR CPU Design Microprocessors TCL Processors EDA Static Timing Analysis IC Logic Synthesis CPU design PNR Perl Timing Closure Synopsys tools VLSI Computer Architecture See 3+     See less ASIC Synthesis PnR CPU Design Microprocessors TCL Processors EDA Static Timing Analysis IC Logic Synthesis CPU design PNR Perl Timing Closure Synopsys tools VLSI Computer Architecture See 3+     See less ", "Experience Senior Design Engineer Intel Corporation Senior Design Engineer Intel Corporation Senior Design Engineer Intel Corporation Education California State University-Sacramento 1991  – 1994 California State University-Sacramento 1991  – 1994 California State University-Sacramento 1991  – 1994 California State University-Sacramento 1991  – 1994 ", "Summary •\tOverall experience of 10+ years in ASIC/FPGA design and verification using System Verilog. \n•\tExperience with synthesis, Timing analysis, ECO, and Silicon debug. \n•\tExperience in Low Power Design and display graphic architecture \n•\tExperience in developing test environment using OVM Summary •\tOverall experience of 10+ years in ASIC/FPGA design and verification using System Verilog. \n•\tExperience with synthesis, Timing analysis, ECO, and Silicon debug. \n•\tExperience in Low Power Design and display graphic architecture \n•\tExperience in developing test environment using OVM •\tOverall experience of 10+ years in ASIC/FPGA design and verification using System Verilog. \n•\tExperience with synthesis, Timing analysis, ECO, and Silicon debug. \n•\tExperience in Low Power Design and display graphic architecture \n•\tExperience in developing test environment using OVM •\tOverall experience of 10+ years in ASIC/FPGA design and verification using System Verilog. \n•\tExperience with synthesis, Timing analysis, ECO, and Silicon debug. \n•\tExperience in Low Power Design and display graphic architecture \n•\tExperience in developing test environment using OVM Experience Senior Design Engineer Intel Corporation December 2005  – Present (9 years 9 months) Folsom, CA •\tResponsible for creating Micro Architecture Specification and design implementation; mainly related to display clock, reset and display feature to lower platform power consumption. \n•\tResponsible for creating Test Plan document, validation component (OVM) and test execution related to display low power features \n \n. Member of Technical Staff GDA Technologies July 2001  –  December 2005  (4 years 6 months) San Jose •\tResponsible for creating Functional Requirement Specification (FRS), RTL design, validation, synthesis and timing analysis for ASIC or FPGA project Senior Design Engineer Intel Corporation December 2005  – Present (9 years 9 months) Folsom, CA •\tResponsible for creating Micro Architecture Specification and design implementation; mainly related to display clock, reset and display feature to lower platform power consumption. \n•\tResponsible for creating Test Plan document, validation component (OVM) and test execution related to display low power features \n \n. Senior Design Engineer Intel Corporation December 2005  – Present (9 years 9 months) Folsom, CA •\tResponsible for creating Micro Architecture Specification and design implementation; mainly related to display clock, reset and display feature to lower platform power consumption. \n•\tResponsible for creating Test Plan document, validation component (OVM) and test execution related to display low power features \n \n. Member of Technical Staff GDA Technologies July 2001  –  December 2005  (4 years 6 months) San Jose •\tResponsible for creating Functional Requirement Specification (FRS), RTL design, validation, synthesis and timing analysis for ASIC or FPGA project Member of Technical Staff GDA Technologies July 2001  –  December 2005  (4 years 6 months) San Jose •\tResponsible for creating Functional Requirement Specification (FRS), RTL design, validation, synthesis and timing analysis for ASIC or FPGA project Skills SoC ASIC Verilog RTL design SystemVerilog OVM Skills  SoC ASIC Verilog RTL design SystemVerilog OVM SoC ASIC Verilog RTL design SystemVerilog OVM SoC ASIC Verilog RTL design SystemVerilog OVM Education California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering SMAK3 University of Indonesia Bachelor of Science (BS),  Physics California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering California State University-Sacramento Master of Science (MS),  Electrical and Electronics Engineering SMAK3 SMAK3 SMAK3 University of Indonesia Bachelor of Science (BS),  Physics University of Indonesia Bachelor of Science (BS),  Physics University of Indonesia Bachelor of Science (BS),  Physics ", "Experience Senior Design Architect Intel Corporation February 2012  – Present (3 years 7 months) San Francisco Bay Area Ivytown/Skylake Design team \n-Section Timing Owner DDR. Responsible for driving timing convergence. Duties included timing audits. Directing floorplan placement and routing. Driving quality convergence by influencing RTL and FUB owners. Also worked on RLS for Mixed FUBsm Senior Design Engineer Intel Corporation October 2009  –  January 2012  (2 years 4 months) Jaketown Design team \n-Section Timing Owner Power Control Unit. Responsible for driving timing convergence. Duties include negotiating initial timing specs. Analysis and resolution of section timing paths. ASIC designer for FUSE block. Senior Design Engineer Intel Corporation January 2007  –  September 2009  (2 years 9 months) San Francisco Bay Area Penryn Design Team \n-Circuit Design BUS Unit. Completed datapath design of high-speed registers, multiplexing and control blocks, Performed presto simulation needed to optimize high speed xor blocks. Responsible for review of FUB clock distribution. Also supported section timing convergence. Component Design Engineer – IA32 Intel Corporation July 2001  –  December 2006  (5 years 6 months) Santa Clara,Ca Yonah design team \n-Circuit design Reservation Station Unit. Completed datapath design of high-speed registers, multiplexing and control blocks. Section Timing Owner, was responsible for driving section timing and quality convergence. Component Design Engineer Intel Corporation August 1997  –  July 2001  (4 years) Santa Clara, Ca Madison Design team \n-Circuit design of Bus related logic for the IA64 CPU. Delivered high-speed registers, multiplexing and control blocks. -Responsible for top level routing of four units. Cluster RC representative. \n-Robustness (Power, Electromigration, Hot-electron) and Timing analysis. Supervised 4 mask designers. Performed Silicon debug using failure analysis tools such as scan, LCP and FIBs Validation Engineer - Compatibility Validation Intel Corporation May 1996  –  August 1996  (4 months) Santa Clara, CA Designed automated system for stressing CPUs & chipsets.Conducted compatibility testing of CPUs with popular software titles used on PCs and servers. Software engineer -Technical Operations & Programming Support Intel Corporation January 1995  –  September 1995  (9 months) Chandler, AZ Responsible for testing of control program used on a sort floor. Entailed testing the functionality of the program on three different tester types. Also responsible for the debug & test of a program used for factory automation associated with a tester/prober setup. Technical Marketing Engineer Intel Corporation May 1994  –  August 1994  (4 months) Chandler, AZ Performed compatibility testing using Indeo Video technology. Responsible for setting up a PC lab for Video Capture, which included setting up a computer network. Published paper on setting up PC for Video Capture and Playback. Product Engineer Intel Corporation May 1993  –  August 1993  (4 months) Chandler, Az Performed qualification and reliability testing testing on microprocessors. Quality & Reliability Engineer Intel Corporation May 1992  –  December 1992  (8 months) Chandler, AZ •\tPerformed Data collection and customer support related to the Dock-to- stock program. \n•\tPerformed Failure Analysis on static RAM integrated circuit, which entailed liquid crystal \nanalysis, chemical & dry etching. Senior Design Architect Intel Corporation February 2012  – Present (3 years 7 months) San Francisco Bay Area Ivytown/Skylake Design team \n-Section Timing Owner DDR. Responsible for driving timing convergence. Duties included timing audits. Directing floorplan placement and routing. Driving quality convergence by influencing RTL and FUB owners. Also worked on RLS for Mixed FUBsm Senior Design Architect Intel Corporation February 2012  – Present (3 years 7 months) San Francisco Bay Area Ivytown/Skylake Design team \n-Section Timing Owner DDR. Responsible for driving timing convergence. Duties included timing audits. Directing floorplan placement and routing. Driving quality convergence by influencing RTL and FUB owners. Also worked on RLS for Mixed FUBsm Senior Design Engineer Intel Corporation October 2009  –  January 2012  (2 years 4 months) Jaketown Design team \n-Section Timing Owner Power Control Unit. Responsible for driving timing convergence. Duties include negotiating initial timing specs. Analysis and resolution of section timing paths. ASIC designer for FUSE block. Senior Design Engineer Intel Corporation October 2009  –  January 2012  (2 years 4 months) Jaketown Design team \n-Section Timing Owner Power Control Unit. Responsible for driving timing convergence. Duties include negotiating initial timing specs. Analysis and resolution of section timing paths. ASIC designer for FUSE block. Senior Design Engineer Intel Corporation January 2007  –  September 2009  (2 years 9 months) San Francisco Bay Area Penryn Design Team \n-Circuit Design BUS Unit. Completed datapath design of high-speed registers, multiplexing and control blocks, Performed presto simulation needed to optimize high speed xor blocks. Responsible for review of FUB clock distribution. Also supported section timing convergence. Senior Design Engineer Intel Corporation January 2007  –  September 2009  (2 years 9 months) San Francisco Bay Area Penryn Design Team \n-Circuit Design BUS Unit. Completed datapath design of high-speed registers, multiplexing and control blocks, Performed presto simulation needed to optimize high speed xor blocks. Responsible for review of FUB clock distribution. Also supported section timing convergence. Component Design Engineer – IA32 Intel Corporation July 2001  –  December 2006  (5 years 6 months) Santa Clara,Ca Yonah design team \n-Circuit design Reservation Station Unit. Completed datapath design of high-speed registers, multiplexing and control blocks. Section Timing Owner, was responsible for driving section timing and quality convergence. Component Design Engineer – IA32 Intel Corporation July 2001  –  December 2006  (5 years 6 months) Santa Clara,Ca Yonah design team \n-Circuit design Reservation Station Unit. Completed datapath design of high-speed registers, multiplexing and control blocks. Section Timing Owner, was responsible for driving section timing and quality convergence. Component Design Engineer Intel Corporation August 1997  –  July 2001  (4 years) Santa Clara, Ca Madison Design team \n-Circuit design of Bus related logic for the IA64 CPU. Delivered high-speed registers, multiplexing and control blocks. -Responsible for top level routing of four units. Cluster RC representative. \n-Robustness (Power, Electromigration, Hot-electron) and Timing analysis. Supervised 4 mask designers. Performed Silicon debug using failure analysis tools such as scan, LCP and FIBs Component Design Engineer Intel Corporation August 1997  –  July 2001  (4 years) Santa Clara, Ca Madison Design team \n-Circuit design of Bus related logic for the IA64 CPU. Delivered high-speed registers, multiplexing and control blocks. -Responsible for top level routing of four units. Cluster RC representative. \n-Robustness (Power, Electromigration, Hot-electron) and Timing analysis. Supervised 4 mask designers. Performed Silicon debug using failure analysis tools such as scan, LCP and FIBs Validation Engineer - Compatibility Validation Intel Corporation May 1996  –  August 1996  (4 months) Santa Clara, CA Designed automated system for stressing CPUs & chipsets.Conducted compatibility testing of CPUs with popular software titles used on PCs and servers. Validation Engineer - Compatibility Validation Intel Corporation May 1996  –  August 1996  (4 months) Santa Clara, CA Designed automated system for stressing CPUs & chipsets.Conducted compatibility testing of CPUs with popular software titles used on PCs and servers. Software engineer -Technical Operations & Programming Support Intel Corporation January 1995  –  September 1995  (9 months) Chandler, AZ Responsible for testing of control program used on a sort floor. Entailed testing the functionality of the program on three different tester types. Also responsible for the debug & test of a program used for factory automation associated with a tester/prober setup. Software engineer -Technical Operations & Programming Support Intel Corporation January 1995  –  September 1995  (9 months) Chandler, AZ Responsible for testing of control program used on a sort floor. Entailed testing the functionality of the program on three different tester types. Also responsible for the debug & test of a program used for factory automation associated with a tester/prober setup. Technical Marketing Engineer Intel Corporation May 1994  –  August 1994  (4 months) Chandler, AZ Performed compatibility testing using Indeo Video technology. Responsible for setting up a PC lab for Video Capture, which included setting up a computer network. Published paper on setting up PC for Video Capture and Playback. Technical Marketing Engineer Intel Corporation May 1994  –  August 1994  (4 months) Chandler, AZ Performed compatibility testing using Indeo Video technology. Responsible for setting up a PC lab for Video Capture, which included setting up a computer network. Published paper on setting up PC for Video Capture and Playback. Product Engineer Intel Corporation May 1993  –  August 1993  (4 months) Chandler, Az Performed qualification and reliability testing testing on microprocessors. Product Engineer Intel Corporation May 1993  –  August 1993  (4 months) Chandler, Az Performed qualification and reliability testing testing on microprocessors. Quality & Reliability Engineer Intel Corporation May 1992  –  December 1992  (8 months) Chandler, AZ •\tPerformed Data collection and customer support related to the Dock-to- stock program. \n•\tPerformed Failure Analysis on static RAM integrated circuit, which entailed liquid crystal \nanalysis, chemical & dry etching. Quality & Reliability Engineer Intel Corporation May 1992  –  December 1992  (8 months) Chandler, AZ •\tPerformed Data collection and customer support related to the Dock-to- stock program. \n•\tPerformed Failure Analysis on static RAM integrated circuit, which entailed liquid crystal \nanalysis, chemical & dry etching. Skills Verilog ASIC SoC VLSI Computer Architecture RTL design SystemVerilog Debugging Processors Semiconductors Static Timing Analysis Microprocessors Skills  Verilog ASIC SoC VLSI Computer Architecture RTL design SystemVerilog Debugging Processors Semiconductors Static Timing Analysis Microprocessors Verilog ASIC SoC VLSI Computer Architecture RTL design SystemVerilog Debugging Processors Semiconductors Static Timing Analysis Microprocessors Verilog ASIC SoC VLSI Computer Architecture RTL design SystemVerilog Debugging Processors Semiconductors Static Timing Analysis Microprocessors Education University of Wisconsin-Madison MSEE,  Computer engineering 1995  – 1997 Southern University and Agricultural and Mechanical College at Baton Rouge BSEE,  electrical engineering 1989  – 1994 University of Wisconsin-Madison MSEE,  Computer engineering 1995  – 1997 University of Wisconsin-Madison MSEE,  Computer engineering 1995  – 1997 University of Wisconsin-Madison MSEE,  Computer engineering 1995  – 1997 Southern University and Agricultural and Mechanical College at Baton Rouge BSEE,  electrical engineering 1989  – 1994 Southern University and Agricultural and Mechanical College at Baton Rouge BSEE,  electrical engineering 1989  – 1994 Southern University and Agricultural and Mechanical College at Baton Rouge BSEE,  electrical engineering 1989  – 1994 ", "Experience Senior Design Engineer Intel Corporation February 2011  – Present (4 years 7 months) Bangalore IO & ESD Layout Design Design Engineer Infineon Technologies India Pvt Ltd. June 2006  –  December 2010  (4 years 7 months) Senior Design Engineer Intel Corporation February 2011  – Present (4 years 7 months) Bangalore IO & ESD Layout Design Senior Design Engineer Intel Corporation February 2011  – Present (4 years 7 months) Bangalore IO & ESD Layout Design Design Engineer Infineon Technologies India Pvt Ltd. June 2006  –  December 2010  (4 years 7 months) Design Engineer Infineon Technologies India Pvt Ltd. June 2006  –  December 2010  (4 years 7 months) Skills Static Timing Analysis VLSI Physical Verification ASIC Physical Design SoC RTL Design IC Semiconductors Verilog EDA CMOS Integrated Circuit... Mixed Signal Skills  Static Timing Analysis VLSI Physical Verification ASIC Physical Design SoC RTL Design IC Semiconductors Verilog EDA CMOS Integrated Circuit... Mixed Signal Static Timing Analysis VLSI Physical Verification ASIC Physical Design SoC RTL Design IC Semiconductors Verilog EDA CMOS Integrated Circuit... Mixed Signal Static Timing Analysis VLSI Physical Verification ASIC Physical Design SoC RTL Design IC Semiconductors Verilog EDA CMOS Integrated Circuit... Mixed Signal Education University of Rajasthan 2001  – 2005 University of Rajasthan 2001  – 2005 University of Rajasthan 2001  – 2005 University of Rajasthan 2001  – 2005 ", "Summary Working at the giant microprocessor chip maker “Intel Corporation” for more than 10 years where I hold many positions and responsibilities. I gain a lot of technical and managerial skills in one of the world class companies. Involved in many projects where applying technical knowledge and management skills are essential for successful projects that leads to the company revenues higher from year to another. Summary Working at the giant microprocessor chip maker “Intel Corporation” for more than 10 years where I hold many positions and responsibilities. I gain a lot of technical and managerial skills in one of the world class companies. Involved in many projects where applying technical knowledge and management skills are essential for successful projects that leads to the company revenues higher from year to another. Working at the giant microprocessor chip maker “Intel Corporation” for more than 10 years where I hold many positions and responsibilities. I gain a lot of technical and managerial skills in one of the world class companies. Involved in many projects where applying technical knowledge and management skills are essential for successful projects that leads to the company revenues higher from year to another. Working at the giant microprocessor chip maker “Intel Corporation” for more than 10 years where I hold many positions and responsibilities. I gain a lot of technical and managerial skills in one of the world class companies. Involved in many projects where applying technical knowledge and management skills are essential for successful projects that leads to the company revenues higher from year to another. Experience Teach Lead & Senior Design Engineer Intel Corporation December 2005  – Present (9 years 9 months) Hillsboro, OR Different responsibilities that include cache design for high performance microprocessor and SOC. Low power SRAM IP and CMOS design; SRAM operation characterization for functionality (read, write, retention) and power modes (active, sleep, power gate), drives simulation methodology, analyzing in-die variation hazard for SRAM IP and CMOS circuits that cover systematic and random variations and its impact on timing and functional/power hazards. Teach Lead & Senior Design Engineer Intel Corporation December 2005  – Present (9 years 9 months) Hillsboro, OR Different responsibilities that include cache design for high performance microprocessor and SOC. Low power SRAM IP and CMOS design; SRAM operation characterization for functionality (read, write, retention) and power modes (active, sleep, power gate), drives simulation methodology, analyzing in-die variation hazard for SRAM IP and CMOS circuits that cover systematic and random variations and its impact on timing and functional/power hazards. Teach Lead & Senior Design Engineer Intel Corporation December 2005  – Present (9 years 9 months) Hillsboro, OR Different responsibilities that include cache design for high performance microprocessor and SOC. Low power SRAM IP and CMOS design; SRAM operation characterization for functionality (read, write, retention) and power modes (active, sleep, power gate), drives simulation methodology, analyzing in-die variation hazard for SRAM IP and CMOS circuits that cover systematic and random variations and its impact on timing and functional/power hazards. Skills ASIC Verilog Semiconductors Skills  ASIC Verilog Semiconductors ASIC Verilog Semiconductors ASIC Verilog Semiconductors Education University of Louisiana at Lafayette Doctor of Philosophy (Ph.D.),  Computer Engineering 2001  – 2005 Low power Cache design (drives new novel techniques to reduce both dynamic and leakage power in cache design) University of Louisiana at Lafayette Doctor of Philosophy (Ph.D.),  Computer Engineering 2001  – 2005 Low power Cache design (drives new novel techniques to reduce both dynamic and leakage power in cache design) University of Louisiana at Lafayette Doctor of Philosophy (Ph.D.),  Computer Engineering 2001  – 2005 Low power Cache design (drives new novel techniques to reduce both dynamic and leakage power in cache design) University of Louisiana at Lafayette Doctor of Philosophy (Ph.D.),  Computer Engineering 2001  – 2005 Low power Cache design (drives new novel techniques to reduce both dynamic and leakage power in cache design) ", "Summary 15+ years semiconductor industry professional in design and implementation of range of electronic products starting micro-processor, high speed peripherals i.e. high speed SERDES, single chip wireless radio implementation using RF, Analog mixed signal and digital core, switch mode and linear voltage regulator, battery charger and board level design and implementation. Summary 15+ years semiconductor industry professional in design and implementation of range of electronic products starting micro-processor, high speed peripherals i.e. high speed SERDES, single chip wireless radio implementation using RF, Analog mixed signal and digital core, switch mode and linear voltage regulator, battery charger and board level design and implementation. 15+ years semiconductor industry professional in design and implementation of range of electronic products starting micro-processor, high speed peripherals i.e. high speed SERDES, single chip wireless radio implementation using RF, Analog mixed signal and digital core, switch mode and linear voltage regulator, battery charger and board level design and implementation. 15+ years semiconductor industry professional in design and implementation of range of electronic products starting micro-processor, high speed peripherals i.e. high speed SERDES, single chip wireless radio implementation using RF, Analog mixed signal and digital core, switch mode and linear voltage regulator, battery charger and board level design and implementation. Experience Analog Mixed Signal Design Engineer IBM March 2015  – Present (6 months) Fishkill, NY Analog Mixed Signal Simulation, High Speed Serial IO design, Transmitter Line driver design, Frequency synthesis using Phase lock loop, Receiver design including equalization circuits i.e. CTLE, ZFE, DFE. Receiver DFE including DFE Summer design, loop unrolling for timing closure, Rx Slicer design i.e CML latch, Dynamic latch. Senior Design Engineer DEKA Research & Development April 2014  –  March 2015  (1 year) Greater Boston Area Electrical design for in home dialysis medical device design. Staff Electrical Design Engineer BD September 2011  –  April 2014  (2 years 8 months) Greater Boston Area Continuous Glucose Monitoring medical device development for diabetes care. The detection includes CMOS image sensor using 130 nm CMOS technology and 5 layer metal and epi layer to implement inductor to implement LC PLL in the silicon. The read out path comprised to 4T pixel that uses gate enhancement and Front side illumination. The overall dynamic range of the CMOS image sensor was 60dB. Also the read out path includes 12 bit SAR ADC. \n \nIEEE802.15.4 wireless ASIC implementation in a single piece of silicon. The single chip radio includes RF Front End, Base band AFE and MAC layer logic to implement the radio protocol and product specific instructions. Analog Design Engineer Freescale June 2011  –  September 2011  (4 months) Tempe, AZ Universal Communication RF, Analog Mixed Signal Physical Layer design. The design includes modulator, demodulator, clock generation circuits design and implementation. Senior Design Engineer Linear Technology Corporation January 2011  –  June 2011  (6 months) Greater Boston Area Battery Charger product design and simulation. senior component design engineer Intel Massachusetts Hudson facility July 2008  –  December 2010  (2 years 6 months) Major responsibilities include but not limited to design and validate digital circuits used in Intel latest family of microprocessor. Senior Design Engineer Intel Corporation July 2008  –  November 2010  (2 years 5 months) Lead design and top level validation activity using the concept of TOC and pro-chain software. Successfully completed the design and validation and the product went in production. \nLead the product manufacturing using the six sigma distribution for the product characterization and successfully introducing the upper and lower limit for manufacturing. Senior Design Engineer Intel Corporation December 2006  –  August 2007  (9 months) Worked as a senior analog mixed signal design engineer in the integrated voltage regulator group for delivering power to microprocessor platform; Responsibilities included but not limited to design and analyze high speed, high bandwidth, high gain OTA for sensing high speed current through inductor in DC-DC buck converter in CCM and DCM mode. Key specifications were 40dB gain, 750 MHz BW, 40 dB PSRR, 35 dB CMRR, less than 5ns settling time. Senior Design Engineer Intel Corporation January 2005  –  December 2006  (2 years) Worked as a senior analog mixed signal design engineer in the high speed serial link development team for the CPU application; Worked on development of Gen II PCI-E products for CPU physical link that includes coding the interface between the IO analog circuit and the digital core controller using synthesizable verilog coding. development team Intel Corporation February 2002  –  December 2004  (2 years 11 months) Worked in the UMTS (WCDMA and GSM) baseband analog front end (AFE; Primary responsibility was to design and architect the digital interface and implementation of the interface using the RTL driven synthesis flow including coding, synthesizing, timing verification, APR and post layout timing, analysis of timing using prime time, pathmill and post layout dynamic simulation using Gate Level Simulation (GLS) with standard delay format (SDF) file from APR. mixed signal design engineer Intel Corporation June 2000  –  January 2002  (1 year 8 months) Major responsibilities included behavioral modeling and validation of the analog and mixed signal components for wireless products e.g. ADC, DAC, filters, OTA. \n \nAnalog circuit design skills \n \nOP AMP/OTA: Design of Operational transconductance amplifier (OTA) with different output stages e.g. class A, class B, class AB. OTA architectures include telescopic cascade, folded cascade, two stage high gain, single stage, rail to rail. These OTA designs are realized with efficient bias generator circuits and low power for portable and wireless applications. Power supply rejection ration (PSRR), common mode rejection ratio (CMRR), slew rate and noise specifications were considered during the design of a specific OTA. Close loop gain of the OTA is realized using the Middlebrook technique and noise performance is realized by resizing the input device sizes for the OTA. \n \n \nDAC: Design and analysis of Digital to Analog Converter (DAC) using the Matlab scripts. Using the matlab scripts proper partition is obtained to design a segmented DAC e.g. for 10 bit DAC, the partition between the unit element DAC and binary weighted DAC sections. The INL/DNL simulations are done using the matlab scripts to make sure that both INL/DNL is less than 1 LSB. Also, gain error, offset error, settling time and glitch energy are characterized using the matlab simulation to obtain the segmented DAC architecture. Analog Mixed Signal Design Engineer IBM March 2015  – Present (6 months) Fishkill, NY Analog Mixed Signal Simulation, High Speed Serial IO design, Transmitter Line driver design, Frequency synthesis using Phase lock loop, Receiver design including equalization circuits i.e. CTLE, ZFE, DFE. Receiver DFE including DFE Summer design, loop unrolling for timing closure, Rx Slicer design i.e CML latch, Dynamic latch. Analog Mixed Signal Design Engineer IBM March 2015  – Present (6 months) Fishkill, NY Analog Mixed Signal Simulation, High Speed Serial IO design, Transmitter Line driver design, Frequency synthesis using Phase lock loop, Receiver design including equalization circuits i.e. CTLE, ZFE, DFE. Receiver DFE including DFE Summer design, loop unrolling for timing closure, Rx Slicer design i.e CML latch, Dynamic latch. Senior Design Engineer DEKA Research & Development April 2014  –  March 2015  (1 year) Greater Boston Area Electrical design for in home dialysis medical device design. Senior Design Engineer DEKA Research & Development April 2014  –  March 2015  (1 year) Greater Boston Area Electrical design for in home dialysis medical device design. Staff Electrical Design Engineer BD September 2011  –  April 2014  (2 years 8 months) Greater Boston Area Continuous Glucose Monitoring medical device development for diabetes care. The detection includes CMOS image sensor using 130 nm CMOS technology and 5 layer metal and epi layer to implement inductor to implement LC PLL in the silicon. The read out path comprised to 4T pixel that uses gate enhancement and Front side illumination. The overall dynamic range of the CMOS image sensor was 60dB. Also the read out path includes 12 bit SAR ADC. \n \nIEEE802.15.4 wireless ASIC implementation in a single piece of silicon. The single chip radio includes RF Front End, Base band AFE and MAC layer logic to implement the radio protocol and product specific instructions. Staff Electrical Design Engineer BD September 2011  –  April 2014  (2 years 8 months) Greater Boston Area Continuous Glucose Monitoring medical device development for diabetes care. The detection includes CMOS image sensor using 130 nm CMOS technology and 5 layer metal and epi layer to implement inductor to implement LC PLL in the silicon. The read out path comprised to 4T pixel that uses gate enhancement and Front side illumination. The overall dynamic range of the CMOS image sensor was 60dB. Also the read out path includes 12 bit SAR ADC. \n \nIEEE802.15.4 wireless ASIC implementation in a single piece of silicon. The single chip radio includes RF Front End, Base band AFE and MAC layer logic to implement the radio protocol and product specific instructions. Analog Design Engineer Freescale June 2011  –  September 2011  (4 months) Tempe, AZ Universal Communication RF, Analog Mixed Signal Physical Layer design. The design includes modulator, demodulator, clock generation circuits design and implementation. Analog Design Engineer Freescale June 2011  –  September 2011  (4 months) Tempe, AZ Universal Communication RF, Analog Mixed Signal Physical Layer design. The design includes modulator, demodulator, clock generation circuits design and implementation. Senior Design Engineer Linear Technology Corporation January 2011  –  June 2011  (6 months) Greater Boston Area Battery Charger product design and simulation. Senior Design Engineer Linear Technology Corporation January 2011  –  June 2011  (6 months) Greater Boston Area Battery Charger product design and simulation. senior component design engineer Intel Massachusetts Hudson facility July 2008  –  December 2010  (2 years 6 months) Major responsibilities include but not limited to design and validate digital circuits used in Intel latest family of microprocessor. senior component design engineer Intel Massachusetts Hudson facility July 2008  –  December 2010  (2 years 6 months) Major responsibilities include but not limited to design and validate digital circuits used in Intel latest family of microprocessor. Senior Design Engineer Intel Corporation July 2008  –  November 2010  (2 years 5 months) Lead design and top level validation activity using the concept of TOC and pro-chain software. Successfully completed the design and validation and the product went in production. \nLead the product manufacturing using the six sigma distribution for the product characterization and successfully introducing the upper and lower limit for manufacturing. Senior Design Engineer Intel Corporation July 2008  –  November 2010  (2 years 5 months) Lead design and top level validation activity using the concept of TOC and pro-chain software. Successfully completed the design and validation and the product went in production. \nLead the product manufacturing using the six sigma distribution for the product characterization and successfully introducing the upper and lower limit for manufacturing. Senior Design Engineer Intel Corporation December 2006  –  August 2007  (9 months) Worked as a senior analog mixed signal design engineer in the integrated voltage regulator group for delivering power to microprocessor platform; Responsibilities included but not limited to design and analyze high speed, high bandwidth, high gain OTA for sensing high speed current through inductor in DC-DC buck converter in CCM and DCM mode. Key specifications were 40dB gain, 750 MHz BW, 40 dB PSRR, 35 dB CMRR, less than 5ns settling time. Senior Design Engineer Intel Corporation December 2006  –  August 2007  (9 months) Worked as a senior analog mixed signal design engineer in the integrated voltage regulator group for delivering power to microprocessor platform; Responsibilities included but not limited to design and analyze high speed, high bandwidth, high gain OTA for sensing high speed current through inductor in DC-DC buck converter in CCM and DCM mode. Key specifications were 40dB gain, 750 MHz BW, 40 dB PSRR, 35 dB CMRR, less than 5ns settling time. Senior Design Engineer Intel Corporation January 2005  –  December 2006  (2 years) Worked as a senior analog mixed signal design engineer in the high speed serial link development team for the CPU application; Worked on development of Gen II PCI-E products for CPU physical link that includes coding the interface between the IO analog circuit and the digital core controller using synthesizable verilog coding. Senior Design Engineer Intel Corporation January 2005  –  December 2006  (2 years) Worked as a senior analog mixed signal design engineer in the high speed serial link development team for the CPU application; Worked on development of Gen II PCI-E products for CPU physical link that includes coding the interface between the IO analog circuit and the digital core controller using synthesizable verilog coding. development team Intel Corporation February 2002  –  December 2004  (2 years 11 months) Worked in the UMTS (WCDMA and GSM) baseband analog front end (AFE; Primary responsibility was to design and architect the digital interface and implementation of the interface using the RTL driven synthesis flow including coding, synthesizing, timing verification, APR and post layout timing, analysis of timing using prime time, pathmill and post layout dynamic simulation using Gate Level Simulation (GLS) with standard delay format (SDF) file from APR. development team Intel Corporation February 2002  –  December 2004  (2 years 11 months) Worked in the UMTS (WCDMA and GSM) baseband analog front end (AFE; Primary responsibility was to design and architect the digital interface and implementation of the interface using the RTL driven synthesis flow including coding, synthesizing, timing verification, APR and post layout timing, analysis of timing using prime time, pathmill and post layout dynamic simulation using Gate Level Simulation (GLS) with standard delay format (SDF) file from APR. mixed signal design engineer Intel Corporation June 2000  –  January 2002  (1 year 8 months) Major responsibilities included behavioral modeling and validation of the analog and mixed signal components for wireless products e.g. ADC, DAC, filters, OTA. \n \nAnalog circuit design skills \n \nOP AMP/OTA: Design of Operational transconductance amplifier (OTA) with different output stages e.g. class A, class B, class AB. OTA architectures include telescopic cascade, folded cascade, two stage high gain, single stage, rail to rail. These OTA designs are realized with efficient bias generator circuits and low power for portable and wireless applications. Power supply rejection ration (PSRR), common mode rejection ratio (CMRR), slew rate and noise specifications were considered during the design of a specific OTA. Close loop gain of the OTA is realized using the Middlebrook technique and noise performance is realized by resizing the input device sizes for the OTA. \n \n \nDAC: Design and analysis of Digital to Analog Converter (DAC) using the Matlab scripts. Using the matlab scripts proper partition is obtained to design a segmented DAC e.g. for 10 bit DAC, the partition between the unit element DAC and binary weighted DAC sections. The INL/DNL simulations are done using the matlab scripts to make sure that both INL/DNL is less than 1 LSB. Also, gain error, offset error, settling time and glitch energy are characterized using the matlab simulation to obtain the segmented DAC architecture. mixed signal design engineer Intel Corporation June 2000  –  January 2002  (1 year 8 months) Major responsibilities included behavioral modeling and validation of the analog and mixed signal components for wireless products e.g. ADC, DAC, filters, OTA. \n \nAnalog circuit design skills \n \nOP AMP/OTA: Design of Operational transconductance amplifier (OTA) with different output stages e.g. class A, class B, class AB. OTA architectures include telescopic cascade, folded cascade, two stage high gain, single stage, rail to rail. These OTA designs are realized with efficient bias generator circuits and low power for portable and wireless applications. Power supply rejection ration (PSRR), common mode rejection ratio (CMRR), slew rate and noise specifications were considered during the design of a specific OTA. Close loop gain of the OTA is realized using the Middlebrook technique and noise performance is realized by resizing the input device sizes for the OTA. \n \n \nDAC: Design and analysis of Digital to Analog Converter (DAC) using the Matlab scripts. Using the matlab scripts proper partition is obtained to design a segmented DAC e.g. for 10 bit DAC, the partition between the unit element DAC and binary weighted DAC sections. The INL/DNL simulations are done using the matlab scripts to make sure that both INL/DNL is less than 1 LSB. Also, gain error, offset error, settling time and glitch energy are characterized using the matlab simulation to obtain the segmented DAC architecture. Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Analog Circuit Design Analog Simulations Low-power Design Mixed Signal Verilog Circuit Design Semiconductors RF ASIC IC RTL Design Processors SoC CMOS Matlab See 1+     See less Skills  Analog Circuit Design Analog Simulations Low-power Design Mixed Signal Verilog Circuit Design Semiconductors RF ASIC IC RTL Design Processors SoC CMOS Matlab See 1+     See less Analog Circuit Design Analog Simulations Low-power Design Mixed Signal Verilog Circuit Design Semiconductors RF ASIC IC RTL Design Processors SoC CMOS Matlab See 1+     See less Analog Circuit Design Analog Simulations Low-power Design Mixed Signal Verilog Circuit Design Semiconductors RF ASIC IC RTL Design Processors SoC CMOS Matlab See 1+     See less Education Arizona State University MS,  Electrical Engineering 1998  – 2000 Semiconductor Device Physics, Analog Mixed Signal Circuit design for wireless, high speed serial link, switch mode power supply application. Bangladesh University of Engineering & Technology (BUET) Bachelor of Science,  Electrical and Electronic Engineering 1997 Arizona State University MS,  Electrical Engineering 1998  – 2000 Semiconductor Device Physics, Analog Mixed Signal Circuit design for wireless, high speed serial link, switch mode power supply application. Arizona State University MS,  Electrical Engineering 1998  – 2000 Semiconductor Device Physics, Analog Mixed Signal Circuit design for wireless, high speed serial link, switch mode power supply application. Arizona State University MS,  Electrical Engineering 1998  – 2000 Semiconductor Device Physics, Analog Mixed Signal Circuit design for wireless, high speed serial link, switch mode power supply application. Bangladesh University of Engineering & Technology (BUET) Bachelor of Science,  Electrical and Electronic Engineering 1997 Bangladesh University of Engineering & Technology (BUET) Bachelor of Science,  Electrical and Electronic Engineering 1997 Bangladesh University of Engineering & Technology (BUET) Bachelor of Science,  Electrical and Electronic Engineering 1997 ", "Summary A highly dedicated and self driven engineer with over 12 years of experience in the microprocessor industry. I have spent my career working in a fast pace, high energy environment, designing the latest generation of microprocessors. I'm driven by new and complex problems. \n \nOver the years I have been involved in various aspect of chip design, including: transistor level circuit design, timing analysis, power optimization, logic verification, and post silicon debug. I thrive in a group environment and throughout various projects I have extensively worked with teams across multiple disciplines, sites, and countries (US, India, and Israel). I have successfully collaborated with teams for Layout, logic, RTL, Section Routing, Noise, tool developers, and various post silicon groups. \n \nI am passionate about learning and education; as Vice-President of the Intel Latino Network I was actively involved in promoting growth in our community. I was a Lead Judge for UC East Bay MESA Competition, and participated in various programs to encourage underrepresented groups to go into Engineering and Science fields. Summary A highly dedicated and self driven engineer with over 12 years of experience in the microprocessor industry. I have spent my career working in a fast pace, high energy environment, designing the latest generation of microprocessors. I'm driven by new and complex problems. \n \nOver the years I have been involved in various aspect of chip design, including: transistor level circuit design, timing analysis, power optimization, logic verification, and post silicon debug. I thrive in a group environment and throughout various projects I have extensively worked with teams across multiple disciplines, sites, and countries (US, India, and Israel). I have successfully collaborated with teams for Layout, logic, RTL, Section Routing, Noise, tool developers, and various post silicon groups. \n \nI am passionate about learning and education; as Vice-President of the Intel Latino Network I was actively involved in promoting growth in our community. I was a Lead Judge for UC East Bay MESA Competition, and participated in various programs to encourage underrepresented groups to go into Engineering and Science fields. A highly dedicated and self driven engineer with over 12 years of experience in the microprocessor industry. I have spent my career working in a fast pace, high energy environment, designing the latest generation of microprocessors. I'm driven by new and complex problems. \n \nOver the years I have been involved in various aspect of chip design, including: transistor level circuit design, timing analysis, power optimization, logic verification, and post silicon debug. I thrive in a group environment and throughout various projects I have extensively worked with teams across multiple disciplines, sites, and countries (US, India, and Israel). I have successfully collaborated with teams for Layout, logic, RTL, Section Routing, Noise, tool developers, and various post silicon groups. \n \nI am passionate about learning and education; as Vice-President of the Intel Latino Network I was actively involved in promoting growth in our community. I was a Lead Judge for UC East Bay MESA Competition, and participated in various programs to encourage underrepresented groups to go into Engineering and Science fields. A highly dedicated and self driven engineer with over 12 years of experience in the microprocessor industry. I have spent my career working in a fast pace, high energy environment, designing the latest generation of microprocessors. I'm driven by new and complex problems. \n \nOver the years I have been involved in various aspect of chip design, including: transistor level circuit design, timing analysis, power optimization, logic verification, and post silicon debug. I thrive in a group environment and throughout various projects I have extensively worked with teams across multiple disciplines, sites, and countries (US, India, and Israel). I have successfully collaborated with teams for Layout, logic, RTL, Section Routing, Noise, tool developers, and various post silicon groups. \n \nI am passionate about learning and education; as Vice-President of the Intel Latino Network I was actively involved in promoting growth in our community. I was a Lead Judge for UC East Bay MESA Competition, and participated in various programs to encourage underrepresented groups to go into Engineering and Science fields. Experience Staff Design Engineer Xilinx 2014  – Present (1 year) FPGA design. Senior Design Engineer Intel Corporation 2011  –  2013  (2 years) San Francisco Bay Area Server Design Team 2011 - 2013 \n•\tNext generation multi-core Processor: Defined buses interface to be used across the un-core RFs. \n•\tWorked directly with mask designers to plan RF routing and optimize critical timing paths. \n•\tPerformed timing and power analysis on custom circuits, and implemented DFT features. \n•\tReduced five weeks of execution effort with a new implementation of the Error Detection/Correction logic for the ring-stop. Ensured efficient collaboration across timing, RTL, and section routing teams. \n•\tMigrated previous design to latest technology and RTL specs, and optimized for new requirements. \n \nTraining, Tool Development, and Support: \n•\tDelivered technical training for over 30 Engineers. \n•\tCollaborated with Israel Design Center to implement and test new tool features. \n•\tMentored junior designers and trained them on tools and design specifications. \n \nMethodology Task Force: \n•\tLed a task force of six engineers to pilot a new set of design tools for project wide release. \n•\tDeveloped the complete methodology for the mode of work between Circuit Designers and Layout Designers, adopted for all un-core High Speed data path designs. \n•\tPrimary Point-of-Contact for engineers migrating to the new tool environment. Senior Design Engineer Intel Corporation 2007  –  2011  (4 years) San Francisco Bay Area Xeon Server Team 2007 - 2011 \n•\t32nm 8-core Sandy Bridge Processor. Performed technology readiness studies to facilitate execution. \n•\tDesign Award received for innovating a merged RF and 64 bit parity block design. Significantly reduced design overhead. Achieved substantial improvement in power and timing by reducing 768 latches, one pipe-line stage of latency, and over 100 um of routing on 256 signals.  \n•\tResponsible for design, timing, logic verification, iScan/ScanOut insertion, and layout floor plan.  \n \nRegister File (RF) Design Lead:  \n•\tPerformed timing simulation at transistor level, and device changes to meet design quality. \n•\tEstablished RF methodology and conducted design reviews for 5 engineers to ensure all RF’s met project guidelines. Improved design robustness and decreased silicon failure escapes. \n•\tCollaborated across geographies with the Bangalore team to reduce layout completion time by 40%.  \n \nFocused Ion Beam (FIB) Lead: \n•\tScheduled FIB assignments and resources for all tasks; worked directly with designers and RTL owners to define the FIB implementation for all logic and timing changes. \n•\tProvided faster way to verify design changes on silicon while reducing design iterations. \n \nComponent Post-Silicon Debug: \n•\tSupported first-silicon power-up. Wrote configuration files for reading TAP registers (serial/parallel).  \n•\tEnabled optical probing tools (IREM, OTRE, and LADA) for speed path detection and functional verification. Conducted latency analysis on all clock signals throughout the chip. Senior Design Engineer Intel Corporation 2005  –  2007  (2 years) San Francisco Bay Area Penryn Design Team \n•\t45nm Core 2 Duo/Quad: Converted differential Domino to single-end Domino, and a 16:1 multiplexer (MUX) to a static logic design, eliminating noise and improving silicon reliability.  \n•\tResponsible for one of the most timing critical fubs in the Execution cluster. \n•\tImplemented a new Design for Testability (DFT) logic for dual end set/reset register circuit.  \n \nL1D Timing Owner: \n•\tSuccessfully isolated and resolved failing paths between synthesized and data-path blocks. \n•\tCollaborated with the layout team for data integration. Provided requirements to other designers and delivered a complete timing model which met all strict hold/setup requirements. \n•\tGenerated timing overrides for Resistance/Capacitance (RC) networks and interconnects, and identified timing improvements through layout changes. \n \nUnit Power Owner: \n•\tDefined the analysis for all power features, low-leakage device insertion, and size optimization. \n•\tReduced 50% of active power for the RF’s by implementing a new bank-enable feature.  \n•\tConverted RF arrays from Dual to Single Rail Domino with 35% area improvement. Reduced signal noise, sub-threshold leakage and active power. Component Design Engineer Intel Corporation 2001  –  2005  (4 years) San Francisco Bay Area Yonah Design Team (2003-2005) \n•\t65 nm Core Duo: Delivered a Memory Interface Unit (MIU) Noise clean on all domino logic. \n•\tPerformed extensive transistor level timing simulations and area optimization on memory arrays.  \n•\tWorked directly with Mask Designers to optimize the layout and reduced silicon failures. \n \n \nLow Power Design Technology Group\t(2001 - 2003) \n•\tOptimized circuits for low power applications while maintaining speed and area requirements.  \n•\tDesigned Complementary Pass-transistor Logic and mirror Conditional Sum Addition (CSA) logic for a low power multiplier with delay and power improvements of 26% and 40% respectively. Staff Design Engineer Xilinx 2014  – Present (1 year) FPGA design. Staff Design Engineer Xilinx 2014  – Present (1 year) FPGA design. Senior Design Engineer Intel Corporation 2011  –  2013  (2 years) San Francisco Bay Area Server Design Team 2011 - 2013 \n•\tNext generation multi-core Processor: Defined buses interface to be used across the un-core RFs. \n•\tWorked directly with mask designers to plan RF routing and optimize critical timing paths. \n•\tPerformed timing and power analysis on custom circuits, and implemented DFT features. \n•\tReduced five weeks of execution effort with a new implementation of the Error Detection/Correction logic for the ring-stop. Ensured efficient collaboration across timing, RTL, and section routing teams. \n•\tMigrated previous design to latest technology and RTL specs, and optimized for new requirements. \n \nTraining, Tool Development, and Support: \n•\tDelivered technical training for over 30 Engineers. \n•\tCollaborated with Israel Design Center to implement and test new tool features. \n•\tMentored junior designers and trained them on tools and design specifications. \n \nMethodology Task Force: \n•\tLed a task force of six engineers to pilot a new set of design tools for project wide release. \n•\tDeveloped the complete methodology for the mode of work between Circuit Designers and Layout Designers, adopted for all un-core High Speed data path designs. \n•\tPrimary Point-of-Contact for engineers migrating to the new tool environment. Senior Design Engineer Intel Corporation 2011  –  2013  (2 years) San Francisco Bay Area Server Design Team 2011 - 2013 \n•\tNext generation multi-core Processor: Defined buses interface to be used across the un-core RFs. \n•\tWorked directly with mask designers to plan RF routing and optimize critical timing paths. \n•\tPerformed timing and power analysis on custom circuits, and implemented DFT features. \n•\tReduced five weeks of execution effort with a new implementation of the Error Detection/Correction logic for the ring-stop. Ensured efficient collaboration across timing, RTL, and section routing teams. \n•\tMigrated previous design to latest technology and RTL specs, and optimized for new requirements. \n \nTraining, Tool Development, and Support: \n•\tDelivered technical training for over 30 Engineers. \n•\tCollaborated with Israel Design Center to implement and test new tool features. \n•\tMentored junior designers and trained them on tools and design specifications. \n \nMethodology Task Force: \n•\tLed a task force of six engineers to pilot a new set of design tools for project wide release. \n•\tDeveloped the complete methodology for the mode of work between Circuit Designers and Layout Designers, adopted for all un-core High Speed data path designs. \n•\tPrimary Point-of-Contact for engineers migrating to the new tool environment. Senior Design Engineer Intel Corporation 2007  –  2011  (4 years) San Francisco Bay Area Xeon Server Team 2007 - 2011 \n•\t32nm 8-core Sandy Bridge Processor. Performed technology readiness studies to facilitate execution. \n•\tDesign Award received for innovating a merged RF and 64 bit parity block design. Significantly reduced design overhead. Achieved substantial improvement in power and timing by reducing 768 latches, one pipe-line stage of latency, and over 100 um of routing on 256 signals.  \n•\tResponsible for design, timing, logic verification, iScan/ScanOut insertion, and layout floor plan.  \n \nRegister File (RF) Design Lead:  \n•\tPerformed timing simulation at transistor level, and device changes to meet design quality. \n•\tEstablished RF methodology and conducted design reviews for 5 engineers to ensure all RF’s met project guidelines. Improved design robustness and decreased silicon failure escapes. \n•\tCollaborated across geographies with the Bangalore team to reduce layout completion time by 40%.  \n \nFocused Ion Beam (FIB) Lead: \n•\tScheduled FIB assignments and resources for all tasks; worked directly with designers and RTL owners to define the FIB implementation for all logic and timing changes. \n•\tProvided faster way to verify design changes on silicon while reducing design iterations. \n \nComponent Post-Silicon Debug: \n•\tSupported first-silicon power-up. Wrote configuration files for reading TAP registers (serial/parallel).  \n•\tEnabled optical probing tools (IREM, OTRE, and LADA) for speed path detection and functional verification. Conducted latency analysis on all clock signals throughout the chip. Senior Design Engineer Intel Corporation 2007  –  2011  (4 years) San Francisco Bay Area Xeon Server Team 2007 - 2011 \n•\t32nm 8-core Sandy Bridge Processor. Performed technology readiness studies to facilitate execution. \n•\tDesign Award received for innovating a merged RF and 64 bit parity block design. Significantly reduced design overhead. Achieved substantial improvement in power and timing by reducing 768 latches, one pipe-line stage of latency, and over 100 um of routing on 256 signals.  \n•\tResponsible for design, timing, logic verification, iScan/ScanOut insertion, and layout floor plan.  \n \nRegister File (RF) Design Lead:  \n•\tPerformed timing simulation at transistor level, and device changes to meet design quality. \n•\tEstablished RF methodology and conducted design reviews for 5 engineers to ensure all RF’s met project guidelines. Improved design robustness and decreased silicon failure escapes. \n•\tCollaborated across geographies with the Bangalore team to reduce layout completion time by 40%.  \n \nFocused Ion Beam (FIB) Lead: \n•\tScheduled FIB assignments and resources for all tasks; worked directly with designers and RTL owners to define the FIB implementation for all logic and timing changes. \n•\tProvided faster way to verify design changes on silicon while reducing design iterations. \n \nComponent Post-Silicon Debug: \n•\tSupported first-silicon power-up. Wrote configuration files for reading TAP registers (serial/parallel).  \n•\tEnabled optical probing tools (IREM, OTRE, and LADA) for speed path detection and functional verification. Conducted latency analysis on all clock signals throughout the chip. Senior Design Engineer Intel Corporation 2005  –  2007  (2 years) San Francisco Bay Area Penryn Design Team \n•\t45nm Core 2 Duo/Quad: Converted differential Domino to single-end Domino, and a 16:1 multiplexer (MUX) to a static logic design, eliminating noise and improving silicon reliability.  \n•\tResponsible for one of the most timing critical fubs in the Execution cluster. \n•\tImplemented a new Design for Testability (DFT) logic for dual end set/reset register circuit.  \n \nL1D Timing Owner: \n•\tSuccessfully isolated and resolved failing paths between synthesized and data-path blocks. \n•\tCollaborated with the layout team for data integration. Provided requirements to other designers and delivered a complete timing model which met all strict hold/setup requirements. \n•\tGenerated timing overrides for Resistance/Capacitance (RC) networks and interconnects, and identified timing improvements through layout changes. \n \nUnit Power Owner: \n•\tDefined the analysis for all power features, low-leakage device insertion, and size optimization. \n•\tReduced 50% of active power for the RF’s by implementing a new bank-enable feature.  \n•\tConverted RF arrays from Dual to Single Rail Domino with 35% area improvement. Reduced signal noise, sub-threshold leakage and active power. Senior Design Engineer Intel Corporation 2005  –  2007  (2 years) San Francisco Bay Area Penryn Design Team \n•\t45nm Core 2 Duo/Quad: Converted differential Domino to single-end Domino, and a 16:1 multiplexer (MUX) to a static logic design, eliminating noise and improving silicon reliability.  \n•\tResponsible for one of the most timing critical fubs in the Execution cluster. \n•\tImplemented a new Design for Testability (DFT) logic for dual end set/reset register circuit.  \n \nL1D Timing Owner: \n•\tSuccessfully isolated and resolved failing paths between synthesized and data-path blocks. \n•\tCollaborated with the layout team for data integration. Provided requirements to other designers and delivered a complete timing model which met all strict hold/setup requirements. \n•\tGenerated timing overrides for Resistance/Capacitance (RC) networks and interconnects, and identified timing improvements through layout changes. \n \nUnit Power Owner: \n•\tDefined the analysis for all power features, low-leakage device insertion, and size optimization. \n•\tReduced 50% of active power for the RF’s by implementing a new bank-enable feature.  \n•\tConverted RF arrays from Dual to Single Rail Domino with 35% area improvement. Reduced signal noise, sub-threshold leakage and active power. Component Design Engineer Intel Corporation 2001  –  2005  (4 years) San Francisco Bay Area Yonah Design Team (2003-2005) \n•\t65 nm Core Duo: Delivered a Memory Interface Unit (MIU) Noise clean on all domino logic. \n•\tPerformed extensive transistor level timing simulations and area optimization on memory arrays.  \n•\tWorked directly with Mask Designers to optimize the layout and reduced silicon failures. \n \n \nLow Power Design Technology Group\t(2001 - 2003) \n•\tOptimized circuits for low power applications while maintaining speed and area requirements.  \n•\tDesigned Complementary Pass-transistor Logic and mirror Conditional Sum Addition (CSA) logic for a low power multiplier with delay and power improvements of 26% and 40% respectively. Component Design Engineer Intel Corporation 2001  –  2005  (4 years) San Francisco Bay Area Yonah Design Team (2003-2005) \n•\t65 nm Core Duo: Delivered a Memory Interface Unit (MIU) Noise clean on all domino logic. \n•\tPerformed extensive transistor level timing simulations and area optimization on memory arrays.  \n•\tWorked directly with Mask Designers to optimize the layout and reduced silicon failures. \n \n \nLow Power Design Technology Group\t(2001 - 2003) \n•\tOptimized circuits for low power applications while maintaining speed and area requirements.  \n•\tDesigned Complementary Pass-transistor Logic and mirror Conditional Sum Addition (CSA) logic for a low power multiplier with delay and power improvements of 26% and 40% respectively. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Static Timing Analysis Circuit Design DFT Physical Design Simulations Logic Design VLSI Processors Integrated Circuit... High Speed Digital ASIC Low-power Design Register Files Timing and Power... Domino Logic Schematic Capture IC Functional Verification SoC RTL design Design for Testability Silicon Microprocessors Domino and Static logic Signal Noise Integrity Physical Layout... Post-Silicon Debug Circuit Layout Debugging Cadence Virtuoso RTL Design See 16+     See less Skills  Static Timing Analysis Circuit Design DFT Physical Design Simulations Logic Design VLSI Processors Integrated Circuit... High Speed Digital ASIC Low-power Design Register Files Timing and Power... Domino Logic Schematic Capture IC Functional Verification SoC RTL design Design for Testability Silicon Microprocessors Domino and Static logic Signal Noise Integrity Physical Layout... Post-Silicon Debug Circuit Layout Debugging Cadence Virtuoso RTL Design See 16+     See less Static Timing Analysis Circuit Design DFT Physical Design Simulations Logic Design VLSI Processors Integrated Circuit... High Speed Digital ASIC Low-power Design Register Files Timing and Power... Domino Logic Schematic Capture IC Functional Verification SoC RTL design Design for Testability Silicon Microprocessors Domino and Static logic Signal Noise Integrity Physical Layout... Post-Silicon Debug Circuit Layout Debugging Cadence Virtuoso RTL Design See 16+     See less Static Timing Analysis Circuit Design DFT Physical Design Simulations Logic Design VLSI Processors Integrated Circuit... High Speed Digital ASIC Low-power Design Register Files Timing and Power... Domino Logic Schematic Capture IC Functional Verification SoC RTL design Design for Testability Silicon Microprocessors Domino and Static logic Signal Noise Integrity Physical Layout... Post-Silicon Debug Circuit Layout Debugging Cadence Virtuoso RTL Design See 16+     See less Education North Carolina State University MSEE,  Electrical Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society North Carolina State University MSEE,  Computer Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society University of Rochester BSEE,  Electrical Engineering/ Mathematics. 1995  – 1999 North Carolina State University MSEE,  Electrical Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society North Carolina State University MSEE,  Electrical Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society North Carolina State University MSEE,  Electrical Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society North Carolina State University MSEE,  Computer Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society North Carolina State University MSEE,  Computer Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society North Carolina State University MSEE,  Computer Engineering 1999  – 2000 Activities and Societies:  Tau Beta Pi Engineering Honor Society University of Rochester BSEE,  Electrical Engineering/ Mathematics. 1995  – 1999 University of Rochester BSEE,  Electrical Engineering/ Mathematics. 1995  – 1999 University of Rochester BSEE,  Electrical Engineering/ Mathematics. 1995  – 1999 ", "Skills Verilog ASIC VLSI Perl C SoC C++ Static Timing Analysis Manufacturing Physical Design Testing Unix Skills  Verilog ASIC VLSI Perl C SoC C++ Static Timing Analysis Manufacturing Physical Design Testing Unix Verilog ASIC VLSI Perl C SoC C++ Static Timing Analysis Manufacturing Physical Design Testing Unix Verilog ASIC VLSI Perl C SoC C++ Static Timing Analysis Manufacturing Physical Design Testing Unix ", "Summary Specialties:Pre-silicon validation of CPU Power Management Microarchitecture Summary Specialties:Pre-silicon validation of CPU Power Management Microarchitecture Specialties:Pre-silicon validation of CPU Power Management Microarchitecture Specialties:Pre-silicon validation of CPU Power Management Microarchitecture Experience Senior Design Engineer Intel Corporation November 2004  – Present (10 years 10 months) I work in the CPU Development team on the Power Management Microarchitecture validation of next generation Microprocessors. Senior Software Engineer IBM Global Services March 2000  –  December 2001  (1 year 10 months) Design Engineer Larsen & Toubro Medical R&D August 1996  –  March 2000  (3 years 8 months) Biomedical Engineer CDR Medical Systems October 1993  –  June 1996  (2 years 9 months) Senior Design Engineer Intel Corporation November 2004  – Present (10 years 10 months) I work in the CPU Development team on the Power Management Microarchitecture validation of next generation Microprocessors. Senior Design Engineer Intel Corporation November 2004  – Present (10 years 10 months) I work in the CPU Development team on the Power Management Microarchitecture validation of next generation Microprocessors. Senior Software Engineer IBM Global Services March 2000  –  December 2001  (1 year 10 months) Senior Software Engineer IBM Global Services March 2000  –  December 2001  (1 year 10 months) Design Engineer Larsen & Toubro Medical R&D August 1996  –  March 2000  (3 years 8 months) Design Engineer Larsen & Toubro Medical R&D August 1996  –  March 2000  (3 years 8 months) Biomedical Engineer CDR Medical Systems October 1993  –  June 1996  (2 years 9 months) Biomedical Engineer CDR Medical Systems October 1993  –  June 1996  (2 years 9 months) Skills Processors Verilog Microarchitecture Microprocessors Power Management Debugging Skills  Processors Verilog Microarchitecture Microprocessors Power Management Debugging Processors Verilog Microarchitecture Microprocessors Power Management Debugging Processors Verilog Microarchitecture Microprocessors Power Management Debugging Education Portland State University MS,  Electrical & Computer Engineering 2002  – 2004 Cochin University of Science and Technology B.Tech,  Biomedical Engineering 1989  – 1993 Portland State University MS,  Electrical & Computer Engineering 2002  – 2004 Portland State University MS,  Electrical & Computer Engineering 2002  – 2004 Portland State University MS,  Electrical & Computer Engineering 2002  – 2004 Cochin University of Science and Technology B.Tech,  Biomedical Engineering 1989  – 1993 Cochin University of Science and Technology B.Tech,  Biomedical Engineering 1989  – 1993 Cochin University of Science and Technology B.Tech,  Biomedical Engineering 1989  – 1993 ", "Summary Experienced VLSI design engineer with experience in  \na. Frontend design and RTL coding in Verilog \nb. Circuit/Layout design and backend design convergence Summary Experienced VLSI design engineer with experience in  \na. Frontend design and RTL coding in Verilog \nb. Circuit/Layout design and backend design convergence Experienced VLSI design engineer with experience in  \na. Frontend design and RTL coding in Verilog \nb. Circuit/Layout design and backend design convergence Experienced VLSI design engineer with experience in  \na. Frontend design and RTL coding in Verilog \nb. Circuit/Layout design and backend design convergence Experience Senior Design Engineer Intel Corporation April 2011  – Present (4 years 5 months) San Francisco Bay Area Design Engineer Intel Corporation November 2008  –  March 2011  (2 years 5 months) Hillsboro, Oregon Graduate Teaching Assistant Arizona State University August 2007  –  October 2008  (1 year 3 months) Tempe, Arizona Software Engineer Tesco HSC July 2005  –  June 2006  (1 year) Bengaluru Area, India Senior Design Engineer Intel Corporation April 2011  – Present (4 years 5 months) San Francisco Bay Area Senior Design Engineer Intel Corporation April 2011  – Present (4 years 5 months) San Francisco Bay Area Design Engineer Intel Corporation November 2008  –  March 2011  (2 years 5 months) Hillsboro, Oregon Design Engineer Intel Corporation November 2008  –  March 2011  (2 years 5 months) Hillsboro, Oregon Graduate Teaching Assistant Arizona State University August 2007  –  October 2008  (1 year 3 months) Tempe, Arizona Graduate Teaching Assistant Arizona State University August 2007  –  October 2008  (1 year 3 months) Tempe, Arizona Software Engineer Tesco HSC July 2005  –  June 2006  (1 year) Bengaluru Area, India Software Engineer Tesco HSC July 2005  –  June 2006  (1 year) Bengaluru Area, India Languages English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Verilog ASIC Debugging Circuit Design Microprocessors VLSI RF Cadence Virtuoso SystemVerilog Computer Architecture CMOS computer ar Skills  Verilog ASIC Debugging Circuit Design Microprocessors VLSI RF Cadence Virtuoso SystemVerilog Computer Architecture CMOS computer ar Verilog ASIC Debugging Circuit Design Microprocessors VLSI RF Cadence Virtuoso SystemVerilog Computer Architecture CMOS computer ar Verilog ASIC Debugging Circuit Design Microprocessors VLSI RF Cadence Virtuoso SystemVerilog Computer Architecture CMOS computer ar Education Arizona State University Master's degree,  Electrical Engineering 2006  – 2008 Master's in Electrical Engineering with focus on digital system circuit design R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Instrumentation Technology 2001  – 2005 Arizona State University Master's degree,  Electrical Engineering 2006  – 2008 Master's in Electrical Engineering with focus on digital system circuit design Arizona State University Master's degree,  Electrical Engineering 2006  – 2008 Master's in Electrical Engineering with focus on digital system circuit design Arizona State University Master's degree,  Electrical Engineering 2006  – 2008 Master's in Electrical Engineering with focus on digital system circuit design R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Instrumentation Technology 2001  – 2005 R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Instrumentation Technology 2001  – 2005 R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Instrumentation Technology 2001  – 2005 Honors & Awards ", "Skills ASIC Semiconductors Embedded Systems PCIe Verilog FPGA Skills  ASIC Semiconductors Embedded Systems PCIe Verilog FPGA ASIC Semiconductors Embedded Systems PCIe Verilog FPGA ASIC Semiconductors Embedded Systems PCIe Verilog FPGA ", "Skills RTL design Static Timing Analysis Timing Closure SystemVerilog Verilog Logic Design RTL coding Circuit Design Silicon Debug DFT Primetime VLSI Microarchitecture PCIe Power Analysis CMOS Low Power Design Microprocessors Silicon Debugging RTL Design See 6+     See less Skills  RTL design Static Timing Analysis Timing Closure SystemVerilog Verilog Logic Design RTL coding Circuit Design Silicon Debug DFT Primetime VLSI Microarchitecture PCIe Power Analysis CMOS Low Power Design Microprocessors Silicon Debugging RTL Design See 6+     See less RTL design Static Timing Analysis Timing Closure SystemVerilog Verilog Logic Design RTL coding Circuit Design Silicon Debug DFT Primetime VLSI Microarchitecture PCIe Power Analysis CMOS Low Power Design Microprocessors Silicon Debugging RTL Design See 6+     See less RTL design Static Timing Analysis Timing Closure SystemVerilog Verilog Logic Design RTL coding Circuit Design Silicon Debug DFT Primetime VLSI Microarchitecture PCIe Power Analysis CMOS Low Power Design Microprocessors Silicon Debugging RTL Design See 6+     See less ", "Skills SoC ASIC VLSI Microprocessors SharePoint Designer Tcl-Tk Perl Collaborative Problem... Integrated Circuit... Static Timing Analysis IC Processors RTL design Skills  SoC ASIC VLSI Microprocessors SharePoint Designer Tcl-Tk Perl Collaborative Problem... Integrated Circuit... Static Timing Analysis IC Processors RTL design SoC ASIC VLSI Microprocessors SharePoint Designer Tcl-Tk Perl Collaborative Problem... Integrated Circuit... Static Timing Analysis IC Processors RTL design SoC ASIC VLSI Microprocessors SharePoint Designer Tcl-Tk Perl Collaborative Problem... Integrated Circuit... Static Timing Analysis IC Processors RTL design Honors & Awards ", "Skills SoC RTL design Testing Skills  SoC RTL design Testing SoC RTL design Testing SoC RTL design Testing ", "Skills Debugging Hardware Architecture ASIC Firmware Verilog Embedded Linux Embedded Systems Embedded Software FPGA SoC Semiconductors Analog Computer Architecture PCB design PCIe Circuit Design Microprocessors Processors IC Analog Circuit Design Intel Signal Integrity PCB Design See 8+     See less Skills  Debugging Hardware Architecture ASIC Firmware Verilog Embedded Linux Embedded Systems Embedded Software FPGA SoC Semiconductors Analog Computer Architecture PCB design PCIe Circuit Design Microprocessors Processors IC Analog Circuit Design Intel Signal Integrity PCB Design See 8+     See less Debugging Hardware Architecture ASIC Firmware Verilog Embedded Linux Embedded Systems Embedded Software FPGA SoC Semiconductors Analog Computer Architecture PCB design PCIe Circuit Design Microprocessors Processors IC Analog Circuit Design Intel Signal Integrity PCB Design See 8+     See less Debugging Hardware Architecture ASIC Firmware Verilog Embedded Linux Embedded Systems Embedded Software FPGA SoC Semiconductors Analog Computer Architecture PCB design PCIe Circuit Design Microprocessors Processors IC Analog Circuit Design Intel Signal Integrity PCB Design See 8+     See less ", "Skills ASIC Verilog VLSI Firmware TCL Perl Electronics Integrated Circuit... Device Drivers Engineering Management Embedded Software Semiconductor Industry Intel C Digital Signal... Semiconductors Debugging IC CMOS Embedded Systems SoC Hardware Architecture See 7+     See less Skills  ASIC Verilog VLSI Firmware TCL Perl Electronics Integrated Circuit... Device Drivers Engineering Management Embedded Software Semiconductor Industry Intel C Digital Signal... Semiconductors Debugging IC CMOS Embedded Systems SoC Hardware Architecture See 7+     See less ASIC Verilog VLSI Firmware TCL Perl Electronics Integrated Circuit... Device Drivers Engineering Management Embedded Software Semiconductor Industry Intel C Digital Signal... Semiconductors Debugging IC CMOS Embedded Systems SoC Hardware Architecture See 7+     See less ASIC Verilog VLSI Firmware TCL Perl Electronics Integrated Circuit... Device Drivers Engineering Management Embedded Software Semiconductor Industry Intel C Digital Signal... Semiconductors Debugging IC CMOS Embedded Systems SoC Hardware Architecture See 7+     See less ", "Experience Senior Design Engineer Intel Corporation January 1999  – Present (16 years 8 months) Senior Design Engineer Intel Corporation January 1999  – Present (16 years 8 months) Senior Design Engineer Intel Corporation January 1999  – Present (16 years 8 months) Skills ASIC Verilog SoC CMOS RTL design Semiconductors VLSI Debugging IC RTL Design Skills  ASIC Verilog SoC CMOS RTL design Semiconductors VLSI Debugging IC RTL Design ASIC Verilog SoC CMOS RTL design Semiconductors VLSI Debugging IC RTL Design ASIC Verilog SoC CMOS RTL design Semiconductors VLSI Debugging IC RTL Design Education University of California, Berkeley 1996  – 2000 University of California, Berkeley 1996  – 2000 University of California, Berkeley 1996  – 2000 University of California, Berkeley 1996  – 2000 ", "Skills Mixed Signal SoC FPGA Semiconductors Debugging C Electronics ModelSim Microcontrollers Perl Embedded Systems EDA Analog Circuit Design C++ ASIC Verilog Computer Architecture Circuit Design JTAG VHDL Analog Hardware Architecture Simulations PCB design Intel PCIe SystemVerilog Functional Verification Firmware See 14+     See less Skills  Mixed Signal SoC FPGA Semiconductors Debugging C Electronics ModelSim Microcontrollers Perl Embedded Systems EDA Analog Circuit Design C++ ASIC Verilog Computer Architecture Circuit Design JTAG VHDL Analog Hardware Architecture Simulations PCB design Intel PCIe SystemVerilog Functional Verification Firmware See 14+     See less Mixed Signal SoC FPGA Semiconductors Debugging C Electronics ModelSim Microcontrollers Perl Embedded Systems EDA Analog Circuit Design C++ ASIC Verilog Computer Architecture Circuit Design JTAG VHDL Analog Hardware Architecture Simulations PCB design Intel PCIe SystemVerilog Functional Verification Firmware See 14+     See less Mixed Signal SoC FPGA Semiconductors Debugging C Electronics ModelSim Microcontrollers Perl Embedded Systems EDA Analog Circuit Design C++ ASIC Verilog Computer Architecture Circuit Design JTAG VHDL Analog Hardware Architecture Simulations PCB design Intel PCIe SystemVerilog Functional Verification Firmware See 14+     See less "]}