{"position": "Senior Systems Programmer", "company": "Intel Corporation", "profiles": ["Experience Senior Systems Programmer Intel Corporation August 2000  – Present (15 years 1 month) Senior Systems Programmer Intel Corporation August 2000  – Present (15 years 1 month) Senior Systems Programmer Intel Corporation August 2000  – Present (15 years 1 month) ", "Experience Telephone and Network (Combination) Technician Arctic Slope Telephone Association Cooperative February 2012  – Present (3 years 7 months) Barrow, Alaska Construction, maintenance, operation and servicing of telephone lines, internet equipment and wireless services. Install and troubleshoot circuits. Senior Systems Programmer / Logistics Planner Barrow Arctic Science Consortium January 2007  –  February 2012  (5 years 2 months) Conference Planning Committee Alaska Surveying & Mapping Conference 2009  –  2010  (1 year) Senior Systems Programmer Intel Corporation 2001  –  2007  (6 years) Call Consultant and Systems Programmer Intel Corporation June 1996  –  2001  (5 years) Telephone and Network (Combination) Technician Arctic Slope Telephone Association Cooperative February 2012  – Present (3 years 7 months) Barrow, Alaska Construction, maintenance, operation and servicing of telephone lines, internet equipment and wireless services. Install and troubleshoot circuits. Telephone and Network (Combination) Technician Arctic Slope Telephone Association Cooperative February 2012  – Present (3 years 7 months) Barrow, Alaska Construction, maintenance, operation and servicing of telephone lines, internet equipment and wireless services. Install and troubleshoot circuits. Senior Systems Programmer / Logistics Planner Barrow Arctic Science Consortium January 2007  –  February 2012  (5 years 2 months) Senior Systems Programmer / Logistics Planner Barrow Arctic Science Consortium January 2007  –  February 2012  (5 years 2 months) Conference Planning Committee Alaska Surveying & Mapping Conference 2009  –  2010  (1 year) Conference Planning Committee Alaska Surveying & Mapping Conference 2009  –  2010  (1 year) Senior Systems Programmer Intel Corporation 2001  –  2007  (6 years) Senior Systems Programmer Intel Corporation 2001  –  2007  (6 years) Call Consultant and Systems Programmer Intel Corporation June 1996  –  2001  (5 years) Call Consultant and Systems Programmer Intel Corporation June 1996  –  2001  (5 years) Skills Security Operating Systems Active Directory Integration Troubleshooting Wireless Leadership Cross-functional Team... Perl Project Management DNS Microsoft Exchange Networking Cloud Computing Skills  Security Operating Systems Active Directory Integration Troubleshooting Wireless Leadership Cross-functional Team... Perl Project Management DNS Microsoft Exchange Networking Cloud Computing Security Operating Systems Active Directory Integration Troubleshooting Wireless Leadership Cross-functional Team... Perl Project Management DNS Microsoft Exchange Networking Cloud Computing Security Operating Systems Active Directory Integration Troubleshooting Wireless Leadership Cross-functional Team... Perl Project Management DNS Microsoft Exchange Networking Cloud Computing Education University of California, Davis Bachelor of Science,  Resource Sciences 1991  – 1995 Activities and Societies:  Alpha Phi Omega University of California, Davis Bachelor of Science,  Resource Sciences 1991  – 1995 Activities and Societies:  Alpha Phi Omega University of California, Davis Bachelor of Science,  Resource Sciences 1991  – 1995 Activities and Societies:  Alpha Phi Omega University of California, Davis Bachelor of Science,  Resource Sciences 1991  – 1995 Activities and Societies:  Alpha Phi Omega ", "Summary Solutions-oriented Windows Server System Engineer with notable success managing servers and services in a complex, heterogeneous and geographically dispersed computing environment. Strong administrative scripting skills, both in development and training. Reputation as a dedicated team player with a strong work ethic and a willingness to assist others when an extra hand is needed. Interested in administrative scripting and automation projects, training and tools. Specialties:• Windows Server 2003 and Server 2008 system engineering and administration, including terminal services and clustering \n• Microsoft application server platform administration, mainly IIS 5.0/6.0, SQL Server 2000/2005/2008 \n• Proficient administrative scripter in VBScript, PowerShell, and WMI; familiar with ADSI, Perl, .NET, and T-SQL \n• Superb troubleshooting and problem solving skills \n• Excellent verbal and written communication skills \n• Strong customer service and support skills Summary Solutions-oriented Windows Server System Engineer with notable success managing servers and services in a complex, heterogeneous and geographically dispersed computing environment. Strong administrative scripting skills, both in development and training. Reputation as a dedicated team player with a strong work ethic and a willingness to assist others when an extra hand is needed. Interested in administrative scripting and automation projects, training and tools. Specialties:• Windows Server 2003 and Server 2008 system engineering and administration, including terminal services and clustering \n• Microsoft application server platform administration, mainly IIS 5.0/6.0, SQL Server 2000/2005/2008 \n• Proficient administrative scripter in VBScript, PowerShell, and WMI; familiar with ADSI, Perl, .NET, and T-SQL \n• Superb troubleshooting and problem solving skills \n• Excellent verbal and written communication skills \n• Strong customer service and support skills Solutions-oriented Windows Server System Engineer with notable success managing servers and services in a complex, heterogeneous and geographically dispersed computing environment. Strong administrative scripting skills, both in development and training. Reputation as a dedicated team player with a strong work ethic and a willingness to assist others when an extra hand is needed. Interested in administrative scripting and automation projects, training and tools. Specialties:• Windows Server 2003 and Server 2008 system engineering and administration, including terminal services and clustering \n• Microsoft application server platform administration, mainly IIS 5.0/6.0, SQL Server 2000/2005/2008 \n• Proficient administrative scripter in VBScript, PowerShell, and WMI; familiar with ADSI, Perl, .NET, and T-SQL \n• Superb troubleshooting and problem solving skills \n• Excellent verbal and written communication skills \n• Strong customer service and support skills Solutions-oriented Windows Server System Engineer with notable success managing servers and services in a complex, heterogeneous and geographically dispersed computing environment. Strong administrative scripting skills, both in development and training. Reputation as a dedicated team player with a strong work ethic and a willingness to assist others when an extra hand is needed. Interested in administrative scripting and automation projects, training and tools. Specialties:• Windows Server 2003 and Server 2008 system engineering and administration, including terminal services and clustering \n• Microsoft application server platform administration, mainly IIS 5.0/6.0, SQL Server 2000/2005/2008 \n• Proficient administrative scripter in VBScript, PowerShell, and WMI; familiar with ADSI, Perl, .NET, and T-SQL \n• Superb troubleshooting and problem solving skills \n• Excellent verbal and written communication skills \n• Strong customer service and support skills Experience Senior Systems Programmer Intel January 2000  – Present (15 years 8 months) • Windows server system engineering and administration  \n• Administrative scripting for Windows server build customization, server security patching, & task automation \n• Microsoft IIS web server administration \n• Microsoft SQL Server 2000/2005/2008 database administration \n• Windows HPC Server 2008 implementation and administration \n• Integration of electrical and mechanical analysis tools from Ansys and Simulia. \n• Customer engagement and stakeholder management \n• IBM Rational ClearQuest global infrastructure architecture, design, and administration, including ClearQuest MultiSite Systems Programmer Intel April 1997  –  December 1999  (2 years 9 months) • Help-desk first- and second-level support for semiconductor design engineering computing services under Windows and UNIX/Linux \n• Development and maintenance of a Remedy ARS-based call tracking system, including custom workflow in Perl Customer Support Specialist Intel Corporation 1995  –  1997  (2 years) Point of contact for customer issues and new business requirements. Responsible for customer communications for service changes and outages. Managed IT aspects of 500 employee move into new office building. System Administrator Intel Corporation 1993  –  1995  (2 years) System administration services for Banyan Vines, OS/2, and Lotus cc:Mail, serving a customer base of about 2500. Management of PC ordering, receiving, inventory, and delivery logistics for new facility during construction and hiring phases. Computer Technician Microage Mesa 1991  –  1993  (2 years) Provided field system engineering and technical support services to a variety of business, education, and government customers in throughout Arizona. Managed inventory logistics, delivery and support of bulk computer orders for a large school district and a major corporate customer. Computer Technician Microage/Computer Solutions 1988  –  1991  (3 years) Provided depot and field service for personal computers and peripherals. Designed, implemented and supported local area network solutions for small business, education, and city and tribal government customers. Senior Systems Programmer Intel January 2000  – Present (15 years 8 months) • Windows server system engineering and administration  \n• Administrative scripting for Windows server build customization, server security patching, & task automation \n• Microsoft IIS web server administration \n• Microsoft SQL Server 2000/2005/2008 database administration \n• Windows HPC Server 2008 implementation and administration \n• Integration of electrical and mechanical analysis tools from Ansys and Simulia. \n• Customer engagement and stakeholder management \n• IBM Rational ClearQuest global infrastructure architecture, design, and administration, including ClearQuest MultiSite Senior Systems Programmer Intel January 2000  – Present (15 years 8 months) • Windows server system engineering and administration  \n• Administrative scripting for Windows server build customization, server security patching, & task automation \n• Microsoft IIS web server administration \n• Microsoft SQL Server 2000/2005/2008 database administration \n• Windows HPC Server 2008 implementation and administration \n• Integration of electrical and mechanical analysis tools from Ansys and Simulia. \n• Customer engagement and stakeholder management \n• IBM Rational ClearQuest global infrastructure architecture, design, and administration, including ClearQuest MultiSite Systems Programmer Intel April 1997  –  December 1999  (2 years 9 months) • Help-desk first- and second-level support for semiconductor design engineering computing services under Windows and UNIX/Linux \n• Development and maintenance of a Remedy ARS-based call tracking system, including custom workflow in Perl Systems Programmer Intel April 1997  –  December 1999  (2 years 9 months) • Help-desk first- and second-level support for semiconductor design engineering computing services under Windows and UNIX/Linux \n• Development and maintenance of a Remedy ARS-based call tracking system, including custom workflow in Perl Customer Support Specialist Intel Corporation 1995  –  1997  (2 years) Point of contact for customer issues and new business requirements. Responsible for customer communications for service changes and outages. Managed IT aspects of 500 employee move into new office building. Customer Support Specialist Intel Corporation 1995  –  1997  (2 years) Point of contact for customer issues and new business requirements. Responsible for customer communications for service changes and outages. Managed IT aspects of 500 employee move into new office building. System Administrator Intel Corporation 1993  –  1995  (2 years) System administration services for Banyan Vines, OS/2, and Lotus cc:Mail, serving a customer base of about 2500. Management of PC ordering, receiving, inventory, and delivery logistics for new facility during construction and hiring phases. System Administrator Intel Corporation 1993  –  1995  (2 years) System administration services for Banyan Vines, OS/2, and Lotus cc:Mail, serving a customer base of about 2500. Management of PC ordering, receiving, inventory, and delivery logistics for new facility during construction and hiring phases. Computer Technician Microage Mesa 1991  –  1993  (2 years) Provided field system engineering and technical support services to a variety of business, education, and government customers in throughout Arizona. Managed inventory logistics, delivery and support of bulk computer orders for a large school district and a major corporate customer. Computer Technician Microage Mesa 1991  –  1993  (2 years) Provided field system engineering and technical support services to a variety of business, education, and government customers in throughout Arizona. Managed inventory logistics, delivery and support of bulk computer orders for a large school district and a major corporate customer. Computer Technician Microage/Computer Solutions 1988  –  1991  (3 years) Provided depot and field service for personal computers and peripherals. Designed, implemented and supported local area network solutions for small business, education, and city and tribal government customers. Computer Technician Microage/Computer Solutions 1988  –  1991  (3 years) Provided depot and field service for personal computers and peripherals. Designed, implemented and supported local area network solutions for small business, education, and city and tribal government customers. Skills Servers Windows Server Troubleshooting Microsoft SQL Server System Administration Perl VBScript Windows IIS Information Technology Integration Linux Skills  Servers Windows Server Troubleshooting Microsoft SQL Server System Administration Perl VBScript Windows IIS Information Technology Integration Linux Servers Windows Server Troubleshooting Microsoft SQL Server System Administration Perl VBScript Windows IIS Information Technology Integration Linux Servers Windows Server Troubleshooting Microsoft SQL Server System Administration Perl VBScript Windows IIS Information Technology Integration Linux Education Northern Arizona University BS,  Mathematics/Computer Science (dual major) 1983  – 1988 Activities and Societies:  Association for Computing Machinery Northern Arizona University BS,  Mathematics/Computer Science (dual major) 1983  – 1988 Activities and Societies:  Association for Computing Machinery Northern Arizona University BS,  Mathematics/Computer Science (dual major) 1983  – 1988 Activities and Societies:  Association for Computing Machinery Northern Arizona University BS,  Mathematics/Computer Science (dual major) 1983  – 1988 Activities and Societies:  Association for Computing Machinery ", "Summary 12 years of Storage (NAS + SAN) administration \n18 years of Linux and FreeBSD administration \n18 years of Windows servers and clients administration \nBroad area of technical expertise Summary 12 years of Storage (NAS + SAN) administration \n18 years of Linux and FreeBSD administration \n18 years of Windows servers and clients administration \nBroad area of technical expertise 12 years of Storage (NAS + SAN) administration \n18 years of Linux and FreeBSD administration \n18 years of Windows servers and clients administration \nBroad area of technical expertise 12 years of Storage (NAS + SAN) administration \n18 years of Linux and FreeBSD administration \n18 years of Windows servers and clients administration \nBroad area of technical expertise Experience Senior systems programmer Intel Corporation September 2002  – Present (13 years) Nizhny Novgorod Region, Russian Federation Senior Specialist of Automation Department Autobank, NN branch June 2002  –  September 2002  (4 months) Nizhny Novgorod Region, Russian Federation Connection of 3 offices in NN branch for data exchange and access to Internet; Interaction with service providers on technical questions. Senior systems programmer Intel Corporation September 2002  – Present (13 years) Nizhny Novgorod Region, Russian Federation Senior systems programmer Intel Corporation September 2002  – Present (13 years) Nizhny Novgorod Region, Russian Federation Senior Specialist of Automation Department Autobank, NN branch June 2002  –  September 2002  (4 months) Nizhny Novgorod Region, Russian Federation Connection of 3 offices in NN branch for data exchange and access to Internet; Interaction with service providers on technical questions. Senior Specialist of Automation Department Autobank, NN branch June 2002  –  September 2002  (4 months) Nizhny Novgorod Region, Russian Federation Connection of 3 offices in NN branch for data exchange and access to Internet; Interaction with service providers on technical questions. Languages Русский/Russian Native or bilingual proficiency Английский/English Professional working proficiency Русский/Russian Native or bilingual proficiency Английский/English Professional working proficiency Русский/Russian Native or bilingual proficiency Английский/English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills NAS NFS CIFS NetApp Filers EMC Celerra Samba EMC SAN Administration EMC Clariion EMC VNX Brocade Fibre Switches Team Leadership ITIL Certified Data replication Linux DNS Management ESXi HP LAN (ethernet) TCP/IP: addressing,... MySQL NIS SSH Unix Windows Broad area of technical... bash C Perl csh RDP Web: Apache and IIS DB: MySQL and MS SQL MS Office products See 18+     See less Skills  NAS NFS CIFS NetApp Filers EMC Celerra Samba EMC SAN Administration EMC Clariion EMC VNX Brocade Fibre Switches Team Leadership ITIL Certified Data replication Linux DNS Management ESXi HP LAN (ethernet) TCP/IP: addressing,... MySQL NIS SSH Unix Windows Broad area of technical... bash C Perl csh RDP Web: Apache and IIS DB: MySQL and MS SQL MS Office products See 18+     See less NAS NFS CIFS NetApp Filers EMC Celerra Samba EMC SAN Administration EMC Clariion EMC VNX Brocade Fibre Switches Team Leadership ITIL Certified Data replication Linux DNS Management ESXi HP LAN (ethernet) TCP/IP: addressing,... MySQL NIS SSH Unix Windows Broad area of technical... bash C Perl csh RDP Web: Apache and IIS DB: MySQL and MS SQL MS Office products See 18+     See less NAS NFS CIFS NetApp Filers EMC Celerra Samba EMC SAN Administration EMC Clariion EMC VNX Brocade Fibre Switches Team Leadership ITIL Certified Data replication Linux DNS Management ESXi HP LAN (ethernet) TCP/IP: addressing,... MySQL NIS SSH Unix Windows Broad area of technical... bash C Perl csh RDP Web: Apache and IIS DB: MySQL and MS SQL MS Office products See 18+     See less Education Нижегородский Государственный Университет им. Н.И. Лобачевского (ННГУ) Инженер-физик,  Информационные технологии в физических исследованиях 1989  – 1995 Activities and Societies:  Работал оператором в университетском вычислительном центре Нижегородский Государственный Университет им. Н.И. Лобачевского (ННГУ) Инженер-физик,  Информационные технологии в физических исследованиях 1989  – 1995 Activities and Societies:  Работал оператором в университетском вычислительном центре Нижегородский Государственный Университет им. Н.И. Лобачевского (ННГУ) Инженер-физик,  Информационные технологии в физических исследованиях 1989  – 1995 Activities and Societies:  Работал оператором в университетском вычислительном центре Нижегородский Государственный Университет им. Н.И. Лобачевского (ННГУ) Инженер-физик,  Информационные технологии в физических исследованиях 1989  – 1995 Activities and Societies:  Работал оператором в университетском вычислительном центре ", "Summary Researcher, developer and enthusiast on Linux based programs and tools, Java/Scala web technologies and networking, experienced on effective solutions implementations on Infrastructure software/tools. I enjoy having out-of-the-box thinking and good team collaboration spirit Summary Researcher, developer and enthusiast on Linux based programs and tools, Java/Scala web technologies and networking, experienced on effective solutions implementations on Infrastructure software/tools. I enjoy having out-of-the-box thinking and good team collaboration spirit Researcher, developer and enthusiast on Linux based programs and tools, Java/Scala web technologies and networking, experienced on effective solutions implementations on Infrastructure software/tools. I enjoy having out-of-the-box thinking and good team collaboration spirit Researcher, developer and enthusiast on Linux based programs and tools, Java/Scala web technologies and networking, experienced on effective solutions implementations on Infrastructure software/tools. I enjoy having out-of-the-box thinking and good team collaboration spirit Experience Systems Programmer Intel Corporation July 2013  – Present (2 years 2 months) Web Service Security Senior Java Developer Dextra Technologies at HP December 2012  – Present (2 years 9 months) Sr. Linux Software Engineer Texas Instruments (Dextra Technologies) June 2010  –  November 2012  (2 years 6 months) Software and Tools development for the OMAP build Infrastructure, automation and product build information gathering for further analysis/statistics. Design and develop custom software/tools solutions for the build infrastructure, automation and adaptation on Internal/External tools. Integrate MeeGo OS on OMAP4 Panda Board. \n \nHands on experience: \n- Experienced on Jenkins-CI extensions/development, specifically on extending 'Gerrit-Trigger' plugin in order to support Multi-Gerrit review server listeners, originally just one Gerrit server listener were supported. Also enable SSH connections through proxy. All this stuff has been deployed on internal Jenkins production server and is coming soon under release process to make it publicly available under MIT license. \n- Design and develop custom Linux software/tools solutions on the Android build infrastructure (OMAP), automation and adaptation on external/internal tools. \n- Design/develop a Python daemon program to review/check coding style on the submitted Android kernel patches to Gerrit review server. (Used Gerrit stream-events facility). \n- Develop a pure bash tool/program to print out the differences between two Android repositories using as input two XML manifest files (versions). Difftool.sh released under GPLv2 license and hosted on: http://git.omapzoom.org \n- Collaborate within the Integration team and help to produce all the necessary pieces to have running MeeGo on OMAP based Panda board. \n- Licensing Android review automation using Java API from internal proprietary deployed server. IT Manager VALI Comercial S.A de C.V. February 2005  –  June 2010  (5 years 5 months) Linux kernel customization for best performance on virtualization software running on own hardware aiming private cloud deployment, tools and automation development for Infrastructure maintenance. Lead and coordinate IT team tasks and projects. \n \nHands on experience: \n- Manage and lead the Information Technologies/Infrastructure area. \n- Deploy kernel customized Linux DNS, DHCP, SMTP, IMAP, HTTP servers. \n- Deploy, configure and maintain private cloud Infrastructure creating VM clusters. \n- Structure and configure Internal LAN and WLAN Network. \n- Implement and deploy secure networking using Mikrotik OS Firewall. \n- Deploy Asterisk PBX for voice communication. \n- Link the company branches to share and collaborate on productivity by using strong secure encrypted VPNs. \n- Lead and develop internal tools/applications development using various open source resources: Python, PHP, GNU toolchain, Java, MySQL, Apache httpd. \n- Deploy Active directory, company wide, optimize on some branches to leverage narrowed bandwidth without loosing productivity. Tech Leader INDEX Datacom February 2003  –  January 2005  (2 years) Software developer senior achieved through development and team coordination for customized Java/Web software packages developed for client delivery. Customizing Linux kernel patches and deploy on customized owned hardware. \n \nHands on experience: \n- Design and deploy Company services Infrastructure including SMTP, POP3, IMAP, HTTP and MySQL. \n- Strategy definition for software life cycle development and milestone accomplishments. \n- Design and lead UML based custom application on client requirements \n- Knowledge on design patterns and Object Oriented Programming. \n- Develop RADIUS Web based GUI integrated on the billing system using PHP programming, HTML, CSS, JavaScript and MySQL. \n- Customize RADIUS server to integrate into accounting/billing system. Systems Programmer Intel Corporation July 2013  – Present (2 years 2 months) Web Service Security Systems Programmer Intel Corporation July 2013  – Present (2 years 2 months) Web Service Security Senior Java Developer Dextra Technologies at HP December 2012  – Present (2 years 9 months) Senior Java Developer Dextra Technologies at HP December 2012  – Present (2 years 9 months) Sr. Linux Software Engineer Texas Instruments (Dextra Technologies) June 2010  –  November 2012  (2 years 6 months) Software and Tools development for the OMAP build Infrastructure, automation and product build information gathering for further analysis/statistics. Design and develop custom software/tools solutions for the build infrastructure, automation and adaptation on Internal/External tools. Integrate MeeGo OS on OMAP4 Panda Board. \n \nHands on experience: \n- Experienced on Jenkins-CI extensions/development, specifically on extending 'Gerrit-Trigger' plugin in order to support Multi-Gerrit review server listeners, originally just one Gerrit server listener were supported. Also enable SSH connections through proxy. All this stuff has been deployed on internal Jenkins production server and is coming soon under release process to make it publicly available under MIT license. \n- Design and develop custom Linux software/tools solutions on the Android build infrastructure (OMAP), automation and adaptation on external/internal tools. \n- Design/develop a Python daemon program to review/check coding style on the submitted Android kernel patches to Gerrit review server. (Used Gerrit stream-events facility). \n- Develop a pure bash tool/program to print out the differences between two Android repositories using as input two XML manifest files (versions). Difftool.sh released under GPLv2 license and hosted on: http://git.omapzoom.org \n- Collaborate within the Integration team and help to produce all the necessary pieces to have running MeeGo on OMAP based Panda board. \n- Licensing Android review automation using Java API from internal proprietary deployed server. Sr. Linux Software Engineer Texas Instruments (Dextra Technologies) June 2010  –  November 2012  (2 years 6 months) Software and Tools development for the OMAP build Infrastructure, automation and product build information gathering for further analysis/statistics. Design and develop custom software/tools solutions for the build infrastructure, automation and adaptation on Internal/External tools. Integrate MeeGo OS on OMAP4 Panda Board. \n \nHands on experience: \n- Experienced on Jenkins-CI extensions/development, specifically on extending 'Gerrit-Trigger' plugin in order to support Multi-Gerrit review server listeners, originally just one Gerrit server listener were supported. Also enable SSH connections through proxy. All this stuff has been deployed on internal Jenkins production server and is coming soon under release process to make it publicly available under MIT license. \n- Design and develop custom Linux software/tools solutions on the Android build infrastructure (OMAP), automation and adaptation on external/internal tools. \n- Design/develop a Python daemon program to review/check coding style on the submitted Android kernel patches to Gerrit review server. (Used Gerrit stream-events facility). \n- Develop a pure bash tool/program to print out the differences between two Android repositories using as input two XML manifest files (versions). Difftool.sh released under GPLv2 license and hosted on: http://git.omapzoom.org \n- Collaborate within the Integration team and help to produce all the necessary pieces to have running MeeGo on OMAP based Panda board. \n- Licensing Android review automation using Java API from internal proprietary deployed server. IT Manager VALI Comercial S.A de C.V. February 2005  –  June 2010  (5 years 5 months) Linux kernel customization for best performance on virtualization software running on own hardware aiming private cloud deployment, tools and automation development for Infrastructure maintenance. Lead and coordinate IT team tasks and projects. \n \nHands on experience: \n- Manage and lead the Information Technologies/Infrastructure area. \n- Deploy kernel customized Linux DNS, DHCP, SMTP, IMAP, HTTP servers. \n- Deploy, configure and maintain private cloud Infrastructure creating VM clusters. \n- Structure and configure Internal LAN and WLAN Network. \n- Implement and deploy secure networking using Mikrotik OS Firewall. \n- Deploy Asterisk PBX for voice communication. \n- Link the company branches to share and collaborate on productivity by using strong secure encrypted VPNs. \n- Lead and develop internal tools/applications development using various open source resources: Python, PHP, GNU toolchain, Java, MySQL, Apache httpd. \n- Deploy Active directory, company wide, optimize on some branches to leverage narrowed bandwidth without loosing productivity. IT Manager VALI Comercial S.A de C.V. February 2005  –  June 2010  (5 years 5 months) Linux kernel customization for best performance on virtualization software running on own hardware aiming private cloud deployment, tools and automation development for Infrastructure maintenance. Lead and coordinate IT team tasks and projects. \n \nHands on experience: \n- Manage and lead the Information Technologies/Infrastructure area. \n- Deploy kernel customized Linux DNS, DHCP, SMTP, IMAP, HTTP servers. \n- Deploy, configure and maintain private cloud Infrastructure creating VM clusters. \n- Structure and configure Internal LAN and WLAN Network. \n- Implement and deploy secure networking using Mikrotik OS Firewall. \n- Deploy Asterisk PBX for voice communication. \n- Link the company branches to share and collaborate on productivity by using strong secure encrypted VPNs. \n- Lead and develop internal tools/applications development using various open source resources: Python, PHP, GNU toolchain, Java, MySQL, Apache httpd. \n- Deploy Active directory, company wide, optimize on some branches to leverage narrowed bandwidth without loosing productivity. Tech Leader INDEX Datacom February 2003  –  January 2005  (2 years) Software developer senior achieved through development and team coordination for customized Java/Web software packages developed for client delivery. Customizing Linux kernel patches and deploy on customized owned hardware. \n \nHands on experience: \n- Design and deploy Company services Infrastructure including SMTP, POP3, IMAP, HTTP and MySQL. \n- Strategy definition for software life cycle development and milestone accomplishments. \n- Design and lead UML based custom application on client requirements \n- Knowledge on design patterns and Object Oriented Programming. \n- Develop RADIUS Web based GUI integrated on the billing system using PHP programming, HTML, CSS, JavaScript and MySQL. \n- Customize RADIUS server to integrate into accounting/billing system. Tech Leader INDEX Datacom February 2003  –  January 2005  (2 years) Software developer senior achieved through development and team coordination for customized Java/Web software packages developed for client delivery. Customizing Linux kernel patches and deploy on customized owned hardware. \n \nHands on experience: \n- Design and deploy Company services Infrastructure including SMTP, POP3, IMAP, HTTP and MySQL. \n- Strategy definition for software life cycle development and milestone accomplishments. \n- Design and lead UML based custom application on client requirements \n- Knowledge on design patterns and Object Oriented Programming. \n- Develop RADIUS Web based GUI integrated on the billing system using PHP programming, HTML, CSS, JavaScript and MySQL. \n- Customize RADIUS server to integrate into accounting/billing system. Skills Linux Jenkins Java REST Git Maven Android Python Agile Methodologies OMAP Bash Scala Concurrent Programming Eclipse Perl MySQL HTTP Debugging IntelliJ IDEA XML Design Patterns Network Security TCP/IP JavaScript HTML Apache Commons Web Services Httpd AJAX Cloud Computing MeeGo Embedded Software Shell Scripting Open Source Linux Kernel See 20+     See less Skills  Linux Jenkins Java REST Git Maven Android Python Agile Methodologies OMAP Bash Scala Concurrent Programming Eclipse Perl MySQL HTTP Debugging IntelliJ IDEA XML Design Patterns Network Security TCP/IP JavaScript HTML Apache Commons Web Services Httpd AJAX Cloud Computing MeeGo Embedded Software Shell Scripting Open Source Linux Kernel See 20+     See less Linux Jenkins Java REST Git Maven Android Python Agile Methodologies OMAP Bash Scala Concurrent Programming Eclipse Perl MySQL HTTP Debugging IntelliJ IDEA XML Design Patterns Network Security TCP/IP JavaScript HTML Apache Commons Web Services Httpd AJAX Cloud Computing MeeGo Embedded Software Shell Scripting Open Source Linux Kernel See 20+     See less Linux Jenkins Java REST Git Maven Android Python Agile Methodologies OMAP Bash Scala Concurrent Programming Eclipse Perl MySQL HTTP Debugging IntelliJ IDEA XML Design Patterns Network Security TCP/IP JavaScript HTML Apache Commons Web Services Httpd AJAX Cloud Computing MeeGo Embedded Software Shell Scripting Open Source Linux Kernel See 20+     See less ", "Experience Information Security Specialist Bank of America April 2011  – Present (4 years 5 months) Senior Systems Programmer Intel Corporation May 1995  –  August 2009  (14 years 4 months) Information Security Specialist Bank of America April 2011  – Present (4 years 5 months) Information Security Specialist Bank of America April 2011  – Present (4 years 5 months) Senior Systems Programmer Intel Corporation May 1995  –  August 2009  (14 years 4 months) Senior Systems Programmer Intel Corporation May 1995  –  August 2009  (14 years 4 months) Education Bloomsburg University of Pennsylvania MS,  Instructional Technology 2007  – 2009 Bloomsburg University of Pennsylvania BS,  Computer Science 1989  – 1993 Bloomsburg University of Pennsylvania MS,  Instructional Technology 2007  – 2009 Bloomsburg University of Pennsylvania MS,  Instructional Technology 2007  – 2009 Bloomsburg University of Pennsylvania MS,  Instructional Technology 2007  – 2009 Bloomsburg University of Pennsylvania BS,  Computer Science 1989  – 1993 Bloomsburg University of Pennsylvania BS,  Computer Science 1989  – 1993 Bloomsburg University of Pennsylvania BS,  Computer Science 1989  – 1993 ", "Summary Highly motivated, passionate, and articulate Senior IT Enterprise Architect, Strategic Product Planner, and Systems Integration Engineering Lead. Lead architecture activity in client computing, mobility, identity management & directory services domains, provide all manner of conceptual, reference, and solution architecture and roadmaps and direct the activities of junior EAs. Proven leadership and team-building skills having frequently organized virtual teams across divisions, functions and geographies. \n \nProven track record over 26 years in delivering global IT infrastructure solutions and services in very competitive, mission-critical environments supporting financial services, product engineering, manufacturing, and corporate functions, leading strategic technical initiatives, creating technical architecture and managing technology and capability roadmaps. \n \nActively engaged with end customers by sharing IT strategies and plans with many Fortune 500 companies and municipalities in the northeast. Spoke at numerous sales events and public forums and delivered keynote addresses on client end point computing, client virtualization, BYOD and consumerization of IT. Authored many customer-facing white papers describing solution architectures and infrastructure deployment strategies. Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. \n \nCore Competencies: \n• Enterprise Architecture \n• Strategic Planning \n• Systems Integration Engineering \n• Innovation & Concept Development \n \nSubject Matter Expertise: \n• Device & Application Mobility \n• Mobile Operating Systems & Platforms\t \n• Client Virtualization \n• Client-Aware Cloud Services \n• IT Consumerization/BYO \n• Identity Management & Directory Services Summary Highly motivated, passionate, and articulate Senior IT Enterprise Architect, Strategic Product Planner, and Systems Integration Engineering Lead. Lead architecture activity in client computing, mobility, identity management & directory services domains, provide all manner of conceptual, reference, and solution architecture and roadmaps and direct the activities of junior EAs. Proven leadership and team-building skills having frequently organized virtual teams across divisions, functions and geographies. \n \nProven track record over 26 years in delivering global IT infrastructure solutions and services in very competitive, mission-critical environments supporting financial services, product engineering, manufacturing, and corporate functions, leading strategic technical initiatives, creating technical architecture and managing technology and capability roadmaps. \n \nActively engaged with end customers by sharing IT strategies and plans with many Fortune 500 companies and municipalities in the northeast. Spoke at numerous sales events and public forums and delivered keynote addresses on client end point computing, client virtualization, BYOD and consumerization of IT. Authored many customer-facing white papers describing solution architectures and infrastructure deployment strategies. Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. \n \nCore Competencies: \n• Enterprise Architecture \n• Strategic Planning \n• Systems Integration Engineering \n• Innovation & Concept Development \n \nSubject Matter Expertise: \n• Device & Application Mobility \n• Mobile Operating Systems & Platforms\t \n• Client Virtualization \n• Client-Aware Cloud Services \n• IT Consumerization/BYO \n• Identity Management & Directory Services Highly motivated, passionate, and articulate Senior IT Enterprise Architect, Strategic Product Planner, and Systems Integration Engineering Lead. Lead architecture activity in client computing, mobility, identity management & directory services domains, provide all manner of conceptual, reference, and solution architecture and roadmaps and direct the activities of junior EAs. Proven leadership and team-building skills having frequently organized virtual teams across divisions, functions and geographies. \n \nProven track record over 26 years in delivering global IT infrastructure solutions and services in very competitive, mission-critical environments supporting financial services, product engineering, manufacturing, and corporate functions, leading strategic technical initiatives, creating technical architecture and managing technology and capability roadmaps. \n \nActively engaged with end customers by sharing IT strategies and plans with many Fortune 500 companies and municipalities in the northeast. Spoke at numerous sales events and public forums and delivered keynote addresses on client end point computing, client virtualization, BYOD and consumerization of IT. Authored many customer-facing white papers describing solution architectures and infrastructure deployment strategies. Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. \n \nCore Competencies: \n• Enterprise Architecture \n• Strategic Planning \n• Systems Integration Engineering \n• Innovation & Concept Development \n \nSubject Matter Expertise: \n• Device & Application Mobility \n• Mobile Operating Systems & Platforms\t \n• Client Virtualization \n• Client-Aware Cloud Services \n• IT Consumerization/BYO \n• Identity Management & Directory Services Highly motivated, passionate, and articulate Senior IT Enterprise Architect, Strategic Product Planner, and Systems Integration Engineering Lead. Lead architecture activity in client computing, mobility, identity management & directory services domains, provide all manner of conceptual, reference, and solution architecture and roadmaps and direct the activities of junior EAs. Proven leadership and team-building skills having frequently organized virtual teams across divisions, functions and geographies. \n \nProven track record over 26 years in delivering global IT infrastructure solutions and services in very competitive, mission-critical environments supporting financial services, product engineering, manufacturing, and corporate functions, leading strategic technical initiatives, creating technical architecture and managing technology and capability roadmaps. \n \nActively engaged with end customers by sharing IT strategies and plans with many Fortune 500 companies and municipalities in the northeast. Spoke at numerous sales events and public forums and delivered keynote addresses on client end point computing, client virtualization, BYOD and consumerization of IT. Authored many customer-facing white papers describing solution architectures and infrastructure deployment strategies. Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. \n \nCore Competencies: \n• Enterprise Architecture \n• Strategic Planning \n• Systems Integration Engineering \n• Innovation & Concept Development \n \nSubject Matter Expertise: \n• Device & Application Mobility \n• Mobile Operating Systems & Platforms\t \n• Client Virtualization \n• Client-Aware Cloud Services \n• IT Consumerization/BYO \n• Identity Management & Directory Services Experience Assistant Vice President, Enterprise Architecture Services MassMutual Financial Group January 2014  – Present (1 year 8 months) Springfield, Massachusetts Area • Senior architect with executive-level influence. \n• Ensure alignment between business and IT strategies. \n• Partner with business units to define technology vision and strategic business objectives for the domain. \n• Establish integrated capability and solution roadmaps and influence business investments in technology. \n• Develop and manage segment and solution architectures. \n• Govern the catalog of architecture patterns and minimize architecture exceptions. \n• Ensure that business capabilities and IT services are modeled. \n• Manage the technology portfolio (APM). Technical Strategist / Strategic Planner Intel Corporation April 2013  –  January 2014  (10 months) Hudson, MA • Drove Intel’s mobility and “No Wires” strategies and solutions targeted at business segments. \n• Applied IT experience to define and design new Intel products and strategies for enterprise and small business usages. \n• Defined Android and mobile platform strategies including definition of business features and security and manageability product requirements. \n• Led product strategy and planning activities for wireless display and wireless docking. \n• Defined product requirements and priorities, partnered with engineering to establish feasibility and understand resource constraints, and drove execution on product roadmaps. Senior IT Enterprise Architect Intel Corporation January 2005  –  April 2013  (8 years 4 months) Hudson, MA • Defined IT strategy and directed all architects and architecture activity for client computing, mobility, identity and directory domains. Reported directly to the Chief Enterprise Architect. \n• Provided architecture for key programs, set technical direction, and managed virtual teams delivering all related conceptual, reference and solution architecture. \n• Led strategic discussions to influence senior leadership and IT direction on numerous topics including Windows 8, client virtualization, manageability, BYO and consumerization. \n• Developed architecture for client virtualization, enterprise content synchronization, mobile application containers, and an innovative digital business assistant mobile application to build out our cross-platform mobility services vision. \n• Defined the IT-standard Windows 7 client platform architecture, established business value for migration, and drove adoption of a uniform 64-bit OS platform standard. \n• Co-developed the Enterprise Architecture practice at Intel, adapted from the TOGAF framework and methodology, and established a technical governance process. \n• Chaired the Client Mobility and Infrastructure Core Services technical governance bodies to develop IT technical standards and enforce compliance. \n• Provided sales and business development support by sharing Intel IT's strategies and plans with many Fortune 500 companies in the northeast. \n• Represented Intel at numerous sales events and public forums and delivered keynote addresses on client computing, client virtualization, BYOD and consumerization of IT. \n• Authored fifteen customer-facing white papers describing solution architectures and infrastructure deployment strategies. \n• Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. Senior Systems Programmer Intel Corporation May 1998  –  December 2004  (6 years 8 months) Hudson, MA • Designed and implemented Intel's Active Directory infrastructure, in use for 13 years. \n• Managed a team of five senior engineers providing global 3rd-level support. \n• Co-designed the Active Directory infrastructure for Intel’s fabs and factories. \n• Facilitated directory services integration for a dozen acquisitions around the globe. \n• Designed an LDAP directory service to support Intel’s first Internet-facing SAP portal. \n• Earned a Corporate Vanguard Award for Active Directory business continuity capability. Principal IT Specialist Digital Equipment Corporation July 1987  –  May 1998  (10 years 11 months) Maynard & Hudson, MA • Led the successful Windows NT and Exchange infrastructure integration and migration for the Digital Semiconductor acquisition, ensuring 1900 users had services for Day 1 at Intel. \n• Designed and built the Windows NT infrastructure and services for Digital Semiconductor. \n• Led a team in support of three 60-node VMS clusters and dozens of UNIX workstations (DEC OSF/1 & Ultrix) used for DEC Alpha processor design. Assistant Vice President, Enterprise Architecture Services MassMutual Financial Group January 2014  – Present (1 year 8 months) Springfield, Massachusetts Area • Senior architect with executive-level influence. \n• Ensure alignment between business and IT strategies. \n• Partner with business units to define technology vision and strategic business objectives for the domain. \n• Establish integrated capability and solution roadmaps and influence business investments in technology. \n• Develop and manage segment and solution architectures. \n• Govern the catalog of architecture patterns and minimize architecture exceptions. \n• Ensure that business capabilities and IT services are modeled. \n• Manage the technology portfolio (APM). Assistant Vice President, Enterprise Architecture Services MassMutual Financial Group January 2014  – Present (1 year 8 months) Springfield, Massachusetts Area • Senior architect with executive-level influence. \n• Ensure alignment between business and IT strategies. \n• Partner with business units to define technology vision and strategic business objectives for the domain. \n• Establish integrated capability and solution roadmaps and influence business investments in technology. \n• Develop and manage segment and solution architectures. \n• Govern the catalog of architecture patterns and minimize architecture exceptions. \n• Ensure that business capabilities and IT services are modeled. \n• Manage the technology portfolio (APM). Technical Strategist / Strategic Planner Intel Corporation April 2013  –  January 2014  (10 months) Hudson, MA • Drove Intel’s mobility and “No Wires” strategies and solutions targeted at business segments. \n• Applied IT experience to define and design new Intel products and strategies for enterprise and small business usages. \n• Defined Android and mobile platform strategies including definition of business features and security and manageability product requirements. \n• Led product strategy and planning activities for wireless display and wireless docking. \n• Defined product requirements and priorities, partnered with engineering to establish feasibility and understand resource constraints, and drove execution on product roadmaps. Technical Strategist / Strategic Planner Intel Corporation April 2013  –  January 2014  (10 months) Hudson, MA • Drove Intel’s mobility and “No Wires” strategies and solutions targeted at business segments. \n• Applied IT experience to define and design new Intel products and strategies for enterprise and small business usages. \n• Defined Android and mobile platform strategies including definition of business features and security and manageability product requirements. \n• Led product strategy and planning activities for wireless display and wireless docking. \n• Defined product requirements and priorities, partnered with engineering to establish feasibility and understand resource constraints, and drove execution on product roadmaps. Senior IT Enterprise Architect Intel Corporation January 2005  –  April 2013  (8 years 4 months) Hudson, MA • Defined IT strategy and directed all architects and architecture activity for client computing, mobility, identity and directory domains. Reported directly to the Chief Enterprise Architect. \n• Provided architecture for key programs, set technical direction, and managed virtual teams delivering all related conceptual, reference and solution architecture. \n• Led strategic discussions to influence senior leadership and IT direction on numerous topics including Windows 8, client virtualization, manageability, BYO and consumerization. \n• Developed architecture for client virtualization, enterprise content synchronization, mobile application containers, and an innovative digital business assistant mobile application to build out our cross-platform mobility services vision. \n• Defined the IT-standard Windows 7 client platform architecture, established business value for migration, and drove adoption of a uniform 64-bit OS platform standard. \n• Co-developed the Enterprise Architecture practice at Intel, adapted from the TOGAF framework and methodology, and established a technical governance process. \n• Chaired the Client Mobility and Infrastructure Core Services technical governance bodies to develop IT technical standards and enforce compliance. \n• Provided sales and business development support by sharing Intel IT's strategies and plans with many Fortune 500 companies in the northeast. \n• Represented Intel at numerous sales events and public forums and delivered keynote addresses on client computing, client virtualization, BYOD and consumerization of IT. \n• Authored fifteen customer-facing white papers describing solution architectures and infrastructure deployment strategies. \n• Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. Senior IT Enterprise Architect Intel Corporation January 2005  –  April 2013  (8 years 4 months) Hudson, MA • Defined IT strategy and directed all architects and architecture activity for client computing, mobility, identity and directory domains. Reported directly to the Chief Enterprise Architect. \n• Provided architecture for key programs, set technical direction, and managed virtual teams delivering all related conceptual, reference and solution architecture. \n• Led strategic discussions to influence senior leadership and IT direction on numerous topics including Windows 8, client virtualization, manageability, BYO and consumerization. \n• Developed architecture for client virtualization, enterprise content synchronization, mobile application containers, and an innovative digital business assistant mobile application to build out our cross-platform mobility services vision. \n• Defined the IT-standard Windows 7 client platform architecture, established business value for migration, and drove adoption of a uniform 64-bit OS platform standard. \n• Co-developed the Enterprise Architecture practice at Intel, adapted from the TOGAF framework and methodology, and established a technical governance process. \n• Chaired the Client Mobility and Infrastructure Core Services technical governance bodies to develop IT technical standards and enforce compliance. \n• Provided sales and business development support by sharing Intel IT's strategies and plans with many Fortune 500 companies in the northeast. \n• Represented Intel at numerous sales events and public forums and delivered keynote addresses on client computing, client virtualization, BYOD and consumerization of IT. \n• Authored fifteen customer-facing white papers describing solution architectures and infrastructure deployment strategies. \n• Established and managed an Innovation Center lab to provide solution demonstrations and technology showcases for the field. Senior Systems Programmer Intel Corporation May 1998  –  December 2004  (6 years 8 months) Hudson, MA • Designed and implemented Intel's Active Directory infrastructure, in use for 13 years. \n• Managed a team of five senior engineers providing global 3rd-level support. \n• Co-designed the Active Directory infrastructure for Intel’s fabs and factories. \n• Facilitated directory services integration for a dozen acquisitions around the globe. \n• Designed an LDAP directory service to support Intel’s first Internet-facing SAP portal. \n• Earned a Corporate Vanguard Award for Active Directory business continuity capability. Senior Systems Programmer Intel Corporation May 1998  –  December 2004  (6 years 8 months) Hudson, MA • Designed and implemented Intel's Active Directory infrastructure, in use for 13 years. \n• Managed a team of five senior engineers providing global 3rd-level support. \n• Co-designed the Active Directory infrastructure for Intel’s fabs and factories. \n• Facilitated directory services integration for a dozen acquisitions around the globe. \n• Designed an LDAP directory service to support Intel’s first Internet-facing SAP portal. \n• Earned a Corporate Vanguard Award for Active Directory business continuity capability. Principal IT Specialist Digital Equipment Corporation July 1987  –  May 1998  (10 years 11 months) Maynard & Hudson, MA • Led the successful Windows NT and Exchange infrastructure integration and migration for the Digital Semiconductor acquisition, ensuring 1900 users had services for Day 1 at Intel. \n• Designed and built the Windows NT infrastructure and services for Digital Semiconductor. \n• Led a team in support of three 60-node VMS clusters and dozens of UNIX workstations (DEC OSF/1 & Ultrix) used for DEC Alpha processor design. Principal IT Specialist Digital Equipment Corporation July 1987  –  May 1998  (10 years 11 months) Maynard & Hudson, MA • Led the successful Windows NT and Exchange infrastructure integration and migration for the Digital Semiconductor acquisition, ensuring 1900 users had services for Day 1 at Intel. \n• Designed and built the Windows NT infrastructure and services for Digital Semiconductor. \n• Led a team in support of three 60-node VMS clusters and dozens of UNIX workstations (DEC OSF/1 & Ultrix) used for DEC Alpha processor design. Skills Information Security Enterprise Mobility Active Directory Enterprise Architecture Cloud Computing Identity Management Virtualization System Architecture Solution Architecture IT Strategy Integration Enterprise Software Security Data Center Network Security Architectures IT Service Management IT Management Program Management Architecture Infrastructure Product Management Unix Information Technology Strategy SOA Intel TCP/IP Servers Technical Leadership Operating Systems Network Architecture Disaster Recovery Business Continuity Software Development System Deployment Storage ITIL IT Operations Server Architecture Client Services Public Speaking Strategic Planning See 28+     See less Skills  Information Security Enterprise Mobility Active Directory Enterprise Architecture Cloud Computing Identity Management Virtualization System Architecture Solution Architecture IT Strategy Integration Enterprise Software Security Data Center Network Security Architectures IT Service Management IT Management Program Management Architecture Infrastructure Product Management Unix Information Technology Strategy SOA Intel TCP/IP Servers Technical Leadership Operating Systems Network Architecture Disaster Recovery Business Continuity Software Development System Deployment Storage ITIL IT Operations Server Architecture Client Services Public Speaking Strategic Planning See 28+     See less Information Security Enterprise Mobility Active Directory Enterprise Architecture Cloud Computing Identity Management Virtualization System Architecture Solution Architecture IT Strategy Integration Enterprise Software Security Data Center Network Security Architectures IT Service Management IT Management Program Management Architecture Infrastructure Product Management Unix Information Technology Strategy SOA Intel TCP/IP Servers Technical Leadership Operating Systems Network Architecture Disaster Recovery Business Continuity Software Development System Deployment Storage ITIL IT Operations Server Architecture Client Services Public Speaking Strategic Planning See 28+     See less Information Security Enterprise Mobility Active Directory Enterprise Architecture Cloud Computing Identity Management Virtualization System Architecture Solution Architecture IT Strategy Integration Enterprise Software Security Data Center Network Security Architectures IT Service Management IT Management Program Management Architecture Infrastructure Product Management Unix Information Technology Strategy SOA Intel TCP/IP Servers Technical Leadership Operating Systems Network Architecture Disaster Recovery Business Continuity Software Development System Deployment Storage ITIL IT Operations Server Architecture Client Services Public Speaking Strategic Planning See 28+     See less Education Bentley University Bachelor of Science (BS),  Computer Information Systems , Summa Cum Laude 1983  – 1987 Bentley University Associate in Science,  Management , Summa Cum Laude 1983  – 1987 East Longmeadow High School 1979  – 1983 Bentley University Bachelor of Science (BS),  Computer Information Systems , Summa Cum Laude 1983  – 1987 Bentley University Bachelor of Science (BS),  Computer Information Systems , Summa Cum Laude 1983  – 1987 Bentley University Bachelor of Science (BS),  Computer Information Systems , Summa Cum Laude 1983  – 1987 Bentley University Associate in Science,  Management , Summa Cum Laude 1983  – 1987 Bentley University Associate in Science,  Management , Summa Cum Laude 1983  – 1987 Bentley University Associate in Science,  Management , Summa Cum Laude 1983  – 1987 East Longmeadow High School 1979  – 1983 East Longmeadow High School 1979  – 1983 East Longmeadow High School 1979  – 1983 ", "Experience IT Manager Max Planck Institute for Plant Breeding Research June 2010  – Present (5 years 3 months) Senior Systems Programmer Intel Corporation December 2004  –  May 2010  (5 years 6 months) IT-Manager Fraunhofer FIT January 1999  –  November 2004  (5 years 11 months) Student Assistant GMD Forschungszentrum Informationstechnik GmbH February 1996  –  December 1998  (2 years 11 months) Sankt Augustin IT Manager Max Planck Institute for Plant Breeding Research June 2010  – Present (5 years 3 months) IT Manager Max Planck Institute for Plant Breeding Research June 2010  – Present (5 years 3 months) Senior Systems Programmer Intel Corporation December 2004  –  May 2010  (5 years 6 months) Senior Systems Programmer Intel Corporation December 2004  –  May 2010  (5 years 6 months) IT-Manager Fraunhofer FIT January 1999  –  November 2004  (5 years 11 months) IT-Manager Fraunhofer FIT January 1999  –  November 2004  (5 years 11 months) Student Assistant GMD Forschungszentrum Informationstechnik GmbH February 1996  –  December 1998  (2 years 11 months) Sankt Augustin Student Assistant GMD Forschungszentrum Informationstechnik GmbH February 1996  –  December 1998  (2 years 11 months) Sankt Augustin Languages German Native or bilingual proficiency English Full professional proficiency Danish Elementary proficiency German Native or bilingual proficiency English Full professional proficiency Danish Elementary proficiency German Native or bilingual proficiency English Full professional proficiency Danish Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Software Development Programming Windows Linux System Administration Operating Systems Java Unix Skills  Software Development Programming Windows Linux System Administration Operating Systems Java Unix Software Development Programming Windows Linux System Administration Operating Systems Java Unix Software Development Programming Windows Linux System Administration Operating Systems Java Unix "]}