{"position": "Senior Counsel", "company": "Intel Corporation", "profiles": ["Experience Senior Counsel Intel Capital November 2012  – Present (2 years 10 months) Santa Clara Senior Counsel Intel Corporation November 2012  – Present (2 years 10 months) Santa Clara Board Member Pie Ranch June 2012  – Present (3 years 3 months) Corporate Associate Morrison & Foerster LLP April 2011  –  November 2012  (1 year 8 months) San Francisco Corporate Associate Paul Hastings October 2008  –  March 2011  (2 years 6 months) San Francisco Senior Counsel Intel Capital November 2012  – Present (2 years 10 months) Santa Clara Senior Counsel Intel Capital November 2012  – Present (2 years 10 months) Santa Clara Senior Counsel Intel Corporation November 2012  – Present (2 years 10 months) Santa Clara Senior Counsel Intel Corporation November 2012  – Present (2 years 10 months) Santa Clara Board Member Pie Ranch June 2012  – Present (3 years 3 months) Board Member Pie Ranch June 2012  – Present (3 years 3 months) Corporate Associate Morrison & Foerster LLP April 2011  –  November 2012  (1 year 8 months) San Francisco Corporate Associate Morrison & Foerster LLP April 2011  –  November 2012  (1 year 8 months) San Francisco Corporate Associate Paul Hastings October 2008  –  March 2011  (2 years 6 months) San Francisco Corporate Associate Paul Hastings October 2008  –  March 2011  (2 years 6 months) San Francisco Education University of California, Davis - School of Law Juris Doctor 2008 Activities and Societies:  Order of the Coif ,  Business Law Journal - Senior Editor University of California, San Diego Bachelor of Arts,  History 2003 University of California, Davis - School of Law Juris Doctor 2008 Activities and Societies:  Order of the Coif ,  Business Law Journal - Senior Editor University of California, Davis - School of Law Juris Doctor 2008 Activities and Societies:  Order of the Coif ,  Business Law Journal - Senior Editor University of California, Davis - School of Law Juris Doctor 2008 Activities and Societies:  Order of the Coif ,  Business Law Journal - Senior Editor University of California, San Diego Bachelor of Arts,  History 2003 University of California, San Diego Bachelor of Arts,  History 2003 University of California, San Diego Bachelor of Arts,  History 2003 ", "Summary I'm an experienced facilitating trainer and business acumen management consultant. I've been a corporate attorney and have a strong background in start-ups, securities, M&A, international transactions, joint ventures, and corporate governance. \n \nOn the side I write fiction. Summary I'm an experienced facilitating trainer and business acumen management consultant. I've been a corporate attorney and have a strong background in start-ups, securities, M&A, international transactions, joint ventures, and corporate governance. \n \nOn the side I write fiction. I'm an experienced facilitating trainer and business acumen management consultant. I've been a corporate attorney and have a strong background in start-ups, securities, M&A, international transactions, joint ventures, and corporate governance. \n \nOn the side I write fiction. I'm an experienced facilitating trainer and business acumen management consultant. I've been a corporate attorney and have a strong background in start-ups, securities, M&A, international transactions, joint ventures, and corporate governance. \n \nOn the side I write fiction. Experience Senior Consultant / Corporate Trainer Acumen Learning March 2013  – Present (2 years 6 months) Boise, Idaho Area I educate and inspire individuals and organizations by building their business acumen, accelerating their ability to accomplish great results. Attorney Law Offices of David J. Butler 2010  –  March 2013  (3 years) Eagle, Idaho Advised entrepreneurs, start-ups, and tech companies in Idaho and elsewhere with respect to strategic, corporate, commercial, and compliance issues. Director of Corporate Legal Numonyx 2008  –  2010  (2 years) Eagle, Idaho Managed in-house attorneys and outside counsel performing all corporate legal work of the high tech start-up Numonyx group. Reported to the General Counsel and managed an annual Corporate Legal budget of $1 million. \n \nResponsibilities included: strategic transactions, including the sale of company transaction (successfully closed in May 2010); establishment of the Numonyx presence in China and management of Numonyx’s minority stake in its Chinese manufacturing joint venture; legal review of procurement agreements; corporate governance and shareholder relationships; corporate secretarial and corporate housekeeping for all Numonyx group companies; a broad compliance mandate; policy setting; implementing compliance programs and company policy by training legal department staff, other functional groups, and C-level officers; and legal support for tax, treasury and finance departments. Senior Counsel Intel Corporation 2007  –  2008  (1 year) Eagle, Idaho Participated as Numonyx management in finalizing the spin-off transaction that created the Numonyx group. Associate General Counsel Micron Technology, Inc. 2005  –  2007  (2 years) Boise, Idaho Worked as a corporate generalist in the in-house legal department. Fulfilled responsibilities in the areas of corporate governance, compliance, public company reporting, shareholder relations, procurement agreement negotiation, joint venture negotiation and management, and general corporate work. Associate Clifford Chance LLP 1999  –  2005  (6 years) London, New York Worked as an associate in the cross-border capital markets practice of one of the world's largest law firms, in its London and New York offices. Senior Consultant / Corporate Trainer Acumen Learning March 2013  – Present (2 years 6 months) Boise, Idaho Area I educate and inspire individuals and organizations by building their business acumen, accelerating their ability to accomplish great results. Senior Consultant / Corporate Trainer Acumen Learning March 2013  – Present (2 years 6 months) Boise, Idaho Area I educate and inspire individuals and organizations by building their business acumen, accelerating their ability to accomplish great results. Attorney Law Offices of David J. Butler 2010  –  March 2013  (3 years) Eagle, Idaho Advised entrepreneurs, start-ups, and tech companies in Idaho and elsewhere with respect to strategic, corporate, commercial, and compliance issues. Attorney Law Offices of David J. Butler 2010  –  March 2013  (3 years) Eagle, Idaho Advised entrepreneurs, start-ups, and tech companies in Idaho and elsewhere with respect to strategic, corporate, commercial, and compliance issues. Director of Corporate Legal Numonyx 2008  –  2010  (2 years) Eagle, Idaho Managed in-house attorneys and outside counsel performing all corporate legal work of the high tech start-up Numonyx group. Reported to the General Counsel and managed an annual Corporate Legal budget of $1 million. \n \nResponsibilities included: strategic transactions, including the sale of company transaction (successfully closed in May 2010); establishment of the Numonyx presence in China and management of Numonyx’s minority stake in its Chinese manufacturing joint venture; legal review of procurement agreements; corporate governance and shareholder relationships; corporate secretarial and corporate housekeeping for all Numonyx group companies; a broad compliance mandate; policy setting; implementing compliance programs and company policy by training legal department staff, other functional groups, and C-level officers; and legal support for tax, treasury and finance departments. Director of Corporate Legal Numonyx 2008  –  2010  (2 years) Eagle, Idaho Managed in-house attorneys and outside counsel performing all corporate legal work of the high tech start-up Numonyx group. Reported to the General Counsel and managed an annual Corporate Legal budget of $1 million. \n \nResponsibilities included: strategic transactions, including the sale of company transaction (successfully closed in May 2010); establishment of the Numonyx presence in China and management of Numonyx’s minority stake in its Chinese manufacturing joint venture; legal review of procurement agreements; corporate governance and shareholder relationships; corporate secretarial and corporate housekeeping for all Numonyx group companies; a broad compliance mandate; policy setting; implementing compliance programs and company policy by training legal department staff, other functional groups, and C-level officers; and legal support for tax, treasury and finance departments. Senior Counsel Intel Corporation 2007  –  2008  (1 year) Eagle, Idaho Participated as Numonyx management in finalizing the spin-off transaction that created the Numonyx group. Senior Counsel Intel Corporation 2007  –  2008  (1 year) Eagle, Idaho Participated as Numonyx management in finalizing the spin-off transaction that created the Numonyx group. Associate General Counsel Micron Technology, Inc. 2005  –  2007  (2 years) Boise, Idaho Worked as a corporate generalist in the in-house legal department. Fulfilled responsibilities in the areas of corporate governance, compliance, public company reporting, shareholder relations, procurement agreement negotiation, joint venture negotiation and management, and general corporate work. Associate General Counsel Micron Technology, Inc. 2005  –  2007  (2 years) Boise, Idaho Worked as a corporate generalist in the in-house legal department. Fulfilled responsibilities in the areas of corporate governance, compliance, public company reporting, shareholder relations, procurement agreement negotiation, joint venture negotiation and management, and general corporate work. Associate Clifford Chance LLP 1999  –  2005  (6 years) London, New York Worked as an associate in the cross-border capital markets practice of one of the world's largest law firms, in its London and New York offices. Associate Clifford Chance LLP 1999  –  2005  (6 years) London, New York Worked as an associate in the cross-border capital markets practice of one of the world's largest law firms, in its London and New York offices. Languages English Native or bilingual proficiency Italian Full professional proficiency English Native or bilingual proficiency Italian Full professional proficiency English Native or bilingual proficiency Italian Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Semiconductor Industry Corporate Law International Law Compliance Contract Negotiation Writing Creative Writing Acoustic Guitar Securities Law Recording Italian Securities Regulation Teaching Mergers and Acquisitions Start-ups Mergers Corporate Governance Joint Ventures Licensing Intellectual Property Patent Litigation Patents Mergers & Acquisitions Strategy Due Diligence Employment Law Negotiation Facilitated Training Business Acumen Management Training Privacy Law Trademarks Trade Secrets Venture Capital Litigation Cross-border... Fiction Start-up Consulting mergers and acquisitions See 25+     See less Skills  Semiconductor Industry Corporate Law International Law Compliance Contract Negotiation Writing Creative Writing Acoustic Guitar Securities Law Recording Italian Securities Regulation Teaching Mergers and Acquisitions Start-ups Mergers Corporate Governance Joint Ventures Licensing Intellectual Property Patent Litigation Patents Mergers & Acquisitions Strategy Due Diligence Employment Law Negotiation Facilitated Training Business Acumen Management Training Privacy Law Trademarks Trade Secrets Venture Capital Litigation Cross-border... Fiction Start-up Consulting mergers and acquisitions See 25+     See less Semiconductor Industry Corporate Law International Law Compliance Contract Negotiation Writing Creative Writing Acoustic Guitar Securities Law Recording Italian Securities Regulation Teaching Mergers and Acquisitions Start-ups Mergers Corporate Governance Joint Ventures Licensing Intellectual Property Patent Litigation Patents Mergers & Acquisitions Strategy Due Diligence Employment Law Negotiation Facilitated Training Business Acumen Management Training Privacy Law Trademarks Trade Secrets Venture Capital Litigation Cross-border... Fiction Start-up Consulting mergers and acquisitions See 25+     See less Semiconductor Industry Corporate Law International Law Compliance Contract Negotiation Writing Creative Writing Acoustic Guitar Securities Law Recording Italian Securities Regulation Teaching Mergers and Acquisitions Start-ups Mergers Corporate Governance Joint Ventures Licensing Intellectual Property Patent Litigation Patents Mergers & Acquisitions Strategy Due Diligence Employment Law Negotiation Facilitated Training Business Acumen Management Training Privacy Law Trademarks Trade Secrets Venture Capital Litigation Cross-border... Fiction Start-up Consulting mergers and acquisitions See 25+     See less Education New York University School of Law J.D.,  Law 1996  – 1999 Activities and Societies:  Environmental Law Journal Brigham Young University B.A.,  Near Eastern Studies 1991  – 1996 New York University School of Law J.D.,  Law 1996  – 1999 Activities and Societies:  Environmental Law Journal New York University School of Law J.D.,  Law 1996  – 1999 Activities and Societies:  Environmental Law Journal New York University School of Law J.D.,  Law 1996  – 1999 Activities and Societies:  Environmental Law Journal Brigham Young University B.A.,  Near Eastern Studies 1991  – 1996 Brigham Young University B.A.,  Near Eastern Studies 1991  – 1996 Brigham Young University B.A.,  Near Eastern Studies 1991  – 1996 ", "Experience Senior Counsel Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Patent Attorney Wilson Sonsini Goodrich and Rosati July 2004  –  October 2014  (10 years 4 months) Austin, Texas Area Patent Attorney Baker Botts 1999  –  2004  (5 years) Austin, Texas Area Senior Counsel Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Senior Counsel Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Patent Attorney Wilson Sonsini Goodrich and Rosati July 2004  –  October 2014  (10 years 4 months) Austin, Texas Area Patent Attorney Wilson Sonsini Goodrich and Rosati July 2004  –  October 2014  (10 years 4 months) Austin, Texas Area Patent Attorney Baker Botts 1999  –  2004  (5 years) Austin, Texas Area Patent Attorney Baker Botts 1999  –  2004  (5 years) Austin, Texas Area Skills Patent Prosecution Civil Litigation Trade Secrets Patents Licensing Litigation Intellectual Property Legal Research Trademarks Copyright Law Corporate Law Real Estate Contract Negotiation Patent Litigation Trademark Infringement Due Diligence Legal Writing Commercial Litigation Corporate Governance See 4+     See less Skills  Patent Prosecution Civil Litigation Trade Secrets Patents Licensing Litigation Intellectual Property Legal Research Trademarks Copyright Law Corporate Law Real Estate Contract Negotiation Patent Litigation Trademark Infringement Due Diligence Legal Writing Commercial Litigation Corporate Governance See 4+     See less Patent Prosecution Civil Litigation Trade Secrets Patents Licensing Litigation Intellectual Property Legal Research Trademarks Copyright Law Corporate Law Real Estate Contract Negotiation Patent Litigation Trademark Infringement Due Diligence Legal Writing Commercial Litigation Corporate Governance See 4+     See less Patent Prosecution Civil Litigation Trade Secrets Patents Licensing Litigation Intellectual Property Legal Research Trademarks Copyright Law Corporate Law Real Estate Contract Negotiation Patent Litigation Trademark Infringement Due Diligence Legal Writing Commercial Litigation Corporate Governance See 4+     See less Education University of Houston Law Center J.D. 2000  – 2003 The University of Texas at Austin B.S.,  Electrical Engineering 1995  – 1997 B.S.E.E. Texas State University-San Marcos B.B.A.,  Finance 1989  – 1993 B.B.A. in Finance University of Houston Law Center J.D. 2000  – 2003 University of Houston Law Center J.D. 2000  – 2003 University of Houston Law Center J.D. 2000  – 2003 The University of Texas at Austin B.S.,  Electrical Engineering 1995  – 1997 B.S.E.E. The University of Texas at Austin B.S.,  Electrical Engineering 1995  – 1997 B.S.E.E. The University of Texas at Austin B.S.,  Electrical Engineering 1995  – 1997 B.S.E.E. Texas State University-San Marcos B.B.A.,  Finance 1989  – 1993 B.B.A. in Finance Texas State University-San Marcos B.B.A.,  Finance 1989  – 1993 B.B.A. in Finance Texas State University-San Marcos B.B.A.,  Finance 1989  – 1993 B.B.A. in Finance ", "Experience Associate General Counsel; Europe, Asia & International LyondellBasell August 2015  – Present (1 month) Rotterdam, The Netherlands Associate General Counsel; Employment, Pension & Benefits LyondellBasell March 2015  – Present (6 months) Houston, Texas Responsible for Employment, Pension & Benefits, a global legal practice group, and responsible for the Global Records & Information Management group. Lead Counsel, Employment, Pension & Benefits LyondellBasell September 2013  –  March 2015  (1 year 7 months) Houston, Texas Lead Counsel, Global Labor & Employment LyondellBasell August 2011  –  September 2013  (2 years 2 months) Houston, Texas Consultant Kim J. Dockstader, PLLC 2010  –  July 2011  (1 year) Senior Director, HR Legal & Compliance Counsel Numonyx B.V. (a former subsidiary of Intel Corporation) 2008  –  2010  (2 years) Senior Counsel Intel Corporation 2007  –  2008  (1 year) Senior Assistant General Counsel Micron Technology 2005  –  2007  (2 years) Partner Stoel Rives LLP 2000  –  2005  (5 years) Deputy General Counsel Micron Electronics, Inc. 1998  –  2000  (2 years) Associate Attorney Holland & Hart LLP 1990  –  1998  (8 years) Writer & Fundraising Coordinator Institute of Political Economy 1986  –  1987  (1 year) Undergraduate Teaching Assistant, Political Science Department Utah State University 1985  –  1986  (1 year) Research Analyst 99th Congress, U.S. House Republican Research Committee (Washington, D.C.) 1985  –  1985  (less than a year) Lobbyist Assistant, Utah Legislature Douglas S. Foxley, Government & Public Affairs 1984  –  1985  (1 year) Research Assistant, Political Science Department Utah State University 1982  –  1985  (3 years) Fundraiser, Development Office Utah State University 1983  –  1984  (1 year) Associate General Counsel; Europe, Asia & International LyondellBasell August 2015  – Present (1 month) Rotterdam, The Netherlands Associate General Counsel; Europe, Asia & International LyondellBasell August 2015  – Present (1 month) Rotterdam, The Netherlands Associate General Counsel; Employment, Pension & Benefits LyondellBasell March 2015  – Present (6 months) Houston, Texas Responsible for Employment, Pension & Benefits, a global legal practice group, and responsible for the Global Records & Information Management group. Associate General Counsel; Employment, Pension & Benefits LyondellBasell March 2015  – Present (6 months) Houston, Texas Responsible for Employment, Pension & Benefits, a global legal practice group, and responsible for the Global Records & Information Management group. Lead Counsel, Employment, Pension & Benefits LyondellBasell September 2013  –  March 2015  (1 year 7 months) Houston, Texas Lead Counsel, Employment, Pension & Benefits LyondellBasell September 2013  –  March 2015  (1 year 7 months) Houston, Texas Lead Counsel, Global Labor & Employment LyondellBasell August 2011  –  September 2013  (2 years 2 months) Houston, Texas Lead Counsel, Global Labor & Employment LyondellBasell August 2011  –  September 2013  (2 years 2 months) Houston, Texas Consultant Kim J. Dockstader, PLLC 2010  –  July 2011  (1 year) Consultant Kim J. Dockstader, PLLC 2010  –  July 2011  (1 year) Senior Director, HR Legal & Compliance Counsel Numonyx B.V. (a former subsidiary of Intel Corporation) 2008  –  2010  (2 years) Senior Director, HR Legal & Compliance Counsel Numonyx B.V. (a former subsidiary of Intel Corporation) 2008  –  2010  (2 years) Senior Counsel Intel Corporation 2007  –  2008  (1 year) Senior Counsel Intel Corporation 2007  –  2008  (1 year) Senior Assistant General Counsel Micron Technology 2005  –  2007  (2 years) Senior Assistant General Counsel Micron Technology 2005  –  2007  (2 years) Partner Stoel Rives LLP 2000  –  2005  (5 years) Partner Stoel Rives LLP 2000  –  2005  (5 years) Deputy General Counsel Micron Electronics, Inc. 1998  –  2000  (2 years) Deputy General Counsel Micron Electronics, Inc. 1998  –  2000  (2 years) Associate Attorney Holland & Hart LLP 1990  –  1998  (8 years) Associate Attorney Holland & Hart LLP 1990  –  1998  (8 years) Writer & Fundraising Coordinator Institute of Political Economy 1986  –  1987  (1 year) Writer & Fundraising Coordinator Institute of Political Economy 1986  –  1987  (1 year) Undergraduate Teaching Assistant, Political Science Department Utah State University 1985  –  1986  (1 year) Undergraduate Teaching Assistant, Political Science Department Utah State University 1985  –  1986  (1 year) Research Analyst 99th Congress, U.S. House Republican Research Committee (Washington, D.C.) 1985  –  1985  (less than a year) Research Analyst 99th Congress, U.S. House Republican Research Committee (Washington, D.C.) 1985  –  1985  (less than a year) Lobbyist Assistant, Utah Legislature Douglas S. Foxley, Government & Public Affairs 1984  –  1985  (1 year) Lobbyist Assistant, Utah Legislature Douglas S. Foxley, Government & Public Affairs 1984  –  1985  (1 year) Research Assistant, Political Science Department Utah State University 1982  –  1985  (3 years) Research Assistant, Political Science Department Utah State University 1982  –  1985  (3 years) Fundraiser, Development Office Utah State University 1983  –  1984  (1 year) Fundraiser, Development Office Utah State University 1983  –  1984  (1 year) Skills Employment Law Litigation HR Consulting Corporate Governance Corporate Law Intellectual Property Leadership Organization Persuasiveness Competitive Achieving Decisiveness General Legal Expertise Mergers & Acquisitions Employee Relations Creativity Strategy Legal Assistance Negotiation Risk Management Due Diligence Start-ups Management Civil Litigation Legal Compliance Joint Ventures Employee Benefits Commercial Litigation Human Resources Trade Secrets Labor Relations Legal Writing Legal Advice Competition Law Trademarks Arbitration Employment Contracts Deferred Compensation Employment Law... Patent Litigation Licensing Mediation Patents Class Actions Dispute Resolution Copyright Law FCPA Data Privacy Patent Prosecution Legal Issues See 35+     See less Skills  Employment Law Litigation HR Consulting Corporate Governance Corporate Law Intellectual Property Leadership Organization Persuasiveness Competitive Achieving Decisiveness General Legal Expertise Mergers & Acquisitions Employee Relations Creativity Strategy Legal Assistance Negotiation Risk Management Due Diligence Start-ups Management Civil Litigation Legal Compliance Joint Ventures Employee Benefits Commercial Litigation Human Resources Trade Secrets Labor Relations Legal Writing Legal Advice Competition Law Trademarks Arbitration Employment Contracts Deferred Compensation Employment Law... Patent Litigation Licensing Mediation Patents Class Actions Dispute Resolution Copyright Law FCPA Data Privacy Patent Prosecution Legal Issues See 35+     See less Employment Law Litigation HR Consulting Corporate Governance Corporate Law Intellectual Property Leadership Organization Persuasiveness Competitive Achieving Decisiveness General Legal Expertise Mergers & Acquisitions Employee Relations Creativity Strategy Legal Assistance Negotiation Risk Management Due Diligence Start-ups Management Civil Litigation Legal Compliance Joint Ventures Employee Benefits Commercial Litigation Human Resources Trade Secrets Labor Relations Legal Writing Legal Advice Competition Law Trademarks Arbitration Employment Contracts Deferred Compensation Employment Law... Patent Litigation Licensing Mediation Patents Class Actions Dispute Resolution Copyright Law FCPA Data Privacy Patent Prosecution Legal Issues See 35+     See less Employment Law Litigation HR Consulting Corporate Governance Corporate Law Intellectual Property Leadership Organization Persuasiveness Competitive Achieving Decisiveness General Legal Expertise Mergers & Acquisitions Employee Relations Creativity Strategy Legal Assistance Negotiation Risk Management Due Diligence Start-ups Management Civil Litigation Legal Compliance Joint Ventures Employee Benefits Commercial Litigation Human Resources Trade Secrets Labor Relations Legal Writing Legal Advice Competition Law Trademarks Arbitration Employment Contracts Deferred Compensation Employment Law... Patent Litigation Licensing Mediation Patents Class Actions Dispute Resolution Copyright Law FCPA Data Privacy Patent Prosecution Legal Issues See 35+     See less Education University of Utah S.J. Quinney College of Law J.D.,  Law 1987  – 1990 William H. Leary Scholar (Top 20%) \nExecutive Editor, Board of Editors, Utah Law Review 1989-1990 \nTeaching Assistant, First-year Writing Program, 1989-1990 \nStaff Writer, On The Merits, 1988-1990 \nStaff Editor, Utah Law Review, 1988-1990 Activities and Societies:  Utah Law Review; Teaching Assistant; On the Merits (monthly periodical) Utah State University B.S. (magna cum laude),  Pre-law major (emphasis in Political Science ,  History and Philosophy); Business Administration minor 1982  – 1987 Graduated in top 10% \nAnnual Recipient, John Welch Pre-law Scholarship, 1985-1986 \nAnnual Recipient, Outstanding Political Science Senior, 1985-1986 Activities and Societies:  Intercollegiate Debate Team; Phi Kappa Phi (Blue Key) Honor Society; Pi Sigma Alpha National Political Honor Society University of Utah S.J. Quinney College of Law J.D.,  Law 1987  – 1990 William H. Leary Scholar (Top 20%) \nExecutive Editor, Board of Editors, Utah Law Review 1989-1990 \nTeaching Assistant, First-year Writing Program, 1989-1990 \nStaff Writer, On The Merits, 1988-1990 \nStaff Editor, Utah Law Review, 1988-1990 Activities and Societies:  Utah Law Review; Teaching Assistant; On the Merits (monthly periodical) University of Utah S.J. Quinney College of Law J.D.,  Law 1987  – 1990 William H. Leary Scholar (Top 20%) \nExecutive Editor, Board of Editors, Utah Law Review 1989-1990 \nTeaching Assistant, First-year Writing Program, 1989-1990 \nStaff Writer, On The Merits, 1988-1990 \nStaff Editor, Utah Law Review, 1988-1990 Activities and Societies:  Utah Law Review; Teaching Assistant; On the Merits (monthly periodical) University of Utah S.J. Quinney College of Law J.D.,  Law 1987  – 1990 William H. Leary Scholar (Top 20%) \nExecutive Editor, Board of Editors, Utah Law Review 1989-1990 \nTeaching Assistant, First-year Writing Program, 1989-1990 \nStaff Writer, On The Merits, 1988-1990 \nStaff Editor, Utah Law Review, 1988-1990 Activities and Societies:  Utah Law Review; Teaching Assistant; On the Merits (monthly periodical) Utah State University B.S. (magna cum laude),  Pre-law major (emphasis in Political Science ,  History and Philosophy); Business Administration minor 1982  – 1987 Graduated in top 10% \nAnnual Recipient, John Welch Pre-law Scholarship, 1985-1986 \nAnnual Recipient, Outstanding Political Science Senior, 1985-1986 Activities and Societies:  Intercollegiate Debate Team; Phi Kappa Phi (Blue Key) Honor Society; Pi Sigma Alpha National Political Honor Society Utah State University B.S. (magna cum laude),  Pre-law major (emphasis in Political Science ,  History and Philosophy); Business Administration minor 1982  – 1987 Graduated in top 10% \nAnnual Recipient, John Welch Pre-law Scholarship, 1985-1986 \nAnnual Recipient, Outstanding Political Science Senior, 1985-1986 Activities and Societies:  Intercollegiate Debate Team; Phi Kappa Phi (Blue Key) Honor Society; Pi Sigma Alpha National Political Honor Society Utah State University B.S. (magna cum laude),  Pre-law major (emphasis in Political Science ,  History and Philosophy); Business Administration minor 1982  – 1987 Graduated in top 10% \nAnnual Recipient, John Welch Pre-law Scholarship, 1985-1986 \nAnnual Recipient, Outstanding Political Science Senior, 1985-1986 Activities and Societies:  Intercollegiate Debate Team; Phi Kappa Phi (Blue Key) Honor Society; Pi Sigma Alpha National Political Honor Society Honors & Awards Additional Honors & Awards Martindale-Hubbell, AV Rating (Preeminent, 5 out of 5) \nWho’s Who Legal USA \nChamber’s USA Guide to America’s Leading Business Lawyers Additional Honors & Awards Martindale-Hubbell, AV Rating (Preeminent, 5 out of 5) \nWho’s Who Legal USA \nChamber’s USA Guide to America’s Leading Business Lawyers Additional Honors & Awards Martindale-Hubbell, AV Rating (Preeminent, 5 out of 5) \nWho’s Who Legal USA \nChamber’s USA Guide to America’s Leading Business Lawyers Additional Honors & Awards Martindale-Hubbell, AV Rating (Preeminent, 5 out of 5) \nWho’s Who Legal USA \nChamber’s USA Guide to America’s Leading Business Lawyers ", "Skills Due Diligence Strategic Partnerships Mergers & Acquisitions Start-ups Venture Capital Business Strategy Private Equity Entrepreneurship Management Licensing Skills  Due Diligence Strategic Partnerships Mergers & Acquisitions Start-ups Venture Capital Business Strategy Private Equity Entrepreneurship Management Licensing Due Diligence Strategic Partnerships Mergers & Acquisitions Start-ups Venture Capital Business Strategy Private Equity Entrepreneurship Management Licensing Due Diligence Strategic Partnerships Mergers & Acquisitions Start-ups Venture Capital Business Strategy Private Equity Entrepreneurship Management Licensing ", "Skills Intellectual Property Trademarks Licensing Copyright Law Trademark Infringement Copyright Infringement Trade Secrets Prosecution Unfair Competition Domain Names Litigation Patents Privacy Law Cyberlaw Patent Litigation Legal Writing Corporate Law See 2+     See less Skills  Intellectual Property Trademarks Licensing Copyright Law Trademark Infringement Copyright Infringement Trade Secrets Prosecution Unfair Competition Domain Names Litigation Patents Privacy Law Cyberlaw Patent Litigation Legal Writing Corporate Law See 2+     See less Intellectual Property Trademarks Licensing Copyright Law Trademark Infringement Copyright Infringement Trade Secrets Prosecution Unfair Competition Domain Names Litigation Patents Privacy Law Cyberlaw Patent Litigation Legal Writing Corporate Law See 2+     See less Intellectual Property Trademarks Licensing Copyright Law Trademark Infringement Copyright Infringement Trade Secrets Prosecution Unfair Competition Domain Names Litigation Patents Privacy Law Cyberlaw Patent Litigation Legal Writing Corporate Law See 2+     See less ", "Summary Highly successful, multi-dimensional executive with over 20 years combined experience in corporate legal, compliance, business development, investor relations and marketing, including in-house and in private law practice counseling large multinational corporations. Member, California, Florida and Pennsylvania Bar Associations. Summary Highly successful, multi-dimensional executive with over 20 years combined experience in corporate legal, compliance, business development, investor relations and marketing, including in-house and in private law practice counseling large multinational corporations. Member, California, Florida and Pennsylvania Bar Associations. Highly successful, multi-dimensional executive with over 20 years combined experience in corporate legal, compliance, business development, investor relations and marketing, including in-house and in private law practice counseling large multinational corporations. Member, California, Florida and Pennsylvania Bar Associations. Highly successful, multi-dimensional executive with over 20 years combined experience in corporate legal, compliance, business development, investor relations and marketing, including in-house and in private law practice counseling large multinational corporations. Member, California, Florida and Pennsylvania Bar Associations. Experience Associate General Counsel & Global Director, Legal Compliance Intel Corporation 2008  –  2010  (2 years) Santa Clara, CA Became Intel’s first full time attorney dedicated to worldwide legal compliance and established the legal department’s global compliance and investigations teams. Created processes, training and budget for the department's overall legal compliance function, including legal risk assessments. Assistant Treasurer & Global Director Marketing & Portfolio Business Development Intel Capital 2006  –  2007  (1 year) Santa Clara, CA Led world-wide team responsible for Intel Capital events, portfolio business development, press relations, marketing, and mergers and acquisitions integration. Managed an organization with over 30 employees and a multi-million dollar budget. Assistant Treasurer & Global Director, Investor Relations Intel Corporation 1997  –  2001  (4 years) Santa Clara, CA Managed all buy side, sell side and retail programs, corporate messaging and events worldwide, including earnings releases, conference calls, analysts' meetings, annual stockholders' meetings, and annual report. Represented Intel on the NASDAQ Stock Market Issuer Affairs Committee. Senior Counsel Intel Corporation 1991  –  1997  (6 years) Santa Clara, CA Managed corporate legal staff and all corporate legal matters including BOD support, SEC filings and disclosures, complex securities transactions, and legal support for Treasury, M&A and Benefits. Associate General Counsel & Global Director, Legal Compliance Intel Corporation 2008  –  2010  (2 years) Santa Clara, CA Became Intel’s first full time attorney dedicated to worldwide legal compliance and established the legal department’s global compliance and investigations teams. Created processes, training and budget for the department's overall legal compliance function, including legal risk assessments. Associate General Counsel & Global Director, Legal Compliance Intel Corporation 2008  –  2010  (2 years) Santa Clara, CA Became Intel’s first full time attorney dedicated to worldwide legal compliance and established the legal department’s global compliance and investigations teams. Created processes, training and budget for the department's overall legal compliance function, including legal risk assessments. Assistant Treasurer & Global Director Marketing & Portfolio Business Development Intel Capital 2006  –  2007  (1 year) Santa Clara, CA Led world-wide team responsible for Intel Capital events, portfolio business development, press relations, marketing, and mergers and acquisitions integration. Managed an organization with over 30 employees and a multi-million dollar budget. Assistant Treasurer & Global Director Marketing & Portfolio Business Development Intel Capital 2006  –  2007  (1 year) Santa Clara, CA Led world-wide team responsible for Intel Capital events, portfolio business development, press relations, marketing, and mergers and acquisitions integration. Managed an organization with over 30 employees and a multi-million dollar budget. Assistant Treasurer & Global Director, Investor Relations Intel Corporation 1997  –  2001  (4 years) Santa Clara, CA Managed all buy side, sell side and retail programs, corporate messaging and events worldwide, including earnings releases, conference calls, analysts' meetings, annual stockholders' meetings, and annual report. Represented Intel on the NASDAQ Stock Market Issuer Affairs Committee. Assistant Treasurer & Global Director, Investor Relations Intel Corporation 1997  –  2001  (4 years) Santa Clara, CA Managed all buy side, sell side and retail programs, corporate messaging and events worldwide, including earnings releases, conference calls, analysts' meetings, annual stockholders' meetings, and annual report. Represented Intel on the NASDAQ Stock Market Issuer Affairs Committee. Senior Counsel Intel Corporation 1991  –  1997  (6 years) Santa Clara, CA Managed corporate legal staff and all corporate legal matters including BOD support, SEC filings and disclosures, complex securities transactions, and legal support for Treasury, M&A and Benefits. Senior Counsel Intel Corporation 1991  –  1997  (6 years) Santa Clara, CA Managed corporate legal staff and all corporate legal matters including BOD support, SEC filings and disclosures, complex securities transactions, and legal support for Treasury, M&A and Benefits. Skills Event Management Microsoft Word Start-ups Due Diligence Public Relations Microsoft Excel Mergers & Acquisitions Business Development Microsoft Office Skills  Event Management Microsoft Word Start-ups Due Diligence Public Relations Microsoft Excel Mergers & Acquisitions Business Development Microsoft Office Event Management Microsoft Word Start-ups Due Diligence Public Relations Microsoft Excel Mergers & Acquisitions Business Development Microsoft Office Event Management Microsoft Word Start-ups Due Diligence Public Relations Microsoft Excel Mergers & Acquisitions Business Development Microsoft Office Education Duke University School of Law Juris Doctor (J.D.) Lehigh University - College of Business and Economics Bachelor's Degree,  Accounting Duke University School of Law Juris Doctor (J.D.) Duke University School of Law Juris Doctor (J.D.) Duke University School of Law Juris Doctor (J.D.) Lehigh University - College of Business and Economics Bachelor's Degree,  Accounting Lehigh University - College of Business and Economics Bachelor's Degree,  Accounting Lehigh University - College of Business and Economics Bachelor's Degree,  Accounting ", "Experience Director, Cybersecurity Policy and Government Relations and Managing Counsel Intel Corporation January 2014  – Present (1 year 8 months) Washington D.C. Metro Area Co-Chair, Cybersecurity Committee Information Technology Industry Council January 2014  – Present (1 year 8 months) Washington, DC Chair Information Technology Sector Coordinating Council April 2015  – Present (5 months) Washington D.C. Metro Area Director, Cybersecurity Policy and Government Relations and Managing Counsel Intel Corporation January 2014  – Present (1 year 8 months) Washington D.C. Metro Area Director, Cybersecurity Policy and Government Relations and Managing Counsel Intel Corporation January 2014  – Present (1 year 8 months) Washington D.C. Metro Area Co-Chair, Cybersecurity Committee Information Technology Industry Council January 2014  – Present (1 year 8 months) Washington, DC Co-Chair, Cybersecurity Committee Information Technology Industry Council January 2014  – Present (1 year 8 months) Washington, DC Chair Information Technology Sector Coordinating Council April 2015  – Present (5 months) Washington D.C. Metro Area Chair Information Technology Sector Coordinating Council April 2015  – Present (5 months) Washington D.C. Metro Area Skills Cyber-security Security Policy Information Security Privacy Law Policy Legislative Relations Public Policy Security Policy Analysis Legislative Affairs Information Assurance Federal Government Information Technology Data Privacy Intellectual Property Privacy Regulations Critical Infrastructure... Computer Security Information Sharing Legislation Cyberspace Law Litigation Legal Compliance Government Homeland Security National Security Legal Writing Strategic Communications Corporate Governance Cyberlaw Mergers & Acquisitions Corporate Law Policy Writing Lobbying Governmental Affairs Strategic Thinking Writing Program Management Government Contracting Government Procurement privacy Competition Law Strategy Constitutional Law White Collar Criminal... Securities Litigation Securities Fraud High Performance... See 33+     See less Skills  Cyber-security Security Policy Information Security Privacy Law Policy Legislative Relations Public Policy Security Policy Analysis Legislative Affairs Information Assurance Federal Government Information Technology Data Privacy Intellectual Property Privacy Regulations Critical Infrastructure... Computer Security Information Sharing Legislation Cyberspace Law Litigation Legal Compliance Government Homeland Security National Security Legal Writing Strategic Communications Corporate Governance Cyberlaw Mergers & Acquisitions Corporate Law Policy Writing Lobbying Governmental Affairs Strategic Thinking Writing Program Management Government Contracting Government Procurement privacy Competition Law Strategy Constitutional Law White Collar Criminal... Securities Litigation Securities Fraud High Performance... See 33+     See less Cyber-security Security Policy Information Security Privacy Law Policy Legislative Relations Public Policy Security Policy Analysis Legislative Affairs Information Assurance Federal Government Information Technology Data Privacy Intellectual Property Privacy Regulations Critical Infrastructure... Computer Security Information Sharing Legislation Cyberspace Law Litigation Legal Compliance Government Homeland Security National Security Legal Writing Strategic Communications Corporate Governance Cyberlaw Mergers & Acquisitions Corporate Law Policy Writing Lobbying Governmental Affairs Strategic Thinking Writing Program Management Government Contracting Government Procurement privacy Competition Law Strategy Constitutional Law White Collar Criminal... Securities Litigation Securities Fraud High Performance... See 33+     See less Cyber-security Security Policy Information Security Privacy Law Policy Legislative Relations Public Policy Security Policy Analysis Legislative Affairs Information Assurance Federal Government Information Technology Data Privacy Intellectual Property Privacy Regulations Critical Infrastructure... Computer Security Information Sharing Legislation Cyberspace Law Litigation Legal Compliance Government Homeland Security National Security Legal Writing Strategic Communications Corporate Governance Cyberlaw Mergers & Acquisitions Corporate Law Policy Writing Lobbying Governmental Affairs Strategic Thinking Writing Program Management Government Contracting Government Procurement privacy Competition Law Strategy Constitutional Law White Collar Criminal... Securities Litigation Securities Fraud High Performance... See 33+     See less ", "Experience Associate Director Intel Corporation November 2014  – Present (10 months) Folsom, California Senior Counsel Intel Corporation February 2012  –  November 2013  (1 year 10 months) Folsom, California Group counsel for mobile and communications businesses. Senior Attorney Intel Corporation February 2008  –  February 2012  (4 years 1 month) Folsom, California Lead attorney for embedded and communications businesses, microprocessor & chipset development teams and SOC development teams. Attorney Intel Corporation June 2005  –  February 2008  (2 years 9 months) Folsom, California Primary attorney for engineering and product development organizations. Associate Cooley Godward Kronish LLP 2000  –  2003  (3 years) Associate Director Intel Corporation November 2014  – Present (10 months) Folsom, California Associate Director Intel Corporation November 2014  – Present (10 months) Folsom, California Senior Counsel Intel Corporation February 2012  –  November 2013  (1 year 10 months) Folsom, California Group counsel for mobile and communications businesses. Senior Counsel Intel Corporation February 2012  –  November 2013  (1 year 10 months) Folsom, California Group counsel for mobile and communications businesses. Senior Attorney Intel Corporation February 2008  –  February 2012  (4 years 1 month) Folsom, California Lead attorney for embedded and communications businesses, microprocessor & chipset development teams and SOC development teams. Senior Attorney Intel Corporation February 2008  –  February 2012  (4 years 1 month) Folsom, California Lead attorney for embedded and communications businesses, microprocessor & chipset development teams and SOC development teams. Attorney Intel Corporation June 2005  –  February 2008  (2 years 9 months) Folsom, California Primary attorney for engineering and product development organizations. Attorney Intel Corporation June 2005  –  February 2008  (2 years 9 months) Folsom, California Primary attorney for engineering and product development organizations. Associate Cooley Godward Kronish LLP 2000  –  2003  (3 years) Associate Cooley Godward Kronish LLP 2000  –  2003  (3 years) Skills Corporate Law Intellectual Property Venture Financing Contract Negotiation Software Licensing Licensing Mergers Corporate Governance Mergers & Acquisitions Joint Ventures Trade Secrets Patents Privacy Law Skills  Corporate Law Intellectual Property Venture Financing Contract Negotiation Software Licensing Licensing Mergers Corporate Governance Mergers & Acquisitions Joint Ventures Trade Secrets Patents Privacy Law Corporate Law Intellectual Property Venture Financing Contract Negotiation Software Licensing Licensing Mergers Corporate Governance Mergers & Acquisitions Joint Ventures Trade Secrets Patents Privacy Law Corporate Law Intellectual Property Venture Financing Contract Negotiation Software Licensing Licensing Mergers Corporate Governance Mergers & Acquisitions Joint Ventures Trade Secrets Patents Privacy Law Education Boston University School of Law JD 1996  – 1999 UCLA BA,  Political Science - International Studies 1991  – 1994 Boston University School of Law JD 1996  – 1999 Boston University School of Law JD 1996  – 1999 Boston University School of Law JD 1996  – 1999 UCLA BA,  Political Science - International Studies 1991  – 1994 UCLA BA,  Political Science - International Studies 1991  – 1994 UCLA BA,  Political Science - International Studies 1991  – 1994 ", "Skills Licensing Intellectual Property Mergers & Acquisitions Patents Patent Litigation Litigation Software Licensing Joint Ventures Privacy Law Contract Negotiation Commercial Litigation Corporate Law Copyright Law Due Diligence Corporate Governance Patent Prosecution Venture Capital Trade Secrets SaaS Cloud Computing Regulatory Compliance Business Alliances Professional Services Strategic Partnerships See 9+     See less Skills  Licensing Intellectual Property Mergers & Acquisitions Patents Patent Litigation Litigation Software Licensing Joint Ventures Privacy Law Contract Negotiation Commercial Litigation Corporate Law Copyright Law Due Diligence Corporate Governance Patent Prosecution Venture Capital Trade Secrets SaaS Cloud Computing Regulatory Compliance Business Alliances Professional Services Strategic Partnerships See 9+     See less Licensing Intellectual Property Mergers & Acquisitions Patents Patent Litigation Litigation Software Licensing Joint Ventures Privacy Law Contract Negotiation Commercial Litigation Corporate Law Copyright Law Due Diligence Corporate Governance Patent Prosecution Venture Capital Trade Secrets SaaS Cloud Computing Regulatory Compliance Business Alliances Professional Services Strategic Partnerships See 9+     See less Licensing Intellectual Property Mergers & Acquisitions Patents Patent Litigation Litigation Software Licensing Joint Ventures Privacy Law Contract Negotiation Commercial Litigation Corporate Law Copyright Law Due Diligence Corporate Governance Patent Prosecution Venture Capital Trade Secrets SaaS Cloud Computing Regulatory Compliance Business Alliances Professional Services Strategic Partnerships See 9+     See less ", "Summary Over 20 years intellectual property experience, partner in three law firms, 8 years in house. Now specializing in patent prosecution and related matters, including portfolio strategy, opinion letters, due diligence, patent licensing and litigation support. Specialties:Patent, intellectual property, litigation, licensing, commercial Summary Over 20 years intellectual property experience, partner in three law firms, 8 years in house. Now specializing in patent prosecution and related matters, including portfolio strategy, opinion letters, due diligence, patent licensing and litigation support. Specialties:Patent, intellectual property, litigation, licensing, commercial Over 20 years intellectual property experience, partner in three law firms, 8 years in house. Now specializing in patent prosecution and related matters, including portfolio strategy, opinion letters, due diligence, patent licensing and litigation support. Specialties:Patent, intellectual property, litigation, licensing, commercial Over 20 years intellectual property experience, partner in three law firms, 8 years in house. Now specializing in patent prosecution and related matters, including portfolio strategy, opinion letters, due diligence, patent licensing and litigation support. Specialties:Patent, intellectual property, litigation, licensing, commercial Experience Patent Law Partner Gard & Kaslow LLP July 2008  – Present (7 years 2 months) Patent practice, including preparation and prosecution of patent applications, strategy and counseling, analysis, non-infringement and invalidity opinions, due diligence, pre-litigation and litigation support. Of Counsel Carr & Ferrell January 2005  –  June 2008  (3 years 6 months) Patent practice Director Private companies 2001  –  2005  (4 years) Director, Intellectual Property and Licensing, Kineto Wireless \nDirector, Legal Affairs, Nova Crystals \nDirector, Intellectual Property, FlexICs Associate General Counsel, Intellectual Property JDS Uniphase 1999  –  2001  (2 years) Director of Intellectual Property Cadence Design Systems 1997  –  1999  (2 years) Senior Counsel Intel Corporation 1996  –  1997  (1 year) Partner Fenwick & West 1991  –  1996  (5 years) Partner Limbach, Limbach & Sutton 1985  –  1991  (6 years) Patent Law Partner Gard & Kaslow LLP July 2008  – Present (7 years 2 months) Patent practice, including preparation and prosecution of patent applications, strategy and counseling, analysis, non-infringement and invalidity opinions, due diligence, pre-litigation and litigation support. Patent Law Partner Gard & Kaslow LLP July 2008  – Present (7 years 2 months) Patent practice, including preparation and prosecution of patent applications, strategy and counseling, analysis, non-infringement and invalidity opinions, due diligence, pre-litigation and litigation support. Of Counsel Carr & Ferrell January 2005  –  June 2008  (3 years 6 months) Patent practice Of Counsel Carr & Ferrell January 2005  –  June 2008  (3 years 6 months) Patent practice Director Private companies 2001  –  2005  (4 years) Director, Intellectual Property and Licensing, Kineto Wireless \nDirector, Legal Affairs, Nova Crystals \nDirector, Intellectual Property, FlexICs Director Private companies 2001  –  2005  (4 years) Director, Intellectual Property and Licensing, Kineto Wireless \nDirector, Legal Affairs, Nova Crystals \nDirector, Intellectual Property, FlexICs Associate General Counsel, Intellectual Property JDS Uniphase 1999  –  2001  (2 years) Associate General Counsel, Intellectual Property JDS Uniphase 1999  –  2001  (2 years) Director of Intellectual Property Cadence Design Systems 1997  –  1999  (2 years) Director of Intellectual Property Cadence Design Systems 1997  –  1999  (2 years) Senior Counsel Intel Corporation 1996  –  1997  (1 year) Senior Counsel Intel Corporation 1996  –  1997  (1 year) Partner Fenwick & West 1991  –  1996  (5 years) Partner Fenwick & West 1991  –  1996  (5 years) Partner Limbach, Limbach & Sutton 1985  –  1991  (6 years) Partner Limbach, Limbach & Sutton 1985  –  1991  (6 years) Skills Patents Patent Prosecution Intellectual Property Patentability Patent Applications Patent Drafting Patent preparation Licensing Patent Portfolio... Patent Analysis Patent Strategy Business Methods Software Patents Skills  Patents Patent Prosecution Intellectual Property Patentability Patent Applications Patent Drafting Patent preparation Licensing Patent Portfolio... Patent Analysis Patent Strategy Business Methods Software Patents Patents Patent Prosecution Intellectual Property Patentability Patent Applications Patent Drafting Patent preparation Licensing Patent Portfolio... Patent Analysis Patent Strategy Business Methods Software Patents Patents Patent Prosecution Intellectual Property Patentability Patent Applications Patent Drafting Patent preparation Licensing Patent Portfolio... Patent Analysis Patent Strategy Business Methods Software Patents Education Massachusetts Institute of Technology SBEE,  Electrical Engineering Stanford Law School JD,  Law Massachusetts Institute of Technology SBEE,  Electrical Engineering Massachusetts Institute of Technology SBEE,  Electrical Engineering Massachusetts Institute of Technology SBEE,  Electrical Engineering Stanford Law School JD,  Law Stanford Law School JD,  Law Stanford Law School JD,  Law ", "Summary Legal and commercial advice on Cloud services, Openstack, software product and solution development and go-to-market, electronic marketplaces, data center and Cloud infrastructure, network and data center virtualization, and strategic alliances. Primary substantive expertise in licensing, standards, data security and privacy, general intellectual property issues, contract simplification, open source, in-bound agreements, direct and channel customer agreements, and international commercial law issues. Summary Legal and commercial advice on Cloud services, Openstack, software product and solution development and go-to-market, electronic marketplaces, data center and Cloud infrastructure, network and data center virtualization, and strategic alliances. Primary substantive expertise in licensing, standards, data security and privacy, general intellectual property issues, contract simplification, open source, in-bound agreements, direct and channel customer agreements, and international commercial law issues. Legal and commercial advice on Cloud services, Openstack, software product and solution development and go-to-market, electronic marketplaces, data center and Cloud infrastructure, network and data center virtualization, and strategic alliances. Primary substantive expertise in licensing, standards, data security and privacy, general intellectual property issues, contract simplification, open source, in-bound agreements, direct and channel customer agreements, and international commercial law issues. Legal and commercial advice on Cloud services, Openstack, software product and solution development and go-to-market, electronic marketplaces, data center and Cloud infrastructure, network and data center virtualization, and strategic alliances. Primary substantive expertise in licensing, standards, data security and privacy, general intellectual property issues, contract simplification, open source, in-bound agreements, direct and channel customer agreements, and international commercial law issues. Experience Director, Legal Services Cisco Systems, Inc. 2006  – Present (9 years) San Jose, California Senior Counsel Intel Corporation February 2000  –  December 2005  (5 years 11 months) Santa Clara, California Director, Legal Services Cisco Systems, Inc. 2006  – Present (9 years) San Jose, California Director, Legal Services Cisco Systems, Inc. 2006  – Present (9 years) San Jose, California Senior Counsel Intel Corporation February 2000  –  December 2005  (5 years 11 months) Santa Clara, California Senior Counsel Intel Corporation February 2000  –  December 2005  (5 years 11 months) Santa Clara, California Languages English English English Skills Corporate Law Privacy Law Software Licensing Virtualization Intellectual Property Mergers & Acquisitions Licensing Data Privacy Data Center Cloud Computing Strategic Partnerships SaaS Contract Negotiation Skills  Corporate Law Privacy Law Software Licensing Virtualization Intellectual Property Mergers & Acquisitions Licensing Data Privacy Data Center Cloud Computing Strategic Partnerships SaaS Contract Negotiation Corporate Law Privacy Law Software Licensing Virtualization Intellectual Property Mergers & Acquisitions Licensing Data Privacy Data Center Cloud Computing Strategic Partnerships SaaS Contract Negotiation Corporate Law Privacy Law Software Licensing Virtualization Intellectual Property Mergers & Acquisitions Licensing Data Privacy Data Center Cloud Computing Strategic Partnerships SaaS Contract Negotiation Education University of California, Los Angeles - School of Law J.D.,  Law 1988  – 1991 Stanford University B.A.,  East Asian Studies ,  Economics 1979  – 1983 Activities and Societies:  Hawaiian Club ,  Okada Tea House volunteer ,  intramural basketball ,  tennis and ping pong ,  study abroad in Taipei ,  Taiwan (Mandarin language) University of California, Los Angeles - School of Law J.D.,  Law 1988  – 1991 University of California, Los Angeles - School of Law J.D.,  Law 1988  – 1991 University of California, Los Angeles - School of Law J.D.,  Law 1988  – 1991 Stanford University B.A.,  East Asian Studies ,  Economics 1979  – 1983 Activities and Societies:  Hawaiian Club ,  Okada Tea House volunteer ,  intramural basketball ,  tennis and ping pong ,  study abroad in Taipei ,  Taiwan (Mandarin language) Stanford University B.A.,  East Asian Studies ,  Economics 1979  – 1983 Activities and Societies:  Hawaiian Club ,  Okada Tea House volunteer ,  intramural basketball ,  tennis and ping pong ,  study abroad in Taipei ,  Taiwan (Mandarin language) Stanford University B.A.,  East Asian Studies ,  Economics 1979  – 1983 Activities and Societies:  Hawaiian Club ,  Okada Tea House volunteer ,  intramural basketball ,  tennis and ping pong ,  study abroad in Taipei ,  Taiwan (Mandarin language) "]}