{"position": "Senior Hardware Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Hardware Engineer Intel Corporation January 2005  – Present (10 years 8 months) Ling successfully taped out, and brought up various boards for a given platform.  \n-Define initial board specification to meet overall system requirement, including the knowledge of various subsystems, like video (Display Port), processor, memory, and storage.  \n-Use Cadence or Orcad Schematics capture tool to create board circuit diagram.  \n-Lead Physical Designer to use Allegro layout tool to conduct floor planning on the board, routing study for the buses, define power delivery strategy, as well as the board stack up.  \n-Write the RTL code to control the board reset sequence.  \n-Come up with Test plan to lead the technician to validate the features on the board. \n-Actively working with China board vendors to ensure the board production meeting schedule. \n \nLing managed to build good relationship with Intel silicon external customers to come up with next generation server platform prototype in the OEM innovation center.  \n-Define one single converge architecture solution to meet the entire server OEM vendor requirement, and build the reference design to demonstrate the silicon with lowest BOM cost. \n-Working with the internal silicon team to define the system power up sequence and different active power states to achieve the high performance with minimum power consumption. \n-Actively working on various customer platform failures, by leading the technician to reproduce the customer failure on the internal validation vehicle, debug the cause, and come up with the solution to resolve the issue with highest priority.  \n-Develop detailed prototype hardware development cycle schedule; also coordinate with the internal silicon team in each of the working milestone. Field Application Engineer (Dell Account) Mitac November 2002  –  January 2004  (1 year 3 months) Ling managed with Dell Supplier Quality Management team, it serves as the focal point to discuss and resolve any issues that Dell wants to see the improvement on. The responsibilities including: \n \n-Prepare daily failure execution report for both management teams, in this way; they can quickly come up with a compromising solution that enables better yielding for delivering any desktop systems.  \n-Negotiate the validation flow, manufacturing flow, quality verification flow methodologies to improve the process of collaboration between Mitac ODM and DELL.  \n-Provide appropriate volume projection rate to Mitac based on the current weeks DELL’s manufacturing capacity demand, as well as future seasonal demand adjusting factor from the macro environment in the United States, this enables the quick turnaround for DELL, and reasonable inventory control for Mitac.  \n-Ling worked closely with DELL Test Engineer to root cause the defect motherboard by doing thorough failure analysis on different components on the board. These analyses helps to determine with either software fix, or need to take further investigation with different component vendors on possible stepping fix.  \n-During my almost two years stay, our on-site FAE support has been granted consistent quality delivery by Dell. As a result, Dell has expanded Mitac’s presence on several DELL desktop platform roadmaps. Senior Hardware Engineer Intel Corporation January 2005  – Present (10 years 8 months) Ling successfully taped out, and brought up various boards for a given platform.  \n-Define initial board specification to meet overall system requirement, including the knowledge of various subsystems, like video (Display Port), processor, memory, and storage.  \n-Use Cadence or Orcad Schematics capture tool to create board circuit diagram.  \n-Lead Physical Designer to use Allegro layout tool to conduct floor planning on the board, routing study for the buses, define power delivery strategy, as well as the board stack up.  \n-Write the RTL code to control the board reset sequence.  \n-Come up with Test plan to lead the technician to validate the features on the board. \n-Actively working with China board vendors to ensure the board production meeting schedule. \n \nLing managed to build good relationship with Intel silicon external customers to come up with next generation server platform prototype in the OEM innovation center.  \n-Define one single converge architecture solution to meet the entire server OEM vendor requirement, and build the reference design to demonstrate the silicon with lowest BOM cost. \n-Working with the internal silicon team to define the system power up sequence and different active power states to achieve the high performance with minimum power consumption. \n-Actively working on various customer platform failures, by leading the technician to reproduce the customer failure on the internal validation vehicle, debug the cause, and come up with the solution to resolve the issue with highest priority.  \n-Develop detailed prototype hardware development cycle schedule; also coordinate with the internal silicon team in each of the working milestone. Senior Hardware Engineer Intel Corporation January 2005  – Present (10 years 8 months) Ling successfully taped out, and brought up various boards for a given platform.  \n-Define initial board specification to meet overall system requirement, including the knowledge of various subsystems, like video (Display Port), processor, memory, and storage.  \n-Use Cadence or Orcad Schematics capture tool to create board circuit diagram.  \n-Lead Physical Designer to use Allegro layout tool to conduct floor planning on the board, routing study for the buses, define power delivery strategy, as well as the board stack up.  \n-Write the RTL code to control the board reset sequence.  \n-Come up with Test plan to lead the technician to validate the features on the board. \n-Actively working with China board vendors to ensure the board production meeting schedule. \n \nLing managed to build good relationship with Intel silicon external customers to come up with next generation server platform prototype in the OEM innovation center.  \n-Define one single converge architecture solution to meet the entire server OEM vendor requirement, and build the reference design to demonstrate the silicon with lowest BOM cost. \n-Working with the internal silicon team to define the system power up sequence and different active power states to achieve the high performance with minimum power consumption. \n-Actively working on various customer platform failures, by leading the technician to reproduce the customer failure on the internal validation vehicle, debug the cause, and come up with the solution to resolve the issue with highest priority.  \n-Develop detailed prototype hardware development cycle schedule; also coordinate with the internal silicon team in each of the working milestone. Field Application Engineer (Dell Account) Mitac November 2002  –  January 2004  (1 year 3 months) Ling managed with Dell Supplier Quality Management team, it serves as the focal point to discuss and resolve any issues that Dell wants to see the improvement on. The responsibilities including: \n \n-Prepare daily failure execution report for both management teams, in this way; they can quickly come up with a compromising solution that enables better yielding for delivering any desktop systems.  \n-Negotiate the validation flow, manufacturing flow, quality verification flow methodologies to improve the process of collaboration between Mitac ODM and DELL.  \n-Provide appropriate volume projection rate to Mitac based on the current weeks DELL’s manufacturing capacity demand, as well as future seasonal demand adjusting factor from the macro environment in the United States, this enables the quick turnaround for DELL, and reasonable inventory control for Mitac.  \n-Ling worked closely with DELL Test Engineer to root cause the defect motherboard by doing thorough failure analysis on different components on the board. These analyses helps to determine with either software fix, or need to take further investigation with different component vendors on possible stepping fix.  \n-During my almost two years stay, our on-site FAE support has been granted consistent quality delivery by Dell. As a result, Dell has expanded Mitac’s presence on several DELL desktop platform roadmaps. Field Application Engineer (Dell Account) Mitac November 2002  –  January 2004  (1 year 3 months) Ling managed with Dell Supplier Quality Management team, it serves as the focal point to discuss and resolve any issues that Dell wants to see the improvement on. The responsibilities including: \n \n-Prepare daily failure execution report for both management teams, in this way; they can quickly come up with a compromising solution that enables better yielding for delivering any desktop systems.  \n-Negotiate the validation flow, manufacturing flow, quality verification flow methodologies to improve the process of collaboration between Mitac ODM and DELL.  \n-Provide appropriate volume projection rate to Mitac based on the current weeks DELL’s manufacturing capacity demand, as well as future seasonal demand adjusting factor from the macro environment in the United States, this enables the quick turnaround for DELL, and reasonable inventory control for Mitac.  \n-Ling worked closely with DELL Test Engineer to root cause the defect motherboard by doing thorough failure analysis on different components on the board. These analyses helps to determine with either software fix, or need to take further investigation with different component vendors on possible stepping fix.  \n-During my almost two years stay, our on-site FAE support has been granted consistent quality delivery by Dell. As a result, Dell has expanded Mitac’s presence on several DELL desktop platform roadmaps. Education UC Davis Bachelor of Applied Science (BASc),  Electrical Engineering Technologies/Technicians 1999  – 2004 UC Davis Bachelor of Applied Science (BASc),  Electrical Engineering Technologies/Technicians 1999  – 2004 UC Davis Bachelor of Applied Science (BASc),  Electrical Engineering Technologies/Technicians 1999  – 2004 UC Davis Bachelor of Applied Science (BASc),  Electrical Engineering Technologies/Technicians 1999  – 2004 ", "Summary Analog, digital, and mixed signal design for embedded systems. \nAssembly language firmware design, development, and debug. \nCustom very high speed digital integrated circuit design. \n64-bit microprocessor circuit design. \nMicrochip microcontrollers. Summary Analog, digital, and mixed signal design for embedded systems. \nAssembly language firmware design, development, and debug. \nCustom very high speed digital integrated circuit design. \n64-bit microprocessor circuit design. \nMicrochip microcontrollers. Analog, digital, and mixed signal design for embedded systems. \nAssembly language firmware design, development, and debug. \nCustom very high speed digital integrated circuit design. \n64-bit microprocessor circuit design. \nMicrochip microcontrollers. Analog, digital, and mixed signal design for embedded systems. \nAssembly language firmware design, development, and debug. \nCustom very high speed digital integrated circuit design. \n64-bit microprocessor circuit design. \nMicrochip microcontrollers. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency Italian Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency Italian Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency Italian Elementary proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills CMOS Semiconductors Microprocessors Electrical Engineering Analog Circuit Design Mixed Signal Firmware Assembly Language Microcontrollers Embedded Systems SMPS Power Electronics I2C SPI RS232 Embedded Software Microchip PIC Electronics Hardware... Digital Circuit Design Integrated Circuit... RS485 DC-DC Real-Time Debugging Circuit Design PCB design Analog Processors Electronics PCB Design See 15+     See less Skills  CMOS Semiconductors Microprocessors Electrical Engineering Analog Circuit Design Mixed Signal Firmware Assembly Language Microcontrollers Embedded Systems SMPS Power Electronics I2C SPI RS232 Embedded Software Microchip PIC Electronics Hardware... Digital Circuit Design Integrated Circuit... RS485 DC-DC Real-Time Debugging Circuit Design PCB design Analog Processors Electronics PCB Design See 15+     See less CMOS Semiconductors Microprocessors Electrical Engineering Analog Circuit Design Mixed Signal Firmware Assembly Language Microcontrollers Embedded Systems SMPS Power Electronics I2C SPI RS232 Embedded Software Microchip PIC Electronics Hardware... Digital Circuit Design Integrated Circuit... RS485 DC-DC Real-Time Debugging Circuit Design PCB design Analog Processors Electronics PCB Design See 15+     See less CMOS Semiconductors Microprocessors Electrical Engineering Analog Circuit Design Mixed Signal Firmware Assembly Language Microcontrollers Embedded Systems SMPS Power Electronics I2C SPI RS232 Embedded Software Microchip PIC Electronics Hardware... Digital Circuit Design Integrated Circuit... RS485 DC-DC Real-Time Debugging Circuit Design PCB design Analog Processors Electronics PCB Design See 15+     See less Education Cornell University M.Eng.,  Electrical Engineering 1994  – 1996 Engineering Management minor. Instituto Tecnológico y de Estudios Superiores de Monterrey Bs.Eng.,  Electronic Systems Engineering 1989  – 1993 Electrical Engineering and Computer Science dual degree Escuela Mexicana Americana 1986  – 1989 Escuela Fernando R. Rodriguez Cornell University M.Eng.,  Electrical Engineering 1994  – 1996 Engineering Management minor. Cornell University M.Eng.,  Electrical Engineering 1994  – 1996 Engineering Management minor. Cornell University M.Eng.,  Electrical Engineering 1994  – 1996 Engineering Management minor. Instituto Tecnológico y de Estudios Superiores de Monterrey Bs.Eng.,  Electronic Systems Engineering 1989  – 1993 Electrical Engineering and Computer Science dual degree Instituto Tecnológico y de Estudios Superiores de Monterrey Bs.Eng.,  Electronic Systems Engineering 1989  – 1993 Electrical Engineering and Computer Science dual degree Instituto Tecnológico y de Estudios Superiores de Monterrey Bs.Eng.,  Electronic Systems Engineering 1989  – 1993 Electrical Engineering and Computer Science dual degree Escuela Mexicana Americana 1986  – 1989 Escuela Mexicana Americana 1986  – 1989 Escuela Mexicana Americana 1986  – 1989 Escuela Fernando R. Rodriguez Escuela Fernando R. Rodriguez Escuela Fernando R. Rodriguez ", "Summary I currently work on providing an emulation system for pre-silicon software development mapping silicon RTL onto FPGA technology. \n \nPreviously, I worked on a test device used to validate and debug Intel silicon products impacting time to market of Intel silicon. \n \nSpecialties: FPGA logic design: Verilog, SystemVerilog, Validation, UVM, Test \nBoard Design: USB, PCIe devices Summary I currently work on providing an emulation system for pre-silicon software development mapping silicon RTL onto FPGA technology. \n \nPreviously, I worked on a test device used to validate and debug Intel silicon products impacting time to market of Intel silicon. \n \nSpecialties: FPGA logic design: Verilog, SystemVerilog, Validation, UVM, Test \nBoard Design: USB, PCIe devices I currently work on providing an emulation system for pre-silicon software development mapping silicon RTL onto FPGA technology. \n \nPreviously, I worked on a test device used to validate and debug Intel silicon products impacting time to market of Intel silicon. \n \nSpecialties: FPGA logic design: Verilog, SystemVerilog, Validation, UVM, Test \nBoard Design: USB, PCIe devices I currently work on providing an emulation system for pre-silicon software development mapping silicon RTL onto FPGA technology. \n \nPreviously, I worked on a test device used to validate and debug Intel silicon products impacting time to market of Intel silicon. \n \nSpecialties: FPGA logic design: Verilog, SystemVerilog, Validation, UVM, Test \nBoard Design: USB, PCIe devices Experience Senior Hardware Design Engineer Microsoft March 2015  – Present (6 months) Redmond, WA Senior Hardware Engineer Intel Corporation November 2013  –  March 2015  (1 year 5 months) Seattle, WA *\tResponsible for mapping RTL designs into a single FPGA prototyping board to enable early software development and integration. \nDefined reduction in functionality for fit. Reduced clock frequencies to meet timing. Developed work-arounds and packet-based FIFOs to deal with the different clock frequency ratios in the FPGA prototype as compared with the final ASIC RTL. \nInstrumented Logic Analyzer cores on the FPGA to debug and root cause bugs to RTL or software. \nDeveloped test-benches for full-chip simulation to verify basic functionality of FPGA-specific RTL instantiation. This included PCIe root port instantiation, JTAG and I2C bus master models. \n*\tUtilized Xilinx’s Aurora Core with 64b66b SERDES to connect two prototype boards. Developed a wrapper to replace the ASIC’s 40-bit interface with Aurora Core SERDES 64-bit interface. Senior Hardware Engineer Intel Corporation June 2002  –  November 2013  (11 years 6 months) DuPont, WA *\tTeam Lead for an international team of FPGA designers. \nMet with customers within Intel to determine features needed to meet debug use cases. Developed product architectural documentation and requirements, estimated and planned work for a team of FPGA developers in the US, India and Israel. Reviewed designs against the requirements, coordinated integration and release with the software team to deliver product level features built upon the hardware capability. \n \n*\tWorked with the product architect to develop a custom 8-bit microcontroller. \nResponsible for bringing the product from the architecture phase to implementation. Developed a Python firmware compiler used for testing the hardware prior to software integration. Developed a common bus interface between the microcontroller and the various bus masters used to debug a target system: JTAG, I2C and other proprietary protocols used for product validation within Intel. Documented the microcontroller architecture and programmer’s reference manual used for developing the software portion of the product. \n \n*\tDeveloped a x4 PCI Express add-in card \nDesigned the board schematics, selected and integrated a x4 PCI Express Core IP into the FPGA. Designed, implemented and tested a 32 channel DMA controller and guided a contractor who developed the driver. \n \n*\tDeveloped a proprietary protocol based on PCI Express. \nLeveraged the Physical and Data Link Protocol from PCI Express and re-defined the Transaction Layer Protocol to develop an efficient 2.5 Gb/s link for use across an HDMI cable.  \nBrought the design from concept through implementation, unit test and debug in lab. Developed a SystemVerilog unit test framework that included bus error injection. \n \n*\tOther bus protocol design experience: PCIe, JTAG, I2C, USB Senior Hardware Design Engineer Microsoft March 2015  – Present (6 months) Redmond, WA Senior Hardware Design Engineer Microsoft March 2015  – Present (6 months) Redmond, WA Senior Hardware Engineer Intel Corporation November 2013  –  March 2015  (1 year 5 months) Seattle, WA *\tResponsible for mapping RTL designs into a single FPGA prototyping board to enable early software development and integration. \nDefined reduction in functionality for fit. Reduced clock frequencies to meet timing. Developed work-arounds and packet-based FIFOs to deal with the different clock frequency ratios in the FPGA prototype as compared with the final ASIC RTL. \nInstrumented Logic Analyzer cores on the FPGA to debug and root cause bugs to RTL or software. \nDeveloped test-benches for full-chip simulation to verify basic functionality of FPGA-specific RTL instantiation. This included PCIe root port instantiation, JTAG and I2C bus master models. \n*\tUtilized Xilinx’s Aurora Core with 64b66b SERDES to connect two prototype boards. Developed a wrapper to replace the ASIC’s 40-bit interface with Aurora Core SERDES 64-bit interface. Senior Hardware Engineer Intel Corporation November 2013  –  March 2015  (1 year 5 months) Seattle, WA *\tResponsible for mapping RTL designs into a single FPGA prototyping board to enable early software development and integration. \nDefined reduction in functionality for fit. Reduced clock frequencies to meet timing. Developed work-arounds and packet-based FIFOs to deal with the different clock frequency ratios in the FPGA prototype as compared with the final ASIC RTL. \nInstrumented Logic Analyzer cores on the FPGA to debug and root cause bugs to RTL or software. \nDeveloped test-benches for full-chip simulation to verify basic functionality of FPGA-specific RTL instantiation. This included PCIe root port instantiation, JTAG and I2C bus master models. \n*\tUtilized Xilinx’s Aurora Core with 64b66b SERDES to connect two prototype boards. Developed a wrapper to replace the ASIC’s 40-bit interface with Aurora Core SERDES 64-bit interface. Senior Hardware Engineer Intel Corporation June 2002  –  November 2013  (11 years 6 months) DuPont, WA *\tTeam Lead for an international team of FPGA designers. \nMet with customers within Intel to determine features needed to meet debug use cases. Developed product architectural documentation and requirements, estimated and planned work for a team of FPGA developers in the US, India and Israel. Reviewed designs against the requirements, coordinated integration and release with the software team to deliver product level features built upon the hardware capability. \n \n*\tWorked with the product architect to develop a custom 8-bit microcontroller. \nResponsible for bringing the product from the architecture phase to implementation. Developed a Python firmware compiler used for testing the hardware prior to software integration. Developed a common bus interface between the microcontroller and the various bus masters used to debug a target system: JTAG, I2C and other proprietary protocols used for product validation within Intel. Documented the microcontroller architecture and programmer’s reference manual used for developing the software portion of the product. \n \n*\tDeveloped a x4 PCI Express add-in card \nDesigned the board schematics, selected and integrated a x4 PCI Express Core IP into the FPGA. Designed, implemented and tested a 32 channel DMA controller and guided a contractor who developed the driver. \n \n*\tDeveloped a proprietary protocol based on PCI Express. \nLeveraged the Physical and Data Link Protocol from PCI Express and re-defined the Transaction Layer Protocol to develop an efficient 2.5 Gb/s link for use across an HDMI cable.  \nBrought the design from concept through implementation, unit test and debug in lab. Developed a SystemVerilog unit test framework that included bus error injection. \n \n*\tOther bus protocol design experience: PCIe, JTAG, I2C, USB Senior Hardware Engineer Intel Corporation June 2002  –  November 2013  (11 years 6 months) DuPont, WA *\tTeam Lead for an international team of FPGA designers. \nMet with customers within Intel to determine features needed to meet debug use cases. Developed product architectural documentation and requirements, estimated and planned work for a team of FPGA developers in the US, India and Israel. Reviewed designs against the requirements, coordinated integration and release with the software team to deliver product level features built upon the hardware capability. \n \n*\tWorked with the product architect to develop a custom 8-bit microcontroller. \nResponsible for bringing the product from the architecture phase to implementation. Developed a Python firmware compiler used for testing the hardware prior to software integration. Developed a common bus interface between the microcontroller and the various bus masters used to debug a target system: JTAG, I2C and other proprietary protocols used for product validation within Intel. Documented the microcontroller architecture and programmer’s reference manual used for developing the software portion of the product. \n \n*\tDeveloped a x4 PCI Express add-in card \nDesigned the board schematics, selected and integrated a x4 PCI Express Core IP into the FPGA. Designed, implemented and tested a 32 channel DMA controller and guided a contractor who developed the driver. \n \n*\tDeveloped a proprietary protocol based on PCI Express. \nLeveraged the Physical and Data Link Protocol from PCI Express and re-defined the Transaction Layer Protocol to develop an efficient 2.5 Gb/s link for use across an HDMI cable.  \nBrought the design from concept through implementation, unit test and debug in lab. Developed a SystemVerilog unit test framework that included bus error injection. \n \n*\tOther bus protocol design experience: PCIe, JTAG, I2C, USB Skills Verilog FPGA Simulations Hardware Architecture Debugging Computer Architecture Embedded Systems USB Logic Design C++ ASIC SystemVerilog UVM Testing SoC Intel See 1+     See less Skills  Verilog FPGA Simulations Hardware Architecture Debugging Computer Architecture Embedded Systems USB Logic Design C++ ASIC SystemVerilog UVM Testing SoC Intel See 1+     See less Verilog FPGA Simulations Hardware Architecture Debugging Computer Architecture Embedded Systems USB Logic Design C++ ASIC SystemVerilog UVM Testing SoC Intel See 1+     See less Verilog FPGA Simulations Hardware Architecture Debugging Computer Architecture Embedded Systems USB Logic Design C++ ASIC SystemVerilog UVM Testing SoC Intel See 1+     See less Education University of Washington MSEE 1999  – 2002 Wesleyan University BA,  Physics 1991  – 1996 University of Washington MSEE 1999  – 2002 University of Washington MSEE 1999  – 2002 University of Washington MSEE 1999  – 2002 Wesleyan University BA,  Physics 1991  – 1996 Wesleyan University BA,  Physics 1991  – 1996 Wesleyan University BA,  Physics 1991  – 1996 ", "Summary Tools/Equipment: Sampling Scopes, Real-time Scopes, Logic Analyzers, Spectrum Analyzers, BERTs \nSpecifications: Simulations PCIE Electrical Specs, SATA Electrical Specs, Intel QPI Specs, DDR3-DDR4-LPDDR4 Specs, USB 3.0 Electrical Specs \nLanguages: C, Python, MATLAB \nAdditional Skills: High Speed Si IO Measurements, Tx & Rx Characterization, PHY Validation, Electrical Link Simulations, Signal Integrity, BER Testing, Power Delivery Measurements, Jitter Analysis, PLL Characterization, Analog IP Validation, Electrical Debugging & Validation, Compliance Testing, Power Management, Test Development, Interconnect Simulation and Analysis \n Summary Tools/Equipment: Sampling Scopes, Real-time Scopes, Logic Analyzers, Spectrum Analyzers, BERTs \nSpecifications: Simulations PCIE Electrical Specs, SATA Electrical Specs, Intel QPI Specs, DDR3-DDR4-LPDDR4 Specs, USB 3.0 Electrical Specs \nLanguages: C, Python, MATLAB \nAdditional Skills: High Speed Si IO Measurements, Tx & Rx Characterization, PHY Validation, Electrical Link Simulations, Signal Integrity, BER Testing, Power Delivery Measurements, Jitter Analysis, PLL Characterization, Analog IP Validation, Electrical Debugging & Validation, Compliance Testing, Power Management, Test Development, Interconnect Simulation and Analysis \n Tools/Equipment: Sampling Scopes, Real-time Scopes, Logic Analyzers, Spectrum Analyzers, BERTs \nSpecifications: Simulations PCIE Electrical Specs, SATA Electrical Specs, Intel QPI Specs, DDR3-DDR4-LPDDR4 Specs, USB 3.0 Electrical Specs \nLanguages: C, Python, MATLAB \nAdditional Skills: High Speed Si IO Measurements, Tx & Rx Characterization, PHY Validation, Electrical Link Simulations, Signal Integrity, BER Testing, Power Delivery Measurements, Jitter Analysis, PLL Characterization, Analog IP Validation, Electrical Debugging & Validation, Compliance Testing, Power Management, Test Development, Interconnect Simulation and Analysis \n Tools/Equipment: Sampling Scopes, Real-time Scopes, Logic Analyzers, Spectrum Analyzers, BERTs \nSpecifications: Simulations PCIE Electrical Specs, SATA Electrical Specs, Intel QPI Specs, DDR3-DDR4-LPDDR4 Specs, USB 3.0 Electrical Specs \nLanguages: C, Python, MATLAB \nAdditional Skills: High Speed Si IO Measurements, Tx & Rx Characterization, PHY Validation, Electrical Link Simulations, Signal Integrity, BER Testing, Power Delivery Measurements, Jitter Analysis, PLL Characterization, Analog IP Validation, Electrical Debugging & Validation, Compliance Testing, Power Management, Test Development, Interconnect Simulation and Analysis \n Experience Senior Hardware Engineer INTEL January 2014  – Present (1 year 8 months) Santa Clara, CA Senior Hardware Engineer, Post-Silicon & Electrical Validation – INTEL CORPORATION\t2014 – Present \n\tWork extensively with Intel Desktop/Client test chips which include providing comprehensive, thorough post-silicon validation and power-on knowledge. \n\tWrote chip initialization code in Python; develop tests for analog and digital blocks along with Python Visa based automation of data collection for analysis. \n\tConduce compliance testing for Intel® PCIE (Gen 1, 2, 3), SATA and USB (2, 3) Transmitters and Receivers. \n\tComplete the characterization of various analog IP’s such as thermal sensors, ADC and amplifiers.  \n\tFamiliar with aspects of USB 3.1 Specification.  \n Senior Hardware Engineer Intel Corporation January 2008  –  December 2013  (6 years) Santa Clara, CA Senior Hardware Engineer, Memory IO Development & Design – INTEL CORPORATION 2008 – 2013 \n\tDeveloped Intel’s proprietary buffered memory link specification used for both IVYTOWN and Haswell-Server Processors. \n\tDesigned and delivered an error-free and efficient initialization procedure for Intel’s buffered memory link. \n\tHelped design initialization and link training specifications for Intel specific buffered memory links, DDR3 and DDR4 memory controllers. \n\tTested, validated and debugged single ended memory PHY/IO (analog and digital) for DDR input/output specs and timing. \n\tCreated novel jitter and noise statistical profiling methodologies for extension of BER based serial link analyses to single ended bursting memory links. \n Senior Hardware Engineer Intel Corporation February 2001  –  December 2007  (6 years 11 months) Santa Clara, CA Senior Hardware Engineer, Serial IO Specifications & Post-Silicon Validation – INTEL CORPORATION 2001 –2007 \n\tCompleted compliance testing for Intel® QPI, SMI (FBD2), PCIE (Gen 1 and 2) and implemented new processes, methods and procedures that improved the efficiency of the electrical validation team to achieve validation metrics.  \n\tSet up multiple labs across geographically dispersed sites and developed Python scripts to validate the IP. \n\tCreated Intel® Quick-Path serial link electrical PHY specifications used in Itanium and Xeon families, desktop processors and Intel® X58 chipsets serial links for 4.8 to 6.4 Gb/s operation. \n\tDeveloped the electrical section of Intel’s proprietary specification called Quick Path Interconnect. \n\tConducted statistical link analysis and developed jitter budgeting methodology for electrical margins for clock forwarded and CDR architectures for link speeds between 2.5 Gb/s to 8 Gb/s. \n\tPerformed signal integrity analysis on complete system links using internally developed statistical bit error analysis tools that are similar to industry standard tools, StatEye or JEye. \n\tDeveloped comprehensive, self-coded scripts in MATLAB for noise and jitter analysis to analyze electrical metrics for QPI specifications; utilized Tek Scope and Agilent Scope based tools to clock jitter analysis.  \n\tWorked on circuit simulations and measurements of single and cascaded PLL for jitter and band-width. \n Senior Device Engineer Intel Corporation 1996  –  2000  (4 years) Santa Clara, California Designed proprietary compact device models for Nwell resistors and transistors and integrated into circuit simulation engines, including lab measurements and extraction of parameters Senior Hardware Engineer INTEL January 2014  – Present (1 year 8 months) Santa Clara, CA Senior Hardware Engineer, Post-Silicon & Electrical Validation – INTEL CORPORATION\t2014 – Present \n\tWork extensively with Intel Desktop/Client test chips which include providing comprehensive, thorough post-silicon validation and power-on knowledge. \n\tWrote chip initialization code in Python; develop tests for analog and digital blocks along with Python Visa based automation of data collection for analysis. \n\tConduce compliance testing for Intel® PCIE (Gen 1, 2, 3), SATA and USB (2, 3) Transmitters and Receivers. \n\tComplete the characterization of various analog IP’s such as thermal sensors, ADC and amplifiers.  \n\tFamiliar with aspects of USB 3.1 Specification.  \n Senior Hardware Engineer INTEL January 2014  – Present (1 year 8 months) Santa Clara, CA Senior Hardware Engineer, Post-Silicon & Electrical Validation – INTEL CORPORATION\t2014 – Present \n\tWork extensively with Intel Desktop/Client test chips which include providing comprehensive, thorough post-silicon validation and power-on knowledge. \n\tWrote chip initialization code in Python; develop tests for analog and digital blocks along with Python Visa based automation of data collection for analysis. \n\tConduce compliance testing for Intel® PCIE (Gen 1, 2, 3), SATA and USB (2, 3) Transmitters and Receivers. \n\tComplete the characterization of various analog IP’s such as thermal sensors, ADC and amplifiers.  \n\tFamiliar with aspects of USB 3.1 Specification.  \n Senior Hardware Engineer Intel Corporation January 2008  –  December 2013  (6 years) Santa Clara, CA Senior Hardware Engineer, Memory IO Development & Design – INTEL CORPORATION 2008 – 2013 \n\tDeveloped Intel’s proprietary buffered memory link specification used for both IVYTOWN and Haswell-Server Processors. \n\tDesigned and delivered an error-free and efficient initialization procedure for Intel’s buffered memory link. \n\tHelped design initialization and link training specifications for Intel specific buffered memory links, DDR3 and DDR4 memory controllers. \n\tTested, validated and debugged single ended memory PHY/IO (analog and digital) for DDR input/output specs and timing. \n\tCreated novel jitter and noise statistical profiling methodologies for extension of BER based serial link analyses to single ended bursting memory links. \n Senior Hardware Engineer Intel Corporation January 2008  –  December 2013  (6 years) Santa Clara, CA Senior Hardware Engineer, Memory IO Development & Design – INTEL CORPORATION 2008 – 2013 \n\tDeveloped Intel’s proprietary buffered memory link specification used for both IVYTOWN and Haswell-Server Processors. \n\tDesigned and delivered an error-free and efficient initialization procedure for Intel’s buffered memory link. \n\tHelped design initialization and link training specifications for Intel specific buffered memory links, DDR3 and DDR4 memory controllers. \n\tTested, validated and debugged single ended memory PHY/IO (analog and digital) for DDR input/output specs and timing. \n\tCreated novel jitter and noise statistical profiling methodologies for extension of BER based serial link analyses to single ended bursting memory links. \n Senior Hardware Engineer Intel Corporation February 2001  –  December 2007  (6 years 11 months) Santa Clara, CA Senior Hardware Engineer, Serial IO Specifications & Post-Silicon Validation – INTEL CORPORATION 2001 –2007 \n\tCompleted compliance testing for Intel® QPI, SMI (FBD2), PCIE (Gen 1 and 2) and implemented new processes, methods and procedures that improved the efficiency of the electrical validation team to achieve validation metrics.  \n\tSet up multiple labs across geographically dispersed sites and developed Python scripts to validate the IP. \n\tCreated Intel® Quick-Path serial link electrical PHY specifications used in Itanium and Xeon families, desktop processors and Intel® X58 chipsets serial links for 4.8 to 6.4 Gb/s operation. \n\tDeveloped the electrical section of Intel’s proprietary specification called Quick Path Interconnect. \n\tConducted statistical link analysis and developed jitter budgeting methodology for electrical margins for clock forwarded and CDR architectures for link speeds between 2.5 Gb/s to 8 Gb/s. \n\tPerformed signal integrity analysis on complete system links using internally developed statistical bit error analysis tools that are similar to industry standard tools, StatEye or JEye. \n\tDeveloped comprehensive, self-coded scripts in MATLAB for noise and jitter analysis to analyze electrical metrics for QPI specifications; utilized Tek Scope and Agilent Scope based tools to clock jitter analysis.  \n\tWorked on circuit simulations and measurements of single and cascaded PLL for jitter and band-width. \n Senior Hardware Engineer Intel Corporation February 2001  –  December 2007  (6 years 11 months) Santa Clara, CA Senior Hardware Engineer, Serial IO Specifications & Post-Silicon Validation – INTEL CORPORATION 2001 –2007 \n\tCompleted compliance testing for Intel® QPI, SMI (FBD2), PCIE (Gen 1 and 2) and implemented new processes, methods and procedures that improved the efficiency of the electrical validation team to achieve validation metrics.  \n\tSet up multiple labs across geographically dispersed sites and developed Python scripts to validate the IP. \n\tCreated Intel® Quick-Path serial link electrical PHY specifications used in Itanium and Xeon families, desktop processors and Intel® X58 chipsets serial links for 4.8 to 6.4 Gb/s operation. \n\tDeveloped the electrical section of Intel’s proprietary specification called Quick Path Interconnect. \n\tConducted statistical link analysis and developed jitter budgeting methodology for electrical margins for clock forwarded and CDR architectures for link speeds between 2.5 Gb/s to 8 Gb/s. \n\tPerformed signal integrity analysis on complete system links using internally developed statistical bit error analysis tools that are similar to industry standard tools, StatEye or JEye. \n\tDeveloped comprehensive, self-coded scripts in MATLAB for noise and jitter analysis to analyze electrical metrics for QPI specifications; utilized Tek Scope and Agilent Scope based tools to clock jitter analysis.  \n\tWorked on circuit simulations and measurements of single and cascaded PLL for jitter and band-width. \n Senior Device Engineer Intel Corporation 1996  –  2000  (4 years) Santa Clara, California Designed proprietary compact device models for Nwell resistors and transistors and integrated into circuit simulation engines, including lab measurements and extraction of parameters Senior Device Engineer Intel Corporation 1996  –  2000  (4 years) Santa Clara, California Designed proprietary compact device models for Nwell resistors and transistors and integrated into circuit simulation engines, including lab measurements and extraction of parameters Skills Simulations USB 3.1 Electrical Specs PCIE Electrical Specs SATA Electrical Specs QPI Specs DDR3/DDR4/LPDDR4 Specs High Speed Si IO... Tx and Rx... PHY Validation Electrical Link... Matlab Python Signal Integrity BERT Sampling Scopes Real Time Scopes BER Testing Power Delivery... C Jitter Analysis PLL Characterization See 6+     See less Skills  Simulations USB 3.1 Electrical Specs PCIE Electrical Specs SATA Electrical Specs QPI Specs DDR3/DDR4/LPDDR4 Specs High Speed Si IO... Tx and Rx... PHY Validation Electrical Link... Matlab Python Signal Integrity BERT Sampling Scopes Real Time Scopes BER Testing Power Delivery... C Jitter Analysis PLL Characterization See 6+     See less Simulations USB 3.1 Electrical Specs PCIE Electrical Specs SATA Electrical Specs QPI Specs DDR3/DDR4/LPDDR4 Specs High Speed Si IO... Tx and Rx... PHY Validation Electrical Link... Matlab Python Signal Integrity BERT Sampling Scopes Real Time Scopes BER Testing Power Delivery... C Jitter Analysis PLL Characterization See 6+     See less Simulations USB 3.1 Electrical Specs PCIE Electrical Specs SATA Electrical Specs QPI Specs DDR3/DDR4/LPDDR4 Specs High Speed Si IO... Tx and Rx... PHY Validation Electrical Link... Matlab Python Signal Integrity BERT Sampling Scopes Real Time Scopes BER Testing Power Delivery... C Jitter Analysis PLL Characterization See 6+     See less Education Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering University of Notre Dame Master's degree,  Electrical and Electronics Engineering Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering University of Notre Dame Master's degree,  Electrical and Electronics Engineering University of Notre Dame Master's degree,  Electrical and Electronics Engineering University of Notre Dame Master's degree,  Electrical and Electronics Engineering ", "Experience Senior Hardware Engineer Intel Corporation Senior Hardware Engineer Intel Corporation Senior Hardware Engineer Intel Corporation ", "Summary Accomplished and versatile lead engineer with 15 years of ASIC and FPGA design experience. Extensive background in full life-cycle of integrated circuit development process, from specification through customer support; including RTL and testbench design, simulation, synthesis, timing analysis, emulation, floorplanning and layout. Thrives when debugging complex problems in all phases of development and integration, including troubleshooting system software and device drivers. Proven track record of designing and implementing high speed, on time solutions which exceed expectations. Strengths include: \n \n•\tHigh Speed Design \n•\tSystem Architecture \n•\tDDR 1/2/3 SDRAM \n•\tImage Processing \n•\tLow Power Design \n•\tDebug and Troubleshooting \n•\tPCIE, PCI/PCI-X  \n•\t802.11 Wireless Networks Summary Accomplished and versatile lead engineer with 15 years of ASIC and FPGA design experience. Extensive background in full life-cycle of integrated circuit development process, from specification through customer support; including RTL and testbench design, simulation, synthesis, timing analysis, emulation, floorplanning and layout. Thrives when debugging complex problems in all phases of development and integration, including troubleshooting system software and device drivers. Proven track record of designing and implementing high speed, on time solutions which exceed expectations. Strengths include: \n \n•\tHigh Speed Design \n•\tSystem Architecture \n•\tDDR 1/2/3 SDRAM \n•\tImage Processing \n•\tLow Power Design \n•\tDebug and Troubleshooting \n•\tPCIE, PCI/PCI-X  \n•\t802.11 Wireless Networks Accomplished and versatile lead engineer with 15 years of ASIC and FPGA design experience. Extensive background in full life-cycle of integrated circuit development process, from specification through customer support; including RTL and testbench design, simulation, synthesis, timing analysis, emulation, floorplanning and layout. Thrives when debugging complex problems in all phases of development and integration, including troubleshooting system software and device drivers. Proven track record of designing and implementing high speed, on time solutions which exceed expectations. Strengths include: \n \n•\tHigh Speed Design \n•\tSystem Architecture \n•\tDDR 1/2/3 SDRAM \n•\tImage Processing \n•\tLow Power Design \n•\tDebug and Troubleshooting \n•\tPCIE, PCI/PCI-X  \n•\t802.11 Wireless Networks Accomplished and versatile lead engineer with 15 years of ASIC and FPGA design experience. Extensive background in full life-cycle of integrated circuit development process, from specification through customer support; including RTL and testbench design, simulation, synthesis, timing analysis, emulation, floorplanning and layout. Thrives when debugging complex problems in all phases of development and integration, including troubleshooting system software and device drivers. Proven track record of designing and implementing high speed, on time solutions which exceed expectations. Strengths include: \n \n•\tHigh Speed Design \n•\tSystem Architecture \n•\tDDR 1/2/3 SDRAM \n•\tImage Processing \n•\tLow Power Design \n•\tDebug and Troubleshooting \n•\tPCIE, PCI/PCI-X  \n•\t802.11 Wireless Networks Experience Senior Hardware Engineer Edico Genome March 2013  – Present (2 years 6 months) Greater San Diego Area Senior Hardware Engineer Edico Genome March 2013  – Present (2 years 6 months) Greater San Diego Area Senior Hardware Engineer Edico Genome March 2013  – Present (2 years 6 months) Greater San Diego Area Skills PCIe Hardware Architecture FPGA Primetime ASIC Xilinx Verilog ModelSim NCSim Skills  PCIe Hardware Architecture FPGA Primetime ASIC Xilinx Verilog ModelSim NCSim PCIe Hardware Architecture FPGA Primetime ASIC Xilinx Verilog ModelSim NCSim PCIe Hardware Architecture FPGA Primetime ASIC Xilinx Verilog ModelSim NCSim ", "Experience Senior Hardware Engineer Intel Corporation April 2012  – Present (3 years 5 months) Israel, Yakum •\tLeading the Design execution of over 3M cells media block with an interdisciplinary team of software, algorithms and hardware engineers, to be included in future Intel CPU projects (2015+) Senior Hardware Engineer, Technical Leader Intel Corporation June 2011  –  April 2012  (11 months) Israel, Yaum •\tTechnical leading and designing of synthesis blocks in a multiple-core processor, the latest Intel's flagship product- Ultrabook. \n•\tDuring my work I have gained knowledge and experience in circuit design and SNPS tools. Furthermore I have experience leading horizontal processes within the organization. \n•\tPart of cross-site managed project which include working with US and Indian design teams. Product Response Leader Intel Corporation October 2009  –  May 2011  (1 year 8 months) Israel, IDC •\tSelected to a team of 10 expert designers from top domains, to debug all \"post-silicon\" circuit failures and setting the frequency for the \"Sandy-Bridge\" Intel next-generation lead CPU. \n•\tChosen to lead the Speed debug activity in System agent.  \n•\tSelected to a team of 4 expert designers to deal with Yield problems & enabling Functional tests Design Engineer - RLS Intel Corporation September 2007  –  September 2009  (2 years 1 month) Israel, Yakum •\tDesigned central parts of the 2nd generation Intel Core Processor Family, Code name \"Sandy-Bridge\", Intel's main CPU for all Mobile and Desktop Computers in 2011 \n•\tDuring my work I have gained vast knowledge and experience in: \no\tImplementation and redesigning of High-speed architectural design code (VERILOG) based on CIRCUIT considerations Using DCT & ICC and other internal optimization tools. \no\tSystem definition- external interfaces, functionality, blocks, internal interfaces, circuit design, Formal Verification, delivery to layout. \no\tIntegration of various blocks while balancing between rigid timing and quality requirements, layout considerations, power considerations and logic simplicity. \no\tExtensive experience in Static Timing Analysis, Performance Verification in high frequencies (3GHz), analyzing and balancing of critical paths under quality rules. Design Engineer Intel Corporation December 2006  –  September 2007  (10 months) Israel, Yakum •\tStudent role in Implementation and redesigning RTL code (VERILOG) based on CIRCUIT considerations \n•\tExperience in writing in PERL, TCL, CSH and System Verilog. \n•\tCompleted University Final Project by building an electronic wireless charger with analog circuitry. Awarded 3rd place on the Dean’s list. Senior Hardware Engineer Intel Corporation April 2012  – Present (3 years 5 months) Israel, Yakum •\tLeading the Design execution of over 3M cells media block with an interdisciplinary team of software, algorithms and hardware engineers, to be included in future Intel CPU projects (2015+) Senior Hardware Engineer Intel Corporation April 2012  – Present (3 years 5 months) Israel, Yakum •\tLeading the Design execution of over 3M cells media block with an interdisciplinary team of software, algorithms and hardware engineers, to be included in future Intel CPU projects (2015+) Senior Hardware Engineer, Technical Leader Intel Corporation June 2011  –  April 2012  (11 months) Israel, Yaum •\tTechnical leading and designing of synthesis blocks in a multiple-core processor, the latest Intel's flagship product- Ultrabook. \n•\tDuring my work I have gained knowledge and experience in circuit design and SNPS tools. Furthermore I have experience leading horizontal processes within the organization. \n•\tPart of cross-site managed project which include working with US and Indian design teams. Senior Hardware Engineer, Technical Leader Intel Corporation June 2011  –  April 2012  (11 months) Israel, Yaum •\tTechnical leading and designing of synthesis blocks in a multiple-core processor, the latest Intel's flagship product- Ultrabook. \n•\tDuring my work I have gained knowledge and experience in circuit design and SNPS tools. Furthermore I have experience leading horizontal processes within the organization. \n•\tPart of cross-site managed project which include working with US and Indian design teams. Product Response Leader Intel Corporation October 2009  –  May 2011  (1 year 8 months) Israel, IDC •\tSelected to a team of 10 expert designers from top domains, to debug all \"post-silicon\" circuit failures and setting the frequency for the \"Sandy-Bridge\" Intel next-generation lead CPU. \n•\tChosen to lead the Speed debug activity in System agent.  \n•\tSelected to a team of 4 expert designers to deal with Yield problems & enabling Functional tests Product Response Leader Intel Corporation October 2009  –  May 2011  (1 year 8 months) Israel, IDC •\tSelected to a team of 10 expert designers from top domains, to debug all \"post-silicon\" circuit failures and setting the frequency for the \"Sandy-Bridge\" Intel next-generation lead CPU. \n•\tChosen to lead the Speed debug activity in System agent.  \n•\tSelected to a team of 4 expert designers to deal with Yield problems & enabling Functional tests Design Engineer - RLS Intel Corporation September 2007  –  September 2009  (2 years 1 month) Israel, Yakum •\tDesigned central parts of the 2nd generation Intel Core Processor Family, Code name \"Sandy-Bridge\", Intel's main CPU for all Mobile and Desktop Computers in 2011 \n•\tDuring my work I have gained vast knowledge and experience in: \no\tImplementation and redesigning of High-speed architectural design code (VERILOG) based on CIRCUIT considerations Using DCT & ICC and other internal optimization tools. \no\tSystem definition- external interfaces, functionality, blocks, internal interfaces, circuit design, Formal Verification, delivery to layout. \no\tIntegration of various blocks while balancing between rigid timing and quality requirements, layout considerations, power considerations and logic simplicity. \no\tExtensive experience in Static Timing Analysis, Performance Verification in high frequencies (3GHz), analyzing and balancing of critical paths under quality rules. Design Engineer - RLS Intel Corporation September 2007  –  September 2009  (2 years 1 month) Israel, Yakum •\tDesigned central parts of the 2nd generation Intel Core Processor Family, Code name \"Sandy-Bridge\", Intel's main CPU for all Mobile and Desktop Computers in 2011 \n•\tDuring my work I have gained vast knowledge and experience in: \no\tImplementation and redesigning of High-speed architectural design code (VERILOG) based on CIRCUIT considerations Using DCT & ICC and other internal optimization tools. \no\tSystem definition- external interfaces, functionality, blocks, internal interfaces, circuit design, Formal Verification, delivery to layout. \no\tIntegration of various blocks while balancing between rigid timing and quality requirements, layout considerations, power considerations and logic simplicity. \no\tExtensive experience in Static Timing Analysis, Performance Verification in high frequencies (3GHz), analyzing and balancing of critical paths under quality rules. Design Engineer Intel Corporation December 2006  –  September 2007  (10 months) Israel, Yakum •\tStudent role in Implementation and redesigning RTL code (VERILOG) based on CIRCUIT considerations \n•\tExperience in writing in PERL, TCL, CSH and System Verilog. \n•\tCompleted University Final Project by building an electronic wireless charger with analog circuitry. Awarded 3rd place on the Dean’s list. Design Engineer Intel Corporation December 2006  –  September 2007  (10 months) Israel, Yakum •\tStudent role in Implementation and redesigning RTL code (VERILOG) based on CIRCUIT considerations \n•\tExperience in writing in PERL, TCL, CSH and System Verilog. \n•\tCompleted University Final Project by building an electronic wireless charger with analog circuitry. Awarded 3rd place on the Dean’s list. Languages Hebrew English Hebrew English Hebrew English Skills Synthesis SystemVerilog Logic Design Verilog Debugging Static Timing Analysis Processors TCL Circuit Design VLSI Specman Skills  Synthesis SystemVerilog Logic Design Verilog Debugging Static Timing Analysis Processors TCL Circuit Design VLSI Specman Synthesis SystemVerilog Logic Design Verilog Debugging Static Timing Analysis Processors TCL Circuit Design VLSI Specman Synthesis SystemVerilog Logic Design Verilog Debugging Static Timing Analysis Processors TCL Circuit Design VLSI Specman Education Tel Aviv University BSEE,  Electrical Engineering 2003  – 2007 •\tMajored in Communication, Computers and Electrical Engineering. Activities and Societies:  Tutored 4th year Advanced Laboratory in Energy Conversion. CUNY New York City College of Technology Bachelor of Science (BSc),  Electrical and Electronics Engineering , 4.0 2002  – 2003 • Listed on Dean’s Honors list with GPA 4.0 First academic year. Tel Aviv University BSEE,  Electrical Engineering 2003  – 2007 •\tMajored in Communication, Computers and Electrical Engineering. Activities and Societies:  Tutored 4th year Advanced Laboratory in Energy Conversion. Tel Aviv University BSEE,  Electrical Engineering 2003  – 2007 •\tMajored in Communication, Computers and Electrical Engineering. Activities and Societies:  Tutored 4th year Advanced Laboratory in Energy Conversion. Tel Aviv University BSEE,  Electrical Engineering 2003  – 2007 •\tMajored in Communication, Computers and Electrical Engineering. Activities and Societies:  Tutored 4th year Advanced Laboratory in Energy Conversion. CUNY New York City College of Technology Bachelor of Science (BSc),  Electrical and Electronics Engineering , 4.0 2002  – 2003 • Listed on Dean’s Honors list with GPA 4.0 First academic year. CUNY New York City College of Technology Bachelor of Science (BSc),  Electrical and Electronics Engineering , 4.0 2002  – 2003 • Listed on Dean’s Honors list with GPA 4.0 First academic year. CUNY New York City College of Technology Bachelor of Science (BSc),  Electrical and Electronics Engineering , 4.0 2002  – 2003 • Listed on Dean’s Honors list with GPA 4.0 First academic year. ", "Experience Senior Hardware Engineer Intel Corporation Senior Hardware Engineer Intel Corporation Senior Hardware Engineer Intel Corporation ", "Summary I am a creative and highly-motivated microprocessor designer with 10+ years of experience in the semiconductor industry. I understand both the product design and market placement issues surrounding server, datacenter, and high-performance products. \n \nI excel at understanding and solving new and complex problems, envisioning future challenges and consequences of design decisions, and bringing together the necessary people across geographies, cultures, departments, and job functions to make the correct decisions. I am constantly looking for innovative solutions to address difficult problems. \n \nI have direct experience with CPU/processor and graphics pipelines, high-speed I/O, DFT, and cache-coherent multi-core and multi-processor systems, with a special focus on high-performance and power-efficient design. \n \nI excel at teaching and mentoring others in both group and one-on-one settings. Specialties:High-performance and low-power microprocessor design, encompassing both custom circuit and logic synthesis methodolgies. Summary I am a creative and highly-motivated microprocessor designer with 10+ years of experience in the semiconductor industry. I understand both the product design and market placement issues surrounding server, datacenter, and high-performance products. \n \nI excel at understanding and solving new and complex problems, envisioning future challenges and consequences of design decisions, and bringing together the necessary people across geographies, cultures, departments, and job functions to make the correct decisions. I am constantly looking for innovative solutions to address difficult problems. \n \nI have direct experience with CPU/processor and graphics pipelines, high-speed I/O, DFT, and cache-coherent multi-core and multi-processor systems, with a special focus on high-performance and power-efficient design. \n \nI excel at teaching and mentoring others in both group and one-on-one settings. Specialties:High-performance and low-power microprocessor design, encompassing both custom circuit and logic synthesis methodolgies. I am a creative and highly-motivated microprocessor designer with 10+ years of experience in the semiconductor industry. I understand both the product design and market placement issues surrounding server, datacenter, and high-performance products. \n \nI excel at understanding and solving new and complex problems, envisioning future challenges and consequences of design decisions, and bringing together the necessary people across geographies, cultures, departments, and job functions to make the correct decisions. I am constantly looking for innovative solutions to address difficult problems. \n \nI have direct experience with CPU/processor and graphics pipelines, high-speed I/O, DFT, and cache-coherent multi-core and multi-processor systems, with a special focus on high-performance and power-efficient design. \n \nI excel at teaching and mentoring others in both group and one-on-one settings. Specialties:High-performance and low-power microprocessor design, encompassing both custom circuit and logic synthesis methodolgies. I am a creative and highly-motivated microprocessor designer with 10+ years of experience in the semiconductor industry. I understand both the product design and market placement issues surrounding server, datacenter, and high-performance products. \n \nI excel at understanding and solving new and complex problems, envisioning future challenges and consequences of design decisions, and bringing together the necessary people across geographies, cultures, departments, and job functions to make the correct decisions. I am constantly looking for innovative solutions to address difficult problems. \n \nI have direct experience with CPU/processor and graphics pipelines, high-speed I/O, DFT, and cache-coherent multi-core and multi-processor systems, with a special focus on high-performance and power-efficient design. \n \nI excel at teaching and mentoring others in both group and one-on-one settings. Specialties:High-performance and low-power microprocessor design, encompassing both custom circuit and logic synthesis methodolgies. Experience Engineering Program Manager Apple July 2014  – Present (1 year 2 months) Cupertino, California Staff Design Engineer Semiconductor Startup February 2011  –  July 2014  (3 years 6 months) Senior Hardware Engineer Intel Corporation August 2001  –  February 2011  (9 years 7 months) Hardware Engineer Compaq Corporation August 1999  –  August 2001  (2 years 1 month) Engineering Program Manager Apple July 2014  – Present (1 year 2 months) Cupertino, California Engineering Program Manager Apple July 2014  – Present (1 year 2 months) Cupertino, California Staff Design Engineer Semiconductor Startup February 2011  –  July 2014  (3 years 6 months) Staff Design Engineer Semiconductor Startup February 2011  –  July 2014  (3 years 6 months) Senior Hardware Engineer Intel Corporation August 2001  –  February 2011  (9 years 7 months) Senior Hardware Engineer Intel Corporation August 2001  –  February 2011  (9 years 7 months) Hardware Engineer Compaq Corporation August 1999  –  August 2001  (2 years 1 month) Hardware Engineer Compaq Corporation August 1999  –  August 2001  (2 years 1 month) Skills IC Hardware Design Physical Design VLSI Microprocessors Hardware Architecture Semiconductors Low-power Design Debugging Logic Synthesis ASIC System Architecture Silicon DFT SoC Static Timing Analysis Algorithms See 2+     See less Skills  IC Hardware Design Physical Design VLSI Microprocessors Hardware Architecture Semiconductors Low-power Design Debugging Logic Synthesis ASIC System Architecture Silicon DFT SoC Static Timing Analysis Algorithms See 2+     See less IC Hardware Design Physical Design VLSI Microprocessors Hardware Architecture Semiconductors Low-power Design Debugging Logic Synthesis ASIC System Architecture Silicon DFT SoC Static Timing Analysis Algorithms See 2+     See less IC Hardware Design Physical Design VLSI Microprocessors Hardware Architecture Semiconductors Low-power Design Debugging Logic Synthesis ASIC System Architecture Silicon DFT SoC Static Timing Analysis Algorithms See 2+     See less Education University of Pennsylvania - The Wharton School MBA 2010  – 2012 Massachusetts Institute of Technology S.B, M.Eng 1994  – 1999 University of Pennsylvania - The Wharton School MBA 2010  – 2012 University of Pennsylvania - The Wharton School MBA 2010  – 2012 University of Pennsylvania - The Wharton School MBA 2010  – 2012 Massachusetts Institute of Technology S.B, M.Eng 1994  – 1999 Massachusetts Institute of Technology S.B, M.Eng 1994  – 1999 Massachusetts Institute of Technology S.B, M.Eng 1994  – 1999 ", "Experience Senior Hardware Engineer Intel Corporation May 2012  – Present (3 years 4 months) Chippewa Falls, WI Senior Hardware Engineer Intel Corporation May 2012  – Present (3 years 4 months) Chippewa Falls, WI Senior Hardware Engineer Intel Corporation May 2012  – Present (3 years 4 months) Chippewa Falls, WI Skills ASIC Physical Design Signal Integrity Primetime Logic Design Timing Closure Static Timing Analysis Clock Tree Synthesis Hardware Circuit Design Verilog SoC PCIe Processors Skills  ASIC Physical Design Signal Integrity Primetime Logic Design Timing Closure Static Timing Analysis Clock Tree Synthesis Hardware Circuit Design Verilog SoC PCIe Processors ASIC Physical Design Signal Integrity Primetime Logic Design Timing Closure Static Timing Analysis Clock Tree Synthesis Hardware Circuit Design Verilog SoC PCIe Processors ASIC Physical Design Signal Integrity Primetime Logic Design Timing Closure Static Timing Analysis Clock Tree Synthesis Hardware Circuit Design Verilog SoC PCIe Processors Education University of Minnesota-Twin Cities 1986  – 1990 University of Wisconsin-Madison University of Wisconsin-Platteville University of Minnesota-Twin Cities 1986  – 1990 University of Minnesota-Twin Cities 1986  – 1990 University of Minnesota-Twin Cities 1986  – 1990 University of Wisconsin-Madison University of Wisconsin-Madison University of Wisconsin-Madison University of Wisconsin-Platteville University of Wisconsin-Platteville University of Wisconsin-Platteville ", "Languages Cebuano Cebuano Cebuano Skills Verilog FPGA Debugging Embedded Systems VHDL USB Design for Manufacturing Hardware Architecture Schematic Capture ASIC Engineering Management Signal Integrity Microsoft Office Skills  Verilog FPGA Debugging Embedded Systems VHDL USB Design for Manufacturing Hardware Architecture Schematic Capture ASIC Engineering Management Signal Integrity Microsoft Office Verilog FPGA Debugging Embedded Systems VHDL USB Design for Manufacturing Hardware Architecture Schematic Capture ASIC Engineering Management Signal Integrity Microsoft Office Verilog FPGA Debugging Embedded Systems VHDL USB Design for Manufacturing Hardware Architecture Schematic Capture ASIC Engineering Management Signal Integrity Microsoft Office ", "Summary Hardware Engineering product development professional. Dedicated to the project at-hand, meeting business goals and customer objectives. Summary Hardware Engineering product development professional. Dedicated to the project at-hand, meeting business goals and customer objectives. Hardware Engineering product development professional. Dedicated to the project at-hand, meeting business goals and customer objectives. Hardware Engineering product development professional. Dedicated to the project at-hand, meeting business goals and customer objectives. Experience Staff Electrical Engineer Siemens Healthcare 2013  – Present (2 years) Flanders, New Jersey Component Engineer Dialogic 2011  –  2013  (2 years) Parsippany, NJ Technical responsibility for component related activities, component selection, alternate sourcing, cost reduction, End-of-Life maintenance, environmental compliance (RoHS, REACH, WEEE), Conflict Minerals, Product Data Management system maintenance, establish/maintain vendor part numbers. Manufacture Engineer Dialogic 2006  –  2011  (5 years) Parsippany, NJ Support Engineering, Planning, and Marketing with contract manufacture new product introduction and production issues. Project Engineer Intel 2004  –  2006  (2 years) Parsippany, NJ Led team to successful RoHS conversion initiative for Media & Signaling Division products. Designed and developed product conversion process for business unit to meet technical compliancy requirements of legislation in time for legislation implementation. Senior Hardware Engineer Intel Corporation 1999  –  2003  (4 years) Parsippany, NJ Digital media and signaling board development. Senior Hardware Engineer Dialogic Corporation 1992  –  1999  (7 years) Parsippany, NJ Digital design, PC-based media and signaling computer boards with telephony interfaces, embedded processors, DSPs, H.100 data streaming, on-board power supplies, ISA and PCI hosts, RS-232 interface between host PC and custom server chassis. Cross functional team member, design review participant, created HW product specification documents, create design verification test procedures, manufacturing testware requirements & datasheets, schematics, bills of materials, assembly diagrams and other manufacturing build documentation. Supported HW/FW/SW integration. Designed to domestic and international regulatory EMI and safety compliance (FCC Part 15 & 68, UL 1950, CSA). Performed competitive analysis, cost reduction. Mentored new-hire and co-op employees. 2nd tier development engineering support to Customer Support Department. Engineer Intern York Technology, Inc. 1991  –  1991  (less than a year) Princeton, NJ Product development support tasks. Fiber optic test and measurement equipment. Test Engineer Intern Unidata 1990  –  1990  (less than a year) Paramus Beta product testing and user documentation of voice and data bandwidth optimization product. Voice & Data Systems Technician AT&T 1987  –  1989  (2 years) Basking Ridge, NJ Systems Technician for Northern Operations Group (NOG) administering and supporting voice and data networks in Basking Ridge headquarters building, Bedminster Global Network Operations Center (GNOC) & other satellite buildings. Medical Insurance Claims Processor Prudential 1984  –  1987  (3 years) Parsippany, NJ Medical claims processing dedicated to IBM employee account. Consistently maintained highest quota and accuracy requirements. Staff Electrical Engineer Siemens Healthcare 2013  – Present (2 years) Flanders, New Jersey Staff Electrical Engineer Siemens Healthcare 2013  – Present (2 years) Flanders, New Jersey Component Engineer Dialogic 2011  –  2013  (2 years) Parsippany, NJ Technical responsibility for component related activities, component selection, alternate sourcing, cost reduction, End-of-Life maintenance, environmental compliance (RoHS, REACH, WEEE), Conflict Minerals, Product Data Management system maintenance, establish/maintain vendor part numbers. Component Engineer Dialogic 2011  –  2013  (2 years) Parsippany, NJ Technical responsibility for component related activities, component selection, alternate sourcing, cost reduction, End-of-Life maintenance, environmental compliance (RoHS, REACH, WEEE), Conflict Minerals, Product Data Management system maintenance, establish/maintain vendor part numbers. Manufacture Engineer Dialogic 2006  –  2011  (5 years) Parsippany, NJ Support Engineering, Planning, and Marketing with contract manufacture new product introduction and production issues. Manufacture Engineer Dialogic 2006  –  2011  (5 years) Parsippany, NJ Support Engineering, Planning, and Marketing with contract manufacture new product introduction and production issues. Project Engineer Intel 2004  –  2006  (2 years) Parsippany, NJ Led team to successful RoHS conversion initiative for Media & Signaling Division products. Designed and developed product conversion process for business unit to meet technical compliancy requirements of legislation in time for legislation implementation. Project Engineer Intel 2004  –  2006  (2 years) Parsippany, NJ Led team to successful RoHS conversion initiative for Media & Signaling Division products. Designed and developed product conversion process for business unit to meet technical compliancy requirements of legislation in time for legislation implementation. Senior Hardware Engineer Intel Corporation 1999  –  2003  (4 years) Parsippany, NJ Digital media and signaling board development. Senior Hardware Engineer Intel Corporation 1999  –  2003  (4 years) Parsippany, NJ Digital media and signaling board development. Senior Hardware Engineer Dialogic Corporation 1992  –  1999  (7 years) Parsippany, NJ Digital design, PC-based media and signaling computer boards with telephony interfaces, embedded processors, DSPs, H.100 data streaming, on-board power supplies, ISA and PCI hosts, RS-232 interface between host PC and custom server chassis. Cross functional team member, design review participant, created HW product specification documents, create design verification test procedures, manufacturing testware requirements & datasheets, schematics, bills of materials, assembly diagrams and other manufacturing build documentation. Supported HW/FW/SW integration. Designed to domestic and international regulatory EMI and safety compliance (FCC Part 15 & 68, UL 1950, CSA). Performed competitive analysis, cost reduction. Mentored new-hire and co-op employees. 2nd tier development engineering support to Customer Support Department. Senior Hardware Engineer Dialogic Corporation 1992  –  1999  (7 years) Parsippany, NJ Digital design, PC-based media and signaling computer boards with telephony interfaces, embedded processors, DSPs, H.100 data streaming, on-board power supplies, ISA and PCI hosts, RS-232 interface between host PC and custom server chassis. Cross functional team member, design review participant, created HW product specification documents, create design verification test procedures, manufacturing testware requirements & datasheets, schematics, bills of materials, assembly diagrams and other manufacturing build documentation. Supported HW/FW/SW integration. Designed to domestic and international regulatory EMI and safety compliance (FCC Part 15 & 68, UL 1950, CSA). Performed competitive analysis, cost reduction. Mentored new-hire and co-op employees. 2nd tier development engineering support to Customer Support Department. Engineer Intern York Technology, Inc. 1991  –  1991  (less than a year) Princeton, NJ Product development support tasks. Fiber optic test and measurement equipment. Engineer Intern York Technology, Inc. 1991  –  1991  (less than a year) Princeton, NJ Product development support tasks. Fiber optic test and measurement equipment. Test Engineer Intern Unidata 1990  –  1990  (less than a year) Paramus Beta product testing and user documentation of voice and data bandwidth optimization product. Test Engineer Intern Unidata 1990  –  1990  (less than a year) Paramus Beta product testing and user documentation of voice and data bandwidth optimization product. Voice & Data Systems Technician AT&T 1987  –  1989  (2 years) Basking Ridge, NJ Systems Technician for Northern Operations Group (NOG) administering and supporting voice and data networks in Basking Ridge headquarters building, Bedminster Global Network Operations Center (GNOC) & other satellite buildings. Voice & Data Systems Technician AT&T 1987  –  1989  (2 years) Basking Ridge, NJ Systems Technician for Northern Operations Group (NOG) administering and supporting voice and data networks in Basking Ridge headquarters building, Bedminster Global Network Operations Center (GNOC) & other satellite buildings. Medical Insurance Claims Processor Prudential 1984  –  1987  (3 years) Parsippany, NJ Medical claims processing dedicated to IBM employee account. Consistently maintained highest quota and accuracy requirements. Medical Insurance Claims Processor Prudential 1984  –  1987  (3 years) Parsippany, NJ Medical claims processing dedicated to IBM employee account. Consistently maintained highest quota and accuracy requirements. Languages German German German Skills Electronics RoHS Engineering Management FPGA VHDL Manufacturing Telecommunications Embedded Systems Product Development PCB design Engineering Testing Hardware C Integration Software Engineering Cross-functional Team... Software Documentation Digital Signal... Systems Engineering See 5+     See less Skills  Electronics RoHS Engineering Management FPGA VHDL Manufacturing Telecommunications Embedded Systems Product Development PCB design Engineering Testing Hardware C Integration Software Engineering Cross-functional Team... Software Documentation Digital Signal... Systems Engineering See 5+     See less Electronics RoHS Engineering Management FPGA VHDL Manufacturing Telecommunications Embedded Systems Product Development PCB design Engineering Testing Hardware C Integration Software Engineering Cross-functional Team... Software Documentation Digital Signal... Systems Engineering See 5+     See less Electronics RoHS Engineering Management FPGA VHDL Manufacturing Telecommunications Embedded Systems Product Development PCB design Engineering Testing Hardware C Integration Software Engineering Cross-functional Team... Software Documentation Digital Signal... Systems Engineering See 5+     See less Education New Jersey Institute of Technology - School of Management MS,  Engineering Management 1995 Activities and Societies:  AEL SIGMA New Jersey Institute of Technology BS,  Electrical , Electronic and Communications Engineering Technology/Technician 1992 Raritan Valley Community College Associate of Arts and Sciences (AAS),  Electrical , Electronics and Communications Engineering 1987 Somerset County Technology Institute Certificate of Electronic Technology,  Electrical , Electronic and Communications Engineering Technology/Technician 1986 New Jersey Institute of Technology - School of Management MS,  Engineering Management 1995 Activities and Societies:  AEL SIGMA New Jersey Institute of Technology - School of Management MS,  Engineering Management 1995 Activities and Societies:  AEL SIGMA New Jersey Institute of Technology - School of Management MS,  Engineering Management 1995 Activities and Societies:  AEL SIGMA New Jersey Institute of Technology BS,  Electrical , Electronic and Communications Engineering Technology/Technician 1992 New Jersey Institute of Technology BS,  Electrical , Electronic and Communications Engineering Technology/Technician 1992 New Jersey Institute of Technology BS,  Electrical , Electronic and Communications Engineering Technology/Technician 1992 Raritan Valley Community College Associate of Arts and Sciences (AAS),  Electrical , Electronics and Communications Engineering 1987 Raritan Valley Community College Associate of Arts and Sciences (AAS),  Electrical , Electronics and Communications Engineering 1987 Raritan Valley Community College Associate of Arts and Sciences (AAS),  Electrical , Electronics and Communications Engineering 1987 Somerset County Technology Institute Certificate of Electronic Technology,  Electrical , Electronic and Communications Engineering Technology/Technician 1986 Somerset County Technology Institute Certificate of Electronic Technology,  Electrical , Electronic and Communications Engineering Technology/Technician 1986 Somerset County Technology Institute Certificate of Electronic Technology,  Electrical , Electronic and Communications Engineering Technology/Technician 1986 ", "Summary Over 15 years of technical leadership experience in Server Microprocessor VLSI design with extensive background in custom/semi-custom datapath/RLS (synthesis) physical design. \n•\tPhysical Design Technical Lead/Manager for multiple projects \n•\tActive participation in all phases of the design phase starting with initial feasibility/technology readiness through execution for multiple microprocessor tape-outs  \n•\tProficient in the entire gamut of digital design encompassing transistor level design, library cells, Register Files, custom blocks and synthesis using Synopsys® tools, as well as owning the execution of multiple sections/units using in-house and industry standard tools \n•\t9+ years of people management experience \n•\tDriven individual and able to quickly ramp-up on new technologies and tasks \n•\tGreat written and verbal communication skills with the ability and desire to work with a variety of people Summary Over 15 years of technical leadership experience in Server Microprocessor VLSI design with extensive background in custom/semi-custom datapath/RLS (synthesis) physical design. \n•\tPhysical Design Technical Lead/Manager for multiple projects \n•\tActive participation in all phases of the design phase starting with initial feasibility/technology readiness through execution for multiple microprocessor tape-outs  \n•\tProficient in the entire gamut of digital design encompassing transistor level design, library cells, Register Files, custom blocks and synthesis using Synopsys® tools, as well as owning the execution of multiple sections/units using in-house and industry standard tools \n•\t9+ years of people management experience \n•\tDriven individual and able to quickly ramp-up on new technologies and tasks \n•\tGreat written and verbal communication skills with the ability and desire to work with a variety of people Over 15 years of technical leadership experience in Server Microprocessor VLSI design with extensive background in custom/semi-custom datapath/RLS (synthesis) physical design. \n•\tPhysical Design Technical Lead/Manager for multiple projects \n•\tActive participation in all phases of the design phase starting with initial feasibility/technology readiness through execution for multiple microprocessor tape-outs  \n•\tProficient in the entire gamut of digital design encompassing transistor level design, library cells, Register Files, custom blocks and synthesis using Synopsys® tools, as well as owning the execution of multiple sections/units using in-house and industry standard tools \n•\t9+ years of people management experience \n•\tDriven individual and able to quickly ramp-up on new technologies and tasks \n•\tGreat written and verbal communication skills with the ability and desire to work with a variety of people Over 15 years of technical leadership experience in Server Microprocessor VLSI design with extensive background in custom/semi-custom datapath/RLS (synthesis) physical design. \n•\tPhysical Design Technical Lead/Manager for multiple projects \n•\tActive participation in all phases of the design phase starting with initial feasibility/technology readiness through execution for multiple microprocessor tape-outs  \n•\tProficient in the entire gamut of digital design encompassing transistor level design, library cells, Register Files, custom blocks and synthesis using Synopsys® tools, as well as owning the execution of multiple sections/units using in-house and industry standard tools \n•\t9+ years of people management experience \n•\tDriven individual and able to quickly ramp-up on new technologies and tasks \n•\tGreat written and verbal communication skills with the ability and desire to work with a variety of people Experience Engineering Manager Intel Corp. January 2006  – Present (9 years 8 months) San Francisco Bay Area Section Physical Design Lead and Manager for multiple generations of Xeon Server microprocessors with ownership spanning initial feasibility/Technology Readiness through execution and multiple tape-outs. Have personally owned the delivery of synthesis (RLS) and datapath blocks while providing technical supervision to engineers on team. Senior Hardware Engineer Intel Corporation August 2001  –  December 2005  (4 years 5 months) San Francisco Bay Area Key contributor to Itanium/Xeon server processor projects with focus on datapath design, Register Files, library cell work as well as various global design roles related to floorplanning and section assembly. Circuit Designer Compaq's Alpha Development Group August 1998  –  August 2001  (3 years 1 month) San Francisco Bay Area Transistor-level implementation of RTL into layout-ready schematics while meeting pre- and post-layout timing, circuit quality, noise, reliability checks. Owned global tasks related to section noise, electrical rule checks, section netlists etc.  \nTook the initiative to create a co-op/intern training and orientation program at Compaq’s Palo Alto Design Center with FAQs, tutorials and design presentations. Mentored, helped hire and supervised several co-ops as well as represented the company at career fairs. Engineering Manager Intel Corp. January 2006  – Present (9 years 8 months) San Francisco Bay Area Section Physical Design Lead and Manager for multiple generations of Xeon Server microprocessors with ownership spanning initial feasibility/Technology Readiness through execution and multiple tape-outs. Have personally owned the delivery of synthesis (RLS) and datapath blocks while providing technical supervision to engineers on team. Engineering Manager Intel Corp. January 2006  – Present (9 years 8 months) San Francisco Bay Area Section Physical Design Lead and Manager for multiple generations of Xeon Server microprocessors with ownership spanning initial feasibility/Technology Readiness through execution and multiple tape-outs. Have personally owned the delivery of synthesis (RLS) and datapath blocks while providing technical supervision to engineers on team. Senior Hardware Engineer Intel Corporation August 2001  –  December 2005  (4 years 5 months) San Francisco Bay Area Key contributor to Itanium/Xeon server processor projects with focus on datapath design, Register Files, library cell work as well as various global design roles related to floorplanning and section assembly. Senior Hardware Engineer Intel Corporation August 2001  –  December 2005  (4 years 5 months) San Francisco Bay Area Key contributor to Itanium/Xeon server processor projects with focus on datapath design, Register Files, library cell work as well as various global design roles related to floorplanning and section assembly. Circuit Designer Compaq's Alpha Development Group August 1998  –  August 2001  (3 years 1 month) San Francisco Bay Area Transistor-level implementation of RTL into layout-ready schematics while meeting pre- and post-layout timing, circuit quality, noise, reliability checks. Owned global tasks related to section noise, electrical rule checks, section netlists etc.  \nTook the initiative to create a co-op/intern training and orientation program at Compaq’s Palo Alto Design Center with FAQs, tutorials and design presentations. Mentored, helped hire and supervised several co-ops as well as represented the company at career fairs. Circuit Designer Compaq's Alpha Development Group August 1998  –  August 2001  (3 years 1 month) San Francisco Bay Area Transistor-level implementation of RTL into layout-ready schematics while meeting pre- and post-layout timing, circuit quality, noise, reliability checks. Owned global tasks related to section noise, electrical rule checks, section netlists etc.  \nTook the initiative to create a co-op/intern training and orientation program at Compaq’s Palo Alto Design Center with FAQs, tutorials and design presentations. Mentored, helped hire and supervised several co-ops as well as represented the company at career fairs. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills ASIC Static Timing Analysis RTL design Low-power Design Verilog Physical Design VLSI SoC SystemVerilog EDA Logic Synthesis Management Skills  ASIC Static Timing Analysis RTL design Low-power Design Verilog Physical Design VLSI SoC SystemVerilog EDA Logic Synthesis Management ASIC Static Timing Analysis RTL design Low-power Design Verilog Physical Design VLSI SoC SystemVerilog EDA Logic Synthesis Management ASIC Static Timing Analysis RTL design Low-power Design Verilog Physical Design VLSI SoC SystemVerilog EDA Logic Synthesis Management Education Iowa State University MS,  Computer Engineering 1996  – 1998 Majoring in digital VLSI design  VESIT Bachelor of Engineering (B.E.),  Electronics Engineering 1992  – 1996 Iowa State University MS,  Computer Engineering 1996  – 1998 Majoring in digital VLSI design  Iowa State University MS,  Computer Engineering 1996  – 1998 Majoring in digital VLSI design  Iowa State University MS,  Computer Engineering 1996  – 1998 Majoring in digital VLSI design  VESIT Bachelor of Engineering (B.E.),  Electronics Engineering 1992  – 1996 VESIT Bachelor of Engineering (B.E.),  Electronics Engineering 1992  – 1996 VESIT Bachelor of Engineering (B.E.),  Electronics Engineering 1992  – 1996 ", "Summary I've designed a lot of large, high-speed, complex circuit boards and SOC development platforms involving custom ASIC devices and FPGA's for telecom, switching, and embedded silicon testing/prototyping applications. I've also designed a lot of FPGA & CPLD RTL designs for controlling and managing these large system platforms, involving packet generation/reception of the Opteron CPU HyperTransport bus, PowerPC 60X bus, and PCI bus bridging/translation, clock controller management, and bus interface snooping/probing applications. I've been using Cadence PCB design tools since about 1997, and have extensive experience with Cadence Concept HDL, Allegro, Specctraquest, and Constraint Manager. I'm well experienced in using both Altera Quartus and Xilinx ISE FPGA RTL design tools, ModelSim RTL simulation tools, Synplicity synthesis, and HyperLynx IBIS SI simulation tools. \n \nMy goals are to apply all these skills in a challenging, rewarding, and leading-edge company, where the goal is to win and accomplish my stated deliverables. Specialties:High-speed digital design, Verilog & VHDL RTL FPGA design, PCB circuit board design & signal integrity simulation, technical team leadership and mentoring, technical project management. Summary I've designed a lot of large, high-speed, complex circuit boards and SOC development platforms involving custom ASIC devices and FPGA's for telecom, switching, and embedded silicon testing/prototyping applications. I've also designed a lot of FPGA & CPLD RTL designs for controlling and managing these large system platforms, involving packet generation/reception of the Opteron CPU HyperTransport bus, PowerPC 60X bus, and PCI bus bridging/translation, clock controller management, and bus interface snooping/probing applications. I've been using Cadence PCB design tools since about 1997, and have extensive experience with Cadence Concept HDL, Allegro, Specctraquest, and Constraint Manager. I'm well experienced in using both Altera Quartus and Xilinx ISE FPGA RTL design tools, ModelSim RTL simulation tools, Synplicity synthesis, and HyperLynx IBIS SI simulation tools. \n \nMy goals are to apply all these skills in a challenging, rewarding, and leading-edge company, where the goal is to win and accomplish my stated deliverables. Specialties:High-speed digital design, Verilog & VHDL RTL FPGA design, PCB circuit board design & signal integrity simulation, technical team leadership and mentoring, technical project management. I've designed a lot of large, high-speed, complex circuit boards and SOC development platforms involving custom ASIC devices and FPGA's for telecom, switching, and embedded silicon testing/prototyping applications. I've also designed a lot of FPGA & CPLD RTL designs for controlling and managing these large system platforms, involving packet generation/reception of the Opteron CPU HyperTransport bus, PowerPC 60X bus, and PCI bus bridging/translation, clock controller management, and bus interface snooping/probing applications. I've been using Cadence PCB design tools since about 1997, and have extensive experience with Cadence Concept HDL, Allegro, Specctraquest, and Constraint Manager. I'm well experienced in using both Altera Quartus and Xilinx ISE FPGA RTL design tools, ModelSim RTL simulation tools, Synplicity synthesis, and HyperLynx IBIS SI simulation tools. \n \nMy goals are to apply all these skills in a challenging, rewarding, and leading-edge company, where the goal is to win and accomplish my stated deliverables. Specialties:High-speed digital design, Verilog & VHDL RTL FPGA design, PCB circuit board design & signal integrity simulation, technical team leadership and mentoring, technical project management. I've designed a lot of large, high-speed, complex circuit boards and SOC development platforms involving custom ASIC devices and FPGA's for telecom, switching, and embedded silicon testing/prototyping applications. I've also designed a lot of FPGA & CPLD RTL designs for controlling and managing these large system platforms, involving packet generation/reception of the Opteron CPU HyperTransport bus, PowerPC 60X bus, and PCI bus bridging/translation, clock controller management, and bus interface snooping/probing applications. I've been using Cadence PCB design tools since about 1997, and have extensive experience with Cadence Concept HDL, Allegro, Specctraquest, and Constraint Manager. I'm well experienced in using both Altera Quartus and Xilinx ISE FPGA RTL design tools, ModelSim RTL simulation tools, Synplicity synthesis, and HyperLynx IBIS SI simulation tools. \n \nMy goals are to apply all these skills in a challenging, rewarding, and leading-edge company, where the goal is to win and accomplish my stated deliverables. Specialties:High-speed digital design, Verilog & VHDL RTL FPGA design, PCB circuit board design & signal integrity simulation, technical team leadership and mentoring, technical project management. Experience Senior Hardware Engineer Intel Corporation February 2013  – Present (2 years 7 months) Hardware Design Engineer Coherent Logix March 2009  –  November 2012  (3 years 9 months) Senior Design Engineer for digital video/camera pipeline & DSP system hardware, involving the development of high-speed video capture circuit boards and FPGA RTL design. Design of digital video data pipeline at the FPGA and board level. Design of custom DSP ASIC system hardware and silicon validation platforms. Signal integrity simulation and Logic/RTL simulation. \n \n-Designed RF wireless chipset development platform including ultra low-noise LDO linear regulator power supply system. \n-Designed LTE wireless base station hardware platform. MTS-Hardware Design Engineer AMD September 2006  –  January 2009  (2 years 5 months) Design of high-speed circuit boards and FPGA's. Hardware debug tools development for AMD Athlon64 & Phenom multi-core microprocessors. Design of HyperTransport interface prototype test hardware & FPGA platforms using multi-gigabit transceiver I/O buffers. Lab debug of DDR2 SDRAM interfaces, HyperTransport interfaces, and PCI-Express interfaces using Logic Analyzers & Oscilloscopes on prototype hardware platforms. MTS-Hardware Design Engineer Agere Systems January 2002  –  August 2006  (4 years 8 months) high-speed electronic design of circuit boards, FPGA's, \nnetwork processor chips, for broadband telecommunications \nequipment (routers, DSL modems, switches, etc.) \nDesigned hardware platforms & FPGA's for \"Pi-ATM\" ATM VLSI chip set and APP750/APP350 Network Processor VLSI chip sets \nAllentown, PA facility 2002-2004 \nAustin, TX facility 2004-2006 \nNOTE: Formerly known as Lucent Technologies-Microelectronics Division prior to the Lucent spinoff and acquisition of Agere MTS-Hardware Design Engineer Lucent Technologies 1994  –  2001  (7 years) high-speed electronic design of circuit boards, FPGA's, \nnetwork processor chips, for broadband telecommunications  \nequipment (routers, DSL modems, switches, etc.) \nDesigned hardware platforms & FPGA's for \"ATLANTA\" ATM VLSI chip set (ATM Layer Cell Processor & Switch Fabric) \nBell Laboratories - Holmdel, NJ facility 1994-1997 \nBell Laboratories - Murray Hill, NJ facility 1997-2001 \nAgere Systems - Allentown, PA facility 2002-2006 Senior Hardware Engineer Intel Corporation February 2013  – Present (2 years 7 months) Senior Hardware Engineer Intel Corporation February 2013  – Present (2 years 7 months) Hardware Design Engineer Coherent Logix March 2009  –  November 2012  (3 years 9 months) Senior Design Engineer for digital video/camera pipeline & DSP system hardware, involving the development of high-speed video capture circuit boards and FPGA RTL design. Design of digital video data pipeline at the FPGA and board level. Design of custom DSP ASIC system hardware and silicon validation platforms. Signal integrity simulation and Logic/RTL simulation. \n \n-Designed RF wireless chipset development platform including ultra low-noise LDO linear regulator power supply system. \n-Designed LTE wireless base station hardware platform. Hardware Design Engineer Coherent Logix March 2009  –  November 2012  (3 years 9 months) Senior Design Engineer for digital video/camera pipeline & DSP system hardware, involving the development of high-speed video capture circuit boards and FPGA RTL design. Design of digital video data pipeline at the FPGA and board level. Design of custom DSP ASIC system hardware and silicon validation platforms. Signal integrity simulation and Logic/RTL simulation. \n \n-Designed RF wireless chipset development platform including ultra low-noise LDO linear regulator power supply system. \n-Designed LTE wireless base station hardware platform. MTS-Hardware Design Engineer AMD September 2006  –  January 2009  (2 years 5 months) Design of high-speed circuit boards and FPGA's. Hardware debug tools development for AMD Athlon64 & Phenom multi-core microprocessors. Design of HyperTransport interface prototype test hardware & FPGA platforms using multi-gigabit transceiver I/O buffers. Lab debug of DDR2 SDRAM interfaces, HyperTransport interfaces, and PCI-Express interfaces using Logic Analyzers & Oscilloscopes on prototype hardware platforms. MTS-Hardware Design Engineer AMD September 2006  –  January 2009  (2 years 5 months) Design of high-speed circuit boards and FPGA's. Hardware debug tools development for AMD Athlon64 & Phenom multi-core microprocessors. Design of HyperTransport interface prototype test hardware & FPGA platforms using multi-gigabit transceiver I/O buffers. Lab debug of DDR2 SDRAM interfaces, HyperTransport interfaces, and PCI-Express interfaces using Logic Analyzers & Oscilloscopes on prototype hardware platforms. MTS-Hardware Design Engineer Agere Systems January 2002  –  August 2006  (4 years 8 months) high-speed electronic design of circuit boards, FPGA's, \nnetwork processor chips, for broadband telecommunications \nequipment (routers, DSL modems, switches, etc.) \nDesigned hardware platforms & FPGA's for \"Pi-ATM\" ATM VLSI chip set and APP750/APP350 Network Processor VLSI chip sets \nAllentown, PA facility 2002-2004 \nAustin, TX facility 2004-2006 \nNOTE: Formerly known as Lucent Technologies-Microelectronics Division prior to the Lucent spinoff and acquisition of Agere MTS-Hardware Design Engineer Agere Systems January 2002  –  August 2006  (4 years 8 months) high-speed electronic design of circuit boards, FPGA's, \nnetwork processor chips, for broadband telecommunications \nequipment (routers, DSL modems, switches, etc.) \nDesigned hardware platforms & FPGA's for \"Pi-ATM\" ATM VLSI chip set and APP750/APP350 Network Processor VLSI chip sets \nAllentown, PA facility 2002-2004 \nAustin, TX facility 2004-2006 \nNOTE: Formerly known as Lucent Technologies-Microelectronics Division prior to the Lucent spinoff and acquisition of Agere MTS-Hardware Design Engineer Lucent Technologies 1994  –  2001  (7 years) high-speed electronic design of circuit boards, FPGA's, \nnetwork processor chips, for broadband telecommunications  \nequipment (routers, DSL modems, switches, etc.) \nDesigned hardware platforms & FPGA's for \"ATLANTA\" ATM VLSI chip set (ATM Layer Cell Processor & Switch Fabric) \nBell Laboratories - Holmdel, NJ facility 1994-1997 \nBell Laboratories - Murray Hill, NJ facility 1997-2001 \nAgere Systems - Allentown, PA facility 2002-2006 MTS-Hardware Design Engineer Lucent Technologies 1994  –  2001  (7 years) high-speed electronic design of circuit boards, FPGA's, \nnetwork processor chips, for broadband telecommunications  \nequipment (routers, DSL modems, switches, etc.) \nDesigned hardware platforms & FPGA's for \"ATLANTA\" ATM VLSI chip set (ATM Layer Cell Processor & Switch Fabric) \nBell Laboratories - Holmdel, NJ facility 1994-1997 \nBell Laboratories - Murray Hill, NJ facility 1997-2001 \nAgere Systems - Allentown, PA facility 2002-2006 Skills FPGA PCB design Xilinx Signal Integrity Verilog VHDL ModelSim Hardware Design Schematic Capture Microprocessors Circuit Design Digital Design Embedded Systems Allegro Integrated Circuit... Hardware Architecture Debugging RTL design Logic Analyzer IC PCIe Xilinx ISE Processors Simulations Emulation ASIC DFT Microarchitecture Static Timing Analysis Digital Signal... Cadence VLSI Logic Synthesis Altera Quartus DDR2 SoC See 21+     See less Skills  FPGA PCB design Xilinx Signal Integrity Verilog VHDL ModelSim Hardware Design Schematic Capture Microprocessors Circuit Design Digital Design Embedded Systems Allegro Integrated Circuit... Hardware Architecture Debugging RTL design Logic Analyzer IC PCIe Xilinx ISE Processors Simulations Emulation ASIC DFT Microarchitecture Static Timing Analysis Digital Signal... Cadence VLSI Logic Synthesis Altera Quartus DDR2 SoC See 21+     See less FPGA PCB design Xilinx Signal Integrity Verilog VHDL ModelSim Hardware Design Schematic Capture Microprocessors Circuit Design Digital Design Embedded Systems Allegro Integrated Circuit... Hardware Architecture Debugging RTL design Logic Analyzer IC PCIe Xilinx ISE Processors Simulations Emulation ASIC DFT Microarchitecture Static Timing Analysis Digital Signal... Cadence VLSI Logic Synthesis Altera Quartus DDR2 SoC See 21+     See less FPGA PCB design Xilinx Signal Integrity Verilog VHDL ModelSim Hardware Design Schematic Capture Microprocessors Circuit Design Digital Design Embedded Systems Allegro Integrated Circuit... Hardware Architecture Debugging RTL design Logic Analyzer IC PCIe Xilinx ISE Processors Simulations Emulation ASIC DFT Microarchitecture Static Timing Analysis Digital Signal... Cadence VLSI Logic Synthesis Altera Quartus DDR2 SoC See 21+     See less Education Columbia University in the City of New York 1998  – 1999 MS-EE graduate coursework 1998-1999 (part-time) Old Dominion University BS-Computer Science 1986  – 1990 New York University - Polytechnic School of Engineering MS-EE graduate coursework 1992-1994 (part-time) RFH Columbia University in the City of New York 1998  – 1999 MS-EE graduate coursework 1998-1999 (part-time) Columbia University in the City of New York 1998  – 1999 MS-EE graduate coursework 1998-1999 (part-time) Columbia University in the City of New York 1998  – 1999 MS-EE graduate coursework 1998-1999 (part-time) Old Dominion University BS-Computer Science 1986  – 1990 Old Dominion University BS-Computer Science 1986  – 1990 Old Dominion University BS-Computer Science 1986  – 1990 New York University - Polytechnic School of Engineering MS-EE graduate coursework 1992-1994 (part-time) New York University - Polytechnic School of Engineering MS-EE graduate coursework 1992-1994 (part-time) New York University - Polytechnic School of Engineering MS-EE graduate coursework 1992-1994 (part-time) RFH RFH RFH ", "Experience Principal Engineer Cavium Inc May 2014  – Present (1 year 4 months) Marlborough, Ma Senior Hardware Design Engineer Intel Corporation 2013  –  April 2014  (1 year) Intel Xeon Server Design Senior Hardware Engineer Intel Corporation 2008  –  2012  (4 years) Intel Xeon Microprocessor Design Hardware Engineer Intel Inc 2003  –  2007  (4 years) Intel Itanium Microprocessor Design Hardware Engineer Compaq August 2000  –  December 2002  (2 years 5 months) DEC-Alpha Microprocessor Design Principal Engineer Cavium Inc May 2014  – Present (1 year 4 months) Marlborough, Ma Principal Engineer Cavium Inc May 2014  – Present (1 year 4 months) Marlborough, Ma Senior Hardware Design Engineer Intel Corporation 2013  –  April 2014  (1 year) Intel Xeon Server Design Senior Hardware Design Engineer Intel Corporation 2013  –  April 2014  (1 year) Intel Xeon Server Design Senior Hardware Engineer Intel Corporation 2008  –  2012  (4 years) Intel Xeon Microprocessor Design Senior Hardware Engineer Intel Corporation 2008  –  2012  (4 years) Intel Xeon Microprocessor Design Hardware Engineer Intel Inc 2003  –  2007  (4 years) Intel Itanium Microprocessor Design Hardware Engineer Intel Inc 2003  –  2007  (4 years) Intel Itanium Microprocessor Design Hardware Engineer Compaq August 2000  –  December 2002  (2 years 5 months) DEC-Alpha Microprocessor Design Hardware Engineer Compaq August 2000  –  December 2002  (2 years 5 months) DEC-Alpha Microprocessor Design Skills VLSI Circuit Design Computer Architecture Verilog Processors Intel IC RTL design SoC Static Timing Analysis EDA TCL Hardware Architecture SystemVerilog ASIC Semiconductors Microprocessors Logic Design PCIe Hardware See 5+     See less Skills  VLSI Circuit Design Computer Architecture Verilog Processors Intel IC RTL design SoC Static Timing Analysis EDA TCL Hardware Architecture SystemVerilog ASIC Semiconductors Microprocessors Logic Design PCIe Hardware See 5+     See less VLSI Circuit Design Computer Architecture Verilog Processors Intel IC RTL design SoC Static Timing Analysis EDA TCL Hardware Architecture SystemVerilog ASIC Semiconductors Microprocessors Logic Design PCIe Hardware See 5+     See less VLSI Circuit Design Computer Architecture Verilog Processors Intel IC RTL design SoC Static Timing Analysis EDA TCL Hardware Architecture SystemVerilog ASIC Semiconductors Microprocessors Logic Design PCIe Hardware See 5+     See less Education Indian Institute of Technology, Madras B.Tech,  Electrical & Electronics Engg 1994  – 1998 Indian Institute of Technology, Madras B.Tech,  Electrical & Electronics Engg 1994  – 1998 Indian Institute of Technology, Madras B.Tech,  Electrical & Electronics Engg 1994  – 1998 Indian Institute of Technology, Madras B.Tech,  Electrical & Electronics Engg 1994  – 1998 ", "Summary Senior Design Engineer with solid core of ASIC, FPGA, high speed signaling, and PCB design experience as well as complementary skills in DSP, analog, RF, and embedded SW. Creative problem-solver who excels at leading small cross-functional teams to deliver innovative technology. Repeatedly recognized for high quality results. Summary Senior Design Engineer with solid core of ASIC, FPGA, high speed signaling, and PCB design experience as well as complementary skills in DSP, analog, RF, and embedded SW. Creative problem-solver who excels at leading small cross-functional teams to deliver innovative technology. Repeatedly recognized for high quality results. Senior Design Engineer with solid core of ASIC, FPGA, high speed signaling, and PCB design experience as well as complementary skills in DSP, analog, RF, and embedded SW. Creative problem-solver who excels at leading small cross-functional teams to deliver innovative technology. Repeatedly recognized for high quality results. Senior Design Engineer with solid core of ASIC, FPGA, high speed signaling, and PCB design experience as well as complementary skills in DSP, analog, RF, and embedded SW. Creative problem-solver who excels at leading small cross-functional teams to deliver innovative technology. Repeatedly recognized for high quality results. Experience Senior Hardware Engineer Intel Corporation 2014  – Present (1 year) Hillsboro, Oregon Wireless system design Senior Hardware Engineer Intel Labs 2001  –  2013  (12 years) Hillsboro, Oregon Developed a millimeter wave wireless point to point prototype. \nDeveloped research prototypes of 802.16 base-station, and 802.11ad PHY. \nDesigned a novel multi-stream and multi-protocol Viterbi decoder in SystemC. \nDeveloped a 480Mbps prototype modem for ultrawideband (UWB) wireless research. Senior Hardware Engineer Intel 1998  –  2001  (3 years) Hillsboro, Oregon Led design teams in FPGA and ASIC development and directed system validation for residential networking gateways. Hardware Engineer Intel Corporation April 1993  –  1998  (5 years) Hillsboro, Oregon Developed ASIC designs for PC network interfaces \nDeveloped system simulations and high volume production test vectors for server chipset PCI interface Senior Hardware Engineer Intel Corporation 2014  – Present (1 year) Hillsboro, Oregon Wireless system design Senior Hardware Engineer Intel Corporation 2014  – Present (1 year) Hillsboro, Oregon Wireless system design Senior Hardware Engineer Intel Labs 2001  –  2013  (12 years) Hillsboro, Oregon Developed a millimeter wave wireless point to point prototype. \nDeveloped research prototypes of 802.16 base-station, and 802.11ad PHY. \nDesigned a novel multi-stream and multi-protocol Viterbi decoder in SystemC. \nDeveloped a 480Mbps prototype modem for ultrawideband (UWB) wireless research. Senior Hardware Engineer Intel Labs 2001  –  2013  (12 years) Hillsboro, Oregon Developed a millimeter wave wireless point to point prototype. \nDeveloped research prototypes of 802.16 base-station, and 802.11ad PHY. \nDesigned a novel multi-stream and multi-protocol Viterbi decoder in SystemC. \nDeveloped a 480Mbps prototype modem for ultrawideband (UWB) wireless research. Senior Hardware Engineer Intel 1998  –  2001  (3 years) Hillsboro, Oregon Led design teams in FPGA and ASIC development and directed system validation for residential networking gateways. Senior Hardware Engineer Intel 1998  –  2001  (3 years) Hillsboro, Oregon Led design teams in FPGA and ASIC development and directed system validation for residential networking gateways. Hardware Engineer Intel Corporation April 1993  –  1998  (5 years) Hillsboro, Oregon Developed ASIC designs for PC network interfaces \nDeveloped system simulations and high volume production test vectors for server chipset PCI interface Hardware Engineer Intel Corporation April 1993  –  1998  (5 years) Hillsboro, Oregon Developed ASIC designs for PC network interfaces \nDeveloped system simulations and high volume production test vectors for server chipset PCI interface Skills RTL design FPGA Verilog ASIC VHDL SoC Debugging Functional Verification Logic Design Physical Layer Integrated Circuit... Embedded Systems Matlab Wireless Communications... RF Engineering Python Hardware Architecture Microprocessors Signal Integrity RTL coding VLSI ModelSim See 7+     See less Skills  RTL design FPGA Verilog ASIC VHDL SoC Debugging Functional Verification Logic Design Physical Layer Integrated Circuit... Embedded Systems Matlab Wireless Communications... RF Engineering Python Hardware Architecture Microprocessors Signal Integrity RTL coding VLSI ModelSim See 7+     See less RTL design FPGA Verilog ASIC VHDL SoC Debugging Functional Verification Logic Design Physical Layer Integrated Circuit... Embedded Systems Matlab Wireless Communications... RF Engineering Python Hardware Architecture Microprocessors Signal Integrity RTL coding VLSI ModelSim See 7+     See less RTL design FPGA Verilog ASIC VHDL SoC Debugging Functional Verification Logic Design Physical Layer Integrated Circuit... Embedded Systems Matlab Wireless Communications... RF Engineering Python Hardware Architecture Microprocessors Signal Integrity RTL coding VLSI ModelSim See 7+     See less Education University of Washington Bachelor of Science (BS),  Electrical Engineering 1987  – 1992 University of Washington Bachelor of Science (BS),  Electrical Engineering 1987  – 1992 University of Washington Bachelor of Science (BS),  Electrical Engineering 1987  – 1992 University of Washington Bachelor of Science (BS),  Electrical Engineering 1987  – 1992 ", "Summary  9 years of experience in hardware design (over 6 years in the same team)  \n Have worked on ODM (LG/Moto/Sony), JDM (Lenovo) and own brand projects  \n Major in mobile phone baseband (PCB layout placement and routing review) and acoustic  \n Familiar with different platforms – Qualcomm, Samsung, MTK and Intel  \n Present technical training for developing new product/chipsets  \n Provide customer design review and issue troubleshooting.  \n Co-work with backend team to fix and improve reference designs  \n Experience as Customer Hardware Project Manager  Summary  9 years of experience in hardware design (over 6 years in the same team)  \n Have worked on ODM (LG/Moto/Sony), JDM (Lenovo) and own brand projects  \n Major in mobile phone baseband (PCB layout placement and routing review) and acoustic  \n Familiar with different platforms – Qualcomm, Samsung, MTK and Intel  \n Present technical training for developing new product/chipsets  \n Provide customer design review and issue troubleshooting.  \n Co-work with backend team to fix and improve reference designs  \n Experience as Customer Hardware Project Manager   9 years of experience in hardware design (over 6 years in the same team)  \n Have worked on ODM (LG/Moto/Sony), JDM (Lenovo) and own brand projects  \n Major in mobile phone baseband (PCB layout placement and routing review) and acoustic  \n Familiar with different platforms – Qualcomm, Samsung, MTK and Intel  \n Present technical training for developing new product/chipsets  \n Provide customer design review and issue troubleshooting.  \n Co-work with backend team to fix and improve reference designs  \n Experience as Customer Hardware Project Manager   9 years of experience in hardware design (over 6 years in the same team)  \n Have worked on ODM (LG/Moto/Sony), JDM (Lenovo) and own brand projects  \n Major in mobile phone baseband (PCB layout placement and routing review) and acoustic  \n Familiar with different platforms – Qualcomm, Samsung, MTK and Intel  \n Present technical training for developing new product/chipsets  \n Provide customer design review and issue troubleshooting.  \n Co-work with backend team to fix and improve reference designs  \n Experience as Customer Hardware Project Manager  Experience Senior Hardware Engineer Intel Corporation May 2012  – Present (3 years 4 months) Taipei City, Taiwan • Hardware project manager and hardware engineer for tier one customer projects  \n• Analyze customer application issues and provide solutions  \n• Provide technical training, schematics, layout review for customers  \n• Co-work with backend team to fix and improve reference design  \n• Support tier one customers and most important projects in Intel Taiwan  \n• Experience in Intel platform  \n Hardware Manager Kong-Profit May 2011  –  April 2012  (1 year) Shenzhen, Guangdong, China • Schematics design  \n• Layout placement and routing check  \n• Co-work with RF/ME/Antenna for product integration  \n• Training program development and work assignment  \n• New product evaluation  \n• Experience in Qualcomm platform  Senior Hardware Engineer Compal Communications, Inc. October 2010  –  May 2011  (8 months) Taipei City, Taiwan • Project leader and baseband team leader  \n• Schematics design  \n• Layout placement and routing check  \n• Co-work with RF/ME/Antenna for product integration  \n• Baseband work assignment.  \n• Provide RFQ for new customer and new project  \n• Experience in Qualcomm platform  Senior Hardware Engineer Arima September 2008  –  October 2010  (2 years 2 months) New Taipei City, Taiwan • BOM finishing, components selection, 2nd source confirmation  \n• Schematics design  \n• PCB layout placement, routing check and co-work with ME for new product  \n• Current consumption, charge and discharge regulation  \n• ESD solution  \n• Audio and acoustic testing and fine tuning  \n• Support production line in China and Brazil factory  \n• Experience in MTK and Infineon platform  Senior Hardware Engineer Inventec December 2006  –  September 2008  (1 year 10 months) Taipei City, Taiwan • Function testing, debug and signals measurement  \n• Schematics design  \n• Layout check  \n• BOM finishing, components selection, 2nd source confirmation  \n• Experience in Qualcomm and Samsung platform  Senior Hardware Engineer Intel Corporation May 2012  – Present (3 years 4 months) Taipei City, Taiwan • Hardware project manager and hardware engineer for tier one customer projects  \n• Analyze customer application issues and provide solutions  \n• Provide technical training, schematics, layout review for customers  \n• Co-work with backend team to fix and improve reference design  \n• Support tier one customers and most important projects in Intel Taiwan  \n• Experience in Intel platform  \n Senior Hardware Engineer Intel Corporation May 2012  – Present (3 years 4 months) Taipei City, Taiwan • Hardware project manager and hardware engineer for tier one customer projects  \n• Analyze customer application issues and provide solutions  \n• Provide technical training, schematics, layout review for customers  \n• Co-work with backend team to fix and improve reference design  \n• Support tier one customers and most important projects in Intel Taiwan  \n• Experience in Intel platform  \n Hardware Manager Kong-Profit May 2011  –  April 2012  (1 year) Shenzhen, Guangdong, China • Schematics design  \n• Layout placement and routing check  \n• Co-work with RF/ME/Antenna for product integration  \n• Training program development and work assignment  \n• New product evaluation  \n• Experience in Qualcomm platform  Hardware Manager Kong-Profit May 2011  –  April 2012  (1 year) Shenzhen, Guangdong, China • Schematics design  \n• Layout placement and routing check  \n• Co-work with RF/ME/Antenna for product integration  \n• Training program development and work assignment  \n• New product evaluation  \n• Experience in Qualcomm platform  Senior Hardware Engineer Compal Communications, Inc. October 2010  –  May 2011  (8 months) Taipei City, Taiwan • Project leader and baseband team leader  \n• Schematics design  \n• Layout placement and routing check  \n• Co-work with RF/ME/Antenna for product integration  \n• Baseband work assignment.  \n• Provide RFQ for new customer and new project  \n• Experience in Qualcomm platform  Senior Hardware Engineer Compal Communications, Inc. October 2010  –  May 2011  (8 months) Taipei City, Taiwan • Project leader and baseband team leader  \n• Schematics design  \n• Layout placement and routing check  \n• Co-work with RF/ME/Antenna for product integration  \n• Baseband work assignment.  \n• Provide RFQ for new customer and new project  \n• Experience in Qualcomm platform  Senior Hardware Engineer Arima September 2008  –  October 2010  (2 years 2 months) New Taipei City, Taiwan • BOM finishing, components selection, 2nd source confirmation  \n• Schematics design  \n• PCB layout placement, routing check and co-work with ME for new product  \n• Current consumption, charge and discharge regulation  \n• ESD solution  \n• Audio and acoustic testing and fine tuning  \n• Support production line in China and Brazil factory  \n• Experience in MTK and Infineon platform  Senior Hardware Engineer Arima September 2008  –  October 2010  (2 years 2 months) New Taipei City, Taiwan • BOM finishing, components selection, 2nd source confirmation  \n• Schematics design  \n• PCB layout placement, routing check and co-work with ME for new product  \n• Current consumption, charge and discharge regulation  \n• ESD solution  \n• Audio and acoustic testing and fine tuning  \n• Support production line in China and Brazil factory  \n• Experience in MTK and Infineon platform  Senior Hardware Engineer Inventec December 2006  –  September 2008  (1 year 10 months) Taipei City, Taiwan • Function testing, debug and signals measurement  \n• Schematics design  \n• Layout check  \n• BOM finishing, components selection, 2nd source confirmation  \n• Experience in Qualcomm and Samsung platform  Senior Hardware Engineer Inventec December 2006  –  September 2008  (1 year 10 months) Taipei City, Taiwan • Function testing, debug and signals measurement  \n• Schematics design  \n• Layout check  \n• BOM finishing, components selection, 2nd source confirmation  \n• Experience in Qualcomm and Samsung platform  Skills OrCAD Allegro PADS Baseband Hardware Architecture Power Management I2C I2S USB MIPI Acoustic Debugging Mobile Devices GSM LTE UMTS HSPA Bluetooth WiFi See 4+     See less Skills  OrCAD Allegro PADS Baseband Hardware Architecture Power Management I2C I2S USB MIPI Acoustic Debugging Mobile Devices GSM LTE UMTS HSPA Bluetooth WiFi See 4+     See less OrCAD Allegro PADS Baseband Hardware Architecture Power Management I2C I2S USB MIPI Acoustic Debugging Mobile Devices GSM LTE UMTS HSPA Bluetooth WiFi See 4+     See less OrCAD Allegro PADS Baseband Hardware Architecture Power Management I2C I2S USB MIPI Acoustic Debugging Mobile Devices GSM LTE UMTS HSPA Bluetooth WiFi See 4+     See less Education Tatung University Master's degree,  Communication Engineering 2004  – 2006 Yuan-Ze University Bachelor's degree,  Electrical Engineering 1997  – 2001 Tatung University Master's degree,  Communication Engineering 2004  – 2006 Tatung University Master's degree,  Communication Engineering 2004  – 2006 Tatung University Master's degree,  Communication Engineering 2004  – 2006 Yuan-Ze University Bachelor's degree,  Electrical Engineering 1997  – 2001 Yuan-Ze University Bachelor's degree,  Electrical Engineering 1997  – 2001 Yuan-Ze University Bachelor's degree,  Electrical Engineering 1997  – 2001 ", "Experience Senior Hardware Engineer Intel Corporation March 2012  – Present (3 years 6 months) Folsom, CA Coordinating post silicon performance validation of integrated graphics processors. Working with a variety of pre and post silicon observation and validation tools to analyze product performance with the goal of tuning power/performance via driver or hardware changes. Work with multiple hardware and software teams to identify and solve performance issues in the product before launch, and to drive future architectural and product decisions based on data and analysis. Senior Design Engineer Intel Corporation November 2003  –  March 2012  (8 years 5 months) Folsom, CA Developed component RTL for integrated graphics processors, from high level specifications through to initial synthesis, using primarily system verilog and VHDL.Included development and execution of a test plan/environment for functional validation and knowledge of associated tools and methods. Also responsible as a technical lead for coordinating other developers in validation of unit clusters. Senior Hardware Engineer Intel Corporation March 2012  – Present (3 years 6 months) Folsom, CA Coordinating post silicon performance validation of integrated graphics processors. Working with a variety of pre and post silicon observation and validation tools to analyze product performance with the goal of tuning power/performance via driver or hardware changes. Work with multiple hardware and software teams to identify and solve performance issues in the product before launch, and to drive future architectural and product decisions based on data and analysis. Senior Hardware Engineer Intel Corporation March 2012  – Present (3 years 6 months) Folsom, CA Coordinating post silicon performance validation of integrated graphics processors. Working with a variety of pre and post silicon observation and validation tools to analyze product performance with the goal of tuning power/performance via driver or hardware changes. Work with multiple hardware and software teams to identify and solve performance issues in the product before launch, and to drive future architectural and product decisions based on data and analysis. Senior Design Engineer Intel Corporation November 2003  –  March 2012  (8 years 5 months) Folsom, CA Developed component RTL for integrated graphics processors, from high level specifications through to initial synthesis, using primarily system verilog and VHDL.Included development and execution of a test plan/environment for functional validation and knowledge of associated tools and methods. Also responsible as a technical lead for coordinating other developers in validation of unit clusters. Senior Design Engineer Intel Corporation November 2003  –  March 2012  (8 years 5 months) Folsom, CA Developed component RTL for integrated graphics processors, from high level specifications through to initial synthesis, using primarily system verilog and VHDL.Included development and execution of a test plan/environment for functional validation and knowledge of associated tools and methods. Also responsible as a technical lead for coordinating other developers in validation of unit clusters. Skills Verilog Debugging Computer Graphics Silicon Validation Computer Architecture RTL design RTL verification direct3d Skills  Verilog Debugging Computer Graphics Silicon Validation Computer Architecture RTL design RTL verification direct3d Verilog Debugging Computer Graphics Silicon Validation Computer Architecture RTL design RTL verification direct3d Verilog Debugging Computer Graphics Silicon Validation Computer Architecture RTL design RTL verification direct3d Education University of Illinois at Urbana-Champaign BS,  Computer Engineering 1996  – 2000 University of Illinois at Urbana-Champaign BS,  Computer Engineering 1996  – 2000 University of Illinois at Urbana-Champaign BS,  Computer Engineering 1996  – 2000 University of Illinois at Urbana-Champaign BS,  Computer Engineering 1996  – 2000 ", "Summary 20+ years of experience in: \n* High-level hardware description language design and implementation. \n* Application Domain Specific Processor / Accelerator (ADSP, ASIP) design and implementation. \n* Semiconductor SoC IP automation and configurability. \n* Communication PHY DSP theory, algorithms, architecture and applications. \n* Interconnect fabric architecture and design. \n \nSpecial interest in: stack processors, systolic arrays, parallel, superpipelined and reconfigurable processors. Summary 20+ years of experience in: \n* High-level hardware description language design and implementation. \n* Application Domain Specific Processor / Accelerator (ADSP, ASIP) design and implementation. \n* Semiconductor SoC IP automation and configurability. \n* Communication PHY DSP theory, algorithms, architecture and applications. \n* Interconnect fabric architecture and design. \n \nSpecial interest in: stack processors, systolic arrays, parallel, superpipelined and reconfigurable processors. 20+ years of experience in: \n* High-level hardware description language design and implementation. \n* Application Domain Specific Processor / Accelerator (ADSP, ASIP) design and implementation. \n* Semiconductor SoC IP automation and configurability. \n* Communication PHY DSP theory, algorithms, architecture and applications. \n* Interconnect fabric architecture and design. \n \nSpecial interest in: stack processors, systolic arrays, parallel, superpipelined and reconfigurable processors. 20+ years of experience in: \n* High-level hardware description language design and implementation. \n* Application Domain Specific Processor / Accelerator (ADSP, ASIP) design and implementation. \n* Semiconductor SoC IP automation and configurability. \n* Communication PHY DSP theory, algorithms, architecture and applications. \n* Interconnect fabric architecture and design. \n \nSpecial interest in: stack processors, systolic arrays, parallel, superpipelined and reconfigurable processors. Experience Principal Engineer Arteris April 2014  – Present (1 year 5 months) Campbell, CA Leading software development team in design of customer facing SoC IP configuration and generation tool. Developing new high-level Hardware Description Language; tools for language analysis and processing. Senior Design Engineer Intel Corporation October 2011  –  April 2014  (2 years 7 months) Santa Clara, CA Development of VLSI Soft-IP collateral, configuration / generation software (TCL, Perl) for several configurable SoC infrastructure / fabric IPs. \n \nWas responsible on architecture and Verilog RTL design of custom external memory interface. Feature enhancements and porting of several Verilog / VHDL RTL blocks for new multi-standard, mixed signal wireless IC. Perl scripting / automation of design and documentation flows. Systems Architect Intel Corporation, Digital Home Group June 2008  –  October 2011  (3 years 5 months) Chandler, AZ Custom base-band DSP processor extended with elastic re-configurable systolic array technology: \n- Technical leadership; \n- Architecture, instruction set specification / design; \n- Design-time development and processor generation software tools (Perl); \n- C++ firmware development, compiler tools architecture; \n \nFrequency domain ATSC demodulator: \n- Leadership through research, algorithm, MATLAB model development and performance evaluation / optimization. SoC Architect Intel Labs, Wireless Communications Lab April 2006  –  May 2008  (2 years 2 months) St.Petersburg, Russia Architected design-time configurable, run-time programmable / reconfigurable array data-streaming machine IP for multi radio based SoCs. \n- Author micro-architecture specifications \n- Ensure systems requirements are met \n- Analyze applications and incorporate key technologies and standards \n- Technical leadership of RTL design, compiler tool-chain and application development teams to perform joint optimization of the complexity / programmability trade-offs involving hardware / software partitioning \n- SoC power efficiency architecture exploration research Senior VLSI Design Engineer Intel Labs, Wireless Communications Lab February 2005  –  March 2006  (1 year 2 months) St.Petersburg, Russia Programmable OFDM specific DSP engine: \n- Architecture definition \n- Verilog RTL design \n- Simulation, synthesis, SystemVerilog functional verification, FPGA prototyping \n- IEEE802.11a protocol porting Senior Hardware Engineer Intel Corporation, Intel Communications Group August 2003  –  January 2005  (1 year 6 months) Nizhny Novgorod, Russia Building SoC design / verification productivity system for Broadband Wireless IEEE 802.16 (WiMAX) project: \n- Pre-silicon chip validation environment, and tools development \n- Build custom Multi-FPGA full chip prototyping platform \n- Embedded DSP processor microarchitecture optimizations Digital IC Designer NEOTEC Semiconductor Ltd. April 2001  –  June 2003  (2 years 3 months) Chu Pei, Taiwan ARM based embedded multimedia platform SoC project: \n- Visual Multi Processor Unit with LCD controller and graphic acceleration functions \n- Integrated memory subsystem \n- Peripheral Processor Unit with SD MMC card functions \n- System and processor architecture, Verilog RTL, logic synthesis, static timing analysis, FPGA prototyping and performance analysis, Forth firmware development \n- Work as Project Manager in building up an corporative IP reuse and documentation infrastructure Head of design group Telecommunication Company of Molodechno (MTK) August 1997  –  March 2001  (3 years 8 months) Molodechno, Belarus Embedded system development \n- Schematic, Verilog RTL, telecommunication and voice application firmware \n- System and embedded 16-bit stack processor architecture, FPGA implementation \n- Russian mobile phone systems: \"Kart\"​, \"Altai\"​, \"VoLeMoT\"​, \"Vilia\" protocol, schematic, PCB, hardware and software implementation Application Engineer Laboratory of New Technologies (NTL) May 1996  –  June 1997  (1 year 2 months) Minsk, Belarus Engaged in development of new Stack microprocessor, testing, benchmarking of DSP algorithms, architecture documentation. Developing Forth compiler, library and applications. Electronic designer Radioplant \"Sputnik\", R&D Center August 1994  –  August 1996  (2 years 1 month) Molodechno, Belarus I developed the schematic and Forth firmware for the new mobile phone station using the stack processor. Implementation of radio modem and voice processing algorithms. Result: additional consumer functions, serial production at the plant, BOM cost reduction Principal Engineer Arteris April 2014  – Present (1 year 5 months) Campbell, CA Leading software development team in design of customer facing SoC IP configuration and generation tool. Developing new high-level Hardware Description Language; tools for language analysis and processing. Principal Engineer Arteris April 2014  – Present (1 year 5 months) Campbell, CA Leading software development team in design of customer facing SoC IP configuration and generation tool. Developing new high-level Hardware Description Language; tools for language analysis and processing. Senior Design Engineer Intel Corporation October 2011  –  April 2014  (2 years 7 months) Santa Clara, CA Development of VLSI Soft-IP collateral, configuration / generation software (TCL, Perl) for several configurable SoC infrastructure / fabric IPs. \n \nWas responsible on architecture and Verilog RTL design of custom external memory interface. Feature enhancements and porting of several Verilog / VHDL RTL blocks for new multi-standard, mixed signal wireless IC. Perl scripting / automation of design and documentation flows. Senior Design Engineer Intel Corporation October 2011  –  April 2014  (2 years 7 months) Santa Clara, CA Development of VLSI Soft-IP collateral, configuration / generation software (TCL, Perl) for several configurable SoC infrastructure / fabric IPs. \n \nWas responsible on architecture and Verilog RTL design of custom external memory interface. Feature enhancements and porting of several Verilog / VHDL RTL blocks for new multi-standard, mixed signal wireless IC. Perl scripting / automation of design and documentation flows. Systems Architect Intel Corporation, Digital Home Group June 2008  –  October 2011  (3 years 5 months) Chandler, AZ Custom base-band DSP processor extended with elastic re-configurable systolic array technology: \n- Technical leadership; \n- Architecture, instruction set specification / design; \n- Design-time development and processor generation software tools (Perl); \n- C++ firmware development, compiler tools architecture; \n \nFrequency domain ATSC demodulator: \n- Leadership through research, algorithm, MATLAB model development and performance evaluation / optimization. Systems Architect Intel Corporation, Digital Home Group June 2008  –  October 2011  (3 years 5 months) Chandler, AZ Custom base-band DSP processor extended with elastic re-configurable systolic array technology: \n- Technical leadership; \n- Architecture, instruction set specification / design; \n- Design-time development and processor generation software tools (Perl); \n- C++ firmware development, compiler tools architecture; \n \nFrequency domain ATSC demodulator: \n- Leadership through research, algorithm, MATLAB model development and performance evaluation / optimization. SoC Architect Intel Labs, Wireless Communications Lab April 2006  –  May 2008  (2 years 2 months) St.Petersburg, Russia Architected design-time configurable, run-time programmable / reconfigurable array data-streaming machine IP for multi radio based SoCs. \n- Author micro-architecture specifications \n- Ensure systems requirements are met \n- Analyze applications and incorporate key technologies and standards \n- Technical leadership of RTL design, compiler tool-chain and application development teams to perform joint optimization of the complexity / programmability trade-offs involving hardware / software partitioning \n- SoC power efficiency architecture exploration research SoC Architect Intel Labs, Wireless Communications Lab April 2006  –  May 2008  (2 years 2 months) St.Petersburg, Russia Architected design-time configurable, run-time programmable / reconfigurable array data-streaming machine IP for multi radio based SoCs. \n- Author micro-architecture specifications \n- Ensure systems requirements are met \n- Analyze applications and incorporate key technologies and standards \n- Technical leadership of RTL design, compiler tool-chain and application development teams to perform joint optimization of the complexity / programmability trade-offs involving hardware / software partitioning \n- SoC power efficiency architecture exploration research Senior VLSI Design Engineer Intel Labs, Wireless Communications Lab February 2005  –  March 2006  (1 year 2 months) St.Petersburg, Russia Programmable OFDM specific DSP engine: \n- Architecture definition \n- Verilog RTL design \n- Simulation, synthesis, SystemVerilog functional verification, FPGA prototyping \n- IEEE802.11a protocol porting Senior VLSI Design Engineer Intel Labs, Wireless Communications Lab February 2005  –  March 2006  (1 year 2 months) St.Petersburg, Russia Programmable OFDM specific DSP engine: \n- Architecture definition \n- Verilog RTL design \n- Simulation, synthesis, SystemVerilog functional verification, FPGA prototyping \n- IEEE802.11a protocol porting Senior Hardware Engineer Intel Corporation, Intel Communications Group August 2003  –  January 2005  (1 year 6 months) Nizhny Novgorod, Russia Building SoC design / verification productivity system for Broadband Wireless IEEE 802.16 (WiMAX) project: \n- Pre-silicon chip validation environment, and tools development \n- Build custom Multi-FPGA full chip prototyping platform \n- Embedded DSP processor microarchitecture optimizations Senior Hardware Engineer Intel Corporation, Intel Communications Group August 2003  –  January 2005  (1 year 6 months) Nizhny Novgorod, Russia Building SoC design / verification productivity system for Broadband Wireless IEEE 802.16 (WiMAX) project: \n- Pre-silicon chip validation environment, and tools development \n- Build custom Multi-FPGA full chip prototyping platform \n- Embedded DSP processor microarchitecture optimizations Digital IC Designer NEOTEC Semiconductor Ltd. April 2001  –  June 2003  (2 years 3 months) Chu Pei, Taiwan ARM based embedded multimedia platform SoC project: \n- Visual Multi Processor Unit with LCD controller and graphic acceleration functions \n- Integrated memory subsystem \n- Peripheral Processor Unit with SD MMC card functions \n- System and processor architecture, Verilog RTL, logic synthesis, static timing analysis, FPGA prototyping and performance analysis, Forth firmware development \n- Work as Project Manager in building up an corporative IP reuse and documentation infrastructure Digital IC Designer NEOTEC Semiconductor Ltd. April 2001  –  June 2003  (2 years 3 months) Chu Pei, Taiwan ARM based embedded multimedia platform SoC project: \n- Visual Multi Processor Unit with LCD controller and graphic acceleration functions \n- Integrated memory subsystem \n- Peripheral Processor Unit with SD MMC card functions \n- System and processor architecture, Verilog RTL, logic synthesis, static timing analysis, FPGA prototyping and performance analysis, Forth firmware development \n- Work as Project Manager in building up an corporative IP reuse and documentation infrastructure Head of design group Telecommunication Company of Molodechno (MTK) August 1997  –  March 2001  (3 years 8 months) Molodechno, Belarus Embedded system development \n- Schematic, Verilog RTL, telecommunication and voice application firmware \n- System and embedded 16-bit stack processor architecture, FPGA implementation \n- Russian mobile phone systems: \"Kart\"​, \"Altai\"​, \"VoLeMoT\"​, \"Vilia\" protocol, schematic, PCB, hardware and software implementation Head of design group Telecommunication Company of Molodechno (MTK) August 1997  –  March 2001  (3 years 8 months) Molodechno, Belarus Embedded system development \n- Schematic, Verilog RTL, telecommunication and voice application firmware \n- System and embedded 16-bit stack processor architecture, FPGA implementation \n- Russian mobile phone systems: \"Kart\"​, \"Altai\"​, \"VoLeMoT\"​, \"Vilia\" protocol, schematic, PCB, hardware and software implementation Application Engineer Laboratory of New Technologies (NTL) May 1996  –  June 1997  (1 year 2 months) Minsk, Belarus Engaged in development of new Stack microprocessor, testing, benchmarking of DSP algorithms, architecture documentation. Developing Forth compiler, library and applications. Application Engineer Laboratory of New Technologies (NTL) May 1996  –  June 1997  (1 year 2 months) Minsk, Belarus Engaged in development of new Stack microprocessor, testing, benchmarking of DSP algorithms, architecture documentation. Developing Forth compiler, library and applications. Electronic designer Radioplant \"Sputnik\", R&D Center August 1994  –  August 1996  (2 years 1 month) Molodechno, Belarus I developed the schematic and Forth firmware for the new mobile phone station using the stack processor. Implementation of radio modem and voice processing algorithms. Result: additional consumer functions, serial production at the plant, BOM cost reduction Electronic designer Radioplant \"Sputnik\", R&D Center August 1994  –  August 1996  (2 years 1 month) Molodechno, Belarus I developed the schematic and Forth firmware for the new mobile phone station using the stack processor. Implementation of radio modem and voice processing algorithms. Result: additional consumer functions, serial production at the plant, BOM cost reduction Languages English Full professional proficiency Russian Native or bilingual proficiency Belarussian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency Belarussian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency Belarussian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Verilog SoC Microarchitecture FPGA RTL design Perl Digital Signal... Baseband Reconfigurable Computing Software Defined Radio JavaScript Agile Methodologies Embedded C++ Forth Watercolor DIY Fixing Things Node.js Linux HTML5 CSS Git Graph Theory Visualization Test Driven Development Low-power Design ASIC RTL coding Digital Signal... Firmware Hardware Architecture Embedded Systems Debugging VHDL SystemVerilog Logic Design IC Software Development Functional Verification Microprocessors ModelSim VLSI Integrated Circuit... Processors Simulations ARM Logic Synthesis RTL Design Static Timing Analysis See 34+     See less Skills  Verilog SoC Microarchitecture FPGA RTL design Perl Digital Signal... Baseband Reconfigurable Computing Software Defined Radio JavaScript Agile Methodologies Embedded C++ Forth Watercolor DIY Fixing Things Node.js Linux HTML5 CSS Git Graph Theory Visualization Test Driven Development Low-power Design ASIC RTL coding Digital Signal... Firmware Hardware Architecture Embedded Systems Debugging VHDL SystemVerilog Logic Design IC Software Development Functional Verification Microprocessors ModelSim VLSI Integrated Circuit... Processors Simulations ARM Logic Synthesis RTL Design Static Timing Analysis See 34+     See less Verilog SoC Microarchitecture FPGA RTL design Perl Digital Signal... Baseband Reconfigurable Computing Software Defined Radio JavaScript Agile Methodologies Embedded C++ Forth Watercolor DIY Fixing Things Node.js Linux HTML5 CSS Git Graph Theory Visualization Test Driven Development Low-power Design ASIC RTL coding Digital Signal... Firmware Hardware Architecture Embedded Systems Debugging VHDL SystemVerilog Logic Design IC Software Development Functional Verification Microprocessors ModelSim VLSI Integrated Circuit... Processors Simulations ARM Logic Synthesis RTL Design Static Timing Analysis See 34+     See less Verilog SoC Microarchitecture FPGA RTL design Perl Digital Signal... Baseband Reconfigurable Computing Software Defined Radio JavaScript Agile Methodologies Embedded C++ Forth Watercolor DIY Fixing Things Node.js Linux HTML5 CSS Git Graph Theory Visualization Test Driven Development Low-power Design ASIC RTL coding Digital Signal... Firmware Hardware Architecture Embedded Systems Debugging VHDL SystemVerilog Logic Design IC Software Development Functional Verification Microprocessors ModelSim VLSI Integrated Circuit... Processors Simulations ARM Logic Synthesis RTL Design Static Timing Analysis See 34+     See less Education Belarusian State University of Informatics and Radioelectronics PhD Study,  Digital Signal Processing 1996  – 1999 Research processor architectures for embedded voice and telecommunication applications. Activities and Societies:  VLIW ,  TTA and Stack-based parallel architectures research project.\nStudy ,  estimate and implementation of voice coding algorithms.\nPassed the exams for candidate's scientific degree: Philosophy ,  English language.\nSpecial subject: \"Computing machines ,  complexes ,  systems and networks\"​.\nThe candidate degree scientific thesis of the \"Methods and Digital Signals Processors for mobile telecommunications system\" subject has been made to be defended. Belarusian State University of Informatics and Radioelectronics Master’s Degree,  Radio Engineering 1989  – 1994 Degree work: \"Integrated Developments Environment for microcontroller K1820\" Activities and Societies:  Faculty of Radio engineering and Electronics Belarusian State University of Informatics and Radioelectronics PhD Study,  Digital Signal Processing 1996  – 1999 Research processor architectures for embedded voice and telecommunication applications. Activities and Societies:  VLIW ,  TTA and Stack-based parallel architectures research project.\nStudy ,  estimate and implementation of voice coding algorithms.\nPassed the exams for candidate's scientific degree: Philosophy ,  English language.\nSpecial subject: \"Computing machines ,  complexes ,  systems and networks\"​.\nThe candidate degree scientific thesis of the \"Methods and Digital Signals Processors for mobile telecommunications system\" subject has been made to be defended. Belarusian State University of Informatics and Radioelectronics PhD Study,  Digital Signal Processing 1996  – 1999 Research processor architectures for embedded voice and telecommunication applications. Activities and Societies:  VLIW ,  TTA and Stack-based parallel architectures research project.\nStudy ,  estimate and implementation of voice coding algorithms.\nPassed the exams for candidate's scientific degree: Philosophy ,  English language.\nSpecial subject: \"Computing machines ,  complexes ,  systems and networks\"​.\nThe candidate degree scientific thesis of the \"Methods and Digital Signals Processors for mobile telecommunications system\" subject has been made to be defended. Belarusian State University of Informatics and Radioelectronics PhD Study,  Digital Signal Processing 1996  – 1999 Research processor architectures for embedded voice and telecommunication applications. Activities and Societies:  VLIW ,  TTA and Stack-based parallel architectures research project.\nStudy ,  estimate and implementation of voice coding algorithms.\nPassed the exams for candidate's scientific degree: Philosophy ,  English language.\nSpecial subject: \"Computing machines ,  complexes ,  systems and networks\"​.\nThe candidate degree scientific thesis of the \"Methods and Digital Signals Processors for mobile telecommunications system\" subject has been made to be defended. Belarusian State University of Informatics and Radioelectronics Master’s Degree,  Radio Engineering 1989  – 1994 Degree work: \"Integrated Developments Environment for microcontroller K1820\" Activities and Societies:  Faculty of Radio engineering and Electronics Belarusian State University of Informatics and Radioelectronics Master’s Degree,  Radio Engineering 1989  – 1994 Degree work: \"Integrated Developments Environment for microcontroller K1820\" Activities and Societies:  Faculty of Radio engineering and Electronics Belarusian State University of Informatics and Radioelectronics Master’s Degree,  Radio Engineering 1989  – 1994 Degree work: \"Integrated Developments Environment for microcontroller K1820\" Activities and Societies:  Faculty of Radio engineering and Electronics ", "Summary Hardware Engineer with 8+ years of experience in digital and mixed-signal IP and ASIC design from algorithm to RTL design and to the physical implementation. Deep knowledge of the digital design flow and extensive experience in low power design. Profiency in Verilog and SystemVerilog HDL for implementation and functional verification, FPGA prototyping. Hands-on experience in MCU, SoC design. Expertise in design flow development for synthesis, automated place and route (APR) layout design, static timing analysis (STA) and pre-Si power characterization from scratch using industry standard CAD tools from Synopsys, Cadence and Mentor Graphics. Solid background in DSP theory, experience in GPGPU programming and scripting with TCL and Perl. Strong “can do” attitude and rapid ramp-up ability Summary Hardware Engineer with 8+ years of experience in digital and mixed-signal IP and ASIC design from algorithm to RTL design and to the physical implementation. Deep knowledge of the digital design flow and extensive experience in low power design. Profiency in Verilog and SystemVerilog HDL for implementation and functional verification, FPGA prototyping. Hands-on experience in MCU, SoC design. Expertise in design flow development for synthesis, automated place and route (APR) layout design, static timing analysis (STA) and pre-Si power characterization from scratch using industry standard CAD tools from Synopsys, Cadence and Mentor Graphics. Solid background in DSP theory, experience in GPGPU programming and scripting with TCL and Perl. Strong “can do” attitude and rapid ramp-up ability Hardware Engineer with 8+ years of experience in digital and mixed-signal IP and ASIC design from algorithm to RTL design and to the physical implementation. Deep knowledge of the digital design flow and extensive experience in low power design. Profiency in Verilog and SystemVerilog HDL for implementation and functional verification, FPGA prototyping. Hands-on experience in MCU, SoC design. Expertise in design flow development for synthesis, automated place and route (APR) layout design, static timing analysis (STA) and pre-Si power characterization from scratch using industry standard CAD tools from Synopsys, Cadence and Mentor Graphics. Solid background in DSP theory, experience in GPGPU programming and scripting with TCL and Perl. Strong “can do” attitude and rapid ramp-up ability Hardware Engineer with 8+ years of experience in digital and mixed-signal IP and ASIC design from algorithm to RTL design and to the physical implementation. Deep knowledge of the digital design flow and extensive experience in low power design. Profiency in Verilog and SystemVerilog HDL for implementation and functional verification, FPGA prototyping. Hands-on experience in MCU, SoC design. Expertise in design flow development for synthesis, automated place and route (APR) layout design, static timing analysis (STA) and pre-Si power characterization from scratch using industry standard CAD tools from Synopsys, Cadence and Mentor Graphics. Solid background in DSP theory, experience in GPGPU programming and scripting with TCL and Perl. Strong “can do” attitude and rapid ramp-up ability Experience Senior Hardware Engineer Intel Labs August 2011  – Present (4 years 1 month) Saint Petersburg, Russian Federation Small core design. Contributor to RTL design, responsible for synthesis, STA and pre-Si power, area and timing characterization using deep sub-micron technology process. Owner of custom design flows, 3rd party libraries and IP integration, complex timing constraints development with multiple clock domain crossing. Responsible for post-route gate-level netlist simulation and conformance checks, post-Si debug with further ECO modifications ASIC Design Engineer SibIS LLC December 2006  –  August 2011  (4 years 9 months) 0.18um PAL/NTSC VideoDAC design. Development of ITU.R BT.656 digital video stream decoder, PAL and NTSC color carrier DDS generator, digital modulator, horizontal and vertical sync blocks, etc. FPGA based prototyping. Synthesys and automated Place and Route (P&R). EDA tools: Cadence Encounter, Cadence IC, Cadence ADE, SpectreVerilog, etc. \n \n0.25um full-custom 10 bit ADC post Place&Route simulation. Parasitics extraction, testbench development, post Place&Route mixed signal simulation. EDA tools: Cadence IC, Cadence Diva, Cadence ADE, Spectre. Electronics Engineer Granch 2005  –  November 2006  (1 year) Embedded Linux devices design. Schematics design, PCB routing. Atmel microcontrollers programming. \n \nDevelopment of portable Linux based two-way 802.11b/g Wi-Fi pager, switch-mode power supply (SMPS) schematics, high power white led flashlight, etc. Development of electronics devices for use in hazardous and explosive dangerous areas. Technical Support KSN 2001  –  2002  (1 year) Senior Hardware Engineer Intel Labs August 2011  – Present (4 years 1 month) Saint Petersburg, Russian Federation Small core design. Contributor to RTL design, responsible for synthesis, STA and pre-Si power, area and timing characterization using deep sub-micron technology process. Owner of custom design flows, 3rd party libraries and IP integration, complex timing constraints development with multiple clock domain crossing. Responsible for post-route gate-level netlist simulation and conformance checks, post-Si debug with further ECO modifications Senior Hardware Engineer Intel Labs August 2011  – Present (4 years 1 month) Saint Petersburg, Russian Federation Small core design. Contributor to RTL design, responsible for synthesis, STA and pre-Si power, area and timing characterization using deep sub-micron technology process. Owner of custom design flows, 3rd party libraries and IP integration, complex timing constraints development with multiple clock domain crossing. Responsible for post-route gate-level netlist simulation and conformance checks, post-Si debug with further ECO modifications ASIC Design Engineer SibIS LLC December 2006  –  August 2011  (4 years 9 months) 0.18um PAL/NTSC VideoDAC design. Development of ITU.R BT.656 digital video stream decoder, PAL and NTSC color carrier DDS generator, digital modulator, horizontal and vertical sync blocks, etc. FPGA based prototyping. Synthesys and automated Place and Route (P&R). EDA tools: Cadence Encounter, Cadence IC, Cadence ADE, SpectreVerilog, etc. \n \n0.25um full-custom 10 bit ADC post Place&Route simulation. Parasitics extraction, testbench development, post Place&Route mixed signal simulation. EDA tools: Cadence IC, Cadence Diva, Cadence ADE, Spectre. ASIC Design Engineer SibIS LLC December 2006  –  August 2011  (4 years 9 months) 0.18um PAL/NTSC VideoDAC design. Development of ITU.R BT.656 digital video stream decoder, PAL and NTSC color carrier DDS generator, digital modulator, horizontal and vertical sync blocks, etc. FPGA based prototyping. Synthesys and automated Place and Route (P&R). EDA tools: Cadence Encounter, Cadence IC, Cadence ADE, SpectreVerilog, etc. \n \n0.25um full-custom 10 bit ADC post Place&Route simulation. Parasitics extraction, testbench development, post Place&Route mixed signal simulation. EDA tools: Cadence IC, Cadence Diva, Cadence ADE, Spectre. Electronics Engineer Granch 2005  –  November 2006  (1 year) Embedded Linux devices design. Schematics design, PCB routing. Atmel microcontrollers programming. \n \nDevelopment of portable Linux based two-way 802.11b/g Wi-Fi pager, switch-mode power supply (SMPS) schematics, high power white led flashlight, etc. Development of electronics devices for use in hazardous and explosive dangerous areas. Electronics Engineer Granch 2005  –  November 2006  (1 year) Embedded Linux devices design. Schematics design, PCB routing. Atmel microcontrollers programming. \n \nDevelopment of portable Linux based two-way 802.11b/g Wi-Fi pager, switch-mode power supply (SMPS) schematics, high power white led flashlight, etc. Development of electronics devices for use in hazardous and explosive dangerous areas. Technical Support KSN 2001  –  2002  (1 year) Technical Support KSN 2001  –  2002  (1 year) Languages English Full professional proficiency Russian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Semiconductors SoC EDA ASIC RTL design Integrated Circuit... FPGA Static Timing Analysis Verilog IC RTL coding VLSI SystemVerilog CMOS Timing Closure Debugging VHDL Digital Signal... Primetime TCL Logic Design Electronics Circuit Design ModelSim Simulations Physical Design Cadence Low-power Design Cadence Virtuoso Mixed Signal Functional Verification Formal Verification Place & Route DFT Hardware Architecture Microcontrollers Synopsys tools Xilinx X86 RTL Design Processors Microarchitecture C C++ Linux See 30+     See less Skills  Semiconductors SoC EDA ASIC RTL design Integrated Circuit... FPGA Static Timing Analysis Verilog IC RTL coding VLSI SystemVerilog CMOS Timing Closure Debugging VHDL Digital Signal... Primetime TCL Logic Design Electronics Circuit Design ModelSim Simulations Physical Design Cadence Low-power Design Cadence Virtuoso Mixed Signal Functional Verification Formal Verification Place & Route DFT Hardware Architecture Microcontrollers Synopsys tools Xilinx X86 RTL Design Processors Microarchitecture C C++ Linux See 30+     See less Semiconductors SoC EDA ASIC RTL design Integrated Circuit... FPGA Static Timing Analysis Verilog IC RTL coding VLSI SystemVerilog CMOS Timing Closure Debugging VHDL Digital Signal... Primetime TCL Logic Design Electronics Circuit Design ModelSim Simulations Physical Design Cadence Low-power Design Cadence Virtuoso Mixed Signal Functional Verification Formal Verification Place & Route DFT Hardware Architecture Microcontrollers Synopsys tools Xilinx X86 RTL Design Processors Microarchitecture C C++ Linux See 30+     See less Semiconductors SoC EDA ASIC RTL design Integrated Circuit... FPGA Static Timing Analysis Verilog IC RTL coding VLSI SystemVerilog CMOS Timing Closure Debugging VHDL Digital Signal... Primetime TCL Logic Design Electronics Circuit Design ModelSim Simulations Physical Design Cadence Low-power Design Cadence Virtuoso Mixed Signal Functional Verification Formal Verification Place & Route DFT Hardware Architecture Microcontrollers Synopsys tools Xilinx X86 RTL Design Processors Microarchitecture C C++ Linux See 30+     See less Education Novosibirsk State Technical University (NSTU) MSc,  Electronics and Microelectronics 2004  – 2005 Degree thesis topic: \"Molecular-Beam Epitaxy Process Automation\" Novosibirsk State Technical University (NSTU) BSc,  Electronics and Microelectronics 1999  – 2004 National Instruments Technology Centre LabView 8 programming 2006  – 2006 Novosibirsk State Technical University (NSTU) MSc,  Electronics and Microelectronics 2004  – 2005 Degree thesis topic: \"Molecular-Beam Epitaxy Process Automation\" Novosibirsk State Technical University (NSTU) MSc,  Electronics and Microelectronics 2004  – 2005 Degree thesis topic: \"Molecular-Beam Epitaxy Process Automation\" Novosibirsk State Technical University (NSTU) MSc,  Electronics and Microelectronics 2004  – 2005 Degree thesis topic: \"Molecular-Beam Epitaxy Process Automation\" Novosibirsk State Technical University (NSTU) BSc,  Electronics and Microelectronics 1999  – 2004 Novosibirsk State Technical University (NSTU) BSc,  Electronics and Microelectronics 1999  – 2004 Novosibirsk State Technical University (NSTU) BSc,  Electronics and Microelectronics 1999  – 2004 National Instruments Technology Centre LabView 8 programming 2006  – 2006 National Instruments Technology Centre LabView 8 programming 2006  – 2006 National Instruments Technology Centre LabView 8 programming 2006  – 2006 ", "Summary • Electromagnetic Compatibility (EMC)/ Electrostatic Discharge (ESD)/Radio Frequency Inteference (RFI) design for PC platform (desktop/laptop/tablet) \n• 6-year experience in RF-MEMS components design, simulation, and measurement. \n• 6-year experience in RF measurement with network analyzer, spectrum analyzer, etc. \n• 10-year experience in semiconductor/MEMS fabrication Specialties:EMC/ESD/RFI Engineering \nMEMS Device \nReconfigurable RF Circuit/Filter/Antenna Summary • Electromagnetic Compatibility (EMC)/ Electrostatic Discharge (ESD)/Radio Frequency Inteference (RFI) design for PC platform (desktop/laptop/tablet) \n• 6-year experience in RF-MEMS components design, simulation, and measurement. \n• 6-year experience in RF measurement with network analyzer, spectrum analyzer, etc. \n• 10-year experience in semiconductor/MEMS fabrication Specialties:EMC/ESD/RFI Engineering \nMEMS Device \nReconfigurable RF Circuit/Filter/Antenna • Electromagnetic Compatibility (EMC)/ Electrostatic Discharge (ESD)/Radio Frequency Inteference (RFI) design for PC platform (desktop/laptop/tablet) \n• 6-year experience in RF-MEMS components design, simulation, and measurement. \n• 6-year experience in RF measurement with network analyzer, spectrum analyzer, etc. \n• 10-year experience in semiconductor/MEMS fabrication Specialties:EMC/ESD/RFI Engineering \nMEMS Device \nReconfigurable RF Circuit/Filter/Antenna • Electromagnetic Compatibility (EMC)/ Electrostatic Discharge (ESD)/Radio Frequency Inteference (RFI) design for PC platform (desktop/laptop/tablet) \n• 6-year experience in RF-MEMS components design, simulation, and measurement. \n• 6-year experience in RF measurement with network analyzer, spectrum analyzer, etc. \n• 10-year experience in semiconductor/MEMS fabrication Specialties:EMC/ESD/RFI Engineering \nMEMS Device \nReconfigurable RF Circuit/Filter/Antenna Experience Senior Hardware Engineer Intel Corporation June 2011  – Present (4 years 3 months) Platform Engineering of EMI/ESD/RFI \nAntenna/SAR Design Graduate Research Assistant Purdue University October 2004  –  May 2011  (6 years 8 months) 1. Fabrication, design, and test of passive RF components and RF-MEMS devices. \n2. Lifetime/reliability test on MEMS devices Senior Hardware Engineer Intel Corporation June 2011  – Present (4 years 3 months) Platform Engineering of EMI/ESD/RFI \nAntenna/SAR Design Senior Hardware Engineer Intel Corporation June 2011  – Present (4 years 3 months) Platform Engineering of EMI/ESD/RFI \nAntenna/SAR Design Graduate Research Assistant Purdue University October 2004  –  May 2011  (6 years 8 months) 1. Fabrication, design, and test of passive RF components and RF-MEMS devices. \n2. Lifetime/reliability test on MEMS devices Graduate Research Assistant Purdue University October 2004  –  May 2011  (6 years 8 months) 1. Fabrication, design, and test of passive RF components and RF-MEMS devices. \n2. Lifetime/reliability test on MEMS devices Skills Electromagnetic... RF design RF measurement Semiconductor/MEMS... MEMS design and test Antenna Design RF Antennas Simulations Skills  Electromagnetic... RF design RF measurement Semiconductor/MEMS... MEMS design and test Antenna Design RF Antennas Simulations Electromagnetic... RF design RF measurement Semiconductor/MEMS... MEMS design and test Antenna Design RF Antennas Simulations Electromagnetic... RF design RF measurement Semiconductor/MEMS... MEMS design and test Antenna Design RF Antennas Simulations Education Purdue University PhD,  Electrical and Computer Engineering 2004  – 2011 - Advisor: Prof. Dimitrios Peroulis \n- Research topics include \n1. Tunable passive RF components \n2. Tunable RF-MEMS resonator and filter \n3. Characterization and modeling of lifetime/Reliability for MEMS devices National Tsing Hua University MS,  Electrical Engineering 2001  – 2002 - Advisor: Ruey-Shing Star Huang \n1. High aspect-ratio SOI MEMS actuator \n2. DSP proramming on Texas Intrument DSP platform Purdue University PhD,  Electrical and Computer Engineering 2004  – 2011 - Advisor: Prof. Dimitrios Peroulis \n- Research topics include \n1. Tunable passive RF components \n2. Tunable RF-MEMS resonator and filter \n3. Characterization and modeling of lifetime/Reliability for MEMS devices Purdue University PhD,  Electrical and Computer Engineering 2004  – 2011 - Advisor: Prof. Dimitrios Peroulis \n- Research topics include \n1. Tunable passive RF components \n2. Tunable RF-MEMS resonator and filter \n3. Characterization and modeling of lifetime/Reliability for MEMS devices Purdue University PhD,  Electrical and Computer Engineering 2004  – 2011 - Advisor: Prof. Dimitrios Peroulis \n- Research topics include \n1. Tunable passive RF components \n2. Tunable RF-MEMS resonator and filter \n3. Characterization and modeling of lifetime/Reliability for MEMS devices National Tsing Hua University MS,  Electrical Engineering 2001  – 2002 - Advisor: Ruey-Shing Star Huang \n1. High aspect-ratio SOI MEMS actuator \n2. DSP proramming on Texas Intrument DSP platform National Tsing Hua University MS,  Electrical Engineering 2001  – 2002 - Advisor: Ruey-Shing Star Huang \n1. High aspect-ratio SOI MEMS actuator \n2. DSP proramming on Texas Intrument DSP platform National Tsing Hua University MS,  Electrical Engineering 2001  – 2002 - Advisor: Ruey-Shing Star Huang \n1. High aspect-ratio SOI MEMS actuator \n2. DSP proramming on Texas Intrument DSP platform Honors & Awards Additional Honors & Awards Honorable Mention - Student Paper Competition in IEEE Tropical Meeting on Silicon Monolithic Integrated Circuits in RF Systems 2011, Phoenix, AZ \nChampion - Texas Instrument DSP Challenge 2000 \nGrand Award - International Science and Engineering Fair, 1996, Tucson, AZ Additional Honors & Awards Honorable Mention - Student Paper Competition in IEEE Tropical Meeting on Silicon Monolithic Integrated Circuits in RF Systems 2011, Phoenix, AZ \nChampion - Texas Instrument DSP Challenge 2000 \nGrand Award - International Science and Engineering Fair, 1996, Tucson, AZ Additional Honors & Awards Honorable Mention - Student Paper Competition in IEEE Tropical Meeting on Silicon Monolithic Integrated Circuits in RF Systems 2011, Phoenix, AZ \nChampion - Texas Instrument DSP Challenge 2000 \nGrand Award - International Science and Engineering Fair, 1996, Tucson, AZ Additional Honors & Awards Honorable Mention - Student Paper Competition in IEEE Tropical Meeting on Silicon Monolithic Integrated Circuits in RF Systems 2011, Phoenix, AZ \nChampion - Texas Instrument DSP Challenge 2000 \nGrand Award - International Science and Engineering Fair, 1996, Tucson, AZ ", "Experience Mobile and Tablet Senior Hardware engineer Intel Corporation April 2013  – Present (2 years 5 months) Principal Hardware engineer HTC March 2010  –  March 2013  (3 years 1 month) Principal hardware engineer Compalcomm August 2004  –  February 2010  (5 years 7 months) Mobile and Tablet Senior Hardware engineer Intel Corporation April 2013  – Present (2 years 5 months) Mobile and Tablet Senior Hardware engineer Intel Corporation April 2013  – Present (2 years 5 months) Principal Hardware engineer HTC March 2010  –  March 2013  (3 years 1 month) Principal Hardware engineer HTC March 2010  –  March 2013  (3 years 1 month) Principal hardware engineer Compalcomm August 2004  –  February 2010  (5 years 7 months) Principal hardware engineer Compalcomm August 2004  –  February 2010  (5 years 7 months) Skills Mobile Devices Mobile Design Tablets Debugging Embedded Software Embedded Systems Hardware Mobile Technology Wireless Skills  Mobile Devices Mobile Design Tablets Debugging Embedded Software Embedded Systems Hardware Mobile Technology Wireless Mobile Devices Mobile Design Tablets Debugging Embedded Software Embedded Systems Hardware Mobile Technology Wireless Mobile Devices Mobile Design Tablets Debugging Embedded Software Embedded Systems Hardware Mobile Technology Wireless Education National Central University Master's degree,  Electrical , Electronics and Communications Engineering 2002  – 2004 National Central University Master's degree,  Electrical , Electronics and Communications Engineering 2002  – 2004 National Central University Master's degree,  Electrical , Electronics and Communications Engineering 2002  – 2004 National Central University Master's degree,  Electrical , Electronics and Communications Engineering 2002  – 2004 ", "Experience Senior Hardware Engineer Intel Corporation Senior Hardware Engineer Intel Corporation Senior Hardware Engineer Intel Corporation Education Milwaukee School of Engineering BS,  Electrical Engineering 1986  – 1990 Milwaukee School of Engineering BS,  Electrical Engineering 1986  – 1990 Milwaukee School of Engineering BS,  Electrical Engineering 1986  – 1990 Milwaukee School of Engineering BS,  Electrical Engineering 1986  – 1990 "]}