{"position": "Senior Software Architect", "company": "Intel Corporation", "profiles": ["Experience Faculty member (Department of Industrial Engineeering & Management) Shenkar College of Engineering and Design October 2014  – Present (11 months) Senior Software Architect Intel Corporation September 2012  –  August 2013  (1 year) Senior System Architect Avaya October 2011  –  August 2012  (11 months) System Architect Telmap November 2009  –  September 2011  (1 year 11 months) Senior System Architect & Standardization Manager Comverse August 2005  –  May 2009  (3 years 10 months) Senior System Engineer Celltick December 2003  –  August 2005  (1 year 9 months) System Architect Amdocs December 2001  –  December 2003  (2 years 1 month) System Architect SeaBridge December 2000  –  December 2001  (1 year 1 month) VP R&D small Startup initiative January 1999  –  December 2000  (2 years) Senior Lecturer – Networks and OS Computer schools July 1997  –  December 1998  (1 year 6 months) Team Leader – Network, System and customer support Almog June 1994  –  June 1997  (3 years 1 month) Faculty member (Department of Industrial Engineeering & Management) Shenkar College of Engineering and Design October 2014  – Present (11 months) Faculty member (Department of Industrial Engineeering & Management) Shenkar College of Engineering and Design October 2014  – Present (11 months) Senior Software Architect Intel Corporation September 2012  –  August 2013  (1 year) Senior Software Architect Intel Corporation September 2012  –  August 2013  (1 year) Senior System Architect Avaya October 2011  –  August 2012  (11 months) Senior System Architect Avaya October 2011  –  August 2012  (11 months) System Architect Telmap November 2009  –  September 2011  (1 year 11 months) System Architect Telmap November 2009  –  September 2011  (1 year 11 months) Senior System Architect & Standardization Manager Comverse August 2005  –  May 2009  (3 years 10 months) Senior System Architect & Standardization Manager Comverse August 2005  –  May 2009  (3 years 10 months) Senior System Engineer Celltick December 2003  –  August 2005  (1 year 9 months) Senior System Engineer Celltick December 2003  –  August 2005  (1 year 9 months) System Architect Amdocs December 2001  –  December 2003  (2 years 1 month) System Architect Amdocs December 2001  –  December 2003  (2 years 1 month) System Architect SeaBridge December 2000  –  December 2001  (1 year 1 month) System Architect SeaBridge December 2000  –  December 2001  (1 year 1 month) VP R&D small Startup initiative January 1999  –  December 2000  (2 years) VP R&D small Startup initiative January 1999  –  December 2000  (2 years) Senior Lecturer – Networks and OS Computer schools July 1997  –  December 1998  (1 year 6 months) Senior Lecturer – Networks and OS Computer schools July 1997  –  December 1998  (1 year 6 months) Team Leader – Network, System and customer support Almog June 1994  –  June 1997  (3 years 1 month) Team Leader – Network, System and customer support Almog June 1994  –  June 1997  (3 years 1 month) Skills Mobile Devices System Architecture Cellular Communications SIP Cloud Computing Android Mobile Communications Wireless Pre-sales Operating Systems Architecture VAS IP Network Architecture Architectures Mobile Technology Telecommunications Multithreading Data Center Software Development Innovation Open Source Software Research Lecturing See 9+     See less Skills  Mobile Devices System Architecture Cellular Communications SIP Cloud Computing Android Mobile Communications Wireless Pre-sales Operating Systems Architecture VAS IP Network Architecture Architectures Mobile Technology Telecommunications Multithreading Data Center Software Development Innovation Open Source Software Research Lecturing See 9+     See less Mobile Devices System Architecture Cellular Communications SIP Cloud Computing Android Mobile Communications Wireless Pre-sales Operating Systems Architecture VAS IP Network Architecture Architectures Mobile Technology Telecommunications Multithreading Data Center Software Development Innovation Open Source Software Research Lecturing See 9+     See less Mobile Devices System Architecture Cellular Communications SIP Cloud Computing Android Mobile Communications Wireless Pre-sales Operating Systems Architecture VAS IP Network Architecture Architectures Mobile Technology Telecommunications Multithreading Data Center Software Development Innovation Open Source Software Research Lecturing See 9+     See less Education Tel Aviv University PhD,  Cohn Institute: Open Source development and Linux kernel research 2006  – 2010 Activities and Societies:  Research areas/interest: Open source ,  Linux ,  networks ,  development model ,  computer history Tel Aviv University M.A.,  Science Education 2001  – 2003 Cum-Laude Tel Aviv University B.Sc.TE,  Computer System 1996  – 2000 Tel Aviv University PhD,  Cohn Institute: Open Source development and Linux kernel research 2006  – 2010 Activities and Societies:  Research areas/interest: Open source ,  Linux ,  networks ,  development model ,  computer history Tel Aviv University PhD,  Cohn Institute: Open Source development and Linux kernel research 2006  – 2010 Activities and Societies:  Research areas/interest: Open source ,  Linux ,  networks ,  development model ,  computer history Tel Aviv University PhD,  Cohn Institute: Open Source development and Linux kernel research 2006  – 2010 Activities and Societies:  Research areas/interest: Open source ,  Linux ,  networks ,  development model ,  computer history Tel Aviv University M.A.,  Science Education 2001  – 2003 Cum-Laude Tel Aviv University M.A.,  Science Education 2001  – 2003 Cum-Laude Tel Aviv University M.A.,  Science Education 2001  – 2003 Cum-Laude Tel Aviv University B.Sc.TE,  Computer System 1996  – 2000 Tel Aviv University B.Sc.TE,  Computer System 1996  – 2000 Tel Aviv University B.Sc.TE,  Computer System 1996  – 2000 ", "Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Embedded Systems Wireless Mobile Communications Android Software Development Handsets TCP/IP ClearCase Agile Project Management Scrum Integration SNMP UMTS Management Telecommunications Bluetooth Network Administration Testing Debugging 3G VoIP Software Design SIP Linux Mobile Applications Software Project... Perl System Architecture RTOS Wireless Networking Mobile Devices Cellular Communications QoS C++ LTE Test Automation Embedded Software Software Engineering Eclipse Unix Product Management Mobile Technology GSM Cloud Computing Product Development C Operating Systems Device Drivers Cross-functional Team... Agile Methodologies See 35+     See less Skills  Embedded Systems Wireless Mobile Communications Android Software Development Handsets TCP/IP ClearCase Agile Project Management Scrum Integration SNMP UMTS Management Telecommunications Bluetooth Network Administration Testing Debugging 3G VoIP Software Design SIP Linux Mobile Applications Software Project... Perl System Architecture RTOS Wireless Networking Mobile Devices Cellular Communications QoS C++ LTE Test Automation Embedded Software Software Engineering Eclipse Unix Product Management Mobile Technology GSM Cloud Computing Product Development C Operating Systems Device Drivers Cross-functional Team... Agile Methodologies See 35+     See less Embedded Systems Wireless Mobile Communications Android Software Development Handsets TCP/IP ClearCase Agile Project Management Scrum Integration SNMP UMTS Management Telecommunications Bluetooth Network Administration Testing Debugging 3G VoIP Software Design SIP Linux Mobile Applications Software Project... Perl System Architecture RTOS Wireless Networking Mobile Devices Cellular Communications QoS C++ LTE Test Automation Embedded Software Software Engineering Eclipse Unix Product Management Mobile Technology GSM Cloud Computing Product Development C Operating Systems Device Drivers Cross-functional Team... Agile Methodologies See 35+     See less Embedded Systems Wireless Mobile Communications Android Software Development Handsets TCP/IP ClearCase Agile Project Management Scrum Integration SNMP UMTS Management Telecommunications Bluetooth Network Administration Testing Debugging 3G VoIP Software Design SIP Linux Mobile Applications Software Project... Perl System Architecture RTOS Wireless Networking Mobile Devices Cellular Communications QoS C++ LTE Test Automation Embedded Software Software Engineering Eclipse Unix Product Management Mobile Technology GSM Cloud Computing Product Development C Operating Systems Device Drivers Cross-functional Team... Agile Methodologies See 35+     See less ", "Skills Embedded Systems Software Development Device Drivers Debugging Firmware Embedded Software System Architecture Software Engineering Perl RTOS Processors Computer Architecture Mobile Devices Wireless Testing Agile Methodologies C C++ SoC Android Linux Software Design Semiconductors Linux Kernel Intel See 10+     See less Skills  Embedded Systems Software Development Device Drivers Debugging Firmware Embedded Software System Architecture Software Engineering Perl RTOS Processors Computer Architecture Mobile Devices Wireless Testing Agile Methodologies C C++ SoC Android Linux Software Design Semiconductors Linux Kernel Intel See 10+     See less Embedded Systems Software Development Device Drivers Debugging Firmware Embedded Software System Architecture Software Engineering Perl RTOS Processors Computer Architecture Mobile Devices Wireless Testing Agile Methodologies C C++ SoC Android Linux Software Design Semiconductors Linux Kernel Intel See 10+     See less Embedded Systems Software Development Device Drivers Debugging Firmware Embedded Software System Architecture Software Engineering Perl RTOS Processors Computer Architecture Mobile Devices Wireless Testing Agile Methodologies C C++ SoC Android Linux Software Design Semiconductors Linux Kernel Intel See 10+     See less ", "Summary Oscar Naim is a Principal Program Manager at Microsoft Corporation (Information Management and Machine Learning group). Oscar re-joined Microsoft in April of 2014, and he has more than 19 years of experience as a software engineer, including positions at Intel Corporation, Microsoft Research, Oracle Corporation and the University of Wisconsin-Madison. He has PhD in Computer Sciences from the University of Southampton, UK (with Tony Hey as his supervisor), as well as a Master and Bachelor’s degree in Computer Sciences from Universidad Simon Bolivar, Venezuela. \n \nIn his free time, Oscar loves to play classical guitar and help his sons little league baseball teams. \n \nSpecialties: Internet of Things, Parallel Computing, Semantics, Systems Integration, Analytical Problem Solving, SW Design & Architecture, Program Management, Life Sciences, Context Aware Computing Summary Oscar Naim is a Principal Program Manager at Microsoft Corporation (Information Management and Machine Learning group). Oscar re-joined Microsoft in April of 2014, and he has more than 19 years of experience as a software engineer, including positions at Intel Corporation, Microsoft Research, Oracle Corporation and the University of Wisconsin-Madison. He has PhD in Computer Sciences from the University of Southampton, UK (with Tony Hey as his supervisor), as well as a Master and Bachelor’s degree in Computer Sciences from Universidad Simon Bolivar, Venezuela. \n \nIn his free time, Oscar loves to play classical guitar and help his sons little league baseball teams. \n \nSpecialties: Internet of Things, Parallel Computing, Semantics, Systems Integration, Analytical Problem Solving, SW Design & Architecture, Program Management, Life Sciences, Context Aware Computing Oscar Naim is a Principal Program Manager at Microsoft Corporation (Information Management and Machine Learning group). Oscar re-joined Microsoft in April of 2014, and he has more than 19 years of experience as a software engineer, including positions at Intel Corporation, Microsoft Research, Oracle Corporation and the University of Wisconsin-Madison. He has PhD in Computer Sciences from the University of Southampton, UK (with Tony Hey as his supervisor), as well as a Master and Bachelor’s degree in Computer Sciences from Universidad Simon Bolivar, Venezuela. \n \nIn his free time, Oscar loves to play classical guitar and help his sons little league baseball teams. \n \nSpecialties: Internet of Things, Parallel Computing, Semantics, Systems Integration, Analytical Problem Solving, SW Design & Architecture, Program Management, Life Sciences, Context Aware Computing Oscar Naim is a Principal Program Manager at Microsoft Corporation (Information Management and Machine Learning group). Oscar re-joined Microsoft in April of 2014, and he has more than 19 years of experience as a software engineer, including positions at Intel Corporation, Microsoft Research, Oracle Corporation and the University of Wisconsin-Madison. He has PhD in Computer Sciences from the University of Southampton, UK (with Tony Hey as his supervisor), as well as a Master and Bachelor’s degree in Computer Sciences from Universidad Simon Bolivar, Venezuela. \n \nIn his free time, Oscar loves to play classical guitar and help his sons little league baseball teams. \n \nSpecialties: Internet of Things, Parallel Computing, Semantics, Systems Integration, Analytical Problem Solving, SW Design & Architecture, Program Management, Life Sciences, Context Aware Computing Experience Principal Program Manager Microsoft April 2014  – Present (1 year 5 months) Portland, Oregon Area Principal Program Manager Microsoft April 2014  – Present (1 year 5 months) Portland, Oregon Area Principal Program Manager Microsoft April 2014  – Present (1 year 5 months) Portland, Oregon Area Languages Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Program Management Parallel Computing Life Sciences Problem Solving Semantics Computer Science Software Engineering Agile Integration SOA Software Development Software Project... System Architecture Agile Methodologies Lifesciences C# Testing Databases Software Design Cloud Computing Microsoft SQL Server Java Java Enterprise Edition See 8+     See less Skills  Program Management Parallel Computing Life Sciences Problem Solving Semantics Computer Science Software Engineering Agile Integration SOA Software Development Software Project... System Architecture Agile Methodologies Lifesciences C# Testing Databases Software Design Cloud Computing Microsoft SQL Server Java Java Enterprise Edition See 8+     See less Program Management Parallel Computing Life Sciences Problem Solving Semantics Computer Science Software Engineering Agile Integration SOA Software Development Software Project... System Architecture Agile Methodologies Lifesciences C# Testing Databases Software Design Cloud Computing Microsoft SQL Server Java Java Enterprise Edition See 8+     See less Program Management Parallel Computing Life Sciences Problem Solving Semantics Computer Science Software Engineering Agile Integration SOA Software Development Software Project... System Architecture Agile Methodologies Lifesciences C# Testing Databases Software Design Cloud Computing Microsoft SQL Server Java Java Enterprise Edition See 8+     See less Education University of Southampton PhD,  Computer Sciences 1992  – 1995 Universidad Simón Bolívar Masters,  Computer Sciences 1990  – 1992 Universidad Simón Bolívar Bachelor,  Computer Sciences 1983  – 1988 University of Southampton PhD,  Computer Sciences 1992  – 1995 University of Southampton PhD,  Computer Sciences 1992  – 1995 University of Southampton PhD,  Computer Sciences 1992  – 1995 Universidad Simón Bolívar Masters,  Computer Sciences 1990  – 1992 Universidad Simón Bolívar Masters,  Computer Sciences 1990  – 1992 Universidad Simón Bolívar Masters,  Computer Sciences 1990  – 1992 Universidad Simón Bolívar Bachelor,  Computer Sciences 1983  – 1988 Universidad Simón Bolívar Bachelor,  Computer Sciences 1983  – 1988 Universidad Simón Bolívar Bachelor,  Computer Sciences 1983  – 1988 ", "Summary Successful Senior Software Architect with expert technical skills in a variety of platforms, languages and environments. Summary Successful Senior Software Architect with expert technical skills in a variety of platforms, languages and environments. Successful Senior Software Architect with expert technical skills in a variety of platforms, languages and environments. Successful Senior Software Architect with expert technical skills in a variety of platforms, languages and environments. Experience Senior Software Architect Intel Corporation 2004  – Present (11 years) Greater Chicago Area Intel Expressway Service Gateway Solutions Architect TEKsystems 2003  –  2004  (1 year) Greater Chicago Area Sears Roebuck and Co. - Provided architectural leadership to several enterprise initiatives to ensure sound and timely solution delivery. Primarily focused on solutions for “off the mall” retail formats. Product Architect / Lead Architect Consultant Cysive 1997  –  2003  (6 years) Greater Chicago Area Product Architect: Interaction Server Software Product - Led architecture and development of the message processing subsystem for Cysive’s flagship product, Cysive Cymbio. Cysive Cymbio integrates multi-channel presentations with existing enterprise systems and web services.  \n \nLead Architect Consultant: Third Party Transportation Exchange Portal, Intermodal Freight Tendering System, Network Equipment B2B Commerce. Team Lead / Senior Developer SPS Payment Services - Dean Witter Discover 1990  –  1997  (7 years) Greater Chicago Area Frequency Marketing Online Transaction Processing System; Credit and Debit Transaction Authorization System. Senior Software Architect Intel Corporation 2004  – Present (11 years) Greater Chicago Area Intel Expressway Service Gateway Senior Software Architect Intel Corporation 2004  – Present (11 years) Greater Chicago Area Intel Expressway Service Gateway Solutions Architect TEKsystems 2003  –  2004  (1 year) Greater Chicago Area Sears Roebuck and Co. - Provided architectural leadership to several enterprise initiatives to ensure sound and timely solution delivery. Primarily focused on solutions for “off the mall” retail formats. Solutions Architect TEKsystems 2003  –  2004  (1 year) Greater Chicago Area Sears Roebuck and Co. - Provided architectural leadership to several enterprise initiatives to ensure sound and timely solution delivery. Primarily focused on solutions for “off the mall” retail formats. Product Architect / Lead Architect Consultant Cysive 1997  –  2003  (6 years) Greater Chicago Area Product Architect: Interaction Server Software Product - Led architecture and development of the message processing subsystem for Cysive’s flagship product, Cysive Cymbio. Cysive Cymbio integrates multi-channel presentations with existing enterprise systems and web services.  \n \nLead Architect Consultant: Third Party Transportation Exchange Portal, Intermodal Freight Tendering System, Network Equipment B2B Commerce. Product Architect / Lead Architect Consultant Cysive 1997  –  2003  (6 years) Greater Chicago Area Product Architect: Interaction Server Software Product - Led architecture and development of the message processing subsystem for Cysive’s flagship product, Cysive Cymbio. Cysive Cymbio integrates multi-channel presentations with existing enterprise systems and web services.  \n \nLead Architect Consultant: Third Party Transportation Exchange Portal, Intermodal Freight Tendering System, Network Equipment B2B Commerce. Team Lead / Senior Developer SPS Payment Services - Dean Witter Discover 1990  –  1997  (7 years) Greater Chicago Area Frequency Marketing Online Transaction Processing System; Credit and Debit Transaction Authorization System. Team Lead / Senior Developer SPS Payment Services - Dean Witter Discover 1990  –  1997  (7 years) Greater Chicago Area Frequency Marketing Online Transaction Processing System; Credit and Debit Transaction Authorization System. Skills OOAD Web Services Architecture Software Engineering Enterprise Architecture Software Development UML Java Skills  OOAD Web Services Architecture Software Engineering Enterprise Architecture Software Development UML Java OOAD Web Services Architecture Software Engineering Enterprise Architecture Software Development UML Java OOAD Web Services Architecture Software Engineering Enterprise Architecture Software Development UML Java Education Northern Illinois University B.S.,  Computer Science Northern Illinois University B.S.,  Computer Science Northern Illinois University B.S.,  Computer Science Northern Illinois University B.S.,  Computer Science ", "Summary Development of high quality embedded and server software - primarily in C and C++ - primarily on Linux and custom platforms. Specialties:Extensive experience and proven history of success in embedded software development. Hardware interface solutions, graphical user interface solutions, and communications in large networked systems. Summary Development of high quality embedded and server software - primarily in C and C++ - primarily on Linux and custom platforms. Specialties:Extensive experience and proven history of success in embedded software development. Hardware interface solutions, graphical user interface solutions, and communications in large networked systems. Development of high quality embedded and server software - primarily in C and C++ - primarily on Linux and custom platforms. Specialties:Extensive experience and proven history of success in embedded software development. Hardware interface solutions, graphical user interface solutions, and communications in large networked systems. Development of high quality embedded and server software - primarily in C and C++ - primarily on Linux and custom platforms. Specialties:Extensive experience and proven history of success in embedded software development. Hardware interface solutions, graphical user interface solutions, and communications in large networked systems. Experience Software Development Engineer Intel Corporation February 2015  – Present (7 months) Chandler, AZ System Development of 6LowPan, IEEE802.15.4 based sensor network Component Software March 2014  – Present (1 year 6 months) Chandler Software Developer for Linux Kernel Device Driver Component Software, Inc October 2013  – Present (1 year 11 months) Chandler, AZ Developing audio device driver for Linux Kernel (3.x) for a high-capacity audio recorder. Adjunct Instructor, teaching introduction to C Maricopa Community Colleges August 2013  – Present (2 years 1 month) Mesa, AZ Owner Component Software, Inc. November 1999  – Present (15 years 10 months) Consultant Seamless Data Storage group Intel May 2012  –  October 2013  (1 year 6 months) Chandler, AZ Responsible for client/server communication protocol development and adaption for distributed file system. Consultant GoogleTv Platform development Intel April 2010  –  October 2011  (1 year 7 months) Chandler, AZ * Control software for ADI audio/video decoders. \n* Control software for Display output pipe \n* Control software for HDMI game mode (low latency display path) \n* Development of HDMI repeater software, based on ADI 7622 and Intel Sodaville processors Software Design Engineer General Dynamics C4 Systems 2008  –  2010  (2 years) Prinicipal Engineer for Automotive Circuits Fault Isolation and Failure Analysis Intel Corporation July 2003  –  March 2008  (4 years 9 months) Prinicipal engineer for fault isolation and failure analysis of embedded microcontrollers used in automotive applications. Successfully improved defect rates from several 100 defects per million to lower than 10 within 2 years. Embedded Software Design Engineer Nettime Solutions, LLC 2005  –  2008  (3 years) Senior Software Architect Intel Corporation April 1992  –  November 1998  (6 years 8 months) Developed image compression algorithms for still images, optimized for the transmission over narrow-band media. \nDeveloped image analysis software for feature recognition and assembly of stereoscopic images into three-dimensional models. engineer Intel 1986  –  1998  (12 years) Senior Design Engineer for Integrated Circuits Intel Corporation February 1987  –  April 1992  (5 years 3 months) Responsible for the top-level design and integration of automotive microcontrollers. Successfully developed and deployed technology to accelerate new product development cycles from 3+ years to approximately 6 months. Design Engineer Cimatel 1982  –  1986  (4 years) Software Development Engineer Intel Corporation February 2015  – Present (7 months) Chandler, AZ Software Development Engineer Intel Corporation February 2015  – Present (7 months) Chandler, AZ System Development of 6LowPan, IEEE802.15.4 based sensor network Component Software March 2014  – Present (1 year 6 months) Chandler System Development of 6LowPan, IEEE802.15.4 based sensor network Component Software March 2014  – Present (1 year 6 months) Chandler Software Developer for Linux Kernel Device Driver Component Software, Inc October 2013  – Present (1 year 11 months) Chandler, AZ Developing audio device driver for Linux Kernel (3.x) for a high-capacity audio recorder. Software Developer for Linux Kernel Device Driver Component Software, Inc October 2013  – Present (1 year 11 months) Chandler, AZ Developing audio device driver for Linux Kernel (3.x) for a high-capacity audio recorder. Adjunct Instructor, teaching introduction to C Maricopa Community Colleges August 2013  – Present (2 years 1 month) Mesa, AZ Adjunct Instructor, teaching introduction to C Maricopa Community Colleges August 2013  – Present (2 years 1 month) Mesa, AZ Owner Component Software, Inc. November 1999  – Present (15 years 10 months) Owner Component Software, Inc. November 1999  – Present (15 years 10 months) Consultant Seamless Data Storage group Intel May 2012  –  October 2013  (1 year 6 months) Chandler, AZ Responsible for client/server communication protocol development and adaption for distributed file system. Consultant Seamless Data Storage group Intel May 2012  –  October 2013  (1 year 6 months) Chandler, AZ Responsible for client/server communication protocol development and adaption for distributed file system. Consultant GoogleTv Platform development Intel April 2010  –  October 2011  (1 year 7 months) Chandler, AZ * Control software for ADI audio/video decoders. \n* Control software for Display output pipe \n* Control software for HDMI game mode (low latency display path) \n* Development of HDMI repeater software, based on ADI 7622 and Intel Sodaville processors Consultant GoogleTv Platform development Intel April 2010  –  October 2011  (1 year 7 months) Chandler, AZ * Control software for ADI audio/video decoders. \n* Control software for Display output pipe \n* Control software for HDMI game mode (low latency display path) \n* Development of HDMI repeater software, based on ADI 7622 and Intel Sodaville processors Software Design Engineer General Dynamics C4 Systems 2008  –  2010  (2 years) Software Design Engineer General Dynamics C4 Systems 2008  –  2010  (2 years) Prinicipal Engineer for Automotive Circuits Fault Isolation and Failure Analysis Intel Corporation July 2003  –  March 2008  (4 years 9 months) Prinicipal engineer for fault isolation and failure analysis of embedded microcontrollers used in automotive applications. Successfully improved defect rates from several 100 defects per million to lower than 10 within 2 years. Prinicipal Engineer for Automotive Circuits Fault Isolation and Failure Analysis Intel Corporation July 2003  –  March 2008  (4 years 9 months) Prinicipal engineer for fault isolation and failure analysis of embedded microcontrollers used in automotive applications. Successfully improved defect rates from several 100 defects per million to lower than 10 within 2 years. Embedded Software Design Engineer Nettime Solutions, LLC 2005  –  2008  (3 years) Embedded Software Design Engineer Nettime Solutions, LLC 2005  –  2008  (3 years) Senior Software Architect Intel Corporation April 1992  –  November 1998  (6 years 8 months) Developed image compression algorithms for still images, optimized for the transmission over narrow-band media. \nDeveloped image analysis software for feature recognition and assembly of stereoscopic images into three-dimensional models. Senior Software Architect Intel Corporation April 1992  –  November 1998  (6 years 8 months) Developed image compression algorithms for still images, optimized for the transmission over narrow-band media. \nDeveloped image analysis software for feature recognition and assembly of stereoscopic images into three-dimensional models. engineer Intel 1986  –  1998  (12 years) engineer Intel 1986  –  1998  (12 years) Senior Design Engineer for Integrated Circuits Intel Corporation February 1987  –  April 1992  (5 years 3 months) Responsible for the top-level design and integration of automotive microcontrollers. Successfully developed and deployed technology to accelerate new product development cycles from 3+ years to approximately 6 months. Senior Design Engineer for Integrated Circuits Intel Corporation February 1987  –  April 1992  (5 years 3 months) Responsible for the top-level design and integration of automotive microcontrollers. Successfully developed and deployed technology to accelerate new product development cycles from 3+ years to approximately 6 months. Design Engineer Cimatel 1982  –  1986  (4 years) Design Engineer Cimatel 1982  –  1986  (4 years) Languages French German French German French German Skills Embedded Systems Software Development Linux Device Drivers Embedded Software C++ C Software Engineering Unix Semiconductors Debugging Programming TCP/IP Perl Testing Java Agile Methodologies Network Engineering Firmware See 4+     See less Skills  Embedded Systems Software Development Linux Device Drivers Embedded Software C++ C Software Engineering Unix Semiconductors Debugging Programming TCP/IP Perl Testing Java Agile Methodologies Network Engineering Firmware See 4+     See less Embedded Systems Software Development Linux Device Drivers Embedded Software C++ C Software Engineering Unix Semiconductors Debugging Programming TCP/IP Perl Testing Java Agile Methodologies Network Engineering Firmware See 4+     See less Embedded Systems Software Development Linux Device Drivers Embedded Software C++ C Software Engineering Unix Semiconductors Debugging Programming TCP/IP Perl Testing Java Agile Methodologies Network Engineering Firmware See 4+     See less Education Fachhochschule Ulm - Hochschule für Technik BSEE,  Telecommunications Engineering 1976  – 1980 Fachhochschule Ulm - Hochschule für Technik BSEE,  Telecommunications Engineering 1976  – 1980 Fachhochschule Ulm - Hochschule für Technik BSEE,  Telecommunications Engineering 1976  – 1980 Fachhochschule Ulm - Hochschule für Technik BSEE,  Telecommunications Engineering 1976  – 1980 Honors & Awards Additional Honors & Awards patents related to image processing and communication protocols Additional Honors & Awards patents related to image processing and communication protocols Additional Honors & Awards patents related to image processing and communication protocols Additional Honors & Awards patents related to image processing and communication protocols ", "Experience Senior Software Architect Intel Corporation June 2013  – Present (2 years 3 months) Architected mobile applications and SDKs in the new devices and wearables group. Founder two forty four a.m. LLC 2008  – Present (7 years) Founder The Computer Coach of Charleston, LLC 1996  – Present (19 years) Charleston, SC Founded The Computer Coach at age 12, providing IT and software consulting to over 250 clients. Lead Developer, Android SCVNGR 2012  –  2013  (1 year) Greater Boston Area Software Engineer Akamai Technologies 2007  –  2011  (4 years) Greater Boston Area Software Engineering Intern Apple May 2006  –  August 2006  (4 months) San Francisco Bay Area Quality Assurance Intern Apple May 2005  –  August 2005  (4 months) San Francisco Bay Area Senior Software Architect Intel Corporation June 2013  – Present (2 years 3 months) Architected mobile applications and SDKs in the new devices and wearables group. Senior Software Architect Intel Corporation June 2013  – Present (2 years 3 months) Architected mobile applications and SDKs in the new devices and wearables group. Founder two forty four a.m. LLC 2008  – Present (7 years) Founder two forty four a.m. LLC 2008  – Present (7 years) Founder The Computer Coach of Charleston, LLC 1996  – Present (19 years) Charleston, SC Founded The Computer Coach at age 12, providing IT and software consulting to over 250 clients. Founder The Computer Coach of Charleston, LLC 1996  – Present (19 years) Charleston, SC Founded The Computer Coach at age 12, providing IT and software consulting to over 250 clients. Lead Developer, Android SCVNGR 2012  –  2013  (1 year) Greater Boston Area Lead Developer, Android SCVNGR 2012  –  2013  (1 year) Greater Boston Area Software Engineer Akamai Technologies 2007  –  2011  (4 years) Greater Boston Area Software Engineer Akamai Technologies 2007  –  2011  (4 years) Greater Boston Area Software Engineering Intern Apple May 2006  –  August 2006  (4 months) San Francisco Bay Area Software Engineering Intern Apple May 2006  –  August 2006  (4 months) San Francisco Bay Area Quality Assurance Intern Apple May 2005  –  August 2005  (4 months) San Francisco Bay Area Quality Assurance Intern Apple May 2005  –  August 2005  (4 months) San Francisco Bay Area Skills Skills     Education Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2003  – 2008 Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2003  – 2008 Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2003  – 2008 Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2003  – 2008 ", "Skills Microsoft SQL Server ASP.NET C# Software Development Relational Databases Visual Studio Perl Linux Agile Methodologies Software Engineering Software Design XML .NET Teamwork Management Embedded Systems Scrum See 2+     See less Skills  Microsoft SQL Server ASP.NET C# Software Development Relational Databases Visual Studio Perl Linux Agile Methodologies Software Engineering Software Design XML .NET Teamwork Management Embedded Systems Scrum See 2+     See less Microsoft SQL Server ASP.NET C# Software Development Relational Databases Visual Studio Perl Linux Agile Methodologies Software Engineering Software Design XML .NET Teamwork Management Embedded Systems Scrum See 2+     See less Microsoft SQL Server ASP.NET C# Software Development Relational Databases Visual Studio Perl Linux Agile Methodologies Software Engineering Software Design XML .NET Teamwork Management Embedded Systems Scrum See 2+     See less ", "Languages Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Wireless System Architecture Embedded Software Mobile Devices Embedded Systems Ethernet Software Development Architecture Cellular Communications WiFi Firmware SNMP TCP/IP RF USB IP Telecommunications Software Design Team Leadership Security Networking Device Drivers LTE Solution Architecture ASIC ARM RTOS Data Transfer SoC Digital Signal... Data Communication Cellular Mobile Flash Memory Python See 20+     See less Skills  Wireless System Architecture Embedded Software Mobile Devices Embedded Systems Ethernet Software Development Architecture Cellular Communications WiFi Firmware SNMP TCP/IP RF USB IP Telecommunications Software Design Team Leadership Security Networking Device Drivers LTE Solution Architecture ASIC ARM RTOS Data Transfer SoC Digital Signal... Data Communication Cellular Mobile Flash Memory Python See 20+     See less Wireless System Architecture Embedded Software Mobile Devices Embedded Systems Ethernet Software Development Architecture Cellular Communications WiFi Firmware SNMP TCP/IP RF USB IP Telecommunications Software Design Team Leadership Security Networking Device Drivers LTE Solution Architecture ASIC ARM RTOS Data Transfer SoC Digital Signal... Data Communication Cellular Mobile Flash Memory Python See 20+     See less Wireless System Architecture Embedded Software Mobile Devices Embedded Systems Ethernet Software Development Architecture Cellular Communications WiFi Firmware SNMP TCP/IP RF USB IP Telecommunications Software Design Team Leadership Security Networking Device Drivers LTE Solution Architecture ASIC ARM RTOS Data Transfer SoC Digital Signal... Data Communication Cellular Mobile Flash Memory Python See 20+     See less ", "Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Databases Data Warehousing Teradata SDLC Oracle RAC Oracle MySQL Software Development Scalability Software Engineering ETL MongoDB Skills  Databases Data Warehousing Teradata SDLC Oracle RAC Oracle MySQL Software Development Scalability Software Engineering ETL MongoDB Databases Data Warehousing Teradata SDLC Oracle RAC Oracle MySQL Software Development Scalability Software Engineering ETL MongoDB Databases Data Warehousing Teradata SDLC Oracle RAC Oracle MySQL Software Development Scalability Software Engineering ETL MongoDB ", "Summary \tAccomplished Technical Architect with 12+ years of industry experience. \n\tExperienced in diverse domain areas including payments, monetization, telecom, logistics and data warehousing. \n\tSuccessfully demonstrated technical leadership in multi-site co-development projects including distributed agile teams \n\tHas worked on enterprise class technology solutions for high profile clients such as British Telecom, Thomson Reuters (Paisley), Harte-Hanks, CSX World Terminals that included direct on-site engagements. \n\tSignificantly contributed for quality and productivity improvement of engineering teams through conducting training, mentoring, instilling best practices and establishing engineering rigour Summary \tAccomplished Technical Architect with 12+ years of industry experience. \n\tExperienced in diverse domain areas including payments, monetization, telecom, logistics and data warehousing. \n\tSuccessfully demonstrated technical leadership in multi-site co-development projects including distributed agile teams \n\tHas worked on enterprise class technology solutions for high profile clients such as British Telecom, Thomson Reuters (Paisley), Harte-Hanks, CSX World Terminals that included direct on-site engagements. \n\tSignificantly contributed for quality and productivity improvement of engineering teams through conducting training, mentoring, instilling best practices and establishing engineering rigour \tAccomplished Technical Architect with 12+ years of industry experience. \n\tExperienced in diverse domain areas including payments, monetization, telecom, logistics and data warehousing. \n\tSuccessfully demonstrated technical leadership in multi-site co-development projects including distributed agile teams \n\tHas worked on enterprise class technology solutions for high profile clients such as British Telecom, Thomson Reuters (Paisley), Harte-Hanks, CSX World Terminals that included direct on-site engagements. \n\tSignificantly contributed for quality and productivity improvement of engineering teams through conducting training, mentoring, instilling best practices and establishing engineering rigour \tAccomplished Technical Architect with 12+ years of industry experience. \n\tExperienced in diverse domain areas including payments, monetization, telecom, logistics and data warehousing. \n\tSuccessfully demonstrated technical leadership in multi-site co-development projects including distributed agile teams \n\tHas worked on enterprise class technology solutions for high profile clients such as British Telecom, Thomson Reuters (Paisley), Harte-Hanks, CSX World Terminals that included direct on-site engagements. \n\tSignificantly contributed for quality and productivity improvement of engineering teams through conducting training, mentoring, instilling best practices and establishing engineering rigour Experience Senior Software Architect Intel Corporation April 2013  – Present (2 years 5 months) Colombo, Sri Lanka Software Architect AePONA December 2010  –  April 2013  (2 years 5 months) Colombo, Sri Lanka Architect - Technology Virtusa (Pvt.) Ltd. October 2002  –  December 2010  (8 years 3 months) Ipswich / London / Boston / Colombo Industrial Trainee - Software Engineer eRunway (Pvt.) Ltd. August 2001  –  January 2002  (6 months) Colombo, Sri Lanka Senior Software Architect Intel Corporation April 2013  – Present (2 years 5 months) Colombo, Sri Lanka Senior Software Architect Intel Corporation April 2013  – Present (2 years 5 months) Colombo, Sri Lanka Software Architect AePONA December 2010  –  April 2013  (2 years 5 months) Colombo, Sri Lanka Software Architect AePONA December 2010  –  April 2013  (2 years 5 months) Colombo, Sri Lanka Architect - Technology Virtusa (Pvt.) Ltd. October 2002  –  December 2010  (8 years 3 months) Ipswich / London / Boston / Colombo Architect - Technology Virtusa (Pvt.) Ltd. October 2002  –  December 2010  (8 years 3 months) Ipswich / London / Boston / Colombo Industrial Trainee - Software Engineer eRunway (Pvt.) Ltd. August 2001  –  January 2002  (6 months) Colombo, Sri Lanka Industrial Trainee - Software Engineer eRunway (Pvt.) Ltd. August 2001  –  January 2002  (6 months) Colombo, Sri Lanka Languages   Skills Spring Java Enterprise Edition Hibernate Ant Web Services Analytical Skills Technical Leadership Software Engineering Software Architecture Object Oriented Design Architecture Tomcat Java JUnit Scrum SOA Software Development Agile Methodologies Pre-sales EJB Weblogic UML Design Patterns REST Servlets JDBC Maven SOAP Test Driven Development Software Design JSP JMS Eclipse OOP Distributed Systems XML Spring Framework WebLogic See 23+     See less Skills  Spring Java Enterprise Edition Hibernate Ant Web Services Analytical Skills Technical Leadership Software Engineering Software Architecture Object Oriented Design Architecture Tomcat Java JUnit Scrum SOA Software Development Agile Methodologies Pre-sales EJB Weblogic UML Design Patterns REST Servlets JDBC Maven SOAP Test Driven Development Software Design JSP JMS Eclipse OOP Distributed Systems XML Spring Framework WebLogic See 23+     See less Spring Java Enterprise Edition Hibernate Ant Web Services Analytical Skills Technical Leadership Software Engineering Software Architecture Object Oriented Design Architecture Tomcat Java JUnit Scrum SOA Software Development Agile Methodologies Pre-sales EJB Weblogic UML Design Patterns REST Servlets JDBC Maven SOAP Test Driven Development Software Design JSP JMS Eclipse OOP Distributed Systems XML Spring Framework WebLogic See 23+     See less Spring Java Enterprise Edition Hibernate Ant Web Services Analytical Skills Technical Leadership Software Engineering Software Architecture Object Oriented Design Architecture Tomcat Java JUnit Scrum SOA Software Development Agile Methodologies Pre-sales EJB Weblogic UML Design Patterns REST Servlets JDBC Maven SOAP Test Driven Development Software Design JSP JMS Eclipse OOP Distributed Systems XML Spring Framework WebLogic See 23+     See less Education University of Moratuwa M. Sc.,  Computer Science - Specializing in Software Architecture 2006  – 2008 GPA: 4.11 out of 4.20 University of Moratuwa B.Sc. Eng. (Hons),  Computer Science & Engineering , 1st Class Honors 1998  – 2002 GPA: 3.86 out of 4.00 D. S. Senanayake College, Colombo 7. 1983  – 1996 University of Moratuwa M. Sc.,  Computer Science - Specializing in Software Architecture 2006  – 2008 GPA: 4.11 out of 4.20 University of Moratuwa M. Sc.,  Computer Science - Specializing in Software Architecture 2006  – 2008 GPA: 4.11 out of 4.20 University of Moratuwa M. Sc.,  Computer Science - Specializing in Software Architecture 2006  – 2008 GPA: 4.11 out of 4.20 University of Moratuwa B.Sc. Eng. (Hons),  Computer Science & Engineering , 1st Class Honors 1998  – 2002 GPA: 3.86 out of 4.00 University of Moratuwa B.Sc. Eng. (Hons),  Computer Science & Engineering , 1st Class Honors 1998  – 2002 GPA: 3.86 out of 4.00 University of Moratuwa B.Sc. Eng. (Hons),  Computer Science & Engineering , 1st Class Honors 1998  – 2002 GPA: 3.86 out of 4.00 D. S. Senanayake College, Colombo 7. 1983  – 1996 D. S. Senanayake College, Colombo 7. 1983  – 1996 D. S. Senanayake College, Colombo 7. 1983  – 1996 Honors & Awards Outstanding Trainer Virtusa (Pvt.) Ltd. September 2008 In recognition of the outstanding training given to Virtusans at the Advance Technology Center in Sri Lanka Virtusa Innovation Award Virtusa (Pvt.) Ltd. February 2007 In recognition of the outstanding contribution towards Web 2.0/SOA Orchestration Technology platform Virtusa Rave Award Virtusa (Pvt.) Ltd. October 2004 In recognition of valued contribution for Engineering Excellence CINTEC Award for the Best Computer Science & Engineering Final Year Project 2000/2001 University of Moratuwa Outstanding Trainer Virtusa (Pvt.) Ltd. September 2008 In recognition of the outstanding training given to Virtusans at the Advance Technology Center in Sri Lanka Outstanding Trainer Virtusa (Pvt.) Ltd. September 2008 In recognition of the outstanding training given to Virtusans at the Advance Technology Center in Sri Lanka Outstanding Trainer Virtusa (Pvt.) Ltd. September 2008 In recognition of the outstanding training given to Virtusans at the Advance Technology Center in Sri Lanka Virtusa Innovation Award Virtusa (Pvt.) Ltd. February 2007 In recognition of the outstanding contribution towards Web 2.0/SOA Orchestration Technology platform Virtusa Innovation Award Virtusa (Pvt.) Ltd. February 2007 In recognition of the outstanding contribution towards Web 2.0/SOA Orchestration Technology platform Virtusa Innovation Award Virtusa (Pvt.) Ltd. February 2007 In recognition of the outstanding contribution towards Web 2.0/SOA Orchestration Technology platform Virtusa Rave Award Virtusa (Pvt.) Ltd. October 2004 In recognition of valued contribution for Engineering Excellence Virtusa Rave Award Virtusa (Pvt.) Ltd. October 2004 In recognition of valued contribution for Engineering Excellence Virtusa Rave Award Virtusa (Pvt.) Ltd. October 2004 In recognition of valued contribution for Engineering Excellence CINTEC Award for the Best Computer Science & Engineering Final Year Project 2000/2001 University of Moratuwa CINTEC Award for the Best Computer Science & Engineering Final Year Project 2000/2001 University of Moratuwa CINTEC Award for the Best Computer Science & Engineering Final Year Project 2000/2001 University of Moratuwa ", "Experience Technical Program Manager - Sales and Marketing Group, Intel Customer Support Intel Corporation March 2015  – Present (6 months) Folsom, CA Senior Enterprise Architect - SaaS Solutions Intel Corporation 2010  – Present (5 years) Folsom, CA Senior Enterprise Architect, SAP Netweaver Intel Corporation 2006  –  2010  (4 years) Folsom, CA Senior Enterprise Architect - Middleware solutions Intel Corporation 2002  –  2005  (3 years) Folsom, CA Senior Software Architect Intel Corporation 1990  –  2002  (12 years) Hillsboro, OR Lithography Process Engineer Intel Corporation 1983  –  1990  (7 years) Aloha, OR Technical Program Manager - Sales and Marketing Group, Intel Customer Support Intel Corporation March 2015  – Present (6 months) Folsom, CA Technical Program Manager - Sales and Marketing Group, Intel Customer Support Intel Corporation March 2015  – Present (6 months) Folsom, CA Senior Enterprise Architect - SaaS Solutions Intel Corporation 2010  – Present (5 years) Folsom, CA Senior Enterprise Architect - SaaS Solutions Intel Corporation 2010  – Present (5 years) Folsom, CA Senior Enterprise Architect, SAP Netweaver Intel Corporation 2006  –  2010  (4 years) Folsom, CA Senior Enterprise Architect, SAP Netweaver Intel Corporation 2006  –  2010  (4 years) Folsom, CA Senior Enterprise Architect - Middleware solutions Intel Corporation 2002  –  2005  (3 years) Folsom, CA Senior Enterprise Architect - Middleware solutions Intel Corporation 2002  –  2005  (3 years) Folsom, CA Senior Software Architect Intel Corporation 1990  –  2002  (12 years) Hillsboro, OR Senior Software Architect Intel Corporation 1990  –  2002  (12 years) Hillsboro, OR Lithography Process Engineer Intel Corporation 1983  –  1990  (7 years) Aloha, OR Lithography Process Engineer Intel Corporation 1983  –  1990  (7 years) Aloha, OR Languages English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Enterprise Architecture SaaS Integration Software Development Software Project... Program Management Salesforce.com NetSuite Agile Methodologies Cloud Computing Enterprise Software System Architecture Microprocessors Software Engineering Perl Computer Architecture See 1+     See less Skills  Enterprise Architecture SaaS Integration Software Development Software Project... Program Management Salesforce.com NetSuite Agile Methodologies Cloud Computing Enterprise Software System Architecture Microprocessors Software Engineering Perl Computer Architecture See 1+     See less Enterprise Architecture SaaS Integration Software Development Software Project... Program Management Salesforce.com NetSuite Agile Methodologies Cloud Computing Enterprise Software System Architecture Microprocessors Software Engineering Perl Computer Architecture See 1+     See less Enterprise Architecture SaaS Integration Software Development Software Project... Program Management Salesforce.com NetSuite Agile Methodologies Cloud Computing Enterprise Software System Architecture Microprocessors Software Engineering Perl Computer Architecture See 1+     See less Education Oregon State University Bachelor of Science (BS),  Chemical Engineering , 3.52/4.0 1979  – 1993 Oregon Graduate Institute of Science & Technology Master of Science (M.S.),  Computer Science , 3.66/4.0 1990  – 1992 Oregon State University Bachelor of Science (BS),  Chemical Engineering , 3.52/4.0 1979  – 1993 Oregon State University Bachelor of Science (BS),  Chemical Engineering , 3.52/4.0 1979  – 1993 Oregon State University Bachelor of Science (BS),  Chemical Engineering , 3.52/4.0 1979  – 1993 Oregon Graduate Institute of Science & Technology Master of Science (M.S.),  Computer Science , 3.66/4.0 1990  – 1992 Oregon Graduate Institute of Science & Technology Master of Science (M.S.),  Computer Science , 3.66/4.0 1990  – 1992 Oregon Graduate Institute of Science & Technology Master of Science (M.S.),  Computer Science , 3.66/4.0 1990  – 1992 Honors & Awards Intel Achievement Award Intel Corporation November 1990 For the development of ORCA station control architecture. Intel Achievement Award Intel Corporation November 1990 For the development of ORCA station control architecture. Intel Achievement Award Intel Corporation November 1990 For the development of ORCA station control architecture. Intel Achievement Award Intel Corporation November 1990 For the development of ORCA station control architecture. ", "Experience Sr. Strategic Planner - Client Computing Group Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, OR Responsible for managing the corporate strategic long-term silicon roadmap for Intel's PC and tablet computing products, a $34B business unit in 2014. In this role drive cross-organizational teams for long-range product strategy definition, identification and evaluation business growth opportunities, development of new business models, competitive analysis, product segmentation strategy, and the management of strategic intellectual property priorities. \n \nAdditional responsibility include managing the visual media and display technology strategy and future product roadmaps for Intel's PC and tablet SoC's. Strategic Technology and User Experience Planner Intel January 2006  –  July 2014  (8 years 7 months) Hillsboro, OR Responsible for the establishing the vision, strategy, long-term product roadmap for Intel's enterprise client computing products, an $18B division within Intel. Lead global and cross-organization teams to translate strategy to an actionable product roadmaps, lead R&D and technology pathfinding activities, and built strategic relationships with key external partners. \n Solution Architect - PC Client Group Intel Corporation January 2005  –  January 2006  (1 year 1 month) Hillsboro, OR Responsible for identifying and driving to implementation PC hardware and software solutions that improved how users utilize business PCs for rich video and audio collaboration. Built internal cross-organization planning and architecture teams, and became the focal point for external partner engagements. Senior Software Architect Intel Corporation June 1999  –  January 2005  (5 years 8 months) Hillsboro, OR Senor Systems Engineer Intel Corporation January 1996  –  June 1999  (3 years 6 months) Hillsboro, OR Sr. Strategic Planner - Client Computing Group Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, OR Responsible for managing the corporate strategic long-term silicon roadmap for Intel's PC and tablet computing products, a $34B business unit in 2014. In this role drive cross-organizational teams for long-range product strategy definition, identification and evaluation business growth opportunities, development of new business models, competitive analysis, product segmentation strategy, and the management of strategic intellectual property priorities. \n \nAdditional responsibility include managing the visual media and display technology strategy and future product roadmaps for Intel's PC and tablet SoC's. Sr. Strategic Planner - Client Computing Group Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, OR Responsible for managing the corporate strategic long-term silicon roadmap for Intel's PC and tablet computing products, a $34B business unit in 2014. In this role drive cross-organizational teams for long-range product strategy definition, identification and evaluation business growth opportunities, development of new business models, competitive analysis, product segmentation strategy, and the management of strategic intellectual property priorities. \n \nAdditional responsibility include managing the visual media and display technology strategy and future product roadmaps for Intel's PC and tablet SoC's. Strategic Technology and User Experience Planner Intel January 2006  –  July 2014  (8 years 7 months) Hillsboro, OR Responsible for the establishing the vision, strategy, long-term product roadmap for Intel's enterprise client computing products, an $18B division within Intel. Lead global and cross-organization teams to translate strategy to an actionable product roadmaps, lead R&D and technology pathfinding activities, and built strategic relationships with key external partners. \n Strategic Technology and User Experience Planner Intel January 2006  –  July 2014  (8 years 7 months) Hillsboro, OR Responsible for the establishing the vision, strategy, long-term product roadmap for Intel's enterprise client computing products, an $18B division within Intel. Lead global and cross-organization teams to translate strategy to an actionable product roadmaps, lead R&D and technology pathfinding activities, and built strategic relationships with key external partners. \n Solution Architect - PC Client Group Intel Corporation January 2005  –  January 2006  (1 year 1 month) Hillsboro, OR Responsible for identifying and driving to implementation PC hardware and software solutions that improved how users utilize business PCs for rich video and audio collaboration. Built internal cross-organization planning and architecture teams, and became the focal point for external partner engagements. Solution Architect - PC Client Group Intel Corporation January 2005  –  January 2006  (1 year 1 month) Hillsboro, OR Responsible for identifying and driving to implementation PC hardware and software solutions that improved how users utilize business PCs for rich video and audio collaboration. Built internal cross-organization planning and architecture teams, and became the focal point for external partner engagements. Senior Software Architect Intel Corporation June 1999  –  January 2005  (5 years 8 months) Hillsboro, OR Senior Software Architect Intel Corporation June 1999  –  January 2005  (5 years 8 months) Hillsboro, OR Senor Systems Engineer Intel Corporation January 1996  –  June 1999  (3 years 6 months) Hillsboro, OR Senor Systems Engineer Intel Corporation January 1996  –  June 1999  (3 years 6 months) Hillsboro, OR Languages   Skills Strategic Planning Computer Architecture Semiconductors Strategy Mobile Devices Strategic Roadmaps Project Management User Experience X86 Program Management Cross-functional Team... User Research Competitive Analysis Team Leadership Enterprise Software Long Range Planning Corporate Strategy... Enterprise Architecture User-centered Design Strategic Partnerships SoC System Architecture Business Strategy Wireless Networking Device Drivers Go-to-market Strategy Product Management Location Based Services Experience Design Embedded Systems Product Marketing Intel Software Engineering Embedded Software Team Building Computer Security Mergers & Acquisitions Intellectual Property Processors Business Process... Collaborative Problem... Product Strategy Executive Level... Market Sizing Project Visioning See 30+     See less Skills  Strategic Planning Computer Architecture Semiconductors Strategy Mobile Devices Strategic Roadmaps Project Management User Experience X86 Program Management Cross-functional Team... User Research Competitive Analysis Team Leadership Enterprise Software Long Range Planning Corporate Strategy... Enterprise Architecture User-centered Design Strategic Partnerships SoC System Architecture Business Strategy Wireless Networking Device Drivers Go-to-market Strategy Product Management Location Based Services Experience Design Embedded Systems Product Marketing Intel Software Engineering Embedded Software Team Building Computer Security Mergers & Acquisitions Intellectual Property Processors Business Process... Collaborative Problem... Product Strategy Executive Level... Market Sizing Project Visioning See 30+     See less Strategic Planning Computer Architecture Semiconductors Strategy Mobile Devices Strategic Roadmaps Project Management User Experience X86 Program Management Cross-functional Team... User Research Competitive Analysis Team Leadership Enterprise Software Long Range Planning Corporate Strategy... Enterprise Architecture User-centered Design Strategic Partnerships SoC System Architecture Business Strategy Wireless Networking Device Drivers Go-to-market Strategy Product Management Location Based Services Experience Design Embedded Systems Product Marketing Intel Software Engineering Embedded Software Team Building Computer Security Mergers & Acquisitions Intellectual Property Processors Business Process... Collaborative Problem... Product Strategy Executive Level... Market Sizing Project Visioning See 30+     See less Strategic Planning Computer Architecture Semiconductors Strategy Mobile Devices Strategic Roadmaps Project Management User Experience X86 Program Management Cross-functional Team... User Research Competitive Analysis Team Leadership Enterprise Software Long Range Planning Corporate Strategy... Enterprise Architecture User-centered Design Strategic Partnerships SoC System Architecture Business Strategy Wireless Networking Device Drivers Go-to-market Strategy Product Management Location Based Services Experience Design Embedded Systems Product Marketing Intel Software Engineering Embedded Software Team Building Computer Security Mergers & Acquisitions Intellectual Property Processors Business Process... Collaborative Problem... Product Strategy Executive Level... Market Sizing Project Visioning See 30+     See less Education University of Wisconsin-Madison BS,  Computer Science 1991  – 1996 University of Wisconsin-Madison BS,  Computer Science 1991  – 1996 University of Wisconsin-Madison BS,  Computer Science 1991  – 1996 University of Wisconsin-Madison BS,  Computer Science 1991  – 1996 Honors & Awards ", "Summary I am a seasoned and talented software leader with 23 years of combined experience working for one of the most innovative technology company on the planet as well as building successful start-ups. \n \nI have extensive experience in all aspects of software engineering from building and managing highly efficient teams, through product definition and architecture of large scale world class products, to building partnerships, M&A and product evangelism. I am passionate about working with smart people and doing whatever it takes to build products I can be proud of. I thrive at a high pace, agile environment and throughout my career I was fortunate to find those ‘adrenaline islands’ even within large corporations. \n \nIn my current role as senior SW Engineering Manager I focus on scaling Intel Cloud Services for wearables and other Internet of Things devices. \n \nMy core areas of expertise include: building, motivating and leading world-class engineering teams, building end-to-end system architectures spanning devices and cloud, cloud services design and best practices, web and mobile app development, agile software development and continuous software delivery/deployment.  \n \nI am interested in Director of SW Engineering, Chief SW Architect or similar leadership opportunities. I can be reached at vadimgore@hotmail.com. \n \nSkills keywords: SAAS / PAAS, Cloud, SOA, Scalability, Site Reliability, API, SDK, REST, JSON, AWS, Openstack, Big Data, Analytics, MongoDB, Tableu, HTML5, Javascript, Angular.JS, node.js, nginx, Puppet, Chef, Docker, Android, Linux, Windows, .NET, SCRUM, Scaled Agile Framework, Security, Wearables, Internet of Things / IOT, C++, Java Summary I am a seasoned and talented software leader with 23 years of combined experience working for one of the most innovative technology company on the planet as well as building successful start-ups. \n \nI have extensive experience in all aspects of software engineering from building and managing highly efficient teams, through product definition and architecture of large scale world class products, to building partnerships, M&A and product evangelism. I am passionate about working with smart people and doing whatever it takes to build products I can be proud of. I thrive at a high pace, agile environment and throughout my career I was fortunate to find those ‘adrenaline islands’ even within large corporations. \n \nIn my current role as senior SW Engineering Manager I focus on scaling Intel Cloud Services for wearables and other Internet of Things devices. \n \nMy core areas of expertise include: building, motivating and leading world-class engineering teams, building end-to-end system architectures spanning devices and cloud, cloud services design and best practices, web and mobile app development, agile software development and continuous software delivery/deployment.  \n \nI am interested in Director of SW Engineering, Chief SW Architect or similar leadership opportunities. I can be reached at vadimgore@hotmail.com. \n \nSkills keywords: SAAS / PAAS, Cloud, SOA, Scalability, Site Reliability, API, SDK, REST, JSON, AWS, Openstack, Big Data, Analytics, MongoDB, Tableu, HTML5, Javascript, Angular.JS, node.js, nginx, Puppet, Chef, Docker, Android, Linux, Windows, .NET, SCRUM, Scaled Agile Framework, Security, Wearables, Internet of Things / IOT, C++, Java I am a seasoned and talented software leader with 23 years of combined experience working for one of the most innovative technology company on the planet as well as building successful start-ups. \n \nI have extensive experience in all aspects of software engineering from building and managing highly efficient teams, through product definition and architecture of large scale world class products, to building partnerships, M&A and product evangelism. I am passionate about working with smart people and doing whatever it takes to build products I can be proud of. I thrive at a high pace, agile environment and throughout my career I was fortunate to find those ‘adrenaline islands’ even within large corporations. \n \nIn my current role as senior SW Engineering Manager I focus on scaling Intel Cloud Services for wearables and other Internet of Things devices. \n \nMy core areas of expertise include: building, motivating and leading world-class engineering teams, building end-to-end system architectures spanning devices and cloud, cloud services design and best practices, web and mobile app development, agile software development and continuous software delivery/deployment.  \n \nI am interested in Director of SW Engineering, Chief SW Architect or similar leadership opportunities. I can be reached at vadimgore@hotmail.com. \n \nSkills keywords: SAAS / PAAS, Cloud, SOA, Scalability, Site Reliability, API, SDK, REST, JSON, AWS, Openstack, Big Data, Analytics, MongoDB, Tableu, HTML5, Javascript, Angular.JS, node.js, nginx, Puppet, Chef, Docker, Android, Linux, Windows, .NET, SCRUM, Scaled Agile Framework, Security, Wearables, Internet of Things / IOT, C++, Java I am a seasoned and talented software leader with 23 years of combined experience working for one of the most innovative technology company on the planet as well as building successful start-ups. \n \nI have extensive experience in all aspects of software engineering from building and managing highly efficient teams, through product definition and architecture of large scale world class products, to building partnerships, M&A and product evangelism. I am passionate about working with smart people and doing whatever it takes to build products I can be proud of. I thrive at a high pace, agile environment and throughout my career I was fortunate to find those ‘adrenaline islands’ even within large corporations. \n \nIn my current role as senior SW Engineering Manager I focus on scaling Intel Cloud Services for wearables and other Internet of Things devices. \n \nMy core areas of expertise include: building, motivating and leading world-class engineering teams, building end-to-end system architectures spanning devices and cloud, cloud services design and best practices, web and mobile app development, agile software development and continuous software delivery/deployment.  \n \nI am interested in Director of SW Engineering, Chief SW Architect or similar leadership opportunities. I can be reached at vadimgore@hotmail.com. \n \nSkills keywords: SAAS / PAAS, Cloud, SOA, Scalability, Site Reliability, API, SDK, REST, JSON, AWS, Openstack, Big Data, Analytics, MongoDB, Tableu, HTML5, Javascript, Angular.JS, node.js, nginx, Puppet, Chef, Docker, Android, Linux, Windows, .NET, SCRUM, Scaled Agile Framework, Security, Wearables, Internet of Things / IOT, C++, Java Experience Senior Cloud Solutions Scaling Manager for Wearables Intel Corporation 2013  – Present (2 years) Portland, Oregon Area Senior Cloud Solutions Scaling Manager, Intel New Technology Group (Internet of Things and Wearables) Lead Platform Architect Intel Corporation 2011  –  2013  (2 years) Portland, Oregon Area Spearheaded, architected and directed implementation of Intel Cloud Services Platform (CSP) - a collection of identity-based cloud services for developers, including Identity, Location, Billing, Context, Analytics, Storage, Recommendation Engine and others Software Engineering Manager Intel Corporation 2009  –  2011  (2 years) Santa Clara, CA Directed design and development of cross platform Intel® AppUp Developer Program SDK from the ground up for Windows and MeeGo OS, supporting multiple development languages: C/C++/C#/Java/ActionScript and multiple runtimes: C/C++, Adobe AIR, Java, .Net, Silverlight, QT Software Engineering Manager Intel Corporation 2008  –  2009  (1 year) San Francisco Bay Area Managed team of UI architects and developers for Intel Reader® - innovative mobile device, helping users with reading-based learning disabilities or visual impairments to increase freedom, enjoyment, and confidence in daily life, improve productivity and efficiency at school or work Senior Software Architect Intel Corporation 2007  –  2008  (1 year) San Francisco Bay Area Key contributor to a number of R&D initiatives in the areas SMB Manageability and Platform Virtualization, research activities in SaaS platform enabling and Web 2.0 development Platform Architect, Manager, Design Technology Solutions Intel Corporation 2002  –  2007  (5 years) San Francisco Bay Area Techical lead to multiple CAD tools development projects Senior Software Architect Thomson Financial 2001  –  2002  (1 year) Greater New York City Area Architected and developed online financial information system for Active Traders and institutional brokerage firms Software Engineering Manager Broadserve February 2000  –  August 2001  (1 year 7 months) Greater New York City Area Led team which architected an integrated software services suite allowing users to access videoconferencing, voice over IP, video-on-demand, streaming TV and e-commerce applications Senior Software Engineer Intel July 1996  –  February 2000  (3 years 8 months) Israel Architected, and led development and deployment of very large and complex integrated CAD software tool-suite, used internally by 1000+ of Intel chip designers. All major Intel processor product lines have been designed using this tool-suite Senior Software Engineer Sirotech Ltd. March 1993  –  July 1996  (3 years 5 months) Israel Wore multiple hats, front-end and back-end developer and managing back-end infrastructure Senior Cloud Solutions Scaling Manager for Wearables Intel Corporation 2013  – Present (2 years) Portland, Oregon Area Senior Cloud Solutions Scaling Manager, Intel New Technology Group (Internet of Things and Wearables) Senior Cloud Solutions Scaling Manager for Wearables Intel Corporation 2013  – Present (2 years) Portland, Oregon Area Senior Cloud Solutions Scaling Manager, Intel New Technology Group (Internet of Things and Wearables) Lead Platform Architect Intel Corporation 2011  –  2013  (2 years) Portland, Oregon Area Spearheaded, architected and directed implementation of Intel Cloud Services Platform (CSP) - a collection of identity-based cloud services for developers, including Identity, Location, Billing, Context, Analytics, Storage, Recommendation Engine and others Lead Platform Architect Intel Corporation 2011  –  2013  (2 years) Portland, Oregon Area Spearheaded, architected and directed implementation of Intel Cloud Services Platform (CSP) - a collection of identity-based cloud services for developers, including Identity, Location, Billing, Context, Analytics, Storage, Recommendation Engine and others Software Engineering Manager Intel Corporation 2009  –  2011  (2 years) Santa Clara, CA Directed design and development of cross platform Intel® AppUp Developer Program SDK from the ground up for Windows and MeeGo OS, supporting multiple development languages: C/C++/C#/Java/ActionScript and multiple runtimes: C/C++, Adobe AIR, Java, .Net, Silverlight, QT Software Engineering Manager Intel Corporation 2009  –  2011  (2 years) Santa Clara, CA Directed design and development of cross platform Intel® AppUp Developer Program SDK from the ground up for Windows and MeeGo OS, supporting multiple development languages: C/C++/C#/Java/ActionScript and multiple runtimes: C/C++, Adobe AIR, Java, .Net, Silverlight, QT Software Engineering Manager Intel Corporation 2008  –  2009  (1 year) San Francisco Bay Area Managed team of UI architects and developers for Intel Reader® - innovative mobile device, helping users with reading-based learning disabilities or visual impairments to increase freedom, enjoyment, and confidence in daily life, improve productivity and efficiency at school or work Software Engineering Manager Intel Corporation 2008  –  2009  (1 year) San Francisco Bay Area Managed team of UI architects and developers for Intel Reader® - innovative mobile device, helping users with reading-based learning disabilities or visual impairments to increase freedom, enjoyment, and confidence in daily life, improve productivity and efficiency at school or work Senior Software Architect Intel Corporation 2007  –  2008  (1 year) San Francisco Bay Area Key contributor to a number of R&D initiatives in the areas SMB Manageability and Platform Virtualization, research activities in SaaS platform enabling and Web 2.0 development Senior Software Architect Intel Corporation 2007  –  2008  (1 year) San Francisco Bay Area Key contributor to a number of R&D initiatives in the areas SMB Manageability and Platform Virtualization, research activities in SaaS platform enabling and Web 2.0 development Platform Architect, Manager, Design Technology Solutions Intel Corporation 2002  –  2007  (5 years) San Francisco Bay Area Techical lead to multiple CAD tools development projects Platform Architect, Manager, Design Technology Solutions Intel Corporation 2002  –  2007  (5 years) San Francisco Bay Area Techical lead to multiple CAD tools development projects Senior Software Architect Thomson Financial 2001  –  2002  (1 year) Greater New York City Area Architected and developed online financial information system for Active Traders and institutional brokerage firms Senior Software Architect Thomson Financial 2001  –  2002  (1 year) Greater New York City Area Architected and developed online financial information system for Active Traders and institutional brokerage firms Software Engineering Manager Broadserve February 2000  –  August 2001  (1 year 7 months) Greater New York City Area Led team which architected an integrated software services suite allowing users to access videoconferencing, voice over IP, video-on-demand, streaming TV and e-commerce applications Software Engineering Manager Broadserve February 2000  –  August 2001  (1 year 7 months) Greater New York City Area Led team which architected an integrated software services suite allowing users to access videoconferencing, voice over IP, video-on-demand, streaming TV and e-commerce applications Senior Software Engineer Intel July 1996  –  February 2000  (3 years 8 months) Israel Architected, and led development and deployment of very large and complex integrated CAD software tool-suite, used internally by 1000+ of Intel chip designers. All major Intel processor product lines have been designed using this tool-suite Senior Software Engineer Intel July 1996  –  February 2000  (3 years 8 months) Israel Architected, and led development and deployment of very large and complex integrated CAD software tool-suite, used internally by 1000+ of Intel chip designers. All major Intel processor product lines have been designed using this tool-suite Senior Software Engineer Sirotech Ltd. March 1993  –  July 1996  (3 years 5 months) Israel Wore multiple hats, front-end and back-end developer and managing back-end infrastructure Senior Software Engineer Sirotech Ltd. March 1993  –  July 1996  (3 years 5 months) Israel Wore multiple hats, front-end and back-end developer and managing back-end infrastructure Languages Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Ukrainian Professional working proficiency English Full professional proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Ukrainian Professional working proficiency English Full professional proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Ukrainian Professional working proficiency English Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Full professional proficiency Skills Software Development Distributed Systems Object Oriented Design Mobile Applications Software Design C++ System Architecture Scalability Agile Methodologies Cloud Computing SOA Databases SaaS Scrum Architecture Web Services Management SDK development Security Mobile Devices Team Leadership Technical Leadership RESTful WebServices OAuth Android Development Internet of Things Amazon Web Services... AWS Tableau Big Data Android Cross-platform... Data Monetization Wearables REST JSON MongoDB node.js Chef DevOps Continuous Delivery See 26+     See less Skills  Software Development Distributed Systems Object Oriented Design Mobile Applications Software Design C++ System Architecture Scalability Agile Methodologies Cloud Computing SOA Databases SaaS Scrum Architecture Web Services Management SDK development Security Mobile Devices Team Leadership Technical Leadership RESTful WebServices OAuth Android Development Internet of Things Amazon Web Services... AWS Tableau Big Data Android Cross-platform... Data Monetization Wearables REST JSON MongoDB node.js Chef DevOps Continuous Delivery See 26+     See less Software Development Distributed Systems Object Oriented Design Mobile Applications Software Design C++ System Architecture Scalability Agile Methodologies Cloud Computing SOA Databases SaaS Scrum Architecture Web Services Management SDK development Security Mobile Devices Team Leadership Technical Leadership RESTful WebServices OAuth Android Development Internet of Things Amazon Web Services... AWS Tableau Big Data Android Cross-platform... Data Monetization Wearables REST JSON MongoDB node.js Chef DevOps Continuous Delivery See 26+     See less Software Development Distributed Systems Object Oriented Design Mobile Applications Software Design C++ System Architecture Scalability Agile Methodologies Cloud Computing SOA Databases SaaS Scrum Architecture Web Services Management SDK development Security Mobile Devices Team Leadership Technical Leadership RESTful WebServices OAuth Android Development Internet of Things Amazon Web Services... AWS Tableau Big Data Android Cross-platform... Data Monetization Wearables REST JSON MongoDB node.js Chef DevOps Continuous Delivery See 26+     See less Honors & Awards ", "Skills High Performance... Distributed Systems C++ Debugging Algorithms Software Engineering Operating Systems Simulations Embedded Systems Linux Skills  High Performance... Distributed Systems C++ Debugging Algorithms Software Engineering Operating Systems Simulations Embedded Systems Linux High Performance... Distributed Systems C++ Debugging Algorithms Software Engineering Operating Systems Simulations Embedded Systems Linux High Performance... Distributed Systems C++ Debugging Algorithms Software Engineering Operating Systems Simulations Embedded Systems Linux ", "Summary Experienced senior software engineer with proven architectural skill and a strong background in embedded software development, data telecommunications, network security, distributed application processing, and Internet standards development. \n \nTwenty-five years of embedded software development experience, in products ranging from military drone aircraft, commercial spacecraft, home Internet gateways, personal mobile devices, game consoles, et cetera. Comfortable troubleshooting with only access to cryptic and incomplete log message streams. \n \nSix years as leading IPv6 network software engineering expert at Apple. Strategic foresight, communication and attention to technical detail was critical in the successful and timely readiness of OS X, iOS and other embedded products for World IPv6 Launch. \n \nEditor, main author, and implementor of RFC 6092, Simple Security in IPv6 Gateway CPE. Contributor to many other Internet Drafts and RFCs. Praised in IETF for excellence in technical and editorial craftsmanship. Summary Experienced senior software engineer with proven architectural skill and a strong background in embedded software development, data telecommunications, network security, distributed application processing, and Internet standards development. \n \nTwenty-five years of embedded software development experience, in products ranging from military drone aircraft, commercial spacecraft, home Internet gateways, personal mobile devices, game consoles, et cetera. Comfortable troubleshooting with only access to cryptic and incomplete log message streams. \n \nSix years as leading IPv6 network software engineering expert at Apple. Strategic foresight, communication and attention to technical detail was critical in the successful and timely readiness of OS X, iOS and other embedded products for World IPv6 Launch. \n \nEditor, main author, and implementor of RFC 6092, Simple Security in IPv6 Gateway CPE. Contributor to many other Internet Drafts and RFCs. Praised in IETF for excellence in technical and editorial craftsmanship. Experienced senior software engineer with proven architectural skill and a strong background in embedded software development, data telecommunications, network security, distributed application processing, and Internet standards development. \n \nTwenty-five years of embedded software development experience, in products ranging from military drone aircraft, commercial spacecraft, home Internet gateways, personal mobile devices, game consoles, et cetera. Comfortable troubleshooting with only access to cryptic and incomplete log message streams. \n \nSix years as leading IPv6 network software engineering expert at Apple. Strategic foresight, communication and attention to technical detail was critical in the successful and timely readiness of OS X, iOS and other embedded products for World IPv6 Launch. \n \nEditor, main author, and implementor of RFC 6092, Simple Security in IPv6 Gateway CPE. Contributor to many other Internet Drafts and RFCs. Praised in IETF for excellence in technical and editorial craftsmanship. Experienced senior software engineer with proven architectural skill and a strong background in embedded software development, data telecommunications, network security, distributed application processing, and Internet standards development. \n \nTwenty-five years of embedded software development experience, in products ranging from military drone aircraft, commercial spacecraft, home Internet gateways, personal mobile devices, game consoles, et cetera. Comfortable troubleshooting with only access to cryptic and incomplete log message streams. \n \nSix years as leading IPv6 network software engineering expert at Apple. Strategic foresight, communication and attention to technical detail was critical in the successful and timely readiness of OS X, iOS and other embedded products for World IPv6 Launch. \n \nEditor, main author, and implementor of RFC 6092, Simple Security in IPv6 Gateway CPE. Contributor to many other Internet Drafts and RFCs. Praised in IETF for excellence in technical and editorial craftsmanship. Experience staff software engineer Nest July 2014  – Present (1 year 2 months) Palo Alto On the Communications Engineering team, working to improve the Nest implementations of Thread and Weave, and to contribute to the development of open standards and industry conventions for communication among intelligent home appliances, personal computers and handheld devices. There is an interesting problem here with a scope that spans across our industry: how do you couple a modern IPv6-only ad-hoc IEEE 802.15.4 link with the legacy IPv4/NAT link of the typical home network? staff software engineer Nest July 2014  – Present (1 year 2 months) Palo Alto On the Communications Engineering team, working to improve the Nest implementations of Thread and Weave, and to contribute to the development of open standards and industry conventions for communication among intelligent home appliances, personal computers and handheld devices. There is an interesting problem here with a scope that spans across our industry: how do you couple a modern IPv6-only ad-hoc IEEE 802.15.4 link with the legacy IPv4/NAT link of the typical home network? staff software engineer Nest July 2014  – Present (1 year 2 months) Palo Alto On the Communications Engineering team, working to improve the Nest implementations of Thread and Weave, and to contribute to the development of open standards and industry conventions for communication among intelligent home appliances, personal computers and handheld devices. There is an interesting problem here with a scope that spans across our industry: how do you couple a modern IPv6-only ad-hoc IEEE 802.15.4 link with the legacy IPv4/NAT link of the typical home network? Skills Firewalls Perl IPv6 Network Security TCP/IP Debugging Embedded Systems Device Drivers Software Configuration... Software Development Software Design Software Engineering OS X Linux Kernel Algorithms Scalability C Operating Systems Object Oriented Design Wireless C++ Solaris Mobile Devices Integration Testing Technology Leadership Development Firmware Security Architectures IEEE 802.11 System Architecture Distributed Algorithms Unix Wireless Networking Programming Functional Programming See 23+     See less Skills  Firewalls Perl IPv6 Network Security TCP/IP Debugging Embedded Systems Device Drivers Software Configuration... Software Development Software Design Software Engineering OS X Linux Kernel Algorithms Scalability C Operating Systems Object Oriented Design Wireless C++ Solaris Mobile Devices Integration Testing Technology Leadership Development Firmware Security Architectures IEEE 802.11 System Architecture Distributed Algorithms Unix Wireless Networking Programming Functional Programming See 23+     See less Firewalls Perl IPv6 Network Security TCP/IP Debugging Embedded Systems Device Drivers Software Configuration... Software Development Software Design Software Engineering OS X Linux Kernel Algorithms Scalability C Operating Systems Object Oriented Design Wireless C++ Solaris Mobile Devices Integration Testing Technology Leadership Development Firmware Security Architectures IEEE 802.11 System Architecture Distributed Algorithms Unix Wireless Networking Programming Functional Programming See 23+     See less Firewalls Perl IPv6 Network Security TCP/IP Debugging Embedded Systems Device Drivers Software Configuration... Software Development Software Design Software Engineering OS X Linux Kernel Algorithms Scalability C Operating Systems Object Oriented Design Wireless C++ Solaris Mobile Devices Integration Testing Technology Leadership Development Firmware Security Architectures IEEE 802.11 System Architecture Distributed Algorithms Unix Wireless Networking Programming Functional Programming See 23+     See less ", "Experience Director of Engineering Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Director of Software Development Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ GoogleTV Engineering and Customer Program Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Phoenix, Arizona Area, Tokyo Japan, Mountain View CA CE4100 (Sodaville) Program Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Phoenix, Arizona Area Senior Product Manager Intel Corporation June 2004  –  January 2008  (3 years 8 months) Phoenix, Arizona Area Silicon Research Manager Intel Corporation January 2003  –  June 2004  (1 year 6 months) Washington State Software Engineering Manager Intel Corporation January 2001  –  January 2003  (2 years 1 month) Washington State Senior Software Architect Intel Corporation January 1999  –  January 2001  (2 years 1 month) Washington State Software Engineer Intel Corporation January 1996  –  January 1999  (3 years 1 month) Washington State Director of Engineering Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Director of Engineering Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Director of Software Development Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ Director of Software Development Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ GoogleTV Engineering and Customer Program Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Phoenix, Arizona Area, Tokyo Japan, Mountain View CA GoogleTV Engineering and Customer Program Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Phoenix, Arizona Area, Tokyo Japan, Mountain View CA CE4100 (Sodaville) Program Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Phoenix, Arizona Area CE4100 (Sodaville) Program Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Phoenix, Arizona Area Senior Product Manager Intel Corporation June 2004  –  January 2008  (3 years 8 months) Phoenix, Arizona Area Senior Product Manager Intel Corporation June 2004  –  January 2008  (3 years 8 months) Phoenix, Arizona Area Silicon Research Manager Intel Corporation January 2003  –  June 2004  (1 year 6 months) Washington State Silicon Research Manager Intel Corporation January 2003  –  June 2004  (1 year 6 months) Washington State Software Engineering Manager Intel Corporation January 2001  –  January 2003  (2 years 1 month) Washington State Software Engineering Manager Intel Corporation January 2001  –  January 2003  (2 years 1 month) Washington State Senior Software Architect Intel Corporation January 1999  –  January 2001  (2 years 1 month) Washington State Senior Software Architect Intel Corporation January 1999  –  January 2001  (2 years 1 month) Washington State Software Engineer Intel Corporation January 1996  –  January 1999  (3 years 1 month) Washington State Software Engineer Intel Corporation January 1996  –  January 1999  (3 years 1 month) Washington State Languages Spanish Limited working proficiency Japanese Elementary proficiency Spanish Limited working proficiency Japanese Elementary proficiency Spanish Limited working proficiency Japanese Elementary proficiency Limited working proficiency Elementary proficiency Skills Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Skills  Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Education Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 University of Washington MS 1997  – 1999 Purdue University BS 1990  – 1995 Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 University of Washington MS 1997  – 1999 University of Washington MS 1997  – 1999 University of Washington MS 1997  – 1999 Purdue University BS 1990  – 1995 Purdue University BS 1990  – 1995 Purdue University BS 1990  – 1995 Honors & Awards Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. ", "Summary I enjoy creating new things.  \n \nBroad and sytem R&D (PC, CE, and Internet) \nProduct and project management \nBuild up innovation team Summary I enjoy creating new things.  \n \nBroad and sytem R&D (PC, CE, and Internet) \nProduct and project management \nBuild up innovation team I enjoy creating new things.  \n \nBroad and sytem R&D (PC, CE, and Internet) \nProduct and project management \nBuild up innovation team I enjoy creating new things.  \n \nBroad and sytem R&D (PC, CE, and Internet) \nProduct and project management \nBuild up innovation team Experience Senior Digital Project Leader, Health&Welless, Health Tech Philips January 2015  – Present (8 months) Shanghai City, China Lead digital innovation Founder, YunYouTu Shanghai XT Info&Tech Co., Ltd. February 2012  –  October 2014  (2 years 9 months) Shanghai City, China An interesting mobile app and service to create animated trip journal in very easy and simple way. Led design and development from concept through product. Keywords: Yunyoutu, LBS, HTML5, iOS, Android.  Tech Lead Coordinate August 2012  –  February 2014  (1 year 7 months) Shanghai City, China Led the 2D/3D GPU (AMD RS780E) accelation framework enabling on home-made platform with ReWorks and Loongson 3A/3B (MIPS). The 2D framework has been merged into offical code base of ReWorks successfully.  Senior Software Architect Intel Corporation October 2005  –  January 2012  (6 years 4 months) Shanghai, China Led innovation on Intel Architecture platforms (desktop, laptop, all in one, and tablet) for global and local OEMs/ODMs, across Windows, Linux and Android. \n \nAchieved Intel china Award 2011. \nDivision Recognition Awards Tech lead First International Computer July 2001  –  September 2005  (4 years 3 months) Shanghai Led multiple projects, e.g. WebPad, media adaptor, PC backup and recovery system, main control board of network printer, media server, etc. Developed device drivers on bootloader, Windows/Windows Embedded, and Linux Senior Digital Project Leader, Health&Welless, Health Tech Philips January 2015  – Present (8 months) Shanghai City, China Lead digital innovation Senior Digital Project Leader, Health&Welless, Health Tech Philips January 2015  – Present (8 months) Shanghai City, China Lead digital innovation Founder, YunYouTu Shanghai XT Info&Tech Co., Ltd. February 2012  –  October 2014  (2 years 9 months) Shanghai City, China An interesting mobile app and service to create animated trip journal in very easy and simple way. Led design and development from concept through product. Keywords: Yunyoutu, LBS, HTML5, iOS, Android.  Founder, YunYouTu Shanghai XT Info&Tech Co., Ltd. February 2012  –  October 2014  (2 years 9 months) Shanghai City, China An interesting mobile app and service to create animated trip journal in very easy and simple way. Led design and development from concept through product. Keywords: Yunyoutu, LBS, HTML5, iOS, Android.  Tech Lead Coordinate August 2012  –  February 2014  (1 year 7 months) Shanghai City, China Led the 2D/3D GPU (AMD RS780E) accelation framework enabling on home-made platform with ReWorks and Loongson 3A/3B (MIPS). The 2D framework has been merged into offical code base of ReWorks successfully.  Tech Lead Coordinate August 2012  –  February 2014  (1 year 7 months) Shanghai City, China Led the 2D/3D GPU (AMD RS780E) accelation framework enabling on home-made platform with ReWorks and Loongson 3A/3B (MIPS). The 2D framework has been merged into offical code base of ReWorks successfully.  Senior Software Architect Intel Corporation October 2005  –  January 2012  (6 years 4 months) Shanghai, China Led innovation on Intel Architecture platforms (desktop, laptop, all in one, and tablet) for global and local OEMs/ODMs, across Windows, Linux and Android. \n \nAchieved Intel china Award 2011. \nDivision Recognition Awards Senior Software Architect Intel Corporation October 2005  –  January 2012  (6 years 4 months) Shanghai, China Led innovation on Intel Architecture platforms (desktop, laptop, all in one, and tablet) for global and local OEMs/ODMs, across Windows, Linux and Android. \n \nAchieved Intel china Award 2011. \nDivision Recognition Awards Tech lead First International Computer July 2001  –  September 2005  (4 years 3 months) Shanghai Led multiple projects, e.g. WebPad, media adaptor, PC backup and recovery system, main control board of network printer, media server, etc. Developed device drivers on bootloader, Windows/Windows Embedded, and Linux Tech lead First International Computer July 2001  –  September 2005  (4 years 3 months) Shanghai Led multiple projects, e.g. WebPad, media adaptor, PC backup and recovery system, main control board of network printer, media server, etc. Developed device drivers on bootloader, Windows/Windows Embedded, and Linux Skills Embedded Systems Device Drivers Linux Debugging Intel Android C++ Software Engineering System Architecture Windows RTOS VxWorks C Security Graphics Streaming Media Software Design X86 Virtualization TCP/IP Architecture Embedded Software Operating Systems Manufacturing ARM Assembly Virtualization... Project Management Product Management Product Development Software Project... Software Development See 17+     See less Skills  Embedded Systems Device Drivers Linux Debugging Intel Android C++ Software Engineering System Architecture Windows RTOS VxWorks C Security Graphics Streaming Media Software Design X86 Virtualization TCP/IP Architecture Embedded Software Operating Systems Manufacturing ARM Assembly Virtualization... Project Management Product Management Product Development Software Project... Software Development See 17+     See less Embedded Systems Device Drivers Linux Debugging Intel Android C++ Software Engineering System Architecture Windows RTOS VxWorks C Security Graphics Streaming Media Software Design X86 Virtualization TCP/IP Architecture Embedded Software Operating Systems Manufacturing ARM Assembly Virtualization... Project Management Product Management Product Development Software Project... Software Development See 17+     See less Embedded Systems Device Drivers Linux Debugging Intel Android C++ Software Engineering System Architecture Windows RTOS VxWorks C Security Graphics Streaming Media Software Design X86 Virtualization TCP/IP Architecture Embedded Software Operating Systems Manufacturing ARM Assembly Virtualization... Project Management Product Management Product Development Software Project... Software Development See 17+     See less Education Shanghai Jiao Tong University PhD,  Pattern recognition and intelligent system 1998  – 2001 Xidian University MS,  EE 1990  – 1997 Shanghai Jiao Tong University PhD,  Pattern recognition and intelligent system 1998  – 2001 Shanghai Jiao Tong University PhD,  Pattern recognition and intelligent system 1998  – 2001 Shanghai Jiao Tong University PhD,  Pattern recognition and intelligent system 1998  – 2001 Xidian University MS,  EE 1990  – 1997 Xidian University MS,  EE 1990  – 1997 Xidian University MS,  EE 1990  – 1997 ", "Experience Senior Storage Architect ioFABRIC August 2014  – Present (1 year 1 month) Toronto, Canada Area Senior Software Architect Intel Corporation July 2012  –  July 2014  (2 years 1 month) Toronto, Canada Area Senior Software Architect Nevex Virtual Technologies Inc. 2009  –  2012  (3 years) Toronto, Canada Area Co-Founder, Chairman of the Board Nevex Software Inc 1998  –  2000  (2 years) Toronto, Canada Area Vice President, Firewall Division Secure Computing 1996  –  1997  (1 year) Toronto, Canada Area Co-Founder Border Network Technologies Inc. 1993  –  1996  (3 years) Toronto, Canada Area Senior Storage Architect ioFABRIC August 2014  – Present (1 year 1 month) Toronto, Canada Area Senior Storage Architect ioFABRIC August 2014  – Present (1 year 1 month) Toronto, Canada Area Senior Software Architect Intel Corporation July 2012  –  July 2014  (2 years 1 month) Toronto, Canada Area Senior Software Architect Intel Corporation July 2012  –  July 2014  (2 years 1 month) Toronto, Canada Area Senior Software Architect Nevex Virtual Technologies Inc. 2009  –  2012  (3 years) Toronto, Canada Area Senior Software Architect Nevex Virtual Technologies Inc. 2009  –  2012  (3 years) Toronto, Canada Area Co-Founder, Chairman of the Board Nevex Software Inc 1998  –  2000  (2 years) Toronto, Canada Area Co-Founder, Chairman of the Board Nevex Software Inc 1998  –  2000  (2 years) Toronto, Canada Area Vice President, Firewall Division Secure Computing 1996  –  1997  (1 year) Toronto, Canada Area Vice President, Firewall Division Secure Computing 1996  –  1997  (1 year) Toronto, Canada Area Co-Founder Border Network Technologies Inc. 1993  –  1996  (3 years) Toronto, Canada Area Co-Founder Border Network Technologies Inc. 1993  –  1996  (3 years) Toronto, Canada Area Languages   Skills Skills     Education University of Toronto Bachelor of Applied Science (BASc),  Engineering Science 1981  – 1985 University of Toronto Bachelor of Applied Science (BASc),  Engineering Science 1981  – 1985 University of Toronto Bachelor of Applied Science (BASc),  Engineering Science 1981  – 1985 University of Toronto Bachelor of Applied Science (BASc),  Engineering Science 1981  – 1985 ", "Summary Senior Software Architect with proven success track record in delivering innovative feature design and development for computing devices, large and small, data management, system performance optimization, along all phases of product development on multiple large scale software projects \n \nSpecialties: Databases, middle ware platforms, modeling, software architecture, dataflow parallelism pattern (see patents), rule engines, programming, agile, platform enabling and performance optimization (multi-core, micro-servers, storage systems). Server software stack development for very constrained mobile server devices. \n \nTools & languages: Java, PhP, Python, C/C++, C#, XML, HTML5, some Javascript, Databases (from sqlite to MySQL, Oracle, Sqlserver, DB2 and some No-SQL), OOP, Software Architecture, Linux, Tizen, Android, Windows, software and hardware profilers \n \nSoftware process: Agile/Scrum/XP/Waterfall/Evolutionary. Commercial product development under start up environments. Taming wicked software projects. Summary Senior Software Architect with proven success track record in delivering innovative feature design and development for computing devices, large and small, data management, system performance optimization, along all phases of product development on multiple large scale software projects \n \nSpecialties: Databases, middle ware platforms, modeling, software architecture, dataflow parallelism pattern (see patents), rule engines, programming, agile, platform enabling and performance optimization (multi-core, micro-servers, storage systems). Server software stack development for very constrained mobile server devices. \n \nTools & languages: Java, PhP, Python, C/C++, C#, XML, HTML5, some Javascript, Databases (from sqlite to MySQL, Oracle, Sqlserver, DB2 and some No-SQL), OOP, Software Architecture, Linux, Tizen, Android, Windows, software and hardware profilers \n \nSoftware process: Agile/Scrum/XP/Waterfall/Evolutionary. Commercial product development under start up environments. Taming wicked software projects. Senior Software Architect with proven success track record in delivering innovative feature design and development for computing devices, large and small, data management, system performance optimization, along all phases of product development on multiple large scale software projects \n \nSpecialties: Databases, middle ware platforms, modeling, software architecture, dataflow parallelism pattern (see patents), rule engines, programming, agile, platform enabling and performance optimization (multi-core, micro-servers, storage systems). Server software stack development for very constrained mobile server devices. \n \nTools & languages: Java, PhP, Python, C/C++, C#, XML, HTML5, some Javascript, Databases (from sqlite to MySQL, Oracle, Sqlserver, DB2 and some No-SQL), OOP, Software Architecture, Linux, Tizen, Android, Windows, software and hardware profilers \n \nSoftware process: Agile/Scrum/XP/Waterfall/Evolutionary. Commercial product development under start up environments. Taming wicked software projects. Senior Software Architect with proven success track record in delivering innovative feature design and development for computing devices, large and small, data management, system performance optimization, along all phases of product development on multiple large scale software projects \n \nSpecialties: Databases, middle ware platforms, modeling, software architecture, dataflow parallelism pattern (see patents), rule engines, programming, agile, platform enabling and performance optimization (multi-core, micro-servers, storage systems). Server software stack development for very constrained mobile server devices. \n \nTools & languages: Java, PhP, Python, C/C++, C#, XML, HTML5, some Javascript, Databases (from sqlite to MySQL, Oracle, Sqlserver, DB2 and some No-SQL), OOP, Software Architecture, Linux, Tizen, Android, Windows, software and hardware profilers \n \nSoftware process: Agile/Scrum/XP/Waterfall/Evolutionary. Commercial product development under start up environments. Taming wicked software projects. Experience Senior Software Architect Intel Corporation January 2012  – Present (3 years 8 months) Chandler AZ Technical lead/architect for Printed Circuit Board design automation project. \n \nSoftware application, platform, kernel, and cloud infrastructure development for Intel based tablets and mobile, battery operated, servers. Android, Tizen, and Windows 8. Sr. Staff Software Engineer Intel May 2005  –  December 2011  (6 years 8 months) Performance characterization of x86 servers on enterprise applications, including databases and XML data management systems. Co-author of the TPoX XML database benchmark Owner TOWNLAKE SOFTWARE January 1996  –  December 2011  (16 years) Boutique enterprise information system consulting Sr. Software Engineer Pervasive Software March 2002  –  April 2005  (3 years 2 months) Inventor (patented) of a Java based component architecture for Dataflow Process Networks for  \nend to end, scalable massive data flows. This component architecture is the basis for the  \ncommercial product “Datarush”. The implementation includes a graph compiler component using  \nthe composite pattern for processes and ports; a runtime linker leveraging dependency injection  \nfor infrastructure features, meta programming support and compile time port type verification and  \nsynthesis; and enabling building and deploying independent, re-usable, dataflow components Sr. Software Architect Unikala Software February 2000  –  August 2001  (1 year 7 months) Invented and implemented (in Java) a rule engine based on the \"Production Systems\" architecture. This was a leading edge effort to add intelligence to the very first versions of J2EE EJBs. Database Architect Living.com June 1998  –  February 2000  (1 year 9 months) Owned the design of order entry tables for web site Software Designer IV Compaq 1998  –  1999  (1 year) Designed and implemented (in C++) table scan optimization rules in the SQL/MX optimizer. Designed and implemented experimental methods to validate the costing model of the SQL/MX optimizer Software Designer IV Tandem 1996  –  1998  (2 years) Cupertino, CA Designed and implemented (in C++) table scan optimization rules in the SQL/MX optimizer. Designed and implemented experimental methods to validate the costing model of the SQL/MX optimizer Director Universidad Virtual Instituto Tecnologico de Monterrey, Hermosillo May 1995  –  April 1996  (1 year) Assistant Professor in the CS department. Director of the Virtual University. Senior Software Architect Intel Corporation January 2012  – Present (3 years 8 months) Chandler AZ Technical lead/architect for Printed Circuit Board design automation project. \n \nSoftware application, platform, kernel, and cloud infrastructure development for Intel based tablets and mobile, battery operated, servers. Android, Tizen, and Windows 8. Senior Software Architect Intel Corporation January 2012  – Present (3 years 8 months) Chandler AZ Technical lead/architect for Printed Circuit Board design automation project. \n \nSoftware application, platform, kernel, and cloud infrastructure development for Intel based tablets and mobile, battery operated, servers. Android, Tizen, and Windows 8. Sr. Staff Software Engineer Intel May 2005  –  December 2011  (6 years 8 months) Performance characterization of x86 servers on enterprise applications, including databases and XML data management systems. Co-author of the TPoX XML database benchmark Sr. Staff Software Engineer Intel May 2005  –  December 2011  (6 years 8 months) Performance characterization of x86 servers on enterprise applications, including databases and XML data management systems. Co-author of the TPoX XML database benchmark Owner TOWNLAKE SOFTWARE January 1996  –  December 2011  (16 years) Boutique enterprise information system consulting Owner TOWNLAKE SOFTWARE January 1996  –  December 2011  (16 years) Boutique enterprise information system consulting Sr. Software Engineer Pervasive Software March 2002  –  April 2005  (3 years 2 months) Inventor (patented) of a Java based component architecture for Dataflow Process Networks for  \nend to end, scalable massive data flows. This component architecture is the basis for the  \ncommercial product “Datarush”. The implementation includes a graph compiler component using  \nthe composite pattern for processes and ports; a runtime linker leveraging dependency injection  \nfor infrastructure features, meta programming support and compile time port type verification and  \nsynthesis; and enabling building and deploying independent, re-usable, dataflow components Sr. Software Engineer Pervasive Software March 2002  –  April 2005  (3 years 2 months) Inventor (patented) of a Java based component architecture for Dataflow Process Networks for  \nend to end, scalable massive data flows. This component architecture is the basis for the  \ncommercial product “Datarush”. The implementation includes a graph compiler component using  \nthe composite pattern for processes and ports; a runtime linker leveraging dependency injection  \nfor infrastructure features, meta programming support and compile time port type verification and  \nsynthesis; and enabling building and deploying independent, re-usable, dataflow components Sr. Software Architect Unikala Software February 2000  –  August 2001  (1 year 7 months) Invented and implemented (in Java) a rule engine based on the \"Production Systems\" architecture. This was a leading edge effort to add intelligence to the very first versions of J2EE EJBs. Sr. Software Architect Unikala Software February 2000  –  August 2001  (1 year 7 months) Invented and implemented (in Java) a rule engine based on the \"Production Systems\" architecture. This was a leading edge effort to add intelligence to the very first versions of J2EE EJBs. Database Architect Living.com June 1998  –  February 2000  (1 year 9 months) Owned the design of order entry tables for web site Database Architect Living.com June 1998  –  February 2000  (1 year 9 months) Owned the design of order entry tables for web site Software Designer IV Compaq 1998  –  1999  (1 year) Designed and implemented (in C++) table scan optimization rules in the SQL/MX optimizer. Designed and implemented experimental methods to validate the costing model of the SQL/MX optimizer Software Designer IV Compaq 1998  –  1999  (1 year) Designed and implemented (in C++) table scan optimization rules in the SQL/MX optimizer. Designed and implemented experimental methods to validate the costing model of the SQL/MX optimizer Software Designer IV Tandem 1996  –  1998  (2 years) Cupertino, CA Designed and implemented (in C++) table scan optimization rules in the SQL/MX optimizer. Designed and implemented experimental methods to validate the costing model of the SQL/MX optimizer Software Designer IV Tandem 1996  –  1998  (2 years) Cupertino, CA Designed and implemented (in C++) table scan optimization rules in the SQL/MX optimizer. Designed and implemented experimental methods to validate the costing model of the SQL/MX optimizer Director Universidad Virtual Instituto Tecnologico de Monterrey, Hermosillo May 1995  –  April 1996  (1 year) Assistant Professor in the CS department. Director of the Virtual University. Director Universidad Virtual Instituto Tecnologico de Monterrey, Hermosillo May 1995  –  April 1996  (1 year) Assistant Professor in the CS department. Director of the Virtual University. Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Java Enterprise Edition XML C/C++ Java Operating Systems Benchmarking System Architecture DB2 Computer Architecture Enterprise Software Embedded Systems Software Architecture Middle-ware development System Performance... PHP HTML5 Big Data Agile Methodologies Conceptual Design Databases JSON Linux Python C++ Software Engineering See 10+     See less Skills  Java Enterprise Edition XML C/C++ Java Operating Systems Benchmarking System Architecture DB2 Computer Architecture Enterprise Software Embedded Systems Software Architecture Middle-ware development System Performance... PHP HTML5 Big Data Agile Methodologies Conceptual Design Databases JSON Linux Python C++ Software Engineering See 10+     See less Java Enterprise Edition XML C/C++ Java Operating Systems Benchmarking System Architecture DB2 Computer Architecture Enterprise Software Embedded Systems Software Architecture Middle-ware development System Performance... PHP HTML5 Big Data Agile Methodologies Conceptual Design Databases JSON Linux Python C++ Software Engineering See 10+     See less Java Enterprise Edition XML C/C++ Java Operating Systems Benchmarking System Architecture DB2 Computer Architecture Enterprise Software Embedded Systems Software Architecture Middle-ware development System Performance... PHP HTML5 Big Data Agile Methodologies Conceptual Design Databases JSON Linux Python C++ Software Engineering See 10+     See less Education New Mexico State University PhD,  Computer Science , Databases 1990  – 1995 Activities and Societies:  ACM Tecnológico de Monterrey MsC,  Computer Science 1988  – 1990 Monterrey Campus Activities and Societies:  IEEE University of California, Berkeley BA,  Physics 1978  – 1982 Activities and Societies:  SHEP New Mexico State University PhD,  Computer Science , Databases 1990  – 1995 Activities and Societies:  ACM New Mexico State University PhD,  Computer Science , Databases 1990  – 1995 Activities and Societies:  ACM New Mexico State University PhD,  Computer Science , Databases 1990  – 1995 Activities and Societies:  ACM Tecnológico de Monterrey MsC,  Computer Science 1988  – 1990 Monterrey Campus Activities and Societies:  IEEE Tecnológico de Monterrey MsC,  Computer Science 1988  – 1990 Monterrey Campus Activities and Societies:  IEEE Tecnológico de Monterrey MsC,  Computer Science 1988  – 1990 Monterrey Campus Activities and Societies:  IEEE University of California, Berkeley BA,  Physics 1978  – 1982 Activities and Societies:  SHEP University of California, Berkeley BA,  Physics 1978  – 1982 Activities and Societies:  SHEP University of California, Berkeley BA,  Physics 1978  – 1982 Activities and Societies:  SHEP ", "Summary Experienced and talented software leader with 15+ years of combined experience working for one of the most innovative technology companies on the planet with broad software/system level experience in Embedded Software Design, Windows Kernel Development, Web Design, Localization and Internationalization Software Development, Data Storage and Caching Design, Mobile Apps and Device Development, and Cloud Services Design. \n \nI have working experience across all aspects of software engineering throughout the entire project life cycle that includes concept and product definition, architecture, design, implementation, delivery, sustaining, customer engagements, and end of life. I've participated in various roles such as lead architect, manager, development software team lead, hands-on developer. \n \nIn my current role as a Senior Software Architect, I focus on defining and driving Software Products that ship externally for PCs, laptops, tablets, and phones across multiple OS systems. \n \nSome specific specialties I have include working experience architecting solutions across multiple Operating Systems and Cloud Services; Windows SW Development for Application, System and Device Drivers, and Middleware layers; Android SW Application Development; Mobile Application Development for Windows and Android; File Systems, Data Storage, and Caching Technologies; Cloud Computing; Web Development; APIs and API Management; Product Evangelism; Software Security Analysis and Secure Coding Experience; Technical and Managerial Leadership; and Customer Engagements.  \n Summary Experienced and talented software leader with 15+ years of combined experience working for one of the most innovative technology companies on the planet with broad software/system level experience in Embedded Software Design, Windows Kernel Development, Web Design, Localization and Internationalization Software Development, Data Storage and Caching Design, Mobile Apps and Device Development, and Cloud Services Design. \n \nI have working experience across all aspects of software engineering throughout the entire project life cycle that includes concept and product definition, architecture, design, implementation, delivery, sustaining, customer engagements, and end of life. I've participated in various roles such as lead architect, manager, development software team lead, hands-on developer. \n \nIn my current role as a Senior Software Architect, I focus on defining and driving Software Products that ship externally for PCs, laptops, tablets, and phones across multiple OS systems. \n \nSome specific specialties I have include working experience architecting solutions across multiple Operating Systems and Cloud Services; Windows SW Development for Application, System and Device Drivers, and Middleware layers; Android SW Application Development; Mobile Application Development for Windows and Android; File Systems, Data Storage, and Caching Technologies; Cloud Computing; Web Development; APIs and API Management; Product Evangelism; Software Security Analysis and Secure Coding Experience; Technical and Managerial Leadership; and Customer Engagements.  \n Experienced and talented software leader with 15+ years of combined experience working for one of the most innovative technology companies on the planet with broad software/system level experience in Embedded Software Design, Windows Kernel Development, Web Design, Localization and Internationalization Software Development, Data Storage and Caching Design, Mobile Apps and Device Development, and Cloud Services Design. \n \nI have working experience across all aspects of software engineering throughout the entire project life cycle that includes concept and product definition, architecture, design, implementation, delivery, sustaining, customer engagements, and end of life. I've participated in various roles such as lead architect, manager, development software team lead, hands-on developer. \n \nIn my current role as a Senior Software Architect, I focus on defining and driving Software Products that ship externally for PCs, laptops, tablets, and phones across multiple OS systems. \n \nSome specific specialties I have include working experience architecting solutions across multiple Operating Systems and Cloud Services; Windows SW Development for Application, System and Device Drivers, and Middleware layers; Android SW Application Development; Mobile Application Development for Windows and Android; File Systems, Data Storage, and Caching Technologies; Cloud Computing; Web Development; APIs and API Management; Product Evangelism; Software Security Analysis and Secure Coding Experience; Technical and Managerial Leadership; and Customer Engagements.  \n Experienced and talented software leader with 15+ years of combined experience working for one of the most innovative technology companies on the planet with broad software/system level experience in Embedded Software Design, Windows Kernel Development, Web Design, Localization and Internationalization Software Development, Data Storage and Caching Design, Mobile Apps and Device Development, and Cloud Services Design. \n \nI have working experience across all aspects of software engineering throughout the entire project life cycle that includes concept and product definition, architecture, design, implementation, delivery, sustaining, customer engagements, and end of life. I've participated in various roles such as lead architect, manager, development software team lead, hands-on developer. \n \nIn my current role as a Senior Software Architect, I focus on defining and driving Software Products that ship externally for PCs, laptops, tablets, and phones across multiple OS systems. \n \nSome specific specialties I have include working experience architecting solutions across multiple Operating Systems and Cloud Services; Windows SW Development for Application, System and Device Drivers, and Middleware layers; Android SW Application Development; Mobile Application Development for Windows and Android; File Systems, Data Storage, and Caching Technologies; Cloud Computing; Web Development; APIs and API Management; Product Evangelism; Software Security Analysis and Secure Coding Experience; Technical and Managerial Leadership; and Customer Engagements.  \n Experience Senior Software Architect Intel Corporation January 2012  – Present (3 years 8 months) Phoenix, Arizona Area Senior Architect responsible for defining Software and Firmware modules to expose Platform Capabilities, through RESTful APIs, WebSocket/WAMP, XMPP, and WebRTC channels to applications running on single local devices, in cloud services, and on remote devices.  \n \nSecurity Expert responsible for driving projects thru Internal Intel Security Development Life cycle Processes that is in line with industry Software Security Practices such as driving Software Threat Modelling Analysis activities and ensuring the architecture was defined to meet project security and privacy objectives that were in compliance with Intel policies and Industry expectations.  \n \nDefined Architecture using UML and drove implementation of a Data Sharing Solution to intelligently organize end users’ data (Media, Documents, Data Files) across local multi form factor storage devices (phones, PCs, Tablets, etc.) running on multi Operating Systems (Windows, Android, and IOS) and remote cloud storage.  \nUsers were able to securely transfer, store and back up precious memories, and smartly syncing modifications to their data in real time in a secure method suitable for enterprise security requirements and expectations. \n \nResponsible for evaluating external validation outsourcing opportunities and potential development acquisitions to Senior Executive Management and Intel Capital Team \n \nCustomer Facing Architectural Representative for External Customers. \n Customer Engineering Architect Intel Corporation February 2011  –  June 2012  (1 year 5 months) Phoenix, Arizona Area Led a team of talented SW Engineers to support custom releases of the Intel Rapid Storage Technology product line including OEM customer specific issues and/or new feature requests. \n \nWorked onsite at various global Intel customer and partner locations to provide onsite tactical development and debugging support for OEM individualized platforms using current released features of Intel’s Software Stack. \n \nCustomer Facing Technical Representative in driving strategic business discussions between customers and partners of Intel Storage Technology to align on new features and successfully close on new design wins for Intel platforms that contributed to a few hundred million dollars to Intel’s bottom line \n Software Architect and Developer Intel Corporation March 2007  –  February 2011  (4 years) Phoenix, Arizona Area Senior Core Developer (C/C++) for Intel Rapid Storage Technology(RST), which is also included in Microsoft Windows inbox drivers used all over the world.  \n \nKey contributor to the first written software integrated into Windows OS which supports Solid State Drives such as TRIM support.  \n \nArchitect/Developer on Storage Driver team for Caching, App Pinning, RAID Stripe Sizes, and Volume Expansion features along with a feature to efficiently power cycle the CPU to take full advantage of maximum SSD bandwidths – Patent Pending \n \nOne of the founding members of Intel Performance Bench marking team focused on measuring, tuning and validating system component performance and power features that grew into what is considered the most expert team still in use within Intel.  \n \n•Senior Lead Architect/Developer for Intel’s HDMI Audio Driver that was bundled with Intel Integrated Graphics Driver and shipped to and used by OEMs across the globe with Intel Chipset Platforms.  \n Application Developer and Internationalization/Localization Architect-Manager Intel Corporation January 2005  –  March 2007  (2 years 3 months) Phoenix, Arizona Area Developed End User and System Configuration applications in HTML, JavaScript, and C++ for Digital Home and Digital Office Group that also required defining the architecture and implementing code to support localization for 27 languages.  \n \nManaged a team of 20 software linguistic experts responsible for localizing and internationalizing Intel’s Storage, Graphics, Audio and Chipset Driver Application programs into 27 languages.  \n \nLed software developer team as primary architect to create efficiency tools such as Auto OS Image builder for multi-language Operating Systems, and Auto Screen Capturing that allowed the team to focus on linguistic reviews eliminating previous tasks that required thousands of additional man hours and costs associated with manual labor.  \n \nDefined I18N/L10N infrastructure for Intel Driver application projects converting from traditional Win32 C++ applications to .NET and new XAML models.  \n Software Engineer Intel Corporation October 2000  –  January 2005  (4 years 4 months) Phoenix, Arizona Area Installation Developer using Install Shield, DIFx, and C++ for Intel Chipset drivers and Intel Integrated Graphics Driver deployments. First level of technical debugging support for OEM GFX driver and other chipset driver deployments. \n \nArchitected and developed a generic device driver installation framework SDK using C++ code that supported 32 and 64 bit, was localizable and Internationalized, and was customizable and programmable which was subsequently used by multiple internal business units and software driver installer teams across Intel. \n \nKey player in initializing and driving discussions between Intel Driver Deployment Teams and Microsoft OS Development Teams to define requirements specific to device installs that resulted in improved installation UX and integrated OS code along with the creation of future tools that MSFT released to support Integrated GFX Installs and other kernel device driver installs. \n \nDeveloper of BIOS Memory Reference Code using ASM and C for SDR and DDR Intel chipsets used by Intel customers to developer their own BIOS code.  \n \nKey developer and debugger during first new silicon power up for Intel PCH mobile and desktop chipsets.  \n \nConverted Memory Controller Hub Emulator to support new Intel PCH Chipsets that allowed early debugging and development for new silicon to improve initial health and significantly accelerate first power on. Senior Software Architect Intel Corporation January 2012  – Present (3 years 8 months) Phoenix, Arizona Area Senior Architect responsible for defining Software and Firmware modules to expose Platform Capabilities, through RESTful APIs, WebSocket/WAMP, XMPP, and WebRTC channels to applications running on single local devices, in cloud services, and on remote devices.  \n \nSecurity Expert responsible for driving projects thru Internal Intel Security Development Life cycle Processes that is in line with industry Software Security Practices such as driving Software Threat Modelling Analysis activities and ensuring the architecture was defined to meet project security and privacy objectives that were in compliance with Intel policies and Industry expectations.  \n \nDefined Architecture using UML and drove implementation of a Data Sharing Solution to intelligently organize end users’ data (Media, Documents, Data Files) across local multi form factor storage devices (phones, PCs, Tablets, etc.) running on multi Operating Systems (Windows, Android, and IOS) and remote cloud storage.  \nUsers were able to securely transfer, store and back up precious memories, and smartly syncing modifications to their data in real time in a secure method suitable for enterprise security requirements and expectations. \n \nResponsible for evaluating external validation outsourcing opportunities and potential development acquisitions to Senior Executive Management and Intel Capital Team \n \nCustomer Facing Architectural Representative for External Customers. \n Senior Software Architect Intel Corporation January 2012  – Present (3 years 8 months) Phoenix, Arizona Area Senior Architect responsible for defining Software and Firmware modules to expose Platform Capabilities, through RESTful APIs, WebSocket/WAMP, XMPP, and WebRTC channels to applications running on single local devices, in cloud services, and on remote devices.  \n \nSecurity Expert responsible for driving projects thru Internal Intel Security Development Life cycle Processes that is in line with industry Software Security Practices such as driving Software Threat Modelling Analysis activities and ensuring the architecture was defined to meet project security and privacy objectives that were in compliance with Intel policies and Industry expectations.  \n \nDefined Architecture using UML and drove implementation of a Data Sharing Solution to intelligently organize end users’ data (Media, Documents, Data Files) across local multi form factor storage devices (phones, PCs, Tablets, etc.) running on multi Operating Systems (Windows, Android, and IOS) and remote cloud storage.  \nUsers were able to securely transfer, store and back up precious memories, and smartly syncing modifications to their data in real time in a secure method suitable for enterprise security requirements and expectations. \n \nResponsible for evaluating external validation outsourcing opportunities and potential development acquisitions to Senior Executive Management and Intel Capital Team \n \nCustomer Facing Architectural Representative for External Customers. \n Customer Engineering Architect Intel Corporation February 2011  –  June 2012  (1 year 5 months) Phoenix, Arizona Area Led a team of talented SW Engineers to support custom releases of the Intel Rapid Storage Technology product line including OEM customer specific issues and/or new feature requests. \n \nWorked onsite at various global Intel customer and partner locations to provide onsite tactical development and debugging support for OEM individualized platforms using current released features of Intel’s Software Stack. \n \nCustomer Facing Technical Representative in driving strategic business discussions between customers and partners of Intel Storage Technology to align on new features and successfully close on new design wins for Intel platforms that contributed to a few hundred million dollars to Intel’s bottom line \n Customer Engineering Architect Intel Corporation February 2011  –  June 2012  (1 year 5 months) Phoenix, Arizona Area Led a team of talented SW Engineers to support custom releases of the Intel Rapid Storage Technology product line including OEM customer specific issues and/or new feature requests. \n \nWorked onsite at various global Intel customer and partner locations to provide onsite tactical development and debugging support for OEM individualized platforms using current released features of Intel’s Software Stack. \n \nCustomer Facing Technical Representative in driving strategic business discussions between customers and partners of Intel Storage Technology to align on new features and successfully close on new design wins for Intel platforms that contributed to a few hundred million dollars to Intel’s bottom line \n Software Architect and Developer Intel Corporation March 2007  –  February 2011  (4 years) Phoenix, Arizona Area Senior Core Developer (C/C++) for Intel Rapid Storage Technology(RST), which is also included in Microsoft Windows inbox drivers used all over the world.  \n \nKey contributor to the first written software integrated into Windows OS which supports Solid State Drives such as TRIM support.  \n \nArchitect/Developer on Storage Driver team for Caching, App Pinning, RAID Stripe Sizes, and Volume Expansion features along with a feature to efficiently power cycle the CPU to take full advantage of maximum SSD bandwidths – Patent Pending \n \nOne of the founding members of Intel Performance Bench marking team focused on measuring, tuning and validating system component performance and power features that grew into what is considered the most expert team still in use within Intel.  \n \n•Senior Lead Architect/Developer for Intel’s HDMI Audio Driver that was bundled with Intel Integrated Graphics Driver and shipped to and used by OEMs across the globe with Intel Chipset Platforms.  \n Software Architect and Developer Intel Corporation March 2007  –  February 2011  (4 years) Phoenix, Arizona Area Senior Core Developer (C/C++) for Intel Rapid Storage Technology(RST), which is also included in Microsoft Windows inbox drivers used all over the world.  \n \nKey contributor to the first written software integrated into Windows OS which supports Solid State Drives such as TRIM support.  \n \nArchitect/Developer on Storage Driver team for Caching, App Pinning, RAID Stripe Sizes, and Volume Expansion features along with a feature to efficiently power cycle the CPU to take full advantage of maximum SSD bandwidths – Patent Pending \n \nOne of the founding members of Intel Performance Bench marking team focused on measuring, tuning and validating system component performance and power features that grew into what is considered the most expert team still in use within Intel.  \n \n•Senior Lead Architect/Developer for Intel’s HDMI Audio Driver that was bundled with Intel Integrated Graphics Driver and shipped to and used by OEMs across the globe with Intel Chipset Platforms.  \n Application Developer and Internationalization/Localization Architect-Manager Intel Corporation January 2005  –  March 2007  (2 years 3 months) Phoenix, Arizona Area Developed End User and System Configuration applications in HTML, JavaScript, and C++ for Digital Home and Digital Office Group that also required defining the architecture and implementing code to support localization for 27 languages.  \n \nManaged a team of 20 software linguistic experts responsible for localizing and internationalizing Intel’s Storage, Graphics, Audio and Chipset Driver Application programs into 27 languages.  \n \nLed software developer team as primary architect to create efficiency tools such as Auto OS Image builder for multi-language Operating Systems, and Auto Screen Capturing that allowed the team to focus on linguistic reviews eliminating previous tasks that required thousands of additional man hours and costs associated with manual labor.  \n \nDefined I18N/L10N infrastructure for Intel Driver application projects converting from traditional Win32 C++ applications to .NET and new XAML models.  \n Application Developer and Internationalization/Localization Architect-Manager Intel Corporation January 2005  –  March 2007  (2 years 3 months) Phoenix, Arizona Area Developed End User and System Configuration applications in HTML, JavaScript, and C++ for Digital Home and Digital Office Group that also required defining the architecture and implementing code to support localization for 27 languages.  \n \nManaged a team of 20 software linguistic experts responsible for localizing and internationalizing Intel’s Storage, Graphics, Audio and Chipset Driver Application programs into 27 languages.  \n \nLed software developer team as primary architect to create efficiency tools such as Auto OS Image builder for multi-language Operating Systems, and Auto Screen Capturing that allowed the team to focus on linguistic reviews eliminating previous tasks that required thousands of additional man hours and costs associated with manual labor.  \n \nDefined I18N/L10N infrastructure for Intel Driver application projects converting from traditional Win32 C++ applications to .NET and new XAML models.  \n Software Engineer Intel Corporation October 2000  –  January 2005  (4 years 4 months) Phoenix, Arizona Area Installation Developer using Install Shield, DIFx, and C++ for Intel Chipset drivers and Intel Integrated Graphics Driver deployments. First level of technical debugging support for OEM GFX driver and other chipset driver deployments. \n \nArchitected and developed a generic device driver installation framework SDK using C++ code that supported 32 and 64 bit, was localizable and Internationalized, and was customizable and programmable which was subsequently used by multiple internal business units and software driver installer teams across Intel. \n \nKey player in initializing and driving discussions between Intel Driver Deployment Teams and Microsoft OS Development Teams to define requirements specific to device installs that resulted in improved installation UX and integrated OS code along with the creation of future tools that MSFT released to support Integrated GFX Installs and other kernel device driver installs. \n \nDeveloper of BIOS Memory Reference Code using ASM and C for SDR and DDR Intel chipsets used by Intel customers to developer their own BIOS code.  \n \nKey developer and debugger during first new silicon power up for Intel PCH mobile and desktop chipsets.  \n \nConverted Memory Controller Hub Emulator to support new Intel PCH Chipsets that allowed early debugging and development for new silicon to improve initial health and significantly accelerate first power on. Software Engineer Intel Corporation October 2000  –  January 2005  (4 years 4 months) Phoenix, Arizona Area Installation Developer using Install Shield, DIFx, and C++ for Intel Chipset drivers and Intel Integrated Graphics Driver deployments. First level of technical debugging support for OEM GFX driver and other chipset driver deployments. \n \nArchitected and developed a generic device driver installation framework SDK using C++ code that supported 32 and 64 bit, was localizable and Internationalized, and was customizable and programmable which was subsequently used by multiple internal business units and software driver installer teams across Intel. \n \nKey player in initializing and driving discussions between Intel Driver Deployment Teams and Microsoft OS Development Teams to define requirements specific to device installs that resulted in improved installation UX and integrated OS code along with the creation of future tools that MSFT released to support Integrated GFX Installs and other kernel device driver installs. \n \nDeveloper of BIOS Memory Reference Code using ASM and C for SDR and DDR Intel chipsets used by Intel customers to developer their own BIOS code.  \n \nKey developer and debugger during first new silicon power up for Intel PCH mobile and desktop chipsets.  \n \nConverted Memory Controller Hub Emulator to support new Intel PCH Chipsets that allowed early debugging and development for new silicon to improve initial health and significantly accelerate first power on. Skills Cloud Computing Device Drivers Intel Debugging Embedded Software Embedded Systems Scrum Computer Architecture C++ Test Automation Testing Software Installation .NET Microsoft Office Team Management Software Development Storage Architecture C C++ Language x86 Assembly Localization Internationalization Java Android Development P2P Kernel Drivers Kernel Debugging WinDbg Linux Product Lifecycle... UML ICONIX Customer Engagement JSON HTML5 XML Perl Windows Android TCP/IP WAMP WebRTC Web Sockets XMPP Git JIRA MSI MySQL Security Threat Modeling See 35+     See less Skills  Cloud Computing Device Drivers Intel Debugging Embedded Software Embedded Systems Scrum Computer Architecture C++ Test Automation Testing Software Installation .NET Microsoft Office Team Management Software Development Storage Architecture C C++ Language x86 Assembly Localization Internationalization Java Android Development P2P Kernel Drivers Kernel Debugging WinDbg Linux Product Lifecycle... UML ICONIX Customer Engagement JSON HTML5 XML Perl Windows Android TCP/IP WAMP WebRTC Web Sockets XMPP Git JIRA MSI MySQL Security Threat Modeling See 35+     See less Cloud Computing Device Drivers Intel Debugging Embedded Software Embedded Systems Scrum Computer Architecture C++ Test Automation Testing Software Installation .NET Microsoft Office Team Management Software Development Storage Architecture C C++ Language x86 Assembly Localization Internationalization Java Android Development P2P Kernel Drivers Kernel Debugging WinDbg Linux Product Lifecycle... UML ICONIX Customer Engagement JSON HTML5 XML Perl Windows Android TCP/IP WAMP WebRTC Web Sockets XMPP Git JIRA MSI MySQL Security Threat Modeling See 35+     See less Cloud Computing Device Drivers Intel Debugging Embedded Software Embedded Systems Scrum Computer Architecture C++ Test Automation Testing Software Installation .NET Microsoft Office Team Management Software Development Storage Architecture C C++ Language x86 Assembly Localization Internationalization Java Android Development P2P Kernel Drivers Kernel Debugging WinDbg Linux Product Lifecycle... UML ICONIX Customer Engagement JSON HTML5 XML Perl Windows Android TCP/IP WAMP WebRTC Web Sockets XMPP Git JIRA MSI MySQL Security Threat Modeling See 35+     See less Education Utah State University Bachelor's degree,  Computer Engineering Utah State University Bachelor's degree,  Computer Engineering Utah State University Bachelor's degree,  Computer Engineering Utah State University Bachelor's degree,  Computer Engineering ", "Summary Software programmer & architect dedicated to improving the User Experience on the Web, PC, or Mobile Device. Windows OS Expert: over 25 years programming experience (Windows 1.0 to present) designing, debugging, and coding Windows applications, middleware, and drivers. Spent the last 5+ years working with ID, hardware, and user experience experts to brainstorm and develop advanced PC concept designs demonstrating new ways to use a mobile PC. Summary Software programmer & architect dedicated to improving the User Experience on the Web, PC, or Mobile Device. Windows OS Expert: over 25 years programming experience (Windows 1.0 to present) designing, debugging, and coding Windows applications, middleware, and drivers. Spent the last 5+ years working with ID, hardware, and user experience experts to brainstorm and develop advanced PC concept designs demonstrating new ways to use a mobile PC. Software programmer & architect dedicated to improving the User Experience on the Web, PC, or Mobile Device. Windows OS Expert: over 25 years programming experience (Windows 1.0 to present) designing, debugging, and coding Windows applications, middleware, and drivers. Spent the last 5+ years working with ID, hardware, and user experience experts to brainstorm and develop advanced PC concept designs demonstrating new ways to use a mobile PC. Software programmer & architect dedicated to improving the User Experience on the Web, PC, or Mobile Device. Windows OS Expert: over 25 years programming experience (Windows 1.0 to present) designing, debugging, and coding Windows applications, middleware, and drivers. Spent the last 5+ years working with ID, hardware, and user experience experts to brainstorm and develop advanced PC concept designs demonstrating new ways to use a mobile PC. Experience Volunteer Webmaster Oregon High School Lacrosse Association September 2013  – Present (2 years) As a volunteer for the league, redesigned the entire website to upgrade relevance of content and improve the user experience. In addition to updating the look and feel for a better Oregon motif, switched the site interface to a menu based navigation to make the most commonly accessed info no more than two clicks away. Tripled the content by adding more pictures, multi-media final four recaps, YouTube videos, and links to all other Oregon lacrosse related sites. Also created an archive to access old standings, playoffs, player awards and other records. Designed database tables and GUI for online Game Score Reporting (including mobile phone interface), game scheduling (replacing error prone Excel spreadsheets), for college alumni, player awards, and player stats. Most importantly moved magic numbers from static pages to global variable file, created systematic process for transitioning year to year, and documented entire site for the next volunteer. All using .ASP, SQL, Javascript and CSS. Original look and feel of the site can be found at http://66.129.214.46/default.asp, updated site can be found at http://www;ohsla.net/default.asp.  IOT Group - Senior Software Architect Intel Corporation May 2015  –  July 2015  (3 months) Creating tools and processes for supporting Windows IOT on Intel Gateways. Software Architect Intel Corporation September 1991  –  July 2015  (23 years 11 months) Hillsboro, OR PC Client Group - Senior Software Architect Intel Corporation May 2013  –  May 2015  (2 years 1 month) PantherMtn Concept Architect & SW integration – architected USB TypeC Software stack from firmware to UI (3 patents), lead SW integration engineer during Power-on and debug including bring-up on Windows10. Shown at CES January 2015 \n \nLlamaMtn 1.5 Concept Application engineer & integration - developed 2nd release of Adaptive Performance Technology module for Intel’s Dynamic Platform Thermal Framework (DPTF) while performing SW integration during platform power-on and debug. Shown at Computex June 2014 \n Mobile Platform Solutions Division - Senior Software Architect Intel Corporation June 2008  –  May 2013  (5 years) As Software Architect worked with team of marketing, hardware and design engineers to build concept laptops including User research, formulating requirements, design of systems, interfaces, and software stacks. \n \nNikiski (Software Architect & Team Lead) - Designed and implemented software stack to enable the Nikiski experience: a dual sided touch panel with both direct and indirect touch, that allowed users access to PC data with the lid closed. A Windows8 like touch experience on Windows7, with an SDK to enable ISV plug-ins for notifications from different data sources: news, weather, birthdays, Outlook, etc. Nikiski was presented at CES and I was on stage with Mooly Eden to present it. Also performed several Press interviews, and served as the main Intel voice for the concept at OEM meetings for months following release. Search YouTube for ‘Intel Nikiski’ to see videos of the CES interviews (4 patents).  \n \nSanRafael (Software Architect) - Developed internal service and architecture to process touches and route them from hardware to Intel IP gesture processing kernels, as well as application level clients. Also implemented linked dual screen browsing plugin for Internet Explorer and Firefox. Worked with Acer SW teams to support transfer of technology to Acer which made the dual touch screen product, Iconia, possible (6 patents).  \n Mobile Platform Group - Mobile Media Architect Intel Corporation September 2006  –  June 2008  (1 year 10 months) Mobile DTV Software Lead - Represented Intel externally on the Mobile DTV Alliance standards group, with external ISVs (Corel, Cyberlink, and Pinnacle), and with OEMs for two different receiver card projects. Created DTV Player software to enable field testing of first laptop with internal DVB antennas and performed field testing in Europe. Integrated Intel proprietary Video Enhancement Technology (VET) into Player (2 patents) and created DirectShow SDK for optimal implementation on Intel DTV hardware.  Corporate Technology Group - Senior Software Engineer Intel Corporation March 2002  –  September 2006  (4 years 7 months) Emerging Platforms Lab Software Lead - spearheaded the switch from WinCE to Linux to further enable research of new radical new power saving methodologies outside of the dictates of Microsoft’s OS limitations. Maintained several web pages that served as FAQs for other CE developers with solutions for the many undocumented problems using CE Platform Builder IDE and Embedded Linux Development. \n \nBeyond 3G & Universal Communicator Software Lead - designed and helped develop the system SW stack for three evolutions of the form factor phones in collaboration with the (laptop) Mobile Platform Teams. Each was featured in IDF keynotes. Architected and implemented the media streaming application and server that would hand-off A/V streams between WWAN & WLAN transports on WinCE using the MxNMgr infrastructure (10yrs before Samsung release on Android). Developed client applications for the GPS locator infrastructure. Created A/V Video Capture application that streamed video over BT for “untethered camera” functionality. Served as software lead in charge of porting the Board Support Package (BSP) for each platform on WinCE and three development platforms in between.  \n \nPersonal Video Player Software Lead - Developed all client applications under WinCE including the A/V media playback application using the ILVC MPEG4-part10 (H.264) and MP3. Also created the PSA file format to optimize A/V performance on the XScale processor. Achieved 30fps playback on the Cotulla processor compared to 12fps using CE DirectShow and the disk caching algorithm reduced the hard drive duty cycle to less than 15% yielding significant power savings.  \n Intel Labs - Senior Software Engineer Intel Corporation August 1998  –  March 2002  (3 years 8 months) IAL Technology Harvesting Team – Technical arm of three person team tasked with distributing IAL technologies to external partners. While deals were signed for Business Streaming Stack and innovative satellite production, none came to fruition due to the dissolution of the Intel Media Streaming division. \n \nIntel Business Streaming Stack,Architect and Team Lead - managed 4 person team that developed an extension of RealPresenter functionality also using DirectShow but with an agnostic streaming infrastructure using NetShow and the Intel ILVC encoder. Also designed and implemented the host GUI and SW stack for the Consus “server in a pocket” project. \nRealPresenter Sr SW Engineer – Developed several DirectShow filters such as Wave Capture, Wave Render, G2Core Encoder and the slide capture OCX (aka LivePix) for the RealPresenter G2 media engine (2 patents). Then took over as team lead for the Knowledge Capture Effort and main Intel representative with RealNetworks for RealPresenter8 managing that relationship for more than a year.  \n ProShare - Software Team Lead Intel Corporation October 1995  –  August 1998  (2 years 11 months) Work on several teams on the massive ProShare application suite.  \n \nProShare New Applications Team to interview diverse groups of ProShare Users to find new usages and applications. Then implemented the audio infrastructure for the GroupLink Groupware project. This application audio intercom support as well as automatic presence detection using voice and camera motion detection to let geologically dispersed teammates quickly get in touch. While not brought to market as a product, this application, essentially a pre-cursor of Microsoft Lync, was very popular during internal and external user tests and, as Lync has since.  \n \nApplication Sharing Team Architect – Designed framework to move Application Sharing to Resource Only Dll architecture (which was enventually adopted by the entire ProShare application suite). For Application Sharing program developed widget to more easily share Apps and served as client side debugging expert (3 patents). Served on Tiger Team for critical ProShare debugging tasks (using SoftIce) and management of the Build Process. Innovations include the ProShare Build WebPage enabling some 20 SW teams to directly update their components in the ProShare build, the IntelSafeWEP library which greatly improved ProShare reliability on Windows 3.1 platforms, and complete redesign of the ProShare 3.0 installation program greatly reducing time to add new modules, enable localization, and also trimming disk space requirements by over 75%.  \n \nAddressBook Team Lead – Managed 4 person team while serving as the SW architect for the ProShare AddressBook infrastructure. Designed & implemented several shared components such as the Visual Business Card, General Type Manager class. and redesign of supporting database schema to increase performance and reduce application footprint. (4 patents)  \n PCEO - Software Engineer Intel Corporation September 1991  –  October 1994  (3 years 2 months) Designed and implemented the FAXability 1.0 manager application, the interactive main cover page GUI, as well as the installation and upgrade packages. For FAXabilty 2.0 created a new FAX management system, address book, and interface to the TSR engine (CASMgr).  \nFAXability 2.0 won the 1992 PC World Best FAX Software award based on its WYSIWYG GUI, unmatched graphic resolution, and superior FAX management capabilities.  \n Software Engineer Momentum Software September 1985  –  May 1988  (2 years 9 months) Lexington, MA 3 PC programming projects: Language parser to interpret money transfer requests (Turbo Prolog), Money Transfer Banking application (C), and Windows 1.0 Application to animate boards baking progress on conveyer belt (C). \n1 Tandem project: Host (back-end) money transfer application for #2 above (COBOL/SNOBOL) Volunteer Webmaster Oregon High School Lacrosse Association September 2013  – Present (2 years) As a volunteer for the league, redesigned the entire website to upgrade relevance of content and improve the user experience. In addition to updating the look and feel for a better Oregon motif, switched the site interface to a menu based navigation to make the most commonly accessed info no more than two clicks away. Tripled the content by adding more pictures, multi-media final four recaps, YouTube videos, and links to all other Oregon lacrosse related sites. Also created an archive to access old standings, playoffs, player awards and other records. Designed database tables and GUI for online Game Score Reporting (including mobile phone interface), game scheduling (replacing error prone Excel spreadsheets), for college alumni, player awards, and player stats. Most importantly moved magic numbers from static pages to global variable file, created systematic process for transitioning year to year, and documented entire site for the next volunteer. All using .ASP, SQL, Javascript and CSS. Original look and feel of the site can be found at http://66.129.214.46/default.asp, updated site can be found at http://www;ohsla.net/default.asp.  Volunteer Webmaster Oregon High School Lacrosse Association September 2013  – Present (2 years) As a volunteer for the league, redesigned the entire website to upgrade relevance of content and improve the user experience. In addition to updating the look and feel for a better Oregon motif, switched the site interface to a menu based navigation to make the most commonly accessed info no more than two clicks away. Tripled the content by adding more pictures, multi-media final four recaps, YouTube videos, and links to all other Oregon lacrosse related sites. Also created an archive to access old standings, playoffs, player awards and other records. Designed database tables and GUI for online Game Score Reporting (including mobile phone interface), game scheduling (replacing error prone Excel spreadsheets), for college alumni, player awards, and player stats. Most importantly moved magic numbers from static pages to global variable file, created systematic process for transitioning year to year, and documented entire site for the next volunteer. All using .ASP, SQL, Javascript and CSS. Original look and feel of the site can be found at http://66.129.214.46/default.asp, updated site can be found at http://www;ohsla.net/default.asp.  IOT Group - Senior Software Architect Intel Corporation May 2015  –  July 2015  (3 months) Creating tools and processes for supporting Windows IOT on Intel Gateways. IOT Group - Senior Software Architect Intel Corporation May 2015  –  July 2015  (3 months) Creating tools and processes for supporting Windows IOT on Intel Gateways. Software Architect Intel Corporation September 1991  –  July 2015  (23 years 11 months) Hillsboro, OR Software Architect Intel Corporation September 1991  –  July 2015  (23 years 11 months) Hillsboro, OR PC Client Group - Senior Software Architect Intel Corporation May 2013  –  May 2015  (2 years 1 month) PantherMtn Concept Architect & SW integration – architected USB TypeC Software stack from firmware to UI (3 patents), lead SW integration engineer during Power-on and debug including bring-up on Windows10. Shown at CES January 2015 \n \nLlamaMtn 1.5 Concept Application engineer & integration - developed 2nd release of Adaptive Performance Technology module for Intel’s Dynamic Platform Thermal Framework (DPTF) while performing SW integration during platform power-on and debug. Shown at Computex June 2014 \n PC Client Group - Senior Software Architect Intel Corporation May 2013  –  May 2015  (2 years 1 month) PantherMtn Concept Architect & SW integration – architected USB TypeC Software stack from firmware to UI (3 patents), lead SW integration engineer during Power-on and debug including bring-up on Windows10. Shown at CES January 2015 \n \nLlamaMtn 1.5 Concept Application engineer & integration - developed 2nd release of Adaptive Performance Technology module for Intel’s Dynamic Platform Thermal Framework (DPTF) while performing SW integration during platform power-on and debug. Shown at Computex June 2014 \n Mobile Platform Solutions Division - Senior Software Architect Intel Corporation June 2008  –  May 2013  (5 years) As Software Architect worked with team of marketing, hardware and design engineers to build concept laptops including User research, formulating requirements, design of systems, interfaces, and software stacks. \n \nNikiski (Software Architect & Team Lead) - Designed and implemented software stack to enable the Nikiski experience: a dual sided touch panel with both direct and indirect touch, that allowed users access to PC data with the lid closed. A Windows8 like touch experience on Windows7, with an SDK to enable ISV plug-ins for notifications from different data sources: news, weather, birthdays, Outlook, etc. Nikiski was presented at CES and I was on stage with Mooly Eden to present it. Also performed several Press interviews, and served as the main Intel voice for the concept at OEM meetings for months following release. Search YouTube for ‘Intel Nikiski’ to see videos of the CES interviews (4 patents).  \n \nSanRafael (Software Architect) - Developed internal service and architecture to process touches and route them from hardware to Intel IP gesture processing kernels, as well as application level clients. Also implemented linked dual screen browsing plugin for Internet Explorer and Firefox. Worked with Acer SW teams to support transfer of technology to Acer which made the dual touch screen product, Iconia, possible (6 patents).  \n Mobile Platform Solutions Division - Senior Software Architect Intel Corporation June 2008  –  May 2013  (5 years) As Software Architect worked with team of marketing, hardware and design engineers to build concept laptops including User research, formulating requirements, design of systems, interfaces, and software stacks. \n \nNikiski (Software Architect & Team Lead) - Designed and implemented software stack to enable the Nikiski experience: a dual sided touch panel with both direct and indirect touch, that allowed users access to PC data with the lid closed. A Windows8 like touch experience on Windows7, with an SDK to enable ISV plug-ins for notifications from different data sources: news, weather, birthdays, Outlook, etc. Nikiski was presented at CES and I was on stage with Mooly Eden to present it. Also performed several Press interviews, and served as the main Intel voice for the concept at OEM meetings for months following release. Search YouTube for ‘Intel Nikiski’ to see videos of the CES interviews (4 patents).  \n \nSanRafael (Software Architect) - Developed internal service and architecture to process touches and route them from hardware to Intel IP gesture processing kernels, as well as application level clients. Also implemented linked dual screen browsing plugin for Internet Explorer and Firefox. Worked with Acer SW teams to support transfer of technology to Acer which made the dual touch screen product, Iconia, possible (6 patents).  \n Mobile Platform Group - Mobile Media Architect Intel Corporation September 2006  –  June 2008  (1 year 10 months) Mobile DTV Software Lead - Represented Intel externally on the Mobile DTV Alliance standards group, with external ISVs (Corel, Cyberlink, and Pinnacle), and with OEMs for two different receiver card projects. Created DTV Player software to enable field testing of first laptop with internal DVB antennas and performed field testing in Europe. Integrated Intel proprietary Video Enhancement Technology (VET) into Player (2 patents) and created DirectShow SDK for optimal implementation on Intel DTV hardware.  Mobile Platform Group - Mobile Media Architect Intel Corporation September 2006  –  June 2008  (1 year 10 months) Mobile DTV Software Lead - Represented Intel externally on the Mobile DTV Alliance standards group, with external ISVs (Corel, Cyberlink, and Pinnacle), and with OEMs for two different receiver card projects. Created DTV Player software to enable field testing of first laptop with internal DVB antennas and performed field testing in Europe. Integrated Intel proprietary Video Enhancement Technology (VET) into Player (2 patents) and created DirectShow SDK for optimal implementation on Intel DTV hardware.  Corporate Technology Group - Senior Software Engineer Intel Corporation March 2002  –  September 2006  (4 years 7 months) Emerging Platforms Lab Software Lead - spearheaded the switch from WinCE to Linux to further enable research of new radical new power saving methodologies outside of the dictates of Microsoft’s OS limitations. Maintained several web pages that served as FAQs for other CE developers with solutions for the many undocumented problems using CE Platform Builder IDE and Embedded Linux Development. \n \nBeyond 3G & Universal Communicator Software Lead - designed and helped develop the system SW stack for three evolutions of the form factor phones in collaboration with the (laptop) Mobile Platform Teams. Each was featured in IDF keynotes. Architected and implemented the media streaming application and server that would hand-off A/V streams between WWAN & WLAN transports on WinCE using the MxNMgr infrastructure (10yrs before Samsung release on Android). Developed client applications for the GPS locator infrastructure. Created A/V Video Capture application that streamed video over BT for “untethered camera” functionality. Served as software lead in charge of porting the Board Support Package (BSP) for each platform on WinCE and three development platforms in between.  \n \nPersonal Video Player Software Lead - Developed all client applications under WinCE including the A/V media playback application using the ILVC MPEG4-part10 (H.264) and MP3. Also created the PSA file format to optimize A/V performance on the XScale processor. Achieved 30fps playback on the Cotulla processor compared to 12fps using CE DirectShow and the disk caching algorithm reduced the hard drive duty cycle to less than 15% yielding significant power savings.  \n Corporate Technology Group - Senior Software Engineer Intel Corporation March 2002  –  September 2006  (4 years 7 months) Emerging Platforms Lab Software Lead - spearheaded the switch from WinCE to Linux to further enable research of new radical new power saving methodologies outside of the dictates of Microsoft’s OS limitations. Maintained several web pages that served as FAQs for other CE developers with solutions for the many undocumented problems using CE Platform Builder IDE and Embedded Linux Development. \n \nBeyond 3G & Universal Communicator Software Lead - designed and helped develop the system SW stack for three evolutions of the form factor phones in collaboration with the (laptop) Mobile Platform Teams. Each was featured in IDF keynotes. Architected and implemented the media streaming application and server that would hand-off A/V streams between WWAN & WLAN transports on WinCE using the MxNMgr infrastructure (10yrs before Samsung release on Android). Developed client applications for the GPS locator infrastructure. Created A/V Video Capture application that streamed video over BT for “untethered camera” functionality. Served as software lead in charge of porting the Board Support Package (BSP) for each platform on WinCE and three development platforms in between.  \n \nPersonal Video Player Software Lead - Developed all client applications under WinCE including the A/V media playback application using the ILVC MPEG4-part10 (H.264) and MP3. Also created the PSA file format to optimize A/V performance on the XScale processor. Achieved 30fps playback on the Cotulla processor compared to 12fps using CE DirectShow and the disk caching algorithm reduced the hard drive duty cycle to less than 15% yielding significant power savings.  \n Intel Labs - Senior Software Engineer Intel Corporation August 1998  –  March 2002  (3 years 8 months) IAL Technology Harvesting Team – Technical arm of three person team tasked with distributing IAL technologies to external partners. While deals were signed for Business Streaming Stack and innovative satellite production, none came to fruition due to the dissolution of the Intel Media Streaming division. \n \nIntel Business Streaming Stack,Architect and Team Lead - managed 4 person team that developed an extension of RealPresenter functionality also using DirectShow but with an agnostic streaming infrastructure using NetShow and the Intel ILVC encoder. Also designed and implemented the host GUI and SW stack for the Consus “server in a pocket” project. \nRealPresenter Sr SW Engineer – Developed several DirectShow filters such as Wave Capture, Wave Render, G2Core Encoder and the slide capture OCX (aka LivePix) for the RealPresenter G2 media engine (2 patents). Then took over as team lead for the Knowledge Capture Effort and main Intel representative with RealNetworks for RealPresenter8 managing that relationship for more than a year.  \n Intel Labs - Senior Software Engineer Intel Corporation August 1998  –  March 2002  (3 years 8 months) IAL Technology Harvesting Team – Technical arm of three person team tasked with distributing IAL technologies to external partners. While deals were signed for Business Streaming Stack and innovative satellite production, none came to fruition due to the dissolution of the Intel Media Streaming division. \n \nIntel Business Streaming Stack,Architect and Team Lead - managed 4 person team that developed an extension of RealPresenter functionality also using DirectShow but with an agnostic streaming infrastructure using NetShow and the Intel ILVC encoder. Also designed and implemented the host GUI and SW stack for the Consus “server in a pocket” project. \nRealPresenter Sr SW Engineer – Developed several DirectShow filters such as Wave Capture, Wave Render, G2Core Encoder and the slide capture OCX (aka LivePix) for the RealPresenter G2 media engine (2 patents). Then took over as team lead for the Knowledge Capture Effort and main Intel representative with RealNetworks for RealPresenter8 managing that relationship for more than a year.  \n ProShare - Software Team Lead Intel Corporation October 1995  –  August 1998  (2 years 11 months) Work on several teams on the massive ProShare application suite.  \n \nProShare New Applications Team to interview diverse groups of ProShare Users to find new usages and applications. Then implemented the audio infrastructure for the GroupLink Groupware project. This application audio intercom support as well as automatic presence detection using voice and camera motion detection to let geologically dispersed teammates quickly get in touch. While not brought to market as a product, this application, essentially a pre-cursor of Microsoft Lync, was very popular during internal and external user tests and, as Lync has since.  \n \nApplication Sharing Team Architect – Designed framework to move Application Sharing to Resource Only Dll architecture (which was enventually adopted by the entire ProShare application suite). For Application Sharing program developed widget to more easily share Apps and served as client side debugging expert (3 patents). Served on Tiger Team for critical ProShare debugging tasks (using SoftIce) and management of the Build Process. Innovations include the ProShare Build WebPage enabling some 20 SW teams to directly update their components in the ProShare build, the IntelSafeWEP library which greatly improved ProShare reliability on Windows 3.1 platforms, and complete redesign of the ProShare 3.0 installation program greatly reducing time to add new modules, enable localization, and also trimming disk space requirements by over 75%.  \n \nAddressBook Team Lead – Managed 4 person team while serving as the SW architect for the ProShare AddressBook infrastructure. Designed & implemented several shared components such as the Visual Business Card, General Type Manager class. and redesign of supporting database schema to increase performance and reduce application footprint. (4 patents)  \n ProShare - Software Team Lead Intel Corporation October 1995  –  August 1998  (2 years 11 months) Work on several teams on the massive ProShare application suite.  \n \nProShare New Applications Team to interview diverse groups of ProShare Users to find new usages and applications. Then implemented the audio infrastructure for the GroupLink Groupware project. This application audio intercom support as well as automatic presence detection using voice and camera motion detection to let geologically dispersed teammates quickly get in touch. While not brought to market as a product, this application, essentially a pre-cursor of Microsoft Lync, was very popular during internal and external user tests and, as Lync has since.  \n \nApplication Sharing Team Architect – Designed framework to move Application Sharing to Resource Only Dll architecture (which was enventually adopted by the entire ProShare application suite). For Application Sharing program developed widget to more easily share Apps and served as client side debugging expert (3 patents). Served on Tiger Team for critical ProShare debugging tasks (using SoftIce) and management of the Build Process. Innovations include the ProShare Build WebPage enabling some 20 SW teams to directly update their components in the ProShare build, the IntelSafeWEP library which greatly improved ProShare reliability on Windows 3.1 platforms, and complete redesign of the ProShare 3.0 installation program greatly reducing time to add new modules, enable localization, and also trimming disk space requirements by over 75%.  \n \nAddressBook Team Lead – Managed 4 person team while serving as the SW architect for the ProShare AddressBook infrastructure. Designed & implemented several shared components such as the Visual Business Card, General Type Manager class. and redesign of supporting database schema to increase performance and reduce application footprint. (4 patents)  \n PCEO - Software Engineer Intel Corporation September 1991  –  October 1994  (3 years 2 months) Designed and implemented the FAXability 1.0 manager application, the interactive main cover page GUI, as well as the installation and upgrade packages. For FAXabilty 2.0 created a new FAX management system, address book, and interface to the TSR engine (CASMgr).  \nFAXability 2.0 won the 1992 PC World Best FAX Software award based on its WYSIWYG GUI, unmatched graphic resolution, and superior FAX management capabilities.  \n PCEO - Software Engineer Intel Corporation September 1991  –  October 1994  (3 years 2 months) Designed and implemented the FAXability 1.0 manager application, the interactive main cover page GUI, as well as the installation and upgrade packages. For FAXabilty 2.0 created a new FAX management system, address book, and interface to the TSR engine (CASMgr).  \nFAXability 2.0 won the 1992 PC World Best FAX Software award based on its WYSIWYG GUI, unmatched graphic resolution, and superior FAX management capabilities.  \n Software Engineer Momentum Software September 1985  –  May 1988  (2 years 9 months) Lexington, MA 3 PC programming projects: Language parser to interpret money transfer requests (Turbo Prolog), Money Transfer Banking application (C), and Windows 1.0 Application to animate boards baking progress on conveyer belt (C). \n1 Tandem project: Host (back-end) money transfer application for #2 above (COBOL/SNOBOL) Software Engineer Momentum Software September 1985  –  May 1988  (2 years 9 months) Lexington, MA 3 PC programming projects: Language parser to interpret money transfer requests (Turbo Prolog), Money Transfer Banking application (C), and Windows 1.0 Application to animate boards baking progress on conveyer belt (C). \n1 Tandem project: Host (back-end) money transfer application for #2 above (COBOL/SNOBOL) Skills Out-of-the-Box Thinking User-centered Design Concept Development Software Development COM C++ Windows Debugging USB TypeC Rapid Prototyping User Interface X86 Software Engineering Microsoft Operating... Databases Intel HTML C# C Assembly Language See 5+     See less Skills  Out-of-the-Box Thinking User-centered Design Concept Development Software Development COM C++ Windows Debugging USB TypeC Rapid Prototyping User Interface X86 Software Engineering Microsoft Operating... Databases Intel HTML C# C Assembly Language See 5+     See less Out-of-the-Box Thinking User-centered Design Concept Development Software Development COM C++ Windows Debugging USB TypeC Rapid Prototyping User Interface X86 Software Engineering Microsoft Operating... Databases Intel HTML C# C Assembly Language See 5+     See less Out-of-the-Box Thinking User-centered Design Concept Development Software Development COM C++ Windows Debugging USB TypeC Rapid Prototyping User Interface X86 Software Engineering Microsoft Operating... Databases Intel HTML C# C Assembly Language See 5+     See less Education University of Oregon Master’s Degree,  Computer Science 1989  – 1991 Focus on Parallel Processing co-authored two papers with Dr. Evan Tick: \"Greedy partitioned algorithms for the shortest-path problem\" (1991, International Journal of Parallel Programming, 1991, http://dblp.uni-trier.de/db/journals/ijpp/ijpp20.html#AdamsonT91) and \"Parallel Algorithms for the Single-Source Shortest-Path Problem\" (ICPP, 1992, http://dblp.uni-trier.de/db/conf/icpp/icpp1992-3.html#AdamsonT92) Duke University Engineer’s Degree,  Electrical Engineering & Computer Science 1982  – 1985 Varsity Lacrosse player for four seasons Activities and Societies:  Beta Theta Pi University of Oregon Master’s Degree,  Computer Science 1989  – 1991 Focus on Parallel Processing co-authored two papers with Dr. Evan Tick: \"Greedy partitioned algorithms for the shortest-path problem\" (1991, International Journal of Parallel Programming, 1991, http://dblp.uni-trier.de/db/journals/ijpp/ijpp20.html#AdamsonT91) and \"Parallel Algorithms for the Single-Source Shortest-Path Problem\" (ICPP, 1992, http://dblp.uni-trier.de/db/conf/icpp/icpp1992-3.html#AdamsonT92) University of Oregon Master’s Degree,  Computer Science 1989  – 1991 Focus on Parallel Processing co-authored two papers with Dr. Evan Tick: \"Greedy partitioned algorithms for the shortest-path problem\" (1991, International Journal of Parallel Programming, 1991, http://dblp.uni-trier.de/db/journals/ijpp/ijpp20.html#AdamsonT91) and \"Parallel Algorithms for the Single-Source Shortest-Path Problem\" (ICPP, 1992, http://dblp.uni-trier.de/db/conf/icpp/icpp1992-3.html#AdamsonT92) University of Oregon Master’s Degree,  Computer Science 1989  – 1991 Focus on Parallel Processing co-authored two papers with Dr. Evan Tick: \"Greedy partitioned algorithms for the shortest-path problem\" (1991, International Journal of Parallel Programming, 1991, http://dblp.uni-trier.de/db/journals/ijpp/ijpp20.html#AdamsonT91) and \"Parallel Algorithms for the Single-Source Shortest-Path Problem\" (ICPP, 1992, http://dblp.uni-trier.de/db/conf/icpp/icpp1992-3.html#AdamsonT92) Duke University Engineer’s Degree,  Electrical Engineering & Computer Science 1982  – 1985 Varsity Lacrosse player for four seasons Activities and Societies:  Beta Theta Pi Duke University Engineer’s Degree,  Electrical Engineering & Computer Science 1982  – 1985 Varsity Lacrosse player for four seasons Activities and Societies:  Beta Theta Pi Duke University Engineer’s Degree,  Electrical Engineering & Computer Science 1982  – 1985 Varsity Lacrosse player for four seasons Activities and Societies:  Beta Theta Pi ", "Experience Senior Patent Counsel Apple September 2007  – Present (8 years) Senior Legal Counsel Apple December 2011  –  November 2012  (1 year) Cupertino CA Seeking to diversify my skill set, I sought an in-house rotation away from my primary patent counsel role in 2012. In this role, I counseled certain software engineering product development teams at Apple on all legal matters arising from business activity. Negotiated, drafted, and closed deals arising from business activities with external entities of all sizes for inbound technology, asset purchase, acquisitions, and IP licensing for engineering and IT needs at Apple. Special emphasis on software licensing and open source software related issues. Patent Professional Intel Corporation 2001  –  September 2007  (6 years) Patent Attorney (2005-2007); Patent Agent (2003-2005); and Patent Engineer (2001-2003). •\t \n \nPrepared, filed and prosecuted patent applications including several key patents. Areas of focus included Compilers, Processor Architecture, and software, generally. Performed key patent selection, claim charting and filing analysis for strategic portfolio reviews, analyses of outside submissions and in support of patent purchases. Participated in invention disclosure selection as an IP Committee member. Helped develop a cost-optimized claim strategy for non-US filing. Conducted disclosure generation sessions with engineering teams. Taught Intel’s Patent Training for Engineers course and developed and delivered advanced patent training to researchers. Senior Software Architect Intel Corporation 2000  –  2001  (1 year) Specification of a broadcast network operation center for data delivery to a video and data based managed client system Senior Software Engineer Intel Corporation 1992  –  2000  (8 years) Multiple roles, including CAD software development in physical design CAD and logic design CAD, software process engineering, and tool build process definition Senior Patent Counsel Apple September 2007  – Present (8 years) Senior Patent Counsel Apple September 2007  – Present (8 years) Senior Legal Counsel Apple December 2011  –  November 2012  (1 year) Cupertino CA Seeking to diversify my skill set, I sought an in-house rotation away from my primary patent counsel role in 2012. In this role, I counseled certain software engineering product development teams at Apple on all legal matters arising from business activity. Negotiated, drafted, and closed deals arising from business activities with external entities of all sizes for inbound technology, asset purchase, acquisitions, and IP licensing for engineering and IT needs at Apple. Special emphasis on software licensing and open source software related issues. Senior Legal Counsel Apple December 2011  –  November 2012  (1 year) Cupertino CA Seeking to diversify my skill set, I sought an in-house rotation away from my primary patent counsel role in 2012. In this role, I counseled certain software engineering product development teams at Apple on all legal matters arising from business activity. Negotiated, drafted, and closed deals arising from business activities with external entities of all sizes for inbound technology, asset purchase, acquisitions, and IP licensing for engineering and IT needs at Apple. Special emphasis on software licensing and open source software related issues. Patent Professional Intel Corporation 2001  –  September 2007  (6 years) Patent Attorney (2005-2007); Patent Agent (2003-2005); and Patent Engineer (2001-2003). •\t \n \nPrepared, filed and prosecuted patent applications including several key patents. Areas of focus included Compilers, Processor Architecture, and software, generally. Performed key patent selection, claim charting and filing analysis for strategic portfolio reviews, analyses of outside submissions and in support of patent purchases. Participated in invention disclosure selection as an IP Committee member. Helped develop a cost-optimized claim strategy for non-US filing. Conducted disclosure generation sessions with engineering teams. Taught Intel’s Patent Training for Engineers course and developed and delivered advanced patent training to researchers. Patent Professional Intel Corporation 2001  –  September 2007  (6 years) Patent Attorney (2005-2007); Patent Agent (2003-2005); and Patent Engineer (2001-2003). •\t \n \nPrepared, filed and prosecuted patent applications including several key patents. Areas of focus included Compilers, Processor Architecture, and software, generally. Performed key patent selection, claim charting and filing analysis for strategic portfolio reviews, analyses of outside submissions and in support of patent purchases. Participated in invention disclosure selection as an IP Committee member. Helped develop a cost-optimized claim strategy for non-US filing. Conducted disclosure generation sessions with engineering teams. Taught Intel’s Patent Training for Engineers course and developed and delivered advanced patent training to researchers. Senior Software Architect Intel Corporation 2000  –  2001  (1 year) Specification of a broadcast network operation center for data delivery to a video and data based managed client system Senior Software Architect Intel Corporation 2000  –  2001  (1 year) Specification of a broadcast network operation center for data delivery to a video and data based managed client system Senior Software Engineer Intel Corporation 1992  –  2000  (8 years) Multiple roles, including CAD software development in physical design CAD and logic design CAD, software process engineering, and tool build process definition Senior Software Engineer Intel Corporation 1992  –  2000  (8 years) Multiple roles, including CAD software development in physical design CAD and logic design CAD, software process engineering, and tool build process definition Languages Hindi Hindi Hindi Skills Patent Portfolio... Patent Portfolio... Software Licensing Patent Prosecution Open Source Licensing Transactional Law Contract Negotiation Patents Intellectual Property Computer Science Software Engineering Skills  Patent Portfolio... Patent Portfolio... Software Licensing Patent Prosecution Open Source Licensing Transactional Law Contract Negotiation Patents Intellectual Property Computer Science Software Engineering Patent Portfolio... Patent Portfolio... Software Licensing Patent Prosecution Open Source Licensing Transactional Law Contract Negotiation Patents Intellectual Property Computer Science Software Engineering Patent Portfolio... Patent Portfolio... Software Licensing Patent Prosecution Open Source Licensing Transactional Law Contract Negotiation Patents Intellectual Property Computer Science Software Engineering Education Lewis & Clark Law School J.D. 2001  – 2004 The Ohio State University Ph.D. 1987  – 1992 The Ohio State University M.S. 1986  – 1987 Birla Institute of Technology and Science, Pilani Msc. (Tech) 1982  – 1986 Lewis & Clark Law School J.D. 2001  – 2004 Lewis & Clark Law School J.D. 2001  – 2004 Lewis & Clark Law School J.D. 2001  – 2004 The Ohio State University Ph.D. 1987  – 1992 The Ohio State University Ph.D. 1987  – 1992 The Ohio State University Ph.D. 1987  – 1992 The Ohio State University M.S. 1986  – 1987 The Ohio State University M.S. 1986  – 1987 The Ohio State University M.S. 1986  – 1987 Birla Institute of Technology and Science, Pilani Msc. (Tech) 1982  – 1986 Birla Institute of Technology and Science, Pilani Msc. (Tech) 1982  – 1986 Birla Institute of Technology and Science, Pilani Msc. (Tech) 1982  – 1986 "]}