{"position": "Simulation Engineer", "company": "Intel Corporation", "profiles": ["Summary Study the influence of workload behavior on the design of pipelined out-of-order superscalar processors in the presence of circuit-level tradeoffs between propagation delay and complexity. Specialties:debugging, logic design, modeling, networking, processors, programming, Summary Study the influence of workload behavior on the design of pipelined out-of-order superscalar processors in the presence of circuit-level tradeoffs between propagation delay and complexity. Specialties:debugging, logic design, modeling, networking, processors, programming, Study the influence of workload behavior on the design of pipelined out-of-order superscalar processors in the presence of circuit-level tradeoffs between propagation delay and complexity. Specialties:debugging, logic design, modeling, networking, processors, programming, Study the influence of workload behavior on the design of pipelined out-of-order superscalar processors in the presence of circuit-level tradeoffs between propagation delay and complexity. Specialties:debugging, logic design, modeling, networking, processors, programming, Experience Performance Simulation Engineer Intel Corporation January 2011  – Present (4 years 8 months) Research assistant North Carolina State University August 2005  –  December 2010  (5 years 5 months) The influence of workload behavior on the design of pipelined processors in the presence of circuit-level trade-offs between propagation delay and complexity. Research Intern Intel Corporation July 2010  –  October 2010  (4 months) The effect of smart cache replacement policies on the best scheduling mechanism in multi-cluster CMPs. Research Intern Qualcomm February 2008  –  August 2008  (7 months) Modeling power and AXI bus performance of the Scorpion processor with event counters. Research Assistant Insitute for Research in Fundamental Science August 2004  –  August 2005  (1 year 1 month) Performance modeling and evaluation of interconnection networks. Intern Iranian Research Org. for Science and Technology January 2001  –  January 2002  (1 year 1 month) Complete logic, schematic and PCB design, programming and debugging of a chemical fermentation system based on the i80196 microprocessor. Performance Simulation Engineer Intel Corporation January 2011  – Present (4 years 8 months) Performance Simulation Engineer Intel Corporation January 2011  – Present (4 years 8 months) Research assistant North Carolina State University August 2005  –  December 2010  (5 years 5 months) The influence of workload behavior on the design of pipelined processors in the presence of circuit-level trade-offs between propagation delay and complexity. Research assistant North Carolina State University August 2005  –  December 2010  (5 years 5 months) The influence of workload behavior on the design of pipelined processors in the presence of circuit-level trade-offs between propagation delay and complexity. Research Intern Intel Corporation July 2010  –  October 2010  (4 months) The effect of smart cache replacement policies on the best scheduling mechanism in multi-cluster CMPs. Research Intern Intel Corporation July 2010  –  October 2010  (4 months) The effect of smart cache replacement policies on the best scheduling mechanism in multi-cluster CMPs. Research Intern Qualcomm February 2008  –  August 2008  (7 months) Modeling power and AXI bus performance of the Scorpion processor with event counters. Research Intern Qualcomm February 2008  –  August 2008  (7 months) Modeling power and AXI bus performance of the Scorpion processor with event counters. Research Assistant Insitute for Research in Fundamental Science August 2004  –  August 2005  (1 year 1 month) Performance modeling and evaluation of interconnection networks. Research Assistant Insitute for Research in Fundamental Science August 2004  –  August 2005  (1 year 1 month) Performance modeling and evaluation of interconnection networks. Intern Iranian Research Org. for Science and Technology January 2001  –  January 2002  (1 year 1 month) Complete logic, schematic and PCB design, programming and debugging of a chemical fermentation system based on the i80196 microprocessor. Intern Iranian Research Org. for Science and Technology January 2001  –  January 2002  (1 year 1 month) Complete logic, schematic and PCB design, programming and debugging of a chemical fermentation system based on the i80196 microprocessor. Skills Computer Architecture Skills  Computer Architecture Computer Architecture Computer Architecture Education NC State University Phd,  Computer Hardware 2005  – 2010 Sharif University of Technology MS,  Engineering 2001  – 2004 Azad University (IAUCTB) BS,  Computer Hardware 1996  – 2001 NC State University Phd,  Computer Hardware 2005  – 2010 NC State University Phd,  Computer Hardware 2005  – 2010 NC State University Phd,  Computer Hardware 2005  – 2010 Sharif University of Technology MS,  Engineering 2001  – 2004 Sharif University of Technology MS,  Engineering 2001  – 2004 Sharif University of Technology MS,  Engineering 2001  – 2004 Azad University (IAUCTB) BS,  Computer Hardware 1996  – 2001 Azad University (IAUCTB) BS,  Computer Hardware 1996  – 2001 Azad University (IAUCTB) BS,  Computer Hardware 1996  – 2001 Honors & Awards Additional Honors & Awards ISCA Travel grant Additional Honors & Awards ISCA Travel grant Additional Honors & Awards ISCA Travel grant Additional Honors & Awards ISCA Travel grant ", "Summary My PhD research was on two main topics: Computer Architecture and Compilers, to be more specific, in Dynamic Binary Translation (DBT) and Transactional Memory. At the end of my PhD I had the opportunity to work as an intern in two major companies: Sony Computer Entertainment America and Intel. At those companies I had the chance to apply my skills and improve my knowledge even further. Specialties:Computer Architecture, Compilers, Parallel Processing, Binary Translation, Transactional Memory Summary My PhD research was on two main topics: Computer Architecture and Compilers, to be more specific, in Dynamic Binary Translation (DBT) and Transactional Memory. At the end of my PhD I had the opportunity to work as an intern in two major companies: Sony Computer Entertainment America and Intel. At those companies I had the chance to apply my skills and improve my knowledge even further. Specialties:Computer Architecture, Compilers, Parallel Processing, Binary Translation, Transactional Memory My PhD research was on two main topics: Computer Architecture and Compilers, to be more specific, in Dynamic Binary Translation (DBT) and Transactional Memory. At the end of my PhD I had the opportunity to work as an intern in two major companies: Sony Computer Entertainment America and Intel. At those companies I had the chance to apply my skills and improve my knowledge even further. Specialties:Computer Architecture, Compilers, Parallel Processing, Binary Translation, Transactional Memory My PhD research was on two main topics: Computer Architecture and Compilers, to be more specific, in Dynamic Binary Translation (DBT) and Transactional Memory. At the end of my PhD I had the opportunity to work as an intern in two major companies: Sony Computer Entertainment America and Intel. At those companies I had the chance to apply my skills and improve my knowledge even further. Specialties:Computer Architecture, Compilers, Parallel Processing, Binary Translation, Transactional Memory Experience CPU Simulation Engineer Intel Corporation September 2012  – Present (3 years) Stockholm, Sweden PhD Student UNICAMP March 2006  –  September 2012  (6 years 7 months) Binary Translation Intern Intel Corporation October 2011  –  January 2012  (4 months) Sweden Compiler Engineer Intern Sony Computer Entertainment America LLC July 2011  –  October 2011  (4 months) Foster City, CA CPU Simulation Engineer Intel Corporation September 2012  – Present (3 years) Stockholm, Sweden CPU Simulation Engineer Intel Corporation September 2012  – Present (3 years) Stockholm, Sweden PhD Student UNICAMP March 2006  –  September 2012  (6 years 7 months) PhD Student UNICAMP March 2006  –  September 2012  (6 years 7 months) Binary Translation Intern Intel Corporation October 2011  –  January 2012  (4 months) Sweden Binary Translation Intern Intel Corporation October 2011  –  January 2012  (4 months) Sweden Compiler Engineer Intern Sony Computer Entertainment America LLC July 2011  –  October 2011  (4 months) Foster City, CA Compiler Engineer Intern Sony Computer Entertainment America LLC July 2011  –  October 2011  (4 months) Foster City, CA Skills Compilers Computer Architecture Parallel Processing Computer Science C Programming Parallel Computing High Performance... Processors Intel Parallel Programming Simulations Software Engineering Binary Translation Skills  Compilers Computer Architecture Parallel Processing Computer Science C Programming Parallel Computing High Performance... Processors Intel Parallel Programming Simulations Software Engineering Binary Translation Compilers Computer Architecture Parallel Processing Computer Science C Programming Parallel Computing High Performance... Processors Intel Parallel Programming Simulations Software Engineering Binary Translation Compilers Computer Architecture Parallel Processing Computer Science C Programming Parallel Computing High Performance... Processors Intel Parallel Programming Simulations Software Engineering Binary Translation Education UNICAMP PhD,  Computer Science 2006  – 2012 Universidade Federal de Juiz de Fora (UFJF) Bachellors,  Computer Science 2002  – 2006 UNICAMP PhD,  Computer Science 2006  – 2012 UNICAMP PhD,  Computer Science 2006  – 2012 UNICAMP PhD,  Computer Science 2006  – 2012 Universidade Federal de Juiz de Fora (UFJF) Bachellors,  Computer Science 2002  – 2006 Universidade Federal de Juiz de Fora (UFJF) Bachellors,  Computer Science 2002  – 2006 Universidade Federal de Juiz de Fora (UFJF) Bachellors,  Computer Science 2002  – 2006 ", "Experience Software Simulation Engineer Intel Corporation Software Simulation Engineer Intel Corporation Software Simulation Engineer Intel Corporation ", "Summary My work experience spans hardware/firmware/software/architecture, with a strong focus on software development and hardware logic verification. \n \nStrengths: \nSoftware/Firmware Development \nLogic Verification Collateral Development (Drivers, Monitors, Checkers) \nIntel Architecture \nItanium RAS Architecture (Reliability Availability Serviceability) \nSoftware Debug \nSilicon Debug \n \nSkills: \nC, C++, Itanium Assembly, Perl, UNIX/Linux Shell Scripting, Git, Subversion, Intel ITP, SystemVerilog, OVM, Verdi, Debussy, DVE, GDB, Adobe Framemaker, Microsoft Office Summary My work experience spans hardware/firmware/software/architecture, with a strong focus on software development and hardware logic verification. \n \nStrengths: \nSoftware/Firmware Development \nLogic Verification Collateral Development (Drivers, Monitors, Checkers) \nIntel Architecture \nItanium RAS Architecture (Reliability Availability Serviceability) \nSoftware Debug \nSilicon Debug \n \nSkills: \nC, C++, Itanium Assembly, Perl, UNIX/Linux Shell Scripting, Git, Subversion, Intel ITP, SystemVerilog, OVM, Verdi, Debussy, DVE, GDB, Adobe Framemaker, Microsoft Office My work experience spans hardware/firmware/software/architecture, with a strong focus on software development and hardware logic verification. \n \nStrengths: \nSoftware/Firmware Development \nLogic Verification Collateral Development (Drivers, Monitors, Checkers) \nIntel Architecture \nItanium RAS Architecture (Reliability Availability Serviceability) \nSoftware Debug \nSilicon Debug \n \nSkills: \nC, C++, Itanium Assembly, Perl, UNIX/Linux Shell Scripting, Git, Subversion, Intel ITP, SystemVerilog, OVM, Verdi, Debussy, DVE, GDB, Adobe Framemaker, Microsoft Office My work experience spans hardware/firmware/software/architecture, with a strong focus on software development and hardware logic verification. \n \nStrengths: \nSoftware/Firmware Development \nLogic Verification Collateral Development (Drivers, Monitors, Checkers) \nIntel Architecture \nItanium RAS Architecture (Reliability Availability Serviceability) \nSoftware Debug \nSilicon Debug \n \nSkills: \nC, C++, Itanium Assembly, Perl, UNIX/Linux Shell Scripting, Git, Subversion, Intel ITP, SystemVerilog, OVM, Verdi, Debussy, DVE, GDB, Adobe Framemaker, Microsoft Office Experience Logic Design Verification Engineer NVIDIA July 2014  – Present (1 year 2 months) Austin, TX IP Logic verification using SystemVerilog and UVM framework. SoC IP Logic Design Verification Engineer Intel Corporation February 2013  –  June 2014  (1 year 5 months) Fort Collins, Colorado Area Logic verification of CPU/Memory/IO Coherency Agent IP for next generation Atom-based Intel Microserver SoC, using OVM/SVTB CPU RAS Firmware Engineer Intel Corporation January 2006  –  January 2013  (7 years 1 month) Fort Collins, Colorado Area Designed and implemented Intel Itanium RAS Firmware CPU System Debug Engineer Intel Corporation January 2004  –  December 2005  (2 years) Fort Collins, Colorado Area Debugged CPU silicon sightings to root cause CPU Logic Design Verification Engineer Intel Corporation May 2001  –  December 2003  (2 years 8 months) Fort Collins, Colorado Area Designed and implemented software for several Itanium CPU RTL micro architectural monitors and checkers for the Bus Interface Unit System Level Simulation Engineer Intel Corporation January 1998  –  April 2001  (3 years 4 months) Sacramento, California Area Created software for micro architectural bus transaction monitors and checkers to validate Intel Chipset RTL Rotation Engineer Intel Corporation June 1996  –  December 1997  (1 year 7 months) Phoenix, Arizona Area Completed four 4-month rotations in Manufacturing (Litho Process), Technical Marketing (Product Prototypes), Circuit Design (1st Itanium CPU), and Logic Design Verification (Chipset) Logic Design Verification Engineer NVIDIA July 2014  – Present (1 year 2 months) Austin, TX IP Logic verification using SystemVerilog and UVM framework. Logic Design Verification Engineer NVIDIA July 2014  – Present (1 year 2 months) Austin, TX IP Logic verification using SystemVerilog and UVM framework. SoC IP Logic Design Verification Engineer Intel Corporation February 2013  –  June 2014  (1 year 5 months) Fort Collins, Colorado Area Logic verification of CPU/Memory/IO Coherency Agent IP for next generation Atom-based Intel Microserver SoC, using OVM/SVTB SoC IP Logic Design Verification Engineer Intel Corporation February 2013  –  June 2014  (1 year 5 months) Fort Collins, Colorado Area Logic verification of CPU/Memory/IO Coherency Agent IP for next generation Atom-based Intel Microserver SoC, using OVM/SVTB CPU RAS Firmware Engineer Intel Corporation January 2006  –  January 2013  (7 years 1 month) Fort Collins, Colorado Area Designed and implemented Intel Itanium RAS Firmware CPU RAS Firmware Engineer Intel Corporation January 2006  –  January 2013  (7 years 1 month) Fort Collins, Colorado Area Designed and implemented Intel Itanium RAS Firmware CPU System Debug Engineer Intel Corporation January 2004  –  December 2005  (2 years) Fort Collins, Colorado Area Debugged CPU silicon sightings to root cause CPU System Debug Engineer Intel Corporation January 2004  –  December 2005  (2 years) Fort Collins, Colorado Area Debugged CPU silicon sightings to root cause CPU Logic Design Verification Engineer Intel Corporation May 2001  –  December 2003  (2 years 8 months) Fort Collins, Colorado Area Designed and implemented software for several Itanium CPU RTL micro architectural monitors and checkers for the Bus Interface Unit CPU Logic Design Verification Engineer Intel Corporation May 2001  –  December 2003  (2 years 8 months) Fort Collins, Colorado Area Designed and implemented software for several Itanium CPU RTL micro architectural monitors and checkers for the Bus Interface Unit System Level Simulation Engineer Intel Corporation January 1998  –  April 2001  (3 years 4 months) Sacramento, California Area Created software for micro architectural bus transaction monitors and checkers to validate Intel Chipset RTL System Level Simulation Engineer Intel Corporation January 1998  –  April 2001  (3 years 4 months) Sacramento, California Area Created software for micro architectural bus transaction monitors and checkers to validate Intel Chipset RTL Rotation Engineer Intel Corporation June 1996  –  December 1997  (1 year 7 months) Phoenix, Arizona Area Completed four 4-month rotations in Manufacturing (Litho Process), Technical Marketing (Product Prototypes), Circuit Design (1st Itanium CPU), and Logic Design Verification (Chipset) Rotation Engineer Intel Corporation June 1996  –  December 1997  (1 year 7 months) Phoenix, Arizona Area Completed four 4-month rotations in Manufacturing (Litho Process), Technical Marketing (Product Prototypes), Circuit Design (1st Itanium CPU), and Logic Design Verification (Chipset) Skills SystemVerilog Debugging Processors Firmware Functional Verification SoC Microprocessors Computer Architecture C++ Perl Assembly Language Itanium Computer Hardware Silicon Validation Software Development Semiconductors See 1+     See less Skills  SystemVerilog Debugging Processors Firmware Functional Verification SoC Microprocessors Computer Architecture C++ Perl Assembly Language Itanium Computer Hardware Silicon Validation Software Development Semiconductors See 1+     See less SystemVerilog Debugging Processors Firmware Functional Verification SoC Microprocessors Computer Architecture C++ Perl Assembly Language Itanium Computer Hardware Silicon Validation Software Development Semiconductors See 1+     See less SystemVerilog Debugging Processors Firmware Functional Verification SoC Microprocessors Computer Architecture C++ Perl Assembly Language Itanium Computer Hardware Silicon Validation Software Development Semiconductors See 1+     See less Education Rochester Institute of Technology Bachelor of Science (BS) 1991  – 1996 Rochester Institute of Technology Bachelor of Science (BS) 1991  – 1996 Rochester Institute of Technology Bachelor of Science (BS) 1991  – 1996 Rochester Institute of Technology Bachelor of Science (BS) 1991  – 1996 ", "Experience Senior Simulation Engineer Intel Corporation June 2014  – Present (1 year 3 months) Adjunct Lecturer Ben Gurion University of the Negev October 2013  – Present (1 year 11 months) Beer Sheva Managing Partner Apparent Software January 2009  – Present (6 years 8 months) Senior Strategic Capacity Analyst Intel Corporation December 2013  –  June 2014  (7 months) Israel Senior Strategic Capacity Analyst Micron Technology December 2012  –  November 2013  (1 year) Israel Industrial Engineering Expert Micron Technology November 2011  –  December 2012  (1 year 2 months) Industrial Engineering Team Leader Micron Technology January 2011  –  November 2011  (11 months) Fab12, Kiryat-Gat, Israel Senior Industrial Engineer Micron Technology May 2010  –  December 2010  (8 months) Project Manager & Industrial Engineer Numonyx April 2008  –  May 2010  (2 years 2 months) Project Manager Intel January 2007  –  March 2008  (1 year 3 months) Industrial Engineer Intel July 2004  –  March 2008  (3 years 9 months) Teaching Assistant Ben Gurion University February 2003  –  June 2004  (1 year 5 months) Psychometric Instructor Kidum Psychometric January 2003  –  April 2004  (1 year 4 months) Product Manager & Software Developer Zindell Technologies January 2001  –  June 2003  (2 years 6 months) Instructor Sivan Computers October 2002  –  May 2003  (8 months) Senior Simulation Engineer Intel Corporation June 2014  – Present (1 year 3 months) Senior Simulation Engineer Intel Corporation June 2014  – Present (1 year 3 months) Adjunct Lecturer Ben Gurion University of the Negev October 2013  – Present (1 year 11 months) Beer Sheva Adjunct Lecturer Ben Gurion University of the Negev October 2013  – Present (1 year 11 months) Beer Sheva Managing Partner Apparent Software January 2009  – Present (6 years 8 months) Managing Partner Apparent Software January 2009  – Present (6 years 8 months) Senior Strategic Capacity Analyst Intel Corporation December 2013  –  June 2014  (7 months) Israel Senior Strategic Capacity Analyst Intel Corporation December 2013  –  June 2014  (7 months) Israel Senior Strategic Capacity Analyst Micron Technology December 2012  –  November 2013  (1 year) Israel Senior Strategic Capacity Analyst Micron Technology December 2012  –  November 2013  (1 year) Israel Industrial Engineering Expert Micron Technology November 2011  –  December 2012  (1 year 2 months) Industrial Engineering Expert Micron Technology November 2011  –  December 2012  (1 year 2 months) Industrial Engineering Team Leader Micron Technology January 2011  –  November 2011  (11 months) Fab12, Kiryat-Gat, Israel Industrial Engineering Team Leader Micron Technology January 2011  –  November 2011  (11 months) Fab12, Kiryat-Gat, Israel Senior Industrial Engineer Micron Technology May 2010  –  December 2010  (8 months) Senior Industrial Engineer Micron Technology May 2010  –  December 2010  (8 months) Project Manager & Industrial Engineer Numonyx April 2008  –  May 2010  (2 years 2 months) Project Manager & Industrial Engineer Numonyx April 2008  –  May 2010  (2 years 2 months) Project Manager Intel January 2007  –  March 2008  (1 year 3 months) Project Manager Intel January 2007  –  March 2008  (1 year 3 months) Industrial Engineer Intel July 2004  –  March 2008  (3 years 9 months) Industrial Engineer Intel July 2004  –  March 2008  (3 years 9 months) Teaching Assistant Ben Gurion University February 2003  –  June 2004  (1 year 5 months) Teaching Assistant Ben Gurion University February 2003  –  June 2004  (1 year 5 months) Psychometric Instructor Kidum Psychometric January 2003  –  April 2004  (1 year 4 months) Psychometric Instructor Kidum Psychometric January 2003  –  April 2004  (1 year 4 months) Product Manager & Software Developer Zindell Technologies January 2001  –  June 2003  (2 years 6 months) Product Manager & Software Developer Zindell Technologies January 2001  –  June 2003  (2 years 6 months) Instructor Sivan Computers October 2002  –  May 2003  (8 months) Instructor Sivan Computers October 2002  –  May 2003  (8 months) Languages English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Capacity Planning Industrial Engineering Product Management Optimization Lean Manufacturing Data Mining Operations Research Simulation Theory of Constraints Analysis Production Planning Certified Project... Results Oriented Semiconductor... Data Analysis Process Improvement Team Leadership Software Project... Business Analysis Programming Cost Reduction Visual Basic Cross-functional Team... Testing Planning Manufacturing Management Agile Methodologies Scrum Semiconductors Project Planning Simulations Manufacturing... Optimizations Integration Automation Semiconductor Industry Software Engineering Object Oriented Design Software Design Strategy Business Process Manufacturing Engineering Management Project Management Engineering SPC See 31+     See less Skills  Capacity Planning Industrial Engineering Product Management Optimization Lean Manufacturing Data Mining Operations Research Simulation Theory of Constraints Analysis Production Planning Certified Project... Results Oriented Semiconductor... Data Analysis Process Improvement Team Leadership Software Project... Business Analysis Programming Cost Reduction Visual Basic Cross-functional Team... Testing Planning Manufacturing Management Agile Methodologies Scrum Semiconductors Project Planning Simulations Manufacturing... Optimizations Integration Automation Semiconductor Industry Software Engineering Object Oriented Design Software Design Strategy Business Process Manufacturing Engineering Management Project Management Engineering SPC See 31+     See less Capacity Planning Industrial Engineering Product Management Optimization Lean Manufacturing Data Mining Operations Research Simulation Theory of Constraints Analysis Production Planning Certified Project... Results Oriented Semiconductor... Data Analysis Process Improvement Team Leadership Software Project... Business Analysis Programming Cost Reduction Visual Basic Cross-functional Team... Testing Planning Manufacturing Management Agile Methodologies Scrum Semiconductors Project Planning Simulations Manufacturing... Optimizations Integration Automation Semiconductor Industry Software Engineering Object Oriented Design Software Design Strategy Business Process Manufacturing Engineering Management Project Management Engineering SPC See 31+     See less Capacity Planning Industrial Engineering Product Management Optimization Lean Manufacturing Data Mining Operations Research Simulation Theory of Constraints Analysis Production Planning Certified Project... Results Oriented Semiconductor... Data Analysis Process Improvement Team Leadership Software Project... Business Analysis Programming Cost Reduction Visual Basic Cross-functional Team... Testing Planning Manufacturing Management Agile Methodologies Scrum Semiconductors Project Planning Simulations Manufacturing... Optimizations Integration Automation Semiconductor Industry Software Engineering Object Oriented Design Software Design Strategy Business Process Manufacturing Engineering Management Project Management Engineering SPC See 31+     See less Education Project Management Institute PMP 2008  – 2008 Ben-Gurion University of the Negev M.Sc. 2003  – 2005 Universitat Ben Gurion Ba-Negev B.Sc. 2001  – 2004 Project Management Institute PMP 2008  – 2008 Project Management Institute PMP 2008  – 2008 Project Management Institute PMP 2008  – 2008 Ben-Gurion University of the Negev M.Sc. 2003  – 2005 Ben-Gurion University of the Negev M.Sc. 2003  – 2005 Ben-Gurion University of the Negev M.Sc. 2003  – 2005 Universitat Ben Gurion Ba-Negev B.Sc. 2001  – 2004 Universitat Ben Gurion Ba-Negev B.Sc. 2001  – 2004 Universitat Ben Gurion Ba-Negev B.Sc. 2001  – 2004 Honors & Awards ", "Summary I am a BI programmer with 3 years' experience in defining KPI's and success matrices, reports and dashboards building. \nDuring my work experience, I defined performance matrix, monitored performances, designed and built graphical dashboards and automated reports in MS BI tools. Summary I am a BI programmer with 3 years' experience in defining KPI's and success matrices, reports and dashboards building. \nDuring my work experience, I defined performance matrix, monitored performances, designed and built graphical dashboards and automated reports in MS BI tools. I am a BI programmer with 3 years' experience in defining KPI's and success matrices, reports and dashboards building. \nDuring my work experience, I defined performance matrix, monitored performances, designed and built graphical dashboards and automated reports in MS BI tools. I am a BI programmer with 3 years' experience in defining KPI's and success matrices, reports and dashboards building. \nDuring my work experience, I defined performance matrix, monitored performances, designed and built graphical dashboards and automated reports in MS BI tools. Experience BI Developer Trax Image Recognition March 2015  – Present (6 months) Tel Aviv Bi Developer zap group October 2014  – Present (11 months) BI Developer Vision.bi January 2014  –  October 2014  (10 months) ZAP Group, Petach Tikva, Israel BI developer Israeli Ministry of Justice February 2012  –  January 2014  (2 years) Ministry of justice (MOJ), Tel-Aviv The team is providing BI solutions in the MOJ, and provides solutions for over 40 different clients within the office. \nWe are working in DWH environment, using MS technology. \nIn my position, I am developing automatic reports and graphical dashboards for the various clients. \nThe development process includes building ETL processes (SSIS), writing complex SQL queries and stored procedures (SQL Server 2008 R2), program the report (SSRS), define user permissions, debug and modify per user's needs. Ph.D student Ben Gurion University February 2011  –  February 2012  (1 year 1 month) Analyzing performances of 3D models for fruit harvesting robot (Advisor: Prof. Yael Edan) Data analyst Intel Corporation August 2008  –  February 2011  (2 years 7 months) Kiryat Gat, Israel Defining quantitative indicators (KPI's) for an inter-disciplinary system in the clean room, analyze system's behavior through complex T-SQL queries and stored procedures and build reports using BO and SSRS per different customer needs. Simulation Engineer Intel Corporation August 2007  –  August 2008  (1 year 1 month) Kiryat Gat, Israel Build system simulation model based on hardware specifications and configuration and provide long-term recommendation to meet manufacturing needs. BI Developer Trax Image Recognition March 2015  – Present (6 months) Tel Aviv BI Developer Trax Image Recognition March 2015  – Present (6 months) Tel Aviv Bi Developer zap group October 2014  – Present (11 months) Bi Developer zap group October 2014  – Present (11 months) BI Developer Vision.bi January 2014  –  October 2014  (10 months) ZAP Group, Petach Tikva, Israel BI Developer Vision.bi January 2014  –  October 2014  (10 months) ZAP Group, Petach Tikva, Israel BI developer Israeli Ministry of Justice February 2012  –  January 2014  (2 years) Ministry of justice (MOJ), Tel-Aviv The team is providing BI solutions in the MOJ, and provides solutions for over 40 different clients within the office. \nWe are working in DWH environment, using MS technology. \nIn my position, I am developing automatic reports and graphical dashboards for the various clients. \nThe development process includes building ETL processes (SSIS), writing complex SQL queries and stored procedures (SQL Server 2008 R2), program the report (SSRS), define user permissions, debug and modify per user's needs. BI developer Israeli Ministry of Justice February 2012  –  January 2014  (2 years) Ministry of justice (MOJ), Tel-Aviv The team is providing BI solutions in the MOJ, and provides solutions for over 40 different clients within the office. \nWe are working in DWH environment, using MS technology. \nIn my position, I am developing automatic reports and graphical dashboards for the various clients. \nThe development process includes building ETL processes (SSIS), writing complex SQL queries and stored procedures (SQL Server 2008 R2), program the report (SSRS), define user permissions, debug and modify per user's needs. Ph.D student Ben Gurion University February 2011  –  February 2012  (1 year 1 month) Analyzing performances of 3D models for fruit harvesting robot (Advisor: Prof. Yael Edan) Ph.D student Ben Gurion University February 2011  –  February 2012  (1 year 1 month) Analyzing performances of 3D models for fruit harvesting robot (Advisor: Prof. Yael Edan) Data analyst Intel Corporation August 2008  –  February 2011  (2 years 7 months) Kiryat Gat, Israel Defining quantitative indicators (KPI's) for an inter-disciplinary system in the clean room, analyze system's behavior through complex T-SQL queries and stored procedures and build reports using BO and SSRS per different customer needs. Data analyst Intel Corporation August 2008  –  February 2011  (2 years 7 months) Kiryat Gat, Israel Defining quantitative indicators (KPI's) for an inter-disciplinary system in the clean room, analyze system's behavior through complex T-SQL queries and stored procedures and build reports using BO and SSRS per different customer needs. Simulation Engineer Intel Corporation August 2007  –  August 2008  (1 year 1 month) Kiryat Gat, Israel Build system simulation model based on hardware specifications and configuration and provide long-term recommendation to meet manufacturing needs. Simulation Engineer Intel Corporation August 2007  –  August 2008  (1 year 1 month) Kiryat Gat, Israel Build system simulation model based on hardware specifications and configuration and provide long-term recommendation to meet manufacturing needs. Languages Hebrew English Hebrew English Hebrew English Skills Algorithms KPI Dashboards KPI Reports Reports Analysis SQL SSRS SSIS DWH ETL Skills  Algorithms KPI Dashboards KPI Reports Reports Analysis SQL SSRS SSIS DWH ETL Algorithms KPI Dashboards KPI Reports Reports Analysis SQL SSRS SSIS DWH ETL Algorithms KPI Dashboards KPI Reports Reports Analysis SQL SSRS SSIS DWH ETL Education Universitat Ben Gurion Ba-Negev Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev / Ben Gurion University Master of Science (M.Sc.),  Industrial Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev / Ben Gurion University Master of Science (M.Sc.),  Industrial Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev / Ben Gurion University Master of Science (M.Sc.),  Industrial Engineering 2000  – 2007 Universitat Ben Gurion Ba-Negev / Ben Gurion University Master of Science (M.Sc.),  Industrial Engineering 2000  – 2007 Honors & Awards Best student paper IADIS Intelligent systems conference, Lisbon, Portugal. June 2007 Excellence in studies Industrial Engineering and Management, Ben-Gurion-University of the Negev. August 2007 Best student paper IADIS Intelligent systems conference, Lisbon, Portugal. June 2007 Best student paper IADIS Intelligent systems conference, Lisbon, Portugal. June 2007 Best student paper IADIS Intelligent systems conference, Lisbon, Portugal. June 2007 Excellence in studies Industrial Engineering and Management, Ben-Gurion-University of the Negev. August 2007 Excellence in studies Industrial Engineering and Management, Ben-Gurion-University of the Negev. August 2007 Excellence in studies Industrial Engineering and Management, Ben-Gurion-University of the Negev. August 2007 ", "Experience Simulation Engineer Intel Corporation Bangalore May 2010  – Present (5 years 4 months) To find Memory Errors in C/C++ Applications and Testing & Design of Parallel Processors Simulation Engineer Intel Corporation Bangalore May 2010  – Present (5 years 4 months) To find Memory Errors in C/C++ Applications and Testing & Design of Parallel Processors Simulation Engineer Intel Corporation Bangalore May 2010  – Present (5 years 4 months) To find Memory Errors in C/C++ Applications and Testing & Design of Parallel Processors Education St. Xavier's College MSc,  Economics 2009  – 2011 Activities and Societies:  MSc from St. Xavier's College Mumbai St. Xavier's College MSc,  Economics 2009  – 2011 Activities and Societies:  MSc from St. Xavier's College Mumbai St. Xavier's College MSc,  Economics 2009  – 2011 Activities and Societies:  MSc from St. Xavier's College Mumbai St. Xavier's College MSc,  Economics 2009  – 2011 Activities and Societies:  MSc from St. Xavier's College Mumbai ", "Summary I am a young aspiring software engineer with a passion for what I do. Ever since I can remember I have always been taking things apart to learn more about what makes them tick. Software development is no different for me. When faced with a project I treat it as a problem to be broken down and solved. Currently I am looking for a challenging project to really sink my teeth into. Summary I am a young aspiring software engineer with a passion for what I do. Ever since I can remember I have always been taking things apart to learn more about what makes them tick. Software development is no different for me. When faced with a project I treat it as a problem to be broken down and solved. Currently I am looking for a challenging project to really sink my teeth into. I am a young aspiring software engineer with a passion for what I do. Ever since I can remember I have always been taking things apart to learn more about what makes them tick. Software development is no different for me. When faced with a project I treat it as a problem to be broken down and solved. Currently I am looking for a challenging project to really sink my teeth into. I am a young aspiring software engineer with a passion for what I do. Ever since I can remember I have always been taking things apart to learn more about what makes them tick. Software development is no different for me. When faced with a project I treat it as a problem to be broken down and solved. Currently I am looking for a challenging project to really sink my teeth into. Experience Production Developer Toolwire November 2014  – Present (10 months) Pleasanton, CA Contractor Graphics Simulation Engineer Intel Corporation July 2013  –  January 2014  (7 months) Sacramento, California Area Contracted for 7 months \n \nResponsibilities \n•\tDebug & augment graphics simulation software in C++ \n•\tManage test repository Production Developer Toolwire November 2014  – Present (10 months) Pleasanton, CA Contractor Production Developer Toolwire November 2014  – Present (10 months) Pleasanton, CA Contractor Graphics Simulation Engineer Intel Corporation July 2013  –  January 2014  (7 months) Sacramento, California Area Contracted for 7 months \n \nResponsibilities \n•\tDebug & augment graphics simulation software in C++ \n•\tManage test repository Graphics Simulation Engineer Intel Corporation July 2013  –  January 2014  (7 months) Sacramento, California Area Contracted for 7 months \n \nResponsibilities \n•\tDebug & augment graphics simulation software in C++ \n•\tManage test repository Skills C++ Java Programming C Eclipse MySQL C# Visual Studio OOP JavaScript DirectX Microsoft Office Integration Software Engineering Microsoft Excel Game Development Customer Service See 2+     See less Skills  C++ Java Programming C Eclipse MySQL C# Visual Studio OOP JavaScript DirectX Microsoft Office Integration Software Engineering Microsoft Excel Game Development Customer Service See 2+     See less C++ Java Programming C Eclipse MySQL C# Visual Studio OOP JavaScript DirectX Microsoft Office Integration Software Engineering Microsoft Excel Game Development Customer Service See 2+     See less C++ Java Programming C Eclipse MySQL C# Visual Studio OOP JavaScript DirectX Microsoft Office Integration Software Engineering Microsoft Excel Game Development Customer Service See 2+     See less Education DeVry University-California Bachelor's Degree,  Game Simulation Programming 2010  – 2013 Graduated Cum Laude \n \nProgram focused on the development of video games written in C++ using the latest versions of Visual Studio, DirectX, and FMOD. We also branched out to other languages and development environments such as Java, C#, Eclipse, and Unity3D.  \n \nAwarded Dean's List for the following semesters: \n-- Summer 2010, Fall 2010, Spring 2011, & Fall 2011 \n \nFavorite Courses: \n-- Artificial Intelligence for Games and Simulations with Lab - Studying and developing A.I. techniques \n-- Data Structures with Lab - Developing data structures from scratch \n-- Game Engine Design and Integration with Lab - Building core game engines from the ground up \n \nCourse Projects: \n \n-- Senior Project: The Darkest Night \n* Helped design core game concept \n* Developed procedurally generated game world \n* Utilized the LEAP Motion prototype input device \n* Project was awarded the \"Most Marketable\" award at the School Tech Fair Activities and Societies:  President of Game Developer's Guild for 1 year DeVry University-California Bachelor's Degree,  Game Simulation Programming 2010  – 2013 Graduated Cum Laude \n \nProgram focused on the development of video games written in C++ using the latest versions of Visual Studio, DirectX, and FMOD. We also branched out to other languages and development environments such as Java, C#, Eclipse, and Unity3D.  \n \nAwarded Dean's List for the following semesters: \n-- Summer 2010, Fall 2010, Spring 2011, & Fall 2011 \n \nFavorite Courses: \n-- Artificial Intelligence for Games and Simulations with Lab - Studying and developing A.I. techniques \n-- Data Structures with Lab - Developing data structures from scratch \n-- Game Engine Design and Integration with Lab - Building core game engines from the ground up \n \nCourse Projects: \n \n-- Senior Project: The Darkest Night \n* Helped design core game concept \n* Developed procedurally generated game world \n* Utilized the LEAP Motion prototype input device \n* Project was awarded the \"Most Marketable\" award at the School Tech Fair Activities and Societies:  President of Game Developer's Guild for 1 year DeVry University-California Bachelor's Degree,  Game Simulation Programming 2010  – 2013 Graduated Cum Laude \n \nProgram focused on the development of video games written in C++ using the latest versions of Visual Studio, DirectX, and FMOD. We also branched out to other languages and development environments such as Java, C#, Eclipse, and Unity3D.  \n \nAwarded Dean's List for the following semesters: \n-- Summer 2010, Fall 2010, Spring 2011, & Fall 2011 \n \nFavorite Courses: \n-- Artificial Intelligence for Games and Simulations with Lab - Studying and developing A.I. techniques \n-- Data Structures with Lab - Developing data structures from scratch \n-- Game Engine Design and Integration with Lab - Building core game engines from the ground up \n \nCourse Projects: \n \n-- Senior Project: The Darkest Night \n* Helped design core game concept \n* Developed procedurally generated game world \n* Utilized the LEAP Motion prototype input device \n* Project was awarded the \"Most Marketable\" award at the School Tech Fair Activities and Societies:  President of Game Developer's Guild for 1 year DeVry University-California Bachelor's Degree,  Game Simulation Programming 2010  – 2013 Graduated Cum Laude \n \nProgram focused on the development of video games written in C++ using the latest versions of Visual Studio, DirectX, and FMOD. We also branched out to other languages and development environments such as Java, C#, Eclipse, and Unity3D.  \n \nAwarded Dean's List for the following semesters: \n-- Summer 2010, Fall 2010, Spring 2011, & Fall 2011 \n \nFavorite Courses: \n-- Artificial Intelligence for Games and Simulations with Lab - Studying and developing A.I. techniques \n-- Data Structures with Lab - Developing data structures from scratch \n-- Game Engine Design and Integration with Lab - Building core game engines from the ground up \n \nCourse Projects: \n \n-- Senior Project: The Darkest Night \n* Helped design core game concept \n* Developed procedurally generated game world \n* Utilized the LEAP Motion prototype input device \n* Project was awarded the \"Most Marketable\" award at the School Tech Fair Activities and Societies:  President of Game Developer's Guild for 1 year ", "Summary . Summary . . . Experience PhD student Ecole Polytechnique Fédérale de Lausanne (EPFL) September 2014  – Present (1 year) Senior Perl/Lua Developer IPONWEB December 2013  –  August 2014  (9 months) Software Simulation Engineer Intel Corporation June 2010  –  November 2013  (3 years 6 months) Power and circuit area estimations and projections for the microprocessor of the new state-of-the-art architecture, software performance simulator development, microprocessor critical path studies, \nproject manager assistance PhD student Ecole Polytechnique Fédérale de Lausanne (EPFL) September 2014  – Present (1 year) PhD student Ecole Polytechnique Fédérale de Lausanne (EPFL) September 2014  – Present (1 year) Senior Perl/Lua Developer IPONWEB December 2013  –  August 2014  (9 months) Senior Perl/Lua Developer IPONWEB December 2013  –  August 2014  (9 months) Software Simulation Engineer Intel Corporation June 2010  –  November 2013  (3 years 6 months) Power and circuit area estimations and projections for the microprocessor of the new state-of-the-art architecture, software performance simulator development, microprocessor critical path studies, \nproject manager assistance Software Simulation Engineer Intel Corporation June 2010  –  November 2013  (3 years 6 months) Power and circuit area estimations and projections for the microprocessor of the new state-of-the-art architecture, software performance simulator development, microprocessor critical path studies, \nproject manager assistance Languages Русский Native or bilingual proficiency English Professional working proficiency Deutsch Limited working proficiency Francaise Elementary proficiency Espanol Elementary proficiency Русский Native or bilingual proficiency English Professional working proficiency Deutsch Limited working proficiency Francaise Elementary proficiency Espanol Elementary proficiency Русский Native or bilingual proficiency English Professional working proficiency Deutsch Limited working proficiency Francaise Elementary proficiency Espanol Elementary proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Elementary proficiency Elementary proficiency Skills Power Management Architecture Microprocessors Computer Science Simulation Software Database Design Agile Methodolgy Perl C++ Language Critical Path Analysis Skills  Power Management Architecture Microprocessors Computer Science Simulation Software Database Design Agile Methodolgy Perl C++ Language Critical Path Analysis Power Management Architecture Microprocessors Computer Science Simulation Software Database Design Agile Methodolgy Perl C++ Language Critical Path Analysis Power Management Architecture Microprocessors Computer Science Simulation Software Database Design Agile Methodolgy Perl C++ Language Critical Path Analysis Education MIPT, Moscow Master's degree,  Microprocessors technology 2012  – 2014 MIPT, Moscow Bachelor of Applied Science (BASc),  Microprocessors technology , 4.9 (5) 2008  – 2012 MIPT, Moscow Master's degree,  Microprocessors technology 2012  – 2014 MIPT, Moscow Master's degree,  Microprocessors technology 2012  – 2014 MIPT, Moscow Master's degree,  Microprocessors technology 2012  – 2014 MIPT, Moscow Bachelor of Applied Science (BASc),  Microprocessors technology , 4.9 (5) 2008  – 2012 MIPT, Moscow Bachelor of Applied Science (BASc),  Microprocessors technology , 4.9 (5) 2008  – 2012 MIPT, Moscow Bachelor of Applied Science (BASc),  Microprocessors technology , 4.9 (5) 2008  – 2012 Honors & Awards Spontaneous recognition award Intel June 2011 Spontaneous recognition award for the excellent contribution to microarchitecture and simulation review Winner of Intel Academics Relations Program Intel September 2010 Abramov and Frolov scholarship MIPT January 2009 Abramov and Frolov scholarship 2009-2011 Heightened scholarship of the government of Russia MIPT December 2011 Heightened scholarship of the government of Russia 2011-2012 Spontaneous recognition award Intel June 2011 Spontaneous recognition award for the excellent contribution to microarchitecture and simulation review Spontaneous recognition award Intel June 2011 Spontaneous recognition award for the excellent contribution to microarchitecture and simulation review Spontaneous recognition award Intel June 2011 Spontaneous recognition award for the excellent contribution to microarchitecture and simulation review Winner of Intel Academics Relations Program Intel September 2010 Winner of Intel Academics Relations Program Intel September 2010 Winner of Intel Academics Relations Program Intel September 2010 Abramov and Frolov scholarship MIPT January 2009 Abramov and Frolov scholarship 2009-2011 Abramov and Frolov scholarship MIPT January 2009 Abramov and Frolov scholarship 2009-2011 Abramov and Frolov scholarship MIPT January 2009 Abramov and Frolov scholarship 2009-2011 Heightened scholarship of the government of Russia MIPT December 2011 Heightened scholarship of the government of Russia 2011-2012 Heightened scholarship of the government of Russia MIPT December 2011 Heightened scholarship of the government of Russia 2011-2012 Heightened scholarship of the government of Russia MIPT December 2011 Heightened scholarship of the government of Russia 2011-2012 ", "Experience Operations Research Engineer Intel Corporation January 2006  – Present (9 years 8 months) Portland, Oregon Area Operations Research engineer specializing in optimization modeling. Responsible for applying operations research techniques on a wide variety of problems with focus on capacity, factory output, sequencing and scheduling strategies. Operations Research Engineer Intel Corporation January 2006  – Present (9 years 8 months) Portland, Oregon Area Operations Research engineer specializing in optimization modeling. Responsible for applying operations research techniques on a wide variety of problems with focus on capacity, factory output, sequencing and scheduling strategies. Operations Research Engineer Intel Corporation January 2006  – Present (9 years 8 months) Portland, Oregon Area Operations Research engineer specializing in optimization modeling. Responsible for applying operations research techniques on a wide variety of problems with focus on capacity, factory output, sequencing and scheduling strategies. Skills Algorithms Industrial Engineering Simulations C++ Semiconductors Engineering Optimization Matlab Python Operations Research Machine Learning Mathematical Modeling Cross-functional Team... Process Engineering Six Sigma Program Management Testing See 2+     See less Skills  Algorithms Industrial Engineering Simulations C++ Semiconductors Engineering Optimization Matlab Python Operations Research Machine Learning Mathematical Modeling Cross-functional Team... Process Engineering Six Sigma Program Management Testing See 2+     See less Algorithms Industrial Engineering Simulations C++ Semiconductors Engineering Optimization Matlab Python Operations Research Machine Learning Mathematical Modeling Cross-functional Team... Process Engineering Six Sigma Program Management Testing See 2+     See less Algorithms Industrial Engineering Simulations C++ Semiconductors Engineering Optimization Matlab Python Operations Research Machine Learning Mathematical Modeling Cross-functional Team... Process Engineering Six Sigma Program Management Testing See 2+     See less Education Penn State University Masters in Industrial Engineering,  Operations Research 2002  – 2005 PSG College of Technology B.E,  Mechanical Engineering 1996  – 2002 Penn State University Masters in Industrial Engineering,  Operations Research 2002  – 2005 Penn State University Masters in Industrial Engineering,  Operations Research 2002  – 2005 Penn State University Masters in Industrial Engineering,  Operations Research 2002  – 2005 PSG College of Technology B.E,  Mechanical Engineering 1996  – 2002 PSG College of Technology B.E,  Mechanical Engineering 1996  – 2002 PSG College of Technology B.E,  Mechanical Engineering 1996  – 2002 ", "Experience Performance Simulation Engineer Intel Corporation Performance Simulation Engineer Intel Corporation Performance Simulation Engineer Intel Corporation Skills SoC Semiconductors ASIC Debugging Skills  SoC Semiconductors ASIC Debugging SoC Semiconductors ASIC Debugging SoC Semiconductors ASIC Debugging ", "Experience Micro-Architecture Simulation Engineer Intel Corporation November 2013  – Present (1 year 10 months) Modeling a new micro-architectural design in SystemC for timing and power estimations. Software Engineer Intel Corporation February 2002  –  October 2013  (11 years 9 months) Haifa CAD Software Engineer \nSchematic logic abstraction tool:  \nA tool taking transistor level schematic model and extracting its logical representation: identifies bit-level combinational & sequential logic, and word level logic and register file logic. \n \nFormal Verification; including:  \nFormal equivalence verification between RTL and schematics. \nFormal methods for analog design. Android Applications Development - September 2012  –  April 2013  (8 months) Developed my first android application during weekends. You can find it in android play with the name: \"Kids Brain Trainer\" Micro-Architecture Simulation Engineer Intel Corporation November 2013  – Present (1 year 10 months) Modeling a new micro-architectural design in SystemC for timing and power estimations. Micro-Architecture Simulation Engineer Intel Corporation November 2013  – Present (1 year 10 months) Modeling a new micro-architectural design in SystemC for timing and power estimations. Software Engineer Intel Corporation February 2002  –  October 2013  (11 years 9 months) Haifa CAD Software Engineer \nSchematic logic abstraction tool:  \nA tool taking transistor level schematic model and extracting its logical representation: identifies bit-level combinational & sequential logic, and word level logic and register file logic. \n \nFormal Verification; including:  \nFormal equivalence verification between RTL and schematics. \nFormal methods for analog design. Software Engineer Intel Corporation February 2002  –  October 2013  (11 years 9 months) Haifa CAD Software Engineer \nSchematic logic abstraction tool:  \nA tool taking transistor level schematic model and extracting its logical representation: identifies bit-level combinational & sequential logic, and word level logic and register file logic. \n \nFormal Verification; including:  \nFormal equivalence verification between RTL and schematics. \nFormal methods for analog design. Android Applications Development - September 2012  –  April 2013  (8 months) Developed my first android application during weekends. You can find it in android play with the name: \"Kids Brain Trainer\" Android Applications Development - September 2012  –  April 2013  (8 months) Developed my first android application during weekends. You can find it in android play with the name: \"Kids Brain Trainer\" Languages Arabic English Hebrew Arabic English Hebrew Arabic English Hebrew Skills Multithreading Algorithms Debugging Object Oriented Design Processors OOP Software Design Software Engineering Linux Kernel C++ C Software Development Distributed Systems Linux Java Image Processing Perl Embedded Systems System Architecture Computer Architecture Operating Systems Java Web Server PHP Formal Verification Operating System... Shell Scripting TCL Verilog Design Patterns SoC X86 Functional Verification STL VLSI Computer Science See 20+     See less Skills  Multithreading Algorithms Debugging Object Oriented Design Processors OOP Software Design Software Engineering Linux Kernel C++ C Software Development Distributed Systems Linux Java Image Processing Perl Embedded Systems System Architecture Computer Architecture Operating Systems Java Web Server PHP Formal Verification Operating System... Shell Scripting TCL Verilog Design Patterns SoC X86 Functional Verification STL VLSI Computer Science See 20+     See less Multithreading Algorithms Debugging Object Oriented Design Processors OOP Software Design Software Engineering Linux Kernel C++ C Software Development Distributed Systems Linux Java Image Processing Perl Embedded Systems System Architecture Computer Architecture Operating Systems Java Web Server PHP Formal Verification Operating System... Shell Scripting TCL Verilog Design Patterns SoC X86 Functional Verification STL VLSI Computer Science See 20+     See less Multithreading Algorithms Debugging Object Oriented Design Processors OOP Software Design Software Engineering Linux Kernel C++ C Software Development Distributed Systems Linux Java Image Processing Perl Embedded Systems System Architecture Computer Architecture Operating Systems Java Web Server PHP Formal Verification Operating System... Shell Scripting TCL Verilog Design Patterns SoC X86 Functional Verification STL VLSI Computer Science See 20+     See less Education Technion - Israel Institute of Technology Bachelor of Science (BSc),  Computer Science , 88 1999  – 2003 Currently doing my second degree at the electrical engineering faculty of the Technion Technion - Israel Institute of Technology Master's degree,  Systems Engineering 2010 Technion - Israel Institute of Technology Bachelor of Science (BSc),  Computer Science , 88 1999  – 2003 Currently doing my second degree at the electrical engineering faculty of the Technion Technion - Israel Institute of Technology Bachelor of Science (BSc),  Computer Science , 88 1999  – 2003 Currently doing my second degree at the electrical engineering faculty of the Technion Technion - Israel Institute of Technology Bachelor of Science (BSc),  Computer Science , 88 1999  – 2003 Currently doing my second degree at the electrical engineering faculty of the Technion Technion - Israel Institute of Technology Master's degree,  Systems Engineering 2010 Technion - Israel Institute of Technology Master's degree,  Systems Engineering 2010 Technion - Israel Institute of Technology Master's degree,  Systems Engineering 2010 ", "Summary \tArchitect that has developed new debug and monitoring architectures for both mobile, desktop and server segments while also leveraging industry standards.  \n\tOver 20 years’ experience in architecture, design, validation and post-silicon debug of silicon ranging from basic chipsets, to complex SoC's.  \n\tHands on in all aspects of the development flow from early architecture, through rtl and physical design, to post-silicon bring up and qualification.  \n\tExperience as both a technical contributor and people manager.  \n\tExperience in architecting and driving prototypes through large scale initiatives both technically and operationally in the areas of design automation, debug architecture, validation automation, debug tools and debug automation.  \n\tConsistent track record of internal publications, industry events, cross-collaboration with external vendors and companies. Summary \tArchitect that has developed new debug and monitoring architectures for both mobile, desktop and server segments while also leveraging industry standards.  \n\tOver 20 years’ experience in architecture, design, validation and post-silicon debug of silicon ranging from basic chipsets, to complex SoC's.  \n\tHands on in all aspects of the development flow from early architecture, through rtl and physical design, to post-silicon bring up and qualification.  \n\tExperience as both a technical contributor and people manager.  \n\tExperience in architecting and driving prototypes through large scale initiatives both technically and operationally in the areas of design automation, debug architecture, validation automation, debug tools and debug automation.  \n\tConsistent track record of internal publications, industry events, cross-collaboration with external vendors and companies. \tArchitect that has developed new debug and monitoring architectures for both mobile, desktop and server segments while also leveraging industry standards.  \n\tOver 20 years’ experience in architecture, design, validation and post-silicon debug of silicon ranging from basic chipsets, to complex SoC's.  \n\tHands on in all aspects of the development flow from early architecture, through rtl and physical design, to post-silicon bring up and qualification.  \n\tExperience as both a technical contributor and people manager.  \n\tExperience in architecting and driving prototypes through large scale initiatives both technically and operationally in the areas of design automation, debug architecture, validation automation, debug tools and debug automation.  \n\tConsistent track record of internal publications, industry events, cross-collaboration with external vendors and companies. \tArchitect that has developed new debug and monitoring architectures for both mobile, desktop and server segments while also leveraging industry standards.  \n\tOver 20 years’ experience in architecture, design, validation and post-silicon debug of silicon ranging from basic chipsets, to complex SoC's.  \n\tHands on in all aspects of the development flow from early architecture, through rtl and physical design, to post-silicon bring up and qualification.  \n\tExperience as both a technical contributor and people manager.  \n\tExperience in architecting and driving prototypes through large scale initiatives both technically and operationally in the areas of design automation, debug architecture, validation automation, debug tools and debug automation.  \n\tConsistent track record of internal publications, industry events, cross-collaboration with external vendors and companies. Experience Principal Engineer - Lead Server Debug Architect Qualcomm November 2013  – Present (1 year 10 months) Raleigh, NC - Debug Architect for server processors. This included industry standard as well as custom solutions that were needed for larger scale designs. Worked on all aspects of the design phase including architecture and specification, clock specification, design, integration, timing closure, post-silicon tools, and silicon bringup. Debug Architecture Lead (Principal Engineer) Intel Corporation January 2011  –  November 2013  (2 years 11 months) Hillsboro, OR Lead architect and development lead on the central debug architecture for SoC's that supports observation of HW, SW, code flow, performance, and power monitoring. Team provided both the HW architecture, portions of the design, validation as well as much of the software infrastructure that gets distributed to internal teams and external tool vendors. Architecture is being used across phones to server designs.  \n \nLed the cross-Intel Debug Tools working group that set the direction for which tools should be developed and used across the post-silicon validation and debug teams. SoC Enabling Group - Hardware Debug Architecture (Principal Engineer) Intel Corporation August 2007  –  January 2011  (3 years 6 months) Hillsboro, OR Lead architect that drove architecture and standards across SoC development teams around hardware debug and trace. This involved converging multiple disparate implementations into one fabric and set of IP blocks to be used across all of the designs.  \n \nPrototyped and deployed automated methods for hardware debug insertion for IP's. Obtained funding and support from global DA team to scale across hundreds of IP's and all SoC projects. \n \nDeveloped a post-silicon tool flow that was automated based on the design insertion tools that were built. Tools could be done in a matter of weeks (versus many quarters) with massive improvements in quality.  \n \nLed the team that supported debug tools and power-on's for multiple SoC's. Personal hands on experience for many of these projects.  \n \nLed team to develop a debug automation prototype that was used later on to quickly test out features at power on. Still technical advisor for this program today.  \nProvided hands on debug and support to product teams for multiple products. Validation Architect (Principal Engineer) Intel Corporation April 2006  –  August 2007  (1 year 5 months) Chandler, AZ Built validation architecture team to develop new debug methodologies as we integrated chipset designs into the mainstream cores.  \n \nDebugged multiple chipset designs used in Pentium and Core based designs.  \n \nPrototyped methodology for debugging post-silicon traces in pre-silicon environments in a device with multiple independent clock domains. Validation Architect Intel Corporation 2001  –  2006  (5 years) Chandler, AZ Architected and co-developed the hardware debug tools and methodologies around chipset debug.  \n \nDesigned performance monitoring logic block in VHDL that was used in multiple chipset designs. Patents granted on this block.  \n \nKey debugger for PCI Express bring up and debug during early phases of the specification. Worked with external graphics chip teams to create the first PCI Express designs in the industry.  \n \nPioneered and deployed post-silicon coverage flows using on-die observation and monitoring techniques. Validation Architect Intel Corporation 1999  –  2001  (2 years) Folsom, CA Created a new role in the team of validation architect responsible for defining debug features, validation methodologies, and debug methodologies for the post-silicon teams.  \n \nDeveloped new validation methodology around producer-consumer testing (which was a generic way to test out the system fabrics for coherency). \n \nDebugged various issues in lab and in simulations. System Level Simulation Engineer Intel Corporation 1996  –  1999  (3 years) Folsom, CA Wrote tests, built models, and debugged in a pre-silicon system level simulation environment on a North Bridge device. \n \nBuilt functional models, trackers and checkers for an internal chip to chip interconnect. \n \nLed the system level simulation team that was responsible for validating the south bridge device.  \nSupported the post-silicon validation team in low level hardware debug in the lab. Technical Marketing Engineer Intel Corporation February 1994  –  1996  (2 years) Folsom, CA Chipset Debug Applications Engineer. Supported the field on design wins. Principal Engineer - Lead Server Debug Architect Qualcomm November 2013  – Present (1 year 10 months) Raleigh, NC - Debug Architect for server processors. This included industry standard as well as custom solutions that were needed for larger scale designs. Worked on all aspects of the design phase including architecture and specification, clock specification, design, integration, timing closure, post-silicon tools, and silicon bringup. Principal Engineer - Lead Server Debug Architect Qualcomm November 2013  – Present (1 year 10 months) Raleigh, NC - Debug Architect for server processors. This included industry standard as well as custom solutions that were needed for larger scale designs. Worked on all aspects of the design phase including architecture and specification, clock specification, design, integration, timing closure, post-silicon tools, and silicon bringup. Debug Architecture Lead (Principal Engineer) Intel Corporation January 2011  –  November 2013  (2 years 11 months) Hillsboro, OR Lead architect and development lead on the central debug architecture for SoC's that supports observation of HW, SW, code flow, performance, and power monitoring. Team provided both the HW architecture, portions of the design, validation as well as much of the software infrastructure that gets distributed to internal teams and external tool vendors. Architecture is being used across phones to server designs.  \n \nLed the cross-Intel Debug Tools working group that set the direction for which tools should be developed and used across the post-silicon validation and debug teams. Debug Architecture Lead (Principal Engineer) Intel Corporation January 2011  –  November 2013  (2 years 11 months) Hillsboro, OR Lead architect and development lead on the central debug architecture for SoC's that supports observation of HW, SW, code flow, performance, and power monitoring. Team provided both the HW architecture, portions of the design, validation as well as much of the software infrastructure that gets distributed to internal teams and external tool vendors. Architecture is being used across phones to server designs.  \n \nLed the cross-Intel Debug Tools working group that set the direction for which tools should be developed and used across the post-silicon validation and debug teams. SoC Enabling Group - Hardware Debug Architecture (Principal Engineer) Intel Corporation August 2007  –  January 2011  (3 years 6 months) Hillsboro, OR Lead architect that drove architecture and standards across SoC development teams around hardware debug and trace. This involved converging multiple disparate implementations into one fabric and set of IP blocks to be used across all of the designs.  \n \nPrototyped and deployed automated methods for hardware debug insertion for IP's. Obtained funding and support from global DA team to scale across hundreds of IP's and all SoC projects. \n \nDeveloped a post-silicon tool flow that was automated based on the design insertion tools that were built. Tools could be done in a matter of weeks (versus many quarters) with massive improvements in quality.  \n \nLed the team that supported debug tools and power-on's for multiple SoC's. Personal hands on experience for many of these projects.  \n \nLed team to develop a debug automation prototype that was used later on to quickly test out features at power on. Still technical advisor for this program today.  \nProvided hands on debug and support to product teams for multiple products. SoC Enabling Group - Hardware Debug Architecture (Principal Engineer) Intel Corporation August 2007  –  January 2011  (3 years 6 months) Hillsboro, OR Lead architect that drove architecture and standards across SoC development teams around hardware debug and trace. This involved converging multiple disparate implementations into one fabric and set of IP blocks to be used across all of the designs.  \n \nPrototyped and deployed automated methods for hardware debug insertion for IP's. Obtained funding and support from global DA team to scale across hundreds of IP's and all SoC projects. \n \nDeveloped a post-silicon tool flow that was automated based on the design insertion tools that were built. Tools could be done in a matter of weeks (versus many quarters) with massive improvements in quality.  \n \nLed the team that supported debug tools and power-on's for multiple SoC's. Personal hands on experience for many of these projects.  \n \nLed team to develop a debug automation prototype that was used later on to quickly test out features at power on. Still technical advisor for this program today.  \nProvided hands on debug and support to product teams for multiple products. Validation Architect (Principal Engineer) Intel Corporation April 2006  –  August 2007  (1 year 5 months) Chandler, AZ Built validation architecture team to develop new debug methodologies as we integrated chipset designs into the mainstream cores.  \n \nDebugged multiple chipset designs used in Pentium and Core based designs.  \n \nPrototyped methodology for debugging post-silicon traces in pre-silicon environments in a device with multiple independent clock domains. Validation Architect (Principal Engineer) Intel Corporation April 2006  –  August 2007  (1 year 5 months) Chandler, AZ Built validation architecture team to develop new debug methodologies as we integrated chipset designs into the mainstream cores.  \n \nDebugged multiple chipset designs used in Pentium and Core based designs.  \n \nPrototyped methodology for debugging post-silicon traces in pre-silicon environments in a device with multiple independent clock domains. Validation Architect Intel Corporation 2001  –  2006  (5 years) Chandler, AZ Architected and co-developed the hardware debug tools and methodologies around chipset debug.  \n \nDesigned performance monitoring logic block in VHDL that was used in multiple chipset designs. Patents granted on this block.  \n \nKey debugger for PCI Express bring up and debug during early phases of the specification. Worked with external graphics chip teams to create the first PCI Express designs in the industry.  \n \nPioneered and deployed post-silicon coverage flows using on-die observation and monitoring techniques. Validation Architect Intel Corporation 2001  –  2006  (5 years) Chandler, AZ Architected and co-developed the hardware debug tools and methodologies around chipset debug.  \n \nDesigned performance monitoring logic block in VHDL that was used in multiple chipset designs. Patents granted on this block.  \n \nKey debugger for PCI Express bring up and debug during early phases of the specification. Worked with external graphics chip teams to create the first PCI Express designs in the industry.  \n \nPioneered and deployed post-silicon coverage flows using on-die observation and monitoring techniques. Validation Architect Intel Corporation 1999  –  2001  (2 years) Folsom, CA Created a new role in the team of validation architect responsible for defining debug features, validation methodologies, and debug methodologies for the post-silicon teams.  \n \nDeveloped new validation methodology around producer-consumer testing (which was a generic way to test out the system fabrics for coherency). \n \nDebugged various issues in lab and in simulations. Validation Architect Intel Corporation 1999  –  2001  (2 years) Folsom, CA Created a new role in the team of validation architect responsible for defining debug features, validation methodologies, and debug methodologies for the post-silicon teams.  \n \nDeveloped new validation methodology around producer-consumer testing (which was a generic way to test out the system fabrics for coherency). \n \nDebugged various issues in lab and in simulations. System Level Simulation Engineer Intel Corporation 1996  –  1999  (3 years) Folsom, CA Wrote tests, built models, and debugged in a pre-silicon system level simulation environment on a North Bridge device. \n \nBuilt functional models, trackers and checkers for an internal chip to chip interconnect. \n \nLed the system level simulation team that was responsible for validating the south bridge device.  \nSupported the post-silicon validation team in low level hardware debug in the lab. System Level Simulation Engineer Intel Corporation 1996  –  1999  (3 years) Folsom, CA Wrote tests, built models, and debugged in a pre-silicon system level simulation environment on a North Bridge device. \n \nBuilt functional models, trackers and checkers for an internal chip to chip interconnect. \n \nLed the system level simulation team that was responsible for validating the south bridge device.  \nSupported the post-silicon validation team in low level hardware debug in the lab. Technical Marketing Engineer Intel Corporation February 1994  –  1996  (2 years) Folsom, CA Chipset Debug Applications Engineer. Supported the field on design wins. Technical Marketing Engineer Intel Corporation February 1994  –  1996  (2 years) Folsom, CA Chipset Debug Applications Engineer. Supported the field on design wins. Skills Computer Architecture Computer Hardware Debugging Debuggers System Verification Verilog SoC Team Leadership Project Management Technical Writing Testing Test Automation Silicon Performance Measurement Performance Analysis Hardware Testing Silicon Validation RTL design RTL Development Solution Architecture Computer Industry Research Embedded Systems ASIC Processors See 10+     See less Skills  Computer Architecture Computer Hardware Debugging Debuggers System Verification Verilog SoC Team Leadership Project Management Technical Writing Testing Test Automation Silicon Performance Measurement Performance Analysis Hardware Testing Silicon Validation RTL design RTL Development Solution Architecture Computer Industry Research Embedded Systems ASIC Processors See 10+     See less Computer Architecture Computer Hardware Debugging Debuggers System Verification Verilog SoC Team Leadership Project Management Technical Writing Testing Test Automation Silicon Performance Measurement Performance Analysis Hardware Testing Silicon Validation RTL design RTL Development Solution Architecture Computer Industry Research Embedded Systems ASIC Processors See 10+     See less Computer Architecture Computer Hardware Debugging Debuggers System Verification Verilog SoC Team Leadership Project Management Technical Writing Testing Test Automation Silicon Performance Measurement Performance Analysis Hardware Testing Silicon Validation RTL design RTL Development Solution Architecture Computer Industry Research Embedded Systems ASIC Processors See 10+     See less Education University of Michigan Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1989  – 1994 University of Michigan Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1989  – 1994 University of Michigan Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1989  – 1994 University of Michigan Bachelor of Science (B.S.),  Electrical and Electronics Engineering 1989  – 1994 ", "Experience Simulation engineer Intel Corporation January 2012  – Present (3 years 8 months) thermal and thermo-mechanical simulation ensuring and improving reliability of semiconductor packages Trainee Infineon Technologies October 2010  –  December 2011  (1 year 3 months) General topic: \"Virtual Prototyping\" Student University of Regensburg October 2002  –  September 2010  (8 years) Regensburg Area, Germany studies of physics, Studiengang Physik mit integriertem Doktorandenkolleg \nspecialized in condensed matter physics \n \n2002 - 2006: diploma student \n2006 - 2009: PhD student \n2009 - 2010: Post Doc Simulation engineer Intel Corporation January 2012  – Present (3 years 8 months) thermal and thermo-mechanical simulation ensuring and improving reliability of semiconductor packages Simulation engineer Intel Corporation January 2012  – Present (3 years 8 months) thermal and thermo-mechanical simulation ensuring and improving reliability of semiconductor packages Trainee Infineon Technologies October 2010  –  December 2011  (1 year 3 months) General topic: \"Virtual Prototyping\" Trainee Infineon Technologies October 2010  –  December 2011  (1 year 3 months) General topic: \"Virtual Prototyping\" Student University of Regensburg October 2002  –  September 2010  (8 years) Regensburg Area, Germany studies of physics, Studiengang Physik mit integriertem Doktorandenkolleg \nspecialized in condensed matter physics \n \n2002 - 2006: diploma student \n2006 - 2009: PhD student \n2009 - 2010: Post Doc Student University of Regensburg October 2002  –  September 2010  (8 years) Regensburg Area, Germany studies of physics, Studiengang Physik mit integriertem Doktorandenkolleg \nspecialized in condensed matter physics \n \n2002 - 2006: diploma student \n2006 - 2009: PhD student \n2009 - 2010: Post Doc Languages German English Latin German English Latin German English Latin Skills Problem Solving Semiconductors Quantum Dots Python Linux Simulations Abaqus ANSYS Matlab C Perl Debugging Physics LaTeX Nanotechnology Nanomaterials Mathematical Modeling Scientific Computing Materials Science Silicon See 5+     See less Skills  Problem Solving Semiconductors Quantum Dots Python Linux Simulations Abaqus ANSYS Matlab C Perl Debugging Physics LaTeX Nanotechnology Nanomaterials Mathematical Modeling Scientific Computing Materials Science Silicon See 5+     See less Problem Solving Semiconductors Quantum Dots Python Linux Simulations Abaqus ANSYS Matlab C Perl Debugging Physics LaTeX Nanotechnology Nanomaterials Mathematical Modeling Scientific Computing Materials Science Silicon See 5+     See less Problem Solving Semiconductors Quantum Dots Python Linux Simulations Abaqus ANSYS Matlab C Perl Debugging Physics LaTeX Nanotechnology Nanomaterials Mathematical Modeling Scientific Computing Materials Science Silicon See 5+     See less Education Universität Regensburg Doctor of Philosophy (PhD),  Physics 2002  – 2010 Friedrich-Alexander-Universität Erlangen-Nürnberg 2004  – 2004 Werner-von-Siemens-Gymnasium Werner-von-Siemens-Gymnasium Universität Regensburg Doctor of Philosophy (PhD),  Physics 2002  – 2010 Universität Regensburg Doctor of Philosophy (PhD),  Physics 2002  – 2010 Universität Regensburg Doctor of Philosophy (PhD),  Physics 2002  – 2010 Friedrich-Alexander-Universität Erlangen-Nürnberg 2004  – 2004 Friedrich-Alexander-Universität Erlangen-Nürnberg 2004  – 2004 Friedrich-Alexander-Universität Erlangen-Nürnberg 2004  – 2004 Werner-von-Siemens-Gymnasium Werner-von-Siemens-Gymnasium Werner-von-Siemens-Gymnasium Werner-von-Siemens-Gymnasium Werner-von-Siemens-Gymnasium Werner-von-Siemens-Gymnasium ", "Skills emedded systems Real Time Datacom Telecommunications... C++ C Perl Python ClearCase Testing Linux Software Development VxWorks Subversion Bash IP Firmware Integration RTOS See 4+     See less Skills  emedded systems Real Time Datacom Telecommunications... C++ C Perl Python ClearCase Testing Linux Software Development VxWorks Subversion Bash IP Firmware Integration RTOS See 4+     See less emedded systems Real Time Datacom Telecommunications... C++ C Perl Python ClearCase Testing Linux Software Development VxWorks Subversion Bash IP Firmware Integration RTOS See 4+     See less emedded systems Real Time Datacom Telecommunications... C++ C Perl Python ClearCase Testing Linux Software Development VxWorks Subversion Bash IP Firmware Integration RTOS See 4+     See less "]}