{"position": "Software Technician", "company": "Intel Corporation", "profiles": ["Skills Data Analysis Team Leadership Change Management Project Planning Management Data Marts SDLC Testing Requirements Gathering Visio Business Analysis Software Project... Business Intelligence PL/SQL Data Warehousing SharePoint Software Documentation ETL Microsoft SQL Server Software Development SQL MS Project See 7+     See less Skills  Data Analysis Team Leadership Change Management Project Planning Management Data Marts SDLC Testing Requirements Gathering Visio Business Analysis Software Project... Business Intelligence PL/SQL Data Warehousing SharePoint Software Documentation ETL Microsoft SQL Server Software Development SQL MS Project See 7+     See less Data Analysis Team Leadership Change Management Project Planning Management Data Marts SDLC Testing Requirements Gathering Visio Business Analysis Software Project... Business Intelligence PL/SQL Data Warehousing SharePoint Software Documentation ETL Microsoft SQL Server Software Development SQL MS Project See 7+     See less Data Analysis Team Leadership Change Management Project Planning Management Data Marts SDLC Testing Requirements Gathering Visio Business Analysis Software Project... Business Intelligence PL/SQL Data Warehousing SharePoint Software Documentation ETL Microsoft SQL Server Software Development SQL MS Project See 7+     See less ", "Summary Skills: Detailed oriented, quick learner, love to learn new things, enjoy working in the internet environment \nComputer Systems: Unix, Windows, Mac, Linux \nComputer Applications: Microsoft Office, Bugzilla, WinSCP, Putty, SQL Advantage, Photoshop, Paint Shop Pro, Photo Impact, Flash 5 \nForeign Languages: Studied German, Italian, French and Spanish. Specialties:programming in html, c, xml, vxml, parity, css, sql, jsp Summary Skills: Detailed oriented, quick learner, love to learn new things, enjoy working in the internet environment \nComputer Systems: Unix, Windows, Mac, Linux \nComputer Applications: Microsoft Office, Bugzilla, WinSCP, Putty, SQL Advantage, Photoshop, Paint Shop Pro, Photo Impact, Flash 5 \nForeign Languages: Studied German, Italian, French and Spanish. Specialties:programming in html, c, xml, vxml, parity, css, sql, jsp Skills: Detailed oriented, quick learner, love to learn new things, enjoy working in the internet environment \nComputer Systems: Unix, Windows, Mac, Linux \nComputer Applications: Microsoft Office, Bugzilla, WinSCP, Putty, SQL Advantage, Photoshop, Paint Shop Pro, Photo Impact, Flash 5 \nForeign Languages: Studied German, Italian, French and Spanish. Specialties:programming in html, c, xml, vxml, parity, css, sql, jsp Skills: Detailed oriented, quick learner, love to learn new things, enjoy working in the internet environment \nComputer Systems: Unix, Windows, Mac, Linux \nComputer Applications: Microsoft Office, Bugzilla, WinSCP, Putty, SQL Advantage, Photoshop, Paint Shop Pro, Photo Impact, Flash 5 \nForeign Languages: Studied German, Italian, French and Spanish. Specialties:programming in html, c, xml, vxml, parity, css, sql, jsp Experience Software Engineer XO Communications December 2005  – Present (9 years 9 months) Beaverton, OR IVR programmer in parity and vxml with some java. My knowledge and exceptional people skills is an asset to this organization. I assist Project Managers, database administrators and QA Engineers on the details of a project to insure the success and on time delivery of a project. I develop and test code for telephone menu programs that use a database or XML for data. I rewrote legacy applications from intervoice to dialogic to get rid of old equipment. I create new enhanced voice services applications in VXML, JSP 2.0 and Parity (like C). I unit test the programs and pass them onto QA. I also modify existing applications for change requests and fix trouble tickets. I am continuing my Java2 education due to the increasing need of these skills in my current position. QA Engineer XO Interactive April 2000  –  December 2005  (5 years 9 months) Portland, Oregon Area I handled many projects simultaneously. I was very proactive when handed a project and completed them before the deadline. I have created QA documentation for many large projects and have written large test plans and executed the manual cases and automated scripts. Creating and maintaining automated Hammer scripts was my responsibility. I used SQL Advantage for database verification. My duties were to test software for telecommunication programs – Interactive Voice Response (IVR). I wrote VB scripts to test these phone applications. Additionally I test web sites with web, IVR, and database interaction. I am very proficient in NT and OS2 operating systems. I used a UNIX platform to test Middleware connections and logging for IVR Applications. I used different programs for remote access to VRUs (Voice Response Units): PolyPM and Timbuktu. I was responsible for testing 3 applications that generate 50 percent of XOI’s revenue. QA Engineer Tektronix 1997  –  1999  (2 years) My responsibilities were to develop, executed, and maintain software test plans for color printers (laser, solid ink and medical). I wrote files and scripts in PostScript, Silk and QATalk. I reported and verified bugs. I manipulated hardware to test software. I tested plug-ins for Photoshop 4.0. I created and maintained tests for the following: Configurations, Localization (FIGS & CCJK), Resetting, Built-In Pages, Color Imaging (CRDs, VCDs, Print Quality, TekColor Correction), Front Panel. I had to follow FDA guidelines while testing medical imaging printers. I worked on three different platforms: Windows (95, 98), UNIX (Xterm), Mac (OS8.0). I used Silk to test the functionality of HTML pages in the printer. I tested scanners connected to Tek printers as copiers. I used ClearCase XDDTS for the bug system. QA Engineer Intel January 1997  –  April 1997  (4 months) I contracted as a software technician at Intel Corporation as a project assistant in international publications. I troubleshot help files for communication programs in many foreign languages for localization (FIGS & CCJK). I checked files in and out for source control. I had bug scrubs twice a week with program testers. I manipulated graphics for help manuals and online help with Photoshop 4.0. I tested software on Asian Operating systems (CCJK). Software Tester Sharp 1997  –  1997  (less than a year) I contracted as a software tester at Sharp Labs of America in Camas, WA as a Software Tester for Sharp copiers. I worked with Genoa tests for PCL and PS. I reported and verified bugs. I used PostScript and PCL to make files for testing. I tested localized pages (FIGS) and front panel. Sales Technician Xerox December 1995  –  October 1996  (11 months) As a Document Management System Analyst, I assisted copier marketing executives as a System Analyst with demos, customer training and connection of color copiers as printers on networks. I specialized in copier front ends (Fiery, Splash, UFO, Cyclone). I used Xerox copiers as printers: 4700, 4900, 5765, 5790, DCS20, DCS35, DC40, DT135. I worked with publishing programs for flyers and training screens. I successfully completed Xerox courses in Quality Training and Sales Analysis. 26V Strategic Microwave Systems Repairer us army October 1984  –  October 1988  (4 years 1 month) Trained for 960 hours in telecommunication electronics, both analog and digital. I maintained and troubleshot three different multiplex communication systems in Southern Europe (Italy). Software Engineer XO Communications December 2005  – Present (9 years 9 months) Beaverton, OR IVR programmer in parity and vxml with some java. My knowledge and exceptional people skills is an asset to this organization. I assist Project Managers, database administrators and QA Engineers on the details of a project to insure the success and on time delivery of a project. I develop and test code for telephone menu programs that use a database or XML for data. I rewrote legacy applications from intervoice to dialogic to get rid of old equipment. I create new enhanced voice services applications in VXML, JSP 2.0 and Parity (like C). I unit test the programs and pass them onto QA. I also modify existing applications for change requests and fix trouble tickets. I am continuing my Java2 education due to the increasing need of these skills in my current position. Software Engineer XO Communications December 2005  – Present (9 years 9 months) Beaverton, OR IVR programmer in parity and vxml with some java. My knowledge and exceptional people skills is an asset to this organization. I assist Project Managers, database administrators and QA Engineers on the details of a project to insure the success and on time delivery of a project. I develop and test code for telephone menu programs that use a database or XML for data. I rewrote legacy applications from intervoice to dialogic to get rid of old equipment. I create new enhanced voice services applications in VXML, JSP 2.0 and Parity (like C). I unit test the programs and pass them onto QA. I also modify existing applications for change requests and fix trouble tickets. I am continuing my Java2 education due to the increasing need of these skills in my current position. QA Engineer XO Interactive April 2000  –  December 2005  (5 years 9 months) Portland, Oregon Area I handled many projects simultaneously. I was very proactive when handed a project and completed them before the deadline. I have created QA documentation for many large projects and have written large test plans and executed the manual cases and automated scripts. Creating and maintaining automated Hammer scripts was my responsibility. I used SQL Advantage for database verification. My duties were to test software for telecommunication programs – Interactive Voice Response (IVR). I wrote VB scripts to test these phone applications. Additionally I test web sites with web, IVR, and database interaction. I am very proficient in NT and OS2 operating systems. I used a UNIX platform to test Middleware connections and logging for IVR Applications. I used different programs for remote access to VRUs (Voice Response Units): PolyPM and Timbuktu. I was responsible for testing 3 applications that generate 50 percent of XOI’s revenue. QA Engineer XO Interactive April 2000  –  December 2005  (5 years 9 months) Portland, Oregon Area I handled many projects simultaneously. I was very proactive when handed a project and completed them before the deadline. I have created QA documentation for many large projects and have written large test plans and executed the manual cases and automated scripts. Creating and maintaining automated Hammer scripts was my responsibility. I used SQL Advantage for database verification. My duties were to test software for telecommunication programs – Interactive Voice Response (IVR). I wrote VB scripts to test these phone applications. Additionally I test web sites with web, IVR, and database interaction. I am very proficient in NT and OS2 operating systems. I used a UNIX platform to test Middleware connections and logging for IVR Applications. I used different programs for remote access to VRUs (Voice Response Units): PolyPM and Timbuktu. I was responsible for testing 3 applications that generate 50 percent of XOI’s revenue. QA Engineer Tektronix 1997  –  1999  (2 years) My responsibilities were to develop, executed, and maintain software test plans for color printers (laser, solid ink and medical). I wrote files and scripts in PostScript, Silk and QATalk. I reported and verified bugs. I manipulated hardware to test software. I tested plug-ins for Photoshop 4.0. I created and maintained tests for the following: Configurations, Localization (FIGS & CCJK), Resetting, Built-In Pages, Color Imaging (CRDs, VCDs, Print Quality, TekColor Correction), Front Panel. I had to follow FDA guidelines while testing medical imaging printers. I worked on three different platforms: Windows (95, 98), UNIX (Xterm), Mac (OS8.0). I used Silk to test the functionality of HTML pages in the printer. I tested scanners connected to Tek printers as copiers. I used ClearCase XDDTS for the bug system. QA Engineer Tektronix 1997  –  1999  (2 years) My responsibilities were to develop, executed, and maintain software test plans for color printers (laser, solid ink and medical). I wrote files and scripts in PostScript, Silk and QATalk. I reported and verified bugs. I manipulated hardware to test software. I tested plug-ins for Photoshop 4.0. I created and maintained tests for the following: Configurations, Localization (FIGS & CCJK), Resetting, Built-In Pages, Color Imaging (CRDs, VCDs, Print Quality, TekColor Correction), Front Panel. I had to follow FDA guidelines while testing medical imaging printers. I worked on three different platforms: Windows (95, 98), UNIX (Xterm), Mac (OS8.0). I used Silk to test the functionality of HTML pages in the printer. I tested scanners connected to Tek printers as copiers. I used ClearCase XDDTS for the bug system. QA Engineer Intel January 1997  –  April 1997  (4 months) I contracted as a software technician at Intel Corporation as a project assistant in international publications. I troubleshot help files for communication programs in many foreign languages for localization (FIGS & CCJK). I checked files in and out for source control. I had bug scrubs twice a week with program testers. I manipulated graphics for help manuals and online help with Photoshop 4.0. I tested software on Asian Operating systems (CCJK). QA Engineer Intel January 1997  –  April 1997  (4 months) I contracted as a software technician at Intel Corporation as a project assistant in international publications. I troubleshot help files for communication programs in many foreign languages for localization (FIGS & CCJK). I checked files in and out for source control. I had bug scrubs twice a week with program testers. I manipulated graphics for help manuals and online help with Photoshop 4.0. I tested software on Asian Operating systems (CCJK). Software Tester Sharp 1997  –  1997  (less than a year) I contracted as a software tester at Sharp Labs of America in Camas, WA as a Software Tester for Sharp copiers. I worked with Genoa tests for PCL and PS. I reported and verified bugs. I used PostScript and PCL to make files for testing. I tested localized pages (FIGS) and front panel. Software Tester Sharp 1997  –  1997  (less than a year) I contracted as a software tester at Sharp Labs of America in Camas, WA as a Software Tester for Sharp copiers. I worked with Genoa tests for PCL and PS. I reported and verified bugs. I used PostScript and PCL to make files for testing. I tested localized pages (FIGS) and front panel. Sales Technician Xerox December 1995  –  October 1996  (11 months) As a Document Management System Analyst, I assisted copier marketing executives as a System Analyst with demos, customer training and connection of color copiers as printers on networks. I specialized in copier front ends (Fiery, Splash, UFO, Cyclone). I used Xerox copiers as printers: 4700, 4900, 5765, 5790, DCS20, DCS35, DC40, DT135. I worked with publishing programs for flyers and training screens. I successfully completed Xerox courses in Quality Training and Sales Analysis. Sales Technician Xerox December 1995  –  October 1996  (11 months) As a Document Management System Analyst, I assisted copier marketing executives as a System Analyst with demos, customer training and connection of color copiers as printers on networks. I specialized in copier front ends (Fiery, Splash, UFO, Cyclone). I used Xerox copiers as printers: 4700, 4900, 5765, 5790, DCS20, DCS35, DC40, DT135. I worked with publishing programs for flyers and training screens. I successfully completed Xerox courses in Quality Training and Sales Analysis. 26V Strategic Microwave Systems Repairer us army October 1984  –  October 1988  (4 years 1 month) Trained for 960 hours in telecommunication electronics, both analog and digital. I maintained and troubleshot three different multiplex communication systems in Southern Europe (Italy). 26V Strategic Microwave Systems Repairer us army October 1984  –  October 1988  (4 years 1 month) Trained for 960 hours in telecommunication electronics, both analog and digital. I maintained and troubleshot three different multiplex communication systems in Southern Europe (Italy). Languages German French Italian Spanish German French Italian Spanish German French Italian Spanish Skills SQL HTML CSS JSP C XML Unix Windows Programming FTP Linux Operating Systems VSS Web Applications Subversion Bugzilla Web Development Telecommunications Cloud Computing VoIP TCP/IP See 6+     See less Skills  SQL HTML CSS JSP C XML Unix Windows Programming FTP Linux Operating Systems VSS Web Applications Subversion Bugzilla Web Development Telecommunications Cloud Computing VoIP TCP/IP See 6+     See less SQL HTML CSS JSP C XML Unix Windows Programming FTP Linux Operating Systems VSS Web Applications Subversion Bugzilla Web Development Telecommunications Cloud Computing VoIP TCP/IP See 6+     See less SQL HTML CSS JSP C XML Unix Windows Programming FTP Linux Operating Systems VSS Web Applications Subversion Bugzilla Web Development Telecommunications Cloud Computing VoIP TCP/IP See 6+     See less Education University of Maryland University College BA,  Computer Science 1991  – 1992 Newport News Community College Computer Science 1990  – 1991 Portland State University computer science 1989  – 1990 San Bernardino Valley Community College AA,  Liberal Arts 1982  – 1984 Hillsboro High School diploma 1980  – 1982 University of Maryland University College BA,  Computer Science 1991  – 1992 University of Maryland University College BA,  Computer Science 1991  – 1992 University of Maryland University College BA,  Computer Science 1991  – 1992 Newport News Community College Computer Science 1990  – 1991 Newport News Community College Computer Science 1990  – 1991 Newport News Community College Computer Science 1990  – 1991 Portland State University computer science 1989  – 1990 Portland State University computer science 1989  – 1990 Portland State University computer science 1989  – 1990 San Bernardino Valley Community College AA,  Liberal Arts 1982  – 1984 San Bernardino Valley Community College AA,  Liberal Arts 1982  – 1984 San Bernardino Valley Community College AA,  Liberal Arts 1982  – 1984 Hillsboro High School diploma 1980  – 1982 Hillsboro High School diploma 1980  – 1982 Hillsboro High School diploma 1980  – 1982 ", "Summary Specialties:High-Availability networks for data centers, factories, wireless, and office/lab networks \nCable plant designs for data center, factory and office spaces \nConstruction Management supporting LANs and WANs \nFirewalls \nNetwork Security Summary Specialties:High-Availability networks for data centers, factories, wireless, and office/lab networks \nCable plant designs for data center, factory and office spaces \nConstruction Management supporting LANs and WANs \nFirewalls \nNetwork Security Specialties:High-Availability networks for data centers, factories, wireless, and office/lab networks \nCable plant designs for data center, factory and office spaces \nConstruction Management supporting LANs and WANs \nFirewalls \nNetwork Security Specialties:High-Availability networks for data centers, factories, wireless, and office/lab networks \nCable plant designs for data center, factory and office spaces \nConstruction Management supporting LANs and WANs \nFirewalls \nNetwork Security Experience Sr. Network Engineer FireEye, Inc. May 2014  – Present (1 year 4 months) Sr. Network Engineer Intel Corporation February 2005  –  May 2014  (9 years 4 months) Sr. Network Engineer responsible for designing, supporting, and troubleshooting High Performance Data Centers, High-Availability Factories, office networks, wireless networks and firewalls. Sr. Network Specialist Intel Corporation April 1995  –  February 2005  (9 years 11 months) Sr. Network Engineer responsible for designing, supporting, and troubleshooting High-Availability Factory networks using Cisco, Bay/Nortel, Checkpoint, and Xyplex equipment. Software Technician Intel Corporation April 1992  –  April 1995  (3 years 1 month) Designed, deployed and maintained DEC Pathworks office automation solutions for factory engineers and support personnel using DECNET and TCP/IP. Sr. Network Engineer FireEye, Inc. May 2014  – Present (1 year 4 months) Sr. Network Engineer FireEye, Inc. May 2014  – Present (1 year 4 months) Sr. Network Engineer Intel Corporation February 2005  –  May 2014  (9 years 4 months) Sr. Network Engineer responsible for designing, supporting, and troubleshooting High Performance Data Centers, High-Availability Factories, office networks, wireless networks and firewalls. Sr. Network Engineer Intel Corporation February 2005  –  May 2014  (9 years 4 months) Sr. Network Engineer responsible for designing, supporting, and troubleshooting High Performance Data Centers, High-Availability Factories, office networks, wireless networks and firewalls. Sr. Network Specialist Intel Corporation April 1995  –  February 2005  (9 years 11 months) Sr. Network Engineer responsible for designing, supporting, and troubleshooting High-Availability Factory networks using Cisco, Bay/Nortel, Checkpoint, and Xyplex equipment. Sr. Network Specialist Intel Corporation April 1995  –  February 2005  (9 years 11 months) Sr. Network Engineer responsible for designing, supporting, and troubleshooting High-Availability Factory networks using Cisco, Bay/Nortel, Checkpoint, and Xyplex equipment. Software Technician Intel Corporation April 1992  –  April 1995  (3 years 1 month) Designed, deployed and maintained DEC Pathworks office automation solutions for factory engineers and support personnel using DECNET and TCP/IP. Software Technician Intel Corporation April 1992  –  April 1995  (3 years 1 month) Designed, deployed and maintained DEC Pathworks office automation solutions for factory engineers and support personnel using DECNET and TCP/IP. Skills Cisco Technologies Semiconductors Firewalls TCP/IP Data Center Process Simulation Storage Design of Experiments High Availability Troubleshooting Network Security Wireless Networking IT Operations WAN Integration Perl Intel Wireless Networking Cross-functional Team... IT Service Management Teamwork Leadership See 8+     See less Skills  Cisco Technologies Semiconductors Firewalls TCP/IP Data Center Process Simulation Storage Design of Experiments High Availability Troubleshooting Network Security Wireless Networking IT Operations WAN Integration Perl Intel Wireless Networking Cross-functional Team... IT Service Management Teamwork Leadership See 8+     See less Cisco Technologies Semiconductors Firewalls TCP/IP Data Center Process Simulation Storage Design of Experiments High Availability Troubleshooting Network Security Wireless Networking IT Operations WAN Integration Perl Intel Wireless Networking Cross-functional Team... IT Service Management Teamwork Leadership See 8+     See less Cisco Technologies Semiconductors Firewalls TCP/IP Data Center Process Simulation Storage Design of Experiments High Availability Troubleshooting Network Security Wireless Networking IT Operations WAN Integration Perl Intel Wireless Networking Cross-functional Team... IT Service Management Teamwork Leadership See 8+     See less Education San Jose State University B.S.,  Chemistry 1991  – 1995 Activities and Societies:  Computer Science Minor San Jose State University B.S.,  Chemistry 1991  – 1995 Activities and Societies:  Computer Science Minor San Jose State University B.S.,  Chemistry 1991  – 1995 Activities and Societies:  Computer Science Minor San Jose State University B.S.,  Chemistry 1991  – 1995 Activities and Societies:  Computer Science Minor ", "Summary Specialties: Laboratory Manager, Contract/Temp (SA) Staff Augmentation, Prototype Design, Software Development Milestones, and Software Testing Q&A. Summary Specialties: Laboratory Manager, Contract/Temp (SA) Staff Augmentation, Prototype Design, Software Development Milestones, and Software Testing Q&A. Specialties: Laboratory Manager, Contract/Temp (SA) Staff Augmentation, Prototype Design, Software Development Milestones, and Software Testing Q&A. Specialties: Laboratory Manager, Contract/Temp (SA) Staff Augmentation, Prototype Design, Software Development Milestones, and Software Testing Q&A. Experience Graphics R&D Laboratory Manager & Lead Software Technician Intel Corporation February 2006  – Present (9 years 7 months) Folsom CA Primary contact for System and Application Support/Graphics Core Engineering groups with in VPG Graphics Software at Intel. In addition, provide support to multiple groups that span over 2000 people (technicians and engineers) with any computer hardware/software and network issues. \n \n*Responsible for Personnel, Security, Capital Equipment, laboratory experiments, resource usage, and Contract (SA) Staff Augmentation for specific hardware related projects. \n*Testing correlation ongoing with Software developers and Hardware Engineers. \n*Testing Operating systems and the health of Graphics drivers. \n*Competitive performance analysis between Intel HD internal graphics cores and 3rd Party High Definition discreet cards. \n*Verify functionality of the installed GFX drivers on New Product Platform Mobile projects. \n*Test and Implement new versions of Windows, Android, Linux, and MacOSX in the R&D environment. Systems Manufacturing Technician Intel Corporation February 2005  –  February 2006  (1 year 1 month) Folsom CA *Mobile Lead - Kelly Contract @ Intel FM \nAnswer inquiries regarding computer software and hardware operation to resolve problems. Worked with new product platform planners and group project owners during pre-deployment phase to proactively resolve issues, peripheral constraints, and best known methods (BKM) to better forecast future project requirements. Read technical manuals, confer with users and conduct computer diagnostics to investigate and resolve problems. The scope of this position is fairly wide, including software and hardware technical resolution debug and fault isolation to lowest level as well as provides technical support to engineers and laboratory technicians. Generated functional requirements for computer-related systems. Evaluated and presented data in appropriate forms. Engineering Software Technician VRTG August 2001  –  February 2005  (3 years 7 months) Technology Support Specialist on PC, MAC, wireless technologies On-Site Service and Repair. Custom PCs, Upgrades, Networking. Virus/Spyware/Root Kit Removal. Security countermeasures. WiFi Alliance compliancy. Custom Servers and high-performance computing. Staff Augmentation - technical worker. Esoteric systems analyst : Amiga, MS-Dos, BEOS, and Atari ST. Validation Engineering Technician Intel Corporation August 2000  –  August 2001  (1 year 1 month) Folsom CA Kelly Contract @ Intel FM \nParticipated in semiconductor validation procedures and provided technical depositions for ongoing activities. Collaborated with engineers to perform data analysis. Troubleshot equipment and processed deviations. Provided timely and accurate information of validation parameters. Scheduled, tracked, reported and achieved project deadlines. Involved with research and development regarding stress tests, Failure, Analysis, Customer Return (FACR). HP-UX testers - Trillium Testers - RFS and Summit robotic Integrated Circuit Handlers - Schlumberger's semiconductor testers. Trained new personnel on validation techniques and the validation Burn-in of computer and computer related systems. Security Officer Pinkerton | Corporate Risk Management Services August 1999  –  August 2000  (1 year 1 month) Intel Corporation Monitored and authorized entrance and departure of employees, visitors and other persons to maintain security of the premises. Ensured a safe, clean and injury free workplace. Provided customer care service. Secured loss prevention and performed detailed incidence reports. Operated detecting devices to screen individuals and prevent passage of prohibited articles into restricted areas. Escorted individuals to specified locations and provided personal protection. Operation Specialist US Navy August 1994  –  August 1996  (2 years 1 month) Graphics R&D Laboratory Manager & Lead Software Technician Intel Corporation February 2006  – Present (9 years 7 months) Folsom CA Primary contact for System and Application Support/Graphics Core Engineering groups with in VPG Graphics Software at Intel. In addition, provide support to multiple groups that span over 2000 people (technicians and engineers) with any computer hardware/software and network issues. \n \n*Responsible for Personnel, Security, Capital Equipment, laboratory experiments, resource usage, and Contract (SA) Staff Augmentation for specific hardware related projects. \n*Testing correlation ongoing with Software developers and Hardware Engineers. \n*Testing Operating systems and the health of Graphics drivers. \n*Competitive performance analysis between Intel HD internal graphics cores and 3rd Party High Definition discreet cards. \n*Verify functionality of the installed GFX drivers on New Product Platform Mobile projects. \n*Test and Implement new versions of Windows, Android, Linux, and MacOSX in the R&D environment. Graphics R&D Laboratory Manager & Lead Software Technician Intel Corporation February 2006  – Present (9 years 7 months) Folsom CA Primary contact for System and Application Support/Graphics Core Engineering groups with in VPG Graphics Software at Intel. In addition, provide support to multiple groups that span over 2000 people (technicians and engineers) with any computer hardware/software and network issues. \n \n*Responsible for Personnel, Security, Capital Equipment, laboratory experiments, resource usage, and Contract (SA) Staff Augmentation for specific hardware related projects. \n*Testing correlation ongoing with Software developers and Hardware Engineers. \n*Testing Operating systems and the health of Graphics drivers. \n*Competitive performance analysis between Intel HD internal graphics cores and 3rd Party High Definition discreet cards. \n*Verify functionality of the installed GFX drivers on New Product Platform Mobile projects. \n*Test and Implement new versions of Windows, Android, Linux, and MacOSX in the R&D environment. Systems Manufacturing Technician Intel Corporation February 2005  –  February 2006  (1 year 1 month) Folsom CA *Mobile Lead - Kelly Contract @ Intel FM \nAnswer inquiries regarding computer software and hardware operation to resolve problems. Worked with new product platform planners and group project owners during pre-deployment phase to proactively resolve issues, peripheral constraints, and best known methods (BKM) to better forecast future project requirements. Read technical manuals, confer with users and conduct computer diagnostics to investigate and resolve problems. The scope of this position is fairly wide, including software and hardware technical resolution debug and fault isolation to lowest level as well as provides technical support to engineers and laboratory technicians. Generated functional requirements for computer-related systems. Evaluated and presented data in appropriate forms. Systems Manufacturing Technician Intel Corporation February 2005  –  February 2006  (1 year 1 month) Folsom CA *Mobile Lead - Kelly Contract @ Intel FM \nAnswer inquiries regarding computer software and hardware operation to resolve problems. Worked with new product platform planners and group project owners during pre-deployment phase to proactively resolve issues, peripheral constraints, and best known methods (BKM) to better forecast future project requirements. Read technical manuals, confer with users and conduct computer diagnostics to investigate and resolve problems. The scope of this position is fairly wide, including software and hardware technical resolution debug and fault isolation to lowest level as well as provides technical support to engineers and laboratory technicians. Generated functional requirements for computer-related systems. Evaluated and presented data in appropriate forms. Engineering Software Technician VRTG August 2001  –  February 2005  (3 years 7 months) Technology Support Specialist on PC, MAC, wireless technologies On-Site Service and Repair. Custom PCs, Upgrades, Networking. Virus/Spyware/Root Kit Removal. Security countermeasures. WiFi Alliance compliancy. Custom Servers and high-performance computing. Staff Augmentation - technical worker. Esoteric systems analyst : Amiga, MS-Dos, BEOS, and Atari ST. Engineering Software Technician VRTG August 2001  –  February 2005  (3 years 7 months) Technology Support Specialist on PC, MAC, wireless technologies On-Site Service and Repair. Custom PCs, Upgrades, Networking. Virus/Spyware/Root Kit Removal. Security countermeasures. WiFi Alliance compliancy. Custom Servers and high-performance computing. Staff Augmentation - technical worker. Esoteric systems analyst : Amiga, MS-Dos, BEOS, and Atari ST. Validation Engineering Technician Intel Corporation August 2000  –  August 2001  (1 year 1 month) Folsom CA Kelly Contract @ Intel FM \nParticipated in semiconductor validation procedures and provided technical depositions for ongoing activities. Collaborated with engineers to perform data analysis. Troubleshot equipment and processed deviations. Provided timely and accurate information of validation parameters. Scheduled, tracked, reported and achieved project deadlines. Involved with research and development regarding stress tests, Failure, Analysis, Customer Return (FACR). HP-UX testers - Trillium Testers - RFS and Summit robotic Integrated Circuit Handlers - Schlumberger's semiconductor testers. Trained new personnel on validation techniques and the validation Burn-in of computer and computer related systems. Validation Engineering Technician Intel Corporation August 2000  –  August 2001  (1 year 1 month) Folsom CA Kelly Contract @ Intel FM \nParticipated in semiconductor validation procedures and provided technical depositions for ongoing activities. Collaborated with engineers to perform data analysis. Troubleshot equipment and processed deviations. Provided timely and accurate information of validation parameters. Scheduled, tracked, reported and achieved project deadlines. Involved with research and development regarding stress tests, Failure, Analysis, Customer Return (FACR). HP-UX testers - Trillium Testers - RFS and Summit robotic Integrated Circuit Handlers - Schlumberger's semiconductor testers. Trained new personnel on validation techniques and the validation Burn-in of computer and computer related systems. Security Officer Pinkerton | Corporate Risk Management Services August 1999  –  August 2000  (1 year 1 month) Intel Corporation Monitored and authorized entrance and departure of employees, visitors and other persons to maintain security of the premises. Ensured a safe, clean and injury free workplace. Provided customer care service. Secured loss prevention and performed detailed incidence reports. Operated detecting devices to screen individuals and prevent passage of prohibited articles into restricted areas. Escorted individuals to specified locations and provided personal protection. Security Officer Pinkerton | Corporate Risk Management Services August 1999  –  August 2000  (1 year 1 month) Intel Corporation Monitored and authorized entrance and departure of employees, visitors and other persons to maintain security of the premises. Ensured a safe, clean and injury free workplace. Provided customer care service. Secured loss prevention and performed detailed incidence reports. Operated detecting devices to screen individuals and prevent passage of prohibited articles into restricted areas. Escorted individuals to specified locations and provided personal protection. Operation Specialist US Navy August 1994  –  August 1996  (2 years 1 month) Operation Specialist US Navy August 1994  –  August 1996  (2 years 1 month) Skills Windows Linux Mac OS Networking Wireless Networking Software Quality... Software Software Installation Computer Hardware Hardware Diagnostics Hardware Architecture Hardware Installation Network Hardware Hardware Development IT Hardware Support HP Server Hardware Temporary Staffing KVM Switches Windows Server Server Administration Server Architecture Apple OS Apple Project Planning Employee Training Technical Training Technical Demonstrations Product Demonstration Interviews Inventory Management Inventory Control Laboratory Laboratory Automation Laboratory Skills Script Coverage WHQL Project Coordination Software Project... Employment Law IT Outsourcing IT Recruitment IT Operations Field Technicians Semiconductor Industry Data Analysis Requirements Analysis Competitive Analysis Purchase Orders IT Service Management Customer Service See 35+     See less Skills  Windows Linux Mac OS Networking Wireless Networking Software Quality... Software Software Installation Computer Hardware Hardware Diagnostics Hardware Architecture Hardware Installation Network Hardware Hardware Development IT Hardware Support HP Server Hardware Temporary Staffing KVM Switches Windows Server Server Administration Server Architecture Apple OS Apple Project Planning Employee Training Technical Training Technical Demonstrations Product Demonstration Interviews Inventory Management Inventory Control Laboratory Laboratory Automation Laboratory Skills Script Coverage WHQL Project Coordination Software Project... Employment Law IT Outsourcing IT Recruitment IT Operations Field Technicians Semiconductor Industry Data Analysis Requirements Analysis Competitive Analysis Purchase Orders IT Service Management Customer Service See 35+     See less Windows Linux Mac OS Networking Wireless Networking Software Quality... Software Software Installation Computer Hardware Hardware Diagnostics Hardware Architecture Hardware Installation Network Hardware Hardware Development IT Hardware Support HP Server Hardware Temporary Staffing KVM Switches Windows Server Server Administration Server Architecture Apple OS Apple Project Planning Employee Training Technical Training Technical Demonstrations Product Demonstration Interviews Inventory Management Inventory Control Laboratory Laboratory Automation Laboratory Skills Script Coverage WHQL Project Coordination Software Project... Employment Law IT Outsourcing IT Recruitment IT Operations Field Technicians Semiconductor Industry Data Analysis Requirements Analysis Competitive Analysis Purchase Orders IT Service Management Customer Service See 35+     See less Windows Linux Mac OS Networking Wireless Networking Software Quality... Software Software Installation Computer Hardware Hardware Diagnostics Hardware Architecture Hardware Installation Network Hardware Hardware Development IT Hardware Support HP Server Hardware Temporary Staffing KVM Switches Windows Server Server Administration Server Architecture Apple OS Apple Project Planning Employee Training Technical Training Technical Demonstrations Product Demonstration Interviews Inventory Management Inventory Control Laboratory Laboratory Automation Laboratory Skills Script Coverage WHQL Project Coordination Software Project... Employment Law IT Outsourcing IT Recruitment IT Operations Field Technicians Semiconductor Industry Data Analysis Requirements Analysis Competitive Analysis Purchase Orders IT Service Management Customer Service See 35+     See less Education National University Master of Arts (M.A.),  Human Resources Management/Personnel Administration , General 2012  – 2013 University of Phoenix-Sacramento Valley Campus Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2006  – 2007 Sacramento City College Computer Systems Networking and Telecommunications 2004  – 2006 American River College Associates of Science Degree,  CIS – Microcomputer PC Support Architecture Managment 2002  – 2004 American River College Associates of Science Degree,  CIS – Computer Network Management 2002  – 2004 National University Master of Arts (M.A.),  Human Resources Management/Personnel Administration , General 2012  – 2013 National University Master of Arts (M.A.),  Human Resources Management/Personnel Administration , General 2012  – 2013 National University Master of Arts (M.A.),  Human Resources Management/Personnel Administration , General 2012  – 2013 University of Phoenix-Sacramento Valley Campus Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2006  – 2007 University of Phoenix-Sacramento Valley Campus Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2006  – 2007 University of Phoenix-Sacramento Valley Campus Bachelor's degree,  Business , Management, Marketing, and Related Support Services 2006  – 2007 Sacramento City College Computer Systems Networking and Telecommunications 2004  – 2006 Sacramento City College Computer Systems Networking and Telecommunications 2004  – 2006 Sacramento City College Computer Systems Networking and Telecommunications 2004  – 2006 American River College Associates of Science Degree,  CIS – Microcomputer PC Support Architecture Managment 2002  – 2004 American River College Associates of Science Degree,  CIS – Microcomputer PC Support Architecture Managment 2002  – 2004 American River College Associates of Science Degree,  CIS – Microcomputer PC Support Architecture Managment 2002  – 2004 American River College Associates of Science Degree,  CIS – Computer Network Management 2002  – 2004 American River College Associates of Science Degree,  CIS – Computer Network Management 2002  – 2004 American River College Associates of Science Degree,  CIS – Computer Network Management 2002  – 2004 ", "Experience Senior Technical Specialist Intel Corporation February 1981  –  November 2013  (32 years 10 months) Santa Clara, CA. Senior Customer Support Specialist Intel February 1981  –  July 1988  (7 years 6 months) Senior Technical Specialist Intel Corporation February 1981  –  November 2013  (32 years 10 months) Santa Clara, CA. Senior Technical Specialist Intel Corporation February 1981  –  November 2013  (32 years 10 months) Santa Clara, CA. Senior Customer Support Specialist Intel February 1981  –  July 1988  (7 years 6 months) Senior Customer Support Specialist Intel February 1981  –  July 1988  (7 years 6 months) Skills Linux Debugging Skills  Linux Debugging Linux Debugging Linux Debugging ", "Summary Seasoned electronics technician with 9+ years of experience in post-silicon validation at Intel, the last 5 of which has been supporting roles in both electrical validation and infrastructure management. Total of 17 years in the industry. Strong understanding of board design, architecture and signal loss, reflection, and degradation and how they contribute to noise or jitter. Solid operations management and leadership skills. Excellent written and oral communication, motivated, and results oriented. Thrive in a team environment, but very productive independently, utilizing a diverse skillset that ranges from DDR3 clock characterization to estimating an operating or project budget. Summary Seasoned electronics technician with 9+ years of experience in post-silicon validation at Intel, the last 5 of which has been supporting roles in both electrical validation and infrastructure management. Total of 17 years in the industry. Strong understanding of board design, architecture and signal loss, reflection, and degradation and how they contribute to noise or jitter. Solid operations management and leadership skills. Excellent written and oral communication, motivated, and results oriented. Thrive in a team environment, but very productive independently, utilizing a diverse skillset that ranges from DDR3 clock characterization to estimating an operating or project budget. Seasoned electronics technician with 9+ years of experience in post-silicon validation at Intel, the last 5 of which has been supporting roles in both electrical validation and infrastructure management. Total of 17 years in the industry. Strong understanding of board design, architecture and signal loss, reflection, and degradation and how they contribute to noise or jitter. Solid operations management and leadership skills. Excellent written and oral communication, motivated, and results oriented. Thrive in a team environment, but very productive independently, utilizing a diverse skillset that ranges from DDR3 clock characterization to estimating an operating or project budget. Seasoned electronics technician with 9+ years of experience in post-silicon validation at Intel, the last 5 of which has been supporting roles in both electrical validation and infrastructure management. Total of 17 years in the industry. Strong understanding of board design, architecture and signal loss, reflection, and degradation and how they contribute to noise or jitter. Solid operations management and leadership skills. Excellent written and oral communication, motivated, and results oriented. Thrive in a team environment, but very productive independently, utilizing a diverse skillset that ranges from DDR3 clock characterization to estimating an operating or project budget. Experience Software Technician Intel Corporation July 2014  – Present (1 year 2 months) Engineering Technician/Lab Manager Intel Corporation 2004  – Present (11 years) Folsom, CA Primary role: Characterization of the memory interface of Intel’s various processor products, using both system margining methodologies and direct signal integrity measurements. \nPerformed multiple job roles from project to project. Leveraged previous job experience in platform design to fill the role of Platform Owner, interfacing with board designers responsible for providing test boards to ensure the various requirements of electrical validation get into the designs often providing design solutions to the Board Designers that were accepted and implemented.  \nWent on a tour of duty as an Analog Engineer filling the role of Interface Owner in the Ivybridge Client Platform. In this role responsibilities covered constructing and executing a test plan to ensure proper System Margin Validation work was performed to ensure a proper PRQ recommendation to the project owners. Part of this plan included a Design of Experiments or DOE in which the varying contributors of DDR3 margin health were weighed and a set of test cases were created to construct a prediction model for failures per million over time. Also had to acquire some basic programming skills with Python to make changes to automated testing \nOwned various lab infrastructure items, performing the role of Lab Manager. In this role was responsible for the network and server health including over 60 desktop hosts and bring up of a new lab server with Windows Server 2008. Also interfaced with environmental health and safety, finance, Corporate Services, and security on a regular basis to ensure lab compliance with Intel policy. \nHave been a sponsor and immediate supervisor for 2-4 Contingent Workers since the beginning of 2011, monitoring work and providing performance feedback to the supplier upon request, and am the primary team member for screening and procuring contract support personnel. Software Technician Intel Corporation July 2014  – Present (1 year 2 months) Software Technician Intel Corporation July 2014  – Present (1 year 2 months) Engineering Technician/Lab Manager Intel Corporation 2004  – Present (11 years) Folsom, CA Primary role: Characterization of the memory interface of Intel’s various processor products, using both system margining methodologies and direct signal integrity measurements. \nPerformed multiple job roles from project to project. Leveraged previous job experience in platform design to fill the role of Platform Owner, interfacing with board designers responsible for providing test boards to ensure the various requirements of electrical validation get into the designs often providing design solutions to the Board Designers that were accepted and implemented.  \nWent on a tour of duty as an Analog Engineer filling the role of Interface Owner in the Ivybridge Client Platform. In this role responsibilities covered constructing and executing a test plan to ensure proper System Margin Validation work was performed to ensure a proper PRQ recommendation to the project owners. Part of this plan included a Design of Experiments or DOE in which the varying contributors of DDR3 margin health were weighed and a set of test cases were created to construct a prediction model for failures per million over time. Also had to acquire some basic programming skills with Python to make changes to automated testing \nOwned various lab infrastructure items, performing the role of Lab Manager. In this role was responsible for the network and server health including over 60 desktop hosts and bring up of a new lab server with Windows Server 2008. Also interfaced with environmental health and safety, finance, Corporate Services, and security on a regular basis to ensure lab compliance with Intel policy. \nHave been a sponsor and immediate supervisor for 2-4 Contingent Workers since the beginning of 2011, monitoring work and providing performance feedback to the supplier upon request, and am the primary team member for screening and procuring contract support personnel. Engineering Technician/Lab Manager Intel Corporation 2004  – Present (11 years) Folsom, CA Primary role: Characterization of the memory interface of Intel’s various processor products, using both system margining methodologies and direct signal integrity measurements. \nPerformed multiple job roles from project to project. Leveraged previous job experience in platform design to fill the role of Platform Owner, interfacing with board designers responsible for providing test boards to ensure the various requirements of electrical validation get into the designs often providing design solutions to the Board Designers that were accepted and implemented.  \nWent on a tour of duty as an Analog Engineer filling the role of Interface Owner in the Ivybridge Client Platform. In this role responsibilities covered constructing and executing a test plan to ensure proper System Margin Validation work was performed to ensure a proper PRQ recommendation to the project owners. Part of this plan included a Design of Experiments or DOE in which the varying contributors of DDR3 margin health were weighed and a set of test cases were created to construct a prediction model for failures per million over time. Also had to acquire some basic programming skills with Python to make changes to automated testing \nOwned various lab infrastructure items, performing the role of Lab Manager. In this role was responsible for the network and server health including over 60 desktop hosts and bring up of a new lab server with Windows Server 2008. Also interfaced with environmental health and safety, finance, Corporate Services, and security on a regular basis to ensure lab compliance with Intel policy. \nHave been a sponsor and immediate supervisor for 2-4 Contingent Workers since the beginning of 2011, monitoring work and providing performance feedback to the supplier upon request, and am the primary team member for screening and procuring contract support personnel. Skills Engineering SPC Semiconductors Semiconductor Industry Design of Experiments Silicon IC Failure Analysis Metrology Electronics Silicon Validation Electronic Circuit... Schematic Capture Fault Isolation Signal Integrity PCIe DDR3 USB SATA Telecommunications Motion Control Debugging See 7+     See less Skills  Engineering SPC Semiconductors Semiconductor Industry Design of Experiments Silicon IC Failure Analysis Metrology Electronics Silicon Validation Electronic Circuit... Schematic Capture Fault Isolation Signal Integrity PCIe DDR3 USB SATA Telecommunications Motion Control Debugging See 7+     See less Engineering SPC Semiconductors Semiconductor Industry Design of Experiments Silicon IC Failure Analysis Metrology Electronics Silicon Validation Electronic Circuit... Schematic Capture Fault Isolation Signal Integrity PCIe DDR3 USB SATA Telecommunications Motion Control Debugging See 7+     See less Engineering SPC Semiconductors Semiconductor Industry Design of Experiments Silicon IC Failure Analysis Metrology Electronics Silicon Validation Electronic Circuit... Schematic Capture Fault Isolation Signal Integrity PCIe DDR3 USB SATA Telecommunications Motion Control Debugging See 7+     See less Education Heald College-Roseville Associate of Science (A.S.),  Electronics Technology , 3.9 1995  – 1997 Activities and Societies:  Graduated with Honors Heald College-Roseville Associate of Science (A.S.),  Electronics Technology , 3.9 1995  – 1997 Activities and Societies:  Graduated with Honors Heald College-Roseville Associate of Science (A.S.),  Electronics Technology , 3.9 1995  – 1997 Activities and Societies:  Graduated with Honors Heald College-Roseville Associate of Science (A.S.),  Electronics Technology , 3.9 1995  – 1997 Activities and Societies:  Graduated with Honors ", "Summary IT generalist with over 20 years of professional experience in supporting complex networked environments including all versions of Microsoft Windows Server, Dynix/PTX and other Unix & Linux based operating systems, Veritas and Symantec enterprise network backup solutions, Virtualization technologies, common off the shelf software application packages, and end user support. Knowledgeable in several areas of IT business practices including Sarbanes-Oxley and HIPAA reporting requirements, security management, with a track record of utilizing proven methodologies of systems planning, implementation and deployment. \n \nSpecialties:  \n• Effectively communicates technical concepts to individuals of varied backgrounds. \n• Catalyst for generating dialog in teams of various sizes. \n• Dynamically develops creative solutions to technical problems. Summary IT generalist with over 20 years of professional experience in supporting complex networked environments including all versions of Microsoft Windows Server, Dynix/PTX and other Unix & Linux based operating systems, Veritas and Symantec enterprise network backup solutions, Virtualization technologies, common off the shelf software application packages, and end user support. Knowledgeable in several areas of IT business practices including Sarbanes-Oxley and HIPAA reporting requirements, security management, with a track record of utilizing proven methodologies of systems planning, implementation and deployment. \n \nSpecialties:  \n• Effectively communicates technical concepts to individuals of varied backgrounds. \n• Catalyst for generating dialog in teams of various sizes. \n• Dynamically develops creative solutions to technical problems. IT generalist with over 20 years of professional experience in supporting complex networked environments including all versions of Microsoft Windows Server, Dynix/PTX and other Unix & Linux based operating systems, Veritas and Symantec enterprise network backup solutions, Virtualization technologies, common off the shelf software application packages, and end user support. Knowledgeable in several areas of IT business practices including Sarbanes-Oxley and HIPAA reporting requirements, security management, with a track record of utilizing proven methodologies of systems planning, implementation and deployment. \n \nSpecialties:  \n• Effectively communicates technical concepts to individuals of varied backgrounds. \n• Catalyst for generating dialog in teams of various sizes. \n• Dynamically develops creative solutions to technical problems. IT generalist with over 20 years of professional experience in supporting complex networked environments including all versions of Microsoft Windows Server, Dynix/PTX and other Unix & Linux based operating systems, Veritas and Symantec enterprise network backup solutions, Virtualization technologies, common off the shelf software application packages, and end user support. Knowledgeable in several areas of IT business practices including Sarbanes-Oxley and HIPAA reporting requirements, security management, with a track record of utilizing proven methodologies of systems planning, implementation and deployment. \n \nSpecialties:  \n• Effectively communicates technical concepts to individuals of varied backgrounds. \n• Catalyst for generating dialog in teams of various sizes. \n• Dynamically develops creative solutions to technical problems. Languages   Skills Virtualization Server Administration Desktop Management Windows Server 2008 Linux server... Dell PowerEdge Servers Storage Management VoIP Cisco IOS Access Control HIPAA Wireless Networking Novell Netware DNS management DHCP Windows Server Hardware System Administration VPN Cisco Technologies Windows Network Administration Software Documentation Operating Systems Networking Integration System Deployment Troubleshooting Servers Unix Linux Computer Hardware See 17+     See less Skills  Virtualization Server Administration Desktop Management Windows Server 2008 Linux server... Dell PowerEdge Servers Storage Management VoIP Cisco IOS Access Control HIPAA Wireless Networking Novell Netware DNS management DHCP Windows Server Hardware System Administration VPN Cisco Technologies Windows Network Administration Software Documentation Operating Systems Networking Integration System Deployment Troubleshooting Servers Unix Linux Computer Hardware See 17+     See less Virtualization Server Administration Desktop Management Windows Server 2008 Linux server... Dell PowerEdge Servers Storage Management VoIP Cisco IOS Access Control HIPAA Wireless Networking Novell Netware DNS management DHCP Windows Server Hardware System Administration VPN Cisco Technologies Windows Network Administration Software Documentation Operating Systems Networking Integration System Deployment Troubleshooting Servers Unix Linux Computer Hardware See 17+     See less Virtualization Server Administration Desktop Management Windows Server 2008 Linux server... Dell PowerEdge Servers Storage Management VoIP Cisco IOS Access Control HIPAA Wireless Networking Novell Netware DNS management DHCP Windows Server Hardware System Administration VPN Cisco Technologies Windows Network Administration Software Documentation Operating Systems Networking Integration System Deployment Troubleshooting Servers Unix Linux Computer Hardware See 17+     See less ", "Summary QA Test technician, performing black box testing of computer hardware and software. Execute test plans as determined by software/hardware engineers, record defects in a defect tracking database; troubleshoot/debug issues; perform regression testing on new software builds; adhere to product life cycle guidelines; build test beds and maintain equipment; installation of operating systems, device drivers and other components. Specialties:Hardware/software troubleshooting. Expertise with Microsoft-based operating systems. Summary QA Test technician, performing black box testing of computer hardware and software. Execute test plans as determined by software/hardware engineers, record defects in a defect tracking database; troubleshoot/debug issues; perform regression testing on new software builds; adhere to product life cycle guidelines; build test beds and maintain equipment; installation of operating systems, device drivers and other components. Specialties:Hardware/software troubleshooting. Expertise with Microsoft-based operating systems. QA Test technician, performing black box testing of computer hardware and software. Execute test plans as determined by software/hardware engineers, record defects in a defect tracking database; troubleshoot/debug issues; perform regression testing on new software builds; adhere to product life cycle guidelines; build test beds and maintain equipment; installation of operating systems, device drivers and other components. Specialties:Hardware/software troubleshooting. Expertise with Microsoft-based operating systems. QA Test technician, performing black box testing of computer hardware and software. Execute test plans as determined by software/hardware engineers, record defects in a defect tracking database; troubleshoot/debug issues; perform regression testing on new software builds; adhere to product life cycle guidelines; build test beds and maintain equipment; installation of operating systems, device drivers and other components. Specialties:Hardware/software troubleshooting. Expertise with Microsoft-based operating systems. Experience Software Technician Intel Corporation September 2000  –  February 2003  (2 years 6 months) Technician assigned to BIOS testing lab. Manual and automated testing of Intel motherboard and Original Equipment Manufacturer (OEM) BIOS software. Testing of BIOS features to comply with Microsoft Hardware Compatibility Testing (HCT) and Windows Hardware Quality Lab (WHQL) guidelines in Windows XP; Windows 2000; Windows ME; and Windows 98. Regression testing of open defects and other testing as required. Testing of special features and situations requested by OEM partners. Defect tracking and reporting through PVCS Tracker. Assisted in writing and implementing new or revised test cases and scenarios. Software Technician Intel Corporation April 1999  –  September 2000  (1 year 6 months) Manager of print server test lab (100+ clients and servers). Installation, configuration and deployment of client workstations and servers, supporting: Windows 3.11; Windows 95; Windows 98; Windows NT 3.51; Windows NT 4.0; Windows 2000; Novell Netware versions 3.X, 4.X, and 5.X; Red Hat Linux; Sun Unix. Direct support to QA engineers through troubleshooting and resolving hardware and software issues. Equipment and asset management. Part-time QA test technician for group: executed test cases as directed for print-server products and network appliances. Defect tracking and reporting through PVCS Tracker Contractor -- QA Test Technician CDI Information Services November 1998  –  February 1999  (4 months) Contract assignment to Intel Corporation, QA Test Technician. Compatibility testing of video card BIOS and driver software under Windows 95, 98, and Windows NT 4.0. Building and configuration of test systems. Defect tracking and reporting through PVCS Tracker. Regression testing of new driver builds. WHQL testing and certification of drivers. Contractor -- QA Test Technician Everest Consultants October 1997  –  November 1998  (1 year 2 months) Contract postion to Hewlett-Packard, mobile computing division, Corvallis, OR. QA Test Technician. Software and hardware compatibility testing of Omnibook Notebook computers. Compatibility Testing of devices such as PC-Card modems, network adapters, hard disk drives, memory modules, DvD, power management support, and notebook security measures under Windows 3.11, Windows 95, Windows 98 and Windows NT 4.0. Installation of operating systems and device drivers. Defect tracking and reporting using IBM’s Lotus Notes Journalist Armed Forces Radio Service (AFRTS) 1986  –  1992  (6 years) Software Technician Intel Corporation September 2000  –  February 2003  (2 years 6 months) Technician assigned to BIOS testing lab. Manual and automated testing of Intel motherboard and Original Equipment Manufacturer (OEM) BIOS software. Testing of BIOS features to comply with Microsoft Hardware Compatibility Testing (HCT) and Windows Hardware Quality Lab (WHQL) guidelines in Windows XP; Windows 2000; Windows ME; and Windows 98. Regression testing of open defects and other testing as required. Testing of special features and situations requested by OEM partners. Defect tracking and reporting through PVCS Tracker. Assisted in writing and implementing new or revised test cases and scenarios. Software Technician Intel Corporation September 2000  –  February 2003  (2 years 6 months) Technician assigned to BIOS testing lab. Manual and automated testing of Intel motherboard and Original Equipment Manufacturer (OEM) BIOS software. Testing of BIOS features to comply with Microsoft Hardware Compatibility Testing (HCT) and Windows Hardware Quality Lab (WHQL) guidelines in Windows XP; Windows 2000; Windows ME; and Windows 98. Regression testing of open defects and other testing as required. Testing of special features and situations requested by OEM partners. Defect tracking and reporting through PVCS Tracker. Assisted in writing and implementing new or revised test cases and scenarios. Software Technician Intel Corporation April 1999  –  September 2000  (1 year 6 months) Manager of print server test lab (100+ clients and servers). Installation, configuration and deployment of client workstations and servers, supporting: Windows 3.11; Windows 95; Windows 98; Windows NT 3.51; Windows NT 4.0; Windows 2000; Novell Netware versions 3.X, 4.X, and 5.X; Red Hat Linux; Sun Unix. Direct support to QA engineers through troubleshooting and resolving hardware and software issues. Equipment and asset management. Part-time QA test technician for group: executed test cases as directed for print-server products and network appliances. Defect tracking and reporting through PVCS Tracker Software Technician Intel Corporation April 1999  –  September 2000  (1 year 6 months) Manager of print server test lab (100+ clients and servers). Installation, configuration and deployment of client workstations and servers, supporting: Windows 3.11; Windows 95; Windows 98; Windows NT 3.51; Windows NT 4.0; Windows 2000; Novell Netware versions 3.X, 4.X, and 5.X; Red Hat Linux; Sun Unix. Direct support to QA engineers through troubleshooting and resolving hardware and software issues. Equipment and asset management. Part-time QA test technician for group: executed test cases as directed for print-server products and network appliances. Defect tracking and reporting through PVCS Tracker Contractor -- QA Test Technician CDI Information Services November 1998  –  February 1999  (4 months) Contract assignment to Intel Corporation, QA Test Technician. Compatibility testing of video card BIOS and driver software under Windows 95, 98, and Windows NT 4.0. Building and configuration of test systems. Defect tracking and reporting through PVCS Tracker. Regression testing of new driver builds. WHQL testing and certification of drivers. Contractor -- QA Test Technician CDI Information Services November 1998  –  February 1999  (4 months) Contract assignment to Intel Corporation, QA Test Technician. Compatibility testing of video card BIOS and driver software under Windows 95, 98, and Windows NT 4.0. Building and configuration of test systems. Defect tracking and reporting through PVCS Tracker. Regression testing of new driver builds. WHQL testing and certification of drivers. Contractor -- QA Test Technician Everest Consultants October 1997  –  November 1998  (1 year 2 months) Contract postion to Hewlett-Packard, mobile computing division, Corvallis, OR. QA Test Technician. Software and hardware compatibility testing of Omnibook Notebook computers. Compatibility Testing of devices such as PC-Card modems, network adapters, hard disk drives, memory modules, DvD, power management support, and notebook security measures under Windows 3.11, Windows 95, Windows 98 and Windows NT 4.0. Installation of operating systems and device drivers. Defect tracking and reporting using IBM’s Lotus Notes Contractor -- QA Test Technician Everest Consultants October 1997  –  November 1998  (1 year 2 months) Contract postion to Hewlett-Packard, mobile computing division, Corvallis, OR. QA Test Technician. Software and hardware compatibility testing of Omnibook Notebook computers. Compatibility Testing of devices such as PC-Card modems, network adapters, hard disk drives, memory modules, DvD, power management support, and notebook security measures under Windows 3.11, Windows 95, Windows 98 and Windows NT 4.0. Installation of operating systems and device drivers. Defect tracking and reporting using IBM’s Lotus Notes Journalist Armed Forces Radio Service (AFRTS) 1986  –  1992  (6 years) Journalist Armed Forces Radio Service (AFRTS) 1986  –  1992  (6 years) Education Portland Community College N/A,  Political Science 2004  – 2006 Defense Information School Diploma,  Journalism 1986  – 1987 Portland Community College N/A,  Political Science 2004  – 2006 Portland Community College N/A,  Political Science 2004  – 2006 Portland Community College N/A,  Political Science 2004  – 2006 Defense Information School Diploma,  Journalism 1986  – 1987 Defense Information School Diploma,  Journalism 1986  – 1987 Defense Information School Diploma,  Journalism 1986  – 1987 ", "Experience Fishing Retired May 2008  – Present (7 years 4 months) Principal Software Engineer A-Gem Software Inc 1994  –  2007  (13 years) Contract Software Engineer, Experienced with Unix Device Drivers, Commerical Simulation Software, Commercial Test Applications Software and numerous gadgets needed to glue everything together. \nClients Included Intel, Mentor Graphics, IBM, Analogy/Avanti and Asset-Intertech. Software patents Asset's IBIST products granted are 7,590,504, 7,562,274. Some good fun with Jay Nejedlo's Test Group as well as with all of the Analog crew who are mostly with Mentor Graphics. Contract Software Engineer Self Employed 1990  –  1994  (4 years) Various Multiprocessor Test Software, Firmware, compiler, disassembliers and other contract work was done. Hypercube work (Mach Unix Variant). Another day, another processor instruction set to learn times. Senior Software Engineer Sequent Computer Systems 1983  –  1989  (6 years) Multiprocessor Unix work, Drivers (all types), Test Software, Performance Analysis, Firmware. I was in Casey Powell's crew, Bob Beck, Gary Feilland, Jack Inman. Later with Bob Knopp and many other good folks too numerous to mention here. Software Technician Intel Corporation 1980  –  1983  (3 years) Early Pioneer of Unix variant on Multibus based microcomputers. \nMain focus was Device Driver software. Fishing Retired May 2008  – Present (7 years 4 months) Fishing Retired May 2008  – Present (7 years 4 months) Principal Software Engineer A-Gem Software Inc 1994  –  2007  (13 years) Contract Software Engineer, Experienced with Unix Device Drivers, Commerical Simulation Software, Commercial Test Applications Software and numerous gadgets needed to glue everything together. \nClients Included Intel, Mentor Graphics, IBM, Analogy/Avanti and Asset-Intertech. Software patents Asset's IBIST products granted are 7,590,504, 7,562,274. Some good fun with Jay Nejedlo's Test Group as well as with all of the Analog crew who are mostly with Mentor Graphics. Principal Software Engineer A-Gem Software Inc 1994  –  2007  (13 years) Contract Software Engineer, Experienced with Unix Device Drivers, Commerical Simulation Software, Commercial Test Applications Software and numerous gadgets needed to glue everything together. \nClients Included Intel, Mentor Graphics, IBM, Analogy/Avanti and Asset-Intertech. Software patents Asset's IBIST products granted are 7,590,504, 7,562,274. Some good fun with Jay Nejedlo's Test Group as well as with all of the Analog crew who are mostly with Mentor Graphics. Contract Software Engineer Self Employed 1990  –  1994  (4 years) Various Multiprocessor Test Software, Firmware, compiler, disassembliers and other contract work was done. Hypercube work (Mach Unix Variant). Another day, another processor instruction set to learn times. Contract Software Engineer Self Employed 1990  –  1994  (4 years) Various Multiprocessor Test Software, Firmware, compiler, disassembliers and other contract work was done. Hypercube work (Mach Unix Variant). Another day, another processor instruction set to learn times. Senior Software Engineer Sequent Computer Systems 1983  –  1989  (6 years) Multiprocessor Unix work, Drivers (all types), Test Software, Performance Analysis, Firmware. I was in Casey Powell's crew, Bob Beck, Gary Feilland, Jack Inman. Later with Bob Knopp and many other good folks too numerous to mention here. Senior Software Engineer Sequent Computer Systems 1983  –  1989  (6 years) Multiprocessor Unix work, Drivers (all types), Test Software, Performance Analysis, Firmware. I was in Casey Powell's crew, Bob Beck, Gary Feilland, Jack Inman. Later with Bob Knopp and many other good folks too numerous to mention here. Software Technician Intel Corporation 1980  –  1983  (3 years) Early Pioneer of Unix variant on Multibus based microcomputers. \nMain focus was Device Driver software. Software Technician Intel Corporation 1980  –  1983  (3 years) Early Pioneer of Unix variant on Multibus based microcomputers. \nMain focus was Device Driver software. Skills Device Drivers Kernel Threads Object Oriented Design Software Engineering SCSI C++ Software Development Debugging Perl CVS C XML X86 Firmware C# Visual Studio Java Client/server Multithreading Testing See 6+     See less Skills  Device Drivers Kernel Threads Object Oriented Design Software Engineering SCSI C++ Software Development Debugging Perl CVS C XML X86 Firmware C# Visual Studio Java Client/server Multithreading Testing See 6+     See less Device Drivers Kernel Threads Object Oriented Design Software Engineering SCSI C++ Software Development Debugging Perl CVS C XML X86 Firmware C# Visual Studio Java Client/server Multithreading Testing See 6+     See less Device Drivers Kernel Threads Object Oriented Design Software Engineering SCSI C++ Software Development Debugging Perl CVS C XML X86 Firmware C# Visual Studio Java Client/server Multithreading Testing See 6+     See less ", "Summary I have over 14 years of technology and sound experience. Specialties:I specialize in sound engineering and audio certifications, although, general Q/A is also a strong point. Summary I have over 14 years of technology and sound experience. Specialties:I specialize in sound engineering and audio certifications, although, general Q/A is also a strong point. I have over 14 years of technology and sound experience. Specialties:I specialize in sound engineering and audio certifications, although, general Q/A is also a strong point. I have over 14 years of technology and sound experience. Specialties:I specialize in sound engineering and audio certifications, although, general Q/A is also a strong point. Experience Software Technician Intel Corporation July 2010  – Present (5 years 2 months) Audio Certification Execution Technician Intel May 2009  –  July 2010  (1 year 3 months) DHG SQE - Audio Certification Execution Technician: As a consulting alliance partner I am responsible for executing full testing, regression testing, and smoke testing for new Intel media products at the Intel Chandler, AZ design facility. I am also responsible for modification and testing of prototype media Intel products. I am responsible for testing new SoC software and firmware. Test certifications include Dolby Digital, Dolby Digital Plus, DDCO, DTS Neo6, DTS ADO, and DTS Master Audio. During test phases I am tasked with developing test automation ideas for streamlining the testing phases. Q/A Test Engineer 2WIRE INC. October 2004  –  May 2009  (4 years 8 months) CFT and Core test responsibility for 2Wire's Gateway division. Also Q/A for MediaPortal project. Dispatch/Tech Support Installco LLC. September 1998  –  October 2001  (3 years 2 months) Managed 30+ field technicians and provided phone support. Inside Sales Shingle & Gibb Automation 1989  –  1990  (1 year) Software Technician Intel Corporation July 2010  – Present (5 years 2 months) Software Technician Intel Corporation July 2010  – Present (5 years 2 months) Audio Certification Execution Technician Intel May 2009  –  July 2010  (1 year 3 months) DHG SQE - Audio Certification Execution Technician: As a consulting alliance partner I am responsible for executing full testing, regression testing, and smoke testing for new Intel media products at the Intel Chandler, AZ design facility. I am also responsible for modification and testing of prototype media Intel products. I am responsible for testing new SoC software and firmware. Test certifications include Dolby Digital, Dolby Digital Plus, DDCO, DTS Neo6, DTS ADO, and DTS Master Audio. During test phases I am tasked with developing test automation ideas for streamlining the testing phases. Audio Certification Execution Technician Intel May 2009  –  July 2010  (1 year 3 months) DHG SQE - Audio Certification Execution Technician: As a consulting alliance partner I am responsible for executing full testing, regression testing, and smoke testing for new Intel media products at the Intel Chandler, AZ design facility. I am also responsible for modification and testing of prototype media Intel products. I am responsible for testing new SoC software and firmware. Test certifications include Dolby Digital, Dolby Digital Plus, DDCO, DTS Neo6, DTS ADO, and DTS Master Audio. During test phases I am tasked with developing test automation ideas for streamlining the testing phases. Q/A Test Engineer 2WIRE INC. October 2004  –  May 2009  (4 years 8 months) CFT and Core test responsibility for 2Wire's Gateway division. Also Q/A for MediaPortal project. Q/A Test Engineer 2WIRE INC. October 2004  –  May 2009  (4 years 8 months) CFT and Core test responsibility for 2Wire's Gateway division. Also Q/A for MediaPortal project. Dispatch/Tech Support Installco LLC. September 1998  –  October 2001  (3 years 2 months) Managed 30+ field technicians and provided phone support. Dispatch/Tech Support Installco LLC. September 1998  –  October 2001  (3 years 2 months) Managed 30+ field technicians and provided phone support. Inside Sales Shingle & Gibb Automation 1989  –  1990  (1 year) Inside Sales Shingle & Gibb Automation 1989  –  1990  (1 year) Languages Spanish Spanish Spanish Skills TCP/IP Perl Debugging Linux Testing Embedded Systems Test Automation C++ Unix Python Software Development Wireless C Java Software Engineering Agile Methodologies Wireless Networking Hardware Embedded Software System Architecture Firmware See 6+     See less Skills  TCP/IP Perl Debugging Linux Testing Embedded Systems Test Automation C++ Unix Python Software Development Wireless C Java Software Engineering Agile Methodologies Wireless Networking Hardware Embedded Software System Architecture Firmware See 6+     See less TCP/IP Perl Debugging Linux Testing Embedded Systems Test Automation C++ Unix Python Software Development Wireless C Java Software Engineering Agile Methodologies Wireless Networking Hardware Embedded Software System Architecture Firmware See 6+     See less TCP/IP Perl Debugging Linux Testing Embedded Systems Test Automation C++ Unix Python Software Development Wireless C Java Software Engineering Agile Methodologies Wireless Networking Hardware Embedded Software System Architecture Firmware See 6+     See less ", "Experience Software Engineer Intel May 2007  – Present (8 years 4 months) Hillsboro Or I work in a group that creates content for testing Intel's processors during manufacturing. There are tests designed to hit specific features in each chip as well as general purpose tests that exercise the processor in its entirety. Electrical/Mechanical/software technician Intel Corporation October 1999  –  May 2007  (7 years 8 months) Hillsboro, Or This was a series of three jobs during my first 7 years at Intel where I built and maintained testers for motherboards, chipsets and finally processors. All testers had a combination of mechanical, electrical and softare features that had to be setup and maintained. Electrical technician Planar Systems April 1997  –  October 1999  (2 years 7 months) Hillsboro, Or I was a test technician who tested and repaired both customer returns and manufacturing defects of Planar's electroluminecent flat panel displays. All repairs were performed down to the component level and required surface mount soldering skills. Software Engineer Intel May 2007  – Present (8 years 4 months) Hillsboro Or I work in a group that creates content for testing Intel's processors during manufacturing. There are tests designed to hit specific features in each chip as well as general purpose tests that exercise the processor in its entirety. Software Engineer Intel May 2007  – Present (8 years 4 months) Hillsboro Or I work in a group that creates content for testing Intel's processors during manufacturing. There are tests designed to hit specific features in each chip as well as general purpose tests that exercise the processor in its entirety. Electrical/Mechanical/software technician Intel Corporation October 1999  –  May 2007  (7 years 8 months) Hillsboro, Or This was a series of three jobs during my first 7 years at Intel where I built and maintained testers for motherboards, chipsets and finally processors. All testers had a combination of mechanical, electrical and softare features that had to be setup and maintained. Electrical/Mechanical/software technician Intel Corporation October 1999  –  May 2007  (7 years 8 months) Hillsboro, Or This was a series of three jobs during my first 7 years at Intel where I built and maintained testers for motherboards, chipsets and finally processors. All testers had a combination of mechanical, electrical and softare features that had to be setup and maintained. Electrical technician Planar Systems April 1997  –  October 1999  (2 years 7 months) Hillsboro, Or I was a test technician who tested and repaired both customer returns and manufacturing defects of Planar's electroluminecent flat panel displays. All repairs were performed down to the component level and required surface mount soldering skills. Electrical technician Planar Systems April 1997  –  October 1999  (2 years 7 months) Hillsboro, Or I was a test technician who tested and repaired both customer returns and manufacturing defects of Planar's electroluminecent flat panel displays. All repairs were performed down to the component level and required surface mount soldering skills. Skills C++ Processors C# Python Debugging Software Engineering C Intel Testing Perl Manufacturing Linux Software Development Electronics Embedded Software Java Troubleshooting TCP/IP Programming Windows Operating Systems Firmware Visual Studio Computer Hardware Android Unix See 11+     See less Skills  C++ Processors C# Python Debugging Software Engineering C Intel Testing Perl Manufacturing Linux Software Development Electronics Embedded Software Java Troubleshooting TCP/IP Programming Windows Operating Systems Firmware Visual Studio Computer Hardware Android Unix See 11+     See less C++ Processors C# Python Debugging Software Engineering C Intel Testing Perl Manufacturing Linux Software Development Electronics Embedded Software Java Troubleshooting TCP/IP Programming Windows Operating Systems Firmware Visual Studio Computer Hardware Android Unix See 11+     See less C++ Processors C# Python Debugging Software Engineering C Intel Testing Perl Manufacturing Linux Software Development Electronics Embedded Software Java Troubleshooting TCP/IP Programming Windows Operating Systems Firmware Visual Studio Computer Hardware Android Unix See 11+     See less Education Oregon State University Computer Science 2013  – 2016 Oregon Institute of Technology 2010  – 2011 University of Phoenix Bachelor of Science,  Information Technology 2004  – 2006 Oregon State University Computer Science 2013  – 2016 Oregon State University Computer Science 2013  – 2016 Oregon State University Computer Science 2013  – 2016 Oregon Institute of Technology 2010  – 2011 Oregon Institute of Technology 2010  – 2011 Oregon Institute of Technology 2010  – 2011 University of Phoenix Bachelor of Science,  Information Technology 2004  – 2006 University of Phoenix Bachelor of Science,  Information Technology 2004  – 2006 University of Phoenix Bachelor of Science,  Information Technology 2004  – 2006 ", "Summary I am a Software Validation Professional for Intel Corporation. \n \nI provide WHCK (Windows Hardware Certification Kit) certification for graphics, audio, and storage drivers for the latest and greatest computer platforms. Summary I am a Software Validation Professional for Intel Corporation. \n \nI provide WHCK (Windows Hardware Certification Kit) certification for graphics, audio, and storage drivers for the latest and greatest computer platforms. I am a Software Validation Professional for Intel Corporation. \n \nI provide WHCK (Windows Hardware Certification Kit) certification for graphics, audio, and storage drivers for the latest and greatest computer platforms. I am a Software Validation Professional for Intel Corporation. \n \nI provide WHCK (Windows Hardware Certification Kit) certification for graphics, audio, and storage drivers for the latest and greatest computer platforms. Experience Software Technician Intel Corporation (IO WHQL and Certification) April 2013  – Present (2 years 5 months) Folsom, CA •\tProvided key support enabling the certification of the Intel Display Audio and Smart Sound Technology drivers for Windows 8.1 and the first Baytrail Windows 8 driver. \n•\tBrandon worked side by side with AEs, PTD lead, developers, and customer debug regarding customer escapes on HDMI audio through Sony’s all-in-one Haswell product relating to customer platform design. \n•\tBrandon provided last minute coverage for Intel Display Audio, Smart Sound Technology, RST, and Component testing on USB3 MTP Valleyview. Software Technician Intel Corporation (VPG GSDV WHQL) January 2008  –  April 2013  (5 years 4 months) Folsom, CA •\tRepresented the Gfx Cert. Team to provide initial and final support for the Haswell ULT Customer Workshop with Sony, Samsung, and Panasonic allowing Intel to provide important feedback to customers and gain an enhanced understanding of customer needs. \n•\tWorked directly with Intel’s customers, debug, and AEs to drive discovered issues to resolution \n•\tIntegral part of the Haswell ULT program supporting Windows 8.1 and HCK2.1, allowing certification and production version release in support of Windows 8.1. \n•\tTwo time recipient of the safety employee of the month award for increasing safety awareness and improving overall group scores from below 70% to above 90% Software Technician Intel Corporation (Internal Execution and ETM) October 2004  –  January 2008  (3 years 4 months) Folsom, CA •\tBrought large scale WHQL (Windows Hardware Quality Labs) multiplayer capability in record time to allow a 400% increase in job demand \n•\tManaged media related planning to ensure same day deployment of run schedule allowing for a 50% decrease of job cycle time \n•\tIntroduced HQV DVD benchmarking to provide preliminary feedback to the company developers, used by marketing to increased revenue to compare scores to competitors \n•\tKey ingredient towards first COPP (Certified Output Protection Protocol) enabled production driver and the successful deployment of new tests Computer Consultant Independent August 2002  –  October 2004  (2 years 3 months) South San Francisco, CA •\tInstalled, configured, and supported PCs and DSL networks for Olympics Dental’s new clinic \n•\tInstalled and maintained operating systems, software packages, and peripherals for Yolo Dental Practice \n•\tProvided end user training in operating systems, printers, scanners, and MS Office usage, and basic computer and network operations for Century 21 Systems Manager Lumenis April 2001  –  August 2002  (1 year 5 months) Santa Clara, CA •\tPromoted to Systems Manager \n•\tWorked with a team to migrate from Novell to NT \n•\tAssisted with the migration from CCMail to Exchange \n•\tIntegral team member in implementing VPN remote connectivity for all remote users including all of the sales force and service department \n•\tWorked closely with European IT team to set up several offices for business transactions all over Europe \n•\tReconfigured fax servers for the transition from Coherent Medical to Lumenis System Administrator Coherent Inc. September 1999  –  April 2001  (1 year 8 months) Santa Clara, CA •\tDetected enormous amounts disk space consumption on the ALPHA, CLALPH, and EUROPE nodes on several occasions, thus reducing downtime to a minimum \n•\tInitiated relations with the Alchemy Software group to implement resolutions to replace microfiche and reduce paper consumption by archiving reports on a web server and optical media* Generated a list of users by groups by writing a complicated script to assist in estimating costs for an Oracle implementation \n•\tAssisted in preparing the systems for Y2K System Administrator Sun Microsystems (via ORX Inc - consultant) January 1999  –  September 1999  (9 months) Milpitas, CA •\tSupported the Sunpeak project, a worldwide distributive system using the Sun Solaris and Oracle applications \n•\tPerformed program failure analysis using Unix, Oracle, and Autosys. Evaluated and troubleshot job failures Technical Support University of San Francisco May 1998  –  September 1999  (1 year 5 months) San Francisco, CA •\tProvided technical resolutions to students, faculty, and staff, using a service ticket system, for dial-up connectivity and other Internet related problems Computer Operations Analyst University of San Francisco January 1997  –  September 1999  (2 years 9 months) San Francisco, CA •\tControlled and monitored the operation of the Open VMS/Alpha System ensuring efficient use to meet the demands of the multi-user system and its users Software Technician Intel Corporation (IO WHQL and Certification) April 2013  – Present (2 years 5 months) Folsom, CA •\tProvided key support enabling the certification of the Intel Display Audio and Smart Sound Technology drivers for Windows 8.1 and the first Baytrail Windows 8 driver. \n•\tBrandon worked side by side with AEs, PTD lead, developers, and customer debug regarding customer escapes on HDMI audio through Sony’s all-in-one Haswell product relating to customer platform design. \n•\tBrandon provided last minute coverage for Intel Display Audio, Smart Sound Technology, RST, and Component testing on USB3 MTP Valleyview. Software Technician Intel Corporation (IO WHQL and Certification) April 2013  – Present (2 years 5 months) Folsom, CA •\tProvided key support enabling the certification of the Intel Display Audio and Smart Sound Technology drivers for Windows 8.1 and the first Baytrail Windows 8 driver. \n•\tBrandon worked side by side with AEs, PTD lead, developers, and customer debug regarding customer escapes on HDMI audio through Sony’s all-in-one Haswell product relating to customer platform design. \n•\tBrandon provided last minute coverage for Intel Display Audio, Smart Sound Technology, RST, and Component testing on USB3 MTP Valleyview. Software Technician Intel Corporation (VPG GSDV WHQL) January 2008  –  April 2013  (5 years 4 months) Folsom, CA •\tRepresented the Gfx Cert. Team to provide initial and final support for the Haswell ULT Customer Workshop with Sony, Samsung, and Panasonic allowing Intel to provide important feedback to customers and gain an enhanced understanding of customer needs. \n•\tWorked directly with Intel’s customers, debug, and AEs to drive discovered issues to resolution \n•\tIntegral part of the Haswell ULT program supporting Windows 8.1 and HCK2.1, allowing certification and production version release in support of Windows 8.1. \n•\tTwo time recipient of the safety employee of the month award for increasing safety awareness and improving overall group scores from below 70% to above 90% Software Technician Intel Corporation (VPG GSDV WHQL) January 2008  –  April 2013  (5 years 4 months) Folsom, CA •\tRepresented the Gfx Cert. Team to provide initial and final support for the Haswell ULT Customer Workshop with Sony, Samsung, and Panasonic allowing Intel to provide important feedback to customers and gain an enhanced understanding of customer needs. \n•\tWorked directly with Intel’s customers, debug, and AEs to drive discovered issues to resolution \n•\tIntegral part of the Haswell ULT program supporting Windows 8.1 and HCK2.1, allowing certification and production version release in support of Windows 8.1. \n•\tTwo time recipient of the safety employee of the month award for increasing safety awareness and improving overall group scores from below 70% to above 90% Software Technician Intel Corporation (Internal Execution and ETM) October 2004  –  January 2008  (3 years 4 months) Folsom, CA •\tBrought large scale WHQL (Windows Hardware Quality Labs) multiplayer capability in record time to allow a 400% increase in job demand \n•\tManaged media related planning to ensure same day deployment of run schedule allowing for a 50% decrease of job cycle time \n•\tIntroduced HQV DVD benchmarking to provide preliminary feedback to the company developers, used by marketing to increased revenue to compare scores to competitors \n•\tKey ingredient towards first COPP (Certified Output Protection Protocol) enabled production driver and the successful deployment of new tests Software Technician Intel Corporation (Internal Execution and ETM) October 2004  –  January 2008  (3 years 4 months) Folsom, CA •\tBrought large scale WHQL (Windows Hardware Quality Labs) multiplayer capability in record time to allow a 400% increase in job demand \n•\tManaged media related planning to ensure same day deployment of run schedule allowing for a 50% decrease of job cycle time \n•\tIntroduced HQV DVD benchmarking to provide preliminary feedback to the company developers, used by marketing to increased revenue to compare scores to competitors \n•\tKey ingredient towards first COPP (Certified Output Protection Protocol) enabled production driver and the successful deployment of new tests Computer Consultant Independent August 2002  –  October 2004  (2 years 3 months) South San Francisco, CA •\tInstalled, configured, and supported PCs and DSL networks for Olympics Dental’s new clinic \n•\tInstalled and maintained operating systems, software packages, and peripherals for Yolo Dental Practice \n•\tProvided end user training in operating systems, printers, scanners, and MS Office usage, and basic computer and network operations for Century 21 Computer Consultant Independent August 2002  –  October 2004  (2 years 3 months) South San Francisco, CA •\tInstalled, configured, and supported PCs and DSL networks for Olympics Dental’s new clinic \n•\tInstalled and maintained operating systems, software packages, and peripherals for Yolo Dental Practice \n•\tProvided end user training in operating systems, printers, scanners, and MS Office usage, and basic computer and network operations for Century 21 Systems Manager Lumenis April 2001  –  August 2002  (1 year 5 months) Santa Clara, CA •\tPromoted to Systems Manager \n•\tWorked with a team to migrate from Novell to NT \n•\tAssisted with the migration from CCMail to Exchange \n•\tIntegral team member in implementing VPN remote connectivity for all remote users including all of the sales force and service department \n•\tWorked closely with European IT team to set up several offices for business transactions all over Europe \n•\tReconfigured fax servers for the transition from Coherent Medical to Lumenis Systems Manager Lumenis April 2001  –  August 2002  (1 year 5 months) Santa Clara, CA •\tPromoted to Systems Manager \n•\tWorked with a team to migrate from Novell to NT \n•\tAssisted with the migration from CCMail to Exchange \n•\tIntegral team member in implementing VPN remote connectivity for all remote users including all of the sales force and service department \n•\tWorked closely with European IT team to set up several offices for business transactions all over Europe \n•\tReconfigured fax servers for the transition from Coherent Medical to Lumenis System Administrator Coherent Inc. September 1999  –  April 2001  (1 year 8 months) Santa Clara, CA •\tDetected enormous amounts disk space consumption on the ALPHA, CLALPH, and EUROPE nodes on several occasions, thus reducing downtime to a minimum \n•\tInitiated relations with the Alchemy Software group to implement resolutions to replace microfiche and reduce paper consumption by archiving reports on a web server and optical media* Generated a list of users by groups by writing a complicated script to assist in estimating costs for an Oracle implementation \n•\tAssisted in preparing the systems for Y2K System Administrator Coherent Inc. September 1999  –  April 2001  (1 year 8 months) Santa Clara, CA •\tDetected enormous amounts disk space consumption on the ALPHA, CLALPH, and EUROPE nodes on several occasions, thus reducing downtime to a minimum \n•\tInitiated relations with the Alchemy Software group to implement resolutions to replace microfiche and reduce paper consumption by archiving reports on a web server and optical media* Generated a list of users by groups by writing a complicated script to assist in estimating costs for an Oracle implementation \n•\tAssisted in preparing the systems for Y2K System Administrator Sun Microsystems (via ORX Inc - consultant) January 1999  –  September 1999  (9 months) Milpitas, CA •\tSupported the Sunpeak project, a worldwide distributive system using the Sun Solaris and Oracle applications \n•\tPerformed program failure analysis using Unix, Oracle, and Autosys. Evaluated and troubleshot job failures System Administrator Sun Microsystems (via ORX Inc - consultant) January 1999  –  September 1999  (9 months) Milpitas, CA •\tSupported the Sunpeak project, a worldwide distributive system using the Sun Solaris and Oracle applications \n•\tPerformed program failure analysis using Unix, Oracle, and Autosys. Evaluated and troubleshot job failures Technical Support University of San Francisco May 1998  –  September 1999  (1 year 5 months) San Francisco, CA •\tProvided technical resolutions to students, faculty, and staff, using a service ticket system, for dial-up connectivity and other Internet related problems Technical Support University of San Francisco May 1998  –  September 1999  (1 year 5 months) San Francisco, CA •\tProvided technical resolutions to students, faculty, and staff, using a service ticket system, for dial-up connectivity and other Internet related problems Computer Operations Analyst University of San Francisco January 1997  –  September 1999  (2 years 9 months) San Francisco, CA •\tControlled and monitored the operation of the Open VMS/Alpha System ensuring efficient use to meet the demands of the multi-user system and its users Computer Operations Analyst University of San Francisco January 1997  –  September 1999  (2 years 9 months) San Francisco, CA •\tControlled and monitored the operation of the Open VMS/Alpha System ensuring efficient use to meet the demands of the multi-user system and its users Skills Debugging Operating Systems Hardware Technical Support Perl Linux C++ Device Drivers Testing TCP/IP C Programming Software Development Embedded Systems Java Skills  Debugging Operating Systems Hardware Technical Support Perl Linux C++ Device Drivers Testing TCP/IP C Programming Software Development Embedded Systems Java Debugging Operating Systems Hardware Technical Support Perl Linux C++ Device Drivers Testing TCP/IP C Programming Software Development Embedded Systems Java Debugging Operating Systems Hardware Technical Support Perl Linux C++ Device Drivers Testing TCP/IP C Programming Software Development Embedded Systems Java Education DeVry University Bachelor's Degree,  Computer Engineering 2012  – 2015 Computer Learning Center Certificate,  Computer Programming 1996  – 1997 DeVry University Bachelor's Degree,  Computer Engineering 2012  – 2015 DeVry University Bachelor's Degree,  Computer Engineering 2012  – 2015 DeVry University Bachelor's Degree,  Computer Engineering 2012  – 2015 Computer Learning Center Certificate,  Computer Programming 1996  – 1997 Computer Learning Center Certificate,  Computer Programming 1996  – 1997 Computer Learning Center Certificate,  Computer Programming 1996  – 1997 ", "Experience Software Technician Intel Corporation Software Technician Intel Corporation Software Technician Intel Corporation Education Folsom Lake College Folsom Lake College Folsom Lake College Folsom Lake College ", "Summary Hands-on Technology Leader who thrives on turning around challenged businesses, building cohesive teams, and developing new platforms that enable companies to rapidly change direction, scale for growth, and accelerate sales. \n \nDelivered SaaS, Big Data, distributed, server, and desktop solutions in varied environments including Fortune 100, start-up, and mid sized privately held businesses. \n \nRecruited and managed cross functional teams comprised of software, database, network, system, and support staff who built the technology that drove a statistical/arbitrage business, for Schonfeld, from $0 to over $100 million in profit within 1.5 years. \n \nExperienced in applying Agile methodologies and principles to reduce product delivery schedules and improve customer satisfaction. \n \nScaled proprietary securities trading systems and quantitative trading strategies to manage trades of 600 million shares per day and more than $1 billion in market exposure. \n \nParticipated in M&A transactions totaling more than $350 million as a technology expert, advisor, and leader of post-merger technology integration. Versed in intellectual property protection, licensing, and asset transfer. \n \nCareer began at Intel’s R&D laboratory with the development of the ProShare Presenter, Intel Internet Phone, and CNN at Work products. Awarded the most prestigious award at Intel, the Intel Achievement Award, for delivering the Intel Internet Phone. \n Summary Hands-on Technology Leader who thrives on turning around challenged businesses, building cohesive teams, and developing new platforms that enable companies to rapidly change direction, scale for growth, and accelerate sales. \n \nDelivered SaaS, Big Data, distributed, server, and desktop solutions in varied environments including Fortune 100, start-up, and mid sized privately held businesses. \n \nRecruited and managed cross functional teams comprised of software, database, network, system, and support staff who built the technology that drove a statistical/arbitrage business, for Schonfeld, from $0 to over $100 million in profit within 1.5 years. \n \nExperienced in applying Agile methodologies and principles to reduce product delivery schedules and improve customer satisfaction. \n \nScaled proprietary securities trading systems and quantitative trading strategies to manage trades of 600 million shares per day and more than $1 billion in market exposure. \n \nParticipated in M&A transactions totaling more than $350 million as a technology expert, advisor, and leader of post-merger technology integration. Versed in intellectual property protection, licensing, and asset transfer. \n \nCareer began at Intel’s R&D laboratory with the development of the ProShare Presenter, Intel Internet Phone, and CNN at Work products. Awarded the most prestigious award at Intel, the Intel Achievement Award, for delivering the Intel Internet Phone. \n Hands-on Technology Leader who thrives on turning around challenged businesses, building cohesive teams, and developing new platforms that enable companies to rapidly change direction, scale for growth, and accelerate sales. \n \nDelivered SaaS, Big Data, distributed, server, and desktop solutions in varied environments including Fortune 100, start-up, and mid sized privately held businesses. \n \nRecruited and managed cross functional teams comprised of software, database, network, system, and support staff who built the technology that drove a statistical/arbitrage business, for Schonfeld, from $0 to over $100 million in profit within 1.5 years. \n \nExperienced in applying Agile methodologies and principles to reduce product delivery schedules and improve customer satisfaction. \n \nScaled proprietary securities trading systems and quantitative trading strategies to manage trades of 600 million shares per day and more than $1 billion in market exposure. \n \nParticipated in M&A transactions totaling more than $350 million as a technology expert, advisor, and leader of post-merger technology integration. Versed in intellectual property protection, licensing, and asset transfer. \n \nCareer began at Intel’s R&D laboratory with the development of the ProShare Presenter, Intel Internet Phone, and CNN at Work products. Awarded the most prestigious award at Intel, the Intel Achievement Award, for delivering the Intel Internet Phone. \n Hands-on Technology Leader who thrives on turning around challenged businesses, building cohesive teams, and developing new platforms that enable companies to rapidly change direction, scale for growth, and accelerate sales. \n \nDelivered SaaS, Big Data, distributed, server, and desktop solutions in varied environments including Fortune 100, start-up, and mid sized privately held businesses. \n \nRecruited and managed cross functional teams comprised of software, database, network, system, and support staff who built the technology that drove a statistical/arbitrage business, for Schonfeld, from $0 to over $100 million in profit within 1.5 years. \n \nExperienced in applying Agile methodologies and principles to reduce product delivery schedules and improve customer satisfaction. \n \nScaled proprietary securities trading systems and quantitative trading strategies to manage trades of 600 million shares per day and more than $1 billion in market exposure. \n \nParticipated in M&A transactions totaling more than $350 million as a technology expert, advisor, and leader of post-merger technology integration. Versed in intellectual property protection, licensing, and asset transfer. \n \nCareer began at Intel’s R&D laboratory with the development of the ProShare Presenter, Intel Internet Phone, and CNN at Work products. Awarded the most prestigious award at Intel, the Intel Achievement Award, for delivering the Intel Internet Phone. \n Experience Principal Ransom Group Services, LLC January 2014  –  August 2015  (1 year 8 months) Conducted market research, market validation, and pilot programs for a publicly traded company wishing to monetize its proprietary data with investment and trading firms. \n \nCurrently building a scalable B2C cloud-based SaaS tool, on Amazon Web Services, for a long term investing tool that uses a proprietary model to reduce portfolio volatility and increase long-term returns. \n \nEstablishing development process, cloud migration, and technology roadmap for a small regional bank. \n \nProviding advice and counsel to small companies on technology related matters. Partner and Chief Technology Officer Kershner Trading Group 2011  –  2014  (3 years) Joined the company as an Independent Quantitative Automated Trader with a focus on utilizing machine learning techniques to data mine and build trading strategies. Later assumed role of CTO to expand the quantitative automated trading businesses by establishing technologies and processes. Partner and Chief Technology Officer Schonfeld Group Holdings, LLC 2004  –  2011  (7 years) Recruited to relocate to NY to oversee technology assets across the Schonfeld family of trading companies. Established new technology teams, methodologies, and communication practices throughout the organization. Oversaw a team of 65 professionals and a $7 million budget. Co-managed a group of quantitative analysts responsible for building automated black box trading algorithms. Co-Founder and Chief Technology Officer Gorilla Communications and TeamTrust 2002  –  2004  (2 years) Co-founded the company and oversaw development of the business model, market entry strategy, product positioning, product definition, pricing model, strategic partnerships, customer support, and sales strategies. \n \nDeveloped a distributed architecture tool that could handle complex deployment environments while exceling at facilitating communication and process management for loosely coupled groups. The solution leveraged open source development tools, databases, web servers, and utility libraries to delivery a production quality system. Established a standard software development process. Chief Development Officer and Order System Architect ProTrader Securities / Instinet 2000  –  2002  (2 years) Recruited to repair and engineer stability in ProTrader’s trading system after the firm lost most of its development team in a labor dispute. Overarching goal was to fix problems that led to daily catastrophic system-wide failures that cost the firm significant revenue and caused customer dissatisfaction. Vice President of Technology Electronic Business Exchange 1998  –  2000  (2 years) Recruited to a pre-funding start-up to deliver a web-based electronic exchange for B2B verticals on a minimal budget. Led a team of 3 and supported business development, fundraising, strategic planning, budgeting, and vendor interaction. President and Chief Technology Officer, CSI.net Momentum Securities 1997  –  1998  (1 year) CSI.net was a subsidiary of Momentum that developed trading platforms for use by Momentum and licensed to other trading firms. \n \nHired to deliver a second-generation trading platform that provided traders with instant access to markets while fulfilling all brokerage and regulatory requirements. Oversaw a team of 12 technologists. Software Development Manager Intel Corporation September 1996  –  September 1997  (1 year 1 month) Promoted to lead a team of 5 software development and QA engineers responsible for delivering multiple Internet telephony products. The Group’s overarching goal was to develop technology prototypes and to transition viable product opportunities to trial markets. Developed strategies and tactical planning for the group and the larger organization. Senior Software Engineer Intel Corporation August 1992  –  August 1996  (4 years 1 month) Promoted to lead a team of 25 technology professionals to develop three high-profile products: Intel Internet Phone, ProShare Presenter, and CNN at Work. Oversaw developer workload, tracked defects, managed the development process, and coordinated with product support groups. Developed high demand, low tolerant control and data systems. Software Engineer Intel Corporation February 1991  –  July 1992  (1 year 6 months) Promoted to develop Windows multimedia technologies and rapid prototypes. Delivered Intel’s first software-only audio, video, and data conferencing prototype that provided a technology base for Intel’s conferencing and telephony product lines. Software Technician Intel Corporation January 1990  –  January 1991  (1 year 1 month) Recruited to join Intel as a full time employee to develop hardware evaluation and manufacturing tests suites. Produced manufacturing test suites to validate board quality. Software Technician Bridgeport Staffing (Contracted to Intel) May 1987  –  January 1990  (2 years 9 months) Hired while still a full-time high school student to develop and maintain build and configuration management scripts. Served as administrator for electronic mail post office, file servers and backup. Principal Ransom Group Services, LLC January 2014  –  August 2015  (1 year 8 months) Conducted market research, market validation, and pilot programs for a publicly traded company wishing to monetize its proprietary data with investment and trading firms. \n \nCurrently building a scalable B2C cloud-based SaaS tool, on Amazon Web Services, for a long term investing tool that uses a proprietary model to reduce portfolio volatility and increase long-term returns. \n \nEstablishing development process, cloud migration, and technology roadmap for a small regional bank. \n \nProviding advice and counsel to small companies on technology related matters. Principal Ransom Group Services, LLC January 2014  –  August 2015  (1 year 8 months) Conducted market research, market validation, and pilot programs for a publicly traded company wishing to monetize its proprietary data with investment and trading firms. \n \nCurrently building a scalable B2C cloud-based SaaS tool, on Amazon Web Services, for a long term investing tool that uses a proprietary model to reduce portfolio volatility and increase long-term returns. \n \nEstablishing development process, cloud migration, and technology roadmap for a small regional bank. \n \nProviding advice and counsel to small companies on technology related matters. Partner and Chief Technology Officer Kershner Trading Group 2011  –  2014  (3 years) Joined the company as an Independent Quantitative Automated Trader with a focus on utilizing machine learning techniques to data mine and build trading strategies. Later assumed role of CTO to expand the quantitative automated trading businesses by establishing technologies and processes. Partner and Chief Technology Officer Kershner Trading Group 2011  –  2014  (3 years) Joined the company as an Independent Quantitative Automated Trader with a focus on utilizing machine learning techniques to data mine and build trading strategies. Later assumed role of CTO to expand the quantitative automated trading businesses by establishing technologies and processes. Partner and Chief Technology Officer Schonfeld Group Holdings, LLC 2004  –  2011  (7 years) Recruited to relocate to NY to oversee technology assets across the Schonfeld family of trading companies. Established new technology teams, methodologies, and communication practices throughout the organization. Oversaw a team of 65 professionals and a $7 million budget. Co-managed a group of quantitative analysts responsible for building automated black box trading algorithms. Partner and Chief Technology Officer Schonfeld Group Holdings, LLC 2004  –  2011  (7 years) Recruited to relocate to NY to oversee technology assets across the Schonfeld family of trading companies. Established new technology teams, methodologies, and communication practices throughout the organization. Oversaw a team of 65 professionals and a $7 million budget. Co-managed a group of quantitative analysts responsible for building automated black box trading algorithms. Co-Founder and Chief Technology Officer Gorilla Communications and TeamTrust 2002  –  2004  (2 years) Co-founded the company and oversaw development of the business model, market entry strategy, product positioning, product definition, pricing model, strategic partnerships, customer support, and sales strategies. \n \nDeveloped a distributed architecture tool that could handle complex deployment environments while exceling at facilitating communication and process management for loosely coupled groups. The solution leveraged open source development tools, databases, web servers, and utility libraries to delivery a production quality system. Established a standard software development process. Co-Founder and Chief Technology Officer Gorilla Communications and TeamTrust 2002  –  2004  (2 years) Co-founded the company and oversaw development of the business model, market entry strategy, product positioning, product definition, pricing model, strategic partnerships, customer support, and sales strategies. \n \nDeveloped a distributed architecture tool that could handle complex deployment environments while exceling at facilitating communication and process management for loosely coupled groups. The solution leveraged open source development tools, databases, web servers, and utility libraries to delivery a production quality system. Established a standard software development process. Chief Development Officer and Order System Architect ProTrader Securities / Instinet 2000  –  2002  (2 years) Recruited to repair and engineer stability in ProTrader’s trading system after the firm lost most of its development team in a labor dispute. Overarching goal was to fix problems that led to daily catastrophic system-wide failures that cost the firm significant revenue and caused customer dissatisfaction. Chief Development Officer and Order System Architect ProTrader Securities / Instinet 2000  –  2002  (2 years) Recruited to repair and engineer stability in ProTrader’s trading system after the firm lost most of its development team in a labor dispute. Overarching goal was to fix problems that led to daily catastrophic system-wide failures that cost the firm significant revenue and caused customer dissatisfaction. Vice President of Technology Electronic Business Exchange 1998  –  2000  (2 years) Recruited to a pre-funding start-up to deliver a web-based electronic exchange for B2B verticals on a minimal budget. Led a team of 3 and supported business development, fundraising, strategic planning, budgeting, and vendor interaction. Vice President of Technology Electronic Business Exchange 1998  –  2000  (2 years) Recruited to a pre-funding start-up to deliver a web-based electronic exchange for B2B verticals on a minimal budget. Led a team of 3 and supported business development, fundraising, strategic planning, budgeting, and vendor interaction. President and Chief Technology Officer, CSI.net Momentum Securities 1997  –  1998  (1 year) CSI.net was a subsidiary of Momentum that developed trading platforms for use by Momentum and licensed to other trading firms. \n \nHired to deliver a second-generation trading platform that provided traders with instant access to markets while fulfilling all brokerage and regulatory requirements. Oversaw a team of 12 technologists. President and Chief Technology Officer, CSI.net Momentum Securities 1997  –  1998  (1 year) CSI.net was a subsidiary of Momentum that developed trading platforms for use by Momentum and licensed to other trading firms. \n \nHired to deliver a second-generation trading platform that provided traders with instant access to markets while fulfilling all brokerage and regulatory requirements. Oversaw a team of 12 technologists. Software Development Manager Intel Corporation September 1996  –  September 1997  (1 year 1 month) Promoted to lead a team of 5 software development and QA engineers responsible for delivering multiple Internet telephony products. The Group’s overarching goal was to develop technology prototypes and to transition viable product opportunities to trial markets. Developed strategies and tactical planning for the group and the larger organization. Software Development Manager Intel Corporation September 1996  –  September 1997  (1 year 1 month) Promoted to lead a team of 5 software development and QA engineers responsible for delivering multiple Internet telephony products. The Group’s overarching goal was to develop technology prototypes and to transition viable product opportunities to trial markets. Developed strategies and tactical planning for the group and the larger organization. Senior Software Engineer Intel Corporation August 1992  –  August 1996  (4 years 1 month) Promoted to lead a team of 25 technology professionals to develop three high-profile products: Intel Internet Phone, ProShare Presenter, and CNN at Work. Oversaw developer workload, tracked defects, managed the development process, and coordinated with product support groups. Developed high demand, low tolerant control and data systems. Senior Software Engineer Intel Corporation August 1992  –  August 1996  (4 years 1 month) Promoted to lead a team of 25 technology professionals to develop three high-profile products: Intel Internet Phone, ProShare Presenter, and CNN at Work. Oversaw developer workload, tracked defects, managed the development process, and coordinated with product support groups. Developed high demand, low tolerant control and data systems. Software Engineer Intel Corporation February 1991  –  July 1992  (1 year 6 months) Promoted to develop Windows multimedia technologies and rapid prototypes. Delivered Intel’s first software-only audio, video, and data conferencing prototype that provided a technology base for Intel’s conferencing and telephony product lines. Software Engineer Intel Corporation February 1991  –  July 1992  (1 year 6 months) Promoted to develop Windows multimedia technologies and rapid prototypes. Delivered Intel’s first software-only audio, video, and data conferencing prototype that provided a technology base for Intel’s conferencing and telephony product lines. Software Technician Intel Corporation January 1990  –  January 1991  (1 year 1 month) Recruited to join Intel as a full time employee to develop hardware evaluation and manufacturing tests suites. Produced manufacturing test suites to validate board quality. Software Technician Intel Corporation January 1990  –  January 1991  (1 year 1 month) Recruited to join Intel as a full time employee to develop hardware evaluation and manufacturing tests suites. Produced manufacturing test suites to validate board quality. Software Technician Bridgeport Staffing (Contracted to Intel) May 1987  –  January 1990  (2 years 9 months) Hired while still a full-time high school student to develop and maintain build and configuration management scripts. Served as administrator for electronic mail post office, file servers and backup. Software Technician Bridgeport Staffing (Contracted to Intel) May 1987  –  January 1990  (2 years 9 months) Hired while still a full-time high school student to develop and maintain build and configuration management scripts. Served as administrator for electronic mail post office, file servers and backup. Languages English English English Skills Trading Systems Electronic Trading Software Development Equities Equity Trading Trading Hedge Funds Market Data Trading Strategies High Frequency Trading Options C Derivatives Distributed Systems C++ Mergers & Acquisitions Start-ups SQL Linux Agile Methodologies XML Unix Java Portfolio Management Machine Learning Python NoSQL Management Integration TCP/IP IP Multicast Node.js Databases Leadership System Architecture Entrepreneurship Financial Markets SDLC Vendor Management IT Strategy Risk Management Program Management Product Management Product Development Cloud Computing SaaS Strategic Partnerships Securities Software Engineering Team Leadership See 35+     See less Skills  Trading Systems Electronic Trading Software Development Equities Equity Trading Trading Hedge Funds Market Data Trading Strategies High Frequency Trading Options C Derivatives Distributed Systems C++ Mergers & Acquisitions Start-ups SQL Linux Agile Methodologies XML Unix Java Portfolio Management Machine Learning Python NoSQL Management Integration TCP/IP IP Multicast Node.js Databases Leadership System Architecture Entrepreneurship Financial Markets SDLC Vendor Management IT Strategy Risk Management Program Management Product Management Product Development Cloud Computing SaaS Strategic Partnerships Securities Software Engineering Team Leadership See 35+     See less Trading Systems Electronic Trading Software Development Equities Equity Trading Trading Hedge Funds Market Data Trading Strategies High Frequency Trading Options C Derivatives Distributed Systems C++ Mergers & Acquisitions Start-ups SQL Linux Agile Methodologies XML Unix Java Portfolio Management Machine Learning Python NoSQL Management Integration TCP/IP IP Multicast Node.js Databases Leadership System Architecture Entrepreneurship Financial Markets SDLC Vendor Management IT Strategy Risk Management Program Management Product Management Product Development Cloud Computing SaaS Strategic Partnerships Securities Software Engineering Team Leadership See 35+     See less Trading Systems Electronic Trading Software Development Equities Equity Trading Trading Hedge Funds Market Data Trading Strategies High Frequency Trading Options C Derivatives Distributed Systems C++ Mergers & Acquisitions Start-ups SQL Linux Agile Methodologies XML Unix Java Portfolio Management Machine Learning Python NoSQL Management Integration TCP/IP IP Multicast Node.js Databases Leadership System Architecture Entrepreneurship Financial Markets SDLC Vendor Management IT Strategy Risk Management Program Management Product Management Product Development Cloud Computing SaaS Strategic Partnerships Securities Software Engineering Team Leadership See 35+     See less ", "Skills Network Administration Microsoft Technologies VMware ESX Operations Management Change Management Vendor Management Contract Management Staff Management Semiconductor Industry Biotechnology Industry SaaS Hadoop administration Linux System... Software Development Datacenter management Online Advertising Data Center Cloud Computing Linux SQL Databases Hadoop See 7+     See less Skills  Network Administration Microsoft Technologies VMware ESX Operations Management Change Management Vendor Management Contract Management Staff Management Semiconductor Industry Biotechnology Industry SaaS Hadoop administration Linux System... Software Development Datacenter management Online Advertising Data Center Cloud Computing Linux SQL Databases Hadoop See 7+     See less Network Administration Microsoft Technologies VMware ESX Operations Management Change Management Vendor Management Contract Management Staff Management Semiconductor Industry Biotechnology Industry SaaS Hadoop administration Linux System... Software Development Datacenter management Online Advertising Data Center Cloud Computing Linux SQL Databases Hadoop See 7+     See less Network Administration Microsoft Technologies VMware ESX Operations Management Change Management Vendor Management Contract Management Staff Management Semiconductor Industry Biotechnology Industry SaaS Hadoop administration Linux System... Software Development Datacenter management Online Advertising Data Center Cloud Computing Linux SQL Databases Hadoop See 7+     See less ", "Summary Customer-oriented digital solutions professional with 15 years experience publishing content, deploying and managing corporate web sites and administering web applications. Broad technical grasp of internet technologies, enabling effective use of the web for digital marketing, internal and external communications, and supporting engineering processes. Systems thinker and team player with a reputation for being highly quality conscious. Strengths include: \n \n-Creative technical problem solver \n-Senior content quality and policy adviser \n-Passion for special projects \n-Effective collaborator \n-Social media, open source and mobile web evangelist \n \nSpecialties: Site and content management, marketing operations, content quality, branding and identity, usability, web analytics, email marketing, social media, search engine optimization Summary Customer-oriented digital solutions professional with 15 years experience publishing content, deploying and managing corporate web sites and administering web applications. Broad technical grasp of internet technologies, enabling effective use of the web for digital marketing, internal and external communications, and supporting engineering processes. Systems thinker and team player with a reputation for being highly quality conscious. Strengths include: \n \n-Creative technical problem solver \n-Senior content quality and policy adviser \n-Passion for special projects \n-Effective collaborator \n-Social media, open source and mobile web evangelist \n \nSpecialties: Site and content management, marketing operations, content quality, branding and identity, usability, web analytics, email marketing, social media, search engine optimization Customer-oriented digital solutions professional with 15 years experience publishing content, deploying and managing corporate web sites and administering web applications. Broad technical grasp of internet technologies, enabling effective use of the web for digital marketing, internal and external communications, and supporting engineering processes. Systems thinker and team player with a reputation for being highly quality conscious. Strengths include: \n \n-Creative technical problem solver \n-Senior content quality and policy adviser \n-Passion for special projects \n-Effective collaborator \n-Social media, open source and mobile web evangelist \n \nSpecialties: Site and content management, marketing operations, content quality, branding and identity, usability, web analytics, email marketing, social media, search engine optimization Customer-oriented digital solutions professional with 15 years experience publishing content, deploying and managing corporate web sites and administering web applications. Broad technical grasp of internet technologies, enabling effective use of the web for digital marketing, internal and external communications, and supporting engineering processes. Systems thinker and team player with a reputation for being highly quality conscious. Strengths include: \n \n-Creative technical problem solver \n-Senior content quality and policy adviser \n-Passion for special projects \n-Effective collaborator \n-Social media, open source and mobile web evangelist \n \nSpecialties: Site and content management, marketing operations, content quality, branding and identity, usability, web analytics, email marketing, social media, search engine optimization Experience Digital Content Manager CDI Corporation, Talent & Technology Services 2014  – Present (1 year) Portland, Oregon Area Create, publish and monitor product and B2B segment content for Fortune 100 company. Execute special projects to evaluate content effectiveness, SEO and web analytics. Support content publishing for critical product launches. Migrate content between content management platforms (CMS). Content Manager and Digital Marketing Specialist avVenta/Accenture Interactive (Client: Intel Corporation) 2009  –  2013  (4 years) Portland, Oregon Area *\tProvided qualitative and quantitative content analysis and execution support for sitewide effort to end-of-life (EOL) legacy static content on http://www.intel.com. This effort enabled content migration to the Adobe CQ5 dynamic platform. \n*\tActed as subject matter expert for near-shore production team on Intel’s web platform technologies and content redirection tools \n*\tBackup support for lead on Intel domain management process and database. This effort is tightly coupled with digital marketing, the corporate domain administrator, online security team and DNS engineering to track and protect Intel’s domain assets. \n*\tTechnical lead on special projects: \n-- Video capability transition from Feedroom to Brightcove/Adobe CQ digital asset management:  \nExecuted content mining and analysis to provide a baseline of video content and player usage to drive consolidation and re-encoding of assets and migration of all video content to Brightcove hosting coordinated with CQ5 DAM. \n-- Intel response to EU Cookie/Privacy regulations:  \nBrought on board to analyze results of crawls of Intel web properties to determine Intel’s exposure to liability in the EU. This included extracting and manipulating reporting from a TRUSTe web portal, summarizing results, identifying content owners and meeting with key stakeholders to achieve 100% buy-in on any required remediation. Product Launch Web Developer Xerox 2007  –  2009  (2 years) * Converted product launch content to XML-based web pages on a LAMP (Linux/Apache/MySQL/Perl) dynamic web platform. (Dreamweaver, UltraEdit, telnet/SSH, SFTP) \n* Coordinated product launches with Xerox e-Commerce and 3rd party portal vendor (Channel Intelligence). This included validating Oracle feeds of product/supplies. \n* Entered and validated translated content modules, specifications and metatags in proprietary translation system in 17 languages. \n* Provided QA functions to ensure content quality and functionality in adherence to brand identity standards. Xerox launched a completely updated brand identity in January 2008. \n* Executed special projects to streamline content processes \n* Led evaluation and implementation of alternative HTML/XML editor (UltraEdit) to replace DreamWeaver, increasing efficiency and significantly reducing per-seat costs. \n* Developed process documentation posted on department Wiki. Web Solutions Manager Intel Corporation January 2004  –  December 2006  (3 years) * Managed content development and publishing of the Technology and Research portion of Intel's public Web site (1000 pages, ~700,000 page views/month) and the online Technology@Intel Magazine with a newsletter circulation of 93,000. \n* Managed migration of the site to a higher level of the intel.com content hierarchy and implemented all required changes to support the rollout of Intel's sweeping brand identity update in 2005, raising the visibility of Intel's technology leadership messaging. \n* Managed content production workflow through contract web developers and external agencies \n* Implemented Web analytics to provide metrics reporting to show site effectiveness. (Omniture SiteCatalyst) \n* Online marketing support: \nTechnical implementation of viral marketing pilot for worldwide marketing campaign. \nDeveloped content feedback mechanism and reporting. \nImplemented RSS, blogging, webcasts \nSearch engine marketing and optimization Web Developer/Administrator Intel Corporation January 2000  –  January 2004  (4 years 1 month) * Designed and landed multiple intranet Web sites to support internal communications and engineering processes, including required graphics development, information architecture and content processes.  \n* Administered Web-based extranet conference content management application for Intel Developer Forum, Intel's series of worldwide developer conferences. Outlined enhancements and managed their development. Trained 30+ training track owners. \n* Technical lead on creation of intranet Web application to track participation in worldwide industry standards groups and SIGs. For the first time there was a system to coordinate complex company involvement, reduce duplication and better protect corporate intellectual property. Network Specialist and Webmaster Intel Corporation 1998  –  2000  (2 years) * Managed Intel Architecture Labs' intranet presence, expanding it and spinning up dozens of content publishers. The purpose of the site was to communicate the Labs' innovations to employees.  \n* Supported testing infrastructure and Internet deployment of leading-edge Web-based software technologies such as VoIP, image/video sharing, cross-proxy DNS resolution. Intel was first in the industry to release a free internet phone (H323) application with over 300,000 downloads at introduction. \n* Implemented Webtrends analytics to provide traffic reporting for intranet and external Intel Architecture Labs Web sites. Technical Marketing Engineer Intel Corporation 1994  –  1998  (4 years) * Key participant on the engineering team that pioneered Intel’s use of the Web. \n* Web-mastered Intel's first intranet server that ultimately evolved into the corporate portal that now supports 100,000 employees. (BSDI Unix, NCSA httpd, CVS version control) \n* Key participant in developing and delivering Intel’s first Internet, Web and Web Authoring training courses, spinning up employees on the new technology. Software Technician Intel Corporation January 1990  –  January 1994  (4 years 1 month) * Streamlined and managed product release process for beta and production releases of 11 embedded software development products, interfacing effectively with business planning, marketing, software administration and software manufacturing teams in order to release products on schedule. \n* Managed shared resources such as labs and test equipment, including multiple UNIX OS’s and DOS/Windows and managed several moves and compressions of the development lab. \n* Managed a smooth transition from an outdated UNIX software defect tracking system to a Windows-based system without incurring project delays. Digital Content Manager CDI Corporation, Talent & Technology Services 2014  – Present (1 year) Portland, Oregon Area Create, publish and monitor product and B2B segment content for Fortune 100 company. Execute special projects to evaluate content effectiveness, SEO and web analytics. Support content publishing for critical product launches. Migrate content between content management platforms (CMS). Digital Content Manager CDI Corporation, Talent & Technology Services 2014  – Present (1 year) Portland, Oregon Area Create, publish and monitor product and B2B segment content for Fortune 100 company. Execute special projects to evaluate content effectiveness, SEO and web analytics. Support content publishing for critical product launches. Migrate content between content management platforms (CMS). Content Manager and Digital Marketing Specialist avVenta/Accenture Interactive (Client: Intel Corporation) 2009  –  2013  (4 years) Portland, Oregon Area *\tProvided qualitative and quantitative content analysis and execution support for sitewide effort to end-of-life (EOL) legacy static content on http://www.intel.com. This effort enabled content migration to the Adobe CQ5 dynamic platform. \n*\tActed as subject matter expert for near-shore production team on Intel’s web platform technologies and content redirection tools \n*\tBackup support for lead on Intel domain management process and database. This effort is tightly coupled with digital marketing, the corporate domain administrator, online security team and DNS engineering to track and protect Intel’s domain assets. \n*\tTechnical lead on special projects: \n-- Video capability transition from Feedroom to Brightcove/Adobe CQ digital asset management:  \nExecuted content mining and analysis to provide a baseline of video content and player usage to drive consolidation and re-encoding of assets and migration of all video content to Brightcove hosting coordinated with CQ5 DAM. \n-- Intel response to EU Cookie/Privacy regulations:  \nBrought on board to analyze results of crawls of Intel web properties to determine Intel’s exposure to liability in the EU. This included extracting and manipulating reporting from a TRUSTe web portal, summarizing results, identifying content owners and meeting with key stakeholders to achieve 100% buy-in on any required remediation. Content Manager and Digital Marketing Specialist avVenta/Accenture Interactive (Client: Intel Corporation) 2009  –  2013  (4 years) Portland, Oregon Area *\tProvided qualitative and quantitative content analysis and execution support for sitewide effort to end-of-life (EOL) legacy static content on http://www.intel.com. This effort enabled content migration to the Adobe CQ5 dynamic platform. \n*\tActed as subject matter expert for near-shore production team on Intel’s web platform technologies and content redirection tools \n*\tBackup support for lead on Intel domain management process and database. This effort is tightly coupled with digital marketing, the corporate domain administrator, online security team and DNS engineering to track and protect Intel’s domain assets. \n*\tTechnical lead on special projects: \n-- Video capability transition from Feedroom to Brightcove/Adobe CQ digital asset management:  \nExecuted content mining and analysis to provide a baseline of video content and player usage to drive consolidation and re-encoding of assets and migration of all video content to Brightcove hosting coordinated with CQ5 DAM. \n-- Intel response to EU Cookie/Privacy regulations:  \nBrought on board to analyze results of crawls of Intel web properties to determine Intel’s exposure to liability in the EU. This included extracting and manipulating reporting from a TRUSTe web portal, summarizing results, identifying content owners and meeting with key stakeholders to achieve 100% buy-in on any required remediation. Product Launch Web Developer Xerox 2007  –  2009  (2 years) * Converted product launch content to XML-based web pages on a LAMP (Linux/Apache/MySQL/Perl) dynamic web platform. (Dreamweaver, UltraEdit, telnet/SSH, SFTP) \n* Coordinated product launches with Xerox e-Commerce and 3rd party portal vendor (Channel Intelligence). This included validating Oracle feeds of product/supplies. \n* Entered and validated translated content modules, specifications and metatags in proprietary translation system in 17 languages. \n* Provided QA functions to ensure content quality and functionality in adherence to brand identity standards. Xerox launched a completely updated brand identity in January 2008. \n* Executed special projects to streamline content processes \n* Led evaluation and implementation of alternative HTML/XML editor (UltraEdit) to replace DreamWeaver, increasing efficiency and significantly reducing per-seat costs. \n* Developed process documentation posted on department Wiki. Product Launch Web Developer Xerox 2007  –  2009  (2 years) * Converted product launch content to XML-based web pages on a LAMP (Linux/Apache/MySQL/Perl) dynamic web platform. (Dreamweaver, UltraEdit, telnet/SSH, SFTP) \n* Coordinated product launches with Xerox e-Commerce and 3rd party portal vendor (Channel Intelligence). This included validating Oracle feeds of product/supplies. \n* Entered and validated translated content modules, specifications and metatags in proprietary translation system in 17 languages. \n* Provided QA functions to ensure content quality and functionality in adherence to brand identity standards. Xerox launched a completely updated brand identity in January 2008. \n* Executed special projects to streamline content processes \n* Led evaluation and implementation of alternative HTML/XML editor (UltraEdit) to replace DreamWeaver, increasing efficiency and significantly reducing per-seat costs. \n* Developed process documentation posted on department Wiki. Web Solutions Manager Intel Corporation January 2004  –  December 2006  (3 years) * Managed content development and publishing of the Technology and Research portion of Intel's public Web site (1000 pages, ~700,000 page views/month) and the online Technology@Intel Magazine with a newsletter circulation of 93,000. \n* Managed migration of the site to a higher level of the intel.com content hierarchy and implemented all required changes to support the rollout of Intel's sweeping brand identity update in 2005, raising the visibility of Intel's technology leadership messaging. \n* Managed content production workflow through contract web developers and external agencies \n* Implemented Web analytics to provide metrics reporting to show site effectiveness. (Omniture SiteCatalyst) \n* Online marketing support: \nTechnical implementation of viral marketing pilot for worldwide marketing campaign. \nDeveloped content feedback mechanism and reporting. \nImplemented RSS, blogging, webcasts \nSearch engine marketing and optimization Web Solutions Manager Intel Corporation January 2004  –  December 2006  (3 years) * Managed content development and publishing of the Technology and Research portion of Intel's public Web site (1000 pages, ~700,000 page views/month) and the online Technology@Intel Magazine with a newsletter circulation of 93,000. \n* Managed migration of the site to a higher level of the intel.com content hierarchy and implemented all required changes to support the rollout of Intel's sweeping brand identity update in 2005, raising the visibility of Intel's technology leadership messaging. \n* Managed content production workflow through contract web developers and external agencies \n* Implemented Web analytics to provide metrics reporting to show site effectiveness. (Omniture SiteCatalyst) \n* Online marketing support: \nTechnical implementation of viral marketing pilot for worldwide marketing campaign. \nDeveloped content feedback mechanism and reporting. \nImplemented RSS, blogging, webcasts \nSearch engine marketing and optimization Web Developer/Administrator Intel Corporation January 2000  –  January 2004  (4 years 1 month) * Designed and landed multiple intranet Web sites to support internal communications and engineering processes, including required graphics development, information architecture and content processes.  \n* Administered Web-based extranet conference content management application for Intel Developer Forum, Intel's series of worldwide developer conferences. Outlined enhancements and managed their development. Trained 30+ training track owners. \n* Technical lead on creation of intranet Web application to track participation in worldwide industry standards groups and SIGs. For the first time there was a system to coordinate complex company involvement, reduce duplication and better protect corporate intellectual property. Web Developer/Administrator Intel Corporation January 2000  –  January 2004  (4 years 1 month) * Designed and landed multiple intranet Web sites to support internal communications and engineering processes, including required graphics development, information architecture and content processes.  \n* Administered Web-based extranet conference content management application for Intel Developer Forum, Intel's series of worldwide developer conferences. Outlined enhancements and managed their development. Trained 30+ training track owners. \n* Technical lead on creation of intranet Web application to track participation in worldwide industry standards groups and SIGs. For the first time there was a system to coordinate complex company involvement, reduce duplication and better protect corporate intellectual property. Network Specialist and Webmaster Intel Corporation 1998  –  2000  (2 years) * Managed Intel Architecture Labs' intranet presence, expanding it and spinning up dozens of content publishers. The purpose of the site was to communicate the Labs' innovations to employees.  \n* Supported testing infrastructure and Internet deployment of leading-edge Web-based software technologies such as VoIP, image/video sharing, cross-proxy DNS resolution. Intel was first in the industry to release a free internet phone (H323) application with over 300,000 downloads at introduction. \n* Implemented Webtrends analytics to provide traffic reporting for intranet and external Intel Architecture Labs Web sites. Network Specialist and Webmaster Intel Corporation 1998  –  2000  (2 years) * Managed Intel Architecture Labs' intranet presence, expanding it and spinning up dozens of content publishers. The purpose of the site was to communicate the Labs' innovations to employees.  \n* Supported testing infrastructure and Internet deployment of leading-edge Web-based software technologies such as VoIP, image/video sharing, cross-proxy DNS resolution. Intel was first in the industry to release a free internet phone (H323) application with over 300,000 downloads at introduction. \n* Implemented Webtrends analytics to provide traffic reporting for intranet and external Intel Architecture Labs Web sites. Technical Marketing Engineer Intel Corporation 1994  –  1998  (4 years) * Key participant on the engineering team that pioneered Intel’s use of the Web. \n* Web-mastered Intel's first intranet server that ultimately evolved into the corporate portal that now supports 100,000 employees. (BSDI Unix, NCSA httpd, CVS version control) \n* Key participant in developing and delivering Intel’s first Internet, Web and Web Authoring training courses, spinning up employees on the new technology. Technical Marketing Engineer Intel Corporation 1994  –  1998  (4 years) * Key participant on the engineering team that pioneered Intel’s use of the Web. \n* Web-mastered Intel's first intranet server that ultimately evolved into the corporate portal that now supports 100,000 employees. (BSDI Unix, NCSA httpd, CVS version control) \n* Key participant in developing and delivering Intel’s first Internet, Web and Web Authoring training courses, spinning up employees on the new technology. Software Technician Intel Corporation January 1990  –  January 1994  (4 years 1 month) * Streamlined and managed product release process for beta and production releases of 11 embedded software development products, interfacing effectively with business planning, marketing, software administration and software manufacturing teams in order to release products on schedule. \n* Managed shared resources such as labs and test equipment, including multiple UNIX OS’s and DOS/Windows and managed several moves and compressions of the development lab. \n* Managed a smooth transition from an outdated UNIX software defect tracking system to a Windows-based system without incurring project delays. Software Technician Intel Corporation January 1990  –  January 1994  (4 years 1 month) * Streamlined and managed product release process for beta and production releases of 11 embedded software development products, interfacing effectively with business planning, marketing, software administration and software manufacturing teams in order to release products on schedule. \n* Managed shared resources such as labs and test equipment, including multiple UNIX OS’s and DOS/Windows and managed several moves and compressions of the development lab. \n* Managed a smooth transition from an outdated UNIX software defect tracking system to a Windows-based system without incurring project delays. Skills Web Analytics SEO Online Marketing Content Strategy Digital Marketing Content Management Information Architecture E-commerce Content Development Web Content Management Website Development SEM User Experience HTML Requirements Analysis Software Product... Software Deployment Mobile Internet Open Source Software Testing Web Marketing Social Media Blogging Dreamweaver Domain Management Digital Asset Management Usability Social Media Marketing Omniture Web Project Management Web Development SDLC Adobe CQ Localization Technical Support Open Source User Documentation ITIL Version Control Tools See 24+     See less Skills  Web Analytics SEO Online Marketing Content Strategy Digital Marketing Content Management Information Architecture E-commerce Content Development Web Content Management Website Development SEM User Experience HTML Requirements Analysis Software Product... Software Deployment Mobile Internet Open Source Software Testing Web Marketing Social Media Blogging Dreamweaver Domain Management Digital Asset Management Usability Social Media Marketing Omniture Web Project Management Web Development SDLC Adobe CQ Localization Technical Support Open Source User Documentation ITIL Version Control Tools See 24+     See less Web Analytics SEO Online Marketing Content Strategy Digital Marketing Content Management Information Architecture E-commerce Content Development Web Content Management Website Development SEM User Experience HTML Requirements Analysis Software Product... Software Deployment Mobile Internet Open Source Software Testing Web Marketing Social Media Blogging Dreamweaver Domain Management Digital Asset Management Usability Social Media Marketing Omniture Web Project Management Web Development SDLC Adobe CQ Localization Technical Support Open Source User Documentation ITIL Version Control Tools See 24+     See less Web Analytics SEO Online Marketing Content Strategy Digital Marketing Content Management Information Architecture E-commerce Content Development Web Content Management Website Development SEM User Experience HTML Requirements Analysis Software Product... Software Deployment Mobile Internet Open Source Software Testing Web Marketing Social Media Blogging Dreamweaver Domain Management Digital Asset Management Usability Social Media Marketing Omniture Web Project Management Web Development SDLC Adobe CQ Localization Technical Support Open Source User Documentation ITIL Version Control Tools See 24+     See less Education Lewis and Clark College Bachelor's Degree,  Liberal Arts - History ,  Religion and Literature , Cum Laude 1973  – 1977 Activities and Societies:  Off-campus program in New York City focused on theater.\nOverseas study in Turkey and Greece focused on archaeology and prehistory. Lewis and Clark College Bachelor's Degree,  Liberal Arts - History ,  Religion and Literature , Cum Laude 1973  – 1977 Activities and Societies:  Off-campus program in New York City focused on theater.\nOverseas study in Turkey and Greece focused on archaeology and prehistory. Lewis and Clark College Bachelor's Degree,  Liberal Arts - History ,  Religion and Literature , Cum Laude 1973  – 1977 Activities and Societies:  Off-campus program in New York City focused on theater.\nOverseas study in Turkey and Greece focused on archaeology and prehistory. Lewis and Clark College Bachelor's Degree,  Liberal Arts - History ,  Religion and Literature , Cum Laude 1973  – 1977 Activities and Societies:  Off-campus program in New York City focused on theater.\nOverseas study in Turkey and Greece focused on archaeology and prehistory. Honors & Awards Additional Honors & Awards Multiple Division Recognition Awards for process improvement, project execution and quality orientation. Additional Honors & Awards Multiple Division Recognition Awards for process improvement, project execution and quality orientation. Additional Honors & Awards Multiple Division Recognition Awards for process improvement, project execution and quality orientation. Additional Honors & Awards Multiple Division Recognition Awards for process improvement, project execution and quality orientation. ", "Experience Software Technician Intel Corporation June 2013  – Present (2 years 3 months) Software Technician Intel Corporation June 2013  – Present (2 years 3 months) Software Technician Intel Corporation June 2013  – Present (2 years 3 months) Languages   Skills Skills     Education Arizona State University Bachelor of Science (BS),  Computer Science 2005  – 2012 Arizona State University Bachelor of Science in Engineering,  Computer Systems Engineering 2005  – 2007 Arizona State University Bachelor of Science (BS),  Computer Science 2005  – 2012 Arizona State University Bachelor of Science (BS),  Computer Science 2005  – 2012 Arizona State University Bachelor of Science (BS),  Computer Science 2005  – 2012 Arizona State University Bachelor of Science in Engineering,  Computer Systems Engineering 2005  – 2007 Arizona State University Bachelor of Science in Engineering,  Computer Systems Engineering 2005  – 2007 Arizona State University Bachelor of Science in Engineering,  Computer Systems Engineering 2005  – 2007 Honors & Awards ", "Summary Lots of Systems Management experience. Can deploy and support Windows and Office globally through different means. Can manage and support most major Systems Management Suites. Lots of experience solving client hardware and software problems. Some management and training experience. \n \nLooking for a senior position in systems management, managing an enterprise's desktop system centrally. \n \nSpecialties: Specialties include supporting various versions of Windows, including Windows 8. Design, management and support of a Systems Management infrastructure. Deploying Windows and Office globally. Can get most legacy applications to run on the newest versions of Windows. Can repackage and deploy third party software globally. Can deploy patches and updates globally. Summary Lots of Systems Management experience. Can deploy and support Windows and Office globally through different means. Can manage and support most major Systems Management Suites. Lots of experience solving client hardware and software problems. Some management and training experience. \n \nLooking for a senior position in systems management, managing an enterprise's desktop system centrally. \n \nSpecialties: Specialties include supporting various versions of Windows, including Windows 8. Design, management and support of a Systems Management infrastructure. Deploying Windows and Office globally. Can get most legacy applications to run on the newest versions of Windows. Can repackage and deploy third party software globally. Can deploy patches and updates globally. Lots of Systems Management experience. Can deploy and support Windows and Office globally through different means. Can manage and support most major Systems Management Suites. Lots of experience solving client hardware and software problems. Some management and training experience. \n \nLooking for a senior position in systems management, managing an enterprise's desktop system centrally. \n \nSpecialties: Specialties include supporting various versions of Windows, including Windows 8. Design, management and support of a Systems Management infrastructure. Deploying Windows and Office globally. Can get most legacy applications to run on the newest versions of Windows. Can repackage and deploy third party software globally. Can deploy patches and updates globally. Lots of Systems Management experience. Can deploy and support Windows and Office globally through different means. Can manage and support most major Systems Management Suites. Lots of experience solving client hardware and software problems. Some management and training experience. \n \nLooking for a senior position in systems management, managing an enterprise's desktop system centrally. \n \nSpecialties: Specialties include supporting various versions of Windows, including Windows 8. Design, management and support of a Systems Management infrastructure. Deploying Windows and Office globally. Can get most legacy applications to run on the newest versions of Windows. Can repackage and deploy third party software globally. Can deploy patches and updates globally. Experience Desktop Engineer Fred Hutchinson Cancer Research Center November 2013  –  May 2014  (7 months) Senior Consultant Sogeti April 2013  –  August 2013  (5 months) Seattle WA Consultant Microsoft April 2012  –  April 2013  (1 year 1 month) Greater Seattle Area As an employee of Microsoft Consulting Services (MCS), I consult with external enterprise clients, as a representative of Microsoft. I help clients implement large-scale projects that utilize Microsoft Operating Systems and Microsoft software. \n \nSpecialties: \n* Windows Desktop, including Windows 7 and Windows 8 \n* System Center Configuration Manager \n* Application Compatibility \n* Application Virtualization \n* Software Packaging \n* Desktop Deployment Windows 7 Deployment Architect Dell 2010  –  2012  (2 years) Providing post sales and implementation services for clients  \n \nProvide assess and design consulting for large scale migrations, desktop optimization and core infrastructure deployment  \n \nContributing to development and ongoing improvement of Dell's industry best practices and standards for deploying enterprise technologies  \n \nMentoring and providing technical leadership to other team members Systems Administrator S&K Technologies 2010  –  2010  (less than a year) Senior Desktop Systems Engineer Flow International March 2008  –  May 2009  (1 year 3 months) Design, Deploy, Configure, Manage and Support Enterprise Wide Systems Management Infrastructure (Microsoft System Center Configuration Manager 2007) \n \nManage and Deploy Windows Vista and Office 2007 globally \n \nRepackage third party applications for automated deployment \n \nApplication Virtualization using App-V 4.2.2 in a client-server and stand alone environments \n \nTest and deploy software updates \n \nSpecify client system hardware \n \nSupport and remediate legacy applications on Windows Vista \n \nGenerate hardware and software inventory reports \n \nTier III hardware and software support \n \nOther duties as assigned by Operations Manager Partner Technical Consultant Microsoft February 2007  –  February 2008  (1 year 1 month) Offer targeted technical engagements by identifying opportunities and proactively providing services to Microsoft Gold Partners \n \nDeliver Technical Web casts, Presentations, Skills Transfer support to partners on Microsoft products and solutions, specializing in current and pending System Center products. \n \nOffer Partners Support Request Management  \n \nOffer Escalation Management for support/service related issues.  \n \nAct as an Information Concierge by proactively offering security bulletin, white papers and other technical resources relevant to partner.  \n \nBuild and sustain a relationship with the primary technical contact for the partner Senior Software Technician Intel Corporation April 2006  –  February 2007  (11 months) Manage networked floating SW licenses.  \n \nBuild desktop and server systems running Windows 2000/XP/2003 from the ground up. \n \nDiagnose and resolve system HW/ SW configuration problems.  \n \nProvide system level application support to CAD users in a networked Windows XP/2003 environment.  \n \nInstall and package CAD SW for automated deployment.  \n \nTest and qualify software tool releases prior to general deployment.  \n \nPrepare process documentation, and performed other projects as assigned by lead engineer or manager.  \n \nManage trouble tickets through specialized web based applications. \n \nAdminister Windows 2003 Servers Network Analyst II Southern Oregon University April 2001  –  April 2006  (5 years 1 month) Provide desktop support for faculty, staff and student lab computers.  \n \nManage and Support Systems Management Infrastructure (ZEN Works) \n \nManage User and System Group Policies in Windows XP.  \nCreate and manage Workstation Images using Ghost and Sysprep.  \n \nProvide Application support and troubleshooting.  \n \nPlan, test, and deploy upgrades from Windows 98 to Windows XP.  \n \nManage Operating System and Application patching and updating.  \n \nBackup Netware 6.5 Administrator.  \n \nManage support for SUSE Linux Desktops Senior Desktop Systems Engineer Sony Electronics 1999  –  1999  (less than a year) Desktop Support Read-Rite Corporation 1997  –  1999  (2 years) Calibration Tech General Electric 1994  –  1997  (3 years) Desktop Engineer Fred Hutchinson Cancer Research Center November 2013  –  May 2014  (7 months) Desktop Engineer Fred Hutchinson Cancer Research Center November 2013  –  May 2014  (7 months) Senior Consultant Sogeti April 2013  –  August 2013  (5 months) Seattle WA Senior Consultant Sogeti April 2013  –  August 2013  (5 months) Seattle WA Consultant Microsoft April 2012  –  April 2013  (1 year 1 month) Greater Seattle Area As an employee of Microsoft Consulting Services (MCS), I consult with external enterprise clients, as a representative of Microsoft. I help clients implement large-scale projects that utilize Microsoft Operating Systems and Microsoft software. \n \nSpecialties: \n* Windows Desktop, including Windows 7 and Windows 8 \n* System Center Configuration Manager \n* Application Compatibility \n* Application Virtualization \n* Software Packaging \n* Desktop Deployment Consultant Microsoft April 2012  –  April 2013  (1 year 1 month) Greater Seattle Area As an employee of Microsoft Consulting Services (MCS), I consult with external enterprise clients, as a representative of Microsoft. I help clients implement large-scale projects that utilize Microsoft Operating Systems and Microsoft software. \n \nSpecialties: \n* Windows Desktop, including Windows 7 and Windows 8 \n* System Center Configuration Manager \n* Application Compatibility \n* Application Virtualization \n* Software Packaging \n* Desktop Deployment Windows 7 Deployment Architect Dell 2010  –  2012  (2 years) Providing post sales and implementation services for clients  \n \nProvide assess and design consulting for large scale migrations, desktop optimization and core infrastructure deployment  \n \nContributing to development and ongoing improvement of Dell's industry best practices and standards for deploying enterprise technologies  \n \nMentoring and providing technical leadership to other team members Windows 7 Deployment Architect Dell 2010  –  2012  (2 years) Providing post sales and implementation services for clients  \n \nProvide assess and design consulting for large scale migrations, desktop optimization and core infrastructure deployment  \n \nContributing to development and ongoing improvement of Dell's industry best practices and standards for deploying enterprise technologies  \n \nMentoring and providing technical leadership to other team members Systems Administrator S&K Technologies 2010  –  2010  (less than a year) Systems Administrator S&K Technologies 2010  –  2010  (less than a year) Senior Desktop Systems Engineer Flow International March 2008  –  May 2009  (1 year 3 months) Design, Deploy, Configure, Manage and Support Enterprise Wide Systems Management Infrastructure (Microsoft System Center Configuration Manager 2007) \n \nManage and Deploy Windows Vista and Office 2007 globally \n \nRepackage third party applications for automated deployment \n \nApplication Virtualization using App-V 4.2.2 in a client-server and stand alone environments \n \nTest and deploy software updates \n \nSpecify client system hardware \n \nSupport and remediate legacy applications on Windows Vista \n \nGenerate hardware and software inventory reports \n \nTier III hardware and software support \n \nOther duties as assigned by Operations Manager Senior Desktop Systems Engineer Flow International March 2008  –  May 2009  (1 year 3 months) Design, Deploy, Configure, Manage and Support Enterprise Wide Systems Management Infrastructure (Microsoft System Center Configuration Manager 2007) \n \nManage and Deploy Windows Vista and Office 2007 globally \n \nRepackage third party applications for automated deployment \n \nApplication Virtualization using App-V 4.2.2 in a client-server and stand alone environments \n \nTest and deploy software updates \n \nSpecify client system hardware \n \nSupport and remediate legacy applications on Windows Vista \n \nGenerate hardware and software inventory reports \n \nTier III hardware and software support \n \nOther duties as assigned by Operations Manager Partner Technical Consultant Microsoft February 2007  –  February 2008  (1 year 1 month) Offer targeted technical engagements by identifying opportunities and proactively providing services to Microsoft Gold Partners \n \nDeliver Technical Web casts, Presentations, Skills Transfer support to partners on Microsoft products and solutions, specializing in current and pending System Center products. \n \nOffer Partners Support Request Management  \n \nOffer Escalation Management for support/service related issues.  \n \nAct as an Information Concierge by proactively offering security bulletin, white papers and other technical resources relevant to partner.  \n \nBuild and sustain a relationship with the primary technical contact for the partner Partner Technical Consultant Microsoft February 2007  –  February 2008  (1 year 1 month) Offer targeted technical engagements by identifying opportunities and proactively providing services to Microsoft Gold Partners \n \nDeliver Technical Web casts, Presentations, Skills Transfer support to partners on Microsoft products and solutions, specializing in current and pending System Center products. \n \nOffer Partners Support Request Management  \n \nOffer Escalation Management for support/service related issues.  \n \nAct as an Information Concierge by proactively offering security bulletin, white papers and other technical resources relevant to partner.  \n \nBuild and sustain a relationship with the primary technical contact for the partner Senior Software Technician Intel Corporation April 2006  –  February 2007  (11 months) Manage networked floating SW licenses.  \n \nBuild desktop and server systems running Windows 2000/XP/2003 from the ground up. \n \nDiagnose and resolve system HW/ SW configuration problems.  \n \nProvide system level application support to CAD users in a networked Windows XP/2003 environment.  \n \nInstall and package CAD SW for automated deployment.  \n \nTest and qualify software tool releases prior to general deployment.  \n \nPrepare process documentation, and performed other projects as assigned by lead engineer or manager.  \n \nManage trouble tickets through specialized web based applications. \n \nAdminister Windows 2003 Servers Senior Software Technician Intel Corporation April 2006  –  February 2007  (11 months) Manage networked floating SW licenses.  \n \nBuild desktop and server systems running Windows 2000/XP/2003 from the ground up. \n \nDiagnose and resolve system HW/ SW configuration problems.  \n \nProvide system level application support to CAD users in a networked Windows XP/2003 environment.  \n \nInstall and package CAD SW for automated deployment.  \n \nTest and qualify software tool releases prior to general deployment.  \n \nPrepare process documentation, and performed other projects as assigned by lead engineer or manager.  \n \nManage trouble tickets through specialized web based applications. \n \nAdminister Windows 2003 Servers Network Analyst II Southern Oregon University April 2001  –  April 2006  (5 years 1 month) Provide desktop support for faculty, staff and student lab computers.  \n \nManage and Support Systems Management Infrastructure (ZEN Works) \n \nManage User and System Group Policies in Windows XP.  \nCreate and manage Workstation Images using Ghost and Sysprep.  \n \nProvide Application support and troubleshooting.  \n \nPlan, test, and deploy upgrades from Windows 98 to Windows XP.  \n \nManage Operating System and Application patching and updating.  \n \nBackup Netware 6.5 Administrator.  \n \nManage support for SUSE Linux Desktops Network Analyst II Southern Oregon University April 2001  –  April 2006  (5 years 1 month) Provide desktop support for faculty, staff and student lab computers.  \n \nManage and Support Systems Management Infrastructure (ZEN Works) \n \nManage User and System Group Policies in Windows XP.  \nCreate and manage Workstation Images using Ghost and Sysprep.  \n \nProvide Application support and troubleshooting.  \n \nPlan, test, and deploy upgrades from Windows 98 to Windows XP.  \n \nManage Operating System and Application patching and updating.  \n \nBackup Netware 6.5 Administrator.  \n \nManage support for SUSE Linux Desktops Senior Desktop Systems Engineer Sony Electronics 1999  –  1999  (less than a year) Senior Desktop Systems Engineer Sony Electronics 1999  –  1999  (less than a year) Desktop Support Read-Rite Corporation 1997  –  1999  (2 years) Desktop Support Read-Rite Corporation 1997  –  1999  (2 years) Calibration Tech General Electric 1994  –  1997  (3 years) Calibration Tech General Electric 1994  –  1997  (3 years) Skills Windows 7 Windows Hardware Systems Management Patch Management Software Deployment Desktop Computers Infrastructure Software SCCM System Deployment Group Policy Windows 8 XP Windows Server Servers Technical Support Operating Systems Security Microsoft Technologies Networking Enterprise Software Virtualization Testing SharePoint Active Directory Computer Hardware VBScript Troubleshooting Application... Enterprise Architecture Hyper-V Powershell VMware Application Packaging Microsoft Exchange IIS App-V VMware ESX Citrix DNS SCOM Server Architecture Microsoft Certified... VDI WSUS vSphere DHCP Cluster VMware Infrastructure See 35+     See less Skills  Windows 7 Windows Hardware Systems Management Patch Management Software Deployment Desktop Computers Infrastructure Software SCCM System Deployment Group Policy Windows 8 XP Windows Server Servers Technical Support Operating Systems Security Microsoft Technologies Networking Enterprise Software Virtualization Testing SharePoint Active Directory Computer Hardware VBScript Troubleshooting Application... Enterprise Architecture Hyper-V Powershell VMware Application Packaging Microsoft Exchange IIS App-V VMware ESX Citrix DNS SCOM Server Architecture Microsoft Certified... VDI WSUS vSphere DHCP Cluster VMware Infrastructure See 35+     See less Windows 7 Windows Hardware Systems Management Patch Management Software Deployment Desktop Computers Infrastructure Software SCCM System Deployment Group Policy Windows 8 XP Windows Server Servers Technical Support Operating Systems Security Microsoft Technologies Networking Enterprise Software Virtualization Testing SharePoint Active Directory Computer Hardware VBScript Troubleshooting Application... Enterprise Architecture Hyper-V Powershell VMware Application Packaging Microsoft Exchange IIS App-V VMware ESX Citrix DNS SCOM Server Architecture Microsoft Certified... VDI WSUS vSphere DHCP Cluster VMware Infrastructure See 35+     See less Windows 7 Windows Hardware Systems Management Patch Management Software Deployment Desktop Computers Infrastructure Software SCCM System Deployment Group Policy Windows 8 XP Windows Server Servers Technical Support Operating Systems Security Microsoft Technologies Networking Enterprise Software Virtualization Testing SharePoint Active Directory Computer Hardware VBScript Troubleshooting Application... Enterprise Architecture Hyper-V Powershell VMware Application Packaging Microsoft Exchange IIS App-V VMware ESX Citrix DNS SCOM Server Architecture Microsoft Certified... VDI WSUS vSphere DHCP Cluster VMware Infrastructure See 35+     See less Education Southern Oregon University Computer Science 2002  – 2005 Worked full time as a Network Analyst while going to school Southern Oregon University Computer Science 2002  – 2005 Worked full time as a Network Analyst while going to school Southern Oregon University Computer Science 2002  – 2005 Worked full time as a Network Analyst while going to school Southern Oregon University Computer Science 2002  – 2005 Worked full time as a Network Analyst while going to school ", "Experience SW Release Manager Intel Corporation August 2012  – Present (3 years 1 month) Hilsboro, OR Manage SW releases for Intel Xeon Phi host/coprocessor SW. Coordinate development and debug activities to meet SW quality and schedule requirements. MIC SW Validation Program Manager Intel Corporation May 2011  –  August 2012  (1 year 4 months) Hillsboro, OR Certified Pharmacy Technician Walgreens March 2008  –  November 2010  (2 years 9 months) Bowling Green, KY Pharmacy technician for high-volume retail pharmacy. Store assistant manager Musicians Pro March 2007  –  March 2009  (2 years 1 month) Bowling Green, KY Musicial instrument store. Store manager Bounty Music February 2004  –  March 2007  (3 years 2 months) Kaua`i Island, Hawaii Managed musical instrument store. Self-employed Ha`ina Productions February 2003  –  February 2004  (1 year 1 month) Kaua`i Island, Hawaii Video production; photography; audio recording; musician Compatibility Validation Planner and Program Manager Intel Corporation July 1994  –  February 2003  (8 years 8 months) Hillsboro, OR Developed plans for compatibility validation of Northwood/Tualatin processors; managed team of planners; managed lab technicians; program manager for CV team. Compatibility Validation Engineer Intel Corporation July 1994  –  July 1999  (5 years 1 month) Hillsboro, OR Compatibility validation for Willamette/Coppermine, Northwood/Tualatin families of processors. SW Development and Validation Engineer Intel Corporation January 1990  –  July 1994  (4 years 7 months) Hillsboro, OR In-circuit emulator and In-target probe software development in C, C++; SW validation Software Technician Intel Corporation July 1989  –  December 1989  (6 months) Hillsboro, OR Lab support, Unix utility development. Software Technician BiiN July 1988  –  July 1989  (1 year 1 month) Hillsboro, OR Lab support, Unix BSD utility script development, BiiN OS SW development in Ada. Software Technician Intel Corporation July 1983  –  July 1988  (5 years 1 month) Hillsboro, OR Geminii project i432 software development platform lab support; utility software development on RMX86, BSD Unix; Osiris OS software utility development in Ada and low-level systems debug on i960 MX. Weather Specialist United States Air Force August 1975  –  August 1981  (6 years 1 month) SW Release Manager Intel Corporation August 2012  – Present (3 years 1 month) Hilsboro, OR Manage SW releases for Intel Xeon Phi host/coprocessor SW. Coordinate development and debug activities to meet SW quality and schedule requirements. SW Release Manager Intel Corporation August 2012  – Present (3 years 1 month) Hilsboro, OR Manage SW releases for Intel Xeon Phi host/coprocessor SW. Coordinate development and debug activities to meet SW quality and schedule requirements. MIC SW Validation Program Manager Intel Corporation May 2011  –  August 2012  (1 year 4 months) Hillsboro, OR MIC SW Validation Program Manager Intel Corporation May 2011  –  August 2012  (1 year 4 months) Hillsboro, OR Certified Pharmacy Technician Walgreens March 2008  –  November 2010  (2 years 9 months) Bowling Green, KY Pharmacy technician for high-volume retail pharmacy. Certified Pharmacy Technician Walgreens March 2008  –  November 2010  (2 years 9 months) Bowling Green, KY Pharmacy technician for high-volume retail pharmacy. Store assistant manager Musicians Pro March 2007  –  March 2009  (2 years 1 month) Bowling Green, KY Musicial instrument store. Store assistant manager Musicians Pro March 2007  –  March 2009  (2 years 1 month) Bowling Green, KY Musicial instrument store. Store manager Bounty Music February 2004  –  March 2007  (3 years 2 months) Kaua`i Island, Hawaii Managed musical instrument store. Store manager Bounty Music February 2004  –  March 2007  (3 years 2 months) Kaua`i Island, Hawaii Managed musical instrument store. Self-employed Ha`ina Productions February 2003  –  February 2004  (1 year 1 month) Kaua`i Island, Hawaii Video production; photography; audio recording; musician Self-employed Ha`ina Productions February 2003  –  February 2004  (1 year 1 month) Kaua`i Island, Hawaii Video production; photography; audio recording; musician Compatibility Validation Planner and Program Manager Intel Corporation July 1994  –  February 2003  (8 years 8 months) Hillsboro, OR Developed plans for compatibility validation of Northwood/Tualatin processors; managed team of planners; managed lab technicians; program manager for CV team. Compatibility Validation Planner and Program Manager Intel Corporation July 1994  –  February 2003  (8 years 8 months) Hillsboro, OR Developed plans for compatibility validation of Northwood/Tualatin processors; managed team of planners; managed lab technicians; program manager for CV team. Compatibility Validation Engineer Intel Corporation July 1994  –  July 1999  (5 years 1 month) Hillsboro, OR Compatibility validation for Willamette/Coppermine, Northwood/Tualatin families of processors. Compatibility Validation Engineer Intel Corporation July 1994  –  July 1999  (5 years 1 month) Hillsboro, OR Compatibility validation for Willamette/Coppermine, Northwood/Tualatin families of processors. SW Development and Validation Engineer Intel Corporation January 1990  –  July 1994  (4 years 7 months) Hillsboro, OR In-circuit emulator and In-target probe software development in C, C++; SW validation SW Development and Validation Engineer Intel Corporation January 1990  –  July 1994  (4 years 7 months) Hillsboro, OR In-circuit emulator and In-target probe software development in C, C++; SW validation Software Technician Intel Corporation July 1989  –  December 1989  (6 months) Hillsboro, OR Lab support, Unix utility development. Software Technician Intel Corporation July 1989  –  December 1989  (6 months) Hillsboro, OR Lab support, Unix utility development. Software Technician BiiN July 1988  –  July 1989  (1 year 1 month) Hillsboro, OR Lab support, Unix BSD utility script development, BiiN OS SW development in Ada. Software Technician BiiN July 1988  –  July 1989  (1 year 1 month) Hillsboro, OR Lab support, Unix BSD utility script development, BiiN OS SW development in Ada. Software Technician Intel Corporation July 1983  –  July 1988  (5 years 1 month) Hillsboro, OR Geminii project i432 software development platform lab support; utility software development on RMX86, BSD Unix; Osiris OS software utility development in Ada and low-level systems debug on i960 MX. Software Technician Intel Corporation July 1983  –  July 1988  (5 years 1 month) Hillsboro, OR Geminii project i432 software development platform lab support; utility software development on RMX86, BSD Unix; Osiris OS software utility development in Ada and low-level systems debug on i960 MX. Weather Specialist United States Air Force August 1975  –  August 1981  (6 years 1 month) Weather Specialist United States Air Force August 1975  –  August 1981  (6 years 1 month) ", "Experience Independent Business Owner Ryan J. Zeigler Photography August 2012  – Present (3 years 1 month) Willamette Valley, Oregon General photography startup focusing on portraiture and landscape/travel print distribution. One man show with plans for future expansion. I handle marketing, booking, shooting, editing, sales and distribution. Advanced Debug Technician Intel Corporation February 2014  –  October 2014  (9 months) Hillsboro, Oregon Platform debug for Broadwell / Wilson Beach Validation Engineer Intel December 2004  –  April 2012  (7 years 5 months) Hardware/Software Q/A on multiple projects. Systems Administrator Weyerhaeuser May 2003  –  December 2004  (1 year 8 months) Portland, Oregon Area Field Network Analyst for 7 sites in the Willamette Valley. Network Analyst Hewlett-Packard December 2001  –  January 2003  (1 year 2 months) Desktop Support Regions Hospital 1999  –  2000  (1 year) Hardware Support Imation 1998  –  1999  (1 year) Oakdale, MN Fab Technician Intel Corporation June 1995  –  January 1997  (1 year 8 months) Aloha, Oregon Independent Business Owner Ryan J. Zeigler Photography August 2012  – Present (3 years 1 month) Willamette Valley, Oregon General photography startup focusing on portraiture and landscape/travel print distribution. One man show with plans for future expansion. I handle marketing, booking, shooting, editing, sales and distribution. Independent Business Owner Ryan J. Zeigler Photography August 2012  – Present (3 years 1 month) Willamette Valley, Oregon General photography startup focusing on portraiture and landscape/travel print distribution. One man show with plans for future expansion. I handle marketing, booking, shooting, editing, sales and distribution. Advanced Debug Technician Intel Corporation February 2014  –  October 2014  (9 months) Hillsboro, Oregon Platform debug for Broadwell / Wilson Beach Advanced Debug Technician Intel Corporation February 2014  –  October 2014  (9 months) Hillsboro, Oregon Platform debug for Broadwell / Wilson Beach Validation Engineer Intel December 2004  –  April 2012  (7 years 5 months) Hardware/Software Q/A on multiple projects. Validation Engineer Intel December 2004  –  April 2012  (7 years 5 months) Hardware/Software Q/A on multiple projects. Systems Administrator Weyerhaeuser May 2003  –  December 2004  (1 year 8 months) Portland, Oregon Area Field Network Analyst for 7 sites in the Willamette Valley. Systems Administrator Weyerhaeuser May 2003  –  December 2004  (1 year 8 months) Portland, Oregon Area Field Network Analyst for 7 sites in the Willamette Valley. Network Analyst Hewlett-Packard December 2001  –  January 2003  (1 year 2 months) Network Analyst Hewlett-Packard December 2001  –  January 2003  (1 year 2 months) Desktop Support Regions Hospital 1999  –  2000  (1 year) Desktop Support Regions Hospital 1999  –  2000  (1 year) Hardware Support Imation 1998  –  1999  (1 year) Oakdale, MN Hardware Support Imation 1998  –  1999  (1 year) Oakdale, MN Fab Technician Intel Corporation June 1995  –  January 1997  (1 year 8 months) Aloha, Oregon Fab Technician Intel Corporation June 1995  –  January 1997  (1 year 8 months) Aloha, Oregon Skills Testing Validation Hardware Debugging Engineering Test Planning Intel Computer Engineering Quality Assurance Operating Systems Windows Writing Social Networking Social Media Technical Writing Blogging Research Facebook Editing Customer Relations Team Leadership Problem Solving New Media Photography Digital Media Troubleshooting Documentation Photoshop Portrait Photography Landscape Photography Digital Photography Twitter Digital Imaging Digital Printing Travel Photography Freelance Writing Photojournalism Commercial Photography Photos Photomatix Pro Nikon Game Testing Project Management Project Planning Fact-checking Communication Community Management Community Engagement Community Building Software Documentation See 35+     See less Skills  Testing Validation Hardware Debugging Engineering Test Planning Intel Computer Engineering Quality Assurance Operating Systems Windows Writing Social Networking Social Media Technical Writing Blogging Research Facebook Editing Customer Relations Team Leadership Problem Solving New Media Photography Digital Media Troubleshooting Documentation Photoshop Portrait Photography Landscape Photography Digital Photography Twitter Digital Imaging Digital Printing Travel Photography Freelance Writing Photojournalism Commercial Photography Photos Photomatix Pro Nikon Game Testing Project Management Project Planning Fact-checking Communication Community Management Community Engagement Community Building Software Documentation See 35+     See less Testing Validation Hardware Debugging Engineering Test Planning Intel Computer Engineering Quality Assurance Operating Systems Windows Writing Social Networking Social Media Technical Writing Blogging Research Facebook Editing Customer Relations Team Leadership Problem Solving New Media Photography Digital Media Troubleshooting Documentation Photoshop Portrait Photography Landscape Photography Digital Photography Twitter Digital Imaging Digital Printing Travel Photography Freelance Writing Photojournalism Commercial Photography Photos Photomatix Pro Nikon Game Testing Project Management Project Planning Fact-checking Communication Community Management Community Engagement Community Building Software Documentation See 35+     See less Testing Validation Hardware Debugging Engineering Test Planning Intel Computer Engineering Quality Assurance Operating Systems Windows Writing Social Networking Social Media Technical Writing Blogging Research Facebook Editing Customer Relations Team Leadership Problem Solving New Media Photography Digital Media Troubleshooting Documentation Photoshop Portrait Photography Landscape Photography Digital Photography Twitter Digital Imaging Digital Printing Travel Photography Freelance Writing Photojournalism Commercial Photography Photos Photomatix Pro Nikon Game Testing Project Management Project Planning Fact-checking Communication Community Management Community Engagement Community Building Software Documentation See 35+     See less Education Linn-Benton Community College Journalism,  Communications , New Media , 3.5 2010  – 2012 Activities and Societies:  LBCC Commuter - reporter ,  editor ,  photographer Linn-Benton Community College Journalism,  Communications , New Media , 3.5 2010  – 2012 Activities and Societies:  LBCC Commuter - reporter ,  editor ,  photographer Linn-Benton Community College Journalism,  Communications , New Media , 3.5 2010  – 2012 Activities and Societies:  LBCC Commuter - reporter ,  editor ,  photographer Linn-Benton Community College Journalism,  Communications , New Media , 3.5 2010  – 2012 Activities and Societies:  LBCC Commuter - reporter ,  editor ,  photographer ", "Summary I’m a self-motivated person, who likes work in team and work alone. Good organization and technical skills. Get on well with people and enjoy working with computers and gadgets. Easily and enthusiastically learn new knowledge. Summary I’m a self-motivated person, who likes work in team and work alone. Good organization and technical skills. Get on well with people and enjoy working with computers and gadgets. Easily and enthusiastically learn new knowledge. I’m a self-motivated person, who likes work in team and work alone. Good organization and technical skills. Get on well with people and enjoy working with computers and gadgets. Easily and enthusiastically learn new knowledge. I’m a self-motivated person, who likes work in team and work alone. Good organization and technical skills. Get on well with people and enjoy working with computers and gadgets. Easily and enthusiastically learn new knowledge. Experience Software Engineer: Test Development Intel Corporation January 2015  – Present (8 months) Software Technician Intel Corporation June 2014  –  December 2014  (7 months) Senior BSS Engineer LLC \"Astelit 2007  –  March 2014  (7 years) Odesa, Ukraine Software testing (white box, black box, manual testing) \nService program development (Java/Android development and testing (2013-2014), HTML/CSS (2013-2014), Ericsson proprietary scripts for OPS and WinFiol (2005-2014), Pascal (2005)) \nPreparation and reading internal trainings \nMobile network statistics analysis (Oracle SQL) \nEriccson MSS/BSS HW/SW integration, RBS integration/rehoming etc. Lead BSS Engineer Astelit February 2005  –  August 2007  (2 years 7 months) Odesa, Ukraine Ericcson MSS/BSS HW/SW integration, Ericsson RBS integration, work with statistic (Oracle SQL). Engineer Digital Communication of Ukraine (DCC) May 2000  –  February 2005  (4 years 10 months) Odesa, Ukraine Engineer Odessaoblenergo August 1999  –  May 2000  (10 months) Software Engineer: Test Development Intel Corporation January 2015  – Present (8 months) Software Engineer: Test Development Intel Corporation January 2015  – Present (8 months) Software Technician Intel Corporation June 2014  –  December 2014  (7 months) Software Technician Intel Corporation June 2014  –  December 2014  (7 months) Senior BSS Engineer LLC \"Astelit 2007  –  March 2014  (7 years) Odesa, Ukraine Software testing (white box, black box, manual testing) \nService program development (Java/Android development and testing (2013-2014), HTML/CSS (2013-2014), Ericsson proprietary scripts for OPS and WinFiol (2005-2014), Pascal (2005)) \nPreparation and reading internal trainings \nMobile network statistics analysis (Oracle SQL) \nEriccson MSS/BSS HW/SW integration, RBS integration/rehoming etc. Senior BSS Engineer LLC \"Astelit 2007  –  March 2014  (7 years) Odesa, Ukraine Software testing (white box, black box, manual testing) \nService program development (Java/Android development and testing (2013-2014), HTML/CSS (2013-2014), Ericsson proprietary scripts for OPS and WinFiol (2005-2014), Pascal (2005)) \nPreparation and reading internal trainings \nMobile network statistics analysis (Oracle SQL) \nEriccson MSS/BSS HW/SW integration, RBS integration/rehoming etc. Lead BSS Engineer Astelit February 2005  –  August 2007  (2 years 7 months) Odesa, Ukraine Ericcson MSS/BSS HW/SW integration, Ericsson RBS integration, work with statistic (Oracle SQL). Lead BSS Engineer Astelit February 2005  –  August 2007  (2 years 7 months) Odesa, Ukraine Ericcson MSS/BSS HW/SW integration, Ericsson RBS integration, work with statistic (Oracle SQL). Engineer Digital Communication of Ukraine (DCC) May 2000  –  February 2005  (4 years 10 months) Odesa, Ukraine Engineer Digital Communication of Ukraine (DCC) May 2000  –  February 2005  (4 years 10 months) Odesa, Ukraine Engineer Odessaoblenergo August 1999  –  May 2000  (10 months) Engineer Odessaoblenergo August 1999  –  May 2000  (10 months) Languages English Professional working proficiency Ukrainian Native or bilingual proficiency Russian Native or bilingual proficiency English Professional working proficiency Ukrainian Native or bilingual proficiency Russian Native or bilingual proficiency English Professional working proficiency Ukrainian Native or bilingual proficiency Russian Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Skills 2G BSS GSM Network Design PDH Telecommunications Java Android Development Ericsson OSS Integration Core Network GPRS Skills  2G BSS GSM Network Design PDH Telecommunications Java Android Development Ericsson OSS Integration Core Network GPRS 2G BSS GSM Network Design PDH Telecommunications Java Android Development Ericsson OSS Integration Core Network GPRS 2G BSS GSM Network Design PDH Telecommunications Java Android Development Ericsson OSS Integration Core Network GPRS Education Odessa National Telecommunications Academy Engineer of Telecommunications,  Computer Systems Networking and Telecommunications , Bachelor/Engineer. Diploma with honours 1994  – 1999 Activities and Societies:  Group's monitor during 3 years. Odesa high school #52 Odessa National Telecommunications Academy Engineer of Telecommunications,  Computer Systems Networking and Telecommunications , Bachelor/Engineer. Diploma with honours 1994  – 1999 Activities and Societies:  Group's monitor during 3 years. Odessa National Telecommunications Academy Engineer of Telecommunications,  Computer Systems Networking and Telecommunications , Bachelor/Engineer. Diploma with honours 1994  – 1999 Activities and Societies:  Group's monitor during 3 years. Odessa National Telecommunications Academy Engineer of Telecommunications,  Computer Systems Networking and Telecommunications , Bachelor/Engineer. Diploma with honours 1994  – 1999 Activities and Societies:  Group's monitor during 3 years. Odesa high school #52 Odesa high school #52 Odesa high school #52 ", "Summary Trained in both hardware and software – equally at home with an oscilloscope or a schematic editor as with a C compiler or a source listing. Embedded software specialist with proven experience building complex test equipment. Specialties:Embedded programming, real-time applications, start-to-finish capability to build test equipment including circuit design, component specification, mechanical design and assembly. Summary Trained in both hardware and software – equally at home with an oscilloscope or a schematic editor as with a C compiler or a source listing. Embedded software specialist with proven experience building complex test equipment. Specialties:Embedded programming, real-time applications, start-to-finish capability to build test equipment including circuit design, component specification, mechanical design and assembly. Trained in both hardware and software – equally at home with an oscilloscope or a schematic editor as with a C compiler or a source listing. Embedded software specialist with proven experience building complex test equipment. Specialties:Embedded programming, real-time applications, start-to-finish capability to build test equipment including circuit design, component specification, mechanical design and assembly. Trained in both hardware and software – equally at home with an oscilloscope or a schematic editor as with a C compiler or a source listing. Embedded software specialist with proven experience building complex test equipment. Specialties:Embedded programming, real-time applications, start-to-finish capability to build test equipment including circuit design, component specification, mechanical design and assembly. Experience Management Firmware Engineer Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Support custom Server Management firmware configurations for new Intel Server motherboards. Azad Consultant at Intel AZAD Technology Partners January 2013  –  December 2013  (1 year) Hillsboro, OR Support custom Server Management firmware configurations for new Intel Server motherboards. ASIC Embedded Engineer Enphase Energy January 2011  –  December 2012  (2 years) Petaluma, CA Supported ASIC development for new products with embedded firmware. Automated testing of power line communications. Created and executed comprehensive modem characterization tests to enhance in-depth understanding of operational characteristics. Sr. Electrical Engineer Rockwell Collins April 2004  –  March 2010  (6 years) Design and build equipment to test Head-Up Guidance Systems components, including environmental stress testing and functional testing. Pioneered innovative Stimulus Bus to support current and future generations of environmental test equipment. Redesigned functional test systems to combine seven circuit boards into one to reduce equipment build time by a minimum of 8 weeks. Sr. Embedded Software Engineer Redcellx Software November 2002  –  February 2004  (1 year 4 months) Portland, Oregon Area Ported real-time, object-oriented RTOS to PC/x86 platform, wrote serial and Ethernet drivers for OS. Brought up debug monitor on Alchemy AU1100 platform, programmed flash ROM burning software, installed embedded Linux kernel and implemented Trolltech QT GUI. Sr. Embedded Firmware Engineer PolyVision Corp. May 2001  –  July 2002  (1 year 3 months) Beaverton, OR Embedded firmware to control user interface of whiteboard camera system. Visual Basic manufacturing test software and test plan development. Debug of embedded Linux Bluetooth software stack on NetARM processor. Sr. Staff Technical Support Engineer Rational Software October 1998  –  April 2001  (2 years 7 months) Beaverton, OR Resolve problems for Ada/C/C++ development environment, including test setup on multiple architectures and operating systems to replicate issues. Software Engineer PMC-Sierra, Inc. April 1997  –  September 1998  (1 year 6 months) Beaverton, OR Embedded OS and network management software on embedded 32-bit MIPS-based RISC CPU for Ethernet switching chips. Software Engineer Sarif, Inc. March 1996  –  April 1997  (1 year 2 months) Vancouver, WA Embedded, 8088-based real-time software to control an LCD projection system, including I2C bus interface, flash ROM programming and TV tuner. Sr. Software Engineer The Coe Manufacturing Company March 1989  –  February 1996  (7 years) Portland, Oregon Area Real-time software to scan and optimize raw timber to maximize yield of finished lumber. Software written in C, x86 ASM, PL/M and Pascal included shape analysis, device drivers and machine control via interface to Programmable Logic Controllers. Software Engineer Intel Corporation February 1987  –  February 1989  (2 years 1 month) Hillsboro, OR Implemented debugger for multi-processor Distributed iRMX systems. Added network capabilities to iRMX II human interface disk file utilities. Software Engineer Cadre Technologies (formerly Northwest Instrument Systems) April 1985  –  January 1987  (1 year 10 months) Beaverton, OR First-generation GUI software to control PC-based software analysis tool. Responsible for data acquisition, post-processing and display of resuts for the SoftAnalyst, a hardware-based software performance analyzer. Software Technician Intel Corporation July 1980  –  March 1985  (4 years 9 months) Hillsboro, OR Projects included: OS configuration utility, industrial control software, iRMX device drivers, graphics firmware, MS Xenix drivers, disk subsystem tests, and memory management diagnostics. Ported debug monitors and rewrote the iRMX kernel to support the new ‘186 and ‘188 integrated processors. Management Firmware Engineer Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Support custom Server Management firmware configurations for new Intel Server motherboards. Management Firmware Engineer Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Support custom Server Management firmware configurations for new Intel Server motherboards. Azad Consultant at Intel AZAD Technology Partners January 2013  –  December 2013  (1 year) Hillsboro, OR Support custom Server Management firmware configurations for new Intel Server motherboards. Azad Consultant at Intel AZAD Technology Partners January 2013  –  December 2013  (1 year) Hillsboro, OR Support custom Server Management firmware configurations for new Intel Server motherboards. ASIC Embedded Engineer Enphase Energy January 2011  –  December 2012  (2 years) Petaluma, CA Supported ASIC development for new products with embedded firmware. Automated testing of power line communications. Created and executed comprehensive modem characterization tests to enhance in-depth understanding of operational characteristics. ASIC Embedded Engineer Enphase Energy January 2011  –  December 2012  (2 years) Petaluma, CA Supported ASIC development for new products with embedded firmware. Automated testing of power line communications. Created and executed comprehensive modem characterization tests to enhance in-depth understanding of operational characteristics. Sr. Electrical Engineer Rockwell Collins April 2004  –  March 2010  (6 years) Design and build equipment to test Head-Up Guidance Systems components, including environmental stress testing and functional testing. Pioneered innovative Stimulus Bus to support current and future generations of environmental test equipment. Redesigned functional test systems to combine seven circuit boards into one to reduce equipment build time by a minimum of 8 weeks. Sr. Electrical Engineer Rockwell Collins April 2004  –  March 2010  (6 years) Design and build equipment to test Head-Up Guidance Systems components, including environmental stress testing and functional testing. Pioneered innovative Stimulus Bus to support current and future generations of environmental test equipment. Redesigned functional test systems to combine seven circuit boards into one to reduce equipment build time by a minimum of 8 weeks. Sr. Embedded Software Engineer Redcellx Software November 2002  –  February 2004  (1 year 4 months) Portland, Oregon Area Ported real-time, object-oriented RTOS to PC/x86 platform, wrote serial and Ethernet drivers for OS. Brought up debug monitor on Alchemy AU1100 platform, programmed flash ROM burning software, installed embedded Linux kernel and implemented Trolltech QT GUI. Sr. Embedded Software Engineer Redcellx Software November 2002  –  February 2004  (1 year 4 months) Portland, Oregon Area Ported real-time, object-oriented RTOS to PC/x86 platform, wrote serial and Ethernet drivers for OS. Brought up debug monitor on Alchemy AU1100 platform, programmed flash ROM burning software, installed embedded Linux kernel and implemented Trolltech QT GUI. Sr. Embedded Firmware Engineer PolyVision Corp. May 2001  –  July 2002  (1 year 3 months) Beaverton, OR Embedded firmware to control user interface of whiteboard camera system. Visual Basic manufacturing test software and test plan development. Debug of embedded Linux Bluetooth software stack on NetARM processor. Sr. Embedded Firmware Engineer PolyVision Corp. May 2001  –  July 2002  (1 year 3 months) Beaverton, OR Embedded firmware to control user interface of whiteboard camera system. Visual Basic manufacturing test software and test plan development. Debug of embedded Linux Bluetooth software stack on NetARM processor. Sr. Staff Technical Support Engineer Rational Software October 1998  –  April 2001  (2 years 7 months) Beaverton, OR Resolve problems for Ada/C/C++ development environment, including test setup on multiple architectures and operating systems to replicate issues. Sr. Staff Technical Support Engineer Rational Software October 1998  –  April 2001  (2 years 7 months) Beaverton, OR Resolve problems for Ada/C/C++ development environment, including test setup on multiple architectures and operating systems to replicate issues. Software Engineer PMC-Sierra, Inc. April 1997  –  September 1998  (1 year 6 months) Beaverton, OR Embedded OS and network management software on embedded 32-bit MIPS-based RISC CPU for Ethernet switching chips. Software Engineer PMC-Sierra, Inc. April 1997  –  September 1998  (1 year 6 months) Beaverton, OR Embedded OS and network management software on embedded 32-bit MIPS-based RISC CPU for Ethernet switching chips. Software Engineer Sarif, Inc. March 1996  –  April 1997  (1 year 2 months) Vancouver, WA Embedded, 8088-based real-time software to control an LCD projection system, including I2C bus interface, flash ROM programming and TV tuner. Software Engineer Sarif, Inc. March 1996  –  April 1997  (1 year 2 months) Vancouver, WA Embedded, 8088-based real-time software to control an LCD projection system, including I2C bus interface, flash ROM programming and TV tuner. Sr. Software Engineer The Coe Manufacturing Company March 1989  –  February 1996  (7 years) Portland, Oregon Area Real-time software to scan and optimize raw timber to maximize yield of finished lumber. Software written in C, x86 ASM, PL/M and Pascal included shape analysis, device drivers and machine control via interface to Programmable Logic Controllers. Sr. Software Engineer The Coe Manufacturing Company March 1989  –  February 1996  (7 years) Portland, Oregon Area Real-time software to scan and optimize raw timber to maximize yield of finished lumber. Software written in C, x86 ASM, PL/M and Pascal included shape analysis, device drivers and machine control via interface to Programmable Logic Controllers. Software Engineer Intel Corporation February 1987  –  February 1989  (2 years 1 month) Hillsboro, OR Implemented debugger for multi-processor Distributed iRMX systems. Added network capabilities to iRMX II human interface disk file utilities. Software Engineer Intel Corporation February 1987  –  February 1989  (2 years 1 month) Hillsboro, OR Implemented debugger for multi-processor Distributed iRMX systems. Added network capabilities to iRMX II human interface disk file utilities. Software Engineer Cadre Technologies (formerly Northwest Instrument Systems) April 1985  –  January 1987  (1 year 10 months) Beaverton, OR First-generation GUI software to control PC-based software analysis tool. Responsible for data acquisition, post-processing and display of resuts for the SoftAnalyst, a hardware-based software performance analyzer. Software Engineer Cadre Technologies (formerly Northwest Instrument Systems) April 1985  –  January 1987  (1 year 10 months) Beaverton, OR First-generation GUI software to control PC-based software analysis tool. Responsible for data acquisition, post-processing and display of resuts for the SoftAnalyst, a hardware-based software performance analyzer. Software Technician Intel Corporation July 1980  –  March 1985  (4 years 9 months) Hillsboro, OR Projects included: OS configuration utility, industrial control software, iRMX device drivers, graphics firmware, MS Xenix drivers, disk subsystem tests, and memory management diagnostics. Ported debug monitors and rewrote the iRMX kernel to support the new ‘186 and ‘188 integrated processors. Software Technician Intel Corporation July 1980  –  March 1985  (4 years 9 months) Hillsboro, OR Projects included: OS configuration utility, industrial control software, iRMX device drivers, graphics firmware, MS Xenix drivers, disk subsystem tests, and memory management diagnostics. Ported debug monitors and rewrote the iRMX kernel to support the new ‘186 and ‘188 integrated processors. Skills Embedded Software Embedded Systems C Hardware RTOS Python Test Automation Test Equipment Assembly Language Embedded Linux Firmware Debugging Ada programming PL/M 8051 Microcontroller uCOS Nucleus Plus GNU tools OrCAD Capture CIS PADS Layout X86 PowerPC MIPS Alchemy Serial Protocols USB Ethernet Fibre Channel ARINC 429 Oscilloscope Multimeter Spectrum Analyzer Logic Analyzer GPIB I2C SPI Flash Memory Interrupts Customer Support Field Service PCB design Device Drivers Testing See 28+     See less Skills  Embedded Software Embedded Systems C Hardware RTOS Python Test Automation Test Equipment Assembly Language Embedded Linux Firmware Debugging Ada programming PL/M 8051 Microcontroller uCOS Nucleus Plus GNU tools OrCAD Capture CIS PADS Layout X86 PowerPC MIPS Alchemy Serial Protocols USB Ethernet Fibre Channel ARINC 429 Oscilloscope Multimeter Spectrum Analyzer Logic Analyzer GPIB I2C SPI Flash Memory Interrupts Customer Support Field Service PCB design Device Drivers Testing See 28+     See less Embedded Software Embedded Systems C Hardware RTOS Python Test Automation Test Equipment Assembly Language Embedded Linux Firmware Debugging Ada programming PL/M 8051 Microcontroller uCOS Nucleus Plus GNU tools OrCAD Capture CIS PADS Layout X86 PowerPC MIPS Alchemy Serial Protocols USB Ethernet Fibre Channel ARINC 429 Oscilloscope Multimeter Spectrum Analyzer Logic Analyzer GPIB I2C SPI Flash Memory Interrupts Customer Support Field Service PCB design Device Drivers Testing See 28+     See less Embedded Software Embedded Systems C Hardware RTOS Python Test Automation Test Equipment Assembly Language Embedded Linux Firmware Debugging Ada programming PL/M 8051 Microcontroller uCOS Nucleus Plus GNU tools OrCAD Capture CIS PADS Layout X86 PowerPC MIPS Alchemy Serial Protocols USB Ethernet Fibre Channel ARINC 429 Oscilloscope Multimeter Spectrum Analyzer Logic Analyzer GPIB I2C SPI Flash Memory Interrupts Customer Support Field Service PCB design Device Drivers Testing See 28+     See less Education Clackamas Community College Journalism ,  Theatre Portland Community College AAS,  Computer Software Technician , 4.0 Only student to graduate with a 4.0 GPA Portland State University Information Structures , 4.0 Clackamas Community College Journalism ,  Theatre Clackamas Community College Journalism ,  Theatre Clackamas Community College Journalism ,  Theatre Portland Community College AAS,  Computer Software Technician , 4.0 Only student to graduate with a 4.0 GPA Portland Community College AAS,  Computer Software Technician , 4.0 Only student to graduate with a 4.0 GPA Portland Community College AAS,  Computer Software Technician , 4.0 Only student to graduate with a 4.0 GPA Portland State University Information Structures , 4.0 Portland State University Information Structures , 4.0 Portland State University Information Structures , 4.0 ", "Experience Software Technician Intel Corporation April 2010  – Present (5 years 5 months) SSD Validation; Altiris 6.9 Admin; Altiris 7.1 Admin; Automation software development using Python, Batch, etc Front Desk Manager La Quinta January 2007  –  April 2010  (3 years 4 months) Software Technician Intel Corporation April 2010  – Present (5 years 5 months) SSD Validation; Altiris 6.9 Admin; Altiris 7.1 Admin; Automation software development using Python, Batch, etc Software Technician Intel Corporation April 2010  – Present (5 years 5 months) SSD Validation; Altiris 6.9 Admin; Altiris 7.1 Admin; Automation software development using Python, Batch, etc Front Desk Manager La Quinta January 2007  –  April 2010  (3 years 4 months) Front Desk Manager La Quinta January 2007  –  April 2010  (3 years 4 months) Skills Altiris Altiris Console Altiris Deployment... Python Software Engineering Software Development Visual Studio Debugging Operating Systems Hardware Testing Skills  Altiris Altiris Console Altiris Deployment... Python Software Engineering Software Development Visual Studio Debugging Operating Systems Hardware Testing Altiris Altiris Console Altiris Deployment... Python Software Engineering Software Development Visual Studio Debugging Operating Systems Hardware Testing Altiris Altiris Console Altiris Deployment... Python Software Engineering Software Development Visual Studio Debugging Operating Systems Hardware Testing Education Regis University Computer Science 2015  – 2017 American River College 2012  – 2015 ITT Technical Institute-Rancho Cordova Associate of Science (A.S.),  Electrical Engineering Technologies/Technicians 2008  – 2010 Regis University Computer Science 2015  – 2017 Regis University Computer Science 2015  – 2017 Regis University Computer Science 2015  – 2017 American River College 2012  – 2015 American River College 2012  – 2015 American River College 2012  – 2015 ITT Technical Institute-Rancho Cordova Associate of Science (A.S.),  Electrical Engineering Technologies/Technicians 2008  – 2010 ITT Technical Institute-Rancho Cordova Associate of Science (A.S.),  Electrical Engineering Technologies/Technicians 2008  – 2010 ITT Technical Institute-Rancho Cordova Associate of Science (A.S.),  Electrical Engineering Technologies/Technicians 2008  – 2010 ", "Skills Intel PCIe Device Drivers Bios Processors Debugging Firmware Computer Architecture X86 SoC Microprocessors Embedded Systems Hardware Architecture Kernel Embedded Software USB ASIC SATA See 3+     See less Skills  Intel PCIe Device Drivers Bios Processors Debugging Firmware Computer Architecture X86 SoC Microprocessors Embedded Systems Hardware Architecture Kernel Embedded Software USB ASIC SATA See 3+     See less Intel PCIe Device Drivers Bios Processors Debugging Firmware Computer Architecture X86 SoC Microprocessors Embedded Systems Hardware Architecture Kernel Embedded Software USB ASIC SATA See 3+     See less Intel PCIe Device Drivers Bios Processors Debugging Firmware Computer Architecture X86 SoC Microprocessors Embedded Systems Hardware Architecture Kernel Embedded Software USB ASIC SATA See 3+     See less ", "Experience Performance Benchmarking Software Technician Intel Corporation September 2011  – Present (4 years) Performance testing of internal and external storage hardware and software. SCM Technician Intel Corporation March 2010  –  September 2011  (1 year 7 months) Setup, configure, smoke test, and troubleshoot new hardware platforms for storage product testing. Validation Engineering Technician (Contractor) Intel March 2009  –  March 2010  (1 year 1 month) Validate data storage products with the engineering team to debug and reproduce issues. CMP R&D Polish Tech. Rohm & Haas Electronic Materials July 2006  –  December 2008  (2 years 6 months) Execute R&D experiments for pad, slurry, and conditioner development in 200/300mm CMP process. Production Specialist Microchip Technology October 2005  –  June 2006  (9 months) Thinfilm/CMP Tool Operator. Compatibility Validation Technician Intel Corp. 1998  –  2001  (3 years) Performance Benchmarking Software Technician Intel Corporation September 2011  – Present (4 years) Performance testing of internal and external storage hardware and software. Performance Benchmarking Software Technician Intel Corporation September 2011  – Present (4 years) Performance testing of internal and external storage hardware and software. SCM Technician Intel Corporation March 2010  –  September 2011  (1 year 7 months) Setup, configure, smoke test, and troubleshoot new hardware platforms for storage product testing. SCM Technician Intel Corporation March 2010  –  September 2011  (1 year 7 months) Setup, configure, smoke test, and troubleshoot new hardware platforms for storage product testing. Validation Engineering Technician (Contractor) Intel March 2009  –  March 2010  (1 year 1 month) Validate data storage products with the engineering team to debug and reproduce issues. Validation Engineering Technician (Contractor) Intel March 2009  –  March 2010  (1 year 1 month) Validate data storage products with the engineering team to debug and reproduce issues. CMP R&D Polish Tech. Rohm & Haas Electronic Materials July 2006  –  December 2008  (2 years 6 months) Execute R&D experiments for pad, slurry, and conditioner development in 200/300mm CMP process. CMP R&D Polish Tech. Rohm & Haas Electronic Materials July 2006  –  December 2008  (2 years 6 months) Execute R&D experiments for pad, slurry, and conditioner development in 200/300mm CMP process. Production Specialist Microchip Technology October 2005  –  June 2006  (9 months) Thinfilm/CMP Tool Operator. Production Specialist Microchip Technology October 2005  –  June 2006  (9 months) Thinfilm/CMP Tool Operator. Compatibility Validation Technician Intel Corp. 1998  –  2001  (3 years) Compatibility Validation Technician Intel Corp. 1998  –  2001  (3 years) "]}