{"position": "Software Build Engineer", "company": "Intel Corporation", "profiles": ["Experience Software Build Engineer Intel Corporation March 2014  – Present (1 year 6 months) Chandler, AZ Software Build Engineer Intel Corporation March 2014  – Present (1 year 6 months) Chandler, AZ Software Build Engineer Intel Corporation March 2014  – Present (1 year 6 months) Chandler, AZ Skills Skills     ", "Experience Software Engineer Intel Software Build Engineer Intel Corporation September 2014  – Present (1 year) Chandler Software Engineer Intel Software Engineer Intel Software Build Engineer Intel Corporation September 2014  – Present (1 year) Chandler Software Build Engineer Intel Corporation September 2014  – Present (1 year) Chandler Skills Debugging Perl Embedded Systems Device Drivers Computer Architecture Software Engineering Multithreading USB PCIe Firmware Intel Processors RTOS Test Planning Systems Engineering X86 Microprocessors Testing Storage Technical Leadership Linux Kernel Functional Verification Scrum ClearCase Operating Systems Agile Methodologies Software Design Embedded Software Programming C SoC Software Development Architecture Object Oriented Design Algorithms Software Quality... Hardware SATA See 23+     See less Skills  Debugging Perl Embedded Systems Device Drivers Computer Architecture Software Engineering Multithreading USB PCIe Firmware Intel Processors RTOS Test Planning Systems Engineering X86 Microprocessors Testing Storage Technical Leadership Linux Kernel Functional Verification Scrum ClearCase Operating Systems Agile Methodologies Software Design Embedded Software Programming C SoC Software Development Architecture Object Oriented Design Algorithms Software Quality... Hardware SATA See 23+     See less Debugging Perl Embedded Systems Device Drivers Computer Architecture Software Engineering Multithreading USB PCIe Firmware Intel Processors RTOS Test Planning Systems Engineering X86 Microprocessors Testing Storage Technical Leadership Linux Kernel Functional Verification Scrum ClearCase Operating Systems Agile Methodologies Software Design Embedded Software Programming C SoC Software Development Architecture Object Oriented Design Algorithms Software Quality... Hardware SATA See 23+     See less Debugging Perl Embedded Systems Device Drivers Computer Architecture Software Engineering Multithreading USB PCIe Firmware Intel Processors RTOS Test Planning Systems Engineering X86 Microprocessors Testing Storage Technical Leadership Linux Kernel Functional Verification Scrum ClearCase Operating Systems Agile Methodologies Software Design Embedded Software Programming C SoC Software Development Architecture Object Oriented Design Algorithms Software Quality... Hardware SATA See 23+     See less Education State University of New York College at Oswego BA,  Computer Science , Math minor 2001  – 2005 Activities and Societies:  Computer Science Association ,  Women in Computing ,  Fencing club ,  Shaun Cassidy Fan Club (Improv Comedy troupe) ,  STG president ,  Hosted a radio show State University of New York College at Oswego BA,  Computer Science , Math minor 2001  – 2005 Activities and Societies:  Computer Science Association ,  Women in Computing ,  Fencing club ,  Shaun Cassidy Fan Club (Improv Comedy troupe) ,  STG president ,  Hosted a radio show State University of New York College at Oswego BA,  Computer Science , Math minor 2001  – 2005 Activities and Societies:  Computer Science Association ,  Women in Computing ,  Fencing club ,  Shaun Cassidy Fan Club (Improv Comedy troupe) ,  STG president ,  Hosted a radio show State University of New York College at Oswego BA,  Computer Science , Math minor 2001  – 2005 Activities and Societies:  Computer Science Association ,  Women in Computing ,  Fencing club ,  Shaun Cassidy Fan Club (Improv Comedy troupe) ,  STG president ,  Hosted a radio show ", "Experience Software Build Engineer Intel Corporation Mac Support Lead CompuCom March 2006  –  July 2015  (9 years 5 months) JAMF Casper server admin \nEscalation Support \nBash Scripting \nQA \nBuild testing Software Build Engineer Intel Corporation Software Build Engineer Intel Corporation Mac Support Lead CompuCom March 2006  –  July 2015  (9 years 5 months) JAMF Casper server admin \nEscalation Support \nBash Scripting \nQA \nBuild testing Mac Support Lead CompuCom March 2006  –  July 2015  (9 years 5 months) JAMF Casper server admin \nEscalation Support \nBash Scripting \nQA \nBuild testing Skills Troubleshooting Microsoft Office Team Leadership Windows Integration Product Management User Experience Skills  Troubleshooting Microsoft Office Team Leadership Windows Integration Product Management User Experience Troubleshooting Microsoft Office Team Leadership Windows Integration Product Management User Experience Troubleshooting Microsoft Office Team Leadership Windows Integration Product Management User Experience ", "Summary As CEO of TIPTOP, I am proud to say that we do a few things very well: \n \n1. We make your phone ring with TARGETED and QUALIFIED prospects who are actively seeking to purchase your products and services. \n \n2. We make you more visible to stand above and dominate your market. \n \n3. We cause your competition to envy you. \n \nWhat is our \"Unique Selling Proposition\" (why you should select us instead of the others)? \n \nIt is this... our compensation is on a contingency basis and upon the GROWTH of your bottom line. \n \nIf you are tired of the same song & dance that comes without hard accountable results from your \"internet marketing guru\" or \"SEO provider\", we need to talk. If anything, we will open your mind to the many options to take your business to the next level. \n \nLet me offer you this... would you like to see what your competition is doing to profitably take business from you? \n \nThat is not a rhetorical question but a serious, legitimate (and free) offer from TIPTOP to you exclusively. \n \nInterested? Let's talk! \n \n----- \n \nI founded my internet marketing company because I saw how crucial it is to have a dominate presence on the internet. After optimizing a nation-wide real estate website and getting hundreds of leads from all across the United States, I quickly realized the vast need of competent lead generation services. \n \nSearch Engine Optimization \nInternet Marketing (search engine ranking positioning) \nGoogle Adwords/PPC \nCosmetic Surgery Internet Marketing, \nInternet Marketing Portland,  \nArticle submissions,  \nCopywriting, \nSearch Engine Optimization,  \nPortland internet marketing,  \nsocial media marketing,  \nPress Release creation,  \nSEO services Portland,  \nSocial Media, \nVideo Marketing Summary As CEO of TIPTOP, I am proud to say that we do a few things very well: \n \n1. We make your phone ring with TARGETED and QUALIFIED prospects who are actively seeking to purchase your products and services. \n \n2. We make you more visible to stand above and dominate your market. \n \n3. We cause your competition to envy you. \n \nWhat is our \"Unique Selling Proposition\" (why you should select us instead of the others)? \n \nIt is this... our compensation is on a contingency basis and upon the GROWTH of your bottom line. \n \nIf you are tired of the same song & dance that comes without hard accountable results from your \"internet marketing guru\" or \"SEO provider\", we need to talk. If anything, we will open your mind to the many options to take your business to the next level. \n \nLet me offer you this... would you like to see what your competition is doing to profitably take business from you? \n \nThat is not a rhetorical question but a serious, legitimate (and free) offer from TIPTOP to you exclusively. \n \nInterested? Let's talk! \n \n----- \n \nI founded my internet marketing company because I saw how crucial it is to have a dominate presence on the internet. After optimizing a nation-wide real estate website and getting hundreds of leads from all across the United States, I quickly realized the vast need of competent lead generation services. \n \nSearch Engine Optimization \nInternet Marketing (search engine ranking positioning) \nGoogle Adwords/PPC \nCosmetic Surgery Internet Marketing, \nInternet Marketing Portland,  \nArticle submissions,  \nCopywriting, \nSearch Engine Optimization,  \nPortland internet marketing,  \nsocial media marketing,  \nPress Release creation,  \nSEO services Portland,  \nSocial Media, \nVideo Marketing As CEO of TIPTOP, I am proud to say that we do a few things very well: \n \n1. We make your phone ring with TARGETED and QUALIFIED prospects who are actively seeking to purchase your products and services. \n \n2. We make you more visible to stand above and dominate your market. \n \n3. We cause your competition to envy you. \n \nWhat is our \"Unique Selling Proposition\" (why you should select us instead of the others)? \n \nIt is this... our compensation is on a contingency basis and upon the GROWTH of your bottom line. \n \nIf you are tired of the same song & dance that comes without hard accountable results from your \"internet marketing guru\" or \"SEO provider\", we need to talk. If anything, we will open your mind to the many options to take your business to the next level. \n \nLet me offer you this... would you like to see what your competition is doing to profitably take business from you? \n \nThat is not a rhetorical question but a serious, legitimate (and free) offer from TIPTOP to you exclusively. \n \nInterested? Let's talk! \n \n----- \n \nI founded my internet marketing company because I saw how crucial it is to have a dominate presence on the internet. After optimizing a nation-wide real estate website and getting hundreds of leads from all across the United States, I quickly realized the vast need of competent lead generation services. \n \nSearch Engine Optimization \nInternet Marketing (search engine ranking positioning) \nGoogle Adwords/PPC \nCosmetic Surgery Internet Marketing, \nInternet Marketing Portland,  \nArticle submissions,  \nCopywriting, \nSearch Engine Optimization,  \nPortland internet marketing,  \nsocial media marketing,  \nPress Release creation,  \nSEO services Portland,  \nSocial Media, \nVideo Marketing As CEO of TIPTOP, I am proud to say that we do a few things very well: \n \n1. We make your phone ring with TARGETED and QUALIFIED prospects who are actively seeking to purchase your products and services. \n \n2. We make you more visible to stand above and dominate your market. \n \n3. We cause your competition to envy you. \n \nWhat is our \"Unique Selling Proposition\" (why you should select us instead of the others)? \n \nIt is this... our compensation is on a contingency basis and upon the GROWTH of your bottom line. \n \nIf you are tired of the same song & dance that comes without hard accountable results from your \"internet marketing guru\" or \"SEO provider\", we need to talk. If anything, we will open your mind to the many options to take your business to the next level. \n \nLet me offer you this... would you like to see what your competition is doing to profitably take business from you? \n \nThat is not a rhetorical question but a serious, legitimate (and free) offer from TIPTOP to you exclusively. \n \nInterested? Let's talk! \n \n----- \n \nI founded my internet marketing company because I saw how crucial it is to have a dominate presence on the internet. After optimizing a nation-wide real estate website and getting hundreds of leads from all across the United States, I quickly realized the vast need of competent lead generation services. \n \nSearch Engine Optimization \nInternet Marketing (search engine ranking positioning) \nGoogle Adwords/PPC \nCosmetic Surgery Internet Marketing, \nInternet Marketing Portland,  \nArticle submissions,  \nCopywriting, \nSearch Engine Optimization,  \nPortland internet marketing,  \nsocial media marketing,  \nPress Release creation,  \nSEO services Portland,  \nSocial Media, \nVideo Marketing Experience Author of David Galan’s Guide to Successful Business Marketing Online Marketing Portland September 2011  – Present (4 years) Book Title: David Galan’s Guide to Successful Business Marketing Online. Dominate the Internet, Get More Clients, Boost Your Profits! Internet Marketing Portland Owner Tip Top Internet Marketing, llc June 2009  – Present (6 years 3 months) Portland, Oregon Area Pin-point targeted leads onto your webpage to warm up potential clients and generate more business with top search engine placement, webpage optimization, video marketing, social media, and mobile marketing. SEO Services Portland. Portland Internet Marketing. Real Estate Investor (private) 2004  – Present (11 years) Multi-state Real Estate Investor - Purchase -> remodel -> sell -> invest Software - Installation and Software Build Engineer Intel Corporation 2003  –  2004  (1 year) Hillsboro, OR Developed, migrated, and maintained installation scripting software for Intel's networked video box prototype. Initially developed using InstallShield 6 and migrated to InstallShield 7 including Microsoft Windows Installer.  \n \nTasks included: custom install dialog windows, system and software requirement verifications, custom feature and package with custom actions, 3rd party software silent install integration for seamless installs, localization for multiple languages, . \n \nSoftware build modifications and maintenance using PVCS, PERL and batch scripting, daily automated and manual builds, on Linux and Windows systems.  \n \nCollaborated with software product engineers for frequent file and system requirement changes.  \n \nWorked closely with Quality Assurance to write and execute test plans and scripts for tracking defects and fixes for multiple network, system, and software configurations. Contractor - Software Build Engineer Intel 2000  –  2002  (2 years) Developed and supported installation software for Intel’s line of 7 web cams, 2 MP3 audio players, and wireless peripherals using InstallShield Pro 6.1 for distribution to Intel’s customer base and OEM partners. Translated and migrated features of Intel's main installation release to IS Developer 7 for evaluation and to determine costs, time, support, and manpower requirements for complete migration. \n \nImplemented advanced installation solutions such as hardware driver configurations/updates, Windows logo compliance, file registration, custom uninstallations, registry manipulation and privilege setting. Integrated and tested 3rd party applications including: MGI Photosuite, DxMedia, DirectX8.0a, Windows Media Player 7, Microsoft Web Publisher, and MusicMatch Jukebox. \n \nProvided outline and flow documents for Customer Support, Marketing, and Technical Publications groups. Led group code reviews and gave project presentations. Improved ease of maintenance by organizing directory structures and build processes. Scoped, planned and integrated time-saving features to expedite/assist group responsibilities for Quality Assurance, Product Localization, Hardware Integration, Configuration Management, and System Compatibility teams. Installation Release Engineer Cadence Design Systems 1997  –  2000  (3 years) ( OrCad aquired by Cadence ) \nDeveloped, enhanced, maintained, and automated installation compilation and builds for 15 different Cadence EDA products within 5 company releases using InstallShield Pro 5.5. Evaluated and determined IS Developer 7 suitability for Cadence's minor product releases.  \n \nGathered requirement specifications from product development groups and project management for installation program development. Provided installation evaluations and project scheduling estimates for short and long term releases.  \n \nReleased complex installations which included the installing/modifying/configuration of: files, folders, .INI files, registry entries, DLL registration, common files, uninstallations, software detection, patches, remote installs, 3rd party installs, and installations/updates from the Web. Integrated software security and product licensing into installation. Integrated and tested 3rd party applications including: ODBC, DCOM 95, IE 5, Adobe Acrobat Reader, ActiveX. \n \nMade product install images and CDs for R&D, QA, technical support, and technical communications teams by automating 6 nightly image build scripts utilizing the NT scheduler, PERL, DOS batch, and ClearCase. Developed Autoplay start-up program and product configuration utilities using Visual C++ 6.0. Installed MemoHASP, NetHasp, Rainbow, FLEXid, and NIC hardware locking utilities and drivers. Software Installation Engineer Orcadesign Consultants 1996  –  1997  (1 year) Developed installation software and builds for product line. Systems Analyst Boeing 1993  –  1995  (2 years) Obtained requirement/functional specifications for procurement, financial, accounts payable, and reporting systems to facilitate project planning, testing, development, and implementation. Improved data entry and procurement productivity by proposing, documenting, verifying, and approving system modifications. Created custom reports and developed database feeds for system interfacing utilizing SQL for warehouse personnel, end-users, managers, vice president operations. Specialist US Army 1987  –  1995  (8 years) AZ, WA Ammunition Specialist - Secure, itemize, package, and deliver AT and AP ammunition. \n \nM1-Abram Tank Driver Author of David Galan’s Guide to Successful Business Marketing Online Marketing Portland September 2011  – Present (4 years) Book Title: David Galan’s Guide to Successful Business Marketing Online. Dominate the Internet, Get More Clients, Boost Your Profits! Author of David Galan’s Guide to Successful Business Marketing Online Marketing Portland September 2011  – Present (4 years) Book Title: David Galan’s Guide to Successful Business Marketing Online. Dominate the Internet, Get More Clients, Boost Your Profits! Internet Marketing Portland Owner Tip Top Internet Marketing, llc June 2009  – Present (6 years 3 months) Portland, Oregon Area Pin-point targeted leads onto your webpage to warm up potential clients and generate more business with top search engine placement, webpage optimization, video marketing, social media, and mobile marketing. SEO Services Portland. Portland Internet Marketing. Internet Marketing Portland Owner Tip Top Internet Marketing, llc June 2009  – Present (6 years 3 months) Portland, Oregon Area Pin-point targeted leads onto your webpage to warm up potential clients and generate more business with top search engine placement, webpage optimization, video marketing, social media, and mobile marketing. SEO Services Portland. Portland Internet Marketing. Real Estate Investor (private) 2004  – Present (11 years) Multi-state Real Estate Investor - Purchase -> remodel -> sell -> invest Real Estate Investor (private) 2004  – Present (11 years) Multi-state Real Estate Investor - Purchase -> remodel -> sell -> invest Software - Installation and Software Build Engineer Intel Corporation 2003  –  2004  (1 year) Hillsboro, OR Developed, migrated, and maintained installation scripting software for Intel's networked video box prototype. Initially developed using InstallShield 6 and migrated to InstallShield 7 including Microsoft Windows Installer.  \n \nTasks included: custom install dialog windows, system and software requirement verifications, custom feature and package with custom actions, 3rd party software silent install integration for seamless installs, localization for multiple languages, . \n \nSoftware build modifications and maintenance using PVCS, PERL and batch scripting, daily automated and manual builds, on Linux and Windows systems.  \n \nCollaborated with software product engineers for frequent file and system requirement changes.  \n \nWorked closely with Quality Assurance to write and execute test plans and scripts for tracking defects and fixes for multiple network, system, and software configurations. Software - Installation and Software Build Engineer Intel Corporation 2003  –  2004  (1 year) Hillsboro, OR Developed, migrated, and maintained installation scripting software for Intel's networked video box prototype. Initially developed using InstallShield 6 and migrated to InstallShield 7 including Microsoft Windows Installer.  \n \nTasks included: custom install dialog windows, system and software requirement verifications, custom feature and package with custom actions, 3rd party software silent install integration for seamless installs, localization for multiple languages, . \n \nSoftware build modifications and maintenance using PVCS, PERL and batch scripting, daily automated and manual builds, on Linux and Windows systems.  \n \nCollaborated with software product engineers for frequent file and system requirement changes.  \n \nWorked closely with Quality Assurance to write and execute test plans and scripts for tracking defects and fixes for multiple network, system, and software configurations. Contractor - Software Build Engineer Intel 2000  –  2002  (2 years) Developed and supported installation software for Intel’s line of 7 web cams, 2 MP3 audio players, and wireless peripherals using InstallShield Pro 6.1 for distribution to Intel’s customer base and OEM partners. Translated and migrated features of Intel's main installation release to IS Developer 7 for evaluation and to determine costs, time, support, and manpower requirements for complete migration. \n \nImplemented advanced installation solutions such as hardware driver configurations/updates, Windows logo compliance, file registration, custom uninstallations, registry manipulation and privilege setting. Integrated and tested 3rd party applications including: MGI Photosuite, DxMedia, DirectX8.0a, Windows Media Player 7, Microsoft Web Publisher, and MusicMatch Jukebox. \n \nProvided outline and flow documents for Customer Support, Marketing, and Technical Publications groups. Led group code reviews and gave project presentations. Improved ease of maintenance by organizing directory structures and build processes. Scoped, planned and integrated time-saving features to expedite/assist group responsibilities for Quality Assurance, Product Localization, Hardware Integration, Configuration Management, and System Compatibility teams. Contractor - Software Build Engineer Intel 2000  –  2002  (2 years) Developed and supported installation software for Intel’s line of 7 web cams, 2 MP3 audio players, and wireless peripherals using InstallShield Pro 6.1 for distribution to Intel’s customer base and OEM partners. Translated and migrated features of Intel's main installation release to IS Developer 7 for evaluation and to determine costs, time, support, and manpower requirements for complete migration. \n \nImplemented advanced installation solutions such as hardware driver configurations/updates, Windows logo compliance, file registration, custom uninstallations, registry manipulation and privilege setting. Integrated and tested 3rd party applications including: MGI Photosuite, DxMedia, DirectX8.0a, Windows Media Player 7, Microsoft Web Publisher, and MusicMatch Jukebox. \n \nProvided outline and flow documents for Customer Support, Marketing, and Technical Publications groups. Led group code reviews and gave project presentations. Improved ease of maintenance by organizing directory structures and build processes. Scoped, planned and integrated time-saving features to expedite/assist group responsibilities for Quality Assurance, Product Localization, Hardware Integration, Configuration Management, and System Compatibility teams. Installation Release Engineer Cadence Design Systems 1997  –  2000  (3 years) ( OrCad aquired by Cadence ) \nDeveloped, enhanced, maintained, and automated installation compilation and builds for 15 different Cadence EDA products within 5 company releases using InstallShield Pro 5.5. Evaluated and determined IS Developer 7 suitability for Cadence's minor product releases.  \n \nGathered requirement specifications from product development groups and project management for installation program development. Provided installation evaluations and project scheduling estimates for short and long term releases.  \n \nReleased complex installations which included the installing/modifying/configuration of: files, folders, .INI files, registry entries, DLL registration, common files, uninstallations, software detection, patches, remote installs, 3rd party installs, and installations/updates from the Web. Integrated software security and product licensing into installation. Integrated and tested 3rd party applications including: ODBC, DCOM 95, IE 5, Adobe Acrobat Reader, ActiveX. \n \nMade product install images and CDs for R&D, QA, technical support, and technical communications teams by automating 6 nightly image build scripts utilizing the NT scheduler, PERL, DOS batch, and ClearCase. Developed Autoplay start-up program and product configuration utilities using Visual C++ 6.0. Installed MemoHASP, NetHasp, Rainbow, FLEXid, and NIC hardware locking utilities and drivers. Installation Release Engineer Cadence Design Systems 1997  –  2000  (3 years) ( OrCad aquired by Cadence ) \nDeveloped, enhanced, maintained, and automated installation compilation and builds for 15 different Cadence EDA products within 5 company releases using InstallShield Pro 5.5. Evaluated and determined IS Developer 7 suitability for Cadence's minor product releases.  \n \nGathered requirement specifications from product development groups and project management for installation program development. Provided installation evaluations and project scheduling estimates for short and long term releases.  \n \nReleased complex installations which included the installing/modifying/configuration of: files, folders, .INI files, registry entries, DLL registration, common files, uninstallations, software detection, patches, remote installs, 3rd party installs, and installations/updates from the Web. Integrated software security and product licensing into installation. Integrated and tested 3rd party applications including: ODBC, DCOM 95, IE 5, Adobe Acrobat Reader, ActiveX. \n \nMade product install images and CDs for R&D, QA, technical support, and technical communications teams by automating 6 nightly image build scripts utilizing the NT scheduler, PERL, DOS batch, and ClearCase. Developed Autoplay start-up program and product configuration utilities using Visual C++ 6.0. Installed MemoHASP, NetHasp, Rainbow, FLEXid, and NIC hardware locking utilities and drivers. Software Installation Engineer Orcadesign Consultants 1996  –  1997  (1 year) Developed installation software and builds for product line. Software Installation Engineer Orcadesign Consultants 1996  –  1997  (1 year) Developed installation software and builds for product line. Systems Analyst Boeing 1993  –  1995  (2 years) Obtained requirement/functional specifications for procurement, financial, accounts payable, and reporting systems to facilitate project planning, testing, development, and implementation. Improved data entry and procurement productivity by proposing, documenting, verifying, and approving system modifications. Created custom reports and developed database feeds for system interfacing utilizing SQL for warehouse personnel, end-users, managers, vice president operations. Systems Analyst Boeing 1993  –  1995  (2 years) Obtained requirement/functional specifications for procurement, financial, accounts payable, and reporting systems to facilitate project planning, testing, development, and implementation. Improved data entry and procurement productivity by proposing, documenting, verifying, and approving system modifications. Created custom reports and developed database feeds for system interfacing utilizing SQL for warehouse personnel, end-users, managers, vice president operations. Specialist US Army 1987  –  1995  (8 years) AZ, WA Ammunition Specialist - Secure, itemize, package, and deliver AT and AP ammunition. \n \nM1-Abram Tank Driver Specialist US Army 1987  –  1995  (8 years) AZ, WA Ammunition Specialist - Secure, itemize, package, and deliver AT and AP ammunition. \n \nM1-Abram Tank Driver Languages English Spanish English Spanish English Spanish Skills Business Growth... Lead Generation Business Systems... Business Strategy Marketing Strategy Internet Marketing Business Process... Entrepreneurship Systems Analysis Online Marketing Program Management Social Media Marketing SEO Video Production Marketing Social Media Investors Business Analysis Start-ups Real Estate Transactions Real Estate Marketing Web Marketing Creative Real Estate... Real Estate Investment... Small Business Marketing Small Business Online... Managing Business Growth Small Business... Web Analytics Pay for Performance Analytics B2B Marketing B2B Marketing Strategy Competitive Analysis Strategic Partnerships Marketing Management Testing Integration Strategic Planning See 24+     See less Skills  Business Growth... Lead Generation Business Systems... Business Strategy Marketing Strategy Internet Marketing Business Process... Entrepreneurship Systems Analysis Online Marketing Program Management Social Media Marketing SEO Video Production Marketing Social Media Investors Business Analysis Start-ups Real Estate Transactions Real Estate Marketing Web Marketing Creative Real Estate... Real Estate Investment... Small Business Marketing Small Business Online... Managing Business Growth Small Business... Web Analytics Pay for Performance Analytics B2B Marketing B2B Marketing Strategy Competitive Analysis Strategic Partnerships Marketing Management Testing Integration Strategic Planning See 24+     See less Business Growth... Lead Generation Business Systems... Business Strategy Marketing Strategy Internet Marketing Business Process... Entrepreneurship Systems Analysis Online Marketing Program Management Social Media Marketing SEO Video Production Marketing Social Media Investors Business Analysis Start-ups Real Estate Transactions Real Estate Marketing Web Marketing Creative Real Estate... Real Estate Investment... Small Business Marketing Small Business Online... Managing Business Growth Small Business... Web Analytics Pay for Performance Analytics B2B Marketing B2B Marketing Strategy Competitive Analysis Strategic Partnerships Marketing Management Testing Integration Strategic Planning See 24+     See less Business Growth... Lead Generation Business Systems... Business Strategy Marketing Strategy Internet Marketing Business Process... Entrepreneurship Systems Analysis Online Marketing Program Management Social Media Marketing SEO Video Production Marketing Social Media Investors Business Analysis Start-ups Real Estate Transactions Real Estate Marketing Web Marketing Creative Real Estate... Real Estate Investment... Small Business Marketing Small Business Online... Managing Business Growth Small Business... Web Analytics Pay for Performance Analytics B2B Marketing B2B Marketing Strategy Competitive Analysis Strategic Partnerships Marketing Management Testing Integration Strategic Planning See 24+     See less Education Northern Arizona University Bachelor of Science Activities and Societies:  Magna Cum Laude\nSH Professional Engineers Northern Arizona University Bachelor of Science Activities and Societies:  Magna Cum Laude\nSH Professional Engineers Northern Arizona University Bachelor of Science Activities and Societies:  Magna Cum Laude\nSH Professional Engineers Northern Arizona University Bachelor of Science Activities and Societies:  Magna Cum Laude\nSH Professional Engineers Honors & Awards Additional Honors & Awards Wallmasters Toastmasters \nLos Bilingues Toastmasters Additional Honors & Awards Wallmasters Toastmasters \nLos Bilingues Toastmasters Additional Honors & Awards Wallmasters Toastmasters \nLos Bilingues Toastmasters Additional Honors & Awards Wallmasters Toastmasters \nLos Bilingues Toastmasters "]}