{"position": "Software Engineer Intern", "company": "Intel Corporation", "profiles": ["Summary I am pursuing my Dual Masters in Computer and Information Science and Computer Graphics and Game Technology at University of Pennsylvania. I am currently looking for a summer internship as a Software Developer. \n \nMy key interests are in the area of Distributed Systems, Computer Graphics and Computer Networks. Summary I am pursuing my Dual Masters in Computer and Information Science and Computer Graphics and Game Technology at University of Pennsylvania. I am currently looking for a summer internship as a Software Developer. \n \nMy key interests are in the area of Distributed Systems, Computer Graphics and Computer Networks. I am pursuing my Dual Masters in Computer and Information Science and Computer Graphics and Game Technology at University of Pennsylvania. I am currently looking for a summer internship as a Software Developer. \n \nMy key interests are in the area of Distributed Systems, Computer Graphics and Computer Networks. I am pursuing my Dual Masters in Computer and Information Science and Computer Graphics and Game Technology at University of Pennsylvania. I am currently looking for a summer internship as a Software Developer. \n \nMy key interests are in the area of Distributed Systems, Computer Graphics and Computer Networks. Experience Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Santa Clara GPU Compiler Team Graduate Teaching Assistant University of Pennsylvania August 2014  – Present (1 year 1 month) Philadelphia CIS 551: Computer and Network Security Software Developer Philadelphia Game Lab June 2014  –  August 2014  (3 months) Greater Philadelphia Area Developed generic server side system for MMORPG Systems Engineer Siemens Technology India July 2012  –  June 2013  (1 year) Bangalore, India Developed and tested firmware for all industrial automation devices manufactured by SIEMENS such as Human Machine Interface (HMI) panels and Programmable Logic Controllers (PLC) using C and C++. Research Assistant Defence Research and Development Organisation January 2012  –  April 2012  (4 months) Bangalore, India Developing next generation Graphical User Interfaces (GUI) for Unmanned Aerial Vehicles (UAV) with real time positional capabilities and video streaming. Project Trainee Wipro Technologies July 2011  –  August 2011  (2 months) Bangalore, India Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Santa Clara GPU Compiler Team Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Santa Clara GPU Compiler Team Graduate Teaching Assistant University of Pennsylvania August 2014  – Present (1 year 1 month) Philadelphia CIS 551: Computer and Network Security Graduate Teaching Assistant University of Pennsylvania August 2014  – Present (1 year 1 month) Philadelphia CIS 551: Computer and Network Security Software Developer Philadelphia Game Lab June 2014  –  August 2014  (3 months) Greater Philadelphia Area Developed generic server side system for MMORPG Software Developer Philadelphia Game Lab June 2014  –  August 2014  (3 months) Greater Philadelphia Area Developed generic server side system for MMORPG Systems Engineer Siemens Technology India July 2012  –  June 2013  (1 year) Bangalore, India Developed and tested firmware for all industrial automation devices manufactured by SIEMENS such as Human Machine Interface (HMI) panels and Programmable Logic Controllers (PLC) using C and C++. Systems Engineer Siemens Technology India July 2012  –  June 2013  (1 year) Bangalore, India Developed and tested firmware for all industrial automation devices manufactured by SIEMENS such as Human Machine Interface (HMI) panels and Programmable Logic Controllers (PLC) using C and C++. Research Assistant Defence Research and Development Organisation January 2012  –  April 2012  (4 months) Bangalore, India Developing next generation Graphical User Interfaces (GUI) for Unmanned Aerial Vehicles (UAV) with real time positional capabilities and video streaming. Research Assistant Defence Research and Development Organisation January 2012  –  April 2012  (4 months) Bangalore, India Developing next generation Graphical User Interfaces (GUI) for Unmanned Aerial Vehicles (UAV) with real time positional capabilities and video streaming. Project Trainee Wipro Technologies July 2011  –  August 2011  (2 months) Bangalore, India Project Trainee Wipro Technologies July 2011  –  August 2011  (2 months) Bangalore, India Languages Hindi Native or bilingual proficiency Tamil Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills C++ C Java C# Matlab HTML SQL JavaScript Photoshop Microsoft Office Microsoft Excel Programming Linux PowerPoint Microsoft SQL Server Core Java Python Microsoft Word MySQL Eclipse Windows Distributed Systems Algorithms LaTeX Ruby Ruby on Rails See 11+     See less Skills  C++ C Java C# Matlab HTML SQL JavaScript Photoshop Microsoft Office Microsoft Excel Programming Linux PowerPoint Microsoft SQL Server Core Java Python Microsoft Word MySQL Eclipse Windows Distributed Systems Algorithms LaTeX Ruby Ruby on Rails See 11+     See less C++ C Java C# Matlab HTML SQL JavaScript Photoshop Microsoft Office Microsoft Excel Programming Linux PowerPoint Microsoft SQL Server Core Java Python Microsoft Word MySQL Eclipse Windows Distributed Systems Algorithms LaTeX Ruby Ruby on Rails See 11+     See less C++ C Java C# Matlab HTML SQL JavaScript Photoshop Microsoft Office Microsoft Excel Programming Linux PowerPoint Microsoft SQL Server Core Java Python Microsoft Word MySQL Eclipse Windows Distributed Systems Algorithms LaTeX Ruby Ruby on Rails See 11+     See less Education University of Pennsylvania Master of Science in Engineering,  Computer Graphics and Game Technology 2013  – 2015 Activities and Societies:  Graduate and Professional Student Assembly (GAPSA) University of Pennsylvania Master of Science in Engineering,  Computer Science 2013  – 2015 Activities and Societies:  TEDxPenn Technology B M S Institute of Technology Bachelor of Engineering (B.E.),  Computer Science 2008  – 2012 Bishop Cotton Boys' School 2003  – 2008 University of Pennsylvania Master of Science in Engineering,  Computer Graphics and Game Technology 2013  – 2015 Activities and Societies:  Graduate and Professional Student Assembly (GAPSA) University of Pennsylvania Master of Science in Engineering,  Computer Graphics and Game Technology 2013  – 2015 Activities and Societies:  Graduate and Professional Student Assembly (GAPSA) University of Pennsylvania Master of Science in Engineering,  Computer Graphics and Game Technology 2013  – 2015 Activities and Societies:  Graduate and Professional Student Assembly (GAPSA) University of Pennsylvania Master of Science in Engineering,  Computer Science 2013  – 2015 Activities and Societies:  TEDxPenn Technology University of Pennsylvania Master of Science in Engineering,  Computer Science 2013  – 2015 Activities and Societies:  TEDxPenn Technology University of Pennsylvania Master of Science in Engineering,  Computer Science 2013  – 2015 Activities and Societies:  TEDxPenn Technology B M S Institute of Technology Bachelor of Engineering (B.E.),  Computer Science 2008  – 2012 B M S Institute of Technology Bachelor of Engineering (B.E.),  Computer Science 2008  – 2012 B M S Institute of Technology Bachelor of Engineering (B.E.),  Computer Science 2008  – 2012 Bishop Cotton Boys' School 2003  – 2008 Bishop Cotton Boys' School 2003  – 2008 Bishop Cotton Boys' School 2003  – 2008 Honors & Awards ", "Summary A Master's student in Electrical and Computer Engineering at Georgia Institute Of Technology looking for a full-time role in the field of Computer Networks and Operating Systems.  Summary A Master's student in Electrical and Computer Engineering at Georgia Institute Of Technology looking for a full-time role in the field of Computer Networks and Operating Systems.  A Master's student in Electrical and Computer Engineering at Georgia Institute Of Technology looking for a full-time role in the field of Computer Networks and Operating Systems.  A Master's student in Electrical and Computer Engineering at Georgia Institute Of Technology looking for a full-time role in the field of Computer Networks and Operating Systems.  Experience Network Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Research Intern ERNET India, Department of Electronics & IT (DeitY), MC&IT, Govt. of India February 2014  –  June 2014  (5 months) Bangalore -Carried out the final year undergraduate project. \n-Worked on ContikiOS, an operating system for resource constrained devices to implement Internet of Things(IoT)  \n-Simulated wireless networks in the Cooja simulator provided with Contiki.  \n-Implemented the Constrained Application Protocol(CoAP) as the application layer protocol.  \n-Utilized the Copper plug-in(Cu) in Mozilla Firefox to monitor the soil parameters in real time. \n-Implemented the RPL protocol and the uIPv6 stack. Intern YourStory.in June 2012  –  July 2012  (2 months) Bangalore Did exhaustive research in the start-up ecosystem in the field of electronics and submitted a report on the trends. Organised Bangalore's first Tech-Intern mixer. Campus Ambassador Teach For India 2011  –  2012  (1 year) Network Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Network Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Research Intern ERNET India, Department of Electronics & IT (DeitY), MC&IT, Govt. of India February 2014  –  June 2014  (5 months) Bangalore -Carried out the final year undergraduate project. \n-Worked on ContikiOS, an operating system for resource constrained devices to implement Internet of Things(IoT)  \n-Simulated wireless networks in the Cooja simulator provided with Contiki.  \n-Implemented the Constrained Application Protocol(CoAP) as the application layer protocol.  \n-Utilized the Copper plug-in(Cu) in Mozilla Firefox to monitor the soil parameters in real time. \n-Implemented the RPL protocol and the uIPv6 stack. Research Intern ERNET India, Department of Electronics & IT (DeitY), MC&IT, Govt. of India February 2014  –  June 2014  (5 months) Bangalore -Carried out the final year undergraduate project. \n-Worked on ContikiOS, an operating system for resource constrained devices to implement Internet of Things(IoT)  \n-Simulated wireless networks in the Cooja simulator provided with Contiki.  \n-Implemented the Constrained Application Protocol(CoAP) as the application layer protocol.  \n-Utilized the Copper plug-in(Cu) in Mozilla Firefox to monitor the soil parameters in real time. \n-Implemented the RPL protocol and the uIPv6 stack. Intern YourStory.in June 2012  –  July 2012  (2 months) Bangalore Did exhaustive research in the start-up ecosystem in the field of electronics and submitted a report on the trends. Organised Bangalore's first Tech-Intern mixer. Intern YourStory.in June 2012  –  July 2012  (2 months) Bangalore Did exhaustive research in the start-up ecosystem in the field of electronics and submitted a report on the trends. Organised Bangalore's first Tech-Intern mixer. Campus Ambassador Teach For India 2011  –  2012  (1 year) Campus Ambassador Teach For India 2011  –  2012  (1 year) Languages   Skills C C++ VHDL VLSI CAD Verilog Matlab Cooja Skills  C C++ VHDL VLSI CAD Verilog Matlab Cooja C C++ VHDL VLSI CAD Verilog Matlab Cooja C C++ VHDL VLSI CAD Verilog Matlab Cooja Education Georgia Institute of Technology Master of Science (M.S.),  Electrical and Computer Engineering (4.0/4.0) 2014  – 2016 M.S. Ramaiah Institute Of Technology B.E,  Telecommunication Engineering 2010  – 2014 Activities and Societies:  The Literary And Debating Society ,  NSS ,  IEEE MSRIT Chapter Mount Carmel College Pre-University,  PCME 2008  – 2010 Activities and Societies:  Public Speaking Association Georgia Institute of Technology Master of Science (M.S.),  Electrical and Computer Engineering (4.0/4.0) 2014  – 2016 Georgia Institute of Technology Master of Science (M.S.),  Electrical and Computer Engineering (4.0/4.0) 2014  – 2016 Georgia Institute of Technology Master of Science (M.S.),  Electrical and Computer Engineering (4.0/4.0) 2014  – 2016 M.S. Ramaiah Institute Of Technology B.E,  Telecommunication Engineering 2010  – 2014 Activities and Societies:  The Literary And Debating Society ,  NSS ,  IEEE MSRIT Chapter M.S. Ramaiah Institute Of Technology B.E,  Telecommunication Engineering 2010  – 2014 Activities and Societies:  The Literary And Debating Society ,  NSS ,  IEEE MSRIT Chapter M.S. Ramaiah Institute Of Technology B.E,  Telecommunication Engineering 2010  – 2014 Activities and Societies:  The Literary And Debating Society ,  NSS ,  IEEE MSRIT Chapter Mount Carmel College Pre-University,  PCME 2008  – 2010 Activities and Societies:  Public Speaking Association Mount Carmel College Pre-University,  PCME 2008  – 2010 Activities and Societies:  Public Speaking Association Mount Carmel College Pre-University,  PCME 2008  – 2010 Activities and Societies:  Public Speaking Association Honors & Awards Best Outgoing Student Award Department of Telecommunications Engineering, M.S.Ramaiah Institute Of Technology May 2014 Certificate of Achievement in Physics May 2010 Scored 100% in Physics in the Pre-University Board Examination(Class XII) Best Outgoing Student Award Department of Telecommunications Engineering, M.S.Ramaiah Institute Of Technology May 2014 Best Outgoing Student Award Department of Telecommunications Engineering, M.S.Ramaiah Institute Of Technology May 2014 Best Outgoing Student Award Department of Telecommunications Engineering, M.S.Ramaiah Institute Of Technology May 2014 Certificate of Achievement in Physics May 2010 Scored 100% in Physics in the Pre-University Board Examination(Class XII) Certificate of Achievement in Physics May 2010 Scored 100% in Physics in the Pre-University Board Examination(Class XII) Certificate of Achievement in Physics May 2010 Scored 100% in Physics in the Pre-University Board Examination(Class XII) ", "Summary Coding Experience: C/C++, MATLAB, Python, Assembly Language, QUCS, Ngspice, LAMMPS Molecular Simulation Package \nRendering experience: POV RAY, PBRT , Autodesk MAYA, Autodesk 3DS Max. \nCAD: CATIA v5 \nProficient with LaTEX and Microsoft Office \nDesign experience: Adobe Fireworks, Adobe Illustrator, Adobe Photoshop. \nVideo Editing: Adobe Premiere Pro, iMovie. Summary Coding Experience: C/C++, MATLAB, Python, Assembly Language, QUCS, Ngspice, LAMMPS Molecular Simulation Package \nRendering experience: POV RAY, PBRT , Autodesk MAYA, Autodesk 3DS Max. \nCAD: CATIA v5 \nProficient with LaTEX and Microsoft Office \nDesign experience: Adobe Fireworks, Adobe Illustrator, Adobe Photoshop. \nVideo Editing: Adobe Premiere Pro, iMovie. Coding Experience: C/C++, MATLAB, Python, Assembly Language, QUCS, Ngspice, LAMMPS Molecular Simulation Package \nRendering experience: POV RAY, PBRT , Autodesk MAYA, Autodesk 3DS Max. \nCAD: CATIA v5 \nProficient with LaTEX and Microsoft Office \nDesign experience: Adobe Fireworks, Adobe Illustrator, Adobe Photoshop. \nVideo Editing: Adobe Premiere Pro, iMovie. Coding Experience: C/C++, MATLAB, Python, Assembly Language, QUCS, Ngspice, LAMMPS Molecular Simulation Package \nRendering experience: POV RAY, PBRT , Autodesk MAYA, Autodesk 3DS Max. \nCAD: CATIA v5 \nProficient with LaTEX and Microsoft Office \nDesign experience: Adobe Fireworks, Adobe Illustrator, Adobe Photoshop. \nVideo Editing: Adobe Premiere Pro, iMovie. Experience Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area work to contribute towards graduate thesis Graduate Student, Materials Science and Engineering Cornell University August 2014  – Present (1 year 1 month) Ithaca, New York Area Thesis on study of Si-dopant activation in InGaAs using Laser Surface Annealing (Experimental and Computational) \n \n• Multiscale Modeling of Si-Dopant Activation/Deactivation and Diffusional Control in InGaAs (Work supported by Semiconductor Research Corporation (SRC) and IBM)  \n• Experimental: Fabricated InGaAs thermistors and micro-Van Der Pauw devices with full lithography access, performed Raman analysis and CAPRES electrical analysis on LSA InGaAs \n• Active trained user of Cornell Nanoscale Science and Technology Facility (clean rooms) and Cornell Center for Materials Research \n• Computational work involves contribution to the Laser Simulation package and Molecular Dynamics Simulations - http://clasp.engr.cornell.edu/CLASP/Home.html (Cornell Laser Simulation Annealing Package) & http://lammps.sandia.gov/ (LAMMPS) Deputy Manager Tata Sons Limited June 2013  – Present (2 years 3 months) Mumbai Area, India Summer Research Intern, Department of Materials Science and Engieering, Fitzgerald Group Massachusetts Institute of Technology (MIT) May 2012  –  September 2012  (5 months) Cambridge, Massachusetts under Prof. Eugene Fitzgerald \n• Studied epitaxial growth of latticed mismatched III-V semiconductor compounds using MOCVD for blue and green emission LEDs \n• Performed mathematical modeling of dual and triple junction solar cells using MATLAB and QUCS circuit simulator, studied bandgap models of binary, ternary and quaternary semiconductor compounds \n• Studied binary and ternary III-V semiconductor compounds which included GaAs, InP, InGaP, InGaAs, Ge, Si Winter Internship, Media Labs, Camera Culture Group Massachusetts Institute of Technology (MIT) December 2011  –  February 2012  (3 months) Cambridge, MA under Prof. Ramesh Raskar \n• Improved MATLAB control environment to centrally control mirrors, streak camera and galvanometer further simplifying the experimental procedure in Femto-second imaging project, contributed to the image reconstruction algorithm \n• Femto - Second Imaging: Stereo Algorithms to create 3D-Depth Maps, performed renderings using PBRT \n• Setup the rendering pipeline for reconstruction of data sets captured from streak camera. \n• Technology in Cricket : Studied effect of Silicone and other similar thermally insulating materials in blocking heat signatures given off in the game of cricket. Project Selected for MIT Technology Review innovations of the year for 2012. \n• Work published in SIGGRAPH 2012 and ACM GRAPHICS 2013 Summer Intern, Camera Culture Group, Media Labs Massachusetts Institute of Technology (MIT) May 2011  –  September 2011  (5 months) Cambridge, MA under Prof. Ramesh Raskar \n•\tFemto-Second Imaging: Python and MATLAB scripts for reconstruction algorithms and data capture by streak camera. Also included Molecular Modelling tool, UCSF Chimera for reconstruction algorithm. Summer Intern Center for Materials for Electronics Technology (CMET) May 2010  –  November 2010  (7 months) Pune Area, India •Conducted synthesis of CdS and CdSe quantum dots in polymer matrices: studied quantum confinement effect, nano-crystalline phase identification and particle size distribution using UV-Visible spectroscopy, XRD and FESEM Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area work to contribute towards graduate thesis Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area work to contribute towards graduate thesis Graduate Student, Materials Science and Engineering Cornell University August 2014  – Present (1 year 1 month) Ithaca, New York Area Thesis on study of Si-dopant activation in InGaAs using Laser Surface Annealing (Experimental and Computational) \n \n• Multiscale Modeling of Si-Dopant Activation/Deactivation and Diffusional Control in InGaAs (Work supported by Semiconductor Research Corporation (SRC) and IBM)  \n• Experimental: Fabricated InGaAs thermistors and micro-Van Der Pauw devices with full lithography access, performed Raman analysis and CAPRES electrical analysis on LSA InGaAs \n• Active trained user of Cornell Nanoscale Science and Technology Facility (clean rooms) and Cornell Center for Materials Research \n• Computational work involves contribution to the Laser Simulation package and Molecular Dynamics Simulations - http://clasp.engr.cornell.edu/CLASP/Home.html (Cornell Laser Simulation Annealing Package) & http://lammps.sandia.gov/ (LAMMPS) Graduate Student, Materials Science and Engineering Cornell University August 2014  – Present (1 year 1 month) Ithaca, New York Area Thesis on study of Si-dopant activation in InGaAs using Laser Surface Annealing (Experimental and Computational) \n \n• Multiscale Modeling of Si-Dopant Activation/Deactivation and Diffusional Control in InGaAs (Work supported by Semiconductor Research Corporation (SRC) and IBM)  \n• Experimental: Fabricated InGaAs thermistors and micro-Van Der Pauw devices with full lithography access, performed Raman analysis and CAPRES electrical analysis on LSA InGaAs \n• Active trained user of Cornell Nanoscale Science and Technology Facility (clean rooms) and Cornell Center for Materials Research \n• Computational work involves contribution to the Laser Simulation package and Molecular Dynamics Simulations - http://clasp.engr.cornell.edu/CLASP/Home.html (Cornell Laser Simulation Annealing Package) & http://lammps.sandia.gov/ (LAMMPS) Deputy Manager Tata Sons Limited June 2013  – Present (2 years 3 months) Mumbai Area, India Deputy Manager Tata Sons Limited June 2013  – Present (2 years 3 months) Mumbai Area, India Summer Research Intern, Department of Materials Science and Engieering, Fitzgerald Group Massachusetts Institute of Technology (MIT) May 2012  –  September 2012  (5 months) Cambridge, Massachusetts under Prof. Eugene Fitzgerald \n• Studied epitaxial growth of latticed mismatched III-V semiconductor compounds using MOCVD for blue and green emission LEDs \n• Performed mathematical modeling of dual and triple junction solar cells using MATLAB and QUCS circuit simulator, studied bandgap models of binary, ternary and quaternary semiconductor compounds \n• Studied binary and ternary III-V semiconductor compounds which included GaAs, InP, InGaP, InGaAs, Ge, Si Summer Research Intern, Department of Materials Science and Engieering, Fitzgerald Group Massachusetts Institute of Technology (MIT) May 2012  –  September 2012  (5 months) Cambridge, Massachusetts under Prof. Eugene Fitzgerald \n• Studied epitaxial growth of latticed mismatched III-V semiconductor compounds using MOCVD for blue and green emission LEDs \n• Performed mathematical modeling of dual and triple junction solar cells using MATLAB and QUCS circuit simulator, studied bandgap models of binary, ternary and quaternary semiconductor compounds \n• Studied binary and ternary III-V semiconductor compounds which included GaAs, InP, InGaP, InGaAs, Ge, Si Winter Internship, Media Labs, Camera Culture Group Massachusetts Institute of Technology (MIT) December 2011  –  February 2012  (3 months) Cambridge, MA under Prof. Ramesh Raskar \n• Improved MATLAB control environment to centrally control mirrors, streak camera and galvanometer further simplifying the experimental procedure in Femto-second imaging project, contributed to the image reconstruction algorithm \n• Femto - Second Imaging: Stereo Algorithms to create 3D-Depth Maps, performed renderings using PBRT \n• Setup the rendering pipeline for reconstruction of data sets captured from streak camera. \n• Technology in Cricket : Studied effect of Silicone and other similar thermally insulating materials in blocking heat signatures given off in the game of cricket. Project Selected for MIT Technology Review innovations of the year for 2012. \n• Work published in SIGGRAPH 2012 and ACM GRAPHICS 2013 Winter Internship, Media Labs, Camera Culture Group Massachusetts Institute of Technology (MIT) December 2011  –  February 2012  (3 months) Cambridge, MA under Prof. Ramesh Raskar \n• Improved MATLAB control environment to centrally control mirrors, streak camera and galvanometer further simplifying the experimental procedure in Femto-second imaging project, contributed to the image reconstruction algorithm \n• Femto - Second Imaging: Stereo Algorithms to create 3D-Depth Maps, performed renderings using PBRT \n• Setup the rendering pipeline for reconstruction of data sets captured from streak camera. \n• Technology in Cricket : Studied effect of Silicone and other similar thermally insulating materials in blocking heat signatures given off in the game of cricket. Project Selected for MIT Technology Review innovations of the year for 2012. \n• Work published in SIGGRAPH 2012 and ACM GRAPHICS 2013 Summer Intern, Camera Culture Group, Media Labs Massachusetts Institute of Technology (MIT) May 2011  –  September 2011  (5 months) Cambridge, MA under Prof. Ramesh Raskar \n•\tFemto-Second Imaging: Python and MATLAB scripts for reconstruction algorithms and data capture by streak camera. Also included Molecular Modelling tool, UCSF Chimera for reconstruction algorithm. Summer Intern, Camera Culture Group, Media Labs Massachusetts Institute of Technology (MIT) May 2011  –  September 2011  (5 months) Cambridge, MA under Prof. Ramesh Raskar \n•\tFemto-Second Imaging: Python and MATLAB scripts for reconstruction algorithms and data capture by streak camera. Also included Molecular Modelling tool, UCSF Chimera for reconstruction algorithm. Summer Intern Center for Materials for Electronics Technology (CMET) May 2010  –  November 2010  (7 months) Pune Area, India •Conducted synthesis of CdS and CdSe quantum dots in polymer matrices: studied quantum confinement effect, nano-crystalline phase identification and particle size distribution using UV-Visible spectroscopy, XRD and FESEM Summer Intern Center for Materials for Electronics Technology (CMET) May 2010  –  November 2010  (7 months) Pune Area, India •Conducted synthesis of CdS and CdSe quantum dots in polymer matrices: studied quantum confinement effect, nano-crystalline phase identification and particle size distribution using UV-Visible spectroscopy, XRD and FESEM Languages   Skills Matlab LaTeX C++ Computer Vision Python Algorithms Heat Treatment Ceramic Materials Mathematical Modeling Nanotechnology Metallurgy Materials Nanomaterials Skills  Matlab LaTeX C++ Computer Vision Python Algorithms Heat Treatment Ceramic Materials Mathematical Modeling Nanotechnology Metallurgy Materials Nanomaterials Matlab LaTeX C++ Computer Vision Python Algorithms Heat Treatment Ceramic Materials Mathematical Modeling Nanotechnology Metallurgy Materials Nanomaterials Matlab LaTeX C++ Computer Vision Python Algorithms Heat Treatment Ceramic Materials Mathematical Modeling Nanotechnology Metallurgy Materials Nanomaterials Education Cornell University Materials Science and Engineering 2014  – 2016 Massachusetts Institute of Technology Bachelor's Degree,  Materials Science and Engineering 2010  – 2013 Visiting/Transfer student College of Engineering Pune Bachelor of Technology (B.Tech.),  Metallurgy and Material Science 2009  – 2013 Undergraduate Thesis: \nRecovery of Metallic Iron Powder from Mill Scale : for Powder Metallurgical Applications \n \nRelevant Courses: \n•\tElectronic & Magnetic Materials \n•\tBasic Electronics Principles \n•\tMaterial Characterization \n•\tNanotechnology & Nanomaterials \n•\tDesign and Selection of Materials \n•\tMetallurgical Thermodynamics \n•\tTransport Phenomena \n•\tDesign and Selection of Materials \n•\tCeramic Engineering \n•\tPolymers & Composites \n•\tCorrosion & Surface Protection \n•\tFailure and Fractures \n•\tMaterials Joining \n•\tPrinciples of Metal Working \n•\tStructural Properties of Materials \n•\tEngineering Mathematics I, II, III, IV \n•\tPhysics I & II (Applied Sciences) \n•\tChemistry (Applied Sciences) \n•\tIntroduction to Computer Programming \n•\tIntroduction to Robotics \n•\tBasic Electrical Technology Activities and Societies:  SAE Baja All-terrain vehicle design team Modern College of Science Junior College,  Higher Secondary Certificate , Physics, Chemistry, Maths,  Electronics 2007  – 2009 Bharatiya Vidya Bhavan Primary,High and Secondary School,  Secondary School Certificate 1997  – 2007 Cornell University Materials Science and Engineering 2014  – 2016 Cornell University Materials Science and Engineering 2014  – 2016 Cornell University Materials Science and Engineering 2014  – 2016 Massachusetts Institute of Technology Bachelor's Degree,  Materials Science and Engineering 2010  – 2013 Visiting/Transfer student Massachusetts Institute of Technology Bachelor's Degree,  Materials Science and Engineering 2010  – 2013 Visiting/Transfer student Massachusetts Institute of Technology Bachelor's Degree,  Materials Science and Engineering 2010  – 2013 Visiting/Transfer student College of Engineering Pune Bachelor of Technology (B.Tech.),  Metallurgy and Material Science 2009  – 2013 Undergraduate Thesis: \nRecovery of Metallic Iron Powder from Mill Scale : for Powder Metallurgical Applications \n \nRelevant Courses: \n•\tElectronic & Magnetic Materials \n•\tBasic Electronics Principles \n•\tMaterial Characterization \n•\tNanotechnology & Nanomaterials \n•\tDesign and Selection of Materials \n•\tMetallurgical Thermodynamics \n•\tTransport Phenomena \n•\tDesign and Selection of Materials \n•\tCeramic Engineering \n•\tPolymers & Composites \n•\tCorrosion & Surface Protection \n•\tFailure and Fractures \n•\tMaterials Joining \n•\tPrinciples of Metal Working \n•\tStructural Properties of Materials \n•\tEngineering Mathematics I, II, III, IV \n•\tPhysics I & II (Applied Sciences) \n•\tChemistry (Applied Sciences) \n•\tIntroduction to Computer Programming \n•\tIntroduction to Robotics \n•\tBasic Electrical Technology Activities and Societies:  SAE Baja All-terrain vehicle design team College of Engineering Pune Bachelor of Technology (B.Tech.),  Metallurgy and Material Science 2009  – 2013 Undergraduate Thesis: \nRecovery of Metallic Iron Powder from Mill Scale : for Powder Metallurgical Applications \n \nRelevant Courses: \n•\tElectronic & Magnetic Materials \n•\tBasic Electronics Principles \n•\tMaterial Characterization \n•\tNanotechnology & Nanomaterials \n•\tDesign and Selection of Materials \n•\tMetallurgical Thermodynamics \n•\tTransport Phenomena \n•\tDesign and Selection of Materials \n•\tCeramic Engineering \n•\tPolymers & Composites \n•\tCorrosion & Surface Protection \n•\tFailure and Fractures \n•\tMaterials Joining \n•\tPrinciples of Metal Working \n•\tStructural Properties of Materials \n•\tEngineering Mathematics I, II, III, IV \n•\tPhysics I & II (Applied Sciences) \n•\tChemistry (Applied Sciences) \n•\tIntroduction to Computer Programming \n•\tIntroduction to Robotics \n•\tBasic Electrical Technology Activities and Societies:  SAE Baja All-terrain vehicle design team College of Engineering Pune Bachelor of Technology (B.Tech.),  Metallurgy and Material Science 2009  – 2013 Undergraduate Thesis: \nRecovery of Metallic Iron Powder from Mill Scale : for Powder Metallurgical Applications \n \nRelevant Courses: \n•\tElectronic & Magnetic Materials \n•\tBasic Electronics Principles \n•\tMaterial Characterization \n•\tNanotechnology & Nanomaterials \n•\tDesign and Selection of Materials \n•\tMetallurgical Thermodynamics \n•\tTransport Phenomena \n•\tDesign and Selection of Materials \n•\tCeramic Engineering \n•\tPolymers & Composites \n•\tCorrosion & Surface Protection \n•\tFailure and Fractures \n•\tMaterials Joining \n•\tPrinciples of Metal Working \n•\tStructural Properties of Materials \n•\tEngineering Mathematics I, II, III, IV \n•\tPhysics I & II (Applied Sciences) \n•\tChemistry (Applied Sciences) \n•\tIntroduction to Computer Programming \n•\tIntroduction to Robotics \n•\tBasic Electrical Technology Activities and Societies:  SAE Baja All-terrain vehicle design team Modern College of Science Junior College,  Higher Secondary Certificate , Physics, Chemistry, Maths,  Electronics 2007  – 2009 Modern College of Science Junior College,  Higher Secondary Certificate , Physics, Chemistry, Maths,  Electronics 2007  – 2009 Modern College of Science Junior College,  Higher Secondary Certificate , Physics, Chemistry, Maths,  Electronics 2007  – 2009 Bharatiya Vidya Bhavan Primary,High and Secondary School,  Secondary School Certificate 1997  – 2007 Bharatiya Vidya Bhavan Primary,High and Secondary School,  Secondary School Certificate 1997  – 2007 Bharatiya Vidya Bhavan Primary,High and Secondary School,  Secondary School Certificate 1997  – 2007 Honors & Awards National Talent Search Examination (NTSE) Scholarship Government of India June 2007 June 2007 - Present J. N. Tata Scholar J. N. Tata Endowment Fund August 2014 K. C. Mahindra Scholar K. C. Mahindra Education Trust August 2014 Navajbai Ratan Tata Trust (NRTT) Scholarship Navajbai Ratan Tata Trust August 2014 R.D.Sethna Scholarship for overseas graduate studies R. D. Sethna Scholarship Fund August 2014 National Talent Search Examination (NTSE) Scholarship Government of India June 2007 June 2007 - Present National Talent Search Examination (NTSE) Scholarship Government of India June 2007 June 2007 - Present National Talent Search Examination (NTSE) Scholarship Government of India June 2007 June 2007 - Present J. N. Tata Scholar J. N. Tata Endowment Fund August 2014 J. N. Tata Scholar J. N. Tata Endowment Fund August 2014 J. N. Tata Scholar J. N. Tata Endowment Fund August 2014 K. C. Mahindra Scholar K. C. Mahindra Education Trust August 2014 K. C. Mahindra Scholar K. C. Mahindra Education Trust August 2014 K. C. Mahindra Scholar K. C. Mahindra Education Trust August 2014 Navajbai Ratan Tata Trust (NRTT) Scholarship Navajbai Ratan Tata Trust August 2014 Navajbai Ratan Tata Trust (NRTT) Scholarship Navajbai Ratan Tata Trust August 2014 Navajbai Ratan Tata Trust (NRTT) Scholarship Navajbai Ratan Tata Trust August 2014 R.D.Sethna Scholarship for overseas graduate studies R. D. Sethna Scholarship Fund August 2014 R.D.Sethna Scholarship for overseas graduate studies R. D. Sethna Scholarship Fund August 2014 R.D.Sethna Scholarship for overseas graduate studies R. D. Sethna Scholarship Fund August 2014 ", "Experience Operations Analyst E*TRADE Financial Software Engineer Intern Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Mortgage Loan Processor Wells Fargo October 2008  –  January 2015  (6 years 4 months) Operations Analyst E*TRADE Financial Operations Analyst E*TRADE Financial Software Engineer Intern Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Software Engineer Intern Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Mortgage Loan Processor Wells Fargo October 2008  –  January 2015  (6 years 4 months) Mortgage Loan Processor Wells Fargo October 2008  –  January 2015  (6 years 4 months) Skills Back Office Financial Services Equities Securities Risk Management Banking Business Analysis Customer Service Finance Financial Analysis Skills  Back Office Financial Services Equities Securities Risk Management Banking Business Analysis Customer Service Finance Financial Analysis Back Office Financial Services Equities Securities Risk Management Banking Business Analysis Customer Service Finance Financial Analysis Back Office Financial Services Equities Securities Risk Management Banking Business Analysis Customer Service Finance Financial Analysis Education Northern Virginia Community College 2006  – 2008 Northern Virginia Community College 2006  – 2008 Northern Virginia Community College 2006  – 2008 Northern Virginia Community College 2006  – 2008 ", "Experience Cloud Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Student Arizona State University August 2014  – Present (1 year 1 month) Graduate Courses :  \nEmbedded Operating System Internals \nSoftware Design  \nDistributed Software Development  \nSemantic Web Mining  Test & Build Automation Engineer Intel Corporation December 2010  –  July 2014  (3 years 8 months) Bengaluru Area, India Developed a new automation framework and refactored existing test framework to automate various graphics technologies. (HDMI, DP, VGI, etc)  \n \nAutomate tests for the Graphics Display Driver using Ranorex, C#, Microsoft Inspect.  \nTools : Visual Studio, QC,  \nHave experience in working in Agile process \n \nBuild : Quickbuild,  \nSCM : Perforce \nPython, Perl, Powershell System Engineer IBM India September 2007  –  November 2010  (3 years 3 months) Bengaluru Area, India Java/J2EE developer, mainly developed workflow for AT&T application.  \n \nTools : Inconcert, Eclipse  \nOOP, Java, Servlets, JSP, Struts, Python Cloud Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Cloud Software Engineer Intern Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Student Arizona State University August 2014  – Present (1 year 1 month) Graduate Courses :  \nEmbedded Operating System Internals \nSoftware Design  \nDistributed Software Development  \nSemantic Web Mining  Student Arizona State University August 2014  – Present (1 year 1 month) Graduate Courses :  \nEmbedded Operating System Internals \nSoftware Design  \nDistributed Software Development  \nSemantic Web Mining  Test & Build Automation Engineer Intel Corporation December 2010  –  July 2014  (3 years 8 months) Bengaluru Area, India Developed a new automation framework and refactored existing test framework to automate various graphics technologies. (HDMI, DP, VGI, etc)  \n \nAutomate tests for the Graphics Display Driver using Ranorex, C#, Microsoft Inspect.  \nTools : Visual Studio, QC,  \nHave experience in working in Agile process \n \nBuild : Quickbuild,  \nSCM : Perforce \nPython, Perl, Powershell Test & Build Automation Engineer Intel Corporation December 2010  –  July 2014  (3 years 8 months) Bengaluru Area, India Developed a new automation framework and refactored existing test framework to automate various graphics technologies. (HDMI, DP, VGI, etc)  \n \nAutomate tests for the Graphics Display Driver using Ranorex, C#, Microsoft Inspect.  \nTools : Visual Studio, QC,  \nHave experience in working in Agile process \n \nBuild : Quickbuild,  \nSCM : Perforce \nPython, Perl, Powershell System Engineer IBM India September 2007  –  November 2010  (3 years 3 months) Bengaluru Area, India Java/J2EE developer, mainly developed workflow for AT&T application.  \n \nTools : Inconcert, Eclipse  \nOOP, Java, Servlets, JSP, Struts, Python System Engineer IBM India September 2007  –  November 2010  (3 years 3 months) Bengaluru Area, India Java/J2EE developer, mainly developed workflow for AT&T application.  \n \nTools : Inconcert, Eclipse  \nOOP, Java, Servlets, JSP, Struts, Python Skills Python Eclipse Agile Methodologies Visual Studio Test Automation Continuous Integration Perforce Perl C# Automation JSP Linux Skills  Python Eclipse Agile Methodologies Visual Studio Test Automation Continuous Integration Perforce Perl C# Automation JSP Linux Python Eclipse Agile Methodologies Visual Studio Test Automation Continuous Integration Perforce Perl C# Automation JSP Linux Python Eclipse Agile Methodologies Visual Studio Test Automation Continuous Integration Perforce Perl C# Automation JSP Linux Education Arizona State University Master’s Degree,  Computer Science , 3.5 2014  – 2015 B. M. S. College of Engineering Bachelor’s Degree,  Computer Science 2003  – 2007 Arizona State University Master’s Degree,  Computer Science , 3.5 2014  – 2015 Arizona State University Master’s Degree,  Computer Science , 3.5 2014  – 2015 Arizona State University Master’s Degree,  Computer Science , 3.5 2014  – 2015 B. M. S. College of Engineering Bachelor’s Degree,  Computer Science 2003  – 2007 B. M. S. College of Engineering Bachelor’s Degree,  Computer Science 2003  – 2007 B. M. S. College of Engineering Bachelor’s Degree,  Computer Science 2003  – 2007 ", "Summary I love startups. Super passionate about building world-class teams and products. Summary I love startups. Super passionate about building world-class teams and products. I love startups. Super passionate about building world-class teams and products. I love startups. Super passionate about building world-class teams and products. Experience CEO Mustbin August 2014  – Present (1 year 1 month) Boston, MA 1000% focused on building the best team, company, and products on the planet. Mustbin was announced as a finalist in the September 2014 and 2015 MassTLC awards for \"Innovative Technology of the Year: Mobile App.\" CTO Mustbin December 2013  –  August 2014  (9 months) Boston, MA Responsible for product and technology development. Recruited and hired engineers, designers, and marketers. Pitched and presented at a number of events and award competitions. In May, Mustbin was honored with the prestigious MITX award for \"Most Innovative Mobile App\" of 2014. in August, we were nominated as one of Boston's Coolest Companies. Vice President, Engineering Mustbin January 2013  –  December 2013  (1 year) Boston, MA First founding team member. Recruited some of Boston's best talent and promoted strong team culture. Established an agile product development process. Collaborated, wrote, and filed a patent protecting our core IP. Lead the team that built and launched the Mustbin iOS app. Mustbin received tremendous praise from TechCrunch on launch: \"The end result is an iPhone app where everything that matters to you is in one place.\" Scrum Master, Sr. Software Engineer Modo Labs, Inc. February 2012  –  January 2013  (1 year) Cambridge, MA Responsible for the Agile development process using Scrum. I managed the Kurogo platform iOS and Android releases and was lead developer on iOS apps for world-class education and enterprise clients and partners. Principal Mahajan Software Consulting August 2010  –  February 2012  (1 year 7 months) Cambridge, MA & San Francisco, CA Developed iOS and web applications for a number of clients. iOS Developer Independent January 2009  –  October 2011  (2 years 10 months) Cambridge, MA Launched three apps: a physics-based puzzle game for iPhone, iPod, and iPad called BeeBop, a “money burning” entertainment app for iPhone and iPad called Money2Burn, and a social networking app for iPhone called RoloRoulette. Over 50,000 people have downloaded my apps. Co-founder, CTO Motus Corporation January 2002  –  July 2010  (8 years 7 months) Cambridge, MA Co-founded the world’s first company dedicated to wireless motion capture using MEMS accelerometers, gyroscopes, and magnetometers. 1 issued patent. 6 patents pending. Nominated for the MIT Technology Review TR35 2008 (Top Innovators under 35) for a patent on utilizing metadata to enable language-based techniques for 3D gesture recognition. Managed an agile team consisting of software engineers, electrical engineers and designers working on the \"Darwin\" Wireless Motion Game Controller and market-leading iClub products. iClub was dubbed the “Future of Golf” by the PGA in 2005. Featured in: New York Times, Wall Street Journal, Boston Globe, Forbes, PBS, and numerous golf magazines. Won top product awards from Travel and Leisure, GolfDigest, Golf Magazine. iClub products were installed in top country clubs including: Pebble Beach, Augusta, St. Andrews, Pinehurst and many others. Co-founder Customachines June 1998  –  January 2000  (1 year 8 months) Sacramento, CA Co-founded a business that manufactures low-cost performance PCs for businesses and individuals. Software Engineer, Intern Intel Corporation June 1999  –  September 1999  (4 months) Folsom, CA Extended support software for the Pentium III team. Software Engineer, Intern Intel Corporation June 1998  –  September 1998  (4 months) Folsom, CA Designed and developed user interface and data delivery tools for use with the engineering problem inquiry database. CEO Mustbin August 2014  – Present (1 year 1 month) Boston, MA 1000% focused on building the best team, company, and products on the planet. Mustbin was announced as a finalist in the September 2014 and 2015 MassTLC awards for \"Innovative Technology of the Year: Mobile App.\" CEO Mustbin August 2014  – Present (1 year 1 month) Boston, MA 1000% focused on building the best team, company, and products on the planet. Mustbin was announced as a finalist in the September 2014 and 2015 MassTLC awards for \"Innovative Technology of the Year: Mobile App.\" CTO Mustbin December 2013  –  August 2014  (9 months) Boston, MA Responsible for product and technology development. Recruited and hired engineers, designers, and marketers. Pitched and presented at a number of events and award competitions. In May, Mustbin was honored with the prestigious MITX award for \"Most Innovative Mobile App\" of 2014. in August, we were nominated as one of Boston's Coolest Companies. CTO Mustbin December 2013  –  August 2014  (9 months) Boston, MA Responsible for product and technology development. Recruited and hired engineers, designers, and marketers. Pitched and presented at a number of events and award competitions. In May, Mustbin was honored with the prestigious MITX award for \"Most Innovative Mobile App\" of 2014. in August, we were nominated as one of Boston's Coolest Companies. Vice President, Engineering Mustbin January 2013  –  December 2013  (1 year) Boston, MA First founding team member. Recruited some of Boston's best talent and promoted strong team culture. Established an agile product development process. Collaborated, wrote, and filed a patent protecting our core IP. Lead the team that built and launched the Mustbin iOS app. Mustbin received tremendous praise from TechCrunch on launch: \"The end result is an iPhone app where everything that matters to you is in one place.\" Vice President, Engineering Mustbin January 2013  –  December 2013  (1 year) Boston, MA First founding team member. Recruited some of Boston's best talent and promoted strong team culture. Established an agile product development process. Collaborated, wrote, and filed a patent protecting our core IP. Lead the team that built and launched the Mustbin iOS app. Mustbin received tremendous praise from TechCrunch on launch: \"The end result is an iPhone app where everything that matters to you is in one place.\" Scrum Master, Sr. Software Engineer Modo Labs, Inc. February 2012  –  January 2013  (1 year) Cambridge, MA Responsible for the Agile development process using Scrum. I managed the Kurogo platform iOS and Android releases and was lead developer on iOS apps for world-class education and enterprise clients and partners. Scrum Master, Sr. Software Engineer Modo Labs, Inc. February 2012  –  January 2013  (1 year) Cambridge, MA Responsible for the Agile development process using Scrum. I managed the Kurogo platform iOS and Android releases and was lead developer on iOS apps for world-class education and enterprise clients and partners. Principal Mahajan Software Consulting August 2010  –  February 2012  (1 year 7 months) Cambridge, MA & San Francisco, CA Developed iOS and web applications for a number of clients. Principal Mahajan Software Consulting August 2010  –  February 2012  (1 year 7 months) Cambridge, MA & San Francisco, CA Developed iOS and web applications for a number of clients. iOS Developer Independent January 2009  –  October 2011  (2 years 10 months) Cambridge, MA Launched three apps: a physics-based puzzle game for iPhone, iPod, and iPad called BeeBop, a “money burning” entertainment app for iPhone and iPad called Money2Burn, and a social networking app for iPhone called RoloRoulette. Over 50,000 people have downloaded my apps. iOS Developer Independent January 2009  –  October 2011  (2 years 10 months) Cambridge, MA Launched three apps: a physics-based puzzle game for iPhone, iPod, and iPad called BeeBop, a “money burning” entertainment app for iPhone and iPad called Money2Burn, and a social networking app for iPhone called RoloRoulette. Over 50,000 people have downloaded my apps. Co-founder, CTO Motus Corporation January 2002  –  July 2010  (8 years 7 months) Cambridge, MA Co-founded the world’s first company dedicated to wireless motion capture using MEMS accelerometers, gyroscopes, and magnetometers. 1 issued patent. 6 patents pending. Nominated for the MIT Technology Review TR35 2008 (Top Innovators under 35) for a patent on utilizing metadata to enable language-based techniques for 3D gesture recognition. Managed an agile team consisting of software engineers, electrical engineers and designers working on the \"Darwin\" Wireless Motion Game Controller and market-leading iClub products. iClub was dubbed the “Future of Golf” by the PGA in 2005. Featured in: New York Times, Wall Street Journal, Boston Globe, Forbes, PBS, and numerous golf magazines. Won top product awards from Travel and Leisure, GolfDigest, Golf Magazine. iClub products were installed in top country clubs including: Pebble Beach, Augusta, St. Andrews, Pinehurst and many others. Co-founder, CTO Motus Corporation January 2002  –  July 2010  (8 years 7 months) Cambridge, MA Co-founded the world’s first company dedicated to wireless motion capture using MEMS accelerometers, gyroscopes, and magnetometers. 1 issued patent. 6 patents pending. Nominated for the MIT Technology Review TR35 2008 (Top Innovators under 35) for a patent on utilizing metadata to enable language-based techniques for 3D gesture recognition. Managed an agile team consisting of software engineers, electrical engineers and designers working on the \"Darwin\" Wireless Motion Game Controller and market-leading iClub products. iClub was dubbed the “Future of Golf” by the PGA in 2005. Featured in: New York Times, Wall Street Journal, Boston Globe, Forbes, PBS, and numerous golf magazines. Won top product awards from Travel and Leisure, GolfDigest, Golf Magazine. iClub products were installed in top country clubs including: Pebble Beach, Augusta, St. Andrews, Pinehurst and many others. Co-founder Customachines June 1998  –  January 2000  (1 year 8 months) Sacramento, CA Co-founded a business that manufactures low-cost performance PCs for businesses and individuals. Co-founder Customachines June 1998  –  January 2000  (1 year 8 months) Sacramento, CA Co-founded a business that manufactures low-cost performance PCs for businesses and individuals. Software Engineer, Intern Intel Corporation June 1999  –  September 1999  (4 months) Folsom, CA Extended support software for the Pentium III team. Software Engineer, Intern Intel Corporation June 1999  –  September 1999  (4 months) Folsom, CA Extended support software for the Pentium III team. Software Engineer, Intern Intel Corporation June 1998  –  September 1998  (4 months) Folsom, CA Designed and developed user interface and data delivery tools for use with the engineering problem inquiry database. Software Engineer, Intern Intel Corporation June 1998  –  September 1998  (4 months) Folsom, CA Designed and developed user interface and data delivery tools for use with the engineering problem inquiry database. Skills Mobile Applications Agile Methodologies Start-ups User Experience Software Engineering Scrum Objective-C C C++ Software Design Enterprise Software Product Management User Interface Design iOS development Algorithms User Interface iOS Android Project Management Embedded Systems Mobile Devices Mac OS X Microsoft Office JavaScript Perl E-commerce Patents Entrepreneurship Product Development Kanban JIRA Product Design Product Marketing Human Computer... Technical Recruiting Team Building Windows HTML CSS PHP Photoshop Git Game Development Mobile Games Marketing Marketing Strategy Social Media Fundraising Public Speaking Swift See 35+     See less Skills  Mobile Applications Agile Methodologies Start-ups User Experience Software Engineering Scrum Objective-C C C++ Software Design Enterprise Software Product Management User Interface Design iOS development Algorithms User Interface iOS Android Project Management Embedded Systems Mobile Devices Mac OS X Microsoft Office JavaScript Perl E-commerce Patents Entrepreneurship Product Development Kanban JIRA Product Design Product Marketing Human Computer... Technical Recruiting Team Building Windows HTML CSS PHP Photoshop Git Game Development Mobile Games Marketing Marketing Strategy Social Media Fundraising Public Speaking Swift See 35+     See less Mobile Applications Agile Methodologies Start-ups User Experience Software Engineering Scrum Objective-C C C++ Software Design Enterprise Software Product Management User Interface Design iOS development Algorithms User Interface iOS Android Project Management Embedded Systems Mobile Devices Mac OS X Microsoft Office JavaScript Perl E-commerce Patents Entrepreneurship Product Development Kanban JIRA Product Design Product Marketing Human Computer... Technical Recruiting Team Building Windows HTML CSS PHP Photoshop Git Game Development Mobile Games Marketing Marketing Strategy Social Media Fundraising Public Speaking Swift See 35+     See less Mobile Applications Agile Methodologies Start-ups User Experience Software Engineering Scrum Objective-C C C++ Software Design Enterprise Software Product Management User Interface Design iOS development Algorithms User Interface iOS Android Project Management Embedded Systems Mobile Devices Mac OS X Microsoft Office JavaScript Perl E-commerce Patents Entrepreneurship Product Development Kanban JIRA Product Design Product Marketing Human Computer... Technical Recruiting Team Building Windows HTML CSS PHP Photoshop Git Game Development Mobile Games Marketing Marketing Strategy Social Media Fundraising Public Speaking Swift See 35+     See less Education University of California, San Diego Computer Engineering 1997  – 2001 Rio Americano High School 1993  – 1997 University of California, San Diego Computer Engineering 1997  – 2001 University of California, San Diego Computer Engineering 1997  – 2001 University of California, San Diego Computer Engineering 1997  – 2001 Rio Americano High School 1993  – 1997 Rio Americano High School 1993  – 1997 Rio Americano High School 1993  – 1997 ", "Experience Continuous Integration Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Graphics Perfomance Analyzers Lab Support Technician Intel Corporation April 2014  –  June 2015  (1 year 3 months) Administrated Jenkins CI build system by troubleshooting errors, improving  \nfunctionality and adding features. \nImplemented changes in build environment that significantly reduced build  \ntimes, in some cases by more than 50%. \nCreated Jenkins gasket code in Python that separated build into several  \nbuild and packaging steps for OSX builds. This allowed us to save \ntime by not rebuilding pieces that did not result in error. \nSetup MySQL database and server from scratch and implemented CI code to  \nallow us to better track Jenkins build times and errors, and allow the  \nbuild team to troubleshoot more efficiently. \nSet up, maintained, and repaired pre-production Broadwell, Haswell and Ivy  \nBridge systems. \nWorked within an Agile / Scrum development environment, and submitted all  \ncoding work through Perforce. Security Officer Securitas Security Services USA, Inc. April 2012  –  April 2014  (2 years 1 month) Provided access control  \nMonitored alarm systems for chemical spills, fire and unauthorized entry  \nResponded to emergency calls  \nExcellent customer service & professionalism System Administrator United States Anrmy September 2007  –  September 2011  (4 years 1 month) Presented weekly report to managers \no Team tasks accomplished/in-progress/up-coming; allowing 100% visibility \nSupervised & trained 5 employees  \no Provided recognition, promotion, discipline & reduction of force  \nOversaw security & maintenance of 120+ computer systems & peripherals  \nManaged 150+ user accounts utilizing Microsoft Active Directory  \nLed team projects  \no Integrated & migrated from PACOM network to Irag network during  \ndeployment \nCreated fliers for common user problems & customer feedback cards  \nCreated new technical training materials which improved employee competence \n& overall customer feedback Continuous Integration Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Continuous Integration Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Graphics Perfomance Analyzers Lab Support Technician Intel Corporation April 2014  –  June 2015  (1 year 3 months) Administrated Jenkins CI build system by troubleshooting errors, improving  \nfunctionality and adding features. \nImplemented changes in build environment that significantly reduced build  \ntimes, in some cases by more than 50%. \nCreated Jenkins gasket code in Python that separated build into several  \nbuild and packaging steps for OSX builds. This allowed us to save \ntime by not rebuilding pieces that did not result in error. \nSetup MySQL database and server from scratch and implemented CI code to  \nallow us to better track Jenkins build times and errors, and allow the  \nbuild team to troubleshoot more efficiently. \nSet up, maintained, and repaired pre-production Broadwell, Haswell and Ivy  \nBridge systems. \nWorked within an Agile / Scrum development environment, and submitted all  \ncoding work through Perforce. Graphics Perfomance Analyzers Lab Support Technician Intel Corporation April 2014  –  June 2015  (1 year 3 months) Administrated Jenkins CI build system by troubleshooting errors, improving  \nfunctionality and adding features. \nImplemented changes in build environment that significantly reduced build  \ntimes, in some cases by more than 50%. \nCreated Jenkins gasket code in Python that separated build into several  \nbuild and packaging steps for OSX builds. This allowed us to save \ntime by not rebuilding pieces that did not result in error. \nSetup MySQL database and server from scratch and implemented CI code to  \nallow us to better track Jenkins build times and errors, and allow the  \nbuild team to troubleshoot more efficiently. \nSet up, maintained, and repaired pre-production Broadwell, Haswell and Ivy  \nBridge systems. \nWorked within an Agile / Scrum development environment, and submitted all  \ncoding work through Perforce. Security Officer Securitas Security Services USA, Inc. April 2012  –  April 2014  (2 years 1 month) Provided access control  \nMonitored alarm systems for chemical spills, fire and unauthorized entry  \nResponded to emergency calls  \nExcellent customer service & professionalism Security Officer Securitas Security Services USA, Inc. April 2012  –  April 2014  (2 years 1 month) Provided access control  \nMonitored alarm systems for chemical spills, fire and unauthorized entry  \nResponded to emergency calls  \nExcellent customer service & professionalism System Administrator United States Anrmy September 2007  –  September 2011  (4 years 1 month) Presented weekly report to managers \no Team tasks accomplished/in-progress/up-coming; allowing 100% visibility \nSupervised & trained 5 employees  \no Provided recognition, promotion, discipline & reduction of force  \nOversaw security & maintenance of 120+ computer systems & peripherals  \nManaged 150+ user accounts utilizing Microsoft Active Directory  \nLed team projects  \no Integrated & migrated from PACOM network to Irag network during  \ndeployment \nCreated fliers for common user problems & customer feedback cards  \nCreated new technical training materials which improved employee competence \n& overall customer feedback System Administrator United States Anrmy September 2007  –  September 2011  (4 years 1 month) Presented weekly report to managers \no Team tasks accomplished/in-progress/up-coming; allowing 100% visibility \nSupervised & trained 5 employees  \no Provided recognition, promotion, discipline & reduction of force  \nOversaw security & maintenance of 120+ computer systems & peripherals  \nManaged 150+ user accounts utilizing Microsoft Active Directory  \nLed team projects  \no Integrated & migrated from PACOM network to Irag network during  \ndeployment \nCreated fliers for common user problems & customer feedback cards  \nCreated new technical training materials which improved employee competence \n& overall customer feedback Skills Linux System... Windows System... Python C++ OS X MySQL Programming Database Design Bash Customer Service Leadership Microsoft Office Microsoft Excel Microsoft Word PowerPoint Strategic Planning Jenkins Database Administration Relational Databases Ubuntu Android Development Security See 7+     See less Skills  Linux System... Windows System... Python C++ OS X MySQL Programming Database Design Bash Customer Service Leadership Microsoft Office Microsoft Excel Microsoft Word PowerPoint Strategic Planning Jenkins Database Administration Relational Databases Ubuntu Android Development Security See 7+     See less Linux System... Windows System... Python C++ OS X MySQL Programming Database Design Bash Customer Service Leadership Microsoft Office Microsoft Excel Microsoft Word PowerPoint Strategic Planning Jenkins Database Administration Relational Databases Ubuntu Android Development Security See 7+     See less Linux System... Windows System... Python C++ OS X MySQL Programming Database Design Bash Customer Service Leadership Microsoft Office Microsoft Excel Microsoft Word PowerPoint Strategic Planning Jenkins Database Administration Relational Databases Ubuntu Android Development Security See 7+     See less Education Portland Community College Associate of Applied Science,  Computer Information Systems , 3.61 2013  – 2015 Portland State University 2011  – 2012 Portland Community College Associate of Applied Science,  Computer Information Systems , 3.61 2013  – 2015 Portland Community College Associate of Applied Science,  Computer Information Systems , 3.61 2013  – 2015 Portland Community College Associate of Applied Science,  Computer Information Systems , 3.61 2013  – 2015 Portland State University 2011  – 2012 Portland State University 2011  – 2012 Portland State University 2011  – 2012 ", "Summary I'm currently working as a Test Engineer for Errigal Operations Software limited after finishing fourth year of BSc Applied Computing (Level 8) in Waterford Institute of Technology. I have studied a range of Modules including Programming, Security, Networking, Games Design, Cryptography, AI, Databases and Ethics. I have experienced many different programming languages including Java, Python, Perl, PHP, Ruby and MySQL. Many of my modules have been taught through Linux, giving me a good knowledge of the Linux command line and tools. I decided to take the Networking stream and from this I have explored many aspects of Networking, from basic switching and routing to configuring Instances in AWS through Python. My FYP is also Networking based and revolves around the Openstack Cloud Computing service.  \n \nI've previously worked for Intel on three separate occasions. All times I was situated in Shannon. I've worked with Client services, fixing computers and dealing with client issues and I have also worked in a software team. My job was primarily based around Software Defined Networking and working with the Cloud Operating Software, Openstack. \n \nI currently manage my own fashion, beauty and fitness Blog which allows me to keep in touch with web design whilst still enjoying my hobby. Summary I'm currently working as a Test Engineer for Errigal Operations Software limited after finishing fourth year of BSc Applied Computing (Level 8) in Waterford Institute of Technology. I have studied a range of Modules including Programming, Security, Networking, Games Design, Cryptography, AI, Databases and Ethics. I have experienced many different programming languages including Java, Python, Perl, PHP, Ruby and MySQL. Many of my modules have been taught through Linux, giving me a good knowledge of the Linux command line and tools. I decided to take the Networking stream and from this I have explored many aspects of Networking, from basic switching and routing to configuring Instances in AWS through Python. My FYP is also Networking based and revolves around the Openstack Cloud Computing service.  \n \nI've previously worked for Intel on three separate occasions. All times I was situated in Shannon. I've worked with Client services, fixing computers and dealing with client issues and I have also worked in a software team. My job was primarily based around Software Defined Networking and working with the Cloud Operating Software, Openstack. \n \nI currently manage my own fashion, beauty and fitness Blog which allows me to keep in touch with web design whilst still enjoying my hobby. I'm currently working as a Test Engineer for Errigal Operations Software limited after finishing fourth year of BSc Applied Computing (Level 8) in Waterford Institute of Technology. I have studied a range of Modules including Programming, Security, Networking, Games Design, Cryptography, AI, Databases and Ethics. I have experienced many different programming languages including Java, Python, Perl, PHP, Ruby and MySQL. Many of my modules have been taught through Linux, giving me a good knowledge of the Linux command line and tools. I decided to take the Networking stream and from this I have explored many aspects of Networking, from basic switching and routing to configuring Instances in AWS through Python. My FYP is also Networking based and revolves around the Openstack Cloud Computing service.  \n \nI've previously worked for Intel on three separate occasions. All times I was situated in Shannon. I've worked with Client services, fixing computers and dealing with client issues and I have also worked in a software team. My job was primarily based around Software Defined Networking and working with the Cloud Operating Software, Openstack. \n \nI currently manage my own fashion, beauty and fitness Blog which allows me to keep in touch with web design whilst still enjoying my hobby. I'm currently working as a Test Engineer for Errigal Operations Software limited after finishing fourth year of BSc Applied Computing (Level 8) in Waterford Institute of Technology. I have studied a range of Modules including Programming, Security, Networking, Games Design, Cryptography, AI, Databases and Ethics. I have experienced many different programming languages including Java, Python, Perl, PHP, Ruby and MySQL. Many of my modules have been taught through Linux, giving me a good knowledge of the Linux command line and tools. I decided to take the Networking stream and from this I have explored many aspects of Networking, from basic switching and routing to configuring Instances in AWS through Python. My FYP is also Networking based and revolves around the Openstack Cloud Computing service.  \n \nI've previously worked for Intel on three separate occasions. All times I was situated in Shannon. I've worked with Client services, fixing computers and dealing with client issues and I have also worked in a software team. My job was primarily based around Software Defined Networking and working with the Cloud Operating Software, Openstack. \n \nI currently manage my own fashion, beauty and fitness Blog which allows me to keep in touch with web design whilst still enjoying my hobby. Experience Tech Support Eishtec February 2015  –  May 2015  (4 months) Waterford, Ireland Software Engineer Intern Intel Corporation January 2014  –  August 2014  (8 months) Shannon, Ireland Working as part of the Openstack team to upstream our changes to Openstack Juno. \nAlso worked on some Project Management tasks such as releasing code for various teams and running Team meetings. \nUsed technologies including Python, GIT, Openstack. Sales Assistant Next Group PLC October 2013  –  December 2013  (3 months) Waterford, Ireland Sales Assistant; taking sales, dressing room assistant, stock replenishmet Software Engineer Intern Intel Corporation June 2013  –  September 2013  (4 months) Shannon, Ireland Worked primarily in a Software Defined Networking team. Worked with the Cloud Operating software, Openstack. I worked as part of a small team but can also work well in a larger team. Client Services Intern Intel Corporation May 2012  –  August 2012  (4 months) Shannon, Ireland Fix Client Issues \nRepair Assets Sales Assistant Dunnes Stores November 2010  –  December 2010  (2 months) Charleville, Co. Cork, Ireland Till Operator \nStocked Shelves \nCustomer Care \nStock Take Sales Assistant Dunnes Stores December 2009  –  December 2009  (1 month) Charleville, Co. Cork, Ireland Till Operator \nStock Shelves \nCustomer Care \nStock Take Tech Support Eishtec February 2015  –  May 2015  (4 months) Waterford, Ireland Tech Support Eishtec February 2015  –  May 2015  (4 months) Waterford, Ireland Software Engineer Intern Intel Corporation January 2014  –  August 2014  (8 months) Shannon, Ireland Working as part of the Openstack team to upstream our changes to Openstack Juno. \nAlso worked on some Project Management tasks such as releasing code for various teams and running Team meetings. \nUsed technologies including Python, GIT, Openstack. Software Engineer Intern Intel Corporation January 2014  –  August 2014  (8 months) Shannon, Ireland Working as part of the Openstack team to upstream our changes to Openstack Juno. \nAlso worked on some Project Management tasks such as releasing code for various teams and running Team meetings. \nUsed technologies including Python, GIT, Openstack. Sales Assistant Next Group PLC October 2013  –  December 2013  (3 months) Waterford, Ireland Sales Assistant; taking sales, dressing room assistant, stock replenishmet Sales Assistant Next Group PLC October 2013  –  December 2013  (3 months) Waterford, Ireland Sales Assistant; taking sales, dressing room assistant, stock replenishmet Software Engineer Intern Intel Corporation June 2013  –  September 2013  (4 months) Shannon, Ireland Worked primarily in a Software Defined Networking team. Worked with the Cloud Operating software, Openstack. I worked as part of a small team but can also work well in a larger team. Software Engineer Intern Intel Corporation June 2013  –  September 2013  (4 months) Shannon, Ireland Worked primarily in a Software Defined Networking team. Worked with the Cloud Operating software, Openstack. I worked as part of a small team but can also work well in a larger team. Client Services Intern Intel Corporation May 2012  –  August 2012  (4 months) Shannon, Ireland Fix Client Issues \nRepair Assets Client Services Intern Intel Corporation May 2012  –  August 2012  (4 months) Shannon, Ireland Fix Client Issues \nRepair Assets Sales Assistant Dunnes Stores November 2010  –  December 2010  (2 months) Charleville, Co. Cork, Ireland Till Operator \nStocked Shelves \nCustomer Care \nStock Take Sales Assistant Dunnes Stores November 2010  –  December 2010  (2 months) Charleville, Co. Cork, Ireland Till Operator \nStocked Shelves \nCustomer Care \nStock Take Sales Assistant Dunnes Stores December 2009  –  December 2009  (1 month) Charleville, Co. Cork, Ireland Till Operator \nStock Shelves \nCustomer Care \nStock Take Sales Assistant Dunnes Stores December 2009  –  December 2009  (1 month) Charleville, Co. Cork, Ireland Till Operator \nStock Shelves \nCustomer Care \nStock Take Languages French Irish French Irish French Irish Skills Java Programming Perl Eclipse OpenStack Python Linux Project Management CCNA HTML SQL Ruby MySQL Ruby on Rails Perl Script Django Cryptography PHP CSS Microsoft Office Teamwork Databases Git See 8+     See less Skills  Java Programming Perl Eclipse OpenStack Python Linux Project Management CCNA HTML SQL Ruby MySQL Ruby on Rails Perl Script Django Cryptography PHP CSS Microsoft Office Teamwork Databases Git See 8+     See less Java Programming Perl Eclipse OpenStack Python Linux Project Management CCNA HTML SQL Ruby MySQL Ruby on Rails Perl Script Django Cryptography PHP CSS Microsoft Office Teamwork Databases Git See 8+     See less Java Programming Perl Eclipse OpenStack Python Linux Project Management CCNA HTML SQL Ruby MySQL Ruby on Rails Perl Script Django Cryptography PHP CSS Microsoft Office Teamwork Databases Git See 8+     See less Education Waterford Institute of Technology Honour Degree,  Applied Computing 2011  – 2015 Activities and Societies:  Class Rep ,  WITSU Ents Crew ,  Ladies Soccer Team St. Mary's Secondary School, Charleville, Co. Cork 2005  – 2011 Waterford Institute of Technology Honour Degree,  Applied Computing 2011  – 2015 Activities and Societies:  Class Rep ,  WITSU Ents Crew ,  Ladies Soccer Team Waterford Institute of Technology Honour Degree,  Applied Computing 2011  – 2015 Activities and Societies:  Class Rep ,  WITSU Ents Crew ,  Ladies Soccer Team Waterford Institute of Technology Honour Degree,  Applied Computing 2011  – 2015 Activities and Societies:  Class Rep ,  WITSU Ents Crew ,  Ladies Soccer Team St. Mary's Secondary School, Charleville, Co. Cork 2005  – 2011 St. Mary's Secondary School, Charleville, Co. Cork 2005  – 2011 St. Mary's Secondary School, Charleville, Co. Cork 2005  – 2011 Honors & Awards Software Defined Networking Course Georgia Institute of Technology August 2013 Joint award with Stanford University Explorer Belt Scouting Ireland July 2012 Involved walking 200km across the Brittany region of France in 10 days with a partner. Supplied with 80 euro to live on between the two of us. Had to undertake projects, both personal and cultural and keep a log of the trip from the first day until the last. Women In Technology Scholarship Intel September 2011 The Intel Women in Technology Scholarship was awarded to 5 women who are studying any technology degree in Ireland. This includes courses such as computers, engineering, maths etc. The aim of this scholarship is to encourage more women to pursue careers in the technology/IT sector. Sunlife Innovation Award Sunlife Financial May 2015 The Sunlife Innovation award is awarded to one student for their final year project. It is chosen based on the use of new or upcoming technologies in the students project or the application of current technologies in new ways. Software Defined Networking Course Georgia Institute of Technology August 2013 Joint award with Stanford University Software Defined Networking Course Georgia Institute of Technology August 2013 Joint award with Stanford University Software Defined Networking Course Georgia Institute of Technology August 2013 Joint award with Stanford University Explorer Belt Scouting Ireland July 2012 Involved walking 200km across the Brittany region of France in 10 days with a partner. Supplied with 80 euro to live on between the two of us. Had to undertake projects, both personal and cultural and keep a log of the trip from the first day until the last. Explorer Belt Scouting Ireland July 2012 Involved walking 200km across the Brittany region of France in 10 days with a partner. Supplied with 80 euro to live on between the two of us. Had to undertake projects, both personal and cultural and keep a log of the trip from the first day until the last. Explorer Belt Scouting Ireland July 2012 Involved walking 200km across the Brittany region of France in 10 days with a partner. Supplied with 80 euro to live on between the two of us. Had to undertake projects, both personal and cultural and keep a log of the trip from the first day until the last. Women In Technology Scholarship Intel September 2011 The Intel Women in Technology Scholarship was awarded to 5 women who are studying any technology degree in Ireland. This includes courses such as computers, engineering, maths etc. The aim of this scholarship is to encourage more women to pursue careers in the technology/IT sector. Women In Technology Scholarship Intel September 2011 The Intel Women in Technology Scholarship was awarded to 5 women who are studying any technology degree in Ireland. This includes courses such as computers, engineering, maths etc. The aim of this scholarship is to encourage more women to pursue careers in the technology/IT sector. Women In Technology Scholarship Intel September 2011 The Intel Women in Technology Scholarship was awarded to 5 women who are studying any technology degree in Ireland. This includes courses such as computers, engineering, maths etc. The aim of this scholarship is to encourage more women to pursue careers in the technology/IT sector. Sunlife Innovation Award Sunlife Financial May 2015 The Sunlife Innovation award is awarded to one student for their final year project. It is chosen based on the use of new or upcoming technologies in the students project or the application of current technologies in new ways. Sunlife Innovation Award Sunlife Financial May 2015 The Sunlife Innovation award is awarded to one student for their final year project. It is chosen based on the use of new or upcoming technologies in the students project or the application of current technologies in new ways. Sunlife Innovation Award Sunlife Financial May 2015 The Sunlife Innovation award is awarded to one student for their final year project. It is chosen based on the use of new or upcoming technologies in the students project or the application of current technologies in new ways. ", "Summary I am currently pursuing a M.S. in Computer Science from the University of California - Los Angeles. I received my B.S. in Computer Science at McGill University in Montreal, Quebec in 2014. \n \nI am passionate about Computer Science and am always looking to learn and explore new topics and areas. I have a wide range of experience and am especially interested in Computer Graphics, Games and Natural Language Processing. \n \nI have worked extensively in Java, C++ and Python and have experience with OpenGL, C#, and a host of other languages and development environments ranging from Visual Studio to Xcode to the command-line. Summary I am currently pursuing a M.S. in Computer Science from the University of California - Los Angeles. I received my B.S. in Computer Science at McGill University in Montreal, Quebec in 2014. \n \nI am passionate about Computer Science and am always looking to learn and explore new topics and areas. I have a wide range of experience and am especially interested in Computer Graphics, Games and Natural Language Processing. \n \nI have worked extensively in Java, C++ and Python and have experience with OpenGL, C#, and a host of other languages and development environments ranging from Visual Studio to Xcode to the command-line. I am currently pursuing a M.S. in Computer Science from the University of California - Los Angeles. I received my B.S. in Computer Science at McGill University in Montreal, Quebec in 2014. \n \nI am passionate about Computer Science and am always looking to learn and explore new topics and areas. I have a wide range of experience and am especially interested in Computer Graphics, Games and Natural Language Processing. \n \nI have worked extensively in Java, C++ and Python and have experience with OpenGL, C#, and a host of other languages and development environments ranging from Visual Studio to Xcode to the command-line. I am currently pursuing a M.S. in Computer Science from the University of California - Los Angeles. I received my B.S. in Computer Science at McGill University in Montreal, Quebec in 2014. \n \nI am passionate about Computer Science and am always looking to learn and explore new topics and areas. I have a wide range of experience and am especially interested in Computer Graphics, Games and Natural Language Processing. \n \nI have worked extensively in Java, C++ and Python and have experience with OpenGL, C#, and a host of other languages and development environments ranging from Visual Studio to Xcode to the command-line. Experience Graphics Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Graphics Software Engineer Intern Intel Corporation May 2014  –  August 2014  (4 months) Hillsboro, Oregon Explored and implemented ports of high performance graphical applications to Chrome and Chrome OS using Google Native Client. Succeeded in delivering a port of a complex ~100k line benchmarking application that runs natively in the browser. Provided an initial proof of concept for this process within Intel as well as delivered documentation to establish best known methods. Software Engineer Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Designed and implemented cross-platform test infrastructure for Windows, Mac OS X, and Ubuntu to run daily and continuous integration tests for 8 developers and 10 machines. Implemented automated GUI testing suite for both Windows and Mac OS X applications to greatly improve the robustness of tests and decrease the number of manual tests required. Sports Camp Counselor McGill University June 2012  –  August 2012  (3 months) Montreal, Canada Area Graphics Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Graphics Software Engineer Intern Intel Corporation June 2015  – Present (3 months) Graphics Software Engineer Intern Intel Corporation May 2014  –  August 2014  (4 months) Hillsboro, Oregon Explored and implemented ports of high performance graphical applications to Chrome and Chrome OS using Google Native Client. Succeeded in delivering a port of a complex ~100k line benchmarking application that runs natively in the browser. Provided an initial proof of concept for this process within Intel as well as delivered documentation to establish best known methods. Graphics Software Engineer Intern Intel Corporation May 2014  –  August 2014  (4 months) Hillsboro, Oregon Explored and implemented ports of high performance graphical applications to Chrome and Chrome OS using Google Native Client. Succeeded in delivering a port of a complex ~100k line benchmarking application that runs natively in the browser. Provided an initial proof of concept for this process within Intel as well as delivered documentation to establish best known methods. Software Engineer Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Designed and implemented cross-platform test infrastructure for Windows, Mac OS X, and Ubuntu to run daily and continuous integration tests for 8 developers and 10 machines. Implemented automated GUI testing suite for both Windows and Mac OS X applications to greatly improve the robustness of tests and decrease the number of manual tests required. Software Engineer Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Designed and implemented cross-platform test infrastructure for Windows, Mac OS X, and Ubuntu to run daily and continuous integration tests for 8 developers and 10 machines. Implemented automated GUI testing suite for both Windows and Mac OS X applications to greatly improve the robustness of tests and decrease the number of manual tests required. Sports Camp Counselor McGill University June 2012  –  August 2012  (3 months) Montreal, Canada Area Sports Camp Counselor McGill University June 2012  –  August 2012  (3 months) Montreal, Canada Area Languages French French French Skills Java Python Computer Graphics ROS Eclipse C++ Linux Windows Mac OS X OS X Software Development Computer Science C Ubuntu Programming Skills  Java Python Computer Graphics ROS Eclipse C++ Linux Windows Mac OS X OS X Software Development Computer Science C Ubuntu Programming Java Python Computer Graphics ROS Eclipse C++ Linux Windows Mac OS X OS X Software Development Computer Science C Ubuntu Programming Java Python Computer Graphics ROS Eclipse C++ Linux Windows Mac OS X OS X Software Development Computer Science C Ubuntu Programming Education University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 McGill University Bachelor of Science,  Computer Science 2009  – 2014 Activities and Societies:  Varsity Men's Basketball Team University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 McGill University Bachelor of Science,  Computer Science 2009  – 2014 Activities and Societies:  Varsity Men's Basketball Team McGill University Bachelor of Science,  Computer Science 2009  – 2014 Activities and Societies:  Varsity Men's Basketball Team McGill University Bachelor of Science,  Computer Science 2009  – 2014 Activities and Societies:  Varsity Men's Basketball Team Honors & Awards ", "Experience Assistant Professor, Department of Electronics Cochin University of Science and Technology August 2015  – Present (1 month) Software Architect Intel Corporation September 2014  –  August 2015  (1 year) Bengaluru Area, India SoC Performance Engineer/ Android Runtime Compiler Engineer Intel Corporation August 2011  –  September 2014  (3 years 2 months) Santa Clara, California, USA Bringup and optimizations of Android Dalvik VM. \nhttps://android-review.googlesource.com/#/c/38941/ \n \nWork on its JIT compiler to generate x86 code for Atom.  \nPerformance analysis and optimizations for mobile products from intel such as phones and tablets. Software Engineer (intern) Intel Corporation, Folsom, California May 2010  –  December 2010  (8 months) Part of the Software and Services Group Client Enabling Team, working with software companies (ISVs) to enhance their applications on Intel processor based laptop \nPerformance enhancement and software optimization of different media codec. Working on photo and media solutions for multi-threaded design and Intel architecture optimizations Software Engineer (intern) Intel Corporation, Champaign, Illinois May 2008  –  August 2008  (4 months) Part of Software and Services Group Developer Products Division, working on building software tools like Intel Thread Checker and performance evaluation of VTUNE set of tools on multi-core machines. System Programmer (Intern) IBM at Poughkeepsie, New York August 2006  –  November 2006  (4 months) Part of SystemZ benchmarking group, working on test software for performance evaluation of load distribution targeting servers. Program Analyst Cognizant Technology Solutions at Chennai, India October 2004  –  December 2004  (3 months) Full Time employee at CTS, working on mainframe related projects. Assistant Professor, Department of Electronics Cochin University of Science and Technology August 2015  – Present (1 month) Assistant Professor, Department of Electronics Cochin University of Science and Technology August 2015  – Present (1 month) Software Architect Intel Corporation September 2014  –  August 2015  (1 year) Bengaluru Area, India Software Architect Intel Corporation September 2014  –  August 2015  (1 year) Bengaluru Area, India SoC Performance Engineer/ Android Runtime Compiler Engineer Intel Corporation August 2011  –  September 2014  (3 years 2 months) Santa Clara, California, USA Bringup and optimizations of Android Dalvik VM. \nhttps://android-review.googlesource.com/#/c/38941/ \n \nWork on its JIT compiler to generate x86 code for Atom.  \nPerformance analysis and optimizations for mobile products from intel such as phones and tablets. SoC Performance Engineer/ Android Runtime Compiler Engineer Intel Corporation August 2011  –  September 2014  (3 years 2 months) Santa Clara, California, USA Bringup and optimizations of Android Dalvik VM. \nhttps://android-review.googlesource.com/#/c/38941/ \n \nWork on its JIT compiler to generate x86 code for Atom.  \nPerformance analysis and optimizations for mobile products from intel such as phones and tablets. Software Engineer (intern) Intel Corporation, Folsom, California May 2010  –  December 2010  (8 months) Part of the Software and Services Group Client Enabling Team, working with software companies (ISVs) to enhance their applications on Intel processor based laptop \nPerformance enhancement and software optimization of different media codec. Working on photo and media solutions for multi-threaded design and Intel architecture optimizations Software Engineer (intern) Intel Corporation, Folsom, California May 2010  –  December 2010  (8 months) Part of the Software and Services Group Client Enabling Team, working with software companies (ISVs) to enhance their applications on Intel processor based laptop \nPerformance enhancement and software optimization of different media codec. Working on photo and media solutions for multi-threaded design and Intel architecture optimizations Software Engineer (intern) Intel Corporation, Champaign, Illinois May 2008  –  August 2008  (4 months) Part of Software and Services Group Developer Products Division, working on building software tools like Intel Thread Checker and performance evaluation of VTUNE set of tools on multi-core machines. Software Engineer (intern) Intel Corporation, Champaign, Illinois May 2008  –  August 2008  (4 months) Part of Software and Services Group Developer Products Division, working on building software tools like Intel Thread Checker and performance evaluation of VTUNE set of tools on multi-core machines. System Programmer (Intern) IBM at Poughkeepsie, New York August 2006  –  November 2006  (4 months) Part of SystemZ benchmarking group, working on test software for performance evaluation of load distribution targeting servers. System Programmer (Intern) IBM at Poughkeepsie, New York August 2006  –  November 2006  (4 months) Part of SystemZ benchmarking group, working on test software for performance evaluation of load distribution targeting servers. Program Analyst Cognizant Technology Solutions at Chennai, India October 2004  –  December 2004  (3 months) Full Time employee at CTS, working on mainframe related projects. Program Analyst Cognizant Technology Solutions at Chennai, India October 2004  –  December 2004  (3 months) Full Time employee at CTS, working on mainframe related projects. Skills X86 Software Design Web Services Test Automation Firmware Shell Scripting ARM Data Structures IC High Performance... MySQL Processors RTOS Computer Science Unix Shell Scripting Xilinx Cadence Virtuoso Integrated Circuit... Static Timing Analysis TCP/IP See 5+     See less Skills  X86 Software Design Web Services Test Automation Firmware Shell Scripting ARM Data Structures IC High Performance... MySQL Processors RTOS Computer Science Unix Shell Scripting Xilinx Cadence Virtuoso Integrated Circuit... Static Timing Analysis TCP/IP See 5+     See less X86 Software Design Web Services Test Automation Firmware Shell Scripting ARM Data Structures IC High Performance... MySQL Processors RTOS Computer Science Unix Shell Scripting Xilinx Cadence Virtuoso Integrated Circuit... Static Timing Analysis TCP/IP See 5+     See less X86 Software Design Web Services Test Automation Firmware Shell Scripting ARM Data Structures IC High Performance... MySQL Processors RTOS Computer Science Unix Shell Scripting Xilinx Cadence Virtuoso Integrated Circuit... Static Timing Analysis TCP/IP See 5+     See less Education Virginia Polytechnic Institute and State University PhD,  Computer Engineering 2007  – 2011 State University of New York at New Paltz MS,  Electrical Engineering 2005  – 2006 Cochin University of Science and Technology BTech,  Electronics Engineering 2000  – 2004 Rajagiri High School, Cochin 1992  – 1998 Virginia Polytechnic Institute and State University PhD,  Computer Engineering 2007  – 2011 Virginia Polytechnic Institute and State University PhD,  Computer Engineering 2007  – 2011 Virginia Polytechnic Institute and State University PhD,  Computer Engineering 2007  – 2011 State University of New York at New Paltz MS,  Electrical Engineering 2005  – 2006 State University of New York at New Paltz MS,  Electrical Engineering 2005  – 2006 State University of New York at New Paltz MS,  Electrical Engineering 2005  – 2006 Cochin University of Science and Technology BTech,  Electronics Engineering 2000  – 2004 Cochin University of Science and Technology BTech,  Electronics Engineering 2000  – 2004 Cochin University of Science and Technology BTech,  Electronics Engineering 2000  – 2004 Rajagiri High School, Cochin 1992  – 1998 Rajagiri High School, Cochin 1992  – 1998 Rajagiri High School, Cochin 1992  – 1998 Honors & Awards Outstanding Graduate Student Department of Electrical and Computer Engineering December 2006 2006 MS Graduation Batch Best Paper Award 15th IEEE/ACM Asia South Pacific Design Automation Conference, Taiwan 2010 Best Paper Award Intel Software professional’s Conference Santa Clara 2013 “A playbook for Analysis, Prototyping and Estimation of optimizations targeting Android \nDalvik VM” Dissertation selected to IEEE Design, Automation and Test in Europe (DATE) PhD Forum 2011 50 students are selected from all over the world at the annual Ph.D. Forum Intel Group Recognition Award 2012 For Outstanding performance results obtained for porting Android Jellybean on Intel Tablet devices Intel Divisional Recognition Award: 2011 For identifying a hardware issue in mobile computing device Intel Divisional Recognition Award 2012 For fixing a loop snoop detection bug in mobile device Intel Department Award 2012 For compiler optimizations to improve performance of Motorola Razr-i Android phone with Intel chip inside Internship work at Intel featured in Parallel programming talk 2010 work in parallelizing MPEG encoder for Microsoft windows player on Intel Core machines was recommended and accepted to a weekly radio program about software developments happening worldwide. \nhttp://software.intel.com/en-us/blogs/2010/10/26/parallel-programming-talk-95-bijoy-jose-multi-threading-for-higher-utilization-of-worker-threads-in-an-mpeg-encoder-halloween-show Outstanding Graduate Student Department of Electrical and Computer Engineering December 2006 2006 MS Graduation Batch Outstanding Graduate Student Department of Electrical and Computer Engineering December 2006 2006 MS Graduation Batch Outstanding Graduate Student Department of Electrical and Computer Engineering December 2006 2006 MS Graduation Batch Best Paper Award 15th IEEE/ACM Asia South Pacific Design Automation Conference, Taiwan 2010 Best Paper Award 15th IEEE/ACM Asia South Pacific Design Automation Conference, Taiwan 2010 Best Paper Award 15th IEEE/ACM Asia South Pacific Design Automation Conference, Taiwan 2010 Best Paper Award Intel Software professional’s Conference Santa Clara 2013 “A playbook for Analysis, Prototyping and Estimation of optimizations targeting Android \nDalvik VM” Best Paper Award Intel Software professional’s Conference Santa Clara 2013 “A playbook for Analysis, Prototyping and Estimation of optimizations targeting Android \nDalvik VM” Best Paper Award Intel Software professional’s Conference Santa Clara 2013 “A playbook for Analysis, Prototyping and Estimation of optimizations targeting Android \nDalvik VM” Dissertation selected to IEEE Design, Automation and Test in Europe (DATE) PhD Forum 2011 50 students are selected from all over the world at the annual Ph.D. Forum Dissertation selected to IEEE Design, Automation and Test in Europe (DATE) PhD Forum 2011 50 students are selected from all over the world at the annual Ph.D. Forum Dissertation selected to IEEE Design, Automation and Test in Europe (DATE) PhD Forum 2011 50 students are selected from all over the world at the annual Ph.D. Forum Intel Group Recognition Award 2012 For Outstanding performance results obtained for porting Android Jellybean on Intel Tablet devices Intel Group Recognition Award 2012 For Outstanding performance results obtained for porting Android Jellybean on Intel Tablet devices Intel Group Recognition Award 2012 For Outstanding performance results obtained for porting Android Jellybean on Intel Tablet devices Intel Divisional Recognition Award: 2011 For identifying a hardware issue in mobile computing device Intel Divisional Recognition Award: 2011 For identifying a hardware issue in mobile computing device Intel Divisional Recognition Award: 2011 For identifying a hardware issue in mobile computing device Intel Divisional Recognition Award 2012 For fixing a loop snoop detection bug in mobile device Intel Divisional Recognition Award 2012 For fixing a loop snoop detection bug in mobile device Intel Divisional Recognition Award 2012 For fixing a loop snoop detection bug in mobile device Intel Department Award 2012 For compiler optimizations to improve performance of Motorola Razr-i Android phone with Intel chip inside Intel Department Award 2012 For compiler optimizations to improve performance of Motorola Razr-i Android phone with Intel chip inside Intel Department Award 2012 For compiler optimizations to improve performance of Motorola Razr-i Android phone with Intel chip inside Internship work at Intel featured in Parallel programming talk 2010 work in parallelizing MPEG encoder for Microsoft windows player on Intel Core machines was recommended and accepted to a weekly radio program about software developments happening worldwide. \nhttp://software.intel.com/en-us/blogs/2010/10/26/parallel-programming-talk-95-bijoy-jose-multi-threading-for-higher-utilization-of-worker-threads-in-an-mpeg-encoder-halloween-show Internship work at Intel featured in Parallel programming talk 2010 work in parallelizing MPEG encoder for Microsoft windows player on Intel Core machines was recommended and accepted to a weekly radio program about software developments happening worldwide. \nhttp://software.intel.com/en-us/blogs/2010/10/26/parallel-programming-talk-95-bijoy-jose-multi-threading-for-higher-utilization-of-worker-threads-in-an-mpeg-encoder-halloween-show Internship work at Intel featured in Parallel programming talk 2010 work in parallelizing MPEG encoder for Microsoft windows player on Intel Core machines was recommended and accepted to a weekly radio program about software developments happening worldwide. \nhttp://software.intel.com/en-us/blogs/2010/10/26/parallel-programming-talk-95-bijoy-jose-multi-threading-for-higher-utilization-of-worker-threads-in-an-mpeg-encoder-halloween-show ", "Experience Software Engineer Intern Intel Corporation May 2013  – Present (2 years 4 months) Sacramento, California Area Graduate Student University of Texas at Dallas August 2012  – Present (3 years 1 month) Dallas/Fort Worth Area Software engineer II Cisco Systems December 2008  –  August 2012  (3 years 9 months) Pune (INDIA) Worked as automation infrastructure developer in Mobile Internet Technology Group.  \n•\tWorked & studied interfaces between MME, SGW, PGW, PCRF, HSS, AAA, LIServer, etc. \n•\tDeveloped automation infrastructure for combo-gateways (PGW+SGW, SAEGW). \n•\tReceived awards for efficiently handling Cisco ASR5500 project and developing efficient automation framework for “Inter chassis session recovery” (Redundancy feature) which saved >30% of running time. \n•\tHeld responsibility of complete testing of Session recovery & lawful intercept features by writing test cases & building automated test framework. \n•\tPlayed major role in upgrading infrastructure while feature enhancements & upcoming features. Software Engineer. Azingo Inc. July 2008  –  November 2008  (5 months) Software Engineer Intern Intel Corporation May 2013  – Present (2 years 4 months) Sacramento, California Area Software Engineer Intern Intel Corporation May 2013  – Present (2 years 4 months) Sacramento, California Area Graduate Student University of Texas at Dallas August 2012  – Present (3 years 1 month) Dallas/Fort Worth Area Graduate Student University of Texas at Dallas August 2012  – Present (3 years 1 month) Dallas/Fort Worth Area Software engineer II Cisco Systems December 2008  –  August 2012  (3 years 9 months) Pune (INDIA) Worked as automation infrastructure developer in Mobile Internet Technology Group.  \n•\tWorked & studied interfaces between MME, SGW, PGW, PCRF, HSS, AAA, LIServer, etc. \n•\tDeveloped automation infrastructure for combo-gateways (PGW+SGW, SAEGW). \n•\tReceived awards for efficiently handling Cisco ASR5500 project and developing efficient automation framework for “Inter chassis session recovery” (Redundancy feature) which saved >30% of running time. \n•\tHeld responsibility of complete testing of Session recovery & lawful intercept features by writing test cases & building automated test framework. \n•\tPlayed major role in upgrading infrastructure while feature enhancements & upcoming features. Software engineer II Cisco Systems December 2008  –  August 2012  (3 years 9 months) Pune (INDIA) Worked as automation infrastructure developer in Mobile Internet Technology Group.  \n•\tWorked & studied interfaces between MME, SGW, PGW, PCRF, HSS, AAA, LIServer, etc. \n•\tDeveloped automation infrastructure for combo-gateways (PGW+SGW, SAEGW). \n•\tReceived awards for efficiently handling Cisco ASR5500 project and developing efficient automation framework for “Inter chassis session recovery” (Redundancy feature) which saved >30% of running time. \n•\tHeld responsibility of complete testing of Session recovery & lawful intercept features by writing test cases & building automated test framework. \n•\tPlayed major role in upgrading infrastructure while feature enhancements & upcoming features. Software Engineer. Azingo Inc. July 2008  –  November 2008  (5 months) Software Engineer. Azingo Inc. July 2008  –  November 2008  (5 months) Skills LTE Automation TCP/IP TCL Unix C C++ Linux 3GPP Programming Java Multithreading Socket Programming Expect 4G Routing OSPF VLAN Python Test Automation Perl Shell Scripting See 7+     See less Skills  LTE Automation TCP/IP TCL Unix C C++ Linux 3GPP Programming Java Multithreading Socket Programming Expect 4G Routing OSPF VLAN Python Test Automation Perl Shell Scripting See 7+     See less LTE Automation TCP/IP TCL Unix C C++ Linux 3GPP Programming Java Multithreading Socket Programming Expect 4G Routing OSPF VLAN Python Test Automation Perl Shell Scripting See 7+     See less LTE Automation TCP/IP TCL Unix C C++ Linux 3GPP Programming Java Multithreading Socket Programming Expect 4G Routing OSPF VLAN Python Test Automation Perl Shell Scripting See 7+     See less Education Pune Institute of Computer Technology BE (Information Technology),  Date structures, Computer networks, Operating systems, Compilers, Databases, Information Retrieval, HCI 2004  – 2008 Activities and Societies:  Project exhibition organization team ,  C language competitions ,  Project exhibition. Pune Institute of Computer Technology BE (Information Technology),  Date structures, Computer networks, Operating systems, Compilers, Databases, Information Retrieval, HCI 2004  – 2008 Activities and Societies:  Project exhibition organization team ,  C language competitions ,  Project exhibition. Pune Institute of Computer Technology BE (Information Technology),  Date structures, Computer networks, Operating systems, Compilers, Databases, Information Retrieval, HCI 2004  – 2008 Activities and Societies:  Project exhibition organization team ,  C language competitions ,  Project exhibition. Pune Institute of Computer Technology BE (Information Technology),  Date structures, Computer networks, Operating systems, Compilers, Databases, Information Retrieval, HCI 2004  – 2008 Activities and Societies:  Project exhibition organization team ,  C language competitions ,  Project exhibition. ", "Experience Graphics Software Engineer Intern Intel Corporation January 2015  – Present (8 months) Software Engineer drawElements June 2013  –  August 2014  (1 year 3 months) Development of the drawElements Quality Program test suite for OpenGL ES 2.0/3.x and OpenCL. System Administrator Aalto University October 2012  –  May 2013  (8 months) Administration, support and development of tools and services. Software Engineer Vilant Systems Oy October 2006  –  April 2007  (7 months) Development of RFID and barcode applications for mobile user terminals and desktops using Visual C++ and web-based technologies. Graphics Software Engineer Intern Intel Corporation January 2015  – Present (8 months) Graphics Software Engineer Intern Intel Corporation January 2015  – Present (8 months) Software Engineer drawElements June 2013  –  August 2014  (1 year 3 months) Development of the drawElements Quality Program test suite for OpenGL ES 2.0/3.x and OpenCL. Software Engineer drawElements June 2013  –  August 2014  (1 year 3 months) Development of the drawElements Quality Program test suite for OpenGL ES 2.0/3.x and OpenCL. System Administrator Aalto University October 2012  –  May 2013  (8 months) Administration, support and development of tools and services. System Administrator Aalto University October 2012  –  May 2013  (8 months) Administration, support and development of tools and services. Software Engineer Vilant Systems Oy October 2006  –  April 2007  (7 months) Development of RFID and barcode applications for mobile user terminals and desktops using Visual C++ and web-based technologies. Software Engineer Vilant Systems Oy October 2006  –  April 2007  (7 months) Development of RFID and barcode applications for mobile user terminals and desktops using Visual C++ and web-based technologies. Languages Finnish Native or bilingual proficiency English Full professional proficiency Swedish Limited working proficiency German Elementary proficiency Finnish Native or bilingual proficiency English Full professional proficiency Swedish Limited working proficiency German Elementary proficiency Finnish Native or bilingual proficiency English Full professional proficiency Swedish Limited working proficiency German Elementary proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills C++ C Python Java Git OpenGL ES OpenGL OpenCL Linux Android Perl Visual Studio ZFS Puppet Linux KVM Skills  C++ C Python Java Git OpenGL ES OpenGL OpenCL Linux Android Perl Visual Studio ZFS Puppet Linux KVM C++ C Python Java Git OpenGL ES OpenGL OpenCL Linux Android Perl Visual Studio ZFS Puppet Linux KVM C++ C Python Java Git OpenGL ES OpenGL OpenCL Linux Android Perl Visual Studio ZFS Puppet Linux KVM Education Teknillinen korkeakoulu-Tekniska högskolan Computer Science 2005  – 2012 Activities and Societies:  Tietokilta ,  PRK Töölön yhteiskoulun lukio 2000  – 2004 Teknillinen korkeakoulu-Tekniska högskolan Computer Science 2005  – 2012 Activities and Societies:  Tietokilta ,  PRK Teknillinen korkeakoulu-Tekniska högskolan Computer Science 2005  – 2012 Activities and Societies:  Tietokilta ,  PRK Teknillinen korkeakoulu-Tekniska högskolan Computer Science 2005  – 2012 Activities and Societies:  Tietokilta ,  PRK Töölön yhteiskoulun lukio 2000  – 2004 Töölön yhteiskoulun lukio 2000  – 2004 Töölön yhteiskoulun lukio 2000  – 2004 Honors & Awards ", "Experience Wireless Charging Software Engineer Intern Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon •\tWrote unit tests for wireless charging firmware update application \n•\tDeveloped utility software to support developers to debug \n•\tValidated and debugged wireless charging firmware \n•\tVisual Studio 2013, C#, C, C++, WPF MVVM, XAML, DebugView and Google C++ testing framework \n \n Software Developer Intern WebMD Health Services June 2014  –  September 2014  (4 months) Portland, Oregon Area •\tDeveloped, maintained and enhanced software solution for company \n•\tWorked in an agile team with other developers and QA \n•\tInteracted closely with designer and product manager \n•\tVisual Studio 2012, C#, Javascript, SQL, HTML, CSS, LESS, Web form and MVC framework Accounting Intern Institute for Asian Study October 2012  –  April 2013  (7 months) Portland, Oregon Area •\tWorked with supervisor and other intern to record financial transaction.  \n•\tInstalled and customized a database application, FileMaker, for the organization. \n•\tIncreased 20% efficiency by customizing features of FileMaker to maintain tasks and projects. Wireless Charging Software Engineer Intern Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon •\tWrote unit tests for wireless charging firmware update application \n•\tDeveloped utility software to support developers to debug \n•\tValidated and debugged wireless charging firmware \n•\tVisual Studio 2013, C#, C, C++, WPF MVVM, XAML, DebugView and Google C++ testing framework \n \n Wireless Charging Software Engineer Intern Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon •\tWrote unit tests for wireless charging firmware update application \n•\tDeveloped utility software to support developers to debug \n•\tValidated and debugged wireless charging firmware \n•\tVisual Studio 2013, C#, C, C++, WPF MVVM, XAML, DebugView and Google C++ testing framework \n \n Software Developer Intern WebMD Health Services June 2014  –  September 2014  (4 months) Portland, Oregon Area •\tDeveloped, maintained and enhanced software solution for company \n•\tWorked in an agile team with other developers and QA \n•\tInteracted closely with designer and product manager \n•\tVisual Studio 2012, C#, Javascript, SQL, HTML, CSS, LESS, Web form and MVC framework Software Developer Intern WebMD Health Services June 2014  –  September 2014  (4 months) Portland, Oregon Area •\tDeveloped, maintained and enhanced software solution for company \n•\tWorked in an agile team with other developers and QA \n•\tInteracted closely with designer and product manager \n•\tVisual Studio 2012, C#, Javascript, SQL, HTML, CSS, LESS, Web form and MVC framework Accounting Intern Institute for Asian Study October 2012  –  April 2013  (7 months) Portland, Oregon Area •\tWorked with supervisor and other intern to record financial transaction.  \n•\tInstalled and customized a database application, FileMaker, for the organization. \n•\tIncreased 20% efficiency by customizing features of FileMaker to maintain tasks and projects. Accounting Intern Institute for Asian Study October 2012  –  April 2013  (7 months) Portland, Oregon Area •\tWorked with supervisor and other intern to record financial transaction.  \n•\tInstalled and customized a database application, FileMaker, for the organization. \n•\tIncreased 20% efficiency by customizing features of FileMaker to maintain tasks and projects. Languages Chinese Chinese Chinese Skills Microsoft SQL Server CSS Accounting Tax Tax Returns C# ASP.NET MVC HTML5 JavaScript LESS C++ Java WPF XAML Agile Methodologies Skills  Microsoft SQL Server CSS Accounting Tax Tax Returns C# ASP.NET MVC HTML5 JavaScript LESS C++ Java WPF XAML Agile Methodologies Microsoft SQL Server CSS Accounting Tax Tax Returns C# ASP.NET MVC HTML5 JavaScript LESS C++ Java WPF XAML Agile Methodologies Microsoft SQL Server CSS Accounting Tax Tax Returns C# ASP.NET MVC HTML5 JavaScript LESS C++ Java WPF XAML Agile Methodologies Education Portland State University Bachelor of Science,  Computer Science , 3.75 2013  – 2016 Portland State University Bachelor's Degree,  Accounting , 3.30 2008  – 2012 Portland State University Bachelor of Science,  Computer Science , 3.75 2013  – 2016 Portland State University Bachelor of Science,  Computer Science , 3.75 2013  – 2016 Portland State University Bachelor of Science,  Computer Science , 3.75 2013  – 2016 Portland State University Bachelor's Degree,  Accounting , 3.30 2008  – 2012 Portland State University Bachelor's Degree,  Accounting , 3.30 2008  – 2012 Portland State University Bachelor's Degree,  Accounting , 3.30 2008  – 2012 ", "Experience Undergraduate Lecture Assistant School of Mathematics, Georgia Institute of Technology August 2015  – Present (1 month) Undergraduate Lecture Assistant for MATH 1551 - Differential Calculus Security Software Engineer Intern Intel Corporation June 2015  –  August 2015  (3 months) Hillsboro, Oregon Undergraduate Lecture Assistant School of Mathematics, Georgia Institute of Technology August 2015  – Present (1 month) Undergraduate Lecture Assistant for MATH 1551 - Differential Calculus Undergraduate Lecture Assistant School of Mathematics, Georgia Institute of Technology August 2015  – Present (1 month) Undergraduate Lecture Assistant for MATH 1551 - Differential Calculus Security Software Engineer Intern Intel Corporation June 2015  –  August 2015  (3 months) Hillsboro, Oregon Security Software Engineer Intern Intel Corporation June 2015  –  August 2015  (3 months) Hillsboro, Oregon Skills Java C++ Python MySQL C Linux Software Development Software Engineering SQL Programming Microsoft Office JavaScript HTML Skills  Java C++ Python MySQL C Linux Software Development Software Engineering SQL Programming Microsoft Office JavaScript HTML Java C++ Python MySQL C Linux Software Development Software Engineering SQL Programming Microsoft Office JavaScript HTML Java C++ Python MySQL C Linux Software Development Software Engineering SQL Programming Microsoft Office JavaScript HTML Education Georgia Institute of Technology Bachelor's Degree,  Computer Science 2014  – 2018 PSBB Sr. Sec. School NGM, Chennai High School 2003  – 2014 High School Georgia Institute of Technology Bachelor's Degree,  Computer Science 2014  – 2018 Georgia Institute of Technology Bachelor's Degree,  Computer Science 2014  – 2018 Georgia Institute of Technology Bachelor's Degree,  Computer Science 2014  – 2018 PSBB Sr. Sec. School NGM, Chennai High School 2003  – 2014 High School PSBB Sr. Sec. School NGM, Chennai High School 2003  – 2014 High School PSBB Sr. Sec. School NGM, Chennai High School 2003  – 2014 High School ", "Summary Passionate about software development, algorithms, and user experience design.  \n \nSoftware by trade, entrepreneur at heart. \n \nSkills: Python, C#, HTML, CSS. \nLearning: C++, Django, JavaScript. Summary Passionate about software development, algorithms, and user experience design.  \n \nSoftware by trade, entrepreneur at heart. \n \nSkills: Python, C#, HTML, CSS. \nLearning: C++, Django, JavaScript. Passionate about software development, algorithms, and user experience design.  \n \nSoftware by trade, entrepreneur at heart. \n \nSkills: Python, C#, HTML, CSS. \nLearning: C++, Django, JavaScript. Passionate about software development, algorithms, and user experience design.  \n \nSoftware by trade, entrepreneur at heart. \n \nSkills: Python, C#, HTML, CSS. \nLearning: C++, Django, JavaScript. Experience Software Engineer Intel Corporation July 2015  – Present (2 months) United States Software Engineer Intern Intel Corporation January 2015  –  June 2015  (6 months) United States •\tImplemented file-testing functionalities on Android in C# and Java. \n•\tDeveloped web view functionalities such as visual graphs and tables using React.js and CSS. \n•\tImplemented a C# program that exports raw JSON data into excel format with nested tables and summary data for Bluetooth test reports. Web Developer Intern Daimler Trucks North America June 2014  –  December 2014  (7 months) Portland, Oregon Area •\tCreated an internal ASP.NET web application for claim and warranty tracking with user authentication.  \n•\tDocumented technical instructions and data mapping for every field against the database. \n•\tDeveloped a SSIS package to run queries on test runs to send error reports with email functionality. \n•\tModified stored procedures and an existing web application to allow more input options. \n•\tWorked directly with business clients to create software solutions to cater their needs. Marketing Assistant Professional and Continuing Education January 2014  –  June 2014  (6 months) Corvallis, Oregon Area •\tConverted potential prospects into students to fill a course of over 40 enrollees. \n•\tResearched market trends and created advertisements on LinkedIn and Facebook. \n•\tDeveloped data analysis spreadsheets based on advertisement performance. \n•\tCreated documentation and press releases for promoting new courses. Software Engineer Intern Intel Corporation July 2013  –  December 2013  (6 months) United States •\tCreated and maintained a test bed for Bluetooth driver quality testing. \n•\tDeveloped a scripting program to repair thousands of test scripts efficiently with a low margin of error.  \n•\tDocumented numerous tutorials for application installation and driver testing. Internal Coordinator Diversity Development September 2011  –  June 2013  (1 year 10 months) Oregon State University •\tSupervised 8 student workers for event production. \n•\tMaintained budget and transaction records for operation costs and running meetings.  \n•\tCommunicated with supervisors of other cultural centers to better serve the students. \n•\tPromoted from an office assistant position from the previous year. PROMISE Intern Extension and Experiment Station Communications June 2011  –  September 2011  (4 months) Oregon State University •\tCreated closed captioning projects in both English and Spanish to increase accessibility of multimedia projects in the OSU Extension.  \n•\tPrepared tutorial documentation and training materials along with delivering training to the entire publications team. Software Engineer Intel Corporation July 2015  – Present (2 months) United States Software Engineer Intel Corporation July 2015  – Present (2 months) United States Software Engineer Intern Intel Corporation January 2015  –  June 2015  (6 months) United States •\tImplemented file-testing functionalities on Android in C# and Java. \n•\tDeveloped web view functionalities such as visual graphs and tables using React.js and CSS. \n•\tImplemented a C# program that exports raw JSON data into excel format with nested tables and summary data for Bluetooth test reports. Software Engineer Intern Intel Corporation January 2015  –  June 2015  (6 months) United States •\tImplemented file-testing functionalities on Android in C# and Java. \n•\tDeveloped web view functionalities such as visual graphs and tables using React.js and CSS. \n•\tImplemented a C# program that exports raw JSON data into excel format with nested tables and summary data for Bluetooth test reports. Web Developer Intern Daimler Trucks North America June 2014  –  December 2014  (7 months) Portland, Oregon Area •\tCreated an internal ASP.NET web application for claim and warranty tracking with user authentication.  \n•\tDocumented technical instructions and data mapping for every field against the database. \n•\tDeveloped a SSIS package to run queries on test runs to send error reports with email functionality. \n•\tModified stored procedures and an existing web application to allow more input options. \n•\tWorked directly with business clients to create software solutions to cater their needs. Web Developer Intern Daimler Trucks North America June 2014  –  December 2014  (7 months) Portland, Oregon Area •\tCreated an internal ASP.NET web application for claim and warranty tracking with user authentication.  \n•\tDocumented technical instructions and data mapping for every field against the database. \n•\tDeveloped a SSIS package to run queries on test runs to send error reports with email functionality. \n•\tModified stored procedures and an existing web application to allow more input options. \n•\tWorked directly with business clients to create software solutions to cater their needs. Marketing Assistant Professional and Continuing Education January 2014  –  June 2014  (6 months) Corvallis, Oregon Area •\tConverted potential prospects into students to fill a course of over 40 enrollees. \n•\tResearched market trends and created advertisements on LinkedIn and Facebook. \n•\tDeveloped data analysis spreadsheets based on advertisement performance. \n•\tCreated documentation and press releases for promoting new courses. Marketing Assistant Professional and Continuing Education January 2014  –  June 2014  (6 months) Corvallis, Oregon Area •\tConverted potential prospects into students to fill a course of over 40 enrollees. \n•\tResearched market trends and created advertisements on LinkedIn and Facebook. \n•\tDeveloped data analysis spreadsheets based on advertisement performance. \n•\tCreated documentation and press releases for promoting new courses. Software Engineer Intern Intel Corporation July 2013  –  December 2013  (6 months) United States •\tCreated and maintained a test bed for Bluetooth driver quality testing. \n•\tDeveloped a scripting program to repair thousands of test scripts efficiently with a low margin of error.  \n•\tDocumented numerous tutorials for application installation and driver testing. Software Engineer Intern Intel Corporation July 2013  –  December 2013  (6 months) United States •\tCreated and maintained a test bed for Bluetooth driver quality testing. \n•\tDeveloped a scripting program to repair thousands of test scripts efficiently with a low margin of error.  \n•\tDocumented numerous tutorials for application installation and driver testing. Internal Coordinator Diversity Development September 2011  –  June 2013  (1 year 10 months) Oregon State University •\tSupervised 8 student workers for event production. \n•\tMaintained budget and transaction records for operation costs and running meetings.  \n•\tCommunicated with supervisors of other cultural centers to better serve the students. \n•\tPromoted from an office assistant position from the previous year. Internal Coordinator Diversity Development September 2011  –  June 2013  (1 year 10 months) Oregon State University •\tSupervised 8 student workers for event production. \n•\tMaintained budget and transaction records for operation costs and running meetings.  \n•\tCommunicated with supervisors of other cultural centers to better serve the students. \n•\tPromoted from an office assistant position from the previous year. PROMISE Intern Extension and Experiment Station Communications June 2011  –  September 2011  (4 months) Oregon State University •\tCreated closed captioning projects in both English and Spanish to increase accessibility of multimedia projects in the OSU Extension.  \n•\tPrepared tutorial documentation and training materials along with delivering training to the entire publications team. PROMISE Intern Extension and Experiment Station Communications June 2011  –  September 2011  (4 months) Oregon State University •\tCreated closed captioning projects in both English and Spanish to increase accessibility of multimedia projects in the OSU Extension.  \n•\tPrepared tutorial documentation and training materials along with delivering training to the entire publications team. Languages English Native or bilingual proficiency Tibetan Native or bilingual proficiency English Native or bilingual proficiency Tibetan Native or bilingual proficiency English Native or bilingual proficiency Tibetan Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Time Management Teamwork Leadership Public Speaking C# Software Documentation Social Media SQL Web Development Data Analysis Databases Critical Thinking Algorithms User Experience Design Entrepreneurship JavaScript iOS Development C++ Python See 4+     See less Skills  Time Management Teamwork Leadership Public Speaking C# Software Documentation Social Media SQL Web Development Data Analysis Databases Critical Thinking Algorithms User Experience Design Entrepreneurship JavaScript iOS Development C++ Python See 4+     See less Time Management Teamwork Leadership Public Speaking C# Software Documentation Social Media SQL Web Development Data Analysis Databases Critical Thinking Algorithms User Experience Design Entrepreneurship JavaScript iOS Development C++ Python See 4+     See less Time Management Teamwork Leadership Public Speaking C# Software Documentation Social Media SQL Web Development Data Analysis Databases Critical Thinking Algorithms User Experience Design Entrepreneurship JavaScript iOS Development C++ Python See 4+     See less Education Oregon State University Bachelors of Science,  Information Systems , 3.71 2009  – 2014 Oregon State University Bachelor of Business Administration (B.B.A.) 2009  – 2014 Oregon State University Bachelors of Science,  Information Systems , 3.71 2009  – 2014 Oregon State University Bachelors of Science,  Information Systems , 3.71 2009  – 2014 Oregon State University Bachelors of Science,  Information Systems , 3.71 2009  – 2014 Oregon State University Bachelor of Business Administration (B.B.A.) 2009  – 2014 Oregon State University Bachelor of Business Administration (B.B.A.) 2009  – 2014 Oregon State University Bachelor of Business Administration (B.B.A.) 2009  – 2014 Honors & Awards Dean's List College of Business June 2014 Educational Opportunities Alumni Scholarship Educational Opportunities Program May 2013 Doris Whalen Memorial Scholarship College of Business May 2012 Study Abroad Scholarship Dongbei University of Finance and Economics. August 2011 Dean's List College of Business June 2014 Dean's List College of Business June 2014 Dean's List College of Business June 2014 Educational Opportunities Alumni Scholarship Educational Opportunities Program May 2013 Educational Opportunities Alumni Scholarship Educational Opportunities Program May 2013 Educational Opportunities Alumni Scholarship Educational Opportunities Program May 2013 Doris Whalen Memorial Scholarship College of Business May 2012 Doris Whalen Memorial Scholarship College of Business May 2012 Doris Whalen Memorial Scholarship College of Business May 2012 Study Abroad Scholarship Dongbei University of Finance and Economics. August 2011 Study Abroad Scholarship Dongbei University of Finance and Economics. August 2011 Study Abroad Scholarship Dongbei University of Finance and Economics. August 2011 ", "Summary Seeking a challenging full time position in the field of Software Development. \nAvailability: January '16 \n \nSkills:  \nProgramming Languages: C++, JAVA, C#, Python, Haskell \nDataBase: SQL Server, MySQL, NoSQL \nWeb Technologies: ASP .Net, PHP, HTML, AJAX toolkit, JavaScript \nApplication Software: Eclipse, J-Unit, Code blocks, X-code, Visual Studio, Rational Rose, UML, git \n \n Summary Seeking a challenging full time position in the field of Software Development. \nAvailability: January '16 \n \nSkills:  \nProgramming Languages: C++, JAVA, C#, Python, Haskell \nDataBase: SQL Server, MySQL, NoSQL \nWeb Technologies: ASP .Net, PHP, HTML, AJAX toolkit, JavaScript \nApplication Software: Eclipse, J-Unit, Code blocks, X-code, Visual Studio, Rational Rose, UML, git \n \n Seeking a challenging full time position in the field of Software Development. \nAvailability: January '16 \n \nSkills:  \nProgramming Languages: C++, JAVA, C#, Python, Haskell \nDataBase: SQL Server, MySQL, NoSQL \nWeb Technologies: ASP .Net, PHP, HTML, AJAX toolkit, JavaScript \nApplication Software: Eclipse, J-Unit, Code blocks, X-code, Visual Studio, Rational Rose, UML, git \n \n Seeking a challenging full time position in the field of Software Development. \nAvailability: January '16 \n \nSkills:  \nProgramming Languages: C++, JAVA, C#, Python, Haskell \nDataBase: SQL Server, MySQL, NoSQL \nWeb Technologies: ASP .Net, PHP, HTML, AJAX toolkit, JavaScript \nApplication Software: Eclipse, J-Unit, Code blocks, X-code, Visual Studio, Rational Rose, UML, git \n \n Experience Research Assistant Rochester Institute of Technology August 2015  – Present (1 month) Computer Lab Assistant Rochester Institute of Technology January 2015  – Present (8 months) Rochester, New York Area - Monitor computer labs and usage of equipment in labs \n- Assist students with troubleshooting computer problems\u2028 \n- Ensure students and faculty have a comfortable experience in the labs Graphics Software Engineer - Intern Intel Corporation June 2015  –  August 2015  (3 months) Phoenix, Arizona Area - Working with VPG - Content Protection team on graphics driver development: design and develop a module to unify the process of initiating communication with Manageability Engine (ME) to carry out PAVP (Protected Audio Video Path) session and WiDi (Wireless Display) sessions, across Android and Windows operating systems.  \n \n- Developed a Clang formatting tool, both on Linux and Windows to interact with Perforce, to format the source code across the CP team. Software Development Intern Exa Corporation May 2014  –  January 2015  (9 months) Boston Developed a graphing module for PowerINSIGHT, to display the simulation results of the wind drag/lift on an automobile, allowing users to compare multiple such results. The application was developed in such a way that it maintained backward compatibility with all the previous versions of the simulation result files.  \nTechnologies used: C++, Qt, XML, Python, Gdb, Open Package Conventions. Assistant System Engineer Tata Consultancy Services March 2013  –  August 2013  (6 months) Mumbai Area, India Developed a web based inventory storage management system for TESCO shopping mart. The project was developed in factory pattern, with front end developed using .Net framework, AJAX toolkit and Java script along with SQL server and C# for designing back end. \n Intern A.T.E.Enterprises Pvt.Ltd. September 2012  –  December 2012  (4 months) Mumbai Area, India Developed an optimization plan for the company's website thus improving the rank in search engine using techniques like keyword Research, Google Analytics, Meta tag generators, URL rewrites. Research Assistant Rochester Institute of Technology August 2015  – Present (1 month) Research Assistant Rochester Institute of Technology August 2015  – Present (1 month) Computer Lab Assistant Rochester Institute of Technology January 2015  – Present (8 months) Rochester, New York Area - Monitor computer labs and usage of equipment in labs \n- Assist students with troubleshooting computer problems\u2028 \n- Ensure students and faculty have a comfortable experience in the labs Computer Lab Assistant Rochester Institute of Technology January 2015  – Present (8 months) Rochester, New York Area - Monitor computer labs and usage of equipment in labs \n- Assist students with troubleshooting computer problems\u2028 \n- Ensure students and faculty have a comfortable experience in the labs Graphics Software Engineer - Intern Intel Corporation June 2015  –  August 2015  (3 months) Phoenix, Arizona Area - Working with VPG - Content Protection team on graphics driver development: design and develop a module to unify the process of initiating communication with Manageability Engine (ME) to carry out PAVP (Protected Audio Video Path) session and WiDi (Wireless Display) sessions, across Android and Windows operating systems.  \n \n- Developed a Clang formatting tool, both on Linux and Windows to interact with Perforce, to format the source code across the CP team. Graphics Software Engineer - Intern Intel Corporation June 2015  –  August 2015  (3 months) Phoenix, Arizona Area - Working with VPG - Content Protection team on graphics driver development: design and develop a module to unify the process of initiating communication with Manageability Engine (ME) to carry out PAVP (Protected Audio Video Path) session and WiDi (Wireless Display) sessions, across Android and Windows operating systems.  \n \n- Developed a Clang formatting tool, both on Linux and Windows to interact with Perforce, to format the source code across the CP team. Software Development Intern Exa Corporation May 2014  –  January 2015  (9 months) Boston Developed a graphing module for PowerINSIGHT, to display the simulation results of the wind drag/lift on an automobile, allowing users to compare multiple such results. The application was developed in such a way that it maintained backward compatibility with all the previous versions of the simulation result files.  \nTechnologies used: C++, Qt, XML, Python, Gdb, Open Package Conventions. Software Development Intern Exa Corporation May 2014  –  January 2015  (9 months) Boston Developed a graphing module for PowerINSIGHT, to display the simulation results of the wind drag/lift on an automobile, allowing users to compare multiple such results. The application was developed in such a way that it maintained backward compatibility with all the previous versions of the simulation result files.  \nTechnologies used: C++, Qt, XML, Python, Gdb, Open Package Conventions. Assistant System Engineer Tata Consultancy Services March 2013  –  August 2013  (6 months) Mumbai Area, India Developed a web based inventory storage management system for TESCO shopping mart. The project was developed in factory pattern, with front end developed using .Net framework, AJAX toolkit and Java script along with SQL server and C# for designing back end. \n Assistant System Engineer Tata Consultancy Services March 2013  –  August 2013  (6 months) Mumbai Area, India Developed a web based inventory storage management system for TESCO shopping mart. The project was developed in factory pattern, with front end developed using .Net framework, AJAX toolkit and Java script along with SQL server and C# for designing back end. \n Intern A.T.E.Enterprises Pvt.Ltd. September 2012  –  December 2012  (4 months) Mumbai Area, India Developed an optimization plan for the company's website thus improving the rank in search engine using techniques like keyword Research, Google Analytics, Meta tag generators, URL rewrites. Intern A.T.E.Enterprises Pvt.Ltd. September 2012  –  December 2012  (4 months) Mumbai Area, India Developed an optimization plan for the company's website thus improving the rank in search engine using techniques like keyword Research, Google Analytics, Meta tag generators, URL rewrites. Languages English Full professional proficiency Hindi Full professional proficiency Marathi Full professional proficiency Sanskrit Elementary proficiency English Full professional proficiency Hindi Full professional proficiency Marathi Full professional proficiency Sanskrit Elementary proficiency English Full professional proficiency Hindi Full professional proficiency Marathi Full professional proficiency Sanskrit Elementary proficiency Full professional proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills C++ Java OOP HTML JavaScript .NET Eclipse Software Engineering Microsoft SQL Server Python XML PHP Software Development AJAX .NET Framework Visual C# AJAX Toolkit Team Foundation Server Rational Rose 2000 JFLAP WAMP Server Emacs CodeBlocks TFS Multithreading Open Package Convention Qty JUnit Functional Programming Haskell Minitab Weka Google Refine See 18+     See less Skills  C++ Java OOP HTML JavaScript .NET Eclipse Software Engineering Microsoft SQL Server Python XML PHP Software Development AJAX .NET Framework Visual C# AJAX Toolkit Team Foundation Server Rational Rose 2000 JFLAP WAMP Server Emacs CodeBlocks TFS Multithreading Open Package Convention Qty JUnit Functional Programming Haskell Minitab Weka Google Refine See 18+     See less C++ Java OOP HTML JavaScript .NET Eclipse Software Engineering Microsoft SQL Server Python XML PHP Software Development AJAX .NET Framework Visual C# AJAX Toolkit Team Foundation Server Rational Rose 2000 JFLAP WAMP Server Emacs CodeBlocks TFS Multithreading Open Package Convention Qty JUnit Functional Programming Haskell Minitab Weka Google Refine See 18+     See less C++ Java OOP HTML JavaScript .NET Eclipse Software Engineering Microsoft SQL Server Python XML PHP Software Development AJAX .NET Framework Visual C# AJAX Toolkit Team Foundation Server Rational Rose 2000 JFLAP WAMP Server Emacs CodeBlocks TFS Multithreading Open Package Convention Qty JUnit Functional Programming Haskell Minitab Weka Google Refine See 18+     See less Education Rochester Institute of Technology Master's degree,  Computer Science , GPA: 3.76 / 4.0 2013  – 2015 University of Mumbai Bachelor of Engineering (B.E.),  Computer Science , First Class with Distinction 2008  – 2012 Activities and Societies:  Association for Computing Machinery ,  Computer Society of India R.D National College H.S.C,  Computer Science , First Class with Distinction 2006  – 2008 I.E.S Modern English School S.S.C,  General Studies 2000  – 2006 Activities and Societies:  Sanksrit - Amarkosh Rochester Institute of Technology Master's degree,  Computer Science , GPA: 3.76 / 4.0 2013  – 2015 Rochester Institute of Technology Master's degree,  Computer Science , GPA: 3.76 / 4.0 2013  – 2015 Rochester Institute of Technology Master's degree,  Computer Science , GPA: 3.76 / 4.0 2013  – 2015 University of Mumbai Bachelor of Engineering (B.E.),  Computer Science , First Class with Distinction 2008  – 2012 Activities and Societies:  Association for Computing Machinery ,  Computer Society of India University of Mumbai Bachelor of Engineering (B.E.),  Computer Science , First Class with Distinction 2008  – 2012 Activities and Societies:  Association for Computing Machinery ,  Computer Society of India University of Mumbai Bachelor of Engineering (B.E.),  Computer Science , First Class with Distinction 2008  – 2012 Activities and Societies:  Association for Computing Machinery ,  Computer Society of India R.D National College H.S.C,  Computer Science , First Class with Distinction 2006  – 2008 R.D National College H.S.C,  Computer Science , First Class with Distinction 2006  – 2008 R.D National College H.S.C,  Computer Science , First Class with Distinction 2006  – 2008 I.E.S Modern English School S.S.C,  General Studies 2000  – 2006 Activities and Societies:  Sanksrit - Amarkosh I.E.S Modern English School S.S.C,  General Studies 2000  – 2006 Activities and Societies:  Sanksrit - Amarkosh I.E.S Modern English School S.S.C,  General Studies 2000  – 2006 Activities and Societies:  Sanksrit - Amarkosh Honors & Awards Graduate Student Scholorship August 2013 First place in Table Tennis (Singles), VPECS February 2012 Secured First place in Table Tennis(Singles) in VPECS,an intra college tournament organized by Electronics Department at PVPPCOE. \n Graduate Student Scholorship August 2013 Graduate Student Scholorship August 2013 Graduate Student Scholorship August 2013 First place in Table Tennis (Singles), VPECS February 2012 Secured First place in Table Tennis(Singles) in VPECS,an intra college tournament organized by Electronics Department at PVPPCOE. \n First place in Table Tennis (Singles), VPECS February 2012 Secured First place in Table Tennis(Singles) in VPECS,an intra college tournament organized by Electronics Department at PVPPCOE. \n First place in Table Tennis (Singles), VPECS February 2012 Secured First place in Table Tennis(Singles) in VPECS,an intra college tournament organized by Electronics Department at PVPPCOE. \n ", "Experience Senior Software Engineer UCloud November 2014  –  June 2015  (8 months) Shanghai City, China Software Engineer Intel Corporation April 2011  –  July 2014  (3 years 4 months) Software Engineer (Intern) Intel Corporation January 2011  –  March 2011  (3 months) Software Engineer(Intern) Tencent July 2010  –  September 2010  (3 months) Software Engineer (Intern) Intel Corporation January 2010  –  June 2010  (6 months) Senior Software Engineer UCloud November 2014  –  June 2015  (8 months) Shanghai City, China Senior Software Engineer UCloud November 2014  –  June 2015  (8 months) Shanghai City, China Software Engineer Intel Corporation April 2011  –  July 2014  (3 years 4 months) Software Engineer Intel Corporation April 2011  –  July 2014  (3 years 4 months) Software Engineer (Intern) Intel Corporation January 2011  –  March 2011  (3 months) Software Engineer (Intern) Intel Corporation January 2011  –  March 2011  (3 months) Software Engineer(Intern) Tencent July 2010  –  September 2010  (3 months) Software Engineer(Intern) Tencent July 2010  –  September 2010  (3 months) Software Engineer (Intern) Intel Corporation January 2010  –  June 2010  (6 months) Software Engineer (Intern) Intel Corporation January 2010  –  June 2010  (6 months) Skills Linux Multithreading Algorithms Debugging Virtualization C/C++ STL TCP/IP stack Design Patterns Open Source NoSQL Redis Distributed Systems Memcached Docker MongoDB Skills  Linux Multithreading Algorithms Debugging Virtualization C/C++ STL TCP/IP stack Design Patterns Open Source NoSQL Redis Distributed Systems Memcached Docker MongoDB Linux Multithreading Algorithms Debugging Virtualization C/C++ STL TCP/IP stack Design Patterns Open Source NoSQL Redis Distributed Systems Memcached Docker MongoDB Linux Multithreading Algorithms Debugging Virtualization C/C++ STL TCP/IP stack Design Patterns Open Source NoSQL Redis Distributed Systems Memcached Docker MongoDB Education Shanghai Jiao Tong University Master of Engineering (M.Eng.),  Computer Science Shanghai Jiao Tong University Master of Engineering (M.Eng.),  Computer Science Shanghai Jiao Tong University Master of Engineering (M.Eng.),  Computer Science Shanghai Jiao Tong University Master of Engineering (M.Eng.),  Computer Science ", "Summary With a 4.5 years experience in web development, I consider myself to be a true Web enthusiast and as such would love the opportunity to work in a fast-paced challenging team environment that combines my passion for the web with my core technical skills. \n \nSpecialties:  \n• Programming Languages:\tC, C++, Core Java \n• Web Technologies:\tJSP, HTML, CSS, DHTML, XML, JavaScript, AJAX, JQUERY \n• Database: MySQL \n• Frameworks: Android, Struts, Spring, Hibernate, CakePHP \n• Web Services:\tREST \n• Servers: Apache Tomcat, JBoss Server \n• Library: Yahoo User Interface Library (YUI), JPivot \n• Tools: Eclipse, Spring tool Suite, Macromedia Dream Weaver, CVS, SVN,  \n• Operating Systems:\tMicrosoft Windows, UNIX Summary With a 4.5 years experience in web development, I consider myself to be a true Web enthusiast and as such would love the opportunity to work in a fast-paced challenging team environment that combines my passion for the web with my core technical skills. \n \nSpecialties:  \n• Programming Languages:\tC, C++, Core Java \n• Web Technologies:\tJSP, HTML, CSS, DHTML, XML, JavaScript, AJAX, JQUERY \n• Database: MySQL \n• Frameworks: Android, Struts, Spring, Hibernate, CakePHP \n• Web Services:\tREST \n• Servers: Apache Tomcat, JBoss Server \n• Library: Yahoo User Interface Library (YUI), JPivot \n• Tools: Eclipse, Spring tool Suite, Macromedia Dream Weaver, CVS, SVN,  \n• Operating Systems:\tMicrosoft Windows, UNIX With a 4.5 years experience in web development, I consider myself to be a true Web enthusiast and as such would love the opportunity to work in a fast-paced challenging team environment that combines my passion for the web with my core technical skills. \n \nSpecialties:  \n• Programming Languages:\tC, C++, Core Java \n• Web Technologies:\tJSP, HTML, CSS, DHTML, XML, JavaScript, AJAX, JQUERY \n• Database: MySQL \n• Frameworks: Android, Struts, Spring, Hibernate, CakePHP \n• Web Services:\tREST \n• Servers: Apache Tomcat, JBoss Server \n• Library: Yahoo User Interface Library (YUI), JPivot \n• Tools: Eclipse, Spring tool Suite, Macromedia Dream Weaver, CVS, SVN,  \n• Operating Systems:\tMicrosoft Windows, UNIX With a 4.5 years experience in web development, I consider myself to be a true Web enthusiast and as such would love the opportunity to work in a fast-paced challenging team environment that combines my passion for the web with my core technical skills. \n \nSpecialties:  \n• Programming Languages:\tC, C++, Core Java \n• Web Technologies:\tJSP, HTML, CSS, DHTML, XML, JavaScript, AJAX, JQUERY \n• Database: MySQL \n• Frameworks: Android, Struts, Spring, Hibernate, CakePHP \n• Web Services:\tREST \n• Servers: Apache Tomcat, JBoss Server \n• Library: Yahoo User Interface Library (YUI), JPivot \n• Tools: Eclipse, Spring tool Suite, Macromedia Dream Weaver, CVS, SVN,  \n• Operating Systems:\tMicrosoft Windows, UNIX Experience Software Engineer Intern Intel Corporation February 2015  – Present (7 months) Software Engineer Intern VSS Monitoring June 2014  –  August 2014  (3 months) sunnyvale, california •Enhancement on existing vBroker product giving User Flexibility to select slower but more secure or fast but less secure SSH. \n•Developed CLI and XML commands for new feature named vIndex for vSpool Product. Software Development Engineer McAfee(Acquired by Intel Corporation) July 2008  –  December 2011  (3 years 6 months) Pune Area, India • Designed and developed modules in Data Loss Prevention Discover using Java, Struts, Hibernate and MySQL. \n• Designed, implemented and documented Data Classification feature for Network DLP.  \n• Enhanced existing NDLP User Interface and implemented Asynchronous events using YAHOO UI Library. \n \nAchievement: \n• Filed for a PATENT on “SYSTEM AND METHOD FOR PROVIDING DATA PROTECTIONS WORKFLOWS IN A NETWORK ENVIRONMENT” in McAfee. Software Engineer Codewalla Studios April 2007  –  June 2008  (1 year 3 months) Pune Area, India 1. Responsible for requirement gathering, Product design and Development. Writing Unit Test \n2. Design and developed Website for Mexico Film Industry (http://www.crewnewmexico.com/). \n3. Enhanced existing online TV guide Site allowing users to search Channel programs. \n4. Added new features in Mobile Advertising Site using CakePhp \n5. Proivded an Enhancement for click per action for different advertisement slots. Software Engineer Intern Intel Corporation February 2015  – Present (7 months) Software Engineer Intern Intel Corporation February 2015  – Present (7 months) Software Engineer Intern VSS Monitoring June 2014  –  August 2014  (3 months) sunnyvale, california •Enhancement on existing vBroker product giving User Flexibility to select slower but more secure or fast but less secure SSH. \n•Developed CLI and XML commands for new feature named vIndex for vSpool Product. Software Engineer Intern VSS Monitoring June 2014  –  August 2014  (3 months) sunnyvale, california •Enhancement on existing vBroker product giving User Flexibility to select slower but more secure or fast but less secure SSH. \n•Developed CLI and XML commands for new feature named vIndex for vSpool Product. Software Development Engineer McAfee(Acquired by Intel Corporation) July 2008  –  December 2011  (3 years 6 months) Pune Area, India • Designed and developed modules in Data Loss Prevention Discover using Java, Struts, Hibernate and MySQL. \n• Designed, implemented and documented Data Classification feature for Network DLP.  \n• Enhanced existing NDLP User Interface and implemented Asynchronous events using YAHOO UI Library. \n \nAchievement: \n• Filed for a PATENT on “SYSTEM AND METHOD FOR PROVIDING DATA PROTECTIONS WORKFLOWS IN A NETWORK ENVIRONMENT” in McAfee. Software Development Engineer McAfee(Acquired by Intel Corporation) July 2008  –  December 2011  (3 years 6 months) Pune Area, India • Designed and developed modules in Data Loss Prevention Discover using Java, Struts, Hibernate and MySQL. \n• Designed, implemented and documented Data Classification feature for Network DLP.  \n• Enhanced existing NDLP User Interface and implemented Asynchronous events using YAHOO UI Library. \n \nAchievement: \n• Filed for a PATENT on “SYSTEM AND METHOD FOR PROVIDING DATA PROTECTIONS WORKFLOWS IN A NETWORK ENVIRONMENT” in McAfee. Software Engineer Codewalla Studios April 2007  –  June 2008  (1 year 3 months) Pune Area, India 1. Responsible for requirement gathering, Product design and Development. Writing Unit Test \n2. Design and developed Website for Mexico Film Industry (http://www.crewnewmexico.com/). \n3. Enhanced existing online TV guide Site allowing users to search Channel programs. \n4. Added new features in Mobile Advertising Site using CakePhp \n5. Proivded an Enhancement for click per action for different advertisement slots. Software Engineer Codewalla Studios April 2007  –  June 2008  (1 year 3 months) Pune Area, India 1. Responsible for requirement gathering, Product design and Development. Writing Unit Test \n2. Design and developed Website for Mexico Film Industry (http://www.crewnewmexico.com/). \n3. Enhanced existing online TV guide Site allowing users to search Channel programs. \n4. Added new features in Mobile Advertising Site using CakePhp \n5. Proivded an Enhancement for click per action for different advertisement slots. Languages English Marathi Hindi English Marathi Hindi English Marathi Hindi Skills Hibernate MySQL HTML Spring JavaScript Java AJAX JSP Struts Servlets Eclipse Core Java J2EE Java Enterprise Edition Design Patterns Web Development Software Development Spring Framework See 3+     See less Skills  Hibernate MySQL HTML Spring JavaScript Java AJAX JSP Struts Servlets Eclipse Core Java J2EE Java Enterprise Edition Design Patterns Web Development Software Development Spring Framework See 3+     See less Hibernate MySQL HTML Spring JavaScript Java AJAX JSP Struts Servlets Eclipse Core Java J2EE Java Enterprise Edition Design Patterns Web Development Software Development Spring Framework See 3+     See less Hibernate MySQL HTML Spring JavaScript Java AJAX JSP Struts Servlets Eclipse Core Java J2EE Java Enterprise Edition Design Patterns Web Development Software Development Spring Framework See 3+     See less Education California State University-Sacramento Master's degree,  Computer Science 2013  – 2015 University of Pune B.E,  Computer 2002  – 2006 California State University-Sacramento Master's degree,  Computer Science 2013  – 2015 California State University-Sacramento Master's degree,  Computer Science 2013  – 2015 California State University-Sacramento Master's degree,  Computer Science 2013  – 2015 University of Pune B.E,  Computer 2002  – 2006 University of Pune B.E,  Computer 2002  – 2006 University of Pune B.E,  Computer 2002  – 2006 ", "Experience Co-Founder - Head of Technology & Engineering HipVan February 2013  – Present (2 years 7 months) Singapore HipVan is an online store for great designs. We're looking for Software Engineers/Senior Software Engineers in Ho Chi Minh City, Vietnam to join our team and build an awesome ecommerce platform. \n \nhttp://hipvan.com \n \nWe're using Ruby on Rails and Go for our platform. Technical Consultant Lazada Group January 2013  –  October 2013  (10 months) Vietnam Head of Software Development Zalora Group January 2012  –  December 2012  (1 year) Singapore Software Development Engineer Amazon.com June 2007  –  December 2011  (4 years 7 months) Greater Seattle Area Software Engineer Intern Indeed.com September 2006  –  December 2006  (4 months) Austin, Texas Area Software Development Engineer Intern Expedia June 2006  –  August 2006  (3 months) Bellevue, WA Software Engineer Intern Intel Corporation September 2005  –  December 2005  (4 months) Austin, Texas Area Software Engineer Intern IBM June 2005  –  August 2005  (3 months) Austin, Texas Area Software Engineer Intern Intel Corporation September 2004  –  December 2004  (4 months) Chandler, Arizona Software Engineer Intern IBM May 2004  –  August 2004  (4 months) Phoenix, Arizona Area Software Engineer Intern Journyx, Inc February 2004  –  May 2004  (4 months) Austin, Texas Area Co-Founder - Head of Technology & Engineering HipVan February 2013  – Present (2 years 7 months) Singapore HipVan is an online store for great designs. We're looking for Software Engineers/Senior Software Engineers in Ho Chi Minh City, Vietnam to join our team and build an awesome ecommerce platform. \n \nhttp://hipvan.com \n \nWe're using Ruby on Rails and Go for our platform. Co-Founder - Head of Technology & Engineering HipVan February 2013  – Present (2 years 7 months) Singapore HipVan is an online store for great designs. We're looking for Software Engineers/Senior Software Engineers in Ho Chi Minh City, Vietnam to join our team and build an awesome ecommerce platform. \n \nhttp://hipvan.com \n \nWe're using Ruby on Rails and Go for our platform. Technical Consultant Lazada Group January 2013  –  October 2013  (10 months) Vietnam Technical Consultant Lazada Group January 2013  –  October 2013  (10 months) Vietnam Head of Software Development Zalora Group January 2012  –  December 2012  (1 year) Singapore Head of Software Development Zalora Group January 2012  –  December 2012  (1 year) Singapore Software Development Engineer Amazon.com June 2007  –  December 2011  (4 years 7 months) Greater Seattle Area Software Development Engineer Amazon.com June 2007  –  December 2011  (4 years 7 months) Greater Seattle Area Software Engineer Intern Indeed.com September 2006  –  December 2006  (4 months) Austin, Texas Area Software Engineer Intern Indeed.com September 2006  –  December 2006  (4 months) Austin, Texas Area Software Development Engineer Intern Expedia June 2006  –  August 2006  (3 months) Bellevue, WA Software Development Engineer Intern Expedia June 2006  –  August 2006  (3 months) Bellevue, WA Software Engineer Intern Intel Corporation September 2005  –  December 2005  (4 months) Austin, Texas Area Software Engineer Intern Intel Corporation September 2005  –  December 2005  (4 months) Austin, Texas Area Software Engineer Intern IBM June 2005  –  August 2005  (3 months) Austin, Texas Area Software Engineer Intern IBM June 2005  –  August 2005  (3 months) Austin, Texas Area Software Engineer Intern Intel Corporation September 2004  –  December 2004  (4 months) Chandler, Arizona Software Engineer Intern Intel Corporation September 2004  –  December 2004  (4 months) Chandler, Arizona Software Engineer Intern IBM May 2004  –  August 2004  (4 months) Phoenix, Arizona Area Software Engineer Intern IBM May 2004  –  August 2004  (4 months) Phoenix, Arizona Area Software Engineer Intern Journyx, Inc February 2004  –  May 2004  (4 months) Austin, Texas Area Software Engineer Intern Journyx, Inc February 2004  –  May 2004  (4 months) Austin, Texas Area Languages Vietnamese Native or bilingual proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Git Ruby on Rails Python JavaScript Java OOP Ruby jQuery Agile Methodologies E-commerce SQL Scrum Web Applications Redis Objective-C Amazon Web Services... iOS development Scalability Distributed Systems See 4+     See less Skills  Git Ruby on Rails Python JavaScript Java OOP Ruby jQuery Agile Methodologies E-commerce SQL Scrum Web Applications Redis Objective-C Amazon Web Services... iOS development Scalability Distributed Systems See 4+     See less Git Ruby on Rails Python JavaScript Java OOP Ruby jQuery Agile Methodologies E-commerce SQL Scrum Web Applications Redis Objective-C Amazon Web Services... iOS development Scalability Distributed Systems See 4+     See less Git Ruby on Rails Python JavaScript Java OOP Ruby jQuery Agile Methodologies E-commerce SQL Scrum Web Applications Redis Objective-C Amazon Web Services... iOS development Scalability Distributed Systems See 4+     See less Education The University of Texas at Austin Bachelor of Science,  Computer Science 2007 The University of Texas at Austin Bachelor of Science,  Computer Science 2007 The University of Texas at Austin Bachelor of Science,  Computer Science 2007 The University of Texas at Austin Bachelor of Science,  Computer Science 2007 ", "Summary \"Know something about everything-rather than everything about something\"​ \nThat's one of the motto's I try to live by. At least in the software engineering industry. That also forms the core of my experience in the same. \nThroughout my 4+ years in the industry, I have been involved right from requirements gathering from potential clients, budget estimation, software design and development, configuration management and release, manual testing, and test automation. \nI have been called a jack of all trades. While some may argue that that's not quite desirable, I believe , with this all-round knowledge of the SDLC, I can bring more value into any project that I carry out. \n \nI started out in game porting and moved through quite a few technology. I've also worked on BREW(which I believe is extinct now). Most of my initial career was spent in SCM and release engineering after which I moved to software development. \nI've dabbled in android a bit and more recently , in grad school,I am trying to educate myself on web development using the MEAN stack(Its a work in progress). \nI have been fascinated with Big Data and that would probably be my next destination. \n \nIn grad school, going to hackathons kind of became a hobby. It wasn't what you made, but what you learnt from it that excited me the most. I learnt a lot from it, and I still carry fond memories of the sleepless nights stringing together code that would just about work in the morning!  \n \nLooking forward to much more of those in my final semester in Spring 2016! Summary \"Know something about everything-rather than everything about something\"​ \nThat's one of the motto's I try to live by. At least in the software engineering industry. That also forms the core of my experience in the same. \nThroughout my 4+ years in the industry, I have been involved right from requirements gathering from potential clients, budget estimation, software design and development, configuration management and release, manual testing, and test automation. \nI have been called a jack of all trades. While some may argue that that's not quite desirable, I believe , with this all-round knowledge of the SDLC, I can bring more value into any project that I carry out. \n \nI started out in game porting and moved through quite a few technology. I've also worked on BREW(which I believe is extinct now). Most of my initial career was spent in SCM and release engineering after which I moved to software development. \nI've dabbled in android a bit and more recently , in grad school,I am trying to educate myself on web development using the MEAN stack(Its a work in progress). \nI have been fascinated with Big Data and that would probably be my next destination. \n \nIn grad school, going to hackathons kind of became a hobby. It wasn't what you made, but what you learnt from it that excited me the most. I learnt a lot from it, and I still carry fond memories of the sleepless nights stringing together code that would just about work in the morning!  \n \nLooking forward to much more of those in my final semester in Spring 2016! \"Know something about everything-rather than everything about something\"​ \nThat's one of the motto's I try to live by. At least in the software engineering industry. That also forms the core of my experience in the same. \nThroughout my 4+ years in the industry, I have been involved right from requirements gathering from potential clients, budget estimation, software design and development, configuration management and release, manual testing, and test automation. \nI have been called a jack of all trades. While some may argue that that's not quite desirable, I believe , with this all-round knowledge of the SDLC, I can bring more value into any project that I carry out. \n \nI started out in game porting and moved through quite a few technology. I've also worked on BREW(which I believe is extinct now). Most of my initial career was spent in SCM and release engineering after which I moved to software development. \nI've dabbled in android a bit and more recently , in grad school,I am trying to educate myself on web development using the MEAN stack(Its a work in progress). \nI have been fascinated with Big Data and that would probably be my next destination. \n \nIn grad school, going to hackathons kind of became a hobby. It wasn't what you made, but what you learnt from it that excited me the most. I learnt a lot from it, and I still carry fond memories of the sleepless nights stringing together code that would just about work in the morning!  \n \nLooking forward to much more of those in my final semester in Spring 2016! \"Know something about everything-rather than everything about something\"​ \nThat's one of the motto's I try to live by. At least in the software engineering industry. That also forms the core of my experience in the same. \nThroughout my 4+ years in the industry, I have been involved right from requirements gathering from potential clients, budget estimation, software design and development, configuration management and release, manual testing, and test automation. \nI have been called a jack of all trades. While some may argue that that's not quite desirable, I believe , with this all-round knowledge of the SDLC, I can bring more value into any project that I carry out. \n \nI started out in game porting and moved through quite a few technology. I've also worked on BREW(which I believe is extinct now). Most of my initial career was spent in SCM and release engineering after which I moved to software development. \nI've dabbled in android a bit and more recently , in grad school,I am trying to educate myself on web development using the MEAN stack(Its a work in progress). \nI have been fascinated with Big Data and that would probably be my next destination. \n \nIn grad school, going to hackathons kind of became a hobby. It wasn't what you made, but what you learnt from it that excited me the most. I learnt a lot from it, and I still carry fond memories of the sleepless nights stringing together code that would just about work in the morning!  \n \nLooking forward to much more of those in my final semester in Spring 2016! Experience Software Engineer Intern Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Front Desk Assistant(Part-Time) University of Texas at Dallas August 2014  –  May 2015  (10 months) RIchardson,Texas •\tAssisted with new residents with move in and move out. \n•\tHelped answer any queries new students may have about the residence halls \n•\tAssisted new residents with the move-in procedure to their respective dorms Engineer 1(Contract) Qualcomm July 2012  –  December 2013  (1 year 6 months) Greater San Diego Area •\tImplemented preliminary ULP automation framework using Android, Perl and QXDM interfaces in 1 month which automated testing activities of 5-6 testers and increased productivity by around 2 hours a day. \n•\tConstructed multiple miniature Java parsers using Eclipse IDE, which facilitated 4-6 Project Leads to interpret test results more quickly, and easily. \n•\tMaintained and enhanced the ASIA test Automation Framework by upgrading Perl scripts and Android apk files to improve the regressions and stability testing cycle. \n•\tCarried out regression and functional testing of various test cases on Qualcomm GPS chipsets using QXDM and QPST and interpreted results with the help of APEX post-processing tool. \n•\tRevamped C# tool to automate testing and result collection activities on Perl and QXDM which greatly assisted the field engineers in daily field test runs. Senior Software Engineer L&T Infotech October 2009  –  July 2012  (2 years 10 months) Mumbai Area, India •\tInvolved in the design, development, and testing of mobile applications for Android devices. \n•\tSuccessfully handled build and release activities for a Motorola Handset on Git for a team of 15 responsible for around 60-70% of client deliverables. \n•\tUpdated bug statuses on Atlassian JIRA and assisted Technical Lead in code reviews on Gerrit review server. \n•\tPorted multiple mobile games from Java mobile platform to BREW for multiple Verizon devices. \n•\tMonitored the Jenkins build automation tool and ensured no code breakages during critical client releases. \n•\tExecuted feasibility analysis and laid initial groundwork for development of Android application for team of 4 while handling release and version control activities on Tortoise SVN tool. \n•\tPorted multiple mobile games from Java mobile platform to BREW for multiple Verizon devices. \n•\tDeveloped software to simulate all of Bluetooth’s basic functionality on the BrewMP platform \n•\tOverhauled and troubleshot existing UI framework on TrigML from one mobile device to another using Clearcase for version control. Engineer Kerala State Electronics Development Corporation Ltd January 2009  –  September 2009  (9 months) Kerala, India •\tMember of the team responsible for creation of new account heads by presenting viable software solutions to potential clients. \n•\tInvolved in the budgeting and estimation of projects. \n•\tFrequently communicated with clients regarding product requirements and ensured software delivery team was on track. Software Engineer Intern Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Software Engineer Intern Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Front Desk Assistant(Part-Time) University of Texas at Dallas August 2014  –  May 2015  (10 months) RIchardson,Texas •\tAssisted with new residents with move in and move out. \n•\tHelped answer any queries new students may have about the residence halls \n•\tAssisted new residents with the move-in procedure to their respective dorms Front Desk Assistant(Part-Time) University of Texas at Dallas August 2014  –  May 2015  (10 months) RIchardson,Texas •\tAssisted with new residents with move in and move out. \n•\tHelped answer any queries new students may have about the residence halls \n•\tAssisted new residents with the move-in procedure to their respective dorms Engineer 1(Contract) Qualcomm July 2012  –  December 2013  (1 year 6 months) Greater San Diego Area •\tImplemented preliminary ULP automation framework using Android, Perl and QXDM interfaces in 1 month which automated testing activities of 5-6 testers and increased productivity by around 2 hours a day. \n•\tConstructed multiple miniature Java parsers using Eclipse IDE, which facilitated 4-6 Project Leads to interpret test results more quickly, and easily. \n•\tMaintained and enhanced the ASIA test Automation Framework by upgrading Perl scripts and Android apk files to improve the regressions and stability testing cycle. \n•\tCarried out regression and functional testing of various test cases on Qualcomm GPS chipsets using QXDM and QPST and interpreted results with the help of APEX post-processing tool. \n•\tRevamped C# tool to automate testing and result collection activities on Perl and QXDM which greatly assisted the field engineers in daily field test runs. Engineer 1(Contract) Qualcomm July 2012  –  December 2013  (1 year 6 months) Greater San Diego Area •\tImplemented preliminary ULP automation framework using Android, Perl and QXDM interfaces in 1 month which automated testing activities of 5-6 testers and increased productivity by around 2 hours a day. \n•\tConstructed multiple miniature Java parsers using Eclipse IDE, which facilitated 4-6 Project Leads to interpret test results more quickly, and easily. \n•\tMaintained and enhanced the ASIA test Automation Framework by upgrading Perl scripts and Android apk files to improve the regressions and stability testing cycle. \n•\tCarried out regression and functional testing of various test cases on Qualcomm GPS chipsets using QXDM and QPST and interpreted results with the help of APEX post-processing tool. \n•\tRevamped C# tool to automate testing and result collection activities on Perl and QXDM which greatly assisted the field engineers in daily field test runs. Senior Software Engineer L&T Infotech October 2009  –  July 2012  (2 years 10 months) Mumbai Area, India •\tInvolved in the design, development, and testing of mobile applications for Android devices. \n•\tSuccessfully handled build and release activities for a Motorola Handset on Git for a team of 15 responsible for around 60-70% of client deliverables. \n•\tUpdated bug statuses on Atlassian JIRA and assisted Technical Lead in code reviews on Gerrit review server. \n•\tPorted multiple mobile games from Java mobile platform to BREW for multiple Verizon devices. \n•\tMonitored the Jenkins build automation tool and ensured no code breakages during critical client releases. \n•\tExecuted feasibility analysis and laid initial groundwork for development of Android application for team of 4 while handling release and version control activities on Tortoise SVN tool. \n•\tPorted multiple mobile games from Java mobile platform to BREW for multiple Verizon devices. \n•\tDeveloped software to simulate all of Bluetooth’s basic functionality on the BrewMP platform \n•\tOverhauled and troubleshot existing UI framework on TrigML from one mobile device to another using Clearcase for version control. Senior Software Engineer L&T Infotech October 2009  –  July 2012  (2 years 10 months) Mumbai Area, India •\tInvolved in the design, development, and testing of mobile applications for Android devices. \n•\tSuccessfully handled build and release activities for a Motorola Handset on Git for a team of 15 responsible for around 60-70% of client deliverables. \n•\tUpdated bug statuses on Atlassian JIRA and assisted Technical Lead in code reviews on Gerrit review server. \n•\tPorted multiple mobile games from Java mobile platform to BREW for multiple Verizon devices. \n•\tMonitored the Jenkins build automation tool and ensured no code breakages during critical client releases. \n•\tExecuted feasibility analysis and laid initial groundwork for development of Android application for team of 4 while handling release and version control activities on Tortoise SVN tool. \n•\tPorted multiple mobile games from Java mobile platform to BREW for multiple Verizon devices. \n•\tDeveloped software to simulate all of Bluetooth’s basic functionality on the BrewMP platform \n•\tOverhauled and troubleshot existing UI framework on TrigML from one mobile device to another using Clearcase for version control. Engineer Kerala State Electronics Development Corporation Ltd January 2009  –  September 2009  (9 months) Kerala, India •\tMember of the team responsible for creation of new account heads by presenting viable software solutions to potential clients. \n•\tInvolved in the budgeting and estimation of projects. \n•\tFrequently communicated with clients regarding product requirements and ensured software delivery team was on track. Engineer Kerala State Electronics Development Corporation Ltd January 2009  –  September 2009  (9 months) Kerala, India •\tMember of the team responsible for creation of new account heads by presenting viable software solutions to potential clients. \n•\tInvolved in the budgeting and estimation of projects. \n•\tFrequently communicated with clients regarding product requirements and ensured software delivery team was on track. Languages English Full professional proficiency Hindi Professional working proficiency Malayalam Full professional proficiency English Full professional proficiency Hindi Professional working proficiency Malayalam Full professional proficiency English Full professional proficiency Hindi Professional working proficiency Malayalam Full professional proficiency Full professional proficiency Professional working proficiency Full professional proficiency Skills Android Eclipse Debugging Git ClearCase Tortoise SVN C Java Linux Testing Mobile Applications MySQL Perl Hadoop MapReduce JIRA Regression Testing Test Automation QXDM QPST APEX Matlab Jenkins HTML CSS RRDTool Ganglia Android Studio See 13+     See less Skills  Android Eclipse Debugging Git ClearCase Tortoise SVN C Java Linux Testing Mobile Applications MySQL Perl Hadoop MapReduce JIRA Regression Testing Test Automation QXDM QPST APEX Matlab Jenkins HTML CSS RRDTool Ganglia Android Studio See 13+     See less Android Eclipse Debugging Git ClearCase Tortoise SVN C Java Linux Testing Mobile Applications MySQL Perl Hadoop MapReduce JIRA Regression Testing Test Automation QXDM QPST APEX Matlab Jenkins HTML CSS RRDTool Ganglia Android Studio See 13+     See less Android Eclipse Debugging Git ClearCase Tortoise SVN C Java Linux Testing Mobile Applications MySQL Perl Hadoop MapReduce JIRA Regression Testing Test Automation QXDM QPST APEX Matlab Jenkins HTML CSS RRDTool Ganglia Android Studio See 13+     See less Education The University of Texas at Dallas Master of Science (MS),  Computer Engineering 2014  – 2016 Activities and Societies:  Student Leadership Organisation ,  Comet Cupboard ,  International Student Service Organisation Saintgits College of Engineering B.Tech,  Electronics and Communication 2004  – 2008 Activities and Societies:  Member of ISTE Syrian Jacobite Public School A.I.S.S.E,  Maths ,  Computer Science 2002  – 2004 The University of Texas at Dallas Master of Science (MS),  Computer Engineering 2014  – 2016 Activities and Societies:  Student Leadership Organisation ,  Comet Cupboard ,  International Student Service Organisation The University of Texas at Dallas Master of Science (MS),  Computer Engineering 2014  – 2016 Activities and Societies:  Student Leadership Organisation ,  Comet Cupboard ,  International Student Service Organisation The University of Texas at Dallas Master of Science (MS),  Computer Engineering 2014  – 2016 Activities and Societies:  Student Leadership Organisation ,  Comet Cupboard ,  International Student Service Organisation Saintgits College of Engineering B.Tech,  Electronics and Communication 2004  – 2008 Activities and Societies:  Member of ISTE Saintgits College of Engineering B.Tech,  Electronics and Communication 2004  – 2008 Activities and Societies:  Member of ISTE Saintgits College of Engineering B.Tech,  Electronics and Communication 2004  – 2008 Activities and Societies:  Member of ISTE Syrian Jacobite Public School A.I.S.S.E,  Maths ,  Computer Science 2002  – 2004 Syrian Jacobite Public School A.I.S.S.E,  Maths ,  Computer Science 2002  – 2004 Syrian Jacobite Public School A.I.S.S.E,  Maths ,  Computer Science 2002  – 2004 Honors & Awards Star Performer of the month L&T Infotech March 2011 For \n-Handling configuration management and release activities efficiently and on time. \n-Minimised turn around time and spun multiple released with only a few days in between Star Performer of the Month L&T Infotech February 2012 For \n- Quickly ramping up on the Android platform and developing and releasing Android apps to customer. \n- Simultaneously handling release activies and developer activities seamlessly in the same project 3rd Spot-UTD Hackathon ACM January 2015 Came in 3rd at the first ever hackathon organised by the UTD ACM chapter for our web app- FunVoyage Top 25(in 100) at HackDFW February 2015 Our app came in the top 25% of best rated apps from among 100 teams Star Performer of the month L&T Infotech March 2011 For \n-Handling configuration management and release activities efficiently and on time. \n-Minimised turn around time and spun multiple released with only a few days in between Star Performer of the month L&T Infotech March 2011 For \n-Handling configuration management and release activities efficiently and on time. \n-Minimised turn around time and spun multiple released with only a few days in between Star Performer of the month L&T Infotech March 2011 For \n-Handling configuration management and release activities efficiently and on time. \n-Minimised turn around time and spun multiple released with only a few days in between Star Performer of the Month L&T Infotech February 2012 For \n- Quickly ramping up on the Android platform and developing and releasing Android apps to customer. \n- Simultaneously handling release activies and developer activities seamlessly in the same project Star Performer of the Month L&T Infotech February 2012 For \n- Quickly ramping up on the Android platform and developing and releasing Android apps to customer. \n- Simultaneously handling release activies and developer activities seamlessly in the same project Star Performer of the Month L&T Infotech February 2012 For \n- Quickly ramping up on the Android platform and developing and releasing Android apps to customer. \n- Simultaneously handling release activies and developer activities seamlessly in the same project 3rd Spot-UTD Hackathon ACM January 2015 Came in 3rd at the first ever hackathon organised by the UTD ACM chapter for our web app- FunVoyage 3rd Spot-UTD Hackathon ACM January 2015 Came in 3rd at the first ever hackathon organised by the UTD ACM chapter for our web app- FunVoyage 3rd Spot-UTD Hackathon ACM January 2015 Came in 3rd at the first ever hackathon organised by the UTD ACM chapter for our web app- FunVoyage Top 25(in 100) at HackDFW February 2015 Our app came in the top 25% of best rated apps from among 100 teams Top 25(in 100) at HackDFW February 2015 Our app came in the top 25% of best rated apps from among 100 teams Top 25(in 100) at HackDFW February 2015 Our app came in the top 25% of best rated apps from among 100 teams ", "Summary • Worked as a Software Engineer Intern at Intel Corporation, Santa Clara. \n• Worked as a Senior Software Developer at Philips Electronics India LTD. \n• Over three years of industry experience in Software Design, Development and Validation. \n• Good debugging skills, including debugging system software on simulator and real hardware using gdb or source level debugging. \n \nCareer interests : Embedded Systems \nSpecialties: C, JAVA Summary • Worked as a Software Engineer Intern at Intel Corporation, Santa Clara. \n• Worked as a Senior Software Developer at Philips Electronics India LTD. \n• Over three years of industry experience in Software Design, Development and Validation. \n• Good debugging skills, including debugging system software on simulator and real hardware using gdb or source level debugging. \n \nCareer interests : Embedded Systems \nSpecialties: C, JAVA • Worked as a Software Engineer Intern at Intel Corporation, Santa Clara. \n• Worked as a Senior Software Developer at Philips Electronics India LTD. \n• Over three years of industry experience in Software Design, Development and Validation. \n• Good debugging skills, including debugging system software on simulator and real hardware using gdb or source level debugging. \n \nCareer interests : Embedded Systems \nSpecialties: C, JAVA • Worked as a Software Engineer Intern at Intel Corporation, Santa Clara. \n• Worked as a Senior Software Developer at Philips Electronics India LTD. \n• Over three years of industry experience in Software Design, Development and Validation. \n• Good debugging skills, including debugging system software on simulator and real hardware using gdb or source level debugging. \n \nCareer interests : Embedded Systems \nSpecialties: C, JAVA Experience Software Engineer II Fujitsu Network Communications August 2013  – Present (2 years 1 month) Richardson, Texas Software Engineer Intern Intel Corporation June 2012  –  January 2013  (8 months) Santa Clara, CA •Evaluated open source Unit Testing Frameworks, CPPUnit, CUnit to investigate applicability to our Binary Translation project. \n•Spearheaded and led feasibility studies on 3rd party offline testing tool, VectorCast. This included integration of extremely complex code base into VectorCast, fielding support issues and bugs, training engineers on tool usage. \n•Designed and implemented validation plan for few modules, Memory Manager and Translation Cache (hardware modeling features like TLB). \n•Designed and implemented an automation framework in Python which greatly improves usability of an in-house unit testing tool. Sr. Software Engineer Philips Consumer Lifestyle July 2008  –  December 2010  (2 years 6 months) Bangalore, India • Responsible for requirement analysis, design and development, documentation and end-to-end testing of various components of LCD TV’s software stack.  \n• Developed multiple components including Ambilight (a patented feature to map diffused light from the TV to the color of the video) \n• Other components include Audio selection channels, Aspect Ratio control and restoration of last status including picture shifts and user settings restoration whenever the TV goes across a power cycle. Software Engineer II Fujitsu Network Communications August 2013  – Present (2 years 1 month) Richardson, Texas Software Engineer II Fujitsu Network Communications August 2013  – Present (2 years 1 month) Richardson, Texas Software Engineer Intern Intel Corporation June 2012  –  January 2013  (8 months) Santa Clara, CA •Evaluated open source Unit Testing Frameworks, CPPUnit, CUnit to investigate applicability to our Binary Translation project. \n•Spearheaded and led feasibility studies on 3rd party offline testing tool, VectorCast. This included integration of extremely complex code base into VectorCast, fielding support issues and bugs, training engineers on tool usage. \n•Designed and implemented validation plan for few modules, Memory Manager and Translation Cache (hardware modeling features like TLB). \n•Designed and implemented an automation framework in Python which greatly improves usability of an in-house unit testing tool. Software Engineer Intern Intel Corporation June 2012  –  January 2013  (8 months) Santa Clara, CA •Evaluated open source Unit Testing Frameworks, CPPUnit, CUnit to investigate applicability to our Binary Translation project. \n•Spearheaded and led feasibility studies on 3rd party offline testing tool, VectorCast. This included integration of extremely complex code base into VectorCast, fielding support issues and bugs, training engineers on tool usage. \n•Designed and implemented validation plan for few modules, Memory Manager and Translation Cache (hardware modeling features like TLB). \n•Designed and implemented an automation framework in Python which greatly improves usability of an in-house unit testing tool. Sr. Software Engineer Philips Consumer Lifestyle July 2008  –  December 2010  (2 years 6 months) Bangalore, India • Responsible for requirement analysis, design and development, documentation and end-to-end testing of various components of LCD TV’s software stack.  \n• Developed multiple components including Ambilight (a patented feature to map diffused light from the TV to the color of the video) \n• Other components include Audio selection channels, Aspect Ratio control and restoration of last status including picture shifts and user settings restoration whenever the TV goes across a power cycle. Sr. Software Engineer Philips Consumer Lifestyle July 2008  –  December 2010  (2 years 6 months) Bangalore, India • Responsible for requirement analysis, design and development, documentation and end-to-end testing of various components of LCD TV’s software stack.  \n• Developed multiple components including Ambilight (a patented feature to map diffused light from the TV to the color of the video) \n• Other components include Audio selection channels, Aspect Ratio control and restoration of last status including picture shifts and user settings restoration whenever the TV goes across a power cycle. Skills C Java Algorithms Embedded Systems JavaScript Computer Architecture Debugging Cloud Computing Operating Systems SQL Compilers Python Linux Parallel Programming Testing Test Automation Device Drivers See 2+     See less Skills  C Java Algorithms Embedded Systems JavaScript Computer Architecture Debugging Cloud Computing Operating Systems SQL Compilers Python Linux Parallel Programming Testing Test Automation Device Drivers See 2+     See less C Java Algorithms Embedded Systems JavaScript Computer Architecture Debugging Cloud Computing Operating Systems SQL Compilers Python Linux Parallel Programming Testing Test Automation Device Drivers See 2+     See less C Java Algorithms Embedded Systems JavaScript Computer Architecture Debugging Cloud Computing Operating Systems SQL Compilers Python Linux Parallel Programming Testing Test Automation Device Drivers See 2+     See less Education The University of Texas at Arlington Master's degree,  Computer Science 2011  – 2013 PESIT, Bangalore Bachelor's degree,  Electronics and Communications Engineering 2004  – 2008 The University of Texas at Arlington Master's degree,  Computer Science 2011  – 2013 The University of Texas at Arlington Master's degree,  Computer Science 2011  – 2013 The University of Texas at Arlington Master's degree,  Computer Science 2011  – 2013 PESIT, Bangalore Bachelor's degree,  Electronics and Communications Engineering 2004  – 2008 PESIT, Bangalore Bachelor's degree,  Electronics and Communications Engineering 2004  – 2008 PESIT, Bangalore Bachelor's degree,  Electronics and Communications Engineering 2004  – 2008 ", "Experience Software Development Engineer Microsoft January 2015  – Present (8 months) Bengaluru Area, India Graphics Software Engineer Intel Corporation June 2012  –  December 2014  (2 years 7 months) Bengaluru Area, India Software Engineer Intern Intel Corporation December 2011  –  May 2012  (6 months) Bengaluru Area, India Software Engineer Intern Intel Corporation May 2010  –  November 2010  (7 months) Bengaluru Area, India Software Development Engineer Microsoft January 2015  – Present (8 months) Bengaluru Area, India Software Development Engineer Microsoft January 2015  – Present (8 months) Bengaluru Area, India Graphics Software Engineer Intel Corporation June 2012  –  December 2014  (2 years 7 months) Bengaluru Area, India Graphics Software Engineer Intel Corporation June 2012  –  December 2014  (2 years 7 months) Bengaluru Area, India Software Engineer Intern Intel Corporation December 2011  –  May 2012  (6 months) Bengaluru Area, India Software Engineer Intern Intel Corporation December 2011  –  May 2012  (6 months) Bengaluru Area, India Software Engineer Intern Intel Corporation May 2010  –  November 2010  (7 months) Bengaluru Area, India Software Engineer Intern Intel Corporation May 2010  –  November 2010  (7 months) Bengaluru Area, India Languages English Full professional proficiency Tamil Native or bilingual proficiency Hindi Limited working proficiency English Full professional proficiency Tamil Native or bilingual proficiency Hindi Limited working proficiency English Full professional proficiency Tamil Native or bilingual proficiency Hindi Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Skills     Education PSG College of Technology Master's degree 2007  – 2012 PSG College of Technology Master's degree 2007  – 2012 PSG College of Technology Master's degree 2007  – 2012 PSG College of Technology Master's degree 2007  – 2012 Honors & Awards ", "Summary A graduate student at USC pursuing my Master's in Computer Science, currently looking for Co-op/Full Time opportunities \n \nSkills: \n \nProgramming Languages: C, JAVA, C++, C#(Beginner) \nWeb Technologies: HTML, XML, CSS, JavaScript, DOM, PHP, JSON,JSP,Python, JQuery \nDatabases: MySQL, Oracle10g, Microsoft SQL Server 2008, XQuery . \nSoftware Tools: Eclipse , Visual Studio, Share Point Summary A graduate student at USC pursuing my Master's in Computer Science, currently looking for Co-op/Full Time opportunities \n \nSkills: \n \nProgramming Languages: C, JAVA, C++, C#(Beginner) \nWeb Technologies: HTML, XML, CSS, JavaScript, DOM, PHP, JSON,JSP,Python, JQuery \nDatabases: MySQL, Oracle10g, Microsoft SQL Server 2008, XQuery . \nSoftware Tools: Eclipse , Visual Studio, Share Point A graduate student at USC pursuing my Master's in Computer Science, currently looking for Co-op/Full Time opportunities \n \nSkills: \n \nProgramming Languages: C, JAVA, C++, C#(Beginner) \nWeb Technologies: HTML, XML, CSS, JavaScript, DOM, PHP, JSON,JSP,Python, JQuery \nDatabases: MySQL, Oracle10g, Microsoft SQL Server 2008, XQuery . \nSoftware Tools: Eclipse , Visual Studio, Share Point A graduate student at USC pursuing my Master's in Computer Science, currently looking for Co-op/Full Time opportunities \n \nSkills: \n \nProgramming Languages: C, JAVA, C++, C#(Beginner) \nWeb Technologies: HTML, XML, CSS, JavaScript, DOM, PHP, JSON,JSP,Python, JQuery \nDatabases: MySQL, Oracle10g, Microsoft SQL Server 2008, XQuery . \nSoftware Tools: Eclipse , Visual Studio, Share Point Experience Software Engineer Intern Intel Corporation January 2015  –  May 2015  (5 months) Portland, Oregon Area Math Grader(MATH 245) University of Southern California January 2014  –  December 2014  (1 year) Greater Los Angeles Area -Responsible for grading Homeworks and Assignments of MATH 245. Technical Community Manager Intern SanDisk May 2014  –  August 2014  (4 months) San Francisco Bay Area -Developed an interactive web application for Corporate Engineering to organize and manage the Licence/Contract details. This tool currently handles an inventory of over 40 Million.  \n-Design,Develop,Maintain websites for Corporate Engineering group within the organisation. \n-Help Corporate Engineering group with content management. \n-Develop and Maintain Engineering communities to streamline the development process. Application Processing University of Southern California September 2013  –  May 2014  (9 months) programmer Analyst Trainee Cognizant Technology Solutions March 2013  –  July 2013  (5 months) Software Engineer Intern Intel Corporation January 2015  –  May 2015  (5 months) Portland, Oregon Area Software Engineer Intern Intel Corporation January 2015  –  May 2015  (5 months) Portland, Oregon Area Math Grader(MATH 245) University of Southern California January 2014  –  December 2014  (1 year) Greater Los Angeles Area -Responsible for grading Homeworks and Assignments of MATH 245. Math Grader(MATH 245) University of Southern California January 2014  –  December 2014  (1 year) Greater Los Angeles Area -Responsible for grading Homeworks and Assignments of MATH 245. Technical Community Manager Intern SanDisk May 2014  –  August 2014  (4 months) San Francisco Bay Area -Developed an interactive web application for Corporate Engineering to organize and manage the Licence/Contract details. This tool currently handles an inventory of over 40 Million.  \n-Design,Develop,Maintain websites for Corporate Engineering group within the organisation. \n-Help Corporate Engineering group with content management. \n-Develop and Maintain Engineering communities to streamline the development process. Technical Community Manager Intern SanDisk May 2014  –  August 2014  (4 months) San Francisco Bay Area -Developed an interactive web application for Corporate Engineering to organize and manage the Licence/Contract details. This tool currently handles an inventory of over 40 Million.  \n-Design,Develop,Maintain websites for Corporate Engineering group within the organisation. \n-Help Corporate Engineering group with content management. \n-Develop and Maintain Engineering communities to streamline the development process. Application Processing University of Southern California September 2013  –  May 2014  (9 months) Application Processing University of Southern California September 2013  –  May 2014  (9 months) programmer Analyst Trainee Cognizant Technology Solutions March 2013  –  July 2013  (5 months) programmer Analyst Trainee Cognizant Technology Solutions March 2013  –  July 2013  (5 months) Languages English Full professional proficiency Hindi Full professional proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills C JavaScript Java XML CSS HTML Microsoft Office SQL Microsoft Word PowerPoint Microsoft Excel PHP Photoshop Windows Core Java PL/SQL C# Data Structures ASP.NET Web Services Spatial Databases XQuery SharePoint jQuery Eclipse MySQL JSP C++ See 13+     See less Skills  C JavaScript Java XML CSS HTML Microsoft Office SQL Microsoft Word PowerPoint Microsoft Excel PHP Photoshop Windows Core Java PL/SQL C# Data Structures ASP.NET Web Services Spatial Databases XQuery SharePoint jQuery Eclipse MySQL JSP C++ See 13+     See less C JavaScript Java XML CSS HTML Microsoft Office SQL Microsoft Word PowerPoint Microsoft Excel PHP Photoshop Windows Core Java PL/SQL C# Data Structures ASP.NET Web Services Spatial Databases XQuery SharePoint jQuery Eclipse MySQL JSP C++ See 13+     See less C JavaScript Java XML CSS HTML Microsoft Office SQL Microsoft Word PowerPoint Microsoft Excel PHP Photoshop Windows Core Java PL/SQL C# Data Structures ASP.NET Web Services Spatial Databases XQuery SharePoint jQuery Eclipse MySQL JSP C++ See 13+     See less Education University of Southern California Master's degree,  Computer Science , 3.73 2013  – 2015 Activities and Societies:  Association of Indian Students MVSR Engineering College Bachelor of Engineering (BEng),  Information Technology , University 1st(4.0) 2008  – 2012 University of Southern California Master's degree,  Computer Science , 3.73 2013  – 2015 Activities and Societies:  Association of Indian Students University of Southern California Master's degree,  Computer Science , 3.73 2013  – 2015 Activities and Societies:  Association of Indian Students University of Southern California Master's degree,  Computer Science , 3.73 2013  – 2015 Activities and Societies:  Association of Indian Students MVSR Engineering College Bachelor of Engineering (BEng),  Information Technology , University 1st(4.0) 2008  – 2012 MVSR Engineering College Bachelor of Engineering (BEng),  Information Technology , University 1st(4.0) 2008  – 2012 MVSR Engineering College Bachelor of Engineering (BEng),  Information Technology , University 1st(4.0) 2008  – 2012 Honors & Awards Gold Medal For Being University First, Osmania University Osmania University August 2012 Graduated First at University among 660 Students at Osmania university,Department of Information Technology. \n \n \n School Toppers Prize All Saints High School June 2006 Was Awarded prestigious school toppers prize for standing first among 500 students in 10th grade. Merit Certificate NIIT September 2010 Stood in top 1% of the country at a national level IT aptitude test. Gold Medal For Being University First, Osmania University Osmania University August 2012 Graduated First at University among 660 Students at Osmania university,Department of Information Technology. \n \n \n Gold Medal For Being University First, Osmania University Osmania University August 2012 Graduated First at University among 660 Students at Osmania university,Department of Information Technology. \n \n \n Gold Medal For Being University First, Osmania University Osmania University August 2012 Graduated First at University among 660 Students at Osmania university,Department of Information Technology. \n \n \n School Toppers Prize All Saints High School June 2006 Was Awarded prestigious school toppers prize for standing first among 500 students in 10th grade. School Toppers Prize All Saints High School June 2006 Was Awarded prestigious school toppers prize for standing first among 500 students in 10th grade. School Toppers Prize All Saints High School June 2006 Was Awarded prestigious school toppers prize for standing first among 500 students in 10th grade. Merit Certificate NIIT September 2010 Stood in top 1% of the country at a national level IT aptitude test. Merit Certificate NIIT September 2010 Stood in top 1% of the country at a national level IT aptitude test. Merit Certificate NIIT September 2010 Stood in top 1% of the country at a national level IT aptitude test. "]}