{"position": "Software Program Manager", "company": "Intel Corporation", "profiles": ["Summary Experienced in leading software development teams sizes from 6 to 123 in high-tech companies in the development, validation, and support of software. Development experience ranges from high end enterprise servers to low end devices delivering system firmware, applications, and software for hardware.  \n \nDriving all aspects of the product life cycle phases through concept definition through maintenance phases. Able to easily transition roles from people management, technical program management, and as well as being a natural problem solver.  \n \nExperienced leading/mentoring new teams or existing teams either locally or spread across international, or different, locations including vendor management. \n \nHighly motivated to learn and adapt to new technologies and challenges in the development environment and bringing out the best in development teams.  Summary Experienced in leading software development teams sizes from 6 to 123 in high-tech companies in the development, validation, and support of software. Development experience ranges from high end enterprise servers to low end devices delivering system firmware, applications, and software for hardware.  \n \nDriving all aspects of the product life cycle phases through concept definition through maintenance phases. Able to easily transition roles from people management, technical program management, and as well as being a natural problem solver.  \n \nExperienced leading/mentoring new teams or existing teams either locally or spread across international, or different, locations including vendor management. \n \nHighly motivated to learn and adapt to new technologies and challenges in the development environment and bringing out the best in development teams.  Experienced in leading software development teams sizes from 6 to 123 in high-tech companies in the development, validation, and support of software. Development experience ranges from high end enterprise servers to low end devices delivering system firmware, applications, and software for hardware.  \n \nDriving all aspects of the product life cycle phases through concept definition through maintenance phases. Able to easily transition roles from people management, technical program management, and as well as being a natural problem solver.  \n \nExperienced leading/mentoring new teams or existing teams either locally or spread across international, or different, locations including vendor management. \n \nHighly motivated to learn and adapt to new technologies and challenges in the development environment and bringing out the best in development teams.  Experienced in leading software development teams sizes from 6 to 123 in high-tech companies in the development, validation, and support of software. Development experience ranges from high end enterprise servers to low end devices delivering system firmware, applications, and software for hardware.  \n \nDriving all aspects of the product life cycle phases through concept definition through maintenance phases. Able to easily transition roles from people management, technical program management, and as well as being a natural problem solver.  \n \nExperienced leading/mentoring new teams or existing teams either locally or spread across international, or different, locations including vendor management. \n \nHighly motivated to learn and adapt to new technologies and challenges in the development environment and bringing out the best in development teams.  Experience Software Program Manager Intel Corporation January 2014  – Present (1 year 8 months) DuPont, Washington Program Manager of team of 30+ engineers in various geographies responsible for driving the development and validation of Common code for Enterprise level servers. This role also includes the program management and analysis of C++ UEFI FW code in support of Server UEFI FW code. Both roles includes requirements gathering, plan creation, removal of roadblocks, and reported progress to plan metrics and status to upper management and stakeholders. Software Engineering Manager Intel Corporation March 2011  –  January 2014  (2 years 11 months) DuPont, Washington Software Engineering Manager Intel Corporation March 2009  –  March 2011  (2 years 1 month) DuPont, Washington Engineering Manager, system BIOS Intel January 2007  –  March 2009  (2 years 3 months) DuPont, Washington Sr Technical Program Manager Intel Corporation May 2005  –  December 2006  (1 year 8 months) DuPont, Washington Sr Development Manager Dell 1994  –  2003  (9 years) Austin, Texas Area Advisory Programmer IBM 1984  –  1994  (10 years) Boca Raton, Florida Software Program Manager Intel Corporation January 2014  – Present (1 year 8 months) DuPont, Washington Program Manager of team of 30+ engineers in various geographies responsible for driving the development and validation of Common code for Enterprise level servers. This role also includes the program management and analysis of C++ UEFI FW code in support of Server UEFI FW code. Both roles includes requirements gathering, plan creation, removal of roadblocks, and reported progress to plan metrics and status to upper management and stakeholders. Software Program Manager Intel Corporation January 2014  – Present (1 year 8 months) DuPont, Washington Program Manager of team of 30+ engineers in various geographies responsible for driving the development and validation of Common code for Enterprise level servers. This role also includes the program management and analysis of C++ UEFI FW code in support of Server UEFI FW code. Both roles includes requirements gathering, plan creation, removal of roadblocks, and reported progress to plan metrics and status to upper management and stakeholders. Software Engineering Manager Intel Corporation March 2011  –  January 2014  (2 years 11 months) DuPont, Washington Software Engineering Manager Intel Corporation March 2011  –  January 2014  (2 years 11 months) DuPont, Washington Software Engineering Manager Intel Corporation March 2009  –  March 2011  (2 years 1 month) DuPont, Washington Software Engineering Manager Intel Corporation March 2009  –  March 2011  (2 years 1 month) DuPont, Washington Engineering Manager, system BIOS Intel January 2007  –  March 2009  (2 years 3 months) DuPont, Washington Engineering Manager, system BIOS Intel January 2007  –  March 2009  (2 years 3 months) DuPont, Washington Sr Technical Program Manager Intel Corporation May 2005  –  December 2006  (1 year 8 months) DuPont, Washington Sr Technical Program Manager Intel Corporation May 2005  –  December 2006  (1 year 8 months) DuPont, Washington Sr Development Manager Dell 1994  –  2003  (9 years) Austin, Texas Area Sr Development Manager Dell 1994  –  2003  (9 years) Austin, Texas Area Advisory Programmer IBM 1984  –  1994  (10 years) Boca Raton, Florida Advisory Programmer IBM 1984  –  1994  (10 years) Boca Raton, Florida Languages English English English Skills Debugging Firmware Embedded Software Program Management Embedded Systems Software Development Testing Device Drivers Software Engineering System Architecture Computer Architecture Hardware Processors Enterprise Software Software Project... Cross-functional Team... Engineering Management Technical Leadership Microprocessors Hardware Architecture SoC Systems Engineering Servers Intel Software Design Semiconductors Data Center ASIC Bios People Management Perl C++ High Performance... Distributed Systems ClearCase RTOS X86 MS Project ARM Embedded Linux Vendor Relationship... See 26+     See less Skills  Debugging Firmware Embedded Software Program Management Embedded Systems Software Development Testing Device Drivers Software Engineering System Architecture Computer Architecture Hardware Processors Enterprise Software Software Project... Cross-functional Team... Engineering Management Technical Leadership Microprocessors Hardware Architecture SoC Systems Engineering Servers Intel Software Design Semiconductors Data Center ASIC Bios People Management Perl C++ High Performance... Distributed Systems ClearCase RTOS X86 MS Project ARM Embedded Linux Vendor Relationship... See 26+     See less Debugging Firmware Embedded Software Program Management Embedded Systems Software Development Testing Device Drivers Software Engineering System Architecture Computer Architecture Hardware Processors Enterprise Software Software Project... Cross-functional Team... Engineering Management Technical Leadership Microprocessors Hardware Architecture SoC Systems Engineering Servers Intel Software Design Semiconductors Data Center ASIC Bios People Management Perl C++ High Performance... Distributed Systems ClearCase RTOS X86 MS Project ARM Embedded Linux Vendor Relationship... See 26+     See less Debugging Firmware Embedded Software Program Management Embedded Systems Software Development Testing Device Drivers Software Engineering System Architecture Computer Architecture Hardware Processors Enterprise Software Software Project... Cross-functional Team... Engineering Management Technical Leadership Microprocessors Hardware Architecture SoC Systems Engineering Servers Intel Software Design Semiconductors Data Center ASIC Bios People Management Perl C++ High Performance... Distributed Systems ClearCase RTOS X86 MS Project ARM Embedded Linux Vendor Relationship... See 26+     See less Education Nova Southeastern University MBA,  Business Administration and Management , General 1990  – 1992 I wanted to expand my knowledge by obtaining my MBA in new areas. When joining Dell I transitioned from being deeply involved on technical issues to Technical Program Management better using my MBA skills while leveraging my strong technical background.  \n \nIn retrospect this was the best thing I did for myself. \n \n Nova Southeastern University BS,  Professional Management 1988  – 1990   Nova Southeastern University MBA,  Business Administration and Management , General 1990  – 1992 I wanted to expand my knowledge by obtaining my MBA in new areas. When joining Dell I transitioned from being deeply involved on technical issues to Technical Program Management better using my MBA skills while leveraging my strong technical background.  \n \nIn retrospect this was the best thing I did for myself. \n \n Nova Southeastern University MBA,  Business Administration and Management , General 1990  – 1992 I wanted to expand my knowledge by obtaining my MBA in new areas. When joining Dell I transitioned from being deeply involved on technical issues to Technical Program Management better using my MBA skills while leveraging my strong technical background.  \n \nIn retrospect this was the best thing I did for myself. \n \n Nova Southeastern University MBA,  Business Administration and Management , General 1990  – 1992 I wanted to expand my knowledge by obtaining my MBA in new areas. When joining Dell I transitioned from being deeply involved on technical issues to Technical Program Management better using my MBA skills while leveraging my strong technical background.  \n \nIn retrospect this was the best thing I did for myself. \n \n Nova Southeastern University BS,  Professional Management 1988  – 1990   Nova Southeastern University BS,  Professional Management 1988  – 1990   Nova Southeastern University BS,  Professional Management 1988  – 1990   ", "Skills Debugging ASIC Firmware Embedded Systems SoC Semiconductors Embedded Software PMP Processors Device Drivers Verilog Computer Architecture VHDL Skills  Debugging ASIC Firmware Embedded Systems SoC Semiconductors Embedded Software PMP Processors Device Drivers Verilog Computer Architecture VHDL Debugging ASIC Firmware Embedded Systems SoC Semiconductors Embedded Software PMP Processors Device Drivers Verilog Computer Architecture VHDL Debugging ASIC Firmware Embedded Systems SoC Semiconductors Embedded Software PMP Processors Device Drivers Verilog Computer Architecture VHDL ", "Experience Software Program Manager Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR Program Manager Intern Intel Corporation September 2013  –  June 2014  (10 months) Operations Intern Business Education Compact March 2012  –  September 2013  (1 year 7 months) Intel Corporation Software Program Manager Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR Software Program Manager Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR Program Manager Intern Intel Corporation September 2013  –  June 2014  (10 months) Program Manager Intern Intel Corporation September 2013  –  June 2014  (10 months) Operations Intern Business Education Compact March 2012  –  September 2013  (1 year 7 months) Intel Corporation Operations Intern Business Education Compact March 2012  –  September 2013  (1 year 7 months) Intel Corporation Skills Microsoft Office Software Engineering Skills  Microsoft Office Software Engineering Microsoft Office Software Engineering Microsoft Office Software Engineering Education Portland State University - School of Business Bachelor's Degree,  Logistics , Materials, and Supply Chain Management 2010  – 2014 Portland State University - School of Business Bachelor's Degree,  Logistics , Materials, and Supply Chain Management 2010  – 2014 Portland State University - School of Business Bachelor's Degree,  Logistics , Materials, and Supply Chain Management 2010  – 2014 Portland State University - School of Business Bachelor's Degree,  Logistics , Materials, and Supply Chain Management 2010  – 2014 ", "Languages English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Product Marketing Market Research Program Management Competitive Analysis Product Management Account Management New Business Development Strategic Partnerships Market Analysis Alliance Marketing Partner Programs Co-marketing Go-to-market Strategy Business Development Lead Generation Strategy Business Alliances Cross-functional Team... International Sales Business Strategy Marketing Marketing Strategy Data Center Multi-channel Marketing Product Launch Demand Generation Channel Partners Intel Technical Marketing Semiconductors Mobile Devices Partner Management Sales Enablement Enterprise Software See 19+     See less Skills  Product Marketing Market Research Program Management Competitive Analysis Product Management Account Management New Business Development Strategic Partnerships Market Analysis Alliance Marketing Partner Programs Co-marketing Go-to-market Strategy Business Development Lead Generation Strategy Business Alliances Cross-functional Team... International Sales Business Strategy Marketing Marketing Strategy Data Center Multi-channel Marketing Product Launch Demand Generation Channel Partners Intel Technical Marketing Semiconductors Mobile Devices Partner Management Sales Enablement Enterprise Software See 19+     See less Product Marketing Market Research Program Management Competitive Analysis Product Management Account Management New Business Development Strategic Partnerships Market Analysis Alliance Marketing Partner Programs Co-marketing Go-to-market Strategy Business Development Lead Generation Strategy Business Alliances Cross-functional Team... International Sales Business Strategy Marketing Marketing Strategy Data Center Multi-channel Marketing Product Launch Demand Generation Channel Partners Intel Technical Marketing Semiconductors Mobile Devices Partner Management Sales Enablement Enterprise Software See 19+     See less Product Marketing Market Research Program Management Competitive Analysis Product Management Account Management New Business Development Strategic Partnerships Market Analysis Alliance Marketing Partner Programs Co-marketing Go-to-market Strategy Business Development Lead Generation Strategy Business Alliances Cross-functional Team... International Sales Business Strategy Marketing Marketing Strategy Data Center Multi-channel Marketing Product Launch Demand Generation Channel Partners Intel Technical Marketing Semiconductors Mobile Devices Partner Management Sales Enablement Enterprise Software See 19+     See less ", "Summary David Sekowski is an outgoing and driven Senior Technology Planner & Program Manager with 10 years of experience defining Business Strategy and Products in the Consumer Electronics, Software, and Semiconductor industries. \n \nHe was one of the primary program managers involved in bringing Intel's first coprocessor family (Intel(R) Xeon Phi) to market. He was instrumental in helping Intel achieve 7 TOP500 placements with the #7 performance- and #1 performance-per-watt-systems at the initial launch at SuperComputing 2012. His team’s work also laid the foundation for China’s Tianhe-2 supercomputer – the fastest computer in the world – beating the previous world-record-holder by ~2x. \n \nIn addition to his experience in High Performance and Technical Computing, David has a passion for Consumer-Software, -Media, and especially -Electronics. Regardless of the subject area he has a strong inclination towards system-level thinking to deliver an overall optimized user experience.  \n \nDavid has strategic vision and strong data-founded opinions sourced from a wealth of knowledge about today's rapidly changing technology space. He is a clear, passionate, and skilled communicator who can articulate and abstract deep technical detail into actionable and requisite levels of abstraction based on the audience. He clearly aligns technology and business initiatives and results. He actively builds networks and consensus across functional organizations to create favorable scenarios for internal constituents, external partners, and customers to all succeed. \n \nOverall, David succeeds in delivering exceptional results in highly constrained, fast-paced, and challenging environments through creative problem solving and team building. Finally, he brings a unique and contagious energy that leads, inspires, and motivates the very best out of others to achieve out-sized results. David has a BS in Electrical Engineering with a focus in Semiconductor Physics from University of Illinois at Urbana-Champaign. Summary David Sekowski is an outgoing and driven Senior Technology Planner & Program Manager with 10 years of experience defining Business Strategy and Products in the Consumer Electronics, Software, and Semiconductor industries. \n \nHe was one of the primary program managers involved in bringing Intel's first coprocessor family (Intel(R) Xeon Phi) to market. He was instrumental in helping Intel achieve 7 TOP500 placements with the #7 performance- and #1 performance-per-watt-systems at the initial launch at SuperComputing 2012. His team’s work also laid the foundation for China’s Tianhe-2 supercomputer – the fastest computer in the world – beating the previous world-record-holder by ~2x. \n \nIn addition to his experience in High Performance and Technical Computing, David has a passion for Consumer-Software, -Media, and especially -Electronics. Regardless of the subject area he has a strong inclination towards system-level thinking to deliver an overall optimized user experience.  \n \nDavid has strategic vision and strong data-founded opinions sourced from a wealth of knowledge about today's rapidly changing technology space. He is a clear, passionate, and skilled communicator who can articulate and abstract deep technical detail into actionable and requisite levels of abstraction based on the audience. He clearly aligns technology and business initiatives and results. He actively builds networks and consensus across functional organizations to create favorable scenarios for internal constituents, external partners, and customers to all succeed. \n \nOverall, David succeeds in delivering exceptional results in highly constrained, fast-paced, and challenging environments through creative problem solving and team building. Finally, he brings a unique and contagious energy that leads, inspires, and motivates the very best out of others to achieve out-sized results. David has a BS in Electrical Engineering with a focus in Semiconductor Physics from University of Illinois at Urbana-Champaign. David Sekowski is an outgoing and driven Senior Technology Planner & Program Manager with 10 years of experience defining Business Strategy and Products in the Consumer Electronics, Software, and Semiconductor industries. \n \nHe was one of the primary program managers involved in bringing Intel's first coprocessor family (Intel(R) Xeon Phi) to market. He was instrumental in helping Intel achieve 7 TOP500 placements with the #7 performance- and #1 performance-per-watt-systems at the initial launch at SuperComputing 2012. His team’s work also laid the foundation for China’s Tianhe-2 supercomputer – the fastest computer in the world – beating the previous world-record-holder by ~2x. \n \nIn addition to his experience in High Performance and Technical Computing, David has a passion for Consumer-Software, -Media, and especially -Electronics. Regardless of the subject area he has a strong inclination towards system-level thinking to deliver an overall optimized user experience.  \n \nDavid has strategic vision and strong data-founded opinions sourced from a wealth of knowledge about today's rapidly changing technology space. He is a clear, passionate, and skilled communicator who can articulate and abstract deep technical detail into actionable and requisite levels of abstraction based on the audience. He clearly aligns technology and business initiatives and results. He actively builds networks and consensus across functional organizations to create favorable scenarios for internal constituents, external partners, and customers to all succeed. \n \nOverall, David succeeds in delivering exceptional results in highly constrained, fast-paced, and challenging environments through creative problem solving and team building. Finally, he brings a unique and contagious energy that leads, inspires, and motivates the very best out of others to achieve out-sized results. David has a BS in Electrical Engineering with a focus in Semiconductor Physics from University of Illinois at Urbana-Champaign. David Sekowski is an outgoing and driven Senior Technology Planner & Program Manager with 10 years of experience defining Business Strategy and Products in the Consumer Electronics, Software, and Semiconductor industries. \n \nHe was one of the primary program managers involved in bringing Intel's first coprocessor family (Intel(R) Xeon Phi) to market. He was instrumental in helping Intel achieve 7 TOP500 placements with the #7 performance- and #1 performance-per-watt-systems at the initial launch at SuperComputing 2012. His team’s work also laid the foundation for China’s Tianhe-2 supercomputer – the fastest computer in the world – beating the previous world-record-holder by ~2x. \n \nIn addition to his experience in High Performance and Technical Computing, David has a passion for Consumer-Software, -Media, and especially -Electronics. Regardless of the subject area he has a strong inclination towards system-level thinking to deliver an overall optimized user experience.  \n \nDavid has strategic vision and strong data-founded opinions sourced from a wealth of knowledge about today's rapidly changing technology space. He is a clear, passionate, and skilled communicator who can articulate and abstract deep technical detail into actionable and requisite levels of abstraction based on the audience. He clearly aligns technology and business initiatives and results. He actively builds networks and consensus across functional organizations to create favorable scenarios for internal constituents, external partners, and customers to all succeed. \n \nOverall, David succeeds in delivering exceptional results in highly constrained, fast-paced, and challenging environments through creative problem solving and team building. Finally, he brings a unique and contagious energy that leads, inspires, and motivates the very best out of others to achieve out-sized results. David has a BS in Electrical Engineering with a focus in Semiconductor Physics from University of Illinois at Urbana-Champaign. Experience Technology Planning & Program Manager Apple September 2013  – Present (2 years) Cupertino, CA David moved to Apple to pursue a greater depth of knowledge and breadth of network and experience in consumer technologies. In his new role, he is responsible for system-level hardware and software technology planning for a variety of Apple products spanning Macs, iPads, iPhones, and Accessories. Mobile Software Program Manager Intel Corporation January 2013  –  September 2013  (9 months) Santa Clara, Ca David's last role at Intel was in program management focused on delivering performance and power profiling technologies to software developers in the mobile, embedded, web application, and performance client spaces spanning smartphones, tablets, laptops, and desktops. He was specifically focused on Android developer programs, tools, APIs, SDKs, and ecosystem enabling activities. Intel(R) Xeon Phi Software Program Manager Intel Corporation November 2011  –  April 2013  (1 year 6 months) Santa Clara, CA David was one of the primary senior program managers involved in bringing Intel's first coprocessor family (i.e. Intel(R) Xeon Phi coprocessor family based on Intel(R) Many Integrated Core (Intel(R) MIC) Architecture) to market in late 2012.  \n \nIn this role within Intel's Software & Solution Group, he coordinated all of the 1st and 3rd party software development and enabling including communications stack components, compilers, runtimes, debuggers, and analysis tools. He also took a primary leadership role in driving a cross-organization system-level performance task force that improved system performance >10x. This also generated reliable customer usage models that led to 2x proof points and 8x design wins for launch compared to initial estimates. \n \nHe was instrumental in helping Intel achieve 7 Top 500 placements using 7 different OEM partners within a short launch window leading up to SuperComputing 2012. The highest performing of these systems achieved #7 overall while another achieved #1 in performance-to-energy efficiency while far surpassing the past world-record-holder.  \n \nFinally, David was awarded Intel's top accolade, the Intel Achievement Award, given to ~0.25% of all Intel employees each year for his team's contribution to this immensely successful new product launch. Technical Computing Software Product Manager Intel Corporation May 2009  –  March 2012  (2 years 11 months) Santa Clara, CA Managed business programs and product initiatives for software products to drive market performance. \n \n\tStrategy Determination: Defined product vision through detailed industry analysis to identify market opportunities, competitive differentiators, customer and internal cross-organizational value-drivers.  \n \n\tProduct Management: Managed product lifecycle from concept through end-of-life or long-term maintenance. Coordinated and tracked business success criteria throughout lifecycle. Gathered market and customer requirements with a focus on increasing marketability through key-gap and value-exchange analysis. Developed product definition and roadmap utilizing gathered requirements, feature prioritization, and intercepts for hardware, software, and operating system developments.  \n \n\tMarketing: Coordinated creation and implementation of pricing, packaging, and promotion programs. Created messaging including value propositions, key features and benefits, and competitive positioning. Managed collateral generation including blogs, benchmarks, user training, and co-marketing initiatives. Owned >1-year website initiative to extend department’s lead in developer community building. \n \n\tBusiness Operations: Led cross-functional business review committee managing >$25 million in yearly revenue. Responsible for SEO, pricing, and release coordination optimizations, and developing new business models. Created and led business informatics team to optimize sales process, infrastructure, and reporting to maximize revenue generation efficiency from enabling products and services. Director of Marketing Personify Inc. (formerly Nuvixa Inc.) July 2010  –  December 2010  (6 months) Champaign, IL As part of a personal startup consulting business, David led investment, product management, and marketing activities for Personify Inc. (formerly called Nuvixa Inc.) as their acting Director of Marketing.  \n \nAt the time, Nuvixa was an early stage technology startup focusing in the rapidly developing perceptual computing segment. He helped design and define both a 3D depth sensing hardware camera (e.g. PrimeSense, Microsoft Kinect, etc.) and a software product to provide a unique \"virtual green-screen\" technology. \n \nLed investment, product management, and marketing activities for early stage technology startup. \n \n\tInvestment: Created pitch and due diligence package including market analysis, financial statements, product definition, and plans for sales, marketing, and development – leading to >$1 million Series A.  \n \n\tProduct Management: Contributed to company vision by identifying key markets, user personas, usage models, value propositions, and features. Created implementation plan for minimum viable product.  \n \n\tProduct Marketing: Coordinated web, graphic, and industrial design vendors. Created marketing plan for company and product launch including messaging, content, PR, social, and partner initiatives. Software Business Project Manager Intel Corporation June 2007  –  May 2009  (2 years) Chicago, IL Managed business projects related to product management, marketing and sales to improve coordination. \n \n\tProduct Management: Managed weekly business review and product management committees to ensure tactical alignment of business programs and product launch plans across discipline areas. \n \n\tMarketing: Performed monthly sales, pricing, promotion, and forecasting analysis for entire division covering over 50 products. All forecasting activities tracked within 10% overall yearly. \n \n\tSales: Generated marketing, technical, and press collateral for internal and external customers, as well as press and industry analysts with a focus on target markets, value propositions, and positioning. Sales & Marketing Intern Intel Corporation May 2005  –  February 2007  (1 year 10 months) Schaumburg - Champaign, IL Performed business analytics to create various programs to increase product awareness and sales. \n \n\tFinance: Created financial forecasts and budgeted marketing programs. Analyzed monthly business reports resulting in programs with increases of 10% in repeat purchases and 188% in evaluations YOY. \n \n\tMarketing: Managed customer engagements for co-marketing programs resulting in four case studies and demo content for partners and resellers. Prepared keynote reaching over 5,000 attendees. \n \n\tSales: Implemented team strategy with business development managers growing sales by 600% YOY. Supported financial services manager directly resulting in 70% of total revenue over 3 quarters. Technology Planning & Program Manager Apple September 2013  – Present (2 years) Cupertino, CA David moved to Apple to pursue a greater depth of knowledge and breadth of network and experience in consumer technologies. In his new role, he is responsible for system-level hardware and software technology planning for a variety of Apple products spanning Macs, iPads, iPhones, and Accessories. Technology Planning & Program Manager Apple September 2013  – Present (2 years) Cupertino, CA David moved to Apple to pursue a greater depth of knowledge and breadth of network and experience in consumer technologies. In his new role, he is responsible for system-level hardware and software technology planning for a variety of Apple products spanning Macs, iPads, iPhones, and Accessories. Mobile Software Program Manager Intel Corporation January 2013  –  September 2013  (9 months) Santa Clara, Ca David's last role at Intel was in program management focused on delivering performance and power profiling technologies to software developers in the mobile, embedded, web application, and performance client spaces spanning smartphones, tablets, laptops, and desktops. He was specifically focused on Android developer programs, tools, APIs, SDKs, and ecosystem enabling activities. Mobile Software Program Manager Intel Corporation January 2013  –  September 2013  (9 months) Santa Clara, Ca David's last role at Intel was in program management focused on delivering performance and power profiling technologies to software developers in the mobile, embedded, web application, and performance client spaces spanning smartphones, tablets, laptops, and desktops. He was specifically focused on Android developer programs, tools, APIs, SDKs, and ecosystem enabling activities. Intel(R) Xeon Phi Software Program Manager Intel Corporation November 2011  –  April 2013  (1 year 6 months) Santa Clara, CA David was one of the primary senior program managers involved in bringing Intel's first coprocessor family (i.e. Intel(R) Xeon Phi coprocessor family based on Intel(R) Many Integrated Core (Intel(R) MIC) Architecture) to market in late 2012.  \n \nIn this role within Intel's Software & Solution Group, he coordinated all of the 1st and 3rd party software development and enabling including communications stack components, compilers, runtimes, debuggers, and analysis tools. He also took a primary leadership role in driving a cross-organization system-level performance task force that improved system performance >10x. This also generated reliable customer usage models that led to 2x proof points and 8x design wins for launch compared to initial estimates. \n \nHe was instrumental in helping Intel achieve 7 Top 500 placements using 7 different OEM partners within a short launch window leading up to SuperComputing 2012. The highest performing of these systems achieved #7 overall while another achieved #1 in performance-to-energy efficiency while far surpassing the past world-record-holder.  \n \nFinally, David was awarded Intel's top accolade, the Intel Achievement Award, given to ~0.25% of all Intel employees each year for his team's contribution to this immensely successful new product launch. Intel(R) Xeon Phi Software Program Manager Intel Corporation November 2011  –  April 2013  (1 year 6 months) Santa Clara, CA David was one of the primary senior program managers involved in bringing Intel's first coprocessor family (i.e. Intel(R) Xeon Phi coprocessor family based on Intel(R) Many Integrated Core (Intel(R) MIC) Architecture) to market in late 2012.  \n \nIn this role within Intel's Software & Solution Group, he coordinated all of the 1st and 3rd party software development and enabling including communications stack components, compilers, runtimes, debuggers, and analysis tools. He also took a primary leadership role in driving a cross-organization system-level performance task force that improved system performance >10x. This also generated reliable customer usage models that led to 2x proof points and 8x design wins for launch compared to initial estimates. \n \nHe was instrumental in helping Intel achieve 7 Top 500 placements using 7 different OEM partners within a short launch window leading up to SuperComputing 2012. The highest performing of these systems achieved #7 overall while another achieved #1 in performance-to-energy efficiency while far surpassing the past world-record-holder.  \n \nFinally, David was awarded Intel's top accolade, the Intel Achievement Award, given to ~0.25% of all Intel employees each year for his team's contribution to this immensely successful new product launch. Technical Computing Software Product Manager Intel Corporation May 2009  –  March 2012  (2 years 11 months) Santa Clara, CA Managed business programs and product initiatives for software products to drive market performance. \n \n\tStrategy Determination: Defined product vision through detailed industry analysis to identify market opportunities, competitive differentiators, customer and internal cross-organizational value-drivers.  \n \n\tProduct Management: Managed product lifecycle from concept through end-of-life or long-term maintenance. Coordinated and tracked business success criteria throughout lifecycle. Gathered market and customer requirements with a focus on increasing marketability through key-gap and value-exchange analysis. Developed product definition and roadmap utilizing gathered requirements, feature prioritization, and intercepts for hardware, software, and operating system developments.  \n \n\tMarketing: Coordinated creation and implementation of pricing, packaging, and promotion programs. Created messaging including value propositions, key features and benefits, and competitive positioning. Managed collateral generation including blogs, benchmarks, user training, and co-marketing initiatives. Owned >1-year website initiative to extend department’s lead in developer community building. \n \n\tBusiness Operations: Led cross-functional business review committee managing >$25 million in yearly revenue. Responsible for SEO, pricing, and release coordination optimizations, and developing new business models. Created and led business informatics team to optimize sales process, infrastructure, and reporting to maximize revenue generation efficiency from enabling products and services. Technical Computing Software Product Manager Intel Corporation May 2009  –  March 2012  (2 years 11 months) Santa Clara, CA Managed business programs and product initiatives for software products to drive market performance. \n \n\tStrategy Determination: Defined product vision through detailed industry analysis to identify market opportunities, competitive differentiators, customer and internal cross-organizational value-drivers.  \n \n\tProduct Management: Managed product lifecycle from concept through end-of-life or long-term maintenance. Coordinated and tracked business success criteria throughout lifecycle. Gathered market and customer requirements with a focus on increasing marketability through key-gap and value-exchange analysis. Developed product definition and roadmap utilizing gathered requirements, feature prioritization, and intercepts for hardware, software, and operating system developments.  \n \n\tMarketing: Coordinated creation and implementation of pricing, packaging, and promotion programs. Created messaging including value propositions, key features and benefits, and competitive positioning. Managed collateral generation including blogs, benchmarks, user training, and co-marketing initiatives. Owned >1-year website initiative to extend department’s lead in developer community building. \n \n\tBusiness Operations: Led cross-functional business review committee managing >$25 million in yearly revenue. Responsible for SEO, pricing, and release coordination optimizations, and developing new business models. Created and led business informatics team to optimize sales process, infrastructure, and reporting to maximize revenue generation efficiency from enabling products and services. Director of Marketing Personify Inc. (formerly Nuvixa Inc.) July 2010  –  December 2010  (6 months) Champaign, IL As part of a personal startup consulting business, David led investment, product management, and marketing activities for Personify Inc. (formerly called Nuvixa Inc.) as their acting Director of Marketing.  \n \nAt the time, Nuvixa was an early stage technology startup focusing in the rapidly developing perceptual computing segment. He helped design and define both a 3D depth sensing hardware camera (e.g. PrimeSense, Microsoft Kinect, etc.) and a software product to provide a unique \"virtual green-screen\" technology. \n \nLed investment, product management, and marketing activities for early stage technology startup. \n \n\tInvestment: Created pitch and due diligence package including market analysis, financial statements, product definition, and plans for sales, marketing, and development – leading to >$1 million Series A.  \n \n\tProduct Management: Contributed to company vision by identifying key markets, user personas, usage models, value propositions, and features. Created implementation plan for minimum viable product.  \n \n\tProduct Marketing: Coordinated web, graphic, and industrial design vendors. Created marketing plan for company and product launch including messaging, content, PR, social, and partner initiatives. Director of Marketing Personify Inc. (formerly Nuvixa Inc.) July 2010  –  December 2010  (6 months) Champaign, IL As part of a personal startup consulting business, David led investment, product management, and marketing activities for Personify Inc. (formerly called Nuvixa Inc.) as their acting Director of Marketing.  \n \nAt the time, Nuvixa was an early stage technology startup focusing in the rapidly developing perceptual computing segment. He helped design and define both a 3D depth sensing hardware camera (e.g. PrimeSense, Microsoft Kinect, etc.) and a software product to provide a unique \"virtual green-screen\" technology. \n \nLed investment, product management, and marketing activities for early stage technology startup. \n \n\tInvestment: Created pitch and due diligence package including market analysis, financial statements, product definition, and plans for sales, marketing, and development – leading to >$1 million Series A.  \n \n\tProduct Management: Contributed to company vision by identifying key markets, user personas, usage models, value propositions, and features. Created implementation plan for minimum viable product.  \n \n\tProduct Marketing: Coordinated web, graphic, and industrial design vendors. Created marketing plan for company and product launch including messaging, content, PR, social, and partner initiatives. Software Business Project Manager Intel Corporation June 2007  –  May 2009  (2 years) Chicago, IL Managed business projects related to product management, marketing and sales to improve coordination. \n \n\tProduct Management: Managed weekly business review and product management committees to ensure tactical alignment of business programs and product launch plans across discipline areas. \n \n\tMarketing: Performed monthly sales, pricing, promotion, and forecasting analysis for entire division covering over 50 products. All forecasting activities tracked within 10% overall yearly. \n \n\tSales: Generated marketing, technical, and press collateral for internal and external customers, as well as press and industry analysts with a focus on target markets, value propositions, and positioning. Software Business Project Manager Intel Corporation June 2007  –  May 2009  (2 years) Chicago, IL Managed business projects related to product management, marketing and sales to improve coordination. \n \n\tProduct Management: Managed weekly business review and product management committees to ensure tactical alignment of business programs and product launch plans across discipline areas. \n \n\tMarketing: Performed monthly sales, pricing, promotion, and forecasting analysis for entire division covering over 50 products. All forecasting activities tracked within 10% overall yearly. \n \n\tSales: Generated marketing, technical, and press collateral for internal and external customers, as well as press and industry analysts with a focus on target markets, value propositions, and positioning. Sales & Marketing Intern Intel Corporation May 2005  –  February 2007  (1 year 10 months) Schaumburg - Champaign, IL Performed business analytics to create various programs to increase product awareness and sales. \n \n\tFinance: Created financial forecasts and budgeted marketing programs. Analyzed monthly business reports resulting in programs with increases of 10% in repeat purchases and 188% in evaluations YOY. \n \n\tMarketing: Managed customer engagements for co-marketing programs resulting in four case studies and demo content for partners and resellers. Prepared keynote reaching over 5,000 attendees. \n \n\tSales: Implemented team strategy with business development managers growing sales by 600% YOY. Supported financial services manager directly resulting in 70% of total revenue over 3 quarters. Sales & Marketing Intern Intel Corporation May 2005  –  February 2007  (1 year 10 months) Schaumburg - Champaign, IL Performed business analytics to create various programs to increase product awareness and sales. \n \n\tFinance: Created financial forecasts and budgeted marketing programs. Analyzed monthly business reports resulting in programs with increases of 10% in repeat purchases and 188% in evaluations YOY. \n \n\tMarketing: Managed customer engagements for co-marketing programs resulting in four case studies and demo content for partners and resellers. Prepared keynote reaching over 5,000 attendees. \n \n\tSales: Implemented team strategy with business development managers growing sales by 600% YOY. Supported financial services manager directly resulting in 70% of total revenue over 3 quarters. Languages   Skills Product Management Cross-functional Team... Intel Product Marketing Go-to-market Strategy Software Development High Performance... Program Management Parallel Programming Competitive Analysis New Business Development Software Project... Software Engineering Parallel Computing Strategy Project Management Product Lifecycle... Business Strategy Introducing New Products Microsoft Office Product Development Marketing Marketing Strategy Marketing Research Business Information Business Analysis Business Process Business Planning Business Process... Product Launch Microsoft Excel Microsoft Word PowerPoint Visio MS Project Android Financial Analysis Financial Reporting Financial Modeling Due Diligence Start-up Consulting Process Improvement Leadership Forecasting Segmentation Market Sizing Pricing Semiconductor Industry Entrepreneurship Start-ups See 35+     See less Skills  Product Management Cross-functional Team... Intel Product Marketing Go-to-market Strategy Software Development High Performance... Program Management Parallel Programming Competitive Analysis New Business Development Software Project... Software Engineering Parallel Computing Strategy Project Management Product Lifecycle... Business Strategy Introducing New Products Microsoft Office Product Development Marketing Marketing Strategy Marketing Research Business Information Business Analysis Business Process Business Planning Business Process... Product Launch Microsoft Excel Microsoft Word PowerPoint Visio MS Project Android Financial Analysis Financial Reporting Financial Modeling Due Diligence Start-up Consulting Process Improvement Leadership Forecasting Segmentation Market Sizing Pricing Semiconductor Industry Entrepreneurship Start-ups See 35+     See less Product Management Cross-functional Team... Intel Product Marketing Go-to-market Strategy Software Development High Performance... Program Management Parallel Programming Competitive Analysis New Business Development Software Project... Software Engineering Parallel Computing Strategy Project Management Product Lifecycle... Business Strategy Introducing New Products Microsoft Office Product Development Marketing Marketing Strategy Marketing Research Business Information Business Analysis Business Process Business Planning Business Process... Product Launch Microsoft Excel Microsoft Word PowerPoint Visio MS Project Android Financial Analysis Financial Reporting Financial Modeling Due Diligence Start-up Consulting Process Improvement Leadership Forecasting Segmentation Market Sizing Pricing Semiconductor Industry Entrepreneurship Start-ups See 35+     See less Product Management Cross-functional Team... Intel Product Marketing Go-to-market Strategy Software Development High Performance... Program Management Parallel Programming Competitive Analysis New Business Development Software Project... Software Engineering Parallel Computing Strategy Project Management Product Lifecycle... Business Strategy Introducing New Products Microsoft Office Product Development Marketing Marketing Strategy Marketing Research Business Information Business Analysis Business Process Business Planning Business Process... Product Launch Microsoft Excel Microsoft Word PowerPoint Visio MS Project Android Financial Analysis Financial Reporting Financial Modeling Due Diligence Start-up Consulting Process Improvement Leadership Forecasting Segmentation Market Sizing Pricing Semiconductor Industry Entrepreneurship Start-ups See 35+     See less Education University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Electrical Engineering (Semiconductor Physics) Activities and Societies:  Office of Technical Consulting Resources (OTCR) ,  Illinois Business Consulting (IBC) ,  The Golder Center for Venture Capital & Private Equity Wheaton North University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Electrical Engineering (Semiconductor Physics) Activities and Societies:  Office of Technical Consulting Resources (OTCR) ,  Illinois Business Consulting (IBC) ,  The Golder Center for Venture Capital & Private Equity University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Electrical Engineering (Semiconductor Physics) Activities and Societies:  Office of Technical Consulting Resources (OTCR) ,  Illinois Business Consulting (IBC) ,  The Golder Center for Venture Capital & Private Equity University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Electrical Engineering (Semiconductor Physics) Activities and Societies:  Office of Technical Consulting Resources (OTCR) ,  Illinois Business Consulting (IBC) ,  The Golder Center for Venture Capital & Private Equity Wheaton North Wheaton North Wheaton North Honors & Awards Intel Achievement Award Intel Corporation May 2013 David is one of the youngest recipients of the prestigious Intel Achievement Award for his work in coordinating the software development, execution, delivery, enabling, and marketing activities in Intel's Software and Solution Group to successfully launch Intel's first coprocessor family: Intel(R) Xeon Phi based on Intel(R) MIC Architecture at SuperComputing 2012. Intel Achievement Award Intel Corporation May 2013 David is one of the youngest recipients of the prestigious Intel Achievement Award for his work in coordinating the software development, execution, delivery, enabling, and marketing activities in Intel's Software and Solution Group to successfully launch Intel's first coprocessor family: Intel(R) Xeon Phi based on Intel(R) MIC Architecture at SuperComputing 2012. Intel Achievement Award Intel Corporation May 2013 David is one of the youngest recipients of the prestigious Intel Achievement Award for his work in coordinating the software development, execution, delivery, enabling, and marketing activities in Intel's Software and Solution Group to successfully launch Intel's first coprocessor family: Intel(R) Xeon Phi based on Intel(R) MIC Architecture at SuperComputing 2012. Intel Achievement Award Intel Corporation May 2013 David is one of the youngest recipients of the prestigious Intel Achievement Award for his work in coordinating the software development, execution, delivery, enabling, and marketing activities in Intel's Software and Solution Group to successfully launch Intel's first coprocessor family: Intel(R) Xeon Phi based on Intel(R) MIC Architecture at SuperComputing 2012. ", "Summary •\tCustomer Skills: Experience working in service/consulting organizations and managing customer relationships.  \n•\tCollaborative & Cross-functional Skills: Able to lead cross-functional teams from engineering, marketing, sales, etc. for new initiatives and customer engagements.  \n•\tExtensive International Experience: Several years of working experience with international teams and customers. Managed a team with staff in China, EMEA, and the US. Bi-lingual and have a multi-cultural upbringing.  \n•\tKnowledge of both Software & Hardware Industries: Worked extensively with both software & hardware companies throughout my career. Summary •\tCustomer Skills: Experience working in service/consulting organizations and managing customer relationships.  \n•\tCollaborative & Cross-functional Skills: Able to lead cross-functional teams from engineering, marketing, sales, etc. for new initiatives and customer engagements.  \n•\tExtensive International Experience: Several years of working experience with international teams and customers. Managed a team with staff in China, EMEA, and the US. Bi-lingual and have a multi-cultural upbringing.  \n•\tKnowledge of both Software & Hardware Industries: Worked extensively with both software & hardware companies throughout my career. •\tCustomer Skills: Experience working in service/consulting organizations and managing customer relationships.  \n•\tCollaborative & Cross-functional Skills: Able to lead cross-functional teams from engineering, marketing, sales, etc. for new initiatives and customer engagements.  \n•\tExtensive International Experience: Several years of working experience with international teams and customers. Managed a team with staff in China, EMEA, and the US. Bi-lingual and have a multi-cultural upbringing.  \n•\tKnowledge of both Software & Hardware Industries: Worked extensively with both software & hardware companies throughout my career. •\tCustomer Skills: Experience working in service/consulting organizations and managing customer relationships.  \n•\tCollaborative & Cross-functional Skills: Able to lead cross-functional teams from engineering, marketing, sales, etc. for new initiatives and customer engagements.  \n•\tExtensive International Experience: Several years of working experience with international teams and customers. Managed a team with staff in China, EMEA, and the US. Bi-lingual and have a multi-cultural upbringing.  \n•\tKnowledge of both Software & Hardware Industries: Worked extensively with both software & hardware companies throughout my career. Experience Client Services Manager The Linux Foundation June 2014  – Present (1 year 3 months) Sr. Client Services Manager Medallia, Inc. July 2011  –  May 2014  (2 years 11 months) Palo Alto, CA Managing a team of managers and analysts who are responsible for customer success at Medallia. Graphics Developer Relations Manager Intel Corporation April 2007  –  July 2011  (4 years 4 months) Responsible for managing the graphics enabling program for PC game and workstation application developers Technical Marketing Manager Intel Corporation August 2004  –  March 2007  (2 years 8 months) Responsible for managing a technical marketing team in the US, EMEA, and China for the Channel Platform Solutions Group (CPSG) Product Line Manager Intel Corportion October 2000  –  July 2004  (3 years 10 months) Responsible for developing & managing technical consulting services for the Intel Solution Services (ISS) Server Software Program Manager Intel Corporation June 1997  –  April 2000  (2 years 11 months) Responsible for enabling Independent Software Vendors (ISVs) and end-users to port and develop their software for up-coming Intel Architecture processors Software Engineer EDS May 1991  –  July 1995  (4 years 3 months) Deployment of ERP and relational database solutions in the manufacturing industry Client Services Manager The Linux Foundation June 2014  – Present (1 year 3 months) Client Services Manager The Linux Foundation June 2014  – Present (1 year 3 months) Sr. Client Services Manager Medallia, Inc. July 2011  –  May 2014  (2 years 11 months) Palo Alto, CA Managing a team of managers and analysts who are responsible for customer success at Medallia. Sr. Client Services Manager Medallia, Inc. July 2011  –  May 2014  (2 years 11 months) Palo Alto, CA Managing a team of managers and analysts who are responsible for customer success at Medallia. Graphics Developer Relations Manager Intel Corporation April 2007  –  July 2011  (4 years 4 months) Responsible for managing the graphics enabling program for PC game and workstation application developers Graphics Developer Relations Manager Intel Corporation April 2007  –  July 2011  (4 years 4 months) Responsible for managing the graphics enabling program for PC game and workstation application developers Technical Marketing Manager Intel Corporation August 2004  –  March 2007  (2 years 8 months) Responsible for managing a technical marketing team in the US, EMEA, and China for the Channel Platform Solutions Group (CPSG) Technical Marketing Manager Intel Corporation August 2004  –  March 2007  (2 years 8 months) Responsible for managing a technical marketing team in the US, EMEA, and China for the Channel Platform Solutions Group (CPSG) Product Line Manager Intel Corportion October 2000  –  July 2004  (3 years 10 months) Responsible for developing & managing technical consulting services for the Intel Solution Services (ISS) Product Line Manager Intel Corportion October 2000  –  July 2004  (3 years 10 months) Responsible for developing & managing technical consulting services for the Intel Solution Services (ISS) Server Software Program Manager Intel Corporation June 1997  –  April 2000  (2 years 11 months) Responsible for enabling Independent Software Vendors (ISVs) and end-users to port and develop their software for up-coming Intel Architecture processors Server Software Program Manager Intel Corporation June 1997  –  April 2000  (2 years 11 months) Responsible for enabling Independent Software Vendors (ISVs) and end-users to port and develop their software for up-coming Intel Architecture processors Software Engineer EDS May 1991  –  July 1995  (4 years 3 months) Deployment of ERP and relational database solutions in the manufacturing industry Software Engineer EDS May 1991  –  July 1995  (4 years 3 months) Deployment of ERP and relational database solutions in the manufacturing industry Languages Korean Korean Korean Skills Enterprise Software Product Management Customer Engagement Cross-functional Team... Account Management Team Management Program Management CEM International Business Analytics ERP SaaS Consulting Open Source Software Go-to-market Strategy Cloud Computing Product Marketing Start-ups Technical Marketing See 4+     See less Skills  Enterprise Software Product Management Customer Engagement Cross-functional Team... Account Management Team Management Program Management CEM International Business Analytics ERP SaaS Consulting Open Source Software Go-to-market Strategy Cloud Computing Product Marketing Start-ups Technical Marketing See 4+     See less Enterprise Software Product Management Customer Engagement Cross-functional Team... Account Management Team Management Program Management CEM International Business Analytics ERP SaaS Consulting Open Source Software Go-to-market Strategy Cloud Computing Product Marketing Start-ups Technical Marketing See 4+     See less Enterprise Software Product Management Customer Engagement Cross-functional Team... Account Management Team Management Program Management CEM International Business Analytics ERP SaaS Consulting Open Source Software Go-to-market Strategy Cloud Computing Product Marketing Start-ups Technical Marketing See 4+     See less Education Carnegie Mellon University - Tepper School of Business Master of Business Administration (MBA) Activities and Societies:  Intramural soccer University of Washington Bachelor of Science (B.S.),  Mathematics Activities and Societies:  Phi Beta Kappa Carnegie Mellon University - Tepper School of Business Master of Business Administration (MBA) Activities and Societies:  Intramural soccer Carnegie Mellon University - Tepper School of Business Master of Business Administration (MBA) Activities and Societies:  Intramural soccer Carnegie Mellon University - Tepper School of Business Master of Business Administration (MBA) Activities and Societies:  Intramural soccer University of Washington Bachelor of Science (B.S.),  Mathematics Activities and Societies:  Phi Beta Kappa University of Washington Bachelor of Science (B.S.),  Mathematics Activities and Societies:  Phi Beta Kappa University of Washington Bachelor of Science (B.S.),  Mathematics Activities and Societies:  Phi Beta Kappa Honors & Awards Additional Honors & Awards Phi Beta Kappa National Honor Society Additional Honors & Awards Phi Beta Kappa National Honor Society Additional Honors & Awards Phi Beta Kappa National Honor Society Additional Honors & Awards Phi Beta Kappa National Honor Society ", "Summary A highly motivated, results-oriented professional with vast global marketing and product management experience. Demonstrated experience in new market development, program management, product development and planning, and Electrical and Software Engineering. Proven track record of developing high performing teams and working effectively with multiple disciplines; engineering, sales, marketing, finance, and senior executives with the ability to coordinate geographically disperse teams to accomplish objectives. Specialties:Strategy Creation, Program Mangement, Market Development, Emerging Markets, Budgeting, Marketing Management, Product Development, Fraud Prevention, Information Systems, Knowledge Management, Software Engineering, Process Re-Engineering Summary A highly motivated, results-oriented professional with vast global marketing and product management experience. Demonstrated experience in new market development, program management, product development and planning, and Electrical and Software Engineering. Proven track record of developing high performing teams and working effectively with multiple disciplines; engineering, sales, marketing, finance, and senior executives with the ability to coordinate geographically disperse teams to accomplish objectives. Specialties:Strategy Creation, Program Mangement, Market Development, Emerging Markets, Budgeting, Marketing Management, Product Development, Fraud Prevention, Information Systems, Knowledge Management, Software Engineering, Process Re-Engineering A highly motivated, results-oriented professional with vast global marketing and product management experience. Demonstrated experience in new market development, program management, product development and planning, and Electrical and Software Engineering. Proven track record of developing high performing teams and working effectively with multiple disciplines; engineering, sales, marketing, finance, and senior executives with the ability to coordinate geographically disperse teams to accomplish objectives. Specialties:Strategy Creation, Program Mangement, Market Development, Emerging Markets, Budgeting, Marketing Management, Product Development, Fraud Prevention, Information Systems, Knowledge Management, Software Engineering, Process Re-Engineering A highly motivated, results-oriented professional with vast global marketing and product management experience. Demonstrated experience in new market development, program management, product development and planning, and Electrical and Software Engineering. Proven track record of developing high performing teams and working effectively with multiple disciplines; engineering, sales, marketing, finance, and senior executives with the ability to coordinate geographically disperse teams to accomplish objectives. Specialties:Strategy Creation, Program Mangement, Market Development, Emerging Markets, Budgeting, Marketing Management, Product Development, Fraud Prevention, Information Systems, Knowledge Management, Software Engineering, Process Re-Engineering Experience President, Board of Directors Folsom Cordova Education Foundation September 2010  – Present (5 years) Starting in April 2009, an idea to start an Education Foundation to help bring 21st Century Skills to our Children in the Folsom-Cordova School District was brought to life. I was at that first meeting, joined the steering committee to help start and set the direction for this foundation, and was later nominated and then elected to the Board of Directors. At the first meeting, was voted in as a Vice President of the Board and now have been elected to the President of the Board. Here is the mission statement of the foundation: \n \nThe Folsom Cordova Education Foundation is a 501 c(3) non-profit organization that will enhance and expand opportunities to provide all Folsom Cordova Unified School District students with innovative programs that prepare them to succeed in a global society. Through productive partnerships and financial support from businesses, private donors, and the community, the Folsom Cordova Education Foundation’s funds will support an educational environment that is results oriented and will inspire the desire for lifelong learning and innovation. Regional Manager - Classmate PC Mature Markets Ecosystem Intel January 2008  – Present (7 years 8 months) Responsible for all geographic activities for the Intel powered classmate PC program in Mature markets; focusing on US and Canada. Managing a strategic team that is delivering a robust end to end education solution Ecosystem by bringing together leaders in the education market to enable the transformation of Education in mature markets like the US through the classmate PC platform. Additionally, delivering the scale needed to take US based programs to worldwide market reach. Senior Graduate Professor Keller Graduate School of Management March 2005  – Present (10 years 6 months) Senior Graduate Professor at Keller Graduate School of Management. Promoted to Senior Faculty May 2009. Classes being taught: \n- Management of Information Systems \n- Applied Managerial Statistics \n- International Business \n- Leadership and Organization Behavior \n- Marketing Management \n- Project/Risk Management \n- Consumer Behavior \n- eCommerce \n- Managing Quality Vice President, Board of Directors Folsom Cordova Education Foundation August 2009  –  September 2010  (1 year 2 months) Starting in April 2009, an idea to start an Education Foundation to help bring 21st Century Skills to our Children in the Folsom-Cordova School District was brought to life. I was at that first meeting, joined the steering committee to help start and set the direction for this foundation, and was later nominated and then elected to the Board of Directors. At the first meeting, was voted in as a Vice President of the Board. Here is the mission statement of the foundation: \n \nThe Folsom Cordova Education Foundation is a 501 c(3) non-profit organization that will enhance and expand opportunities to provide all Folsom Cordova Unified School District students with innovative programs that prepare them to succeed in a global society. Through productive partnerships and financial support from businesses, private donors, and the community, the Folsom Cordova Education Foundation’s funds will support an educational environment that is results oriented and will inspire the desire for lifelong learning and innovation. Anti-Remark Specialist Intel Corporation 1998  –  January 2009  (11 years) Developed an anti-fraud program for Intel’s microprocessor products saving Intel $500 Million of exposure per year. Additionally, provided technical expertise and witness testimony to law enforcement. Awarded an Intel Achievement Award for this effort. Strategic Market/Product Development Manager Intel Corporation January 2006  –  January 2008  (2 years 1 month) Responsible for developing new market product strategies and new distribution models for a $1B product group focusing on developing unique computing platforms for emerging markets. Managed a virtual team of five geographically disperse business development managers. \n \n- Built a powerful team that supported market dev functions in China, South East Asia, India, Middle East, Turkey, Africa, and Latin America. \n- Developed radical new business model utilizing Non-Government Organizations and Development Agencies as an agent for Intel’s new unique platforms focusing on developing new channels to deliver platforms, information, and funding. \n- Delivered strategic plan for penetrating rural low power computing market allowing Intel to grow new market potential within a year estimated at 1.4 Million units. \n- Delivered a radical new approach to managing product requirements for Classmate PC program (affordable laptop for children) and drove a standarization of core software stack components. Platform Manager Intel Corporation July 2004  –  January 2006  (1 year 7 months) Responsible for delivering new and unique platforms for emerging markets including; managing the development of the platforms, go-to-market strategy, marketing/sales collaterals, product launches, promotions, and ecosystem development. Managed a worldwide virtual team of 50+ people spanning multiple organizations and disciplines from product development to launch and ramp. \n \n- Delivered, launched, and ramped first emerging market specific platform to China focused on Internet Cafe Market, exceeding sales target for 2005, delivering an incremental $50 million revenue. Awarded an Intel Achievement Award, Intel’s highest honor, for this effort. \n- Drove successful country expansion plan that delivered the Internet Café platform to the next top markets doubling sales in one year. Technical Assistant to VP Intel Corporation January 2004  –  December 2004  (1 year) Provided \"Chief of Staff\" services for the Vice President of our Reseller Channel Group. Worked with VP to create a strategy to address needs of emerging markets and helped to create a new organization at Intel that expands Intel's growth and total available market by opening access to the next billion computer users. \n \n- Instrumental in helping to grow, as group Vice President’s technical advisor, a grass-roots group at Intel focused on a new emerging market strategy to deliver an incremental $1 billion per year in revenue via unique computing platforms. \n- Produced new organization business plan and assisted in the setup of operations in US, China, Brazil, India, and Egypt. Strategic Software Program Manager Intel Corporation March 2001  –  January 2004  (2 years 11 months) Responsible for all new software application product management that supported Intel’s channel business, including customer engagement, requirements management, software process efficiency, development team deliverables, and final product launch and delivery. Managed a team of 7 sr. software engineers to create a pioneering new SW methodology and deliver innovative products in weeks instead of months/years. \n \n- Developed new and improved MIS for Intel’s supply chain management and silicon component-build schedules which delivered $85 million and grew user productivity 500% with a minimal investment of $500k. \n- Contributed to server product sales growth of 56% 2004 over 2005 by delivering an online tool to assist customers in matching server component compatibility pre-sales. \n- Drove team to deliver a 9x compounded productivity increase in team output as measured by delivered customer requirements per month per head in just two years, winning 2 Intel Software Quality Awards. Software Engineering Validation Manager Intel Corporation September 1999  –  March 2001  (1 year 7 months) Managed a team of eleven software validation engineers that delivered software products for Intel’s Reseller Channel. Senior Software Engineer Intel Corporation August 1997  –  September 1999  (2 years 2 months) Designed and invented key software products for Intel’s channel customers including our graphics card business and CPU business. Product Development Engineer Intel Corporation October 1993  –  August 1997  (3 years 11 months) Engineered unique technical solutions to enable Intel’s OverDrive™ CPU Product Line business. Work created a business to upgrade old systems with the newest technology. Co-Op Engineer Intel Corporation September 1991  –  September 1992  (1 year 1 month) Co-Op Engineering position working in the field sales office to support customer technical issues. Co-Op Engineer Ekohwerks December 1989  –  June 1991  (1 year 7 months) Co-Op Engineering position working with the design team on their Orbital Tube Welder product lines. President, Board of Directors Folsom Cordova Education Foundation September 2010  – Present (5 years) Starting in April 2009, an idea to start an Education Foundation to help bring 21st Century Skills to our Children in the Folsom-Cordova School District was brought to life. I was at that first meeting, joined the steering committee to help start and set the direction for this foundation, and was later nominated and then elected to the Board of Directors. At the first meeting, was voted in as a Vice President of the Board and now have been elected to the President of the Board. Here is the mission statement of the foundation: \n \nThe Folsom Cordova Education Foundation is a 501 c(3) non-profit organization that will enhance and expand opportunities to provide all Folsom Cordova Unified School District students with innovative programs that prepare them to succeed in a global society. Through productive partnerships and financial support from businesses, private donors, and the community, the Folsom Cordova Education Foundation’s funds will support an educational environment that is results oriented and will inspire the desire for lifelong learning and innovation. President, Board of Directors Folsom Cordova Education Foundation September 2010  – Present (5 years) Starting in April 2009, an idea to start an Education Foundation to help bring 21st Century Skills to our Children in the Folsom-Cordova School District was brought to life. I was at that first meeting, joined the steering committee to help start and set the direction for this foundation, and was later nominated and then elected to the Board of Directors. At the first meeting, was voted in as a Vice President of the Board and now have been elected to the President of the Board. Here is the mission statement of the foundation: \n \nThe Folsom Cordova Education Foundation is a 501 c(3) non-profit organization that will enhance and expand opportunities to provide all Folsom Cordova Unified School District students with innovative programs that prepare them to succeed in a global society. Through productive partnerships and financial support from businesses, private donors, and the community, the Folsom Cordova Education Foundation’s funds will support an educational environment that is results oriented and will inspire the desire for lifelong learning and innovation. Regional Manager - Classmate PC Mature Markets Ecosystem Intel January 2008  – Present (7 years 8 months) Responsible for all geographic activities for the Intel powered classmate PC program in Mature markets; focusing on US and Canada. Managing a strategic team that is delivering a robust end to end education solution Ecosystem by bringing together leaders in the education market to enable the transformation of Education in mature markets like the US through the classmate PC platform. Additionally, delivering the scale needed to take US based programs to worldwide market reach. Regional Manager - Classmate PC Mature Markets Ecosystem Intel January 2008  – Present (7 years 8 months) Responsible for all geographic activities for the Intel powered classmate PC program in Mature markets; focusing on US and Canada. Managing a strategic team that is delivering a robust end to end education solution Ecosystem by bringing together leaders in the education market to enable the transformation of Education in mature markets like the US through the classmate PC platform. Additionally, delivering the scale needed to take US based programs to worldwide market reach. Senior Graduate Professor Keller Graduate School of Management March 2005  – Present (10 years 6 months) Senior Graduate Professor at Keller Graduate School of Management. Promoted to Senior Faculty May 2009. Classes being taught: \n- Management of Information Systems \n- Applied Managerial Statistics \n- International Business \n- Leadership and Organization Behavior \n- Marketing Management \n- Project/Risk Management \n- Consumer Behavior \n- eCommerce \n- Managing Quality Senior Graduate Professor Keller Graduate School of Management March 2005  – Present (10 years 6 months) Senior Graduate Professor at Keller Graduate School of Management. Promoted to Senior Faculty May 2009. Classes being taught: \n- Management of Information Systems \n- Applied Managerial Statistics \n- International Business \n- Leadership and Organization Behavior \n- Marketing Management \n- Project/Risk Management \n- Consumer Behavior \n- eCommerce \n- Managing Quality Vice President, Board of Directors Folsom Cordova Education Foundation August 2009  –  September 2010  (1 year 2 months) Starting in April 2009, an idea to start an Education Foundation to help bring 21st Century Skills to our Children in the Folsom-Cordova School District was brought to life. I was at that first meeting, joined the steering committee to help start and set the direction for this foundation, and was later nominated and then elected to the Board of Directors. At the first meeting, was voted in as a Vice President of the Board. Here is the mission statement of the foundation: \n \nThe Folsom Cordova Education Foundation is a 501 c(3) non-profit organization that will enhance and expand opportunities to provide all Folsom Cordova Unified School District students with innovative programs that prepare them to succeed in a global society. Through productive partnerships and financial support from businesses, private donors, and the community, the Folsom Cordova Education Foundation’s funds will support an educational environment that is results oriented and will inspire the desire for lifelong learning and innovation. Vice President, Board of Directors Folsom Cordova Education Foundation August 2009  –  September 2010  (1 year 2 months) Starting in April 2009, an idea to start an Education Foundation to help bring 21st Century Skills to our Children in the Folsom-Cordova School District was brought to life. I was at that first meeting, joined the steering committee to help start and set the direction for this foundation, and was later nominated and then elected to the Board of Directors. At the first meeting, was voted in as a Vice President of the Board. Here is the mission statement of the foundation: \n \nThe Folsom Cordova Education Foundation is a 501 c(3) non-profit organization that will enhance and expand opportunities to provide all Folsom Cordova Unified School District students with innovative programs that prepare them to succeed in a global society. Through productive partnerships and financial support from businesses, private donors, and the community, the Folsom Cordova Education Foundation’s funds will support an educational environment that is results oriented and will inspire the desire for lifelong learning and innovation. Anti-Remark Specialist Intel Corporation 1998  –  January 2009  (11 years) Developed an anti-fraud program for Intel’s microprocessor products saving Intel $500 Million of exposure per year. Additionally, provided technical expertise and witness testimony to law enforcement. Awarded an Intel Achievement Award for this effort. Anti-Remark Specialist Intel Corporation 1998  –  January 2009  (11 years) Developed an anti-fraud program for Intel’s microprocessor products saving Intel $500 Million of exposure per year. Additionally, provided technical expertise and witness testimony to law enforcement. Awarded an Intel Achievement Award for this effort. Strategic Market/Product Development Manager Intel Corporation January 2006  –  January 2008  (2 years 1 month) Responsible for developing new market product strategies and new distribution models for a $1B product group focusing on developing unique computing platforms for emerging markets. Managed a virtual team of five geographically disperse business development managers. \n \n- Built a powerful team that supported market dev functions in China, South East Asia, India, Middle East, Turkey, Africa, and Latin America. \n- Developed radical new business model utilizing Non-Government Organizations and Development Agencies as an agent for Intel’s new unique platforms focusing on developing new channels to deliver platforms, information, and funding. \n- Delivered strategic plan for penetrating rural low power computing market allowing Intel to grow new market potential within a year estimated at 1.4 Million units. \n- Delivered a radical new approach to managing product requirements for Classmate PC program (affordable laptop for children) and drove a standarization of core software stack components. Strategic Market/Product Development Manager Intel Corporation January 2006  –  January 2008  (2 years 1 month) Responsible for developing new market product strategies and new distribution models for a $1B product group focusing on developing unique computing platforms for emerging markets. Managed a virtual team of five geographically disperse business development managers. \n \n- Built a powerful team that supported market dev functions in China, South East Asia, India, Middle East, Turkey, Africa, and Latin America. \n- Developed radical new business model utilizing Non-Government Organizations and Development Agencies as an agent for Intel’s new unique platforms focusing on developing new channels to deliver platforms, information, and funding. \n- Delivered strategic plan for penetrating rural low power computing market allowing Intel to grow new market potential within a year estimated at 1.4 Million units. \n- Delivered a radical new approach to managing product requirements for Classmate PC program (affordable laptop for children) and drove a standarization of core software stack components. Platform Manager Intel Corporation July 2004  –  January 2006  (1 year 7 months) Responsible for delivering new and unique platforms for emerging markets including; managing the development of the platforms, go-to-market strategy, marketing/sales collaterals, product launches, promotions, and ecosystem development. Managed a worldwide virtual team of 50+ people spanning multiple organizations and disciplines from product development to launch and ramp. \n \n- Delivered, launched, and ramped first emerging market specific platform to China focused on Internet Cafe Market, exceeding sales target for 2005, delivering an incremental $50 million revenue. Awarded an Intel Achievement Award, Intel’s highest honor, for this effort. \n- Drove successful country expansion plan that delivered the Internet Café platform to the next top markets doubling sales in one year. Platform Manager Intel Corporation July 2004  –  January 2006  (1 year 7 months) Responsible for delivering new and unique platforms for emerging markets including; managing the development of the platforms, go-to-market strategy, marketing/sales collaterals, product launches, promotions, and ecosystem development. Managed a worldwide virtual team of 50+ people spanning multiple organizations and disciplines from product development to launch and ramp. \n \n- Delivered, launched, and ramped first emerging market specific platform to China focused on Internet Cafe Market, exceeding sales target for 2005, delivering an incremental $50 million revenue. Awarded an Intel Achievement Award, Intel’s highest honor, for this effort. \n- Drove successful country expansion plan that delivered the Internet Café platform to the next top markets doubling sales in one year. Technical Assistant to VP Intel Corporation January 2004  –  December 2004  (1 year) Provided \"Chief of Staff\" services for the Vice President of our Reseller Channel Group. Worked with VP to create a strategy to address needs of emerging markets and helped to create a new organization at Intel that expands Intel's growth and total available market by opening access to the next billion computer users. \n \n- Instrumental in helping to grow, as group Vice President’s technical advisor, a grass-roots group at Intel focused on a new emerging market strategy to deliver an incremental $1 billion per year in revenue via unique computing platforms. \n- Produced new organization business plan and assisted in the setup of operations in US, China, Brazil, India, and Egypt. Technical Assistant to VP Intel Corporation January 2004  –  December 2004  (1 year) Provided \"Chief of Staff\" services for the Vice President of our Reseller Channel Group. Worked with VP to create a strategy to address needs of emerging markets and helped to create a new organization at Intel that expands Intel's growth and total available market by opening access to the next billion computer users. \n \n- Instrumental in helping to grow, as group Vice President’s technical advisor, a grass-roots group at Intel focused on a new emerging market strategy to deliver an incremental $1 billion per year in revenue via unique computing platforms. \n- Produced new organization business plan and assisted in the setup of operations in US, China, Brazil, India, and Egypt. Strategic Software Program Manager Intel Corporation March 2001  –  January 2004  (2 years 11 months) Responsible for all new software application product management that supported Intel’s channel business, including customer engagement, requirements management, software process efficiency, development team deliverables, and final product launch and delivery. Managed a team of 7 sr. software engineers to create a pioneering new SW methodology and deliver innovative products in weeks instead of months/years. \n \n- Developed new and improved MIS for Intel’s supply chain management and silicon component-build schedules which delivered $85 million and grew user productivity 500% with a minimal investment of $500k. \n- Contributed to server product sales growth of 56% 2004 over 2005 by delivering an online tool to assist customers in matching server component compatibility pre-sales. \n- Drove team to deliver a 9x compounded productivity increase in team output as measured by delivered customer requirements per month per head in just two years, winning 2 Intel Software Quality Awards. Strategic Software Program Manager Intel Corporation March 2001  –  January 2004  (2 years 11 months) Responsible for all new software application product management that supported Intel’s channel business, including customer engagement, requirements management, software process efficiency, development team deliverables, and final product launch and delivery. Managed a team of 7 sr. software engineers to create a pioneering new SW methodology and deliver innovative products in weeks instead of months/years. \n \n- Developed new and improved MIS for Intel’s supply chain management and silicon component-build schedules which delivered $85 million and grew user productivity 500% with a minimal investment of $500k. \n- Contributed to server product sales growth of 56% 2004 over 2005 by delivering an online tool to assist customers in matching server component compatibility pre-sales. \n- Drove team to deliver a 9x compounded productivity increase in team output as measured by delivered customer requirements per month per head in just two years, winning 2 Intel Software Quality Awards. Software Engineering Validation Manager Intel Corporation September 1999  –  March 2001  (1 year 7 months) Managed a team of eleven software validation engineers that delivered software products for Intel’s Reseller Channel. Software Engineering Validation Manager Intel Corporation September 1999  –  March 2001  (1 year 7 months) Managed a team of eleven software validation engineers that delivered software products for Intel’s Reseller Channel. Senior Software Engineer Intel Corporation August 1997  –  September 1999  (2 years 2 months) Designed and invented key software products for Intel’s channel customers including our graphics card business and CPU business. Senior Software Engineer Intel Corporation August 1997  –  September 1999  (2 years 2 months) Designed and invented key software products for Intel’s channel customers including our graphics card business and CPU business. Product Development Engineer Intel Corporation October 1993  –  August 1997  (3 years 11 months) Engineered unique technical solutions to enable Intel’s OverDrive™ CPU Product Line business. Work created a business to upgrade old systems with the newest technology. Product Development Engineer Intel Corporation October 1993  –  August 1997  (3 years 11 months) Engineered unique technical solutions to enable Intel’s OverDrive™ CPU Product Line business. Work created a business to upgrade old systems with the newest technology. Co-Op Engineer Intel Corporation September 1991  –  September 1992  (1 year 1 month) Co-Op Engineering position working in the field sales office to support customer technical issues. Co-Op Engineer Intel Corporation September 1991  –  September 1992  (1 year 1 month) Co-Op Engineering position working in the field sales office to support customer technical issues. Co-Op Engineer Ekohwerks December 1989  –  June 1991  (1 year 7 months) Co-Op Engineering position working with the design team on their Orbital Tube Welder product lines. Co-Op Engineer Ekohwerks December 1989  –  June 1991  (1 year 7 months) Co-Op Engineering position working with the design team on their Orbital Tube Welder product lines. Skills Product Development Market Development Business Strategy Marketing Strategy Strategic Planning Educational Technology Training Development & delivery... Instructors Instructional Design Marketing Management Program Management Budgets Software Engineering Leadership Sales Product Management Business Development Go-to-market Strategy Strategy Project Management Entrepreneurship Management Staff Development Analysis New Business Development See 11+     See less Skills  Product Development Market Development Business Strategy Marketing Strategy Strategic Planning Educational Technology Training Development & delivery... Instructors Instructional Design Marketing Management Program Management Budgets Software Engineering Leadership Sales Product Management Business Development Go-to-market Strategy Strategy Project Management Entrepreneurship Management Staff Development Analysis New Business Development See 11+     See less Product Development Market Development Business Strategy Marketing Strategy Strategic Planning Educational Technology Training Development & delivery... Instructors Instructional Design Marketing Management Program Management Budgets Software Engineering Leadership Sales Product Management Business Development Go-to-market Strategy Strategy Project Management Entrepreneurship Management Staff Development Analysis New Business Development See 11+     See less Product Development Market Development Business Strategy Marketing Strategy Strategic Planning Educational Technology Training Development & delivery... Instructors Instructional Design Marketing Management Program Management Budgets Software Engineering Leadership Sales Product Management Business Development Go-to-market Strategy Strategy Project Management Entrepreneurship Management Staff Development Analysis New Business Development See 11+     See less Education University of California, Davis - Graduate School of Management MBA,  Marketing and Finance 1998  – 2001 University of Toledo BS,  Electrical Engineering 1988  – 1993 Magna Cum Laude Activities and Societies:  Tau Beta Pi University of California, Davis - Graduate School of Management MBA,  Marketing and Finance 1998  – 2001 University of California, Davis - Graduate School of Management MBA,  Marketing and Finance 1998  – 2001 University of California, Davis - Graduate School of Management MBA,  Marketing and Finance 1998  – 2001 University of Toledo BS,  Electrical Engineering 1988  – 1993 Magna Cum Laude Activities and Societies:  Tau Beta Pi University of Toledo BS,  Electrical Engineering 1988  – 1993 Magna Cum Laude Activities and Societies:  Tau Beta Pi University of Toledo BS,  Electrical Engineering 1988  – 1993 Magna Cum Laude Activities and Societies:  Tau Beta Pi Honors & Awards Additional Honors & Awards Intel Achievement Award 2005 - For Leadership in defining and delivering Intel's first unique platform solutiuon for China iCafes. \nIntel Achievement Award 2000 - For driving a successful program to reduce fradulant remarking of Intel microprocessors \nSoftware Quality Award 2003 \nSoftware Quality Award 2001 Additional Honors & Awards Intel Achievement Award 2005 - For Leadership in defining and delivering Intel's first unique platform solutiuon for China iCafes. \nIntel Achievement Award 2000 - For driving a successful program to reduce fradulant remarking of Intel microprocessors \nSoftware Quality Award 2003 \nSoftware Quality Award 2001 Additional Honors & Awards Intel Achievement Award 2005 - For Leadership in defining and delivering Intel's first unique platform solutiuon for China iCafes. \nIntel Achievement Award 2000 - For driving a successful program to reduce fradulant remarking of Intel microprocessors \nSoftware Quality Award 2003 \nSoftware Quality Award 2001 Additional Honors & Awards Intel Achievement Award 2005 - For Leadership in defining and delivering Intel's first unique platform solutiuon for China iCafes. \nIntel Achievement Award 2000 - For driving a successful program to reduce fradulant remarking of Intel microprocessors \nSoftware Quality Award 2003 \nSoftware Quality Award 2001 ", "Skills Ethernet Product Management IP Telecommunications TDM SDH MPLS RPR Project Management Optics Japanese business... Carrier Ethernet Mobile Devices Software Development SNMP Cellular Communications See 1+     See less Skills  Ethernet Product Management IP Telecommunications TDM SDH MPLS RPR Project Management Optics Japanese business... Carrier Ethernet Mobile Devices Software Development SNMP Cellular Communications See 1+     See less Ethernet Product Management IP Telecommunications TDM SDH MPLS RPR Project Management Optics Japanese business... Carrier Ethernet Mobile Devices Software Development SNMP Cellular Communications See 1+     See less Ethernet Product Management IP Telecommunications TDM SDH MPLS RPR Project Management Optics Japanese business... Carrier Ethernet Mobile Devices Software Development SNMP Cellular Communications See 1+     See less ", "Summary [ Latest update : 09-Jul-2013] \n \nInvolved in time critical projects in the Mobile Handset System Solution for the last 15+ years, spanning form modem baseband to multimedia application processors. \n \nIncluding: \n \n►Android Software Program Management \n \n►Multimedia Software Program Management ♦ Android \n»●» Lead complex, multi-functional, multi-sited project for entire project lifecycle. \n»●» Worked with leadership and engineering teams (100+ resources), kept the players. \nco-ordinated on the project's progress and deadlines. \n»●» Ensured reporting to project stakeholders. \n»●» Co-ordinated with Customer Support teams and ensured support for customer engagement. \n \n \n►Modem Project Management ♦ 3G ♦ L2/L3 HSxPA ♦ Supplier Management ♦ Outsourcing \n»●» Lead the Engineering teams for development of Modem L2/L3 protocol stack. \n»●» Managed Line of 50+ resources with support from Project Leaders. \n»●» Managed Supplier (one Indian and one European) for delivery and commitments for RRC. \n»●» Supported Customer Support teams at various stages for customer deployment. \n»●» Involved in vendor evaluation and outsource management for long term stack maintenance. \n \nI am also passionate about building scripts for automation(.sh/.pl), tools for project metrics (.xls) and working on custom ROMs. \n \nI hold one patent in the Modem domain. Summary [ Latest update : 09-Jul-2013] \n \nInvolved in time critical projects in the Mobile Handset System Solution for the last 15+ years, spanning form modem baseband to multimedia application processors. \n \nIncluding: \n \n►Android Software Program Management \n \n►Multimedia Software Program Management ♦ Android \n»●» Lead complex, multi-functional, multi-sited project for entire project lifecycle. \n»●» Worked with leadership and engineering teams (100+ resources), kept the players. \nco-ordinated on the project's progress and deadlines. \n»●» Ensured reporting to project stakeholders. \n»●» Co-ordinated with Customer Support teams and ensured support for customer engagement. \n \n \n►Modem Project Management ♦ 3G ♦ L2/L3 HSxPA ♦ Supplier Management ♦ Outsourcing \n»●» Lead the Engineering teams for development of Modem L2/L3 protocol stack. \n»●» Managed Line of 50+ resources with support from Project Leaders. \n»●» Managed Supplier (one Indian and one European) for delivery and commitments for RRC. \n»●» Supported Customer Support teams at various stages for customer deployment. \n»●» Involved in vendor evaluation and outsource management for long term stack maintenance. \n \nI am also passionate about building scripts for automation(.sh/.pl), tools for project metrics (.xls) and working on custom ROMs. \n \nI hold one patent in the Modem domain. [ Latest update : 09-Jul-2013] \n \nInvolved in time critical projects in the Mobile Handset System Solution for the last 15+ years, spanning form modem baseband to multimedia application processors. \n \nIncluding: \n \n►Android Software Program Management \n \n►Multimedia Software Program Management ♦ Android \n»●» Lead complex, multi-functional, multi-sited project for entire project lifecycle. \n»●» Worked with leadership and engineering teams (100+ resources), kept the players. \nco-ordinated on the project's progress and deadlines. \n»●» Ensured reporting to project stakeholders. \n»●» Co-ordinated with Customer Support teams and ensured support for customer engagement. \n \n \n►Modem Project Management ♦ 3G ♦ L2/L3 HSxPA ♦ Supplier Management ♦ Outsourcing \n»●» Lead the Engineering teams for development of Modem L2/L3 protocol stack. \n»●» Managed Line of 50+ resources with support from Project Leaders. \n»●» Managed Supplier (one Indian and one European) for delivery and commitments for RRC. \n»●» Supported Customer Support teams at various stages for customer deployment. \n»●» Involved in vendor evaluation and outsource management for long term stack maintenance. \n \nI am also passionate about building scripts for automation(.sh/.pl), tools for project metrics (.xls) and working on custom ROMs. \n \nI hold one patent in the Modem domain. [ Latest update : 09-Jul-2013] \n \nInvolved in time critical projects in the Mobile Handset System Solution for the last 15+ years, spanning form modem baseband to multimedia application processors. \n \nIncluding: \n \n►Android Software Program Management \n \n►Multimedia Software Program Management ♦ Android \n»●» Lead complex, multi-functional, multi-sited project for entire project lifecycle. \n»●» Worked with leadership and engineering teams (100+ resources), kept the players. \nco-ordinated on the project's progress and deadlines. \n»●» Ensured reporting to project stakeholders. \n»●» Co-ordinated with Customer Support teams and ensured support for customer engagement. \n \n \n►Modem Project Management ♦ 3G ♦ L2/L3 HSxPA ♦ Supplier Management ♦ Outsourcing \n»●» Lead the Engineering teams for development of Modem L2/L3 protocol stack. \n»●» Managed Line of 50+ resources with support from Project Leaders. \n»●» Managed Supplier (one Indian and one European) for delivery and commitments for RRC. \n»●» Supported Customer Support teams at various stages for customer deployment. \n»●» Involved in vendor evaluation and outsource management for long term stack maintenance. \n \nI am also passionate about building scripts for automation(.sh/.pl), tools for project metrics (.xls) and working on custom ROMs. \n \nI hold one patent in the Modem domain. Experience Software Program Manager Intel Corporation July 2013  – Present (2 years 2 months) Bengaluru Area, India Android Software Program Manager Senior Project Manager ST-Ericsson July 2008  –  June 2013  (5 years) Bangalore, INDIA Philips Semiconductors ♦ NXP Semiconductors ♦ ST-Ericsson \n \n▄▀ Multimedia Software Program Manager (Android) [ Oct'10 - till Date ] \n \n»●» Managed Program from Definition Phase to Deployment Phase for the 100+ member team ( in 5 Sites) \n»●» Managed project schedules, identifying risks and communicating project stakeholders.  \n»●» Co-ordinated with internal IP suppliers for delivery and scheduling \n»●» Executed project in full mutimedia scope including Audio, Video, Camera, Display, Graphics, Android Integration.  \n \n \n▄▀ Modem Project Manager (L2/L3-HSxPA) ♦ Supplier Manager ♦ Outsourcing [ Jun'08 - Oct'10 ] \n \n»●» Lead the Engineering teams of Access Stratum, Non Access Stratum, RLC, MAC, Telephony, Integration & Delivery \n»●» Line management of 50+resource with a leadership team \n»●» Supplier Managment of a European vendor for HSXPA-RRC(3G) stack for Planning Co-ordination, Delivery acceptance. \n»●» Contributed to Vendor evaluation, planning and outsourcing to a selected vendor for long term stack maintenance. Project Manager NXP Semiconductors June 2006  –  July 2008  (2 years 2 months) Bangalore,INDIA Philips Semiconductors ♦ NXP Semiconductors ♦ ST-Ericsson \n \n▄▀ Modem Project Manager (L2/L3-UMTS) ♦ Supplier Manager \n \n»●» Lead the Engineering teams of Access Stratum 2G, Non Access Stratum, RLC, MAC, Telephony, Integration & Delivery \n»●» Lead the L2/L3 development activities for Unlicensed Mobile Access (UMA) technology integration \n»●» Supplier Managment of a Indian vendor for UMTS-RRC(3G) stack for Planning Co-ordination, Delivery acceptance. \n \n♫ During this period I was part of the team that won the 3rd Prize APAC Regional Finals in NXP's Quality Improvement competition, and have contributed to a article on 3G UMA technology/Fixed mobile convergence in a Indian magazine.♫ Project Leader Philips Semiconductors April 2001  –  June 2006  (5 years 3 months) Bangalore, INDIA ▄▀ Modem-L3-RadioResource developer(2.5G) ♦ Team Coordination Project Officer with France site \n \n»●» Involved in development and maintenance of Radio Resource Sublayer (GPRS) \n»●» Worked at the customer sites during the last phases of product deployment. \n»●» Co-ordinated 13 member team for development and delivery towards commitment to integration team in Europe. \n \n♫ During this period I have filed a patent, and was part of the team that won 3rd Place World Wide in Philips's Quality improvement competition ♫ Senior Software Engineer Integra Micro Systems October 1998  –  April 2001  (2 years 7 months) Bangalore, INDIA ▄▀ Protocol Test Environment Developer ♦ Integrator ♦ Tester @ Motorola India Electronics Limited. \n \n»●» Worked on Motorola's mobile telecom technology - Integrated Digital Enhanced Network (iDEN) \n»●» Was part of the team that developed the iDEN protocol test enviornment, a fully automatic test bench for Mobile conformance tests. ( Similar to GSM Conformance Specification(MS) 11.10 ) Software Program Manager Intel Corporation July 2013  – Present (2 years 2 months) Bengaluru Area, India Android Software Program Manager Software Program Manager Intel Corporation July 2013  – Present (2 years 2 months) Bengaluru Area, India Android Software Program Manager Senior Project Manager ST-Ericsson July 2008  –  June 2013  (5 years) Bangalore, INDIA Philips Semiconductors ♦ NXP Semiconductors ♦ ST-Ericsson \n \n▄▀ Multimedia Software Program Manager (Android) [ Oct'10 - till Date ] \n \n»●» Managed Program from Definition Phase to Deployment Phase for the 100+ member team ( in 5 Sites) \n»●» Managed project schedules, identifying risks and communicating project stakeholders.  \n»●» Co-ordinated with internal IP suppliers for delivery and scheduling \n»●» Executed project in full mutimedia scope including Audio, Video, Camera, Display, Graphics, Android Integration.  \n \n \n▄▀ Modem Project Manager (L2/L3-HSxPA) ♦ Supplier Manager ♦ Outsourcing [ Jun'08 - Oct'10 ] \n \n»●» Lead the Engineering teams of Access Stratum, Non Access Stratum, RLC, MAC, Telephony, Integration & Delivery \n»●» Line management of 50+resource with a leadership team \n»●» Supplier Managment of a European vendor for HSXPA-RRC(3G) stack for Planning Co-ordination, Delivery acceptance. \n»●» Contributed to Vendor evaluation, planning and outsourcing to a selected vendor for long term stack maintenance. Senior Project Manager ST-Ericsson July 2008  –  June 2013  (5 years) Bangalore, INDIA Philips Semiconductors ♦ NXP Semiconductors ♦ ST-Ericsson \n \n▄▀ Multimedia Software Program Manager (Android) [ Oct'10 - till Date ] \n \n»●» Managed Program from Definition Phase to Deployment Phase for the 100+ member team ( in 5 Sites) \n»●» Managed project schedules, identifying risks and communicating project stakeholders.  \n»●» Co-ordinated with internal IP suppliers for delivery and scheduling \n»●» Executed project in full mutimedia scope including Audio, Video, Camera, Display, Graphics, Android Integration.  \n \n \n▄▀ Modem Project Manager (L2/L3-HSxPA) ♦ Supplier Manager ♦ Outsourcing [ Jun'08 - Oct'10 ] \n \n»●» Lead the Engineering teams of Access Stratum, Non Access Stratum, RLC, MAC, Telephony, Integration & Delivery \n»●» Line management of 50+resource with a leadership team \n»●» Supplier Managment of a European vendor for HSXPA-RRC(3G) stack for Planning Co-ordination, Delivery acceptance. \n»●» Contributed to Vendor evaluation, planning and outsourcing to a selected vendor for long term stack maintenance. Project Manager NXP Semiconductors June 2006  –  July 2008  (2 years 2 months) Bangalore,INDIA Philips Semiconductors ♦ NXP Semiconductors ♦ ST-Ericsson \n \n▄▀ Modem Project Manager (L2/L3-UMTS) ♦ Supplier Manager \n \n»●» Lead the Engineering teams of Access Stratum 2G, Non Access Stratum, RLC, MAC, Telephony, Integration & Delivery \n»●» Lead the L2/L3 development activities for Unlicensed Mobile Access (UMA) technology integration \n»●» Supplier Managment of a Indian vendor for UMTS-RRC(3G) stack for Planning Co-ordination, Delivery acceptance. \n \n♫ During this period I was part of the team that won the 3rd Prize APAC Regional Finals in NXP's Quality Improvement competition, and have contributed to a article on 3G UMA technology/Fixed mobile convergence in a Indian magazine.♫ Project Manager NXP Semiconductors June 2006  –  July 2008  (2 years 2 months) Bangalore,INDIA Philips Semiconductors ♦ NXP Semiconductors ♦ ST-Ericsson \n \n▄▀ Modem Project Manager (L2/L3-UMTS) ♦ Supplier Manager \n \n»●» Lead the Engineering teams of Access Stratum 2G, Non Access Stratum, RLC, MAC, Telephony, Integration & Delivery \n»●» Lead the L2/L3 development activities for Unlicensed Mobile Access (UMA) technology integration \n»●» Supplier Managment of a Indian vendor for UMTS-RRC(3G) stack for Planning Co-ordination, Delivery acceptance. \n \n♫ During this period I was part of the team that won the 3rd Prize APAC Regional Finals in NXP's Quality Improvement competition, and have contributed to a article on 3G UMA technology/Fixed mobile convergence in a Indian magazine.♫ Project Leader Philips Semiconductors April 2001  –  June 2006  (5 years 3 months) Bangalore, INDIA ▄▀ Modem-L3-RadioResource developer(2.5G) ♦ Team Coordination Project Officer with France site \n \n»●» Involved in development and maintenance of Radio Resource Sublayer (GPRS) \n»●» Worked at the customer sites during the last phases of product deployment. \n»●» Co-ordinated 13 member team for development and delivery towards commitment to integration team in Europe. \n \n♫ During this period I have filed a patent, and was part of the team that won 3rd Place World Wide in Philips's Quality improvement competition ♫ Project Leader Philips Semiconductors April 2001  –  June 2006  (5 years 3 months) Bangalore, INDIA ▄▀ Modem-L3-RadioResource developer(2.5G) ♦ Team Coordination Project Officer with France site \n \n»●» Involved in development and maintenance of Radio Resource Sublayer (GPRS) \n»●» Worked at the customer sites during the last phases of product deployment. \n»●» Co-ordinated 13 member team for development and delivery towards commitment to integration team in Europe. \n \n♫ During this period I have filed a patent, and was part of the team that won 3rd Place World Wide in Philips's Quality improvement competition ♫ Senior Software Engineer Integra Micro Systems October 1998  –  April 2001  (2 years 7 months) Bangalore, INDIA ▄▀ Protocol Test Environment Developer ♦ Integrator ♦ Tester @ Motorola India Electronics Limited. \n \n»●» Worked on Motorola's mobile telecom technology - Integrated Digital Enhanced Network (iDEN) \n»●» Was part of the team that developed the iDEN protocol test enviornment, a fully automatic test bench for Mobile conformance tests. ( Similar to GSM Conformance Specification(MS) 11.10 ) Senior Software Engineer Integra Micro Systems October 1998  –  April 2001  (2 years 7 months) Bangalore, INDIA ▄▀ Protocol Test Environment Developer ♦ Integrator ♦ Tester @ Motorola India Electronics Limited. \n \n»●» Worked on Motorola's mobile telecom technology - Integrated Digital Enhanced Network (iDEN) \n»●» Was part of the team that developed the iDEN protocol test enviornment, a fully automatic test bench for Mobile conformance tests. ( Similar to GSM Conformance Specification(MS) 11.10 ) Skills Embedded Software Embedded Systems Wireless UMTS ClearCase RTOS Mobile Communications 3GPP GSM WCDMA Skills  Embedded Software Embedded Systems Wireless UMTS ClearCase RTOS Mobile Communications 3GPP GSM WCDMA Embedded Software Embedded Systems Wireless UMTS ClearCase RTOS Mobile Communications 3GPP GSM WCDMA Embedded Software Embedded Systems Wireless UMTS ClearCase RTOS Mobile Communications 3GPP GSM WCDMA Education Birla Institute of Technology and Science, Pilani M.S.,  Software System 2004  – 2006 B. M. S. College of Engineering B.E.,  Telecommunication 1993  – 1997 Birla Institute of Technology and Science, Pilani M.S.,  Software System 2004  – 2006 Birla Institute of Technology and Science, Pilani M.S.,  Software System 2004  – 2006 Birla Institute of Technology and Science, Pilani M.S.,  Software System 2004  – 2006 B. M. S. College of Engineering B.E.,  Telecommunication 1993  – 1997 B. M. S. College of Engineering B.E.,  Telecommunication 1993  – 1997 B. M. S. College of Engineering B.E.,  Telecommunication 1993  – 1997 ", "Experience Senior Software Program Manager Intel Corporation February 2015  – Present (7 months) Software Quality Manager Intel June 2009  –  January 2015  (5 years 8 months) Software Quality Engineer Intel Corporation May 2004  –  June 2009  (5 years 2 months) Ireland Software Program Manager Intel Corporation February 2002  –  May 2004  (2 years 4 months) Ireland Software Engineer Intel Corporation February 2000  –  February 2002  (2 years 1 month) Ireland Software Engineer Tellabs May 1997  –  February 2000  (2 years 10 months) Test Engineer 3Com May 1996  –  May 1997  (1 year 1 month) Senior Software Program Manager Intel Corporation February 2015  – Present (7 months) Senior Software Program Manager Intel Corporation February 2015  – Present (7 months) Software Quality Manager Intel June 2009  –  January 2015  (5 years 8 months) Software Quality Manager Intel June 2009  –  January 2015  (5 years 8 months) Software Quality Engineer Intel Corporation May 2004  –  June 2009  (5 years 2 months) Ireland Software Quality Engineer Intel Corporation May 2004  –  June 2009  (5 years 2 months) Ireland Software Program Manager Intel Corporation February 2002  –  May 2004  (2 years 4 months) Ireland Software Program Manager Intel Corporation February 2002  –  May 2004  (2 years 4 months) Ireland Software Engineer Intel Corporation February 2000  –  February 2002  (2 years 1 month) Ireland Software Engineer Intel Corporation February 2000  –  February 2002  (2 years 1 month) Ireland Software Engineer Tellabs May 1997  –  February 2000  (2 years 10 months) Software Engineer Tellabs May 1997  –  February 2000  (2 years 10 months) Test Engineer 3Com May 1996  –  May 1997  (1 year 1 month) Test Engineer 3Com May 1996  –  May 1997  (1 year 1 month) Skills Testing Software Engineering Test Automation Embedded Systems Debugging Embedded Software Semiconductors ClearCase C Software Quality... Intel SoC Agile Methodologies Software Development ClearQuest Software Quality Test Planning Women in Technology STEM Engagements Software Program... People Management See 6+     See less Skills  Testing Software Engineering Test Automation Embedded Systems Debugging Embedded Software Semiconductors ClearCase C Software Quality... Intel SoC Agile Methodologies Software Development ClearQuest Software Quality Test Planning Women in Technology STEM Engagements Software Program... People Management See 6+     See less Testing Software Engineering Test Automation Embedded Systems Debugging Embedded Software Semiconductors ClearCase C Software Quality... Intel SoC Agile Methodologies Software Development ClearQuest Software Quality Test Planning Women in Technology STEM Engagements Software Program... People Management See 6+     See less Testing Software Engineering Test Automation Embedded Systems Debugging Embedded Software Semiconductors ClearCase C Software Quality... Intel SoC Agile Methodologies Software Development ClearQuest Software Quality Test Planning Women in Technology STEM Engagements Software Program... People Management See 6+     See less ", "Skills Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less Skills  Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less Cross-functional Team... Strategic Planning New Business Development Project Management Business Relationship... Program Management Go-to-market Strategy Business Alliances Team Leadership Management SaaS Semiconductors Business Analysis Wireless Marketing Intel Start-ups Partner Management Product Marketing Strategic Partnerships Product Management Strategy Enterprise Software Competitive Analysis See 9+     See less ", "Summary I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. Summary I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. Experience Finance Program Director American Express Global Business Travel October 2014  – Present (11 months) Phoenix, Arizona Area Finance Program Director American Express Global Business Travel October 2014  – Present (11 months) Phoenix, Arizona Area Finance Program Director American Express Global Business Travel October 2014  – Present (11 months) Phoenix, Arizona Area Languages Spanish Spanish Spanish Skills Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Skills  Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Education University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Ventura College Associates,  liberal arts 1989  – 1991 University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Ventura College Associates,  liberal arts 1989  – 1991 Ventura College Associates,  liberal arts 1989  – 1991 Ventura College Associates,  liberal arts 1989  – 1991 Honors & Awards Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. ", "Experience Software Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Jerusalem Linux WiFi core and PC products lines (WiFi) Software program manager \n \nincluding:  \nWiFi Linux group execution management ,  \nwork plans,  \ncontinuous integration,  \ninterfaces and coordination with validation, system and firmware groups. \nLeading development and release process both internaly and with customers. Software Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Jerusalem Linux WiFi core and PC products lines (WiFi) Software program manager \n \nincluding:  \nWiFi Linux group execution management ,  \nwork plans,  \ncontinuous integration,  \ninterfaces and coordination with validation, system and firmware groups. \nLeading development and release process both internaly and with customers. Software Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Jerusalem Linux WiFi core and PC products lines (WiFi) Software program manager \n \nincluding:  \nWiFi Linux group execution management ,  \nwork plans,  \ncontinuous integration,  \ninterfaces and coordination with validation, system and firmware groups. \nLeading development and release process both internaly and with customers. Languages English Hebrew English Hebrew English Hebrew Skills Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Skills  Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Education Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 ", "Summary Objective: Drive Business Excellence, Consistency, and Predictability through Operations Management or Program Management in Sales Support, Customer Service/Support, or Related Areas. \n \nI am an articulate, personable, and highly professional individual who works exceptionally well in cross organizational and cross team environments. I’m self-motivated and able to perform under pressure and in high output environments. A combination of program management acumen and interpersonal skills allow me to drive quality and predictability in the output of the programs I manage. Computer skills include: Computer skills include: PC, Microsoft Windows OS 7 and 8, Microsoft Office Suites (Work, PowerPoint, Excel, Visio, and Team Foundations Server), SharePoint JAMA Software, JIVE Software, Wiki, Google, bing, Firefox, Chrome browsers, Outlook, G-mail, Yahoo.  \n \nSpecialties: Program/Project Management, Vendor Management, Business Operations Management, Staff Management, Business Development, Events Management, Customer and Sales Support. Summary Objective: Drive Business Excellence, Consistency, and Predictability through Operations Management or Program Management in Sales Support, Customer Service/Support, or Related Areas. \n \nI am an articulate, personable, and highly professional individual who works exceptionally well in cross organizational and cross team environments. I’m self-motivated and able to perform under pressure and in high output environments. A combination of program management acumen and interpersonal skills allow me to drive quality and predictability in the output of the programs I manage. Computer skills include: Computer skills include: PC, Microsoft Windows OS 7 and 8, Microsoft Office Suites (Work, PowerPoint, Excel, Visio, and Team Foundations Server), SharePoint JAMA Software, JIVE Software, Wiki, Google, bing, Firefox, Chrome browsers, Outlook, G-mail, Yahoo.  \n \nSpecialties: Program/Project Management, Vendor Management, Business Operations Management, Staff Management, Business Development, Events Management, Customer and Sales Support. Objective: Drive Business Excellence, Consistency, and Predictability through Operations Management or Program Management in Sales Support, Customer Service/Support, or Related Areas. \n \nI am an articulate, personable, and highly professional individual who works exceptionally well in cross organizational and cross team environments. I’m self-motivated and able to perform under pressure and in high output environments. A combination of program management acumen and interpersonal skills allow me to drive quality and predictability in the output of the programs I manage. Computer skills include: Computer skills include: PC, Microsoft Windows OS 7 and 8, Microsoft Office Suites (Work, PowerPoint, Excel, Visio, and Team Foundations Server), SharePoint JAMA Software, JIVE Software, Wiki, Google, bing, Firefox, Chrome browsers, Outlook, G-mail, Yahoo.  \n \nSpecialties: Program/Project Management, Vendor Management, Business Operations Management, Staff Management, Business Development, Events Management, Customer and Sales Support. Objective: Drive Business Excellence, Consistency, and Predictability through Operations Management or Program Management in Sales Support, Customer Service/Support, or Related Areas. \n \nI am an articulate, personable, and highly professional individual who works exceptionally well in cross organizational and cross team environments. I’m self-motivated and able to perform under pressure and in high output environments. A combination of program management acumen and interpersonal skills allow me to drive quality and predictability in the output of the programs I manage. Computer skills include: Computer skills include: PC, Microsoft Windows OS 7 and 8, Microsoft Office Suites (Work, PowerPoint, Excel, Visio, and Team Foundations Server), SharePoint JAMA Software, JIVE Software, Wiki, Google, bing, Firefox, Chrome browsers, Outlook, G-mail, Yahoo.  \n \nSpecialties: Program/Project Management, Vendor Management, Business Operations Management, Staff Management, Business Development, Events Management, Customer and Sales Support. Experience Technical Software Program Manager Intel Corporation November 2013  – Present (1 year 10 months) Rogers, AR Responsible for managing projects/programs of small, medium to large (may be global) scope, impact and complexity through all phases of the product and platform lifecycle. Manages interdependencies and integration among multiple projects, teams, and stakeholders.  Solutions Enabling Manager Intel Corporation September 2011  –  November 2013  (2 years 3 months) Hillsboro, Oregon Manager of 20+ Application Engineers, SW developers, IT Flex staff augmentation, outsourcing contingent workers and interns chartered with enabling PCCGs Intel sensor hub, extreme tuning utility (XTU), e-ink as well as feature integration software solutions for PCCG PC platforms. Drove ISV enabling strategy, created ISV enabling plans for the Intel Sensor Hub Solution to define and deliver an SDK to 200+ customers. Established, grow and managed relationships with ~15 ISVs. Successfully launched sensor based applications at CES and IDF. Deployed seven boutique Win8 Metro and Desktop application in AppUp and MSFT Storefront which immediately showed the sensor value to end users and OEMs through the heavy adoption of the applications by PCCG & SSG Co-Marketing 15+ GEO wide activities and events such as: (conferences, GEO roadshows, articles, press kits, the Ultrabook Zone and Experience Pack” that includes our applications when consumers purchase an Ultrabook). Influenced and collaborate with SSG to scale sensor based applications. Collaborated with PCCG ACS Architecture, FW Engineering, Planning, Marketing, SQE, SSG, Finance and Intel Legal, closely worked with UX and engineering teams on customer feedback; identified and resolved OEM and ISVs escalation. Other responsibilities included managing a multimillion dollar budgets and day-to-day operations of the Solutions Development Engineering organization. Developed a process to take POC to production and established it within CSS and drove a patient mentoring program across CSS to increase the quality and quantity of patient submissions by 20% from 2012. Operations Manager / IP Vendor Manager Intel Corporation September 2008  –  September 2011  (3 years 1 month) Hillsboro, Oregon I was the Operations Manager for a ~300 person organization which included driving Intel Business planning life cycle, PLBP/POR, MSR, MIR (Indicators) and MBOs including the Performance Recognition Process: SRA and DRAs. Manage track and auditing cross-geo resource allocation plans, department budgets, and capital budget planning and deployment. Manage staff, F2F, Operational review agenda’s, published and track ARs. In November of 2010 I transitioned from Operations to a TP SW IP Vendor Management role where I was responsible for managing UMGs PSI Flex BB, Flex Staff augmentation and Flex outsourcing contingent worker vendor contracts as well as UMGs PSIs TPV SW IP vendors. I was PSIs single point of contact for all third party vendor management supporting 4 platforms Moorestown (sustaining), Medfield (development), Merrifield and Clovertrail+ (planning and early development). I successfully drove vendor selection, SOW and contract to closure, tracking major milestones aligned to the SOW/contracts, acceptance criteria, payments approval/release, planning cycles (NRE, capital, headcount), ensured contingent worker guidelines and policies were being adhered to, process development and improvement. I drove and influenced the UMGs strategic planning team to include internal and external SW IP feature ingredient and pre-silicon (Merrifield/Clovertrail+) requirements into their platform landing zone process resulting in huge efficiency across UMGs. Customer Marketing Program Mgr. Intel Corporation October 2005  –  September 2008  (3 years) Hillsboro, Oregon I owned the business relationships with Intel’s North American customers who are shipping and developing products based on Intel’s first WiMAX chipsets. My responsibilities include day to day management of forecasting, pricing, issue resolution, and maintaining market and business alignment in a highly dynamic, evolving technical arena. My customers shipped the lion’s share of Intel based products which account for over 70% of the total worldwide WiMAX CPE shipments. During the initial product launch I negotiated co-marketing plans and managed market matchmaking activities between my customers and worldwide Broadband Wireless Service Providers. Channel Business Development Manager Intel Corporation April 2004  –  November 2005  (1 year 8 months) Hillsboro, Oregon I managed relationships between European distributors and their customers of Intel Embedded Telecom products, with sole factory responsibility for establishing and meeting sales targets. Responsibilities included alignment of Product teams with customers’ requirements, and identifying eco-system partners when Intel’s portfolio could not meet their needs. I supported of the Sales Organization through the entire sales cycle from discovery through fulfillment and contributed to the definition, and owned implantation of Go-To-Market strategies and marketing plans. I developed a Product Life Cycle model that was adopted for use by business unit’s long range planning organization to establish PORs (Plan of Records) and revenue targets. Operations Manager Intel Corporation April 2003  –  April 2004  (1 year 1 month) I was responsible for business operations for a team of 50 marketing and customer facing field personnel. Responsibilities included facilitation of Intel’s business planning process (Long Range Plan, Product Requirements Documents, Product Roadmaps, and Product Life Cycle Business Plan), driving department initiatives and tracking the team’s performance to financial and other goals. Managed quarterly business reviews. Training & Events Manager, Network Processing Group Intel Corporation January 2002  –  April 2003  (1 year 4 months) I managed a team of five divisional Training & Events Program Managers responsible for requirements discovery, planning, development and delivery of training materials for internal sales events and external tradeshows. This team was consistently delivered timely, high quality training tailored to particular audiences in support of the business unit’s objectives. Business Development Program Manager, Telecom Industry Sector Intel Corporation September 2000  –  January 2002  (1 year 5 months) I was responsible for developing proposals in response to customers’ RFX’s (Request for Information, Quotation and Proposal) which required coordination with field sales engineers, factory representatives, and third party vendors. I improved the RFX response process by standardizing templates and an order entry plan, and developing a tracking database, and enabled continuous improvement by establishing a process for tracking and reviewing performance metrics. Customer Service Vendor Account Mgr. IBM (Sequesnt Computer Systems) September 1989  –  September 2000  (11 years 1 month) Beaverton Oregon At Sequent Computers I advanced from an executive admin role, through a series of increasingly challenging positions in the Customer Service organization to the position of Operations Program Manager which I held when I left in 2000. As Operations Program Manager my responsibilities included negotiating vendor agreements and providing financial oversight which included analysis of Customer Service revenue, profitability, and costs. I identified changes which resulted in $3,600,000 savings, turning what had been a cost center into a profit center. Other positions held were Business Analyst, Information Services, responsible for supporting software development and enhancements to legacy systems for the service contacts organization, call management and logistics and Lead Service Contract Representative responsible for generated price quotations and negotiated/administered maintenance renewal contracts with new, established, and third-party customers and major accounts. Corporate Services Office Manager Floating Point Systems September 1983  –  September 1989  (6 years 1 month) Beaverton, Oregon Prior Experience included 6 years with Floating Point Systems (Facilities Manager and Administrative Assistant) and three years with OPS Blue Shield as a printing press operator. Technical Software Program Manager Intel Corporation November 2013  – Present (1 year 10 months) Rogers, AR Responsible for managing projects/programs of small, medium to large (may be global) scope, impact and complexity through all phases of the product and platform lifecycle. Manages interdependencies and integration among multiple projects, teams, and stakeholders.  Technical Software Program Manager Intel Corporation November 2013  – Present (1 year 10 months) Rogers, AR Responsible for managing projects/programs of small, medium to large (may be global) scope, impact and complexity through all phases of the product and platform lifecycle. Manages interdependencies and integration among multiple projects, teams, and stakeholders.  Solutions Enabling Manager Intel Corporation September 2011  –  November 2013  (2 years 3 months) Hillsboro, Oregon Manager of 20+ Application Engineers, SW developers, IT Flex staff augmentation, outsourcing contingent workers and interns chartered with enabling PCCGs Intel sensor hub, extreme tuning utility (XTU), e-ink as well as feature integration software solutions for PCCG PC platforms. Drove ISV enabling strategy, created ISV enabling plans for the Intel Sensor Hub Solution to define and deliver an SDK to 200+ customers. Established, grow and managed relationships with ~15 ISVs. Successfully launched sensor based applications at CES and IDF. Deployed seven boutique Win8 Metro and Desktop application in AppUp and MSFT Storefront which immediately showed the sensor value to end users and OEMs through the heavy adoption of the applications by PCCG & SSG Co-Marketing 15+ GEO wide activities and events such as: (conferences, GEO roadshows, articles, press kits, the Ultrabook Zone and Experience Pack” that includes our applications when consumers purchase an Ultrabook). Influenced and collaborate with SSG to scale sensor based applications. Collaborated with PCCG ACS Architecture, FW Engineering, Planning, Marketing, SQE, SSG, Finance and Intel Legal, closely worked with UX and engineering teams on customer feedback; identified and resolved OEM and ISVs escalation. Other responsibilities included managing a multimillion dollar budgets and day-to-day operations of the Solutions Development Engineering organization. Developed a process to take POC to production and established it within CSS and drove a patient mentoring program across CSS to increase the quality and quantity of patient submissions by 20% from 2012. Solutions Enabling Manager Intel Corporation September 2011  –  November 2013  (2 years 3 months) Hillsboro, Oregon Manager of 20+ Application Engineers, SW developers, IT Flex staff augmentation, outsourcing contingent workers and interns chartered with enabling PCCGs Intel sensor hub, extreme tuning utility (XTU), e-ink as well as feature integration software solutions for PCCG PC platforms. Drove ISV enabling strategy, created ISV enabling plans for the Intel Sensor Hub Solution to define and deliver an SDK to 200+ customers. Established, grow and managed relationships with ~15 ISVs. Successfully launched sensor based applications at CES and IDF. Deployed seven boutique Win8 Metro and Desktop application in AppUp and MSFT Storefront which immediately showed the sensor value to end users and OEMs through the heavy adoption of the applications by PCCG & SSG Co-Marketing 15+ GEO wide activities and events such as: (conferences, GEO roadshows, articles, press kits, the Ultrabook Zone and Experience Pack” that includes our applications when consumers purchase an Ultrabook). Influenced and collaborate with SSG to scale sensor based applications. Collaborated with PCCG ACS Architecture, FW Engineering, Planning, Marketing, SQE, SSG, Finance and Intel Legal, closely worked with UX and engineering teams on customer feedback; identified and resolved OEM and ISVs escalation. Other responsibilities included managing a multimillion dollar budgets and day-to-day operations of the Solutions Development Engineering organization. Developed a process to take POC to production and established it within CSS and drove a patient mentoring program across CSS to increase the quality and quantity of patient submissions by 20% from 2012. Operations Manager / IP Vendor Manager Intel Corporation September 2008  –  September 2011  (3 years 1 month) Hillsboro, Oregon I was the Operations Manager for a ~300 person organization which included driving Intel Business planning life cycle, PLBP/POR, MSR, MIR (Indicators) and MBOs including the Performance Recognition Process: SRA and DRAs. Manage track and auditing cross-geo resource allocation plans, department budgets, and capital budget planning and deployment. Manage staff, F2F, Operational review agenda’s, published and track ARs. In November of 2010 I transitioned from Operations to a TP SW IP Vendor Management role where I was responsible for managing UMGs PSI Flex BB, Flex Staff augmentation and Flex outsourcing contingent worker vendor contracts as well as UMGs PSIs TPV SW IP vendors. I was PSIs single point of contact for all third party vendor management supporting 4 platforms Moorestown (sustaining), Medfield (development), Merrifield and Clovertrail+ (planning and early development). I successfully drove vendor selection, SOW and contract to closure, tracking major milestones aligned to the SOW/contracts, acceptance criteria, payments approval/release, planning cycles (NRE, capital, headcount), ensured contingent worker guidelines and policies were being adhered to, process development and improvement. I drove and influenced the UMGs strategic planning team to include internal and external SW IP feature ingredient and pre-silicon (Merrifield/Clovertrail+) requirements into their platform landing zone process resulting in huge efficiency across UMGs. Operations Manager / IP Vendor Manager Intel Corporation September 2008  –  September 2011  (3 years 1 month) Hillsboro, Oregon I was the Operations Manager for a ~300 person organization which included driving Intel Business planning life cycle, PLBP/POR, MSR, MIR (Indicators) and MBOs including the Performance Recognition Process: SRA and DRAs. Manage track and auditing cross-geo resource allocation plans, department budgets, and capital budget planning and deployment. Manage staff, F2F, Operational review agenda’s, published and track ARs. In November of 2010 I transitioned from Operations to a TP SW IP Vendor Management role where I was responsible for managing UMGs PSI Flex BB, Flex Staff augmentation and Flex outsourcing contingent worker vendor contracts as well as UMGs PSIs TPV SW IP vendors. I was PSIs single point of contact for all third party vendor management supporting 4 platforms Moorestown (sustaining), Medfield (development), Merrifield and Clovertrail+ (planning and early development). I successfully drove vendor selection, SOW and contract to closure, tracking major milestones aligned to the SOW/contracts, acceptance criteria, payments approval/release, planning cycles (NRE, capital, headcount), ensured contingent worker guidelines and policies were being adhered to, process development and improvement. I drove and influenced the UMGs strategic planning team to include internal and external SW IP feature ingredient and pre-silicon (Merrifield/Clovertrail+) requirements into their platform landing zone process resulting in huge efficiency across UMGs. Customer Marketing Program Mgr. Intel Corporation October 2005  –  September 2008  (3 years) Hillsboro, Oregon I owned the business relationships with Intel’s North American customers who are shipping and developing products based on Intel’s first WiMAX chipsets. My responsibilities include day to day management of forecasting, pricing, issue resolution, and maintaining market and business alignment in a highly dynamic, evolving technical arena. My customers shipped the lion’s share of Intel based products which account for over 70% of the total worldwide WiMAX CPE shipments. During the initial product launch I negotiated co-marketing plans and managed market matchmaking activities between my customers and worldwide Broadband Wireless Service Providers. Customer Marketing Program Mgr. Intel Corporation October 2005  –  September 2008  (3 years) Hillsboro, Oregon I owned the business relationships with Intel’s North American customers who are shipping and developing products based on Intel’s first WiMAX chipsets. My responsibilities include day to day management of forecasting, pricing, issue resolution, and maintaining market and business alignment in a highly dynamic, evolving technical arena. My customers shipped the lion’s share of Intel based products which account for over 70% of the total worldwide WiMAX CPE shipments. During the initial product launch I negotiated co-marketing plans and managed market matchmaking activities between my customers and worldwide Broadband Wireless Service Providers. Channel Business Development Manager Intel Corporation April 2004  –  November 2005  (1 year 8 months) Hillsboro, Oregon I managed relationships between European distributors and their customers of Intel Embedded Telecom products, with sole factory responsibility for establishing and meeting sales targets. Responsibilities included alignment of Product teams with customers’ requirements, and identifying eco-system partners when Intel’s portfolio could not meet their needs. I supported of the Sales Organization through the entire sales cycle from discovery through fulfillment and contributed to the definition, and owned implantation of Go-To-Market strategies and marketing plans. I developed a Product Life Cycle model that was adopted for use by business unit’s long range planning organization to establish PORs (Plan of Records) and revenue targets. Channel Business Development Manager Intel Corporation April 2004  –  November 2005  (1 year 8 months) Hillsboro, Oregon I managed relationships between European distributors and their customers of Intel Embedded Telecom products, with sole factory responsibility for establishing and meeting sales targets. Responsibilities included alignment of Product teams with customers’ requirements, and identifying eco-system partners when Intel’s portfolio could not meet their needs. I supported of the Sales Organization through the entire sales cycle from discovery through fulfillment and contributed to the definition, and owned implantation of Go-To-Market strategies and marketing plans. I developed a Product Life Cycle model that was adopted for use by business unit’s long range planning organization to establish PORs (Plan of Records) and revenue targets. Operations Manager Intel Corporation April 2003  –  April 2004  (1 year 1 month) I was responsible for business operations for a team of 50 marketing and customer facing field personnel. Responsibilities included facilitation of Intel’s business planning process (Long Range Plan, Product Requirements Documents, Product Roadmaps, and Product Life Cycle Business Plan), driving department initiatives and tracking the team’s performance to financial and other goals. Managed quarterly business reviews. Operations Manager Intel Corporation April 2003  –  April 2004  (1 year 1 month) I was responsible for business operations for a team of 50 marketing and customer facing field personnel. Responsibilities included facilitation of Intel’s business planning process (Long Range Plan, Product Requirements Documents, Product Roadmaps, and Product Life Cycle Business Plan), driving department initiatives and tracking the team’s performance to financial and other goals. Managed quarterly business reviews. Training & Events Manager, Network Processing Group Intel Corporation January 2002  –  April 2003  (1 year 4 months) I managed a team of five divisional Training & Events Program Managers responsible for requirements discovery, planning, development and delivery of training materials for internal sales events and external tradeshows. This team was consistently delivered timely, high quality training tailored to particular audiences in support of the business unit’s objectives. Training & Events Manager, Network Processing Group Intel Corporation January 2002  –  April 2003  (1 year 4 months) I managed a team of five divisional Training & Events Program Managers responsible for requirements discovery, planning, development and delivery of training materials for internal sales events and external tradeshows. This team was consistently delivered timely, high quality training tailored to particular audiences in support of the business unit’s objectives. Business Development Program Manager, Telecom Industry Sector Intel Corporation September 2000  –  January 2002  (1 year 5 months) I was responsible for developing proposals in response to customers’ RFX’s (Request for Information, Quotation and Proposal) which required coordination with field sales engineers, factory representatives, and third party vendors. I improved the RFX response process by standardizing templates and an order entry plan, and developing a tracking database, and enabled continuous improvement by establishing a process for tracking and reviewing performance metrics. Business Development Program Manager, Telecom Industry Sector Intel Corporation September 2000  –  January 2002  (1 year 5 months) I was responsible for developing proposals in response to customers’ RFX’s (Request for Information, Quotation and Proposal) which required coordination with field sales engineers, factory representatives, and third party vendors. I improved the RFX response process by standardizing templates and an order entry plan, and developing a tracking database, and enabled continuous improvement by establishing a process for tracking and reviewing performance metrics. Customer Service Vendor Account Mgr. IBM (Sequesnt Computer Systems) September 1989  –  September 2000  (11 years 1 month) Beaverton Oregon At Sequent Computers I advanced from an executive admin role, through a series of increasingly challenging positions in the Customer Service organization to the position of Operations Program Manager which I held when I left in 2000. As Operations Program Manager my responsibilities included negotiating vendor agreements and providing financial oversight which included analysis of Customer Service revenue, profitability, and costs. I identified changes which resulted in $3,600,000 savings, turning what had been a cost center into a profit center. Other positions held were Business Analyst, Information Services, responsible for supporting software development and enhancements to legacy systems for the service contacts organization, call management and logistics and Lead Service Contract Representative responsible for generated price quotations and negotiated/administered maintenance renewal contracts with new, established, and third-party customers and major accounts. Customer Service Vendor Account Mgr. IBM (Sequesnt Computer Systems) September 1989  –  September 2000  (11 years 1 month) Beaverton Oregon At Sequent Computers I advanced from an executive admin role, through a series of increasingly challenging positions in the Customer Service organization to the position of Operations Program Manager which I held when I left in 2000. As Operations Program Manager my responsibilities included negotiating vendor agreements and providing financial oversight which included analysis of Customer Service revenue, profitability, and costs. I identified changes which resulted in $3,600,000 savings, turning what had been a cost center into a profit center. Other positions held were Business Analyst, Information Services, responsible for supporting software development and enhancements to legacy systems for the service contacts organization, call management and logistics and Lead Service Contract Representative responsible for generated price quotations and negotiated/administered maintenance renewal contracts with new, established, and third-party customers and major accounts. Corporate Services Office Manager Floating Point Systems September 1983  –  September 1989  (6 years 1 month) Beaverton, Oregon Prior Experience included 6 years with Floating Point Systems (Facilities Manager and Administrative Assistant) and three years with OPS Blue Shield as a printing press operator. Corporate Services Office Manager Floating Point Systems September 1983  –  September 1989  (6 years 1 month) Beaverton, Oregon Prior Experience included 6 years with Floating Point Systems (Facilities Manager and Administrative Assistant) and three years with OPS Blue Shield as a printing press operator. Skills Program Management Cross-functional Team... Management Telecommunications Business Planning Product Management Product Marketing Leadership Business Development CRM Project Management Marketing Go-to-market Strategy Marketing Strategy Team Management Operations Management Process Improvement Customer Service... Customer Support Sales Support Customer Account... Vendor Management See 7+     See less Skills  Program Management Cross-functional Team... Management Telecommunications Business Planning Product Management Product Marketing Leadership Business Development CRM Project Management Marketing Go-to-market Strategy Marketing Strategy Team Management Operations Management Process Improvement Customer Service... Customer Support Sales Support Customer Account... Vendor Management See 7+     See less Program Management Cross-functional Team... Management Telecommunications Business Planning Product Management Product Marketing Leadership Business Development CRM Project Management Marketing Go-to-market Strategy Marketing Strategy Team Management Operations Management Process Improvement Customer Service... Customer Support Sales Support Customer Account... Vendor Management See 7+     See less Program Management Cross-functional Team... Management Telecommunications Business Planning Product Management Product Marketing Leadership Business Development CRM Project Management Marketing Go-to-market Strategy Marketing Strategy Team Management Operations Management Process Improvement Customer Service... Customer Support Sales Support Customer Account... Vendor Management See 7+     See less Honors & Awards Additional Honors & Awards Received company-wide Employee Excellence Award in 1994, Sequant Computer Systems, Inc. Additional Honors & Awards Received company-wide Employee Excellence Award in 1994, Sequant Computer Systems, Inc. Additional Honors & Awards Received company-wide Employee Excellence Award in 1994, Sequant Computer Systems, Inc. Additional Honors & Awards Received company-wide Employee Excellence Award in 1994, Sequant Computer Systems, Inc. ", "Summary 12 years of experience in leading Software development groups and managing multi-disciplinary projects. Results oriented manager with strong technical leadership. Bring proven experience in R&D project management as well as customer facing. \nWide experience in Software development methods and project flows from creating the requirements, architecture, development, integration, testing, debugging and customer support. \n \nProven experience as a Group Manager of 20+ engineers and team leaders in the area of developing mobile wireless embedded systems. Manage local teams and offshore including sub-contractors. \nProven experience in leading R&D Software projects as well as customization projects for customers. Experienced with customers facing and support. Specialties:WiFi, Bluetooth, Linux, Android, C, real time embedded systems, project management, device drivers, Firmware, Chips, FPGA, Hardware, mobile, wireless, network communication protocols, Software development methodologies. Summary 12 years of experience in leading Software development groups and managing multi-disciplinary projects. Results oriented manager with strong technical leadership. Bring proven experience in R&D project management as well as customer facing. \nWide experience in Software development methods and project flows from creating the requirements, architecture, development, integration, testing, debugging and customer support. \n \nProven experience as a Group Manager of 20+ engineers and team leaders in the area of developing mobile wireless embedded systems. Manage local teams and offshore including sub-contractors. \nProven experience in leading R&D Software projects as well as customization projects for customers. Experienced with customers facing and support. Specialties:WiFi, Bluetooth, Linux, Android, C, real time embedded systems, project management, device drivers, Firmware, Chips, FPGA, Hardware, mobile, wireless, network communication protocols, Software development methodologies. 12 years of experience in leading Software development groups and managing multi-disciplinary projects. Results oriented manager with strong technical leadership. Bring proven experience in R&D project management as well as customer facing. \nWide experience in Software development methods and project flows from creating the requirements, architecture, development, integration, testing, debugging and customer support. \n \nProven experience as a Group Manager of 20+ engineers and team leaders in the area of developing mobile wireless embedded systems. Manage local teams and offshore including sub-contractors. \nProven experience in leading R&D Software projects as well as customization projects for customers. Experienced with customers facing and support. Specialties:WiFi, Bluetooth, Linux, Android, C, real time embedded systems, project management, device drivers, Firmware, Chips, FPGA, Hardware, mobile, wireless, network communication protocols, Software development methodologies. 12 years of experience in leading Software development groups and managing multi-disciplinary projects. Results oriented manager with strong technical leadership. Bring proven experience in R&D project management as well as customer facing. \nWide experience in Software development methods and project flows from creating the requirements, architecture, development, integration, testing, debugging and customer support. \n \nProven experience as a Group Manager of 20+ engineers and team leaders in the area of developing mobile wireless embedded systems. Manage local teams and offshore including sub-contractors. \nProven experience in leading R&D Software projects as well as customization projects for customers. Experienced with customers facing and support. Specialties:WiFi, Bluetooth, Linux, Android, C, real time embedded systems, project management, device drivers, Firmware, Chips, FPGA, Hardware, mobile, wireless, network communication protocols, Software development methodologies. Experience Wireless Connectivity Software Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Israel Wireless Connectivity Group Manager Texas Instruments January 2010  –  November 2012  (2 years 11 months) Israel \tManage a group of 20+ engineers and team leaders in Texas Instruments and offshore. \n\tResponsible for the Software development and testing of WiFi and Bluetooth solutions. \n\tManage the development of user space applications and kernel drivers on Android and Linux embedded platforms, as well as Internet of Things projects. \n\tBuilt an offshore QA team. \n\tLead the technical customer support worldwide. \n\tManage the work with sub-contractors on SOW based. \n\tResponsible for the work with module makers in the US, Taiwan and China. \n\tWork with international Marketing and Business partners. Project Manager - Bluetooth R&D Texas Instruments January 2008  –  December 2009  (2 years) \tLed multiple projects in the Bluetooth R&D and managed multiple teams. \n\tResponsible for the development of Bluetooth Headset chip and Software for a leading mobile customer. \n\tDeep technical involvement in the Firmware, Software, Hardware, RF and system-on-a-chip components. \n\tLed the development of the Bluetooth Protocol Stack on Windows and Android. \n\tLed the defining of processes, methodologies and tools in the engineering team. Project Manager - WiFi R&D Texas Instruments January 2004  –  December 2007  (4 years) \tPlayed a key role in building the mobile WiFi R&D. \n\tParticipated in the definition of the WiFi chip and Software, led multiple teams and had close contact with key mobile customers. \n\tResponsible for the development of WiFi Hardware and Software. Team Leader - Bluetooth R&D Texas Instruments August 2000  –  December 2003  (3 years 5 months) \tResponsible for the development of the Firmware in TI's first single chip Bluetooth device. \n\tKey role in the definition of the Firmware architecture of the Bluetooth chip. \n\tManaged 10+ developers. \n\tTechnical authority for Bluetooth Firmware. Firmware Programmer - Bluetooth R&D Texas Instruments January 1999  –  July 2000  (1 year 7 months) \tLed the design and the implementation of Bluetooth Firmware modules: data path, voice path, low power modules, low level drivers. \n\tTechnical environment: Firmware, C, real time embedded systems, Bluetooth, FPGA, Chips, Hardware, mobile, wireless. Real time embedded Software engineer Tadiran Telecom March 1997  –  December 1998  (1 year 10 months) \tDefined, designed and developed Software modules and embedded applications for advanced graphic telephone. Wireless Connectivity Software Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Israel Wireless Connectivity Software Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Israel Wireless Connectivity Group Manager Texas Instruments January 2010  –  November 2012  (2 years 11 months) Israel \tManage a group of 20+ engineers and team leaders in Texas Instruments and offshore. \n\tResponsible for the Software development and testing of WiFi and Bluetooth solutions. \n\tManage the development of user space applications and kernel drivers on Android and Linux embedded platforms, as well as Internet of Things projects. \n\tBuilt an offshore QA team. \n\tLead the technical customer support worldwide. \n\tManage the work with sub-contractors on SOW based. \n\tResponsible for the work with module makers in the US, Taiwan and China. \n\tWork with international Marketing and Business partners. Wireless Connectivity Group Manager Texas Instruments January 2010  –  November 2012  (2 years 11 months) Israel \tManage a group of 20+ engineers and team leaders in Texas Instruments and offshore. \n\tResponsible for the Software development and testing of WiFi and Bluetooth solutions. \n\tManage the development of user space applications and kernel drivers on Android and Linux embedded platforms, as well as Internet of Things projects. \n\tBuilt an offshore QA team. \n\tLead the technical customer support worldwide. \n\tManage the work with sub-contractors on SOW based. \n\tResponsible for the work with module makers in the US, Taiwan and China. \n\tWork with international Marketing and Business partners. Project Manager - Bluetooth R&D Texas Instruments January 2008  –  December 2009  (2 years) \tLed multiple projects in the Bluetooth R&D and managed multiple teams. \n\tResponsible for the development of Bluetooth Headset chip and Software for a leading mobile customer. \n\tDeep technical involvement in the Firmware, Software, Hardware, RF and system-on-a-chip components. \n\tLed the development of the Bluetooth Protocol Stack on Windows and Android. \n\tLed the defining of processes, methodologies and tools in the engineering team. Project Manager - Bluetooth R&D Texas Instruments January 2008  –  December 2009  (2 years) \tLed multiple projects in the Bluetooth R&D and managed multiple teams. \n\tResponsible for the development of Bluetooth Headset chip and Software for a leading mobile customer. \n\tDeep technical involvement in the Firmware, Software, Hardware, RF and system-on-a-chip components. \n\tLed the development of the Bluetooth Protocol Stack on Windows and Android. \n\tLed the defining of processes, methodologies and tools in the engineering team. Project Manager - WiFi R&D Texas Instruments January 2004  –  December 2007  (4 years) \tPlayed a key role in building the mobile WiFi R&D. \n\tParticipated in the definition of the WiFi chip and Software, led multiple teams and had close contact with key mobile customers. \n\tResponsible for the development of WiFi Hardware and Software. Project Manager - WiFi R&D Texas Instruments January 2004  –  December 2007  (4 years) \tPlayed a key role in building the mobile WiFi R&D. \n\tParticipated in the definition of the WiFi chip and Software, led multiple teams and had close contact with key mobile customers. \n\tResponsible for the development of WiFi Hardware and Software. Team Leader - Bluetooth R&D Texas Instruments August 2000  –  December 2003  (3 years 5 months) \tResponsible for the development of the Firmware in TI's first single chip Bluetooth device. \n\tKey role in the definition of the Firmware architecture of the Bluetooth chip. \n\tManaged 10+ developers. \n\tTechnical authority for Bluetooth Firmware. Team Leader - Bluetooth R&D Texas Instruments August 2000  –  December 2003  (3 years 5 months) \tResponsible for the development of the Firmware in TI's first single chip Bluetooth device. \n\tKey role in the definition of the Firmware architecture of the Bluetooth chip. \n\tManaged 10+ developers. \n\tTechnical authority for Bluetooth Firmware. Firmware Programmer - Bluetooth R&D Texas Instruments January 1999  –  July 2000  (1 year 7 months) \tLed the design and the implementation of Bluetooth Firmware modules: data path, voice path, low power modules, low level drivers. \n\tTechnical environment: Firmware, C, real time embedded systems, Bluetooth, FPGA, Chips, Hardware, mobile, wireless. Firmware Programmer - Bluetooth R&D Texas Instruments January 1999  –  July 2000  (1 year 7 months) \tLed the design and the implementation of Bluetooth Firmware modules: data path, voice path, low power modules, low level drivers. \n\tTechnical environment: Firmware, C, real time embedded systems, Bluetooth, FPGA, Chips, Hardware, mobile, wireless. Real time embedded Software engineer Tadiran Telecom March 1997  –  December 1998  (1 year 10 months) \tDefined, designed and developed Software modules and embedded applications for advanced graphic telephone. Real time embedded Software engineer Tadiran Telecom March 1997  –  December 1998  (1 year 10 months) \tDefined, designed and developed Software modules and embedded applications for advanced graphic telephone. Languages Hebrew English Hebrew English Hebrew English Skills Internet of Things Program Management Software Project... Wireless WiFi Bluetooth Windows Linux Android RTOS Embedded Software Mobile Devices Embedded Systems Firmware Software Development Software Engineering C WLAN ARM R&D Team Management Architecture Hardware Programming SoC Cross-functional Team... Real Time Software Design Communication Protocols Assembly Cellular Customer Relations Team Building Matrix Management Semiconductors Mobile Mobile Communications Processors See 23+     See less Skills  Internet of Things Program Management Software Project... Wireless WiFi Bluetooth Windows Linux Android RTOS Embedded Software Mobile Devices Embedded Systems Firmware Software Development Software Engineering C WLAN ARM R&D Team Management Architecture Hardware Programming SoC Cross-functional Team... Real Time Software Design Communication Protocols Assembly Cellular Customer Relations Team Building Matrix Management Semiconductors Mobile Mobile Communications Processors See 23+     See less Internet of Things Program Management Software Project... Wireless WiFi Bluetooth Windows Linux Android RTOS Embedded Software Mobile Devices Embedded Systems Firmware Software Development Software Engineering C WLAN ARM R&D Team Management Architecture Hardware Programming SoC Cross-functional Team... Real Time Software Design Communication Protocols Assembly Cellular Customer Relations Team Building Matrix Management Semiconductors Mobile Mobile Communications Processors See 23+     See less Internet of Things Program Management Software Project... Wireless WiFi Bluetooth Windows Linux Android RTOS Embedded Software Mobile Devices Embedded Systems Firmware Software Development Software Engineering C WLAN ARM R&D Team Management Architecture Hardware Programming SoC Cross-functional Team... Real Time Software Design Communication Protocols Assembly Cellular Customer Relations Team Building Matrix Management Semiconductors Mobile Mobile Communications Processors See 23+     See less Education Ben-Gurion University of the Negev MBA 2001  – 2003 Graduated with distinction Holon Institute of Technology 1994  – 1998 Graduated with special distinction Amal B Amal B Ben-Gurion University of the Negev MBA 2001  – 2003 Graduated with distinction Ben-Gurion University of the Negev MBA 2001  – 2003 Graduated with distinction Ben-Gurion University of the Negev MBA 2001  – 2003 Graduated with distinction Holon Institute of Technology 1994  – 1998 Graduated with special distinction Holon Institute of Technology 1994  – 1998 Graduated with special distinction Holon Institute of Technology 1994  – 1998 Graduated with special distinction Amal B Amal B Amal B Amal B Amal B Amal B ", "Skills PMP Program Management Engineering Management Telecommunications... Telecommunications Integration Software Project... Testing Software Development Open Source Software Agile Methodologies Agile Project Management Project Delivery Requirements Analysis Project Management Wireless Enterprise Software LTE Six Sigma Software Design Product Management Management Scrum Mobile Devices Troubleshooting GSM See 11+     See less Skills  PMP Program Management Engineering Management Telecommunications... Telecommunications Integration Software Project... Testing Software Development Open Source Software Agile Methodologies Agile Project Management Project Delivery Requirements Analysis Project Management Wireless Enterprise Software LTE Six Sigma Software Design Product Management Management Scrum Mobile Devices Troubleshooting GSM See 11+     See less PMP Program Management Engineering Management Telecommunications... Telecommunications Integration Software Project... Testing Software Development Open Source Software Agile Methodologies Agile Project Management Project Delivery Requirements Analysis Project Management Wireless Enterprise Software LTE Six Sigma Software Design Product Management Management Scrum Mobile Devices Troubleshooting GSM See 11+     See less PMP Program Management Engineering Management Telecommunications... Telecommunications Integration Software Project... Testing Software Development Open Source Software Agile Methodologies Agile Project Management Project Delivery Requirements Analysis Project Management Wireless Enterprise Software LTE Six Sigma Software Design Product Management Management Scrum Mobile Devices Troubleshooting GSM See 11+     See less Honors & Awards ", "Summary Strategic Technical and Market Analysis with a Special Focus on Cloud Telecommunications Delivery in the Areas of SDN and Network Function Virtualization (NFV) \n \nCTO Engagement and Technology Alignment Program Management \n \nStrategic Market And Sales Opportunity Enabling  \n \nSolution Partner Go to Market Planning  \n \nStandards Influencing and Product Defintion, Project Management,  \n \nSpecialties: Engagement Modeling, Pre Sales Pipeline Management, TCO and Opportunity Analysis in new and emerging Telecom markets Summary Strategic Technical and Market Analysis with a Special Focus on Cloud Telecommunications Delivery in the Areas of SDN and Network Function Virtualization (NFV) \n \nCTO Engagement and Technology Alignment Program Management \n \nStrategic Market And Sales Opportunity Enabling  \n \nSolution Partner Go to Market Planning  \n \nStandards Influencing and Product Defintion, Project Management,  \n \nSpecialties: Engagement Modeling, Pre Sales Pipeline Management, TCO and Opportunity Analysis in new and emerging Telecom markets Strategic Technical and Market Analysis with a Special Focus on Cloud Telecommunications Delivery in the Areas of SDN and Network Function Virtualization (NFV) \n \nCTO Engagement and Technology Alignment Program Management \n \nStrategic Market And Sales Opportunity Enabling  \n \nSolution Partner Go to Market Planning  \n \nStandards Influencing and Product Defintion, Project Management,  \n \nSpecialties: Engagement Modeling, Pre Sales Pipeline Management, TCO and Opportunity Analysis in new and emerging Telecom markets Strategic Technical and Market Analysis with a Special Focus on Cloud Telecommunications Delivery in the Areas of SDN and Network Function Virtualization (NFV) \n \nCTO Engagement and Technology Alignment Program Management \n \nStrategic Market And Sales Opportunity Enabling  \n \nSolution Partner Go to Market Planning  \n \nStandards Influencing and Product Defintion, Project Management,  \n \nSpecialties: Engagement Modeling, Pre Sales Pipeline Management, TCO and Opportunity Analysis in new and emerging Telecom markets Experience Solutions and Market Development Manager Intel Corporation October 2011  – Present (3 years 11 months) Shannon, Ireland Product Manager Intel Corporation October 2009  –  October 2011  (2 years 1 month) Software Program Manager Intel Corporation February 2009  –  September 2010  (1 year 8 months) Group Engineering Manager Intel Technologies October 2007  –  March 2009  (1 year 6 months) Fulltime MBA Student Smufit Business School UCD September 2006  –  July 2007  (11 months) Embedded Software Manager Commprove Technologies July 2004  –  September 2006  (2 years 3 months) Project Manager & Team Leader Silicon and Software Systems October 2000  –  July 2004  (3 years 10 months) System Architect Ebeon January 2000  –  October 2000  (10 months) SW Lead Tellabs, Ireland 1994  –  2000  (6 years) Embedded Software Engineer Tellabs Ltd December 1993  –  December 1999  (6 years 1 month) Solutions and Market Development Manager Intel Corporation October 2011  – Present (3 years 11 months) Shannon, Ireland Solutions and Market Development Manager Intel Corporation October 2011  – Present (3 years 11 months) Shannon, Ireland Product Manager Intel Corporation October 2009  –  October 2011  (2 years 1 month) Product Manager Intel Corporation October 2009  –  October 2011  (2 years 1 month) Software Program Manager Intel Corporation February 2009  –  September 2010  (1 year 8 months) Software Program Manager Intel Corporation February 2009  –  September 2010  (1 year 8 months) Group Engineering Manager Intel Technologies October 2007  –  March 2009  (1 year 6 months) Group Engineering Manager Intel Technologies October 2007  –  March 2009  (1 year 6 months) Fulltime MBA Student Smufit Business School UCD September 2006  –  July 2007  (11 months) Fulltime MBA Student Smufit Business School UCD September 2006  –  July 2007  (11 months) Embedded Software Manager Commprove Technologies July 2004  –  September 2006  (2 years 3 months) Embedded Software Manager Commprove Technologies July 2004  –  September 2006  (2 years 3 months) Project Manager & Team Leader Silicon and Software Systems October 2000  –  July 2004  (3 years 10 months) Project Manager & Team Leader Silicon and Software Systems October 2000  –  July 2004  (3 years 10 months) System Architect Ebeon January 2000  –  October 2000  (10 months) System Architect Ebeon January 2000  –  October 2000  (10 months) SW Lead Tellabs, Ireland 1994  –  2000  (6 years) SW Lead Tellabs, Ireland 1994  –  2000  (6 years) Embedded Software Engineer Tellabs Ltd December 1993  –  December 1999  (6 years 1 month) Embedded Software Engineer Tellabs Ltd December 1993  –  December 1999  (6 years 1 month) Languages Spanish Spanish Spanish Skills Product Development Product Management Embedded Systems Project Management Software Project... Embedded Software SoC Software Development Software Engineering Device Drivers Software Design Semiconductors Testing Perl C IP Go-to-market Strategy Agile Methodologies Telecommunications Electronics VxWorks Processors Mobile Devices Product Marketing Distributed Systems SNMP Cloud Computing Linux System Architecture Wireless Management Program Management Cross-functional Team... See 18+     See less Skills  Product Development Product Management Embedded Systems Project Management Software Project... Embedded Software SoC Software Development Software Engineering Device Drivers Software Design Semiconductors Testing Perl C IP Go-to-market Strategy Agile Methodologies Telecommunications Electronics VxWorks Processors Mobile Devices Product Marketing Distributed Systems SNMP Cloud Computing Linux System Architecture Wireless Management Program Management Cross-functional Team... See 18+     See less Product Development Product Management Embedded Systems Project Management Software Project... Embedded Software SoC Software Development Software Engineering Device Drivers Software Design Semiconductors Testing Perl C IP Go-to-market Strategy Agile Methodologies Telecommunications Electronics VxWorks Processors Mobile Devices Product Marketing Distributed Systems SNMP Cloud Computing Linux System Architecture Wireless Management Program Management Cross-functional Team... See 18+     See less Product Development Product Management Embedded Systems Project Management Software Project... Embedded Software SoC Software Development Software Engineering Device Drivers Software Design Semiconductors Testing Perl C IP Go-to-market Strategy Agile Methodologies Telecommunications Electronics VxWorks Processors Mobile Devices Product Marketing Distributed Systems SNMP Cloud Computing Linux System Architecture Wireless Management Program Management Cross-functional Team... See 18+     See less Education University College Dublin MBA,  Master In Business Administration 2006  – 2007 MBA Activities and Societies:  Focus on Product and Project Management University of Limerick Graduate Diploma,  Computer Engineering 1992  – 1993 MBA, Bachelor of Electronic Engineering Activities and Societies:  GAA ,  Debating Society ,  Class Representative University of Limerick BEng,  Electronic Engineering 1988  – 1992 Graduate Diploma in Computer Engineering and a degree in Electronic Engineering Activities and Societies:  Business Strategy Research ,  Golf ,  GAA University College Dublin MBA,  Master In Business Administration 2006  – 2007 MBA Activities and Societies:  Focus on Product and Project Management University College Dublin MBA,  Master In Business Administration 2006  – 2007 MBA Activities and Societies:  Focus on Product and Project Management University College Dublin MBA,  Master In Business Administration 2006  – 2007 MBA Activities and Societies:  Focus on Product and Project Management University of Limerick Graduate Diploma,  Computer Engineering 1992  – 1993 MBA, Bachelor of Electronic Engineering Activities and Societies:  GAA ,  Debating Society ,  Class Representative University of Limerick Graduate Diploma,  Computer Engineering 1992  – 1993 MBA, Bachelor of Electronic Engineering Activities and Societies:  GAA ,  Debating Society ,  Class Representative University of Limerick Graduate Diploma,  Computer Engineering 1992  – 1993 MBA, Bachelor of Electronic Engineering Activities and Societies:  GAA ,  Debating Society ,  Class Representative University of Limerick BEng,  Electronic Engineering 1988  – 1992 Graduate Diploma in Computer Engineering and a degree in Electronic Engineering Activities and Societies:  Business Strategy Research ,  Golf ,  GAA University of Limerick BEng,  Electronic Engineering 1988  – 1992 Graduate Diploma in Computer Engineering and a degree in Electronic Engineering Activities and Societies:  Business Strategy Research ,  Golf ,  GAA University of Limerick BEng,  Electronic Engineering 1988  – 1992 Graduate Diploma in Computer Engineering and a degree in Electronic Engineering Activities and Societies:  Business Strategy Research ,  Golf ,  GAA ", "Skills Embedded Systems Embedded Software Debugging Integration Device Drivers ARM SoC Software Engineering RTOS Software Development C Skills  Embedded Systems Embedded Software Debugging Integration Device Drivers ARM SoC Software Engineering RTOS Software Development C Embedded Systems Embedded Software Debugging Integration Device Drivers ARM SoC Software Engineering RTOS Software Development C Embedded Systems Embedded Software Debugging Integration Device Drivers ARM SoC Software Engineering RTOS Software Development C ", "Summary I have many and wide-ranging experiences in technology development and testing, much of it in communications & networks, that have provided a broad base for successfully managing software programs. Successful programs require a strong understanding of the customers' needs (requirements) and evaluating the program's teams in order to establish processes that allow the team to be successful in delivering the products. No two programs are the same. I continue to learn new technologies to be more effective in helping the development teams, as well as new program methodologies such as Agile, Scrum and Kanban to improve efficiency and productivity. However, fundamental program management methods of meeting the customer's needs (schedule, cost, quality), empowering highly effective teams and monitoring/reporting progress are at the heart of every successful program. Summary I have many and wide-ranging experiences in technology development and testing, much of it in communications & networks, that have provided a broad base for successfully managing software programs. Successful programs require a strong understanding of the customers' needs (requirements) and evaluating the program's teams in order to establish processes that allow the team to be successful in delivering the products. No two programs are the same. I continue to learn new technologies to be more effective in helping the development teams, as well as new program methodologies such as Agile, Scrum and Kanban to improve efficiency and productivity. However, fundamental program management methods of meeting the customer's needs (schedule, cost, quality), empowering highly effective teams and monitoring/reporting progress are at the heart of every successful program. I have many and wide-ranging experiences in technology development and testing, much of it in communications & networks, that have provided a broad base for successfully managing software programs. Successful programs require a strong understanding of the customers' needs (requirements) and evaluating the program's teams in order to establish processes that allow the team to be successful in delivering the products. No two programs are the same. I continue to learn new technologies to be more effective in helping the development teams, as well as new program methodologies such as Agile, Scrum and Kanban to improve efficiency and productivity. However, fundamental program management methods of meeting the customer's needs (schedule, cost, quality), empowering highly effective teams and monitoring/reporting progress are at the heart of every successful program. I have many and wide-ranging experiences in technology development and testing, much of it in communications & networks, that have provided a broad base for successfully managing software programs. Successful programs require a strong understanding of the customers' needs (requirements) and evaluating the program's teams in order to establish processes that allow the team to be successful in delivering the products. No two programs are the same. I continue to learn new technologies to be more effective in helping the development teams, as well as new program methodologies such as Agile, Scrum and Kanban to improve efficiency and productivity. However, fundamental program management methods of meeting the customer's needs (schedule, cost, quality), empowering highly effective teams and monitoring/reporting progress are at the heart of every successful program. Experience Sr. Software Program Manager Intel Corporation August 1995  – Present (20 years 1 month) Hillsboro, Oregon Manage software projects & programs for Intel products including phones, tablets, laptops, Ultrabooks, wireless network products and conferencing technologies.  \n \nApril 2011 to Present: \nManage large programs with cross-geo teams to optimize OS (Android, ChromeOS & Windows) features to run best on Intel products. Coordinate internally with 10 engineering managers, six Principle Engineers and two QA managers to release highly optimized SW to meet release schedules for five product groups, usually eight to 10 concurrent products. Establish custom-tailored project processes, including Agile, to achieve highly efficient teams. Ensure teams have development & prototype systems through budgeting and order tracking. Use Business Intelligence tools, such as Tableau, MSBI and others to track project progress. Report project status to Intel managers and directors. Advise Intel management on organizational structures and changes to benefit the projects. Engineering Manager II Morrow, Inc. March 1988  –  August 1995  (7 years 6 months) Salem, Oregon Computer Analyst Westinghouse Hanford June 1986  –  March 1988  (1 year 10 months) Richland/Kennewick/Pasco, Washington Area Sr. Software Program Manager Intel Corporation August 1995  – Present (20 years 1 month) Hillsboro, Oregon Manage software projects & programs for Intel products including phones, tablets, laptops, Ultrabooks, wireless network products and conferencing technologies.  \n \nApril 2011 to Present: \nManage large programs with cross-geo teams to optimize OS (Android, ChromeOS & Windows) features to run best on Intel products. Coordinate internally with 10 engineering managers, six Principle Engineers and two QA managers to release highly optimized SW to meet release schedules for five product groups, usually eight to 10 concurrent products. Establish custom-tailored project processes, including Agile, to achieve highly efficient teams. Ensure teams have development & prototype systems through budgeting and order tracking. Use Business Intelligence tools, such as Tableau, MSBI and others to track project progress. Report project status to Intel managers and directors. Advise Intel management on organizational structures and changes to benefit the projects. Sr. Software Program Manager Intel Corporation August 1995  – Present (20 years 1 month) Hillsboro, Oregon Manage software projects & programs for Intel products including phones, tablets, laptops, Ultrabooks, wireless network products and conferencing technologies.  \n \nApril 2011 to Present: \nManage large programs with cross-geo teams to optimize OS (Android, ChromeOS & Windows) features to run best on Intel products. Coordinate internally with 10 engineering managers, six Principle Engineers and two QA managers to release highly optimized SW to meet release schedules for five product groups, usually eight to 10 concurrent products. Establish custom-tailored project processes, including Agile, to achieve highly efficient teams. Ensure teams have development & prototype systems through budgeting and order tracking. Use Business Intelligence tools, such as Tableau, MSBI and others to track project progress. Report project status to Intel managers and directors. Advise Intel management on organizational structures and changes to benefit the projects. Engineering Manager II Morrow, Inc. March 1988  –  August 1995  (7 years 6 months) Salem, Oregon Engineering Manager II Morrow, Inc. March 1988  –  August 1995  (7 years 6 months) Salem, Oregon Computer Analyst Westinghouse Hanford June 1986  –  March 1988  (1 year 10 months) Richland/Kennewick/Pasco, Washington Area Computer Analyst Westinghouse Hanford June 1986  –  March 1988  (1 year 10 months) Richland/Kennewick/Pasco, Washington Area Languages German German German Skills Software Project... Software Engineering Wireless Networking Certified Software... Network Architecture Android Organizational... Cross-functional Team... Cross-cultural Teams Business Intelligence IBM Rational Tools Tableau Software Development... ClearQuest Software Requirements Wireless Protocols IP Multimedia Subsystem Video Conferencing Data Conferencing PMP Agile Project Management Agile Methodologies Wireless Software Development C See 10+     See less Skills  Software Project... Software Engineering Wireless Networking Certified Software... Network Architecture Android Organizational... Cross-functional Team... Cross-cultural Teams Business Intelligence IBM Rational Tools Tableau Software Development... ClearQuest Software Requirements Wireless Protocols IP Multimedia Subsystem Video Conferencing Data Conferencing PMP Agile Project Management Agile Methodologies Wireless Software Development C See 10+     See less Software Project... Software Engineering Wireless Networking Certified Software... Network Architecture Android Organizational... Cross-functional Team... Cross-cultural Teams Business Intelligence IBM Rational Tools Tableau Software Development... ClearQuest Software Requirements Wireless Protocols IP Multimedia Subsystem Video Conferencing Data Conferencing PMP Agile Project Management Agile Methodologies Wireless Software Development C See 10+     See less Software Project... Software Engineering Wireless Networking Certified Software... Network Architecture Android Organizational... Cross-functional Team... Cross-cultural Teams Business Intelligence IBM Rational Tools Tableau Software Development... ClearQuest Software Requirements Wireless Protocols IP Multimedia Subsystem Video Conferencing Data Conferencing PMP Agile Project Management Agile Methodologies Wireless Software Development C See 10+     See less Education Oregon Institute of Technology Bachelor of Science (BS),  Computer Technology/Computer Systems Technology 1982  – 1986 Activities and Societies:  Data Processing and Managemeng Association;\nPhi Theta Kappa Honor;\nOutstanding CSET Student Award (1986); Oregon Institute of Technology Bachelor of Science (BS),  Computer Technology/Computer Systems Technology 1982  – 1986 Activities and Societies:  Data Processing and Managemeng Association;\nPhi Theta Kappa Honor;\nOutstanding CSET Student Award (1986); Oregon Institute of Technology Bachelor of Science (BS),  Computer Technology/Computer Systems Technology 1982  – 1986 Activities and Societies:  Data Processing and Managemeng Association;\nPhi Theta Kappa Honor;\nOutstanding CSET Student Award (1986); Oregon Institute of Technology Bachelor of Science (BS),  Computer Technology/Computer Systems Technology 1982  – 1986 Activities and Societies:  Data Processing and Managemeng Association;\nPhi Theta Kappa Honor;\nOutstanding CSET Student Award (1986); ", "Skills Agile Methodologies Program Management Cross-functional Team... Software Project... Integration Enterprise Software Software Development Product Management Scrum Unix Management Business Process SaaS Agile Project Management Software Engineering Project Delivery PMO Requirements Analysis See 3+     See less Skills  Agile Methodologies Program Management Cross-functional Team... Software Project... Integration Enterprise Software Software Development Product Management Scrum Unix Management Business Process SaaS Agile Project Management Software Engineering Project Delivery PMO Requirements Analysis See 3+     See less Agile Methodologies Program Management Cross-functional Team... Software Project... Integration Enterprise Software Software Development Product Management Scrum Unix Management Business Process SaaS Agile Project Management Software Engineering Project Delivery PMO Requirements Analysis See 3+     See less Agile Methodologies Program Management Cross-functional Team... Software Project... Integration Enterprise Software Software Development Product Management Scrum Unix Management Business Process SaaS Agile Project Management Software Engineering Project Delivery PMO Requirements Analysis See 3+     See less ", "Summary An award winning and results driven professional with 16 years experience in leading edge international IT companies. Excellent strategic, people, and technical management skills honed in dynamic customer focused environments. A highly effective communicator and leader that builds and motivates teams to deliver solutions with enthusiasm. An innovative achiever that consistently seeks excellence.  \n \nAREAS OF EXPERTISE: \n- Built and managed multiple software development teams of up to 20 people within large-scale IT environments and applications \n- Led highly visible large and complex programmes and projects in a distributed and matrixed team environment \n- Analysed problems and provided solutions to deliver high business value and maximise efficiencies \n- Optimised business deliveries with respect to results, cost, and schedule Summary An award winning and results driven professional with 16 years experience in leading edge international IT companies. Excellent strategic, people, and technical management skills honed in dynamic customer focused environments. A highly effective communicator and leader that builds and motivates teams to deliver solutions with enthusiasm. An innovative achiever that consistently seeks excellence.  \n \nAREAS OF EXPERTISE: \n- Built and managed multiple software development teams of up to 20 people within large-scale IT environments and applications \n- Led highly visible large and complex programmes and projects in a distributed and matrixed team environment \n- Analysed problems and provided solutions to deliver high business value and maximise efficiencies \n- Optimised business deliveries with respect to results, cost, and schedule An award winning and results driven professional with 16 years experience in leading edge international IT companies. Excellent strategic, people, and technical management skills honed in dynamic customer focused environments. A highly effective communicator and leader that builds and motivates teams to deliver solutions with enthusiasm. An innovative achiever that consistently seeks excellence.  \n \nAREAS OF EXPERTISE: \n- Built and managed multiple software development teams of up to 20 people within large-scale IT environments and applications \n- Led highly visible large and complex programmes and projects in a distributed and matrixed team environment \n- Analysed problems and provided solutions to deliver high business value and maximise efficiencies \n- Optimised business deliveries with respect to results, cost, and schedule An award winning and results driven professional with 16 years experience in leading edge international IT companies. Excellent strategic, people, and technical management skills honed in dynamic customer focused environments. A highly effective communicator and leader that builds and motivates teams to deliver solutions with enthusiasm. An innovative achiever that consistently seeks excellence.  \n \nAREAS OF EXPERTISE: \n- Built and managed multiple software development teams of up to 20 people within large-scale IT environments and applications \n- Led highly visible large and complex programmes and projects in a distributed and matrixed team environment \n- Analysed problems and provided solutions to deliver high business value and maximise efficiencies \n- Optimised business deliveries with respect to results, cost, and schedule Experience Software Program Manager Intel Corporation March 2015  – Present (6 months) Shannon Managing programs and projects in Software Defined Networking and Network Function Virtualization using open source solutions within the Data Centre Group at Intel's Shannon R&D facility.  Director Fidelity Investments February 2008  –  July 2014  (6 years 6 months) Galway, Ireland Director of Software Engineering Management in people leadership and technical management roles across 3 Fidelity business units. Directed programmes, projects, and multiple globally distributed software development teams of up to 20 people. Senior Manager Fidelity Investments September 2005  –  February 2008  (2 years 6 months) Galway Managed a globally distributed team of 19 people and other third party vendors across Ireland and India to provide HR and payroll interface outsourcing services. Project Manager Fidelity Investments March 2003  –  August 2005  (2 years 6 months) Galway Managed 8 developers to deliver 12 Oracle client implementations on schedule and budget. Project Lead Fidelity Investments March 2002  –  March 2003  (1 year 1 month) Galway Led 4 developers to deliver 3 Oracle client implementations. First of 8 staff to head up Galway office. Consultant Oracle September 1999  –  February 2002  (2 years 6 months) Dublin Led 3 developers to deliver an Oracle application to the Irish market and also designed and developed solutions for 4 consulting projects. Associate Consultant Oracle August 1998  –  August 1999  (1 year 1 month) Dublin Software Program Manager Intel Corporation March 2015  – Present (6 months) Shannon Managing programs and projects in Software Defined Networking and Network Function Virtualization using open source solutions within the Data Centre Group at Intel's Shannon R&D facility.  Software Program Manager Intel Corporation March 2015  – Present (6 months) Shannon Managing programs and projects in Software Defined Networking and Network Function Virtualization using open source solutions within the Data Centre Group at Intel's Shannon R&D facility.  Director Fidelity Investments February 2008  –  July 2014  (6 years 6 months) Galway, Ireland Director of Software Engineering Management in people leadership and technical management roles across 3 Fidelity business units. Directed programmes, projects, and multiple globally distributed software development teams of up to 20 people. Director Fidelity Investments February 2008  –  July 2014  (6 years 6 months) Galway, Ireland Director of Software Engineering Management in people leadership and technical management roles across 3 Fidelity business units. Directed programmes, projects, and multiple globally distributed software development teams of up to 20 people. Senior Manager Fidelity Investments September 2005  –  February 2008  (2 years 6 months) Galway Managed a globally distributed team of 19 people and other third party vendors across Ireland and India to provide HR and payroll interface outsourcing services. Senior Manager Fidelity Investments September 2005  –  February 2008  (2 years 6 months) Galway Managed a globally distributed team of 19 people and other third party vendors across Ireland and India to provide HR and payroll interface outsourcing services. Project Manager Fidelity Investments March 2003  –  August 2005  (2 years 6 months) Galway Managed 8 developers to deliver 12 Oracle client implementations on schedule and budget. Project Manager Fidelity Investments March 2003  –  August 2005  (2 years 6 months) Galway Managed 8 developers to deliver 12 Oracle client implementations on schedule and budget. Project Lead Fidelity Investments March 2002  –  March 2003  (1 year 1 month) Galway Led 4 developers to deliver 3 Oracle client implementations. First of 8 staff to head up Galway office. Project Lead Fidelity Investments March 2002  –  March 2003  (1 year 1 month) Galway Led 4 developers to deliver 3 Oracle client implementations. First of 8 staff to head up Galway office. Consultant Oracle September 1999  –  February 2002  (2 years 6 months) Dublin Led 3 developers to deliver an Oracle application to the Irish market and also designed and developed solutions for 4 consulting projects. Consultant Oracle September 1999  –  February 2002  (2 years 6 months) Dublin Led 3 developers to deliver an Oracle application to the Irish market and also designed and developed solutions for 4 consulting projects. Associate Consultant Oracle August 1998  –  August 1999  (1 year 1 month) Dublin Associate Consultant Oracle August 1998  –  August 1999  (1 year 1 month) Dublin Skills Agile Methodologies Project Management Vendor Management Portfolio Management Process Engineering Leadership Managing multiple... IT Strategy Team Building and... Software Development Business Partnership Program Management Application Lifecycle... Software Development... Information Security... Big Data Cloud Computing Talent Planning Financial Management Distributed Team... Strategy See 6+     See less Skills  Agile Methodologies Project Management Vendor Management Portfolio Management Process Engineering Leadership Managing multiple... IT Strategy Team Building and... Software Development Business Partnership Program Management Application Lifecycle... Software Development... Information Security... Big Data Cloud Computing Talent Planning Financial Management Distributed Team... Strategy See 6+     See less Agile Methodologies Project Management Vendor Management Portfolio Management Process Engineering Leadership Managing multiple... IT Strategy Team Building and... Software Development Business Partnership Program Management Application Lifecycle... Software Development... Information Security... Big Data Cloud Computing Talent Planning Financial Management Distributed Team... Strategy See 6+     See less Agile Methodologies Project Management Vendor Management Portfolio Management Process Engineering Leadership Managing multiple... IT Strategy Team Building and... Software Development Business Partnership Program Management Application Lifecycle... Software Development... Information Security... Big Data Cloud Computing Talent Planning Financial Management Distributed Team... Strategy See 6+     See less Education Liverpool University Bsc.,  Engineering Science 1998  – 2002 Harvard University Masters,  Engineering Science 1992  – 1994 Liverpool University Bsc.,  Engineering Science 1998  – 2002 Liverpool University Bsc.,  Engineering Science 1998  – 2002 Liverpool University Bsc.,  Engineering Science 1998  – 2002 Harvard University Masters,  Engineering Science 1992  – 1994 Harvard University Masters,  Engineering Science 1992  – 1994 Harvard University Masters,  Engineering Science 1992  – 1994 Honors & Awards Frank Knox Postgraduate Harvard Fellowship September 1992 Liverpool University Mason Bibby Engineering Scholarship June 1991 Frank Knox Postgraduate Harvard Fellowship September 1992 Frank Knox Postgraduate Harvard Fellowship September 1992 Frank Knox Postgraduate Harvard Fellowship September 1992 Liverpool University Mason Bibby Engineering Scholarship June 1991 Liverpool University Mason Bibby Engineering Scholarship June 1991 Liverpool University Mason Bibby Engineering Scholarship June 1991 ", "Summary Experienced software project/program manager with strong leadership, managerial, organizational, and communication skills. Summary Experienced software project/program manager with strong leadership, managerial, organizational, and communication skills. Experienced software project/program manager with strong leadership, managerial, organizational, and communication skills. Experienced software project/program manager with strong leadership, managerial, organizational, and communication skills. Experience Software Project Manager TIBCO Software Inc. February 2012  – Present (3 years 7 months) Palo Alto, California Manage two separate software programs in compliance with TIBCO PLC. This involves coordination between three geographies as well as several different roles within TIBCO. Responsible for creation and maintenance of Confluence pages and JIRA queries for project tracking. Monitor defects/enhancements to gain resolution and closure. Act as scrum master for two development projects. Project Manager Contractor TIBCO Software, Inc. January 2011  –  March 2011  (3 months) Implemented a mergers/acquisitions process within MS Project for Legal and Human Resources. Program Manager Hifn/Exar October 2007  –  June 2010  (2 years 9 months) Coordinated development of hardware and software for data security and compression applications. Initiated process improvements. Software Program Manager Intel Corporation May 2004  –  October 2007  (3 years 6 months) Managed development of software BIOS and drivers for mobile platforms. Managed development of Intel Centrino branding tool. Contributed to process improvement initiatives. Lead Sales Manager Williams-Sonoma, Inc. September 2003  –  May 2004  (9 months) Supervised sales and shipping/receiving staff during store hours. Assisted customers, performed daily and weekly financial analysis calculations. Responsible for receiving shipments and shipping externally. Engineering Manager Phoenix Technologies, Ltd. April 1999  –  January 2003  (3 years 10 months) Managed a team focusing on generating a single product. Managed the s/w development of this product. Acted as primary interface to customers, set delivery expectations for them. Provided technical documentation for product. Project Manager Phoenix Technologies, Ltd. March 1994  –  April 1999  (5 years 2 months) Managed core and customer s/w projects for internal usage and for external customers. Handled all customer interaction and communication. Software Development Engineer Chips & Technologies, Inc. 1992  –  1993  (1 year) Maintained code and implemented new features for EMS drivers for 8088/286/386sx chipsets \nImplemented Socket Services specification 2.0 for PCCHIP \nPrepared software and documentation for BIOS and EMS driver releases \nVerified, resolved, and responded to customer problems Quality Assurance Test Engineer Chips & Technologies, Inc. 1989  –  1992  (3 years) Set up computer systems and networks for test and development purposes \nTested BIOS, EMS drivers, and keyboard controllers on several hardware platforms using various software applications and add-in hardware components \nAnalyzed and isolated software bugs for BIOS programmers \nReviewed and edited customer documentation before release Software Project Manager TIBCO Software Inc. February 2012  – Present (3 years 7 months) Palo Alto, California Manage two separate software programs in compliance with TIBCO PLC. This involves coordination between three geographies as well as several different roles within TIBCO. Responsible for creation and maintenance of Confluence pages and JIRA queries for project tracking. Monitor defects/enhancements to gain resolution and closure. Act as scrum master for two development projects. Software Project Manager TIBCO Software Inc. February 2012  – Present (3 years 7 months) Palo Alto, California Manage two separate software programs in compliance with TIBCO PLC. This involves coordination between three geographies as well as several different roles within TIBCO. Responsible for creation and maintenance of Confluence pages and JIRA queries for project tracking. Monitor defects/enhancements to gain resolution and closure. Act as scrum master for two development projects. Project Manager Contractor TIBCO Software, Inc. January 2011  –  March 2011  (3 months) Implemented a mergers/acquisitions process within MS Project for Legal and Human Resources. Project Manager Contractor TIBCO Software, Inc. January 2011  –  March 2011  (3 months) Implemented a mergers/acquisitions process within MS Project for Legal and Human Resources. Program Manager Hifn/Exar October 2007  –  June 2010  (2 years 9 months) Coordinated development of hardware and software for data security and compression applications. Initiated process improvements. Program Manager Hifn/Exar October 2007  –  June 2010  (2 years 9 months) Coordinated development of hardware and software for data security and compression applications. Initiated process improvements. Software Program Manager Intel Corporation May 2004  –  October 2007  (3 years 6 months) Managed development of software BIOS and drivers for mobile platforms. Managed development of Intel Centrino branding tool. Contributed to process improvement initiatives. Software Program Manager Intel Corporation May 2004  –  October 2007  (3 years 6 months) Managed development of software BIOS and drivers for mobile platforms. Managed development of Intel Centrino branding tool. Contributed to process improvement initiatives. Lead Sales Manager Williams-Sonoma, Inc. September 2003  –  May 2004  (9 months) Supervised sales and shipping/receiving staff during store hours. Assisted customers, performed daily and weekly financial analysis calculations. Responsible for receiving shipments and shipping externally. Lead Sales Manager Williams-Sonoma, Inc. September 2003  –  May 2004  (9 months) Supervised sales and shipping/receiving staff during store hours. Assisted customers, performed daily and weekly financial analysis calculations. Responsible for receiving shipments and shipping externally. Engineering Manager Phoenix Technologies, Ltd. April 1999  –  January 2003  (3 years 10 months) Managed a team focusing on generating a single product. Managed the s/w development of this product. Acted as primary interface to customers, set delivery expectations for them. Provided technical documentation for product. Engineering Manager Phoenix Technologies, Ltd. April 1999  –  January 2003  (3 years 10 months) Managed a team focusing on generating a single product. Managed the s/w development of this product. Acted as primary interface to customers, set delivery expectations for them. Provided technical documentation for product. Project Manager Phoenix Technologies, Ltd. March 1994  –  April 1999  (5 years 2 months) Managed core and customer s/w projects for internal usage and for external customers. Handled all customer interaction and communication. Project Manager Phoenix Technologies, Ltd. March 1994  –  April 1999  (5 years 2 months) Managed core and customer s/w projects for internal usage and for external customers. Handled all customer interaction and communication. Software Development Engineer Chips & Technologies, Inc. 1992  –  1993  (1 year) Maintained code and implemented new features for EMS drivers for 8088/286/386sx chipsets \nImplemented Socket Services specification 2.0 for PCCHIP \nPrepared software and documentation for BIOS and EMS driver releases \nVerified, resolved, and responded to customer problems Software Development Engineer Chips & Technologies, Inc. 1992  –  1993  (1 year) Maintained code and implemented new features for EMS drivers for 8088/286/386sx chipsets \nImplemented Socket Services specification 2.0 for PCCHIP \nPrepared software and documentation for BIOS and EMS driver releases \nVerified, resolved, and responded to customer problems Quality Assurance Test Engineer Chips & Technologies, Inc. 1989  –  1992  (3 years) Set up computer systems and networks for test and development purposes \nTested BIOS, EMS drivers, and keyboard controllers on several hardware platforms using various software applications and add-in hardware components \nAnalyzed and isolated software bugs for BIOS programmers \nReviewed and edited customer documentation before release Quality Assurance Test Engineer Chips & Technologies, Inc. 1989  –  1992  (3 years) Set up computer systems and networks for test and development purposes \nTested BIOS, EMS drivers, and keyboard controllers on several hardware platforms using various software applications and add-in hardware components \nAnalyzed and isolated software bugs for BIOS programmers \nReviewed and edited customer documentation before release Skills Software Documentation Software Development Engineering Management Embedded Software Software Engineering Program Management Testing Management Go-to-market Strategy MS Project Device Drivers Cross-functional Team... Firmware Hardware Product Marketing Embedded Systems Intel Semiconductors Product Management System Architecture Quality Assurance See 6+     See less Skills  Software Documentation Software Development Engineering Management Embedded Software Software Engineering Program Management Testing Management Go-to-market Strategy MS Project Device Drivers Cross-functional Team... Firmware Hardware Product Marketing Embedded Systems Intel Semiconductors Product Management System Architecture Quality Assurance See 6+     See less Software Documentation Software Development Engineering Management Embedded Software Software Engineering Program Management Testing Management Go-to-market Strategy MS Project Device Drivers Cross-functional Team... Firmware Hardware Product Marketing Embedded Systems Intel Semiconductors Product Management System Architecture Quality Assurance See 6+     See less Software Documentation Software Development Engineering Management Embedded Software Software Engineering Program Management Testing Management Go-to-market Strategy MS Project Device Drivers Cross-functional Team... Firmware Hardware Product Marketing Embedded Systems Intel Semiconductors Product Management System Architecture Quality Assurance See 6+     See less Education Cal Poly, San Luis Obispo BS,  Electronic Engineering September 1984  – June 1989 Cal Poly, San Luis Obispo BS,  Electronic Engineering September 1984  – June 1989 Cal Poly, San Luis Obispo BS,  Electronic Engineering September 1984  – June 1989 Cal Poly, San Luis Obispo BS,  Electronic Engineering September 1984  – June 1989 ", "Skills Skills     ", "Experience Software Program Manager Intel Corporation Software Program Manager Intel Corporation Software Program Manager Intel Corporation "]}