{"position": "Software QA Engineer", "company": "Intel Corporation", "profiles": ["Experience Sr. Software QA Engineer Intel Corporation June 2011  – Present (4 years 3 months) Santa Clara, CA QA Engineer Hooked Wireless January 2009  –  December 2011  (3 years) Testing mobile apps on various smart phones which on Android, iPhone, Symbian, Windows Mobile 6. \nTesting Client and Server based applications. QA Engineer Yahoo! June 2010  –  February 2011  (9 months) Worked on Yahoo mobile App for HP Android tablet and iPad QA Engineer PayPal 2011  –  2011  (less than a year) QA Engineer Cisco December 2007  –  December 2008  (1 year 1 month) Tested Enterprise mobile apps on all smart phones which run on Symbian, Blackberry and iPhone. Sr. Software QA Engineer Intel Corporation June 2011  – Present (4 years 3 months) Santa Clara, CA Sr. Software QA Engineer Intel Corporation June 2011  – Present (4 years 3 months) Santa Clara, CA QA Engineer Hooked Wireless January 2009  –  December 2011  (3 years) Testing mobile apps on various smart phones which on Android, iPhone, Symbian, Windows Mobile 6. \nTesting Client and Server based applications. QA Engineer Hooked Wireless January 2009  –  December 2011  (3 years) Testing mobile apps on various smart phones which on Android, iPhone, Symbian, Windows Mobile 6. \nTesting Client and Server based applications. QA Engineer Yahoo! June 2010  –  February 2011  (9 months) Worked on Yahoo mobile App for HP Android tablet and iPad QA Engineer Yahoo! June 2010  –  February 2011  (9 months) Worked on Yahoo mobile App for HP Android tablet and iPad QA Engineer PayPal 2011  –  2011  (less than a year) QA Engineer PayPal 2011  –  2011  (less than a year) QA Engineer Cisco December 2007  –  December 2008  (1 year 1 month) Tested Enterprise mobile apps on all smart phones which run on Symbian, Blackberry and iPhone. QA Engineer Cisco December 2007  –  December 2008  (1 year 1 month) Tested Enterprise mobile apps on all smart phones which run on Symbian, Blackberry and iPhone. Skills Mobile Testing Android Quality Assurance Web Applications Xcode Software Quality... Mobile Devices Symbian Mobile Applications Perl iPhone Software Engineering Skills  Mobile Testing Android Quality Assurance Web Applications Xcode Software Quality... Mobile Devices Symbian Mobile Applications Perl iPhone Software Engineering Mobile Testing Android Quality Assurance Web Applications Xcode Software Quality... Mobile Devices Symbian Mobile Applications Perl iPhone Software Engineering Mobile Testing Android Quality Assurance Web Applications Xcode Software Quality... Mobile Devices Symbian Mobile Applications Perl iPhone Software Engineering Education University of Hyderabad PGDCS,  Computer Science 1995  – 1996 Acharya Nagarjuna University 1989  – 1991 University of Hyderabad PGDCS,  Computer Science 1995  – 1996 University of Hyderabad PGDCS,  Computer Science 1995  – 1996 University of Hyderabad PGDCS,  Computer Science 1995  – 1996 Acharya Nagarjuna University 1989  – 1991 Acharya Nagarjuna University 1989  – 1991 Acharya Nagarjuna University 1989  – 1991 ", "Experience software QA engineer Intel Corporation 2013  – Present (2 years) Hillsboro, OR senior software engineer Motorola Mobile Devices May 2000  –  2012  (12 years) software engineer motorola 2000  –  2009  (9 years) software engineer motorola networks 2000  –  2009  (9 years) Software Engineer Nortel Networks November 1997  –  May 2000  (2 years 7 months) Ottawa, Canada Area CDMA BTS Software Development \nCDMA BTS Common Software Development senior software engineer Nortel Networks March 1994  –  October 1997  (3 years 8 months) Ottawa, Canada Area Digital Switch Software Development \nDMS AIN/CS1 Software Development software QA engineer Intel Corporation 2013  – Present (2 years) Hillsboro, OR software QA engineer Intel Corporation 2013  – Present (2 years) Hillsboro, OR senior software engineer Motorola Mobile Devices May 2000  –  2012  (12 years) senior software engineer Motorola Mobile Devices May 2000  –  2012  (12 years) software engineer motorola 2000  –  2009  (9 years) software engineer motorola 2000  –  2009  (9 years) software engineer motorola networks 2000  –  2009  (9 years) software engineer motorola networks 2000  –  2009  (9 years) Software Engineer Nortel Networks November 1997  –  May 2000  (2 years 7 months) Ottawa, Canada Area CDMA BTS Software Development \nCDMA BTS Common Software Development Software Engineer Nortel Networks November 1997  –  May 2000  (2 years 7 months) Ottawa, Canada Area CDMA BTS Software Development \nCDMA BTS Common Software Development senior software engineer Nortel Networks March 1994  –  October 1997  (3 years 8 months) Ottawa, Canada Area Digital Switch Software Development \nDMS AIN/CS1 Software Development senior software engineer Nortel Networks March 1994  –  October 1997  (3 years 8 months) Ottawa, Canada Area Digital Switch Software Development \nDMS AIN/CS1 Software Development Education Taiyuan University of Science and Technology Taiyuan University of Science and Technology Taiyuan University of Science and Technology Taiyuan University of Science and Technology ", "Experience Software QA Engineer Intel Corporation November 2012  – Present (2 years 10 months) Software QA Engineer Intel Corporation November 2012  – Present (2 years 10 months) Software QA Engineer Intel Corporation November 2012  – Present (2 years 10 months) ", "Summary Result driven Quality Assurance professional with over 16 years of combined experience in defining standards and processes, facilitating and leading change and performing complex automation / manual testing of web based, windows based client server applications and mobile platforms. Well-versed in SDLC and QA life cycles in Agile and waterfall methodologies, offshore collaboration, problem solving and scrum master roles and responsibilities. Consistent history of leading large-scale projects, developing robust QA guidelines, implementing successful process improvements, and multifaceted automation.  Summary Result driven Quality Assurance professional with over 16 years of combined experience in defining standards and processes, facilitating and leading change and performing complex automation / manual testing of web based, windows based client server applications and mobile platforms. Well-versed in SDLC and QA life cycles in Agile and waterfall methodologies, offshore collaboration, problem solving and scrum master roles and responsibilities. Consistent history of leading large-scale projects, developing robust QA guidelines, implementing successful process improvements, and multifaceted automation.  Result driven Quality Assurance professional with over 16 years of combined experience in defining standards and processes, facilitating and leading change and performing complex automation / manual testing of web based, windows based client server applications and mobile platforms. Well-versed in SDLC and QA life cycles in Agile and waterfall methodologies, offshore collaboration, problem solving and scrum master roles and responsibilities. Consistent history of leading large-scale projects, developing robust QA guidelines, implementing successful process improvements, and multifaceted automation.  Result driven Quality Assurance professional with over 16 years of combined experience in defining standards and processes, facilitating and leading change and performing complex automation / manual testing of web based, windows based client server applications and mobile platforms. Well-versed in SDLC and QA life cycles in Agile and waterfall methodologies, offshore collaboration, problem solving and scrum master roles and responsibilities. Consistent history of leading large-scale projects, developing robust QA guidelines, implementing successful process improvements, and multifaceted automation.  Experience QA Team Lead Fiserv Digital Channels, Hillsboro OR January 2006  – Present (9 years 8 months) Hillsboro Oregon Software QA Engineer Freightliner / Daimler October 2004  –  April 2005  (7 months) Portlad Oregon Software QA Engineer Intel Corporation January 2004  –  October 2004  (10 months) Hillsboro Oregon Software QA Engineer Oregon Department of Transportation May 2003  –  September 2003  (5 months) Portland, Oregon Area Software QA Engineer FEI Company August 2002  –  October 2002  (3 months) Hillsboro Oregon Software QA Engineer Intel Corporation November 2000  –  November 2001  (1 year 1 month) Hillsboro Oregon QA Team Lead Fiserv Digital Channels, Hillsboro OR January 2006  – Present (9 years 8 months) Hillsboro Oregon QA Team Lead Fiserv Digital Channels, Hillsboro OR January 2006  – Present (9 years 8 months) Hillsboro Oregon Software QA Engineer Freightliner / Daimler October 2004  –  April 2005  (7 months) Portlad Oregon Software QA Engineer Freightliner / Daimler October 2004  –  April 2005  (7 months) Portlad Oregon Software QA Engineer Intel Corporation January 2004  –  October 2004  (10 months) Hillsboro Oregon Software QA Engineer Intel Corporation January 2004  –  October 2004  (10 months) Hillsboro Oregon Software QA Engineer Oregon Department of Transportation May 2003  –  September 2003  (5 months) Portland, Oregon Area Software QA Engineer Oregon Department of Transportation May 2003  –  September 2003  (5 months) Portland, Oregon Area Software QA Engineer FEI Company August 2002  –  October 2002  (3 months) Hillsboro Oregon Software QA Engineer FEI Company August 2002  –  October 2002  (3 months) Hillsboro Oregon Software QA Engineer Intel Corporation November 2000  –  November 2001  (1 year 1 month) Hillsboro Oregon Software QA Engineer Intel Corporation November 2000  –  November 2001  (1 year 1 month) Hillsboro Oregon Skills Agile Methodologies Visual studio 2010, C#... SQL server 2008 R2, TFS... Team Track, Quality... C# TFS Visual Studio SDLC Quality Assurance Skills  Agile Methodologies Visual studio 2010, C#... SQL server 2008 R2, TFS... Team Track, Quality... C# TFS Visual Studio SDLC Quality Assurance Agile Methodologies Visual studio 2010, C#... SQL server 2008 R2, TFS... Team Track, Quality... C# TFS Visual Studio SDLC Quality Assurance Agile Methodologies Visual studio 2010, C#... SQL server 2008 R2, TFS... Team Track, Quality... C# TFS Visual Studio SDLC Quality Assurance ", "Experience Software QA Engineer Intel Corporation June 2011  – Present (4 years 3 months) Nizhny Novgorod Region, Russian Federation Undergraduate Intern Technical Intel Corporation May 2010  –  June 2011  (1 year 2 months) Sarov Software QA Engineer Intel Corporation June 2011  – Present (4 years 3 months) Nizhny Novgorod Region, Russian Federation Software QA Engineer Intel Corporation June 2011  – Present (4 years 3 months) Nizhny Novgorod Region, Russian Federation Undergraduate Intern Technical Intel Corporation May 2010  –  June 2011  (1 year 2 months) Sarov Undergraduate Intern Technical Intel Corporation May 2010  –  June 2011  (1 year 2 months) Sarov Skills Intel Software Engineering Debugging Computer Architecture Embedded Systems Software Design Processors Linux Kernel Perl Python Object Oriented Design Subversion Embedded Software Embedded Linux Skills  Intel Software Engineering Debugging Computer Architecture Embedded Systems Software Design Processors Linux Kernel Perl Python Object Oriented Design Subversion Embedded Software Embedded Linux Intel Software Engineering Debugging Computer Architecture Embedded Systems Software Design Processors Linux Kernel Perl Python Object Oriented Design Subversion Embedded Software Embedded Linux Intel Software Engineering Debugging Computer Architecture Embedded Systems Software Design Processors Linux Kernel Perl Python Object Oriented Design Subversion Embedded Software Embedded Linux Education Sarov State Institute of Physics and Technology 2006  – 2011 Sarov State Institute of Physics and Technology 2006  – 2011 Sarov State Institute of Physics and Technology 2006  – 2011 Sarov State Institute of Physics and Technology 2006  – 2011 ", "Experience Software QA engineer Intel Corporation November 2008  – Present (6 years 10 months) Intel open source center Meego product member of staff 1 Alcatel-Lucent 2004  –  2008  (4 years) mts-1 Lucent Technologies 2004  –  2007  (3 years) Software QA engineer Intel Corporation November 2008  – Present (6 years 10 months) Intel open source center Meego product Software QA engineer Intel Corporation November 2008  – Present (6 years 10 months) Intel open source center Meego product member of staff 1 Alcatel-Lucent 2004  –  2008  (4 years) member of staff 1 Alcatel-Lucent 2004  –  2008  (4 years) mts-1 Lucent Technologies 2004  –  2007  (3 years) mts-1 Lucent Technologies 2004  –  2007  (3 years) ", "Experience Software QA Engineer Intel Corporation April 2015  – Present (5 months) Software Engineering ARRIS, [Vates] November 2013  –  April 2015  (1 year 6 months) Digital TV Test Automation \n• QA engineer responsible for designing and executing automated test cases, for a Digital Tv Video environment. \n• Tools: Storm Test library for Digital TV automation, Python / Selenium for framework structure.  \n• Agile: Kanban Methodology  Software Engineering Intel November 2010  –  November 2013  (3 years 1 month) Nov 2012  \nQuality assurance engineer of Intel AppUp (AppUp NG) \n•\tQA engineer responsible for designing and executing automated and manual test cases, for a complex system including different operating systems and different browsers and devices.  \n•\tTest Automation: Responsible for Test cases development. Eclipse with Selenium and Junit in Java, tracking and report of Exploratory Tests Sessions with Jira Bonfire. \nOther tools; SCM Bamboo, Enterprise Tester for Test tracking and reports generation. \n•\tAgile: Scrum Methodology.\t \n•\tSoftware Development in Java programming with Hybris and Spring Framework.  \n•\tTools for development: Eclipse, Spring Framework, Junit, TestNG \n \n \nNov 2010 - Nov 2012 \nQuality assurance engineer of Intel AppUp Center (AppUp v1) \n•\tQA engineer responsible for designing and executing manual and Automated test cases, for a complex system including different operating systems and devices..  \nTest Automation: Test cases development with Squish in JavaScript and Sikuli with Java. \n•\tExploratory Session with Jira Bonfire \nOther tools; SCM Bamboo, Quality Center for QA test tracking and reports generation. \nAgile: Scrum Methodology. Software Engineering Motorola July 2008  –  November 2010  (2 years 5 months) Software Test Engineering \n \n-Use case analysis and Test case identification \n-Test case creation \n-Test case execution \n-Test Automation – TestComplete \n-Test Automation - QuickTestPro \n-Backend and Frontend Tests \n-Web Applications functional Tests \n-Web Applications performance Tests - JMeter \n-Test Cases Documentation \n-Test Cases Design Testing Analyst Santex America July 2007  –  July 2008  (1 year 1 month) -\tUse case analysis and Test case identification \n-\tTest case creation \n-\tTest case execution \n-\tBugTracking Tools  \n-\tPerformance Test Tools \n-\tBackend and Frontend Tests \n- Automated Test Tools \n-\tMySQL Procedures Tests \n-\tWeb Applications functional Tests \n-\tWeb Applications performance Tests \n-\tTest Cases Documentation \n-\tCustomers acceptance Tests Test Engineering Santex America - SEMDirector 2007  –  2008  (1 year) Application Tester AR Consultores -CTI Móvil April 2005  –  June 2007  (2 years 3 months) -\tTesting of developments carried out using Forms Oracle 10 g. \n-\tTesting of procedures, packets and functions made using PL/SQL \n-\tTesting (black box method) of procedures and programs made using Pro C \n-\tUnix commands use in order to administrate and compile programs, script, forms Oracle, etc. \n-\tOracle Designer 10g/9i  \n-\tUse of PL/SQL Developer. SQL code interpretation \n-\tFTP management and use of Reflection FTP Client and WINSCP \n-\tUse of Reflection 2 and Putty for Unix commands. \n-\tUse/test cases documentation. Verification of new implementations. Coordination with final user. \n-\tFollow up of new development’s implementations in production environments (made using Forms Oracle 10g) \n-\tOperative Support to final users regarding new implementations and developments Technical Support Manager Universidad Blas Pascal September 2000  –  April 2005  (4 years 8 months) Technical support provided to the university offices. Informatics lab management. Hardware and software maintenance. New hired employees’ trainer. Software QA Engineer Intel Corporation April 2015  – Present (5 months) Software QA Engineer Intel Corporation April 2015  – Present (5 months) Software Engineering ARRIS, [Vates] November 2013  –  April 2015  (1 year 6 months) Digital TV Test Automation \n• QA engineer responsible for designing and executing automated test cases, for a Digital Tv Video environment. \n• Tools: Storm Test library for Digital TV automation, Python / Selenium for framework structure.  \n• Agile: Kanban Methodology  Software Engineering ARRIS, [Vates] November 2013  –  April 2015  (1 year 6 months) Digital TV Test Automation \n• QA engineer responsible for designing and executing automated test cases, for a Digital Tv Video environment. \n• Tools: Storm Test library for Digital TV automation, Python / Selenium for framework structure.  \n• Agile: Kanban Methodology  Software Engineering Intel November 2010  –  November 2013  (3 years 1 month) Nov 2012  \nQuality assurance engineer of Intel AppUp (AppUp NG) \n•\tQA engineer responsible for designing and executing automated and manual test cases, for a complex system including different operating systems and different browsers and devices.  \n•\tTest Automation: Responsible for Test cases development. Eclipse with Selenium and Junit in Java, tracking and report of Exploratory Tests Sessions with Jira Bonfire. \nOther tools; SCM Bamboo, Enterprise Tester for Test tracking and reports generation. \n•\tAgile: Scrum Methodology.\t \n•\tSoftware Development in Java programming with Hybris and Spring Framework.  \n•\tTools for development: Eclipse, Spring Framework, Junit, TestNG \n \n \nNov 2010 - Nov 2012 \nQuality assurance engineer of Intel AppUp Center (AppUp v1) \n•\tQA engineer responsible for designing and executing manual and Automated test cases, for a complex system including different operating systems and devices..  \nTest Automation: Test cases development with Squish in JavaScript and Sikuli with Java. \n•\tExploratory Session with Jira Bonfire \nOther tools; SCM Bamboo, Quality Center for QA test tracking and reports generation. \nAgile: Scrum Methodology. Software Engineering Intel November 2010  –  November 2013  (3 years 1 month) Nov 2012  \nQuality assurance engineer of Intel AppUp (AppUp NG) \n•\tQA engineer responsible for designing and executing automated and manual test cases, for a complex system including different operating systems and different browsers and devices.  \n•\tTest Automation: Responsible for Test cases development. Eclipse with Selenium and Junit in Java, tracking and report of Exploratory Tests Sessions with Jira Bonfire. \nOther tools; SCM Bamboo, Enterprise Tester for Test tracking and reports generation. \n•\tAgile: Scrum Methodology.\t \n•\tSoftware Development in Java programming with Hybris and Spring Framework.  \n•\tTools for development: Eclipse, Spring Framework, Junit, TestNG \n \n \nNov 2010 - Nov 2012 \nQuality assurance engineer of Intel AppUp Center (AppUp v1) \n•\tQA engineer responsible for designing and executing manual and Automated test cases, for a complex system including different operating systems and devices..  \nTest Automation: Test cases development with Squish in JavaScript and Sikuli with Java. \n•\tExploratory Session with Jira Bonfire \nOther tools; SCM Bamboo, Quality Center for QA test tracking and reports generation. \nAgile: Scrum Methodology. Software Engineering Motorola July 2008  –  November 2010  (2 years 5 months) Software Test Engineering \n \n-Use case analysis and Test case identification \n-Test case creation \n-Test case execution \n-Test Automation – TestComplete \n-Test Automation - QuickTestPro \n-Backend and Frontend Tests \n-Web Applications functional Tests \n-Web Applications performance Tests - JMeter \n-Test Cases Documentation \n-Test Cases Design Software Engineering Motorola July 2008  –  November 2010  (2 years 5 months) Software Test Engineering \n \n-Use case analysis and Test case identification \n-Test case creation \n-Test case execution \n-Test Automation – TestComplete \n-Test Automation - QuickTestPro \n-Backend and Frontend Tests \n-Web Applications functional Tests \n-Web Applications performance Tests - JMeter \n-Test Cases Documentation \n-Test Cases Design Testing Analyst Santex America July 2007  –  July 2008  (1 year 1 month) -\tUse case analysis and Test case identification \n-\tTest case creation \n-\tTest case execution \n-\tBugTracking Tools  \n-\tPerformance Test Tools \n-\tBackend and Frontend Tests \n- Automated Test Tools \n-\tMySQL Procedures Tests \n-\tWeb Applications functional Tests \n-\tWeb Applications performance Tests \n-\tTest Cases Documentation \n-\tCustomers acceptance Tests Testing Analyst Santex America July 2007  –  July 2008  (1 year 1 month) -\tUse case analysis and Test case identification \n-\tTest case creation \n-\tTest case execution \n-\tBugTracking Tools  \n-\tPerformance Test Tools \n-\tBackend and Frontend Tests \n- Automated Test Tools \n-\tMySQL Procedures Tests \n-\tWeb Applications functional Tests \n-\tWeb Applications performance Tests \n-\tTest Cases Documentation \n-\tCustomers acceptance Tests Test Engineering Santex America - SEMDirector 2007  –  2008  (1 year) Test Engineering Santex America - SEMDirector 2007  –  2008  (1 year) Application Tester AR Consultores -CTI Móvil April 2005  –  June 2007  (2 years 3 months) -\tTesting of developments carried out using Forms Oracle 10 g. \n-\tTesting of procedures, packets and functions made using PL/SQL \n-\tTesting (black box method) of procedures and programs made using Pro C \n-\tUnix commands use in order to administrate and compile programs, script, forms Oracle, etc. \n-\tOracle Designer 10g/9i  \n-\tUse of PL/SQL Developer. SQL code interpretation \n-\tFTP management and use of Reflection FTP Client and WINSCP \n-\tUse of Reflection 2 and Putty for Unix commands. \n-\tUse/test cases documentation. Verification of new implementations. Coordination with final user. \n-\tFollow up of new development’s implementations in production environments (made using Forms Oracle 10g) \n-\tOperative Support to final users regarding new implementations and developments Application Tester AR Consultores -CTI Móvil April 2005  –  June 2007  (2 years 3 months) -\tTesting of developments carried out using Forms Oracle 10 g. \n-\tTesting of procedures, packets and functions made using PL/SQL \n-\tTesting (black box method) of procedures and programs made using Pro C \n-\tUnix commands use in order to administrate and compile programs, script, forms Oracle, etc. \n-\tOracle Designer 10g/9i  \n-\tUse of PL/SQL Developer. SQL code interpretation \n-\tFTP management and use of Reflection FTP Client and WINSCP \n-\tUse of Reflection 2 and Putty for Unix commands. \n-\tUse/test cases documentation. Verification of new implementations. Coordination with final user. \n-\tFollow up of new development’s implementations in production environments (made using Forms Oracle 10g) \n-\tOperative Support to final users regarding new implementations and developments Technical Support Manager Universidad Blas Pascal September 2000  –  April 2005  (4 years 8 months) Technical support provided to the university offices. Informatics lab management. Hardware and software maintenance. New hired employees’ trainer. Technical Support Manager Universidad Blas Pascal September 2000  –  April 2005  (4 years 8 months) Technical support provided to the university offices. Informatics lab management. Hardware and software maintenance. New hired employees’ trainer. Languages English Professional working proficiency English Professional working proficiency English Professional working proficiency Professional working proficiency Skills Test Automation Testing Scrum Java Software Engineering Agile Methodologies Selenium SQL Test Cases Quality Center Sikuli Agile Atlassian JIRA Squish Regression Testing Quality Assurance MySQL Web Applications Android SDK Oracle Python JavaScript PL/SQL Robotium Teamwork Kanban See 11+     See less Skills  Test Automation Testing Scrum Java Software Engineering Agile Methodologies Selenium SQL Test Cases Quality Center Sikuli Agile Atlassian JIRA Squish Regression Testing Quality Assurance MySQL Web Applications Android SDK Oracle Python JavaScript PL/SQL Robotium Teamwork Kanban See 11+     See less Test Automation Testing Scrum Java Software Engineering Agile Methodologies Selenium SQL Test Cases Quality Center Sikuli Agile Atlassian JIRA Squish Regression Testing Quality Assurance MySQL Web Applications Android SDK Oracle Python JavaScript PL/SQL Robotium Teamwork Kanban See 11+     See less Test Automation Testing Scrum Java Software Engineering Agile Methodologies Selenium SQL Test Cases Quality Center Sikuli Agile Atlassian JIRA Squish Regression Testing Quality Assurance MySQL Web Applications Android SDK Oracle Python JavaScript PL/SQL Robotium Teamwork Kanban See 11+     See less Education Universidad Blas Pascal Bachelor in Informatics,  Computer Software Engineering 1998  – 2004 Universidad Nacional de Córdoba Universidad Blas Pascal Bachelor in Informatics,  Computer Software Engineering 1998  – 2004 Universidad Blas Pascal Bachelor in Informatics,  Computer Software Engineering 1998  – 2004 Universidad Blas Pascal Bachelor in Informatics,  Computer Software Engineering 1998  – 2004 Universidad Nacional de Córdoba Universidad Nacional de Córdoba Universidad Nacional de Córdoba ", "Summary Professional software engineer with solid experience in the industry. Strong result orientation, \"shipped\" is the high-priority keyword in the work history. Proficient, active knowledge of C/C++, C#. Multi-threaded programming for MS-Windows, DotNET platform, managed/native code interoperability. Industrial software development process, outstanding Debugging skills. Contributed to Windows (5 releases), SQL Server 2005, Visual Studio 2005, Visual Studio 2013, and Windows Embedded Compact 2013. As a contractor/vendor, helped ship Windows Server 2008, Microsoft Ad Platform, and the major release of Microsoft Supply Chain Management system. Developed Embedded firmware for ARM-based System-On-Chip. Most recently contributed to Visual Studio Aquisition and Deployment Test Infrastructure.  \n \nSpecialties: visual studio, c, c++, c + +, assembly language, computer hardware, configuration management, svn, subversion, debugging, dot net framework, graphical user interface, intel, javascript, linux, c#, c #, microsoft certified professional, microsoft windows, object oriented design, optimization, programming, protocols, quality, shipping, software development, visual c++, visual studio, team system, android, eclipse, windows embedded compact 2013 \n \nMicrosoft Certified Technology Specialist - Windows Embedded developer. Summary Professional software engineer with solid experience in the industry. Strong result orientation, \"shipped\" is the high-priority keyword in the work history. Proficient, active knowledge of C/C++, C#. Multi-threaded programming for MS-Windows, DotNET platform, managed/native code interoperability. Industrial software development process, outstanding Debugging skills. Contributed to Windows (5 releases), SQL Server 2005, Visual Studio 2005, Visual Studio 2013, and Windows Embedded Compact 2013. As a contractor/vendor, helped ship Windows Server 2008, Microsoft Ad Platform, and the major release of Microsoft Supply Chain Management system. Developed Embedded firmware for ARM-based System-On-Chip. Most recently contributed to Visual Studio Aquisition and Deployment Test Infrastructure.  \n \nSpecialties: visual studio, c, c++, c + +, assembly language, computer hardware, configuration management, svn, subversion, debugging, dot net framework, graphical user interface, intel, javascript, linux, c#, c #, microsoft certified professional, microsoft windows, object oriented design, optimization, programming, protocols, quality, shipping, software development, visual c++, visual studio, team system, android, eclipse, windows embedded compact 2013 \n \nMicrosoft Certified Technology Specialist - Windows Embedded developer. Professional software engineer with solid experience in the industry. Strong result orientation, \"shipped\" is the high-priority keyword in the work history. Proficient, active knowledge of C/C++, C#. Multi-threaded programming for MS-Windows, DotNET platform, managed/native code interoperability. Industrial software development process, outstanding Debugging skills. Contributed to Windows (5 releases), SQL Server 2005, Visual Studio 2005, Visual Studio 2013, and Windows Embedded Compact 2013. As a contractor/vendor, helped ship Windows Server 2008, Microsoft Ad Platform, and the major release of Microsoft Supply Chain Management system. Developed Embedded firmware for ARM-based System-On-Chip. Most recently contributed to Visual Studio Aquisition and Deployment Test Infrastructure.  \n \nSpecialties: visual studio, c, c++, c + +, assembly language, computer hardware, configuration management, svn, subversion, debugging, dot net framework, graphical user interface, intel, javascript, linux, c#, c #, microsoft certified professional, microsoft windows, object oriented design, optimization, programming, protocols, quality, shipping, software development, visual c++, visual studio, team system, android, eclipse, windows embedded compact 2013 \n \nMicrosoft Certified Technology Specialist - Windows Embedded developer. Professional software engineer with solid experience in the industry. Strong result orientation, \"shipped\" is the high-priority keyword in the work history. Proficient, active knowledge of C/C++, C#. Multi-threaded programming for MS-Windows, DotNET platform, managed/native code interoperability. Industrial software development process, outstanding Debugging skills. Contributed to Windows (5 releases), SQL Server 2005, Visual Studio 2005, Visual Studio 2013, and Windows Embedded Compact 2013. As a contractor/vendor, helped ship Windows Server 2008, Microsoft Ad Platform, and the major release of Microsoft Supply Chain Management system. Developed Embedded firmware for ARM-based System-On-Chip. Most recently contributed to Visual Studio Aquisition and Deployment Test Infrastructure.  \n \nSpecialties: visual studio, c, c++, c + +, assembly language, computer hardware, configuration management, svn, subversion, debugging, dot net framework, graphical user interface, intel, javascript, linux, c#, c #, microsoft certified professional, microsoft windows, object oriented design, optimization, programming, protocols, quality, shipping, software development, visual c++, visual studio, team system, android, eclipse, windows embedded compact 2013 \n \nMicrosoft Certified Technology Specialist - Windows Embedded developer. Experience Software Engineer Microsoft September 2000  – Present (15 years) Redmond, WA Software Design Engineer (vendor) Microsoft June 2010  –  August 2012  (2 years 3 months) Senior Software Engineer Formotus, Inc. 2009  –  2010  (1 year) Senior Software Engineer Symetrix Inc. May 2008  –  February 2009  (10 months) Software Design Engineer (contract) Microsoft April 2007  –  April 2008  (1 year 1 month) Software Design Engineer Microsoft 2000  –  2006  (6 years) Software QA Engineer Intel Corporation 1995  –  2000  (5 years) Software Developer ParaGraph International 1994  –  1995  (1 year) Software Engineer Microsoft September 2000  – Present (15 years) Redmond, WA Software Engineer Microsoft September 2000  – Present (15 years) Redmond, WA Software Design Engineer (vendor) Microsoft June 2010  –  August 2012  (2 years 3 months) Software Design Engineer (vendor) Microsoft June 2010  –  August 2012  (2 years 3 months) Senior Software Engineer Formotus, Inc. 2009  –  2010  (1 year) Senior Software Engineer Formotus, Inc. 2009  –  2010  (1 year) Senior Software Engineer Symetrix Inc. May 2008  –  February 2009  (10 months) Senior Software Engineer Symetrix Inc. May 2008  –  February 2009  (10 months) Software Design Engineer (contract) Microsoft April 2007  –  April 2008  (1 year 1 month) Software Design Engineer (contract) Microsoft April 2007  –  April 2008  (1 year 1 month) Software Design Engineer Microsoft 2000  –  2006  (6 years) Software Design Engineer Microsoft 2000  –  2006  (6 years) Software QA Engineer Intel Corporation 1995  –  2000  (5 years) Software QA Engineer Intel Corporation 1995  –  2000  (5 years) Software Developer ParaGraph International 1994  –  1995  (1 year) Software Developer ParaGraph International 1994  –  1995  (1 year) Languages English Russian English Russian English Russian Skills Multithreading Firmware C C++ Visual Studio Windows CE Windows Server Windows 7 ARM7 SoC .NET .NET Compact Framework C# WinForms IAR JTAG Performance Tuning Win32 API Debugging Software Engineering OOP Object Oriented Design Barcode Software Design RFID+ Subversion Visual C++ Software Quality... System Architecture Programming See 15+     See less Skills  Multithreading Firmware C C++ Visual Studio Windows CE Windows Server Windows 7 ARM7 SoC .NET .NET Compact Framework C# WinForms IAR JTAG Performance Tuning Win32 API Debugging Software Engineering OOP Object Oriented Design Barcode Software Design RFID+ Subversion Visual C++ Software Quality... System Architecture Programming See 15+     See less Multithreading Firmware C C++ Visual Studio Windows CE Windows Server Windows 7 ARM7 SoC .NET .NET Compact Framework C# WinForms IAR JTAG Performance Tuning Win32 API Debugging Software Engineering OOP Object Oriented Design Barcode Software Design RFID+ Subversion Visual C++ Software Quality... System Architecture Programming See 15+     See less Multithreading Firmware C C++ Visual Studio Windows CE Windows Server Windows 7 ARM7 SoC .NET .NET Compact Framework C# WinForms IAR JTAG Performance Tuning Win32 API Debugging Software Engineering OOP Object Oriented Design Barcode Software Design RFID+ Subversion Visual C++ Software Quality... System Architecture Programming See 15+     See less ", "Summary A self motivated, result oriented individual with 4+ years experience in Software Quality Assurance and Testing. \n \nKey Strengths: \n●Experience in Manual and automated testing \n●Good problem solving skills and ability to handle multiple projects \n●Fast learning Skills and Domain understanding \n●Ability to work in a Team environment \n●Take ownership in tasks \n Summary A self motivated, result oriented individual with 4+ years experience in Software Quality Assurance and Testing. \n \nKey Strengths: \n●Experience in Manual and automated testing \n●Good problem solving skills and ability to handle multiple projects \n●Fast learning Skills and Domain understanding \n●Ability to work in a Team environment \n●Take ownership in tasks \n A self motivated, result oriented individual with 4+ years experience in Software Quality Assurance and Testing. \n \nKey Strengths: \n●Experience in Manual and automated testing \n●Good problem solving skills and ability to handle multiple projects \n●Fast learning Skills and Domain understanding \n●Ability to work in a Team environment \n●Take ownership in tasks \n A self motivated, result oriented individual with 4+ years experience in Software Quality Assurance and Testing. \n \nKey Strengths: \n●Experience in Manual and automated testing \n●Good problem solving skills and ability to handle multiple projects \n●Fast learning Skills and Domain understanding \n●Ability to work in a Team environment \n●Take ownership in tasks \n Experience Senior Software QA Engineer Intel Corporation April 2015  – Present (5 months) Colombo ●Test Case Design (Functional, Process, UI) \n●Test plan preparation \n●Agile process knowlege and Agile Scrum project Team player \n●Defect Tracking Jira \n●Agile Story based test case writing \n●Puppet script base deployment \n●Jmeter Scripts for Soap and Rest api testing \n●GIT \n●Project Task estimate preparation QA Engineer Intel Corporation May 2013  –  March 2015  (1 year 11 months) Colombo Test Case Design (Functional, Process, UI) \nEnd to End Test execution \nProject Documentation and Release Note preparation \nSoap UI Test Scripts \nInter-operablity Testing (IOT) \nCustomer Acceptance Testing \nTest Reporting \nAgile Scrum project Team player Associate QA Engineer AePONA April 2012  –  April 2013  (1 year 1 month) Test Designing (UI/Functional) \nTest Automation using JUnit \nTest Execution \nDefect Reporting \nRelease Documentation QA Analyst Rezgateway August 2011  –  April 2012  (9 months) Test Execution \nTest Case Design \nDefect tracking \nTest Case Review \nBrowser vise testing Placement QA Engineer- Intern Virtusa July 2009  –  November 2010  (1 year 5 months) Colombo Test Case Design(Functional, Process and UI ) \nTest Case Review \nTest Execution \nSoapUI based Web services testing \nDefect Tracking and reporting \nQC software based testing process \nRegression Testing Senior Software QA Engineer Intel Corporation April 2015  – Present (5 months) Colombo ●Test Case Design (Functional, Process, UI) \n●Test plan preparation \n●Agile process knowlege and Agile Scrum project Team player \n●Defect Tracking Jira \n●Agile Story based test case writing \n●Puppet script base deployment \n●Jmeter Scripts for Soap and Rest api testing \n●GIT \n●Project Task estimate preparation Senior Software QA Engineer Intel Corporation April 2015  – Present (5 months) Colombo ●Test Case Design (Functional, Process, UI) \n●Test plan preparation \n●Agile process knowlege and Agile Scrum project Team player \n●Defect Tracking Jira \n●Agile Story based test case writing \n●Puppet script base deployment \n●Jmeter Scripts for Soap and Rest api testing \n●GIT \n●Project Task estimate preparation QA Engineer Intel Corporation May 2013  –  March 2015  (1 year 11 months) Colombo Test Case Design (Functional, Process, UI) \nEnd to End Test execution \nProject Documentation and Release Note preparation \nSoap UI Test Scripts \nInter-operablity Testing (IOT) \nCustomer Acceptance Testing \nTest Reporting \nAgile Scrum project Team player QA Engineer Intel Corporation May 2013  –  March 2015  (1 year 11 months) Colombo Test Case Design (Functional, Process, UI) \nEnd to End Test execution \nProject Documentation and Release Note preparation \nSoap UI Test Scripts \nInter-operablity Testing (IOT) \nCustomer Acceptance Testing \nTest Reporting \nAgile Scrum project Team player Associate QA Engineer AePONA April 2012  –  April 2013  (1 year 1 month) Test Designing (UI/Functional) \nTest Automation using JUnit \nTest Execution \nDefect Reporting \nRelease Documentation Associate QA Engineer AePONA April 2012  –  April 2013  (1 year 1 month) Test Designing (UI/Functional) \nTest Automation using JUnit \nTest Execution \nDefect Reporting \nRelease Documentation QA Analyst Rezgateway August 2011  –  April 2012  (9 months) Test Execution \nTest Case Design \nDefect tracking \nTest Case Review \nBrowser vise testing QA Analyst Rezgateway August 2011  –  April 2012  (9 months) Test Execution \nTest Case Design \nDefect tracking \nTest Case Review \nBrowser vise testing Placement QA Engineer- Intern Virtusa July 2009  –  November 2010  (1 year 5 months) Colombo Test Case Design(Functional, Process and UI ) \nTest Case Review \nTest Execution \nSoapUI based Web services testing \nDefect Tracking and reporting \nQC software based testing process \nRegression Testing Placement QA Engineer- Intern Virtusa July 2009  –  November 2010  (1 year 5 months) Colombo Test Case Design(Functional, Process and UI ) \nTest Case Review \nTest Execution \nSoapUI based Web services testing \nDefect Tracking and reporting \nQC software based testing process \nRegression Testing Languages English Professional working proficiency Sinhala Native or bilingual proficiency English Professional working proficiency Sinhala Native or bilingual proficiency English Professional working proficiency Sinhala Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Fast Learner Teamwork Database Management Teaching Technical Writing C#.net windows... User Acceptance Testing Manual Testing Software Quality... Matlab Artificial Neural... Digital signal... Agile Methodologies Test Automation Java Test Planning Testing See 2+     See less Skills  Fast Learner Teamwork Database Management Teaching Technical Writing C#.net windows... User Acceptance Testing Manual Testing Software Quality... Matlab Artificial Neural... Digital signal... Agile Methodologies Test Automation Java Test Planning Testing See 2+     See less Fast Learner Teamwork Database Management Teaching Technical Writing C#.net windows... User Acceptance Testing Manual Testing Software Quality... Matlab Artificial Neural... Digital signal... Agile Methodologies Test Automation Java Test Planning Testing See 2+     See less Fast Learner Teamwork Database Management Teaching Technical Writing C#.net windows... User Acceptance Testing Manual Testing Software Quality... Matlab Artificial Neural... Digital signal... Agile Methodologies Test Automation Java Test Planning Testing See 2+     See less Education Open University of Sri Lanka BTech,  Computer Engineering , Second Class 2005  – 2011 Southlands College-Galle 1991  – 2004 Open University of Sri Lanka BTech,  Computer Engineering , Second Class 2005  – 2011 Open University of Sri Lanka BTech,  Computer Engineering , Second Class 2005  – 2011 Open University of Sri Lanka BTech,  Computer Engineering , Second Class 2005  – 2011 Southlands College-Galle 1991  – 2004 Southlands College-Galle 1991  – 2004 Southlands College-Galle 1991  – 2004 Honors & Awards Additional Honors & Awards RoboGames- IESL 2009 -Merit Prize Additional Honors & Awards RoboGames- IESL 2009 -Merit Prize Additional Honors & Awards RoboGames- IESL 2009 -Merit Prize Additional Honors & Awards RoboGames- IESL 2009 -Merit Prize ", "Summary Highly motivated with a passion towards new technology and customer solutions. I enjoy working with Engineers, Executives, Marketing, Sales, Support and Customers to find solutions to problems. Summary Highly motivated with a passion towards new technology and customer solutions. I enjoy working with Engineers, Executives, Marketing, Sales, Support and Customers to find solutions to problems. Highly motivated with a passion towards new technology and customer solutions. I enjoy working with Engineers, Executives, Marketing, Sales, Support and Customers to find solutions to problems. Highly motivated with a passion towards new technology and customer solutions. I enjoy working with Engineers, Executives, Marketing, Sales, Support and Customers to find solutions to problems. Experience Innovation Engineering Manager Trimble April 2014  – Present (1 year 5 months) Joined a motivated team tasked with research and delivery of advanced technology-based solutions in mobile computing. Test Engineering Manager Trimble April 2011  –  April 2014  (3 years 1 month) Corvallis, Oregon Area System Test Engineer Trimble December 2004  –  April 2011  (6 years 5 months) Manager College of Engineering Wireless Helpdesk September 2004  –  December 2004  (4 months) Head Consultant / Lead Trainer Oregon State University Computer Science Department June 2003  –  September 2004  (1 year 4 months) Software/Hardware Lab Consultant Oregon State University Computer Science Department March 1998  –  June 2003  (5 years 4 months) Software QA Engineer Centerspan Communications April 2002  –  August 2002  (5 months) Software Integration Engineer Oresis Communications February 2001  –  March 2002  (1 year 2 months) Software QA Engineer Intel Corporation February 2000  –  February 2001  (1 year 1 month) IT Intern Fort James Corporation June 1999  –  September 1999  (4 months) Innovation Engineering Manager Trimble April 2014  – Present (1 year 5 months) Joined a motivated team tasked with research and delivery of advanced technology-based solutions in mobile computing. Innovation Engineering Manager Trimble April 2014  – Present (1 year 5 months) Joined a motivated team tasked with research and delivery of advanced technology-based solutions in mobile computing. Test Engineering Manager Trimble April 2011  –  April 2014  (3 years 1 month) Corvallis, Oregon Area Test Engineering Manager Trimble April 2011  –  April 2014  (3 years 1 month) Corvallis, Oregon Area System Test Engineer Trimble December 2004  –  April 2011  (6 years 5 months) System Test Engineer Trimble December 2004  –  April 2011  (6 years 5 months) Manager College of Engineering Wireless Helpdesk September 2004  –  December 2004  (4 months) Manager College of Engineering Wireless Helpdesk September 2004  –  December 2004  (4 months) Head Consultant / Lead Trainer Oregon State University Computer Science Department June 2003  –  September 2004  (1 year 4 months) Head Consultant / Lead Trainer Oregon State University Computer Science Department June 2003  –  September 2004  (1 year 4 months) Software/Hardware Lab Consultant Oregon State University Computer Science Department March 1998  –  June 2003  (5 years 4 months) Software/Hardware Lab Consultant Oregon State University Computer Science Department March 1998  –  June 2003  (5 years 4 months) Software QA Engineer Centerspan Communications April 2002  –  August 2002  (5 months) Software QA Engineer Centerspan Communications April 2002  –  August 2002  (5 months) Software Integration Engineer Oresis Communications February 2001  –  March 2002  (1 year 2 months) Software Integration Engineer Oresis Communications February 2001  –  March 2002  (1 year 2 months) Software QA Engineer Intel Corporation February 2000  –  February 2001  (1 year 1 month) Software QA Engineer Intel Corporation February 2000  –  February 2001  (1 year 1 month) IT Intern Fort James Corporation June 1999  –  September 1999  (4 months) IT Intern Fort James Corporation June 1999  –  September 1999  (4 months) Languages English English English Skills Testing Software Quality... Quality Assurance Embedded Systems Scrum Embedded Software Software Development Agile Methodologies Software Project... Debugging Integration Operating Systems Wireless System Testing ClearCase Test Management Software Engineering Test Planning Telecommunications Hardware Linux Test Automation TCP/IP Test Cases Regression Testing System Architecture Software Design Technical Leadership Electronics Manual Testing User Acceptance Testing Firmware Technical Support WiFi Unix Mobile Devices Management Product Development Cross-functional Team... Engineering Management See 25+     See less Skills  Testing Software Quality... Quality Assurance Embedded Systems Scrum Embedded Software Software Development Agile Methodologies Software Project... Debugging Integration Operating Systems Wireless System Testing ClearCase Test Management Software Engineering Test Planning Telecommunications Hardware Linux Test Automation TCP/IP Test Cases Regression Testing System Architecture Software Design Technical Leadership Electronics Manual Testing User Acceptance Testing Firmware Technical Support WiFi Unix Mobile Devices Management Product Development Cross-functional Team... Engineering Management See 25+     See less Testing Software Quality... Quality Assurance Embedded Systems Scrum Embedded Software Software Development Agile Methodologies Software Project... Debugging Integration Operating Systems Wireless System Testing ClearCase Test Management Software Engineering Test Planning Telecommunications Hardware Linux Test Automation TCP/IP Test Cases Regression Testing System Architecture Software Design Technical Leadership Electronics Manual Testing User Acceptance Testing Firmware Technical Support WiFi Unix Mobile Devices Management Product Development Cross-functional Team... Engineering Management See 25+     See less Testing Software Quality... Quality Assurance Embedded Systems Scrum Embedded Software Software Development Agile Methodologies Software Project... Debugging Integration Operating Systems Wireless System Testing ClearCase Test Management Software Engineering Test Planning Telecommunications Hardware Linux Test Automation TCP/IP Test Cases Regression Testing System Architecture Software Design Technical Leadership Electronics Manual Testing User Acceptance Testing Firmware Technical Support WiFi Unix Mobile Devices Management Product Development Cross-functional Team... Engineering Management See 25+     See less Education Oregon State University Bachelors of Science,  Multimedia 1997  – 2005 Oregon State University Bachelors of Science,  Multimedia 1997  – 2005 Oregon State University Bachelors of Science,  Multimedia 1997  – 2005 Oregon State University Bachelors of Science,  Multimedia 1997  – 2005 ", "Languages French Native or bilingual proficiency Spanish Full professional proficiency Japanese Elementary proficiency French Native or bilingual proficiency Spanish Full professional proficiency Japanese Elementary proficiency French Native or bilingual proficiency Spanish Full professional proficiency Japanese Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Test Planning SDLC Testing Software Development .NET Software Project... Microsoft SQL Server XML Integration JavaScript Quality Assurance Visual Studio Scrum C# Requirements Analysis C++ MCSE 2003 IEEE 802.11 Microsoft Dynamics POS Linux HTML Visual Studio Team... Visual Test Visual Basic LAN-WAN Mac OS X Agile Methodologies Microsoft Product Studio Technical Project... Silk Performer SilkTest Video Walls Microsoft CRM AX 2009 Powershell Test Automation CSS MS Project See 24+     See less Skills  Test Planning SDLC Testing Software Development .NET Software Project... Microsoft SQL Server XML Integration JavaScript Quality Assurance Visual Studio Scrum C# Requirements Analysis C++ MCSE 2003 IEEE 802.11 Microsoft Dynamics POS Linux HTML Visual Studio Team... Visual Test Visual Basic LAN-WAN Mac OS X Agile Methodologies Microsoft Product Studio Technical Project... Silk Performer SilkTest Video Walls Microsoft CRM AX 2009 Powershell Test Automation CSS MS Project See 24+     See less Test Planning SDLC Testing Software Development .NET Software Project... Microsoft SQL Server XML Integration JavaScript Quality Assurance Visual Studio Scrum C# Requirements Analysis C++ MCSE 2003 IEEE 802.11 Microsoft Dynamics POS Linux HTML Visual Studio Team... Visual Test Visual Basic LAN-WAN Mac OS X Agile Methodologies Microsoft Product Studio Technical Project... Silk Performer SilkTest Video Walls Microsoft CRM AX 2009 Powershell Test Automation CSS MS Project See 24+     See less Test Planning SDLC Testing Software Development .NET Software Project... Microsoft SQL Server XML Integration JavaScript Quality Assurance Visual Studio Scrum C# Requirements Analysis C++ MCSE 2003 IEEE 802.11 Microsoft Dynamics POS Linux HTML Visual Studio Team... Visual Test Visual Basic LAN-WAN Mac OS X Agile Methodologies Microsoft Product Studio Technical Project... Silk Performer SilkTest Video Walls Microsoft CRM AX 2009 Powershell Test Automation CSS MS Project See 24+     See less ", "Experience Software QA Engineer Intel Corporation November 2013  – Present (1 year 10 months) San Francisco Bay Area - Develop client automation tests which reduces the testing life cycle by 40% \n- Create test plans for Client and Web apps \n- Build and document best practices for filing defects \n- Validate internal back end releases \n- Launched analytics reporting product and multiple client apps Software QA Engineer Kno, Inc. (acquired by Intel) March 2012  –  November 2013  (1 year 9 months) San Francisco Bay Area - Performed product validation for eTextbooks apps on several platforms including iOS, Android, Windows, and the Web \n- Collaborated with software development team to solve quality issues & identify related bugs \n- Perform system and software setup and installations \n- Perform QA automation for multiple mobile devices' applications and web applications Data Quality Analyst Iron Speed, Inc. December 2011  –  April 2012  (5 months) San Francisco Bay Area - Processed and migrated large data sets between MS Excel and MS SQL \n- QA and validated data using in-house tool \n- Reported issues back to SWD and verified fixes Register Officer National University 2011  –  2011  (less than a year) IT Support Engineer – Out Source Engineer for Abu Dhabi Islamic Bank MDS Computers January 2010  –  July 2010  (7 months) Abu Dhabi - United Arab Emirates o\tHW and SW administration (building, installation and maintenance) \no\tTier one and two internal helpdesk support \no\tTier one network administration support Systems Support Engineer – Head of Dubai Office IT UNITED ENGINEERING CONSTRUCTION May 2006  –  October 2009  (3 years 6 months) Dubai - United Arab Emirates o\tAdministrate and maintain company’s web and mail servers. \no\tPrepare and instruct internal trainings. \no\tPrepare and follow up on purchase orders. \no\tAdministrate data backups using SQL Server Enterprise Manager. \no\tMonitor and troubleshoot company’s IT systems and work with other teams to resolve HW & SW issues. \no\tDevelop marketing charts and logos. Software QA Engineer Intel Corporation November 2013  – Present (1 year 10 months) San Francisco Bay Area - Develop client automation tests which reduces the testing life cycle by 40% \n- Create test plans for Client and Web apps \n- Build and document best practices for filing defects \n- Validate internal back end releases \n- Launched analytics reporting product and multiple client apps Software QA Engineer Intel Corporation November 2013  – Present (1 year 10 months) San Francisco Bay Area - Develop client automation tests which reduces the testing life cycle by 40% \n- Create test plans for Client and Web apps \n- Build and document best practices for filing defects \n- Validate internal back end releases \n- Launched analytics reporting product and multiple client apps Software QA Engineer Kno, Inc. (acquired by Intel) March 2012  –  November 2013  (1 year 9 months) San Francisco Bay Area - Performed product validation for eTextbooks apps on several platforms including iOS, Android, Windows, and the Web \n- Collaborated with software development team to solve quality issues & identify related bugs \n- Perform system and software setup and installations \n- Perform QA automation for multiple mobile devices' applications and web applications Software QA Engineer Kno, Inc. (acquired by Intel) March 2012  –  November 2013  (1 year 9 months) San Francisco Bay Area - Performed product validation for eTextbooks apps on several platforms including iOS, Android, Windows, and the Web \n- Collaborated with software development team to solve quality issues & identify related bugs \n- Perform system and software setup and installations \n- Perform QA automation for multiple mobile devices' applications and web applications Data Quality Analyst Iron Speed, Inc. December 2011  –  April 2012  (5 months) San Francisco Bay Area - Processed and migrated large data sets between MS Excel and MS SQL \n- QA and validated data using in-house tool \n- Reported issues back to SWD and verified fixes Data Quality Analyst Iron Speed, Inc. December 2011  –  April 2012  (5 months) San Francisco Bay Area - Processed and migrated large data sets between MS Excel and MS SQL \n- QA and validated data using in-house tool \n- Reported issues back to SWD and verified fixes Register Officer National University 2011  –  2011  (less than a year) Register Officer National University 2011  –  2011  (less than a year) IT Support Engineer – Out Source Engineer for Abu Dhabi Islamic Bank MDS Computers January 2010  –  July 2010  (7 months) Abu Dhabi - United Arab Emirates o\tHW and SW administration (building, installation and maintenance) \no\tTier one and two internal helpdesk support \no\tTier one network administration support IT Support Engineer – Out Source Engineer for Abu Dhabi Islamic Bank MDS Computers January 2010  –  July 2010  (7 months) Abu Dhabi - United Arab Emirates o\tHW and SW administration (building, installation and maintenance) \no\tTier one and two internal helpdesk support \no\tTier one network administration support Systems Support Engineer – Head of Dubai Office IT UNITED ENGINEERING CONSTRUCTION May 2006  –  October 2009  (3 years 6 months) Dubai - United Arab Emirates o\tAdministrate and maintain company’s web and mail servers. \no\tPrepare and instruct internal trainings. \no\tPrepare and follow up on purchase orders. \no\tAdministrate data backups using SQL Server Enterprise Manager. \no\tMonitor and troubleshoot company’s IT systems and work with other teams to resolve HW & SW issues. \no\tDevelop marketing charts and logos. Systems Support Engineer – Head of Dubai Office IT UNITED ENGINEERING CONSTRUCTION May 2006  –  October 2009  (3 years 6 months) Dubai - United Arab Emirates o\tAdministrate and maintain company’s web and mail servers. \no\tPrepare and instruct internal trainings. \no\tPrepare and follow up on purchase orders. \no\tAdministrate data backups using SQL Server Enterprise Manager. \no\tMonitor and troubleshoot company’s IT systems and work with other teams to resolve HW & SW issues. \no\tDevelop marketing charts and logos. Skills Network Administration Microsoft SQL Server Quality Assurance Troubleshooting Visual Studio Software Engineering Java System Administration HTML C++ Perl Databases Web Applications SQL Skills  Network Administration Microsoft SQL Server Quality Assurance Troubleshooting Visual Studio Software Engineering Java System Administration HTML C++ Perl Databases Web Applications SQL Network Administration Microsoft SQL Server Quality Assurance Troubleshooting Visual Studio Software Engineering Java System Administration HTML C++ Perl Databases Web Applications SQL Network Administration Microsoft SQL Server Quality Assurance Troubleshooting Visual Studio Software Engineering Java System Administration HTML C++ Perl Databases Web Applications SQL Education National University Master,  Management Information Systems 2010  – 2011 Al Jami'at Al-Hashimiyyah Bachelor of Science (BS),  Management Information Systems , General 2002  – 2006 National University Master,  Management Information Systems 2010  – 2011 National University Master,  Management Information Systems 2010  – 2011 National University Master,  Management Information Systems 2010  – 2011 Al Jami'at Al-Hashimiyyah Bachelor of Science (BS),  Management Information Systems , General 2002  – 2006 Al Jami'at Al-Hashimiyyah Bachelor of Science (BS),  Management Information Systems , General 2002  – 2006 Al Jami'at Al-Hashimiyyah Bachelor of Science (BS),  Management Information Systems , General 2002  – 2006 ", "Experience Software QA Engineer Intel Corporation June 2014  – Present (1 year 3 months) Cluj County, Romania Software QA Engineer Neusoft EDC February 2012  –  May 2014  (2 years 4 months) - Creating and executing test cases; \n- Performing tests on real devices supported by the tested application; \n- Analyzing and evaluating the requirements and guidelines; \n- Exploratory, acceptance, stress, regression, confirmation, security testing; \n- Reporting of work done on a daily basis; \n- Bug reporting/tracking using client’s web-based tool; \n- Daily check of reports from team members; \n- Security testing- coordinator for a group of 10 people; \n- Security trainer; \n- Basic Testing training reviewer. Technical Help Desk Support UPC Romania June 2008  –  February 2012  (3 years 9 months) -solving issues by phone or, if not possible, by sending it to another department;  \n-problems related to Internet Connections, Digital/Analog TV transmission or VoIP. Sales Agent COSMOTE Romania April 2007  –  October 2007  (7 months) -selling different types of cellular phones; \n-primary accounting. Software QA Engineer Intel Corporation June 2014  – Present (1 year 3 months) Cluj County, Romania Software QA Engineer Intel Corporation June 2014  – Present (1 year 3 months) Cluj County, Romania Software QA Engineer Neusoft EDC February 2012  –  May 2014  (2 years 4 months) - Creating and executing test cases; \n- Performing tests on real devices supported by the tested application; \n- Analyzing and evaluating the requirements and guidelines; \n- Exploratory, acceptance, stress, regression, confirmation, security testing; \n- Reporting of work done on a daily basis; \n- Bug reporting/tracking using client’s web-based tool; \n- Daily check of reports from team members; \n- Security testing- coordinator for a group of 10 people; \n- Security trainer; \n- Basic Testing training reviewer. Software QA Engineer Neusoft EDC February 2012  –  May 2014  (2 years 4 months) - Creating and executing test cases; \n- Performing tests on real devices supported by the tested application; \n- Analyzing and evaluating the requirements and guidelines; \n- Exploratory, acceptance, stress, regression, confirmation, security testing; \n- Reporting of work done on a daily basis; \n- Bug reporting/tracking using client’s web-based tool; \n- Daily check of reports from team members; \n- Security testing- coordinator for a group of 10 people; \n- Security trainer; \n- Basic Testing training reviewer. Technical Help Desk Support UPC Romania June 2008  –  February 2012  (3 years 9 months) -solving issues by phone or, if not possible, by sending it to another department;  \n-problems related to Internet Connections, Digital/Analog TV transmission or VoIP. Technical Help Desk Support UPC Romania June 2008  –  February 2012  (3 years 9 months) -solving issues by phone or, if not possible, by sending it to another department;  \n-problems related to Internet Connections, Digital/Analog TV transmission or VoIP. Sales Agent COSMOTE Romania April 2007  –  October 2007  (7 months) -selling different types of cellular phones; \n-primary accounting. Sales Agent COSMOTE Romania April 2007  –  October 2007  (7 months) -selling different types of cellular phones; \n-primary accounting. Languages Romanian Native or bilingual proficiency French Full professional proficiency English Full professional proficiency Spanish Elementary proficiency Romanian Native or bilingual proficiency French Full professional proficiency English Full professional proficiency Spanish Elementary proficiency Romanian Native or bilingual proficiency French Full professional proficiency English Full professional proficiency Spanish Elementary proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Testing Test Cases Manual Testing Regression Testing Mobile Applications Test Management Test Planning System Testing Black Box Testing Translation Software Agile Testing Software Quality... Test Automation Quality Center JIRA Technicals See 2+     See less Skills  Testing Test Cases Manual Testing Regression Testing Mobile Applications Test Management Test Planning System Testing Black Box Testing Translation Software Agile Testing Software Quality... Test Automation Quality Center JIRA Technicals See 2+     See less Testing Test Cases Manual Testing Regression Testing Mobile Applications Test Management Test Planning System Testing Black Box Testing Translation Software Agile Testing Software Quality... Test Automation Quality Center JIRA Technicals See 2+     See less Testing Test Cases Manual Testing Regression Testing Mobile Applications Test Management Test Planning System Testing Black Box Testing Translation Software Agile Testing Software Quality... Test Automation Quality Center JIRA Technicals See 2+     See less Education University \"Babes-Bolyai\", Faculty of Letters, RO-FR section, Cluj Napoca Philologist and Translator /Interpreter authorized by The Ministry of Justice (language:French),  Romanian Language and Literature; French Language and Literature 2005  – 2008 “Sabin Dragoi” Pedagogical High-School, Deva Philologist 2001  – 2005 University \"Babes-Bolyai\", Faculty of Letters, RO-FR section, Cluj Napoca Philologist and Translator /Interpreter authorized by The Ministry of Justice (language:French),  Romanian Language and Literature; French Language and Literature 2005  – 2008 University \"Babes-Bolyai\", Faculty of Letters, RO-FR section, Cluj Napoca Philologist and Translator /Interpreter authorized by The Ministry of Justice (language:French),  Romanian Language and Literature; French Language and Literature 2005  – 2008 University \"Babes-Bolyai\", Faculty of Letters, RO-FR section, Cluj Napoca Philologist and Translator /Interpreter authorized by The Ministry of Justice (language:French),  Romanian Language and Literature; French Language and Literature 2005  – 2008 “Sabin Dragoi” Pedagogical High-School, Deva Philologist 2001  – 2005 “Sabin Dragoi” Pedagogical High-School, Deva Philologist 2001  – 2005 “Sabin Dragoi” Pedagogical High-School, Deva Philologist 2001  – 2005 ", "Experience Engineering Manager Intel Corporation April 2014  – Present (1 year 5 months) Validation Lead Intel Corporation November 2013  –  April 2014  (6 months) Program/Project Manager Intel Corporation June 2011  –  November 2013  (2 years 6 months) Senior Software QA Engineer Intel Corporation October 2010  –  June 2011  (9 months) Senior Software QA Engineer K12 May 2010  –  June 2011  (1 year 2 months) Software QA Engineer Xerox July 2007  –  May 2010  (2 years 11 months) Software Feature Validation Intel March 2007  –  July 2007  (5 months) Software Engineer Pixelworks Inc. January 2004  –  March 2007  (3 years 3 months) Engineering Manager Intel Corporation April 2014  – Present (1 year 5 months) Engineering Manager Intel Corporation April 2014  – Present (1 year 5 months) Validation Lead Intel Corporation November 2013  –  April 2014  (6 months) Validation Lead Intel Corporation November 2013  –  April 2014  (6 months) Program/Project Manager Intel Corporation June 2011  –  November 2013  (2 years 6 months) Program/Project Manager Intel Corporation June 2011  –  November 2013  (2 years 6 months) Senior Software QA Engineer Intel Corporation October 2010  –  June 2011  (9 months) Senior Software QA Engineer Intel Corporation October 2010  –  June 2011  (9 months) Senior Software QA Engineer K12 May 2010  –  June 2011  (1 year 2 months) Senior Software QA Engineer K12 May 2010  –  June 2011  (1 year 2 months) Software QA Engineer Xerox July 2007  –  May 2010  (2 years 11 months) Software QA Engineer Xerox July 2007  –  May 2010  (2 years 11 months) Software Feature Validation Intel March 2007  –  July 2007  (5 months) Software Feature Validation Intel March 2007  –  July 2007  (5 months) Software Engineer Pixelworks Inc. January 2004  –  March 2007  (3 years 3 months) Software Engineer Pixelworks Inc. January 2004  –  March 2007  (3 years 3 months) Skills Semiconductors Debugging Software Engineering Scrum Software Development Testing Embedded Software Software Quality... Agile Methodologies Embedded Systems Firmware Software Design ClearCase Quality Assurance Mobile Devices System Architecture See 1+     See less Skills  Semiconductors Debugging Software Engineering Scrum Software Development Testing Embedded Software Software Quality... Agile Methodologies Embedded Systems Firmware Software Design ClearCase Quality Assurance Mobile Devices System Architecture See 1+     See less Semiconductors Debugging Software Engineering Scrum Software Development Testing Embedded Software Software Quality... Agile Methodologies Embedded Systems Firmware Software Design ClearCase Quality Assurance Mobile Devices System Architecture See 1+     See less Semiconductors Debugging Software Engineering Scrum Software Development Testing Embedded Software Software Quality... Agile Methodologies Embedded Systems Firmware Software Design ClearCase Quality Assurance Mobile Devices System Architecture See 1+     See less Education Oregon Institute of Technology 2000  – 2003 Oregon Institute of Technology 2000  – 2003 Oregon Institute of Technology 2000  – 2003 Oregon Institute of Technology 2000  – 2003 ", "Summary Integration and software QA engineer at Intel Corporation. Summary Integration and software QA engineer at Intel Corporation. Integration and software QA engineer at Intel Corporation. Integration and software QA engineer at Intel Corporation. Experience Software Testing Manager QualiTest Group July 2013  – Present (2 years 2 months) Israel Integration and software QA engineer at Intel Corporation. Radio Planning Engineer RF Cell February 2012  –  July 2013  (1 year 6 months) Radio network Optimization Customer Service Orad LTD November 2010  –  February 2012  (1 year 4 months) Software Testing Manager QualiTest Group July 2013  – Present (2 years 2 months) Israel Integration and software QA engineer at Intel Corporation. Software Testing Manager QualiTest Group July 2013  – Present (2 years 2 months) Israel Integration and software QA engineer at Intel Corporation. Radio Planning Engineer RF Cell February 2012  –  July 2013  (1 year 6 months) Radio network Optimization Radio Planning Engineer RF Cell February 2012  –  July 2013  (1 year 6 months) Radio network Optimization Customer Service Orad LTD November 2010  –  February 2012  (1 year 4 months) Customer Service Orad LTD November 2010  –  February 2012  (1 year 4 months) Languages Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills VHDL Electronics Matlab Excel Microsoft Office Word Problem Solving PowerPoint Operating Systems Troubleshooting Hardware Windows Teamwork Testing Customer Service Networking Telecommunications FPGA Wireless Engineering Linux TCP/IP Electrical Engineering Embedded Systems C Integration Programming See 12+     See less Skills  VHDL Electronics Matlab Excel Microsoft Office Word Problem Solving PowerPoint Operating Systems Troubleshooting Hardware Windows Teamwork Testing Customer Service Networking Telecommunications FPGA Wireless Engineering Linux TCP/IP Electrical Engineering Embedded Systems C Integration Programming See 12+     See less VHDL Electronics Matlab Excel Microsoft Office Word Problem Solving PowerPoint Operating Systems Troubleshooting Hardware Windows Teamwork Testing Customer Service Networking Telecommunications FPGA Wireless Engineering Linux TCP/IP Electrical Engineering Embedded Systems C Integration Programming See 12+     See less VHDL Electronics Matlab Excel Microsoft Office Word Problem Solving PowerPoint Operating Systems Troubleshooting Hardware Windows Teamwork Testing Customer Service Networking Telecommunications FPGA Wireless Engineering Linux TCP/IP Electrical Engineering Embedded Systems C Integration Programming See 12+     See less Education Holon Institute of Technology B.Sc,  Micro-electronics 2008  – 2012 Holon Institute of Technology B.Sc,  Micro-electronics 2008  – 2012 Holon Institute of Technology B.Sc,  Micro-electronics 2008  – 2012 Holon Institute of Technology B.Sc,  Micro-electronics 2008  – 2012 ", "Skills Data Warehousing Operating Systems Mac OS X Agile Methodologies Software Quality... Scrum Testing Test Automation Unix SQL Software Development Microsoft SQL Server XML Linux Quality Assurance Databases Web Services Automation Web Applications Shell Scripting Software Project... Bug Tracking JavaScript QTP OOP MySQL Visual Studio OS X Business Analysis Test Cases SoapUI Access Requirements Analysis Manual Testing Ruby Programming LoadRunner Regression Testing Integration HTML Software Engineering Subversion IIS Test Planning Visual Basic C++ JIRA .NET C# SOAP See 35+     See less Skills  Data Warehousing Operating Systems Mac OS X Agile Methodologies Software Quality... Scrum Testing Test Automation Unix SQL Software Development Microsoft SQL Server XML Linux Quality Assurance Databases Web Services Automation Web Applications Shell Scripting Software Project... Bug Tracking JavaScript QTP OOP MySQL Visual Studio OS X Business Analysis Test Cases SoapUI Access Requirements Analysis Manual Testing Ruby Programming LoadRunner Regression Testing Integration HTML Software Engineering Subversion IIS Test Planning Visual Basic C++ JIRA .NET C# SOAP See 35+     See less Data Warehousing Operating Systems Mac OS X Agile Methodologies Software Quality... Scrum Testing Test Automation Unix SQL Software Development Microsoft SQL Server XML Linux Quality Assurance Databases Web Services Automation Web Applications Shell Scripting Software Project... Bug Tracking JavaScript QTP OOP MySQL Visual Studio OS X Business Analysis Test Cases SoapUI Access Requirements Analysis Manual Testing Ruby Programming LoadRunner Regression Testing Integration HTML Software Engineering Subversion IIS Test Planning Visual Basic C++ JIRA .NET C# SOAP See 35+     See less Data Warehousing Operating Systems Mac OS X Agile Methodologies Software Quality... Scrum Testing Test Automation Unix SQL Software Development Microsoft SQL Server XML Linux Quality Assurance Databases Web Services Automation Web Applications Shell Scripting Software Project... Bug Tracking JavaScript QTP OOP MySQL Visual Studio OS X Business Analysis Test Cases SoapUI Access Requirements Analysis Manual Testing Ruby Programming LoadRunner Regression Testing Integration HTML Software Engineering Subversion IIS Test Planning Visual Basic C++ JIRA .NET C# SOAP See 35+     See less Honors & Awards ", "Experience Senior Software QA Engineer Intel Corporation October 2013  – Present (1 year 11 months) Israel Senior Software QA Engineer Telmap August 2008  – Present (7 years 1 month) QA Engineer BMC Software 2006  –  2008  (2 years) PM BMC August 2004  –  June 2006  (1 year 11 months) Front Desk Supoort BMC August 2000  –  August 2004  (4 years 1 month) Senior Software QA Engineer Intel Corporation October 2013  – Present (1 year 11 months) Israel Senior Software QA Engineer Intel Corporation October 2013  – Present (1 year 11 months) Israel Senior Software QA Engineer Telmap August 2008  – Present (7 years 1 month) Senior Software QA Engineer Telmap August 2008  – Present (7 years 1 month) QA Engineer BMC Software 2006  –  2008  (2 years) QA Engineer BMC Software 2006  –  2008  (2 years) PM BMC August 2004  –  June 2006  (1 year 11 months) PM BMC August 2004  –  June 2006  (1 year 11 months) Front Desk Supoort BMC August 2000  –  August 2004  (4 years 1 month) Front Desk Supoort BMC August 2000  –  August 2004  (4 years 1 month) Skills Software Quality... ISTQB Certified ISTQB Test Planning Object Oriented Design Testing Agile Methodologies Unix Manual Testing Test Automation Quality Assurance Quality Center Regression Testing Test Management OOP Test Cases System Testing Scrum JIRA Bug Tracking Black Box Testing Agile Testing Performance Testing Web Applications Shell Scripting QTP Mobile Applications Android XML Perl LoadRunner Multithreading See 17+     See less Skills  Software Quality... ISTQB Certified ISTQB Test Planning Object Oriented Design Testing Agile Methodologies Unix Manual Testing Test Automation Quality Assurance Quality Center Regression Testing Test Management OOP Test Cases System Testing Scrum JIRA Bug Tracking Black Box Testing Agile Testing Performance Testing Web Applications Shell Scripting QTP Mobile Applications Android XML Perl LoadRunner Multithreading See 17+     See less Software Quality... ISTQB Certified ISTQB Test Planning Object Oriented Design Testing Agile Methodologies Unix Manual Testing Test Automation Quality Assurance Quality Center Regression Testing Test Management OOP Test Cases System Testing Scrum JIRA Bug Tracking Black Box Testing Agile Testing Performance Testing Web Applications Shell Scripting QTP Mobile Applications Android XML Perl LoadRunner Multithreading See 17+     See less Software Quality... ISTQB Certified ISTQB Test Planning Object Oriented Design Testing Agile Methodologies Unix Manual Testing Test Automation Quality Assurance Quality Center Regression Testing Test Management OOP Test Cases System Testing Scrum JIRA Bug Tracking Black Box Testing Agile Testing Performance Testing Web Applications Shell Scripting QTP Mobile Applications Android XML Perl LoadRunner Multithreading See 17+     See less ", "Experience Associate QA Lead Intel Corporation April 2015  – Present (5 months) Senior Software QA Engineer Intel Corporation September 2013  – Present (2 years) Requirements analyzing, Test designing, Test documentation in testlink, Testing tool development, Testing Simulator Development, Test Automation, Test automation framework enhancements, Product Documentation Writing, Providing test estimations for deliveries, Product releasing. Software QA Engineer Intel Corporation April 2013  –  September 2013  (6 months) Requirements analyzing, Test designing, Test documentation in testlink, Testing tool development, Testing Simulator Development, Test Automation, Test automation framework enhancements, Product releasing. Software QA Engineer Aepona October 2011  –  April 2013  (1 year 7 months) Mainly involved in test designing, testcase automation and simulator development for testing. Also doing some researches on test automation development and automated test-suite execution. Associate Software QA Engineer Aepona October 2010  –  October 2011  (1 year 1 month) Mainly involved in requirements analyzing, test designing, test documentation in testlink, test automation, product releasing. Software Engineer Olit (pvt) Limited April 2010  –  September 2010  (6 months) Associate QA Lead Intel Corporation April 2015  – Present (5 months) Associate QA Lead Intel Corporation April 2015  – Present (5 months) Senior Software QA Engineer Intel Corporation September 2013  – Present (2 years) Requirements analyzing, Test designing, Test documentation in testlink, Testing tool development, Testing Simulator Development, Test Automation, Test automation framework enhancements, Product Documentation Writing, Providing test estimations for deliveries, Product releasing. Senior Software QA Engineer Intel Corporation September 2013  – Present (2 years) Requirements analyzing, Test designing, Test documentation in testlink, Testing tool development, Testing Simulator Development, Test Automation, Test automation framework enhancements, Product Documentation Writing, Providing test estimations for deliveries, Product releasing. Software QA Engineer Intel Corporation April 2013  –  September 2013  (6 months) Requirements analyzing, Test designing, Test documentation in testlink, Testing tool development, Testing Simulator Development, Test Automation, Test automation framework enhancements, Product releasing. Software QA Engineer Intel Corporation April 2013  –  September 2013  (6 months) Requirements analyzing, Test designing, Test documentation in testlink, Testing tool development, Testing Simulator Development, Test Automation, Test automation framework enhancements, Product releasing. Software QA Engineer Aepona October 2011  –  April 2013  (1 year 7 months) Mainly involved in test designing, testcase automation and simulator development for testing. Also doing some researches on test automation development and automated test-suite execution. Software QA Engineer Aepona October 2011  –  April 2013  (1 year 7 months) Mainly involved in test designing, testcase automation and simulator development for testing. Also doing some researches on test automation development and automated test-suite execution. Associate Software QA Engineer Aepona October 2010  –  October 2011  (1 year 1 month) Mainly involved in requirements analyzing, test designing, test documentation in testlink, test automation, product releasing. Associate Software QA Engineer Aepona October 2010  –  October 2011  (1 year 1 month) Mainly involved in requirements analyzing, test designing, test documentation in testlink, test automation, product releasing. Software Engineer Olit (pvt) Limited April 2010  –  September 2010  (6 months) Software Engineer Olit (pvt) Limited April 2010  –  September 2010  (6 months) Languages Sinhalese English Sinhalese English Sinhalese English Skills Software Deployment Android Development QA Engineering Java Application... ASP.Net Development PIC Programming Video Editing Sound Editing Graphic Design Circuit Design ASP.NET C# Android JavaSE Software Quality... Software Development Tomcat Test Automation JUnit Quality Assurance Eclipse Testing Build & Deployment... Jenkins Testing Tool Development Simulator Development... Ant JIRA Maven UML Subversion Bugzilla OOP SOAP Software Engineering REST Java See 22+     See less Skills  Software Deployment Android Development QA Engineering Java Application... ASP.Net Development PIC Programming Video Editing Sound Editing Graphic Design Circuit Design ASP.NET C# Android JavaSE Software Quality... Software Development Tomcat Test Automation JUnit Quality Assurance Eclipse Testing Build & Deployment... Jenkins Testing Tool Development Simulator Development... Ant JIRA Maven UML Subversion Bugzilla OOP SOAP Software Engineering REST Java See 22+     See less Software Deployment Android Development QA Engineering Java Application... ASP.Net Development PIC Programming Video Editing Sound Editing Graphic Design Circuit Design ASP.NET C# Android JavaSE Software Quality... Software Development Tomcat Test Automation JUnit Quality Assurance Eclipse Testing Build & Deployment... Jenkins Testing Tool Development Simulator Development... Ant JIRA Maven UML Subversion Bugzilla OOP SOAP Software Engineering REST Java See 22+     See less Software Deployment Android Development QA Engineering Java Application... ASP.Net Development PIC Programming Video Editing Sound Editing Graphic Design Circuit Design ASP.NET C# Android JavaSE Software Quality... Software Development Tomcat Test Automation JUnit Quality Assurance Eclipse Testing Build & Deployment... Jenkins Testing Tool Development Simulator Development... Ant JIRA Maven UML Subversion Bugzilla OOP SOAP Software Engineering REST Java See 22+     See less Education Sri Lanka Institue of Information Technology BSc in Information Technology,  Computer Software Engineering 2007  – 2010 Ananda Collage Colombo 10 1996  – 2004 Activities and Societies:  Electronic Club ,  Astronomical Club ,  Cricket Club ,  Math Club M.D.H. Jayawardhana Widyala 1991  – 1996 Sri Lanka Institue of Information Technology BSc in Information Technology,  Computer Software Engineering 2007  – 2010 Sri Lanka Institue of Information Technology BSc in Information Technology,  Computer Software Engineering 2007  – 2010 Sri Lanka Institue of Information Technology BSc in Information Technology,  Computer Software Engineering 2007  – 2010 Ananda Collage Colombo 10 1996  – 2004 Activities and Societies:  Electronic Club ,  Astronomical Club ,  Cricket Club ,  Math Club Ananda Collage Colombo 10 1996  – 2004 Activities and Societies:  Electronic Club ,  Astronomical Club ,  Cricket Club ,  Math Club Ananda Collage Colombo 10 1996  – 2004 Activities and Societies:  Electronic Club ,  Astronomical Club ,  Cricket Club ,  Math Club M.D.H. Jayawardhana Widyala 1991  – 1996 M.D.H. Jayawardhana Widyala 1991  – 1996 M.D.H. Jayawardhana Widyala 1991  – 1996 ", "Experience Software QA Engineer Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Avionics Intern SpaceX July 2014  –  October 2014  (4 months) Hawthorne, CA • Worked to make battery module and pack assembly processes production-ready \n• Conducted characterization tests on proposed new battery cells \n• Developed tooling to increase efficiency and consistency of solar cell substring assembly Avionics Intern SpaceX August 2013  –  December 2013  (5 months) Hawthorne, CA • Worked to make battery module and pack assembly processes production-ready \n• Conducted characterization tests on proposed new battery cells \n• Developed tooling to increase efficiency and consistency of solar cell substring assembly PreSilicon Validation Intern Intel Corporation May 2013  –  August 2013  (4 months) Portland, Oregon Area • Improved debug collateral and logging of Test Access Point (TAP) traffic in SV environment \n• Developed a tool to dynamically visualize a network throughout a test run Undergraduate Teaching Assistant University of Florida January 2013  –  May 2013  (5 months) Gainesville, FL Teaching assistant for Digital Design Lab. Manufacturing Engineering Intern Unison Industries May 2012  –  August 2012  (4 months) Jacksonville, Florida Area • Created $51,000 in annual cost savings by automating testing for 36 wiring harnesses \n• Headed the roll out of a new Software Control Procedure for the plant Design Engineering Intern GE Aviation May 2011  –  August 2011  (4 months) Clearwater, FL • Conducted Electrical and Code tests on the FPGA for an MCDU \n• Selected replacement parts for the ADTE obsolescence project Software QA Engineer Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Software QA Engineer Intel Corporation November 2014  – Present (10 months) Portland, Oregon Area Avionics Intern SpaceX July 2014  –  October 2014  (4 months) Hawthorne, CA • Worked to make battery module and pack assembly processes production-ready \n• Conducted characterization tests on proposed new battery cells \n• Developed tooling to increase efficiency and consistency of solar cell substring assembly Avionics Intern SpaceX July 2014  –  October 2014  (4 months) Hawthorne, CA • Worked to make battery module and pack assembly processes production-ready \n• Conducted characterization tests on proposed new battery cells \n• Developed tooling to increase efficiency and consistency of solar cell substring assembly Avionics Intern SpaceX August 2013  –  December 2013  (5 months) Hawthorne, CA • Worked to make battery module and pack assembly processes production-ready \n• Conducted characterization tests on proposed new battery cells \n• Developed tooling to increase efficiency and consistency of solar cell substring assembly Avionics Intern SpaceX August 2013  –  December 2013  (5 months) Hawthorne, CA • Worked to make battery module and pack assembly processes production-ready \n• Conducted characterization tests on proposed new battery cells \n• Developed tooling to increase efficiency and consistency of solar cell substring assembly PreSilicon Validation Intern Intel Corporation May 2013  –  August 2013  (4 months) Portland, Oregon Area • Improved debug collateral and logging of Test Access Point (TAP) traffic in SV environment \n• Developed a tool to dynamically visualize a network throughout a test run PreSilicon Validation Intern Intel Corporation May 2013  –  August 2013  (4 months) Portland, Oregon Area • Improved debug collateral and logging of Test Access Point (TAP) traffic in SV environment \n• Developed a tool to dynamically visualize a network throughout a test run Undergraduate Teaching Assistant University of Florida January 2013  –  May 2013  (5 months) Gainesville, FL Teaching assistant for Digital Design Lab. Undergraduate Teaching Assistant University of Florida January 2013  –  May 2013  (5 months) Gainesville, FL Teaching assistant for Digital Design Lab. Manufacturing Engineering Intern Unison Industries May 2012  –  August 2012  (4 months) Jacksonville, Florida Area • Created $51,000 in annual cost savings by automating testing for 36 wiring harnesses \n• Headed the roll out of a new Software Control Procedure for the plant Manufacturing Engineering Intern Unison Industries May 2012  –  August 2012  (4 months) Jacksonville, Florida Area • Created $51,000 in annual cost savings by automating testing for 36 wiring harnesses \n• Headed the roll out of a new Software Control Procedure for the plant Design Engineering Intern GE Aviation May 2011  –  August 2011  (4 months) Clearwater, FL • Conducted Electrical and Code tests on the FPGA for an MCDU \n• Selected replacement parts for the ADTE obsolescence project Design Engineering Intern GE Aviation May 2011  –  August 2011  (4 months) Clearwater, FL • Conducted Electrical and Code tests on the FPGA for an MCDU \n• Selected replacement parts for the ADTE obsolescence project Languages English English English Skills Java C C++ Matlab Linux Python Skills  Java C C++ Matlab Linux Python Java C C++ Matlab Linux Python Java C C++ Matlab Linux Python Education University of Florida Bachelor of Science (BS),  Electrical and Electronics Engineering 2009  – 2014 Activities and Societies:  Tau Beta Pi\nEta Kappa Nu University of Florida Bachelor's degree,  Computer Engineering 2009  – 2014 University of Florida Bachelor of Science (BS),  Electrical and Electronics Engineering 2009  – 2014 Activities and Societies:  Tau Beta Pi\nEta Kappa Nu University of Florida Bachelor of Science (BS),  Electrical and Electronics Engineering 2009  – 2014 Activities and Societies:  Tau Beta Pi\nEta Kappa Nu University of Florida Bachelor of Science (BS),  Electrical and Electronics Engineering 2009  – 2014 Activities and Societies:  Tau Beta Pi\nEta Kappa Nu University of Florida Bachelor's degree,  Computer Engineering 2009  – 2014 University of Florida Bachelor's degree,  Computer Engineering 2009  – 2014 University of Florida Bachelor's degree,  Computer Engineering 2009  – 2014 Honors & Awards GE Above and Beyond Award for Teamwork GE August 2012 GE Above and Beyond Award for Teamwork GE August 2012 GE Above and Beyond Award for Teamwork GE August 2012 GE Above and Beyond Award for Teamwork GE August 2012 ", "Experience Software QA Engineer Intel Corporation October 2014  – Present (11 months) Contracted Software QA Engineer Intel Corporation May 2012  – Present (3 years 4 months) Bucharest, Romania through RINF Outsourcing \nsenior QA consultant Software Engineer Assystem May 2011  –  May 2012  (1 year 1 month) Bucharest, Romania QA Tester Ubisoft March 2008  –  May 2011  (3 years 3 months) Bucharest, Romania Software QA Engineer Intel Corporation October 2014  – Present (11 months) Software QA Engineer Intel Corporation October 2014  – Present (11 months) Contracted Software QA Engineer Intel Corporation May 2012  – Present (3 years 4 months) Bucharest, Romania through RINF Outsourcing \nsenior QA consultant Contracted Software QA Engineer Intel Corporation May 2012  – Present (3 years 4 months) Bucharest, Romania through RINF Outsourcing \nsenior QA consultant Software Engineer Assystem May 2011  –  May 2012  (1 year 1 month) Bucharest, Romania Software Engineer Assystem May 2011  –  May 2012  (1 year 1 month) Bucharest, Romania QA Tester Ubisoft March 2008  –  May 2011  (3 years 3 months) Bucharest, Romania QA Tester Ubisoft March 2008  –  May 2011  (3 years 3 months) Bucharest, Romania Languages English Full professional proficiency French Professional working proficiency English Full professional proficiency French Professional working proficiency English Full professional proficiency French Professional working proficiency Full professional proficiency Professional working proficiency Skills Debugging Embedded Systems Testing Test Automation Linux C Python Bash JavaScript PHP C++ Java QA Engineering Test Planning White Box Testing Mac OS HTML 5 Android Git JIRA Perforce ClearCase Jenkins OpenGL ES WebGL Benchmarking Performance Benchmarking Subversion Software Quality... See 14+     See less Skills  Debugging Embedded Systems Testing Test Automation Linux C Python Bash JavaScript PHP C++ Java QA Engineering Test Planning White Box Testing Mac OS HTML 5 Android Git JIRA Perforce ClearCase Jenkins OpenGL ES WebGL Benchmarking Performance Benchmarking Subversion Software Quality... See 14+     See less Debugging Embedded Systems Testing Test Automation Linux C Python Bash JavaScript PHP C++ Java QA Engineering Test Planning White Box Testing Mac OS HTML 5 Android Git JIRA Perforce ClearCase Jenkins OpenGL ES WebGL Benchmarking Performance Benchmarking Subversion Software Quality... See 14+     See less Debugging Embedded Systems Testing Test Automation Linux C Python Bash JavaScript PHP C++ Java QA Engineering Test Planning White Box Testing Mac OS HTML 5 Android Git JIRA Perforce ClearCase Jenkins OpenGL ES WebGL Benchmarking Performance Benchmarking Subversion Software Quality... See 14+     See less Education Universitatea „Politehnica” din București Bachelor of Engineering (BEng),  Automatic Control and Systems Engineering Department 2003  – 2010 Universitatea „Politehnica” din București Bachelor of Engineering (BEng),  Automatic Control and Systems Engineering Department 2003  – 2010 Universitatea „Politehnica” din București Bachelor of Engineering (BEng),  Automatic Control and Systems Engineering Department 2003  – 2010 Universitatea „Politehnica” din București Bachelor of Engineering (BEng),  Automatic Control and Systems Engineering Department 2003  – 2010 ", "Skills Software Engineering Object Oriented Design C Embedded Systems System Architecture Embedded Software C++ Software Design Java Debugging Skills  Software Engineering Object Oriented Design C Embedded Systems System Architecture Embedded Software C++ Software Design Java Debugging Software Engineering Object Oriented Design C Embedded Systems System Architecture Embedded Software C++ Software Design Java Debugging Software Engineering Object Oriented Design C Embedded Systems System Architecture Embedded Software C++ Software Design Java Debugging ", "Experience Software QA Engineer Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, California Systems Analyst Belkin International March 2013  –  September 2013  (7 months) Alameda, CA Web Engineering QA Cisco Consumer Products May 2009  –  March 2013  (3 years 11 months) Software QA Engineer Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, California Software QA Engineer Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, California Systems Analyst Belkin International March 2013  –  September 2013  (7 months) Alameda, CA Systems Analyst Belkin International March 2013  –  September 2013  (7 months) Alameda, CA Web Engineering QA Cisco Consumer Products May 2009  –  March 2013  (3 years 11 months) Web Engineering QA Cisco Consumer Products May 2009  –  March 2013  (3 years 11 months) "]}