{"position": "Software Solutions Architect", "company": "Intel Corporation", "profiles": ["Skills Intel Semiconductors Program Management Software Engineering Electronics Test Automation Product Development Systems Engineering Design of Experiments Hardware Embedded Software Embedded Systems Debugging System Architecture Skills  Intel Semiconductors Program Management Software Engineering Electronics Test Automation Product Development Systems Engineering Design of Experiments Hardware Embedded Software Embedded Systems Debugging System Architecture Intel Semiconductors Program Management Software Engineering Electronics Test Automation Product Development Systems Engineering Design of Experiments Hardware Embedded Software Embedded Systems Debugging System Architecture Intel Semiconductors Program Management Software Engineering Electronics Test Automation Product Development Systems Engineering Design of Experiments Hardware Embedded Software Embedded Systems Debugging System Architecture ", "Summary Senior technical leader with 15+ years experience leading the design, development and deployment of enterprise IT solutions and commercial software products with a focus on networking, analytics and integration.  \n \n• Self-driven, highly motivated, and passionate technologist  \n• Successful track record delivering high-visibility, high-value projects on time and on budget \n• Broad experience building and leading teams across global organizations with direct and matrixed reporting structures \n• Possess equal parts technology and business acumen to communicate effectively with both C-Level executives and engineering teams \n• A decade of international project experience in IT, government, and healthcare IT sectors \n• Regular speaker at industry conferences with the ability to translate and articulate complex information to large audiences as well as executive-level management.  \n• Known for accepting unfamiliar challenges and becoming an expert global resource with a proven management track record in sales, marketing, strategy and business development. \n \nCurrently holds the position of Director of Business Analytics at Intel’s Information Technology Group, and has responsibility for defining the strategy and roadmap for business intelligence and analytic capabilities in support of business group requirements. \n \nSpecialties: Business Development, Technology Strategy, Agile Product Development, Product Management, Business Intelligence, Advanced & Predictive Analytics, Information Security, Technical Marketing Summary Senior technical leader with 15+ years experience leading the design, development and deployment of enterprise IT solutions and commercial software products with a focus on networking, analytics and integration.  \n \n• Self-driven, highly motivated, and passionate technologist  \n• Successful track record delivering high-visibility, high-value projects on time and on budget \n• Broad experience building and leading teams across global organizations with direct and matrixed reporting structures \n• Possess equal parts technology and business acumen to communicate effectively with both C-Level executives and engineering teams \n• A decade of international project experience in IT, government, and healthcare IT sectors \n• Regular speaker at industry conferences with the ability to translate and articulate complex information to large audiences as well as executive-level management.  \n• Known for accepting unfamiliar challenges and becoming an expert global resource with a proven management track record in sales, marketing, strategy and business development. \n \nCurrently holds the position of Director of Business Analytics at Intel’s Information Technology Group, and has responsibility for defining the strategy and roadmap for business intelligence and analytic capabilities in support of business group requirements. \n \nSpecialties: Business Development, Technology Strategy, Agile Product Development, Product Management, Business Intelligence, Advanced & Predictive Analytics, Information Security, Technical Marketing Senior technical leader with 15+ years experience leading the design, development and deployment of enterprise IT solutions and commercial software products with a focus on networking, analytics and integration.  \n \n• Self-driven, highly motivated, and passionate technologist  \n• Successful track record delivering high-visibility, high-value projects on time and on budget \n• Broad experience building and leading teams across global organizations with direct and matrixed reporting structures \n• Possess equal parts technology and business acumen to communicate effectively with both C-Level executives and engineering teams \n• A decade of international project experience in IT, government, and healthcare IT sectors \n• Regular speaker at industry conferences with the ability to translate and articulate complex information to large audiences as well as executive-level management.  \n• Known for accepting unfamiliar challenges and becoming an expert global resource with a proven management track record in sales, marketing, strategy and business development. \n \nCurrently holds the position of Director of Business Analytics at Intel’s Information Technology Group, and has responsibility for defining the strategy and roadmap for business intelligence and analytic capabilities in support of business group requirements. \n \nSpecialties: Business Development, Technology Strategy, Agile Product Development, Product Management, Business Intelligence, Advanced & Predictive Analytics, Information Security, Technical Marketing Senior technical leader with 15+ years experience leading the design, development and deployment of enterprise IT solutions and commercial software products with a focus on networking, analytics and integration.  \n \n• Self-driven, highly motivated, and passionate technologist  \n• Successful track record delivering high-visibility, high-value projects on time and on budget \n• Broad experience building and leading teams across global organizations with direct and matrixed reporting structures \n• Possess equal parts technology and business acumen to communicate effectively with both C-Level executives and engineering teams \n• A decade of international project experience in IT, government, and healthcare IT sectors \n• Regular speaker at industry conferences with the ability to translate and articulate complex information to large audiences as well as executive-level management.  \n• Known for accepting unfamiliar challenges and becoming an expert global resource with a proven management track record in sales, marketing, strategy and business development. \n \nCurrently holds the position of Director of Business Analytics at Intel’s Information Technology Group, and has responsibility for defining the strategy and roadmap for business intelligence and analytic capabilities in support of business group requirements. \n \nSpecialties: Business Development, Technology Strategy, Agile Product Development, Product Management, Business Intelligence, Advanced & Predictive Analytics, Information Security, Technical Marketing Experience Director - Business Analytics, Information Technology Group Intel Corporation October 2010  – Present (4 years 11 months) San Francisco Bay Area President Irish Network Bay Area December 2014  – Present (9 months) San Francisco Bay Area Director - Business Analytics, Information Technology Group Intel Corporation October 2010  – Present (4 years 11 months) San Francisco Bay Area Director - Business Analytics, Information Technology Group Intel Corporation October 2010  – Present (4 years 11 months) San Francisco Bay Area President Irish Network Bay Area December 2014  – Present (9 months) San Francisco Bay Area President Irish Network Bay Area December 2014  – Present (9 months) San Francisco Bay Area Skills Product Marketing Product Management Business Intelligence Agile IT Strategy Predictive Analytics Strategic Partnerships Analytics Business Strategy Go-to-market Strategy Innovation Marketing Analytics Sales Analytics Social Media Analytics Agile Methodologies Intel Enterprise Architecture Cloud Computing Business Development Management Business Analytics Program Management Enterprise Software See 8+     See less Skills  Product Marketing Product Management Business Intelligence Agile IT Strategy Predictive Analytics Strategic Partnerships Analytics Business Strategy Go-to-market Strategy Innovation Marketing Analytics Sales Analytics Social Media Analytics Agile Methodologies Intel Enterprise Architecture Cloud Computing Business Development Management Business Analytics Program Management Enterprise Software See 8+     See less Product Marketing Product Management Business Intelligence Agile IT Strategy Predictive Analytics Strategic Partnerships Analytics Business Strategy Go-to-market Strategy Innovation Marketing Analytics Sales Analytics Social Media Analytics Agile Methodologies Intel Enterprise Architecture Cloud Computing Business Development Management Business Analytics Program Management Enterprise Software See 8+     See less Product Marketing Product Management Business Intelligence Agile IT Strategy Predictive Analytics Strategic Partnerships Analytics Business Strategy Go-to-market Strategy Innovation Marketing Analytics Sales Analytics Social Media Analytics Agile Methodologies Intel Enterprise Architecture Cloud Computing Business Development Management Business Analytics Program Management Enterprise Software See 8+     See less Education University of Limerick M.Sc.,  Technology Management 2003  – 2005 University of Limerick B.Sc.,  Applied Physics 1993  – 1997 Massachusetts Institute of Technology Certificate,  Big Data & Analytics 2014  – 2014 Tackling the Challenges of Big Data University of Virginia Darden School of Business Certificate, Leading for Extraordinary Results,  Organizational Leadership 2009  – 2009 University of Limerick M.Sc.,  Technology Management 2003  – 2005 University of Limerick M.Sc.,  Technology Management 2003  – 2005 University of Limerick M.Sc.,  Technology Management 2003  – 2005 University of Limerick B.Sc.,  Applied Physics 1993  – 1997 University of Limerick B.Sc.,  Applied Physics 1993  – 1997 University of Limerick B.Sc.,  Applied Physics 1993  – 1997 Massachusetts Institute of Technology Certificate,  Big Data & Analytics 2014  – 2014 Tackling the Challenges of Big Data Massachusetts Institute of Technology Certificate,  Big Data & Analytics 2014  – 2014 Tackling the Challenges of Big Data Massachusetts Institute of Technology Certificate,  Big Data & Analytics 2014  – 2014 Tackling the Challenges of Big Data University of Virginia Darden School of Business Certificate, Leading for Extraordinary Results,  Organizational Leadership 2009  – 2009 University of Virginia Darden School of Business Certificate, Leading for Extraordinary Results,  Organizational Leadership 2009  – 2009 University of Virginia Darden School of Business Certificate, Leading for Extraordinary Results,  Organizational Leadership 2009  – 2009 Honors & Awards Irish 40-Under-40 Award Winner 2015 Irish Echo February 2015 Irish 40-Under-40 Award Winner 2015, celebrating Irish and Irish Americans who have distinguished themselves in their respective fields of work before reaching the age of forty.  Additional Honors & Awards US Patents: 7440994, 7499981, 7546363, 7562112 & 7921155 Irish 40-Under-40 Award Winner 2015 Irish Echo February 2015 Irish 40-Under-40 Award Winner 2015, celebrating Irish and Irish Americans who have distinguished themselves in their respective fields of work before reaching the age of forty.  Irish 40-Under-40 Award Winner 2015 Irish Echo February 2015 Irish 40-Under-40 Award Winner 2015, celebrating Irish and Irish Americans who have distinguished themselves in their respective fields of work before reaching the age of forty.  Irish 40-Under-40 Award Winner 2015 Irish Echo February 2015 Irish 40-Under-40 Award Winner 2015, celebrating Irish and Irish Americans who have distinguished themselves in their respective fields of work before reaching the age of forty.  Additional Honors & Awards US Patents: 7440994, 7499981, 7546363, 7562112 & 7921155 Additional Honors & Awards US Patents: 7440994, 7499981, 7546363, 7562112 & 7921155 Additional Honors & Awards US Patents: 7440994, 7499981, 7546363, 7562112 & 7921155 ", "Summary Versatile technologist with a proven record in engineering team management, software design and development. Strong team leadership skills successfully applied in product development and research projects. My work has resulted in 6 issued and 1 pending US patents. \n \nSpecialties: Extensive experience in system engineering, system design and research strategy definition. System development experience includes business solutions, embedded device management architectures, managed runtimes and internet applications.  \n \n(Direct development experience includes: MS .Net C#, Java, Java Script, C, C++, Perl, SQL Stored Procedures, Linux Embedded Software Development, RFID Reader Software Design and Development, RFID Reader APIs, Web Services, Device Management) Summary Versatile technologist with a proven record in engineering team management, software design and development. Strong team leadership skills successfully applied in product development and research projects. My work has resulted in 6 issued and 1 pending US patents. \n \nSpecialties: Extensive experience in system engineering, system design and research strategy definition. System development experience includes business solutions, embedded device management architectures, managed runtimes and internet applications.  \n \n(Direct development experience includes: MS .Net C#, Java, Java Script, C, C++, Perl, SQL Stored Procedures, Linux Embedded Software Development, RFID Reader Software Design and Development, RFID Reader APIs, Web Services, Device Management) Versatile technologist with a proven record in engineering team management, software design and development. Strong team leadership skills successfully applied in product development and research projects. My work has resulted in 6 issued and 1 pending US patents. \n \nSpecialties: Extensive experience in system engineering, system design and research strategy definition. System development experience includes business solutions, embedded device management architectures, managed runtimes and internet applications.  \n \n(Direct development experience includes: MS .Net C#, Java, Java Script, C, C++, Perl, SQL Stored Procedures, Linux Embedded Software Development, RFID Reader Software Design and Development, RFID Reader APIs, Web Services, Device Management) Versatile technologist with a proven record in engineering team management, software design and development. Strong team leadership skills successfully applied in product development and research projects. My work has resulted in 6 issued and 1 pending US patents. \n \nSpecialties: Extensive experience in system engineering, system design and research strategy definition. System development experience includes business solutions, embedded device management architectures, managed runtimes and internet applications.  \n \n(Direct development experience includes: MS .Net C#, Java, Java Script, C, C++, Perl, SQL Stored Procedures, Linux Embedded Software Development, RFID Reader Software Design and Development, RFID Reader APIs, Web Services, Device Management) Experience Software Solutions Architect Intel Corporation October 2013  – Present (1 year 11 months) Phoenix, Arizona Area Device Management Roadmap Proposal and Product Requirements Document v0.3:  \nDesigned a Device Management capability roadmap for the current product and reviewed it with technical stakeholders. This proposal was the result of cross company stakeholder collaboration. After several stakeholder usages brainstorming sessions, documented related Use Cases and Requirements in Jama, which can be used to produce the Device Management PRD v0.3. By taking the time to apply disciplined Requirements Engineering techniques, this work is easily shared with our validation partners, internal and external team members. This has helped define the applicability of certain APIs, third party feature sets and development work to be completed during 2014. Additionally, by creating a Domain Model in Enterprise Architect(EA) the system being designed is much easier to comprehend and communicate with stakeholders. Engineering Manager Intel Corporation September 2010  –  October 2013  (3 years 2 months) Android Working Group Leadership: Led Android Working Group to create several path finding activities aimed at determining how department product features can add value to an Intel-based Android solution. Drove this WG which started with one senior engineer to a team of architects and junior contributors in six months. The group agreed to reuse known Open Source Storage components rather than create new competing solutions in Linux.  \n \nSystem Architecture Engineering manager within one of Intel's client business groups.  \nSystem Engineering team established a Collaborative Software Architecture Specification Design Process. Drove the involvement of an external consultant/author to train the CSC team in a UML based SW design methodology. Classes were held involving team chief technologists, developers, validation, customer support and R&D developers. This group has saved weeks of engineering time by simplifying designs for one feature alone. Validation was able to perform their testing from a much more informed perspective than previous feature designs methods.  \n \nChampioned the Jama Contour requirements management tool database rollout for engineering team. Developed Jama Contour based processes to transition the System Engineering team from an MS Excel/Outlook review process to a Jama Contour Review Center process. Acted as co-tool system administrator for Jama Contour, granting access, educating system engineers in using the tool, and planning ways to produce Software Requirements Specifications from the tool’s database. Reviewed vision of how Contour should be used with System Engineers and Agile development organization.  \n \nManaged tools team of three software developers to drive consistent and well understood requirements management processes and traceably through Agile software development sprints and test cycles. Engineering Manager Intel Corporation April 2008  –  April 2011  (3 years 1 month) Global Deployment Services manager within one of Intel's client business groups. Position involves managing a number of localization (L10N) program managers and numerous L10N engineers. Software products requiring L10N range from BIOS to network management applications. This Arizona based team localizes client platform components such as Active Management Technology - AMT vPro, graphics driver UIs, storage configuration UIs and their associated installers across multiple human languages. Senior Software Engineer Intel Corporation January 2006  –  March 2008  (2 years 3 months) Led a cross organizational team (including application enabling, business unit marketing/strategic planning and product engineering) to create next generation software roadmap for the Mobile Clinicians Assistant (MCA) software development kit (SDK). Gathered requirements from hospital IT vendors, OEM software engineers, nurses and Intel field sales. Authored Mobile Clinicians Assistant (MCA) next generation SDK strategic planning requirements document.  \n \nDrove the creation and publication of two Intel Software Insight articles. Collaborated with external technical writers contributing content, crafting text and editing drafts.  \n \n“RFID Technology Improves Bedside Care in Hospitals” \n“How Shadowing Shaped the Design of the Mobile Clinical Assistant” \n \nSoftware Engineering Research Lead for SSG Digital Health Enabling (DHe) with focus on RFID Reader API development, mobile platforms and Real Time Location Systems (RTLS) for Hospital IT Mobile Point of Care usage models. Senior Software Engineer Intel Corporation January 2004  –  December 2005  (2 years) Software Engineering Lead for RFID Reader Network and Device Management features.  \n \nResponsible for an embedded Linux software architecture, SNMP tool vendor and C/C++ system integration involving four engineers and three companies.  \n• Delivered the Device Management Architecture for an RFID reader \n• Delivered RFID Reader’s SNMP Device Management Software stack  \n• Selected and managed relationship with SNMP agent vendor  \n• Designed and implemented Device Management data hierarchy (Enterprise MIB) for product team. Authored white paper which was shared with external customers \n• Lead development of a Device Management Web page interface  \n• Investigated USB Drivers and tools for silicon based product Senior Software Engineer - R&D Intel Corporation October 2000  –  December 2003  (3 years 3 months) Proven skills as an innovator and leader in Runtime and Web Services technologies. \n \nW3C XMLP (SOAP) 1.2 Working Group - Company's Principal Representative  \n \n• Authored the W3C SOAP 1.2 Binding to Email. This document was accepted as a W3C Note. Facilitated a W3C working group sub team to finalize the document and address feedback from the working group. Industry leaders from IBM, HP, Macromedia, Sun and Systinet acknowledged my significant contribution.  \n \nNative Method Invocation (NMI) Research Project Team Lead \n• Three US patent filings, one foreign filing.  \n• Prepared and delivered project findings to Microsoft. Coordinated China and Arizona based team members’ contributions. \n• Created project plan and execution strategy, lead the project through PLC process  \n• Forged and managed close partnership with business unit  \n• Significantly contributed to team’s technical deliverables Systems Engineer Xerox Corporation 1998  –  2000  (2 years) Demonstrated skills as a leader and systems engineer in both intranet applications development and embedded internet technologies. \n \n• 2 US Patents awarded for an invention utilizing Web Technology, RDBMS, Object Oriented Design, and Servlets for distributed device management.  \n• Led Team of Systems Engineers, Developers, Business Unit Representatives and Test Engineers to deliver new Internet features on two Xerox products. This involved creating specifications, project plans, test plans and presentations to management. This was done in a CMM Level 2 Certified organization.  \n• Worked on future Network Controller Software strategies with the organization’s Architecture Team. \n• Wrote a High Level Design document for the Document Centre Embedded Web Client.  \n• Designed and implemented the core data model for the “It’s All on the Web” Metrics Automation Application. Developed PL/SQL package libraries for metrics calculations and browser page rendering. Software Solutions Architect Intel Corporation October 2013  – Present (1 year 11 months) Phoenix, Arizona Area Device Management Roadmap Proposal and Product Requirements Document v0.3:  \nDesigned a Device Management capability roadmap for the current product and reviewed it with technical stakeholders. This proposal was the result of cross company stakeholder collaboration. After several stakeholder usages brainstorming sessions, documented related Use Cases and Requirements in Jama, which can be used to produce the Device Management PRD v0.3. By taking the time to apply disciplined Requirements Engineering techniques, this work is easily shared with our validation partners, internal and external team members. This has helped define the applicability of certain APIs, third party feature sets and development work to be completed during 2014. Additionally, by creating a Domain Model in Enterprise Architect(EA) the system being designed is much easier to comprehend and communicate with stakeholders. Software Solutions Architect Intel Corporation October 2013  – Present (1 year 11 months) Phoenix, Arizona Area Device Management Roadmap Proposal and Product Requirements Document v0.3:  \nDesigned a Device Management capability roadmap for the current product and reviewed it with technical stakeholders. This proposal was the result of cross company stakeholder collaboration. After several stakeholder usages brainstorming sessions, documented related Use Cases and Requirements in Jama, which can be used to produce the Device Management PRD v0.3. By taking the time to apply disciplined Requirements Engineering techniques, this work is easily shared with our validation partners, internal and external team members. This has helped define the applicability of certain APIs, third party feature sets and development work to be completed during 2014. Additionally, by creating a Domain Model in Enterprise Architect(EA) the system being designed is much easier to comprehend and communicate with stakeholders. Engineering Manager Intel Corporation September 2010  –  October 2013  (3 years 2 months) Android Working Group Leadership: Led Android Working Group to create several path finding activities aimed at determining how department product features can add value to an Intel-based Android solution. Drove this WG which started with one senior engineer to a team of architects and junior contributors in six months. The group agreed to reuse known Open Source Storage components rather than create new competing solutions in Linux.  \n \nSystem Architecture Engineering manager within one of Intel's client business groups.  \nSystem Engineering team established a Collaborative Software Architecture Specification Design Process. Drove the involvement of an external consultant/author to train the CSC team in a UML based SW design methodology. Classes were held involving team chief technologists, developers, validation, customer support and R&D developers. This group has saved weeks of engineering time by simplifying designs for one feature alone. Validation was able to perform their testing from a much more informed perspective than previous feature designs methods.  \n \nChampioned the Jama Contour requirements management tool database rollout for engineering team. Developed Jama Contour based processes to transition the System Engineering team from an MS Excel/Outlook review process to a Jama Contour Review Center process. Acted as co-tool system administrator for Jama Contour, granting access, educating system engineers in using the tool, and planning ways to produce Software Requirements Specifications from the tool’s database. Reviewed vision of how Contour should be used with System Engineers and Agile development organization.  \n \nManaged tools team of three software developers to drive consistent and well understood requirements management processes and traceably through Agile software development sprints and test cycles. Engineering Manager Intel Corporation September 2010  –  October 2013  (3 years 2 months) Android Working Group Leadership: Led Android Working Group to create several path finding activities aimed at determining how department product features can add value to an Intel-based Android solution. Drove this WG which started with one senior engineer to a team of architects and junior contributors in six months. The group agreed to reuse known Open Source Storage components rather than create new competing solutions in Linux.  \n \nSystem Architecture Engineering manager within one of Intel's client business groups.  \nSystem Engineering team established a Collaborative Software Architecture Specification Design Process. Drove the involvement of an external consultant/author to train the CSC team in a UML based SW design methodology. Classes were held involving team chief technologists, developers, validation, customer support and R&D developers. This group has saved weeks of engineering time by simplifying designs for one feature alone. Validation was able to perform their testing from a much more informed perspective than previous feature designs methods.  \n \nChampioned the Jama Contour requirements management tool database rollout for engineering team. Developed Jama Contour based processes to transition the System Engineering team from an MS Excel/Outlook review process to a Jama Contour Review Center process. Acted as co-tool system administrator for Jama Contour, granting access, educating system engineers in using the tool, and planning ways to produce Software Requirements Specifications from the tool’s database. Reviewed vision of how Contour should be used with System Engineers and Agile development organization.  \n \nManaged tools team of three software developers to drive consistent and well understood requirements management processes and traceably through Agile software development sprints and test cycles. Engineering Manager Intel Corporation April 2008  –  April 2011  (3 years 1 month) Global Deployment Services manager within one of Intel's client business groups. Position involves managing a number of localization (L10N) program managers and numerous L10N engineers. Software products requiring L10N range from BIOS to network management applications. This Arizona based team localizes client platform components such as Active Management Technology - AMT vPro, graphics driver UIs, storage configuration UIs and their associated installers across multiple human languages. Engineering Manager Intel Corporation April 2008  –  April 2011  (3 years 1 month) Global Deployment Services manager within one of Intel's client business groups. Position involves managing a number of localization (L10N) program managers and numerous L10N engineers. Software products requiring L10N range from BIOS to network management applications. This Arizona based team localizes client platform components such as Active Management Technology - AMT vPro, graphics driver UIs, storage configuration UIs and their associated installers across multiple human languages. Senior Software Engineer Intel Corporation January 2006  –  March 2008  (2 years 3 months) Led a cross organizational team (including application enabling, business unit marketing/strategic planning and product engineering) to create next generation software roadmap for the Mobile Clinicians Assistant (MCA) software development kit (SDK). Gathered requirements from hospital IT vendors, OEM software engineers, nurses and Intel field sales. Authored Mobile Clinicians Assistant (MCA) next generation SDK strategic planning requirements document.  \n \nDrove the creation and publication of two Intel Software Insight articles. Collaborated with external technical writers contributing content, crafting text and editing drafts.  \n \n“RFID Technology Improves Bedside Care in Hospitals” \n“How Shadowing Shaped the Design of the Mobile Clinical Assistant” \n \nSoftware Engineering Research Lead for SSG Digital Health Enabling (DHe) with focus on RFID Reader API development, mobile platforms and Real Time Location Systems (RTLS) for Hospital IT Mobile Point of Care usage models. Senior Software Engineer Intel Corporation January 2006  –  March 2008  (2 years 3 months) Led a cross organizational team (including application enabling, business unit marketing/strategic planning and product engineering) to create next generation software roadmap for the Mobile Clinicians Assistant (MCA) software development kit (SDK). Gathered requirements from hospital IT vendors, OEM software engineers, nurses and Intel field sales. Authored Mobile Clinicians Assistant (MCA) next generation SDK strategic planning requirements document.  \n \nDrove the creation and publication of two Intel Software Insight articles. Collaborated with external technical writers contributing content, crafting text and editing drafts.  \n \n“RFID Technology Improves Bedside Care in Hospitals” \n“How Shadowing Shaped the Design of the Mobile Clinical Assistant” \n \nSoftware Engineering Research Lead for SSG Digital Health Enabling (DHe) with focus on RFID Reader API development, mobile platforms and Real Time Location Systems (RTLS) for Hospital IT Mobile Point of Care usage models. Senior Software Engineer Intel Corporation January 2004  –  December 2005  (2 years) Software Engineering Lead for RFID Reader Network and Device Management features.  \n \nResponsible for an embedded Linux software architecture, SNMP tool vendor and C/C++ system integration involving four engineers and three companies.  \n• Delivered the Device Management Architecture for an RFID reader \n• Delivered RFID Reader’s SNMP Device Management Software stack  \n• Selected and managed relationship with SNMP agent vendor  \n• Designed and implemented Device Management data hierarchy (Enterprise MIB) for product team. Authored white paper which was shared with external customers \n• Lead development of a Device Management Web page interface  \n• Investigated USB Drivers and tools for silicon based product Senior Software Engineer Intel Corporation January 2004  –  December 2005  (2 years) Software Engineering Lead for RFID Reader Network and Device Management features.  \n \nResponsible for an embedded Linux software architecture, SNMP tool vendor and C/C++ system integration involving four engineers and three companies.  \n• Delivered the Device Management Architecture for an RFID reader \n• Delivered RFID Reader’s SNMP Device Management Software stack  \n• Selected and managed relationship with SNMP agent vendor  \n• Designed and implemented Device Management data hierarchy (Enterprise MIB) for product team. Authored white paper which was shared with external customers \n• Lead development of a Device Management Web page interface  \n• Investigated USB Drivers and tools for silicon based product Senior Software Engineer - R&D Intel Corporation October 2000  –  December 2003  (3 years 3 months) Proven skills as an innovator and leader in Runtime and Web Services technologies. \n \nW3C XMLP (SOAP) 1.2 Working Group - Company's Principal Representative  \n \n• Authored the W3C SOAP 1.2 Binding to Email. This document was accepted as a W3C Note. Facilitated a W3C working group sub team to finalize the document and address feedback from the working group. Industry leaders from IBM, HP, Macromedia, Sun and Systinet acknowledged my significant contribution.  \n \nNative Method Invocation (NMI) Research Project Team Lead \n• Three US patent filings, one foreign filing.  \n• Prepared and delivered project findings to Microsoft. Coordinated China and Arizona based team members’ contributions. \n• Created project plan and execution strategy, lead the project through PLC process  \n• Forged and managed close partnership with business unit  \n• Significantly contributed to team’s technical deliverables Senior Software Engineer - R&D Intel Corporation October 2000  –  December 2003  (3 years 3 months) Proven skills as an innovator and leader in Runtime and Web Services technologies. \n \nW3C XMLP (SOAP) 1.2 Working Group - Company's Principal Representative  \n \n• Authored the W3C SOAP 1.2 Binding to Email. This document was accepted as a W3C Note. Facilitated a W3C working group sub team to finalize the document and address feedback from the working group. Industry leaders from IBM, HP, Macromedia, Sun and Systinet acknowledged my significant contribution.  \n \nNative Method Invocation (NMI) Research Project Team Lead \n• Three US patent filings, one foreign filing.  \n• Prepared and delivered project findings to Microsoft. Coordinated China and Arizona based team members’ contributions. \n• Created project plan and execution strategy, lead the project through PLC process  \n• Forged and managed close partnership with business unit  \n• Significantly contributed to team’s technical deliverables Systems Engineer Xerox Corporation 1998  –  2000  (2 years) Demonstrated skills as a leader and systems engineer in both intranet applications development and embedded internet technologies. \n \n• 2 US Patents awarded for an invention utilizing Web Technology, RDBMS, Object Oriented Design, and Servlets for distributed device management.  \n• Led Team of Systems Engineers, Developers, Business Unit Representatives and Test Engineers to deliver new Internet features on two Xerox products. This involved creating specifications, project plans, test plans and presentations to management. This was done in a CMM Level 2 Certified organization.  \n• Worked on future Network Controller Software strategies with the organization’s Architecture Team. \n• Wrote a High Level Design document for the Document Centre Embedded Web Client.  \n• Designed and implemented the core data model for the “It’s All on the Web” Metrics Automation Application. Developed PL/SQL package libraries for metrics calculations and browser page rendering. Systems Engineer Xerox Corporation 1998  –  2000  (2 years) Demonstrated skills as a leader and systems engineer in both intranet applications development and embedded internet technologies. \n \n• 2 US Patents awarded for an invention utilizing Web Technology, RDBMS, Object Oriented Design, and Servlets for distributed device management.  \n• Led Team of Systems Engineers, Developers, Business Unit Representatives and Test Engineers to deliver new Internet features on two Xerox products. This involved creating specifications, project plans, test plans and presentations to management. This was done in a CMM Level 2 Certified organization.  \n• Worked on future Network Controller Software strategies with the organization’s Architecture Team. \n• Wrote a High Level Design document for the Document Centre Embedded Web Client.  \n• Designed and implemented the core data model for the “It’s All on the Web” Metrics Automation Application. Developed PL/SQL package libraries for metrics calculations and browser page rendering. Skills Software Engineering Software Development Software Design Embedded Systems System Architecture Perl Systems Engineering C++ Testing Distributed Systems Agile Methodologies Web Services Java Product Management Architecture C C# Requirements Analysis Product Development Technical Leadership Enterprise Software .NET JavaScript Engineering Management Intel Visual Studio Programming Computer Architecture Web Applications Software Project... Test Automation Scrum Semiconductors Databases Remote Device Management Embedded Linux Unix ICONIX Mobile Device Management Android Open Source Licensing Internet of Things See 27+     See less Skills  Software Engineering Software Development Software Design Embedded Systems System Architecture Perl Systems Engineering C++ Testing Distributed Systems Agile Methodologies Web Services Java Product Management Architecture C C# Requirements Analysis Product Development Technical Leadership Enterprise Software .NET JavaScript Engineering Management Intel Visual Studio Programming Computer Architecture Web Applications Software Project... Test Automation Scrum Semiconductors Databases Remote Device Management Embedded Linux Unix ICONIX Mobile Device Management Android Open Source Licensing Internet of Things See 27+     See less Software Engineering Software Development Software Design Embedded Systems System Architecture Perl Systems Engineering C++ Testing Distributed Systems Agile Methodologies Web Services Java Product Management Architecture C C# Requirements Analysis Product Development Technical Leadership Enterprise Software .NET JavaScript Engineering Management Intel Visual Studio Programming Computer Architecture Web Applications Software Project... Test Automation Scrum Semiconductors Databases Remote Device Management Embedded Linux Unix ICONIX Mobile Device Management Android Open Source Licensing Internet of Things See 27+     See less Software Engineering Software Development Software Design Embedded Systems System Architecture Perl Systems Engineering C++ Testing Distributed Systems Agile Methodologies Web Services Java Product Management Architecture C C# Requirements Analysis Product Development Technical Leadership Enterprise Software .NET JavaScript Engineering Management Intel Visual Studio Programming Computer Architecture Web Applications Software Project... Test Automation Scrum Semiconductors Databases Remote Device Management Embedded Linux Unix ICONIX Mobile Device Management Android Open Source Licensing Internet of Things See 27+     See less Education Rochester Institute of Technology MS,  Computer Science State University of New York College at Geneseo BA,  Mathematics Summa Cum Laude Honors Graduate \nComputer Science Minor Rochester Institute of Technology MS,  Computer Science Rochester Institute of Technology MS,  Computer Science Rochester Institute of Technology MS,  Computer Science State University of New York College at Geneseo BA,  Mathematics Summa Cum Laude Honors Graduate \nComputer Science Minor State University of New York College at Geneseo BA,  Mathematics Summa Cum Laude Honors Graduate \nComputer Science Minor State University of New York College at Geneseo BA,  Mathematics Summa Cum Laude Honors Graduate \nComputer Science Minor Honors & Awards Additional Honors & Awards Patent #\tTitle \n7,730,473 Relieving data marshalling overhead  \n \n7, 917, 898 Methods and apparatus to provide a modular native method invocation system  \n \n7, 587, 712 End-to-end architecture for mobile client JIT processing on network infrastructure trusted servers  \n \n7, 428, 730 Software development environment  \n \n7, 133, 908 Metrics and status presentation system and method using persistent template-driven web objects  \n \n6, 829, 630 Mechanisms for web-object event/state-driven communication between networked devices Additional Honors & Awards Patent #\tTitle \n7,730,473 Relieving data marshalling overhead  \n \n7, 917, 898 Methods and apparatus to provide a modular native method invocation system  \n \n7, 587, 712 End-to-end architecture for mobile client JIT processing on network infrastructure trusted servers  \n \n7, 428, 730 Software development environment  \n \n7, 133, 908 Metrics and status presentation system and method using persistent template-driven web objects  \n \n6, 829, 630 Mechanisms for web-object event/state-driven communication between networked devices Additional Honors & Awards Patent #\tTitle \n7,730,473 Relieving data marshalling overhead  \n \n7, 917, 898 Methods and apparatus to provide a modular native method invocation system  \n \n7, 587, 712 End-to-end architecture for mobile client JIT processing on network infrastructure trusted servers  \n \n7, 428, 730 Software development environment  \n \n7, 133, 908 Metrics and status presentation system and method using persistent template-driven web objects  \n \n6, 829, 630 Mechanisms for web-object event/state-driven communication between networked devices Additional Honors & Awards Patent #\tTitle \n7,730,473 Relieving data marshalling overhead  \n \n7, 917, 898 Methods and apparatus to provide a modular native method invocation system  \n \n7, 587, 712 End-to-end architecture for mobile client JIT processing on network infrastructure trusted servers  \n \n7, 428, 730 Software development environment  \n \n7, 133, 908 Metrics and status presentation system and method using persistent template-driven web objects  \n \n6, 829, 630 Mechanisms for web-object event/state-driven communication between networked devices ", "Summary Software Solutions Architect / Senior Program Manager with 14 years of industry experience. Proficient in end-to-end Software Architecture & System Development Life Cycle (SDLC) including analysis, requirements management, solution architecture, design & development. Experience with a wide variety of verticals – Telecom, Media, consumer goods & Retail. Stanford Certified Project Manager (SCPM). \n \nProven Technical Leadership with software architecture, object oriented programming and development frameworks. Good understanding of Client/Server/Embedded Technologies, Big Data, IOT applying best practices in project management, systems engineering to complex projects worldwide. Capable Solutions Architect & Certified Stanford Project Manager. Proven skills in ISV ecosystem engagement & external customer/vendor/stakeholder management. Summary Software Solutions Architect / Senior Program Manager with 14 years of industry experience. Proficient in end-to-end Software Architecture & System Development Life Cycle (SDLC) including analysis, requirements management, solution architecture, design & development. Experience with a wide variety of verticals – Telecom, Media, consumer goods & Retail. Stanford Certified Project Manager (SCPM). \n \nProven Technical Leadership with software architecture, object oriented programming and development frameworks. Good understanding of Client/Server/Embedded Technologies, Big Data, IOT applying best practices in project management, systems engineering to complex projects worldwide. Capable Solutions Architect & Certified Stanford Project Manager. Proven skills in ISV ecosystem engagement & external customer/vendor/stakeholder management. Software Solutions Architect / Senior Program Manager with 14 years of industry experience. Proficient in end-to-end Software Architecture & System Development Life Cycle (SDLC) including analysis, requirements management, solution architecture, design & development. Experience with a wide variety of verticals – Telecom, Media, consumer goods & Retail. Stanford Certified Project Manager (SCPM). \n \nProven Technical Leadership with software architecture, object oriented programming and development frameworks. Good understanding of Client/Server/Embedded Technologies, Big Data, IOT applying best practices in project management, systems engineering to complex projects worldwide. Capable Solutions Architect & Certified Stanford Project Manager. Proven skills in ISV ecosystem engagement & external customer/vendor/stakeholder management. Software Solutions Architect / Senior Program Manager with 14 years of industry experience. Proficient in end-to-end Software Architecture & System Development Life Cycle (SDLC) including analysis, requirements management, solution architecture, design & development. Experience with a wide variety of verticals – Telecom, Media, consumer goods & Retail. Stanford Certified Project Manager (SCPM). \n \nProven Technical Leadership with software architecture, object oriented programming and development frameworks. Good understanding of Client/Server/Embedded Technologies, Big Data, IOT applying best practices in project management, systems engineering to complex projects worldwide. Capable Solutions Architect & Certified Stanford Project Manager. Proven skills in ISV ecosystem engagement & external customer/vendor/stakeholder management. Experience Software Solutions Architect Intel Corporation January 2015  – Present (8 months) San Francisco Bay Area Ecosystem Enabling, Design & Development of Industry solutions - Intel Software & Services Group Senior Systems Analyst / Software Architect AT&T June 2006  –  February 2008  (1 year 9 months) Greater Seattle Area Site Redesign of Cingular.com, ~60 million customers, making it easier for customers to shop for wireless service and manage their accounts online. World-class design with new levels of personalization for cingular.com ie. MyCingular - review, pay their bill, access phone, device tutorials; upgrade and more. \n \nTechnologies : ATG's Commerce framework, Redesign of B2C and B2B elements with ATG’s Out-of-box Commerce Droplets for displaying the categories, products, SKU info. Business Rules for OLAM and OCS flows implemented for Checkout flow, shopping cart. ATG 2006.3 , DAS 6.3, Dynamo Commerce Server , DSP tag libraries , Oracle 10g , SVN , Eclipse 3.1, Jdk 1.4 , ATG Content Administration(CA), Interwoven Teamsite. Architect / Systems Analyst The Walt Disney Company February 2006  –  June 2006  (5 months) Greater Los Angeles Area The Zeus program was a global strategic initiative, launched by Disney’s TV distribution business, to address a number of process and systems issues that were adversely affecting existing customer relationships and threatening future growth opportunities. \n \nRe-engineered systems for client, Inventory, Contract Management. Zeus is a web-based, multi-tiered application built using J2EE technologies. Designed, developed ATG SQL repositories for different financial modules and optimized performance with analysis and testing of key features.  \n \nTechnologies : ATG 7.0 (DAS, DPS, DSS), IBM WebSphere 4.0.4, Eclipse, iPlanet 4.1, DB2 UDB v7.2, WebMethods ES 5.0.1,IS 4.6, TN 4.6, SAP R/3, SiteMinder policy server, Cognos ReportNet, Solaris 8,Ant, UML, Together 5.02, Junit, Bugzilla, JavaScript and XML. Project Manager / Software Architect Atos Origin September 1996  –  December 2005  (9 years 4 months) Mumbai India, Maastricht Netherlands Atos Origin Consultant at Procter & Gamble: P&G had more than 50 websites for publishing Baby Care and Health Care product info across the US, Europe and Asian peninsula hosted on pampers.com. P&G also had dozen websites for publishing articles relating to fem-care and Health Care products hosted on beinggirl.com. Schools program web site was launched by P&G for schoolteachers and students (aboutyou.info) in US and France. \n \nTechnologies : Teamsite, DoubleClick. Application developed using ATG repository & personalization. Most content was designed using Teamsite and a few sites use XML repository. Class and Sequence Diagram using UML. Database schema and objects. ATG components (Droplet, Formhandler, Servlet Pipeline, repository). User Registration and Login functionality extending ATG ProfileFormHandler feature. JHTML pages. ATG Dynamo 4.5 & 6.0, Oracle 8i, JHTML, Interwoven Teamsite, DoubleClick., UNIX, Eclipse, Windows \n \nDevelopment and maintenance projects. Millenium code fixes & related compliance in source code of 1.8m including Cobol, Abap programs & JCL accessing IMS database. Customers included Philip Morris, Society General, Ericsson, DSM, ABP, Unilever, ING and ABN Amro banks  \n \nTechnologies : Intershop (Application Server), Perl, Oracle, UNIX, VJ++, KAVA, Oracle. DB2, CICS, CSP, IMS , DB2 database, LIDA, Multi-Edit, MS Access, Visual Basic, MF Workbench Software Programmer CT&T - Ministry of Science & Technology March 1994  –  August 1996  (2 years 6 months) Trivandrum India Electronics Research & Development Center Trivandrum India: On-line credit system. The front-end used CICS and the application designed using COBOL & JCL accessing DB2 database. Requirements mgmt, App & DB design, Programming, testing using DB2, CICS, CSP, COBOL. \n \nCT&T, Trivandrum, India: CT&T is an undertaking of Ministry of Science and Technology of Government of India. Developed software for government organizations and also provided training to government employees to acquaint them to different software packages. Conducted training on COBOL, C, Pascal and Operating systems. Software Solutions Architect Intel Corporation January 2015  – Present (8 months) San Francisco Bay Area Ecosystem Enabling, Design & Development of Industry solutions - Intel Software & Services Group Software Solutions Architect Intel Corporation January 2015  – Present (8 months) San Francisco Bay Area Ecosystem Enabling, Design & Development of Industry solutions - Intel Software & Services Group Senior Systems Analyst / Software Architect AT&T June 2006  –  February 2008  (1 year 9 months) Greater Seattle Area Site Redesign of Cingular.com, ~60 million customers, making it easier for customers to shop for wireless service and manage their accounts online. World-class design with new levels of personalization for cingular.com ie. MyCingular - review, pay their bill, access phone, device tutorials; upgrade and more. \n \nTechnologies : ATG's Commerce framework, Redesign of B2C and B2B elements with ATG’s Out-of-box Commerce Droplets for displaying the categories, products, SKU info. Business Rules for OLAM and OCS flows implemented for Checkout flow, shopping cart. ATG 2006.3 , DAS 6.3, Dynamo Commerce Server , DSP tag libraries , Oracle 10g , SVN , Eclipse 3.1, Jdk 1.4 , ATG Content Administration(CA), Interwoven Teamsite. Senior Systems Analyst / Software Architect AT&T June 2006  –  February 2008  (1 year 9 months) Greater Seattle Area Site Redesign of Cingular.com, ~60 million customers, making it easier for customers to shop for wireless service and manage their accounts online. World-class design with new levels of personalization for cingular.com ie. MyCingular - review, pay their bill, access phone, device tutorials; upgrade and more. \n \nTechnologies : ATG's Commerce framework, Redesign of B2C and B2B elements with ATG’s Out-of-box Commerce Droplets for displaying the categories, products, SKU info. Business Rules for OLAM and OCS flows implemented for Checkout flow, shopping cart. ATG 2006.3 , DAS 6.3, Dynamo Commerce Server , DSP tag libraries , Oracle 10g , SVN , Eclipse 3.1, Jdk 1.4 , ATG Content Administration(CA), Interwoven Teamsite. Architect / Systems Analyst The Walt Disney Company February 2006  –  June 2006  (5 months) Greater Los Angeles Area The Zeus program was a global strategic initiative, launched by Disney’s TV distribution business, to address a number of process and systems issues that were adversely affecting existing customer relationships and threatening future growth opportunities. \n \nRe-engineered systems for client, Inventory, Contract Management. Zeus is a web-based, multi-tiered application built using J2EE technologies. Designed, developed ATG SQL repositories for different financial modules and optimized performance with analysis and testing of key features.  \n \nTechnologies : ATG 7.0 (DAS, DPS, DSS), IBM WebSphere 4.0.4, Eclipse, iPlanet 4.1, DB2 UDB v7.2, WebMethods ES 5.0.1,IS 4.6, TN 4.6, SAP R/3, SiteMinder policy server, Cognos ReportNet, Solaris 8,Ant, UML, Together 5.02, Junit, Bugzilla, JavaScript and XML. Architect / Systems Analyst The Walt Disney Company February 2006  –  June 2006  (5 months) Greater Los Angeles Area The Zeus program was a global strategic initiative, launched by Disney’s TV distribution business, to address a number of process and systems issues that were adversely affecting existing customer relationships and threatening future growth opportunities. \n \nRe-engineered systems for client, Inventory, Contract Management. Zeus is a web-based, multi-tiered application built using J2EE technologies. Designed, developed ATG SQL repositories for different financial modules and optimized performance with analysis and testing of key features.  \n \nTechnologies : ATG 7.0 (DAS, DPS, DSS), IBM WebSphere 4.0.4, Eclipse, iPlanet 4.1, DB2 UDB v7.2, WebMethods ES 5.0.1,IS 4.6, TN 4.6, SAP R/3, SiteMinder policy server, Cognos ReportNet, Solaris 8,Ant, UML, Together 5.02, Junit, Bugzilla, JavaScript and XML. Project Manager / Software Architect Atos Origin September 1996  –  December 2005  (9 years 4 months) Mumbai India, Maastricht Netherlands Atos Origin Consultant at Procter & Gamble: P&G had more than 50 websites for publishing Baby Care and Health Care product info across the US, Europe and Asian peninsula hosted on pampers.com. P&G also had dozen websites for publishing articles relating to fem-care and Health Care products hosted on beinggirl.com. Schools program web site was launched by P&G for schoolteachers and students (aboutyou.info) in US and France. \n \nTechnologies : Teamsite, DoubleClick. Application developed using ATG repository & personalization. Most content was designed using Teamsite and a few sites use XML repository. Class and Sequence Diagram using UML. Database schema and objects. ATG components (Droplet, Formhandler, Servlet Pipeline, repository). User Registration and Login functionality extending ATG ProfileFormHandler feature. JHTML pages. ATG Dynamo 4.5 & 6.0, Oracle 8i, JHTML, Interwoven Teamsite, DoubleClick., UNIX, Eclipse, Windows \n \nDevelopment and maintenance projects. Millenium code fixes & related compliance in source code of 1.8m including Cobol, Abap programs & JCL accessing IMS database. Customers included Philip Morris, Society General, Ericsson, DSM, ABP, Unilever, ING and ABN Amro banks  \n \nTechnologies : Intershop (Application Server), Perl, Oracle, UNIX, VJ++, KAVA, Oracle. DB2, CICS, CSP, IMS , DB2 database, LIDA, Multi-Edit, MS Access, Visual Basic, MF Workbench Project Manager / Software Architect Atos Origin September 1996  –  December 2005  (9 years 4 months) Mumbai India, Maastricht Netherlands Atos Origin Consultant at Procter & Gamble: P&G had more than 50 websites for publishing Baby Care and Health Care product info across the US, Europe and Asian peninsula hosted on pampers.com. P&G also had dozen websites for publishing articles relating to fem-care and Health Care products hosted on beinggirl.com. Schools program web site was launched by P&G for schoolteachers and students (aboutyou.info) in US and France. \n \nTechnologies : Teamsite, DoubleClick. Application developed using ATG repository & personalization. Most content was designed using Teamsite and a few sites use XML repository. Class and Sequence Diagram using UML. Database schema and objects. ATG components (Droplet, Formhandler, Servlet Pipeline, repository). User Registration and Login functionality extending ATG ProfileFormHandler feature. JHTML pages. ATG Dynamo 4.5 & 6.0, Oracle 8i, JHTML, Interwoven Teamsite, DoubleClick., UNIX, Eclipse, Windows \n \nDevelopment and maintenance projects. Millenium code fixes & related compliance in source code of 1.8m including Cobol, Abap programs & JCL accessing IMS database. Customers included Philip Morris, Society General, Ericsson, DSM, ABP, Unilever, ING and ABN Amro banks  \n \nTechnologies : Intershop (Application Server), Perl, Oracle, UNIX, VJ++, KAVA, Oracle. DB2, CICS, CSP, IMS , DB2 database, LIDA, Multi-Edit, MS Access, Visual Basic, MF Workbench Software Programmer CT&T - Ministry of Science & Technology March 1994  –  August 1996  (2 years 6 months) Trivandrum India Electronics Research & Development Center Trivandrum India: On-line credit system. The front-end used CICS and the application designed using COBOL & JCL accessing DB2 database. Requirements mgmt, App & DB design, Programming, testing using DB2, CICS, CSP, COBOL. \n \nCT&T, Trivandrum, India: CT&T is an undertaking of Ministry of Science and Technology of Government of India. Developed software for government organizations and also provided training to government employees to acquaint them to different software packages. Conducted training on COBOL, C, Pascal and Operating systems. Software Programmer CT&T - Ministry of Science & Technology March 1994  –  August 1996  (2 years 6 months) Trivandrum India Electronics Research & Development Center Trivandrum India: On-line credit system. The front-end used CICS and the application designed using COBOL & JCL accessing DB2 database. Requirements mgmt, App & DB design, Programming, testing using DB2, CICS, CSP, COBOL. \n \nCT&T, Trivandrum, India: CT&T is an undertaking of Ministry of Science and Technology of Government of India. Developed software for government organizations and also provided training to government employees to acquaint them to different software packages. Conducted training on COBOL, C, Pascal and Operating systems. Skills Software Project... Project Planning Project Management Systems Analysis Software Development Web Applications Information Architecture Scrum Requirements Analysis Requirements Management Skills  Software Project... Project Planning Project Management Systems Analysis Software Development Web Applications Information Architecture Scrum Requirements Analysis Requirements Management Software Project... Project Planning Project Management Systems Analysis Software Development Web Applications Information Architecture Scrum Requirements Analysis Requirements Management Software Project... Project Planning Project Management Systems Analysis Software Development Web Applications Information Architecture Scrum Requirements Analysis Requirements Management Education Stanford University Stanford Certified Project Manager (SCPM),  Advanced Project Management 2012  – 2014 Converting Strategy into Action, Executing complex programs, Leadership for strategic execution, Managing without Authority, Leading Effective teams, Leading change from the middle. Electronics Research & Development Center IBM Mainframe Certification 1996  – 1996 NCVT - National Council for vocational training Postgraduate Diploma,  Computer Science & Applications 1991  – 1993 University of Kerala Bachelor's degree,  Economics 1988  – 1991 Stanford University Stanford Certified Project Manager (SCPM),  Advanced Project Management 2012  – 2014 Converting Strategy into Action, Executing complex programs, Leadership for strategic execution, Managing without Authority, Leading Effective teams, Leading change from the middle. Stanford University Stanford Certified Project Manager (SCPM),  Advanced Project Management 2012  – 2014 Converting Strategy into Action, Executing complex programs, Leadership for strategic execution, Managing without Authority, Leading Effective teams, Leading change from the middle. Stanford University Stanford Certified Project Manager (SCPM),  Advanced Project Management 2012  – 2014 Converting Strategy into Action, Executing complex programs, Leadership for strategic execution, Managing without Authority, Leading Effective teams, Leading change from the middle. Electronics Research & Development Center IBM Mainframe Certification 1996  – 1996 Electronics Research & Development Center IBM Mainframe Certification 1996  – 1996 Electronics Research & Development Center IBM Mainframe Certification 1996  – 1996 NCVT - National Council for vocational training Postgraduate Diploma,  Computer Science & Applications 1991  – 1993 NCVT - National Council for vocational training Postgraduate Diploma,  Computer Science & Applications 1991  – 1993 NCVT - National Council for vocational training Postgraduate Diploma,  Computer Science & Applications 1991  – 1993 University of Kerala Bachelor's degree,  Economics 1988  – 1991 University of Kerala Bachelor's degree,  Economics 1988  – 1991 University of Kerala Bachelor's degree,  Economics 1988  – 1991 "]}