{"position": "Staff Product Engineer", "company": "Intel Corporation", "profiles": ["Summary Over 20 years experience in semiconductor ICs, Solution Development System PC, Tablets, Smart Phones development, and Optical Networking Telecommunication, CPU development, Supplier Quality and Reliability Management, ISO 9000 Quality System. New Product quality and reliability management. Project management, ICs, Module Product Development leading teams, IC testing and manufacturing, fab processes, packaging and assembly, Semiconductor Chipset development, qualification, Global Resource Management, Budgeting, Strategic Planning, Purchasing, Team Building & Leadership, Process Improvement, Subcontractors Management, Customers Management, Risk Assessment, Requirements Analysis, Mentoring and coaching. \nI have been described by others as a \"thorough professional\" in new products development and management who is \"diligent, enthusiastic, self-directed and motivated\" with \"great attention to detail.\" Colleagues have recognized my ability in \"bridging and balancing the financial concerns of the company with technical and project management needs.\" \n \nColleagues have made these remarks because of the results I have been able to produce and as a result of the manner in which I went about producing them. I am an active listener and a good communicator across all organizational levels. \nI have honed my ability to identify and resolve what are perceived to be minor issues before they blossom into major problems. I have successfully infused my teams with this \"Always Strive For Success\" mentality that has helped achieve set goals for the project by making it clear about what is necessary versus what’s not, and make sure the people doing the work feel valued for the important things they are doing. \n \nSpecialties: Platform Systems Product Development, Microprocessor, Chipsets Product, Communications ICs, quality and reliability System, supplier quality management, techincal problem solving, project management, customer support, yield enhancement and Platform system validation. Summary Over 20 years experience in semiconductor ICs, Solution Development System PC, Tablets, Smart Phones development, and Optical Networking Telecommunication, CPU development, Supplier Quality and Reliability Management, ISO 9000 Quality System. New Product quality and reliability management. Project management, ICs, Module Product Development leading teams, IC testing and manufacturing, fab processes, packaging and assembly, Semiconductor Chipset development, qualification, Global Resource Management, Budgeting, Strategic Planning, Purchasing, Team Building & Leadership, Process Improvement, Subcontractors Management, Customers Management, Risk Assessment, Requirements Analysis, Mentoring and coaching. \nI have been described by others as a \"thorough professional\" in new products development and management who is \"diligent, enthusiastic, self-directed and motivated\" with \"great attention to detail.\" Colleagues have recognized my ability in \"bridging and balancing the financial concerns of the company with technical and project management needs.\" \n \nColleagues have made these remarks because of the results I have been able to produce and as a result of the manner in which I went about producing them. I am an active listener and a good communicator across all organizational levels. \nI have honed my ability to identify and resolve what are perceived to be minor issues before they blossom into major problems. I have successfully infused my teams with this \"Always Strive For Success\" mentality that has helped achieve set goals for the project by making it clear about what is necessary versus what’s not, and make sure the people doing the work feel valued for the important things they are doing. \n \nSpecialties: Platform Systems Product Development, Microprocessor, Chipsets Product, Communications ICs, quality and reliability System, supplier quality management, techincal problem solving, project management, customer support, yield enhancement and Platform system validation. Over 20 years experience in semiconductor ICs, Solution Development System PC, Tablets, Smart Phones development, and Optical Networking Telecommunication, CPU development, Supplier Quality and Reliability Management, ISO 9000 Quality System. New Product quality and reliability management. Project management, ICs, Module Product Development leading teams, IC testing and manufacturing, fab processes, packaging and assembly, Semiconductor Chipset development, qualification, Global Resource Management, Budgeting, Strategic Planning, Purchasing, Team Building & Leadership, Process Improvement, Subcontractors Management, Customers Management, Risk Assessment, Requirements Analysis, Mentoring and coaching. \nI have been described by others as a \"thorough professional\" in new products development and management who is \"diligent, enthusiastic, self-directed and motivated\" with \"great attention to detail.\" Colleagues have recognized my ability in \"bridging and balancing the financial concerns of the company with technical and project management needs.\" \n \nColleagues have made these remarks because of the results I have been able to produce and as a result of the manner in which I went about producing them. I am an active listener and a good communicator across all organizational levels. \nI have honed my ability to identify and resolve what are perceived to be minor issues before they blossom into major problems. I have successfully infused my teams with this \"Always Strive For Success\" mentality that has helped achieve set goals for the project by making it clear about what is necessary versus what’s not, and make sure the people doing the work feel valued for the important things they are doing. \n \nSpecialties: Platform Systems Product Development, Microprocessor, Chipsets Product, Communications ICs, quality and reliability System, supplier quality management, techincal problem solving, project management, customer support, yield enhancement and Platform system validation. Over 20 years experience in semiconductor ICs, Solution Development System PC, Tablets, Smart Phones development, and Optical Networking Telecommunication, CPU development, Supplier Quality and Reliability Management, ISO 9000 Quality System. New Product quality and reliability management. Project management, ICs, Module Product Development leading teams, IC testing and manufacturing, fab processes, packaging and assembly, Semiconductor Chipset development, qualification, Global Resource Management, Budgeting, Strategic Planning, Purchasing, Team Building & Leadership, Process Improvement, Subcontractors Management, Customers Management, Risk Assessment, Requirements Analysis, Mentoring and coaching. \nI have been described by others as a \"thorough professional\" in new products development and management who is \"diligent, enthusiastic, self-directed and motivated\" with \"great attention to detail.\" Colleagues have recognized my ability in \"bridging and balancing the financial concerns of the company with technical and project management needs.\" \n \nColleagues have made these remarks because of the results I have been able to produce and as a result of the manner in which I went about producing them. I am an active listener and a good communicator across all organizational levels. \nI have honed my ability to identify and resolve what are perceived to be minor issues before they blossom into major problems. I have successfully infused my teams with this \"Always Strive For Success\" mentality that has helped achieve set goals for the project by making it clear about what is necessary versus what’s not, and make sure the people doing the work feel valued for the important things they are doing. \n \nSpecialties: Platform Systems Product Development, Microprocessor, Chipsets Product, Communications ICs, quality and reliability System, supplier quality management, techincal problem solving, project management, customer support, yield enhancement and Platform system validation. Experience Staff Product Engineer - Mobile Devices Intel Corporation October 2013  – Present (1 year 11 months) Folsom, California Senior Staff Product Development Engineer Intel July 2008  – Present (7 years 2 months) Folsom, California Supplier Quality and Reliability Manager Intel 2000  –  2010  (10 years) Managed supplier in Asia, Europe and USA for Semiconductors IC components and module, ISO 9001 Quality System Development, Certified ISO9001 Lead Assessor. Suppliers/Subcontractors Quality System Management, supplier audit, Quality Process improvements Quality and Reliability Engineer Manager Intel October 1994  –  June 2008  (13 years 9 months) Managed Product Qualification acrorss global sites, supported new products qualification from concept to high volume manufactuiring, managed subcontractors and suppliers, qualified and certified new fab processes, packages, supported customers globally. Staff Product Engineer - Mobile Devices Intel Corporation October 2013  – Present (1 year 11 months) Folsom, California Staff Product Engineer - Mobile Devices Intel Corporation October 2013  – Present (1 year 11 months) Folsom, California Senior Staff Product Development Engineer Intel July 2008  – Present (7 years 2 months) Folsom, California Senior Staff Product Development Engineer Intel July 2008  – Present (7 years 2 months) Folsom, California Supplier Quality and Reliability Manager Intel 2000  –  2010  (10 years) Managed supplier in Asia, Europe and USA for Semiconductors IC components and module, ISO 9001 Quality System Development, Certified ISO9001 Lead Assessor. Suppliers/Subcontractors Quality System Management, supplier audit, Quality Process improvements Supplier Quality and Reliability Manager Intel 2000  –  2010  (10 years) Managed supplier in Asia, Europe and USA for Semiconductors IC components and module, ISO 9001 Quality System Development, Certified ISO9001 Lead Assessor. Suppliers/Subcontractors Quality System Management, supplier audit, Quality Process improvements Quality and Reliability Engineer Manager Intel October 1994  –  June 2008  (13 years 9 months) Managed Product Qualification acrorss global sites, supported new products qualification from concept to high volume manufactuiring, managed subcontractors and suppliers, qualified and certified new fab processes, packages, supported customers globally. Quality and Reliability Engineer Manager Intel October 1994  –  June 2008  (13 years 9 months) Managed Product Qualification acrorss global sites, supported new products qualification from concept to high volume manufactuiring, managed subcontractors and suppliers, qualified and certified new fab processes, packages, supported customers globally. Skills Semiconductors Testing Manufacturing IC Product Development Process Improvement Project Management Quality System Management Leadership Processors Telecommunications Strategic Planning Continuous Improvement Process Engineering Engineering Management Microprocessors Requirements Analysis Reliability Design of Experiments Semiconductor Industry Cross-functional Team... Quality Management Failure Analysis SPC Intel Product Engineering CMOS Silicon DFT ASIC Mixed Signal JMP Electronics SoC Thin Films See 21+     See less Skills  Semiconductors Testing Manufacturing IC Product Development Process Improvement Project Management Quality System Management Leadership Processors Telecommunications Strategic Planning Continuous Improvement Process Engineering Engineering Management Microprocessors Requirements Analysis Reliability Design of Experiments Semiconductor Industry Cross-functional Team... Quality Management Failure Analysis SPC Intel Product Engineering CMOS Silicon DFT ASIC Mixed Signal JMP Electronics SoC Thin Films See 21+     See less Semiconductors Testing Manufacturing IC Product Development Process Improvement Project Management Quality System Management Leadership Processors Telecommunications Strategic Planning Continuous Improvement Process Engineering Engineering Management Microprocessors Requirements Analysis Reliability Design of Experiments Semiconductor Industry Cross-functional Team... Quality Management Failure Analysis SPC Intel Product Engineering CMOS Silicon DFT ASIC Mixed Signal JMP Electronics SoC Thin Films See 21+     See less Semiconductors Testing Manufacturing IC Product Development Process Improvement Project Management Quality System Management Leadership Processors Telecommunications Strategic Planning Continuous Improvement Process Engineering Engineering Management Microprocessors Requirements Analysis Reliability Design of Experiments Semiconductor Industry Cross-functional Team... Quality Management Failure Analysis SPC Intel Product Engineering CMOS Silicon DFT ASIC Mixed Signal JMP Electronics SoC Thin Films See 21+     See less ", "Experience Senior Product Development Engineer Intel Corporation April 2012  – Present (3 years 5 months) Senior Probe Engineer IM Flash Technologies March 2008  –  April 2012  (4 years 2 months) Lehi, UT Probe Engineer MTI June 2003  –  March 2008  (4 years 10 months) Senior Product Development Engineer Intel Corporation April 2012  – Present (3 years 5 months) Senior Product Development Engineer Intel Corporation April 2012  – Present (3 years 5 months) Senior Probe Engineer IM Flash Technologies March 2008  –  April 2012  (4 years 2 months) Lehi, UT Senior Probe Engineer IM Flash Technologies March 2008  –  April 2012  (4 years 2 months) Lehi, UT Probe Engineer MTI June 2003  –  March 2008  (4 years 10 months) Probe Engineer MTI June 2003  –  March 2008  (4 years 10 months) Skills Product Engineering Failure Analysis Semiconductors IC CMOS Flash Memory Electronics Test Engineering Testing Root Cause Analysis Manufacturing Semiconductor Industry JMP Design of Experiments SPC Skills  Product Engineering Failure Analysis Semiconductors IC CMOS Flash Memory Electronics Test Engineering Testing Root Cause Analysis Manufacturing Semiconductor Industry JMP Design of Experiments SPC Product Engineering Failure Analysis Semiconductors IC CMOS Flash Memory Electronics Test Engineering Testing Root Cause Analysis Manufacturing Semiconductor Industry JMP Design of Experiments SPC Product Engineering Failure Analysis Semiconductors IC CMOS Flash Memory Electronics Test Engineering Testing Root Cause Analysis Manufacturing Semiconductor Industry JMP Design of Experiments SPC Education AMA University Bachelor of Science (B.S.),  Computer Engineering 1989  – 1993 AMA University Bachelor of Science (B.S.),  Computer Engineering 1989  – 1993 AMA University Bachelor of Science (B.S.),  Computer Engineering 1989  – 1993 AMA University Bachelor of Science (B.S.),  Computer Engineering 1989  – 1993 ", "Summary I am a product engineer with extensive experience in communication, computer, and other high tech industries, and most recently worked for a major semiconductor company. I have expertise in digital signal processors, memory devices, lasers, system on a chip, and cell phone basebands. I excel in managing projects, setting priorities, coaching/mentoring, public speaking, and handling complaints. Additional strengths include leadership in product reliability and cost reduction, failure analysis, and managing cross functional teams. I am also recognized as the go-to-guy for data analysis. Summary I am a product engineer with extensive experience in communication, computer, and other high tech industries, and most recently worked for a major semiconductor company. I have expertise in digital signal processors, memory devices, lasers, system on a chip, and cell phone basebands. I excel in managing projects, setting priorities, coaching/mentoring, public speaking, and handling complaints. Additional strengths include leadership in product reliability and cost reduction, failure analysis, and managing cross functional teams. I am also recognized as the go-to-guy for data analysis. I am a product engineer with extensive experience in communication, computer, and other high tech industries, and most recently worked for a major semiconductor company. I have expertise in digital signal processors, memory devices, lasers, system on a chip, and cell phone basebands. I excel in managing projects, setting priorities, coaching/mentoring, public speaking, and handling complaints. Additional strengths include leadership in product reliability and cost reduction, failure analysis, and managing cross functional teams. I am also recognized as the go-to-guy for data analysis. I am a product engineer with extensive experience in communication, computer, and other high tech industries, and most recently worked for a major semiconductor company. I have expertise in digital signal processors, memory devices, lasers, system on a chip, and cell phone basebands. I excel in managing projects, setting priorities, coaching/mentoring, public speaking, and handling complaints. Additional strengths include leadership in product reliability and cost reduction, failure analysis, and managing cross functional teams. I am also recognized as the go-to-guy for data analysis. Experience Senior Staff Product Engineer Intel Corporation 2011  –  2012  (1 year) Allentown, PA Product Engineer Infineon/LSI/Agere 2006  –  2011  (5 years) Allentown, PA DMTS Product Engineer Agere 2002  –  2006  (4 years) Allentown, PA Laser Technologist Lucent Technologies 2000  –  2002  (2 years) Reading/Breinigsville, PA Product Engineer/Technologist AT&T/Lucent Technologies 1992  –  2000  (8 years) Orlando, FL Senior Staff Product Engineer Intel Corporation 2011  –  2012  (1 year) Allentown, PA Senior Staff Product Engineer Intel Corporation 2011  –  2012  (1 year) Allentown, PA Product Engineer Infineon/LSI/Agere 2006  –  2011  (5 years) Allentown, PA Product Engineer Infineon/LSI/Agere 2006  –  2011  (5 years) Allentown, PA DMTS Product Engineer Agere 2002  –  2006  (4 years) Allentown, PA DMTS Product Engineer Agere 2002  –  2006  (4 years) Allentown, PA Laser Technologist Lucent Technologies 2000  –  2002  (2 years) Reading/Breinigsville, PA Laser Technologist Lucent Technologies 2000  –  2002  (2 years) Reading/Breinigsville, PA Product Engineer/Technologist AT&T/Lucent Technologies 1992  –  2000  (8 years) Orlando, FL Product Engineer/Technologist AT&T/Lucent Technologies 1992  –  2000  (8 years) Orlando, FL ", "Skills Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less Skills  Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less Microprocessors Debugging Circuit Design Integrated Circuit... Verilog IC Microarchitecture VLSI VHDL FPGA Perl CMOS RTL design Logic Design SoC RTL Design See 1+     See less "]}