{"position": "Staffing Manager", "company": "Intel Corporation", "profiles": ["Languages French French French Skills Workforce Analytics Talent Management Performance Management Workforce Planning Program Management Big Data SAP HR PeopleSoft SAP BW Teradata MicroStrategy Reporting Cognos Employee Engagement Employee Benefits Leadership Development Recruiting Leadership Management HRIS Talent Acquisition Sourcing Human Resources Onboarding Applicant Tracking... See 9+     See less Skills  Workforce Analytics Talent Management Performance Management Workforce Planning Program Management Big Data SAP HR PeopleSoft SAP BW Teradata MicroStrategy Reporting Cognos Employee Engagement Employee Benefits Leadership Development Recruiting Leadership Management HRIS Talent Acquisition Sourcing Human Resources Onboarding Applicant Tracking... See 9+     See less Workforce Analytics Talent Management Performance Management Workforce Planning Program Management Big Data SAP HR PeopleSoft SAP BW Teradata MicroStrategy Reporting Cognos Employee Engagement Employee Benefits Leadership Development Recruiting Leadership Management HRIS Talent Acquisition Sourcing Human Resources Onboarding Applicant Tracking... See 9+     See less Workforce Analytics Talent Management Performance Management Workforce Planning Program Management Big Data SAP HR PeopleSoft SAP BW Teradata MicroStrategy Reporting Cognos Employee Engagement Employee Benefits Leadership Development Recruiting Leadership Management HRIS Talent Acquisition Sourcing Human Resources Onboarding Applicant Tracking... See 9+     See less ", "Summary Human resources professional with significant corporate leadership experience in various industries including technology, consumer products, entertainment, commercial aviation, educational assessment, financial services, global consulting, chemicals and forest products. Served as corporate officer of $100 millIon growth business, and built staff and talent capabilities in highly successful division of internationally known firm with 45% compounded annual growth rate. Summary Human resources professional with significant corporate leadership experience in various industries including technology, consumer products, entertainment, commercial aviation, educational assessment, financial services, global consulting, chemicals and forest products. Served as corporate officer of $100 millIon growth business, and built staff and talent capabilities in highly successful division of internationally known firm with 45% compounded annual growth rate. Human resources professional with significant corporate leadership experience in various industries including technology, consumer products, entertainment, commercial aviation, educational assessment, financial services, global consulting, chemicals and forest products. Served as corporate officer of $100 millIon growth business, and built staff and talent capabilities in highly successful division of internationally known firm with 45% compounded annual growth rate. Human resources professional with significant corporate leadership experience in various industries including technology, consumer products, entertainment, commercial aviation, educational assessment, financial services, global consulting, chemicals and forest products. Served as corporate officer of $100 millIon growth business, and built staff and talent capabilities in highly successful division of internationally known firm with 45% compounded annual growth rate. Experience Coaching Services Northwest Evaluation Association 2014  – Present (1 year) Portland, Oregon Area Personal development and career coaching services for staff of educational assessment firm. Assist colleagues as they begin personal growth path toward more rewarding individual work and personal goals. Help each person create a meaningful, action-based approach to achieve new insights and plans for moving ahead. Director of Human Resources Northwest Evaluation Association 2011  –  2014  (3 years) Portland, OR Broad ranging HR responsibilities, including employee relations, broad-based compensation, employee benefits, HR information systems, payroll and related activities for national not-for-profit educational services organization. Manage team supporting both headquartered employee population as well as regional offices and remotely-based employees. \n \nSignificant projects included: moved employee health plan to self-funded from insured model; changed defined contribution plans to new platform (Transamerica) vendor; built new deferred compensation plans; installed new HR management system (Oracle SAAS); refined employee benefits offerings. \n \nRetired 2014. Principal/Senior Consultant Mercer 2002  –  2010  (8 years) Pacific Northwest USA Client Relationship Manager. Responsible for developing both new and existing business opportunities with clients and prospects located throughout the Pacific Northwest. Built client base consistently in both number and scope of work provided. Extensive work in health & benefits, retirement, human capital, outsourcing, HR data services and international HR for both domestic and globally-based clients. Annual sales goals in excess of $1.5 million, and managed $5 million+ existing annual business volume. Corporate Group Staffing Manager Intel Corporation 2001  –  2001  (less than a year) Folsom CA/Hillsboro OR Managed team of twenty U.S. and international staffing specialists responsible for corporate and affiliated businesses (Intel Capital, etc). Worked closely with senior executives and strategic staffing planning colleagues to build critical skills scenarios during period of reduced business volumes. SVP & Chief Administrative Officer Gardenburger, Inc. 1997  –  2000  (3 years) Wide-ranging functions in rapidly growing consumer products foods business, including human resources, investor relations, legal affairs, IT, administrative services, facilities and related activities. Also served as Corporate Secretary and Treasurer. Built successful HR services capacity during period of new manufacturing facility introduction utilizing high-performance team concepts, and collaborated with other leadership team as business model led to eventual sale of the company. HR Business Partner (Consultant) Tektronix/Grass Valley Group 1995  –  1997  (2 years) Member of management team involved in turning around business unit undergoing signficant employee and product change. Helped redirect workforce toward new business model and stemmed large turnover issue; also assisted in correcting MRP cost issue, helping improve business bottom line. Vice President, Human Resources Charles Schwab & Company 1993  –  1995  (2 years) Provided broad HR services through 15-person team to over 3,000 financial staff in more than 225 offices in the U.S. and Canada. Director, Human Resources, Disney Consumer Products The Walt Disney Company 1990  –  1993  (3 years) Started up and led first HR function within the business group. Staffed 15-person global team supporting over 2,000 employees operating in over 30 countries. Significant growth of business created need for over 1,600 new hires during my tenure, along with opening offices in nearly 25 new countries. Full range of HR activities, including talent management, OD/OE, international personnel, staffing, employee relations, relocation, training, M&A and related servcies. Managing Principal The Walters Shipp Group, Inc 1986  –  1990  (4 years) Pacific Northwest, USA Developed one of the earliest human resource consulting practices in the Northwest, with services centered in Oregon and Washington. Worked with a variety of industries, providing senior-level HR strategy and tactical services to both small, start-up organizations as well as larger, established Fortune 1000 size firms. Regarded as excellent resource for variety of functions, including talent management and staffing, organizational development, compensation services, benefits strategy and plans, employee relations, affirmative action and organizational effectiveness. Corporate Manager, Flight Officer Staffing United Airlines 1985  –  1986  (1 year) Denver, CO Led the recruitment and hiring of all pilots duirng a period of rapid organizational growth (first-time service to all 50 states, acqusition of Pan Am Pacific routes). FY employment of almost 1,000 new flight officers accomplished on time and within targeted budget. Development of more sophisticated pilot selection parameters and improvement in FAA airmen records screening process. Managed staffing team of 15 professionals and support personnel at the Denver Flight Training Center. Manager, Human Resources, Pulp & Paper Division Crown Zellerbach Corporation 1984  –  1985  (1 year) Portland, Oregon Area Provided human resources support to nine West coast operating pulp and paper mill operations' HR teams, including significant talent management/recruiting and training services. Augmented mill teams when capacity requirements dictated additional assistance. Participated in division-wide HR planning councils. Manager, Technical and Professional Staffing Crown Zellerbach Corporation 1976  –  1985  (9 years) San Francisco, California and Portland, Oregon Supported all divisions (pulp & paper, timber & wood products, corrugated packaging, flexible packaging, research & developmemnt, corporate engineering and all field professional staff services), initially in S.F. and subsequently in Portland, of $3 billion Fortune 500 firm. Managed annual hiring averaging 100-150 professional and technical staff, including extensive national college relations program. Collaborated with senior leaders to develop human capital budget.  \n \nCompany bought out in hostile takeover in summer 1985. Coaching Services Northwest Evaluation Association 2014  – Present (1 year) Portland, Oregon Area Personal development and career coaching services for staff of educational assessment firm. Assist colleagues as they begin personal growth path toward more rewarding individual work and personal goals. Help each person create a meaningful, action-based approach to achieve new insights and plans for moving ahead. Coaching Services Northwest Evaluation Association 2014  – Present (1 year) Portland, Oregon Area Personal development and career coaching services for staff of educational assessment firm. Assist colleagues as they begin personal growth path toward more rewarding individual work and personal goals. Help each person create a meaningful, action-based approach to achieve new insights and plans for moving ahead. Director of Human Resources Northwest Evaluation Association 2011  –  2014  (3 years) Portland, OR Broad ranging HR responsibilities, including employee relations, broad-based compensation, employee benefits, HR information systems, payroll and related activities for national not-for-profit educational services organization. Manage team supporting both headquartered employee population as well as regional offices and remotely-based employees. \n \nSignificant projects included: moved employee health plan to self-funded from insured model; changed defined contribution plans to new platform (Transamerica) vendor; built new deferred compensation plans; installed new HR management system (Oracle SAAS); refined employee benefits offerings. \n \nRetired 2014. Director of Human Resources Northwest Evaluation Association 2011  –  2014  (3 years) Portland, OR Broad ranging HR responsibilities, including employee relations, broad-based compensation, employee benefits, HR information systems, payroll and related activities for national not-for-profit educational services organization. Manage team supporting both headquartered employee population as well as regional offices and remotely-based employees. \n \nSignificant projects included: moved employee health plan to self-funded from insured model; changed defined contribution plans to new platform (Transamerica) vendor; built new deferred compensation plans; installed new HR management system (Oracle SAAS); refined employee benefits offerings. \n \nRetired 2014. Principal/Senior Consultant Mercer 2002  –  2010  (8 years) Pacific Northwest USA Client Relationship Manager. Responsible for developing both new and existing business opportunities with clients and prospects located throughout the Pacific Northwest. Built client base consistently in both number and scope of work provided. Extensive work in health & benefits, retirement, human capital, outsourcing, HR data services and international HR for both domestic and globally-based clients. Annual sales goals in excess of $1.5 million, and managed $5 million+ existing annual business volume. Principal/Senior Consultant Mercer 2002  –  2010  (8 years) Pacific Northwest USA Client Relationship Manager. Responsible for developing both new and existing business opportunities with clients and prospects located throughout the Pacific Northwest. Built client base consistently in both number and scope of work provided. Extensive work in health & benefits, retirement, human capital, outsourcing, HR data services and international HR for both domestic and globally-based clients. Annual sales goals in excess of $1.5 million, and managed $5 million+ existing annual business volume. Corporate Group Staffing Manager Intel Corporation 2001  –  2001  (less than a year) Folsom CA/Hillsboro OR Managed team of twenty U.S. and international staffing specialists responsible for corporate and affiliated businesses (Intel Capital, etc). Worked closely with senior executives and strategic staffing planning colleagues to build critical skills scenarios during period of reduced business volumes. Corporate Group Staffing Manager Intel Corporation 2001  –  2001  (less than a year) Folsom CA/Hillsboro OR Managed team of twenty U.S. and international staffing specialists responsible for corporate and affiliated businesses (Intel Capital, etc). Worked closely with senior executives and strategic staffing planning colleagues to build critical skills scenarios during period of reduced business volumes. SVP & Chief Administrative Officer Gardenburger, Inc. 1997  –  2000  (3 years) Wide-ranging functions in rapidly growing consumer products foods business, including human resources, investor relations, legal affairs, IT, administrative services, facilities and related activities. Also served as Corporate Secretary and Treasurer. Built successful HR services capacity during period of new manufacturing facility introduction utilizing high-performance team concepts, and collaborated with other leadership team as business model led to eventual sale of the company. SVP & Chief Administrative Officer Gardenburger, Inc. 1997  –  2000  (3 years) Wide-ranging functions in rapidly growing consumer products foods business, including human resources, investor relations, legal affairs, IT, administrative services, facilities and related activities. Also served as Corporate Secretary and Treasurer. Built successful HR services capacity during period of new manufacturing facility introduction utilizing high-performance team concepts, and collaborated with other leadership team as business model led to eventual sale of the company. HR Business Partner (Consultant) Tektronix/Grass Valley Group 1995  –  1997  (2 years) Member of management team involved in turning around business unit undergoing signficant employee and product change. Helped redirect workforce toward new business model and stemmed large turnover issue; also assisted in correcting MRP cost issue, helping improve business bottom line. HR Business Partner (Consultant) Tektronix/Grass Valley Group 1995  –  1997  (2 years) Member of management team involved in turning around business unit undergoing signficant employee and product change. Helped redirect workforce toward new business model and stemmed large turnover issue; also assisted in correcting MRP cost issue, helping improve business bottom line. Vice President, Human Resources Charles Schwab & Company 1993  –  1995  (2 years) Provided broad HR services through 15-person team to over 3,000 financial staff in more than 225 offices in the U.S. and Canada. Vice President, Human Resources Charles Schwab & Company 1993  –  1995  (2 years) Provided broad HR services through 15-person team to over 3,000 financial staff in more than 225 offices in the U.S. and Canada. Director, Human Resources, Disney Consumer Products The Walt Disney Company 1990  –  1993  (3 years) Started up and led first HR function within the business group. Staffed 15-person global team supporting over 2,000 employees operating in over 30 countries. Significant growth of business created need for over 1,600 new hires during my tenure, along with opening offices in nearly 25 new countries. Full range of HR activities, including talent management, OD/OE, international personnel, staffing, employee relations, relocation, training, M&A and related servcies. Director, Human Resources, Disney Consumer Products The Walt Disney Company 1990  –  1993  (3 years) Started up and led first HR function within the business group. Staffed 15-person global team supporting over 2,000 employees operating in over 30 countries. Significant growth of business created need for over 1,600 new hires during my tenure, along with opening offices in nearly 25 new countries. Full range of HR activities, including talent management, OD/OE, international personnel, staffing, employee relations, relocation, training, M&A and related servcies. Managing Principal The Walters Shipp Group, Inc 1986  –  1990  (4 years) Pacific Northwest, USA Developed one of the earliest human resource consulting practices in the Northwest, with services centered in Oregon and Washington. Worked with a variety of industries, providing senior-level HR strategy and tactical services to both small, start-up organizations as well as larger, established Fortune 1000 size firms. Regarded as excellent resource for variety of functions, including talent management and staffing, organizational development, compensation services, benefits strategy and plans, employee relations, affirmative action and organizational effectiveness. Managing Principal The Walters Shipp Group, Inc 1986  –  1990  (4 years) Pacific Northwest, USA Developed one of the earliest human resource consulting practices in the Northwest, with services centered in Oregon and Washington. Worked with a variety of industries, providing senior-level HR strategy and tactical services to both small, start-up organizations as well as larger, established Fortune 1000 size firms. Regarded as excellent resource for variety of functions, including talent management and staffing, organizational development, compensation services, benefits strategy and plans, employee relations, affirmative action and organizational effectiveness. Corporate Manager, Flight Officer Staffing United Airlines 1985  –  1986  (1 year) Denver, CO Led the recruitment and hiring of all pilots duirng a period of rapid organizational growth (first-time service to all 50 states, acqusition of Pan Am Pacific routes). FY employment of almost 1,000 new flight officers accomplished on time and within targeted budget. Development of more sophisticated pilot selection parameters and improvement in FAA airmen records screening process. Managed staffing team of 15 professionals and support personnel at the Denver Flight Training Center. Corporate Manager, Flight Officer Staffing United Airlines 1985  –  1986  (1 year) Denver, CO Led the recruitment and hiring of all pilots duirng a period of rapid organizational growth (first-time service to all 50 states, acqusition of Pan Am Pacific routes). FY employment of almost 1,000 new flight officers accomplished on time and within targeted budget. Development of more sophisticated pilot selection parameters and improvement in FAA airmen records screening process. Managed staffing team of 15 professionals and support personnel at the Denver Flight Training Center. Manager, Human Resources, Pulp & Paper Division Crown Zellerbach Corporation 1984  –  1985  (1 year) Portland, Oregon Area Provided human resources support to nine West coast operating pulp and paper mill operations' HR teams, including significant talent management/recruiting and training services. Augmented mill teams when capacity requirements dictated additional assistance. Participated in division-wide HR planning councils. Manager, Human Resources, Pulp & Paper Division Crown Zellerbach Corporation 1984  –  1985  (1 year) Portland, Oregon Area Provided human resources support to nine West coast operating pulp and paper mill operations' HR teams, including significant talent management/recruiting and training services. Augmented mill teams when capacity requirements dictated additional assistance. Participated in division-wide HR planning councils. Manager, Technical and Professional Staffing Crown Zellerbach Corporation 1976  –  1985  (9 years) San Francisco, California and Portland, Oregon Supported all divisions (pulp & paper, timber & wood products, corrugated packaging, flexible packaging, research & developmemnt, corporate engineering and all field professional staff services), initially in S.F. and subsequently in Portland, of $3 billion Fortune 500 firm. Managed annual hiring averaging 100-150 professional and technical staff, including extensive national college relations program. Collaborated with senior leaders to develop human capital budget.  \n \nCompany bought out in hostile takeover in summer 1985. Manager, Technical and Professional Staffing Crown Zellerbach Corporation 1976  –  1985  (9 years) San Francisco, California and Portland, Oregon Supported all divisions (pulp & paper, timber & wood products, corrugated packaging, flexible packaging, research & developmemnt, corporate engineering and all field professional staff services), initially in S.F. and subsequently in Portland, of $3 billion Fortune 500 firm. Managed annual hiring averaging 100-150 professional and technical staff, including extensive national college relations program. Collaborated with senior leaders to develop human capital budget.  \n \nCompany bought out in hostile takeover in summer 1985. Skills Performance Management Employee Relations Organizational... Deferred Compensation Leadership Development HRIS Human Resources Succession Planning Employee Engagement Employee Benefits Onboarding Executive Coaching Organizational Design Change Management Recruiting Benefits Administration Workforce Planning Talent Acquisition Coaching Applicant Tracking... CRM FMLA HR Policies Management Mergers  Organizational... Payroll Team Building Technical Recruiting Training Leadership See 16+     See less Skills  Performance Management Employee Relations Organizational... Deferred Compensation Leadership Development HRIS Human Resources Succession Planning Employee Engagement Employee Benefits Onboarding Executive Coaching Organizational Design Change Management Recruiting Benefits Administration Workforce Planning Talent Acquisition Coaching Applicant Tracking... CRM FMLA HR Policies Management Mergers  Organizational... Payroll Team Building Technical Recruiting Training Leadership See 16+     See less Performance Management Employee Relations Organizational... Deferred Compensation Leadership Development HRIS Human Resources Succession Planning Employee Engagement Employee Benefits Onboarding Executive Coaching Organizational Design Change Management Recruiting Benefits Administration Workforce Planning Talent Acquisition Coaching Applicant Tracking... CRM FMLA HR Policies Management Mergers  Organizational... Payroll Team Building Technical Recruiting Training Leadership See 16+     See less Performance Management Employee Relations Organizational... Deferred Compensation Leadership Development HRIS Human Resources Succession Planning Employee Engagement Employee Benefits Onboarding Executive Coaching Organizational Design Change Management Recruiting Benefits Administration Workforce Planning Talent Acquisition Coaching Applicant Tracking... CRM FMLA HR Policies Management Mergers  Organizational... Payroll Team Building Technical Recruiting Training Leadership See 16+     See less Education San Francisco State University B.A.,  Political Science San Francisco State University B.A.,  Political Science San Francisco State University B.A.,  Political Science San Francisco State University B.A.,  Political Science Honors & Awards Additional Honors & Awards Former adjunct faculty member at Portland State University. Additional Honors & Awards Former adjunct faculty member at Portland State University. Additional Honors & Awards Former adjunct faculty member at Portland State University. Additional Honors & Awards Former adjunct faculty member at Portland State University. ", "Summary We provide home staging for Washington dc area homeowner and Realtors, and sell custom blinds and shades for DC area condo and homeowners! \n \nWe are especially interested in connecting with Realtors and/or developers selling VACANT homes in the Metro DC area. We have hands on experience, access to contemporary furniture and flexible options to help move your property quickly and for more money!  \n \nFormer manager of staffing and recruiting teams, both in large non-profit and Fortune 100 corporation. Summary We provide home staging for Washington dc area homeowner and Realtors, and sell custom blinds and shades for DC area condo and homeowners! \n \nWe are especially interested in connecting with Realtors and/or developers selling VACANT homes in the Metro DC area. We have hands on experience, access to contemporary furniture and flexible options to help move your property quickly and for more money!  \n \nFormer manager of staffing and recruiting teams, both in large non-profit and Fortune 100 corporation. We provide home staging for Washington dc area homeowner and Realtors, and sell custom blinds and shades for DC area condo and homeowners! \n \nWe are especially interested in connecting with Realtors and/or developers selling VACANT homes in the Metro DC area. We have hands on experience, access to contemporary furniture and flexible options to help move your property quickly and for more money!  \n \nFormer manager of staffing and recruiting teams, both in large non-profit and Fortune 100 corporation. We provide home staging for Washington dc area homeowner and Realtors, and sell custom blinds and shades for DC area condo and homeowners! \n \nWe are especially interested in connecting with Realtors and/or developers selling VACANT homes in the Metro DC area. We have hands on experience, access to contemporary furniture and flexible options to help move your property quickly and for more money!  \n \nFormer manager of staffing and recruiting teams, both in large non-profit and Fortune 100 corporation. Experience Partner/Co-owner Budget Blinds of Silver Spring and Bethesda May 2013  – Present (2 years 4 months) Silver Spring, MD Currently manage all sales and promotion for Budget Blinds of Silver Spring. Our franchise services clients in Silver Spring, Chevy Chase, Bethesda, Kensington, Olney, Takoma Park and parts of Washington DC. Not only do we sell blinds and shades, we also sell shutters, area rugs and custom drapery. Unlike other companies, we have a variety of vendors and products available so we can find something to meet your needs and budget. \n \nAll products are professionally measured and installed! \n \ncheck us out at www.budgetblinds.com/silverspring/ Interior Decorator and Home stager ra redoes rooms, inc April 2004  –  July 2015  (11 years 4 months) Washington D.C. Metro Area Recruiting Manager American Red Cross, Headquarters July 2006  –  June 2007  (1 year) Campus Recruiter and Staffing Manager Intel Corporation 1995  –  2004  (9 years) Partner/Co-owner Budget Blinds of Silver Spring and Bethesda May 2013  – Present (2 years 4 months) Silver Spring, MD Currently manage all sales and promotion for Budget Blinds of Silver Spring. Our franchise services clients in Silver Spring, Chevy Chase, Bethesda, Kensington, Olney, Takoma Park and parts of Washington DC. Not only do we sell blinds and shades, we also sell shutters, area rugs and custom drapery. Unlike other companies, we have a variety of vendors and products available so we can find something to meet your needs and budget. \n \nAll products are professionally measured and installed! \n \ncheck us out at www.budgetblinds.com/silverspring/ Partner/Co-owner Budget Blinds of Silver Spring and Bethesda May 2013  – Present (2 years 4 months) Silver Spring, MD Currently manage all sales and promotion for Budget Blinds of Silver Spring. Our franchise services clients in Silver Spring, Chevy Chase, Bethesda, Kensington, Olney, Takoma Park and parts of Washington DC. Not only do we sell blinds and shades, we also sell shutters, area rugs and custom drapery. Unlike other companies, we have a variety of vendors and products available so we can find something to meet your needs and budget. \n \nAll products are professionally measured and installed! \n \ncheck us out at www.budgetblinds.com/silverspring/ Interior Decorator and Home stager ra redoes rooms, inc April 2004  –  July 2015  (11 years 4 months) Washington D.C. Metro Area Interior Decorator and Home stager ra redoes rooms, inc April 2004  –  July 2015  (11 years 4 months) Washington D.C. Metro Area Recruiting Manager American Red Cross, Headquarters July 2006  –  June 2007  (1 year) Recruiting Manager American Red Cross, Headquarters July 2006  –  June 2007  (1 year) Campus Recruiter and Staffing Manager Intel Corporation 1995  –  2004  (9 years) Campus Recruiter and Staffing Manager Intel Corporation 1995  –  2004  (9 years) Skills Public Speaking Talent Acquisition Process Improvement Small Business Problem Solving Customer Service Event Planning Leadership Development Team Building Hiring Recruiting Management Coaching Leadership Onboarding Entrepreneurship Vendor Management Budgets Non-profits Strategic Planning Sourcing Interviews Selling Performance Management Applicant Tracking... Talent Management Social Media Organizational... Employee Relations Nonprofits Human Resources Project Management CRM Executive Search Training Business Development Temporary Placement Social Networking College Recruiting Marketing Consulting Strategy Sales See 28+     See less Skills  Public Speaking Talent Acquisition Process Improvement Small Business Problem Solving Customer Service Event Planning Leadership Development Team Building Hiring Recruiting Management Coaching Leadership Onboarding Entrepreneurship Vendor Management Budgets Non-profits Strategic Planning Sourcing Interviews Selling Performance Management Applicant Tracking... Talent Management Social Media Organizational... Employee Relations Nonprofits Human Resources Project Management CRM Executive Search Training Business Development Temporary Placement Social Networking College Recruiting Marketing Consulting Strategy Sales See 28+     See less Public Speaking Talent Acquisition Process Improvement Small Business Problem Solving Customer Service Event Planning Leadership Development Team Building Hiring Recruiting Management Coaching Leadership Onboarding Entrepreneurship Vendor Management Budgets Non-profits Strategic Planning Sourcing Interviews Selling Performance Management Applicant Tracking... Talent Management Social Media Organizational... Employee Relations Nonprofits Human Resources Project Management CRM Executive Search Training Business Development Temporary Placement Social Networking College Recruiting Marketing Consulting Strategy Sales See 28+     See less Public Speaking Talent Acquisition Process Improvement Small Business Problem Solving Customer Service Event Planning Leadership Development Team Building Hiring Recruiting Management Coaching Leadership Onboarding Entrepreneurship Vendor Management Budgets Non-profits Strategic Planning Sourcing Interviews Selling Performance Management Applicant Tracking... Talent Management Social Media Organizational... Employee Relations Nonprofits Human Resources Project Management CRM Executive Search Training Business Development Temporary Placement Social Networking College Recruiting Marketing Consulting Strategy Sales See 28+     See less Education University of Maryland - Robert H. Smith School of Business MBA 1995 James Madison University - College of Business bba 1986  – 1990 University of Maryland - Robert H. Smith School of Business MBA 1995 University of Maryland - Robert H. Smith School of Business MBA 1995 University of Maryland - Robert H. Smith School of Business MBA 1995 James Madison University - College of Business bba 1986  – 1990 James Madison University - College of Business bba 1986  – 1990 James Madison University - College of Business bba 1986  – 1990 ", "Experience Coach* Trainer* Inspirer* Future You - INSPIRED 2014  – Present (1 year) Hong Kong based Unleashing potential through inspiring and developing leaders and managers Consultant Right Management 2014  – Present (1 year) Hong Kong Talent Development Director - Greater China Nike April 2004  –  December 2013  (9 years 9 months) Hong Kong Senior Manager Human Resources Microsoft August 2001  –  July 2003  (2 years) Hong Kong Talent Managment Motorola 1999  –  2001  (2 years) Staffing Manager Intel Corporation November 1997  –  November 1999  (2 years 1 month) Hong Kong Consultant Price Waterhouse November 1993  –  October 1997  (4 years) Hong Kong Coach* Trainer* Inspirer* Future You - INSPIRED 2014  – Present (1 year) Hong Kong based Unleashing potential through inspiring and developing leaders and managers Coach* Trainer* Inspirer* Future You - INSPIRED 2014  – Present (1 year) Hong Kong based Unleashing potential through inspiring and developing leaders and managers Consultant Right Management 2014  – Present (1 year) Hong Kong Consultant Right Management 2014  – Present (1 year) Hong Kong Talent Development Director - Greater China Nike April 2004  –  December 2013  (9 years 9 months) Hong Kong Talent Development Director - Greater China Nike April 2004  –  December 2013  (9 years 9 months) Hong Kong Senior Manager Human Resources Microsoft August 2001  –  July 2003  (2 years) Hong Kong Senior Manager Human Resources Microsoft August 2001  –  July 2003  (2 years) Hong Kong Talent Managment Motorola 1999  –  2001  (2 years) Talent Managment Motorola 1999  –  2001  (2 years) Staffing Manager Intel Corporation November 1997  –  November 1999  (2 years 1 month) Hong Kong Staffing Manager Intel Corporation November 1997  –  November 1999  (2 years 1 month) Hong Kong Consultant Price Waterhouse November 1993  –  October 1997  (4 years) Hong Kong Consultant Price Waterhouse November 1993  –  October 1997  (4 years) Hong Kong Languages   Skills Human Resources Talent Management Temporary Placement Succession Planning Employee Relations Talent Acquisition Employee Engagement Executive Coaching Performance Management HR Consulting Leadership Development Organizational... Recruiting Coaching Personnel Management Organizational Design Sourcing Organizational... See 3+     See less Skills  Human Resources Talent Management Temporary Placement Succession Planning Employee Relations Talent Acquisition Employee Engagement Executive Coaching Performance Management HR Consulting Leadership Development Organizational... Recruiting Coaching Personnel Management Organizational Design Sourcing Organizational... See 3+     See less Human Resources Talent Management Temporary Placement Succession Planning Employee Relations Talent Acquisition Employee Engagement Executive Coaching Performance Management HR Consulting Leadership Development Organizational... Recruiting Coaching Personnel Management Organizational Design Sourcing Organizational... See 3+     See less Human Resources Talent Management Temporary Placement Succession Planning Employee Relations Talent Acquisition Employee Engagement Executive Coaching Performance Management HR Consulting Leadership Development Organizational... Recruiting Coaching Personnel Management Organizational Design Sourcing Organizational... See 3+     See less Education Henley Management College Master of Business Administration (M.B.A.) 2004 University of the Witwatersrand Bachelor of Arts (B.A.),  Industrial and Organizational Psychology 1992 ProgressU Henley Management College Master of Business Administration (M.B.A.) 2004 Henley Management College Master of Business Administration (M.B.A.) 2004 Henley Management College Master of Business Administration (M.B.A.) 2004 University of the Witwatersrand Bachelor of Arts (B.A.),  Industrial and Organizational Psychology 1992 University of the Witwatersrand Bachelor of Arts (B.A.),  Industrial and Organizational Psychology 1992 University of the Witwatersrand Bachelor of Arts (B.A.),  Industrial and Organizational Psychology 1992 ProgressU ProgressU ProgressU ", "Skills Semiconductors R&D Continuous Improvement IC Product Development Electronics Supply Management Equipment Deployment Program Management... Talent Management Talent Mining Talent Acquisition Design of Experiments Manufacturing Program Management Semiconductor Industry Management Virtual Teams Global Sourcing Sourcing Stakeholder Management Cross-functional... Strategic Sourcing Project Management Senior Stakeholder... Engineering Management Engineering Failure Analysis Lean Manufacturing Debugging SPC Cross-functional Team... See 17+     See less Skills  Semiconductors R&D Continuous Improvement IC Product Development Electronics Supply Management Equipment Deployment Program Management... Talent Management Talent Mining Talent Acquisition Design of Experiments Manufacturing Program Management Semiconductor Industry Management Virtual Teams Global Sourcing Sourcing Stakeholder Management Cross-functional... Strategic Sourcing Project Management Senior Stakeholder... Engineering Management Engineering Failure Analysis Lean Manufacturing Debugging SPC Cross-functional Team... See 17+     See less Semiconductors R&D Continuous Improvement IC Product Development Electronics Supply Management Equipment Deployment Program Management... Talent Management Talent Mining Talent Acquisition Design of Experiments Manufacturing Program Management Semiconductor Industry Management Virtual Teams Global Sourcing Sourcing Stakeholder Management Cross-functional... Strategic Sourcing Project Management Senior Stakeholder... Engineering Management Engineering Failure Analysis Lean Manufacturing Debugging SPC Cross-functional Team... See 17+     See less Semiconductors R&D Continuous Improvement IC Product Development Electronics Supply Management Equipment Deployment Program Management... Talent Management Talent Mining Talent Acquisition Design of Experiments Manufacturing Program Management Semiconductor Industry Management Virtual Teams Global Sourcing Sourcing Stakeholder Management Cross-functional... Strategic Sourcing Project Management Senior Stakeholder... Engineering Management Engineering Failure Analysis Lean Manufacturing Debugging SPC Cross-functional Team... See 17+     See less ", "Experience Operations Staffing Manager Intel Corporation May 2015  – Present (4 months) Supply Team Manager Intel Corporation November 2012  –  May 2015  (2 years 7 months) Customer Business Manager Intel October 2008  –  November 2012  (4 years 2 months) Pricing Manager Intel August 2005  –  January 2011  (5 years 6 months) Customer Business Manager - Latin America Intel February 2005  –  August 2005  (7 months) Customer Sales Analyst - Latin America Intel January 2003  –  February 2005  (2 years 2 months) Customer Business Analyst - Latin America Intel January 2000  –  January 2003  (3 years 1 month) Operations Staffing Manager Intel Corporation May 2015  – Present (4 months) Operations Staffing Manager Intel Corporation May 2015  – Present (4 months) Supply Team Manager Intel Corporation November 2012  –  May 2015  (2 years 7 months) Supply Team Manager Intel Corporation November 2012  –  May 2015  (2 years 7 months) Customer Business Manager Intel October 2008  –  November 2012  (4 years 2 months) Customer Business Manager Intel October 2008  –  November 2012  (4 years 2 months) Pricing Manager Intel August 2005  –  January 2011  (5 years 6 months) Pricing Manager Intel August 2005  –  January 2011  (5 years 6 months) Customer Business Manager - Latin America Intel February 2005  –  August 2005  (7 months) Customer Business Manager - Latin America Intel February 2005  –  August 2005  (7 months) Customer Sales Analyst - Latin America Intel January 2003  –  February 2005  (2 years 2 months) Customer Sales Analyst - Latin America Intel January 2003  –  February 2005  (2 years 2 months) Customer Business Analyst - Latin America Intel January 2000  –  January 2003  (3 years 1 month) Customer Business Analyst - Latin America Intel January 2000  –  January 2003  (3 years 1 month) Languages Spanish Spanish Spanish Skills Latin America Cross-functional Team... Semiconductors Intel Product Management Product Marketing Competitive Analysis Forecasting Program Management Process Improvement Pricing Product Launch Management Skills  Latin America Cross-functional Team... Semiconductors Intel Product Management Product Marketing Competitive Analysis Forecasting Program Management Process Improvement Pricing Product Launch Management Latin America Cross-functional Team... Semiconductors Intel Product Management Product Marketing Competitive Analysis Forecasting Program Management Process Improvement Pricing Product Launch Management Latin America Cross-functional Team... Semiconductors Intel Product Management Product Marketing Competitive Analysis Forecasting Program Management Process Improvement Pricing Product Launch Management Education California State University-Sacramento Bachelor's degree,  International Business 1997  – 1999 California State University-Sacramento Bachelor's degree,  International Business 1997  – 1999 California State University-Sacramento Bachelor's degree,  International Business 1997  – 1999 California State University-Sacramento Bachelor's degree,  International Business 1997  – 1999 ", "Experience Staffing Manager Intel Corporation June 2015  – Present (3 months) Costa Rica Managing Immigration and Post Offer Team supporting America's Region. Staffing Recruiter/Talent Consultant Intel Corporation June 2014  – Present (1 year 3 months) In charge of recruting process for College Graduates for Intel in the USA Planning Manager Intel Corporation January 2011  –  May 2014  (3 years 5 months) Costa Rica Managed a professional team of Planner Analysts in charge of engineering and customer samples' supply chain for Intel’s latest technology microprocessors before introducing products into high volume manufacturing. Lead Planner Intel Corporation January 2008  –  December 2010  (3 years) Costa Rica Planner in charge of operational coordination across product platforms for Intel Costa Rica Assembly and Test Factory. Supply Chain Lead Intel Corporation January 2005  –  December 2007  (3 years) Virtual Senior Planner for microprocessor products including direct materials supply & capacity coordination for Intel Virtual Assembly & Test Factory. Staffing Manager Intel Corporation June 2015  – Present (3 months) Costa Rica Managing Immigration and Post Offer Team supporting America's Region. Staffing Manager Intel Corporation June 2015  – Present (3 months) Costa Rica Managing Immigration and Post Offer Team supporting America's Region. Staffing Recruiter/Talent Consultant Intel Corporation June 2014  – Present (1 year 3 months) In charge of recruting process for College Graduates for Intel in the USA Staffing Recruiter/Talent Consultant Intel Corporation June 2014  – Present (1 year 3 months) In charge of recruting process for College Graduates for Intel in the USA Planning Manager Intel Corporation January 2011  –  May 2014  (3 years 5 months) Costa Rica Managed a professional team of Planner Analysts in charge of engineering and customer samples' supply chain for Intel’s latest technology microprocessors before introducing products into high volume manufacturing. Planning Manager Intel Corporation January 2011  –  May 2014  (3 years 5 months) Costa Rica Managed a professional team of Planner Analysts in charge of engineering and customer samples' supply chain for Intel’s latest technology microprocessors before introducing products into high volume manufacturing. Lead Planner Intel Corporation January 2008  –  December 2010  (3 years) Costa Rica Planner in charge of operational coordination across product platforms for Intel Costa Rica Assembly and Test Factory. Lead Planner Intel Corporation January 2008  –  December 2010  (3 years) Costa Rica Planner in charge of operational coordination across product platforms for Intel Costa Rica Assembly and Test Factory. Supply Chain Lead Intel Corporation January 2005  –  December 2007  (3 years) Virtual Senior Planner for microprocessor products including direct materials supply & capacity coordination for Intel Virtual Assembly & Test Factory. Supply Chain Lead Intel Corporation January 2005  –  December 2007  (3 years) Virtual Senior Planner for microprocessor products including direct materials supply & capacity coordination for Intel Virtual Assembly & Test Factory. Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Recruiting Customer Service Human Resources Microsoft Word Employee Relations Talent Acquisition Talent Management Outlook Program Management C Microsoft Office Six Sigma Testing Management Cross-functional Team... Skills  Recruiting Customer Service Human Resources Microsoft Word Employee Relations Talent Acquisition Talent Management Outlook Program Management C Microsoft Office Six Sigma Testing Management Cross-functional Team... Recruiting Customer Service Human Resources Microsoft Word Employee Relations Talent Acquisition Talent Management Outlook Program Management C Microsoft Office Six Sigma Testing Management Cross-functional Team... Recruiting Customer Service Human Resources Microsoft Word Employee Relations Talent Acquisition Talent Management Outlook Program Management C Microsoft Office Six Sigma Testing Management Cross-functional Team... ", "Experience Human Resources Employee Representative Wegmans Food Markets July 2007  – Present (8 years 2 months) Operations Management Trainee Wegmans February 2007  –  July 2007  (6 months) Employee Referral Program Manager Intel Corporation April 2005  –  January 2007  (1 year 10 months) Human Resources Staffing Program/Project Manager Intel Corporation April 2005  –  January 2007  (1 year 10 months) Business Analyst Intel Corporation May 2004  –  April 2005  (1 year) Embedded Staffing Manager Intel Corporation December 2000  –  May 2004  (3 years 6 months) Human Resources Employee Representative Wegmans Food Markets July 2007  – Present (8 years 2 months) Human Resources Employee Representative Wegmans Food Markets July 2007  – Present (8 years 2 months) Operations Management Trainee Wegmans February 2007  –  July 2007  (6 months) Operations Management Trainee Wegmans February 2007  –  July 2007  (6 months) Employee Referral Program Manager Intel Corporation April 2005  –  January 2007  (1 year 10 months) Employee Referral Program Manager Intel Corporation April 2005  –  January 2007  (1 year 10 months) Human Resources Staffing Program/Project Manager Intel Corporation April 2005  –  January 2007  (1 year 10 months) Human Resources Staffing Program/Project Manager Intel Corporation April 2005  –  January 2007  (1 year 10 months) Business Analyst Intel Corporation May 2004  –  April 2005  (1 year) Business Analyst Intel Corporation May 2004  –  April 2005  (1 year) Embedded Staffing Manager Intel Corporation December 2000  –  May 2004  (3 years 6 months) Embedded Staffing Manager Intel Corporation December 2000  –  May 2004  (3 years 6 months) Education Grove City College Business Management Grove City College Business Management Grove City College Business Management Grove City College Business Management ", "Skills Temporary Placement Semiconductors Cross-functional Team... Program Management College Recruiting Talent Management Workforce Planning Talent Acquisition Employee Relations Human Resources Performance Management Process Improvement Organizational... Applicant Tracking... Management Project Management Recruiting Sourcing Strategy See 4+     See less Skills  Temporary Placement Semiconductors Cross-functional Team... Program Management College Recruiting Talent Management Workforce Planning Talent Acquisition Employee Relations Human Resources Performance Management Process Improvement Organizational... Applicant Tracking... Management Project Management Recruiting Sourcing Strategy See 4+     See less Temporary Placement Semiconductors Cross-functional Team... Program Management College Recruiting Talent Management Workforce Planning Talent Acquisition Employee Relations Human Resources Performance Management Process Improvement Organizational... Applicant Tracking... Management Project Management Recruiting Sourcing Strategy See 4+     See less Temporary Placement Semiconductors Cross-functional Team... Program Management College Recruiting Talent Management Workforce Planning Talent Acquisition Employee Relations Human Resources Performance Management Process Improvement Organizational... Applicant Tracking... Management Project Management Recruiting Sourcing Strategy See 4+     See less ", "Languages Spanish Spanish Spanish Skills Employer Branding Talent Management Talent Acquisition Performance Management Recruiting Change Management Strategic Sourcing Sourcing Employee Relations Succession Planning Management Workforce Planning Strategy Interviews Executive Search Organizational Design Personnel Management See 2+     See less Skills  Employer Branding Talent Management Talent Acquisition Performance Management Recruiting Change Management Strategic Sourcing Sourcing Employee Relations Succession Planning Management Workforce Planning Strategy Interviews Executive Search Organizational Design Personnel Management See 2+     See less Employer Branding Talent Management Talent Acquisition Performance Management Recruiting Change Management Strategic Sourcing Sourcing Employee Relations Succession Planning Management Workforce Planning Strategy Interviews Executive Search Organizational Design Personnel Management See 2+     See less Employer Branding Talent Management Talent Acquisition Performance Management Recruiting Change Management Strategic Sourcing Sourcing Employee Relations Succession Planning Management Workforce Planning Strategy Interviews Executive Search Organizational Design Personnel Management See 2+     See less ", "Skills Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less Skills  Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less Cross-functional Team... Team Management Program Management Integration Organizational... Contract Negotiation Talent Acquisition Performance Management Employee Relations Talent Management Management Supply Chain Vendor Management Strategy Team Leadership Process Improvement Strategic Partnerships Interviews Business Relationship... Global Sourcing Integrity Communication Onboarding Graduate Recruitment Interviewing Competency Based... Building Organizational... Problem Solving Retention Strategies Collaborative Problem... Coaching & Mentoring Mergers & Acquisitions Acquisition Integration See 18+     See less ", "Experience Intel Executive Recruiting Manager Intel Corporation August 2012  – Present (3 years 1 month) Phoenix, Arizona Area Leads the team of Intel Executive Recruiters in charge of connecting Industry Leaders with Intel opportunities. In this role she  \n•Oversees the team strategic direction and provides operational support to team members \n•Builds strong partnerships with Intel’s Business Leaders to provide consultative support to Executive Talent needs.  \n•Ensures a strong Business and Market Acumen to anticipate hiring needs and proactively attract the best leaders from the Industry.  \n•Builds solid relationships with executives through informal networking  \n•Manages a preferred provider program as well as a supplier scorecard evaluation \n•Focus on diversity hiring to meet Intel's representation goals by 2020. \n US Diversity Talent Delivery Manager Intel Corporation January 2011  –  June 2013  (2 years 6 months) Phoenix, Arizona Area Responsible for setting the diversity talent delivery vision and strategy for the US.  \nManaged a team in charge of the programs necessary to ensure diversity hiring is met across all US Business Units. Managed the process to achieve Intel’s Employee Bonus Goal, which positively impacted Intel’s representation. Proved Diversity Focused Hiring Events/training to be successful by deliverying offers on the spot. Supported the launch of our first Diversity Recruiting Marketing Campaign. Introduced Paperless Resume collection tool with Intel Tablets, Developed Diversity Industry Network to share best known methods and kicked off Intel Veterans Recruiting and Hiring Efforts. Latin America Staffing Manager Intel Corporation June 2005  –  December 2010  (5 years 7 months) Costa Rica Leading and managing a team of 16 people in charge of employer branding and marketing, recruiting and hiring new employees throughout 13 countries in Latin America. 1000 heads hired a year with a discretionary annual budget of ~$500k US College Manager (temporary assignment) Intel Corporation June 2010  –  September 2010  (4 months) Phoenix, Arizona Area Temporarily led a team of 18 associates responsible for US College Graduates and Students Recruiting and Relations. Executed 2010 fall recruiting and marketing activities according to plan. Materials New Products Introduction Manager Intel Corporation January 1999  –  June 2005  (6 years 6 months) Phoenix, Arizona Area •Created and led a global team in charge of new materials readiness for new products introductions in 3 different platforms and 5 high volume manufacturing sites around the world (China, Malaysia- Penang, Malaysia-Kulim Costa Rica, Philippines). \n•Managed the readiness of bill of materials and suppliers in support of 9 new products.  \n•Reduced new product validation materials usage in 50% Direct and Indirect Materials Warehouse Team Leader Intel Corporation November 1997  –  January 1999  (1 year 3 months) Costa Rica •Managed a team in charge of inventory integrity. Achieved 98% direct & indirect materials inventory accuracy for CR Warehouse, kitting area and manufacturing floor.  \n•Successful implementation of inventory management systems and Warehouse ISO 9000 Certification Strategic Production Planner / Materials Manager Hanes - Sara Lee Corporation May 1996  –  June 1997  (1 year 2 months) Costa Rica •Strategic Production Planning:  \nIn charge of the production planning and lines optimization to successfully execute Corporate Sales & Marketing weekly, monthly and annual goals. \nSupervised and controlled the efficiency of Final Product Packaging department composed of 100 people, ensuring the accomplishment of weekly goals to meet required export targets. \n•Materials Manager: \nManaged the materials ordering and inventory management to meet production requirements of 1 million units a week. \nResponsible of warehouse operations by managing a team of 13 people, in charge of materials replenishment for production together with the raw materials inbound process. Supervised the outbound process of finished goods from the free trade zone until delivered to the Distribution Center. Intel Executive Recruiting Manager Intel Corporation August 2012  – Present (3 years 1 month) Phoenix, Arizona Area Leads the team of Intel Executive Recruiters in charge of connecting Industry Leaders with Intel opportunities. In this role she  \n•Oversees the team strategic direction and provides operational support to team members \n•Builds strong partnerships with Intel’s Business Leaders to provide consultative support to Executive Talent needs.  \n•Ensures a strong Business and Market Acumen to anticipate hiring needs and proactively attract the best leaders from the Industry.  \n•Builds solid relationships with executives through informal networking  \n•Manages a preferred provider program as well as a supplier scorecard evaluation \n•Focus on diversity hiring to meet Intel's representation goals by 2020. \n Intel Executive Recruiting Manager Intel Corporation August 2012  – Present (3 years 1 month) Phoenix, Arizona Area Leads the team of Intel Executive Recruiters in charge of connecting Industry Leaders with Intel opportunities. In this role she  \n•Oversees the team strategic direction and provides operational support to team members \n•Builds strong partnerships with Intel’s Business Leaders to provide consultative support to Executive Talent needs.  \n•Ensures a strong Business and Market Acumen to anticipate hiring needs and proactively attract the best leaders from the Industry.  \n•Builds solid relationships with executives through informal networking  \n•Manages a preferred provider program as well as a supplier scorecard evaluation \n•Focus on diversity hiring to meet Intel's representation goals by 2020. \n US Diversity Talent Delivery Manager Intel Corporation January 2011  –  June 2013  (2 years 6 months) Phoenix, Arizona Area Responsible for setting the diversity talent delivery vision and strategy for the US.  \nManaged a team in charge of the programs necessary to ensure diversity hiring is met across all US Business Units. Managed the process to achieve Intel’s Employee Bonus Goal, which positively impacted Intel’s representation. Proved Diversity Focused Hiring Events/training to be successful by deliverying offers on the spot. Supported the launch of our first Diversity Recruiting Marketing Campaign. Introduced Paperless Resume collection tool with Intel Tablets, Developed Diversity Industry Network to share best known methods and kicked off Intel Veterans Recruiting and Hiring Efforts. US Diversity Talent Delivery Manager Intel Corporation January 2011  –  June 2013  (2 years 6 months) Phoenix, Arizona Area Responsible for setting the diversity talent delivery vision and strategy for the US.  \nManaged a team in charge of the programs necessary to ensure diversity hiring is met across all US Business Units. Managed the process to achieve Intel’s Employee Bonus Goal, which positively impacted Intel’s representation. Proved Diversity Focused Hiring Events/training to be successful by deliverying offers on the spot. Supported the launch of our first Diversity Recruiting Marketing Campaign. Introduced Paperless Resume collection tool with Intel Tablets, Developed Diversity Industry Network to share best known methods and kicked off Intel Veterans Recruiting and Hiring Efforts. Latin America Staffing Manager Intel Corporation June 2005  –  December 2010  (5 years 7 months) Costa Rica Leading and managing a team of 16 people in charge of employer branding and marketing, recruiting and hiring new employees throughout 13 countries in Latin America. 1000 heads hired a year with a discretionary annual budget of ~$500k Latin America Staffing Manager Intel Corporation June 2005  –  December 2010  (5 years 7 months) Costa Rica Leading and managing a team of 16 people in charge of employer branding and marketing, recruiting and hiring new employees throughout 13 countries in Latin America. 1000 heads hired a year with a discretionary annual budget of ~$500k US College Manager (temporary assignment) Intel Corporation June 2010  –  September 2010  (4 months) Phoenix, Arizona Area Temporarily led a team of 18 associates responsible for US College Graduates and Students Recruiting and Relations. Executed 2010 fall recruiting and marketing activities according to plan. US College Manager (temporary assignment) Intel Corporation June 2010  –  September 2010  (4 months) Phoenix, Arizona Area Temporarily led a team of 18 associates responsible for US College Graduates and Students Recruiting and Relations. Executed 2010 fall recruiting and marketing activities according to plan. Materials New Products Introduction Manager Intel Corporation January 1999  –  June 2005  (6 years 6 months) Phoenix, Arizona Area •Created and led a global team in charge of new materials readiness for new products introductions in 3 different platforms and 5 high volume manufacturing sites around the world (China, Malaysia- Penang, Malaysia-Kulim Costa Rica, Philippines). \n•Managed the readiness of bill of materials and suppliers in support of 9 new products.  \n•Reduced new product validation materials usage in 50% Materials New Products Introduction Manager Intel Corporation January 1999  –  June 2005  (6 years 6 months) Phoenix, Arizona Area •Created and led a global team in charge of new materials readiness for new products introductions in 3 different platforms and 5 high volume manufacturing sites around the world (China, Malaysia- Penang, Malaysia-Kulim Costa Rica, Philippines). \n•Managed the readiness of bill of materials and suppliers in support of 9 new products.  \n•Reduced new product validation materials usage in 50% Direct and Indirect Materials Warehouse Team Leader Intel Corporation November 1997  –  January 1999  (1 year 3 months) Costa Rica •Managed a team in charge of inventory integrity. Achieved 98% direct & indirect materials inventory accuracy for CR Warehouse, kitting area and manufacturing floor.  \n•Successful implementation of inventory management systems and Warehouse ISO 9000 Certification Direct and Indirect Materials Warehouse Team Leader Intel Corporation November 1997  –  January 1999  (1 year 3 months) Costa Rica •Managed a team in charge of inventory integrity. Achieved 98% direct & indirect materials inventory accuracy for CR Warehouse, kitting area and manufacturing floor.  \n•Successful implementation of inventory management systems and Warehouse ISO 9000 Certification Strategic Production Planner / Materials Manager Hanes - Sara Lee Corporation May 1996  –  June 1997  (1 year 2 months) Costa Rica •Strategic Production Planning:  \nIn charge of the production planning and lines optimization to successfully execute Corporate Sales & Marketing weekly, monthly and annual goals. \nSupervised and controlled the efficiency of Final Product Packaging department composed of 100 people, ensuring the accomplishment of weekly goals to meet required export targets. \n•Materials Manager: \nManaged the materials ordering and inventory management to meet production requirements of 1 million units a week. \nResponsible of warehouse operations by managing a team of 13 people, in charge of materials replenishment for production together with the raw materials inbound process. Supervised the outbound process of finished goods from the free trade zone until delivered to the Distribution Center. Strategic Production Planner / Materials Manager Hanes - Sara Lee Corporation May 1996  –  June 1997  (1 year 2 months) Costa Rica •Strategic Production Planning:  \nIn charge of the production planning and lines optimization to successfully execute Corporate Sales & Marketing weekly, monthly and annual goals. \nSupervised and controlled the efficiency of Final Product Packaging department composed of 100 people, ensuring the accomplishment of weekly goals to meet required export targets. \n•Materials Manager: \nManaged the materials ordering and inventory management to meet production requirements of 1 million units a week. \nResponsible of warehouse operations by managing a team of 13 people, in charge of materials replenishment for production together with the raw materials inbound process. Supervised the outbound process of finished goods from the free trade zone until delivered to the Distribution Center. Languages Spanish English Spanish English Spanish English Skills Sourcing Cross-functional Team... Program Management Talent Management Team Building People Management Succession Planning Team Leadership Workforce Planning Employer Branding Strategic Planning Inventory Management Business Process... Business Planning Materials Management Global Strategy Global Teams Diversity Executive Search Multi Tasking Management Product Development Human Resources Strategy Manufacturing Recruiting Process Improvement Employee Relations Temporary Placement Lean Manufacturing Budgets Hiring Continuous Improvement Supply Chain Process Engineering Production Planning Supply Chain Management Six Sigma Operations Management SAP Performance Management Vendor Management Supply Management See 28+     See less Skills  Sourcing Cross-functional Team... Program Management Talent Management Team Building People Management Succession Planning Team Leadership Workforce Planning Employer Branding Strategic Planning Inventory Management Business Process... Business Planning Materials Management Global Strategy Global Teams Diversity Executive Search Multi Tasking Management Product Development Human Resources Strategy Manufacturing Recruiting Process Improvement Employee Relations Temporary Placement Lean Manufacturing Budgets Hiring Continuous Improvement Supply Chain Process Engineering Production Planning Supply Chain Management Six Sigma Operations Management SAP Performance Management Vendor Management Supply Management See 28+     See less Sourcing Cross-functional Team... Program Management Talent Management Team Building People Management Succession Planning Team Leadership Workforce Planning Employer Branding Strategic Planning Inventory Management Business Process... Business Planning Materials Management Global Strategy Global Teams Diversity Executive Search Multi Tasking Management Product Development Human Resources Strategy Manufacturing Recruiting Process Improvement Employee Relations Temporary Placement Lean Manufacturing Budgets Hiring Continuous Improvement Supply Chain Process Engineering Production Planning Supply Chain Management Six Sigma Operations Management SAP Performance Management Vendor Management Supply Management See 28+     See less Sourcing Cross-functional Team... Program Management Talent Management Team Building People Management Succession Planning Team Leadership Workforce Planning Employer Branding Strategic Planning Inventory Management Business Process... Business Planning Materials Management Global Strategy Global Teams Diversity Executive Search Multi Tasking Management Product Development Human Resources Strategy Manufacturing Recruiting Process Improvement Employee Relations Temporary Placement Lean Manufacturing Budgets Hiring Continuous Improvement Supply Chain Process Engineering Production Planning Supply Chain Management Six Sigma Operations Management SAP Performance Management Vendor Management Supply Management See 28+     See less Education EOI Escuela de Negocios Master,  Human Resources Strategic Direction 2008  – 2009 Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering 1993  – 1995 Saint Clare High School 1988  – 1992 EOI Escuela de Negocios Master,  Human Resources Strategic Direction 2008  – 2009 EOI Escuela de Negocios Master,  Human Resources Strategic Direction 2008  – 2009 EOI Escuela de Negocios Master,  Human Resources Strategic Direction 2008  – 2009 Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering 1993  – 1995 Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering 1993  – 1995 Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering 1993  – 1995 Saint Clare High School 1988  – 1992 Saint Clare High School 1988  – 1992 Saint Clare High School 1988  – 1992 ", "Summary Today Dell is composed of more than 100,000 team members who serve the IT needs of global corporations, small and medium businesses, governments, healthcare providers, educational institutions and home computing users. From PCs to the infrastructure and services that power the world’s most complex data centers and cloud computing environments, Dell’s broad range of IT services and solutions has helped millions of customers around the world. Summary Today Dell is composed of more than 100,000 team members who serve the IT needs of global corporations, small and medium businesses, governments, healthcare providers, educational institutions and home computing users. From PCs to the infrastructure and services that power the world’s most complex data centers and cloud computing environments, Dell’s broad range of IT services and solutions has helped millions of customers around the world. Today Dell is composed of more than 100,000 team members who serve the IT needs of global corporations, small and medium businesses, governments, healthcare providers, educational institutions and home computing users. From PCs to the infrastructure and services that power the world’s most complex data centers and cloud computing environments, Dell’s broad range of IT services and solutions has helped millions of customers around the world. Today Dell is composed of more than 100,000 team members who serve the IT needs of global corporations, small and medium businesses, governments, healthcare providers, educational institutions and home computing users. From PCs to the infrastructure and services that power the world’s most complex data centers and cloud computing environments, Dell’s broad range of IT services and solutions has helped millions of customers around the world. Experience Talent Acquistion Director Dell September 2011  – Present (4 years) Copenhagen Area, Denmark EMEA Lead, Talent Acquisition Center of Excellence Talent Acquisition Director Dell January 2011  –  August 2011  (8 months) - EMEA Large Enterprise \n- Nordic, Switzerland, Benelux Sr. Talent Acquisition Manager Dell November 2009  –  December 2010  (1 year 2 months) EMEA Large Enterprise,  \n- Dell Nordic/Benelux & Central European Region,  \n- Large Enterprise Executive Sr. HR Manager Dell January 2009  –  October 2009  (10 months) Sr. Talent Acquisition Manager Dell September 2004  –  December 2008  (4 years 4 months) - EMEA Executive Recruiting \n- EMEA Corporate Accounts (CA) \n- Dell Nordic & Benelux EMEA Staffing Manager Intel Corporation April 2003  –  September 2004  (1 year 6 months) CNEER Staffing Manager Intel Corporation July 2002  –  April 2003  (10 months) Central, Nordic & Eastern European Region Nordic Staffing Consultant Intel Corporation December 2000  –  June 2002  (1 year 7 months) Branch Director MatchMaker Recruiting, now: Promando July 2000  –  December 2000  (6 months) Department Manager MatchMaker Recruiting, now: Promando October 1998  –  June 2000  (1 year 9 months) Recruiting Consultant MatchMaker Recruiting, now: Promando August 1997  –  September 1998  (1 year 2 months) Head of Section, Naval Tactics and Weapons Academy Royal Danish Navy July 1996  –  July 1997  (1 year 1 month) Above Water Warfare Section Commanding Officer, 4th Squadron Fast Missile Boat Royal Danish Navy October 1993  –  June 1996  (2 years 9 months) Korsør - HDMS Bredal,  \n- HDMS Bille,  \n- HDMS Rodsteen Executive Officer, 4th Squadron Fast Missile Boat Royal Danish Navy December 1987  –  September 1993  (5 years 10 months) Copenhagen - HDMS Bredal,  \n- HDMS Bille Talent Acquistion Director Dell September 2011  – Present (4 years) Copenhagen Area, Denmark EMEA Lead, Talent Acquisition Center of Excellence Talent Acquistion Director Dell September 2011  – Present (4 years) Copenhagen Area, Denmark EMEA Lead, Talent Acquisition Center of Excellence Talent Acquisition Director Dell January 2011  –  August 2011  (8 months) - EMEA Large Enterprise \n- Nordic, Switzerland, Benelux Talent Acquisition Director Dell January 2011  –  August 2011  (8 months) - EMEA Large Enterprise \n- Nordic, Switzerland, Benelux Sr. Talent Acquisition Manager Dell November 2009  –  December 2010  (1 year 2 months) EMEA Large Enterprise,  \n- Dell Nordic/Benelux & Central European Region,  \n- Large Enterprise Executive Sr. Talent Acquisition Manager Dell November 2009  –  December 2010  (1 year 2 months) EMEA Large Enterprise,  \n- Dell Nordic/Benelux & Central European Region,  \n- Large Enterprise Executive Sr. HR Manager Dell January 2009  –  October 2009  (10 months) Sr. HR Manager Dell January 2009  –  October 2009  (10 months) Sr. Talent Acquisition Manager Dell September 2004  –  December 2008  (4 years 4 months) - EMEA Executive Recruiting \n- EMEA Corporate Accounts (CA) \n- Dell Nordic & Benelux Sr. Talent Acquisition Manager Dell September 2004  –  December 2008  (4 years 4 months) - EMEA Executive Recruiting \n- EMEA Corporate Accounts (CA) \n- Dell Nordic & Benelux EMEA Staffing Manager Intel Corporation April 2003  –  September 2004  (1 year 6 months) EMEA Staffing Manager Intel Corporation April 2003  –  September 2004  (1 year 6 months) CNEER Staffing Manager Intel Corporation July 2002  –  April 2003  (10 months) Central, Nordic & Eastern European Region CNEER Staffing Manager Intel Corporation July 2002  –  April 2003  (10 months) Central, Nordic & Eastern European Region Nordic Staffing Consultant Intel Corporation December 2000  –  June 2002  (1 year 7 months) Nordic Staffing Consultant Intel Corporation December 2000  –  June 2002  (1 year 7 months) Branch Director MatchMaker Recruiting, now: Promando July 2000  –  December 2000  (6 months) Branch Director MatchMaker Recruiting, now: Promando July 2000  –  December 2000  (6 months) Department Manager MatchMaker Recruiting, now: Promando October 1998  –  June 2000  (1 year 9 months) Department Manager MatchMaker Recruiting, now: Promando October 1998  –  June 2000  (1 year 9 months) Recruiting Consultant MatchMaker Recruiting, now: Promando August 1997  –  September 1998  (1 year 2 months) Recruiting Consultant MatchMaker Recruiting, now: Promando August 1997  –  September 1998  (1 year 2 months) Head of Section, Naval Tactics and Weapons Academy Royal Danish Navy July 1996  –  July 1997  (1 year 1 month) Above Water Warfare Section Head of Section, Naval Tactics and Weapons Academy Royal Danish Navy July 1996  –  July 1997  (1 year 1 month) Above Water Warfare Section Commanding Officer, 4th Squadron Fast Missile Boat Royal Danish Navy October 1993  –  June 1996  (2 years 9 months) Korsør - HDMS Bredal,  \n- HDMS Bille,  \n- HDMS Rodsteen Commanding Officer, 4th Squadron Fast Missile Boat Royal Danish Navy October 1993  –  June 1996  (2 years 9 months) Korsør - HDMS Bredal,  \n- HDMS Bille,  \n- HDMS Rodsteen Executive Officer, 4th Squadron Fast Missile Boat Royal Danish Navy December 1987  –  September 1993  (5 years 10 months) Copenhagen - HDMS Bredal,  \n- HDMS Bille Executive Officer, 4th Squadron Fast Missile Boat Royal Danish Navy December 1987  –  September 1993  (5 years 10 months) Copenhagen - HDMS Bredal,  \n- HDMS Bille Skills Talent Acquisition Performance Management Executive Search Recruiting Cloud Computing EMEA Talent Management IT Service Management Human Resources Sourcing Internet Recruiting Employee Relations Data Center HR Consulting Employer Branding Applicant Tracking... Onboarding Workforce Planning Technical Recruiting Organizational... Employee Engagement HRIS Temporary Placement Management See 9+     See less Skills  Talent Acquisition Performance Management Executive Search Recruiting Cloud Computing EMEA Talent Management IT Service Management Human Resources Sourcing Internet Recruiting Employee Relations Data Center HR Consulting Employer Branding Applicant Tracking... Onboarding Workforce Planning Technical Recruiting Organizational... Employee Engagement HRIS Temporary Placement Management See 9+     See less Talent Acquisition Performance Management Executive Search Recruiting Cloud Computing EMEA Talent Management IT Service Management Human Resources Sourcing Internet Recruiting Employee Relations Data Center HR Consulting Employer Branding Applicant Tracking... Onboarding Workforce Planning Technical Recruiting Organizational... Employee Engagement HRIS Temporary Placement Management See 9+     See less Talent Acquisition Performance Management Executive Search Recruiting Cloud Computing EMEA Talent Management IT Service Management Human Resources Sourcing Internet Recruiting Employee Relations Data Center HR Consulting Employer Branding Applicant Tracking... Onboarding Workforce Planning Technical Recruiting Organizational... Employee Engagement HRIS Temporary Placement Management See 9+     See less Education Royal Danish Naval Academy VUT I/L,  Advanced Officers Education, Operations/Tactical Line 1990  – 1992 Royal Danish Defense College Military Staff Education 1990  – 1990 Royal Danish Naval Academy Operations/Tactical Line 1983  – 1987 Royal Danish Naval Academy VUT I/L,  Advanced Officers Education, Operations/Tactical Line 1990  – 1992 Royal Danish Naval Academy VUT I/L,  Advanced Officers Education, Operations/Tactical Line 1990  – 1992 Royal Danish Naval Academy VUT I/L,  Advanced Officers Education, Operations/Tactical Line 1990  – 1992 Royal Danish Defense College Military Staff Education 1990  – 1990 Royal Danish Defense College Military Staff Education 1990  – 1990 Royal Danish Defense College Military Staff Education 1990  – 1990 Royal Danish Naval Academy Operations/Tactical Line 1983  – 1987 Royal Danish Naval Academy Operations/Tactical Line 1983  – 1987 Royal Danish Naval Academy Operations/Tactical Line 1983  – 1987 ", "Languages   Skills Military Leadership Human Resources Recruiting Cross-functional Team... Talent Acquisition Leadership Development Program Management Personnel Management Organizational... Management Strategic Planning Change Management Operational Planning Team Leadership Temporary Placement Operations Management Organizational... Team Building Training College Recruiting Employee Relations Analysis Strategic Leadership Employee Training Force Protection See 11+     See less Skills  Military Leadership Human Resources Recruiting Cross-functional Team... Talent Acquisition Leadership Development Program Management Personnel Management Organizational... Management Strategic Planning Change Management Operational Planning Team Leadership Temporary Placement Operations Management Organizational... Team Building Training College Recruiting Employee Relations Analysis Strategic Leadership Employee Training Force Protection See 11+     See less Military Leadership Human Resources Recruiting Cross-functional Team... Talent Acquisition Leadership Development Program Management Personnel Management Organizational... Management Strategic Planning Change Management Operational Planning Team Leadership Temporary Placement Operations Management Organizational... Team Building Training College Recruiting Employee Relations Analysis Strategic Leadership Employee Training Force Protection See 11+     See less Military Leadership Human Resources Recruiting Cross-functional Team... Talent Acquisition Leadership Development Program Management Personnel Management Organizational... Management Strategic Planning Change Management Operational Planning Team Leadership Temporary Placement Operations Management Organizational... Team Building Training College Recruiting Employee Relations Analysis Strategic Leadership Employee Training Force Protection See 11+     See less Education Vanderbilt University - Owen Graduate School of Management MBA 2001  – 2003 Boston University BA 1993  – 1997 Kadena High School Vanderbilt University - Owen Graduate School of Management MBA 2001  – 2003 Vanderbilt University - Owen Graduate School of Management MBA 2001  – 2003 Vanderbilt University - Owen Graduate School of Management MBA 2001  – 2003 Boston University BA 1993  – 1997 Boston University BA 1993  – 1997 Boston University BA 1993  – 1997 Kadena High School Kadena High School Kadena High School Honors & Awards Intel Finance Achievement Award Intel March 2012 Awarded the prestigious Intel Finance Achievement Award on four separate occasions for excellence in Cost Containment and Cost Savings (Highest level finance recognition awarded at Intel) Additional Honors & Awards Selected by Phoenix Business Journal as one of 40 Under 40 Up and Coming Leaders in Phoenix, Arizona (2011) Intel Finance Achievement Award Intel March 2012 Awarded the prestigious Intel Finance Achievement Award on four separate occasions for excellence in Cost Containment and Cost Savings (Highest level finance recognition awarded at Intel) Intel Finance Achievement Award Intel March 2012 Awarded the prestigious Intel Finance Achievement Award on four separate occasions for excellence in Cost Containment and Cost Savings (Highest level finance recognition awarded at Intel) Intel Finance Achievement Award Intel March 2012 Awarded the prestigious Intel Finance Achievement Award on four separate occasions for excellence in Cost Containment and Cost Savings (Highest level finance recognition awarded at Intel) Additional Honors & Awards Selected by Phoenix Business Journal as one of 40 Under 40 Up and Coming Leaders in Phoenix, Arizona (2011) Additional Honors & Awards Selected by Phoenix Business Journal as one of 40 Under 40 Up and Coming Leaders in Phoenix, Arizona (2011) Additional Honors & Awards Selected by Phoenix Business Journal as one of 40 Under 40 Up and Coming Leaders in Phoenix, Arizona (2011) ", "Summary 25+ years of experience on Industrial Engineering areas, ranging from Manufacturing Planning to Product / Process development, from procurement to Human Resources areas, as Staffing Manager.  \n \nI am critical thinker, that sees and seeks paths where other sees roadblocks. Process Improvement is a passion that is supported by Six Sigma Green Belt and Lean Sensei Certifications. Give me a problem or a challenge to handle, I will make it a reality.  \n \nAt Intel we are designing the future and we want internal entrepreneurs to join as be part of our revolution, Guadalajara (MEX), San Jose (CR) and Cordoba (ARG) are hiring significant amount of electronic, software and computer science professionals. Visit our page at  \nhttps://www.facebook.com/IntelLatinoAmerica \nfor more details. Summary 25+ years of experience on Industrial Engineering areas, ranging from Manufacturing Planning to Product / Process development, from procurement to Human Resources areas, as Staffing Manager.  \n \nI am critical thinker, that sees and seeks paths where other sees roadblocks. Process Improvement is a passion that is supported by Six Sigma Green Belt and Lean Sensei Certifications. Give me a problem or a challenge to handle, I will make it a reality.  \n \nAt Intel we are designing the future and we want internal entrepreneurs to join as be part of our revolution, Guadalajara (MEX), San Jose (CR) and Cordoba (ARG) are hiring significant amount of electronic, software and computer science professionals. Visit our page at  \nhttps://www.facebook.com/IntelLatinoAmerica \nfor more details. 25+ years of experience on Industrial Engineering areas, ranging from Manufacturing Planning to Product / Process development, from procurement to Human Resources areas, as Staffing Manager.  \n \nI am critical thinker, that sees and seeks paths where other sees roadblocks. Process Improvement is a passion that is supported by Six Sigma Green Belt and Lean Sensei Certifications. Give me a problem or a challenge to handle, I will make it a reality.  \n \nAt Intel we are designing the future and we want internal entrepreneurs to join as be part of our revolution, Guadalajara (MEX), San Jose (CR) and Cordoba (ARG) are hiring significant amount of electronic, software and computer science professionals. Visit our page at  \nhttps://www.facebook.com/IntelLatinoAmerica \nfor more details. 25+ years of experience on Industrial Engineering areas, ranging from Manufacturing Planning to Product / Process development, from procurement to Human Resources areas, as Staffing Manager.  \n \nI am critical thinker, that sees and seeks paths where other sees roadblocks. Process Improvement is a passion that is supported by Six Sigma Green Belt and Lean Sensei Certifications. Give me a problem or a challenge to handle, I will make it a reality.  \n \nAt Intel we are designing the future and we want internal entrepreneurs to join as be part of our revolution, Guadalajara (MEX), San Jose (CR) and Cordoba (ARG) are hiring significant amount of electronic, software and computer science professionals. Visit our page at  \nhttps://www.facebook.com/IntelLatinoAmerica \nfor more details. Experience LAR Talent Delivery (Staffing) Manager Intel Corporation January 2013  – Present (2 years 8 months) costa rica Manage Talent processes for Intel Corporation for the Latin America region, including external hiring and connecting internal career opportunities. Procurement Manager Intel Corporation October 2007  –  January 2013  (5 years 4 months) Costa Rica Managed a team of 15 people within Shared Service Center model, to procure goods and services for Intel's America Region (from Canada to Argentina). During my tenure, the service time (Requisition to Purchase Order creation) was reduced 75%, payment rework was reduced by 50% and started a discount negotiation process. Assembly Operations Industrial Engineer Manager Intel Corporation February 2003  –  October 2007  (4 years 9 months) Phoenix, Arizona Area Managed the factory resource planning process for all Intel's Assembly Factories globally, including capital spending, space planning and headcount planning. Standard methodology was proposed and implemented to ensure analysis consistency and repeatability, to enable what if scenario planning with a quick response time. I was based in Phoenix (Arizona) for about 4 years, interacting with professionals from Costa Rica, Malaysia, Philippines and China. Factory Industial Engineering Supervisor Intel Corporation April 2001  –  February 2003  (1 year 11 months) Costa Rica Coordinated Costa Rica factory resource planning, from capital spending to space and headcount requirements. Weekly macro production resource allocations were provided to manufacturing for their shift execution. Factory Industial Engineer Busniness Analyst Intel Corporation February 2000  –  April 2001  (1 year 3 months) Phoenix, Arizona Area Partnered with global Industrial Engineers to develop a standardized methodology to compute factory requirements, including but limited to capital budgeting, space and headcount requirements, for the long term planning process (2-5 years). Factory Industial Engineer Intel Corporation March 1998  –  February 2000  (2 years) Costa Rica Managed the Costa Rica Factory (CR3) start up process, purchasing and importing capital equipment during the factory planning phase. Later on, the scope focused on space and headcount planning to meet weekly production output, by creating resource allocations by product. Manufacturing Manager Impresora Delta January 1995  –  February 1998  (3 years 2 months) LAR Talent Delivery (Staffing) Manager Intel Corporation January 2013  – Present (2 years 8 months) costa rica Manage Talent processes for Intel Corporation for the Latin America region, including external hiring and connecting internal career opportunities. LAR Talent Delivery (Staffing) Manager Intel Corporation January 2013  – Present (2 years 8 months) costa rica Manage Talent processes for Intel Corporation for the Latin America region, including external hiring and connecting internal career opportunities. Procurement Manager Intel Corporation October 2007  –  January 2013  (5 years 4 months) Costa Rica Managed a team of 15 people within Shared Service Center model, to procure goods and services for Intel's America Region (from Canada to Argentina). During my tenure, the service time (Requisition to Purchase Order creation) was reduced 75%, payment rework was reduced by 50% and started a discount negotiation process. Procurement Manager Intel Corporation October 2007  –  January 2013  (5 years 4 months) Costa Rica Managed a team of 15 people within Shared Service Center model, to procure goods and services for Intel's America Region (from Canada to Argentina). During my tenure, the service time (Requisition to Purchase Order creation) was reduced 75%, payment rework was reduced by 50% and started a discount negotiation process. Assembly Operations Industrial Engineer Manager Intel Corporation February 2003  –  October 2007  (4 years 9 months) Phoenix, Arizona Area Managed the factory resource planning process for all Intel's Assembly Factories globally, including capital spending, space planning and headcount planning. Standard methodology was proposed and implemented to ensure analysis consistency and repeatability, to enable what if scenario planning with a quick response time. I was based in Phoenix (Arizona) for about 4 years, interacting with professionals from Costa Rica, Malaysia, Philippines and China. Assembly Operations Industrial Engineer Manager Intel Corporation February 2003  –  October 2007  (4 years 9 months) Phoenix, Arizona Area Managed the factory resource planning process for all Intel's Assembly Factories globally, including capital spending, space planning and headcount planning. Standard methodology was proposed and implemented to ensure analysis consistency and repeatability, to enable what if scenario planning with a quick response time. I was based in Phoenix (Arizona) for about 4 years, interacting with professionals from Costa Rica, Malaysia, Philippines and China. Factory Industial Engineering Supervisor Intel Corporation April 2001  –  February 2003  (1 year 11 months) Costa Rica Coordinated Costa Rica factory resource planning, from capital spending to space and headcount requirements. Weekly macro production resource allocations were provided to manufacturing for their shift execution. Factory Industial Engineering Supervisor Intel Corporation April 2001  –  February 2003  (1 year 11 months) Costa Rica Coordinated Costa Rica factory resource planning, from capital spending to space and headcount requirements. Weekly macro production resource allocations were provided to manufacturing for their shift execution. Factory Industial Engineer Busniness Analyst Intel Corporation February 2000  –  April 2001  (1 year 3 months) Phoenix, Arizona Area Partnered with global Industrial Engineers to develop a standardized methodology to compute factory requirements, including but limited to capital budgeting, space and headcount requirements, for the long term planning process (2-5 years). Factory Industial Engineer Busniness Analyst Intel Corporation February 2000  –  April 2001  (1 year 3 months) Phoenix, Arizona Area Partnered with global Industrial Engineers to develop a standardized methodology to compute factory requirements, including but limited to capital budgeting, space and headcount requirements, for the long term planning process (2-5 years). Factory Industial Engineer Intel Corporation March 1998  –  February 2000  (2 years) Costa Rica Managed the Costa Rica Factory (CR3) start up process, purchasing and importing capital equipment during the factory planning phase. Later on, the scope focused on space and headcount planning to meet weekly production output, by creating resource allocations by product. Factory Industial Engineer Intel Corporation March 1998  –  February 2000  (2 years) Costa Rica Managed the Costa Rica Factory (CR3) start up process, purchasing and importing capital equipment during the factory planning phase. Later on, the scope focused on space and headcount planning to meet weekly production output, by creating resource allocations by product. Manufacturing Manager Impresora Delta January 1995  –  February 1998  (3 years 2 months) Manufacturing Manager Impresora Delta January 1995  –  February 1998  (3 years 2 months) Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Procurement Supply Chain Spend Analysis Supplier Development Supplier Evaluation Materials Management Cross-functional Team... Supplier Negotiation Purchasing Six Sigma Green Belt SME LEAN Expert Shared Service Center Factory Layout Planning Factory Resources... Strategic Planning Continuous Improvement Engineering Lean Manufacturing Semiconductor Industry Process Improvement Value Stream Mapping Intel Management Industrial Engineering SPC Six Sigma Sourcing Quality Management Teamwork Project Management Operations Management Leadership See 22+     See less Skills  Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Procurement Supply Chain Spend Analysis Supplier Development Supplier Evaluation Materials Management Cross-functional Team... Supplier Negotiation Purchasing Six Sigma Green Belt SME LEAN Expert Shared Service Center Factory Layout Planning Factory Resources... Strategic Planning Continuous Improvement Engineering Lean Manufacturing Semiconductor Industry Process Improvement Value Stream Mapping Intel Management Industrial Engineering SPC Six Sigma Sourcing Quality Management Teamwork Project Management Operations Management Leadership See 22+     See less Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Procurement Supply Chain Spend Analysis Supplier Development Supplier Evaluation Materials Management Cross-functional Team... Supplier Negotiation Purchasing Six Sigma Green Belt SME LEAN Expert Shared Service Center Factory Layout Planning Factory Resources... Strategic Planning Continuous Improvement Engineering Lean Manufacturing Semiconductor Industry Process Improvement Value Stream Mapping Intel Management Industrial Engineering SPC Six Sigma Sourcing Quality Management Teamwork Project Management Operations Management Leadership See 22+     See less Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Procurement Supply Chain Spend Analysis Supplier Development Supplier Evaluation Materials Management Cross-functional Team... Supplier Negotiation Purchasing Six Sigma Green Belt SME LEAN Expert Shared Service Center Factory Layout Planning Factory Resources... Strategic Planning Continuous Improvement Engineering Lean Manufacturing Semiconductor Industry Process Improvement Value Stream Mapping Intel Management Industrial Engineering SPC Six Sigma Sourcing Quality Management Teamwork Project Management Operations Management Leadership See 22+     See less Education Universidad Interamericana de Costa Rica Master's degree,  Business Administration , Management and Operations 1991  – 1993 Activities and Societies:  Master on Business Administration with Emphasis on Finance Universidad de Costa Rica Bachelor's degree,  Industrial Engineering 1985  – 1991 Activities and Societies:  Industrial Engineering Universidad Interamericana de Costa Rica Master's degree,  Business Administration , Management and Operations 1991  – 1993 Activities and Societies:  Master on Business Administration with Emphasis on Finance Universidad Interamericana de Costa Rica Master's degree,  Business Administration , Management and Operations 1991  – 1993 Activities and Societies:  Master on Business Administration with Emphasis on Finance Universidad Interamericana de Costa Rica Master's degree,  Business Administration , Management and Operations 1991  – 1993 Activities and Societies:  Master on Business Administration with Emphasis on Finance Universidad de Costa Rica Bachelor's degree,  Industrial Engineering 1985  – 1991 Activities and Societies:  Industrial Engineering Universidad de Costa Rica Bachelor's degree,  Industrial Engineering 1985  – 1991 Activities and Societies:  Industrial Engineering Universidad de Costa Rica Bachelor's degree,  Industrial Engineering 1985  – 1991 Activities and Societies:  Industrial Engineering ", "Experience Country Staffing Manager Intel Corporation February 2015  – Present (7 months) Chandler, AZ Diversity Talent Acquisition Manager Intel Corporation May 2013  – Present (2 years 4 months) Country Staffing Manager Intel Corporation February 2015  – Present (7 months) Chandler, AZ Country Staffing Manager Intel Corporation February 2015  – Present (7 months) Chandler, AZ Diversity Talent Acquisition Manager Intel Corporation May 2013  – Present (2 years 4 months) Diversity Talent Acquisition Manager Intel Corporation May 2013  – Present (2 years 4 months) ", "Experience HR Staffing Manager Intel Corporation September 2013  – Present (2 years) Managing a group responsible for US Talent Recruitment. LAR Talent Planning Manager Intel Corporation January 2012  –  September 2013  (1 year 9 months) Responsible for the hiring forecast in the Latin American Region. HR Staffing Manager Intel Corporation September 2013  – Present (2 years) Managing a group responsible for US Talent Recruitment. HR Staffing Manager Intel Corporation September 2013  – Present (2 years) Managing a group responsible for US Talent Recruitment. LAR Talent Planning Manager Intel Corporation January 2012  –  September 2013  (1 year 9 months) Responsible for the hiring forecast in the Latin American Region. LAR Talent Planning Manager Intel Corporation January 2012  –  September 2013  (1 year 9 months) Responsible for the hiring forecast in the Latin American Region. Skills Talent Management Workforce Planning Human Resources Interviews Performance Management Organizational... Career Development PeopleSoft Hiring Process Improvement Management Team Leadership Recruiting Leadership Cross-functional Team... Strategic Planning See 1+     See less Skills  Talent Management Workforce Planning Human Resources Interviews Performance Management Organizational... Career Development PeopleSoft Hiring Process Improvement Management Team Leadership Recruiting Leadership Cross-functional Team... Strategic Planning See 1+     See less Talent Management Workforce Planning Human Resources Interviews Performance Management Organizational... Career Development PeopleSoft Hiring Process Improvement Management Team Leadership Recruiting Leadership Cross-functional Team... Strategic Planning See 1+     See less Talent Management Workforce Planning Human Resources Interviews Performance Management Organizational... Career Development PeopleSoft Hiring Process Improvement Management Team Leadership Recruiting Leadership Cross-functional Team... Strategic Planning See 1+     See less Education UNED Master of Business Administration (MBA),  MBA 2014  – 2016 Universidad de Costa Rica Bachelor's degree,  Communication and Media Studies 1995  – 1999 UNED Master of Business Administration (MBA),  MBA 2014  – 2016 UNED Master of Business Administration (MBA),  MBA 2014  – 2016 UNED Master of Business Administration (MBA),  MBA 2014  – 2016 Universidad de Costa Rica Bachelor's degree,  Communication and Media Studies 1995  – 1999 Universidad de Costa Rica Bachelor's degree,  Communication and Media Studies 1995  – 1999 Universidad de Costa Rica Bachelor's degree,  Communication and Media Studies 1995  – 1999 ", "Skills College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding Skills  College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding ", "Skills Talent Management Human Resources Sourcing Technical Recruiting Recruiting Executive Search Talent Acquisition HR Consulting Management Temporary Placement Training Employer Branding Organizational... Employee Relations Workforce Planning Internet Recruiting Personnel Management Change Management Applicant Tracking... Strategic Sourcing Management Consulting Strategy Interviews Succession Planning Employee Engagement Onboarding Contract Recruitment HRIS Performance Management Deferred Compensation See 15+     See less Skills  Talent Management Human Resources Sourcing Technical Recruiting Recruiting Executive Search Talent Acquisition HR Consulting Management Temporary Placement Training Employer Branding Organizational... Employee Relations Workforce Planning Internet Recruiting Personnel Management Change Management Applicant Tracking... Strategic Sourcing Management Consulting Strategy Interviews Succession Planning Employee Engagement Onboarding Contract Recruitment HRIS Performance Management Deferred Compensation See 15+     See less Talent Management Human Resources Sourcing Technical Recruiting Recruiting Executive Search Talent Acquisition HR Consulting Management Temporary Placement Training Employer Branding Organizational... Employee Relations Workforce Planning Internet Recruiting Personnel Management Change Management Applicant Tracking... Strategic Sourcing Management Consulting Strategy Interviews Succession Planning Employee Engagement Onboarding Contract Recruitment HRIS Performance Management Deferred Compensation See 15+     See less Talent Management Human Resources Sourcing Technical Recruiting Recruiting Executive Search Talent Acquisition HR Consulting Management Temporary Placement Training Employer Branding Organizational... Employee Relations Workforce Planning Internet Recruiting Personnel Management Change Management Applicant Tracking... Strategic Sourcing Management Consulting Strategy Interviews Succession Planning Employee Engagement Onboarding Contract Recruitment HRIS Performance Management Deferred Compensation See 15+     See less ", "Summary Whatsappable at: +60124310695 / yee.zer.ng@intel.com \n \nSr HR Talent Manager for Intel's fastest growing region.  \nStrong business+finance acumen with people and customer orientation. 14 years of combined people & business management experience with global exposure across US, Europe, and Asia. Multilingual and MENSA certified. \n \nExperienced in multiple spectrum of Global Talent Management (Talent Acquisition, 5B Planning, People Movement and Internal Talent Marketplace). \n \nSpecialties: Areas of expertise: Internal Talent Marketplace Implementation Strategies, Corporate Redeployments, Career Profiling, Employee Onboarding and Integration, 5B Talent Planning, Boudreau Talentship Model Expertise, Consumer Electronics, Service Desk, HR, Professional Service Delivery, Account Management, Talent Acquisition, TalentCorp, CREST and gov partnerships, corp IT infrastructure. \nFranklin Covey Certified: Intel Facilitator for 7 Habits of Highly Effective People \nPioneer facilitator for Intel's Strengthening Managerial Skills Workshop and 6 term facilitator for the Management Through People Bootcamp. Summary Whatsappable at: +60124310695 / yee.zer.ng@intel.com \n \nSr HR Talent Manager for Intel's fastest growing region.  \nStrong business+finance acumen with people and customer orientation. 14 years of combined people & business management experience with global exposure across US, Europe, and Asia. Multilingual and MENSA certified. \n \nExperienced in multiple spectrum of Global Talent Management (Talent Acquisition, 5B Planning, People Movement and Internal Talent Marketplace). \n \nSpecialties: Areas of expertise: Internal Talent Marketplace Implementation Strategies, Corporate Redeployments, Career Profiling, Employee Onboarding and Integration, 5B Talent Planning, Boudreau Talentship Model Expertise, Consumer Electronics, Service Desk, HR, Professional Service Delivery, Account Management, Talent Acquisition, TalentCorp, CREST and gov partnerships, corp IT infrastructure. \nFranklin Covey Certified: Intel Facilitator for 7 Habits of Highly Effective People \nPioneer facilitator for Intel's Strengthening Managerial Skills Workshop and 6 term facilitator for the Management Through People Bootcamp. Whatsappable at: +60124310695 / yee.zer.ng@intel.com \n \nSr HR Talent Manager for Intel's fastest growing region.  \nStrong business+finance acumen with people and customer orientation. 14 years of combined people & business management experience with global exposure across US, Europe, and Asia. Multilingual and MENSA certified. \n \nExperienced in multiple spectrum of Global Talent Management (Talent Acquisition, 5B Planning, People Movement and Internal Talent Marketplace). \n \nSpecialties: Areas of expertise: Internal Talent Marketplace Implementation Strategies, Corporate Redeployments, Career Profiling, Employee Onboarding and Integration, 5B Talent Planning, Boudreau Talentship Model Expertise, Consumer Electronics, Service Desk, HR, Professional Service Delivery, Account Management, Talent Acquisition, TalentCorp, CREST and gov partnerships, corp IT infrastructure. \nFranklin Covey Certified: Intel Facilitator for 7 Habits of Highly Effective People \nPioneer facilitator for Intel's Strengthening Managerial Skills Workshop and 6 term facilitator for the Management Through People Bootcamp. Whatsappable at: +60124310695 / yee.zer.ng@intel.com \n \nSr HR Talent Manager for Intel's fastest growing region.  \nStrong business+finance acumen with people and customer orientation. 14 years of combined people & business management experience with global exposure across US, Europe, and Asia. Multilingual and MENSA certified. \n \nExperienced in multiple spectrum of Global Talent Management (Talent Acquisition, 5B Planning, People Movement and Internal Talent Marketplace). \n \nSpecialties: Areas of expertise: Internal Talent Marketplace Implementation Strategies, Corporate Redeployments, Career Profiling, Employee Onboarding and Integration, 5B Talent Planning, Boudreau Talentship Model Expertise, Consumer Electronics, Service Desk, HR, Professional Service Delivery, Account Management, Talent Acquisition, TalentCorp, CREST and gov partnerships, corp IT infrastructure. \nFranklin Covey Certified: Intel Facilitator for 7 Habits of Highly Effective People \nPioneer facilitator for Intel's Strengthening Managerial Skills Workshop and 6 term facilitator for the Management Through People Bootcamp. Experience Greater Asia Region Talent Marketplace Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Penang (Malaysia) and Virtual Asia. Responsible for the internal Talent Marketplace in Asia encompassing Corporate People Movement, Onboarding & Integration Program Management, and Internal Career Mobility. Introduced into Asia multiple employee engagement programs including a crowd sourced Career Advisor Network, virtual reality Career Event, a ‘WOW’ New Employee Integration System and getting a regionally dispersed integration processes into a globally BPM L4 compliant reusable process library. Greater Asia Region Talent Planning Manager Intel Corporation October 2012  –  April 2014  (1 year 7 months) Asia Deep expertise on the Boudreau HC BRidge Talentship framework, 5B model and Strategic Pivot Points. Delivered multiple Strategic Business Plans to solve Intel's key imperatives challenges in 2012-2014. Responsible as an Internal Subject Matter Expert and played multiple roles including as a business consultant, peer coach to global Talent Planners, subject trainer and advisor for Asia business operations. Intel Architecture Group Staffing Manager Intel Corporation April 2010  –  September 2012  (2 years 6 months) Penang, Malaysia Responsible for the Talent Acquisition Strategic and Workforce Plan for Intel Architecture Group's largest offshore design and developnent site. Worked with TalentCorp and led multiple recruitment programs to attract talents from around the world. Well versed business acumen on the global technology industry. Malaysia HR Staffing Accounts Manager Intel November 2008  –  March 2010  (1 year 5 months) Accountable to Intel's mutiple business groups in Talent Acquisition and Delivery for Intel's largest offshore site. Led the Staffing Accounts Team to multiple successful global TAPs (Talent Acquisition Plans) for niche technical skills. Partnered different HR functions to deliver holistic Workforce Plans and intervention strategies. Global Service Desk Quality and 2nd Level Manager Intel 2006  –  October 2008  (2 years) Managing a team of 2nd Level IT Support Specialist and Quality Monitoring Agents for Intel's Global Service Desk. ITIL and HDI certified. Global Service Delivery Manager Intel 2004  –  2006  (2 years) Accountable for the delivery of Service Desk support to the largest business group in Intel (Technology Manufacturing Group) and managing 35-40 agents in the Global Office Service Desk team. Front Line Supervisor Intel 2003  –  2004  (1 year) Team Manager for a Service Desk sr team with 2 Team Leaders directly reporting to me. Managing 5 business line accounts consisting of 100+ Pay Per View Applications, including Core Business Services. Responsible for overall day to day Contractor Vendor/Supplier Management for 2 large service providers. Greater Asia Region Talent Marketplace Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Penang (Malaysia) and Virtual Asia. Responsible for the internal Talent Marketplace in Asia encompassing Corporate People Movement, Onboarding & Integration Program Management, and Internal Career Mobility. Introduced into Asia multiple employee engagement programs including a crowd sourced Career Advisor Network, virtual reality Career Event, a ‘WOW’ New Employee Integration System and getting a regionally dispersed integration processes into a globally BPM L4 compliant reusable process library. Greater Asia Region Talent Marketplace Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Penang (Malaysia) and Virtual Asia. Responsible for the internal Talent Marketplace in Asia encompassing Corporate People Movement, Onboarding & Integration Program Management, and Internal Career Mobility. Introduced into Asia multiple employee engagement programs including a crowd sourced Career Advisor Network, virtual reality Career Event, a ‘WOW’ New Employee Integration System and getting a regionally dispersed integration processes into a globally BPM L4 compliant reusable process library. Greater Asia Region Talent Planning Manager Intel Corporation October 2012  –  April 2014  (1 year 7 months) Asia Deep expertise on the Boudreau HC BRidge Talentship framework, 5B model and Strategic Pivot Points. Delivered multiple Strategic Business Plans to solve Intel's key imperatives challenges in 2012-2014. Responsible as an Internal Subject Matter Expert and played multiple roles including as a business consultant, peer coach to global Talent Planners, subject trainer and advisor for Asia business operations. Greater Asia Region Talent Planning Manager Intel Corporation October 2012  –  April 2014  (1 year 7 months) Asia Deep expertise on the Boudreau HC BRidge Talentship framework, 5B model and Strategic Pivot Points. Delivered multiple Strategic Business Plans to solve Intel's key imperatives challenges in 2012-2014. Responsible as an Internal Subject Matter Expert and played multiple roles including as a business consultant, peer coach to global Talent Planners, subject trainer and advisor for Asia business operations. Intel Architecture Group Staffing Manager Intel Corporation April 2010  –  September 2012  (2 years 6 months) Penang, Malaysia Responsible for the Talent Acquisition Strategic and Workforce Plan for Intel Architecture Group's largest offshore design and developnent site. Worked with TalentCorp and led multiple recruitment programs to attract talents from around the world. Well versed business acumen on the global technology industry. Intel Architecture Group Staffing Manager Intel Corporation April 2010  –  September 2012  (2 years 6 months) Penang, Malaysia Responsible for the Talent Acquisition Strategic and Workforce Plan for Intel Architecture Group's largest offshore design and developnent site. Worked with TalentCorp and led multiple recruitment programs to attract talents from around the world. Well versed business acumen on the global technology industry. Malaysia HR Staffing Accounts Manager Intel November 2008  –  March 2010  (1 year 5 months) Accountable to Intel's mutiple business groups in Talent Acquisition and Delivery for Intel's largest offshore site. Led the Staffing Accounts Team to multiple successful global TAPs (Talent Acquisition Plans) for niche technical skills. Partnered different HR functions to deliver holistic Workforce Plans and intervention strategies. Malaysia HR Staffing Accounts Manager Intel November 2008  –  March 2010  (1 year 5 months) Accountable to Intel's mutiple business groups in Talent Acquisition and Delivery for Intel's largest offshore site. Led the Staffing Accounts Team to multiple successful global TAPs (Talent Acquisition Plans) for niche technical skills. Partnered different HR functions to deliver holistic Workforce Plans and intervention strategies. Global Service Desk Quality and 2nd Level Manager Intel 2006  –  October 2008  (2 years) Managing a team of 2nd Level IT Support Specialist and Quality Monitoring Agents for Intel's Global Service Desk. ITIL and HDI certified. Global Service Desk Quality and 2nd Level Manager Intel 2006  –  October 2008  (2 years) Managing a team of 2nd Level IT Support Specialist and Quality Monitoring Agents for Intel's Global Service Desk. ITIL and HDI certified. Global Service Delivery Manager Intel 2004  –  2006  (2 years) Accountable for the delivery of Service Desk support to the largest business group in Intel (Technology Manufacturing Group) and managing 35-40 agents in the Global Office Service Desk team. Global Service Delivery Manager Intel 2004  –  2006  (2 years) Accountable for the delivery of Service Desk support to the largest business group in Intel (Technology Manufacturing Group) and managing 35-40 agents in the Global Office Service Desk team. Front Line Supervisor Intel 2003  –  2004  (1 year) Team Manager for a Service Desk sr team with 2 Team Leaders directly reporting to me. Managing 5 business line accounts consisting of 100+ Pay Per View Applications, including Core Business Services. Responsible for overall day to day Contractor Vendor/Supplier Management for 2 large service providers. Front Line Supervisor Intel 2003  –  2004  (1 year) Team Manager for a Service Desk sr team with 2 Team Leaders directly reporting to me. Managing 5 business line accounts consisting of 100+ Pay Per View Applications, including Core Business Services. Responsible for overall day to day Contractor Vendor/Supplier Management for 2 large service providers. Languages Chinese Native or bilingual proficiency English Native or bilingual proficiency Malay Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Malay Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Malay Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Program Management Human Resources Change Management Process Improvement Talent Acquisition Cross-functional Team... Project Management Performance Management Six Sigma Team Leadership Operations Management Team Building Team Management Employee Relations Management Strategic Planning Manufacturing Coaching Stakeholder Management Recruiting Organizational... Strategy ITIL Leadership Account Management Sourcing Talent Management Business Process... Training Outsourcing Management Consulting Project Planning Business Development Global Talent... Vendor Management See 20+     See less Skills  Program Management Human Resources Change Management Process Improvement Talent Acquisition Cross-functional Team... Project Management Performance Management Six Sigma Team Leadership Operations Management Team Building Team Management Employee Relations Management Strategic Planning Manufacturing Coaching Stakeholder Management Recruiting Organizational... Strategy ITIL Leadership Account Management Sourcing Talent Management Business Process... Training Outsourcing Management Consulting Project Planning Business Development Global Talent... Vendor Management See 20+     See less Program Management Human Resources Change Management Process Improvement Talent Acquisition Cross-functional Team... Project Management Performance Management Six Sigma Team Leadership Operations Management Team Building Team Management Employee Relations Management Strategic Planning Manufacturing Coaching Stakeholder Management Recruiting Organizational... Strategy ITIL Leadership Account Management Sourcing Talent Management Business Process... Training Outsourcing Management Consulting Project Planning Business Development Global Talent... Vendor Management See 20+     See less Program Management Human Resources Change Management Process Improvement Talent Acquisition Cross-functional Team... Project Management Performance Management Six Sigma Team Leadership Operations Management Team Building Team Management Employee Relations Management Strategic Planning Manufacturing Coaching Stakeholder Management Recruiting Organizational... Strategy ITIL Leadership Account Management Sourcing Talent Management Business Process... Training Outsourcing Management Consulting Project Planning Business Development Global Talent... Vendor Management See 20+     See less "]}