{"position": "Strategic Planner", "company": "Intel Corporation", "profiles": ["Experience Senior Strategic Planner Intel Corporation October 2011  – Present (3 years 11 months) Portland, Oregon Area Senior Strategic Planner Intel Corporation October 2011  – Present (3 years 11 months) Portland, Oregon Area Senior Strategic Planner Intel Corporation October 2011  – Present (3 years 11 months) Portland, Oregon Area Skills Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less Skills  Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less ", "Skills Quantitative Research User Experience Video Quality Visual Perception Non-Functional... Key Performance... Qualitative Research Cognitive Psychology Statistical Modeling Data Analysis Competitive Analysis Software Engineering Human Computer... Embedded Systems Research Design Usability Testing Semiconductors Machine Learning Experimental Design Algorithms Computer Science User-centered Design Human Factors Computer Vision See 9+     See less Skills  Quantitative Research User Experience Video Quality Visual Perception Non-Functional... Key Performance... Qualitative Research Cognitive Psychology Statistical Modeling Data Analysis Competitive Analysis Software Engineering Human Computer... Embedded Systems Research Design Usability Testing Semiconductors Machine Learning Experimental Design Algorithms Computer Science User-centered Design Human Factors Computer Vision See 9+     See less Quantitative Research User Experience Video Quality Visual Perception Non-Functional... Key Performance... Qualitative Research Cognitive Psychology Statistical Modeling Data Analysis Competitive Analysis Software Engineering Human Computer... Embedded Systems Research Design Usability Testing Semiconductors Machine Learning Experimental Design Algorithms Computer Science User-centered Design Human Factors Computer Vision See 9+     See less Quantitative Research User Experience Video Quality Visual Perception Non-Functional... Key Performance... Qualitative Research Cognitive Psychology Statistical Modeling Data Analysis Competitive Analysis Software Engineering Human Computer... Embedded Systems Research Design Usability Testing Semiconductors Machine Learning Experimental Design Algorithms Computer Science User-centered Design Human Factors Computer Vision See 9+     See less ", "Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency German Professional working proficiency French Professional working proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency German Professional working proficiency French Professional working proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency German Professional working proficiency French Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Data, Voice, Video... Service & Support Product Management Marketing Engineering Software IPTV Wireless Telecommunications Product Marketing IP Ethernet Start-ups Strategic Partnerships VoIP Channel Video Networking Data Center Switches Routing TCP/IP L2/L3 protocols Business Services CMTS Strategy Networking Program Management See 12+     See less Skills  Data, Voice, Video... Service & Support Product Management Marketing Engineering Software IPTV Wireless Telecommunications Product Marketing IP Ethernet Start-ups Strategic Partnerships VoIP Channel Video Networking Data Center Switches Routing TCP/IP L2/L3 protocols Business Services CMTS Strategy Networking Program Management See 12+     See less Data, Voice, Video... Service & Support Product Management Marketing Engineering Software IPTV Wireless Telecommunications Product Marketing IP Ethernet Start-ups Strategic Partnerships VoIP Channel Video Networking Data Center Switches Routing TCP/IP L2/L3 protocols Business Services CMTS Strategy Networking Program Management See 12+     See less Data, Voice, Video... Service & Support Product Management Marketing Engineering Software IPTV Wireless Telecommunications Product Marketing IP Ethernet Start-ups Strategic Partnerships VoIP Channel Video Networking Data Center Switches Routing TCP/IP L2/L3 protocols Business Services CMTS Strategy Networking Program Management See 12+     See less ", "Summary Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Summary Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Semiconductor industry program manager with a proven track record for solving business problems using financial, analytical and strategic thinking skills. Dynamic and influential speaker; outstanding team leader. Specialties:Device interoperability, Desktop platform market analysis, Competitive performance analysis, Product Marketing and Product Management, Fab process affordability and ramp management, Semiconductor processing (specifically plasma etch, PVD, CVD and electroplating) Experience Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Defining next generation Xeon CPU and platform capabilities supporting key Datacenter segments, including Cloud, Enterprise, Technical Computing and Intelligent Systems. All-in-One Segment Manager Intel Corporation March 2012  –  July 2013  (1 year 5 months) Portland, Oregon Area Led a cross-organizational effort to reinvigorate the desktop PC market and accelerate consumer refresh. Engaged with OEM customers to identify compelling user experiences which fulfill consumers’ unmet needs. Defined product specifications that deliver targeted experiences, based upon customer input and feedback. Won multiple designs with each of the top All-in-One OEMs worldwide. Managed AIO business for Intel (including a direct report team of Product Marketing Engineers), coordinating efforts of Engineering, Customer Enabling, Product Marketing, Corporate Marketing and Strategic Planning. Established volume goals and drove cross-Intel execution to meet them. PCCG Director of Compute Continuum Intel January 2011  –  March 2012  (1 year 3 months) Hillsboro, OR Lead Intel-wide initiative to deliver cross-device user experiences. Forged executive consensus on strategies to increase PC relevance, gain marketshare in adjacent markets and grow revenue beyond silicon via Compute Continuum CSD. Delivered products to market (Common Connectivity Framework middleware, Intel® Pair & Share, Intel® TelePort Extender) by managing engineering execution and product marketing. Defined next-generation solutions for device-to-device connectivity (CCF2.0) and showcase app (My Media Library); aligned PCCG via PLBP and scoped budgets via Plan process. Desktop Platform Roadmap Manager Intel June 2006  –  January 2011  (4 years 8 months) Drove strategies and plans to maximize margins for Intel’s $12B Desktop platform business. Defined and championed the “Differentiated Desktop” business segmentation strategy. Secured funding and drove execution; met or exceeded business goals. Transformed Intel’s internal Desktop CPU Roadmap into a competitive performance analysis engine and utilized it to drive business strategies and product capabilities. Product Manager Intel August 2005  –  June 2006  (11 months) Drove Product Development Teams to bring new CPUs to market and meet customer requirements. Led Problem Response Teams to contain and determine root cause of escaped discrepant material. Managed external communications with customers. Process Technology Program Manager Intel Corporation February 2003  –  August 2005  (2 years 7 months) Hillsboro, OR Matrix managed TME (1000 person org) to deliver affordable, ramp-ready process technologies. Created systems and business processes to collect affordability data, measure performance-to-goal and provide closed loop feedback to customers and stakeholders. Drove ramp readiness risk assessment and gap closure for each toolset in the process flow. Group Leader Intel April 1999  –  August 2005  (6 years 5 months) Managed a team of 6-8 engineers to select, develop and ramp metal deposition equipment. Facilitated employee development and growth, wrote and delivered performance reviews, managed staffing and employee performance to meet group deliverables. Managed Intel/supplier business relationships and negotiated commercial deals. Sr. Process Engineer Intel February 1995  –  April 1999  (4 years 3 months) Santa Clara, CA Selected, developed and ramped plasma etch, CVD and PVD process equipment for advanced semiconductor process nodes. Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Defining next generation Xeon CPU and platform capabilities supporting key Datacenter segments, including Cloud, Enterprise, Technical Computing and Intelligent Systems. Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Defining next generation Xeon CPU and platform capabilities supporting key Datacenter segments, including Cloud, Enterprise, Technical Computing and Intelligent Systems. All-in-One Segment Manager Intel Corporation March 2012  –  July 2013  (1 year 5 months) Portland, Oregon Area Led a cross-organizational effort to reinvigorate the desktop PC market and accelerate consumer refresh. Engaged with OEM customers to identify compelling user experiences which fulfill consumers’ unmet needs. Defined product specifications that deliver targeted experiences, based upon customer input and feedback. Won multiple designs with each of the top All-in-One OEMs worldwide. Managed AIO business for Intel (including a direct report team of Product Marketing Engineers), coordinating efforts of Engineering, Customer Enabling, Product Marketing, Corporate Marketing and Strategic Planning. Established volume goals and drove cross-Intel execution to meet them. All-in-One Segment Manager Intel Corporation March 2012  –  July 2013  (1 year 5 months) Portland, Oregon Area Led a cross-organizational effort to reinvigorate the desktop PC market and accelerate consumer refresh. Engaged with OEM customers to identify compelling user experiences which fulfill consumers’ unmet needs. Defined product specifications that deliver targeted experiences, based upon customer input and feedback. Won multiple designs with each of the top All-in-One OEMs worldwide. Managed AIO business for Intel (including a direct report team of Product Marketing Engineers), coordinating efforts of Engineering, Customer Enabling, Product Marketing, Corporate Marketing and Strategic Planning. Established volume goals and drove cross-Intel execution to meet them. PCCG Director of Compute Continuum Intel January 2011  –  March 2012  (1 year 3 months) Hillsboro, OR Lead Intel-wide initiative to deliver cross-device user experiences. Forged executive consensus on strategies to increase PC relevance, gain marketshare in adjacent markets and grow revenue beyond silicon via Compute Continuum CSD. Delivered products to market (Common Connectivity Framework middleware, Intel® Pair & Share, Intel® TelePort Extender) by managing engineering execution and product marketing. Defined next-generation solutions for device-to-device connectivity (CCF2.0) and showcase app (My Media Library); aligned PCCG via PLBP and scoped budgets via Plan process. PCCG Director of Compute Continuum Intel January 2011  –  March 2012  (1 year 3 months) Hillsboro, OR Lead Intel-wide initiative to deliver cross-device user experiences. Forged executive consensus on strategies to increase PC relevance, gain marketshare in adjacent markets and grow revenue beyond silicon via Compute Continuum CSD. Delivered products to market (Common Connectivity Framework middleware, Intel® Pair & Share, Intel® TelePort Extender) by managing engineering execution and product marketing. Defined next-generation solutions for device-to-device connectivity (CCF2.0) and showcase app (My Media Library); aligned PCCG via PLBP and scoped budgets via Plan process. Desktop Platform Roadmap Manager Intel June 2006  –  January 2011  (4 years 8 months) Drove strategies and plans to maximize margins for Intel’s $12B Desktop platform business. Defined and championed the “Differentiated Desktop” business segmentation strategy. Secured funding and drove execution; met or exceeded business goals. Transformed Intel’s internal Desktop CPU Roadmap into a competitive performance analysis engine and utilized it to drive business strategies and product capabilities. Desktop Platform Roadmap Manager Intel June 2006  –  January 2011  (4 years 8 months) Drove strategies and plans to maximize margins for Intel’s $12B Desktop platform business. Defined and championed the “Differentiated Desktop” business segmentation strategy. Secured funding and drove execution; met or exceeded business goals. Transformed Intel’s internal Desktop CPU Roadmap into a competitive performance analysis engine and utilized it to drive business strategies and product capabilities. Product Manager Intel August 2005  –  June 2006  (11 months) Drove Product Development Teams to bring new CPUs to market and meet customer requirements. Led Problem Response Teams to contain and determine root cause of escaped discrepant material. Managed external communications with customers. Product Manager Intel August 2005  –  June 2006  (11 months) Drove Product Development Teams to bring new CPUs to market and meet customer requirements. Led Problem Response Teams to contain and determine root cause of escaped discrepant material. Managed external communications with customers. Process Technology Program Manager Intel Corporation February 2003  –  August 2005  (2 years 7 months) Hillsboro, OR Matrix managed TME (1000 person org) to deliver affordable, ramp-ready process technologies. Created systems and business processes to collect affordability data, measure performance-to-goal and provide closed loop feedback to customers and stakeholders. Drove ramp readiness risk assessment and gap closure for each toolset in the process flow. Process Technology Program Manager Intel Corporation February 2003  –  August 2005  (2 years 7 months) Hillsboro, OR Matrix managed TME (1000 person org) to deliver affordable, ramp-ready process technologies. Created systems and business processes to collect affordability data, measure performance-to-goal and provide closed loop feedback to customers and stakeholders. Drove ramp readiness risk assessment and gap closure for each toolset in the process flow. Group Leader Intel April 1999  –  August 2005  (6 years 5 months) Managed a team of 6-8 engineers to select, develop and ramp metal deposition equipment. Facilitated employee development and growth, wrote and delivered performance reviews, managed staffing and employee performance to meet group deliverables. Managed Intel/supplier business relationships and negotiated commercial deals. Group Leader Intel April 1999  –  August 2005  (6 years 5 months) Managed a team of 6-8 engineers to select, develop and ramp metal deposition equipment. Facilitated employee development and growth, wrote and delivered performance reviews, managed staffing and employee performance to meet group deliverables. Managed Intel/supplier business relationships and negotiated commercial deals. Sr. Process Engineer Intel February 1995  –  April 1999  (4 years 3 months) Santa Clara, CA Selected, developed and ramped plasma etch, CVD and PVD process equipment for advanced semiconductor process nodes. Sr. Process Engineer Intel February 1995  –  April 1999  (4 years 3 months) Santa Clara, CA Selected, developed and ramped plasma etch, CVD and PVD process equipment for advanced semiconductor process nodes. Skills Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Skills  Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Leadership Strategic Thinking Business Analysis Product Marketing Business Strategy Intel Semiconductor... Semiconductors Process Development Product Development Strategy Cloud Computing Enterprise Software Product Management Management Cross-functional Team... Semiconductor Industry Competitive Analysis See 3+     See less Education University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Wisconsin-Madison M.S.,  Physical Chemistry 1991  – 1994 Designed, constructed and debugged an Ultra High Vacuum Scanning Tunneling Microscope. University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi University of Colorado at Boulder B.S.,  Chemical Engineering 1986  – 1991 Investigated halogen etching reactions on silicon substrates using molecular beam techniques. Activities and Societies:  Tau Beta Pi Honors & Awards Additional Honors & Awards Intel Achievement Award, 2011 Additional Honors & Awards Intel Achievement Award, 2011 Additional Honors & Awards Intel Achievement Award, 2011 Additional Honors & Awards Intel Achievement Award, 2011 ", "Experience Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Strategic Planner Intel Corporation July 2013  – Present (2 years 2 months) Skills Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less Skills  Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less Ethernet Product Marketing VLSI Product Development Problem Solving Competitive Analysis Verilog Product Planning Product Strategy Strategic Planning Embedded Systems Product Management Semiconductors Intel Telecommunications Strategy SoC See 2+     See less ", "Experience Strategic Planner Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Cloud orchestration and software defined infrastructure solutions planning for the Intel Datacenter Group. Business Development Mngr Intel Corp. 2007  –  February 2014  (7 years) Portland, Oregon Area Product Marketing Engineer Intel 2005  –  2007  (2 years) Business Analyst Intel 2004  –  2005  (1 year) Portland, Oregon Area Engineering Program Manager Intel 2002  –  2004  (2 years) Manufacturing Program Manager Intel 2000  –  2002  (2 years) Strategic Planner Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Cloud orchestration and software defined infrastructure solutions planning for the Intel Datacenter Group. Strategic Planner Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Cloud orchestration and software defined infrastructure solutions planning for the Intel Datacenter Group. Business Development Mngr Intel Corp. 2007  –  February 2014  (7 years) Portland, Oregon Area Business Development Mngr Intel Corp. 2007  –  February 2014  (7 years) Portland, Oregon Area Product Marketing Engineer Intel 2005  –  2007  (2 years) Product Marketing Engineer Intel 2005  –  2007  (2 years) Business Analyst Intel 2004  –  2005  (1 year) Portland, Oregon Area Business Analyst Intel 2004  –  2005  (1 year) Portland, Oregon Area Engineering Program Manager Intel 2002  –  2004  (2 years) Engineering Program Manager Intel 2002  –  2004  (2 years) Manufacturing Program Manager Intel 2000  –  2002  (2 years) Manufacturing Program Manager Intel 2000  –  2002  (2 years) Skills Semiconductors Cross-functional Team... Product Marketing Product Management Product Development Product Lifecycle... Go-to-market Strategy Intel Program Management Competitive Analysis Electronics Product Launch Semiconductor Industry Embedded Systems Strategic Partnerships Cloud Computing See 1+     See less Skills  Semiconductors Cross-functional Team... Product Marketing Product Management Product Development Product Lifecycle... Go-to-market Strategy Intel Program Management Competitive Analysis Electronics Product Launch Semiconductor Industry Embedded Systems Strategic Partnerships Cloud Computing See 1+     See less Semiconductors Cross-functional Team... Product Marketing Product Management Product Development Product Lifecycle... Go-to-market Strategy Intel Program Management Competitive Analysis Electronics Product Launch Semiconductor Industry Embedded Systems Strategic Partnerships Cloud Computing See 1+     See less Semiconductors Cross-functional Team... Product Marketing Product Management Product Development Product Lifecycle... Go-to-market Strategy Intel Program Management Competitive Analysis Electronics Product Launch Semiconductor Industry Embedded Systems Strategic Partnerships Cloud Computing See 1+     See less Education University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration and Management , General 1998  – 2000 The University of Georgia BS,  Physics 1991  – 1994 St. Christopher's School 1985  – 1989 University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration and Management , General 1998  – 2000 University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration and Management , General 1998  – 2000 University of Oregon - Charles H. Lundquist College of Business MBA,  Business Administration and Management , General 1998  – 2000 The University of Georgia BS,  Physics 1991  – 1994 The University of Georgia BS,  Physics 1991  – 1994 The University of Georgia BS,  Physics 1991  – 1994 St. Christopher's School 1985  – 1989 St. Christopher's School 1985  – 1989 St. Christopher's School 1985  – 1989 ", "Skills Cross-functional Team... Product Management Process Improvement Integration Enterprise Software IT Management Leadership System Architecture Enterprise Architecture Team Management Management Intel Semiconductors Strategy Product Development Software Project... Software Development Competitive Analysis Program Management SPC Logistics Supply Chain Management Cloud Computing SAP Requirements Analysis Materials Management Manufacturing Process Engineering Vendor Management Testing Engineering Management Embedded Systems SDLC Team Leadership Product Lifecycle... Master Data Management Business Intelligence Project Management Lean Manufacturing Business Process... Continuous Improvement Agile Methodologies ERP Technical Marketing Product Marketing PMP Business Analysis See 32+     See less Skills  Cross-functional Team... Product Management Process Improvement Integration Enterprise Software IT Management Leadership System Architecture Enterprise Architecture Team Management Management Intel Semiconductors Strategy Product Development Software Project... Software Development Competitive Analysis Program Management SPC Logistics Supply Chain Management Cloud Computing SAP Requirements Analysis Materials Management Manufacturing Process Engineering Vendor Management Testing Engineering Management Embedded Systems SDLC Team Leadership Product Lifecycle... Master Data Management Business Intelligence Project Management Lean Manufacturing Business Process... Continuous Improvement Agile Methodologies ERP Technical Marketing Product Marketing PMP Business Analysis See 32+     See less Cross-functional Team... Product Management Process Improvement Integration Enterprise Software IT Management Leadership System Architecture Enterprise Architecture Team Management Management Intel Semiconductors Strategy Product Development Software Project... Software Development Competitive Analysis Program Management SPC Logistics Supply Chain Management Cloud Computing SAP Requirements Analysis Materials Management Manufacturing Process Engineering Vendor Management Testing Engineering Management Embedded Systems SDLC Team Leadership Product Lifecycle... Master Data Management Business Intelligence Project Management Lean Manufacturing Business Process... Continuous Improvement Agile Methodologies ERP Technical Marketing Product Marketing PMP Business Analysis See 32+     See less Cross-functional Team... Product Management Process Improvement Integration Enterprise Software IT Management Leadership System Architecture Enterprise Architecture Team Management Management Intel Semiconductors Strategy Product Development Software Project... Software Development Competitive Analysis Program Management SPC Logistics Supply Chain Management Cloud Computing SAP Requirements Analysis Materials Management Manufacturing Process Engineering Vendor Management Testing Engineering Management Embedded Systems SDLC Team Leadership Product Lifecycle... Master Data Management Business Intelligence Project Management Lean Manufacturing Business Process... Continuous Improvement Agile Methodologies ERP Technical Marketing Product Marketing PMP Business Analysis See 32+     See less ", "Skills Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less Skills  Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less ", "Experience EMEA Real Estate Strategic Planner Intel Corporation May 2014  – Present (1 year 4 months) ISR Construction Project Office manager (PMO) Intel Corporation January 2013  –  May 2014  (1 year 5 months) ISR Israel Construction enterprise business operation manger Intel January 2010  –  May 2014  (4 years 5 months) Israel R&D Control lead Intel March 2008  –  December 2009  (1 year 10 months) Provide leadership to establish and maintain a consistent risk management framework for the respective R&D opertions: lead risk management planning; comprehends environment; emerging risks and drives/influences mitigation risk. Senior Strategic Finance Analyst Intel March 2008  –  March 2009  (1 year 1 month) ISR F&A People Segment team memeber Intel 2004  –  2009  (5 years) Finance Manager Intel May 2002  –  March 2008  (5 years 11 months) •Managing a team of 5 analysts and providing financial support for the EMEA corporate services, people management, analyst development, building team capability, executing business process excellence, and co-leading, with the operations Directors, many cost reduction forums targeted at maximizing gross margins.  \n•Proactively engage with site Ops/VF Finance and Ops counterparts in setting clear goals and aligning on finance agenda while thriving well under ambiguous environment \nTeam financial capabilities include Close, POR/PLAN process while driving disciplined cost reduction to achieve organization spending/ROIC target. \n•Managing the Real Estate financial evaluation/selection of new property development for existing and new real estate/infrastructure office site projects across the EMEA region. EMEA Real Estate Strategic Planner Intel Corporation May 2014  – Present (1 year 4 months) EMEA Real Estate Strategic Planner Intel Corporation May 2014  – Present (1 year 4 months) ISR Construction Project Office manager (PMO) Intel Corporation January 2013  –  May 2014  (1 year 5 months) ISR ISR Construction Project Office manager (PMO) Intel Corporation January 2013  –  May 2014  (1 year 5 months) ISR Israel Construction enterprise business operation manger Intel January 2010  –  May 2014  (4 years 5 months) Israel Construction enterprise business operation manger Intel January 2010  –  May 2014  (4 years 5 months) Israel R&D Control lead Intel March 2008  –  December 2009  (1 year 10 months) Provide leadership to establish and maintain a consistent risk management framework for the respective R&D opertions: lead risk management planning; comprehends environment; emerging risks and drives/influences mitigation risk. Israel R&D Control lead Intel March 2008  –  December 2009  (1 year 10 months) Provide leadership to establish and maintain a consistent risk management framework for the respective R&D opertions: lead risk management planning; comprehends environment; emerging risks and drives/influences mitigation risk. Senior Strategic Finance Analyst Intel March 2008  –  March 2009  (1 year 1 month) Senior Strategic Finance Analyst Intel March 2008  –  March 2009  (1 year 1 month) ISR F&A People Segment team memeber Intel 2004  –  2009  (5 years) ISR F&A People Segment team memeber Intel 2004  –  2009  (5 years) Finance Manager Intel May 2002  –  March 2008  (5 years 11 months) •Managing a team of 5 analysts and providing financial support for the EMEA corporate services, people management, analyst development, building team capability, executing business process excellence, and co-leading, with the operations Directors, many cost reduction forums targeted at maximizing gross margins.  \n•Proactively engage with site Ops/VF Finance and Ops counterparts in setting clear goals and aligning on finance agenda while thriving well under ambiguous environment \nTeam financial capabilities include Close, POR/PLAN process while driving disciplined cost reduction to achieve organization spending/ROIC target. \n•Managing the Real Estate financial evaluation/selection of new property development for existing and new real estate/infrastructure office site projects across the EMEA region. Finance Manager Intel May 2002  –  March 2008  (5 years 11 months) •Managing a team of 5 analysts and providing financial support for the EMEA corporate services, people management, analyst development, building team capability, executing business process excellence, and co-leading, with the operations Directors, many cost reduction forums targeted at maximizing gross margins.  \n•Proactively engage with site Ops/VF Finance and Ops counterparts in setting clear goals and aligning on finance agenda while thriving well under ambiguous environment \nTeam financial capabilities include Close, POR/PLAN process while driving disciplined cost reduction to achieve organization spending/ROIC target. \n•Managing the Real Estate financial evaluation/selection of new property development for existing and new real estate/infrastructure office site projects across the EMEA region. Skills Business Strategy Competitive Analysis Strategic Planning Budgeting Financial Analysis People Management Business Process... Business Management Management Cross-functional Team... Leadership Team Management Team Building Process Improvement Budgets Forecasting Product Management MS Project Financial Modeling Executive Management Start-ups Finance Program Management Strategy Mergers & Acquisitions See 10+     See less Skills  Business Strategy Competitive Analysis Strategic Planning Budgeting Financial Analysis People Management Business Process... Business Management Management Cross-functional Team... Leadership Team Management Team Building Process Improvement Budgets Forecasting Product Management MS Project Financial Modeling Executive Management Start-ups Finance Program Management Strategy Mergers & Acquisitions See 10+     See less Business Strategy Competitive Analysis Strategic Planning Budgeting Financial Analysis People Management Business Process... Business Management Management Cross-functional Team... Leadership Team Management Team Building Process Improvement Budgets Forecasting Product Management MS Project Financial Modeling Executive Management Start-ups Finance Program Management Strategy Mergers & Acquisitions See 10+     See less Business Strategy Competitive Analysis Strategic Planning Budgeting Financial Analysis People Management Business Process... Business Management Management Cross-functional Team... Leadership Team Management Team Building Process Improvement Budgets Forecasting Product Management MS Project Financial Modeling Executive Management Start-ups Finance Program Management Strategy Mergers & Acquisitions See 10+     See less Education Tel Aviv University Excutive,  Strategic Management 2011  – 2011 Lahav-Recanati Institute Bar-Ilan University M.A,  Law 2008  – 2009 Universitat Ben Gurion Ba-Negev B.A,  Accounting 1990  – 1994 Universitat Ben Gurion Ba-Negev BA,  Economics and Business mgt. 1990  – 1993 Tel Aviv University Excutive,  Strategic Management 2011  – 2011 Lahav-Recanati Institute Tel Aviv University Excutive,  Strategic Management 2011  – 2011 Lahav-Recanati Institute Tel Aviv University Excutive,  Strategic Management 2011  – 2011 Lahav-Recanati Institute Bar-Ilan University M.A,  Law 2008  – 2009 Bar-Ilan University M.A,  Law 2008  – 2009 Bar-Ilan University M.A,  Law 2008  – 2009 Universitat Ben Gurion Ba-Negev B.A,  Accounting 1990  – 1994 Universitat Ben Gurion Ba-Negev B.A,  Accounting 1990  – 1994 Universitat Ben Gurion Ba-Negev B.A,  Accounting 1990  – 1994 Universitat Ben Gurion Ba-Negev BA,  Economics and Business mgt. 1990  – 1993 Universitat Ben Gurion Ba-Negev BA,  Economics and Business mgt. 1990  – 1993 Universitat Ben Gurion Ba-Negev BA,  Economics and Business mgt. 1990  – 1993 ", "Summary Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Summary Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Product planning & marketing professional with broad experience in both consumer electronics and personal computers. At my best in small, smart, and fast teams. Experience Senior Staff Strategic Planner Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Staff Product Planner Intel Corporation June 2004  –  March 2015  (10 years 10 months) Hillsboro, Oregon Senior Product Marketing Engineer Intel Corporation August 1999  –  July 2004  (5 years) Hillsboro, Oregon Product Marketing Associate Panasonic July 1994  –  July 1997  (3 years 1 month) Osaka, Japan Corporate Planning Analyst Panasonic September 1992  –  July 1994  (1 year 11 months) Osaka, Japan Senior Staff Strategic Planner Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Senior Staff Strategic Planner Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Staff Product Planner Intel Corporation June 2004  –  March 2015  (10 years 10 months) Hillsboro, Oregon Staff Product Planner Intel Corporation June 2004  –  March 2015  (10 years 10 months) Hillsboro, Oregon Senior Product Marketing Engineer Intel Corporation August 1999  –  July 2004  (5 years) Hillsboro, Oregon Senior Product Marketing Engineer Intel Corporation August 1999  –  July 2004  (5 years) Hillsboro, Oregon Product Marketing Associate Panasonic July 1994  –  July 1997  (3 years 1 month) Osaka, Japan Product Marketing Associate Panasonic July 1994  –  July 1997  (3 years 1 month) Osaka, Japan Corporate Planning Analyst Panasonic September 1992  –  July 1994  (1 year 11 months) Osaka, Japan Corporate Planning Analyst Panasonic September 1992  –  July 1994  (1 year 11 months) Osaka, Japan Languages Japanese (4 years in college+ 5 years ex-pat, but now very rusty) Japanese (4 years in college+ 5 years ex-pat, but now very rusty) Japanese (4 years in college+ 5 years ex-pat, but now very rusty) Skills Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Skills  Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Program Management Competitive Analysis Product Marketing Product Development Product Management Consumer Electronics Strategic Planning Marketing Management Cross-functional Team... Strategic Partnerships Product Planning Mobile Devices Business Strategy Go-to-market Strategy Education University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley BA 1988  – 1992 International Christian University 1990  – 1991 Iolani School High School degree 1980  – 1988 University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley, Haas School of Business MBA 1997  – 1999 University of California, Berkeley BA 1988  – 1992 University of California, Berkeley BA 1988  – 1992 University of California, Berkeley BA 1988  – 1992 International Christian University 1990  – 1991 International Christian University 1990  – 1991 International Christian University 1990  – 1991 Iolani School High School degree 1980  – 1988 Iolani School High School degree 1980  – 1988 Iolani School High School degree 1980  – 1988 ", "Skills Virtualization System Architecture SaaS Analysis Software Engineering Integration Security Linux Strategy Debugging XML Enterprise Software Team Building Software Development Specifications SDLC Computer Security Device Drivers Operating Systems Shell Scripting Architectures SOA Solaris See 8+     See less Skills  Virtualization System Architecture SaaS Analysis Software Engineering Integration Security Linux Strategy Debugging XML Enterprise Software Team Building Software Development Specifications SDLC Computer Security Device Drivers Operating Systems Shell Scripting Architectures SOA Solaris See 8+     See less Virtualization System Architecture SaaS Analysis Software Engineering Integration Security Linux Strategy Debugging XML Enterprise Software Team Building Software Development Specifications SDLC Computer Security Device Drivers Operating Systems Shell Scripting Architectures SOA Solaris See 8+     See less Virtualization System Architecture SaaS Analysis Software Engineering Integration Security Linux Strategy Debugging XML Enterprise Software Team Building Software Development Specifications SDLC Computer Security Device Drivers Operating Systems Shell Scripting Architectures SOA Solaris See 8+     See less ", "Summary Since 1999, Ze’ev Rivlin has led BD, Strategic Planning, and Marketing at a number of Hi-Tech start-ups. At Wisair, Ze'ev developed new business directions including new markets/applications of Wisair technology/solution to leading OEM products. Previous to that, as an independent consultant, Ze'ev provided strategic planning, Marketing, and BD services to the ASR and Consumer Electronics (CE) markets. At Commex, he led the Marketing Team as well as all BD efforts, focusing on product marketing and strategy, competitive positioning, and customer engagement. Before coming to Commex, Ze’ev drove business development efforts at Oplus Technologies (acquired by Intel Corporation) developing new markets for video processing SoCs resulting in successful introduction of numerous products with Tier1 Japanese OEMs such as Yamaha. At Intel, he was a strategic planner developing innovative new features for Intel’s Mobility Group platforms.  \n \nZe'ev possesses over 20yrs expertise in the field of Automatic Speech Recognition (ASR) , engaging in research in the field from 1990-1998 at AT&T Bell Labs and SRI International, and in various capacities, on-and-off, deriving new strategic applications for ASR in the market, including specific focus on Consumer Electronics apps and Speech Analytics.  \n \nZe’ev holds a B.S. in Computer Science from Temple University and an M.S. in Electrical Engineering from Drexel University. Specialties:International Marketing and Business Development \nStrategic Planning \nConsumer Electronics, Semiconductor markets \nAutomatic Speech Recognition - Technical & Business sides - 20yrs Summary Since 1999, Ze’ev Rivlin has led BD, Strategic Planning, and Marketing at a number of Hi-Tech start-ups. At Wisair, Ze'ev developed new business directions including new markets/applications of Wisair technology/solution to leading OEM products. Previous to that, as an independent consultant, Ze'ev provided strategic planning, Marketing, and BD services to the ASR and Consumer Electronics (CE) markets. At Commex, he led the Marketing Team as well as all BD efforts, focusing on product marketing and strategy, competitive positioning, and customer engagement. Before coming to Commex, Ze’ev drove business development efforts at Oplus Technologies (acquired by Intel Corporation) developing new markets for video processing SoCs resulting in successful introduction of numerous products with Tier1 Japanese OEMs such as Yamaha. At Intel, he was a strategic planner developing innovative new features for Intel’s Mobility Group platforms.  \n \nZe'ev possesses over 20yrs expertise in the field of Automatic Speech Recognition (ASR) , engaging in research in the field from 1990-1998 at AT&T Bell Labs and SRI International, and in various capacities, on-and-off, deriving new strategic applications for ASR in the market, including specific focus on Consumer Electronics apps and Speech Analytics.  \n \nZe’ev holds a B.S. in Computer Science from Temple University and an M.S. in Electrical Engineering from Drexel University. Specialties:International Marketing and Business Development \nStrategic Planning \nConsumer Electronics, Semiconductor markets \nAutomatic Speech Recognition - Technical & Business sides - 20yrs Since 1999, Ze’ev Rivlin has led BD, Strategic Planning, and Marketing at a number of Hi-Tech start-ups. At Wisair, Ze'ev developed new business directions including new markets/applications of Wisair technology/solution to leading OEM products. Previous to that, as an independent consultant, Ze'ev provided strategic planning, Marketing, and BD services to the ASR and Consumer Electronics (CE) markets. At Commex, he led the Marketing Team as well as all BD efforts, focusing on product marketing and strategy, competitive positioning, and customer engagement. Before coming to Commex, Ze’ev drove business development efforts at Oplus Technologies (acquired by Intel Corporation) developing new markets for video processing SoCs resulting in successful introduction of numerous products with Tier1 Japanese OEMs such as Yamaha. At Intel, he was a strategic planner developing innovative new features for Intel’s Mobility Group platforms.  \n \nZe'ev possesses over 20yrs expertise in the field of Automatic Speech Recognition (ASR) , engaging in research in the field from 1990-1998 at AT&T Bell Labs and SRI International, and in various capacities, on-and-off, deriving new strategic applications for ASR in the market, including specific focus on Consumer Electronics apps and Speech Analytics.  \n \nZe’ev holds a B.S. in Computer Science from Temple University and an M.S. in Electrical Engineering from Drexel University. Specialties:International Marketing and Business Development \nStrategic Planning \nConsumer Electronics, Semiconductor markets \nAutomatic Speech Recognition - Technical & Business sides - 20yrs Since 1999, Ze’ev Rivlin has led BD, Strategic Planning, and Marketing at a number of Hi-Tech start-ups. At Wisair, Ze'ev developed new business directions including new markets/applications of Wisair technology/solution to leading OEM products. Previous to that, as an independent consultant, Ze'ev provided strategic planning, Marketing, and BD services to the ASR and Consumer Electronics (CE) markets. At Commex, he led the Marketing Team as well as all BD efforts, focusing on product marketing and strategy, competitive positioning, and customer engagement. Before coming to Commex, Ze’ev drove business development efforts at Oplus Technologies (acquired by Intel Corporation) developing new markets for video processing SoCs resulting in successful introduction of numerous products with Tier1 Japanese OEMs such as Yamaha. At Intel, he was a strategic planner developing innovative new features for Intel’s Mobility Group platforms.  \n \nZe'ev possesses over 20yrs expertise in the field of Automatic Speech Recognition (ASR) , engaging in research in the field from 1990-1998 at AT&T Bell Labs and SRI International, and in various capacities, on-and-off, deriving new strategic applications for ASR in the market, including specific focus on Consumer Electronics apps and Speech Analytics.  \n \nZe’ev holds a B.S. in Computer Science from Temple University and an M.S. in Electrical Engineering from Drexel University. Specialties:International Marketing and Business Development \nStrategic Planning \nConsumer Electronics, Semiconductor markets \nAutomatic Speech Recognition - Technical & Business sides - 20yrs Experience Strategic Planner Intel Corporation 2012  – Present (3 years) Haifa Director of Business Development Wisair December 2010  –  May 2012  (1 year 6 months) Defined new business directions and developed business relationships with relevant customers/OEMs/partners - key focus tablet market - connected with OEMs (brands), APU vendors, ODMs, and solution partners to jointly develop Wisair Wireless Display solution Independent Consultant New Business Initiatives October 2009  –  December 2010  (1 year 3 months) Business Development and Strategic Planning for Speech Analytics and Consumer Electronics Industries. Promoted business for clients with key OEM partners, mainly in Japan, US, and locally. Conducted market research for strategic and competitive positioning. Leveraged proven track record in CE OEM Market and over 20yrs experience in all aspects of Speech Recognition, the enabling technology for Speech Analytics in Call Center, Homeland Security, and Online Media Markets. VP Marketing & Business Development Commex Technologies February 2007  –  October 2009  (2 years 9 months) Strategic Planner, Mobility Group Intel February 2006  –  February 2007  (1 year 1 month) Business Development Manager Oplus Technologies March 2004  –  February 2006  (2 years) BD Mgr VCON February 2001  –  February 2003  (2 years 1 month) Product Marketing Manager NSC May 1999  –  February 2001  (1 year 10 months) Research Engineer SRI International March 1994  –  May 1999  (5 years 3 months) Research Engineer AT&T Bell Labs June 1989  –  March 1994  (4 years 10 months) Strategic Planner Intel Corporation 2012  – Present (3 years) Haifa Strategic Planner Intel Corporation 2012  – Present (3 years) Haifa Director of Business Development Wisair December 2010  –  May 2012  (1 year 6 months) Defined new business directions and developed business relationships with relevant customers/OEMs/partners - key focus tablet market - connected with OEMs (brands), APU vendors, ODMs, and solution partners to jointly develop Wisair Wireless Display solution Director of Business Development Wisair December 2010  –  May 2012  (1 year 6 months) Defined new business directions and developed business relationships with relevant customers/OEMs/partners - key focus tablet market - connected with OEMs (brands), APU vendors, ODMs, and solution partners to jointly develop Wisair Wireless Display solution Independent Consultant New Business Initiatives October 2009  –  December 2010  (1 year 3 months) Business Development and Strategic Planning for Speech Analytics and Consumer Electronics Industries. Promoted business for clients with key OEM partners, mainly in Japan, US, and locally. Conducted market research for strategic and competitive positioning. Leveraged proven track record in CE OEM Market and over 20yrs experience in all aspects of Speech Recognition, the enabling technology for Speech Analytics in Call Center, Homeland Security, and Online Media Markets. Independent Consultant New Business Initiatives October 2009  –  December 2010  (1 year 3 months) Business Development and Strategic Planning for Speech Analytics and Consumer Electronics Industries. Promoted business for clients with key OEM partners, mainly in Japan, US, and locally. Conducted market research for strategic and competitive positioning. Leveraged proven track record in CE OEM Market and over 20yrs experience in all aspects of Speech Recognition, the enabling technology for Speech Analytics in Call Center, Homeland Security, and Online Media Markets. VP Marketing & Business Development Commex Technologies February 2007  –  October 2009  (2 years 9 months) VP Marketing & Business Development Commex Technologies February 2007  –  October 2009  (2 years 9 months) Strategic Planner, Mobility Group Intel February 2006  –  February 2007  (1 year 1 month) Strategic Planner, Mobility Group Intel February 2006  –  February 2007  (1 year 1 month) Business Development Manager Oplus Technologies March 2004  –  February 2006  (2 years) Business Development Manager Oplus Technologies March 2004  –  February 2006  (2 years) BD Mgr VCON February 2001  –  February 2003  (2 years 1 month) BD Mgr VCON February 2001  –  February 2003  (2 years 1 month) Product Marketing Manager NSC May 1999  –  February 2001  (1 year 10 months) Product Marketing Manager NSC May 1999  –  February 2001  (1 year 10 months) Research Engineer SRI International March 1994  –  May 1999  (5 years 3 months) Research Engineer SRI International March 1994  –  May 1999  (5 years 3 months) Research Engineer AT&T Bell Labs June 1989  –  March 1994  (4 years 10 months) Research Engineer AT&T Bell Labs June 1989  –  March 1994  (4 years 10 months) Skills Strategic Planning Consumer Electronics Semiconductors Speech Recognition Product Management Start-ups Mobile Devices Product Marketing Go-to-market Strategy Embedded Systems Wireless Strategic Partnerships System Architecture ASIC Telecommunications R&D Business Development Global Business... SoC See 4+     See less Skills  Strategic Planning Consumer Electronics Semiconductors Speech Recognition Product Management Start-ups Mobile Devices Product Marketing Go-to-market Strategy Embedded Systems Wireless Strategic Partnerships System Architecture ASIC Telecommunications R&D Business Development Global Business... SoC See 4+     See less Strategic Planning Consumer Electronics Semiconductors Speech Recognition Product Management Start-ups Mobile Devices Product Marketing Go-to-market Strategy Embedded Systems Wireless Strategic Partnerships System Architecture ASIC Telecommunications R&D Business Development Global Business... SoC See 4+     See less Strategic Planning Consumer Electronics Semiconductors Speech Recognition Product Management Start-ups Mobile Devices Product Marketing Go-to-market Strategy Embedded Systems Wireless Strategic Partnerships System Architecture ASIC Telecommunications R&D Business Development Global Business... SoC See 4+     See less Education Drexel University MSEE 1985  – 1990 Technion 1987  – 1988 Temple University BS,  Computer Science 1980  – 1984 Cheltenham High School ba 1976  – 1980 Philadelphia University Drexel University MSEE 1985  – 1990 Drexel University MSEE 1985  – 1990 Drexel University MSEE 1985  – 1990 Technion 1987  – 1988 Technion 1987  – 1988 Technion 1987  – 1988 Temple University BS,  Computer Science 1980  – 1984 Temple University BS,  Computer Science 1980  – 1984 Temple University BS,  Computer Science 1980  – 1984 Cheltenham High School ba 1976  – 1980 Cheltenham High School ba 1976  – 1980 Cheltenham High School ba 1976  – 1980 Philadelphia University Philadelphia University Philadelphia University Honors & Awards Additional Honors & Awards Temple University President's Scholar Additional Honors & Awards Temple University President's Scholar Additional Honors & Awards Temple University President's Scholar Additional Honors & Awards Temple University President's Scholar ", "Summary A proven leader with a demonstrated technical prowess across a wide range of disciplines.  \n \nI lead through trust; by personally investing in growing my team’s technical strength, and by eliminating organizational inefficiencies. My diverse technical background enables quick evaluation of new technologies and usage model decomposition. \n \nI am seeking to combine my deep passion for people and technology, to develop new business ventures, or evolve existing organizations and portfolios to new levels of competitiveness. Summary A proven leader with a demonstrated technical prowess across a wide range of disciplines.  \n \nI lead through trust; by personally investing in growing my team’s technical strength, and by eliminating organizational inefficiencies. My diverse technical background enables quick evaluation of new technologies and usage model decomposition. \n \nI am seeking to combine my deep passion for people and technology, to develop new business ventures, or evolve existing organizations and portfolios to new levels of competitiveness. A proven leader with a demonstrated technical prowess across a wide range of disciplines.  \n \nI lead through trust; by personally investing in growing my team’s technical strength, and by eliminating organizational inefficiencies. My diverse technical background enables quick evaluation of new technologies and usage model decomposition. \n \nI am seeking to combine my deep passion for people and technology, to develop new business ventures, or evolve existing organizations and portfolios to new levels of competitiveness. A proven leader with a demonstrated technical prowess across a wide range of disciplines.  \n \nI lead through trust; by personally investing in growing my team’s technical strength, and by eliminating organizational inefficiencies. My diverse technical background enables quick evaluation of new technologies and usage model decomposition. \n \nI am seeking to combine my deep passion for people and technology, to develop new business ventures, or evolve existing organizations and portfolios to new levels of competitiveness. Experience Corporate Strategic Planner Intel Corporation – Corporate Strategy Office August 2013  – Present (2 years 1 month) Chandler, AZ Applications Engineering and Ecosystem Enabling Manager Intel Corporation – Intelligent Embedded Systems Group October 2009  –  July 2013  (3 years 10 months) Chandler, AZ *\tResponsible for driving adoption of Intel graphics in embedded markets including digital signage, retail, automotive, digital surveillance, casino gaming, and cable TV distribution. \n*\tDramatically improved support quality with new industry enabling strategies, collaterals, and employee development programs, and optimization of issue handling processes.  \n*\tReduced average issue resolution time from 98 to 36 days, with < 1% escalation rate over 2 years.  \n*\tReduced number of “aged” issues by over 80% enabling prioritization of customer issues based on impact, not age.  \n*\tTransformed employee skill set through cross training, formal education, and tiered projects. \n*\tDeployed new graphics software optimization services to accelerate development times for ISVs.  \n*\tEnabled long life support for embedded customers by negotiating outsourced vendor development/delivery contracts. \n*\tNegotiated internal support agreements enabling Intel to offer long-life graphics support for embedded customers on embedded operating systems through formal Service Level Agreements, funding transfers and issue handicapping. Driver Development and Architecture Intel Corporation – Video Products Group May 2007  –  October 2009  (2 years 6 months) Folsom, CA *\tIdentified and implemented protections to mitigate theft of protected content from simple screen recording methods. \n*\tConducted exploratory studies to determine feasibility of various encrypted memory options and deep color (xvYCC). \n*\tAuthored internal documentation, behavioral specifications, validation guides, and enabling collateral for ISVs. \n*\tAbstracted Intel’s proprietary video content protection mechanisms through standardized APIs. \n*\tWorked with Microsoft to ensure Windows 7 playback of protected videos on Intel platforms was supported “in-box”. \n*\tIdentified video performance needs of future products through analysis of HD-DVD and Blu-ray specifications. Video, Display and Content Protection Evangelist Intel Corporation – Personal Computing Clients Group December 2005  –  May 2007  (1 year 6 months) Folsom, CA *\tMaintained ISV relationships and provided training to enable market leading video performance on Intel platforms.  \n*\tFormed and lead a multi-disciplinary team to track, measure, and improve Intel’s video performance on key software. \n*\tConsulted with ecosystem partners and engineering to propose a redesign of Intel’s graphics control panel. \n*\tAuthored a training series to raise awareness of Intel’s graphics capabilities internally and externally.  \n*\tEnsured consistent and accurate market positioning through IDF presentations, OEM seminars, and sales conferences. \n*\tIdentified future product requirements through exploratory discussions with key OEM partners. Sr. HW Technical Marketing & Enabling Engineer Intel Corporation – Embedded Intel Architecture Division May 2002  –  December 2005  (3 years 8 months) Chandler, AZ *\tUsed Cadence tools for schematic capture to design multi-purpose reference PCBs and validate layout compliance. \n*\tCreated reference designs and published multi-layer board design guidelines to shorten OEM/ODM design cycles. \n*\tEducated developers on all platform features and design considerations by providing trainings at IDF, ESC etc. \n*\tAuthored PRDs for reference boards by working across multiple engineering and procurement disciplines. \n*\tPartnered with field sales teams to secure early development partnerships with key customers. HW Technical Marketing & Enabling Engineer Intel Corporation – Application Design-In Center August 2000  –  May 2002  (1 year 10 months) Folsom, CA *\tPublished a method to replace ASIC aiding CPU frequency transitions with a software equivalent.  \n*\tEnsured OEM/ODM designs met launch schedules by debugging reported issues to silicon, board, or BIOS level through inspection of system configuration space, schematics, and layout as necessary. \n*\tCreated software tool to automatically compare system configuration space against published and expected values. Corporate Strategic Planner Intel Corporation – Corporate Strategy Office August 2013  – Present (2 years 1 month) Chandler, AZ Corporate Strategic Planner Intel Corporation – Corporate Strategy Office August 2013  – Present (2 years 1 month) Chandler, AZ Applications Engineering and Ecosystem Enabling Manager Intel Corporation – Intelligent Embedded Systems Group October 2009  –  July 2013  (3 years 10 months) Chandler, AZ *\tResponsible for driving adoption of Intel graphics in embedded markets including digital signage, retail, automotive, digital surveillance, casino gaming, and cable TV distribution. \n*\tDramatically improved support quality with new industry enabling strategies, collaterals, and employee development programs, and optimization of issue handling processes.  \n*\tReduced average issue resolution time from 98 to 36 days, with < 1% escalation rate over 2 years.  \n*\tReduced number of “aged” issues by over 80% enabling prioritization of customer issues based on impact, not age.  \n*\tTransformed employee skill set through cross training, formal education, and tiered projects. \n*\tDeployed new graphics software optimization services to accelerate development times for ISVs.  \n*\tEnabled long life support for embedded customers by negotiating outsourced vendor development/delivery contracts. \n*\tNegotiated internal support agreements enabling Intel to offer long-life graphics support for embedded customers on embedded operating systems through formal Service Level Agreements, funding transfers and issue handicapping. Applications Engineering and Ecosystem Enabling Manager Intel Corporation – Intelligent Embedded Systems Group October 2009  –  July 2013  (3 years 10 months) Chandler, AZ *\tResponsible for driving adoption of Intel graphics in embedded markets including digital signage, retail, automotive, digital surveillance, casino gaming, and cable TV distribution. \n*\tDramatically improved support quality with new industry enabling strategies, collaterals, and employee development programs, and optimization of issue handling processes.  \n*\tReduced average issue resolution time from 98 to 36 days, with < 1% escalation rate over 2 years.  \n*\tReduced number of “aged” issues by over 80% enabling prioritization of customer issues based on impact, not age.  \n*\tTransformed employee skill set through cross training, formal education, and tiered projects. \n*\tDeployed new graphics software optimization services to accelerate development times for ISVs.  \n*\tEnabled long life support for embedded customers by negotiating outsourced vendor development/delivery contracts. \n*\tNegotiated internal support agreements enabling Intel to offer long-life graphics support for embedded customers on embedded operating systems through formal Service Level Agreements, funding transfers and issue handicapping. Driver Development and Architecture Intel Corporation – Video Products Group May 2007  –  October 2009  (2 years 6 months) Folsom, CA *\tIdentified and implemented protections to mitigate theft of protected content from simple screen recording methods. \n*\tConducted exploratory studies to determine feasibility of various encrypted memory options and deep color (xvYCC). \n*\tAuthored internal documentation, behavioral specifications, validation guides, and enabling collateral for ISVs. \n*\tAbstracted Intel’s proprietary video content protection mechanisms through standardized APIs. \n*\tWorked with Microsoft to ensure Windows 7 playback of protected videos on Intel platforms was supported “in-box”. \n*\tIdentified video performance needs of future products through analysis of HD-DVD and Blu-ray specifications. Driver Development and Architecture Intel Corporation – Video Products Group May 2007  –  October 2009  (2 years 6 months) Folsom, CA *\tIdentified and implemented protections to mitigate theft of protected content from simple screen recording methods. \n*\tConducted exploratory studies to determine feasibility of various encrypted memory options and deep color (xvYCC). \n*\tAuthored internal documentation, behavioral specifications, validation guides, and enabling collateral for ISVs. \n*\tAbstracted Intel’s proprietary video content protection mechanisms through standardized APIs. \n*\tWorked with Microsoft to ensure Windows 7 playback of protected videos on Intel platforms was supported “in-box”. \n*\tIdentified video performance needs of future products through analysis of HD-DVD and Blu-ray specifications. Video, Display and Content Protection Evangelist Intel Corporation – Personal Computing Clients Group December 2005  –  May 2007  (1 year 6 months) Folsom, CA *\tMaintained ISV relationships and provided training to enable market leading video performance on Intel platforms.  \n*\tFormed and lead a multi-disciplinary team to track, measure, and improve Intel’s video performance on key software. \n*\tConsulted with ecosystem partners and engineering to propose a redesign of Intel’s graphics control panel. \n*\tAuthored a training series to raise awareness of Intel’s graphics capabilities internally and externally.  \n*\tEnsured consistent and accurate market positioning through IDF presentations, OEM seminars, and sales conferences. \n*\tIdentified future product requirements through exploratory discussions with key OEM partners. Video, Display and Content Protection Evangelist Intel Corporation – Personal Computing Clients Group December 2005  –  May 2007  (1 year 6 months) Folsom, CA *\tMaintained ISV relationships and provided training to enable market leading video performance on Intel platforms.  \n*\tFormed and lead a multi-disciplinary team to track, measure, and improve Intel’s video performance on key software. \n*\tConsulted with ecosystem partners and engineering to propose a redesign of Intel’s graphics control panel. \n*\tAuthored a training series to raise awareness of Intel’s graphics capabilities internally and externally.  \n*\tEnsured consistent and accurate market positioning through IDF presentations, OEM seminars, and sales conferences. \n*\tIdentified future product requirements through exploratory discussions with key OEM partners. Sr. HW Technical Marketing & Enabling Engineer Intel Corporation – Embedded Intel Architecture Division May 2002  –  December 2005  (3 years 8 months) Chandler, AZ *\tUsed Cadence tools for schematic capture to design multi-purpose reference PCBs and validate layout compliance. \n*\tCreated reference designs and published multi-layer board design guidelines to shorten OEM/ODM design cycles. \n*\tEducated developers on all platform features and design considerations by providing trainings at IDF, ESC etc. \n*\tAuthored PRDs for reference boards by working across multiple engineering and procurement disciplines. \n*\tPartnered with field sales teams to secure early development partnerships with key customers. Sr. HW Technical Marketing & Enabling Engineer Intel Corporation – Embedded Intel Architecture Division May 2002  –  December 2005  (3 years 8 months) Chandler, AZ *\tUsed Cadence tools for schematic capture to design multi-purpose reference PCBs and validate layout compliance. \n*\tCreated reference designs and published multi-layer board design guidelines to shorten OEM/ODM design cycles. \n*\tEducated developers on all platform features and design considerations by providing trainings at IDF, ESC etc. \n*\tAuthored PRDs for reference boards by working across multiple engineering and procurement disciplines. \n*\tPartnered with field sales teams to secure early development partnerships with key customers. HW Technical Marketing & Enabling Engineer Intel Corporation – Application Design-In Center August 2000  –  May 2002  (1 year 10 months) Folsom, CA *\tPublished a method to replace ASIC aiding CPU frequency transitions with a software equivalent.  \n*\tEnsured OEM/ODM designs met launch schedules by debugging reported issues to silicon, board, or BIOS level through inspection of system configuration space, schematics, and layout as necessary. \n*\tCreated software tool to automatically compare system configuration space against published and expected values. HW Technical Marketing & Enabling Engineer Intel Corporation – Application Design-In Center August 2000  –  May 2002  (1 year 10 months) Folsom, CA *\tPublished a method to replace ASIC aiding CPU frequency transitions with a software equivalent.  \n*\tEnsured OEM/ODM designs met launch schedules by debugging reported issues to silicon, board, or BIOS level through inspection of system configuration space, schematics, and layout as necessary. \n*\tCreated software tool to automatically compare system configuration space against published and expected values. Languages   Skills Intel SoC Graphics Software Embedded Systems Semiconductors Management Hardware Architecture Process Improvement Processors Business Strategy Strategic Planning Process Management Process Optimization Enabling Change Embedded Software Embedded Operating... Windows Embedded Board Development Schematic Board Layout PCB design Windows Driver... Device Drivers Kernel Drivers GPGPU Video Compression Decoding Video Playback Transcoding H.264 3D graphics Digital Signage Automotive Infotainment POS Customer Support Small Business Computer Graphics Debugging Cross-functional Team... Product Management Hardware ASIC See 27+     See less Skills  Intel SoC Graphics Software Embedded Systems Semiconductors Management Hardware Architecture Process Improvement Processors Business Strategy Strategic Planning Process Management Process Optimization Enabling Change Embedded Software Embedded Operating... Windows Embedded Board Development Schematic Board Layout PCB design Windows Driver... Device Drivers Kernel Drivers GPGPU Video Compression Decoding Video Playback Transcoding H.264 3D graphics Digital Signage Automotive Infotainment POS Customer Support Small Business Computer Graphics Debugging Cross-functional Team... Product Management Hardware ASIC See 27+     See less Intel SoC Graphics Software Embedded Systems Semiconductors Management Hardware Architecture Process Improvement Processors Business Strategy Strategic Planning Process Management Process Optimization Enabling Change Embedded Software Embedded Operating... Windows Embedded Board Development Schematic Board Layout PCB design Windows Driver... Device Drivers Kernel Drivers GPGPU Video Compression Decoding Video Playback Transcoding H.264 3D graphics Digital Signage Automotive Infotainment POS Customer Support Small Business Computer Graphics Debugging Cross-functional Team... Product Management Hardware ASIC See 27+     See less Intel SoC Graphics Software Embedded Systems Semiconductors Management Hardware Architecture Process Improvement Processors Business Strategy Strategic Planning Process Management Process Optimization Enabling Change Embedded Software Embedded Operating... Windows Embedded Board Development Schematic Board Layout PCB design Windows Driver... Device Drivers Kernel Drivers GPGPU Video Compression Decoding Video Playback Transcoding H.264 3D graphics Digital Signage Automotive Infotainment POS Customer Support Small Business Computer Graphics Debugging Cross-functional Team... Product Management Hardware ASIC See 27+     See less Education Penn State University BS,  Electrical Engineering 1996  – 2000 Activities and Societies:  IEEE Student Branch (President ,  Vice President)\nIEEE Computer Society Student Branch ( President) Penn State University BS,  Electrical Engineering 1996  – 2000 Activities and Societies:  IEEE Student Branch (President ,  Vice President)\nIEEE Computer Society Student Branch ( President) Penn State University BS,  Electrical Engineering 1996  – 2000 Activities and Societies:  IEEE Student Branch (President ,  Vice President)\nIEEE Computer Society Student Branch ( President) Penn State University BS,  Electrical Engineering 1996  – 2000 Activities and Societies:  IEEE Student Branch (President ,  Vice President)\nIEEE Computer Society Student Branch ( President) Honors & Awards ", "Skills Technical Marketing ASIC SoC Computer Architecture Semiconductors Processors Go-to-market Strategy Verilog Intel IC Embedded Systems Product Management Consumer Electronics Microprocessors Software Engineering Debugging System Architecture Hardware Architecture Embedded Software Digital Signal... Analog Mobile Devices See 7+     See less Skills  Technical Marketing ASIC SoC Computer Architecture Semiconductors Processors Go-to-market Strategy Verilog Intel IC Embedded Systems Product Management Consumer Electronics Microprocessors Software Engineering Debugging System Architecture Hardware Architecture Embedded Software Digital Signal... Analog Mobile Devices See 7+     See less Technical Marketing ASIC SoC Computer Architecture Semiconductors Processors Go-to-market Strategy Verilog Intel IC Embedded Systems Product Management Consumer Electronics Microprocessors Software Engineering Debugging System Architecture Hardware Architecture Embedded Software Digital Signal... Analog Mobile Devices See 7+     See less Technical Marketing ASIC SoC Computer Architecture Semiconductors Processors Go-to-market Strategy Verilog Intel IC Embedded Systems Product Management Consumer Electronics Microprocessors Software Engineering Debugging System Architecture Hardware Architecture Embedded Software Digital Signal... Analog Mobile Devices See 7+     See less ", "Experience SSD Strategic Planner Intel Corporation May 2012  – Present (3 years 4 months) Sr. CAD and Component Design Engineer INTEL Corporation July 2007  –  April 2012  (4 years 10 months) IC Design Engineer Tanner Research February 2005  –  July 2007  (2 years 6 months) Research Assistant Information Sciences Institute June 2003  –  May 2005  (2 years) Research Assistant Tata Institute of Fundamental Research June 2001  –  May 2002  (1 year) SSD Strategic Planner Intel Corporation May 2012  – Present (3 years 4 months) SSD Strategic Planner Intel Corporation May 2012  – Present (3 years 4 months) Sr. CAD and Component Design Engineer INTEL Corporation July 2007  –  April 2012  (4 years 10 months) Sr. CAD and Component Design Engineer INTEL Corporation July 2007  –  April 2012  (4 years 10 months) IC Design Engineer Tanner Research February 2005  –  July 2007  (2 years 6 months) IC Design Engineer Tanner Research February 2005  –  July 2007  (2 years 6 months) Research Assistant Information Sciences Institute June 2003  –  May 2005  (2 years) Research Assistant Information Sciences Institute June 2003  –  May 2005  (2 years) Research Assistant Tata Institute of Fundamental Research June 2001  –  May 2002  (1 year) Research Assistant Tata Institute of Fundamental Research June 2001  –  May 2002  (1 year) Skills Skills     Education University of California, Davis - Graduate School of Management Masters,  Business Administration 2008  – 2011 University of Southern California Masters,  Electrical Engineering 2002  – 2005 CG-CoreEl Programmable Solutions School of VLSI Design Diploma,  VLSI Design 2003  – 2003 University of Mumbai Bachelors,  Electronics Engineering 1998  – 2002 University of California, Davis - Graduate School of Management Masters,  Business Administration 2008  – 2011 University of California, Davis - Graduate School of Management Masters,  Business Administration 2008  – 2011 University of California, Davis - Graduate School of Management Masters,  Business Administration 2008  – 2011 University of Southern California Masters,  Electrical Engineering 2002  – 2005 University of Southern California Masters,  Electrical Engineering 2002  – 2005 University of Southern California Masters,  Electrical Engineering 2002  – 2005 CG-CoreEl Programmable Solutions School of VLSI Design Diploma,  VLSI Design 2003  – 2003 CG-CoreEl Programmable Solutions School of VLSI Design Diploma,  VLSI Design 2003  – 2003 CG-CoreEl Programmable Solutions School of VLSI Design Diploma,  VLSI Design 2003  – 2003 University of Mumbai Bachelors,  Electronics Engineering 1998  – 2002 University of Mumbai Bachelors,  Electronics Engineering 1998  – 2002 University of Mumbai Bachelors,  Electronics Engineering 1998  – 2002 ", "Skills Intel Semiconductors Technical Marketing Processors Computer Architecture Microprocessors Digital Signal... Hardware Virtualization SoC ASIC IC Hardware Architecture Strategy Debugging Firmware Product Management Product Lifecycle... EDA See 4+     See less Skills  Intel Semiconductors Technical Marketing Processors Computer Architecture Microprocessors Digital Signal... Hardware Virtualization SoC ASIC IC Hardware Architecture Strategy Debugging Firmware Product Management Product Lifecycle... EDA See 4+     See less Intel Semiconductors Technical Marketing Processors Computer Architecture Microprocessors Digital Signal... Hardware Virtualization SoC ASIC IC Hardware Architecture Strategy Debugging Firmware Product Management Product Lifecycle... EDA See 4+     See less Intel Semiconductors Technical Marketing Processors Computer Architecture Microprocessors Digital Signal... Hardware Virtualization SoC ASIC IC Hardware Architecture Strategy Debugging Firmware Product Management Product Lifecycle... EDA See 4+     See less Honors & Awards ", "Summary Strong SW Engineering background – 15+ years’ of experience at Intel in embedded, networking and telecommunications, distributed systems and services. Almost all SW layers and operating systems development, design and architecture (μCode, FW, Driver and Application, Web Services, Telco, Internet distributed systems). Took part in architecting, design and technical leadership of telco RT operating system, higher level protocols (like LANE, MPoA, and OSPF) and distributed parallel processing. Great knowledge in large project and program management (multi-million, cross-site, telco space programs for Japanese and German customers). Later on focused on more strategic areas like engagements with customers, building agile SW engineering organization to develop user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. Last two years spent on making difference in product strategic planning. I took a SW Strategic Planner position for 2015/2016/2017 Atom and Core based SoC's; also Long-Lead Technology and Strategy Development for new emerging spaces. Summary Strong SW Engineering background – 15+ years’ of experience at Intel in embedded, networking and telecommunications, distributed systems and services. Almost all SW layers and operating systems development, design and architecture (μCode, FW, Driver and Application, Web Services, Telco, Internet distributed systems). Took part in architecting, design and technical leadership of telco RT operating system, higher level protocols (like LANE, MPoA, and OSPF) and distributed parallel processing. Great knowledge in large project and program management (multi-million, cross-site, telco space programs for Japanese and German customers). Later on focused on more strategic areas like engagements with customers, building agile SW engineering organization to develop user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. Last two years spent on making difference in product strategic planning. I took a SW Strategic Planner position for 2015/2016/2017 Atom and Core based SoC's; also Long-Lead Technology and Strategy Development for new emerging spaces. Strong SW Engineering background – 15+ years’ of experience at Intel in embedded, networking and telecommunications, distributed systems and services. Almost all SW layers and operating systems development, design and architecture (μCode, FW, Driver and Application, Web Services, Telco, Internet distributed systems). Took part in architecting, design and technical leadership of telco RT operating system, higher level protocols (like LANE, MPoA, and OSPF) and distributed parallel processing. Great knowledge in large project and program management (multi-million, cross-site, telco space programs for Japanese and German customers). Later on focused on more strategic areas like engagements with customers, building agile SW engineering organization to develop user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. Last two years spent on making difference in product strategic planning. I took a SW Strategic Planner position for 2015/2016/2017 Atom and Core based SoC's; also Long-Lead Technology and Strategy Development for new emerging spaces. Strong SW Engineering background – 15+ years’ of experience at Intel in embedded, networking and telecommunications, distributed systems and services. Almost all SW layers and operating systems development, design and architecture (μCode, FW, Driver and Application, Web Services, Telco, Internet distributed systems). Took part in architecting, design and technical leadership of telco RT operating system, higher level protocols (like LANE, MPoA, and OSPF) and distributed parallel processing. Great knowledge in large project and program management (multi-million, cross-site, telco space programs for Japanese and German customers). Later on focused on more strategic areas like engagements with customers, building agile SW engineering organization to develop user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. Last two years spent on making difference in product strategic planning. I took a SW Strategic Planner position for 2015/2016/2017 Atom and Core based SoC's; also Long-Lead Technology and Strategy Development for new emerging spaces. Experience Strategic Planner Intel Corporation April 2012  – Present (3 years 5 months) Sacramento, California Area <Intel Restricted Secret> :-) Engineering Manager Intel Corporation November 2007  –  April 2012  (4 years 6 months) Gdańsk Area, Poland Building and leading PCCG Engineering organization in Poland. This very strong Agile team was focused on delivering solutions opening new business models and opportunities related to distributed internet services. This amazing group of individuals developed user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. This team got to finals of Intel Software Quality Award (two times), was first team at Intel to achieve Design For Security Level 3, was chosen to describe its methodology as opening speech for Intel Professionals Conference, our team delivered presentations on Intel Agile Conferences and is recognized as a role model and in agile development. I feel honored that I had this opportunity to lead the group and see how it grows and people are expanding their skills.  \n \nAs Business Unit owner had more site-level duties like ITP Site Committee member (strategic planning for Intel Poland, all business groups’ alignment), ITP Site sponsor for Employee Development, ITP Site sponsor for GPTW. Also as certified T-Coach helped new managers to transition to new role. Recognized trainer for “Strengthening Managers Skills”, “Managing Teams” & “Career Development Workshop”. Program Manager Intel Corporation May 2005  –  November 2007  (2 years 7 months) Gdańsk Area, Poland Was responsible for delivery of following product lines: Intel® IXDP2805 and Intel® IXDP2855 Advanced Development Platforms (LINK), Intel NetStructure® IXB2805 3G Boards, and Intel NetStructure® MPCBL0040 Single Board Computer. Besides the regular PM duties (managing $5M+ budget and team of over 100 engineers) I was responsible for requirements gathering, Design Wins, negotiation of contracts and schedules with demanding customer (i.e. Siemens, Motorola and Nokia). Senior Software Engineer Intel Corporation April 2002  –  April 2005  (3 years 1 month) Gdańsk Area, Poland TRD/Design Lead in Wireless Product Division (WPD). Working on Windows and Linux drivers for Intel Centrino platform (802.11 a/b/g and b/g), micro-code for baseband controller, Software Access Point (SoftAP). Software Engineer Intel Corporation November 1999  –  March 2002  (2 years 5 months) Gdańsk Area, Poland Various assignments in multiple development organizations (L2 Forwarder, OSPF, RT OS design, ATM Shaper – in uCode, DSLAM, VoIP, IXA SDK). Software Engineer Olicom A/S July 1998  –  October 1999  (1 year 4 months) Gdańsk Area, Poland Joined Olicom A.S. that later on became Intel's acquisition. As part of ATM Switch (Olicom OC-9x00 product line) development team responsible for MPOA, LANE and SNMP implementations. Network Administrator / IT Specialist Prosper Bank S.A. September 1997  –  July 1998  (11 months) Strategic Planner Intel Corporation April 2012  – Present (3 years 5 months) Sacramento, California Area <Intel Restricted Secret> :-) Strategic Planner Intel Corporation April 2012  – Present (3 years 5 months) Sacramento, California Area <Intel Restricted Secret> :-) Engineering Manager Intel Corporation November 2007  –  April 2012  (4 years 6 months) Gdańsk Area, Poland Building and leading PCCG Engineering organization in Poland. This very strong Agile team was focused on delivering solutions opening new business models and opportunities related to distributed internet services. This amazing group of individuals developed user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. This team got to finals of Intel Software Quality Award (two times), was first team at Intel to achieve Design For Security Level 3, was chosen to describe its methodology as opening speech for Intel Professionals Conference, our team delivered presentations on Intel Agile Conferences and is recognized as a role model and in agile development. I feel honored that I had this opportunity to lead the group and see how it grows and people are expanding their skills.  \n \nAs Business Unit owner had more site-level duties like ITP Site Committee member (strategic planning for Intel Poland, all business groups’ alignment), ITP Site sponsor for Employee Development, ITP Site sponsor for GPTW. Also as certified T-Coach helped new managers to transition to new role. Recognized trainer for “Strengthening Managers Skills”, “Managing Teams” & “Career Development Workshop”. Engineering Manager Intel Corporation November 2007  –  April 2012  (4 years 6 months) Gdańsk Area, Poland Building and leading PCCG Engineering organization in Poland. This very strong Agile team was focused on delivering solutions opening new business models and opportunities related to distributed internet services. This amazing group of individuals developed user facing services like Anti-Theft, Intel Insider, Identity Protection Technology, and so on. This team got to finals of Intel Software Quality Award (two times), was first team at Intel to achieve Design For Security Level 3, was chosen to describe its methodology as opening speech for Intel Professionals Conference, our team delivered presentations on Intel Agile Conferences and is recognized as a role model and in agile development. I feel honored that I had this opportunity to lead the group and see how it grows and people are expanding their skills.  \n \nAs Business Unit owner had more site-level duties like ITP Site Committee member (strategic planning for Intel Poland, all business groups’ alignment), ITP Site sponsor for Employee Development, ITP Site sponsor for GPTW. Also as certified T-Coach helped new managers to transition to new role. Recognized trainer for “Strengthening Managers Skills”, “Managing Teams” & “Career Development Workshop”. Program Manager Intel Corporation May 2005  –  November 2007  (2 years 7 months) Gdańsk Area, Poland Was responsible for delivery of following product lines: Intel® IXDP2805 and Intel® IXDP2855 Advanced Development Platforms (LINK), Intel NetStructure® IXB2805 3G Boards, and Intel NetStructure® MPCBL0040 Single Board Computer. Besides the regular PM duties (managing $5M+ budget and team of over 100 engineers) I was responsible for requirements gathering, Design Wins, negotiation of contracts and schedules with demanding customer (i.e. Siemens, Motorola and Nokia). Program Manager Intel Corporation May 2005  –  November 2007  (2 years 7 months) Gdańsk Area, Poland Was responsible for delivery of following product lines: Intel® IXDP2805 and Intel® IXDP2855 Advanced Development Platforms (LINK), Intel NetStructure® IXB2805 3G Boards, and Intel NetStructure® MPCBL0040 Single Board Computer. Besides the regular PM duties (managing $5M+ budget and team of over 100 engineers) I was responsible for requirements gathering, Design Wins, negotiation of contracts and schedules with demanding customer (i.e. Siemens, Motorola and Nokia). Senior Software Engineer Intel Corporation April 2002  –  April 2005  (3 years 1 month) Gdańsk Area, Poland TRD/Design Lead in Wireless Product Division (WPD). Working on Windows and Linux drivers for Intel Centrino platform (802.11 a/b/g and b/g), micro-code for baseband controller, Software Access Point (SoftAP). Senior Software Engineer Intel Corporation April 2002  –  April 2005  (3 years 1 month) Gdańsk Area, Poland TRD/Design Lead in Wireless Product Division (WPD). Working on Windows and Linux drivers for Intel Centrino platform (802.11 a/b/g and b/g), micro-code for baseband controller, Software Access Point (SoftAP). Software Engineer Intel Corporation November 1999  –  March 2002  (2 years 5 months) Gdańsk Area, Poland Various assignments in multiple development organizations (L2 Forwarder, OSPF, RT OS design, ATM Shaper – in uCode, DSLAM, VoIP, IXA SDK). Software Engineer Intel Corporation November 1999  –  March 2002  (2 years 5 months) Gdańsk Area, Poland Various assignments in multiple development organizations (L2 Forwarder, OSPF, RT OS design, ATM Shaper – in uCode, DSLAM, VoIP, IXA SDK). Software Engineer Olicom A/S July 1998  –  October 1999  (1 year 4 months) Gdańsk Area, Poland Joined Olicom A.S. that later on became Intel's acquisition. As part of ATM Switch (Olicom OC-9x00 product line) development team responsible for MPOA, LANE and SNMP implementations. Software Engineer Olicom A/S July 1998  –  October 1999  (1 year 4 months) Gdańsk Area, Poland Joined Olicom A.S. that later on became Intel's acquisition. As part of ATM Switch (Olicom OC-9x00 product line) development team responsible for MPOA, LANE and SNMP implementations. Network Administrator / IT Specialist Prosper Bank S.A. September 1997  –  July 1998  (11 months) Network Administrator / IT Specialist Prosper Bank S.A. September 1997  –  July 1998  (11 months) Languages English Full professional proficiency Russian Limited working proficiency German Elementary proficiency English Full professional proficiency Russian Limited working proficiency German Elementary proficiency English Full professional proficiency Russian Limited working proficiency German Elementary proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills Program Management Vendor Management Intel Telecommunications Product Development Embedded Systems Debugging Device Drivers Embedded Software Management Semiconductors Firmware SoC Processors Software Engineering Computer Architecture Agile Methodologies Microprocessors Wireless Linux Strategy Mobile Devices Software Development C Distributed Systems C++ Software Design See 12+     See less Skills  Program Management Vendor Management Intel Telecommunications Product Development Embedded Systems Debugging Device Drivers Embedded Software Management Semiconductors Firmware SoC Processors Software Engineering Computer Architecture Agile Methodologies Microprocessors Wireless Linux Strategy Mobile Devices Software Development C Distributed Systems C++ Software Design See 12+     See less Program Management Vendor Management Intel Telecommunications Product Development Embedded Systems Debugging Device Drivers Embedded Software Management Semiconductors Firmware SoC Processors Software Engineering Computer Architecture Agile Methodologies Microprocessors Wireless Linux Strategy Mobile Devices Software Development C Distributed Systems C++ Software Design See 12+     See less Program Management Vendor Management Intel Telecommunications Product Development Embedded Systems Debugging Device Drivers Embedded Software Management Semiconductors Firmware SoC Processors Software Engineering Computer Architecture Agile Methodologies Microprocessors Wireless Linux Strategy Mobile Devices Software Development C Distributed Systems C++ Software Design See 12+     See less Education Gdańsk University of Technology M.Sc,,  Electronic ,  Telecommunication and Informatics 1994  – 1999 Technical College Electronics 1989  – 1994 Gdańsk University of Technology M.Sc,,  Electronic ,  Telecommunication and Informatics 1994  – 1999 Gdańsk University of Technology M.Sc,,  Electronic ,  Telecommunication and Informatics 1994  – 1999 Gdańsk University of Technology M.Sc,,  Electronic ,  Telecommunication and Informatics 1994  – 1999 Technical College Electronics 1989  – 1994 Technical College Electronics 1989  – 1994 Technical College Electronics 1989  – 1994 Honors & Awards Additional Honors & Awards Author of 5 US patents (#7.069.334, and 4 pending), 2 publications on www.ip.com \nWireless Networking Group Divisional Recognition Award (Freeville 802.11 a/b/g and b/g) \nCIG Services and Support Division Recognition Award (Binford, Wainwright delivery + RNC C-Plane Design Win) \nDEG Achievement Award (Intel Upgrade Services) Additional Honors & Awards Author of 5 US patents (#7.069.334, and 4 pending), 2 publications on www.ip.com \nWireless Networking Group Divisional Recognition Award (Freeville 802.11 a/b/g and b/g) \nCIG Services and Support Division Recognition Award (Binford, Wainwright delivery + RNC C-Plane Design Win) \nDEG Achievement Award (Intel Upgrade Services) Additional Honors & Awards Author of 5 US patents (#7.069.334, and 4 pending), 2 publications on www.ip.com \nWireless Networking Group Divisional Recognition Award (Freeville 802.11 a/b/g and b/g) \nCIG Services and Support Division Recognition Award (Binford, Wainwright delivery + RNC C-Plane Design Win) \nDEG Achievement Award (Intel Upgrade Services) Additional Honors & Awards Author of 5 US patents (#7.069.334, and 4 pending), 2 publications on www.ip.com \nWireless Networking Group Divisional Recognition Award (Freeville 802.11 a/b/g and b/g) \nCIG Services and Support Division Recognition Award (Binford, Wainwright delivery + RNC C-Plane Design Win) \nDEG Achievement Award (Intel Upgrade Services) ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Strategy Cross-functional Team... IT Service Management Intel Product Management Semiconductors Program Management Process Improvement Competitive Analysis Mobile Devices Software Project... Project Management Management Cloud Computing Go-to-market Strategy System Architecture Product Marketing Integration User Interface Design Information Architecture Business Process... User Experience Strategic Partnerships Product Development Usability Testing Graphic Design Web Design Strategic Planning Creative Direction See 14+     See less Skills  Strategy Cross-functional Team... IT Service Management Intel Product Management Semiconductors Program Management Process Improvement Competitive Analysis Mobile Devices Software Project... Project Management Management Cloud Computing Go-to-market Strategy System Architecture Product Marketing Integration User Interface Design Information Architecture Business Process... User Experience Strategic Partnerships Product Development Usability Testing Graphic Design Web Design Strategic Planning Creative Direction See 14+     See less Strategy Cross-functional Team... IT Service Management Intel Product Management Semiconductors Program Management Process Improvement Competitive Analysis Mobile Devices Software Project... Project Management Management Cloud Computing Go-to-market Strategy System Architecture Product Marketing Integration User Interface Design Information Architecture Business Process... User Experience Strategic Partnerships Product Development Usability Testing Graphic Design Web Design Strategic Planning Creative Direction See 14+     See less Strategy Cross-functional Team... IT Service Management Intel Product Management Semiconductors Program Management Process Improvement Competitive Analysis Mobile Devices Software Project... Project Management Management Cloud Computing Go-to-market Strategy System Architecture Product Marketing Integration User Interface Design Information Architecture Business Process... User Experience Strategic Partnerships Product Development Usability Testing Graphic Design Web Design Strategic Planning Creative Direction See 14+     See less "]}