{"position": "Structural Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Structural Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon Forensic Structural Engineer - Western Region Property Division Manager Rimkus Consulting Group January 2005  –  June 2013  (8 years 6 months) Phoenix, Arizona Forensic Structural Engineer and Property Division Manager – performed structural investigation of building collapse and distress due to overload, defective design/construction, foundation movement, earthquake, windstorm, hurricane, construction vibrations and vehicle impact.  \n \nAnalysis tools included hand calculation, spreadsheet programming, and use of finite element analysis software.  \n \nProvided expert witness testimony in deposition, mediation, arbitration and trial. \n \nAs Property Division Manager, trained clients and employees on technical and operational topics using multi-media presentations.  \n \nManager of Arizona and New Mexico District for one year to bridge a temporary vacancy, during which the office culture was re-invigorated with new optimism and revenue of the office increased by approximately $40,000 per consultant. Structural Building Design - Project Engineer Paragon Structural Design January 1999  –  January 2005  (6 years 1 month) Performed structural design of commercial, institutional and industrial buildings in concrete, steel, masonry and wood, including lateral wind and earthquake analysis. Design included structural analysis, detailing, general structural notes and specifications. \n \nAlso performed structural inspection of buildings under construction, which involved working collaboratively with contractors and owners to complete construction on time and in conformance with plans and specifications. Designer of Industrial Electric Heaters Watow Electric Manufacturing Company August 1987  –  August 1993  (6 years 1 month) Greater St. Louis Area Designer of industrial electric heaters, including hands-on collaboration with shop employees to develop designs for unique customer requirements. Worked with Information Systems department to write, debug and implement a design program. \n \nLead person of the shipping department, and equipment operator, during the first 3-½ years of employment. Senior Structural Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon Senior Structural Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon Forensic Structural Engineer - Western Region Property Division Manager Rimkus Consulting Group January 2005  –  June 2013  (8 years 6 months) Phoenix, Arizona Forensic Structural Engineer and Property Division Manager – performed structural investigation of building collapse and distress due to overload, defective design/construction, foundation movement, earthquake, windstorm, hurricane, construction vibrations and vehicle impact.  \n \nAnalysis tools included hand calculation, spreadsheet programming, and use of finite element analysis software.  \n \nProvided expert witness testimony in deposition, mediation, arbitration and trial. \n \nAs Property Division Manager, trained clients and employees on technical and operational topics using multi-media presentations.  \n \nManager of Arizona and New Mexico District for one year to bridge a temporary vacancy, during which the office culture was re-invigorated with new optimism and revenue of the office increased by approximately $40,000 per consultant. Forensic Structural Engineer - Western Region Property Division Manager Rimkus Consulting Group January 2005  –  June 2013  (8 years 6 months) Phoenix, Arizona Forensic Structural Engineer and Property Division Manager – performed structural investigation of building collapse and distress due to overload, defective design/construction, foundation movement, earthquake, windstorm, hurricane, construction vibrations and vehicle impact.  \n \nAnalysis tools included hand calculation, spreadsheet programming, and use of finite element analysis software.  \n \nProvided expert witness testimony in deposition, mediation, arbitration and trial. \n \nAs Property Division Manager, trained clients and employees on technical and operational topics using multi-media presentations.  \n \nManager of Arizona and New Mexico District for one year to bridge a temporary vacancy, during which the office culture was re-invigorated with new optimism and revenue of the office increased by approximately $40,000 per consultant. Structural Building Design - Project Engineer Paragon Structural Design January 1999  –  January 2005  (6 years 1 month) Performed structural design of commercial, institutional and industrial buildings in concrete, steel, masonry and wood, including lateral wind and earthquake analysis. Design included structural analysis, detailing, general structural notes and specifications. \n \nAlso performed structural inspection of buildings under construction, which involved working collaboratively with contractors and owners to complete construction on time and in conformance with plans and specifications. Structural Building Design - Project Engineer Paragon Structural Design January 1999  –  January 2005  (6 years 1 month) Performed structural design of commercial, institutional and industrial buildings in concrete, steel, masonry and wood, including lateral wind and earthquake analysis. Design included structural analysis, detailing, general structural notes and specifications. \n \nAlso performed structural inspection of buildings under construction, which involved working collaboratively with contractors and owners to complete construction on time and in conformance with plans and specifications. Designer of Industrial Electric Heaters Watow Electric Manufacturing Company August 1987  –  August 1993  (6 years 1 month) Greater St. Louis Area Designer of industrial electric heaters, including hands-on collaboration with shop employees to develop designs for unique customer requirements. Worked with Information Systems department to write, debug and implement a design program. \n \nLead person of the shipping department, and equipment operator, during the first 3-½ years of employment. Designer of Industrial Electric Heaters Watow Electric Manufacturing Company August 1987  –  August 1993  (6 years 1 month) Greater St. Louis Area Designer of industrial electric heaters, including hands-on collaboration with shop employees to develop designs for unique customer requirements. Worked with Information Systems department to write, debug and implement a design program. \n \nLead person of the shipping department, and equipment operator, during the first 3-½ years of employment. Skills Expert Witness Forensic Engineering Civil Engineering Foundation Design Forensic Analysis Structural Engineering Geotechnical Engineering Construction Structural Analysis Masonry Bridge Steel Concrete Finite Element Analysis Structural Engineers Skills  Expert Witness Forensic Engineering Civil Engineering Foundation Design Forensic Analysis Structural Engineering Geotechnical Engineering Construction Structural Analysis Masonry Bridge Steel Concrete Finite Element Analysis Structural Engineers Expert Witness Forensic Engineering Civil Engineering Foundation Design Forensic Analysis Structural Engineering Geotechnical Engineering Construction Structural Analysis Masonry Bridge Steel Concrete Finite Element Analysis Structural Engineers Expert Witness Forensic Engineering Civil Engineering Foundation Design Forensic Analysis Structural Engineering Geotechnical Engineering Construction Structural Analysis Masonry Bridge Steel Concrete Finite Element Analysis Structural Engineers Education University of Missouri-Rolla Bachelor of Science and Master of Science,  Civil Engineering (Emphasis on Structural Engineering) 1993  – 1998 University of Missouri-Rolla Bachelor of Science and Master of Science,  Civil Engineering (Emphasis on Structural Engineering) 1993  – 1998 University of Missouri-Rolla Bachelor of Science and Master of Science,  Civil Engineering (Emphasis on Structural Engineering) 1993  – 1998 University of Missouri-Rolla Bachelor of Science and Master of Science,  Civil Engineering (Emphasis on Structural Engineering) 1993  – 1998 ", "Experience Structural Engineer Intel Corporation August 2014  – Present (1 year 1 month) Bengaluru Area, India Engineer, Sr Staff - IC Design Broadcom October 2012  –  August 2014  (1 year 11 months) Bengaluru Area, India R & D Engineer IBM September 2011  –  October 2012  (1 year 2 months) Bengaluru Area, India Design Engineer Analog Devices June 2007  –  September 2011  (4 years 4 months) Structural Engineer Intel Corporation August 2014  – Present (1 year 1 month) Bengaluru Area, India Structural Engineer Intel Corporation August 2014  – Present (1 year 1 month) Bengaluru Area, India Engineer, Sr Staff - IC Design Broadcom October 2012  –  August 2014  (1 year 11 months) Bengaluru Area, India Engineer, Sr Staff - IC Design Broadcom October 2012  –  August 2014  (1 year 11 months) Bengaluru Area, India R & D Engineer IBM September 2011  –  October 2012  (1 year 2 months) Bengaluru Area, India R & D Engineer IBM September 2011  –  October 2012  (1 year 2 months) Bengaluru Area, India Design Engineer Analog Devices June 2007  –  September 2011  (4 years 4 months) Design Engineer Analog Devices June 2007  –  September 2011  (4 years 4 months) Skills Verilog TCL ASIC RTL design Static Timing Analysis VLSI Functional Verification Integrated Circuit... SoC Processors FPGA VHDL SystemVerilog Logic Design IC Microprocessors CMOS Hardware Architecture Debugging EDA Semiconductors Computer Architecture See 7+     See less Skills  Verilog TCL ASIC RTL design Static Timing Analysis VLSI Functional Verification Integrated Circuit... SoC Processors FPGA VHDL SystemVerilog Logic Design IC Microprocessors CMOS Hardware Architecture Debugging EDA Semiconductors Computer Architecture See 7+     See less Verilog TCL ASIC RTL design Static Timing Analysis VLSI Functional Verification Integrated Circuit... SoC Processors FPGA VHDL SystemVerilog Logic Design IC Microprocessors CMOS Hardware Architecture Debugging EDA Semiconductors Computer Architecture See 7+     See less Verilog TCL ASIC RTL design Static Timing Analysis VLSI Functional Verification Integrated Circuit... SoC Processors FPGA VHDL SystemVerilog Logic Design IC Microprocessors CMOS Hardware Architecture Debugging EDA Semiconductors Computer Architecture See 7+     See less Education National Institute of Technology Tiruchirappalli B.Tech.,  Electronics and Communication 2003  – 2007 National Institute of Technology Tiruchirappalli B.Tech.,  Electronics and Communication 2003  – 2007 National Institute of Technology Tiruchirappalli B.Tech.,  Electronics and Communication 2003  – 2007 National Institute of Technology Tiruchirappalli B.Tech.,  Electronics and Communication 2003  – 2007 ", "Experience Thermal/Structural Engineer Intel Corporation September 2004  – Present (11 years) Hillsboro, OR Mechanical Engineer Menova Engineering March 2001  –  February 2004  (3 years) Mechanical Engineer Nortel Networks December 1999  –  March 2000  (4 months) Thermal/Structural Engineer Intel Corporation September 2004  – Present (11 years) Hillsboro, OR Thermal/Structural Engineer Intel Corporation September 2004  – Present (11 years) Hillsboro, OR Mechanical Engineer Menova Engineering March 2001  –  February 2004  (3 years) Mechanical Engineer Menova Engineering March 2001  –  February 2004  (3 years) Mechanical Engineer Nortel Networks December 1999  –  March 2000  (4 months) Mechanical Engineer Nortel Networks December 1999  –  March 2000  (4 months) Education Saint Petersburg State Polytechnical University Master of Science (MSc),  Aerodynamics and Thermodynamics Saint Petersburg State Polytechnical University Master of Science (MSc),  Aerodynamics and Thermodynamics Saint Petersburg State Polytechnical University Master of Science (MSc),  Aerodynamics and Thermodynamics Saint Petersburg State Polytechnical University Master of Science (MSc),  Aerodynamics and Thermodynamics ", "Experience Structural Designer Barry-Wehmiller Design Group Inc.. April 2013  – Present (2 years 5 months) Lake Oswego, Oregon Currently assigned to Intel TICE (Tool Install Central Engineering) Ronler Acres, Hillsboro, Oregon Senior Structural Designer MW Group US Inc. January 2010  –  April 2013  (3 years 4 months) Senior Structural Designer - Tool Install, Hillsboro, Oregon TICE Structural Engineer Intel Corporation 2013  –  2013  (less than a year) Senior Structural Deigner MW Group US Inc. January 2009  –  December 2009  (1 year) Senior Structural Designer -300mm Tool Install, Pheonix, Arizona Architectural, Industrial, Structural Design MW Group March 2005  –  December 2008  (3 years 10 months) Structural Design lead - Tool Install \nArchitectural Design Lead - Tool Install \nIE Layout 200 & 300mm Manufacturing Structural Designer Barry-Wehmiller Design Group Inc.. April 2013  – Present (2 years 5 months) Lake Oswego, Oregon Currently assigned to Intel TICE (Tool Install Central Engineering) Ronler Acres, Hillsboro, Oregon Structural Designer Barry-Wehmiller Design Group Inc.. April 2013  – Present (2 years 5 months) Lake Oswego, Oregon Currently assigned to Intel TICE (Tool Install Central Engineering) Ronler Acres, Hillsboro, Oregon Senior Structural Designer MW Group US Inc. January 2010  –  April 2013  (3 years 4 months) Senior Structural Designer - Tool Install, Hillsboro, Oregon Senior Structural Designer MW Group US Inc. January 2010  –  April 2013  (3 years 4 months) Senior Structural Designer - Tool Install, Hillsboro, Oregon TICE Structural Engineer Intel Corporation 2013  –  2013  (less than a year) TICE Structural Engineer Intel Corporation 2013  –  2013  (less than a year) Senior Structural Deigner MW Group US Inc. January 2009  –  December 2009  (1 year) Senior Structural Designer -300mm Tool Install, Pheonix, Arizona Senior Structural Deigner MW Group US Inc. January 2009  –  December 2009  (1 year) Senior Structural Designer -300mm Tool Install, Pheonix, Arizona Architectural, Industrial, Structural Design MW Group March 2005  –  December 2008  (3 years 10 months) Structural Design lead - Tool Install \nArchitectural Design Lead - Tool Install \nIE Layout 200 & 300mm Manufacturing Architectural, Industrial, Structural Design MW Group March 2005  –  December 2008  (3 years 10 months) Structural Design lead - Tool Install \nArchitectural Design Lead - Tool Install \nIE Layout 200 & 300mm Manufacturing Skills AutoCAD AutoCAD Mechanical AutoCAD Architecture Revit CoCreate Mastercam Solidworks IT Solutions File Management Cad Management Mechanical Aptitude Structural Aptitude Designs Innovation CAD Microstation Navisworks Structural Engineering Architectural Design Piping 3D Construction Engineering Materials See 9+     See less Skills  AutoCAD AutoCAD Mechanical AutoCAD Architecture Revit CoCreate Mastercam Solidworks IT Solutions File Management Cad Management Mechanical Aptitude Structural Aptitude Designs Innovation CAD Microstation Navisworks Structural Engineering Architectural Design Piping 3D Construction Engineering Materials See 9+     See less AutoCAD AutoCAD Mechanical AutoCAD Architecture Revit CoCreate Mastercam Solidworks IT Solutions File Management Cad Management Mechanical Aptitude Structural Aptitude Designs Innovation CAD Microstation Navisworks Structural Engineering Architectural Design Piping 3D Construction Engineering Materials See 9+     See less AutoCAD AutoCAD Mechanical AutoCAD Architecture Revit CoCreate Mastercam Solidworks IT Solutions File Management Cad Management Mechanical Aptitude Structural Aptitude Designs Innovation CAD Microstation Navisworks Structural Engineering Architectural Design Piping 3D Construction Engineering Materials See 9+     See less ", "Summary Career-oriented structural engineering professional with over 24 years of experience in both corporate and consulting environments. Progressive technical and project management experience and ability to understand and focus on client’s core business. Recognized nationally as expert in seismic engineering of nonstructural components. Outstanding management and communication skills including a natural ability to convey technical information to non-technical audiences. Summary Career-oriented structural engineering professional with over 24 years of experience in both corporate and consulting environments. Progressive technical and project management experience and ability to understand and focus on client’s core business. Recognized nationally as expert in seismic engineering of nonstructural components. Outstanding management and communication skills including a natural ability to convey technical information to non-technical audiences. Career-oriented structural engineering professional with over 24 years of experience in both corporate and consulting environments. Progressive technical and project management experience and ability to understand and focus on client’s core business. Recognized nationally as expert in seismic engineering of nonstructural components. Outstanding management and communication skills including a natural ability to convey technical information to non-technical audiences. Career-oriented structural engineering professional with over 24 years of experience in both corporate and consulting environments. Progressive technical and project management experience and ability to understand and focus on client’s core business. Recognized nationally as expert in seismic engineering of nonstructural components. Outstanding management and communication skills including a natural ability to convey technical information to non-technical audiences. Experience Senior Structural Engineer Intel Corporation 2001  – Present (14 years) Hillsboro, OR Engineering expert and strategic resource for all structural issues worldwide. Owner and interpreter of all factory master designs, structural master design standards and structural specifications. Seismic expert for new & existing buildings, clean room components, and all tools & equipment. Internal strategic resource for vibration performance of both facilities and critical process tools. Facilities System Group Manager Intel Corporation 2004  –  2006  (2 years) Hillsboro, OR Principal Degenkolb Engineers 2000  –  2001  (1 year) Portland, OR Project manager responsible for all facets of expert consulting engineering practice including client development and support, written proposals and interviews, project scheduling and budgets, engineering management of technical and non-technical staff, management of consultants, and services during construction. Acted in responsible charge of the production of drawings and reports for the structural design of new buildings and the seismic evaluation and strengthening of existing buildings, expert peer review of work by other consultants for critical new design and seismic rehabilitation projects and project coordinator and technical editor of several industry- and government-sponsored research and code-review projects. Associate Principal Degenkolb Engineers 1997  –  2000  (3 years) Portland, OR Associate Principal, Design Engineer, Structural Designer Degenkolb Engineers 1989  –  1997  (8 years) San Francisco, CA Senior Structural Engineer Intel Corporation 2001  – Present (14 years) Hillsboro, OR Engineering expert and strategic resource for all structural issues worldwide. Owner and interpreter of all factory master designs, structural master design standards and structural specifications. Seismic expert for new & existing buildings, clean room components, and all tools & equipment. Internal strategic resource for vibration performance of both facilities and critical process tools. Senior Structural Engineer Intel Corporation 2001  – Present (14 years) Hillsboro, OR Engineering expert and strategic resource for all structural issues worldwide. Owner and interpreter of all factory master designs, structural master design standards and structural specifications. Seismic expert for new & existing buildings, clean room components, and all tools & equipment. Internal strategic resource for vibration performance of both facilities and critical process tools. Facilities System Group Manager Intel Corporation 2004  –  2006  (2 years) Hillsboro, OR Facilities System Group Manager Intel Corporation 2004  –  2006  (2 years) Hillsboro, OR Principal Degenkolb Engineers 2000  –  2001  (1 year) Portland, OR Project manager responsible for all facets of expert consulting engineering practice including client development and support, written proposals and interviews, project scheduling and budgets, engineering management of technical and non-technical staff, management of consultants, and services during construction. Acted in responsible charge of the production of drawings and reports for the structural design of new buildings and the seismic evaluation and strengthening of existing buildings, expert peer review of work by other consultants for critical new design and seismic rehabilitation projects and project coordinator and technical editor of several industry- and government-sponsored research and code-review projects. Principal Degenkolb Engineers 2000  –  2001  (1 year) Portland, OR Project manager responsible for all facets of expert consulting engineering practice including client development and support, written proposals and interviews, project scheduling and budgets, engineering management of technical and non-technical staff, management of consultants, and services during construction. Acted in responsible charge of the production of drawings and reports for the structural design of new buildings and the seismic evaluation and strengthening of existing buildings, expert peer review of work by other consultants for critical new design and seismic rehabilitation projects and project coordinator and technical editor of several industry- and government-sponsored research and code-review projects. Associate Principal Degenkolb Engineers 1997  –  2000  (3 years) Portland, OR Associate Principal Degenkolb Engineers 1997  –  2000  (3 years) Portland, OR Associate Principal, Design Engineer, Structural Designer Degenkolb Engineers 1989  –  1997  (8 years) San Francisco, CA Associate Principal, Design Engineer, Structural Designer Degenkolb Engineers 1989  –  1997  (8 years) San Francisco, CA Languages   Skills Skills     Education University of California, Berkeley Master's Degree,  Structural Engineering Mechanics of Materials 1989  – 1990 University of California, Berkeley Bachelor's Degree,  Civil Engineering 1985  – 1989 University of California, Berkeley Master's Degree,  Structural Engineering Mechanics of Materials 1989  – 1990 University of California, Berkeley Master's Degree,  Structural Engineering Mechanics of Materials 1989  – 1990 University of California, Berkeley Master's Degree,  Structural Engineering Mechanics of Materials 1989  – 1990 University of California, Berkeley Bachelor's Degree,  Civil Engineering 1985  – 1989 University of California, Berkeley Bachelor's Degree,  Civil Engineering 1985  – 1989 University of California, Berkeley Bachelor's Degree,  Civil Engineering 1985  – 1989 Honors & Awards ", "Experience Regional Structural Engineer Intel Corporation Regional Structural Engineer Intel Corporation Regional Structural Engineer Intel Corporation ", "Summary Construction Projects Managed at intel  \n \n-Guadalajara New Site, Office Buildings PM 2013 \n-AFZ Intel Campus Fit Up (office Fit Up) 2012 \n-Electrical Room Construction for N2 plant 2012 \nIntel N2 Plant Retrofit 2 years \n-Electromechanical Retrofit: new compressors, Liquid N2 tanks installation, new transformer and new cold box installation \n-Civil Works electrical room construction \nLife Safety Alarms Retrofit \n-Entire new alarms system, voice system and  \nWaste Water Plant Filtration System 8 months \n-New filter and controls implementation \nIntel Innovation Center \n-Architectural Retrofit  \nCBI Project 1.5 years \n-Electromechanical infrastructure Retrofit \n \nFacilities Engineer Responsible for the following Systems: \n-Cooling Water System \n-Compress Air System \n-Mechanical Budge,  \n-Nitrogen System \n \nSpecialties:  \nMember of Colegio Federado de Ingenieros de Costa Rica \nProject Manager Professional and PMI Active Member \nNational Fire Protection Association Certification Norm 101 \nATC-20 Certification Post Seismic Building Evaluation \nOSHA General Standards for Construction Industry UCSD Summary Construction Projects Managed at intel  \n \n-Guadalajara New Site, Office Buildings PM 2013 \n-AFZ Intel Campus Fit Up (office Fit Up) 2012 \n-Electrical Room Construction for N2 plant 2012 \nIntel N2 Plant Retrofit 2 years \n-Electromechanical Retrofit: new compressors, Liquid N2 tanks installation, new transformer and new cold box installation \n-Civil Works electrical room construction \nLife Safety Alarms Retrofit \n-Entire new alarms system, voice system and  \nWaste Water Plant Filtration System 8 months \n-New filter and controls implementation \nIntel Innovation Center \n-Architectural Retrofit  \nCBI Project 1.5 years \n-Electromechanical infrastructure Retrofit \n \nFacilities Engineer Responsible for the following Systems: \n-Cooling Water System \n-Compress Air System \n-Mechanical Budge,  \n-Nitrogen System \n \nSpecialties:  \nMember of Colegio Federado de Ingenieros de Costa Rica \nProject Manager Professional and PMI Active Member \nNational Fire Protection Association Certification Norm 101 \nATC-20 Certification Post Seismic Building Evaluation \nOSHA General Standards for Construction Industry UCSD Construction Projects Managed at intel  \n \n-Guadalajara New Site, Office Buildings PM 2013 \n-AFZ Intel Campus Fit Up (office Fit Up) 2012 \n-Electrical Room Construction for N2 plant 2012 \nIntel N2 Plant Retrofit 2 years \n-Electromechanical Retrofit: new compressors, Liquid N2 tanks installation, new transformer and new cold box installation \n-Civil Works electrical room construction \nLife Safety Alarms Retrofit \n-Entire new alarms system, voice system and  \nWaste Water Plant Filtration System 8 months \n-New filter and controls implementation \nIntel Innovation Center \n-Architectural Retrofit  \nCBI Project 1.5 years \n-Electromechanical infrastructure Retrofit \n \nFacilities Engineer Responsible for the following Systems: \n-Cooling Water System \n-Compress Air System \n-Mechanical Budge,  \n-Nitrogen System \n \nSpecialties:  \nMember of Colegio Federado de Ingenieros de Costa Rica \nProject Manager Professional and PMI Active Member \nNational Fire Protection Association Certification Norm 101 \nATC-20 Certification Post Seismic Building Evaluation \nOSHA General Standards for Construction Industry UCSD Construction Projects Managed at intel  \n \n-Guadalajara New Site, Office Buildings PM 2013 \n-AFZ Intel Campus Fit Up (office Fit Up) 2012 \n-Electrical Room Construction for N2 plant 2012 \nIntel N2 Plant Retrofit 2 years \n-Electromechanical Retrofit: new compressors, Liquid N2 tanks installation, new transformer and new cold box installation \n-Civil Works electrical room construction \nLife Safety Alarms Retrofit \n-Entire new alarms system, voice system and  \nWaste Water Plant Filtration System 8 months \n-New filter and controls implementation \nIntel Innovation Center \n-Architectural Retrofit  \nCBI Project 1.5 years \n-Electromechanical infrastructure Retrofit \n \nFacilities Engineer Responsible for the following Systems: \n-Cooling Water System \n-Compress Air System \n-Mechanical Budge,  \n-Nitrogen System \n \nSpecialties:  \nMember of Colegio Federado de Ingenieros de Costa Rica \nProject Manager Professional and PMI Active Member \nNational Fire Protection Association Certification Norm 101 \nATC-20 Certification Post Seismic Building Evaluation \nOSHA General Standards for Construction Industry UCSD Experience VLSI Structural Engineer Intel Corporation May 2014  – Present (1 year 4 months) Contruction Project Manager Intel 2007  –  May 2014  (7 years) Project Manager Profesional credential (PMI) \n \nResponsible for projects scope, budget and schedule for construction project. \nIncluding project team supervision, customers and stakeholder management. Facilities Engineer Intel 2002  –  2007  (5 years) Engineer in charge of systems maintenance coordination such as Nitrogen Plant, Oil Free Compress Air, Cooling towers. \nResponsible for mechanical budget, contracts maintenance services, contractors supervision, indetify and implement system improvements in terms of energy efficiency, cost reduction. \nResponsible for system statistical analysis, define control limits, identify system out of control reasons and trends evaluation VLSI Structural Engineer Intel Corporation May 2014  – Present (1 year 4 months) VLSI Structural Engineer Intel Corporation May 2014  – Present (1 year 4 months) Contruction Project Manager Intel 2007  –  May 2014  (7 years) Project Manager Profesional credential (PMI) \n \nResponsible for projects scope, budget and schedule for construction project. \nIncluding project team supervision, customers and stakeholder management. Contruction Project Manager Intel 2007  –  May 2014  (7 years) Project Manager Profesional credential (PMI) \n \nResponsible for projects scope, budget and schedule for construction project. \nIncluding project team supervision, customers and stakeholder management. Facilities Engineer Intel 2002  –  2007  (5 years) Engineer in charge of systems maintenance coordination such as Nitrogen Plant, Oil Free Compress Air, Cooling towers. \nResponsible for mechanical budget, contracts maintenance services, contractors supervision, indetify and implement system improvements in terms of energy efficiency, cost reduction. \nResponsible for system statistical analysis, define control limits, identify system out of control reasons and trends evaluation Facilities Engineer Intel 2002  –  2007  (5 years) Engineer in charge of systems maintenance coordination such as Nitrogen Plant, Oil Free Compress Air, Cooling towers. \nResponsible for mechanical budget, contracts maintenance services, contractors supervision, indetify and implement system improvements in terms of energy efficiency, cost reduction. \nResponsible for system statistical analysis, define control limits, identify system out of control reasons and trends evaluation Languages English English English Skills Engineering Management Factory Facilities Management Electricians Semiconductors Construction Energy Efficiency Engineering Manufacturing Semiconductor Industry CAD Unix TLC Skills  Engineering Management Factory Facilities Management Electricians Semiconductors Construction Energy Efficiency Engineering Manufacturing Semiconductor Industry CAD Unix TLC Engineering Management Factory Facilities Management Electricians Semiconductors Construction Energy Efficiency Engineering Manufacturing Semiconductor Industry CAD Unix TLC Engineering Management Factory Facilities Management Electricians Semiconductors Construction Energy Efficiency Engineering Manufacturing Semiconductor Industry CAD Unix TLC Education Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering , Bachiller 1999  – 2002 Universidad Central (CR) Licenciado,  Civil Engineer Civil Engineering Licenced Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering , Bachiller 1999  – 2002 Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering , Bachiller 1999  – 2002 Universidad Internacional de las Américas Bachelor's degree,  Industrial Engineering , Bachiller 1999  – 2002 Universidad Central (CR) Licenciado,  Civil Engineer Civil Engineering Licenced Universidad Central (CR) Licenciado,  Civil Engineer Civil Engineering Licenced Universidad Central (CR) Licenciado,  Civil Engineer Civil Engineering Licenced Honors & Awards Construction Achievement Award Intel Corporation February 2014 Construction Achievement Award Intel Corporation February 2008 Additional Honors & Awards Micro Electronics Technician Honor Graduation Instituto Nacional de  \n \nConstruction Division Award Intel Corporation Construction Achievement Award Intel Corporation February 2014 Construction Achievement Award Intel Corporation February 2014 Construction Achievement Award Intel Corporation February 2014 Construction Achievement Award Intel Corporation February 2008 Construction Achievement Award Intel Corporation February 2008 Construction Achievement Award Intel Corporation February 2008 Additional Honors & Awards Micro Electronics Technician Honor Graduation Instituto Nacional de  \n \nConstruction Division Award Intel Corporation Additional Honors & Awards Micro Electronics Technician Honor Graduation Instituto Nacional de  \n \nConstruction Division Award Intel Corporation Additional Honors & Awards Micro Electronics Technician Honor Graduation Instituto Nacional de  \n \nConstruction Division Award Intel Corporation ", "Experience Structural Department Manager, Sr. Associate SSOE Group (formerly Evergreen EDC) January 2013  – Present (2 years 8 months) Principal/Structural Engineering Manager Evergreen EDC July 2007  –  January 2013  (5 years 7 months) Hillsboro, Oregon Structural Engineer Intel Corporation February 2006  –  June 2007  (1 year 5 months) Hillsoboro, Oregon Structural Engineer Degenkolb Engineers January 2000  –  January 2006  (6 years 1 month) Portland, Oregon Structural Department Manager, Sr. Associate SSOE Group (formerly Evergreen EDC) January 2013  – Present (2 years 8 months) Structural Department Manager, Sr. Associate SSOE Group (formerly Evergreen EDC) January 2013  – Present (2 years 8 months) Principal/Structural Engineering Manager Evergreen EDC July 2007  –  January 2013  (5 years 7 months) Hillsboro, Oregon Principal/Structural Engineering Manager Evergreen EDC July 2007  –  January 2013  (5 years 7 months) Hillsboro, Oregon Structural Engineer Intel Corporation February 2006  –  June 2007  (1 year 5 months) Hillsoboro, Oregon Structural Engineer Intel Corporation February 2006  –  June 2007  (1 year 5 months) Hillsoboro, Oregon Structural Engineer Degenkolb Engineers January 2000  –  January 2006  (6 years 1 month) Portland, Oregon Structural Engineer Degenkolb Engineers January 2000  –  January 2006  (6 years 1 month) Portland, Oregon Skills Structural Engineering AutoCAD Manufacturing Engineering Engineering Management Construction Management CAD Contract Management Steel Structures Skills  Structural Engineering AutoCAD Manufacturing Engineering Engineering Management Construction Management CAD Contract Management Steel Structures Structural Engineering AutoCAD Manufacturing Engineering Engineering Management Construction Management CAD Contract Management Steel Structures Structural Engineering AutoCAD Manufacturing Engineering Engineering Management Construction Management CAD Contract Management Steel Structures Education University of Nevada-Reno Master of Science (M.S.),  Civil Engineering 1998  – 1999 University of Nevada-Reno Bachelor of Science (B.S.),  Civil Engineering 1994  – 1998 University of Nevada-Reno Master of Science (M.S.),  Civil Engineering 1998  – 1999 University of Nevada-Reno Master of Science (M.S.),  Civil Engineering 1998  – 1999 University of Nevada-Reno Master of Science (M.S.),  Civil Engineering 1998  – 1999 University of Nevada-Reno Bachelor of Science (B.S.),  Civil Engineering 1994  – 1998 University of Nevada-Reno Bachelor of Science (B.S.),  Civil Engineering 1994  – 1998 University of Nevada-Reno Bachelor of Science (B.S.),  Civil Engineering 1994  – 1998 ", "Experience Tool Install Structural Engineer Intel Corporation June 2013  – Present (2 years 3 months) Civil Engineer Intern Freeport-McMoRan Copper & Gold Inc. May 2012  –  May 2013  (1 year 1 month) Civil Engineer Intern ADOT May 2011  –  March 2012  (11 months) Tool Install Structural Engineer Intel Corporation June 2013  – Present (2 years 3 months) Tool Install Structural Engineer Intel Corporation June 2013  – Present (2 years 3 months) Civil Engineer Intern Freeport-McMoRan Copper & Gold Inc. May 2012  –  May 2013  (1 year 1 month) Civil Engineer Intern Freeport-McMoRan Copper & Gold Inc. May 2012  –  May 2013  (1 year 1 month) Civil Engineer Intern ADOT May 2011  –  March 2012  (11 months) Civil Engineer Intern ADOT May 2011  –  March 2012  (11 months) Skills Structural Engineering AutoCAD Structural Analysis AutoCAD Civil 3D Steel Design Surveying RISA SAP2000 Construction Engineering Microstation Bridge Civil Engineering Concrete Construction Management Matlab CAD Construction See 2+     See less Skills  Structural Engineering AutoCAD Structural Analysis AutoCAD Civil 3D Steel Design Surveying RISA SAP2000 Construction Engineering Microstation Bridge Civil Engineering Concrete Construction Management Matlab CAD Construction See 2+     See less Structural Engineering AutoCAD Structural Analysis AutoCAD Civil 3D Steel Design Surveying RISA SAP2000 Construction Engineering Microstation Bridge Civil Engineering Concrete Construction Management Matlab CAD Construction See 2+     See less Structural Engineering AutoCAD Structural Analysis AutoCAD Civil 3D Steel Design Surveying RISA SAP2000 Construction Engineering Microstation Bridge Civil Engineering Concrete Construction Management Matlab CAD Construction See 2+     See less Education University of Arizona Bachelor's degree,  Civil Engineering 2009  – 2013 Summa Cum Laude University of Arizona Bachelor's degree,  Civil Engineering 2009  – 2013 Summa Cum Laude University of Arizona Bachelor's degree,  Civil Engineering 2009  – 2013 Summa Cum Laude University of Arizona Bachelor's degree,  Civil Engineering 2009  – 2013 Summa Cum Laude "]}