{"position": "Supplier Manager", "company": "Intel Corporation", "profiles": ["Experience Supplier Manager Intel Corporation July 2013  – Present (2 years 2 months) Intern- Supply Chain Management Domino's Pizza Enterprises Limited May 2012  –  August 2012  (4 months) Server Stillwater Grill August 2009  –  February 2012  (2 years 7 months) Okemos, MI Waited tables during busy hours of the day Supplier Manager Intel Corporation July 2013  – Present (2 years 2 months) Supplier Manager Intel Corporation July 2013  – Present (2 years 2 months) Intern- Supply Chain Management Domino's Pizza Enterprises Limited May 2012  –  August 2012  (4 months) Intern- Supply Chain Management Domino's Pizza Enterprises Limited May 2012  –  August 2012  (4 months) Server Stillwater Grill August 2009  –  February 2012  (2 years 7 months) Okemos, MI Waited tables during busy hours of the day Server Stillwater Grill August 2009  –  February 2012  (2 years 7 months) Okemos, MI Waited tables during busy hours of the day Skills Microsoft Office Microsoft Word Microsoft Excel Teamwork PowerPoint Customer Service Skills  Microsoft Office Microsoft Word Microsoft Excel Teamwork PowerPoint Customer Service Microsoft Office Microsoft Word Microsoft Excel Teamwork PowerPoint Customer Service Microsoft Office Microsoft Word Microsoft Excel Teamwork PowerPoint Customer Service Education Michigan State University - The Eli Broad Graduate School of Management Bachelor of Science (BS),  Supply Chain Management 2009  – 2013 Activities and Societies:  Multicultural Business Students\nMSU Supply Chain Management Association Michigan State University - The Eli Broad Graduate School of Management Bachelor of Science (BS),  Supply Chain Management 2009  – 2013 Activities and Societies:  Multicultural Business Students\nMSU Supply Chain Management Association Michigan State University - The Eli Broad Graduate School of Management Bachelor of Science (BS),  Supply Chain Management 2009  – 2013 Activities and Societies:  Multicultural Business Students\nMSU Supply Chain Management Association Michigan State University - The Eli Broad Graduate School of Management Bachelor of Science (BS),  Supply Chain Management 2009  – 2013 Activities and Societies:  Multicultural Business Students\nMSU Supply Chain Management Association ", "Experience 3PL Supplier Manager Intel Corporation September 2014  – Present (1 year) Intel Ireland Supplier Manager responsible for site's chemical and gas 3PL provider Gases Buyer Intel Corporation November 2011  –  September 2014  (2 years 11 months) Intel Ireland Buyer responsible for procurement of gases for factory operations Ireland Site Supply Line POC Intel Corporation April 2011  –  November 2011  (8 months) Intel Ireland Project Management role. Site POC responsible for supply line management of spare parts for factory install and qual project. Gas and Chemicals Buyer Intel Corporation January 2009  –  April 2011  (2 years 4 months) Intel Ireland Buyer responsible for procurement of gas and chemicals for factory operations Spare Parts Buyer Intel Corporation January 2007  –  December 2008  (2 years) Intel Ireland Buyer responsible for procurement of spare parts from major semiconductor equipment supplier. Spare Parts Buyer Intel Corporation January 2006  –  December 2006  (1 year) Intel Ireland Buyer responsible for procurement of spare parts from multiple medium-sized semiconductor equipment suppliers Inventory Analyst Intel Corporation October 2004  –  December 2005  (1 year 3 months) Intel Ireland Responsible for new part adds to site Bill of Materials and analysis of inventory profile to minimise inventory on hand. Capital Finance Analyst Intel Corporation June 2003  –  September 2004  (1 year 4 months) Intel Ireland Responsible for capital project spending and depreciation forecasting 3PL Supplier Manager Intel Corporation September 2014  – Present (1 year) Intel Ireland Supplier Manager responsible for site's chemical and gas 3PL provider 3PL Supplier Manager Intel Corporation September 2014  – Present (1 year) Intel Ireland Supplier Manager responsible for site's chemical and gas 3PL provider Gases Buyer Intel Corporation November 2011  –  September 2014  (2 years 11 months) Intel Ireland Buyer responsible for procurement of gases for factory operations Gases Buyer Intel Corporation November 2011  –  September 2014  (2 years 11 months) Intel Ireland Buyer responsible for procurement of gases for factory operations Ireland Site Supply Line POC Intel Corporation April 2011  –  November 2011  (8 months) Intel Ireland Project Management role. Site POC responsible for supply line management of spare parts for factory install and qual project. Ireland Site Supply Line POC Intel Corporation April 2011  –  November 2011  (8 months) Intel Ireland Project Management role. Site POC responsible for supply line management of spare parts for factory install and qual project. Gas and Chemicals Buyer Intel Corporation January 2009  –  April 2011  (2 years 4 months) Intel Ireland Buyer responsible for procurement of gas and chemicals for factory operations Gas and Chemicals Buyer Intel Corporation January 2009  –  April 2011  (2 years 4 months) Intel Ireland Buyer responsible for procurement of gas and chemicals for factory operations Spare Parts Buyer Intel Corporation January 2007  –  December 2008  (2 years) Intel Ireland Buyer responsible for procurement of spare parts from major semiconductor equipment supplier. Spare Parts Buyer Intel Corporation January 2007  –  December 2008  (2 years) Intel Ireland Buyer responsible for procurement of spare parts from major semiconductor equipment supplier. Spare Parts Buyer Intel Corporation January 2006  –  December 2006  (1 year) Intel Ireland Buyer responsible for procurement of spare parts from multiple medium-sized semiconductor equipment suppliers Spare Parts Buyer Intel Corporation January 2006  –  December 2006  (1 year) Intel Ireland Buyer responsible for procurement of spare parts from multiple medium-sized semiconductor equipment suppliers Inventory Analyst Intel Corporation October 2004  –  December 2005  (1 year 3 months) Intel Ireland Responsible for new part adds to site Bill of Materials and analysis of inventory profile to minimise inventory on hand. Inventory Analyst Intel Corporation October 2004  –  December 2005  (1 year 3 months) Intel Ireland Responsible for new part adds to site Bill of Materials and analysis of inventory profile to minimise inventory on hand. Capital Finance Analyst Intel Corporation June 2003  –  September 2004  (1 year 4 months) Intel Ireland Responsible for capital project spending and depreciation forecasting Capital Finance Analyst Intel Corporation June 2003  –  September 2004  (1 year 4 months) Intel Ireland Responsible for capital project spending and depreciation forecasting Skills Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Skills  Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Education Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider ", "Experience TSM Supplier Manager Intel Corporation TSM Supplier Manager Intel Corporation TSM Supplier Manager Intel Corporation Skills Semiconductors Semiconductor Industry IC Silicon Intel ASIC Processors Analog Failure Analysis CMOS Product Engineering SoC Yield Mixed Signal Process Integration Program Management See 1+     See less Skills  Semiconductors Semiconductor Industry IC Silicon Intel ASIC Processors Analog Failure Analysis CMOS Product Engineering SoC Yield Mixed Signal Process Integration Program Management See 1+     See less Semiconductors Semiconductor Industry IC Silicon Intel ASIC Processors Analog Failure Analysis CMOS Product Engineering SoC Yield Mixed Signal Process Integration Program Management See 1+     See less Semiconductors Semiconductor Industry IC Silicon Intel ASIC Processors Analog Failure Analysis CMOS Product Engineering SoC Yield Mixed Signal Process Integration Program Management See 1+     See less ", "Experience Supplier Manager Intel Corporation Supplier Manager Intel Corporation Supplier Manager Intel Corporation Education Arizona State University 1980  – 1986 Arizona State University 1980  – 1986 Arizona State University 1980  – 1986 Arizona State University 1980  – 1986 ", "Experience Risk and Compliance Mgr, Outsource Supplier Manager Intel Corporation April 1975  – Present (40 years 5 months) Purchasing Buyer Intel 1975  –  2012  (37 years) Purchasing Intel 1974  –  2009  (35 years) Marketing Intel Corporation 1974  –  2009  (35 years) Risk and Compliance Mgr, Outsource Supplier Manager Intel Corporation April 1975  – Present (40 years 5 months) Risk and Compliance Mgr, Outsource Supplier Manager Intel Corporation April 1975  – Present (40 years 5 months) Purchasing Buyer Intel 1975  –  2012  (37 years) Purchasing Buyer Intel 1975  –  2012  (37 years) Purchasing Intel 1974  –  2009  (35 years) Purchasing Intel 1974  –  2009  (35 years) Marketing Intel Corporation 1974  –  2009  (35 years) Marketing Intel Corporation 1974  –  2009  (35 years) Education De Anza College 1972  – 1975 De Anza College 1972  – 1974 De Anza College 1972  – 1975 De Anza College 1972  – 1975 De Anza College 1972  – 1975 De Anza College 1972  – 1974 De Anza College 1972  – 1974 De Anza College 1972  – 1974 ", "Experience commodity manager Intel Corporation November 1987  – Present (27 years 10 months) Santa Clara, CA Responsible for managing contracts and business relationships with key OEM suppliers. Assess customer requirements, develop sourcing strategy, negotiate and securing contracts, prepare expenditures plan, drive quality improvement programs, and conduct strategic supplier meetings/programs commodity manager Intel Corporation November 1987  – Present (27 years 10 months) Santa Clara, CA Responsible for managing contracts and business relationships with key OEM suppliers. Assess customer requirements, develop sourcing strategy, negotiate and securing contracts, prepare expenditures plan, drive quality improvement programs, and conduct strategic supplier meetings/programs commodity manager Intel Corporation November 1987  – Present (27 years 10 months) Santa Clara, CA Responsible for managing contracts and business relationships with key OEM suppliers. Assess customer requirements, develop sourcing strategy, negotiate and securing contracts, prepare expenditures plan, drive quality improvement programs, and conduct strategic supplier meetings/programs Skills Strategy Strategic Sourcing Negotiation Procurement Cross-functional Team... Supply Management Supply Chain Management Contract Management Six Sigma Supplier Evaluation Program Management Skills  Strategy Strategic Sourcing Negotiation Procurement Cross-functional Team... Supply Management Supply Chain Management Contract Management Six Sigma Supplier Evaluation Program Management Strategy Strategic Sourcing Negotiation Procurement Cross-functional Team... Supply Management Supply Chain Management Contract Management Six Sigma Supplier Evaluation Program Management Strategy Strategic Sourcing Negotiation Procurement Cross-functional Team... Supply Management Supply Chain Management Contract Management Six Sigma Supplier Evaluation Program Management Education San Jose State University Business Administration and Management , General San Jose State University Business Administration and Management , General San Jose State University Business Administration and Management , General San Jose State University Business Administration and Management , General ", "Experience Retirement Finance Analyst/Supplier Manager Intel Corporation February 2014  – Present (1 year 7 months) Senior Accountant GALLINA LLP January 2011  –  February 2014  (3 years 2 months) Audit Experience: \nConstruction, real estate, employee benefit, government, and non-profit audit experience. \n \nTax Experience: \nPreparation of Corporation, Partnership, LLC, SMLLC, LLP, and Individual tax returns. \n \nOther Experience: \nReview and Compilation experience Sales Macy's May 2009  –  December 2010  (1 year 8 months) Recruiter K-Designers August 2005  –  November 2008  (3 years 4 months) Retirement Finance Analyst/Supplier Manager Intel Corporation February 2014  – Present (1 year 7 months) Retirement Finance Analyst/Supplier Manager Intel Corporation February 2014  – Present (1 year 7 months) Senior Accountant GALLINA LLP January 2011  –  February 2014  (3 years 2 months) Audit Experience: \nConstruction, real estate, employee benefit, government, and non-profit audit experience. \n \nTax Experience: \nPreparation of Corporation, Partnership, LLC, SMLLC, LLP, and Individual tax returns. \n \nOther Experience: \nReview and Compilation experience Senior Accountant GALLINA LLP January 2011  –  February 2014  (3 years 2 months) Audit Experience: \nConstruction, real estate, employee benefit, government, and non-profit audit experience. \n \nTax Experience: \nPreparation of Corporation, Partnership, LLC, SMLLC, LLP, and Individual tax returns. \n \nOther Experience: \nReview and Compilation experience Sales Macy's May 2009  –  December 2010  (1 year 8 months) Sales Macy's May 2009  –  December 2010  (1 year 8 months) Recruiter K-Designers August 2005  –  November 2008  (3 years 4 months) Recruiter K-Designers August 2005  –  November 2008  (3 years 4 months) Skills Accounting Audits of Employee... Compilation Of... Financial Statement... Government Auditing Tax Returns GAAP Tax ProSystem fx Tax CCH ProSystem fx Skills  Accounting Audits of Employee... Compilation Of... Financial Statement... Government Auditing Tax Returns GAAP Tax ProSystem fx Tax CCH ProSystem fx Accounting Audits of Employee... Compilation Of... Financial Statement... Government Auditing Tax Returns GAAP Tax ProSystem fx Tax CCH ProSystem fx Accounting Audits of Employee... Compilation Of... Financial Statement... Government Auditing Tax Returns GAAP Tax ProSystem fx Tax CCH ProSystem fx Education California State University-Sacramento Bachelor of Business Administration (B.B.A.),  Accounting 2008  – 2011 Graduated Cum Laude Activities and Societies:  Beta Alpha Psi (Member) California State University-Sacramento Bachelor of Business Administration (B.B.A.),  Accounting 2008  – 2011 Graduated Cum Laude Activities and Societies:  Beta Alpha Psi (Member) California State University-Sacramento Bachelor of Business Administration (B.B.A.),  Accounting 2008  – 2011 Graduated Cum Laude Activities and Societies:  Beta Alpha Psi (Member) California State University-Sacramento Bachelor of Business Administration (B.B.A.),  Accounting 2008  – 2011 Graduated Cum Laude Activities and Societies:  Beta Alpha Psi (Member) ", "Experience Engineering Manager Intel EDA Supplier Manager Intel Corporation August 2011  – Present (4 years 1 month) Phoenix, Arizona Area Engineering Manager Intel Engineering Manager Intel EDA Supplier Manager Intel Corporation August 2011  – Present (4 years 1 month) Phoenix, Arizona Area EDA Supplier Manager Intel Corporation August 2011  – Present (4 years 1 month) Phoenix, Arizona Area Education Arizona State University MBA 1997  – 1999 Brigham Young University 1981  – 1988 Arizona State University MBA 1997  – 1999 Arizona State University MBA 1997  – 1999 Arizona State University MBA 1997  – 1999 Brigham Young University 1981  – 1988 Brigham Young University 1981  – 1988 Brigham Young University 1981  – 1988 ", "Summary Specialties:SAP (System Application & Products), BLS (Business Logistics Shipping), NMDB (Network Database), Wisard, Microsoft Access, Excel, Outlook, Word and PowerPoint Summary Specialties:SAP (System Application & Products), BLS (Business Logistics Shipping), NMDB (Network Database), Wisard, Microsoft Access, Excel, Outlook, Word and PowerPoint Specialties:SAP (System Application & Products), BLS (Business Logistics Shipping), NMDB (Network Database), Wisard, Microsoft Access, Excel, Outlook, Word and PowerPoint Specialties:SAP (System Application & Products), BLS (Business Logistics Shipping), NMDB (Network Database), Wisard, Microsoft Access, Excel, Outlook, Word and PowerPoint Experience Logistics Supplier Manager Intel Corporation July 2011  – Present (4 years 2 months) Chandler, Arizona •\tActing as a key contact for Arizona Capital moves between Capital Carriers, Site Capital Project Manager (SCPM), Buyers, Tool Owners and Dock Master. Communicate internally to Intel employees for any inquiries (such as: tracking Export/Import Capital shipments, customs issue related, post Good Receipts on Purchase Order) as well as communicate externally to Capital Carriers. \n•\tResponsible for issuing Logistics Incident Follow up Tool (LIFTs) for Capital Carriers to document and manage resolution of transportation related issues and determine the root cause of each incident so effective action plans can be implemented to prevent the incident from recurring. \n•\tResponsible for issuing Supplier Report Card (SRC) for Capital Carriers as a tool to communicate supplier’s overall performance for a given month. \n•\tResponsible in alleviating EEE’s and additional costs by working with the stakeholders to get a true picture of the incoming shipments to meet factory schedules. \n•\tA lead coordinator for weekly Dock Team Meetings for several Intel facilities (Fab32, CH4/ATTD, BBUL) to ensure that there is no issues meeting factory commits to all of the factories. \n•\tResponsible for providing & processing paperwork for Intel’s various activities, such as: Resale Tools, Harvest Tools, Reuse Tools and Domestic Daily Truck. Arizona Site Traffic Coordinator Intel Corporation February 2006  –  July 2011  (5 years 6 months) • Involved in SAP deployment project from A-pipe into F-pipe by piloting shipments with different carriers and testing different transactions that resulted in faster processing time, easier to navigate and more efficient than the A-pipe. \n• Provided training & SOP (Standard Operating Procedure) in SAP for team members.  \n• Created Arizona, Massachusetts & New Mexico Outbound/Inbound reports that included monitoring freight spends on a monthly basis. Responsible for analyzing each carrier’s freight spends and chargeable weight, identifying any “out of control” fluctuations, and researching further for explanations \n• Responsible for assigning the correct Carrier for all outbound international shipments & process shipment paperwork (Commercial Invoice, Packing List & Straight Bill of Ladings) for Finished Goods and Non Finished Good \n• File Shipper’s Export Declaration to US Customs as per Export/Import trade requirement about 30-40 in a weekly basis. \n• A main point of contact with Intel Arizona employees for traffic/transportation related questions. Communicate internally with Intel employees to receive responses to any inquiries (such as: tracking shipments, customs issue related) as well as externally to different carriers \n• Ensure that Intel remains compliant with US Customs regulations Outbound Documentation Customer Service Hanjin Shipping May 2003  –  February 2006  (2 years 10 months) • Checked master Bill of Ladings to ensure accuracy for outgoing shipments and ensured that Bill of Ladings are received from Shippers/Forwarders within stipulated time frame to avoid Customs penalty \n• Manifested and inputted ratings correctly according to each customer’s Service Contract after vessel sails, reconciled between manifest and load list to ensure details like the container & seal numbers on both documents match \n• Released Bill of Ladings, whether it is Original/Seaway/Telex Release, and distributed them in accordance with Shipper/Forwarder’s requirements \n• Answered a high volume of incoming calls and in-person inquiries from clients, treated each person with respect and providing information and referrals as needed Assistant Traffic Manager VOIGT MARITIME, INC. as agents for BERMUDA INTERNATIONAL SHIPPING LIMITED, NEW YORK, NY April 1998  –  February 2001  (2 years 11 months) • Responsible for maintaining and updating Company’s Web Site \n• Generated Ocean Shipping Manifest and Financial Recap weekly \n• Quoted and Negotiated Ocean, Inland and Intermodal rates \n• Completed all aspects of ocean export documentation and bookings  \n• Responsible for the determination of proper HTS classification for various types of merchandise \n• Performed ocean consolidations and organized FCL (Full Container Load) and LCL (Less than Container Load) movement, Filed tariffs with the FMC (Federal Maritime Commission) Key Account Coordinator Panalpina June 1997  –  December 1997  (7 months) • Tracked, monitored and expedited orders and shipments for company’s major account  \n• Coordinated workflow among Sea/Air Import/Export managers and directly supervised several support staff \n• Motivated and directed support staff in order to create a positive work environment and ensure accurate, on-time completion Administrative Assistant/Import Manager VOIGT MARITIME, INC. as agents for BERMUDA INTERNATIONAL SHIPPING LIMITED, NEW YORK, NY August 1994  –  November 1996  (2 years 4 months) • Created highly effective organizational and filing systems, including quick and thorough indexing, filing and offsite storage, resulting in easy access to critical information and streamlined office functioning \n• Monitor regulatory compliance changes affecting import requirements and ensure standards are met  \n• Maintain current knowledge of import regulations documentation and customs initiatives and liaise with internal management and customers advising of initiatives \n• Arranged inland transportation for virtually all types of outgoing domestic freight, Quickly promoted to Import Manager within 6 months Logistics Supplier Manager Intel Corporation July 2011  – Present (4 years 2 months) Chandler, Arizona •\tActing as a key contact for Arizona Capital moves between Capital Carriers, Site Capital Project Manager (SCPM), Buyers, Tool Owners and Dock Master. Communicate internally to Intel employees for any inquiries (such as: tracking Export/Import Capital shipments, customs issue related, post Good Receipts on Purchase Order) as well as communicate externally to Capital Carriers. \n•\tResponsible for issuing Logistics Incident Follow up Tool (LIFTs) for Capital Carriers to document and manage resolution of transportation related issues and determine the root cause of each incident so effective action plans can be implemented to prevent the incident from recurring. \n•\tResponsible for issuing Supplier Report Card (SRC) for Capital Carriers as a tool to communicate supplier’s overall performance for a given month. \n•\tResponsible in alleviating EEE’s and additional costs by working with the stakeholders to get a true picture of the incoming shipments to meet factory schedules. \n•\tA lead coordinator for weekly Dock Team Meetings for several Intel facilities (Fab32, CH4/ATTD, BBUL) to ensure that there is no issues meeting factory commits to all of the factories. \n•\tResponsible for providing & processing paperwork for Intel’s various activities, such as: Resale Tools, Harvest Tools, Reuse Tools and Domestic Daily Truck. Logistics Supplier Manager Intel Corporation July 2011  – Present (4 years 2 months) Chandler, Arizona •\tActing as a key contact for Arizona Capital moves between Capital Carriers, Site Capital Project Manager (SCPM), Buyers, Tool Owners and Dock Master. Communicate internally to Intel employees for any inquiries (such as: tracking Export/Import Capital shipments, customs issue related, post Good Receipts on Purchase Order) as well as communicate externally to Capital Carriers. \n•\tResponsible for issuing Logistics Incident Follow up Tool (LIFTs) for Capital Carriers to document and manage resolution of transportation related issues and determine the root cause of each incident so effective action plans can be implemented to prevent the incident from recurring. \n•\tResponsible for issuing Supplier Report Card (SRC) for Capital Carriers as a tool to communicate supplier’s overall performance for a given month. \n•\tResponsible in alleviating EEE’s and additional costs by working with the stakeholders to get a true picture of the incoming shipments to meet factory schedules. \n•\tA lead coordinator for weekly Dock Team Meetings for several Intel facilities (Fab32, CH4/ATTD, BBUL) to ensure that there is no issues meeting factory commits to all of the factories. \n•\tResponsible for providing & processing paperwork for Intel’s various activities, such as: Resale Tools, Harvest Tools, Reuse Tools and Domestic Daily Truck. Arizona Site Traffic Coordinator Intel Corporation February 2006  –  July 2011  (5 years 6 months) • Involved in SAP deployment project from A-pipe into F-pipe by piloting shipments with different carriers and testing different transactions that resulted in faster processing time, easier to navigate and more efficient than the A-pipe. \n• Provided training & SOP (Standard Operating Procedure) in SAP for team members.  \n• Created Arizona, Massachusetts & New Mexico Outbound/Inbound reports that included monitoring freight spends on a monthly basis. Responsible for analyzing each carrier’s freight spends and chargeable weight, identifying any “out of control” fluctuations, and researching further for explanations \n• Responsible for assigning the correct Carrier for all outbound international shipments & process shipment paperwork (Commercial Invoice, Packing List & Straight Bill of Ladings) for Finished Goods and Non Finished Good \n• File Shipper’s Export Declaration to US Customs as per Export/Import trade requirement about 30-40 in a weekly basis. \n• A main point of contact with Intel Arizona employees for traffic/transportation related questions. Communicate internally with Intel employees to receive responses to any inquiries (such as: tracking shipments, customs issue related) as well as externally to different carriers \n• Ensure that Intel remains compliant with US Customs regulations Arizona Site Traffic Coordinator Intel Corporation February 2006  –  July 2011  (5 years 6 months) • Involved in SAP deployment project from A-pipe into F-pipe by piloting shipments with different carriers and testing different transactions that resulted in faster processing time, easier to navigate and more efficient than the A-pipe. \n• Provided training & SOP (Standard Operating Procedure) in SAP for team members.  \n• Created Arizona, Massachusetts & New Mexico Outbound/Inbound reports that included monitoring freight spends on a monthly basis. Responsible for analyzing each carrier’s freight spends and chargeable weight, identifying any “out of control” fluctuations, and researching further for explanations \n• Responsible for assigning the correct Carrier for all outbound international shipments & process shipment paperwork (Commercial Invoice, Packing List & Straight Bill of Ladings) for Finished Goods and Non Finished Good \n• File Shipper’s Export Declaration to US Customs as per Export/Import trade requirement about 30-40 in a weekly basis. \n• A main point of contact with Intel Arizona employees for traffic/transportation related questions. Communicate internally with Intel employees to receive responses to any inquiries (such as: tracking shipments, customs issue related) as well as externally to different carriers \n• Ensure that Intel remains compliant with US Customs regulations Outbound Documentation Customer Service Hanjin Shipping May 2003  –  February 2006  (2 years 10 months) • Checked master Bill of Ladings to ensure accuracy for outgoing shipments and ensured that Bill of Ladings are received from Shippers/Forwarders within stipulated time frame to avoid Customs penalty \n• Manifested and inputted ratings correctly according to each customer’s Service Contract after vessel sails, reconciled between manifest and load list to ensure details like the container & seal numbers on both documents match \n• Released Bill of Ladings, whether it is Original/Seaway/Telex Release, and distributed them in accordance with Shipper/Forwarder’s requirements \n• Answered a high volume of incoming calls and in-person inquiries from clients, treated each person with respect and providing information and referrals as needed Outbound Documentation Customer Service Hanjin Shipping May 2003  –  February 2006  (2 years 10 months) • Checked master Bill of Ladings to ensure accuracy for outgoing shipments and ensured that Bill of Ladings are received from Shippers/Forwarders within stipulated time frame to avoid Customs penalty \n• Manifested and inputted ratings correctly according to each customer’s Service Contract after vessel sails, reconciled between manifest and load list to ensure details like the container & seal numbers on both documents match \n• Released Bill of Ladings, whether it is Original/Seaway/Telex Release, and distributed them in accordance with Shipper/Forwarder’s requirements \n• Answered a high volume of incoming calls and in-person inquiries from clients, treated each person with respect and providing information and referrals as needed Assistant Traffic Manager VOIGT MARITIME, INC. as agents for BERMUDA INTERNATIONAL SHIPPING LIMITED, NEW YORK, NY April 1998  –  February 2001  (2 years 11 months) • Responsible for maintaining and updating Company’s Web Site \n• Generated Ocean Shipping Manifest and Financial Recap weekly \n• Quoted and Negotiated Ocean, Inland and Intermodal rates \n• Completed all aspects of ocean export documentation and bookings  \n• Responsible for the determination of proper HTS classification for various types of merchandise \n• Performed ocean consolidations and organized FCL (Full Container Load) and LCL (Less than Container Load) movement, Filed tariffs with the FMC (Federal Maritime Commission) Assistant Traffic Manager VOIGT MARITIME, INC. as agents for BERMUDA INTERNATIONAL SHIPPING LIMITED, NEW YORK, NY April 1998  –  February 2001  (2 years 11 months) • Responsible for maintaining and updating Company’s Web Site \n• Generated Ocean Shipping Manifest and Financial Recap weekly \n• Quoted and Negotiated Ocean, Inland and Intermodal rates \n• Completed all aspects of ocean export documentation and bookings  \n• Responsible for the determination of proper HTS classification for various types of merchandise \n• Performed ocean consolidations and organized FCL (Full Container Load) and LCL (Less than Container Load) movement, Filed tariffs with the FMC (Federal Maritime Commission) Key Account Coordinator Panalpina June 1997  –  December 1997  (7 months) • Tracked, monitored and expedited orders and shipments for company’s major account  \n• Coordinated workflow among Sea/Air Import/Export managers and directly supervised several support staff \n• Motivated and directed support staff in order to create a positive work environment and ensure accurate, on-time completion Key Account Coordinator Panalpina June 1997  –  December 1997  (7 months) • Tracked, monitored and expedited orders and shipments for company’s major account  \n• Coordinated workflow among Sea/Air Import/Export managers and directly supervised several support staff \n• Motivated and directed support staff in order to create a positive work environment and ensure accurate, on-time completion Administrative Assistant/Import Manager VOIGT MARITIME, INC. as agents for BERMUDA INTERNATIONAL SHIPPING LIMITED, NEW YORK, NY August 1994  –  November 1996  (2 years 4 months) • Created highly effective organizational and filing systems, including quick and thorough indexing, filing and offsite storage, resulting in easy access to critical information and streamlined office functioning \n• Monitor regulatory compliance changes affecting import requirements and ensure standards are met  \n• Maintain current knowledge of import regulations documentation and customs initiatives and liaise with internal management and customers advising of initiatives \n• Arranged inland transportation for virtually all types of outgoing domestic freight, Quickly promoted to Import Manager within 6 months Administrative Assistant/Import Manager VOIGT MARITIME, INC. as agents for BERMUDA INTERNATIONAL SHIPPING LIMITED, NEW YORK, NY August 1994  –  November 1996  (2 years 4 months) • Created highly effective organizational and filing systems, including quick and thorough indexing, filing and offsite storage, resulting in easy access to critical information and streamlined office functioning \n• Monitor regulatory compliance changes affecting import requirements and ensure standards are met  \n• Maintain current knowledge of import regulations documentation and customs initiatives and liaise with internal management and customers advising of initiatives \n• Arranged inland transportation for virtually all types of outgoing domestic freight, Quickly promoted to Import Manager within 6 months Languages Indonesian Indonesian Indonesian Skills Outlook Microsoft Excel Supply Chain Logistics Customs Regulations Transportation Access Management Freight Process Improvement International Trade Logistics Management Skills  Outlook Microsoft Excel Supply Chain Logistics Customs Regulations Transportation Access Management Freight Process Improvement International Trade Logistics Management Outlook Microsoft Excel Supply Chain Logistics Customs Regulations Transportation Access Management Freight Process Improvement International Trade Logistics Management Outlook Microsoft Excel Supply Chain Logistics Customs Regulations Transportation Access Management Freight Process Improvement International Trade Logistics Management Education DeVry Institute of Technology Bachelor of Science,  Information Technology 2001  – 2002 Graduated: GPA 3.34 \nHonors: Dean’s List CITY UNIVERSITY OF NEW YORK-YORK COLLEGE Bachelor of Science,  Business Administration 1989  – 1993 Graduated - Magna Cum Laude (GPA 3.54)  \nHonors: Dean’s Lists Activities and Societies:  Delta Mu Delta DeVry Institute of Technology Bachelor of Science,  Information Technology 2001  – 2002 Graduated: GPA 3.34 \nHonors: Dean’s List DeVry Institute of Technology Bachelor of Science,  Information Technology 2001  – 2002 Graduated: GPA 3.34 \nHonors: Dean’s List DeVry Institute of Technology Bachelor of Science,  Information Technology 2001  – 2002 Graduated: GPA 3.34 \nHonors: Dean’s List CITY UNIVERSITY OF NEW YORK-YORK COLLEGE Bachelor of Science,  Business Administration 1989  – 1993 Graduated - Magna Cum Laude (GPA 3.54)  \nHonors: Dean’s Lists Activities and Societies:  Delta Mu Delta CITY UNIVERSITY OF NEW YORK-YORK COLLEGE Bachelor of Science,  Business Administration 1989  – 1993 Graduated - Magna Cum Laude (GPA 3.54)  \nHonors: Dean’s Lists Activities and Societies:  Delta Mu Delta CITY UNIVERSITY OF NEW YORK-YORK COLLEGE Bachelor of Science,  Business Administration 1989  – 1993 Graduated - Magna Cum Laude (GPA 3.54)  \nHonors: Dean’s Lists Activities and Societies:  Delta Mu Delta ", "Experience Payroll Supplier Manager Intel Corporation November 1998  – Present (16 years 10 months) Swindon I work in the Global Payroll Program Office, based in Swindon managing our biggest payroll supplier in the GER region. Customer Services Thames Water January 1995  –  November 1998  (3 years 11 months) Office Admin Bower & Bailey January 1994  –  January 1995  (1 year 1 month) Payroll Supplier Manager Intel Corporation November 1998  – Present (16 years 10 months) Swindon I work in the Global Payroll Program Office, based in Swindon managing our biggest payroll supplier in the GER region. Payroll Supplier Manager Intel Corporation November 1998  – Present (16 years 10 months) Swindon I work in the Global Payroll Program Office, based in Swindon managing our biggest payroll supplier in the GER region. Customer Services Thames Water January 1995  –  November 1998  (3 years 11 months) Customer Services Thames Water January 1995  –  November 1998  (3 years 11 months) Office Admin Bower & Bailey January 1994  –  January 1995  (1 year 1 month) Office Admin Bower & Bailey January 1994  –  January 1995  (1 year 1 month) Skills Intel Skills  Intel Intel Intel Education Ridgeway 1989  – 1995 Ridgeway 1989  – 1995 Ridgeway 1989  – 1995 Ridgeway 1989  – 1995 ", "Experience IT Strategic Sourcing Manager Intel Corporation 2005  – Present (10 years) Operations Maxtek 1997  –  2005  (8 years) Purchasing \nPlanning \nManufacturing Manager \nMaster Scheduler IT Strategic Sourcing Manager Intel Corporation 2005  – Present (10 years) IT Strategic Sourcing Manager Intel Corporation 2005  – Present (10 years) Operations Maxtek 1997  –  2005  (8 years) Purchasing \nPlanning \nManufacturing Manager \nMaster Scheduler Operations Maxtek 1997  –  2005  (8 years) Purchasing \nPlanning \nManufacturing Manager \nMaster Scheduler Skills Strategic Sourcing Supply Management Supply Chain Management Skills  Strategic Sourcing Supply Management Supply Chain Management Strategic Sourcing Supply Management Supply Chain Management Strategic Sourcing Supply Management Supply Chain Management Education University of Portland MBA 2000  – 2003 University of Oregon - Charles H. Lundquist College of Business BS,  Finance ,  Economics 1995  – 1997 University of Portland MBA 2000  – 2003 University of Portland MBA 2000  – 2003 University of Portland MBA 2000  – 2003 University of Oregon - Charles H. Lundquist College of Business BS,  Finance ,  Economics 1995  – 1997 University of Oregon - Charles H. Lundquist College of Business BS,  Finance ,  Economics 1995  – 1997 University of Oregon - Charles H. Lundquist College of Business BS,  Finance ,  Economics 1995  – 1997 ", "Summary 1. Touch panel technology and market analysis \n2. Strong and solid background in device and solid state physics \n3. Familiar with many measurement instruments and transient techniques \n4. Extended experiences in reliability and analysis of TFT device  \n5. Several years of Novel TFT device & Display design experiences \n6. Deep knowledge in server related technologies (Windows, Linux, UNIX) \n7. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash Specialties:1. Consumer electronic product market analysis \n2. The reliability and characteristics of TFT device and solid sate physics \n3. semiconductor parameter measurement instruments \n4. Linux server related technologies (mail server, etc.) \n5. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash Summary 1. Touch panel technology and market analysis \n2. Strong and solid background in device and solid state physics \n3. Familiar with many measurement instruments and transient techniques \n4. Extended experiences in reliability and analysis of TFT device  \n5. Several years of Novel TFT device & Display design experiences \n6. Deep knowledge in server related technologies (Windows, Linux, UNIX) \n7. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash Specialties:1. Consumer electronic product market analysis \n2. The reliability and characteristics of TFT device and solid sate physics \n3. semiconductor parameter measurement instruments \n4. Linux server related technologies (mail server, etc.) \n5. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash 1. Touch panel technology and market analysis \n2. Strong and solid background in device and solid state physics \n3. Familiar with many measurement instruments and transient techniques \n4. Extended experiences in reliability and analysis of TFT device  \n5. Several years of Novel TFT device & Display design experiences \n6. Deep knowledge in server related technologies (Windows, Linux, UNIX) \n7. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash Specialties:1. Consumer electronic product market analysis \n2. The reliability and characteristics of TFT device and solid sate physics \n3. semiconductor parameter measurement instruments \n4. Linux server related technologies (mail server, etc.) \n5. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash 1. Touch panel technology and market analysis \n2. Strong and solid background in device and solid state physics \n3. Familiar with many measurement instruments and transient techniques \n4. Extended experiences in reliability and analysis of TFT device  \n5. Several years of Novel TFT device & Display design experiences \n6. Deep knowledge in server related technologies (Windows, Linux, UNIX) \n7. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash Specialties:1. Consumer electronic product market analysis \n2. The reliability and characteristics of TFT device and solid sate physics \n3. semiconductor parameter measurement instruments \n4. Linux server related technologies (mail server, etc.) \n5. Advanced programming & scripting language: e.g., Macromedia, JAVA, PHP, C, Flash Experience Supplier Manager Intel Corporation December 2011  – Present (3 years 9 months) Taipei 3rd Party Enabling \nClient Application Engineering, PCCG Department manager AUO October 2010  –  December 2011  (1 year 3 months) Touch Solution Product Strategy Planning Dept.  \nProduct Marketing Div. Chief Engineer HTC August 2009  –  January 2010  (6 months) Optical chief engineer Senior Engineer AUO August 2004  –  September 2008  (4 years 2 months) Platform RD for Array tech. \n1. Novel structure TFT \n2. Novel measurement tech. \n3. Electronics engineering Senior Engineer AUO April 2001  –  September 2002  (1 year 6 months) LCD array integration Supplier Manager Intel Corporation December 2011  – Present (3 years 9 months) Taipei 3rd Party Enabling \nClient Application Engineering, PCCG Supplier Manager Intel Corporation December 2011  – Present (3 years 9 months) Taipei 3rd Party Enabling \nClient Application Engineering, PCCG Department manager AUO October 2010  –  December 2011  (1 year 3 months) Touch Solution Product Strategy Planning Dept.  \nProduct Marketing Div. Department manager AUO October 2010  –  December 2011  (1 year 3 months) Touch Solution Product Strategy Planning Dept.  \nProduct Marketing Div. Chief Engineer HTC August 2009  –  January 2010  (6 months) Optical chief engineer Chief Engineer HTC August 2009  –  January 2010  (6 months) Optical chief engineer Senior Engineer AUO August 2004  –  September 2008  (4 years 2 months) Platform RD for Array tech. \n1. Novel structure TFT \n2. Novel measurement tech. \n3. Electronics engineering Senior Engineer AUO August 2004  –  September 2008  (4 years 2 months) Platform RD for Array tech. \n1. Novel structure TFT \n2. Novel measurement tech. \n3. Electronics engineering Senior Engineer AUO April 2001  –  September 2002  (1 year 6 months) LCD array integration Senior Engineer AUO April 2001  –  September 2002  (1 year 6 months) LCD array integration Skills PHP Flash Macromedia Semiconductors Device Physics Skills  PHP Flash Macromedia Semiconductors Device Physics PHP Flash Macromedia Semiconductors Device Physics PHP Flash Macromedia Semiconductors Device Physics Education National Tsing Hua University PhD,  Electronics Engineering 2003  – 2009 National Central University Master,  Optics and photonics 1996  – 1999 National Chung Cheng University B. S.,  Physics 1992  – 1996 National Tsing Hua University PhD,  Electronics Engineering 2003  – 2009 National Tsing Hua University PhD,  Electronics Engineering 2003  – 2009 National Tsing Hua University PhD,  Electronics Engineering 2003  – 2009 National Central University Master,  Optics and photonics 1996  – 1999 National Central University Master,  Optics and photonics 1996  – 1999 National Central University Master,  Optics and photonics 1996  – 1999 National Chung Cheng University B. S.,  Physics 1992  – 1996 National Chung Cheng University B. S.,  Physics 1992  – 1996 National Chung Cheng University B. S.,  Physics 1992  – 1996 ", "Experience 3PL Supplier Manager Intel Corporation 3PL Supplier Manager Intel Corporation 3PL Supplier Manager Intel Corporation Skills Semiconductor Industry Semiconductors Supply Management Skills  Semiconductor Industry Semiconductors Supply Management Semiconductor Industry Semiconductors Supply Management Semiconductor Industry Semiconductors Supply Management ", "Summary Self-starting leader with 10+ years of industry experience and with 6+ years of experience in semiconductor supply chain management. Expert in contract negotiation, supplier/stakeholders management and sourcing, business development, strategic planning, cost cutting initiatives and cross-functional leadership Summary Self-starting leader with 10+ years of industry experience and with 6+ years of experience in semiconductor supply chain management. Expert in contract negotiation, supplier/stakeholders management and sourcing, business development, strategic planning, cost cutting initiatives and cross-functional leadership Self-starting leader with 10+ years of industry experience and with 6+ years of experience in semiconductor supply chain management. Expert in contract negotiation, supplier/stakeholders management and sourcing, business development, strategic planning, cost cutting initiatives and cross-functional leadership Self-starting leader with 10+ years of industry experience and with 6+ years of experience in semiconductor supply chain management. Expert in contract negotiation, supplier/stakeholders management and sourcing, business development, strategic planning, cost cutting initiatives and cross-functional leadership Experience Supplier Manager Intel Corporation August 2014  – Present (1 year 1 month) Chandler, AZ •\tSupplier performance management: Responsible for managing largest semiconductor packaging equipment supplier with $20M yearly spends. Led a matrix managed team to focus on cost, quality, availability, technology and sustainability \n•\tCost reduction: Led a team to explore opportunities for cost reduction by outsourcing critical sub components and achieved 68% cost reduction and 50% lead time reduction while maintaining quality \n•\tStrategic planning: Identified key technology areas and influence supplier senior management to focus on collaboration activities to make supplier and Intel market leaders \n•\tSupplier development: Drive new/existing vendors to achieve Preferred Quality Supplier segmentation by performing to key metrics of excursion management, technology roadmap, cost reduction roadmap, leadtime and sustainability. This led to supplier moving to Certification status in 1 year timeframe \n Program Manager Intel Corporation June 2012  –  July 2014  (2 years 2 months) Chandler, AZ •\tSourcing manager: Chaired a sourcing project and did an extensive industry benchmarking to identify and downselect key members of the ecosystem. Analyzed Total Cost of Ownership for next gen process development \n•\tQuality/Operations manager: Influenced supplier and Intel senior management to collaborate in industry leading Ball Attach equipment development which lead to improved manufacturability, yield improvement to 99.98%, cycle time improvement by 15% and reduced product cost. \n•\tRisk management leader: Led several task forces related to supply chain to ensure Intel meets product release timelines  \n Supply Chain Engineer Intel Corporation November 2010  –  May 2012  (1 year 7 months) Chandler, AZ •\tAffordability lead: Delivered a healthy, affordable supply chain to deliver group’s technology roadmap in areas such as Inspection metrology and Ball Attach technology for Second and First Level interconnect process. Anticipated and timely addressed R&D needs while supporting existing supply chain \n•\tDemand management and Ramp readiness: Successfully enabled supply chain readiness for new product/process development and ramp. Worked with Quality, Operations, Technology Development (TD)/High Volume factory Engineering and Supplier to drive closure to factory related issues and excursions \n•\tVelocity lead: Identified and influenced supplier in a project to accelerate business velocity to meet volatile business requirements and demand/supply needs. Developed Key Performance Indicator’s, scorecards, time dependency models and metrics to measure the success of each deliverable. \n•\tSix sigma: Team leader in a Green Belt project- used lean six sigma methodologies to optimize process flow by parts standardization.  \n \n Senior Process Development engineer Intel Corporation March 2009  –  November 2010  (1 year 9 months) Chandler, AZ •\tProduct development lead: Delivered risk assessments, empirical evaluations and certified a robust/reliable process with a high yield/throughput for high volume manufacturing. Technical lead in cross-functional task force group to drive yield attack, identifying and mitigating potential risks to product ramp geared to the certification of next generation technology. Utilized tools such as 7-step structured problem solving, Failure Modes Effects Analysis (FMEA) and conducting design of experiments (DOE) to address quality excursions.  \n•\tChange control champion: Championed Copy Exactly Audit and White Paper change control to ensure successful development and transfer of technology to HVM. \n•\tNew supplier evaluation and selection: Led a cross functional team to drive new equipment selection for Next Gen platforms. Conducted deep dive through industry scan, assessed, analyzed and consolidated data from potential suppliers and communicated decision clearly and succinctly to management \n Research Assistant North Carolina State University January 2006  –  February 2009  (3 years 2 months) Raleigh-Durham, North Carolina Area •\tDeveloped surface modified polypropylene to improve adhesion to Elastomeric polymers \n•\tAttached polymer brushes to acrylate modified PP to improve surface properties  \n•\tRheological, mechanical, and physical characterization of polymers and polymer blends \n•\tMolecular modeling to substantiate experimental results \n•\tDesigned and developed surface modified and high throughput spunbond nonwoven Intern, Process Development Group Intel Corporation May 2008  –  August 2008  (4 months) Chandler, AZ •\tCollaborated with research team to optimize material selection for next generation thermal solution for server packages \n•\tWorked extensively with thermal and mechanical core competency experts to reduce thermal resistance of semiconductor packages \n Quality Engineer Morarji Textiles June 2004  –  November 2005  (1 year 6 months) India •\tDeveloped tests for Yarn Package dyeing quality  \n•\tDeveloped protocol for the fabric quality reliability and reproducibility \n•\tStreamlined the ‘weaving to finishing’ stages in fabric production \n•\tWorked in tandem with Marketing department to troubleshoot customer complaints Intern, Quality Assurance Clariant May 2003  –  July 2003  (3 months) India •\tPerformed stringent Quality checks on textile chemicals and auxiliaries \n•\tPerformed GPC, HPLC and TLC on in-house chemicals for export \n•\tFormulated new products as per the needs of the customers Supplier Manager Intel Corporation August 2014  – Present (1 year 1 month) Chandler, AZ •\tSupplier performance management: Responsible for managing largest semiconductor packaging equipment supplier with $20M yearly spends. Led a matrix managed team to focus on cost, quality, availability, technology and sustainability \n•\tCost reduction: Led a team to explore opportunities for cost reduction by outsourcing critical sub components and achieved 68% cost reduction and 50% lead time reduction while maintaining quality \n•\tStrategic planning: Identified key technology areas and influence supplier senior management to focus on collaboration activities to make supplier and Intel market leaders \n•\tSupplier development: Drive new/existing vendors to achieve Preferred Quality Supplier segmentation by performing to key metrics of excursion management, technology roadmap, cost reduction roadmap, leadtime and sustainability. This led to supplier moving to Certification status in 1 year timeframe \n Supplier Manager Intel Corporation August 2014  – Present (1 year 1 month) Chandler, AZ •\tSupplier performance management: Responsible for managing largest semiconductor packaging equipment supplier with $20M yearly spends. Led a matrix managed team to focus on cost, quality, availability, technology and sustainability \n•\tCost reduction: Led a team to explore opportunities for cost reduction by outsourcing critical sub components and achieved 68% cost reduction and 50% lead time reduction while maintaining quality \n•\tStrategic planning: Identified key technology areas and influence supplier senior management to focus on collaboration activities to make supplier and Intel market leaders \n•\tSupplier development: Drive new/existing vendors to achieve Preferred Quality Supplier segmentation by performing to key metrics of excursion management, technology roadmap, cost reduction roadmap, leadtime and sustainability. This led to supplier moving to Certification status in 1 year timeframe \n Program Manager Intel Corporation June 2012  –  July 2014  (2 years 2 months) Chandler, AZ •\tSourcing manager: Chaired a sourcing project and did an extensive industry benchmarking to identify and downselect key members of the ecosystem. Analyzed Total Cost of Ownership for next gen process development \n•\tQuality/Operations manager: Influenced supplier and Intel senior management to collaborate in industry leading Ball Attach equipment development which lead to improved manufacturability, yield improvement to 99.98%, cycle time improvement by 15% and reduced product cost. \n•\tRisk management leader: Led several task forces related to supply chain to ensure Intel meets product release timelines  \n Program Manager Intel Corporation June 2012  –  July 2014  (2 years 2 months) Chandler, AZ •\tSourcing manager: Chaired a sourcing project and did an extensive industry benchmarking to identify and downselect key members of the ecosystem. Analyzed Total Cost of Ownership for next gen process development \n•\tQuality/Operations manager: Influenced supplier and Intel senior management to collaborate in industry leading Ball Attach equipment development which lead to improved manufacturability, yield improvement to 99.98%, cycle time improvement by 15% and reduced product cost. \n•\tRisk management leader: Led several task forces related to supply chain to ensure Intel meets product release timelines  \n Supply Chain Engineer Intel Corporation November 2010  –  May 2012  (1 year 7 months) Chandler, AZ •\tAffordability lead: Delivered a healthy, affordable supply chain to deliver group’s technology roadmap in areas such as Inspection metrology and Ball Attach technology for Second and First Level interconnect process. Anticipated and timely addressed R&D needs while supporting existing supply chain \n•\tDemand management and Ramp readiness: Successfully enabled supply chain readiness for new product/process development and ramp. Worked with Quality, Operations, Technology Development (TD)/High Volume factory Engineering and Supplier to drive closure to factory related issues and excursions \n•\tVelocity lead: Identified and influenced supplier in a project to accelerate business velocity to meet volatile business requirements and demand/supply needs. Developed Key Performance Indicator’s, scorecards, time dependency models and metrics to measure the success of each deliverable. \n•\tSix sigma: Team leader in a Green Belt project- used lean six sigma methodologies to optimize process flow by parts standardization.  \n \n Supply Chain Engineer Intel Corporation November 2010  –  May 2012  (1 year 7 months) Chandler, AZ •\tAffordability lead: Delivered a healthy, affordable supply chain to deliver group’s technology roadmap in areas such as Inspection metrology and Ball Attach technology for Second and First Level interconnect process. Anticipated and timely addressed R&D needs while supporting existing supply chain \n•\tDemand management and Ramp readiness: Successfully enabled supply chain readiness for new product/process development and ramp. Worked with Quality, Operations, Technology Development (TD)/High Volume factory Engineering and Supplier to drive closure to factory related issues and excursions \n•\tVelocity lead: Identified and influenced supplier in a project to accelerate business velocity to meet volatile business requirements and demand/supply needs. Developed Key Performance Indicator’s, scorecards, time dependency models and metrics to measure the success of each deliverable. \n•\tSix sigma: Team leader in a Green Belt project- used lean six sigma methodologies to optimize process flow by parts standardization.  \n \n Senior Process Development engineer Intel Corporation March 2009  –  November 2010  (1 year 9 months) Chandler, AZ •\tProduct development lead: Delivered risk assessments, empirical evaluations and certified a robust/reliable process with a high yield/throughput for high volume manufacturing. Technical lead in cross-functional task force group to drive yield attack, identifying and mitigating potential risks to product ramp geared to the certification of next generation technology. Utilized tools such as 7-step structured problem solving, Failure Modes Effects Analysis (FMEA) and conducting design of experiments (DOE) to address quality excursions.  \n•\tChange control champion: Championed Copy Exactly Audit and White Paper change control to ensure successful development and transfer of technology to HVM. \n•\tNew supplier evaluation and selection: Led a cross functional team to drive new equipment selection for Next Gen platforms. Conducted deep dive through industry scan, assessed, analyzed and consolidated data from potential suppliers and communicated decision clearly and succinctly to management \n Senior Process Development engineer Intel Corporation March 2009  –  November 2010  (1 year 9 months) Chandler, AZ •\tProduct development lead: Delivered risk assessments, empirical evaluations and certified a robust/reliable process with a high yield/throughput for high volume manufacturing. Technical lead in cross-functional task force group to drive yield attack, identifying and mitigating potential risks to product ramp geared to the certification of next generation technology. Utilized tools such as 7-step structured problem solving, Failure Modes Effects Analysis (FMEA) and conducting design of experiments (DOE) to address quality excursions.  \n•\tChange control champion: Championed Copy Exactly Audit and White Paper change control to ensure successful development and transfer of technology to HVM. \n•\tNew supplier evaluation and selection: Led a cross functional team to drive new equipment selection for Next Gen platforms. Conducted deep dive through industry scan, assessed, analyzed and consolidated data from potential suppliers and communicated decision clearly and succinctly to management \n Research Assistant North Carolina State University January 2006  –  February 2009  (3 years 2 months) Raleigh-Durham, North Carolina Area •\tDeveloped surface modified polypropylene to improve adhesion to Elastomeric polymers \n•\tAttached polymer brushes to acrylate modified PP to improve surface properties  \n•\tRheological, mechanical, and physical characterization of polymers and polymer blends \n•\tMolecular modeling to substantiate experimental results \n•\tDesigned and developed surface modified and high throughput spunbond nonwoven Research Assistant North Carolina State University January 2006  –  February 2009  (3 years 2 months) Raleigh-Durham, North Carolina Area •\tDeveloped surface modified polypropylene to improve adhesion to Elastomeric polymers \n•\tAttached polymer brushes to acrylate modified PP to improve surface properties  \n•\tRheological, mechanical, and physical characterization of polymers and polymer blends \n•\tMolecular modeling to substantiate experimental results \n•\tDesigned and developed surface modified and high throughput spunbond nonwoven Intern, Process Development Group Intel Corporation May 2008  –  August 2008  (4 months) Chandler, AZ •\tCollaborated with research team to optimize material selection for next generation thermal solution for server packages \n•\tWorked extensively with thermal and mechanical core competency experts to reduce thermal resistance of semiconductor packages \n Intern, Process Development Group Intel Corporation May 2008  –  August 2008  (4 months) Chandler, AZ •\tCollaborated with research team to optimize material selection for next generation thermal solution for server packages \n•\tWorked extensively with thermal and mechanical core competency experts to reduce thermal resistance of semiconductor packages \n Quality Engineer Morarji Textiles June 2004  –  November 2005  (1 year 6 months) India •\tDeveloped tests for Yarn Package dyeing quality  \n•\tDeveloped protocol for the fabric quality reliability and reproducibility \n•\tStreamlined the ‘weaving to finishing’ stages in fabric production \n•\tWorked in tandem with Marketing department to troubleshoot customer complaints Quality Engineer Morarji Textiles June 2004  –  November 2005  (1 year 6 months) India •\tDeveloped tests for Yarn Package dyeing quality  \n•\tDeveloped protocol for the fabric quality reliability and reproducibility \n•\tStreamlined the ‘weaving to finishing’ stages in fabric production \n•\tWorked in tandem with Marketing department to troubleshoot customer complaints Intern, Quality Assurance Clariant May 2003  –  July 2003  (3 months) India •\tPerformed stringent Quality checks on textile chemicals and auxiliaries \n•\tPerformed GPC, HPLC and TLC on in-house chemicals for export \n•\tFormulated new products as per the needs of the customers Intern, Quality Assurance Clariant May 2003  –  July 2003  (3 months) India •\tPerformed stringent Quality checks on textile chemicals and auxiliaries \n•\tPerformed GPC, HPLC and TLC on in-house chemicals for export \n•\tFormulated new products as per the needs of the customers Languages Hindi, Bengali, Marathi Hindi, Bengali, Marathi Hindi, Bengali, Marathi Skills Semiconductor... Semiconductor Equipment Packaging Engineering Innovator Problem solver Process Development Polymer Science Nonwovens Supply Chain Operations High Volume Production Thermal Interface... FMEA Process Simulation SPC Materials Science Semiconductors Design of Experiments Thermal See 4+     See less Skills  Semiconductor... Semiconductor Equipment Packaging Engineering Innovator Problem solver Process Development Polymer Science Nonwovens Supply Chain Operations High Volume Production Thermal Interface... FMEA Process Simulation SPC Materials Science Semiconductors Design of Experiments Thermal See 4+     See less Semiconductor... Semiconductor Equipment Packaging Engineering Innovator Problem solver Process Development Polymer Science Nonwovens Supply Chain Operations High Volume Production Thermal Interface... FMEA Process Simulation SPC Materials Science Semiconductors Design of Experiments Thermal See 4+     See less Semiconductor... Semiconductor Equipment Packaging Engineering Innovator Problem solver Process Development Polymer Science Nonwovens Supply Chain Operations High Volume Production Thermal Interface... FMEA Process Simulation SPC Materials Science Semiconductors Design of Experiments Thermal See 4+     See less Education North Carolina State University PhD,  Fiber and Polymer Science 2006  – 2009 PhD in Material Science North Carolina State University PhD,  Fiber and Polymer Science 2006  – 2009 PhD in Material Science North Carolina State University PhD,  Fiber and Polymer Science 2006  – 2009 PhD in Material Science North Carolina State University PhD,  Fiber and Polymer Science 2006  – 2009 PhD in Material Science ", "Experience Supplier Manager Intel Corporation June 2005  – Present (10 years 3 months) Commodity Specialist Intel Corporation September 2000  –  June 2005  (4 years 10 months) Supplier Manager Intel Corporation June 2005  – Present (10 years 3 months) Supplier Manager Intel Corporation June 2005  – Present (10 years 3 months) Commodity Specialist Intel Corporation September 2000  –  June 2005  (4 years 10 months) Commodity Specialist Intel Corporation September 2000  –  June 2005  (4 years 10 months) Education George Fox University MBA,  Leadership 2003  – 2005 Portland State University 1995  – 1998 George Fox University MBA,  Leadership 2003  – 2005 George Fox University MBA,  Leadership 2003  – 2005 George Fox University MBA,  Leadership 2003  – 2005 Portland State University 1995  – 1998 Portland State University 1995  – 1998 Portland State University 1995  – 1998 ", "Experience Supplier Manager Intel Corporation Supplier Manager Intel Corporation Supplier Manager Intel Corporation "]}