{"position": "Supply Chain Analyst", "company": "Intel Corporation", "profiles": ["Experience Supply Chain Analyst Intel Corporation February 2015  – Present (7 months) Factory Operations Manager - Technology Development Intel April 2009  – Present (6 years 5 months) Factory Operations Manager Intel November 2007  –  April 2009  (1 year 6 months) Responsible for overall safety performance of the shift module team by follow-up on all safety items, leading safety teams, and acting as a safety resource to the Factory.  \nEmergency Response Team (ERT) Leader and coach, responsible for developing and training ERT teams and leading ERT response.  \nFirst point of contact for daily module related issues.  \nResponsible for the daily execution of factory strategies for modul. \nResponsible for meeting factory output goals and the reallocation of factory resources needed.  \nDrive Lean Manufacturing culture with technician teams, coaching for rapid improvements, standardization in area. \nOwn, develop and coach shift technician team.  \nDirectly responsible for administrative management of assigned technicians.  \nExecute technician yearly review process, including writing and delivery of performance reviews. \nPerform interviewing and New Hire assimilation as needed. Training Developer/Specialist Intel Corporation February 2004  –  November 2007  (3 years 10 months) Manufacturing Technician Intel January 2000  –  January 2004  (4 years 1 month) Electronics Technician - Nuclear Reactor Operator US Navy October 1993  –  October 1999  (6 years 1 month) Supply Chain Analyst Intel Corporation February 2015  – Present (7 months) Supply Chain Analyst Intel Corporation February 2015  – Present (7 months) Factory Operations Manager - Technology Development Intel April 2009  – Present (6 years 5 months) Factory Operations Manager - Technology Development Intel April 2009  – Present (6 years 5 months) Factory Operations Manager Intel November 2007  –  April 2009  (1 year 6 months) Responsible for overall safety performance of the shift module team by follow-up on all safety items, leading safety teams, and acting as a safety resource to the Factory.  \nEmergency Response Team (ERT) Leader and coach, responsible for developing and training ERT teams and leading ERT response.  \nFirst point of contact for daily module related issues.  \nResponsible for the daily execution of factory strategies for modul. \nResponsible for meeting factory output goals and the reallocation of factory resources needed.  \nDrive Lean Manufacturing culture with technician teams, coaching for rapid improvements, standardization in area. \nOwn, develop and coach shift technician team.  \nDirectly responsible for administrative management of assigned technicians.  \nExecute technician yearly review process, including writing and delivery of performance reviews. \nPerform interviewing and New Hire assimilation as needed. Factory Operations Manager Intel November 2007  –  April 2009  (1 year 6 months) Responsible for overall safety performance of the shift module team by follow-up on all safety items, leading safety teams, and acting as a safety resource to the Factory.  \nEmergency Response Team (ERT) Leader and coach, responsible for developing and training ERT teams and leading ERT response.  \nFirst point of contact for daily module related issues.  \nResponsible for the daily execution of factory strategies for modul. \nResponsible for meeting factory output goals and the reallocation of factory resources needed.  \nDrive Lean Manufacturing culture with technician teams, coaching for rapid improvements, standardization in area. \nOwn, develop and coach shift technician team.  \nDirectly responsible for administrative management of assigned technicians.  \nExecute technician yearly review process, including writing and delivery of performance reviews. \nPerform interviewing and New Hire assimilation as needed. Training Developer/Specialist Intel Corporation February 2004  –  November 2007  (3 years 10 months) Training Developer/Specialist Intel Corporation February 2004  –  November 2007  (3 years 10 months) Manufacturing Technician Intel January 2000  –  January 2004  (4 years 1 month) Manufacturing Technician Intel January 2000  –  January 2004  (4 years 1 month) Electronics Technician - Nuclear Reactor Operator US Navy October 1993  –  October 1999  (6 years 1 month) Electronics Technician - Nuclear Reactor Operator US Navy October 1993  –  October 1999  (6 years 1 month) Skills Intel Lean Manufacturing Coaching Mentoring Semiconductor... Constraint Management Manufacturing Semiconductors Operations Management Leadership Management Semiconductor Industry SPC Program Management Process Improvement Forecasting JMP Project Planning Cross-functional Team... Continuous Improvement Engineering Management Project Management Six Sigma Training Team Leadership Troubleshooting Process Engineering See 12+     See less Skills  Intel Lean Manufacturing Coaching Mentoring Semiconductor... Constraint Management Manufacturing Semiconductors Operations Management Leadership Management Semiconductor Industry SPC Program Management Process Improvement Forecasting JMP Project Planning Cross-functional Team... Continuous Improvement Engineering Management Project Management Six Sigma Training Team Leadership Troubleshooting Process Engineering See 12+     See less Intel Lean Manufacturing Coaching Mentoring Semiconductor... Constraint Management Manufacturing Semiconductors Operations Management Leadership Management Semiconductor Industry SPC Program Management Process Improvement Forecasting JMP Project Planning Cross-functional Team... Continuous Improvement Engineering Management Project Management Six Sigma Training Team Leadership Troubleshooting Process Engineering See 12+     See less Intel Lean Manufacturing Coaching Mentoring Semiconductor... Constraint Management Manufacturing Semiconductors Operations Management Leadership Management Semiconductor Industry SPC Program Management Process Improvement Forecasting JMP Project Planning Cross-functional Team... Continuous Improvement Engineering Management Project Management Six Sigma Training Team Leadership Troubleshooting Process Engineering See 12+     See less Education American InterContinental University Bachelor of Arts,  Business Administration 2002  – 2004 Naval Nuclear Power School Nuclear Power Operation 1993  – 1995 Electronics Technician A-School - Orlando, FL - 1993 \nNaval Nuclear Power School - Orlando, FL - 1994 \nNaval Nuclear Prototype - Charleston, SC - 1995 The University of Texas at El Paso 1992  – 1993 Texas Tech University Music Performance ,  Music Education 1986  – 1990 Activities and Societies:  Phi Mu Alpha Sinfonia ,  University Symphonic Band ,  Goin' Band From Raiderland American InterContinental University Bachelor of Arts,  Business Administration 2002  – 2004 American InterContinental University Bachelor of Arts,  Business Administration 2002  – 2004 American InterContinental University Bachelor of Arts,  Business Administration 2002  – 2004 Naval Nuclear Power School Nuclear Power Operation 1993  – 1995 Electronics Technician A-School - Orlando, FL - 1993 \nNaval Nuclear Power School - Orlando, FL - 1994 \nNaval Nuclear Prototype - Charleston, SC - 1995 Naval Nuclear Power School Nuclear Power Operation 1993  – 1995 Electronics Technician A-School - Orlando, FL - 1993 \nNaval Nuclear Power School - Orlando, FL - 1994 \nNaval Nuclear Prototype - Charleston, SC - 1995 Naval Nuclear Power School Nuclear Power Operation 1993  – 1995 Electronics Technician A-School - Orlando, FL - 1993 \nNaval Nuclear Power School - Orlando, FL - 1994 \nNaval Nuclear Prototype - Charleston, SC - 1995 The University of Texas at El Paso 1992  – 1993 The University of Texas at El Paso 1992  – 1993 The University of Texas at El Paso 1992  – 1993 Texas Tech University Music Performance ,  Music Education 1986  – 1990 Activities and Societies:  Phi Mu Alpha Sinfonia ,  University Symphonic Band ,  Goin' Band From Raiderland Texas Tech University Music Performance ,  Music Education 1986  – 1990 Activities and Societies:  Phi Mu Alpha Sinfonia ,  University Symphonic Band ,  Goin' Band From Raiderland Texas Tech University Music Performance ,  Music Education 1986  – 1990 Activities and Societies:  Phi Mu Alpha Sinfonia ,  University Symphonic Band ,  Goin' Band From Raiderland ", "Experience Supply Chain Analyst Intel Corporation June 2014  – Present (1 year 3 months) Sr. Administrative Assistant Intel Corporation November 2004  –  May 2014  (9 years 7 months) State of California Insurance Agent Solo Insurance May 2004  –  October 2004  (6 months) Administrative Assistant via Kelly Services Intel Corporation September 2003  –  April 2004  (8 months) Appraiser Assistant Newton + Mercado Appraisers December 2002  –  August 2003  (9 months) Beaverton, OR PR Intern/Admin via BEC & Kelly Services Intel Corporation January 2001  –  December 2002  (2 years) Hillsboro, OR Supply Chain Analyst Intel Corporation June 2014  – Present (1 year 3 months) Supply Chain Analyst Intel Corporation June 2014  – Present (1 year 3 months) Sr. Administrative Assistant Intel Corporation November 2004  –  May 2014  (9 years 7 months) Sr. Administrative Assistant Intel Corporation November 2004  –  May 2014  (9 years 7 months) State of California Insurance Agent Solo Insurance May 2004  –  October 2004  (6 months) State of California Insurance Agent Solo Insurance May 2004  –  October 2004  (6 months) Administrative Assistant via Kelly Services Intel Corporation September 2003  –  April 2004  (8 months) Administrative Assistant via Kelly Services Intel Corporation September 2003  –  April 2004  (8 months) Appraiser Assistant Newton + Mercado Appraisers December 2002  –  August 2003  (9 months) Beaverton, OR Appraiser Assistant Newton + Mercado Appraisers December 2002  –  August 2003  (9 months) Beaverton, OR PR Intern/Admin via BEC & Kelly Services Intel Corporation January 2001  –  December 2002  (2 years) Hillsboro, OR PR Intern/Admin via BEC & Kelly Services Intel Corporation January 2001  –  December 2002  (2 years) Hillsboro, OR Skills Microsoft Office Microsoft Excel Outlook PowerPoint Research SAP Microsoft Office... Employee Relations Project Management Organizational... Higher Education SharePoint Administrative... Spreadsheets Office Management System Administration Databases Purchasing Analysis Microsoft Word Semiconductors Community Outreach Teamwork Process Improvement Access Program Management Data Analysis Leadership Training Team Leadership Inventory Management Team Building Public Relations Customer Service Event Planning Interviews Event Management Administration Human Resources Data Entry See 25+     See less Skills  Microsoft Office Microsoft Excel Outlook PowerPoint Research SAP Microsoft Office... Employee Relations Project Management Organizational... Higher Education SharePoint Administrative... Spreadsheets Office Management System Administration Databases Purchasing Analysis Microsoft Word Semiconductors Community Outreach Teamwork Process Improvement Access Program Management Data Analysis Leadership Training Team Leadership Inventory Management Team Building Public Relations Customer Service Event Planning Interviews Event Management Administration Human Resources Data Entry See 25+     See less Microsoft Office Microsoft Excel Outlook PowerPoint Research SAP Microsoft Office... Employee Relations Project Management Organizational... Higher Education SharePoint Administrative... Spreadsheets Office Management System Administration Databases Purchasing Analysis Microsoft Word Semiconductors Community Outreach Teamwork Process Improvement Access Program Management Data Analysis Leadership Training Team Leadership Inventory Management Team Building Public Relations Customer Service Event Planning Interviews Event Management Administration Human Resources Data Entry See 25+     See less Microsoft Office Microsoft Excel Outlook PowerPoint Research SAP Microsoft Office... Employee Relations Project Management Organizational... Higher Education SharePoint Administrative... Spreadsheets Office Management System Administration Databases Purchasing Analysis Microsoft Word Semiconductors Community Outreach Teamwork Process Improvement Access Program Management Data Analysis Leadership Training Team Leadership Inventory Management Team Building Public Relations Customer Service Event Planning Interviews Event Management Administration Human Resources Data Entry See 25+     See less Education Portland State University - School of Business Bachelor of Science (B.S.) Business,  Human Resource Management and Management Leadership 2012 Activities and Societies:  Beta Gamma Sigma Portland Community College Associate of Science (A.S.),  General Studies Portland State University - School of Business Bachelor of Science (B.S.) Business,  Human Resource Management and Management Leadership 2012 Activities and Societies:  Beta Gamma Sigma Portland State University - School of Business Bachelor of Science (B.S.) Business,  Human Resource Management and Management Leadership 2012 Activities and Societies:  Beta Gamma Sigma Portland State University - School of Business Bachelor of Science (B.S.) Business,  Human Resource Management and Management Leadership 2012 Activities and Societies:  Beta Gamma Sigma Portland Community College Associate of Science (A.S.),  General Studies Portland Community College Associate of Science (A.S.),  General Studies Portland Community College Associate of Science (A.S.),  General Studies Honors & Awards Additional Honors & Awards Beta Gamma Sigma Additional Honors & Awards Beta Gamma Sigma Additional Honors & Awards Beta Gamma Sigma Additional Honors & Awards Beta Gamma Sigma ", "Experience Supply Chain Analyst Intel Corporation August 2011  – Present (4 years 1 month) Amsterdam Area, Netherlands Supply Chain Analyst, with core focus on Project Management, Continuous Improvement, and managing the sites relationship with customer driven SC improvement deployments.  \nProject managed workforce optimization capability , initiated and jointly developed EMEA Customer Value Metric collaboration structure, developed a Roadmap to facilitate One OPS Infrastructure, through the application of Lean and roll modeling collaboration achieved a 90% reduction in Logistics response time to SMG for DN Expedite, Pull in and cancellation. \nProject supported selective outsource implementation and exploring EMEA Boxing SC Model. Covered EMEA Logistics Business Support Group Manager for 2 months. \nSkills are project management, people management, LEAN, change - able agent and collaboration specialist Warehouse Coordinator Intel Corporation July 2011  –  July 2012  (1 year 1 month) Amsterdam Area, Netherlands Managed operational capacity, resource management,impact analysis, operational readiness, metrics in addition to new capability projects. Programs supported increased service levels for customers while increasing volumes through the facility. Examples projects delivered new staffing model, operational readiness for the Channel Tray Integration, initiated site communication program, HVI role change by scoping, key deliverables and creating new R&Rs, improved placement logic in WMII reducing picking travel time by 25%. \nSkills are change-able agent, flexible, biz acumen, innovator, team player and trusted biz partner Logistics Manager Intel Corporation August 2005  –  June 2011  (5 years 11 months) Manager Operation support group with 5 analysts. My team is responsible for managing and monitoring Safety, Operational Training, Quality, Staffing, Equipment, Systems en Projects by using Critical Success Indicators dashboard; Back up Operational Manager; Intel Netherlands Spokes person (PR activity), Participate in Global Warehouse of the future project, Co -lead SAP picking & placement strategy configuration.  \nSkills are excellent problem solving, people manager, stimulator, innovator, team player. GERL Quality Analyst Intel Corporation February 2005  –  August 2005  (7 months) Coached and trained internal Quality Reps from different department resulted in a consistent and equal approach; Responsible for monthly trending analysis; Identified and suggested various process improvements; Developed and implemented Quality Reports. Controls Analyst (Auditor) Intel Corporation June 2002  –  February 2005  (2 years 9 months) Executed worldwide Virtual Factory audits by checking sites compliancy against procedures; Identified existing and highlighted new process risks; Region / Site Controls Champion; Developed a self assessment program and document control process. Transportation Quality Analyst Intel Corporation November 2000  –  June 2002  (1 year 8 months) Coordinated and followed up efficient on transportation related internal and external complaints caused in transport network; Provided trending analysis; Lead and facilitated Carrier meetings, Participated in various team internal and worldwide. Customer Service Representative Danzas AEI December 1998  –  November 2000  (2 years) Handled and followed up quickly and efficient incoming telephone calls related to delivery and quality queries raised by Customer Business Analyst and Internal departments; Performed daily communication reports Transportation Coordinator Mokveld Valves December 1997  –  November 1998  (1 year) Responsible to arrange transport, documentation and packaging for valves shipped to worldwide end destinations. Assistant Inside Sales Gouderak BV September 1992  –  November 1997  (5 years 3 months) Responsible to arrange transport en documentation for drivers with deliveries in the Netherlands and Germany; Informed customers accordingly. Supply Chain Analyst Intel Corporation August 2011  – Present (4 years 1 month) Amsterdam Area, Netherlands Supply Chain Analyst, with core focus on Project Management, Continuous Improvement, and managing the sites relationship with customer driven SC improvement deployments.  \nProject managed workforce optimization capability , initiated and jointly developed EMEA Customer Value Metric collaboration structure, developed a Roadmap to facilitate One OPS Infrastructure, through the application of Lean and roll modeling collaboration achieved a 90% reduction in Logistics response time to SMG for DN Expedite, Pull in and cancellation. \nProject supported selective outsource implementation and exploring EMEA Boxing SC Model. Covered EMEA Logistics Business Support Group Manager for 2 months. \nSkills are project management, people management, LEAN, change - able agent and collaboration specialist Supply Chain Analyst Intel Corporation August 2011  – Present (4 years 1 month) Amsterdam Area, Netherlands Supply Chain Analyst, with core focus on Project Management, Continuous Improvement, and managing the sites relationship with customer driven SC improvement deployments.  \nProject managed workforce optimization capability , initiated and jointly developed EMEA Customer Value Metric collaboration structure, developed a Roadmap to facilitate One OPS Infrastructure, through the application of Lean and roll modeling collaboration achieved a 90% reduction in Logistics response time to SMG for DN Expedite, Pull in and cancellation. \nProject supported selective outsource implementation and exploring EMEA Boxing SC Model. Covered EMEA Logistics Business Support Group Manager for 2 months. \nSkills are project management, people management, LEAN, change - able agent and collaboration specialist Warehouse Coordinator Intel Corporation July 2011  –  July 2012  (1 year 1 month) Amsterdam Area, Netherlands Managed operational capacity, resource management,impact analysis, operational readiness, metrics in addition to new capability projects. Programs supported increased service levels for customers while increasing volumes through the facility. Examples projects delivered new staffing model, operational readiness for the Channel Tray Integration, initiated site communication program, HVI role change by scoping, key deliverables and creating new R&Rs, improved placement logic in WMII reducing picking travel time by 25%. \nSkills are change-able agent, flexible, biz acumen, innovator, team player and trusted biz partner Warehouse Coordinator Intel Corporation July 2011  –  July 2012  (1 year 1 month) Amsterdam Area, Netherlands Managed operational capacity, resource management,impact analysis, operational readiness, metrics in addition to new capability projects. Programs supported increased service levels for customers while increasing volumes through the facility. Examples projects delivered new staffing model, operational readiness for the Channel Tray Integration, initiated site communication program, HVI role change by scoping, key deliverables and creating new R&Rs, improved placement logic in WMII reducing picking travel time by 25%. \nSkills are change-able agent, flexible, biz acumen, innovator, team player and trusted biz partner Logistics Manager Intel Corporation August 2005  –  June 2011  (5 years 11 months) Manager Operation support group with 5 analysts. My team is responsible for managing and monitoring Safety, Operational Training, Quality, Staffing, Equipment, Systems en Projects by using Critical Success Indicators dashboard; Back up Operational Manager; Intel Netherlands Spokes person (PR activity), Participate in Global Warehouse of the future project, Co -lead SAP picking & placement strategy configuration.  \nSkills are excellent problem solving, people manager, stimulator, innovator, team player. Logistics Manager Intel Corporation August 2005  –  June 2011  (5 years 11 months) Manager Operation support group with 5 analysts. My team is responsible for managing and monitoring Safety, Operational Training, Quality, Staffing, Equipment, Systems en Projects by using Critical Success Indicators dashboard; Back up Operational Manager; Intel Netherlands Spokes person (PR activity), Participate in Global Warehouse of the future project, Co -lead SAP picking & placement strategy configuration.  \nSkills are excellent problem solving, people manager, stimulator, innovator, team player. GERL Quality Analyst Intel Corporation February 2005  –  August 2005  (7 months) Coached and trained internal Quality Reps from different department resulted in a consistent and equal approach; Responsible for monthly trending analysis; Identified and suggested various process improvements; Developed and implemented Quality Reports. GERL Quality Analyst Intel Corporation February 2005  –  August 2005  (7 months) Coached and trained internal Quality Reps from different department resulted in a consistent and equal approach; Responsible for monthly trending analysis; Identified and suggested various process improvements; Developed and implemented Quality Reports. Controls Analyst (Auditor) Intel Corporation June 2002  –  February 2005  (2 years 9 months) Executed worldwide Virtual Factory audits by checking sites compliancy against procedures; Identified existing and highlighted new process risks; Region / Site Controls Champion; Developed a self assessment program and document control process. Controls Analyst (Auditor) Intel Corporation June 2002  –  February 2005  (2 years 9 months) Executed worldwide Virtual Factory audits by checking sites compliancy against procedures; Identified existing and highlighted new process risks; Region / Site Controls Champion; Developed a self assessment program and document control process. Transportation Quality Analyst Intel Corporation November 2000  –  June 2002  (1 year 8 months) Coordinated and followed up efficient on transportation related internal and external complaints caused in transport network; Provided trending analysis; Lead and facilitated Carrier meetings, Participated in various team internal and worldwide. Transportation Quality Analyst Intel Corporation November 2000  –  June 2002  (1 year 8 months) Coordinated and followed up efficient on transportation related internal and external complaints caused in transport network; Provided trending analysis; Lead and facilitated Carrier meetings, Participated in various team internal and worldwide. Customer Service Representative Danzas AEI December 1998  –  November 2000  (2 years) Handled and followed up quickly and efficient incoming telephone calls related to delivery and quality queries raised by Customer Business Analyst and Internal departments; Performed daily communication reports Customer Service Representative Danzas AEI December 1998  –  November 2000  (2 years) Handled and followed up quickly and efficient incoming telephone calls related to delivery and quality queries raised by Customer Business Analyst and Internal departments; Performed daily communication reports Transportation Coordinator Mokveld Valves December 1997  –  November 1998  (1 year) Responsible to arrange transport, documentation and packaging for valves shipped to worldwide end destinations. Transportation Coordinator Mokveld Valves December 1997  –  November 1998  (1 year) Responsible to arrange transport, documentation and packaging for valves shipped to worldwide end destinations. Assistant Inside Sales Gouderak BV September 1992  –  November 1997  (5 years 3 months) Responsible to arrange transport en documentation for drivers with deliveries in the Netherlands and Germany; Informed customers accordingly. Assistant Inside Sales Gouderak BV September 1992  –  November 1997  (5 years 3 months) Responsible to arrange transport en documentation for drivers with deliveries in the Netherlands and Germany; Informed customers accordingly. Skills Logistics Warehousing Transportation Process Improvement Problem Solving Supply Chain Logistics Management Warehouse Management Operations Management Inventory Management Change Management Lean Manufacturing People Management Continuous Improvement WMS Management Supply Chain... Training Strategy Supply Chain Management Transportation... Materials Management Purchasing Teamwork Project Planning International Logistics Procurement Process Engineering Demand Planning Software Documentation Customs Regulations Business Strategy Cross-functional Team... Global Sourcing Operational Excellence Business Process... Contract Management Program Management SAP MRP 3PL Leadership Shipping Manufacturing Analysis Reverse Logistics Team Leadership Customer Service Strategic Sourcing Supply Management See 35+     See less Skills  Logistics Warehousing Transportation Process Improvement Problem Solving Supply Chain Logistics Management Warehouse Management Operations Management Inventory Management Change Management Lean Manufacturing People Management Continuous Improvement WMS Management Supply Chain... Training Strategy Supply Chain Management Transportation... Materials Management Purchasing Teamwork Project Planning International Logistics Procurement Process Engineering Demand Planning Software Documentation Customs Regulations Business Strategy Cross-functional Team... Global Sourcing Operational Excellence Business Process... Contract Management Program Management SAP MRP 3PL Leadership Shipping Manufacturing Analysis Reverse Logistics Team Leadership Customer Service Strategic Sourcing Supply Management See 35+     See less Logistics Warehousing Transportation Process Improvement Problem Solving Supply Chain Logistics Management Warehouse Management Operations Management Inventory Management Change Management Lean Manufacturing People Management Continuous Improvement WMS Management Supply Chain... Training Strategy Supply Chain Management Transportation... Materials Management Purchasing Teamwork Project Planning International Logistics Procurement Process Engineering Demand Planning Software Documentation Customs Regulations Business Strategy Cross-functional Team... Global Sourcing Operational Excellence Business Process... Contract Management Program Management SAP MRP 3PL Leadership Shipping Manufacturing Analysis Reverse Logistics Team Leadership Customer Service Strategic Sourcing Supply Management See 35+     See less Logistics Warehousing Transportation Process Improvement Problem Solving Supply Chain Logistics Management Warehouse Management Operations Management Inventory Management Change Management Lean Manufacturing People Management Continuous Improvement WMS Management Supply Chain... Training Strategy Supply Chain Management Transportation... Materials Management Purchasing Teamwork Project Planning International Logistics Procurement Process Engineering Demand Planning Software Documentation Customs Regulations Business Strategy Cross-functional Team... Global Sourcing Operational Excellence Business Process... Contract Management Program Management SAP MRP 3PL Leadership Shipping Manufacturing Analysis Reverse Logistics Team Leadership Customer Service Strategic Sourcing Supply Management See 35+     See less Education NCOI HBO Business Administration Bachelor,  Special subject: Logistics 2007  – 2013 Institute LOI - Logistics Management MBO+,  Logistics Management 1991  – 1992 MBO MBO,  Food Technology 1987  – 1991 NCOI HBO Business Administration Bachelor,  Special subject: Logistics 2007  – 2013 NCOI HBO Business Administration Bachelor,  Special subject: Logistics 2007  – 2013 NCOI HBO Business Administration Bachelor,  Special subject: Logistics 2007  – 2013 Institute LOI - Logistics Management MBO+,  Logistics Management 1991  – 1992 Institute LOI - Logistics Management MBO+,  Logistics Management 1991  – 1992 Institute LOI - Logistics Management MBO+,  Logistics Management 1991  – 1992 MBO MBO,  Food Technology 1987  – 1991 MBO MBO,  Food Technology 1987  – 1991 MBO MBO,  Food Technology 1987  – 1991 ", "Skills Strategic Sourcing Supply Management Supply Chain Management Contract Negotiation Global Sourcing Cross-functional Team... Lean Manufacturing SPC Materials Management Supplier Development Change Management Process Improvement Inventory Management Manufacturing Purchasing Program Management Warehousing Manufacturing... Supply Chain Operations Management Production Planning MRP Procurement Logistics Sourcing Continuous Improvement Supply Chain... Vendor Management Forecasting Outsourcing SAP Semiconductors Negotiation Supplier Negotiation Demand Planning See 20+     See less Skills  Strategic Sourcing Supply Management Supply Chain Management Contract Negotiation Global Sourcing Cross-functional Team... Lean Manufacturing SPC Materials Management Supplier Development Change Management Process Improvement Inventory Management Manufacturing Purchasing Program Management Warehousing Manufacturing... Supply Chain Operations Management Production Planning MRP Procurement Logistics Sourcing Continuous Improvement Supply Chain... Vendor Management Forecasting Outsourcing SAP Semiconductors Negotiation Supplier Negotiation Demand Planning See 20+     See less Strategic Sourcing Supply Management Supply Chain Management Contract Negotiation Global Sourcing Cross-functional Team... Lean Manufacturing SPC Materials Management Supplier Development Change Management Process Improvement Inventory Management Manufacturing Purchasing Program Management Warehousing Manufacturing... Supply Chain Operations Management Production Planning MRP Procurement Logistics Sourcing Continuous Improvement Supply Chain... Vendor Management Forecasting Outsourcing SAP Semiconductors Negotiation Supplier Negotiation Demand Planning See 20+     See less Strategic Sourcing Supply Management Supply Chain Management Contract Negotiation Global Sourcing Cross-functional Team... Lean Manufacturing SPC Materials Management Supplier Development Change Management Process Improvement Inventory Management Manufacturing Purchasing Program Management Warehousing Manufacturing... Supply Chain Operations Management Production Planning MRP Procurement Logistics Sourcing Continuous Improvement Supply Chain... Vendor Management Forecasting Outsourcing SAP Semiconductors Negotiation Supplier Negotiation Demand Planning See 20+     See less ", "Summary JD/MBA with logistics, supply chain, strategic sourcing, procurement, contracting, and international work experience. \n \nAs a Marine Corps Logistics Officer, I gained experience with supplier management, operations planning, property accountability, materials management, maintenance management, and supply chain operations. My legal training and work have sharpened my writing, research, and analytical skills. I compliment those skills and talents with what I gained from the nonprofit and Peace Corps communities: the ability to engage and work with any person in any environment. Summary JD/MBA with logistics, supply chain, strategic sourcing, procurement, contracting, and international work experience. \n \nAs a Marine Corps Logistics Officer, I gained experience with supplier management, operations planning, property accountability, materials management, maintenance management, and supply chain operations. My legal training and work have sharpened my writing, research, and analytical skills. I compliment those skills and talents with what I gained from the nonprofit and Peace Corps communities: the ability to engage and work with any person in any environment. JD/MBA with logistics, supply chain, strategic sourcing, procurement, contracting, and international work experience. \n \nAs a Marine Corps Logistics Officer, I gained experience with supplier management, operations planning, property accountability, materials management, maintenance management, and supply chain operations. My legal training and work have sharpened my writing, research, and analytical skills. I compliment those skills and talents with what I gained from the nonprofit and Peace Corps communities: the ability to engage and work with any person in any environment. JD/MBA with logistics, supply chain, strategic sourcing, procurement, contracting, and international work experience. \n \nAs a Marine Corps Logistics Officer, I gained experience with supplier management, operations planning, property accountability, materials management, maintenance management, and supply chain operations. My legal training and work have sharpened my writing, research, and analytical skills. I compliment those skills and talents with what I gained from the nonprofit and Peace Corps communities: the ability to engage and work with any person in any environment. Experience Graduate Teaching Assistant, Strategic Cost Management (MGT 271) for Professor Shannon Anderson UC Davis Graduate School of Management January 2015  –  March 2015  (3 months) Davis, CA JD/MBA Business Analyst Intern - Supply Chain and Procurement Chevron May 2014  –  August 2014  (4 months) Houston, TX MBA Student Consultant - Sustainability and Strategy Mars September 2013  –  March 2014  (7 months) MBA Intern - Sourcing and Procurement The Walt Disney Company June 2013  –  August 2013  (3 months) Glendale, CA Legal Intern - Contracts and Liability Office of Statewide Health Planning and Development June 2012  –  November 2012  (6 months) Sacramento, CA Logistics Officer United States Marine Corps January 2005  –  June 2011  (6 years 6 months) California | Iraq Project Manager - Community Relations and Training Swords to Plowshares March 2009  –  April 2011  (2 years 2 months) San Francisco, CA Store Receiving Manager Office Depot September 2004  –  November 2004  (3 months) Manhattan Beach, CA Peace Corps Volunteer - Community and Youth Development Peace Corps (Nicaragua) July 2002  –  August 2004  (2 years 2 months) Laguna de Perla, Nicaragua \"30-Day\" Account Manager Monterey Financial Services, Inc. January 2002  –  April 2002  (4 months) Oceanside, CA Level 5 Associate (cook, cashier) In-N-Out Burger June 1995  –  November 2001  (6 years 6 months) San Diego, CA Customer Service Representative TransUnion June 1998  –  August 1998  (3 months) Anaheim, CA Graduate Teaching Assistant, Strategic Cost Management (MGT 271) for Professor Shannon Anderson UC Davis Graduate School of Management January 2015  –  March 2015  (3 months) Davis, CA Graduate Teaching Assistant, Strategic Cost Management (MGT 271) for Professor Shannon Anderson UC Davis Graduate School of Management January 2015  –  March 2015  (3 months) Davis, CA JD/MBA Business Analyst Intern - Supply Chain and Procurement Chevron May 2014  –  August 2014  (4 months) Houston, TX JD/MBA Business Analyst Intern - Supply Chain and Procurement Chevron May 2014  –  August 2014  (4 months) Houston, TX MBA Student Consultant - Sustainability and Strategy Mars September 2013  –  March 2014  (7 months) MBA Student Consultant - Sustainability and Strategy Mars September 2013  –  March 2014  (7 months) MBA Intern - Sourcing and Procurement The Walt Disney Company June 2013  –  August 2013  (3 months) Glendale, CA MBA Intern - Sourcing and Procurement The Walt Disney Company June 2013  –  August 2013  (3 months) Glendale, CA Legal Intern - Contracts and Liability Office of Statewide Health Planning and Development June 2012  –  November 2012  (6 months) Sacramento, CA Legal Intern - Contracts and Liability Office of Statewide Health Planning and Development June 2012  –  November 2012  (6 months) Sacramento, CA Logistics Officer United States Marine Corps January 2005  –  June 2011  (6 years 6 months) California | Iraq Logistics Officer United States Marine Corps January 2005  –  June 2011  (6 years 6 months) California | Iraq Project Manager - Community Relations and Training Swords to Plowshares March 2009  –  April 2011  (2 years 2 months) San Francisco, CA Project Manager - Community Relations and Training Swords to Plowshares March 2009  –  April 2011  (2 years 2 months) San Francisco, CA Store Receiving Manager Office Depot September 2004  –  November 2004  (3 months) Manhattan Beach, CA Store Receiving Manager Office Depot September 2004  –  November 2004  (3 months) Manhattan Beach, CA Peace Corps Volunteer - Community and Youth Development Peace Corps (Nicaragua) July 2002  –  August 2004  (2 years 2 months) Laguna de Perla, Nicaragua Peace Corps Volunteer - Community and Youth Development Peace Corps (Nicaragua) July 2002  –  August 2004  (2 years 2 months) Laguna de Perla, Nicaragua \"30-Day\" Account Manager Monterey Financial Services, Inc. January 2002  –  April 2002  (4 months) Oceanside, CA \"30-Day\" Account Manager Monterey Financial Services, Inc. January 2002  –  April 2002  (4 months) Oceanside, CA Level 5 Associate (cook, cashier) In-N-Out Burger June 1995  –  November 2001  (6 years 6 months) San Diego, CA Level 5 Associate (cook, cashier) In-N-Out Burger June 1995  –  November 2001  (6 years 6 months) San Diego, CA Customer Service Representative TransUnion June 1998  –  August 1998  (3 months) Anaheim, CA Customer Service Representative TransUnion June 1998  –  August 1998  (3 months) Anaheim, CA Languages Spanish Spanish Spanish Skills Program Management Project Management Marketing Sales Public Speaking Supply Chain Management Leadership Development Government Community Outreach Policy Analysis Non-profits Legal Writing Team Building Critical Thinking Analysis Strategy Training Social Media Military Editing Leadership Nonprofits Policy Cross-functional Team... Time Management Research Legal Research Strategic Planning Spanish Management See 15+     See less Skills  Program Management Project Management Marketing Sales Public Speaking Supply Chain Management Leadership Development Government Community Outreach Policy Analysis Non-profits Legal Writing Team Building Critical Thinking Analysis Strategy Training Social Media Military Editing Leadership Nonprofits Policy Cross-functional Team... Time Management Research Legal Research Strategic Planning Spanish Management See 15+     See less Program Management Project Management Marketing Sales Public Speaking Supply Chain Management Leadership Development Government Community Outreach Policy Analysis Non-profits Legal Writing Team Building Critical Thinking Analysis Strategy Training Social Media Military Editing Leadership Nonprofits Policy Cross-functional Team... Time Management Research Legal Research Strategic Planning Spanish Management See 15+     See less Program Management Project Management Marketing Sales Public Speaking Supply Chain Management Leadership Development Government Community Outreach Policy Analysis Non-profits Legal Writing Team Building Critical Thinking Analysis Strategy Training Social Media Military Editing Leadership Nonprofits Policy Cross-functional Team... Time Management Research Legal Research Strategic Planning Spanish Management See 15+     See less Education UC Davis Graduate School of Management Master of Business Administration (MBA) 2012  – 2015 UC Davis School of Law JD 2011  – 2015 University of California, Berkeley Certificate 2009  – 2011 University of San Diego BA Servite High School UC Davis Graduate School of Management Master of Business Administration (MBA) 2012  – 2015 UC Davis Graduate School of Management Master of Business Administration (MBA) 2012  – 2015 UC Davis Graduate School of Management Master of Business Administration (MBA) 2012  – 2015 UC Davis School of Law JD 2011  – 2015 UC Davis School of Law JD 2011  – 2015 UC Davis School of Law JD 2011  – 2015 University of California, Berkeley Certificate 2009  – 2011 University of California, Berkeley Certificate 2009  – 2011 University of California, Berkeley Certificate 2009  – 2011 University of San Diego BA University of San Diego BA University of San Diego BA Servite High School Servite High School Servite High School Honors & Awards Professor Gary Solis Veterans Service Award UC Davis School of Law April 2014 For outstanding service to veterans at UC Davis and in the community. Innovator Fellow UC Davis Graduate School of Management 2013 King Hall Alumni Association Award UC Davis School of Law Alumni Association April 2015 For outstanding and meaningful contribution to King Hall as a student to improve and enhance the community and opportunities for others. Professor Gary Solis Veterans Service Award UC Davis School of Law April 2014 For outstanding service to veterans at UC Davis and in the community. Professor Gary Solis Veterans Service Award UC Davis School of Law April 2014 For outstanding service to veterans at UC Davis and in the community. Professor Gary Solis Veterans Service Award UC Davis School of Law April 2014 For outstanding service to veterans at UC Davis and in the community. Innovator Fellow UC Davis Graduate School of Management 2013 Innovator Fellow UC Davis Graduate School of Management 2013 Innovator Fellow UC Davis Graduate School of Management 2013 King Hall Alumni Association Award UC Davis School of Law Alumni Association April 2015 For outstanding and meaningful contribution to King Hall as a student to improve and enhance the community and opportunities for others. King Hall Alumni Association Award UC Davis School of Law Alumni Association April 2015 For outstanding and meaningful contribution to King Hall as a student to improve and enhance the community and opportunities for others. King Hall Alumni Association Award UC Davis School of Law Alumni Association April 2015 For outstanding and meaningful contribution to King Hall as a student to improve and enhance the community and opportunities for others. ", "Experience Supply Chain Analyst Intel Corporation January 2013  – Present (2 years 8 months) Vietnam • Core responsibility to ensure Continuous Improvement in pursuit of OpX. Identify process improvements based on thorough understanding of the business processes and supply chain dependencies.  \n• Communicate, explain, and clarify issues with the customer/business groups/divisions, and translate business requirements. Perform specialized tasks in addition to core job responsibilities, such as consulting on tools, systems, quality and controls, services, or processes; provide input to system/process design; and/or provide content knowledge support and troubleshooting.  \n• Work on projects and programs simultaneously, managing multi stakeholders and 3PL, conduct budget and headcount planning, business forecasting, constraint analysis, inventory analysis, plan, benchmarking and departmental indicators Supply Chain Analyst Intel Corporation January 2013  – Present (2 years 8 months) Vietnam • Core responsibility to ensure Continuous Improvement in pursuit of OpX. Identify process improvements based on thorough understanding of the business processes and supply chain dependencies.  \n• Communicate, explain, and clarify issues with the customer/business groups/divisions, and translate business requirements. Perform specialized tasks in addition to core job responsibilities, such as consulting on tools, systems, quality and controls, services, or processes; provide input to system/process design; and/or provide content knowledge support and troubleshooting.  \n• Work on projects and programs simultaneously, managing multi stakeholders and 3PL, conduct budget and headcount planning, business forecasting, constraint analysis, inventory analysis, plan, benchmarking and departmental indicators Supply Chain Analyst Intel Corporation January 2013  – Present (2 years 8 months) Vietnam • Core responsibility to ensure Continuous Improvement in pursuit of OpX. Identify process improvements based on thorough understanding of the business processes and supply chain dependencies.  \n• Communicate, explain, and clarify issues with the customer/business groups/divisions, and translate business requirements. Perform specialized tasks in addition to core job responsibilities, such as consulting on tools, systems, quality and controls, services, or processes; provide input to system/process design; and/or provide content knowledge support and troubleshooting.  \n• Work on projects and programs simultaneously, managing multi stakeholders and 3PL, conduct budget and headcount planning, business forecasting, constraint analysis, inventory analysis, plan, benchmarking and departmental indicators Skills Skills     Education Université de Liège Master,  Logistics and Transportation 2010  – 2011 University of Economics and Law - Vietnam National University Bachelor,  Management Information System , Very Good 2005  – 2009 Aptech Computer Programming , Distinction 2006  – 2008 Université de Liège Master,  Logistics and Transportation 2010  – 2011 Université de Liège Master,  Logistics and Transportation 2010  – 2011 Université de Liège Master,  Logistics and Transportation 2010  – 2011 University of Economics and Law - Vietnam National University Bachelor,  Management Information System , Very Good 2005  – 2009 University of Economics and Law - Vietnam National University Bachelor,  Management Information System , Very Good 2005  – 2009 University of Economics and Law - Vietnam National University Bachelor,  Management Information System , Very Good 2005  – 2009 Aptech Computer Programming , Distinction 2006  – 2008 Aptech Computer Programming , Distinction 2006  – 2008 Aptech Computer Programming , Distinction 2006  – 2008 Honors & Awards Additional Honors & Awards The POSCO Asia Fellowship - POSCO TJ Park Foundation Additional Honors & Awards The POSCO Asia Fellowship - POSCO TJ Park Foundation Additional Honors & Awards The POSCO Asia Fellowship - POSCO TJ Park Foundation Additional Honors & Awards The POSCO Asia Fellowship - POSCO TJ Park Foundation ", "Experience Commodity Specialist Intel Supply Chain Analyst Intel Corporation June 2008  – Present (7 years 3 months) Commodity Specialist Intel Commodity Specialist Intel Supply Chain Analyst Intel Corporation June 2008  – Present (7 years 3 months) Supply Chain Analyst Intel Corporation June 2008  – Present (7 years 3 months) Skills Strategic Sourcing Procurement Supply Chain Management SAP Cross-functional Team... Supply Chain... Supply Management MRP Materials Management Continuous Improvement Supply Chain Supplier Development Lean Manufacturing Skills  Strategic Sourcing Procurement Supply Chain Management SAP Cross-functional Team... Supply Chain... Supply Management MRP Materials Management Continuous Improvement Supply Chain Supplier Development Lean Manufacturing Strategic Sourcing Procurement Supply Chain Management SAP Cross-functional Team... Supply Chain... Supply Management MRP Materials Management Continuous Improvement Supply Chain Supplier Development Lean Manufacturing Strategic Sourcing Procurement Supply Chain Management SAP Cross-functional Team... Supply Chain... Supply Management MRP Materials Management Continuous Improvement Supply Chain Supplier Development Lean Manufacturing Education Western International University 2001  – 2005 Western International University 2001  – 2005 Western International University 2001  – 2005 Western International University 2001  – 2005 ", "Experience Supply Chain Analyst Intel Corporation July 2012  – Present (3 years 2 months) Dalian, Liaoning, China 1.Responsible for operations scheduling and planning materials for production in accordance to customer demand, plant capacity and WIP to meet optimum response. \n2.Perform what-if analysis, provide corresponding supply strategy and drive customer fulfilment through communicating and coordinating both internal and external stakeholders. \n3.Raw material procurement and reverse logistics management via SAP based systems. \n4.Initiated and led project team to qualify new supplier and develop new business process, achieving 50% shorter supply lead time, lower freight cost and optimized transportation route. \n5.Drive continuous improvement on business process by applying Lean philosophy and implementing ~30 creative experiments to improve cost efficiency and business effectiveness.  Customs Operation Specialist Intel Corporation January 2013  –  June 2013  (6 months) Dalian, Liaoning, China 1. Responsible for international transportation especially inbound Customs clearance operations for bonded cargo during 6-month rotation in Logistics team. \n2. Applied supply chain management knowledge into daily activities and accelerated import customs clearance. Supply Chain Analyst Intel Corporation July 2012  – Present (3 years 2 months) Dalian, Liaoning, China 1.Responsible for operations scheduling and planning materials for production in accordance to customer demand, plant capacity and WIP to meet optimum response. \n2.Perform what-if analysis, provide corresponding supply strategy and drive customer fulfilment through communicating and coordinating both internal and external stakeholders. \n3.Raw material procurement and reverse logistics management via SAP based systems. \n4.Initiated and led project team to qualify new supplier and develop new business process, achieving 50% shorter supply lead time, lower freight cost and optimized transportation route. \n5.Drive continuous improvement on business process by applying Lean philosophy and implementing ~30 creative experiments to improve cost efficiency and business effectiveness.  Supply Chain Analyst Intel Corporation July 2012  – Present (3 years 2 months) Dalian, Liaoning, China 1.Responsible for operations scheduling and planning materials for production in accordance to customer demand, plant capacity and WIP to meet optimum response. \n2.Perform what-if analysis, provide corresponding supply strategy and drive customer fulfilment through communicating and coordinating both internal and external stakeholders. \n3.Raw material procurement and reverse logistics management via SAP based systems. \n4.Initiated and led project team to qualify new supplier and develop new business process, achieving 50% shorter supply lead time, lower freight cost and optimized transportation route. \n5.Drive continuous improvement on business process by applying Lean philosophy and implementing ~30 creative experiments to improve cost efficiency and business effectiveness.  Customs Operation Specialist Intel Corporation January 2013  –  June 2013  (6 months) Dalian, Liaoning, China 1. Responsible for international transportation especially inbound Customs clearance operations for bonded cargo during 6-month rotation in Logistics team. \n2. Applied supply chain management knowledge into daily activities and accelerated import customs clearance. Customs Operation Specialist Intel Corporation January 2013  –  June 2013  (6 months) Dalian, Liaoning, China 1. Responsible for international transportation especially inbound Customs clearance operations for bonded cargo during 6-month rotation in Logistics team. \n2. Applied supply chain management knowledge into daily activities and accelerated import customs clearance. Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Supply Chain Management Project Management Problem Solving Analytical Skills Strategic Planning Communication Interpersonal Skills Skills  Supply Chain Management Project Management Problem Solving Analytical Skills Strategic Planning Communication Interpersonal Skills Supply Chain Management Project Management Problem Solving Analytical Skills Strategic Planning Communication Interpersonal Skills Supply Chain Management Project Management Problem Solving Analytical Skills Strategic Planning Communication Interpersonal Skills Education Dalian Maritime University Master's degree,  Logistics Engineering & Management 2010  – 2012 1. Achieved the honor of Excellent Graduate Student of DMU (2011); \n2. Won first class fellowship; \n3. Initiated events within campus and coordinated classmates to participate in social activities like Dalian International Walking Festival as well as volunteering); \n4. Dissertation titled “Research on New Business Development of Tally Industry”. Published in China Tally Association, 2011; \n5. Part-time ERP teacher in Dalian Ocean University. Dalian Maritime University Bachelor's degree,  Logistics Management 2006  – 2010 Honor: Excellent Undergraduate Student of DMU (2010), National Scholarship (2007), National Endeavour Fellowship (2008&2009). \nOrganized events (e.g. orientation ceremonies, Chinese corner) as a member of Oversea Students Club. Dalian Maritime University Master's degree,  Logistics Engineering & Management 2010  – 2012 1. Achieved the honor of Excellent Graduate Student of DMU (2011); \n2. Won first class fellowship; \n3. Initiated events within campus and coordinated classmates to participate in social activities like Dalian International Walking Festival as well as volunteering); \n4. Dissertation titled “Research on New Business Development of Tally Industry”. Published in China Tally Association, 2011; \n5. Part-time ERP teacher in Dalian Ocean University. Dalian Maritime University Master's degree,  Logistics Engineering & Management 2010  – 2012 1. Achieved the honor of Excellent Graduate Student of DMU (2011); \n2. Won first class fellowship; \n3. Initiated events within campus and coordinated classmates to participate in social activities like Dalian International Walking Festival as well as volunteering); \n4. Dissertation titled “Research on New Business Development of Tally Industry”. Published in China Tally Association, 2011; \n5. Part-time ERP teacher in Dalian Ocean University. Dalian Maritime University Master's degree,  Logistics Engineering & Management 2010  – 2012 1. Achieved the honor of Excellent Graduate Student of DMU (2011); \n2. Won first class fellowship; \n3. Initiated events within campus and coordinated classmates to participate in social activities like Dalian International Walking Festival as well as volunteering); \n4. Dissertation titled “Research on New Business Development of Tally Industry”. Published in China Tally Association, 2011; \n5. Part-time ERP teacher in Dalian Ocean University. Dalian Maritime University Bachelor's degree,  Logistics Management 2006  – 2010 Honor: Excellent Undergraduate Student of DMU (2010), National Scholarship (2007), National Endeavour Fellowship (2008&2009). \nOrganized events (e.g. orientation ceremonies, Chinese corner) as a member of Oversea Students Club. Dalian Maritime University Bachelor's degree,  Logistics Management 2006  – 2010 Honor: Excellent Undergraduate Student of DMU (2010), National Scholarship (2007), National Endeavour Fellowship (2008&2009). \nOrganized events (e.g. orientation ceremonies, Chinese corner) as a member of Oversea Students Club. Dalian Maritime University Bachelor's degree,  Logistics Management 2006  – 2010 Honor: Excellent Undergraduate Student of DMU (2010), National Scholarship (2007), National Endeavour Fellowship (2008&2009). \nOrganized events (e.g. orientation ceremonies, Chinese corner) as a member of Oversea Students Club. ", "Experience Supply Chain Analyst Intel Corporation February 2006  – Present (9 years 7 months) Chandler, Arizona Supply Chain Analyst Intel Corporation February 2006  – Present (9 years 7 months) Chandler, Arizona Supply Chain Analyst Intel Corporation February 2006  – Present (9 years 7 months) Chandler, Arizona ", "Experience Supply Chain Analyst Intel Corporation September 2014  – Present (1 year) MNC Customer Business Manager Intel Corporation April 2010  –  September 2014  (4 years 6 months) Business Analyst Intel 2004  –  2010  (6 years) Supply Chain Analyst Intel Corporation September 2014  – Present (1 year) Supply Chain Analyst Intel Corporation September 2014  – Present (1 year) MNC Customer Business Manager Intel Corporation April 2010  –  September 2014  (4 years 6 months) MNC Customer Business Manager Intel Corporation April 2010  –  September 2014  (4 years 6 months) Business Analyst Intel 2004  –  2010  (6 years) Business Analyst Intel 2004  –  2010  (6 years) Skills Business Analysis Product Management Supply Chain Management Skills  Business Analysis Product Management Supply Chain Management Business Analysis Product Management Supply Chain Management Business Analysis Product Management Supply Chain Management Education University of the West of England 1996  – 2000 University of the West of England 1996  – 2000 University of the West of England 1996  – 2000 University of the West of England 1996  – 2000 ", "Summary A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. Summary A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. Languages   Skills Skills     ", "Summary Supply Chain Management at Intel Corporation Global Fab Materials Group Specialties:Supply Chain Management, Inventory management, Logistics, Information Technology consulting, Computer hardware and software repair Summary Supply Chain Management at Intel Corporation Global Fab Materials Group Specialties:Supply Chain Management, Inventory management, Logistics, Information Technology consulting, Computer hardware and software repair Supply Chain Management at Intel Corporation Global Fab Materials Group Specialties:Supply Chain Management, Inventory management, Logistics, Information Technology consulting, Computer hardware and software repair Supply Chain Management at Intel Corporation Global Fab Materials Group Specialties:Supply Chain Management, Inventory management, Logistics, Information Technology consulting, Computer hardware and software repair Experience Supply Chain Analyst Intel Corporation June 2012  –  April 2015  (2 years 11 months) • Ensured chip manufacturing production plans across global operations stay on track by maintaining stock of chemical and gas inventory \n \n• Determined demands from end users by communicating closely with factory engineers \n \n• Collaborated with supplier, sub-suppliers in order to ensure quality, shelf life, quantity, availability and other demands are met \n \n• Work closely with logistics providers and 3PL warehouse providers in order to ship and store hazmat products appropriately \n \n• Involved in development of supply chain web applications for internal use Manager, Computer Repair Technician, Technology Consultant University of Michigan Computer Showcase July 2009  –  August 2010  (1 year 2 months) • Instituted policy changes to order processing system allowing for more flexibility during special sales periods in order to meet greater demand \n \n• Enhanced inventory management by identifying and implementing methods to prevent stock outages through improved communication between sales associates and stock room employees \n \n• Trained and supervised sales associates and technology consultants on the specifications, features, and benefits of every product to ensure customer's technological needs were met resulting in greater customer satisfaction and reduced product return rates \n \n• Expedited order fulfillment by processing point of sale transactions and shipping orders allowing for significant reductions in customer wait time \n \n• Provided customers with computer software repair services and performed hardware repairs for systems with warranty coverage Student Coordinator, Student Manager, Consultant Academic Technology Center, Cornell University June 2004  –  May 2007  (3 years) • Achieved highest level student position in the IT department by providing exceptional technology consulting services on a consistent basis \n \n• Supervised student management team and trained consulting staff (~45 students) in time-sensitive project work involving course website creation and digital media production resulting in 100% of all deadlines being met \n \n• Provided consulting services to faculty members to determine hardware and software technological needs for delivery of course material \n \n• Assisted in purchasing decisions through budget management and product research \n \n• Provided on-site and remote technical support for online courses to ensure student and faculty satisfaction Supply Chain Analyst Intel Corporation June 2012  –  April 2015  (2 years 11 months) • Ensured chip manufacturing production plans across global operations stay on track by maintaining stock of chemical and gas inventory \n \n• Determined demands from end users by communicating closely with factory engineers \n \n• Collaborated with supplier, sub-suppliers in order to ensure quality, shelf life, quantity, availability and other demands are met \n \n• Work closely with logistics providers and 3PL warehouse providers in order to ship and store hazmat products appropriately \n \n• Involved in development of supply chain web applications for internal use Supply Chain Analyst Intel Corporation June 2012  –  April 2015  (2 years 11 months) • Ensured chip manufacturing production plans across global operations stay on track by maintaining stock of chemical and gas inventory \n \n• Determined demands from end users by communicating closely with factory engineers \n \n• Collaborated with supplier, sub-suppliers in order to ensure quality, shelf life, quantity, availability and other demands are met \n \n• Work closely with logistics providers and 3PL warehouse providers in order to ship and store hazmat products appropriately \n \n• Involved in development of supply chain web applications for internal use Manager, Computer Repair Technician, Technology Consultant University of Michigan Computer Showcase July 2009  –  August 2010  (1 year 2 months) • Instituted policy changes to order processing system allowing for more flexibility during special sales periods in order to meet greater demand \n \n• Enhanced inventory management by identifying and implementing methods to prevent stock outages through improved communication between sales associates and stock room employees \n \n• Trained and supervised sales associates and technology consultants on the specifications, features, and benefits of every product to ensure customer's technological needs were met resulting in greater customer satisfaction and reduced product return rates \n \n• Expedited order fulfillment by processing point of sale transactions and shipping orders allowing for significant reductions in customer wait time \n \n• Provided customers with computer software repair services and performed hardware repairs for systems with warranty coverage Manager, Computer Repair Technician, Technology Consultant University of Michigan Computer Showcase July 2009  –  August 2010  (1 year 2 months) • Instituted policy changes to order processing system allowing for more flexibility during special sales periods in order to meet greater demand \n \n• Enhanced inventory management by identifying and implementing methods to prevent stock outages through improved communication between sales associates and stock room employees \n \n• Trained and supervised sales associates and technology consultants on the specifications, features, and benefits of every product to ensure customer's technological needs were met resulting in greater customer satisfaction and reduced product return rates \n \n• Expedited order fulfillment by processing point of sale transactions and shipping orders allowing for significant reductions in customer wait time \n \n• Provided customers with computer software repair services and performed hardware repairs for systems with warranty coverage Student Coordinator, Student Manager, Consultant Academic Technology Center, Cornell University June 2004  –  May 2007  (3 years) • Achieved highest level student position in the IT department by providing exceptional technology consulting services on a consistent basis \n \n• Supervised student management team and trained consulting staff (~45 students) in time-sensitive project work involving course website creation and digital media production resulting in 100% of all deadlines being met \n \n• Provided consulting services to faculty members to determine hardware and software technological needs for delivery of course material \n \n• Assisted in purchasing decisions through budget management and product research \n \n• Provided on-site and remote technical support for online courses to ensure student and faculty satisfaction Student Coordinator, Student Manager, Consultant Academic Technology Center, Cornell University June 2004  –  May 2007  (3 years) • Achieved highest level student position in the IT department by providing exceptional technology consulting services on a consistent basis \n \n• Supervised student management team and trained consulting staff (~45 students) in time-sensitive project work involving course website creation and digital media production resulting in 100% of all deadlines being met \n \n• Provided consulting services to faculty members to determine hardware and software technological needs for delivery of course material \n \n• Assisted in purchasing decisions through budget management and product research \n \n• Provided on-site and remote technical support for online courses to ensure student and faculty satisfaction Languages Spanish Spanish Spanish Skills Supply Chain Management Supply Chain Logistics Procurement Inventory Management Process Improvement Project Management Data Analysis Logistics Management Materials Management Supply Chain... Skills  Supply Chain Management Supply Chain Logistics Procurement Inventory Management Process Improvement Project Management Data Analysis Logistics Management Materials Management Supply Chain... Supply Chain Management Supply Chain Logistics Procurement Inventory Management Process Improvement Project Management Data Analysis Logistics Management Materials Management Supply Chain... Supply Chain Management Supply Chain Logistics Procurement Inventory Management Process Improvement Project Management Data Analysis Logistics Management Materials Management Supply Chain... Education Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2010  – 2012 Area of Interest: Information Technology Management \nBroad Merit Scholarship Recipient Activities and Societies:  Graduate Supply Chain Association Member Cornell University BS,  Independent Major (Material Science & Engineering and Science & Technology Studies) 2003  – 2009 Learning Strategies Center Scholarship Recipient \nJohn McMullen Dean Scholarship Recipient \nCornell University Grant Recipient Activities and Societies:  Society of Hispanic Engineers ,  National Society of Collegiate Scholars Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2010  – 2012 Area of Interest: Information Technology Management \nBroad Merit Scholarship Recipient Activities and Societies:  Graduate Supply Chain Association Member Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2010  – 2012 Area of Interest: Information Technology Management \nBroad Merit Scholarship Recipient Activities and Societies:  Graduate Supply Chain Association Member Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2010  – 2012 Area of Interest: Information Technology Management \nBroad Merit Scholarship Recipient Activities and Societies:  Graduate Supply Chain Association Member Cornell University BS,  Independent Major (Material Science & Engineering and Science & Technology Studies) 2003  – 2009 Learning Strategies Center Scholarship Recipient \nJohn McMullen Dean Scholarship Recipient \nCornell University Grant Recipient Activities and Societies:  Society of Hispanic Engineers ,  National Society of Collegiate Scholars Cornell University BS,  Independent Major (Material Science & Engineering and Science & Technology Studies) 2003  – 2009 Learning Strategies Center Scholarship Recipient \nJohn McMullen Dean Scholarship Recipient \nCornell University Grant Recipient Activities and Societies:  Society of Hispanic Engineers ,  National Society of Collegiate Scholars Cornell University BS,  Independent Major (Material Science & Engineering and Science & Technology Studies) 2003  – 2009 Learning Strategies Center Scholarship Recipient \nJohn McMullen Dean Scholarship Recipient \nCornell University Grant Recipient Activities and Societies:  Society of Hispanic Engineers ,  National Society of Collegiate Scholars ", "Summary I am restorative. I love to take on a problem, crisis, or emergency and put it into an ideal state. I have a very strong sense of focus. I am driven to set goals that keep projects on schedule. I build consensus and support for ideas, projects and strategy. I enjoy spending time doing possibility thinking and exploring the \"what-ifs\" of life. I believe everyone has something to bring to the table.  \n \nI would love to get to know you and learn from your experience. Summary I am restorative. I love to take on a problem, crisis, or emergency and put it into an ideal state. I have a very strong sense of focus. I am driven to set goals that keep projects on schedule. I build consensus and support for ideas, projects and strategy. I enjoy spending time doing possibility thinking and exploring the \"what-ifs\" of life. I believe everyone has something to bring to the table.  \n \nI would love to get to know you and learn from your experience. I am restorative. I love to take on a problem, crisis, or emergency and put it into an ideal state. I have a very strong sense of focus. I am driven to set goals that keep projects on schedule. I build consensus and support for ideas, projects and strategy. I enjoy spending time doing possibility thinking and exploring the \"what-ifs\" of life. I believe everyone has something to bring to the table.  \n \nI would love to get to know you and learn from your experience. I am restorative. I love to take on a problem, crisis, or emergency and put it into an ideal state. I have a very strong sense of focus. I am driven to set goals that keep projects on schedule. I build consensus and support for ideas, projects and strategy. I enjoy spending time doing possibility thinking and exploring the \"what-ifs\" of life. I believe everyone has something to bring to the table.  \n \nI would love to get to know you and learn from your experience. Experience Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Hard Skills: In my current role I analyze current demand signals, trends in consumption, forecast inventory needs, and determine cost savings and value-add opportunities. In addition to these daily \"maintenance of business\" activities, I work on special projects supporting the fab to reduce machine down time. \n \nSoft Skills: Negotiation and Supplier Relationship Management. Maintain healthy relationships with both suppliers and customers, making sure their needs are addressed while maintaining Intel's goals as first priority. Build team morale and make sure our group culture is focused on excellence and is a great place to work.  \n \n\"Extra-curricular\": I work with a group of six other individuals to recognize team members for their hard work and exceptional contributions to our business units goals. This is done in the form of lunches, happy hours, and holiday parties. Additionally, we organize quarterly community service projects that allow the whole team to give back to the community in a meaningful way. MBA Candidate W.P. Carey School of Business August 2011  –  May 2013  (1 year 10 months) Tempe, AZ I specialized in Supply Chain and Financial Markets Management. I also worked as a teaching assistant in an undergraduate management consulting course. I helped students develop recommendations on special business projects for local businesses and for Target Corporation. I also critiqued the students presentation and speaking skills and provided constructive feedback to perfect their final presentations to these businesses. \n \nI was also a finalist in the Suma Cup Competition. This is a business strategy competition that analyzes a company facing current, real-world challenges. Intern Intel Corporation May 2012  –  August 2012  (4 months) Chandler, Arizona As an intern in the Global Sourcing and Procurement organization I worked within the business operations group to: \n1. Identify data gaps in the current emergency response website needed to effectively manage events affecting the supply chain. \n2. Collaborate with representatives from six other business groups to identify needed improvements in data availability and protocol implementation to the emergency response structure. \n3. Redesign the emergency response website and propose implementation of improvements to executive level staff. \n4. Research and compose a business recovery plan for the Global Sourcing and Procurement Organization, including appropriate response levels to critical impacts to the supply chain. Owner/Manager Golden Spoon April 2010  –  April 2012  (2 years 1 month) I run the day to day operations of Golden Spoon Frozen Yogurt in Orem, UT as well as planning strategy for its success and expansion in the Utah Valley area. Consultant/Account Specialist The RedX April 2009  –  June 2010  (1 year 3 months) I assisted real estate agents in implementing software strategies to grow their business. Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Hard Skills: In my current role I analyze current demand signals, trends in consumption, forecast inventory needs, and determine cost savings and value-add opportunities. In addition to these daily \"maintenance of business\" activities, I work on special projects supporting the fab to reduce machine down time. \n \nSoft Skills: Negotiation and Supplier Relationship Management. Maintain healthy relationships with both suppliers and customers, making sure their needs are addressed while maintaining Intel's goals as first priority. Build team morale and make sure our group culture is focused on excellence and is a great place to work.  \n \n\"Extra-curricular\": I work with a group of six other individuals to recognize team members for their hard work and exceptional contributions to our business units goals. This is done in the form of lunches, happy hours, and holiday parties. Additionally, we organize quarterly community service projects that allow the whole team to give back to the community in a meaningful way. Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Hard Skills: In my current role I analyze current demand signals, trends in consumption, forecast inventory needs, and determine cost savings and value-add opportunities. In addition to these daily \"maintenance of business\" activities, I work on special projects supporting the fab to reduce machine down time. \n \nSoft Skills: Negotiation and Supplier Relationship Management. Maintain healthy relationships with both suppliers and customers, making sure their needs are addressed while maintaining Intel's goals as first priority. Build team morale and make sure our group culture is focused on excellence and is a great place to work.  \n \n\"Extra-curricular\": I work with a group of six other individuals to recognize team members for their hard work and exceptional contributions to our business units goals. This is done in the form of lunches, happy hours, and holiday parties. Additionally, we organize quarterly community service projects that allow the whole team to give back to the community in a meaningful way. MBA Candidate W.P. Carey School of Business August 2011  –  May 2013  (1 year 10 months) Tempe, AZ I specialized in Supply Chain and Financial Markets Management. I also worked as a teaching assistant in an undergraduate management consulting course. I helped students develop recommendations on special business projects for local businesses and for Target Corporation. I also critiqued the students presentation and speaking skills and provided constructive feedback to perfect their final presentations to these businesses. \n \nI was also a finalist in the Suma Cup Competition. This is a business strategy competition that analyzes a company facing current, real-world challenges. MBA Candidate W.P. Carey School of Business August 2011  –  May 2013  (1 year 10 months) Tempe, AZ I specialized in Supply Chain and Financial Markets Management. I also worked as a teaching assistant in an undergraduate management consulting course. I helped students develop recommendations on special business projects for local businesses and for Target Corporation. I also critiqued the students presentation and speaking skills and provided constructive feedback to perfect their final presentations to these businesses. \n \nI was also a finalist in the Suma Cup Competition. This is a business strategy competition that analyzes a company facing current, real-world challenges. Intern Intel Corporation May 2012  –  August 2012  (4 months) Chandler, Arizona As an intern in the Global Sourcing and Procurement organization I worked within the business operations group to: \n1. Identify data gaps in the current emergency response website needed to effectively manage events affecting the supply chain. \n2. Collaborate with representatives from six other business groups to identify needed improvements in data availability and protocol implementation to the emergency response structure. \n3. Redesign the emergency response website and propose implementation of improvements to executive level staff. \n4. Research and compose a business recovery plan for the Global Sourcing and Procurement Organization, including appropriate response levels to critical impacts to the supply chain. Intern Intel Corporation May 2012  –  August 2012  (4 months) Chandler, Arizona As an intern in the Global Sourcing and Procurement organization I worked within the business operations group to: \n1. Identify data gaps in the current emergency response website needed to effectively manage events affecting the supply chain. \n2. Collaborate with representatives from six other business groups to identify needed improvements in data availability and protocol implementation to the emergency response structure. \n3. Redesign the emergency response website and propose implementation of improvements to executive level staff. \n4. Research and compose a business recovery plan for the Global Sourcing and Procurement Organization, including appropriate response levels to critical impacts to the supply chain. Owner/Manager Golden Spoon April 2010  –  April 2012  (2 years 1 month) I run the day to day operations of Golden Spoon Frozen Yogurt in Orem, UT as well as planning strategy for its success and expansion in the Utah Valley area. Owner/Manager Golden Spoon April 2010  –  April 2012  (2 years 1 month) I run the day to day operations of Golden Spoon Frozen Yogurt in Orem, UT as well as planning strategy for its success and expansion in the Utah Valley area. Consultant/Account Specialist The RedX April 2009  –  June 2010  (1 year 3 months) I assisted real estate agents in implementing software strategies to grow their business. Consultant/Account Specialist The RedX April 2009  –  June 2010  (1 year 3 months) I assisted real estate agents in implementing software strategies to grow their business. Languages Portuguese Portuguese Portuguese Skills Cross-functional Team... Process Improvement Project Management Management Consulting Analysis Strategy Strategic Planning Management Entrepreneurship Product Management Supply Chain Business Strategy Negotiation Supply Chain Management Procurement Skills  Cross-functional Team... Process Improvement Project Management Management Consulting Analysis Strategy Strategic Planning Management Entrepreneurship Product Management Supply Chain Business Strategy Negotiation Supply Chain Management Procurement Cross-functional Team... Process Improvement Project Management Management Consulting Analysis Strategy Strategic Planning Management Entrepreneurship Product Management Supply Chain Business Strategy Negotiation Supply Chain Management Procurement Cross-functional Team... Process Improvement Project Management Management Consulting Analysis Strategy Strategic Planning Management Entrepreneurship Product Management Supply Chain Business Strategy Negotiation Supply Chain Management Procurement Education Arizona State University - W. P. Carey School of Business MBA,  Supply Chain and Financial Markets Management 2011  – 2013 Activities and Societies:  Graduate Supply Chain Management Association\nFinance Club W. P. Carey School of Business at Arizona State University Master of Business Administration,  Supply Chain Management 2011  – 2013 Brigham Young University Bachelor,  Arts 2006  – 2010 American Council on the Teaching of Foreign Languages Brigham Young University Bachelor of Arts (B.A.),  Portuguese, Business 2003  – 2010 Arizona State University - W. P. Carey School of Business MBA,  Supply Chain and Financial Markets Management 2011  – 2013 Activities and Societies:  Graduate Supply Chain Management Association\nFinance Club Arizona State University - W. P. Carey School of Business MBA,  Supply Chain and Financial Markets Management 2011  – 2013 Activities and Societies:  Graduate Supply Chain Management Association\nFinance Club Arizona State University - W. P. Carey School of Business MBA,  Supply Chain and Financial Markets Management 2011  – 2013 Activities and Societies:  Graduate Supply Chain Management Association\nFinance Club W. P. Carey School of Business at Arizona State University Master of Business Administration,  Supply Chain Management 2011  – 2013 W. P. Carey School of Business at Arizona State University Master of Business Administration,  Supply Chain Management 2011  – 2013 W. P. Carey School of Business at Arizona State University Master of Business Administration,  Supply Chain Management 2011  – 2013 Brigham Young University Bachelor,  Arts 2006  – 2010 American Council on the Teaching of Foreign Languages Brigham Young University Bachelor,  Arts 2006  – 2010 American Council on the Teaching of Foreign Languages Brigham Young University Bachelor,  Arts 2006  – 2010 American Council on the Teaching of Foreign Languages Brigham Young University Bachelor of Arts (B.A.),  Portuguese, Business 2003  – 2010 Brigham Young University Bachelor of Arts (B.A.),  Portuguese, Business 2003  – 2010 Brigham Young University Bachelor of Arts (B.A.),  Portuguese, Business 2003  – 2010 ", "Experience Supply Chain Analyst Intel Corporation Supply Chain Analyst Intel Corporation June 1995  –  May 2015  (20 years) Kulim, Penang, Malaysia Supply Chain Analyst Intel Corporation Supply Chain Analyst Intel Corporation Supply Chain Analyst Intel Corporation June 1995  –  May 2015  (20 years) Kulim, Penang, Malaysia Supply Chain Analyst Intel Corporation June 1995  –  May 2015  (20 years) Kulim, Penang, Malaysia Languages English English English Skills Supply Chain Cross-functional Team... Supply Chain Management Manufacturing Lean Manufacturing Six Sigma Process Improvement Continuous Improvement Supply Management MRP Logistics Skills  Supply Chain Cross-functional Team... Supply Chain Management Manufacturing Lean Manufacturing Six Sigma Process Improvement Continuous Improvement Supply Management MRP Logistics Supply Chain Cross-functional Team... Supply Chain Management Manufacturing Lean Manufacturing Six Sigma Process Improvement Continuous Improvement Supply Management MRP Logistics Supply Chain Cross-functional Team... Supply Chain Management Manufacturing Lean Manufacturing Six Sigma Process Improvement Continuous Improvement Supply Management MRP Logistics ", "Summary I have recently graduated from Penn State University from the Smeal College of Business with a B.S. in Supply Chain Management. I am currently working at Intel Corporation as part of the Customer Fulfillment, Planning, and Logistics group in the Supply Chain Rotation Program. \n \nI am passionate about supply chain because I believe in increasing the customer value of products and services through efficient manufacturing and logistics solutions. Summary I have recently graduated from Penn State University from the Smeal College of Business with a B.S. in Supply Chain Management. I am currently working at Intel Corporation as part of the Customer Fulfillment, Planning, and Logistics group in the Supply Chain Rotation Program. \n \nI am passionate about supply chain because I believe in increasing the customer value of products and services through efficient manufacturing and logistics solutions. I have recently graduated from Penn State University from the Smeal College of Business with a B.S. in Supply Chain Management. I am currently working at Intel Corporation as part of the Customer Fulfillment, Planning, and Logistics group in the Supply Chain Rotation Program. \n \nI am passionate about supply chain because I believe in increasing the customer value of products and services through efficient manufacturing and logistics solutions. I have recently graduated from Penn State University from the Smeal College of Business with a B.S. in Supply Chain Management. I am currently working at Intel Corporation as part of the Customer Fulfillment, Planning, and Logistics group in the Supply Chain Rotation Program. \n \nI am passionate about supply chain because I believe in increasing the customer value of products and services through efficient manufacturing and logistics solutions. Experience Supply Chain Analyst Intel Corporation May 2015  – Present (4 months) Hillsboro, Oregon CPLG Supply Chain Rotation.  \nProduct data management for systems & boards. Supply Chain Quality Engineer Intern in Customer Planning and Logistics Group Intel Corporation May 2014  –  August 2014  (4 months) Phoenix, Arizona Area - Created framework for initial engagements with new businesses' Supply Chain \n- Contributed to benchmark team in understanding supply chain requirements for new business units in areas such as Perfect Order, CDD, and other key metrics External Manufacturing Co-Op McNeil Consumer Healthcare June 2013  –  January 2014  (8 months) Greater Philadelphia Area Active involvement in all parts of Over-The-Counter External Manufacturing pillars in heavily regulated Consent Decree Environment- Plan, Source, Make, Deliver through weekly metric meetings.  \n \nSupported process improvement activities at External Manufacturing sites to increase manufacturing reliability to provide On Time In Full orders to customers.  \n \nImplemented streamlining at External Manufacturing sites on a cross-functional team for a more robust management of roles, responsibilities, and accountability of raw material suppliers in network.  \nFacilitated company culture leadership on Credo Team, including team building activities and Enrichment Day.  \n \nServed as Social Media Chairperson on Intern & Co-Op Association Board through weekly newsletters facilitating increased camaraderie and networking among students at McNeil. Implemented bylaws and Roberts Rules of Order among board members.  \n \nRecipient of Encore Award: Gold Level for Results that have a measurable impact on a department or division. Ritual Chairman Zeta Tau Alpha January 2013  –  June 2013  (6 months) University Park, PA - Direct sorority rituals throughout the year \n- Instruct Post Initiate Education course for new members and manage inventory of ritual supplies \n- Serve as leader of member enrichment committee on programming council and serve on Executive Board overseeing general chapter business Intern 401(k) Advisors June 2012  –  August 2012  (3 months) Aliso Viejo, CA Worked collaboratively with 401(k) Advisors and Retirement Plan Advisory Group in all departments. Completed Investment Due Diligence reports, attended client meetings, and provided administrative assistance. Researched and presented on financial and retirement plan topics. Mergers & Acquisitions Intern Harvey & Company LLC May 2012  –  June 2012  (2 months) Greater Los Angeles Area Supply Chain Analyst Intel Corporation May 2015  – Present (4 months) Hillsboro, Oregon CPLG Supply Chain Rotation.  \nProduct data management for systems & boards. Supply Chain Analyst Intel Corporation May 2015  – Present (4 months) Hillsboro, Oregon CPLG Supply Chain Rotation.  \nProduct data management for systems & boards. Supply Chain Quality Engineer Intern in Customer Planning and Logistics Group Intel Corporation May 2014  –  August 2014  (4 months) Phoenix, Arizona Area - Created framework for initial engagements with new businesses' Supply Chain \n- Contributed to benchmark team in understanding supply chain requirements for new business units in areas such as Perfect Order, CDD, and other key metrics Supply Chain Quality Engineer Intern in Customer Planning and Logistics Group Intel Corporation May 2014  –  August 2014  (4 months) Phoenix, Arizona Area - Created framework for initial engagements with new businesses' Supply Chain \n- Contributed to benchmark team in understanding supply chain requirements for new business units in areas such as Perfect Order, CDD, and other key metrics External Manufacturing Co-Op McNeil Consumer Healthcare June 2013  –  January 2014  (8 months) Greater Philadelphia Area Active involvement in all parts of Over-The-Counter External Manufacturing pillars in heavily regulated Consent Decree Environment- Plan, Source, Make, Deliver through weekly metric meetings.  \n \nSupported process improvement activities at External Manufacturing sites to increase manufacturing reliability to provide On Time In Full orders to customers.  \n \nImplemented streamlining at External Manufacturing sites on a cross-functional team for a more robust management of roles, responsibilities, and accountability of raw material suppliers in network.  \nFacilitated company culture leadership on Credo Team, including team building activities and Enrichment Day.  \n \nServed as Social Media Chairperson on Intern & Co-Op Association Board through weekly newsletters facilitating increased camaraderie and networking among students at McNeil. Implemented bylaws and Roberts Rules of Order among board members.  \n \nRecipient of Encore Award: Gold Level for Results that have a measurable impact on a department or division. External Manufacturing Co-Op McNeil Consumer Healthcare June 2013  –  January 2014  (8 months) Greater Philadelphia Area Active involvement in all parts of Over-The-Counter External Manufacturing pillars in heavily regulated Consent Decree Environment- Plan, Source, Make, Deliver through weekly metric meetings.  \n \nSupported process improvement activities at External Manufacturing sites to increase manufacturing reliability to provide On Time In Full orders to customers.  \n \nImplemented streamlining at External Manufacturing sites on a cross-functional team for a more robust management of roles, responsibilities, and accountability of raw material suppliers in network.  \nFacilitated company culture leadership on Credo Team, including team building activities and Enrichment Day.  \n \nServed as Social Media Chairperson on Intern & Co-Op Association Board through weekly newsletters facilitating increased camaraderie and networking among students at McNeil. Implemented bylaws and Roberts Rules of Order among board members.  \n \nRecipient of Encore Award: Gold Level for Results that have a measurable impact on a department or division. Ritual Chairman Zeta Tau Alpha January 2013  –  June 2013  (6 months) University Park, PA - Direct sorority rituals throughout the year \n- Instruct Post Initiate Education course for new members and manage inventory of ritual supplies \n- Serve as leader of member enrichment committee on programming council and serve on Executive Board overseeing general chapter business Ritual Chairman Zeta Tau Alpha January 2013  –  June 2013  (6 months) University Park, PA - Direct sorority rituals throughout the year \n- Instruct Post Initiate Education course for new members and manage inventory of ritual supplies \n- Serve as leader of member enrichment committee on programming council and serve on Executive Board overseeing general chapter business Intern 401(k) Advisors June 2012  –  August 2012  (3 months) Aliso Viejo, CA Worked collaboratively with 401(k) Advisors and Retirement Plan Advisory Group in all departments. Completed Investment Due Diligence reports, attended client meetings, and provided administrative assistance. Researched and presented on financial and retirement plan topics. Intern 401(k) Advisors June 2012  –  August 2012  (3 months) Aliso Viejo, CA Worked collaboratively with 401(k) Advisors and Retirement Plan Advisory Group in all departments. Completed Investment Due Diligence reports, attended client meetings, and provided administrative assistance. Researched and presented on financial and retirement plan topics. Mergers & Acquisitions Intern Harvey & Company LLC May 2012  –  June 2012  (2 months) Greater Los Angeles Area Mergers & Acquisitions Intern Harvey & Company LLC May 2012  –  June 2012  (2 months) Greater Los Angeles Area Languages English Native or bilingual proficiency Spanish Elementary proficiency Italian Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Italian Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Italian Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills PowerPoint Retirement Planning Microsoft Office Mergers & Acquisitions Finance Communication Public Speaking Presentations Microsoft Excel Team Leadership Microsoft Word Process Improvement Supply Chain Management Time Management Management Leadership Cross-functional Team... See 2+     See less Skills  PowerPoint Retirement Planning Microsoft Office Mergers & Acquisitions Finance Communication Public Speaking Presentations Microsoft Excel Team Leadership Microsoft Word Process Improvement Supply Chain Management Time Management Management Leadership Cross-functional Team... See 2+     See less PowerPoint Retirement Planning Microsoft Office Mergers & Acquisitions Finance Communication Public Speaking Presentations Microsoft Excel Team Leadership Microsoft Word Process Improvement Supply Chain Management Time Management Management Leadership Cross-functional Team... See 2+     See less PowerPoint Retirement Planning Microsoft Office Mergers & Acquisitions Finance Communication Public Speaking Presentations Microsoft Excel Team Leadership Microsoft Word Process Improvement Supply Chain Management Time Management Management Leadership Cross-functional Team... See 2+     See less Education Penn State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management , 3.71 2011  – 2015 Activities and Societies:  Deans List ,  Zeta Tau Alpha Sorority- Gamma Epsilon Chapter ,  Women In Business Club ,  THON Corona del Mar High School 2007  – 2011 Activities and Societies:  Youth and Government ,  Cheerleading IES Abroad Rome N.A,  International Business 2014 Study Abroad in Rome, Italy for five months with an emphasis on International Business and International Relations. Gained conversational Italian skills, a broad understanding of social, political and economical environment of Europe, the United States, and the Mediterranean, and increased knowledge of recent European history. Increased soft skills such as communication with a language barrier, presentations in both a classroom and field study setting, and developing a more robust global point of view. Extensive networking and cultural exchange with both American and Italian students and professors from various universities. Penn State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management , 3.71 2011  – 2015 Activities and Societies:  Deans List ,  Zeta Tau Alpha Sorority- Gamma Epsilon Chapter ,  Women In Business Club ,  THON Penn State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management , 3.71 2011  – 2015 Activities and Societies:  Deans List ,  Zeta Tau Alpha Sorority- Gamma Epsilon Chapter ,  Women In Business Club ,  THON Penn State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management , 3.71 2011  – 2015 Activities and Societies:  Deans List ,  Zeta Tau Alpha Sorority- Gamma Epsilon Chapter ,  Women In Business Club ,  THON Corona del Mar High School 2007  – 2011 Activities and Societies:  Youth and Government ,  Cheerleading Corona del Mar High School 2007  – 2011 Activities and Societies:  Youth and Government ,  Cheerleading Corona del Mar High School 2007  – 2011 Activities and Societies:  Youth and Government ,  Cheerleading IES Abroad Rome N.A,  International Business 2014 Study Abroad in Rome, Italy for five months with an emphasis on International Business and International Relations. Gained conversational Italian skills, a broad understanding of social, political and economical environment of Europe, the United States, and the Mediterranean, and increased knowledge of recent European history. Increased soft skills such as communication with a language barrier, presentations in both a classroom and field study setting, and developing a more robust global point of view. Extensive networking and cultural exchange with both American and Italian students and professors from various universities. IES Abroad Rome N.A,  International Business 2014 Study Abroad in Rome, Italy for five months with an emphasis on International Business and International Relations. Gained conversational Italian skills, a broad understanding of social, political and economical environment of Europe, the United States, and the Mediterranean, and increased knowledge of recent European history. Increased soft skills such as communication with a language barrier, presentations in both a classroom and field study setting, and developing a more robust global point of view. Extensive networking and cultural exchange with both American and Italian students and professors from various universities. IES Abroad Rome N.A,  International Business 2014 Study Abroad in Rome, Italy for five months with an emphasis on International Business and International Relations. Gained conversational Italian skills, a broad understanding of social, political and economical environment of Europe, the United States, and the Mediterranean, and increased knowledge of recent European history. Increased soft skills such as communication with a language barrier, presentations in both a classroom and field study setting, and developing a more robust global point of view. Extensive networking and cultural exchange with both American and Italian students and professors from various universities. ", "Summary Currently working as demand capacity planner with experience in SAP, Business Objects & Microsoft excel. \n \nOther experience includes order processing, shipment arrangment & quotation processing . Summary Currently working as demand capacity planner with experience in SAP, Business Objects & Microsoft excel. \n \nOther experience includes order processing, shipment arrangment & quotation processing . Currently working as demand capacity planner with experience in SAP, Business Objects & Microsoft excel. \n \nOther experience includes order processing, shipment arrangment & quotation processing . Currently working as demand capacity planner with experience in SAP, Business Objects & Microsoft excel. \n \nOther experience includes order processing, shipment arrangment & quotation processing . Experience Supply Chain Analyst Intel Corporation 2013  – Present (2 years) Singapore Engineer Intel January 2010  –  December 2012  (3 years) Singapore Technical Specialist Infineon Technologies January 2007  –  June 2011  (4 years 6 months) Supply Chain Analyst Intel Corporation 2013  – Present (2 years) Singapore Supply Chain Analyst Intel Corporation 2013  – Present (2 years) Singapore Engineer Intel January 2010  –  December 2012  (3 years) Singapore Engineer Intel January 2010  –  December 2012  (3 years) Singapore Technical Specialist Infineon Technologies January 2007  –  June 2011  (4 years 6 months) Technical Specialist Infineon Technologies January 2007  –  June 2011  (4 years 6 months) Languages English Malay English Malay English Malay Skills SAP Excel Pivot Microsoft Excel Business Objects Forecasting Supply Chain Logistics Quality Assurance Skills  SAP Excel Pivot Microsoft Excel Business Objects Forecasting Supply Chain Logistics Quality Assurance SAP Excel Pivot Microsoft Excel Business Objects Forecasting Supply Chain Logistics Quality Assurance SAP Excel Pivot Microsoft Excel Business Objects Forecasting Supply Chain Logistics Quality Assurance Honors & Awards The Lee Kuan Yew Scholarship to Encourage (LKY STEP). 2001 Awarded to 10 students with COM who has shown achievements in both studies and extra curricular activities. Tay Eng Soon Scholarship 2001 Awarded to six recipients who has received the LKY STEP. Certificate of Merit for Industrial Technician Certificate ITE East Tampines 2001 Awarded to students who have successfully made it to the top 5% in their cohort. 4PM Bestari Award, ITE East Tampines 4PM 2001 Awarded by Malay Volunteer service, 4PM, to top Malay students in ITE Colours Award by Singapore Sports Council Singapore Sports Council 2001 In recognition for participation in Netball The Lee Kuan Yew Scholarship to Encourage (LKY STEP). 2001 Awarded to 10 students with COM who has shown achievements in both studies and extra curricular activities. The Lee Kuan Yew Scholarship to Encourage (LKY STEP). 2001 Awarded to 10 students with COM who has shown achievements in both studies and extra curricular activities. The Lee Kuan Yew Scholarship to Encourage (LKY STEP). 2001 Awarded to 10 students with COM who has shown achievements in both studies and extra curricular activities. Tay Eng Soon Scholarship 2001 Awarded to six recipients who has received the LKY STEP. Tay Eng Soon Scholarship 2001 Awarded to six recipients who has received the LKY STEP. Tay Eng Soon Scholarship 2001 Awarded to six recipients who has received the LKY STEP. Certificate of Merit for Industrial Technician Certificate ITE East Tampines 2001 Awarded to students who have successfully made it to the top 5% in their cohort. Certificate of Merit for Industrial Technician Certificate ITE East Tampines 2001 Awarded to students who have successfully made it to the top 5% in their cohort. Certificate of Merit for Industrial Technician Certificate ITE East Tampines 2001 Awarded to students who have successfully made it to the top 5% in their cohort. 4PM Bestari Award, ITE East Tampines 4PM 2001 Awarded by Malay Volunteer service, 4PM, to top Malay students in ITE 4PM Bestari Award, ITE East Tampines 4PM 2001 Awarded by Malay Volunteer service, 4PM, to top Malay students in ITE 4PM Bestari Award, ITE East Tampines 4PM 2001 Awarded by Malay Volunteer service, 4PM, to top Malay students in ITE Colours Award by Singapore Sports Council Singapore Sports Council 2001 In recognition for participation in Netball Colours Award by Singapore Sports Council Singapore Sports Council 2001 In recognition for participation in Netball Colours Award by Singapore Sports Council Singapore Sports Council 2001 In recognition for participation in Netball ", "Experience Supply Chain Analyst Intel Corporation Supply Chain Analyst Intel Corporation Supply Chain Analyst Intel Corporation ", "Experience Supply Chain Analyst Intel Corporation March 2013  – Present (2 years 6 months) Business Supply Planner Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA -Manage Box Product globally to maximize box factory fulfillment of customer orders via proactive planning and inventory strategies, product life cycle management and execution to business strategies that support channel growth. \n \n-Owner of lean initiative to automate a data verification process to eliminate wasted time SAP Co-op Church & Dwight January 2011  –  July 2011  (7 months) Princeton, NJ Part of the Master Data Management team on a large scale project to upgrade Church & Dwight's ERP system to SAP ECC 6.0 in five countries \n \nProficient in the use of SAP ECC 6.0, SAP Master Data Management, HP Quality Center, Manugistics, Microsoft Office software and have working knowledge of relational databases \n \nCapable of managing, maintaining, and analyzing extremely large amounts of data \n \nWorked with co-packers and supply planners to help create distribution timelines and schedules for Church & Dwight products Supply Chain Analyst Intel Corporation March 2013  – Present (2 years 6 months) Supply Chain Analyst Intel Corporation March 2013  – Present (2 years 6 months) Business Supply Planner Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA -Manage Box Product globally to maximize box factory fulfillment of customer orders via proactive planning and inventory strategies, product life cycle management and execution to business strategies that support channel growth. \n \n-Owner of lean initiative to automate a data verification process to eliminate wasted time Business Supply Planner Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA -Manage Box Product globally to maximize box factory fulfillment of customer orders via proactive planning and inventory strategies, product life cycle management and execution to business strategies that support channel growth. \n \n-Owner of lean initiative to automate a data verification process to eliminate wasted time SAP Co-op Church & Dwight January 2011  –  July 2011  (7 months) Princeton, NJ Part of the Master Data Management team on a large scale project to upgrade Church & Dwight's ERP system to SAP ECC 6.0 in five countries \n \nProficient in the use of SAP ECC 6.0, SAP Master Data Management, HP Quality Center, Manugistics, Microsoft Office software and have working knowledge of relational databases \n \nCapable of managing, maintaining, and analyzing extremely large amounts of data \n \nWorked with co-packers and supply planners to help create distribution timelines and schedules for Church & Dwight products SAP Co-op Church & Dwight January 2011  –  July 2011  (7 months) Princeton, NJ Part of the Master Data Management team on a large scale project to upgrade Church & Dwight's ERP system to SAP ECC 6.0 in five countries \n \nProficient in the use of SAP ECC 6.0, SAP Master Data Management, HP Quality Center, Manugistics, Microsoft Office software and have working knowledge of relational databases \n \nCapable of managing, maintaining, and analyzing extremely large amounts of data \n \nWorked with co-packers and supply planners to help create distribution timelines and schedules for Church & Dwight products Skills Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Skills  Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Education Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Copenhagen Business School Minor,  International Business 2010  – 2010 Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Copenhagen Business School Minor,  International Business 2010  – 2010 Copenhagen Business School Minor,  International Business 2010  – 2010 Copenhagen Business School Minor,  International Business 2010  – 2010 ", "Experience Supply Chain Analyst Intel Corporation November 2013  – Present (1 year 10 months) Chandler, AZ Supply Demand Manager Intel Corporation April 2007  –  November 2013  (6 years 8 months) Divisional Planner Intel Corporation January 2002  –  April 2007  (5 years 4 months) Statistician Intel Corp June 2000  –  January 2002  (1 year 8 months) Supply Chain Analyst Intel Corporation November 2013  – Present (1 year 10 months) Chandler, AZ Supply Chain Analyst Intel Corporation November 2013  – Present (1 year 10 months) Chandler, AZ Supply Demand Manager Intel Corporation April 2007  –  November 2013  (6 years 8 months) Supply Demand Manager Intel Corporation April 2007  –  November 2013  (6 years 8 months) Divisional Planner Intel Corporation January 2002  –  April 2007  (5 years 4 months) Divisional Planner Intel Corporation January 2002  –  April 2007  (5 years 4 months) Statistician Intel Corp June 2000  –  January 2002  (1 year 8 months) Statistician Intel Corp June 2000  –  January 2002  (1 year 8 months) Skills Semiconductors Cross-functional Team... Program Management Data Mining Analytics Process Improvement Data Analysis Manufacturing Supply Chain Management Product Management Process Engineering Supply Chain Forecasting Skills  Semiconductors Cross-functional Team... Program Management Data Mining Analytics Process Improvement Data Analysis Manufacturing Supply Chain Management Product Management Process Engineering Supply Chain Forecasting Semiconductors Cross-functional Team... Program Management Data Mining Analytics Process Improvement Data Analysis Manufacturing Supply Chain Management Product Management Process Engineering Supply Chain Forecasting Semiconductors Cross-functional Team... Program Management Data Mining Analytics Process Improvement Data Analysis Manufacturing Supply Chain Management Product Management Process Engineering Supply Chain Forecasting Education Northern Arizona University M.A.,  Mathematics with emphasis in Statistics 1998  – 2000 Northern Arizona University B.A.,  Math 1994  – 1998 Activities and Societies:  Northern Lights ,  SPURS Northern Arizona University M.A.,  Mathematics with emphasis in Statistics 1998  – 2000 Northern Arizona University M.A.,  Mathematics with emphasis in Statistics 1998  – 2000 Northern Arizona University M.A.,  Mathematics with emphasis in Statistics 1998  – 2000 Northern Arizona University B.A.,  Math 1994  – 1998 Activities and Societies:  Northern Lights ,  SPURS Northern Arizona University B.A.,  Math 1994  – 1998 Activities and Societies:  Northern Lights ,  SPURS Northern Arizona University B.A.,  Math 1994  – 1998 Activities and Societies:  Northern Lights ,  SPURS ", "Summary Specialties:CRM Competent \nLatin American Culture \nEducation System \nRetail Banking Summary Specialties:CRM Competent \nLatin American Culture \nEducation System \nRetail Banking Specialties:CRM Competent \nLatin American Culture \nEducation System \nRetail Banking Specialties:CRM Competent \nLatin American Culture \nEducation System \nRetail Banking Experience Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Chandler, Arizona Work as an indirect materials buyer and the indirect strategic buyer lead for a group of 10 buyers. Manage relationships with over 60 key suppliers for Intel's research and development group. Develop best known methods (BKMs) for entire materials buyer group improving processes and establishing benchmarks. Lead various meetings involving key stakeholders and manage relationships between finance, engineering, and suppliers. Sourcing/Supply Chain Graduate Intern Intel Corporation June 2012  –  August 2012  (3 months) Phoenix, Arizona Area -Developed a strategy for managing indirect supplier tail spend within Corporate Strategic Procurement (CSP) through collaboration with various verticals across the organization and benchmarking BKMs with similar firms in the industry.  \n-Proposed recommendations that mitigated both unnecessary cost and risk associated with supplier adds and non-preferred supplier spend. Project Manager 5168 Ventures January 2012  –  March 2012  (3 months) Columbus, Ohio Area and Sao Paulo, Brazil -Led a team to develop a business plan for implementing an e-learning platform for technical trades in Brazil \n-Benchmarked BKMs from successful technical e-learning programs throughout the world \n-Created a marketing strategy for rolling out the program with various checkpoints and measures Project Manager Fisher Professional Services September 2011  –  December 2011  (4 months) Columbus, Ohio Area -Managed a consulting team on a project for JP Morgan Chase regarding their internal consulting group. \n-Analyzed leading internal consulting groups across various industries to compile best practices for JPMC. \n-Evaluated industry best practices and determined bottom-line savings for firm of over 7.8 million dollars over 10 years. Consultant Bear Consulting January 2011  –  August 2011  (8 months) Charlotte, North Carolina Area Chief Supply \n \n•Lead team to liquidate $1.6 million worth of inventory \n•Establish a sustainable system of liquidating inventory and reducing overstock from 40% to 10% \n•Contact previous and potential buyers of merchandise \n \nOptical Experts Manufacturing (Oem) \n \n•Participated on a group launching Performance Labor Management, a subsidiary division of Oem \n•Created a system showing true value of labor hours for products produced \n•Evaluated trends in data collected and proposed solutions resulting in 17% improved efficiency Classroom Spanish Teacher Kennedy Charter Public School August 2007  –  January 2009  (1 year 6 months) Charlotte, North Carolina Area •Taught Spanish at a school chartered for foster children and previously expelled students  \n•Led after-school tutoring and career goal-setting sessions for students in all school subjects  \n•Mentored incoming teachers, including experienced and first year teachers \n•Taught successful methods of discipline and strategies for engaging students Classroom Spanish Teacher Cambridge Public Schools August 2004  –  July 2007  (3 years) Cambridge, Massachusetts •Taught Spanish conversational and writing skills to students at multiple levels  \n•Created and implemented new program and curriculum for native Spanish-speakers  \n•Served on a committee which created citywide curriculum for Spanish on all levels \n \nTrack and Field Coach\t \n•Coached high jump, long jump, triple jump, hurdles, spirits, and relays. Officiated at track meets \n•Coached 11 different athletes to state championship and helped lead team to win three conference championships Personal Banking Representative Sovereign Bank September 2002  –  August 2004  (2 years) Cranston, Rhode Island and Needham, Massachusetts •First in monthly product sales for the region eight times averaging 2.6 products per interaction \n•Trained incoming retail bankers on banking operations, sales techniques, and regulation compliance \n•Serviced individual and business Spanish- and English-speaking clients \n•Updated and maintained accounts, processed loans, set up new accounts, and completed wire transfers Missionary Church of Jesus Christ of Latter-day Saints August 1998  –  August 2000  (2 years 1 month) Supervised groups of up to eighteen missionaries by monitoring progress, teaching effective communication skills and fostering involvement in community among supervisees. Organized and carried out community service projects such as building homes, working on farms, and teaching English. Presided over a congregation, and aided local religious leaders in strengthening their congregations (200 to 300 people) by attending planning meetings advising effective strategies. Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Chandler, Arizona Work as an indirect materials buyer and the indirect strategic buyer lead for a group of 10 buyers. Manage relationships with over 60 key suppliers for Intel's research and development group. Develop best known methods (BKMs) for entire materials buyer group improving processes and establishing benchmarks. Lead various meetings involving key stakeholders and manage relationships between finance, engineering, and suppliers. Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Chandler, Arizona Work as an indirect materials buyer and the indirect strategic buyer lead for a group of 10 buyers. Manage relationships with over 60 key suppliers for Intel's research and development group. Develop best known methods (BKMs) for entire materials buyer group improving processes and establishing benchmarks. Lead various meetings involving key stakeholders and manage relationships between finance, engineering, and suppliers. Sourcing/Supply Chain Graduate Intern Intel Corporation June 2012  –  August 2012  (3 months) Phoenix, Arizona Area -Developed a strategy for managing indirect supplier tail spend within Corporate Strategic Procurement (CSP) through collaboration with various verticals across the organization and benchmarking BKMs with similar firms in the industry.  \n-Proposed recommendations that mitigated both unnecessary cost and risk associated with supplier adds and non-preferred supplier spend. Sourcing/Supply Chain Graduate Intern Intel Corporation June 2012  –  August 2012  (3 months) Phoenix, Arizona Area -Developed a strategy for managing indirect supplier tail spend within Corporate Strategic Procurement (CSP) through collaboration with various verticals across the organization and benchmarking BKMs with similar firms in the industry.  \n-Proposed recommendations that mitigated both unnecessary cost and risk associated with supplier adds and non-preferred supplier spend. Project Manager 5168 Ventures January 2012  –  March 2012  (3 months) Columbus, Ohio Area and Sao Paulo, Brazil -Led a team to develop a business plan for implementing an e-learning platform for technical trades in Brazil \n-Benchmarked BKMs from successful technical e-learning programs throughout the world \n-Created a marketing strategy for rolling out the program with various checkpoints and measures Project Manager 5168 Ventures January 2012  –  March 2012  (3 months) Columbus, Ohio Area and Sao Paulo, Brazil -Led a team to develop a business plan for implementing an e-learning platform for technical trades in Brazil \n-Benchmarked BKMs from successful technical e-learning programs throughout the world \n-Created a marketing strategy for rolling out the program with various checkpoints and measures Project Manager Fisher Professional Services September 2011  –  December 2011  (4 months) Columbus, Ohio Area -Managed a consulting team on a project for JP Morgan Chase regarding their internal consulting group. \n-Analyzed leading internal consulting groups across various industries to compile best practices for JPMC. \n-Evaluated industry best practices and determined bottom-line savings for firm of over 7.8 million dollars over 10 years. Project Manager Fisher Professional Services September 2011  –  December 2011  (4 months) Columbus, Ohio Area -Managed a consulting team on a project for JP Morgan Chase regarding their internal consulting group. \n-Analyzed leading internal consulting groups across various industries to compile best practices for JPMC. \n-Evaluated industry best practices and determined bottom-line savings for firm of over 7.8 million dollars over 10 years. Consultant Bear Consulting January 2011  –  August 2011  (8 months) Charlotte, North Carolina Area Chief Supply \n \n•Lead team to liquidate $1.6 million worth of inventory \n•Establish a sustainable system of liquidating inventory and reducing overstock from 40% to 10% \n•Contact previous and potential buyers of merchandise \n \nOptical Experts Manufacturing (Oem) \n \n•Participated on a group launching Performance Labor Management, a subsidiary division of Oem \n•Created a system showing true value of labor hours for products produced \n•Evaluated trends in data collected and proposed solutions resulting in 17% improved efficiency Consultant Bear Consulting January 2011  –  August 2011  (8 months) Charlotte, North Carolina Area Chief Supply \n \n•Lead team to liquidate $1.6 million worth of inventory \n•Establish a sustainable system of liquidating inventory and reducing overstock from 40% to 10% \n•Contact previous and potential buyers of merchandise \n \nOptical Experts Manufacturing (Oem) \n \n•Participated on a group launching Performance Labor Management, a subsidiary division of Oem \n•Created a system showing true value of labor hours for products produced \n•Evaluated trends in data collected and proposed solutions resulting in 17% improved efficiency Classroom Spanish Teacher Kennedy Charter Public School August 2007  –  January 2009  (1 year 6 months) Charlotte, North Carolina Area •Taught Spanish at a school chartered for foster children and previously expelled students  \n•Led after-school tutoring and career goal-setting sessions for students in all school subjects  \n•Mentored incoming teachers, including experienced and first year teachers \n•Taught successful methods of discipline and strategies for engaging students Classroom Spanish Teacher Kennedy Charter Public School August 2007  –  January 2009  (1 year 6 months) Charlotte, North Carolina Area •Taught Spanish at a school chartered for foster children and previously expelled students  \n•Led after-school tutoring and career goal-setting sessions for students in all school subjects  \n•Mentored incoming teachers, including experienced and first year teachers \n•Taught successful methods of discipline and strategies for engaging students Classroom Spanish Teacher Cambridge Public Schools August 2004  –  July 2007  (3 years) Cambridge, Massachusetts •Taught Spanish conversational and writing skills to students at multiple levels  \n•Created and implemented new program and curriculum for native Spanish-speakers  \n•Served on a committee which created citywide curriculum for Spanish on all levels \n \nTrack and Field Coach\t \n•Coached high jump, long jump, triple jump, hurdles, spirits, and relays. Officiated at track meets \n•Coached 11 different athletes to state championship and helped lead team to win three conference championships Classroom Spanish Teacher Cambridge Public Schools August 2004  –  July 2007  (3 years) Cambridge, Massachusetts •Taught Spanish conversational and writing skills to students at multiple levels  \n•Created and implemented new program and curriculum for native Spanish-speakers  \n•Served on a committee which created citywide curriculum for Spanish on all levels \n \nTrack and Field Coach\t \n•Coached high jump, long jump, triple jump, hurdles, spirits, and relays. Officiated at track meets \n•Coached 11 different athletes to state championship and helped lead team to win three conference championships Personal Banking Representative Sovereign Bank September 2002  –  August 2004  (2 years) Cranston, Rhode Island and Needham, Massachusetts •First in monthly product sales for the region eight times averaging 2.6 products per interaction \n•Trained incoming retail bankers on banking operations, sales techniques, and regulation compliance \n•Serviced individual and business Spanish- and English-speaking clients \n•Updated and maintained accounts, processed loans, set up new accounts, and completed wire transfers Personal Banking Representative Sovereign Bank September 2002  –  August 2004  (2 years) Cranston, Rhode Island and Needham, Massachusetts •First in monthly product sales for the region eight times averaging 2.6 products per interaction \n•Trained incoming retail bankers on banking operations, sales techniques, and regulation compliance \n•Serviced individual and business Spanish- and English-speaking clients \n•Updated and maintained accounts, processed loans, set up new accounts, and completed wire transfers Missionary Church of Jesus Christ of Latter-day Saints August 1998  –  August 2000  (2 years 1 month) Supervised groups of up to eighteen missionaries by monitoring progress, teaching effective communication skills and fostering involvement in community among supervisees. Organized and carried out community service projects such as building homes, working on farms, and teaching English. Presided over a congregation, and aided local religious leaders in strengthening their congregations (200 to 300 people) by attending planning meetings advising effective strategies. Missionary Church of Jesus Christ of Latter-day Saints August 1998  –  August 2000  (2 years 1 month) Supervised groups of up to eighteen missionaries by monitoring progress, teaching effective communication skills and fostering involvement in community among supervisees. Organized and carried out community service projects such as building homes, working on farms, and teaching English. Presided over a congregation, and aided local religious leaders in strengthening their congregations (200 to 300 people) by attending planning meetings advising effective strategies. Languages Spanish Spanish Spanish Skills Teaching Problem Solving Fluent in Spanish Latin American culture Retail Banking Data Analysis Project Management Microsoft Office Accounting Analysis Business Planning Business Analysis CRM Business Strategy Communication Skills Coaching Finance Leadership Management Marketing Strategy Microsoft Excel Microsoft Word PowerPoint Process Improvement Research Retail Sales Spanish Strategy Supply Chain Team Leadership Training See 17+     See less Skills  Teaching Problem Solving Fluent in Spanish Latin American culture Retail Banking Data Analysis Project Management Microsoft Office Accounting Analysis Business Planning Business Analysis CRM Business Strategy Communication Skills Coaching Finance Leadership Management Marketing Strategy Microsoft Excel Microsoft Word PowerPoint Process Improvement Research Retail Sales Spanish Strategy Supply Chain Team Leadership Training See 17+     See less Teaching Problem Solving Fluent in Spanish Latin American culture Retail Banking Data Analysis Project Management Microsoft Office Accounting Analysis Business Planning Business Analysis CRM Business Strategy Communication Skills Coaching Finance Leadership Management Marketing Strategy Microsoft Excel Microsoft Word PowerPoint Process Improvement Research Retail Sales Spanish Strategy Supply Chain Team Leadership Training See 17+     See less Teaching Problem Solving Fluent in Spanish Latin American culture Retail Banking Data Analysis Project Management Microsoft Office Accounting Analysis Business Planning Business Analysis CRM Business Strategy Communication Skills Coaching Finance Leadership Management Marketing Strategy Microsoft Excel Microsoft Word PowerPoint Process Improvement Research Retail Sales Spanish Strategy Supply Chain Team Leadership Training See 17+     See less Education The Ohio State University - The Max M. Fisher College of Business MBA,  Operations and Logistics Management 2011  – 2013 University of Massachusetts Boston Masters of Education,  Secondary Education 2004  – 2006 Rhode Island College Bachelor of Arts,  Spanish 2002  – 2004 Brigham Young University - Idaho Associate of Arts and Sciences,  Spanish 2001  – 2002 The Ohio State University - The Max M. Fisher College of Business MBA,  Operations and Logistics Management 2011  – 2013 The Ohio State University - The Max M. Fisher College of Business MBA,  Operations and Logistics Management 2011  – 2013 The Ohio State University - The Max M. Fisher College of Business MBA,  Operations and Logistics Management 2011  – 2013 University of Massachusetts Boston Masters of Education,  Secondary Education 2004  – 2006 University of Massachusetts Boston Masters of Education,  Secondary Education 2004  – 2006 University of Massachusetts Boston Masters of Education,  Secondary Education 2004  – 2006 Rhode Island College Bachelor of Arts,  Spanish 2002  – 2004 Rhode Island College Bachelor of Arts,  Spanish 2002  – 2004 Rhode Island College Bachelor of Arts,  Spanish 2002  – 2004 Brigham Young University - Idaho Associate of Arts and Sciences,  Spanish 2001  – 2002 Brigham Young University - Idaho Associate of Arts and Sciences,  Spanish 2001  – 2002 Brigham Young University - Idaho Associate of Arts and Sciences,  Spanish 2001  – 2002 Honors & Awards Additional Honors & Awards Eagle Scout Additional Honors & Awards Eagle Scout Additional Honors & Awards Eagle Scout Additional Honors & Awards Eagle Scout ", "Languages Dutch Native or bilingual proficiency English Full professional proficiency Spanish Professional working proficiency Dutch Native or bilingual proficiency English Full professional proficiency Spanish Professional working proficiency Dutch Native or bilingual proficiency English Full professional proficiency Spanish Professional working proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Skills Theory of Constraints Problem Solving Competitive Analysis Excel ROI development Stakeholder Management Stakeholder Engagement Stakeholder Consultation Management Consulting Bilingual Spanish Fluent English Negotiation Statistical Modeling Lean Sigma Internal Communications Financial Analysis Business Analysis New Business Development Six Sigma Strategic Sourcing Program Management Microsoft Excel English Budgets SAP Procurement Manufacturing Cross-functional Team... Project Planning Analysis Inventory Management Change Management Operations Management Supply Chain Management Lean Manufacturing Strategy Leadership Return on Investment Business Process... Process Improvement Supply Chain Logistics Continuous Improvement Supply Management Supply Chain... Forecasting Warehousing Project Management Business Development See 35+     See less Skills  Theory of Constraints Problem Solving Competitive Analysis Excel ROI development Stakeholder Management Stakeholder Engagement Stakeholder Consultation Management Consulting Bilingual Spanish Fluent English Negotiation Statistical Modeling Lean Sigma Internal Communications Financial Analysis Business Analysis New Business Development Six Sigma Strategic Sourcing Program Management Microsoft Excel English Budgets SAP Procurement Manufacturing Cross-functional Team... Project Planning Analysis Inventory Management Change Management Operations Management Supply Chain Management Lean Manufacturing Strategy Leadership Return on Investment Business Process... Process Improvement Supply Chain Logistics Continuous Improvement Supply Management Supply Chain... Forecasting Warehousing Project Management Business Development See 35+     See less Theory of Constraints Problem Solving Competitive Analysis Excel ROI development Stakeholder Management Stakeholder Engagement Stakeholder Consultation Management Consulting Bilingual Spanish Fluent English Negotiation Statistical Modeling Lean Sigma Internal Communications Financial Analysis Business Analysis New Business Development Six Sigma Strategic Sourcing Program Management Microsoft Excel English Budgets SAP Procurement Manufacturing Cross-functional Team... Project Planning Analysis Inventory Management Change Management Operations Management Supply Chain Management Lean Manufacturing Strategy Leadership Return on Investment Business Process... Process Improvement Supply Chain Logistics Continuous Improvement Supply Management Supply Chain... Forecasting Warehousing Project Management Business Development See 35+     See less Theory of Constraints Problem Solving Competitive Analysis Excel ROI development Stakeholder Management Stakeholder Engagement Stakeholder Consultation Management Consulting Bilingual Spanish Fluent English Negotiation Statistical Modeling Lean Sigma Internal Communications Financial Analysis Business Analysis New Business Development Six Sigma Strategic Sourcing Program Management Microsoft Excel English Budgets SAP Procurement Manufacturing Cross-functional Team... Project Planning Analysis Inventory Management Change Management Operations Management Supply Chain Management Lean Manufacturing Strategy Leadership Return on Investment Business Process... Process Improvement Supply Chain Logistics Continuous Improvement Supply Management Supply Chain... Forecasting Warehousing Project Management Business Development See 35+     See less Honors & Awards ", "Experience Supply Chain Analyst Intel Corporation November 2013  – Present (1 year 10 months) Folsom, California • Mitigate excess inventory risk and work provide opportunity to generate non-forecasted sales.  \n• Influenced business units on inventory and build strategies to support deal based opportunities. \n• Coordinate across multiple business units to align materials and capacity for new products to support customers’ new platform qual dates. \n• Team SAP Super User  \n Operations Management Practicum KersTech Vehicle Systems January 2013  –  June 2013  (6 months) University of Oregon • Analyzed relevant markets and competitive threats to the Company’s product \n• Performed total cost of ownership for the Company’s new product \n• Contacted prospective buyers to identify potential concerns in adopting the product Vice President of Programming UOHRA March 2012  –  June 2013  (1 year 4 months) University of Oregon • Networked with over 45 professionals from the Eugene, Oregon area \n• Organized events for each term and ensured smooth operation \n• Developed professional forms and compiled speaker biographies \n• Updated and managed the website to inform members of upcoming events Recycling Intern Free Geek May 2011  –  September 2011  (5 months) Portland, Oregon • Taught volunteers and interns how to break down and sort various electronic items \n• Managed up to 12 volunteers at a time across two different workstations \n• Communicated recycling floor needs to upper management Information Assistant Child Eye Care Associates April 2011  –  August 2011  (5 months) Lake Oswego, Oregon • Converted and organized patient files into an electronic database Coach Cascade Soccer Camp June 2008  –  September 2009  (1 year 4 months) Portland, Oregon Area • Worked with various ages (6-12 years old) and skill levels \n• Coordinated mini tournaments and individualized daily training drills for the entire camp \n• Guided parents on how to solve problems with disruptive children Supply Chain Analyst Intel Corporation November 2013  – Present (1 year 10 months) Folsom, California • Mitigate excess inventory risk and work provide opportunity to generate non-forecasted sales.  \n• Influenced business units on inventory and build strategies to support deal based opportunities. \n• Coordinate across multiple business units to align materials and capacity for new products to support customers’ new platform qual dates. \n• Team SAP Super User  \n Supply Chain Analyst Intel Corporation November 2013  – Present (1 year 10 months) Folsom, California • Mitigate excess inventory risk and work provide opportunity to generate non-forecasted sales.  \n• Influenced business units on inventory and build strategies to support deal based opportunities. \n• Coordinate across multiple business units to align materials and capacity for new products to support customers’ new platform qual dates. \n• Team SAP Super User  \n Operations Management Practicum KersTech Vehicle Systems January 2013  –  June 2013  (6 months) University of Oregon • Analyzed relevant markets and competitive threats to the Company’s product \n• Performed total cost of ownership for the Company’s new product \n• Contacted prospective buyers to identify potential concerns in adopting the product Operations Management Practicum KersTech Vehicle Systems January 2013  –  June 2013  (6 months) University of Oregon • Analyzed relevant markets and competitive threats to the Company’s product \n• Performed total cost of ownership for the Company’s new product \n• Contacted prospective buyers to identify potential concerns in adopting the product Vice President of Programming UOHRA March 2012  –  June 2013  (1 year 4 months) University of Oregon • Networked with over 45 professionals from the Eugene, Oregon area \n• Organized events for each term and ensured smooth operation \n• Developed professional forms and compiled speaker biographies \n• Updated and managed the website to inform members of upcoming events Vice President of Programming UOHRA March 2012  –  June 2013  (1 year 4 months) University of Oregon • Networked with over 45 professionals from the Eugene, Oregon area \n• Organized events for each term and ensured smooth operation \n• Developed professional forms and compiled speaker biographies \n• Updated and managed the website to inform members of upcoming events Recycling Intern Free Geek May 2011  –  September 2011  (5 months) Portland, Oregon • Taught volunteers and interns how to break down and sort various electronic items \n• Managed up to 12 volunteers at a time across two different workstations \n• Communicated recycling floor needs to upper management Recycling Intern Free Geek May 2011  –  September 2011  (5 months) Portland, Oregon • Taught volunteers and interns how to break down and sort various electronic items \n• Managed up to 12 volunteers at a time across two different workstations \n• Communicated recycling floor needs to upper management Information Assistant Child Eye Care Associates April 2011  –  August 2011  (5 months) Lake Oswego, Oregon • Converted and organized patient files into an electronic database Information Assistant Child Eye Care Associates April 2011  –  August 2011  (5 months) Lake Oswego, Oregon • Converted and organized patient files into an electronic database Coach Cascade Soccer Camp June 2008  –  September 2009  (1 year 4 months) Portland, Oregon Area • Worked with various ages (6-12 years old) and skill levels \n• Coordinated mini tournaments and individualized daily training drills for the entire camp \n• Guided parents on how to solve problems with disruptive children Coach Cascade Soccer Camp June 2008  –  September 2009  (1 year 4 months) Portland, Oregon Area • Worked with various ages (6-12 years old) and skill levels \n• Coordinated mini tournaments and individualized daily training drills for the entire camp \n• Guided parents on how to solve problems with disruptive children Skills Python SQL JavaScript CSS HTML 5 Database Modeling Excel Microsoft Word PHP SDK Managing Database Microsoft Office Microsoft Excel Public Speaking Operations Management Leadership Management Data Analysis PowerPoint Time Management Teamwork Research See 7+     See less Skills  Python SQL JavaScript CSS HTML 5 Database Modeling Excel Microsoft Word PHP SDK Managing Database Microsoft Office Microsoft Excel Public Speaking Operations Management Leadership Management Data Analysis PowerPoint Time Management Teamwork Research See 7+     See less Python SQL JavaScript CSS HTML 5 Database Modeling Excel Microsoft Word PHP SDK Managing Database Microsoft Office Microsoft Excel Public Speaking Operations Management Leadership Management Data Analysis PowerPoint Time Management Teamwork Research See 7+     See less Python SQL JavaScript CSS HTML 5 Database Modeling Excel Microsoft Word PHP SDK Managing Database Microsoft Office Microsoft Excel Public Speaking Operations Management Leadership Management Data Analysis PowerPoint Time Management Teamwork Research See 7+     See less Education University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (BS),  Information Systems and Operations Management , Senior 2011  – 2013 Minored in Computer Information Technology Activities and Societies:  Vice President of Programming for The University of Oregon Human Resource Association Trinity University 2008  – 2010 Catlin Gabel 2004  – 2008 University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (BS),  Information Systems and Operations Management , Senior 2011  – 2013 Minored in Computer Information Technology Activities and Societies:  Vice President of Programming for The University of Oregon Human Resource Association University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (BS),  Information Systems and Operations Management , Senior 2011  – 2013 Minored in Computer Information Technology Activities and Societies:  Vice President of Programming for The University of Oregon Human Resource Association University of Oregon - Charles H. Lundquist College of Business Bachelor of Science (BS),  Information Systems and Operations Management , Senior 2011  – 2013 Minored in Computer Information Technology Activities and Societies:  Vice President of Programming for The University of Oregon Human Resource Association Trinity University 2008  – 2010 Trinity University 2008  – 2010 Trinity University 2008  – 2010 Catlin Gabel 2004  – 2008 Catlin Gabel 2004  – 2008 Catlin Gabel 2004  – 2008 Honors & Awards 2013 Information Systems and Operations Management Outstanding Student Award Yue Fang June 2013 Award for outstanding achievement and excellence in the ISOM field at the University of Oregon. 2013 Information Systems and Operations Management Outstanding Student Award Yue Fang June 2013 Award for outstanding achievement and excellence in the ISOM field at the University of Oregon. 2013 Information Systems and Operations Management Outstanding Student Award Yue Fang June 2013 Award for outstanding achievement and excellence in the ISOM field at the University of Oregon. 2013 Information Systems and Operations Management Outstanding Student Award Yue Fang June 2013 Award for outstanding achievement and excellence in the ISOM field at the University of Oregon. "]}