{"position": "Systems Administrator", "company": "Intel Corporation", "profiles": ["Summary Microsoft Certified Systems Engineer offering more than 14 years of experience managing servers and datacenter operations in the high-tech and manufacturing industries. Design, deploy, and support highly available and secure information system solutions. \n \nSpecialties: \n \nWindows and Linux server administration \nActive Directory \nInformation security management \nNetwork administration \nVirtualization \nProject Management \nTeam Leadership \nProblem Solving \nCustomer Service \nSystem fault tolerance and performance Summary Microsoft Certified Systems Engineer offering more than 14 years of experience managing servers and datacenter operations in the high-tech and manufacturing industries. Design, deploy, and support highly available and secure information system solutions. \n \nSpecialties: \n \nWindows and Linux server administration \nActive Directory \nInformation security management \nNetwork administration \nVirtualization \nProject Management \nTeam Leadership \nProblem Solving \nCustomer Service \nSystem fault tolerance and performance Microsoft Certified Systems Engineer offering more than 14 years of experience managing servers and datacenter operations in the high-tech and manufacturing industries. Design, deploy, and support highly available and secure information system solutions. \n \nSpecialties: \n \nWindows and Linux server administration \nActive Directory \nInformation security management \nNetwork administration \nVirtualization \nProject Management \nTeam Leadership \nProblem Solving \nCustomer Service \nSystem fault tolerance and performance Microsoft Certified Systems Engineer offering more than 14 years of experience managing servers and datacenter operations in the high-tech and manufacturing industries. Design, deploy, and support highly available and secure information system solutions. \n \nSpecialties: \n \nWindows and Linux server administration \nActive Directory \nInformation security management \nNetwork administration \nVirtualization \nProject Management \nTeam Leadership \nProblem Solving \nCustomer Service \nSystem fault tolerance and performance Experience Senior Systems Administrator Intel Corporation November 2014  – Present (10 months) Hudson, MA Information Security Specialist Intel Corporation February 2014  –  November 2014  (10 months) Hudson, MA ESM event correlation and content development; threat analysis; incident response; policy maintenance and enforcement; access control; patch and antivirus management; firewall administration; system hardening; secure deployment consultation; user awareness training Systems Administrator Intel Corporation March 2000  –  November 2014  (14 years 9 months) Hudson, MA 24x7 datacenter management including Windows Servers, Linux, and Storage administration, network and system security. Implement and maintain highly available solutions utilizing NLBS, MSCS clustering, VMware, SAN, and network redundancy. Manage system and network security using Tivoli Endpoint Manager for patch management, McAfee antivirus, Active Directory, and Checkpoint firewall. Administer IIS, FTP, fileshare, and DNS infrastructure. Conduct large, complex, system upgrade and Information Security projects. Proven track record for delivering high quality systems meeting or exceeding customer expectations. IS consultant Liberty Mutual Insurance 1997  –  1999  (2 years) Portsmouth, NH Accounting Manager Quality Systems International Corporation May 1995  –  June 1997  (2 years 2 months) Waltham, MA Accounting Assistant Harbor Homes, Inc. January 1993  –  May 1995  (2 years 5 months) Senior Systems Administrator Intel Corporation November 2014  – Present (10 months) Hudson, MA Senior Systems Administrator Intel Corporation November 2014  – Present (10 months) Hudson, MA Information Security Specialist Intel Corporation February 2014  –  November 2014  (10 months) Hudson, MA ESM event correlation and content development; threat analysis; incident response; policy maintenance and enforcement; access control; patch and antivirus management; firewall administration; system hardening; secure deployment consultation; user awareness training Information Security Specialist Intel Corporation February 2014  –  November 2014  (10 months) Hudson, MA ESM event correlation and content development; threat analysis; incident response; policy maintenance and enforcement; access control; patch and antivirus management; firewall administration; system hardening; secure deployment consultation; user awareness training Systems Administrator Intel Corporation March 2000  –  November 2014  (14 years 9 months) Hudson, MA 24x7 datacenter management including Windows Servers, Linux, and Storage administration, network and system security. Implement and maintain highly available solutions utilizing NLBS, MSCS clustering, VMware, SAN, and network redundancy. Manage system and network security using Tivoli Endpoint Manager for patch management, McAfee antivirus, Active Directory, and Checkpoint firewall. Administer IIS, FTP, fileshare, and DNS infrastructure. Conduct large, complex, system upgrade and Information Security projects. Proven track record for delivering high quality systems meeting or exceeding customer expectations. Systems Administrator Intel Corporation March 2000  –  November 2014  (14 years 9 months) Hudson, MA 24x7 datacenter management including Windows Servers, Linux, and Storage administration, network and system security. Implement and maintain highly available solutions utilizing NLBS, MSCS clustering, VMware, SAN, and network redundancy. Manage system and network security using Tivoli Endpoint Manager for patch management, McAfee antivirus, Active Directory, and Checkpoint firewall. Administer IIS, FTP, fileshare, and DNS infrastructure. Conduct large, complex, system upgrade and Information Security projects. Proven track record for delivering high quality systems meeting or exceeding customer expectations. IS consultant Liberty Mutual Insurance 1997  –  1999  (2 years) Portsmouth, NH IS consultant Liberty Mutual Insurance 1997  –  1999  (2 years) Portsmouth, NH Accounting Manager Quality Systems International Corporation May 1995  –  June 1997  (2 years 2 months) Waltham, MA Accounting Manager Quality Systems International Corporation May 1995  –  June 1997  (2 years 2 months) Waltham, MA Accounting Assistant Harbor Homes, Inc. January 1993  –  May 1995  (2 years 5 months) Accounting Assistant Harbor Homes, Inc. January 1993  –  May 1995  (2 years 5 months) Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Windows Server Active Directory Network Security Infrastructure VMware High Availability TCP/IP Information Security... SAN Project Management HP Server Hardware IIS Networking Microsoft Cluster IBM Tivoli Network Load Balancing DNS management Checkpoint Firewall Business Continuity... McAfee Antivirus Red Hat Linux Powershell Problem Solving Team Leadership Customer Service Virtualization Servers Linux Checkpoint See 14+     See less Skills  Windows Server Active Directory Network Security Infrastructure VMware High Availability TCP/IP Information Security... SAN Project Management HP Server Hardware IIS Networking Microsoft Cluster IBM Tivoli Network Load Balancing DNS management Checkpoint Firewall Business Continuity... McAfee Antivirus Red Hat Linux Powershell Problem Solving Team Leadership Customer Service Virtualization Servers Linux Checkpoint See 14+     See less Windows Server Active Directory Network Security Infrastructure VMware High Availability TCP/IP Information Security... SAN Project Management HP Server Hardware IIS Networking Microsoft Cluster IBM Tivoli Network Load Balancing DNS management Checkpoint Firewall Business Continuity... McAfee Antivirus Red Hat Linux Powershell Problem Solving Team Leadership Customer Service Virtualization Servers Linux Checkpoint See 14+     See less Windows Server Active Directory Network Security Infrastructure VMware High Availability TCP/IP Information Security... SAN Project Management HP Server Hardware IIS Networking Microsoft Cluster IBM Tivoli Network Load Balancing DNS management Checkpoint Firewall Business Continuity... McAfee Antivirus Red Hat Linux Powershell Problem Solving Team Leadership Customer Service Virtualization Servers Linux Checkpoint See 14+     See less Education Bentley College - Elkin B. McCallum Graduate School of Business Master of Science (MS),  Computer Information Systems 1995  – 1997 University of New Hampshire - Whittemore School of Business and Economics Bachelor of Business Administration (BBA),  Accounting ,  Finance , Economics,  Marketing 1987  – 1992 Bentley College - Elkin B. McCallum Graduate School of Business Master of Science (MS),  Computer Information Systems 1995  – 1997 Bentley College - Elkin B. McCallum Graduate School of Business Master of Science (MS),  Computer Information Systems 1995  – 1997 Bentley College - Elkin B. McCallum Graduate School of Business Master of Science (MS),  Computer Information Systems 1995  – 1997 University of New Hampshire - Whittemore School of Business and Economics Bachelor of Business Administration (BBA),  Accounting ,  Finance , Economics,  Marketing 1987  – 1992 University of New Hampshire - Whittemore School of Business and Economics Bachelor of Business Administration (BBA),  Accounting ,  Finance , Economics,  Marketing 1987  – 1992 University of New Hampshire - Whittemore School of Business and Economics Bachelor of Business Administration (BBA),  Accounting ,  Finance , Economics,  Marketing 1987  – 1992 Honors & Awards ", "Experience Systems Administrator Intel Corporation Systems Administrator Intel Corporation Systems Administrator Intel Corporation ", "Experience Unix Systems Administrator Intel Corporation October 2005  – Present (9 years 11 months) Assistant Payroll Administrator CPICorp. Canada June 1985  –  August 2001  (16 years 3 months) Unix Systems Administrator Intel Corporation October 2005  – Present (9 years 11 months) Unix Systems Administrator Intel Corporation October 2005  – Present (9 years 11 months) Assistant Payroll Administrator CPICorp. Canada June 1985  –  August 2001  (16 years 3 months) Assistant Payroll Administrator CPICorp. Canada June 1985  –  August 2001  (16 years 3 months) Skills Linux, Distributed... Unix Linux Perl Shell Scripting Operating Systems Virtualization Servers Troubleshooting System Administration TCP/IP Skills  Linux, Distributed... Unix Linux Perl Shell Scripting Operating Systems Virtualization Servers Troubleshooting System Administration TCP/IP Linux, Distributed... Unix Linux Perl Shell Scripting Operating Systems Virtualization Servers Troubleshooting System Administration TCP/IP Linux, Distributed... Unix Linux Perl Shell Scripting Operating Systems Virtualization Servers Troubleshooting System Administration TCP/IP Education Birla Institute of Technology and Science Master of Arts (M.A.),  Economics Birla Institute of Technology and Science Master of Arts (M.A.),  Economics Birla Institute of Technology and Science Master of Arts (M.A.),  Economics Birla Institute of Technology and Science Master of Arts (M.A.),  Economics ", "Experience DBA / Software Engineer / Systems Administrator Intel Corporation 1999  – Present (16 years) Oregon Manufacturing Production Control Tech Intel Corporation 1996  –  1999  (3 years) Phoenix, Arizona Area Inventory Control Technician Intel Corporation November 1992  –  December 1995  (3 years 2 months) Arizona DBA / Software Engineer / Systems Administrator Intel Corporation 1999  – Present (16 years) Oregon DBA / Software Engineer / Systems Administrator Intel Corporation 1999  – Present (16 years) Oregon Manufacturing Production Control Tech Intel Corporation 1996  –  1999  (3 years) Phoenix, Arizona Area Manufacturing Production Control Tech Intel Corporation 1996  –  1999  (3 years) Phoenix, Arizona Area Inventory Control Technician Intel Corporation November 1992  –  December 1995  (3 years 2 months) Arizona Inventory Control Technician Intel Corporation November 1992  –  December 1995  (3 years 2 months) Arizona Skills Manufacturing Semiconductors Skills  Manufacturing Semiconductors Manufacturing Semiconductors Manufacturing Semiconductors Education Mesa High School, Mesa, AZ Mesa High School, Mesa, AZ Mesa High School, Mesa, AZ Mesa High School, Mesa, AZ ", "Experience Systems Administrator Intel Corporation Systems Administrator Intel Corporation Systems Administrator Intel Corporation ", "Experience Senior Systems Administrator Intel Corporation April 2013  – Present (2 years 5 months) Belfast, United Kingdom Senior Systems Administrator AePONA April 2007  – Present (8 years 5 months) Belfast, United Kingdom •\tSupporting CentOS/XP/OSX/Ubuntu desktops and laptops on 6 sites and for remote workers. \n•\tMaintaining and developing Aepona’s IT infrastructure. This includes IBM/HP/Dell/Sun servers, running Samba, NIS, NFS and LDAP services on Linux HA Clusters and Hypervisors, Windows Terminal Server 2000 and 2003.  \n• Developing and Maintaining Aepona's Migration to a Virtual Environment, including the use of ESXi, Oracle VM, LDOMs and Zones.  \n•\tManaging Aepona’s mail, Intranet Services and Monitoring Systems including Nagios and Cacti \n•\tMaintaining Firewalls and Openvpn Servers to provide Internet and VPN access for Aepona Employees and VPN access to Aepona’s Customer Sites.  \n•\tSourcing and purchasing new hardware and software.  \n•\tProviding 24/7 support of Aepona’s IT infrastructure to Aepona employees.  \n•\tManaging and developing Aepona’s internal LAN comprising of Enterasys Cisco and HP hardware.  \n•\tDeveloping tools to manage work processes and automate manual task.  \n•\tDeploy and Maintain a SAN infrastructure using Qlogic Switches, IBM/HP and Sun Storage Arrays. \n•\tSupporting development hardware and software used by Aepona products, this includes both Redhat 5 Servers and Oracle servers running Solaris 9 & 10, Suncluster, Oracle RAC, Apache, Jboss tomcat and SVM. Support Manager AePONA September 2006  –  March 2007  (7 months) Belfast, United Kingdom •\tResponsible for managing a team of five support Engineers. The role involved the supporting of production deployments, the allocation of support tasks, customer communication, scheduling of site updates.  \n•\tResponsible for ensuring Aepona met all it’s customer SLA’s. Support Engineer AePONA March 2003  –  September 2006  (3 years 7 months) Belfast, United Kingdom •\tSupport and Maintenance Engineer for Aepona’s third generation Parlay Gateway. Provided support to Production sites and customer trials, together with bug fixing and the development of new services on the Gateway. The Gateway is developed using Java and C++. The gateway runs on a Solaris OS using an Oracle database. \n•\tProvided 24/7 support for the Aepona Parlay Gateway Lead Engineer AePONA April 2001  –  March 2003  (2 years) Belfast, United Kingdom Worked as C Developer for Components of Aepona's Parlay Gateway including SS7 CAP and INAP modules, connectors for SMPP and UCP interfaces to SMSC. \nDevelopment of Network Management Software: Worked with a team of engineers to develop a system to improve the efficiency of a major mobile operators pre-paid network. Using C on Solaris we developed a number of process’s, which managed the communication between an IVR and Telecordia’s SCP, improving the efficiency and stability of the IVR applications. Software Engineer AePONA February 1999  –  March 2001  (2 years 2 months) Dublin, Ireland Developer on a large team providing 3G interfaces to Logica’s Short Message Service Centre – C and Tcl on a HPUX Graduate Software Engineer, AePONA June 1998  –  February 1999  (9 months) Belfast, United Kingdom Worked as a Test Engineer developing Test Spec's and Scripts for Components of Telecoms Networks including SMSC's and Signaling Systems Senior Systems Administrator Intel Corporation April 2013  – Present (2 years 5 months) Belfast, United Kingdom Senior Systems Administrator Intel Corporation April 2013  – Present (2 years 5 months) Belfast, United Kingdom Senior Systems Administrator AePONA April 2007  – Present (8 years 5 months) Belfast, United Kingdom •\tSupporting CentOS/XP/OSX/Ubuntu desktops and laptops on 6 sites and for remote workers. \n•\tMaintaining and developing Aepona’s IT infrastructure. This includes IBM/HP/Dell/Sun servers, running Samba, NIS, NFS and LDAP services on Linux HA Clusters and Hypervisors, Windows Terminal Server 2000 and 2003.  \n• Developing and Maintaining Aepona's Migration to a Virtual Environment, including the use of ESXi, Oracle VM, LDOMs and Zones.  \n•\tManaging Aepona’s mail, Intranet Services and Monitoring Systems including Nagios and Cacti \n•\tMaintaining Firewalls and Openvpn Servers to provide Internet and VPN access for Aepona Employees and VPN access to Aepona’s Customer Sites.  \n•\tSourcing and purchasing new hardware and software.  \n•\tProviding 24/7 support of Aepona’s IT infrastructure to Aepona employees.  \n•\tManaging and developing Aepona’s internal LAN comprising of Enterasys Cisco and HP hardware.  \n•\tDeveloping tools to manage work processes and automate manual task.  \n•\tDeploy and Maintain a SAN infrastructure using Qlogic Switches, IBM/HP and Sun Storage Arrays. \n•\tSupporting development hardware and software used by Aepona products, this includes both Redhat 5 Servers and Oracle servers running Solaris 9 & 10, Suncluster, Oracle RAC, Apache, Jboss tomcat and SVM. Senior Systems Administrator AePONA April 2007  – Present (8 years 5 months) Belfast, United Kingdom •\tSupporting CentOS/XP/OSX/Ubuntu desktops and laptops on 6 sites and for remote workers. \n•\tMaintaining and developing Aepona’s IT infrastructure. This includes IBM/HP/Dell/Sun servers, running Samba, NIS, NFS and LDAP services on Linux HA Clusters and Hypervisors, Windows Terminal Server 2000 and 2003.  \n• Developing and Maintaining Aepona's Migration to a Virtual Environment, including the use of ESXi, Oracle VM, LDOMs and Zones.  \n•\tManaging Aepona’s mail, Intranet Services and Monitoring Systems including Nagios and Cacti \n•\tMaintaining Firewalls and Openvpn Servers to provide Internet and VPN access for Aepona Employees and VPN access to Aepona’s Customer Sites.  \n•\tSourcing and purchasing new hardware and software.  \n•\tProviding 24/7 support of Aepona’s IT infrastructure to Aepona employees.  \n•\tManaging and developing Aepona’s internal LAN comprising of Enterasys Cisco and HP hardware.  \n•\tDeveloping tools to manage work processes and automate manual task.  \n•\tDeploy and Maintain a SAN infrastructure using Qlogic Switches, IBM/HP and Sun Storage Arrays. \n•\tSupporting development hardware and software used by Aepona products, this includes both Redhat 5 Servers and Oracle servers running Solaris 9 & 10, Suncluster, Oracle RAC, Apache, Jboss tomcat and SVM. Support Manager AePONA September 2006  –  March 2007  (7 months) Belfast, United Kingdom •\tResponsible for managing a team of five support Engineers. The role involved the supporting of production deployments, the allocation of support tasks, customer communication, scheduling of site updates.  \n•\tResponsible for ensuring Aepona met all it’s customer SLA’s. Support Manager AePONA September 2006  –  March 2007  (7 months) Belfast, United Kingdom •\tResponsible for managing a team of five support Engineers. The role involved the supporting of production deployments, the allocation of support tasks, customer communication, scheduling of site updates.  \n•\tResponsible for ensuring Aepona met all it’s customer SLA’s. Support Engineer AePONA March 2003  –  September 2006  (3 years 7 months) Belfast, United Kingdom •\tSupport and Maintenance Engineer for Aepona’s third generation Parlay Gateway. Provided support to Production sites and customer trials, together with bug fixing and the development of new services on the Gateway. The Gateway is developed using Java and C++. The gateway runs on a Solaris OS using an Oracle database. \n•\tProvided 24/7 support for the Aepona Parlay Gateway Support Engineer AePONA March 2003  –  September 2006  (3 years 7 months) Belfast, United Kingdom •\tSupport and Maintenance Engineer for Aepona’s third generation Parlay Gateway. Provided support to Production sites and customer trials, together with bug fixing and the development of new services on the Gateway. The Gateway is developed using Java and C++. The gateway runs on a Solaris OS using an Oracle database. \n•\tProvided 24/7 support for the Aepona Parlay Gateway Lead Engineer AePONA April 2001  –  March 2003  (2 years) Belfast, United Kingdom Worked as C Developer for Components of Aepona's Parlay Gateway including SS7 CAP and INAP modules, connectors for SMPP and UCP interfaces to SMSC. \nDevelopment of Network Management Software: Worked with a team of engineers to develop a system to improve the efficiency of a major mobile operators pre-paid network. Using C on Solaris we developed a number of process’s, which managed the communication between an IVR and Telecordia’s SCP, improving the efficiency and stability of the IVR applications. Lead Engineer AePONA April 2001  –  March 2003  (2 years) Belfast, United Kingdom Worked as C Developer for Components of Aepona's Parlay Gateway including SS7 CAP and INAP modules, connectors for SMPP and UCP interfaces to SMSC. \nDevelopment of Network Management Software: Worked with a team of engineers to develop a system to improve the efficiency of a major mobile operators pre-paid network. Using C on Solaris we developed a number of process’s, which managed the communication between an IVR and Telecordia’s SCP, improving the efficiency and stability of the IVR applications. Software Engineer AePONA February 1999  –  March 2001  (2 years 2 months) Dublin, Ireland Developer on a large team providing 3G interfaces to Logica’s Short Message Service Centre – C and Tcl on a HPUX Software Engineer AePONA February 1999  –  March 2001  (2 years 2 months) Dublin, Ireland Developer on a large team providing 3G interfaces to Logica’s Short Message Service Centre – C and Tcl on a HPUX Graduate Software Engineer, AePONA June 1998  –  February 1999  (9 months) Belfast, United Kingdom Worked as a Test Engineer developing Test Spec's and Scripts for Components of Telecoms Networks including SMSC's and Signaling Systems Graduate Software Engineer, AePONA June 1998  –  February 1999  (9 months) Belfast, United Kingdom Worked as a Test Engineer developing Test Spec's and Scripts for Components of Telecoms Networks including SMSC's and Signaling Systems Skills Skills     Education University of Ulster Bsc Hons,  Computers 1994  – 1998 University of Ulster Bsc Hons,  Computers 1994  – 1998 University of Ulster Bsc Hons,  Computers 1994  – 1998 University of Ulster Bsc Hons,  Computers 1994  – 1998 ", "Experience Systems Administrator Intel Corporation (Outsourcing Kelly Services de Mexico S.A de C.V) July 2015  – Present (2 months) Zapopan Area, Mexico Infrastructure and support VMWare \nSupport ESXI server \nDevelopment in Script \nInstallation and support Machines \nManagement and implementation of VM \nSupport of Pool VM machines and Physicals \nManagement of servers IVB, HSW, SNB \nRemote machine monitoring \nNetwork Management VLAN \n Owner G.A Importaciones November 2014  – Present (10 months) Guadalajara, Jalisco - Continuous visits to suppliers in the US \n- Purchase - Sale of different items in the states of USA \n- Transfer of merchandise of USA-Mexico. \n- Tracking Product Guides USA-Mexico \n- Product Distribution in Mexico ENGINEERING IN VALIDATION OF SYSTEM Intel Corporation (Outsourcing Kelly Services de Mexico S.A de C.V) November 2013  –  November 2014  (1 year 1 month) Guadalajara Area, Mexico Infrastructure and support VMWare \nSupport ESXI server \nDevelopment in Script \nInstallation and support Machines \nManagement and implementation of VM \nSupport of Pool VM machines and Physicals \nManagement of servers IVB, HSW, SNB \nRemote machine monitoring \nNetwork Management VLAN \n FAILURE ANALYSIS LEVEL 2 XYRATEX (OUTSOURCING MANPOWER) April 2013  –  November 2013  (8 months) Tlaquepaque Area, Mexico TECHNICIAN VALIDATION VPG MIC INTEL (OUTSOURCING KELLY SERVICES MEXICO S.A DE C.V) May 2012  –  April 2013  (1 year) Guadalajara Area, Mexico Systems Administrator Intel Corporation (Outsourcing Kelly Services de Mexico S.A de C.V) July 2015  – Present (2 months) Zapopan Area, Mexico Infrastructure and support VMWare \nSupport ESXI server \nDevelopment in Script \nInstallation and support Machines \nManagement and implementation of VM \nSupport of Pool VM machines and Physicals \nManagement of servers IVB, HSW, SNB \nRemote machine monitoring \nNetwork Management VLAN \n Systems Administrator Intel Corporation (Outsourcing Kelly Services de Mexico S.A de C.V) July 2015  – Present (2 months) Zapopan Area, Mexico Infrastructure and support VMWare \nSupport ESXI server \nDevelopment in Script \nInstallation and support Machines \nManagement and implementation of VM \nSupport of Pool VM machines and Physicals \nManagement of servers IVB, HSW, SNB \nRemote machine monitoring \nNetwork Management VLAN \n Owner G.A Importaciones November 2014  – Present (10 months) Guadalajara, Jalisco - Continuous visits to suppliers in the US \n- Purchase - Sale of different items in the states of USA \n- Transfer of merchandise of USA-Mexico. \n- Tracking Product Guides USA-Mexico \n- Product Distribution in Mexico Owner G.A Importaciones November 2014  – Present (10 months) Guadalajara, Jalisco - Continuous visits to suppliers in the US \n- Purchase - Sale of different items in the states of USA \n- Transfer of merchandise of USA-Mexico. \n- Tracking Product Guides USA-Mexico \n- Product Distribution in Mexico ENGINEERING IN VALIDATION OF SYSTEM Intel Corporation (Outsourcing Kelly Services de Mexico S.A de C.V) November 2013  –  November 2014  (1 year 1 month) Guadalajara Area, Mexico Infrastructure and support VMWare \nSupport ESXI server \nDevelopment in Script \nInstallation and support Machines \nManagement and implementation of VM \nSupport of Pool VM machines and Physicals \nManagement of servers IVB, HSW, SNB \nRemote machine monitoring \nNetwork Management VLAN \n ENGINEERING IN VALIDATION OF SYSTEM Intel Corporation (Outsourcing Kelly Services de Mexico S.A de C.V) November 2013  –  November 2014  (1 year 1 month) Guadalajara Area, Mexico Infrastructure and support VMWare \nSupport ESXI server \nDevelopment in Script \nInstallation and support Machines \nManagement and implementation of VM \nSupport of Pool VM machines and Physicals \nManagement of servers IVB, HSW, SNB \nRemote machine monitoring \nNetwork Management VLAN \n FAILURE ANALYSIS LEVEL 2 XYRATEX (OUTSOURCING MANPOWER) April 2013  –  November 2013  (8 months) Tlaquepaque Area, Mexico FAILURE ANALYSIS LEVEL 2 XYRATEX (OUTSOURCING MANPOWER) April 2013  –  November 2013  (8 months) Tlaquepaque Area, Mexico TECHNICIAN VALIDATION VPG MIC INTEL (OUTSOURCING KELLY SERVICES MEXICO S.A DE C.V) May 2012  –  April 2013  (1 year) Guadalajara Area, Mexico TECHNICIAN VALIDATION VPG MIC INTEL (OUTSOURCING KELLY SERVICES MEXICO S.A DE C.V) May 2012  –  April 2013  (1 year) Guadalajara Area, Mexico Languages English, Middle (1100-1500) English, Middle (1100-1500) English, Middle (1100-1500) Skills Servers Python Git Windows Ubuntu Management Debugging C Skills  Servers Python Git Windows Ubuntu Management Debugging C Servers Python Git Windows Ubuntu Management Debugging C Servers Python Git Windows Ubuntu Management Debugging C Education Universidad de Guadalajara Bachelor of Engineering in communications and electronics 2005  – 2009 Universidad de Guadalajara Bachelor of Engineering in communications and electronics 2005  – 2009 Universidad de Guadalajara Bachelor of Engineering in communications and electronics 2005  – 2009 Universidad de Guadalajara Bachelor of Engineering in communications and electronics 2005  – 2009 ", "Experience Systems Administrator, Intel Federal LLC Intel Corporation June 2015  – Present (3 months) Systems Administrator Intel Corporation January 2010  – Present (5 years 8 months) hudson, ma Automation Engineer Intel Corporation May 1998  –  January 2010  (11 years 9 months) hudson, massachusetts Systems Administrator, Intel Federal LLC Intel Corporation June 2015  – Present (3 months) Systems Administrator, Intel Federal LLC Intel Corporation June 2015  – Present (3 months) Systems Administrator Intel Corporation January 2010  – Present (5 years 8 months) hudson, ma Systems Administrator Intel Corporation January 2010  – Present (5 years 8 months) hudson, ma Automation Engineer Intel Corporation May 1998  –  January 2010  (11 years 9 months) hudson, massachusetts Automation Engineer Intel Corporation May 1998  –  January 2010  (11 years 9 months) hudson, massachusetts Skills Data Center System Administration VMware ESX Storage SAN Computer Hardware SharePoint Disaster Recovery VMware Hardware Virtualization Unix Windows Server Skills  Data Center System Administration VMware ESX Storage SAN Computer Hardware SharePoint Disaster Recovery VMware Hardware Virtualization Unix Windows Server Data Center System Administration VMware ESX Storage SAN Computer Hardware SharePoint Disaster Recovery VMware Hardware Virtualization Unix Windows Server Data Center System Administration VMware ESX Storage SAN Computer Hardware SharePoint Disaster Recovery VMware Hardware Virtualization Unix Windows Server Education Assumption College Bachelor's degree Assumption College Bachelor's degree Assumption College Bachelor's degree Assumption College Bachelor's degree ", "Experience Systems Administrator Cambridge Crystallographic Data Centre April 2007  – Present (8 years 5 months) Systems Administrator Intel Corporation June 2006  –  December 2006  (7 months) Systems Administrator Accelrys August 2004  –  May 2006  (1 year 10 months) Systems Administrator Intel Corporation February 2003  –  August 2004  (1 year 7 months) Systems Administrator Sequenom January 2003  –  July 2003  (7 months) Systems Administrator Gemini Genomics August 2000  –  December 2002  (2 years 5 months) Systems Administrator Boden December 1996  –  August 2000  (3 years 9 months) Systems Administrator Cambridge Crystallographic Data Centre April 2007  – Present (8 years 5 months) Systems Administrator Cambridge Crystallographic Data Centre April 2007  – Present (8 years 5 months) Systems Administrator Intel Corporation June 2006  –  December 2006  (7 months) Systems Administrator Intel Corporation June 2006  –  December 2006  (7 months) Systems Administrator Accelrys August 2004  –  May 2006  (1 year 10 months) Systems Administrator Accelrys August 2004  –  May 2006  (1 year 10 months) Systems Administrator Intel Corporation February 2003  –  August 2004  (1 year 7 months) Systems Administrator Intel Corporation February 2003  –  August 2004  (1 year 7 months) Systems Administrator Sequenom January 2003  –  July 2003  (7 months) Systems Administrator Sequenom January 2003  –  July 2003  (7 months) Systems Administrator Gemini Genomics August 2000  –  December 2002  (2 years 5 months) Systems Administrator Gemini Genomics August 2000  –  December 2002  (2 years 5 months) Systems Administrator Boden December 1996  –  August 2000  (3 years 9 months) Systems Administrator Boden December 1996  –  August 2000  (3 years 9 months) Skills Linux Windows Server VMWare System Administration Windows DNS Unix SharePoint Apache Virtualization Mac OS X MySQL OS X Bash Microsoft SQL Server Unix Shell Scripting ITIL v3 Foundations... Python Shell Scripting See 4+     See less Skills  Linux Windows Server VMWare System Administration Windows DNS Unix SharePoint Apache Virtualization Mac OS X MySQL OS X Bash Microsoft SQL Server Unix Shell Scripting ITIL v3 Foundations... Python Shell Scripting See 4+     See less Linux Windows Server VMWare System Administration Windows DNS Unix SharePoint Apache Virtualization Mac OS X MySQL OS X Bash Microsoft SQL Server Unix Shell Scripting ITIL v3 Foundations... Python Shell Scripting See 4+     See less Linux Windows Server VMWare System Administration Windows DNS Unix SharePoint Apache Virtualization Mac OS X MySQL OS X Bash Microsoft SQL Server Unix Shell Scripting ITIL v3 Foundations... Python Shell Scripting See 4+     See less Education London Metropolitan University 2:2,  Politics and Sociology 1993  – 1996 London Metropolitan University 2:2,  Politics and Sociology 1993  – 1996 London Metropolitan University 2:2,  Politics and Sociology 1993  – 1996 London Metropolitan University 2:2,  Politics and Sociology 1993  – 1996 ", "Experience Systems Administrator Intel Corporation February 1994  – Present (21 years 7 months) Systems Administrator Intel Corporation February 1994  – Present (21 years 7 months) Systems Administrator Intel Corporation February 1994  – Present (21 years 7 months) Skills Intel Project Management Unix Skills  Intel Project Management Unix Intel Project Management Unix Intel Project Management Unix Education Santa Rita, Tucson, AZ Santa Rita, Tucson, AZ Santa Rita, Tucson, AZ Santa Rita, Tucson, AZ ", "Experience Systems Administrator Intel Corporation Systems Administrator Intel Corporation Systems Administrator Intel Corporation Education International Institute Of Information Technology, Hyderabad Master's Degree,  Information Technology 2004  – 2006 State University of New York College at Buffalo Bachelor's Degree,  Computer Software Engineering 1998  – 2002 International Institute Of Information Technology, Hyderabad Master's Degree,  Information Technology 2004  – 2006 International Institute Of Information Technology, Hyderabad Master's Degree,  Information Technology 2004  – 2006 International Institute Of Information Technology, Hyderabad Master's Degree,  Information Technology 2004  – 2006 State University of New York College at Buffalo Bachelor's Degree,  Computer Software Engineering 1998  – 2002 State University of New York College at Buffalo Bachelor's Degree,  Computer Software Engineering 1998  – 2002 State University of New York College at Buffalo Bachelor's Degree,  Computer Software Engineering 1998  – 2002 ", "Skills Unix Intel Linux SoC NFS Perl Debugging System Administration VLSI Unix Shell Scripting Clustering High Availability High Performance... Fault Tolerance Samba AFS Plotters Process Automation SSH VNC Rsync MySQL Change Management Customer Support See 9+     See less Skills  Unix Intel Linux SoC NFS Perl Debugging System Administration VLSI Unix Shell Scripting Clustering High Availability High Performance... Fault Tolerance Samba AFS Plotters Process Automation SSH VNC Rsync MySQL Change Management Customer Support See 9+     See less Unix Intel Linux SoC NFS Perl Debugging System Administration VLSI Unix Shell Scripting Clustering High Availability High Performance... Fault Tolerance Samba AFS Plotters Process Automation SSH VNC Rsync MySQL Change Management Customer Support See 9+     See less Unix Intel Linux SoC NFS Perl Debugging System Administration VLSI Unix Shell Scripting Clustering High Availability High Performance... Fault Tolerance Samba AFS Plotters Process Automation SSH VNC Rsync MySQL Change Management Customer Support See 9+     See less ", "Summary I am currently employed at Intel Corporation. \n \nI have done everything from basic pc maintenance, server validation, server administration, software QA, and building a 500+ node network from the ground up. My experience thus far has allowed me to develop a real swiss army knife skill set. While I specialize in computer hardware/firmware diagnostics I have done a little bit of everything, and can be considered a jack of all trades. \n \nSpecialties: Extensive Desktop and Server validation. OS Imaging. Summary I am currently employed at Intel Corporation. \n \nI have done everything from basic pc maintenance, server validation, server administration, software QA, and building a 500+ node network from the ground up. My experience thus far has allowed me to develop a real swiss army knife skill set. While I specialize in computer hardware/firmware diagnostics I have done a little bit of everything, and can be considered a jack of all trades. \n \nSpecialties: Extensive Desktop and Server validation. OS Imaging. I am currently employed at Intel Corporation. \n \nI have done everything from basic pc maintenance, server validation, server administration, software QA, and building a 500+ node network from the ground up. My experience thus far has allowed me to develop a real swiss army knife skill set. While I specialize in computer hardware/firmware diagnostics I have done a little bit of everything, and can be considered a jack of all trades. \n \nSpecialties: Extensive Desktop and Server validation. OS Imaging. I am currently employed at Intel Corporation. \n \nI have done everything from basic pc maintenance, server validation, server administration, software QA, and building a 500+ node network from the ground up. My experience thus far has allowed me to develop a real swiss army knife skill set. While I specialize in computer hardware/firmware diagnostics I have done a little bit of everything, and can be considered a jack of all trades. \n \nSpecialties: Extensive Desktop and Server validation. OS Imaging. Experience Systems Administrator Intel Corporation December 2014  – Present (9 months) Hillsboro, Oregon Currently I am the systems administrator for a small secure computing enclave. Active ownership includes hardware support, os installation and support, environment wide system backups, and MS Active Directory domain administration. Systems Administrator Kelly Services(Intel Corporation) January 2012  –  December 2014  (3 years) Hillsboro, Oregon systems administrator for a small secure computing enclave. Active ownership includes hardware support, os installation and support, environment wide system backups, and MS Active Directory domain administration. Lab Operations Engineer Microsoft Corporation October 2009  –  January 2012  (2 years 4 months) I am responsible for two testing labs at Microsoft, encompassing around 4,000 systems. Both labs host a number of Hyper-V Virtual Machine hosts. Duties include deployment of new systems, responding to customer support tickets, and overall improvement of lab infrastructure. \n \nInfrastructure management includes a protected domain, AD, DHCP, DNS, WINS, and WDS. PC Test Technician Intel Corporation August 2008  –  August 2009  (1 year 1 month) Validation of Intel computing systems having just completed build in a manufacturing lab. Responsible for full end to end system validation, firmware updates, and debug of errors. Ensured quality systems were shipped to our customers. vPro Validation Technician Kelly IT Resources February 2007  –  February 2008  (1 year 1 month) Validation of vPro hardware and software per defined test plans, reporting of failures, and build out of net hardware platforms for qualification. Contingent Worker The Oregon Clinic September 2007  –  December 2007  (4 months) In this position I was responsible for pc and printer installation in a medical building, network configuration, server configuration, rack configuration, responding to help desk calls, and assisting anywhere else that was needed. I provided support to 200+ doctors, surgeons, nurses, and over 500 network nodes. PC Test Technician Intel Corporation July 2005  –  July 2006  (1 year 1 month) Systems Administrator Intel Corporation December 2014  – Present (9 months) Hillsboro, Oregon Currently I am the systems administrator for a small secure computing enclave. Active ownership includes hardware support, os installation and support, environment wide system backups, and MS Active Directory domain administration. Systems Administrator Intel Corporation December 2014  – Present (9 months) Hillsboro, Oregon Currently I am the systems administrator for a small secure computing enclave. Active ownership includes hardware support, os installation and support, environment wide system backups, and MS Active Directory domain administration. Systems Administrator Kelly Services(Intel Corporation) January 2012  –  December 2014  (3 years) Hillsboro, Oregon systems administrator for a small secure computing enclave. Active ownership includes hardware support, os installation and support, environment wide system backups, and MS Active Directory domain administration. Systems Administrator Kelly Services(Intel Corporation) January 2012  –  December 2014  (3 years) Hillsboro, Oregon systems administrator for a small secure computing enclave. Active ownership includes hardware support, os installation and support, environment wide system backups, and MS Active Directory domain administration. Lab Operations Engineer Microsoft Corporation October 2009  –  January 2012  (2 years 4 months) I am responsible for two testing labs at Microsoft, encompassing around 4,000 systems. Both labs host a number of Hyper-V Virtual Machine hosts. Duties include deployment of new systems, responding to customer support tickets, and overall improvement of lab infrastructure. \n \nInfrastructure management includes a protected domain, AD, DHCP, DNS, WINS, and WDS. Lab Operations Engineer Microsoft Corporation October 2009  –  January 2012  (2 years 4 months) I am responsible for two testing labs at Microsoft, encompassing around 4,000 systems. Both labs host a number of Hyper-V Virtual Machine hosts. Duties include deployment of new systems, responding to customer support tickets, and overall improvement of lab infrastructure. \n \nInfrastructure management includes a protected domain, AD, DHCP, DNS, WINS, and WDS. PC Test Technician Intel Corporation August 2008  –  August 2009  (1 year 1 month) Validation of Intel computing systems having just completed build in a manufacturing lab. Responsible for full end to end system validation, firmware updates, and debug of errors. Ensured quality systems were shipped to our customers. PC Test Technician Intel Corporation August 2008  –  August 2009  (1 year 1 month) Validation of Intel computing systems having just completed build in a manufacturing lab. Responsible for full end to end system validation, firmware updates, and debug of errors. Ensured quality systems were shipped to our customers. vPro Validation Technician Kelly IT Resources February 2007  –  February 2008  (1 year 1 month) Validation of vPro hardware and software per defined test plans, reporting of failures, and build out of net hardware platforms for qualification. vPro Validation Technician Kelly IT Resources February 2007  –  February 2008  (1 year 1 month) Validation of vPro hardware and software per defined test plans, reporting of failures, and build out of net hardware platforms for qualification. Contingent Worker The Oregon Clinic September 2007  –  December 2007  (4 months) In this position I was responsible for pc and printer installation in a medical building, network configuration, server configuration, rack configuration, responding to help desk calls, and assisting anywhere else that was needed. I provided support to 200+ doctors, surgeons, nurses, and over 500 network nodes. Contingent Worker The Oregon Clinic September 2007  –  December 2007  (4 months) In this position I was responsible for pc and printer installation in a medical building, network configuration, server configuration, rack configuration, responding to help desk calls, and assisting anywhere else that was needed. I provided support to 200+ doctors, surgeons, nurses, and over 500 network nodes. PC Test Technician Intel Corporation July 2005  –  July 2006  (1 year 1 month) PC Test Technician Intel Corporation July 2005  –  July 2006  (1 year 1 month) Skills Validation Testing Cloud Computing Computer Maintenance Software Quality... Hyper-V SaaS DNS Operating Systems DHCP Networking System Deployment Hardware Skills  Validation Testing Cloud Computing Computer Maintenance Software Quality... Hyper-V SaaS DNS Operating Systems DHCP Networking System Deployment Hardware Validation Testing Cloud Computing Computer Maintenance Software Quality... Hyper-V SaaS DNS Operating Systems DHCP Networking System Deployment Hardware Validation Testing Cloud Computing Computer Maintenance Software Quality... Hyper-V SaaS DNS Operating Systems DHCP Networking System Deployment Hardware Education Heald College Associate of Science (A.S.),  Computer Network Administration 2003  – 2005 Major studies included network administration and design, computer hardware repair, and os installation. Minor studies included VB/C# programming, SQL database administration, and Linux system administration. Activities and Societies:  Phi Theta Kappa Heald College Associate of Science (A.S.),  Computer Network Administration 2003  – 2005 Major studies included network administration and design, computer hardware repair, and os installation. Minor studies included VB/C# programming, SQL database administration, and Linux system administration. Activities and Societies:  Phi Theta Kappa Heald College Associate of Science (A.S.),  Computer Network Administration 2003  – 2005 Major studies included network administration and design, computer hardware repair, and os installation. Minor studies included VB/C# programming, SQL database administration, and Linux system administration. Activities and Societies:  Phi Theta Kappa Heald College Associate of Science (A.S.),  Computer Network Administration 2003  – 2005 Major studies included network administration and design, computer hardware repair, and os installation. Minor studies included VB/C# programming, SQL database administration, and Linux system administration. Activities and Societies:  Phi Theta Kappa ", "Skills Solaris Virtualization Unix SAN Linux DNS Cisco Technologies TCP/IP Red Hat Linux NAS VMware System Administration System Deployment Technical Support Unix Shell Scripting Firewalls Operating Systems PIX Checkpoint Perl Routers VPN ITIL Troubleshooting High Availability AIX Oracle Disaster Recovery AIX Administration Clariion Weblogic Java Netscreen RedHat Netbackup Apache Cluster Routing Shell Scripting Cisco VIOS CC&B IBM XIV Infrastructure ITIL Certified RHEV Qlogic See 32+     See less Skills  Solaris Virtualization Unix SAN Linux DNS Cisco Technologies TCP/IP Red Hat Linux NAS VMware System Administration System Deployment Technical Support Unix Shell Scripting Firewalls Operating Systems PIX Checkpoint Perl Routers VPN ITIL Troubleshooting High Availability AIX Oracle Disaster Recovery AIX Administration Clariion Weblogic Java Netscreen RedHat Netbackup Apache Cluster Routing Shell Scripting Cisco VIOS CC&B IBM XIV Infrastructure ITIL Certified RHEV Qlogic See 32+     See less Solaris Virtualization Unix SAN Linux DNS Cisco Technologies TCP/IP Red Hat Linux NAS VMware System Administration System Deployment Technical Support Unix Shell Scripting Firewalls Operating Systems PIX Checkpoint Perl Routers VPN ITIL Troubleshooting High Availability AIX Oracle Disaster Recovery AIX Administration Clariion Weblogic Java Netscreen RedHat Netbackup Apache Cluster Routing Shell Scripting Cisco VIOS CC&B IBM XIV Infrastructure ITIL Certified RHEV Qlogic See 32+     See less Solaris Virtualization Unix SAN Linux DNS Cisco Technologies TCP/IP Red Hat Linux NAS VMware System Administration System Deployment Technical Support Unix Shell Scripting Firewalls Operating Systems PIX Checkpoint Perl Routers VPN ITIL Troubleshooting High Availability AIX Oracle Disaster Recovery AIX Administration Clariion Weblogic Java Netscreen RedHat Netbackup Apache Cluster Routing Shell Scripting Cisco VIOS CC&B IBM XIV Infrastructure ITIL Certified RHEV Qlogic See 32+     See less ", "Summary Specialties:Apache web server administration, C/C++, cross-site collaboration, eDiscovery, environment automation, global development teams, global-scale innovation, HPC, Open Source Software, parallel programming, Perl, project management, public speaking, secure collaboration, software development, training, Unix administration, very large-scale computing environments, wikis Summary Specialties:Apache web server administration, C/C++, cross-site collaboration, eDiscovery, environment automation, global development teams, global-scale innovation, HPC, Open Source Software, parallel programming, Perl, project management, public speaking, secure collaboration, software development, training, Unix administration, very large-scale computing environments, wikis Specialties:Apache web server administration, C/C++, cross-site collaboration, eDiscovery, environment automation, global development teams, global-scale innovation, HPC, Open Source Software, parallel programming, Perl, project management, public speaking, secure collaboration, software development, training, Unix administration, very large-scale computing environments, wikis Specialties:Apache web server administration, C/C++, cross-site collaboration, eDiscovery, environment automation, global development teams, global-scale innovation, HPC, Open Source Software, parallel programming, Perl, project management, public speaking, secure collaboration, software development, training, Unix administration, very large-scale computing environments, wikis Experience Notary Public Self Employed November 2012  – Present (2 years 10 months) Notary Public In and For the State of Oregon \n \nSigning Agent and mobile Notary. Provide mobile Notary services on behalf of the State of Oregon. Construction and Remodeling Self Employed January 2011  – Present (4 years 8 months) Responsible for all aspects of the project cycle: job scoping, creating detailed drawings, estimating work effort, writing and submitting bids, planning, creating materials lists, purchasing, labor, budgeting, billing, staying on schedule, etc. \n \nManage scope of work, budget, time, and customers. \n \nUse National and Local Building Codes and minimum acceptable standards for work. \n \nFraming, finish work, kitchens, bathrooms, flooring (hardwood, laminate, tile, etc), drywall (walls and ceilings), plumbing, electrical, indoor painting, outdoor (whole house) painting, replacing windows and doors, residing, roofing, masonry, concrete, decking, fencing, etc. IT Solutions Architect, DevOps, Systems Administrator Intel Corporation December 1998  –  December 2010  (12 years 1 month) Hillsboro, Oregon - Systems administrator in ITEC, spanning over 50 sites and 20 countries. \n- Directly supported multiple CPU and chipset design projects and provided tapeout support for multiple microprocessor families. \n- Sole area owner of Unix web environment. Included all project websites, all wikis supported globally, and main corporate wiki. Maintained >99.999% uptime over 3 consecutive years. \n- Created secure collaboration environment for use with design projects. Fully encrypted environment included wikis, databases, project web sites, project workspaces, file servers, and revision control. \n- Created enterprise solutions for eDiscovery. \n- Maintained administrative scripts and programs to automate, simplify and augment routine tasks. Rewrote older scripts to utilize multi-threaded and parallel algorithms, increasing speedup and throughput while vastly reducing execution times. \n- Designed completely automated home directory management system for internal customer base. Automated and removed day-to-day hands-on management. \n- Designed high availability (HA), fault tolerant web farm hosting mission critical applications using off the shelf computers and open source software. \n- Led large-scale initiative merging multiple disparate computing environments and infrastructures into single homogeneous environment while minimizing downtime. \n- Created automated Unix group management system, converting from completely manual process to fully automated web based system. Decreased group approval times from weeks to hours. \n- Created Unix user account management system for the enterprise-wide EC environment; fully automated Unix account management and reduced process to one step. \n- Created Windows-based Unix password changing program allowing users to change/sync their Windows password with all their cross-site Unix accounts. \n- Created enterprise-wide Unix password aging mechanism supporting all flavors of Unix with a single implementation. Software Developer, Process Engineer, Systems Administrator Intel Corporation December 1998  –  December 2010  (12 years 1 month) Hillsboro, Oregon - Developed code and maintained administrative scripts and programs to automate, simplify, and augment routine tasks. Refactored scripts to utilize multi-threaded and parallel algorithms, increasing speedup and throughput while vastly reducing execution time. \n- Designed enterprise-wide scripts to collect performance analysis data for all Unix versions. \n- Created automated survey generator; given a text file with questions and simple commands, allowed for on-the-fly generation of complex web-based customer surveys easily tailored to individuals. \n- Created automated librarian and checkout program with reservations and reminders for pool of projectors and travel/loaner laptops. \n- Taught training classes to peers and internal customers. \n- Mentored colleagues on programming, software development, and project management. \n- Managed interns and students to success, coaching them to meet deadlines and complete deliverables. Mentored and taught programming skills, software QA, regression and unit testing so interns ended their internship with more knowledge and skills then when they started. \n- Process Engineer. Identified request trends and implemented steps to resolve top issues, increased productivity and improved customer satisfaction by reducing number of incoming requests, and automated routine tasks to reduce request turnaround time. \n- Team lead for day shift in Computing Support Center and for On-Call support team. \n- Team lead for move of computing and internal customer base from one campus to another. Lead support efforts during entire scope of move process. \n- Created inventory management system for tracking assets utilizing barcodes. Created custom scanning application for Palm Pilots with integrated barcode scanners. \n- Y2K team responsible for Oregon event rollover support. \n- Only on-site weekend and night Computing Support representative for Pentium 4 microprocessor design team. Provided tapeout support for multiple new Intel microprocessor families. Independent Distributor Xocai (MXI Corp) March 2008  –  November 2010  (2 years 9 months) Distributor of Xocai Healthy Chocolate. \n \nMy primary focus is health and wellness, helping you achieve solutions for weight loss, energy, performance, and healthy aging. Along the way I have also helped people become financially independent. \n \nDiscover one of the fastest growing industries in the world. Backed by a stable company and instant recognition, the product is a unique, patented, and category creating business that is one of the hottest topics of research and discussion on the medical community world-wide. \n \nI am always looking for leaders to work with who are interested in success! Co-founder, Program/Project Manager ProjectWish January 2005  –  October 2008  (3 years 10 months) Responsible for directly managing Open Source online video game project of 20-40 members distributed across a dozen timezones and countries through the entire project lifecycle. Accountable for day-to-day running of the project. \n \nUsed both Agile and Waterfall SDLC methodologies. \n \nMentored and coached contributors on programming, software development, project scoping, project management, and scheduling. Introduced team members to the computer game industry, where they could learn by doing. Software Validation Engineer Graphic Enterprises 1995  –  1997  (2 years) Led software testing and QA team, testing software written for the printing and prepress industry. Debugged software products to fix customer problems and bugs uncovered during testing. \n \nDesigned regression test framework to automate testing and debugging, improving full suite testing time. \n \nCreated database of bugs and real-world customer issues that fed into test suite, continuously increasing test coverage. \n \nInitiated methods for quality control of software products using continuous integration. \n \nCreated dashboard displaying results of test output for quick visual indicators of testing. \n \nRefactored C++ code to improve software performance. Rewrote key algorithms in Assembler for efficiency and speedup gains. Inservice Instructor Lake Local School District July 1995  –  August 1995  (2 months) Uniontown, Ohio Developed a curriculum and trained school district teachers and administrators on using computers and technology in the classroom. Notary Public Self Employed November 2012  – Present (2 years 10 months) Notary Public In and For the State of Oregon \n \nSigning Agent and mobile Notary. Provide mobile Notary services on behalf of the State of Oregon. Notary Public Self Employed November 2012  – Present (2 years 10 months) Notary Public In and For the State of Oregon \n \nSigning Agent and mobile Notary. Provide mobile Notary services on behalf of the State of Oregon. Construction and Remodeling Self Employed January 2011  – Present (4 years 8 months) Responsible for all aspects of the project cycle: job scoping, creating detailed drawings, estimating work effort, writing and submitting bids, planning, creating materials lists, purchasing, labor, budgeting, billing, staying on schedule, etc. \n \nManage scope of work, budget, time, and customers. \n \nUse National and Local Building Codes and minimum acceptable standards for work. \n \nFraming, finish work, kitchens, bathrooms, flooring (hardwood, laminate, tile, etc), drywall (walls and ceilings), plumbing, electrical, indoor painting, outdoor (whole house) painting, replacing windows and doors, residing, roofing, masonry, concrete, decking, fencing, etc. Construction and Remodeling Self Employed January 2011  – Present (4 years 8 months) Responsible for all aspects of the project cycle: job scoping, creating detailed drawings, estimating work effort, writing and submitting bids, planning, creating materials lists, purchasing, labor, budgeting, billing, staying on schedule, etc. \n \nManage scope of work, budget, time, and customers. \n \nUse National and Local Building Codes and minimum acceptable standards for work. \n \nFraming, finish work, kitchens, bathrooms, flooring (hardwood, laminate, tile, etc), drywall (walls and ceilings), plumbing, electrical, indoor painting, outdoor (whole house) painting, replacing windows and doors, residing, roofing, masonry, concrete, decking, fencing, etc. IT Solutions Architect, DevOps, Systems Administrator Intel Corporation December 1998  –  December 2010  (12 years 1 month) Hillsboro, Oregon - Systems administrator in ITEC, spanning over 50 sites and 20 countries. \n- Directly supported multiple CPU and chipset design projects and provided tapeout support for multiple microprocessor families. \n- Sole area owner of Unix web environment. Included all project websites, all wikis supported globally, and main corporate wiki. Maintained >99.999% uptime over 3 consecutive years. \n- Created secure collaboration environment for use with design projects. Fully encrypted environment included wikis, databases, project web sites, project workspaces, file servers, and revision control. \n- Created enterprise solutions for eDiscovery. \n- Maintained administrative scripts and programs to automate, simplify and augment routine tasks. Rewrote older scripts to utilize multi-threaded and parallel algorithms, increasing speedup and throughput while vastly reducing execution times. \n- Designed completely automated home directory management system for internal customer base. Automated and removed day-to-day hands-on management. \n- Designed high availability (HA), fault tolerant web farm hosting mission critical applications using off the shelf computers and open source software. \n- Led large-scale initiative merging multiple disparate computing environments and infrastructures into single homogeneous environment while minimizing downtime. \n- Created automated Unix group management system, converting from completely manual process to fully automated web based system. Decreased group approval times from weeks to hours. \n- Created Unix user account management system for the enterprise-wide EC environment; fully automated Unix account management and reduced process to one step. \n- Created Windows-based Unix password changing program allowing users to change/sync their Windows password with all their cross-site Unix accounts. \n- Created enterprise-wide Unix password aging mechanism supporting all flavors of Unix with a single implementation. IT Solutions Architect, DevOps, Systems Administrator Intel Corporation December 1998  –  December 2010  (12 years 1 month) Hillsboro, Oregon - Systems administrator in ITEC, spanning over 50 sites and 20 countries. \n- Directly supported multiple CPU and chipset design projects and provided tapeout support for multiple microprocessor families. \n- Sole area owner of Unix web environment. Included all project websites, all wikis supported globally, and main corporate wiki. Maintained >99.999% uptime over 3 consecutive years. \n- Created secure collaboration environment for use with design projects. Fully encrypted environment included wikis, databases, project web sites, project workspaces, file servers, and revision control. \n- Created enterprise solutions for eDiscovery. \n- Maintained administrative scripts and programs to automate, simplify and augment routine tasks. Rewrote older scripts to utilize multi-threaded and parallel algorithms, increasing speedup and throughput while vastly reducing execution times. \n- Designed completely automated home directory management system for internal customer base. Automated and removed day-to-day hands-on management. \n- Designed high availability (HA), fault tolerant web farm hosting mission critical applications using off the shelf computers and open source software. \n- Led large-scale initiative merging multiple disparate computing environments and infrastructures into single homogeneous environment while minimizing downtime. \n- Created automated Unix group management system, converting from completely manual process to fully automated web based system. Decreased group approval times from weeks to hours. \n- Created Unix user account management system for the enterprise-wide EC environment; fully automated Unix account management and reduced process to one step. \n- Created Windows-based Unix password changing program allowing users to change/sync their Windows password with all their cross-site Unix accounts. \n- Created enterprise-wide Unix password aging mechanism supporting all flavors of Unix with a single implementation. Software Developer, Process Engineer, Systems Administrator Intel Corporation December 1998  –  December 2010  (12 years 1 month) Hillsboro, Oregon - Developed code and maintained administrative scripts and programs to automate, simplify, and augment routine tasks. Refactored scripts to utilize multi-threaded and parallel algorithms, increasing speedup and throughput while vastly reducing execution time. \n- Designed enterprise-wide scripts to collect performance analysis data for all Unix versions. \n- Created automated survey generator; given a text file with questions and simple commands, allowed for on-the-fly generation of complex web-based customer surveys easily tailored to individuals. \n- Created automated librarian and checkout program with reservations and reminders for pool of projectors and travel/loaner laptops. \n- Taught training classes to peers and internal customers. \n- Mentored colleagues on programming, software development, and project management. \n- Managed interns and students to success, coaching them to meet deadlines and complete deliverables. Mentored and taught programming skills, software QA, regression and unit testing so interns ended their internship with more knowledge and skills then when they started. \n- Process Engineer. Identified request trends and implemented steps to resolve top issues, increased productivity and improved customer satisfaction by reducing number of incoming requests, and automated routine tasks to reduce request turnaround time. \n- Team lead for day shift in Computing Support Center and for On-Call support team. \n- Team lead for move of computing and internal customer base from one campus to another. Lead support efforts during entire scope of move process. \n- Created inventory management system for tracking assets utilizing barcodes. Created custom scanning application for Palm Pilots with integrated barcode scanners. \n- Y2K team responsible for Oregon event rollover support. \n- Only on-site weekend and night Computing Support representative for Pentium 4 microprocessor design team. Provided tapeout support for multiple new Intel microprocessor families. Software Developer, Process Engineer, Systems Administrator Intel Corporation December 1998  –  December 2010  (12 years 1 month) Hillsboro, Oregon - Developed code and maintained administrative scripts and programs to automate, simplify, and augment routine tasks. Refactored scripts to utilize multi-threaded and parallel algorithms, increasing speedup and throughput while vastly reducing execution time. \n- Designed enterprise-wide scripts to collect performance analysis data for all Unix versions. \n- Created automated survey generator; given a text file with questions and simple commands, allowed for on-the-fly generation of complex web-based customer surveys easily tailored to individuals. \n- Created automated librarian and checkout program with reservations and reminders for pool of projectors and travel/loaner laptops. \n- Taught training classes to peers and internal customers. \n- Mentored colleagues on programming, software development, and project management. \n- Managed interns and students to success, coaching them to meet deadlines and complete deliverables. Mentored and taught programming skills, software QA, regression and unit testing so interns ended their internship with more knowledge and skills then when they started. \n- Process Engineer. Identified request trends and implemented steps to resolve top issues, increased productivity and improved customer satisfaction by reducing number of incoming requests, and automated routine tasks to reduce request turnaround time. \n- Team lead for day shift in Computing Support Center and for On-Call support team. \n- Team lead for move of computing and internal customer base from one campus to another. Lead support efforts during entire scope of move process. \n- Created inventory management system for tracking assets utilizing barcodes. Created custom scanning application for Palm Pilots with integrated barcode scanners. \n- Y2K team responsible for Oregon event rollover support. \n- Only on-site weekend and night Computing Support representative for Pentium 4 microprocessor design team. Provided tapeout support for multiple new Intel microprocessor families. Independent Distributor Xocai (MXI Corp) March 2008  –  November 2010  (2 years 9 months) Distributor of Xocai Healthy Chocolate. \n \nMy primary focus is health and wellness, helping you achieve solutions for weight loss, energy, performance, and healthy aging. Along the way I have also helped people become financially independent. \n \nDiscover one of the fastest growing industries in the world. Backed by a stable company and instant recognition, the product is a unique, patented, and category creating business that is one of the hottest topics of research and discussion on the medical community world-wide. \n \nI am always looking for leaders to work with who are interested in success! Independent Distributor Xocai (MXI Corp) March 2008  –  November 2010  (2 years 9 months) Distributor of Xocai Healthy Chocolate. \n \nMy primary focus is health and wellness, helping you achieve solutions for weight loss, energy, performance, and healthy aging. Along the way I have also helped people become financially independent. \n \nDiscover one of the fastest growing industries in the world. Backed by a stable company and instant recognition, the product is a unique, patented, and category creating business that is one of the hottest topics of research and discussion on the medical community world-wide. \n \nI am always looking for leaders to work with who are interested in success! Co-founder, Program/Project Manager ProjectWish January 2005  –  October 2008  (3 years 10 months) Responsible for directly managing Open Source online video game project of 20-40 members distributed across a dozen timezones and countries through the entire project lifecycle. Accountable for day-to-day running of the project. \n \nUsed both Agile and Waterfall SDLC methodologies. \n \nMentored and coached contributors on programming, software development, project scoping, project management, and scheduling. Introduced team members to the computer game industry, where they could learn by doing. Co-founder, Program/Project Manager ProjectWish January 2005  –  October 2008  (3 years 10 months) Responsible for directly managing Open Source online video game project of 20-40 members distributed across a dozen timezones and countries through the entire project lifecycle. Accountable for day-to-day running of the project. \n \nUsed both Agile and Waterfall SDLC methodologies. \n \nMentored and coached contributors on programming, software development, project scoping, project management, and scheduling. Introduced team members to the computer game industry, where they could learn by doing. Software Validation Engineer Graphic Enterprises 1995  –  1997  (2 years) Led software testing and QA team, testing software written for the printing and prepress industry. Debugged software products to fix customer problems and bugs uncovered during testing. \n \nDesigned regression test framework to automate testing and debugging, improving full suite testing time. \n \nCreated database of bugs and real-world customer issues that fed into test suite, continuously increasing test coverage. \n \nInitiated methods for quality control of software products using continuous integration. \n \nCreated dashboard displaying results of test output for quick visual indicators of testing. \n \nRefactored C++ code to improve software performance. Rewrote key algorithms in Assembler for efficiency and speedup gains. Software Validation Engineer Graphic Enterprises 1995  –  1997  (2 years) Led software testing and QA team, testing software written for the printing and prepress industry. Debugged software products to fix customer problems and bugs uncovered during testing. \n \nDesigned regression test framework to automate testing and debugging, improving full suite testing time. \n \nCreated database of bugs and real-world customer issues that fed into test suite, continuously increasing test coverage. \n \nInitiated methods for quality control of software products using continuous integration. \n \nCreated dashboard displaying results of test output for quick visual indicators of testing. \n \nRefactored C++ code to improve software performance. Rewrote key algorithms in Assembler for efficiency and speedup gains. Inservice Instructor Lake Local School District July 1995  –  August 1995  (2 months) Uniontown, Ohio Developed a curriculum and trained school district teachers and administrators on using computers and technology in the classroom. Inservice Instructor Lake Local School District July 1995  –  August 1995  (2 months) Uniontown, Ohio Developed a curriculum and trained school district teachers and administrators on using computers and technology in the classroom. Skills Perl Unix Apache Agile Methodologies Linux Subversion Shell Scripting Distributed Systems Open Source Program Management HTML MySQL Software Development Python High Performance... Active Directory High Availability Computer Security Wikis Samba Cloud Computing Software Engineering Project Management XML PHP Intel Solution Architecture Open Source Software Parallel Programming Training Public Speaking Change Management CGI Desktop Environment International... Software Testing C/C++ environment automation Global Development cross-site collaboration secure collaboration enhancing global... very large-scale... eDiscovery algorithm analysis large dataset... intern management software security AFS See 34+     See less Skills  Perl Unix Apache Agile Methodologies Linux Subversion Shell Scripting Distributed Systems Open Source Program Management HTML MySQL Software Development Python High Performance... Active Directory High Availability Computer Security Wikis Samba Cloud Computing Software Engineering Project Management XML PHP Intel Solution Architecture Open Source Software Parallel Programming Training Public Speaking Change Management CGI Desktop Environment International... Software Testing C/C++ environment automation Global Development cross-site collaboration secure collaboration enhancing global... very large-scale... eDiscovery algorithm analysis large dataset... intern management software security AFS See 34+     See less Perl Unix Apache Agile Methodologies Linux Subversion Shell Scripting Distributed Systems Open Source Program Management HTML MySQL Software Development Python High Performance... Active Directory High Availability Computer Security Wikis Samba Cloud Computing Software Engineering Project Management XML PHP Intel Solution Architecture Open Source Software Parallel Programming Training Public Speaking Change Management CGI Desktop Environment International... Software Testing C/C++ environment automation Global Development cross-site collaboration secure collaboration enhancing global... very large-scale... eDiscovery algorithm analysis large dataset... intern management software security AFS See 34+     See less Perl Unix Apache Agile Methodologies Linux Subversion Shell Scripting Distributed Systems Open Source Program Management HTML MySQL Software Development Python High Performance... Active Directory High Availability Computer Security Wikis Samba Cloud Computing Software Engineering Project Management XML PHP Intel Solution Architecture Open Source Software Parallel Programming Training Public Speaking Change Management CGI Desktop Environment International... Software Testing C/C++ environment automation Global Development cross-site collaboration secure collaboration enhancing global... very large-scale... eDiscovery algorithm analysis large dataset... intern management software security AFS See 34+     See less Education The University of Akron BSCS,  Computer Science 1997 Lake High School 1992 The University of Akron BSCS,  Computer Science 1997 The University of Akron BSCS,  Computer Science 1997 The University of Akron BSCS,  Computer Science 1997 Lake High School 1992 Lake High School 1992 Lake High School 1992 Honors & Awards Additional Honors & Awards Eagle Scout \nMultiple Intel divisional recognition awards Additional Honors & Awards Eagle Scout \nMultiple Intel divisional recognition awards Additional Honors & Awards Eagle Scout \nMultiple Intel divisional recognition awards Additional Honors & Awards Eagle Scout \nMultiple Intel divisional recognition awards ", "Experience Systems Administrator Intel Corporation May 2013  – Present (2 years 4 months) Systems Administrator AePONA June 2000  –  March 2013  (12 years 10 months) Systems Administrator Intel Corporation May 2013  – Present (2 years 4 months) Systems Administrator Intel Corporation May 2013  – Present (2 years 4 months) Systems Administrator AePONA June 2000  –  March 2013  (12 years 10 months) Systems Administrator AePONA June 2000  –  March 2013  (12 years 10 months) Skills TCP/IP Unix Solaris Linux Telecommunications SS7 Shell Scripting IP Red Hat Linux Cloud Computing SMS Java Eclipse Agile Methodologies Integration Mac OS X Server Mac OS Mac & PC platforms Desktop Administration Linux System... Linux Server Linux Kernel Linux Desktop Linux KVM Linux Firewalls Virtualization VirtualBox Virtual Machines See 13+     See less Skills  TCP/IP Unix Solaris Linux Telecommunications SS7 Shell Scripting IP Red Hat Linux Cloud Computing SMS Java Eclipse Agile Methodologies Integration Mac OS X Server Mac OS Mac & PC platforms Desktop Administration Linux System... Linux Server Linux Kernel Linux Desktop Linux KVM Linux Firewalls Virtualization VirtualBox Virtual Machines See 13+     See less TCP/IP Unix Solaris Linux Telecommunications SS7 Shell Scripting IP Red Hat Linux Cloud Computing SMS Java Eclipse Agile Methodologies Integration Mac OS X Server Mac OS Mac & PC platforms Desktop Administration Linux System... Linux Server Linux Kernel Linux Desktop Linux KVM Linux Firewalls Virtualization VirtualBox Virtual Machines See 13+     See less TCP/IP Unix Solaris Linux Telecommunications SS7 Shell Scripting IP Red Hat Linux Cloud Computing SMS Java Eclipse Agile Methodologies Integration Mac OS X Server Mac OS Mac & PC platforms Desktop Administration Linux System... Linux Server Linux Kernel Linux Desktop Linux KVM Linux Firewalls Virtualization VirtualBox Virtual Machines See 13+     See less Education Belfast Metropolitan College Linux Professional Institute,  Linux Essentials Certified , Passed 2014  – 2015 Belfast Metropolitan College Linux Professional Institute,  Linux Essentials Certified , Passed 2014  – 2015 Belfast Metropolitan College Linux Professional Institute,  Linux Essentials Certified , Passed 2014  – 2015 Belfast Metropolitan College Linux Professional Institute,  Linux Essentials Certified , Passed 2014  – 2015 ", "Summary Specialties:Programming, Troubleshooting, Graphic Design, Web Design, Windows XP, Windows XP Professional, Windows Vista, Windows 7, HTML, PHP, Microsoft QuickBasic, Python, Java, C++. Summary Specialties:Programming, Troubleshooting, Graphic Design, Web Design, Windows XP, Windows XP Professional, Windows Vista, Windows 7, HTML, PHP, Microsoft QuickBasic, Python, Java, C++. Specialties:Programming, Troubleshooting, Graphic Design, Web Design, Windows XP, Windows XP Professional, Windows Vista, Windows 7, HTML, PHP, Microsoft QuickBasic, Python, Java, C++. Specialties:Programming, Troubleshooting, Graphic Design, Web Design, Windows XP, Windows XP Professional, Windows Vista, Windows 7, HTML, PHP, Microsoft QuickBasic, Python, Java, C++. Experience Linux Systems Administrator Intel Corporation May 2015  – Present (4 months) Chandler, Arizona Security Solutions Engineer JPMorgan Chase July 2013  –  April 2015  (1 year 10 months) New York, NY -Parse security log files using Perl to extract specific pieces of information \n-Created Perl and C# applications to automate tasks \n-Assist with configuring Apple related products to firms standards and policies \n-Automate installations and configurations of Apache using Perl \n-Assisted with encryption efforts of files and databases. GameSpy Volunteer GameSpy Industries January 2007  –  December 2013  (7 years) -Volunteer Administrator for GameSpy Industries program known as GameSpy Arcade. Supervising online players to ensure compliance with the Terms of Service \n \n-Volunteer Wizard Captain & Recruiter / Trainer for GameSpy Industries program called GameSpy Arcade. Managed the GameSpy Wizard Volunteer team. Director of tournament creation and execution. Recruiter and trainer of new Wizards. \n \n \n-Volunteer Guardian and Recruiter & Trainer for GameSpy Industries. Administrated gaming ladders. Recruiter and trainer of new Guardians. \n \n \n-Volunteer Helper for GameSpy Industries and IGN Entertainment. Responsible for assisting clients with GameSpy Industries / IGN Entertainment services. Senior Desktop Support Technician Rochester Institute of Technology March 2013  –  June 2013  (4 months) Rochester Institute of Technology -Assisted with maintaining RIT computer and network infrastructure \n-Supported faculty and staff with all aspects of computer equipment support and repairs \n-Provided customer assistance in person, remotely, and via phone \n-Troubleshoot, diagnose, and resolve computer issues \n-Manage and direct workflow of tickets \n-Manage and direct other technicians \n-Worked with Active Directory, PointSec Encryption, SCCM 2007 & 2012, and Munki. Senior Residential Computer Consultant Rochester Institute of Technology November 2010  –  June 2013  (2 years 8 months) I help fix Rochester Institute of Technology students, faculty, and staff computers. I interact one on one with the customers that come into the ITS Resnet office. When in the Tech Center I use a variety of tools to help fix, clean, and troubleshoot issues with a computer. Resident Advisor Rochester Institute of Technology March 2011  –  May 2013  (2 years 3 months) Build a sense of community on the floor. Provide residents with the resources they need to succeed. Maintaining order and providing a safe place to be in the residence halls. Fulfill my administrative duties as the RA to my floor and my Residence Life staff. Basically, being a leader and role model for my residents and the other RAs. Webmaster - New York Eta Chapter Phi Delta Theta Fraternity March 2010  –  May 2013  (3 years 3 months) As the webmaster, I am in charge of updating our website. I have designed a website template from scratch and coded the website around the design. I have implemented Mambo Content Management System into our new website. The new website is still under construction and still undergoing tests. Infrastructure Engineer JPMorgan Chase June 2012  –  August 2012  (3 months) -Assisted with decommissioning of assets. \n-Performed data entry duties through development of Perl scripts. \n-Operated under appropriate time constraints and proficiency requirements. \n-Developed a centralized ticketing system. Scholarship Chairman - New York Eta Chapter Phi Delta Theta Fraternity February 2011  –  May 2012  (1 year 4 months) Duty involves aiding fellow Brothers find assistance for any academic issues they may be facing. The scholarship chairman is also responsible for motivating Brothers to perform well academically. Risk Management Chair - New York Eta Chapter Phi Delta Theta Fraternity February 2010  –  May 2012  (2 years 4 months) -Conducts risk assessments involving the NY Eta Chapter \n-Working on bringing the Red Cross to RIT Greek Life to teach CPR IT Intern City of Rochester May 2011  –  August 2011  (4 months) Rochester, New York Area Provide client support for all software and hardware related issues for computers throughout the City of Rochester. Linux Systems Administrator Intel Corporation May 2015  – Present (4 months) Chandler, Arizona Linux Systems Administrator Intel Corporation May 2015  – Present (4 months) Chandler, Arizona Security Solutions Engineer JPMorgan Chase July 2013  –  April 2015  (1 year 10 months) New York, NY -Parse security log files using Perl to extract specific pieces of information \n-Created Perl and C# applications to automate tasks \n-Assist with configuring Apple related products to firms standards and policies \n-Automate installations and configurations of Apache using Perl \n-Assisted with encryption efforts of files and databases. Security Solutions Engineer JPMorgan Chase July 2013  –  April 2015  (1 year 10 months) New York, NY -Parse security log files using Perl to extract specific pieces of information \n-Created Perl and C# applications to automate tasks \n-Assist with configuring Apple related products to firms standards and policies \n-Automate installations and configurations of Apache using Perl \n-Assisted with encryption efforts of files and databases. GameSpy Volunteer GameSpy Industries January 2007  –  December 2013  (7 years) -Volunteer Administrator for GameSpy Industries program known as GameSpy Arcade. Supervising online players to ensure compliance with the Terms of Service \n \n-Volunteer Wizard Captain & Recruiter / Trainer for GameSpy Industries program called GameSpy Arcade. Managed the GameSpy Wizard Volunteer team. Director of tournament creation and execution. Recruiter and trainer of new Wizards. \n \n \n-Volunteer Guardian and Recruiter & Trainer for GameSpy Industries. Administrated gaming ladders. Recruiter and trainer of new Guardians. \n \n \n-Volunteer Helper for GameSpy Industries and IGN Entertainment. Responsible for assisting clients with GameSpy Industries / IGN Entertainment services. GameSpy Volunteer GameSpy Industries January 2007  –  December 2013  (7 years) -Volunteer Administrator for GameSpy Industries program known as GameSpy Arcade. Supervising online players to ensure compliance with the Terms of Service \n \n-Volunteer Wizard Captain & Recruiter / Trainer for GameSpy Industries program called GameSpy Arcade. Managed the GameSpy Wizard Volunteer team. Director of tournament creation and execution. Recruiter and trainer of new Wizards. \n \n \n-Volunteer Guardian and Recruiter & Trainer for GameSpy Industries. Administrated gaming ladders. Recruiter and trainer of new Guardians. \n \n \n-Volunteer Helper for GameSpy Industries and IGN Entertainment. Responsible for assisting clients with GameSpy Industries / IGN Entertainment services. Senior Desktop Support Technician Rochester Institute of Technology March 2013  –  June 2013  (4 months) Rochester Institute of Technology -Assisted with maintaining RIT computer and network infrastructure \n-Supported faculty and staff with all aspects of computer equipment support and repairs \n-Provided customer assistance in person, remotely, and via phone \n-Troubleshoot, diagnose, and resolve computer issues \n-Manage and direct workflow of tickets \n-Manage and direct other technicians \n-Worked with Active Directory, PointSec Encryption, SCCM 2007 & 2012, and Munki. Senior Desktop Support Technician Rochester Institute of Technology March 2013  –  June 2013  (4 months) Rochester Institute of Technology -Assisted with maintaining RIT computer and network infrastructure \n-Supported faculty and staff with all aspects of computer equipment support and repairs \n-Provided customer assistance in person, remotely, and via phone \n-Troubleshoot, diagnose, and resolve computer issues \n-Manage and direct workflow of tickets \n-Manage and direct other technicians \n-Worked with Active Directory, PointSec Encryption, SCCM 2007 & 2012, and Munki. Senior Residential Computer Consultant Rochester Institute of Technology November 2010  –  June 2013  (2 years 8 months) I help fix Rochester Institute of Technology students, faculty, and staff computers. I interact one on one with the customers that come into the ITS Resnet office. When in the Tech Center I use a variety of tools to help fix, clean, and troubleshoot issues with a computer. Senior Residential Computer Consultant Rochester Institute of Technology November 2010  –  June 2013  (2 years 8 months) I help fix Rochester Institute of Technology students, faculty, and staff computers. I interact one on one with the customers that come into the ITS Resnet office. When in the Tech Center I use a variety of tools to help fix, clean, and troubleshoot issues with a computer. Resident Advisor Rochester Institute of Technology March 2011  –  May 2013  (2 years 3 months) Build a sense of community on the floor. Provide residents with the resources they need to succeed. Maintaining order and providing a safe place to be in the residence halls. Fulfill my administrative duties as the RA to my floor and my Residence Life staff. Basically, being a leader and role model for my residents and the other RAs. Resident Advisor Rochester Institute of Technology March 2011  –  May 2013  (2 years 3 months) Build a sense of community on the floor. Provide residents with the resources they need to succeed. Maintaining order and providing a safe place to be in the residence halls. Fulfill my administrative duties as the RA to my floor and my Residence Life staff. Basically, being a leader and role model for my residents and the other RAs. Webmaster - New York Eta Chapter Phi Delta Theta Fraternity March 2010  –  May 2013  (3 years 3 months) As the webmaster, I am in charge of updating our website. I have designed a website template from scratch and coded the website around the design. I have implemented Mambo Content Management System into our new website. The new website is still under construction and still undergoing tests. Webmaster - New York Eta Chapter Phi Delta Theta Fraternity March 2010  –  May 2013  (3 years 3 months) As the webmaster, I am in charge of updating our website. I have designed a website template from scratch and coded the website around the design. I have implemented Mambo Content Management System into our new website. The new website is still under construction and still undergoing tests. Infrastructure Engineer JPMorgan Chase June 2012  –  August 2012  (3 months) -Assisted with decommissioning of assets. \n-Performed data entry duties through development of Perl scripts. \n-Operated under appropriate time constraints and proficiency requirements. \n-Developed a centralized ticketing system. Infrastructure Engineer JPMorgan Chase June 2012  –  August 2012  (3 months) -Assisted with decommissioning of assets. \n-Performed data entry duties through development of Perl scripts. \n-Operated under appropriate time constraints and proficiency requirements. \n-Developed a centralized ticketing system. Scholarship Chairman - New York Eta Chapter Phi Delta Theta Fraternity February 2011  –  May 2012  (1 year 4 months) Duty involves aiding fellow Brothers find assistance for any academic issues they may be facing. The scholarship chairman is also responsible for motivating Brothers to perform well academically. Scholarship Chairman - New York Eta Chapter Phi Delta Theta Fraternity February 2011  –  May 2012  (1 year 4 months) Duty involves aiding fellow Brothers find assistance for any academic issues they may be facing. The scholarship chairman is also responsible for motivating Brothers to perform well academically. Risk Management Chair - New York Eta Chapter Phi Delta Theta Fraternity February 2010  –  May 2012  (2 years 4 months) -Conducts risk assessments involving the NY Eta Chapter \n-Working on bringing the Red Cross to RIT Greek Life to teach CPR Risk Management Chair - New York Eta Chapter Phi Delta Theta Fraternity February 2010  –  May 2012  (2 years 4 months) -Conducts risk assessments involving the NY Eta Chapter \n-Working on bringing the Red Cross to RIT Greek Life to teach CPR IT Intern City of Rochester May 2011  –  August 2011  (4 months) Rochester, New York Area Provide client support for all software and hardware related issues for computers throughout the City of Rochester. IT Intern City of Rochester May 2011  –  August 2011  (4 months) Rochester, New York Area Provide client support for all software and hardware related issues for computers throughout the City of Rochester. Languages English Native or bilingual proficiency Latin Limited working proficiency Spanish Limited working proficiency Hebrew Elementary proficiency English Native or bilingual proficiency Latin Limited working proficiency Spanish Limited working proficiency Hebrew Elementary proficiency English Native or bilingual proficiency Latin Limited working proficiency Spanish Limited working proficiency Hebrew Elementary proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Elementary proficiency Skills Troubleshooting Linux Apache Python Perl HTML PHP C++ Network Administration Windows JavaScript Microsoft Office Programming Windows 7 Windows XP CSS Microsoft Excel PowerPoint Active Directory Web Design Data Analysis Website Development Java Teamwork Mac OSX Asset Managment Public Speaking Computer Hardware... Windows Vista HTML + CSS Team-oriented Online Gaming Customer Service MySQL PhoneGap Microsoft Word Windows 8 Objective-C Xcode C# Microsoft C SQL Security C See 29+     See less Skills  Troubleshooting Linux Apache Python Perl HTML PHP C++ Network Administration Windows JavaScript Microsoft Office Programming Windows 7 Windows XP CSS Microsoft Excel PowerPoint Active Directory Web Design Data Analysis Website Development Java Teamwork Mac OSX Asset Managment Public Speaking Computer Hardware... Windows Vista HTML + CSS Team-oriented Online Gaming Customer Service MySQL PhoneGap Microsoft Word Windows 8 Objective-C Xcode C# Microsoft C SQL Security C See 29+     See less Troubleshooting Linux Apache Python Perl HTML PHP C++ Network Administration Windows JavaScript Microsoft Office Programming Windows 7 Windows XP CSS Microsoft Excel PowerPoint Active Directory Web Design Data Analysis Website Development Java Teamwork Mac OSX Asset Managment Public Speaking Computer Hardware... Windows Vista HTML + CSS Team-oriented Online Gaming Customer Service MySQL PhoneGap Microsoft Word Windows 8 Objective-C Xcode C# Microsoft C SQL Security C See 29+     See less Troubleshooting Linux Apache Python Perl HTML PHP C++ Network Administration Windows JavaScript Microsoft Office Programming Windows 7 Windows XP CSS Microsoft Excel PowerPoint Active Directory Web Design Data Analysis Website Development Java Teamwork Mac OSX Asset Managment Public Speaking Computer Hardware... Windows Vista HTML + CSS Team-oriented Online Gaming Customer Service MySQL PhoneGap Microsoft Word Windows 8 Objective-C Xcode C# Microsoft C SQL Security C See 29+     See less Education Rochester Institute of Technology Bachelor of Science in,  Information Security and Forensics 2009  – 2013 Risk Management Chairman, Scholarship Chairman, and Webmaster for Phi Delta Theta NY Eta Chapter. \n \nCourses: Network Fundamentals, Data Analysis I, Ethics in Information Technology, C++ Programmers in Net Security, Computer System Fundamentals, Problem Based Intro CS, Data Structures Problem Solve, Object Oriented Programming, Cyber Self Defense, Intro to Routing and Switching, Cryptography and Authentication, Scripting in Perl, Information Security Policies, Applicant Wireless Networks Activities and Societies:  Phi Delta Theta ,  Tennis ,  Skeptics Club ,  Ultimate Frisbee ,  Squash Clarkstown High School North 2005  – 2009 Activities and Societies:  Varsity Tennis ,  Varsity Skiing ,  Ultimate Frisbee Club ,  Israeli Club Rochester Institute of Technology Bachelor of Science in,  Information Security and Forensics 2009  – 2013 Risk Management Chairman, Scholarship Chairman, and Webmaster for Phi Delta Theta NY Eta Chapter. \n \nCourses: Network Fundamentals, Data Analysis I, Ethics in Information Technology, C++ Programmers in Net Security, Computer System Fundamentals, Problem Based Intro CS, Data Structures Problem Solve, Object Oriented Programming, Cyber Self Defense, Intro to Routing and Switching, Cryptography and Authentication, Scripting in Perl, Information Security Policies, Applicant Wireless Networks Activities and Societies:  Phi Delta Theta ,  Tennis ,  Skeptics Club ,  Ultimate Frisbee ,  Squash Rochester Institute of Technology Bachelor of Science in,  Information Security and Forensics 2009  – 2013 Risk Management Chairman, Scholarship Chairman, and Webmaster for Phi Delta Theta NY Eta Chapter. \n \nCourses: Network Fundamentals, Data Analysis I, Ethics in Information Technology, C++ Programmers in Net Security, Computer System Fundamentals, Problem Based Intro CS, Data Structures Problem Solve, Object Oriented Programming, Cyber Self Defense, Intro to Routing and Switching, Cryptography and Authentication, Scripting in Perl, Information Security Policies, Applicant Wireless Networks Activities and Societies:  Phi Delta Theta ,  Tennis ,  Skeptics Club ,  Ultimate Frisbee ,  Squash Rochester Institute of Technology Bachelor of Science in,  Information Security and Forensics 2009  – 2013 Risk Management Chairman, Scholarship Chairman, and Webmaster for Phi Delta Theta NY Eta Chapter. \n \nCourses: Network Fundamentals, Data Analysis I, Ethics in Information Technology, C++ Programmers in Net Security, Computer System Fundamentals, Problem Based Intro CS, Data Structures Problem Solve, Object Oriented Programming, Cyber Self Defense, Intro to Routing and Switching, Cryptography and Authentication, Scripting in Perl, Information Security Policies, Applicant Wireless Networks Activities and Societies:  Phi Delta Theta ,  Tennis ,  Skeptics Club ,  Ultimate Frisbee ,  Squash Clarkstown High School North 2005  – 2009 Activities and Societies:  Varsity Tennis ,  Varsity Skiing ,  Ultimate Frisbee Club ,  Israeli Club Clarkstown High School North 2005  – 2009 Activities and Societies:  Varsity Tennis ,  Varsity Skiing ,  Ultimate Frisbee Club ,  Israeli Club Clarkstown High School North 2005  – 2009 Activities and Societies:  Varsity Tennis ,  Varsity Skiing ,  Ultimate Frisbee Club ,  Israeli Club Honors & Awards Dean's List Rochester Institute of Technology Received Dean's list award for Winter 2011, Fall 2011, Winter 2012, Spring 2012, Fall 2012, and Winter 2013. Dean's List Rochester Institute of Technology Received Dean's list award for Winter 2011, Fall 2011, Winter 2012, Spring 2012, Fall 2012, and Winter 2013. Dean's List Rochester Institute of Technology Received Dean's list award for Winter 2011, Fall 2011, Winter 2012, Spring 2012, Fall 2012, and Winter 2013. Dean's List Rochester Institute of Technology Received Dean's list award for Winter 2011, Fall 2011, Winter 2012, Spring 2012, Fall 2012, and Winter 2013. ", "Experience Systems Administrator Intel Corporation February 2014  – Present (1 year 7 months) Hillsboro, Oregon Systems Administrator Act-On Software, Inc. October 2013  –  January 2014  (4 months) System Administrator Intel Corporation January 2012  –  July 2013  (1 year 7 months) Sys Admin Tektronix 1979  –  2009  (30 years) Systems Administrator Intel Corporation February 2014  – Present (1 year 7 months) Hillsboro, Oregon Systems Administrator Intel Corporation February 2014  – Present (1 year 7 months) Hillsboro, Oregon Systems Administrator Act-On Software, Inc. October 2013  –  January 2014  (4 months) Systems Administrator Act-On Software, Inc. October 2013  –  January 2014  (4 months) System Administrator Intel Corporation January 2012  –  July 2013  (1 year 7 months) System Administrator Intel Corporation January 2012  –  July 2013  (1 year 7 months) Sys Admin Tektronix 1979  –  2009  (30 years) Sys Admin Tektronix 1979  –  2009  (30 years) Skills Linux Unix Operating Systems TCP/IP Perl Servers VMware Data Center System Administration Windows Server Apache Storage Network Security Virtualization Open Source Troubleshooting Network Administration Solaris DNS Bash Hardware Red Hat Linux System Architecture Disaster Recovery Shell Scripting Firewalls Server Architecture Cluster SAN VMware ESX RedHat High Availability See 17+     See less Skills  Linux Unix Operating Systems TCP/IP Perl Servers VMware Data Center System Administration Windows Server Apache Storage Network Security Virtualization Open Source Troubleshooting Network Administration Solaris DNS Bash Hardware Red Hat Linux System Architecture Disaster Recovery Shell Scripting Firewalls Server Architecture Cluster SAN VMware ESX RedHat High Availability See 17+     See less Linux Unix Operating Systems TCP/IP Perl Servers VMware Data Center System Administration Windows Server Apache Storage Network Security Virtualization Open Source Troubleshooting Network Administration Solaris DNS Bash Hardware Red Hat Linux System Architecture Disaster Recovery Shell Scripting Firewalls Server Architecture Cluster SAN VMware ESX RedHat High Availability See 17+     See less Linux Unix Operating Systems TCP/IP Perl Servers VMware Data Center System Administration Windows Server Apache Storage Network Security Virtualization Open Source Troubleshooting Network Administration Solaris DNS Bash Hardware Red Hat Linux System Architecture Disaster Recovery Shell Scripting Firewalls Server Architecture Cluster SAN VMware ESX RedHat High Availability See 17+     See less Education Portland State University Portland State University Portland State University Portland State University ", "Experience Systems Administrator Intel Corporation October 2008  – Present (6 years 11 months) Systems Administrator Intel Corporation October 2008  – Present (6 years 11 months) Systems Administrator Intel Corporation October 2008  – Present (6 years 11 months) Skills Linux Storage High Performance... Skills  Linux Storage High Performance... Linux Storage High Performance... Linux Storage High Performance... ", "Summary Computer guru and pc miracle maker. I currently hold a 100% fix rate and Zero escalations rating at Intel as a Sr. Systems Administrator and Network Security Officer. Summary Computer guru and pc miracle maker. I currently hold a 100% fix rate and Zero escalations rating at Intel as a Sr. Systems Administrator and Network Security Officer. Computer guru and pc miracle maker. I currently hold a 100% fix rate and Zero escalations rating at Intel as a Sr. Systems Administrator and Network Security Officer. Computer guru and pc miracle maker. I currently hold a 100% fix rate and Zero escalations rating at Intel as a Sr. Systems Administrator and Network Security Officer. Experience Sr. Systems Administrator Intel Corporation Sr. Systems Administrator Intel Corporation Sr. Systems Administrator Intel Corporation Skills Hardware Testing Operating Systems Troubleshooting TCP/IP Security Network Security Virtualization Disaster Recovery Skills  Hardware Testing Operating Systems Troubleshooting TCP/IP Security Network Security Virtualization Disaster Recovery Hardware Testing Operating Systems Troubleshooting TCP/IP Security Network Security Virtualization Disaster Recovery Hardware Testing Operating Systems Troubleshooting TCP/IP Security Network Security Virtualization Disaster Recovery Education San Diego State University-California State University Creative Writing San Diego State University-California State University Creative Writing San Diego State University-California State University Creative Writing San Diego State University-California State University Creative Writing ", "Summary System Administrator seeking to help manage and improve a large, heterogeneous computer installation. Eager to assist users by problem solving, training, and help using the computers. Summary System Administrator seeking to help manage and improve a large, heterogeneous computer installation. Eager to assist users by problem solving, training, and help using the computers. System Administrator seeking to help manage and improve a large, heterogeneous computer installation. Eager to assist users by problem solving, training, and help using the computers. System Administrator seeking to help manage and improve a large, heterogeneous computer installation. Eager to assist users by problem solving, training, and help using the computers. Experience Metrology Process Engineer Intel Corporation March 2012  – Present (3 years 6 months) Albuquerque, New Mexico Area Help improve Intel's the manufacturing process by sustaining metrology systems that measure the thin films on our product. Use statistical analysis to ensure the tools are constantly giving correct readings. Assist in the troubleshooting of issues and constantly seek improvements.. Computer Systems Administrator Intel Corporation June 1997  –  March 2012  (14 years 10 months) Albuquerque, New Mexico Area - I provided daily maintenance and regular improvement of Network Attached Storage (NAS) systems (NetApp and EMC), and EMC SAN. Assisted with daily support for up to 9000 Red Hat Enterprise Linux nodes including all phases of installation, troubleshooting, and on-call. \n \n- Proactively monitored and improved system performance. Gathered and monitored data, reviewed metrics, located performance bottlenecks, worked with cross-site teams to identify and apply improvements. Wrote scripts to improve performance, solve system issues, and automate tasks. \n \n- Managed Windows® backup servers connected to a SAN, including doing SQL backups. \n \n- Configured, administered, and monitored UNIX and Active Directory authentication (VAS). \n \n- Worked with customers to define, specify, design, install, configure, and verify many different types of software and systems. Also worked through acceptance testing, troubleshooting, and deployment. UNIX System Administrator University of New Mexico, High Performance Computer Education and Resource Center March 1995  –  May 1997  (2 years 3 months) Albuquerque, New Mexico Area Installed and managed the computer resources of the Computer Center including: a 32-node IBM SP1 parallel machine, an RS/6000 cluster with 6 nodes, an HP 715/900, a Sun Sparc 20 (2 processor), an SGI Onyx, and 22 X-terminals. Planned and reconfigured all the machines (SPl enet cards, all disks, Sun motherboard, SGI disks/tape) planned, specified, and purchased new hardware. Managed over 300 users and answer questions daily (especially at the beginning and end of the semesters ;-). Aerial Photography Circuit Designer Miletus October 1994  –  March 1995  (6 months) Albuquerque, New Mexico Area Designed circuits for aerial photography. Created assembly language programs to interface them with a PC. UNIX System Administrator Digital Equipment Corporation November 1990  –  September 1994  (3 years 11 months) Albuquerque, New Mexico Area Installed, upgraded, and managed many MIPS, Alpha, VAX and x86-based workstations and PCs to help the manufacturing and test areas. Developed, documented and audited standard procedures for system management. Implemented and tested contingency plans. Wrote many scripts to automate system management. Helped Test Engineers design and write procedures. Developed training plans for and helped train 4 team members. Assigned technical projects, coordinated their resolution, and wrote and delivered reviews. Supercomputer Consultant General Atomics October 1988  –  November 1990  (2 years 2 months) Albuquerque, New Mexico Area Solved users technical problems with supercomputers, software, and network communications. Assisted in optimizing and debugging codes that were being ported to the Cray. Wrote software documentation and technical articles for the newsletter. Created programs in C and FORTRAN to test and enhance the systems. Prepared course materials for and taught software classes both on and off-site. System manager for the local Sun systems. Flight Test Instrumentation Engineer Bell Helicopter January 1986  –  August 1988  (2 years 8 months) Arlington, Texas Was responsible for designing and installing electronic instrumentation on flight-test helicopters using pulse code modulation, frequency modulation and telemetry circuitry and equipment. Regularly used PCM encoders and decoders, signal multiplexers and time code generators. Operated electronic test instruments including oscilloscopes, spectrum analyzers, and computers. Familiar with aircraft avionics and the IEEE-488, 1553, and VME buses. Worked with CADAM to produce wiring and installation drawings. Metrology Process Engineer Intel Corporation March 2012  – Present (3 years 6 months) Albuquerque, New Mexico Area Help improve Intel's the manufacturing process by sustaining metrology systems that measure the thin films on our product. Use statistical analysis to ensure the tools are constantly giving correct readings. Assist in the troubleshooting of issues and constantly seek improvements.. Metrology Process Engineer Intel Corporation March 2012  – Present (3 years 6 months) Albuquerque, New Mexico Area Help improve Intel's the manufacturing process by sustaining metrology systems that measure the thin films on our product. Use statistical analysis to ensure the tools are constantly giving correct readings. Assist in the troubleshooting of issues and constantly seek improvements.. Computer Systems Administrator Intel Corporation June 1997  –  March 2012  (14 years 10 months) Albuquerque, New Mexico Area - I provided daily maintenance and regular improvement of Network Attached Storage (NAS) systems (NetApp and EMC), and EMC SAN. Assisted with daily support for up to 9000 Red Hat Enterprise Linux nodes including all phases of installation, troubleshooting, and on-call. \n \n- Proactively monitored and improved system performance. Gathered and monitored data, reviewed metrics, located performance bottlenecks, worked with cross-site teams to identify and apply improvements. Wrote scripts to improve performance, solve system issues, and automate tasks. \n \n- Managed Windows® backup servers connected to a SAN, including doing SQL backups. \n \n- Configured, administered, and monitored UNIX and Active Directory authentication (VAS). \n \n- Worked with customers to define, specify, design, install, configure, and verify many different types of software and systems. Also worked through acceptance testing, troubleshooting, and deployment. Computer Systems Administrator Intel Corporation June 1997  –  March 2012  (14 years 10 months) Albuquerque, New Mexico Area - I provided daily maintenance and regular improvement of Network Attached Storage (NAS) systems (NetApp and EMC), and EMC SAN. Assisted with daily support for up to 9000 Red Hat Enterprise Linux nodes including all phases of installation, troubleshooting, and on-call. \n \n- Proactively monitored and improved system performance. Gathered and monitored data, reviewed metrics, located performance bottlenecks, worked with cross-site teams to identify and apply improvements. Wrote scripts to improve performance, solve system issues, and automate tasks. \n \n- Managed Windows® backup servers connected to a SAN, including doing SQL backups. \n \n- Configured, administered, and monitored UNIX and Active Directory authentication (VAS). \n \n- Worked with customers to define, specify, design, install, configure, and verify many different types of software and systems. Also worked through acceptance testing, troubleshooting, and deployment. UNIX System Administrator University of New Mexico, High Performance Computer Education and Resource Center March 1995  –  May 1997  (2 years 3 months) Albuquerque, New Mexico Area Installed and managed the computer resources of the Computer Center including: a 32-node IBM SP1 parallel machine, an RS/6000 cluster with 6 nodes, an HP 715/900, a Sun Sparc 20 (2 processor), an SGI Onyx, and 22 X-terminals. Planned and reconfigured all the machines (SPl enet cards, all disks, Sun motherboard, SGI disks/tape) planned, specified, and purchased new hardware. Managed over 300 users and answer questions daily (especially at the beginning and end of the semesters ;-). UNIX System Administrator University of New Mexico, High Performance Computer Education and Resource Center March 1995  –  May 1997  (2 years 3 months) Albuquerque, New Mexico Area Installed and managed the computer resources of the Computer Center including: a 32-node IBM SP1 parallel machine, an RS/6000 cluster with 6 nodes, an HP 715/900, a Sun Sparc 20 (2 processor), an SGI Onyx, and 22 X-terminals. Planned and reconfigured all the machines (SPl enet cards, all disks, Sun motherboard, SGI disks/tape) planned, specified, and purchased new hardware. Managed over 300 users and answer questions daily (especially at the beginning and end of the semesters ;-). Aerial Photography Circuit Designer Miletus October 1994  –  March 1995  (6 months) Albuquerque, New Mexico Area Designed circuits for aerial photography. Created assembly language programs to interface them with a PC. Aerial Photography Circuit Designer Miletus October 1994  –  March 1995  (6 months) Albuquerque, New Mexico Area Designed circuits for aerial photography. Created assembly language programs to interface them with a PC. UNIX System Administrator Digital Equipment Corporation November 1990  –  September 1994  (3 years 11 months) Albuquerque, New Mexico Area Installed, upgraded, and managed many MIPS, Alpha, VAX and x86-based workstations and PCs to help the manufacturing and test areas. Developed, documented and audited standard procedures for system management. Implemented and tested contingency plans. Wrote many scripts to automate system management. Helped Test Engineers design and write procedures. Developed training plans for and helped train 4 team members. Assigned technical projects, coordinated their resolution, and wrote and delivered reviews. UNIX System Administrator Digital Equipment Corporation November 1990  –  September 1994  (3 years 11 months) Albuquerque, New Mexico Area Installed, upgraded, and managed many MIPS, Alpha, VAX and x86-based workstations and PCs to help the manufacturing and test areas. Developed, documented and audited standard procedures for system management. Implemented and tested contingency plans. Wrote many scripts to automate system management. Helped Test Engineers design and write procedures. Developed training plans for and helped train 4 team members. Assigned technical projects, coordinated their resolution, and wrote and delivered reviews. Supercomputer Consultant General Atomics October 1988  –  November 1990  (2 years 2 months) Albuquerque, New Mexico Area Solved users technical problems with supercomputers, software, and network communications. Assisted in optimizing and debugging codes that were being ported to the Cray. Wrote software documentation and technical articles for the newsletter. Created programs in C and FORTRAN to test and enhance the systems. Prepared course materials for and taught software classes both on and off-site. System manager for the local Sun systems. Supercomputer Consultant General Atomics October 1988  –  November 1990  (2 years 2 months) Albuquerque, New Mexico Area Solved users technical problems with supercomputers, software, and network communications. Assisted in optimizing and debugging codes that were being ported to the Cray. Wrote software documentation and technical articles for the newsletter. Created programs in C and FORTRAN to test and enhance the systems. Prepared course materials for and taught software classes both on and off-site. System manager for the local Sun systems. Flight Test Instrumentation Engineer Bell Helicopter January 1986  –  August 1988  (2 years 8 months) Arlington, Texas Was responsible for designing and installing electronic instrumentation on flight-test helicopters using pulse code modulation, frequency modulation and telemetry circuitry and equipment. Regularly used PCM encoders and decoders, signal multiplexers and time code generators. Operated electronic test instruments including oscilloscopes, spectrum analyzers, and computers. Familiar with aircraft avionics and the IEEE-488, 1553, and VME buses. Worked with CADAM to produce wiring and installation drawings. Flight Test Instrumentation Engineer Bell Helicopter January 1986  –  August 1988  (2 years 8 months) Arlington, Texas Was responsible for designing and installing electronic instrumentation on flight-test helicopters using pulse code modulation, frequency modulation and telemetry circuitry and equipment. Regularly used PCM encoders and decoders, signal multiplexers and time code generators. Operated electronic test instruments including oscilloscopes, spectrum analyzers, and computers. Familiar with aircraft avionics and the IEEE-488, 1553, and VME buses. Worked with CADAM to produce wiring and installation drawings. Languages Spanish (very rusty) Spanish (very rusty) Spanish (very rusty) Skills Testing Hardware Unix Linux Debugging C Software Documentation Circuit Design Software Installation Automation Cluster Technical Writing Program Management HP Test Equipment Skills  Testing Hardware Unix Linux Debugging C Software Documentation Circuit Design Software Installation Automation Cluster Technical Writing Program Management HP Test Equipment Testing Hardware Unix Linux Debugging C Software Documentation Circuit Design Software Installation Automation Cluster Technical Writing Program Management HP Test Equipment Testing Hardware Unix Linux Debugging C Software Documentation Circuit Design Software Installation Automation Cluster Technical Writing Program Management HP Test Equipment Education The University of Texas at El Paso BSEE,  Electronics , Signal Processing,  Telecommunications 1986 Electronic Music, Circuit Design Activities and Societies:  IEEE The University of Texas at El Paso BSEE,  Electronics , Signal Processing,  Telecommunications 1986 Electronic Music, Circuit Design Activities and Societies:  IEEE The University of Texas at El Paso BSEE,  Electronics , Signal Processing,  Telecommunications 1986 Electronic Music, Circuit Design Activities and Societies:  IEEE The University of Texas at El Paso BSEE,  Electronics , Signal Processing,  Telecommunications 1986 Electronic Music, Circuit Design Activities and Societies:  IEEE ", "Experience Systems Administrator Intel Corporation December 1998  – Present (16 years 9 months) Systems Administrator Intel Corporation December 1998  – Present (16 years 9 months) Systems Administrator Intel Corporation December 1998  – Present (16 years 9 months) Skills WinPE CMD Windows Windows Server 2008 System Administration VBScript WMI X64 Troubleshooting Server Hardware Account Management Remote Management Remediation Job Scheduling Wireless Networking Terminal Services Terminal Server System Deployment Client Relationship... Customer Satisfaction Server Architecture Enterprise Architecture Provisioning Powershell Windows Server Windows 7 Shell Scripting Integration Information Technology System Integration... Remote Troubleshooting Remote Administration Information Security... Computer Security Virtual Servers Virtual Server Test Lab Management System Consolidation Root Cause Problem... See 24+     See less Skills  WinPE CMD Windows Windows Server 2008 System Administration VBScript WMI X64 Troubleshooting Server Hardware Account Management Remote Management Remediation Job Scheduling Wireless Networking Terminal Services Terminal Server System Deployment Client Relationship... Customer Satisfaction Server Architecture Enterprise Architecture Provisioning Powershell Windows Server Windows 7 Shell Scripting Integration Information Technology System Integration... Remote Troubleshooting Remote Administration Information Security... Computer Security Virtual Servers Virtual Server Test Lab Management System Consolidation Root Cause Problem... See 24+     See less WinPE CMD Windows Windows Server 2008 System Administration VBScript WMI X64 Troubleshooting Server Hardware Account Management Remote Management Remediation Job Scheduling Wireless Networking Terminal Services Terminal Server System Deployment Client Relationship... Customer Satisfaction Server Architecture Enterprise Architecture Provisioning Powershell Windows Server Windows 7 Shell Scripting Integration Information Technology System Integration... Remote Troubleshooting Remote Administration Information Security... Computer Security Virtual Servers Virtual Server Test Lab Management System Consolidation Root Cause Problem... See 24+     See less WinPE CMD Windows Windows Server 2008 System Administration VBScript WMI X64 Troubleshooting Server Hardware Account Management Remote Management Remediation Job Scheduling Wireless Networking Terminal Services Terminal Server System Deployment Client Relationship... Customer Satisfaction Server Architecture Enterprise Architecture Provisioning Powershell Windows Server Windows 7 Shell Scripting Integration Information Technology System Integration... Remote Troubleshooting Remote Administration Information Security... Computer Security Virtual Servers Virtual Server Test Lab Management System Consolidation Root Cause Problem... See 24+     See less ", "Summary Electrical Engineering/Physics background \nLinux/Solaris/HP-UX \nProgramming: C, Basic, Assembly \nScripting: Perl, Shell Specialties:NIS, Unix - Active Directory integration Summary Electrical Engineering/Physics background \nLinux/Solaris/HP-UX \nProgramming: C, Basic, Assembly \nScripting: Perl, Shell Specialties:NIS, Unix - Active Directory integration Electrical Engineering/Physics background \nLinux/Solaris/HP-UX \nProgramming: C, Basic, Assembly \nScripting: Perl, Shell Specialties:NIS, Unix - Active Directory integration Electrical Engineering/Physics background \nLinux/Solaris/HP-UX \nProgramming: C, Basic, Assembly \nScripting: Perl, Shell Specialties:NIS, Unix - Active Directory integration Experience Sr Unix Systems Administrator Intel Corporation 1999  – Present (16 years) Sr System Programmer (UNIX) Intel Software Network 1999  – Present (16 years) Sr. Unix Administrator Tektronix 1996  –  1999  (3 years) Unix Systems Administrator The Aerospace Corporation 1993  –  1999  (6 years) Assistant Professor in Electrical Engineering San Jose State University 1986  –  1992  (6 years) Sr Unix Systems Administrator Intel Corporation 1999  – Present (16 years) Sr Unix Systems Administrator Intel Corporation 1999  – Present (16 years) Sr System Programmer (UNIX) Intel Software Network 1999  – Present (16 years) Sr System Programmer (UNIX) Intel Software Network 1999  – Present (16 years) Sr. Unix Administrator Tektronix 1996  –  1999  (3 years) Sr. Unix Administrator Tektronix 1996  –  1999  (3 years) Unix Systems Administrator The Aerospace Corporation 1993  –  1999  (6 years) Unix Systems Administrator The Aerospace Corporation 1993  –  1999  (6 years) Assistant Professor in Electrical Engineering San Jose State University 1986  –  1992  (6 years) Assistant Professor in Electrical Engineering San Jose State University 1986  –  1992  (6 years) Skills Unix Active Directory Perl Skills  Unix Active Directory Perl Unix Active Directory Perl Unix Active Directory Perl Education Colorado State University PhD,  Electrical Engineering 1980  – 1988 Texas A&M University BS, MS,  Electrical Enginering 1973  – 1979 Colorado State University PhD,  Electrical Engineering 1980  – 1988 Colorado State University PhD,  Electrical Engineering 1980  – 1988 Colorado State University PhD,  Electrical Engineering 1980  – 1988 Texas A&M University BS, MS,  Electrical Enginering 1973  – 1979 Texas A&M University BS, MS,  Electrical Enginering 1973  – 1979 Texas A&M University BS, MS,  Electrical Enginering 1973  – 1979 Honors & Awards Intel IT Division Recognition: Joint Develpoment Infrastructure for Intel Foundry Services Intel Corporation, Information Technology 2011 Implementation of an externally-facing Joint Development Infrastructure for Intel Foundry Services Additional Honors & Awards Intel Engineering Computing Recognition Award: Global Solaris Team \nIntel IT Divsion Recognition: AMR1 Environmental Merge Project, 2008 \nIntel IT Divsion Recognition: Cache Manager Deployment, 2009 \nIntel IT Divsion Recognition: Cross-Platform Identity Management, 2009 Intel IT Division Recognition: Joint Develpoment Infrastructure for Intel Foundry Services Intel Corporation, Information Technology 2011 Implementation of an externally-facing Joint Development Infrastructure for Intel Foundry Services Intel IT Division Recognition: Joint Develpoment Infrastructure for Intel Foundry Services Intel Corporation, Information Technology 2011 Implementation of an externally-facing Joint Development Infrastructure for Intel Foundry Services Intel IT Division Recognition: Joint Develpoment Infrastructure for Intel Foundry Services Intel Corporation, Information Technology 2011 Implementation of an externally-facing Joint Development Infrastructure for Intel Foundry Services Additional Honors & Awards Intel Engineering Computing Recognition Award: Global Solaris Team \nIntel IT Divsion Recognition: AMR1 Environmental Merge Project, 2008 \nIntel IT Divsion Recognition: Cache Manager Deployment, 2009 \nIntel IT Divsion Recognition: Cross-Platform Identity Management, 2009 Additional Honors & Awards Intel Engineering Computing Recognition Award: Global Solaris Team \nIntel IT Divsion Recognition: AMR1 Environmental Merge Project, 2008 \nIntel IT Divsion Recognition: Cache Manager Deployment, 2009 \nIntel IT Divsion Recognition: Cross-Platform Identity Management, 2009 Additional Honors & Awards Intel Engineering Computing Recognition Award: Global Solaris Team \nIntel IT Divsion Recognition: AMR1 Environmental Merge Project, 2008 \nIntel IT Divsion Recognition: Cache Manager Deployment, 2009 \nIntel IT Divsion Recognition: Cross-Platform Identity Management, 2009 "]}