{"position": "Tech Marketing", "company": "Intel Corporation", "profiles": ["Skills Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics Skills  Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics Mobile Devices Strategy Intel Wireless Marketing Semiconductors Product Management Go-to-market Strategy Product Marketing Processors Semiconductor Industry Electronics ", "Experience Tech Marketing Intel Corporation Tech Marketing Intel Corporation Tech Marketing Intel Corporation ", "Summary An experienced, IT client support specialist focusing on 2nd level support, deployments and the PC lifecycle. With a proven track record in leading a team which includes permanent employees, interns and contractors and ensuring all issues are resolved within agreed SLAs. Latterly responible for managing IT assets for the Greater European Region from purchase to disposition. Successfully led major strategic change initiatives, development programmes and operations in this area. More recently part of a technical marketing team delivering, to European sales teams and their retail partners, a package of demonstrations and material facilitating an understanding and positioning of Intel's products. Summary An experienced, IT client support specialist focusing on 2nd level support, deployments and the PC lifecycle. With a proven track record in leading a team which includes permanent employees, interns and contractors and ensuring all issues are resolved within agreed SLAs. Latterly responible for managing IT assets for the Greater European Region from purchase to disposition. Successfully led major strategic change initiatives, development programmes and operations in this area. More recently part of a technical marketing team delivering, to European sales teams and their retail partners, a package of demonstrations and material facilitating an understanding and positioning of Intel's products. An experienced, IT client support specialist focusing on 2nd level support, deployments and the PC lifecycle. With a proven track record in leading a team which includes permanent employees, interns and contractors and ensuring all issues are resolved within agreed SLAs. Latterly responible for managing IT assets for the Greater European Region from purchase to disposition. Successfully led major strategic change initiatives, development programmes and operations in this area. More recently part of a technical marketing team delivering, to European sales teams and their retail partners, a package of demonstrations and material facilitating an understanding and positioning of Intel's products. An experienced, IT client support specialist focusing on 2nd level support, deployments and the PC lifecycle. With a proven track record in leading a team which includes permanent employees, interns and contractors and ensuring all issues are resolved within agreed SLAs. Latterly responible for managing IT assets for the Greater European Region from purchase to disposition. Successfully led major strategic change initiatives, development programmes and operations in this area. More recently part of a technical marketing team delivering, to European sales teams and their retail partners, a package of demonstrations and material facilitating an understanding and positioning of Intel's products. Experience Operations Specialist Etherlive Ltd May 2013  – Present (2 years 4 months) Brinkworth Postman - Saturday Royal Mail February 2013  – Present (2 years 7 months) Hawkesworth Depot Contracted to 8 hours Saturday morning TA Administrator Bank of New York Mellon March 2013  –  June 2013  (4 months) Swindon Contracted via Morgan McKinley for 25 hours per week to be part of the Premier Account team. Responsible for uploading of investment transactions. Quick learning ( no previous experinece ) , accuracy, working to time constraints and team work were vital skills to be able to succeed in this role. Tech Marketing Intel Corporation March 2012  –  August 2012  (6 months) •Successful delivery of Retail Roadshow in Spain, Saudi Arabia, Germany, Nordics. Enabling local retail sales teams and their retail partners to demonstrate the key features of products to retail customers.  \n•Managed small team that performed EC conformance testing on customer products. This service was offered to customers as a free service as part of any design-in sales discussions. Saving the potential customer on 3rd party test houses failing their products.  \n•Project managed the installation of a turntable ( department had been working on for 3 years previous).  \n•Performed Sample audits, helping teams and owners improve storage and tracking of high value items and reducing risk of companies Intellectual property (IP) \n•This years Intern hire program for all tech marketing teams had not been kicked off (5 months behind other departments and the normal timeline) . Initiated the process and completed interview process and introduction and induction of new interns Asset Management GER Intel Corporation June 2009  –  March 2012  (2 years 10 months) •Improved asset tracking audit results from a mid 80% accuracy to goal a of 98% accuracy for the Greater European Region. \n•Introduced Best Known Methods (BKMs) across the region to help teams improve and maintain their accuracy. \n•Enabled region to meet all refresh requirements, budgeting and planning to replace PCs in line with Intel's lifecycle guidelines. \n•Reduced stock levels of end-of-life (EOL) hardware. Migrated all region to Windows 7 within specified timelines. \n•Introduced Solid State Drive (SSD) technology to the standard PC offering and enabled upgrades so that all employees could take advantage of the benefits of SSD technology. \n•Produced and delivered a training class providing Health & Safety training on manual handling for site employees Client Services team lead Intel Corporation May 1996  –  June 2009  (13 years 2 months) •Incident management for UK and remote supported sites, 3000+ incidents recorded and resolved year on year \n•Refresh of hardware and software from windows 3.11 through to windows 7 in line with corporate policy. Changed the delivery mechanism for refresh machines to class room delivery and provided training for the end user. So improving the user experience and reducing their down time.  \n•Development and introduction of service centre (drop-in) for hands on, face-to-face resolution of user issues.  \n•Developing local and global process to ensure day one delivery of PC to new hires.  \n•Worked with vendor to deploy fleet of HP network printers in the UK and supported small sites, reducing site print costs and quantity of floor printers, provided user training and worked through customer concerns . \n•Hired interns year on year, CV screening, interviewing and integration of successful candidates. Several returning post graduation as new Intel employees.  \n•Provided support for remote sites with no local support,Egypt, South Africa, Finland, Sweden.... Building up relationships with remote employees providing remote support and planned regular site visits to ensure full use of time on site. Providing other IT function support for the small site ( network, telephony) Removing the need for local support staff whilst still enableing the local sales teams to be productive Operations Specialist Etherlive Ltd May 2013  – Present (2 years 4 months) Brinkworth Operations Specialist Etherlive Ltd May 2013  – Present (2 years 4 months) Brinkworth Postman - Saturday Royal Mail February 2013  – Present (2 years 7 months) Hawkesworth Depot Contracted to 8 hours Saturday morning Postman - Saturday Royal Mail February 2013  – Present (2 years 7 months) Hawkesworth Depot Contracted to 8 hours Saturday morning TA Administrator Bank of New York Mellon March 2013  –  June 2013  (4 months) Swindon Contracted via Morgan McKinley for 25 hours per week to be part of the Premier Account team. Responsible for uploading of investment transactions. Quick learning ( no previous experinece ) , accuracy, working to time constraints and team work were vital skills to be able to succeed in this role. TA Administrator Bank of New York Mellon March 2013  –  June 2013  (4 months) Swindon Contracted via Morgan McKinley for 25 hours per week to be part of the Premier Account team. Responsible for uploading of investment transactions. Quick learning ( no previous experinece ) , accuracy, working to time constraints and team work were vital skills to be able to succeed in this role. Tech Marketing Intel Corporation March 2012  –  August 2012  (6 months) •Successful delivery of Retail Roadshow in Spain, Saudi Arabia, Germany, Nordics. Enabling local retail sales teams and their retail partners to demonstrate the key features of products to retail customers.  \n•Managed small team that performed EC conformance testing on customer products. This service was offered to customers as a free service as part of any design-in sales discussions. Saving the potential customer on 3rd party test houses failing their products.  \n•Project managed the installation of a turntable ( department had been working on for 3 years previous).  \n•Performed Sample audits, helping teams and owners improve storage and tracking of high value items and reducing risk of companies Intellectual property (IP) \n•This years Intern hire program for all tech marketing teams had not been kicked off (5 months behind other departments and the normal timeline) . Initiated the process and completed interview process and introduction and induction of new interns Tech Marketing Intel Corporation March 2012  –  August 2012  (6 months) •Successful delivery of Retail Roadshow in Spain, Saudi Arabia, Germany, Nordics. Enabling local retail sales teams and their retail partners to demonstrate the key features of products to retail customers.  \n•Managed small team that performed EC conformance testing on customer products. This service was offered to customers as a free service as part of any design-in sales discussions. Saving the potential customer on 3rd party test houses failing their products.  \n•Project managed the installation of a turntable ( department had been working on for 3 years previous).  \n•Performed Sample audits, helping teams and owners improve storage and tracking of high value items and reducing risk of companies Intellectual property (IP) \n•This years Intern hire program for all tech marketing teams had not been kicked off (5 months behind other departments and the normal timeline) . Initiated the process and completed interview process and introduction and induction of new interns Asset Management GER Intel Corporation June 2009  –  March 2012  (2 years 10 months) •Improved asset tracking audit results from a mid 80% accuracy to goal a of 98% accuracy for the Greater European Region. \n•Introduced Best Known Methods (BKMs) across the region to help teams improve and maintain their accuracy. \n•Enabled region to meet all refresh requirements, budgeting and planning to replace PCs in line with Intel's lifecycle guidelines. \n•Reduced stock levels of end-of-life (EOL) hardware. Migrated all region to Windows 7 within specified timelines. \n•Introduced Solid State Drive (SSD) technology to the standard PC offering and enabled upgrades so that all employees could take advantage of the benefits of SSD technology. \n•Produced and delivered a training class providing Health & Safety training on manual handling for site employees Asset Management GER Intel Corporation June 2009  –  March 2012  (2 years 10 months) •Improved asset tracking audit results from a mid 80% accuracy to goal a of 98% accuracy for the Greater European Region. \n•Introduced Best Known Methods (BKMs) across the region to help teams improve and maintain their accuracy. \n•Enabled region to meet all refresh requirements, budgeting and planning to replace PCs in line with Intel's lifecycle guidelines. \n•Reduced stock levels of end-of-life (EOL) hardware. Migrated all region to Windows 7 within specified timelines. \n•Introduced Solid State Drive (SSD) technology to the standard PC offering and enabled upgrades so that all employees could take advantage of the benefits of SSD technology. \n•Produced and delivered a training class providing Health & Safety training on manual handling for site employees Client Services team lead Intel Corporation May 1996  –  June 2009  (13 years 2 months) •Incident management for UK and remote supported sites, 3000+ incidents recorded and resolved year on year \n•Refresh of hardware and software from windows 3.11 through to windows 7 in line with corporate policy. Changed the delivery mechanism for refresh machines to class room delivery and provided training for the end user. So improving the user experience and reducing their down time.  \n•Development and introduction of service centre (drop-in) for hands on, face-to-face resolution of user issues.  \n•Developing local and global process to ensure day one delivery of PC to new hires.  \n•Worked with vendor to deploy fleet of HP network printers in the UK and supported small sites, reducing site print costs and quantity of floor printers, provided user training and worked through customer concerns . \n•Hired interns year on year, CV screening, interviewing and integration of successful candidates. Several returning post graduation as new Intel employees.  \n•Provided support for remote sites with no local support,Egypt, South Africa, Finland, Sweden.... Building up relationships with remote employees providing remote support and planned regular site visits to ensure full use of time on site. Providing other IT function support for the small site ( network, telephony) Removing the need for local support staff whilst still enableing the local sales teams to be productive Client Services team lead Intel Corporation May 1996  –  June 2009  (13 years 2 months) •Incident management for UK and remote supported sites, 3000+ incidents recorded and resolved year on year \n•Refresh of hardware and software from windows 3.11 through to windows 7 in line with corporate policy. Changed the delivery mechanism for refresh machines to class room delivery and provided training for the end user. So improving the user experience and reducing their down time.  \n•Development and introduction of service centre (drop-in) for hands on, face-to-face resolution of user issues.  \n•Developing local and global process to ensure day one delivery of PC to new hires.  \n•Worked with vendor to deploy fleet of HP network printers in the UK and supported small sites, reducing site print costs and quantity of floor printers, provided user training and worked through customer concerns . \n•Hired interns year on year, CV screening, interviewing and integration of successful candidates. Several returning post graduation as new Intel employees.  \n•Provided support for remote sites with no local support,Egypt, South Africa, Finland, Sweden.... Building up relationships with remote employees providing remote support and planned regular site visits to ensure full use of time on site. Providing other IT function support for the small site ( network, telephony) Removing the need for local support staff whilst still enableing the local sales teams to be productive Languages French Elementary proficiency German Elementary proficiency French Elementary proficiency German Elementary proficiency French Elementary proficiency German Elementary proficiency Elementary proficiency Elementary proficiency Skills Intel Skills  Intel Intel Intel Education Swindon College HTEC,  Electronics 1980  – 1983 Kingsdown school 4 O Levels,  Maths ,  English ,  History ,  Chemistry 1974  – 1980 Swindon College HTEC,  Electronics 1980  – 1983 Swindon College HTEC,  Electronics 1980  – 1983 Swindon College HTEC,  Electronics 1980  – 1983 Kingsdown school 4 O Levels,  Maths ,  English ,  History ,  Chemistry 1974  – 1980 Kingsdown school 4 O Levels,  Maths ,  English ,  History ,  Chemistry 1974  – 1980 Kingsdown school 4 O Levels,  Maths ,  English ,  History ,  Chemistry 1974  – 1980 ", "Experience Tech. Marketing Intel Corporation Enterprise Platform Technical Marketing Engineer Intel Corporation May 2006  – Present (9 years 4 months) Design and deployment of Mission-Critical and HPC servers Senior TME Intel Corporation 1981  – Present (34 years) Swindon, United Kingdom Enterprise Platform Technical Marketing Tech. Marketing Intel Corporation Tech. Marketing Intel Corporation Enterprise Platform Technical Marketing Engineer Intel Corporation May 2006  – Present (9 years 4 months) Design and deployment of Mission-Critical and HPC servers Enterprise Platform Technical Marketing Engineer Intel Corporation May 2006  – Present (9 years 4 months) Design and deployment of Mission-Critical and HPC servers Senior TME Intel Corporation 1981  – Present (34 years) Swindon, United Kingdom Enterprise Platform Technical Marketing Senior TME Intel Corporation 1981  – Present (34 years) Swindon, United Kingdom Enterprise Platform Technical Marketing ", "Summary \"Birth, school, work, death\" - The Godfathers Summary \"Birth, school, work, death\" - The Godfathers \"Birth, school, work, death\" - The Godfathers \"Birth, school, work, death\" - The Godfathers Experience Creative Director J Laurie Shoe Boutique January 2014  – Present (1 year 8 months) 628 washington ave, ocean springs Promote select items with artwork and fashion forward commentary. Create collections featuring fabulous footwear, bedazzling jewelry and complimentary handbags. Systems Engineer Huntington Ingalls Industries, Inc. 2002  –  December 2014  (12 years) Pascagoula, Mississippi Jack of IT, master of not so much Tech Marketing Intel Corporation 2000  –  2002  (2 years) Product Manager Samsung Telecommunications America 1997  –  1999  (2 years) Creative Director J Laurie Shoe Boutique January 2014  – Present (1 year 8 months) 628 washington ave, ocean springs Promote select items with artwork and fashion forward commentary. Create collections featuring fabulous footwear, bedazzling jewelry and complimentary handbags. Creative Director J Laurie Shoe Boutique January 2014  – Present (1 year 8 months) 628 washington ave, ocean springs Promote select items with artwork and fashion forward commentary. Create collections featuring fabulous footwear, bedazzling jewelry and complimentary handbags. Systems Engineer Huntington Ingalls Industries, Inc. 2002  –  December 2014  (12 years) Pascagoula, Mississippi Jack of IT, master of not so much Systems Engineer Huntington Ingalls Industries, Inc. 2002  –  December 2014  (12 years) Pascagoula, Mississippi Jack of IT, master of not so much Tech Marketing Intel Corporation 2000  –  2002  (2 years) Tech Marketing Intel Corporation 2000  –  2002  (2 years) Product Manager Samsung Telecommunications America 1997  –  1999  (2 years) Product Manager Samsung Telecommunications America 1997  –  1999  (2 years) Skills Integration Marketing Skills  Integration Marketing Integration Marketing Integration Marketing Education Pace Graduate School of Business MBA,  Computer Science 1981 Georgetown University Bachelor of Business Administration (B.B.A.),  International Business 1974  – 1978 Pace Graduate School of Business MBA,  Computer Science 1981 Pace Graduate School of Business MBA,  Computer Science 1981 Pace Graduate School of Business MBA,  Computer Science 1981 Georgetown University Bachelor of Business Administration (B.B.A.),  International Business 1974  – 1978 Georgetown University Bachelor of Business Administration (B.B.A.),  International Business 1974  – 1978 Georgetown University Bachelor of Business Administration (B.B.A.),  International Business 1974  – 1978 ", "Experience Tech Marketing Intel Corporation/Mobility Group - Mobile Platforms January 1995  – Present (20 years 8 months) HW TME/PAE Intel 1995  – Present (20 years) Tech marketing Intel 1995  – Present (20 years) AE CHIPS 1997  –  1998  (1 year) Tech Marketing Intel Corporation/Mobility Group - Mobile Platforms January 1995  – Present (20 years 8 months) Tech Marketing Intel Corporation/Mobility Group - Mobile Platforms January 1995  – Present (20 years 8 months) HW TME/PAE Intel 1995  – Present (20 years) HW TME/PAE Intel 1995  – Present (20 years) Tech marketing Intel 1995  – Present (20 years) Tech marketing Intel 1995  – Present (20 years) AE CHIPS 1997  –  1998  (1 year) AE CHIPS 1997  –  1998  (1 year) Education California Polytechnic State University-San Luis Obispo California Polytechnic State University-San Luis Obispo California Polytechnic State University-San Luis Obispo California Polytechnic State University-San Luis Obispo ", "Summary Strategic and creative thinker with technical roots. A life long embedded system designer in a world filled with connected devices. Experienced leader with strong project and management skills. A proven project and team leader with solid track records. Hands-on Product Experience across StrongARM, Xeon, Core, Atom and now Quark.One of the core designers for Intel Security QuickAssist. Researcher in Trusted Computing in total system protection. \n \nSpecialties: Entrepreneurship, Startups, Business Development, Go-To-Market, Sales, Project Management, Embedded System Design, BIOS and firmware, Device Drivers, multicore technology, system architecture \n \nAreas of Interests: Intelligent Devices, Internet of Things, Big Data usage, Software Defined Network, Cloud Computing, Mobile Security Summary Strategic and creative thinker with technical roots. A life long embedded system designer in a world filled with connected devices. Experienced leader with strong project and management skills. A proven project and team leader with solid track records. Hands-on Product Experience across StrongARM, Xeon, Core, Atom and now Quark.One of the core designers for Intel Security QuickAssist. Researcher in Trusted Computing in total system protection. \n \nSpecialties: Entrepreneurship, Startups, Business Development, Go-To-Market, Sales, Project Management, Embedded System Design, BIOS and firmware, Device Drivers, multicore technology, system architecture \n \nAreas of Interests: Intelligent Devices, Internet of Things, Big Data usage, Software Defined Network, Cloud Computing, Mobile Security Strategic and creative thinker with technical roots. A life long embedded system designer in a world filled with connected devices. Experienced leader with strong project and management skills. A proven project and team leader with solid track records. Hands-on Product Experience across StrongARM, Xeon, Core, Atom and now Quark.One of the core designers for Intel Security QuickAssist. Researcher in Trusted Computing in total system protection. \n \nSpecialties: Entrepreneurship, Startups, Business Development, Go-To-Market, Sales, Project Management, Embedded System Design, BIOS and firmware, Device Drivers, multicore technology, system architecture \n \nAreas of Interests: Intelligent Devices, Internet of Things, Big Data usage, Software Defined Network, Cloud Computing, Mobile Security Strategic and creative thinker with technical roots. A life long embedded system designer in a world filled with connected devices. Experienced leader with strong project and management skills. A proven project and team leader with solid track records. Hands-on Product Experience across StrongARM, Xeon, Core, Atom and now Quark.One of the core designers for Intel Security QuickAssist. Researcher in Trusted Computing in total system protection. \n \nSpecialties: Entrepreneurship, Startups, Business Development, Go-To-Market, Sales, Project Management, Embedded System Design, BIOS and firmware, Device Drivers, multicore technology, system architecture \n \nAreas of Interests: Intelligent Devices, Internet of Things, Big Data usage, Software Defined Network, Cloud Computing, Mobile Security Experience Vice President NECINA June 2015  – Present (3 months) Cambridge, MA NECINA is the largest Chinese professional organization in Northeast America with 18 years of history. The organization is dedicated to community growth, career advancement and information exchange. Judge of National IoT Competition IOT Competition January 2015  – Present (8 months) Beijing City, China Judge for 2015 IOT Competition http://iotcompetition.org/ Sr. Technical Account Platform Architecture Engineer Intel July 2006  – Present (9 years 2 months) Hudson, MA Responsible for various strategic technical accounts. At the same time I am involved with R & D of next-gen solutions. In this role I am very glad to work alongside some ultra-talented teams and individuals on things that will help our end customers. Virtual Platform Tech Marketing Lead Intel Corporation July 2009  –  December 2014  (5 years 6 months) Greater Boston Area Virtual Platform technology Simics has proven track records and significant values for product R & D through product life cycle. In this role I manage and drive Virtual Platform customer engagement and external usage models for next-generation solutions. Simics is truly a hidden gem for embedded systems and cloud computing. Director, NECINA NEW Accelerator Program NECINA June 2012  –  June 2014  (2 years 1 month) Greater Boston Area NECINA NEW Accelerator is the first part-time incubator program ever! In 2012 we accepted 10+ new businesses. Several companies have received funding while participating in this program. VP Technology NECINA May 2013  –  May 2014  (1 year 1 month) Greater Boston Area In this role I am focusing on technology and information side of operations. Continue to be part of NECINA NEW Accelerator program 2.0, fostering the growth of new businesses in New England region. Co-Founder and Product Manager of Virtual Show Floor virtualshowfloor.com May 2012  –  December 2013  (1 year 8 months) Greater Boston Area As co-founder of this product I got to work with a stellar team of experts across multiple domains. Led the team and finished product building process as well as early market/customer engagement. Product Tech Lead (Tech Marketing) Intel Corporation June 2004  –  June 2006  (2 years 1 month) Greater Boston Area Worked as product technical lead for a variety of product lines ranging from Centrino, Core Duo, Core 2 Duo CPUs, 3100/7520 chipsets for embedded market segments. My areas of interest include embedded system designs and architecture and how to implement these technologies to help end customers and achieve great results. Firmware Engineer / Architect Intel February 2001  –  June 2004  (3 years 5 months) Joined Intel Westford team that has many Basis Communications team members. Worked on a very cool concept of programmable Network Processors. Designed Intel IXP4XX network processor HSS firmware. Lead designer for Xscale application component such as OS layer. Managed SW/SV engineering teams to deliver quality solution for IXP4XX Xscale application layer. Managed subcontract situations (IPSec) and drove solutions to finish line. Managed various BSP and RTOS related projects. Managed teams that had zero overlap from timezone perspective. Product early architecture definition for next-gen Security Devices.  \n \nOur Network Processor solutions were ranked No.1 worldwide around 2002-2003 time frame with IXP425 peaking as a great choice for SOHO and wireless APs. Embedded System Developer (Intern) AutoXray June 2000  –  September 2000  (4 months) Phoenix, Arizona Area Very addictive engineering environment lots of run working with Bill/Nigel/Jenifer and the whole crew at AutoXray. Vice President NECINA June 2015  – Present (3 months) Cambridge, MA NECINA is the largest Chinese professional organization in Northeast America with 18 years of history. The organization is dedicated to community growth, career advancement and information exchange. Vice President NECINA June 2015  – Present (3 months) Cambridge, MA NECINA is the largest Chinese professional organization in Northeast America with 18 years of history. The organization is dedicated to community growth, career advancement and information exchange. Judge of National IoT Competition IOT Competition January 2015  – Present (8 months) Beijing City, China Judge for 2015 IOT Competition http://iotcompetition.org/ Judge of National IoT Competition IOT Competition January 2015  – Present (8 months) Beijing City, China Judge for 2015 IOT Competition http://iotcompetition.org/ Sr. Technical Account Platform Architecture Engineer Intel July 2006  – Present (9 years 2 months) Hudson, MA Responsible for various strategic technical accounts. At the same time I am involved with R & D of next-gen solutions. In this role I am very glad to work alongside some ultra-talented teams and individuals on things that will help our end customers. Sr. Technical Account Platform Architecture Engineer Intel July 2006  – Present (9 years 2 months) Hudson, MA Responsible for various strategic technical accounts. At the same time I am involved with R & D of next-gen solutions. In this role I am very glad to work alongside some ultra-talented teams and individuals on things that will help our end customers. Virtual Platform Tech Marketing Lead Intel Corporation July 2009  –  December 2014  (5 years 6 months) Greater Boston Area Virtual Platform technology Simics has proven track records and significant values for product R & D through product life cycle. In this role I manage and drive Virtual Platform customer engagement and external usage models for next-generation solutions. Simics is truly a hidden gem for embedded systems and cloud computing. Virtual Platform Tech Marketing Lead Intel Corporation July 2009  –  December 2014  (5 years 6 months) Greater Boston Area Virtual Platform technology Simics has proven track records and significant values for product R & D through product life cycle. In this role I manage and drive Virtual Platform customer engagement and external usage models for next-generation solutions. Simics is truly a hidden gem for embedded systems and cloud computing. Director, NECINA NEW Accelerator Program NECINA June 2012  –  June 2014  (2 years 1 month) Greater Boston Area NECINA NEW Accelerator is the first part-time incubator program ever! In 2012 we accepted 10+ new businesses. Several companies have received funding while participating in this program. Director, NECINA NEW Accelerator Program NECINA June 2012  –  June 2014  (2 years 1 month) Greater Boston Area NECINA NEW Accelerator is the first part-time incubator program ever! In 2012 we accepted 10+ new businesses. Several companies have received funding while participating in this program. VP Technology NECINA May 2013  –  May 2014  (1 year 1 month) Greater Boston Area In this role I am focusing on technology and information side of operations. Continue to be part of NECINA NEW Accelerator program 2.0, fostering the growth of new businesses in New England region. VP Technology NECINA May 2013  –  May 2014  (1 year 1 month) Greater Boston Area In this role I am focusing on technology and information side of operations. Continue to be part of NECINA NEW Accelerator program 2.0, fostering the growth of new businesses in New England region. Co-Founder and Product Manager of Virtual Show Floor virtualshowfloor.com May 2012  –  December 2013  (1 year 8 months) Greater Boston Area As co-founder of this product I got to work with a stellar team of experts across multiple domains. Led the team and finished product building process as well as early market/customer engagement. Co-Founder and Product Manager of Virtual Show Floor virtualshowfloor.com May 2012  –  December 2013  (1 year 8 months) Greater Boston Area As co-founder of this product I got to work with a stellar team of experts across multiple domains. Led the team and finished product building process as well as early market/customer engagement. Product Tech Lead (Tech Marketing) Intel Corporation June 2004  –  June 2006  (2 years 1 month) Greater Boston Area Worked as product technical lead for a variety of product lines ranging from Centrino, Core Duo, Core 2 Duo CPUs, 3100/7520 chipsets for embedded market segments. My areas of interest include embedded system designs and architecture and how to implement these technologies to help end customers and achieve great results. Product Tech Lead (Tech Marketing) Intel Corporation June 2004  –  June 2006  (2 years 1 month) Greater Boston Area Worked as product technical lead for a variety of product lines ranging from Centrino, Core Duo, Core 2 Duo CPUs, 3100/7520 chipsets for embedded market segments. My areas of interest include embedded system designs and architecture and how to implement these technologies to help end customers and achieve great results. Firmware Engineer / Architect Intel February 2001  –  June 2004  (3 years 5 months) Joined Intel Westford team that has many Basis Communications team members. Worked on a very cool concept of programmable Network Processors. Designed Intel IXP4XX network processor HSS firmware. Lead designer for Xscale application component such as OS layer. Managed SW/SV engineering teams to deliver quality solution for IXP4XX Xscale application layer. Managed subcontract situations (IPSec) and drove solutions to finish line. Managed various BSP and RTOS related projects. Managed teams that had zero overlap from timezone perspective. Product early architecture definition for next-gen Security Devices.  \n \nOur Network Processor solutions were ranked No.1 worldwide around 2002-2003 time frame with IXP425 peaking as a great choice for SOHO and wireless APs. Firmware Engineer / Architect Intel February 2001  –  June 2004  (3 years 5 months) Joined Intel Westford team that has many Basis Communications team members. Worked on a very cool concept of programmable Network Processors. Designed Intel IXP4XX network processor HSS firmware. Lead designer for Xscale application component such as OS layer. Managed SW/SV engineering teams to deliver quality solution for IXP4XX Xscale application layer. Managed subcontract situations (IPSec) and drove solutions to finish line. Managed various BSP and RTOS related projects. Managed teams that had zero overlap from timezone perspective. Product early architecture definition for next-gen Security Devices.  \n \nOur Network Processor solutions were ranked No.1 worldwide around 2002-2003 time frame with IXP425 peaking as a great choice for SOHO and wireless APs. Embedded System Developer (Intern) AutoXray June 2000  –  September 2000  (4 months) Phoenix, Arizona Area Very addictive engineering environment lots of run working with Bill/Nigel/Jenifer and the whole crew at AutoXray. Embedded System Developer (Intern) AutoXray June 2000  –  September 2000  (4 months) Phoenix, Arizona Area Very addictive engineering environment lots of run working with Bill/Nigel/Jenifer and the whole crew at AutoXray. Languages Chinese Chinese Chinese Skills embedded system design architecture program management Product Requirements... Product Management Product Launch Architecture Team Leadership Vendor Relationships Multicultural Embedded Systems System Architecture Device Drivers Leadership Entrepreneurship Processors Wireless RTOS Go-to-market Strategy Start-ups Firmware Strategy Semiconductors Intel Program Management Product Requirements See 11+     See less Skills  embedded system design architecture program management Product Requirements... Product Management Product Launch Architecture Team Leadership Vendor Relationships Multicultural Embedded Systems System Architecture Device Drivers Leadership Entrepreneurship Processors Wireless RTOS Go-to-market Strategy Start-ups Firmware Strategy Semiconductors Intel Program Management Product Requirements See 11+     See less embedded system design architecture program management Product Requirements... Product Management Product Launch Architecture Team Leadership Vendor Relationships Multicultural Embedded Systems System Architecture Device Drivers Leadership Entrepreneurship Processors Wireless RTOS Go-to-market Strategy Start-ups Firmware Strategy Semiconductors Intel Program Management Product Requirements See 11+     See less embedded system design architecture program management Product Requirements... Product Management Product Launch Architecture Team Leadership Vendor Relationships Multicultural Embedded Systems System Architecture Device Drivers Leadership Entrepreneurship Processors Wireless RTOS Go-to-market Strategy Start-ups Firmware Strategy Semiconductors Intel Program Management Product Requirements See 11+     See less Education University of Washington Master of Science (MS),  Digital Signal Processing (School of Oceanography) 1997  – 1999 Researching the mystery of the Pacific ocean using 2-D seismic tomography technology. \"Big Data\" :-) Activities and Societies:  Seismic Tomography Arizona State University MSEE,  Communications 1999  – 2001 Viterbi who? Go Sun Devils! University of Science and Technology of China BS 1992  – 1997 University of Washington Master of Science (MS),  Digital Signal Processing (School of Oceanography) 1997  – 1999 Researching the mystery of the Pacific ocean using 2-D seismic tomography technology. \"Big Data\" :-) Activities and Societies:  Seismic Tomography University of Washington Master of Science (MS),  Digital Signal Processing (School of Oceanography) 1997  – 1999 Researching the mystery of the Pacific ocean using 2-D seismic tomography technology. \"Big Data\" :-) Activities and Societies:  Seismic Tomography University of Washington Master of Science (MS),  Digital Signal Processing (School of Oceanography) 1997  – 1999 Researching the mystery of the Pacific ocean using 2-D seismic tomography technology. \"Big Data\" :-) Activities and Societies:  Seismic Tomography Arizona State University MSEE,  Communications 1999  – 2001 Viterbi who? Go Sun Devils! Arizona State University MSEE,  Communications 1999  – 2001 Viterbi who? Go Sun Devils! Arizona State University MSEE,  Communications 1999  – 2001 Viterbi who? Go Sun Devils! University of Science and Technology of China BS 1992  – 1997 University of Science and Technology of China BS 1992  – 1997 University of Science and Technology of China BS 1992  – 1997 "]}