{"position": "Technical Marketing Engineer", "company": "Intel Corporation", "profiles": ["Summary After working the last 17 years at Intel doing a variety of technical and marketing jobs I started Northwest Vapors.  \n \nAt NW Vapors we supply electronic cigarette hardware and e-liquid to the various tobacco stores, head shops, and distributors, as well as online sales. \n \nSpecialties: Sales, Marketing \nNetwork design and debug \nSystem design, builds, and debug. \nWindows, Linux, Java, Flash \n3D Modeling/Animation, Graphics Design \nCustomer Service, Technical Support \nVirtualization, ESX, VMWare Summary After working the last 17 years at Intel doing a variety of technical and marketing jobs I started Northwest Vapors.  \n \nAt NW Vapors we supply electronic cigarette hardware and e-liquid to the various tobacco stores, head shops, and distributors, as well as online sales. \n \nSpecialties: Sales, Marketing \nNetwork design and debug \nSystem design, builds, and debug. \nWindows, Linux, Java, Flash \n3D Modeling/Animation, Graphics Design \nCustomer Service, Technical Support \nVirtualization, ESX, VMWare After working the last 17 years at Intel doing a variety of technical and marketing jobs I started Northwest Vapors.  \n \nAt NW Vapors we supply electronic cigarette hardware and e-liquid to the various tobacco stores, head shops, and distributors, as well as online sales. \n \nSpecialties: Sales, Marketing \nNetwork design and debug \nSystem design, builds, and debug. \nWindows, Linux, Java, Flash \n3D Modeling/Animation, Graphics Design \nCustomer Service, Technical Support \nVirtualization, ESX, VMWare After working the last 17 years at Intel doing a variety of technical and marketing jobs I started Northwest Vapors.  \n \nAt NW Vapors we supply electronic cigarette hardware and e-liquid to the various tobacco stores, head shops, and distributors, as well as online sales. \n \nSpecialties: Sales, Marketing \nNetwork design and debug \nSystem design, builds, and debug. \nWindows, Linux, Java, Flash \n3D Modeling/Animation, Graphics Design \nCustomer Service, Technical Support \nVirtualization, ESX, VMWare Experience Owner / Operator Northwest Vapors February 2011  – Present (4 years 7 months) 712 Bridge St. Vernonia, OR. 97064 Manufacturer and distributor of electronic cigarettes and e-liquids http://nwvapors.com. We have a retail location as well as supplying stores with our VapoRight and Taste E-Liquids products all over the USA. Sr. TME for Desktop Processor Marketing and Lab Manager Intel Corporation June 2006  –  April 2011  (4 years 11 months) I currently develop and execute the desktop processor marketing demo strategy. I also develop and manage demos for our division's key events such as ISMC, the ATZ at IDF, and IRUM. I develop the desktop processor demo guide for use in the field and channel as well as supply parts and demos for other organizations such as Corp Demos and SSG. I also manage the desktop processor lab in Hillsboro. Sr Technical Marketing Engineer Intel Corporation September 1993  –  April 2011  (17 years 8 months) I design, build and give computer and technology demonstrations. I Write technical documentation, develop classes and demonstrations for training. I also debug and test new technologies as well as write code for Java and Flash. Sr. DPS Xeon Technical Marketing Engineer Intel Corporation April 2003  –  June 2006  (3 years 3 months) Worked with multiple development teams in SSG and EPG to define and develop the future versions of Software Development Platforms (SDP) for distribution to internal and external customers. I define and drive the technologies enabling roadmaps for the Xeon development platforms as well as drive SSG technical needs in board and system meetings. I create the technical and marketing documentation for all of the Xeon SDP as well. Technical Marketing Engineer Intel Corporation September 1999  –  April 2003  (3 years 8 months) Manage, develop and deliver Intel corporate demonstrations for use in executive keynote presentations and tradeshows around the world. I work across Intel divisions to identify technologies and create timelines, messaging, and support requirements for event demonstrations. I then create, reproduce, and document demos before shipping to various locations and performing the demos on stage. Technical Marketing Engineer and Unix lead Intel Corporation November 1996  –  September 1999  (2 years 11 months) Managed all aspects of Server product completeness within EMSD as well as coordinated and provided Unix support across all EMSD platforms. I was involved with project leadership, investigation and disposition of errata, writing technical documents and training in support of ESG's products during design, development, and production phases. Interfaced with many Intel/ESG internal groups such as design engineering, system validation, compatibility labs, product marketing and business development, as well as external groups such as FSEs/FAEs and Major OEM/Distribution customers. Designed and taught 6 top ranked courses at Intel field sales conferences. Account Technical Marketing Engineer Intel Corporation September 1995  –  November 1996  (1 year 3 months) Technical customer interface for major accounts (Fujitsu/NEC/NCR/Micron/DG). Managed the closure of technical issues, communication of product updates and changes with server production products. Tracked, prioritized, and solved application/product issues reported by OEM customers, driving resolution across divisions both at Intel and customer sites. Author of technical white papers, engineering guidelines and other technical documents necessary for supporting our products. Communicated future customer requirements to product development and assisted in feature definition of new server products. Chaired customer and OEM meetings for business unit issue closure. Designed and implemented the OZZY subset of Intel servers. Configured our Internet connections including CSD/DSU's, Cisco router, and Ascend pipeline routers. Customer Manager Intel Corporation May 1995  –  September 1995  (5 months) Managed 150 temporary employees for the Intel Pentium Processor FDIV replacement program. Scripted support guidelines and escalation procedures for telephone operators. Designed and managed the Major Account's team and assisted in outsourcing of FDIV replacement call center. Technical Support Intel Corporation September 1993  –  May 1995  (1 year 9 months) OPSD Support and ProShare® Product Demonstration/Technical Support \nWas one of 4 senior technical support engineers for OPSD's faxmodem group and ProShare products. Provided technical customer support for the ProShare family of products including the ISVR Pro and other Intel video related products, both at the call center and offline (BBS, fax, and internet). Designed and set up demonstrations and guided tours. Trained FAE's on installation and troubleshooting of Intel video products.; marks and brands are the property of their respective owners. Owner RH Systems October 1992  –  September 1993  (1 year) Bought, sold, and repaied computer systems and networks. Hospital Corpsman US Navy August 1985  –  September 1988  (3 years 2 months) Hospital Corpsman Owner / Operator Northwest Vapors February 2011  – Present (4 years 7 months) 712 Bridge St. Vernonia, OR. 97064 Manufacturer and distributor of electronic cigarettes and e-liquids http://nwvapors.com. We have a retail location as well as supplying stores with our VapoRight and Taste E-Liquids products all over the USA. Owner / Operator Northwest Vapors February 2011  – Present (4 years 7 months) 712 Bridge St. Vernonia, OR. 97064 Manufacturer and distributor of electronic cigarettes and e-liquids http://nwvapors.com. We have a retail location as well as supplying stores with our VapoRight and Taste E-Liquids products all over the USA. Sr. TME for Desktop Processor Marketing and Lab Manager Intel Corporation June 2006  –  April 2011  (4 years 11 months) I currently develop and execute the desktop processor marketing demo strategy. I also develop and manage demos for our division's key events such as ISMC, the ATZ at IDF, and IRUM. I develop the desktop processor demo guide for use in the field and channel as well as supply parts and demos for other organizations such as Corp Demos and SSG. I also manage the desktop processor lab in Hillsboro. Sr. TME for Desktop Processor Marketing and Lab Manager Intel Corporation June 2006  –  April 2011  (4 years 11 months) I currently develop and execute the desktop processor marketing demo strategy. I also develop and manage demos for our division's key events such as ISMC, the ATZ at IDF, and IRUM. I develop the desktop processor demo guide for use in the field and channel as well as supply parts and demos for other organizations such as Corp Demos and SSG. I also manage the desktop processor lab in Hillsboro. Sr Technical Marketing Engineer Intel Corporation September 1993  –  April 2011  (17 years 8 months) I design, build and give computer and technology demonstrations. I Write technical documentation, develop classes and demonstrations for training. I also debug and test new technologies as well as write code for Java and Flash. Sr Technical Marketing Engineer Intel Corporation September 1993  –  April 2011  (17 years 8 months) I design, build and give computer and technology demonstrations. I Write technical documentation, develop classes and demonstrations for training. I also debug and test new technologies as well as write code for Java and Flash. Sr. DPS Xeon Technical Marketing Engineer Intel Corporation April 2003  –  June 2006  (3 years 3 months) Worked with multiple development teams in SSG and EPG to define and develop the future versions of Software Development Platforms (SDP) for distribution to internal and external customers. I define and drive the technologies enabling roadmaps for the Xeon development platforms as well as drive SSG technical needs in board and system meetings. I create the technical and marketing documentation for all of the Xeon SDP as well. Sr. DPS Xeon Technical Marketing Engineer Intel Corporation April 2003  –  June 2006  (3 years 3 months) Worked with multiple development teams in SSG and EPG to define and develop the future versions of Software Development Platforms (SDP) for distribution to internal and external customers. I define and drive the technologies enabling roadmaps for the Xeon development platforms as well as drive SSG technical needs in board and system meetings. I create the technical and marketing documentation for all of the Xeon SDP as well. Technical Marketing Engineer Intel Corporation September 1999  –  April 2003  (3 years 8 months) Manage, develop and deliver Intel corporate demonstrations for use in executive keynote presentations and tradeshows around the world. I work across Intel divisions to identify technologies and create timelines, messaging, and support requirements for event demonstrations. I then create, reproduce, and document demos before shipping to various locations and performing the demos on stage. Technical Marketing Engineer Intel Corporation September 1999  –  April 2003  (3 years 8 months) Manage, develop and deliver Intel corporate demonstrations for use in executive keynote presentations and tradeshows around the world. I work across Intel divisions to identify technologies and create timelines, messaging, and support requirements for event demonstrations. I then create, reproduce, and document demos before shipping to various locations and performing the demos on stage. Technical Marketing Engineer and Unix lead Intel Corporation November 1996  –  September 1999  (2 years 11 months) Managed all aspects of Server product completeness within EMSD as well as coordinated and provided Unix support across all EMSD platforms. I was involved with project leadership, investigation and disposition of errata, writing technical documents and training in support of ESG's products during design, development, and production phases. Interfaced with many Intel/ESG internal groups such as design engineering, system validation, compatibility labs, product marketing and business development, as well as external groups such as FSEs/FAEs and Major OEM/Distribution customers. Designed and taught 6 top ranked courses at Intel field sales conferences. Technical Marketing Engineer and Unix lead Intel Corporation November 1996  –  September 1999  (2 years 11 months) Managed all aspects of Server product completeness within EMSD as well as coordinated and provided Unix support across all EMSD platforms. I was involved with project leadership, investigation and disposition of errata, writing technical documents and training in support of ESG's products during design, development, and production phases. Interfaced with many Intel/ESG internal groups such as design engineering, system validation, compatibility labs, product marketing and business development, as well as external groups such as FSEs/FAEs and Major OEM/Distribution customers. Designed and taught 6 top ranked courses at Intel field sales conferences. Account Technical Marketing Engineer Intel Corporation September 1995  –  November 1996  (1 year 3 months) Technical customer interface for major accounts (Fujitsu/NEC/NCR/Micron/DG). Managed the closure of technical issues, communication of product updates and changes with server production products. Tracked, prioritized, and solved application/product issues reported by OEM customers, driving resolution across divisions both at Intel and customer sites. Author of technical white papers, engineering guidelines and other technical documents necessary for supporting our products. Communicated future customer requirements to product development and assisted in feature definition of new server products. Chaired customer and OEM meetings for business unit issue closure. Designed and implemented the OZZY subset of Intel servers. Configured our Internet connections including CSD/DSU's, Cisco router, and Ascend pipeline routers. Account Technical Marketing Engineer Intel Corporation September 1995  –  November 1996  (1 year 3 months) Technical customer interface for major accounts (Fujitsu/NEC/NCR/Micron/DG). Managed the closure of technical issues, communication of product updates and changes with server production products. Tracked, prioritized, and solved application/product issues reported by OEM customers, driving resolution across divisions both at Intel and customer sites. Author of technical white papers, engineering guidelines and other technical documents necessary for supporting our products. Communicated future customer requirements to product development and assisted in feature definition of new server products. Chaired customer and OEM meetings for business unit issue closure. Designed and implemented the OZZY subset of Intel servers. Configured our Internet connections including CSD/DSU's, Cisco router, and Ascend pipeline routers. Customer Manager Intel Corporation May 1995  –  September 1995  (5 months) Managed 150 temporary employees for the Intel Pentium Processor FDIV replacement program. Scripted support guidelines and escalation procedures for telephone operators. Designed and managed the Major Account's team and assisted in outsourcing of FDIV replacement call center. Customer Manager Intel Corporation May 1995  –  September 1995  (5 months) Managed 150 temporary employees for the Intel Pentium Processor FDIV replacement program. Scripted support guidelines and escalation procedures for telephone operators. Designed and managed the Major Account's team and assisted in outsourcing of FDIV replacement call center. Technical Support Intel Corporation September 1993  –  May 1995  (1 year 9 months) OPSD Support and ProShare® Product Demonstration/Technical Support \nWas one of 4 senior technical support engineers for OPSD's faxmodem group and ProShare products. Provided technical customer support for the ProShare family of products including the ISVR Pro and other Intel video related products, both at the call center and offline (BBS, fax, and internet). Designed and set up demonstrations and guided tours. Trained FAE's on installation and troubleshooting of Intel video products.; marks and brands are the property of their respective owners. Technical Support Intel Corporation September 1993  –  May 1995  (1 year 9 months) OPSD Support and ProShare® Product Demonstration/Technical Support \nWas one of 4 senior technical support engineers for OPSD's faxmodem group and ProShare products. Provided technical customer support for the ProShare family of products including the ISVR Pro and other Intel video related products, both at the call center and offline (BBS, fax, and internet). Designed and set up demonstrations and guided tours. Trained FAE's on installation and troubleshooting of Intel video products.; marks and brands are the property of their respective owners. Owner RH Systems October 1992  –  September 1993  (1 year) Bought, sold, and repaied computer systems and networks. Owner RH Systems October 1992  –  September 1993  (1 year) Bought, sold, and repaied computer systems and networks. Hospital Corpsman US Navy August 1985  –  September 1988  (3 years 2 months) Hospital Corpsman Hospital Corpsman US Navy August 1985  –  September 1988  (3 years 2 months) Hospital Corpsman Skills Linux Software Development Testing Hardware Virtualization Troubleshooting Management Strategy Leadership Wireless Embedded Systems Unix Servers CRM Debugging Windows VMware Product Marketing Data Center Startup Development Startup Marketing Account Management Team Management Project Management See 9+     See less Skills  Linux Software Development Testing Hardware Virtualization Troubleshooting Management Strategy Leadership Wireless Embedded Systems Unix Servers CRM Debugging Windows VMware Product Marketing Data Center Startup Development Startup Marketing Account Management Team Management Project Management See 9+     See less Linux Software Development Testing Hardware Virtualization Troubleshooting Management Strategy Leadership Wireless Embedded Systems Unix Servers CRM Debugging Windows VMware Product Marketing Data Center Startup Development Startup Marketing Account Management Team Management Project Management See 9+     See less Linux Software Development Testing Hardware Virtualization Troubleshooting Management Strategy Leadership Wireless Embedded Systems Unix Servers CRM Debugging Windows VMware Product Marketing Data Center Startup Development Startup Marketing Account Management Team Management Project Management See 9+     See less Education The George Washington University School of Medicine and Health Sciences Bachelor of Sience,  Nursing 1986  – 1988 Nursing Cuesta College 1983  – 1984 The George Washington University School of Medicine and Health Sciences Bachelor of Sience,  Nursing 1986  – 1988 Nursing The George Washington University School of Medicine and Health Sciences Bachelor of Sience,  Nursing 1986  – 1988 Nursing The George Washington University School of Medicine and Health Sciences Bachelor of Sience,  Nursing 1986  – 1988 Nursing Cuesta College 1983  – 1984 Cuesta College 1983  – 1984 Cuesta College 1983  – 1984 ", "Summary Seasoned marketing professional with a technical edge and 15+ years of marketing experience. Experience in a variety of roles including product marketing, press relations, marketing communications, business development, and technical marketing. A team player, a strategic thinker and a strong communicator with strengths in Product Marketing, Communication, and Marketing Tools. \n \nSpecialties:  \n• Product Marketing: Product positioning and messaging, managing marketing programs/campaigns, product launches, brand management, training and sales support \n• Communication: Developing high impact presentations, press relations and building relationships, communicating technical and complex products to a diverse audience,  \n• Marketing Tools: Collateral development, product brochures, press releases, datasheets, product demos, sales guides, online/print advertising, social media platforms Summary Seasoned marketing professional with a technical edge and 15+ years of marketing experience. Experience in a variety of roles including product marketing, press relations, marketing communications, business development, and technical marketing. A team player, a strategic thinker and a strong communicator with strengths in Product Marketing, Communication, and Marketing Tools. \n \nSpecialties:  \n• Product Marketing: Product positioning and messaging, managing marketing programs/campaigns, product launches, brand management, training and sales support \n• Communication: Developing high impact presentations, press relations and building relationships, communicating technical and complex products to a diverse audience,  \n• Marketing Tools: Collateral development, product brochures, press releases, datasheets, product demos, sales guides, online/print advertising, social media platforms Seasoned marketing professional with a technical edge and 15+ years of marketing experience. Experience in a variety of roles including product marketing, press relations, marketing communications, business development, and technical marketing. A team player, a strategic thinker and a strong communicator with strengths in Product Marketing, Communication, and Marketing Tools. \n \nSpecialties:  \n• Product Marketing: Product positioning and messaging, managing marketing programs/campaigns, product launches, brand management, training and sales support \n• Communication: Developing high impact presentations, press relations and building relationships, communicating technical and complex products to a diverse audience,  \n• Marketing Tools: Collateral development, product brochures, press releases, datasheets, product demos, sales guides, online/print advertising, social media platforms Seasoned marketing professional with a technical edge and 15+ years of marketing experience. Experience in a variety of roles including product marketing, press relations, marketing communications, business development, and technical marketing. A team player, a strategic thinker and a strong communicator with strengths in Product Marketing, Communication, and Marketing Tools. \n \nSpecialties:  \n• Product Marketing: Product positioning and messaging, managing marketing programs/campaigns, product launches, brand management, training and sales support \n• Communication: Developing high impact presentations, press relations and building relationships, communicating technical and complex products to a diverse audience,  \n• Marketing Tools: Collateral development, product brochures, press releases, datasheets, product demos, sales guides, online/print advertising, social media platforms Experience Technical Marketing Engineer Intel Corporation July 2012  – Present (3 years 2 months) San Francisco Bay Area Marketing Engineer (contract) at Intel Corporation Empirical, Inc June 2011  –  July 2012  (1 year 2 months) San Francisco Bay Area Marketing Manager Cyber Switching, Inc. August 2009  –  May 2011  (1 year 10 months) Senior Product Marketing Engineer Asyst Technologies July 2008  –  October 2008  (4 months) Product Marketing Engineer Corsair Memory December 2006  –  July 2008  (1 year 8 months) Technical Marketing Engineer Intel Corporation August 2005  –  November 2006  (1 year 4 months) Press Relations Manager Intel Corporation April 2004  –  August 2005  (1 year 5 months) Performance Marketing Engineer Intel Corporation May 2001  –  April 2004  (3 years) Sales and Marketing Rotation Program Intel Corporation August 1999  –  May 2001  (1 year 10 months) Technical Marketing Engineer Intel Corporation July 2012  – Present (3 years 2 months) San Francisco Bay Area Technical Marketing Engineer Intel Corporation July 2012  – Present (3 years 2 months) San Francisco Bay Area Marketing Engineer (contract) at Intel Corporation Empirical, Inc June 2011  –  July 2012  (1 year 2 months) San Francisco Bay Area Marketing Engineer (contract) at Intel Corporation Empirical, Inc June 2011  –  July 2012  (1 year 2 months) San Francisco Bay Area Marketing Manager Cyber Switching, Inc. August 2009  –  May 2011  (1 year 10 months) Marketing Manager Cyber Switching, Inc. August 2009  –  May 2011  (1 year 10 months) Senior Product Marketing Engineer Asyst Technologies July 2008  –  October 2008  (4 months) Senior Product Marketing Engineer Asyst Technologies July 2008  –  October 2008  (4 months) Product Marketing Engineer Corsair Memory December 2006  –  July 2008  (1 year 8 months) Product Marketing Engineer Corsair Memory December 2006  –  July 2008  (1 year 8 months) Technical Marketing Engineer Intel Corporation August 2005  –  November 2006  (1 year 4 months) Technical Marketing Engineer Intel Corporation August 2005  –  November 2006  (1 year 4 months) Press Relations Manager Intel Corporation April 2004  –  August 2005  (1 year 5 months) Press Relations Manager Intel Corporation April 2004  –  August 2005  (1 year 5 months) Performance Marketing Engineer Intel Corporation May 2001  –  April 2004  (3 years) Performance Marketing Engineer Intel Corporation May 2001  –  April 2004  (3 years) Sales and Marketing Rotation Program Intel Corporation August 1999  –  May 2001  (1 year 10 months) Sales and Marketing Rotation Program Intel Corporation August 1999  –  May 2001  (1 year 10 months) Skills Technical Marketing Press Releases Marketing Communications Social Media Product Marketing Marketing Brand Management Product Demonstration Press Relations Communication Skills Demos Product Launch Product Launch Events Product Development Product Management Cross-functional Team... Trade Shows Program Management Consumer Electronics Semiconductors Intel Go-to-market Strategy Messaging Sales Operations Product Lifecycle... Processors Competitive Analysis See 12+     See less Skills  Technical Marketing Press Releases Marketing Communications Social Media Product Marketing Marketing Brand Management Product Demonstration Press Relations Communication Skills Demos Product Launch Product Launch Events Product Development Product Management Cross-functional Team... Trade Shows Program Management Consumer Electronics Semiconductors Intel Go-to-market Strategy Messaging Sales Operations Product Lifecycle... Processors Competitive Analysis See 12+     See less Technical Marketing Press Releases Marketing Communications Social Media Product Marketing Marketing Brand Management Product Demonstration Press Relations Communication Skills Demos Product Launch Product Launch Events Product Development Product Management Cross-functional Team... Trade Shows Program Management Consumer Electronics Semiconductors Intel Go-to-market Strategy Messaging Sales Operations Product Lifecycle... Processors Competitive Analysis See 12+     See less Technical Marketing Press Releases Marketing Communications Social Media Product Marketing Marketing Brand Management Product Demonstration Press Relations Communication Skills Demos Product Launch Product Launch Events Product Development Product Management Cross-functional Team... Trade Shows Program Management Consumer Electronics Semiconductors Intel Go-to-market Strategy Messaging Sales Operations Product Lifecycle... Processors Competitive Analysis See 12+     See less Education University of California, Davis BS University of California, Davis BS University of California, Davis BS University of California, Davis BS ", "Summary Over my 14 year career at Intel I have worked in software development, software validation, program management, and a technical marketing engineer for both hardware (LAN 1gig) and software (Linux, OpenStack, and Android). I have a broad understanding of the entire gamut of computers and related technologies including understanding how high speed differential signals propagate, how firmware interacts with hardware, how BIOS and the chipsets interact, and the many different programming languages.  \n \nI enjoy the work I do now and am focusing on improving my Android technical depth across the entire OS software stack. I take a particular interest in how companies strategically respond to competition which is why I pursued an MBA earlier in my career. My goal is to continue working as a TME while I build a strong technical depth on Android with plans to eventually move into a strategic planning or marketing role. I enjoy the work I do now travelling to meet customers, developing product demos, and solving complex technical issues. Summary Over my 14 year career at Intel I have worked in software development, software validation, program management, and a technical marketing engineer for both hardware (LAN 1gig) and software (Linux, OpenStack, and Android). I have a broad understanding of the entire gamut of computers and related technologies including understanding how high speed differential signals propagate, how firmware interacts with hardware, how BIOS and the chipsets interact, and the many different programming languages.  \n \nI enjoy the work I do now and am focusing on improving my Android technical depth across the entire OS software stack. I take a particular interest in how companies strategically respond to competition which is why I pursued an MBA earlier in my career. My goal is to continue working as a TME while I build a strong technical depth on Android with plans to eventually move into a strategic planning or marketing role. I enjoy the work I do now travelling to meet customers, developing product demos, and solving complex technical issues. Over my 14 year career at Intel I have worked in software development, software validation, program management, and a technical marketing engineer for both hardware (LAN 1gig) and software (Linux, OpenStack, and Android). I have a broad understanding of the entire gamut of computers and related technologies including understanding how high speed differential signals propagate, how firmware interacts with hardware, how BIOS and the chipsets interact, and the many different programming languages.  \n \nI enjoy the work I do now and am focusing on improving my Android technical depth across the entire OS software stack. I take a particular interest in how companies strategically respond to competition which is why I pursued an MBA earlier in my career. My goal is to continue working as a TME while I build a strong technical depth on Android with plans to eventually move into a strategic planning or marketing role. I enjoy the work I do now travelling to meet customers, developing product demos, and solving complex technical issues. Over my 14 year career at Intel I have worked in software development, software validation, program management, and a technical marketing engineer for both hardware (LAN 1gig) and software (Linux, OpenStack, and Android). I have a broad understanding of the entire gamut of computers and related technologies including understanding how high speed differential signals propagate, how firmware interacts with hardware, how BIOS and the chipsets interact, and the many different programming languages.  \n \nI enjoy the work I do now and am focusing on improving my Android technical depth across the entire OS software stack. I take a particular interest in how companies strategically respond to competition which is why I pursued an MBA earlier in my career. My goal is to continue working as a TME while I build a strong technical depth on Android with plans to eventually move into a strategic planning or marketing role. I enjoy the work I do now travelling to meet customers, developing product demos, and solving complex technical issues. Experience Technical Marketing Engineer Intel Corporation February 2011  – Present (4 years 7 months) Hillsboro, OR TME working for the Intel(r) Open Source Technology Center (OSTS) supporting Android, OpenStack, Mission Critical Linux, and MeeGo.  \n \n1) Led and personally established the initial Android customer support process for tablets for a worldwide team of TME's spread across 5 countries.  \n2) Developed compelling Android demos that showed some of Intel's first Atom processors for Android tablets running fast and smooth. \n3) Developed and showed demos on OpenStack for COSBench, Trusted Compute Pools, and single-bit/multi-bit error injection that show Intel's lead in this area.  \n4) Conceived of, developed, and scripted several video training's around Android on Intel. See below for examples. \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-mac-os-with-intel-hardware-accelerated-execution-manager \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-ubuntu-with-kvm-acceleration-supported-by-intel-vt-x \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-microsoft-windows-with-intel-hardware-accelerated-execution-manager \n \nhttp://www.youtube.com/watch?v=If8C6xX1mpg \n \nMost recently (2014 and 2015) I have been working on Intel's Reference Device for Android program which has successfully met its goal to provide over the air updates of the latest Android version with 2 weeks of each major release. This program aims to solve a major headache in the industry by providing a semi-custom reference platform that ODM's/OEM's can bring to market quickly that will always run the latest Android version. The first IRDA device that I worked on is the TrekStor SurfTab tablet http://www.trekstor.de/detail-surftabs-en/product/surftab-xintron-i-70.html and is already running the latest Android version. Technical Marketing Engineer Intel Corporation March 2007  –  February 2011  (4 years) Hillsboro, OR TME working in LAN Access Division supporting MNC's such as Dell on their integrated LOM (Lan On Motherboard) hardware designs for the Intel vPro platform. \n-Reviewed Customer hardware schematics/layouts and fixed the customers design mistakes saving them money in unnecessary board spins \n-Developed Sales and Training presentations that were delivered on site in Korea, Japan, China, Taiwan, and the USA \n-Secured design wins for Intel contributing millions of dollars to the LAN division \n-Provided second line support for hardware and software related LAN issues to customers like LGE, Acer, Asus, Quanta, etc.. \n-IEEE testing, conformance, and debug \n-Improved team processes such as consolidating all of the best layout guidelines for all products into a single source document to help over 20 other coworkers and all customers. This was a one year commitment meeting weekly with some of the top engineers at Intel to work through complicated details. Validation Program Manager Intel March 2005  –  March 2007  (2 years 1 month) Validation Program Manager for the entire validation team worldwide for verifying candidates to work with Intel® Viiv™ (http://www.intel.com/viiv).  \n- Lead a cross functional team to develop of the validation strategy and test plans for three major releases of Viiv  \n- Forecasted and tracked budget for equipment and contractors  \n- Developed processes and tools to track the verification of hundreds of Viiv candidates targeted for 10 different countries \n- Developed project schedules for three major releases of Viiv working with engineers across multiple groups and GEOs. \n- Oversaw defect management process and audited the results of engineers. \n- Led the tool consolidation effort to migrate multiple disparate tools to SAP \n \nValidation Program manager for the Intel® Channel Marketplace Program  \n- Lead the development of the validation strategy in China  \n- Worked with Intel marketing teams worldwide to prioritize the validation of candidates through the Shanghai test lab. Validation Engineer Intel October 2003  –  March 2005  (1 year 6 months) Validation lead for many successful releases of Intel Integrator Toolkit and Intel Express Installer. Developed project schedules, managed validation resources, created indicators, sourced and developed automation testing, documented test plans and strategy, and mentored a contractor to a full time position. \n \nDeveloped and documented the teams defect management process with Tibet and created the templates all validation engineers follow for the Software Test Plans and Test Descriptor Specifications. Software Engineer / Project Manager Intel August 2001  –  October 2003  (2 years 3 months) Managed, developed, and improved process for the release of all CD software for the Intel server division. Managed product milestones and release schedules for 60 products. Drove continuous improvements into the user interface, reducing production time by 30%.  \n \nProject managed a global team in development of the Microsoft .NET Online CD Contents Management System. \n \nManaged over 2000 eRoom users within EPSD. ERoom is a mission-critical collaboration tool. Developed tools in Visual Basic and ASP, extending business applications using the eRoom API. One of these tools identified, notified, and removed inactive users, saving Intel over $100,000 in licenses per year.  \n \nDeveloped a new HTML CD GUI interface that reduced the time required to make CDs by 40%, reduced errors in coding, and improved functionality. \n \nImplemented the Doors 7.0 database and web server, a requirements document management system used by teams to develop product specifications. Software Engineer CDI (Intel Contractor) August 2000  –  August 2001  (1 year 1 month) Redesigned a web request tracking system in ASP that interfaces with a SQL Server 7.0 database. \n \nDeveloped part of a menu program in the C programming language that runs in Intel’s new Extensible Firmware Interface (EFI) environment for the Intel® Itanium® processor. \n \nDeveloped the front end of a software build system to schedule and execute builds through a web site. Software Engineer (intern) Intel June 2000  –  August 2000  (3 months) Developed Active Server Pages using JavaScript and VBScript to Interface with multiple SQL databases. \n \nReengineered several databases and enforced referential integrity. \n \nMigrated existing web pages to an IT supported web server and repaired ASP scripts. Outside Plant Engineer Bellsouth May 1996  –  May 1997  (1 year 1 month) Designed a $70,000 fiber optic cable route through a new apartment complex and coordinated the project with other departments, customers, and outside contractors. \n \nDesigned and maintained telephone cable routes using BellSouth’s proprietary CAD system. Technical Marketing Engineer Intel Corporation February 2011  – Present (4 years 7 months) Hillsboro, OR TME working for the Intel(r) Open Source Technology Center (OSTS) supporting Android, OpenStack, Mission Critical Linux, and MeeGo.  \n \n1) Led and personally established the initial Android customer support process for tablets for a worldwide team of TME's spread across 5 countries.  \n2) Developed compelling Android demos that showed some of Intel's first Atom processors for Android tablets running fast and smooth. \n3) Developed and showed demos on OpenStack for COSBench, Trusted Compute Pools, and single-bit/multi-bit error injection that show Intel's lead in this area.  \n4) Conceived of, developed, and scripted several video training's around Android on Intel. See below for examples. \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-mac-os-with-intel-hardware-accelerated-execution-manager \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-ubuntu-with-kvm-acceleration-supported-by-intel-vt-x \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-microsoft-windows-with-intel-hardware-accelerated-execution-manager \n \nhttp://www.youtube.com/watch?v=If8C6xX1mpg \n \nMost recently (2014 and 2015) I have been working on Intel's Reference Device for Android program which has successfully met its goal to provide over the air updates of the latest Android version with 2 weeks of each major release. This program aims to solve a major headache in the industry by providing a semi-custom reference platform that ODM's/OEM's can bring to market quickly that will always run the latest Android version. The first IRDA device that I worked on is the TrekStor SurfTab tablet http://www.trekstor.de/detail-surftabs-en/product/surftab-xintron-i-70.html and is already running the latest Android version. Technical Marketing Engineer Intel Corporation February 2011  – Present (4 years 7 months) Hillsboro, OR TME working for the Intel(r) Open Source Technology Center (OSTS) supporting Android, OpenStack, Mission Critical Linux, and MeeGo.  \n \n1) Led and personally established the initial Android customer support process for tablets for a worldwide team of TME's spread across 5 countries.  \n2) Developed compelling Android demos that showed some of Intel's first Atom processors for Android tablets running fast and smooth. \n3) Developed and showed demos on OpenStack for COSBench, Trusted Compute Pools, and single-bit/multi-bit error injection that show Intel's lead in this area.  \n4) Conceived of, developed, and scripted several video training's around Android on Intel. See below for examples. \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-mac-os-with-intel-hardware-accelerated-execution-manager \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-ubuntu-with-kvm-acceleration-supported-by-intel-vt-x \n \nhttp://software.intel.com/en-us/videos/android-ics-emulator-for-microsoft-windows-with-intel-hardware-accelerated-execution-manager \n \nhttp://www.youtube.com/watch?v=If8C6xX1mpg \n \nMost recently (2014 and 2015) I have been working on Intel's Reference Device for Android program which has successfully met its goal to provide over the air updates of the latest Android version with 2 weeks of each major release. This program aims to solve a major headache in the industry by providing a semi-custom reference platform that ODM's/OEM's can bring to market quickly that will always run the latest Android version. The first IRDA device that I worked on is the TrekStor SurfTab tablet http://www.trekstor.de/detail-surftabs-en/product/surftab-xintron-i-70.html and is already running the latest Android version. Technical Marketing Engineer Intel Corporation March 2007  –  February 2011  (4 years) Hillsboro, OR TME working in LAN Access Division supporting MNC's such as Dell on their integrated LOM (Lan On Motherboard) hardware designs for the Intel vPro platform. \n-Reviewed Customer hardware schematics/layouts and fixed the customers design mistakes saving them money in unnecessary board spins \n-Developed Sales and Training presentations that were delivered on site in Korea, Japan, China, Taiwan, and the USA \n-Secured design wins for Intel contributing millions of dollars to the LAN division \n-Provided second line support for hardware and software related LAN issues to customers like LGE, Acer, Asus, Quanta, etc.. \n-IEEE testing, conformance, and debug \n-Improved team processes such as consolidating all of the best layout guidelines for all products into a single source document to help over 20 other coworkers and all customers. This was a one year commitment meeting weekly with some of the top engineers at Intel to work through complicated details. Technical Marketing Engineer Intel Corporation March 2007  –  February 2011  (4 years) Hillsboro, OR TME working in LAN Access Division supporting MNC's such as Dell on their integrated LOM (Lan On Motherboard) hardware designs for the Intel vPro platform. \n-Reviewed Customer hardware schematics/layouts and fixed the customers design mistakes saving them money in unnecessary board spins \n-Developed Sales and Training presentations that were delivered on site in Korea, Japan, China, Taiwan, and the USA \n-Secured design wins for Intel contributing millions of dollars to the LAN division \n-Provided second line support for hardware and software related LAN issues to customers like LGE, Acer, Asus, Quanta, etc.. \n-IEEE testing, conformance, and debug \n-Improved team processes such as consolidating all of the best layout guidelines for all products into a single source document to help over 20 other coworkers and all customers. This was a one year commitment meeting weekly with some of the top engineers at Intel to work through complicated details. Validation Program Manager Intel March 2005  –  March 2007  (2 years 1 month) Validation Program Manager for the entire validation team worldwide for verifying candidates to work with Intel® Viiv™ (http://www.intel.com/viiv).  \n- Lead a cross functional team to develop of the validation strategy and test plans for three major releases of Viiv  \n- Forecasted and tracked budget for equipment and contractors  \n- Developed processes and tools to track the verification of hundreds of Viiv candidates targeted for 10 different countries \n- Developed project schedules for three major releases of Viiv working with engineers across multiple groups and GEOs. \n- Oversaw defect management process and audited the results of engineers. \n- Led the tool consolidation effort to migrate multiple disparate tools to SAP \n \nValidation Program manager for the Intel® Channel Marketplace Program  \n- Lead the development of the validation strategy in China  \n- Worked with Intel marketing teams worldwide to prioritize the validation of candidates through the Shanghai test lab. Validation Program Manager Intel March 2005  –  March 2007  (2 years 1 month) Validation Program Manager for the entire validation team worldwide for verifying candidates to work with Intel® Viiv™ (http://www.intel.com/viiv).  \n- Lead a cross functional team to develop of the validation strategy and test plans for three major releases of Viiv  \n- Forecasted and tracked budget for equipment and contractors  \n- Developed processes and tools to track the verification of hundreds of Viiv candidates targeted for 10 different countries \n- Developed project schedules for three major releases of Viiv working with engineers across multiple groups and GEOs. \n- Oversaw defect management process and audited the results of engineers. \n- Led the tool consolidation effort to migrate multiple disparate tools to SAP \n \nValidation Program manager for the Intel® Channel Marketplace Program  \n- Lead the development of the validation strategy in China  \n- Worked with Intel marketing teams worldwide to prioritize the validation of candidates through the Shanghai test lab. Validation Engineer Intel October 2003  –  March 2005  (1 year 6 months) Validation lead for many successful releases of Intel Integrator Toolkit and Intel Express Installer. Developed project schedules, managed validation resources, created indicators, sourced and developed automation testing, documented test plans and strategy, and mentored a contractor to a full time position. \n \nDeveloped and documented the teams defect management process with Tibet and created the templates all validation engineers follow for the Software Test Plans and Test Descriptor Specifications. Validation Engineer Intel October 2003  –  March 2005  (1 year 6 months) Validation lead for many successful releases of Intel Integrator Toolkit and Intel Express Installer. Developed project schedules, managed validation resources, created indicators, sourced and developed automation testing, documented test plans and strategy, and mentored a contractor to a full time position. \n \nDeveloped and documented the teams defect management process with Tibet and created the templates all validation engineers follow for the Software Test Plans and Test Descriptor Specifications. Software Engineer / Project Manager Intel August 2001  –  October 2003  (2 years 3 months) Managed, developed, and improved process for the release of all CD software for the Intel server division. Managed product milestones and release schedules for 60 products. Drove continuous improvements into the user interface, reducing production time by 30%.  \n \nProject managed a global team in development of the Microsoft .NET Online CD Contents Management System. \n \nManaged over 2000 eRoom users within EPSD. ERoom is a mission-critical collaboration tool. Developed tools in Visual Basic and ASP, extending business applications using the eRoom API. One of these tools identified, notified, and removed inactive users, saving Intel over $100,000 in licenses per year.  \n \nDeveloped a new HTML CD GUI interface that reduced the time required to make CDs by 40%, reduced errors in coding, and improved functionality. \n \nImplemented the Doors 7.0 database and web server, a requirements document management system used by teams to develop product specifications. Software Engineer / Project Manager Intel August 2001  –  October 2003  (2 years 3 months) Managed, developed, and improved process for the release of all CD software for the Intel server division. Managed product milestones and release schedules for 60 products. Drove continuous improvements into the user interface, reducing production time by 30%.  \n \nProject managed a global team in development of the Microsoft .NET Online CD Contents Management System. \n \nManaged over 2000 eRoom users within EPSD. ERoom is a mission-critical collaboration tool. Developed tools in Visual Basic and ASP, extending business applications using the eRoom API. One of these tools identified, notified, and removed inactive users, saving Intel over $100,000 in licenses per year.  \n \nDeveloped a new HTML CD GUI interface that reduced the time required to make CDs by 40%, reduced errors in coding, and improved functionality. \n \nImplemented the Doors 7.0 database and web server, a requirements document management system used by teams to develop product specifications. Software Engineer CDI (Intel Contractor) August 2000  –  August 2001  (1 year 1 month) Redesigned a web request tracking system in ASP that interfaces with a SQL Server 7.0 database. \n \nDeveloped part of a menu program in the C programming language that runs in Intel’s new Extensible Firmware Interface (EFI) environment for the Intel® Itanium® processor. \n \nDeveloped the front end of a software build system to schedule and execute builds through a web site. Software Engineer CDI (Intel Contractor) August 2000  –  August 2001  (1 year 1 month) Redesigned a web request tracking system in ASP that interfaces with a SQL Server 7.0 database. \n \nDeveloped part of a menu program in the C programming language that runs in Intel’s new Extensible Firmware Interface (EFI) environment for the Intel® Itanium® processor. \n \nDeveloped the front end of a software build system to schedule and execute builds through a web site. Software Engineer (intern) Intel June 2000  –  August 2000  (3 months) Developed Active Server Pages using JavaScript and VBScript to Interface with multiple SQL databases. \n \nReengineered several databases and enforced referential integrity. \n \nMigrated existing web pages to an IT supported web server and repaired ASP scripts. Software Engineer (intern) Intel June 2000  –  August 2000  (3 months) Developed Active Server Pages using JavaScript and VBScript to Interface with multiple SQL databases. \n \nReengineered several databases and enforced referential integrity. \n \nMigrated existing web pages to an IT supported web server and repaired ASP scripts. Outside Plant Engineer Bellsouth May 1996  –  May 1997  (1 year 1 month) Designed a $70,000 fiber optic cable route through a new apartment complex and coordinated the project with other departments, customers, and outside contractors. \n \nDesigned and maintained telephone cable routes using BellSouth’s proprietary CAD system. Outside Plant Engineer Bellsouth May 1996  –  May 1997  (1 year 1 month) Designed a $70,000 fiber optic cable route through a new apartment complex and coordinated the project with other departments, customers, and outside contractors. \n \nDesigned and maintained telephone cable routes using BellSouth’s proprietary CAD system. Education Tennessee Technological University - College of Business Administration MBA,  General Management Concentration 1999  – 2001 Overall GPA: 3.8 \nEarned 100% of education Tennessee Technological University BSEE,  Digital Design Concentration 1994  – 1999 Graduated In Cursu Honorum Summa Cum Laude \nOverall GPA: 3.98 Major GPA: 4.0 Activities and Societies:  Theta Tau professional Engineering Fraternity (President) Tennessee Technological University - College of Business Administration MBA,  General Management Concentration 1999  – 2001 Overall GPA: 3.8 \nEarned 100% of education Tennessee Technological University - College of Business Administration MBA,  General Management Concentration 1999  – 2001 Overall GPA: 3.8 \nEarned 100% of education Tennessee Technological University - College of Business Administration MBA,  General Management Concentration 1999  – 2001 Overall GPA: 3.8 \nEarned 100% of education Tennessee Technological University BSEE,  Digital Design Concentration 1994  – 1999 Graduated In Cursu Honorum Summa Cum Laude \nOverall GPA: 3.98 Major GPA: 4.0 Activities and Societies:  Theta Tau professional Engineering Fraternity (President) Tennessee Technological University BSEE,  Digital Design Concentration 1994  – 1999 Graduated In Cursu Honorum Summa Cum Laude \nOverall GPA: 3.98 Major GPA: 4.0 Activities and Societies:  Theta Tau professional Engineering Fraternity (President) Tennessee Technological University BSEE,  Digital Design Concentration 1994  – 1999 Graduated In Cursu Honorum Summa Cum Laude \nOverall GPA: 3.98 Major GPA: 4.0 Activities and Societies:  Theta Tau professional Engineering Fraternity (President) ", "Summary •\tTechnical Marketing Evangelist with twenty-five year’ experience marked by professionalism and commitment. Conversant in a range of marketing and promotional disciplines. \n•\tProficient with both technical concepts and customer/consumer priorities; skilled in driving promotional initiatives influencing high-level decision makers.  \n•\tKnown for energy, innovation, communication and adaptability.  \n•\tWidely traveled, comfortable with diverse cultures and experience working in China, Hong Kong, South Korea, Taiwan, Japan, Australia, Chile, Brazil, Mexico, Canada, Germany, India, Singapore, Dutch West Indies, and 40+ states.  \n•\tConversational fluency in Spanish; learning Mandarin.  \n \nCORE COMPETENCIES \n•\tProject & Team Management \n•\tPresentation Planning & Delivery  \n•\tCross-Functional Groups \n•\tCollaboration \n•\tTechnical Consultation \n•\tResearch/Analysis/Documentation \n•\tField Support \n•\tTechnology Integration/Conversion \n•\tCustomer Needs Assessment \n•\tForecasting/Strategic Planning \n•\tEvent Planning & Coordination \n•\tProduct Development \n•\tTraining & Coaching \n•\tLiaison Functions \n•\tCompetitor & Industry Trend Analysis \n•\tDemand Creation \n \nTECHNICAL SKILLSET \nOperating Systems: Windows XP, Windows 7, Windows 8, Windows 8.1, ChromeOS, Android, Steam OS \nLanguages: Exposure to C#, C++, Java, HTML5 \nSoftware/Applications: Microsoft Office Suite, Adobe Creative Suite, Cyberlink Power Director, SAP, SharePoint, Steam, UPlay, Origin Summary •\tTechnical Marketing Evangelist with twenty-five year’ experience marked by professionalism and commitment. Conversant in a range of marketing and promotional disciplines. \n•\tProficient with both technical concepts and customer/consumer priorities; skilled in driving promotional initiatives influencing high-level decision makers.  \n•\tKnown for energy, innovation, communication and adaptability.  \n•\tWidely traveled, comfortable with diverse cultures and experience working in China, Hong Kong, South Korea, Taiwan, Japan, Australia, Chile, Brazil, Mexico, Canada, Germany, India, Singapore, Dutch West Indies, and 40+ states.  \n•\tConversational fluency in Spanish; learning Mandarin.  \n \nCORE COMPETENCIES \n•\tProject & Team Management \n•\tPresentation Planning & Delivery  \n•\tCross-Functional Groups \n•\tCollaboration \n•\tTechnical Consultation \n•\tResearch/Analysis/Documentation \n•\tField Support \n•\tTechnology Integration/Conversion \n•\tCustomer Needs Assessment \n•\tForecasting/Strategic Planning \n•\tEvent Planning & Coordination \n•\tProduct Development \n•\tTraining & Coaching \n•\tLiaison Functions \n•\tCompetitor & Industry Trend Analysis \n•\tDemand Creation \n \nTECHNICAL SKILLSET \nOperating Systems: Windows XP, Windows 7, Windows 8, Windows 8.1, ChromeOS, Android, Steam OS \nLanguages: Exposure to C#, C++, Java, HTML5 \nSoftware/Applications: Microsoft Office Suite, Adobe Creative Suite, Cyberlink Power Director, SAP, SharePoint, Steam, UPlay, Origin •\tTechnical Marketing Evangelist with twenty-five year’ experience marked by professionalism and commitment. Conversant in a range of marketing and promotional disciplines. \n•\tProficient with both technical concepts and customer/consumer priorities; skilled in driving promotional initiatives influencing high-level decision makers.  \n•\tKnown for energy, innovation, communication and adaptability.  \n•\tWidely traveled, comfortable with diverse cultures and experience working in China, Hong Kong, South Korea, Taiwan, Japan, Australia, Chile, Brazil, Mexico, Canada, Germany, India, Singapore, Dutch West Indies, and 40+ states.  \n•\tConversational fluency in Spanish; learning Mandarin.  \n \nCORE COMPETENCIES \n•\tProject & Team Management \n•\tPresentation Planning & Delivery  \n•\tCross-Functional Groups \n•\tCollaboration \n•\tTechnical Consultation \n•\tResearch/Analysis/Documentation \n•\tField Support \n•\tTechnology Integration/Conversion \n•\tCustomer Needs Assessment \n•\tForecasting/Strategic Planning \n•\tEvent Planning & Coordination \n•\tProduct Development \n•\tTraining & Coaching \n•\tLiaison Functions \n•\tCompetitor & Industry Trend Analysis \n•\tDemand Creation \n \nTECHNICAL SKILLSET \nOperating Systems: Windows XP, Windows 7, Windows 8, Windows 8.1, ChromeOS, Android, Steam OS \nLanguages: Exposure to C#, C++, Java, HTML5 \nSoftware/Applications: Microsoft Office Suite, Adobe Creative Suite, Cyberlink Power Director, SAP, SharePoint, Steam, UPlay, Origin •\tTechnical Marketing Evangelist with twenty-five year’ experience marked by professionalism and commitment. Conversant in a range of marketing and promotional disciplines. \n•\tProficient with both technical concepts and customer/consumer priorities; skilled in driving promotional initiatives influencing high-level decision makers.  \n•\tKnown for energy, innovation, communication and adaptability.  \n•\tWidely traveled, comfortable with diverse cultures and experience working in China, Hong Kong, South Korea, Taiwan, Japan, Australia, Chile, Brazil, Mexico, Canada, Germany, India, Singapore, Dutch West Indies, and 40+ states.  \n•\tConversational fluency in Spanish; learning Mandarin.  \n \nCORE COMPETENCIES \n•\tProject & Team Management \n•\tPresentation Planning & Delivery  \n•\tCross-Functional Groups \n•\tCollaboration \n•\tTechnical Consultation \n•\tResearch/Analysis/Documentation \n•\tField Support \n•\tTechnology Integration/Conversion \n•\tCustomer Needs Assessment \n•\tForecasting/Strategic Planning \n•\tEvent Planning & Coordination \n•\tProduct Development \n•\tTraining & Coaching \n•\tLiaison Functions \n•\tCompetitor & Industry Trend Analysis \n•\tDemand Creation \n \nTECHNICAL SKILLSET \nOperating Systems: Windows XP, Windows 7, Windows 8, Windows 8.1, ChromeOS, Android, Steam OS \nLanguages: Exposure to C#, C++, Java, HTML5 \nSoftware/Applications: Microsoft Office Suite, Adobe Creative Suite, Cyberlink Power Director, SAP, SharePoint, Steam, UPlay, Origin Experience Senior Technical Marketing Engineer / Application Engineer Intel Corporation November 2012  – Present (2 years 10 months) Hillsboro, OR Account Executive New Horizons Computer Learning Centers July 2011  –  October 2012  (1 year 4 months) Beaveron, OR Director of US Operations Australian Simulation Controls Systems 2008  –  2010  (2 years) Hillsbro, OR Business Development Manager Sharp Electronics Corporation 2007  –  2008  (1 year) Camas, WA Senior Technical Marketing Engineer Intel Corporation 2004  –  2007  (3 years) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2001  –  2004  (3 years) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2000  –  2001  (1 year) Hillsboro, OR Technical Marketing Engineer / Evangelist Intel Corporation 1999  –  2000  (1 year) Hillboro, OR Senior Customer Support Engineer Intel Corp. October 1996  –  1999  (3 years) Hillsboro, OR ADDITIONAL EXPERIENCE Detailed Below 1987  –  1996  (9 years) Senior Technical Marketing Engineer / Application Engineer Intel Corporation November 2012  – Present (2 years 10 months) Hillsboro, OR Senior Technical Marketing Engineer / Application Engineer Intel Corporation November 2012  – Present (2 years 10 months) Hillsboro, OR Account Executive New Horizons Computer Learning Centers July 2011  –  October 2012  (1 year 4 months) Beaveron, OR Account Executive New Horizons Computer Learning Centers July 2011  –  October 2012  (1 year 4 months) Beaveron, OR Director of US Operations Australian Simulation Controls Systems 2008  –  2010  (2 years) Hillsbro, OR Director of US Operations Australian Simulation Controls Systems 2008  –  2010  (2 years) Hillsbro, OR Business Development Manager Sharp Electronics Corporation 2007  –  2008  (1 year) Camas, WA Business Development Manager Sharp Electronics Corporation 2007  –  2008  (1 year) Camas, WA Senior Technical Marketing Engineer Intel Corporation 2004  –  2007  (3 years) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2004  –  2007  (3 years) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2001  –  2004  (3 years) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2001  –  2004  (3 years) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2000  –  2001  (1 year) Hillsboro, OR Senior Technical Marketing Engineer Intel Corporation 2000  –  2001  (1 year) Hillsboro, OR Technical Marketing Engineer / Evangelist Intel Corporation 1999  –  2000  (1 year) Hillboro, OR Technical Marketing Engineer / Evangelist Intel Corporation 1999  –  2000  (1 year) Hillboro, OR Senior Customer Support Engineer Intel Corp. October 1996  –  1999  (3 years) Hillsboro, OR Senior Customer Support Engineer Intel Corp. October 1996  –  1999  (3 years) Hillsboro, OR ADDITIONAL EXPERIENCE Detailed Below 1987  –  1996  (9 years) ADDITIONAL EXPERIENCE Detailed Below 1987  –  1996  (9 years) Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Consulting Product Marketing Product Management Cross-functional Team... Go-to-market Strategy Strategic Partnerships Consumer Electronics Cloud Computing Competitive Analysis Product Development Mobile Devices Business Development Program Management Semiconductors Wireless Multi-channel Marketing Product Launch Start-ups Channel SaaS New Business Development See 6+     See less Skills  Consulting Product Marketing Product Management Cross-functional Team... Go-to-market Strategy Strategic Partnerships Consumer Electronics Cloud Computing Competitive Analysis Product Development Mobile Devices Business Development Program Management Semiconductors Wireless Multi-channel Marketing Product Launch Start-ups Channel SaaS New Business Development See 6+     See less Consulting Product Marketing Product Management Cross-functional Team... Go-to-market Strategy Strategic Partnerships Consumer Electronics Cloud Computing Competitive Analysis Product Development Mobile Devices Business Development Program Management Semiconductors Wireless Multi-channel Marketing Product Launch Start-ups Channel SaaS New Business Development See 6+     See less Consulting Product Marketing Product Management Cross-functional Team... Go-to-market Strategy Strategic Partnerships Consumer Electronics Cloud Computing Competitive Analysis Product Development Mobile Devices Business Development Program Management Semiconductors Wireless Multi-channel Marketing Product Launch Start-ups Channel SaaS New Business Development See 6+     See less Education Linfield College 2001  – 2003 Linfield College 2001  – 2003 Linfield College 2001  – 2003 Linfield College 2001  – 2003 ", "Summary Experienced Chartered Engineer having transferable skills with a successful and consistent track record of concluding projects with high-value returns. \n \nExtensive experience in electronics, computing, industrial design and adjacent industries. \nAble to embrace diverse disciplines and manage ambiguity to enable product development through holistic understanding. \n \nExperience in all phases of the engineering life-cycle; R&D through validation to full production and sustaining. Much experience in customer/industry facing technical roles. \n \nLooking for a challenging role utilising extensive hardware, product definition, conceptual and mechanical industrial design capabilities. \n \n--------------------------------------- \n \nAREAS OF EXPERTISE: \nDigital and analog hardware design. \nMicroprocessor and Embedded Microcontroller systems design. \nPresentation skills, customer liaison, public speaking and technical positioning. \nMechanical design. \nIndustrial Design. \nProduct development. \nCAD tools for schematic capture, board layout, Mechanical 3D modelling and FEA simulation. Design for manufacturing and assembly (DFMA). \nProduction Engineering. \nModel making and light engineering. Summary Experienced Chartered Engineer having transferable skills with a successful and consistent track record of concluding projects with high-value returns. \n \nExtensive experience in electronics, computing, industrial design and adjacent industries. \nAble to embrace diverse disciplines and manage ambiguity to enable product development through holistic understanding. \n \nExperience in all phases of the engineering life-cycle; R&D through validation to full production and sustaining. Much experience in customer/industry facing technical roles. \n \nLooking for a challenging role utilising extensive hardware, product definition, conceptual and mechanical industrial design capabilities. \n \n--------------------------------------- \n \nAREAS OF EXPERTISE: \nDigital and analog hardware design. \nMicroprocessor and Embedded Microcontroller systems design. \nPresentation skills, customer liaison, public speaking and technical positioning. \nMechanical design. \nIndustrial Design. \nProduct development. \nCAD tools for schematic capture, board layout, Mechanical 3D modelling and FEA simulation. Design for manufacturing and assembly (DFMA). \nProduction Engineering. \nModel making and light engineering. Experienced Chartered Engineer having transferable skills with a successful and consistent track record of concluding projects with high-value returns. \n \nExtensive experience in electronics, computing, industrial design and adjacent industries. \nAble to embrace diverse disciplines and manage ambiguity to enable product development through holistic understanding. \n \nExperience in all phases of the engineering life-cycle; R&D through validation to full production and sustaining. Much experience in customer/industry facing technical roles. \n \nLooking for a challenging role utilising extensive hardware, product definition, conceptual and mechanical industrial design capabilities. \n \n--------------------------------------- \n \nAREAS OF EXPERTISE: \nDigital and analog hardware design. \nMicroprocessor and Embedded Microcontroller systems design. \nPresentation skills, customer liaison, public speaking and technical positioning. \nMechanical design. \nIndustrial Design. \nProduct development. \nCAD tools for schematic capture, board layout, Mechanical 3D modelling and FEA simulation. Design for manufacturing and assembly (DFMA). \nProduction Engineering. \nModel making and light engineering. Experienced Chartered Engineer having transferable skills with a successful and consistent track record of concluding projects with high-value returns. \n \nExtensive experience in electronics, computing, industrial design and adjacent industries. \nAble to embrace diverse disciplines and manage ambiguity to enable product development through holistic understanding. \n \nExperience in all phases of the engineering life-cycle; R&D through validation to full production and sustaining. Much experience in customer/industry facing technical roles. \n \nLooking for a challenging role utilising extensive hardware, product definition, conceptual and mechanical industrial design capabilities. \n \n--------------------------------------- \n \nAREAS OF EXPERTISE: \nDigital and analog hardware design. \nMicroprocessor and Embedded Microcontroller systems design. \nPresentation skills, customer liaison, public speaking and technical positioning. \nMechanical design. \nIndustrial Design. \nProduct development. \nCAD tools for schematic capture, board layout, Mechanical 3D modelling and FEA simulation. Design for manufacturing and assembly (DFMA). \nProduction Engineering. \nModel making and light engineering. Experience Senior Technical Marketing Engineer - IoT Intel Corporation January 2014  – Present (1 year 8 months) Swindon, United Kingdom Duties: \n•\tConsulting with Divisions and external customers to enable new technologies and solutions. \n•\tIdentifying and positioning Intel Gateway solutions and winning designs for specific Customers and applications. \n•\tBrokering relationships between Customers, Systems Integrators and ODMs. \n•\tTechnical consultant and pathfinder to enable solution development and deployment. \n•\tTechnical audience address and pitching concepts. \n•\tDemo and PoC design and creation, deployment at various forums such as Industry and Government Initiative Events. \n•\tPresenting demos and PoCs, articulating and positioning key messages. Senior Technical Marketing Engineer Intel Corporation November 2009  –  January 2014  (4 years 3 months) Swindon, United Kingdom MNC Design-in team for Fujitsu (Server and Data Centre group). Technical Marketing Engineer Intel Corporation 1998  –  November 2009  (11 years) Swindon, United Kingdom Embedded and Channel Customer designs. Systems Engineer Intel Corporation 1988  –  1998  (10 years) Swindon, United Kingdom Hardware Design Engineer Rank Xerox 1986  –  1988  (2 years) Welwyn Garden City Graduate Hardware Design Engineer Smiths Industries 1984  –  1986  (2 years) Cheltenham Under Graduate Industrial Placement MBB Elektronik January 1983  –  September 1983  (9 months) Ottobrunn, Germany Under Graduate Industrial Placement National Physical Laboratory January 1982  –  September 1982  (9 months) Teddington Senior Technical Marketing Engineer - IoT Intel Corporation January 2014  – Present (1 year 8 months) Swindon, United Kingdom Duties: \n•\tConsulting with Divisions and external customers to enable new technologies and solutions. \n•\tIdentifying and positioning Intel Gateway solutions and winning designs for specific Customers and applications. \n•\tBrokering relationships between Customers, Systems Integrators and ODMs. \n•\tTechnical consultant and pathfinder to enable solution development and deployment. \n•\tTechnical audience address and pitching concepts. \n•\tDemo and PoC design and creation, deployment at various forums such as Industry and Government Initiative Events. \n•\tPresenting demos and PoCs, articulating and positioning key messages. Senior Technical Marketing Engineer - IoT Intel Corporation January 2014  – Present (1 year 8 months) Swindon, United Kingdom Duties: \n•\tConsulting with Divisions and external customers to enable new technologies and solutions. \n•\tIdentifying and positioning Intel Gateway solutions and winning designs for specific Customers and applications. \n•\tBrokering relationships between Customers, Systems Integrators and ODMs. \n•\tTechnical consultant and pathfinder to enable solution development and deployment. \n•\tTechnical audience address and pitching concepts. \n•\tDemo and PoC design and creation, deployment at various forums such as Industry and Government Initiative Events. \n•\tPresenting demos and PoCs, articulating and positioning key messages. Senior Technical Marketing Engineer Intel Corporation November 2009  –  January 2014  (4 years 3 months) Swindon, United Kingdom MNC Design-in team for Fujitsu (Server and Data Centre group). Senior Technical Marketing Engineer Intel Corporation November 2009  –  January 2014  (4 years 3 months) Swindon, United Kingdom MNC Design-in team for Fujitsu (Server and Data Centre group). Technical Marketing Engineer Intel Corporation 1998  –  November 2009  (11 years) Swindon, United Kingdom Embedded and Channel Customer designs. Technical Marketing Engineer Intel Corporation 1998  –  November 2009  (11 years) Swindon, United Kingdom Embedded and Channel Customer designs. Systems Engineer Intel Corporation 1988  –  1998  (10 years) Swindon, United Kingdom Systems Engineer Intel Corporation 1988  –  1998  (10 years) Swindon, United Kingdom Hardware Design Engineer Rank Xerox 1986  –  1988  (2 years) Welwyn Garden City Hardware Design Engineer Rank Xerox 1986  –  1988  (2 years) Welwyn Garden City Graduate Hardware Design Engineer Smiths Industries 1984  –  1986  (2 years) Cheltenham Graduate Hardware Design Engineer Smiths Industries 1984  –  1986  (2 years) Cheltenham Under Graduate Industrial Placement MBB Elektronik January 1983  –  September 1983  (9 months) Ottobrunn, Germany Under Graduate Industrial Placement MBB Elektronik January 1983  –  September 1983  (9 months) Ottobrunn, Germany Under Graduate Industrial Placement National Physical Laboratory January 1982  –  September 1982  (9 months) Teddington Under Graduate Industrial Placement National Physical Laboratory January 1982  –  September 1982  (9 months) Teddington Skills Semiconductors Embedded Systems Processors Intel IOT Product Marketing Product Management SoC Microprocessors IC Computer Architecture Debugging Project Management Industrial Design Mechanical Engineering Hardware Thermal Management Model Making See 3+     See less Skills  Semiconductors Embedded Systems Processors Intel IOT Product Marketing Product Management SoC Microprocessors IC Computer Architecture Debugging Project Management Industrial Design Mechanical Engineering Hardware Thermal Management Model Making See 3+     See less Semiconductors Embedded Systems Processors Intel IOT Product Marketing Product Management SoC Microprocessors IC Computer Architecture Debugging Project Management Industrial Design Mechanical Engineering Hardware Thermal Management Model Making See 3+     See less Semiconductors Embedded Systems Processors Intel IOT Product Marketing Product Management SoC Microprocessors IC Computer Architecture Debugging Project Management Industrial Design Mechanical Engineering Hardware Thermal Management Model Making See 3+     See less Education Brunel University London BSc Joint Honours,  Physics and Electronics Brunel University London BSc Joint Honours,  Physics and Electronics Brunel University London BSc Joint Honours,  Physics and Electronics Brunel University London BSc Joint Honours,  Physics and Electronics ", "Skills C++ Windows Operating Systems Product Development Java C C# XML Software Development JavaScript SQL Linux HTML MySQL .NET Agile Methodologies Microsoft SQL Server See 2+     See less Skills  C++ Windows Operating Systems Product Development Java C C# XML Software Development JavaScript SQL Linux HTML MySQL .NET Agile Methodologies Microsoft SQL Server See 2+     See less C++ Windows Operating Systems Product Development Java C C# XML Software Development JavaScript SQL Linux HTML MySQL .NET Agile Methodologies Microsoft SQL Server See 2+     See less C++ Windows Operating Systems Product Development Java C C# XML Software Development JavaScript SQL Linux HTML MySQL .NET Agile Methodologies Microsoft SQL Server See 2+     See less ", "Languages   Skills Skills     Honors & Awards ", "Summary Proven track record of successful sales support activity with strong capacity to grasp new technologies and explain them to multiple audiences. Possess a solid understanding of advanced and emerging mobile related software and hardware technologies with an emphasis on security, cloud managed solution, mobile app design and development, basic web development, third-party technology integration and PC client architecture and design. Strong ability to work in a team environment and to collaborate on the development of innovative tailored solutions for clients and prospects. Diverse technical experience to gather the client data required to effectively deliver a viable solution. Strong technical expertise with business acumen to provides vital, detailed information about how a solutions delivers business value to clients. \n \nSpecialties: Emerging mobile-software and hardware technologies, mobile app design and development, hardware-based Full Disk Encryption solutions (TCG Opal Compliant Self Encrypting Drives, Trusted Platform Module (TPM) applications, IT/Enterprise Software evaluation process, Corporate PC deployment, computer motherboard architecture, usage scenario development, industry trade shows support, Voice over IP, computer security architecture, hardware-based encrypting and authentication security software solutions, and participation in industry standard forums. Summary Proven track record of successful sales support activity with strong capacity to grasp new technologies and explain them to multiple audiences. Possess a solid understanding of advanced and emerging mobile related software and hardware technologies with an emphasis on security, cloud managed solution, mobile app design and development, basic web development, third-party technology integration and PC client architecture and design. Strong ability to work in a team environment and to collaborate on the development of innovative tailored solutions for clients and prospects. Diverse technical experience to gather the client data required to effectively deliver a viable solution. Strong technical expertise with business acumen to provides vital, detailed information about how a solutions delivers business value to clients. \n \nSpecialties: Emerging mobile-software and hardware technologies, mobile app design and development, hardware-based Full Disk Encryption solutions (TCG Opal Compliant Self Encrypting Drives, Trusted Platform Module (TPM) applications, IT/Enterprise Software evaluation process, Corporate PC deployment, computer motherboard architecture, usage scenario development, industry trade shows support, Voice over IP, computer security architecture, hardware-based encrypting and authentication security software solutions, and participation in industry standard forums. Proven track record of successful sales support activity with strong capacity to grasp new technologies and explain them to multiple audiences. Possess a solid understanding of advanced and emerging mobile related software and hardware technologies with an emphasis on security, cloud managed solution, mobile app design and development, basic web development, third-party technology integration and PC client architecture and design. Strong ability to work in a team environment and to collaborate on the development of innovative tailored solutions for clients and prospects. Diverse technical experience to gather the client data required to effectively deliver a viable solution. Strong technical expertise with business acumen to provides vital, detailed information about how a solutions delivers business value to clients. \n \nSpecialties: Emerging mobile-software and hardware technologies, mobile app design and development, hardware-based Full Disk Encryption solutions (TCG Opal Compliant Self Encrypting Drives, Trusted Platform Module (TPM) applications, IT/Enterprise Software evaluation process, Corporate PC deployment, computer motherboard architecture, usage scenario development, industry trade shows support, Voice over IP, computer security architecture, hardware-based encrypting and authentication security software solutions, and participation in industry standard forums. Proven track record of successful sales support activity with strong capacity to grasp new technologies and explain them to multiple audiences. Possess a solid understanding of advanced and emerging mobile related software and hardware technologies with an emphasis on security, cloud managed solution, mobile app design and development, basic web development, third-party technology integration and PC client architecture and design. Strong ability to work in a team environment and to collaborate on the development of innovative tailored solutions for clients and prospects. Diverse technical experience to gather the client data required to effectively deliver a viable solution. Strong technical expertise with business acumen to provides vital, detailed information about how a solutions delivers business value to clients. \n \nSpecialties: Emerging mobile-software and hardware technologies, mobile app design and development, hardware-based Full Disk Encryption solutions (TCG Opal Compliant Self Encrypting Drives, Trusted Platform Module (TPM) applications, IT/Enterprise Software evaluation process, Corporate PC deployment, computer motherboard architecture, usage scenario development, industry trade shows support, Voice over IP, computer security architecture, hardware-based encrypting and authentication security software solutions, and participation in industry standard forums. Experience Mobile Engagement Sales Engineer Aruba Networks, an HP company April 2015  – Present (5 months) Portland, Oregon Area Responsible for providing pre-sales technical / functional support to prospective clients and customers. Present and articulate the capabilities and values of an Aruba Mobile Engagement Solution. Work with Aruba’s Product Team & Aruba’s Territory Account Managers and Sales Engineers to support key opportunities and Proof of Concepts. Project manage the sales and technology deployment processes, and consult with various stakeholders with an emphasis on mobile app design and development, basic web development and third-party technology integration. Support designed strategic and large account opportunities and work with various account teams within a designated region. Proactively respond to requests from sales field regarding potential customer opportunities, as well as support and drive these opportunities through the sales process to closure. Collaborate on the development of innovative, tailored solutions for clients and prospects. Effectively gather the client data required to tailor a solution. Provide vital, detailed information about how Aruba’s solutions deliver business value to our clients. Mobile Engagement Sales Engineer Aruba Networks, an HP company April 2015  – Present (5 months) Portland, Oregon Area Responsible for providing pre-sales technical / functional support to prospective clients and customers. Present and articulate the capabilities and values of an Aruba Mobile Engagement Solution. Work with Aruba’s Product Team & Aruba’s Territory Account Managers and Sales Engineers to support key opportunities and Proof of Concepts. Project manage the sales and technology deployment processes, and consult with various stakeholders with an emphasis on mobile app design and development, basic web development and third-party technology integration. Support designed strategic and large account opportunities and work with various account teams within a designated region. Proactively respond to requests from sales field regarding potential customer opportunities, as well as support and drive these opportunities through the sales process to closure. Collaborate on the development of innovative, tailored solutions for clients and prospects. Effectively gather the client data required to tailor a solution. Provide vital, detailed information about how Aruba’s solutions deliver business value to our clients. Mobile Engagement Sales Engineer Aruba Networks, an HP company April 2015  – Present (5 months) Portland, Oregon Area Responsible for providing pre-sales technical / functional support to prospective clients and customers. Present and articulate the capabilities and values of an Aruba Mobile Engagement Solution. Work with Aruba’s Product Team & Aruba’s Territory Account Managers and Sales Engineers to support key opportunities and Proof of Concepts. Project manage the sales and technology deployment processes, and consult with various stakeholders with an emphasis on mobile app design and development, basic web development and third-party technology integration. Support designed strategic and large account opportunities and work with various account teams within a designated region. Proactively respond to requests from sales field regarding potential customer opportunities, as well as support and drive these opportunities through the sales process to closure. Collaborate on the development of innovative, tailored solutions for clients and prospects. Effectively gather the client data required to tailor a solution. Provide vital, detailed information about how Aruba’s solutions deliver business value to our clients. Languages Hmong Hmong Hmong Skills Security Enterprise Software Cloud Computing SaaS Management Product Development Computer Security Solution Selling Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Network Security Sales Process Trade Shows Virtualization Mobile Devices Product Lifecycle... Wireless Hardware Agile Methodologies VoIP Technical Product Sales Technical Sales... Pre/Post Sales Engineers Trade Show Exhibitor Trade Show... Trade Show Planning Webinars Disk Encryption Encryption Software Encryption Active Directory... Software Installation Customer Satisfaction Direct Sales DLP Pre-sales Cloud Security See 24+     See less Skills  Security Enterprise Software Cloud Computing SaaS Management Product Development Computer Security Solution Selling Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Network Security Sales Process Trade Shows Virtualization Mobile Devices Product Lifecycle... Wireless Hardware Agile Methodologies VoIP Technical Product Sales Technical Sales... Pre/Post Sales Engineers Trade Show Exhibitor Trade Show... Trade Show Planning Webinars Disk Encryption Encryption Software Encryption Active Directory... Software Installation Customer Satisfaction Direct Sales DLP Pre-sales Cloud Security See 24+     See less Security Enterprise Software Cloud Computing SaaS Management Product Development Computer Security Solution Selling Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Network Security Sales Process Trade Shows Virtualization Mobile Devices Product Lifecycle... Wireless Hardware Agile Methodologies VoIP Technical Product Sales Technical Sales... Pre/Post Sales Engineers Trade Show Exhibitor Trade Show... Trade Show Planning Webinars Disk Encryption Encryption Software Encryption Active Directory... Software Installation Customer Satisfaction Direct Sales DLP Pre-sales Cloud Security See 24+     See less Security Enterprise Software Cloud Computing SaaS Management Product Development Computer Security Solution Selling Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Network Security Sales Process Trade Shows Virtualization Mobile Devices Product Lifecycle... Wireless Hardware Agile Methodologies VoIP Technical Product Sales Technical Sales... Pre/Post Sales Engineers Trade Show Exhibitor Trade Show... Trade Show Planning Webinars Disk Encryption Encryption Software Encryption Active Directory... Software Installation Customer Satisfaction Direct Sales DLP Pre-sales Cloud Security See 24+     See less ", "Languages Swedish Native or bilingual proficiency English Native or bilingual proficiency German Limited working proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency German Limited working proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency German Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Semiconductors Program Management Intel Strategy Management Go-to-market Strategy Processors Product Management Product Marketing User Experience Debugging Skills  Semiconductors Program Management Intel Strategy Management Go-to-market Strategy Processors Product Management Product Marketing User Experience Debugging Semiconductors Program Management Intel Strategy Management Go-to-market Strategy Processors Product Management Product Marketing User Experience Debugging Semiconductors Program Management Intel Strategy Management Go-to-market Strategy Processors Product Management Product Marketing User Experience Debugging ", "Skills Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less Skills  Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less ", "Languages English English English Skills Data Center Enterprise Software Security Semiconductors Intel Software Development Switches Cross-functional Team... Management Project Management Team Building Team Leadership Employee Management Employee Learning &... Test Lab Management Wildlife Conservation Fundraising Networking Computer Networking Technical Marketing Technical Support Customer Support Business Development Routers Training See 10+     See less Skills  Data Center Enterprise Software Security Semiconductors Intel Software Development Switches Cross-functional Team... Management Project Management Team Building Team Leadership Employee Management Employee Learning &... Test Lab Management Wildlife Conservation Fundraising Networking Computer Networking Technical Marketing Technical Support Customer Support Business Development Routers Training See 10+     See less Data Center Enterprise Software Security Semiconductors Intel Software Development Switches Cross-functional Team... Management Project Management Team Building Team Leadership Employee Management Employee Learning &... Test Lab Management Wildlife Conservation Fundraising Networking Computer Networking Technical Marketing Technical Support Customer Support Business Development Routers Training See 10+     See less Data Center Enterprise Software Security Semiconductors Intel Software Development Switches Cross-functional Team... Management Project Management Team Building Team Leadership Employee Management Employee Learning &... Test Lab Management Wildlife Conservation Fundraising Networking Computer Networking Technical Marketing Technical Support Customer Support Business Development Routers Training See 10+     See less ", "Summary I am an enthusiastic and ambitious person currently working as a Technical Marketing Engineer at Intel Corporation where I look after the design-in processes of the Fujitsu desktop systems.  \n \nI have an excellent ability to communicate well in the busy workplace and a proven skill to manage a team of people working towards an objective. My can-do attitude and large skill set delivers what I promise. Summary I am an enthusiastic and ambitious person currently working as a Technical Marketing Engineer at Intel Corporation where I look after the design-in processes of the Fujitsu desktop systems.  \n \nI have an excellent ability to communicate well in the busy workplace and a proven skill to manage a team of people working towards an objective. My can-do attitude and large skill set delivers what I promise. I am an enthusiastic and ambitious person currently working as a Technical Marketing Engineer at Intel Corporation where I look after the design-in processes of the Fujitsu desktop systems.  \n \nI have an excellent ability to communicate well in the busy workplace and a proven skill to manage a team of people working towards an objective. My can-do attitude and large skill set delivers what I promise. I am an enthusiastic and ambitious person currently working as a Technical Marketing Engineer at Intel Corporation where I look after the design-in processes of the Fujitsu desktop systems.  \n \nI have an excellent ability to communicate well in the busy workplace and a proven skill to manage a team of people working towards an objective. My can-do attitude and large skill set delivers what I promise. Experience Client Technical Marketing Engineer Intel Corporation March 2015  – Present (6 months) Placement Peer Assisted Learning (P:PAL) Leader Bournemouth University October 2014  –  May 2015  (8 months) Bournemouth, United Kingdom It is a pilot program at Bournemouth University created this year by my peers and myself in order to assist and advise 2 year Computing students how to succeslully get a desired placement job. \nMy responsibilities include: sessions content specification, organisational logistics and taking active part in the sessions where we share personal expiriances, dos and donts of job applications, interviews, test centers as well as how to perform well after getting the job. Technical Sales Engineer Intel Corporation July 2013  –  August 2014  (1 year 2 months) Swindon, United Kingdom As a technical sales engineer I worked closely with a range of Technical Account Managers that covered accounts including Dell, HP, Cisco and IBM, to provide support for their Intel based platforms. As part of the role I developed interactive, solution based demos for both Client and Server platforms, attended major technology events in EMEA, performed benchmarking analysis on a customer systems as well as took part in comprehensive analysis of Intel products for scientific purposes. Peer Assisted Learning (PAL) Leader Bournemouth University September 2012  –  June 2013  (10 months) Bournemouth, United Kingdom Informal sessions run for first year students to help them adjust more quickly to University life and help develop their independent learning and study skills as wells as provide guidance on how to approach assessments and where to find required materials. Client Technical Marketing Engineer Intel Corporation March 2015  – Present (6 months) Client Technical Marketing Engineer Intel Corporation March 2015  – Present (6 months) Placement Peer Assisted Learning (P:PAL) Leader Bournemouth University October 2014  –  May 2015  (8 months) Bournemouth, United Kingdom It is a pilot program at Bournemouth University created this year by my peers and myself in order to assist and advise 2 year Computing students how to succeslully get a desired placement job. \nMy responsibilities include: sessions content specification, organisational logistics and taking active part in the sessions where we share personal expiriances, dos and donts of job applications, interviews, test centers as well as how to perform well after getting the job. Placement Peer Assisted Learning (P:PAL) Leader Bournemouth University October 2014  –  May 2015  (8 months) Bournemouth, United Kingdom It is a pilot program at Bournemouth University created this year by my peers and myself in order to assist and advise 2 year Computing students how to succeslully get a desired placement job. \nMy responsibilities include: sessions content specification, organisational logistics and taking active part in the sessions where we share personal expiriances, dos and donts of job applications, interviews, test centers as well as how to perform well after getting the job. Technical Sales Engineer Intel Corporation July 2013  –  August 2014  (1 year 2 months) Swindon, United Kingdom As a technical sales engineer I worked closely with a range of Technical Account Managers that covered accounts including Dell, HP, Cisco and IBM, to provide support for their Intel based platforms. As part of the role I developed interactive, solution based demos for both Client and Server platforms, attended major technology events in EMEA, performed benchmarking analysis on a customer systems as well as took part in comprehensive analysis of Intel products for scientific purposes. Technical Sales Engineer Intel Corporation July 2013  –  August 2014  (1 year 2 months) Swindon, United Kingdom As a technical sales engineer I worked closely with a range of Technical Account Managers that covered accounts including Dell, HP, Cisco and IBM, to provide support for their Intel based platforms. As part of the role I developed interactive, solution based demos for both Client and Server platforms, attended major technology events in EMEA, performed benchmarking analysis on a customer systems as well as took part in comprehensive analysis of Intel products for scientific purposes. Peer Assisted Learning (PAL) Leader Bournemouth University September 2012  –  June 2013  (10 months) Bournemouth, United Kingdom Informal sessions run for first year students to help them adjust more quickly to University life and help develop their independent learning and study skills as wells as provide guidance on how to approach assessments and where to find required materials. Peer Assisted Learning (PAL) Leader Bournemouth University September 2012  –  June 2013  (10 months) Bournemouth, United Kingdom Informal sessions run for first year students to help them adjust more quickly to University life and help develop their independent learning and study skills as wells as provide guidance on how to approach assessments and where to find required materials. Languages English Native or bilingual proficiency Polish Native or bilingual proficiency Spanish Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Spanish Elementary proficiency German Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Spanish Elementary proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Team Leadership Teamwork Customer Engagement Hadoop Programming CSS SQL Agile Project Management Windows Linux UML Databases Android Database Design HTML Java Python Computer Hardware Microsoft Visio Network Security Operating Systems Cloudera See 7+     See less Skills  Team Leadership Teamwork Customer Engagement Hadoop Programming CSS SQL Agile Project Management Windows Linux UML Databases Android Database Design HTML Java Python Computer Hardware Microsoft Visio Network Security Operating Systems Cloudera See 7+     See less Team Leadership Teamwork Customer Engagement Hadoop Programming CSS SQL Agile Project Management Windows Linux UML Databases Android Database Design HTML Java Python Computer Hardware Microsoft Visio Network Security Operating Systems Cloudera See 7+     See less Team Leadership Teamwork Customer Engagement Hadoop Programming CSS SQL Agile Project Management Windows Linux UML Databases Android Database Design HTML Java Python Computer Hardware Microsoft Visio Network Security Operating Systems Cloudera See 7+     See less Education Bournemouth University Bachelor of Science (BSc),  Business Computing 2011  – 2015 First Year: 1st \nSecond year: 2:1 \nFinal year units: \n- Network Configuration Management \n- Advanced Data Management (Data Mining) \n- Business Development & Enterprise Activities and Societies:  Varsity Volleyball Team Wiltshire College BTEC National Diploma,  IT , Distinction 2009  – 2011 Liceum Ogólnokształcące im. Komisji Edukacji Narodowej w Przasnyszu Profil humanistyczno-lingwistyczno-medialny 2005  – 2008 Bournemouth University Bachelor of Science (BSc),  Business Computing 2011  – 2015 First Year: 1st \nSecond year: 2:1 \nFinal year units: \n- Network Configuration Management \n- Advanced Data Management (Data Mining) \n- Business Development & Enterprise Activities and Societies:  Varsity Volleyball Team Bournemouth University Bachelor of Science (BSc),  Business Computing 2011  – 2015 First Year: 1st \nSecond year: 2:1 \nFinal year units: \n- Network Configuration Management \n- Advanced Data Management (Data Mining) \n- Business Development & Enterprise Activities and Societies:  Varsity Volleyball Team Bournemouth University Bachelor of Science (BSc),  Business Computing 2011  – 2015 First Year: 1st \nSecond year: 2:1 \nFinal year units: \n- Network Configuration Management \n- Advanced Data Management (Data Mining) \n- Business Development & Enterprise Activities and Societies:  Varsity Volleyball Team Wiltshire College BTEC National Diploma,  IT , Distinction 2009  – 2011 Wiltshire College BTEC National Diploma,  IT , Distinction 2009  – 2011 Wiltshire College BTEC National Diploma,  IT , Distinction 2009  – 2011 Liceum Ogólnokształcące im. Komisji Edukacji Narodowej w Przasnyszu Profil humanistyczno-lingwistyczno-medialny 2005  – 2008 Liceum Ogólnokształcące im. Komisji Edukacji Narodowej w Przasnyszu Profil humanistyczno-lingwistyczno-medialny 2005  – 2008 Liceum Ogólnokształcące im. Komisji Edukacji Narodowej w Przasnyszu Profil humanistyczno-lingwistyczno-medialny 2005  – 2008 Honors & Awards Case Communications Award for Exceptional Achievement Wiltshire College October 2011 Best IT Student Case Communications Award for Exceptional Achievement Wiltshire College October 2011 Best IT Student Case Communications Award for Exceptional Achievement Wiltshire College October 2011 Best IT Student Case Communications Award for Exceptional Achievement Wiltshire College October 2011 Best IT Student ", "Skills Semiconductors Skills  Semiconductors Semiconductors Semiconductors ", "Summary After 10 years at Intel I'm following my passion for gaming on the desktop team. I'm excited by the opportunities and challenges this new role offers and can't wait to see where gaming will go in the future. \n Summary After 10 years at Intel I'm following my passion for gaming on the desktop team. I'm excited by the opportunities and challenges this new role offers and can't wait to see where gaming will go in the future. \n After 10 years at Intel I'm following my passion for gaming on the desktop team. I'm excited by the opportunities and challenges this new role offers and can't wait to see where gaming will go in the future. \n After 10 years at Intel I'm following my passion for gaming on the desktop team. I'm excited by the opportunities and challenges this new role offers and can't wait to see where gaming will go in the future. \n Experience Senior Technical Marketing Engineer Intel Corporation June 2015  – Present (3 months) Portland, Oregon Area Desktop TME responsible for gaming demo strategy and execution across Intel \n Senior Technical Marketing Engineer Intel Corporation July 2014  –  June 2015  (1 year) Portland, Oregon Area Outboard marketing TME responsible for overall desktop demo strategy and execution across Intel \n \nHighlights: \n- TME lead for Intel's 5960X launch at PAX Prime 2014. This was the first time Intel launched a CPU at a gaming event and my first event on the desktop team. I was responsible for the desktop demos in the showcase and launch panel \n \n- Supported full year cycle (~20 events) across all desktop segments including: gaming, content creation, mini-pc, all-in-one, portable all-in-one, compute stick \n \n- Planning and Execution of CES 2015 - this was my first corporate event in the desktop team and the largest event of the year involving the Intel booth and multiple executives at multiple sites, each with their own demo requirements \n \n Senior Technical Marketing Engineer Intel Corporation November 2005  –  June 2014  (8 years 8 months) Portland, Oregon Area Achievements \nRedefined the technical training strategy for Intel's Enterprise Products and Services Division after the previous training team of 10 individuals was redeployed. \nDeploy bi-annual technical server trainings worldwide for the past 5 years. Each training is held in over 20 locations reaching up to 700 customers \nWorked with key customers to develop customized training content to train via the web, phone and face to face \nReceived multiple recognitions including 2 division recognition awards for the quality and value the technical training brings to Intel's customers \n \nResponsibilities \nManaging the logistics of training events which include $400,000 budget, collaborating content creation with stakeholders around the world, and building/shipping all hardware. \nCreation of technical documentation, white papers, training presentations, demos and other technical collateral \nSupport channel to MNC customer design wins with Intel's new server boards \nTechnical point of contact for major US-based server accounts, supporting all server products they purchase from Intel \nGather feedback from customers and Intel field teams in different geos to define training agenda that focuses on their local target products and usage models Senior Technical Marketing Engineer Intel Corporation June 2015  – Present (3 months) Portland, Oregon Area Desktop TME responsible for gaming demo strategy and execution across Intel \n Senior Technical Marketing Engineer Intel Corporation June 2015  – Present (3 months) Portland, Oregon Area Desktop TME responsible for gaming demo strategy and execution across Intel \n Senior Technical Marketing Engineer Intel Corporation July 2014  –  June 2015  (1 year) Portland, Oregon Area Outboard marketing TME responsible for overall desktop demo strategy and execution across Intel \n \nHighlights: \n- TME lead for Intel's 5960X launch at PAX Prime 2014. This was the first time Intel launched a CPU at a gaming event and my first event on the desktop team. I was responsible for the desktop demos in the showcase and launch panel \n \n- Supported full year cycle (~20 events) across all desktop segments including: gaming, content creation, mini-pc, all-in-one, portable all-in-one, compute stick \n \n- Planning and Execution of CES 2015 - this was my first corporate event in the desktop team and the largest event of the year involving the Intel booth and multiple executives at multiple sites, each with their own demo requirements \n \n Senior Technical Marketing Engineer Intel Corporation July 2014  –  June 2015  (1 year) Portland, Oregon Area Outboard marketing TME responsible for overall desktop demo strategy and execution across Intel \n \nHighlights: \n- TME lead for Intel's 5960X launch at PAX Prime 2014. This was the first time Intel launched a CPU at a gaming event and my first event on the desktop team. I was responsible for the desktop demos in the showcase and launch panel \n \n- Supported full year cycle (~20 events) across all desktop segments including: gaming, content creation, mini-pc, all-in-one, portable all-in-one, compute stick \n \n- Planning and Execution of CES 2015 - this was my first corporate event in the desktop team and the largest event of the year involving the Intel booth and multiple executives at multiple sites, each with their own demo requirements \n \n Senior Technical Marketing Engineer Intel Corporation November 2005  –  June 2014  (8 years 8 months) Portland, Oregon Area Achievements \nRedefined the technical training strategy for Intel's Enterprise Products and Services Division after the previous training team of 10 individuals was redeployed. \nDeploy bi-annual technical server trainings worldwide for the past 5 years. Each training is held in over 20 locations reaching up to 700 customers \nWorked with key customers to develop customized training content to train via the web, phone and face to face \nReceived multiple recognitions including 2 division recognition awards for the quality and value the technical training brings to Intel's customers \n \nResponsibilities \nManaging the logistics of training events which include $400,000 budget, collaborating content creation with stakeholders around the world, and building/shipping all hardware. \nCreation of technical documentation, white papers, training presentations, demos and other technical collateral \nSupport channel to MNC customer design wins with Intel's new server boards \nTechnical point of contact for major US-based server accounts, supporting all server products they purchase from Intel \nGather feedback from customers and Intel field teams in different geos to define training agenda that focuses on their local target products and usage models Senior Technical Marketing Engineer Intel Corporation November 2005  –  June 2014  (8 years 8 months) Portland, Oregon Area Achievements \nRedefined the technical training strategy for Intel's Enterprise Products and Services Division after the previous training team of 10 individuals was redeployed. \nDeploy bi-annual technical server trainings worldwide for the past 5 years. Each training is held in over 20 locations reaching up to 700 customers \nWorked with key customers to develop customized training content to train via the web, phone and face to face \nReceived multiple recognitions including 2 division recognition awards for the quality and value the technical training brings to Intel's customers \n \nResponsibilities \nManaging the logistics of training events which include $400,000 budget, collaborating content creation with stakeholders around the world, and building/shipping all hardware. \nCreation of technical documentation, white papers, training presentations, demos and other technical collateral \nSupport channel to MNC customer design wins with Intel's new server boards \nTechnical point of contact for major US-based server accounts, supporting all server products they purchase from Intel \nGather feedback from customers and Intel field teams in different geos to define training agenda that focuses on their local target products and usage models Languages   Skills Program Management Computer Hardware Training Delivery Microsoft Office Windows 7 Troubleshooting Creativity Technical Marketing Servers Product Management Product Marketing Intel Hardware Processors Strategy Skills  Program Management Computer Hardware Training Delivery Microsoft Office Windows 7 Troubleshooting Creativity Technical Marketing Servers Product Management Product Marketing Intel Hardware Processors Strategy Program Management Computer Hardware Training Delivery Microsoft Office Windows 7 Troubleshooting Creativity Technical Marketing Servers Product Management Product Marketing Intel Hardware Processors Strategy Program Management Computer Hardware Training Delivery Microsoft Office Windows 7 Troubleshooting Creativity Technical Marketing Servers Product Management Product Marketing Intel Hardware Processors Strategy Education University of Pennsylvania 2013  – 2013 Gamification course through Coursera.org Stanford University 2012  – 2013 Human-Computer Interaction course through Coursera.org \nCompleted with Distinction Portland State University Master of Science (MS),  Engineering/Industrial Management 2008  – 2011 Case Western Bachelor of Science (BS),  Mechanical Engineering 2001  – 2005 University of Pennsylvania 2013  – 2013 Gamification course through Coursera.org University of Pennsylvania 2013  – 2013 Gamification course through Coursera.org University of Pennsylvania 2013  – 2013 Gamification course through Coursera.org Stanford University 2012  – 2013 Human-Computer Interaction course through Coursera.org \nCompleted with Distinction Stanford University 2012  – 2013 Human-Computer Interaction course through Coursera.org \nCompleted with Distinction Stanford University 2012  – 2013 Human-Computer Interaction course through Coursera.org \nCompleted with Distinction Portland State University Master of Science (MS),  Engineering/Industrial Management 2008  – 2011 Portland State University Master of Science (MS),  Engineering/Industrial Management 2008  – 2011 Portland State University Master of Science (MS),  Engineering/Industrial Management 2008  – 2011 Case Western Bachelor of Science (BS),  Mechanical Engineering 2001  – 2005 Case Western Bachelor of Science (BS),  Mechanical Engineering 2001  – 2005 Case Western Bachelor of Science (BS),  Mechanical Engineering 2001  – 2005 Honors & Awards ", "Summary Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Summary Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Experience Sales Director Intel Corporation 2012  – Present (3 years) Taipei, Taiwan Responsible for Taiwan-based global accounts totaling $350M+ in revenue. \nProducts include semiconductor and software solutions for IOT, data center, telecom, consumer electronics & wireless devices. Vice President, Asia Pacific Metrico Wireless 2008  –  2012  (4 years) Taipei, Taiwan Set up Metrico’s Asia headquarters, recruited sales/technical teams and channel partners that grew the Asia business from one customer into a profitable million dollar business. \n \nResponsible for setting strategy, managing P&L and developing sales and marketing relationships with Asia’s leading wireless carriers, branded/ODM smartphone, notebook, tablet, and wireless chip companies. \n \nSold and deployed a cloud based smartphone testing service in Korea, Taiwan and China.  \nCustomers included China Mobile, SK Telecom, Chunghwa Telecom, HTC, ASUS, Acer, LGE, Pantech, Huawei, ZTE, Mediatek, Motorola Beijing, Qualcomm Beijing, and others. \n \nMetrico was acquired by Spirent Communications in 2012. Asia Business Advisor APAC Ventures 2004  –  2012  (8 years) Taipei, Taiwan Consulted with the management of privately funded companies to develop their Asia business plan, hire local staff and develop new customers opportunities. \n \nOver the past 10 years, I have worked with the following: LANDesk Software, Crystal Voice Communications (acquired by Global IP Solutions), Global IP Solutions (acquired by Google), Diginext, Jasper, PicoMobile (acquired by Marvell), Tuxera Software, LogLogic (acquired by TIBCO) & Polaris Wireless. Director of Asia Sales & Marketing Azaire Networks 2002  –  2008  (6 years) Taiwan Developed Azaire’s product and sales plan for Asia by engaging with leading Asia wireless operators to develop business models to justify deployment of 3GPP defined I-WLAN solution which specified use of WiFi networks to offload data & voice traffic from more expensive 3G networks.  \n \nPartnered with leading MNC and local system integrators to engage with Asia operators and closed multi-million dollar 3G offload deal with Chunghwa Telecom. Solution was based on 3GPP I-WLAN and was first such deployment in Asia based on EAP SIM authentication.  \n \nAzaire Networks (also previously named Mobility Networks) was acquired by Intellinet Technologies in 2008 Sales Manager Intel Corporation 1999  –  2001  (2 years) San Jose, CA Responsible for US based computer OEMs, retail and distributors selling Intel's full line of products. \n \nExceed revenue target $68M revenue target by ~30% and design wins by ~40%. \n \nCompleted MBA while working fulltime, left Intel to pursue 1 year of travel and volunteer work in Brazil Asia Pacific, Product Manager Intel Corporation 1997  –  1999  (2 years) Hong Kong Member of APAC business management team responsible for $500M+ desktop product business \n \nJob responsibilities included localizing product roadmaps, participating in strategic planning, determining APAC CPU demand forecast, and pricing. Asia Pacific, Technical Marketing Engineer Intel Corporation 1995  –  1997  (2 years) Taipei, Taiwan Co-founder of Intel’s Asia Pacific PC Lab in Taiwan with charter to drive and validate Intel silicon design wins at APAC OEMs. \n \nSupported hiring and managing of technical team that provided testing services to Asian computer OEMs to assist them in validating their designs of Intel products and to test new PC industry initiatives. \n \nDeveloped and delivered technical marketing training seminars as part of development of new Asia Pacific sales channel. Technical Marketing Engineer Intel Corporation 1994  –  1995  (1 year) Folsom, CA Worked on Pentium(™) CPU OverDrive processor group as a member of product development team.  \n \nContributed to technical product specification and customer enablement. Sales Director Intel Corporation 2012  – Present (3 years) Taipei, Taiwan Responsible for Taiwan-based global accounts totaling $350M+ in revenue. \nProducts include semiconductor and software solutions for IOT, data center, telecom, consumer electronics & wireless devices. Sales Director Intel Corporation 2012  – Present (3 years) Taipei, Taiwan Responsible for Taiwan-based global accounts totaling $350M+ in revenue. \nProducts include semiconductor and software solutions for IOT, data center, telecom, consumer electronics & wireless devices. Vice President, Asia Pacific Metrico Wireless 2008  –  2012  (4 years) Taipei, Taiwan Set up Metrico’s Asia headquarters, recruited sales/technical teams and channel partners that grew the Asia business from one customer into a profitable million dollar business. \n \nResponsible for setting strategy, managing P&L and developing sales and marketing relationships with Asia’s leading wireless carriers, branded/ODM smartphone, notebook, tablet, and wireless chip companies. \n \nSold and deployed a cloud based smartphone testing service in Korea, Taiwan and China.  \nCustomers included China Mobile, SK Telecom, Chunghwa Telecom, HTC, ASUS, Acer, LGE, Pantech, Huawei, ZTE, Mediatek, Motorola Beijing, Qualcomm Beijing, and others. \n \nMetrico was acquired by Spirent Communications in 2012. Vice President, Asia Pacific Metrico Wireless 2008  –  2012  (4 years) Taipei, Taiwan Set up Metrico’s Asia headquarters, recruited sales/technical teams and channel partners that grew the Asia business from one customer into a profitable million dollar business. \n \nResponsible for setting strategy, managing P&L and developing sales and marketing relationships with Asia’s leading wireless carriers, branded/ODM smartphone, notebook, tablet, and wireless chip companies. \n \nSold and deployed a cloud based smartphone testing service in Korea, Taiwan and China.  \nCustomers included China Mobile, SK Telecom, Chunghwa Telecom, HTC, ASUS, Acer, LGE, Pantech, Huawei, ZTE, Mediatek, Motorola Beijing, Qualcomm Beijing, and others. \n \nMetrico was acquired by Spirent Communications in 2012. Asia Business Advisor APAC Ventures 2004  –  2012  (8 years) Taipei, Taiwan Consulted with the management of privately funded companies to develop their Asia business plan, hire local staff and develop new customers opportunities. \n \nOver the past 10 years, I have worked with the following: LANDesk Software, Crystal Voice Communications (acquired by Global IP Solutions), Global IP Solutions (acquired by Google), Diginext, Jasper, PicoMobile (acquired by Marvell), Tuxera Software, LogLogic (acquired by TIBCO) & Polaris Wireless. Asia Business Advisor APAC Ventures 2004  –  2012  (8 years) Taipei, Taiwan Consulted with the management of privately funded companies to develop their Asia business plan, hire local staff and develop new customers opportunities. \n \nOver the past 10 years, I have worked with the following: LANDesk Software, Crystal Voice Communications (acquired by Global IP Solutions), Global IP Solutions (acquired by Google), Diginext, Jasper, PicoMobile (acquired by Marvell), Tuxera Software, LogLogic (acquired by TIBCO) & Polaris Wireless. Director of Asia Sales & Marketing Azaire Networks 2002  –  2008  (6 years) Taiwan Developed Azaire’s product and sales plan for Asia by engaging with leading Asia wireless operators to develop business models to justify deployment of 3GPP defined I-WLAN solution which specified use of WiFi networks to offload data & voice traffic from more expensive 3G networks.  \n \nPartnered with leading MNC and local system integrators to engage with Asia operators and closed multi-million dollar 3G offload deal with Chunghwa Telecom. Solution was based on 3GPP I-WLAN and was first such deployment in Asia based on EAP SIM authentication.  \n \nAzaire Networks (also previously named Mobility Networks) was acquired by Intellinet Technologies in 2008 Director of Asia Sales & Marketing Azaire Networks 2002  –  2008  (6 years) Taiwan Developed Azaire’s product and sales plan for Asia by engaging with leading Asia wireless operators to develop business models to justify deployment of 3GPP defined I-WLAN solution which specified use of WiFi networks to offload data & voice traffic from more expensive 3G networks.  \n \nPartnered with leading MNC and local system integrators to engage with Asia operators and closed multi-million dollar 3G offload deal with Chunghwa Telecom. Solution was based on 3GPP I-WLAN and was first such deployment in Asia based on EAP SIM authentication.  \n \nAzaire Networks (also previously named Mobility Networks) was acquired by Intellinet Technologies in 2008 Sales Manager Intel Corporation 1999  –  2001  (2 years) San Jose, CA Responsible for US based computer OEMs, retail and distributors selling Intel's full line of products. \n \nExceed revenue target $68M revenue target by ~30% and design wins by ~40%. \n \nCompleted MBA while working fulltime, left Intel to pursue 1 year of travel and volunteer work in Brazil Sales Manager Intel Corporation 1999  –  2001  (2 years) San Jose, CA Responsible for US based computer OEMs, retail and distributors selling Intel's full line of products. \n \nExceed revenue target $68M revenue target by ~30% and design wins by ~40%. \n \nCompleted MBA while working fulltime, left Intel to pursue 1 year of travel and volunteer work in Brazil Asia Pacific, Product Manager Intel Corporation 1997  –  1999  (2 years) Hong Kong Member of APAC business management team responsible for $500M+ desktop product business \n \nJob responsibilities included localizing product roadmaps, participating in strategic planning, determining APAC CPU demand forecast, and pricing. Asia Pacific, Product Manager Intel Corporation 1997  –  1999  (2 years) Hong Kong Member of APAC business management team responsible for $500M+ desktop product business \n \nJob responsibilities included localizing product roadmaps, participating in strategic planning, determining APAC CPU demand forecast, and pricing. Asia Pacific, Technical Marketing Engineer Intel Corporation 1995  –  1997  (2 years) Taipei, Taiwan Co-founder of Intel’s Asia Pacific PC Lab in Taiwan with charter to drive and validate Intel silicon design wins at APAC OEMs. \n \nSupported hiring and managing of technical team that provided testing services to Asian computer OEMs to assist them in validating their designs of Intel products and to test new PC industry initiatives. \n \nDeveloped and delivered technical marketing training seminars as part of development of new Asia Pacific sales channel. Asia Pacific, Technical Marketing Engineer Intel Corporation 1995  –  1997  (2 years) Taipei, Taiwan Co-founder of Intel’s Asia Pacific PC Lab in Taiwan with charter to drive and validate Intel silicon design wins at APAC OEMs. \n \nSupported hiring and managing of technical team that provided testing services to Asian computer OEMs to assist them in validating their designs of Intel products and to test new PC industry initiatives. \n \nDeveloped and delivered technical marketing training seminars as part of development of new Asia Pacific sales channel. Technical Marketing Engineer Intel Corporation 1994  –  1995  (1 year) Folsom, CA Worked on Pentium(™) CPU OverDrive processor group as a member of product development team.  \n \nContributed to technical product specification and customer enablement. Technical Marketing Engineer Intel Corporation 1994  –  1995  (1 year) Folsom, CA Worked on Pentium(™) CPU OverDrive processor group as a member of product development team.  \n \nContributed to technical product specification and customer enablement. Languages English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less Skills  Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less ", "Languages   Skills Software Engineering Product Marketing Intel Processors Technical Marketing Architecture Competitive Analysis Product Management CAD MeeGo Linux Embedded Linux Verilog Data Center EDA Servers Software Development IC Software Design Debugging Embedded Systems Microprocessors Device Drivers Computer Architecture Simulations SoC Semiconductors Architectures See 13+     See less Skills  Software Engineering Product Marketing Intel Processors Technical Marketing Architecture Competitive Analysis Product Management CAD MeeGo Linux Embedded Linux Verilog Data Center EDA Servers Software Development IC Software Design Debugging Embedded Systems Microprocessors Device Drivers Computer Architecture Simulations SoC Semiconductors Architectures See 13+     See less Software Engineering Product Marketing Intel Processors Technical Marketing Architecture Competitive Analysis Product Management CAD MeeGo Linux Embedded Linux Verilog Data Center EDA Servers Software Development IC Software Design Debugging Embedded Systems Microprocessors Device Drivers Computer Architecture Simulations SoC Semiconductors Architectures See 13+     See less Software Engineering Product Marketing Intel Processors Technical Marketing Architecture Competitive Analysis Product Management CAD MeeGo Linux Embedded Linux Verilog Data Center EDA Servers Software Development IC Software Design Debugging Embedded Systems Microprocessors Device Drivers Computer Architecture Simulations SoC Semiconductors Architectures See 13+     See less ", "Skills Verilog Static Timing Analysis ASIC RTL design VLSI SystemVerilog Computer Architecture SoC Semiconductors Skills  Verilog Static Timing Analysis ASIC RTL design VLSI SystemVerilog Computer Architecture SoC Semiconductors Verilog Static Timing Analysis ASIC RTL design VLSI SystemVerilog Computer Architecture SoC Semiconductors Verilog Static Timing Analysis ASIC RTL design VLSI SystemVerilog Computer Architecture SoC Semiconductors ", "Summary 9+ years as Technical Marketing Engineer at Intel Corporation in Datacenter and High Performance Computing. \nExperience producing high quality technical documentation, including product specification and datasheets. \nProven track record of supporting numerous tier-1 customers across geos from development to launch.6 years of IC design experience. Summary 9+ years as Technical Marketing Engineer at Intel Corporation in Datacenter and High Performance Computing. \nExperience producing high quality technical documentation, including product specification and datasheets. \nProven track record of supporting numerous tier-1 customers across geos from development to launch.6 years of IC design experience. 9+ years as Technical Marketing Engineer at Intel Corporation in Datacenter and High Performance Computing. \nExperience producing high quality technical documentation, including product specification and datasheets. \nProven track record of supporting numerous tier-1 customers across geos from development to launch.6 years of IC design experience. 9+ years as Technical Marketing Engineer at Intel Corporation in Datacenter and High Performance Computing. \nExperience producing high quality technical documentation, including product specification and datasheets. \nProven track record of supporting numerous tier-1 customers across geos from development to launch.6 years of IC design experience. Experience Technical Marketing Manager Intel January 2014  – Present (1 year 8 months) San Jose, CA o\tPoint-of-contact for Fabric Business Unit on key customer requirements, issues and status. \no\tManaging team of 6 TMEs to support Intel® Omni-Path Fabric products for HPC. \no\tTrained team members on TME processes and customer support. \no\tPlanning and managing multi-quarter team collaterals for OEM partner  \no\tCreated technical deep-dive presentations and held training boot camps for customers. \no\tTraining sales and field teams on technical merits of the products to engage potential new customers. \no\tIdentifying gaps in and defining requirements for development tools and testing methodologies to assist in customer qualification. \no\tDeveloping processes with engineering to ensure smooth handoff of technical information. Senior Technical Marketing Engineer Intel Corporation September 2011  –  December 2013  (2 years 4 months) San Jose, CA o\tRole of technical consultant on the Intel® Xeon Phi™ product family for the HPC market with focus on power delivery and custom cooling solutions. \no\tCreated and periodically released product datasheet. \no\tIdentified product hardware features critical for customer qualifications and drove enabling by working with engineering teams to design and deliver prototypes. \no\tOwned co-validation engagements with key OEM partners for joint product qualifications critical to achieving product Ship Release Approval milestone. Task involved working with engineering and customers to identify specific areas requiring qualification coverage, managing progress through periodic technical calls, and reported status weekly to program execution meetings. \no\tTrained sales teams of Intel customers on features and market positioning of Intel Xeon Phi. \no\tCreated proposal for special product sku request from key customer based on business needs for both customer and Intel, and drove through approval process by upper management. \no\tPresented at Intel conferences in Taiwan and Santa Clara, to train tier-2 customers on product integration and qualification. Technical Marketing Engineer Intel Corporation September 2005  –  September 2011  (6 years 1 month) San Jose, CA o\tRole of technical consultant on Intel® 7500 Scalable Memory Buffer and platform electrical design guidelines for Intel® Xeon® and Itanium® Processor based platforms. \no\tPoint-of-contact for technical enabling of Intel® Itanium® platform software development vehicle for ISV and OSV community. Task involved working directly with box vendor to ensure compliance with system requirements, provide debug support and keep vendor on track to meet NRE milestones. Related accomplishment involved validating 3rd party vendor of debug software. \no\tLed task force of key engineering experts to tackle high visible showstopper issues critical for OEM partner launch. \no\tProvided Intel® QuickPath Interconnect training to customers on link protocol, test tools and hardware debug methodologies. Design Engineer Intel Corporation August 1999  –  August 2005  (6 years 1 month) San Jose, CA o\tDeveloped methodology and script for faster turnaround of IC layout checks for rule violations. Resulted in dropping average processing time from 12 hours to 3 hours, and was widely adopted by other IC design teams. \no\tSilicon debug: executing component level test patterns, debugging and root-causing silicon sightings, and proposing workarounds. \no\tIC block design: parasitic extraction, logic and timing verification and layout planning. Technical Marketing Manager Intel January 2014  – Present (1 year 8 months) San Jose, CA o\tPoint-of-contact for Fabric Business Unit on key customer requirements, issues and status. \no\tManaging team of 6 TMEs to support Intel® Omni-Path Fabric products for HPC. \no\tTrained team members on TME processes and customer support. \no\tPlanning and managing multi-quarter team collaterals for OEM partner  \no\tCreated technical deep-dive presentations and held training boot camps for customers. \no\tTraining sales and field teams on technical merits of the products to engage potential new customers. \no\tIdentifying gaps in and defining requirements for development tools and testing methodologies to assist in customer qualification. \no\tDeveloping processes with engineering to ensure smooth handoff of technical information. Technical Marketing Manager Intel January 2014  – Present (1 year 8 months) San Jose, CA o\tPoint-of-contact for Fabric Business Unit on key customer requirements, issues and status. \no\tManaging team of 6 TMEs to support Intel® Omni-Path Fabric products for HPC. \no\tTrained team members on TME processes and customer support. \no\tPlanning and managing multi-quarter team collaterals for OEM partner  \no\tCreated technical deep-dive presentations and held training boot camps for customers. \no\tTraining sales and field teams on technical merits of the products to engage potential new customers. \no\tIdentifying gaps in and defining requirements for development tools and testing methodologies to assist in customer qualification. \no\tDeveloping processes with engineering to ensure smooth handoff of technical information. Senior Technical Marketing Engineer Intel Corporation September 2011  –  December 2013  (2 years 4 months) San Jose, CA o\tRole of technical consultant on the Intel® Xeon Phi™ product family for the HPC market with focus on power delivery and custom cooling solutions. \no\tCreated and periodically released product datasheet. \no\tIdentified product hardware features critical for customer qualifications and drove enabling by working with engineering teams to design and deliver prototypes. \no\tOwned co-validation engagements with key OEM partners for joint product qualifications critical to achieving product Ship Release Approval milestone. Task involved working with engineering and customers to identify specific areas requiring qualification coverage, managing progress through periodic technical calls, and reported status weekly to program execution meetings. \no\tTrained sales teams of Intel customers on features and market positioning of Intel Xeon Phi. \no\tCreated proposal for special product sku request from key customer based on business needs for both customer and Intel, and drove through approval process by upper management. \no\tPresented at Intel conferences in Taiwan and Santa Clara, to train tier-2 customers on product integration and qualification. Senior Technical Marketing Engineer Intel Corporation September 2011  –  December 2013  (2 years 4 months) San Jose, CA o\tRole of technical consultant on the Intel® Xeon Phi™ product family for the HPC market with focus on power delivery and custom cooling solutions. \no\tCreated and periodically released product datasheet. \no\tIdentified product hardware features critical for customer qualifications and drove enabling by working with engineering teams to design and deliver prototypes. \no\tOwned co-validation engagements with key OEM partners for joint product qualifications critical to achieving product Ship Release Approval milestone. Task involved working with engineering and customers to identify specific areas requiring qualification coverage, managing progress through periodic technical calls, and reported status weekly to program execution meetings. \no\tTrained sales teams of Intel customers on features and market positioning of Intel Xeon Phi. \no\tCreated proposal for special product sku request from key customer based on business needs for both customer and Intel, and drove through approval process by upper management. \no\tPresented at Intel conferences in Taiwan and Santa Clara, to train tier-2 customers on product integration and qualification. Technical Marketing Engineer Intel Corporation September 2005  –  September 2011  (6 years 1 month) San Jose, CA o\tRole of technical consultant on Intel® 7500 Scalable Memory Buffer and platform electrical design guidelines for Intel® Xeon® and Itanium® Processor based platforms. \no\tPoint-of-contact for technical enabling of Intel® Itanium® platform software development vehicle for ISV and OSV community. Task involved working directly with box vendor to ensure compliance with system requirements, provide debug support and keep vendor on track to meet NRE milestones. Related accomplishment involved validating 3rd party vendor of debug software. \no\tLed task force of key engineering experts to tackle high visible showstopper issues critical for OEM partner launch. \no\tProvided Intel® QuickPath Interconnect training to customers on link protocol, test tools and hardware debug methodologies. Technical Marketing Engineer Intel Corporation September 2005  –  September 2011  (6 years 1 month) San Jose, CA o\tRole of technical consultant on Intel® 7500 Scalable Memory Buffer and platform electrical design guidelines for Intel® Xeon® and Itanium® Processor based platforms. \no\tPoint-of-contact for technical enabling of Intel® Itanium® platform software development vehicle for ISV and OSV community. Task involved working directly with box vendor to ensure compliance with system requirements, provide debug support and keep vendor on track to meet NRE milestones. Related accomplishment involved validating 3rd party vendor of debug software. \no\tLed task force of key engineering experts to tackle high visible showstopper issues critical for OEM partner launch. \no\tProvided Intel® QuickPath Interconnect training to customers on link protocol, test tools and hardware debug methodologies. Design Engineer Intel Corporation August 1999  –  August 2005  (6 years 1 month) San Jose, CA o\tDeveloped methodology and script for faster turnaround of IC layout checks for rule violations. Resulted in dropping average processing time from 12 hours to 3 hours, and was widely adopted by other IC design teams. \no\tSilicon debug: executing component level test patterns, debugging and root-causing silicon sightings, and proposing workarounds. \no\tIC block design: parasitic extraction, logic and timing verification and layout planning. Design Engineer Intel Corporation August 1999  –  August 2005  (6 years 1 month) San Jose, CA o\tDeveloped methodology and script for faster turnaround of IC layout checks for rule violations. Resulted in dropping average processing time from 12 hours to 3 hours, and was widely adopted by other IC design teams. \no\tSilicon debug: executing component level test patterns, debugging and root-causing silicon sightings, and proposing workarounds. \no\tIC block design: parasitic extraction, logic and timing verification and layout planning. Education Utah State University ME,  Electrical Engineering 1997  – 1999 Utah State University ME,  Electrical Engineering 1997  – 1999 Utah State University ME,  Electrical Engineering 1997  – 1999 Utah State University ME,  Electrical Engineering 1997  – 1999 ", "Languages Portuguese Native or bilingual proficiency English Native or bilingual proficiency Spanish Professional working proficiency German Elementary proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Spanish Professional working proficiency German Elementary proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Spanish Professional working proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Telecommunications Product Management Wireless Program Management Pre-sales Cross-functional Team... RF Business Development GSM CRM Cellular Communications Mobile Communications Salesforce.com Leadership Mobile Devices Mobile Technology IP Sales Operations Negotiation Product Marketing Analysis Testing Networking See 8+     See less Skills  Telecommunications Product Management Wireless Program Management Pre-sales Cross-functional Team... RF Business Development GSM CRM Cellular Communications Mobile Communications Salesforce.com Leadership Mobile Devices Mobile Technology IP Sales Operations Negotiation Product Marketing Analysis Testing Networking See 8+     See less Telecommunications Product Management Wireless Program Management Pre-sales Cross-functional Team... RF Business Development GSM CRM Cellular Communications Mobile Communications Salesforce.com Leadership Mobile Devices Mobile Technology IP Sales Operations Negotiation Product Marketing Analysis Testing Networking See 8+     See less Telecommunications Product Management Wireless Program Management Pre-sales Cross-functional Team... RF Business Development GSM CRM Cellular Communications Mobile Communications Salesforce.com Leadership Mobile Devices Mobile Technology IP Sales Operations Negotiation Product Marketing Analysis Testing Networking See 8+     See less ", "Skills Technical Marketing Intel Semiconductors Processors Debugging Product Lifecycle... IC Business Alliances Product Management Computer Architecture SoC Go-to-market Strategy ASIC Product Marketing Microprocessors Digital Media Semiconductor Industry Hardware Architecture EDA Analog Firmware Embedded Systems FPGA Device Drivers Embedded Software System Architecture Consumer Electronics Hardware High Performance... RF PCIe See 16+     See less Skills  Technical Marketing Intel Semiconductors Processors Debugging Product Lifecycle... IC Business Alliances Product Management Computer Architecture SoC Go-to-market Strategy ASIC Product Marketing Microprocessors Digital Media Semiconductor Industry Hardware Architecture EDA Analog Firmware Embedded Systems FPGA Device Drivers Embedded Software System Architecture Consumer Electronics Hardware High Performance... RF PCIe See 16+     See less Technical Marketing Intel Semiconductors Processors Debugging Product Lifecycle... IC Business Alliances Product Management Computer Architecture SoC Go-to-market Strategy ASIC Product Marketing Microprocessors Digital Media Semiconductor Industry Hardware Architecture EDA Analog Firmware Embedded Systems FPGA Device Drivers Embedded Software System Architecture Consumer Electronics Hardware High Performance... RF PCIe See 16+     See less Technical Marketing Intel Semiconductors Processors Debugging Product Lifecycle... IC Business Alliances Product Management Computer Architecture SoC Go-to-market Strategy ASIC Product Marketing Microprocessors Digital Media Semiconductor Industry Hardware Architecture EDA Analog Firmware Embedded Systems FPGA Device Drivers Embedded Software System Architecture Consumer Electronics Hardware High Performance... RF PCIe See 16+     See less "]}