{"position": "Technical Training Program Manager", "company": "Intel Corporation", "profiles": ["Experience Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Skills Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Skills  Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Program Management Process Improvement Analysis Data Analysis Business Analysis Problem Solving Excel Process Development Technical Training PowerPoint Word Metrics Customer Relations Education California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society ", "Experience Medical Billing Specialist The NM Family Connection, LLC May 2015  – Present (4 months) RHIT Exam Prep Instructor ITT Technical Institute May 2013  – Present (2 years 4 months) Albuquerque, New Mexico Area Develop and implemented a structured class for candidates who are preparing to test for their RHIT credential. \nProfessionals holding the RHIT credential are health information technicians who: \n•Ensure the quality of medical records by verifying their completeness, accuracy, and proper entry into computer systems. \n•Use computer applications to assemble and analyze patient data for the purpose of improving patient care or controlling costs. \n•Often specialize in coding diagnoses and procedures in patient records for reimbursement and research. An additional role for RHITs is cancer registrars - compiling and maintaining data on cancer patients. Medical Coder UNM Hospitals February 2013  –  May 2015  (2 years 4 months) Albuquerque, New Mexico Area Code inpatient hospital discharge and outpatient day surgery records for the purpose of reimbursement, research and compliance with federal regulation according to diagnosis, operation, and procedure using ICD-9-CM classification system. Ensures adherence to Hospital and Departmental Policies and Procedures. Trained for the upcoming ICD-10 implementation. Health Information Technician UNM Sandoval Regional Medical Center August 2012  –  February 2013  (7 months) Prepare documentations for addition into the electronic medical records, scan with quality checks. Perform Patient record quality checks and conducted release of information all in accordance with HIPPA requirements. Registrar @ Colinas del Norte Elementary School Rio Rancho Public Schools July 2006  –  August 2012  (6 years 2 months) Responsible for registration and withdrawing student and the integrity of students personal information; data entry for the purpose of state reporting; report generation and schedule creation. Electronically create the student records, which includes scheduling and attendance in the district software, PowerSchool. General office skills; telephone management, scheduling meetings, greeting and addressing parental concerns. Program Manager, Assembly Test Manufacturing Intel Corporation April 2004  –  February 2006  (1 year 11 months) Project manager for the People systems team responsible for providing integrated solutions that enable F7 Test multi cultural employees quickly and smoothly to contribute to a successful startup and ramp. Solutions included staffing, relocation, instruction of best know methods, manufacturing training systems TED’s, TX, Peer training, and curriculums. Created a SharePoint based best known method system to share with the ATM VF Organizations. Technical Training Program Manager Intel Corporation 2005  –  2006  (1 year) Albuquerque, New Mexico Area Project manager for Assembly test manufacturing technical training group. Responsible for facilitating implementation of certification tracking tool and Training Exchange reporting tool across all 11 world wide ATM factories. Responsible for creating desktop procedures and business processes for the virtual factories. Facilitator for the Training systems group, responsible for implementing training systems and programs and success indicators for the organization. Coached, trained and mentored several team members to a superuser for all software systems. Medical Billing Specialist The NM Family Connection, LLC May 2015  – Present (4 months) Medical Billing Specialist The NM Family Connection, LLC May 2015  – Present (4 months) RHIT Exam Prep Instructor ITT Technical Institute May 2013  – Present (2 years 4 months) Albuquerque, New Mexico Area Develop and implemented a structured class for candidates who are preparing to test for their RHIT credential. \nProfessionals holding the RHIT credential are health information technicians who: \n•Ensure the quality of medical records by verifying their completeness, accuracy, and proper entry into computer systems. \n•Use computer applications to assemble and analyze patient data for the purpose of improving patient care or controlling costs. \n•Often specialize in coding diagnoses and procedures in patient records for reimbursement and research. An additional role for RHITs is cancer registrars - compiling and maintaining data on cancer patients. RHIT Exam Prep Instructor ITT Technical Institute May 2013  – Present (2 years 4 months) Albuquerque, New Mexico Area Develop and implemented a structured class for candidates who are preparing to test for their RHIT credential. \nProfessionals holding the RHIT credential are health information technicians who: \n•Ensure the quality of medical records by verifying their completeness, accuracy, and proper entry into computer systems. \n•Use computer applications to assemble and analyze patient data for the purpose of improving patient care or controlling costs. \n•Often specialize in coding diagnoses and procedures in patient records for reimbursement and research. An additional role for RHITs is cancer registrars - compiling and maintaining data on cancer patients. Medical Coder UNM Hospitals February 2013  –  May 2015  (2 years 4 months) Albuquerque, New Mexico Area Code inpatient hospital discharge and outpatient day surgery records for the purpose of reimbursement, research and compliance with federal regulation according to diagnosis, operation, and procedure using ICD-9-CM classification system. Ensures adherence to Hospital and Departmental Policies and Procedures. Trained for the upcoming ICD-10 implementation. Medical Coder UNM Hospitals February 2013  –  May 2015  (2 years 4 months) Albuquerque, New Mexico Area Code inpatient hospital discharge and outpatient day surgery records for the purpose of reimbursement, research and compliance with federal regulation according to diagnosis, operation, and procedure using ICD-9-CM classification system. Ensures adherence to Hospital and Departmental Policies and Procedures. Trained for the upcoming ICD-10 implementation. Health Information Technician UNM Sandoval Regional Medical Center August 2012  –  February 2013  (7 months) Prepare documentations for addition into the electronic medical records, scan with quality checks. Perform Patient record quality checks and conducted release of information all in accordance with HIPPA requirements. Health Information Technician UNM Sandoval Regional Medical Center August 2012  –  February 2013  (7 months) Prepare documentations for addition into the electronic medical records, scan with quality checks. Perform Patient record quality checks and conducted release of information all in accordance with HIPPA requirements. Registrar @ Colinas del Norte Elementary School Rio Rancho Public Schools July 2006  –  August 2012  (6 years 2 months) Responsible for registration and withdrawing student and the integrity of students personal information; data entry for the purpose of state reporting; report generation and schedule creation. Electronically create the student records, which includes scheduling and attendance in the district software, PowerSchool. General office skills; telephone management, scheduling meetings, greeting and addressing parental concerns. Registrar @ Colinas del Norte Elementary School Rio Rancho Public Schools July 2006  –  August 2012  (6 years 2 months) Responsible for registration and withdrawing student and the integrity of students personal information; data entry for the purpose of state reporting; report generation and schedule creation. Electronically create the student records, which includes scheduling and attendance in the district software, PowerSchool. General office skills; telephone management, scheduling meetings, greeting and addressing parental concerns. Program Manager, Assembly Test Manufacturing Intel Corporation April 2004  –  February 2006  (1 year 11 months) Project manager for the People systems team responsible for providing integrated solutions that enable F7 Test multi cultural employees quickly and smoothly to contribute to a successful startup and ramp. Solutions included staffing, relocation, instruction of best know methods, manufacturing training systems TED’s, TX, Peer training, and curriculums. Created a SharePoint based best known method system to share with the ATM VF Organizations. Program Manager, Assembly Test Manufacturing Intel Corporation April 2004  –  February 2006  (1 year 11 months) Project manager for the People systems team responsible for providing integrated solutions that enable F7 Test multi cultural employees quickly and smoothly to contribute to a successful startup and ramp. Solutions included staffing, relocation, instruction of best know methods, manufacturing training systems TED’s, TX, Peer training, and curriculums. Created a SharePoint based best known method system to share with the ATM VF Organizations. Technical Training Program Manager Intel Corporation 2005  –  2006  (1 year) Albuquerque, New Mexico Area Project manager for Assembly test manufacturing technical training group. Responsible for facilitating implementation of certification tracking tool and Training Exchange reporting tool across all 11 world wide ATM factories. Responsible for creating desktop procedures and business processes for the virtual factories. Facilitator for the Training systems group, responsible for implementing training systems and programs and success indicators for the organization. Coached, trained and mentored several team members to a superuser for all software systems. Technical Training Program Manager Intel Corporation 2005  –  2006  (1 year) Albuquerque, New Mexico Area Project manager for Assembly test manufacturing technical training group. Responsible for facilitating implementation of certification tracking tool and Training Exchange reporting tool across all 11 world wide ATM factories. Responsible for creating desktop procedures and business processes for the virtual factories. Facilitator for the Training systems group, responsible for implementing training systems and programs and success indicators for the organization. Coached, trained and mentored several team members to a superuser for all software systems. Languages   Skills Medical Records HIPAA Health Information... CPT EMR Medical Coding Medical Transcription CPOE Cerner JCAHO ICD-9-CM Healthcare Information... Release of Information Training and Development Medical Terminology EHR Healthcare Hospitals Healthcare Management HCPCS Revenue Cycle Informatics Data Entry Program Management Training Process Improvement Management ICD-9 Medical Billing NextGen Medicine See 16+     See less Skills  Medical Records HIPAA Health Information... CPT EMR Medical Coding Medical Transcription CPOE Cerner JCAHO ICD-9-CM Healthcare Information... Release of Information Training and Development Medical Terminology EHR Healthcare Hospitals Healthcare Management HCPCS Revenue Cycle Informatics Data Entry Program Management Training Process Improvement Management ICD-9 Medical Billing NextGen Medicine See 16+     See less Medical Records HIPAA Health Information... CPT EMR Medical Coding Medical Transcription CPOE Cerner JCAHO ICD-9-CM Healthcare Information... Release of Information Training and Development Medical Terminology EHR Healthcare Hospitals Healthcare Management HCPCS Revenue Cycle Informatics Data Entry Program Management Training Process Improvement Management ICD-9 Medical Billing NextGen Medicine See 16+     See less Medical Records HIPAA Health Information... CPT EMR Medical Coding Medical Transcription CPOE Cerner JCAHO ICD-9-CM Healthcare Information... Release of Information Training and Development Medical Terminology EHR Healthcare Hospitals Healthcare Management HCPCS Revenue Cycle Informatics Data Entry Program Management Training Process Improvement Management ICD-9 Medical Billing NextGen Medicine See 16+     See less Education Central New Mexico Community College Health Information Techonology,  Health Information/Medical Records Administration/Administrator 2009  – 2011 National American University-Albuquerque 1997  – 1998 Central New Mexico Community College Health Information Techonology,  Health Information/Medical Records Administration/Administrator 2009  – 2011 Central New Mexico Community College Health Information Techonology,  Health Information/Medical Records Administration/Administrator 2009  – 2011 Central New Mexico Community College Health Information Techonology,  Health Information/Medical Records Administration/Administrator 2009  – 2011 National American University-Albuquerque 1997  – 1998 National American University-Albuquerque 1997  – 1998 National American University-Albuquerque 1997  – 1998 Honors & Awards ", "Experience Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, California Account Manager FedEx January 1998  –  February 2012  (14 years 2 months) Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, California Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, California Account Manager FedEx January 1998  –  February 2012  (14 years 2 months) Account Manager FedEx January 1998  –  February 2012  (14 years 2 months) Skills Program Management Training & Development Learning Management Account Management Process Improvement Art Direction Graphic Design Photography Offset Printing Digital Printing Adobe Creative Suite Microsoft Office Skills  Program Management Training & Development Learning Management Account Management Process Improvement Art Direction Graphic Design Photography Offset Printing Digital Printing Adobe Creative Suite Microsoft Office Program Management Training & Development Learning Management Account Management Process Improvement Art Direction Graphic Design Photography Offset Printing Digital Printing Adobe Creative Suite Microsoft Office Program Management Training & Development Learning Management Account Management Process Improvement Art Direction Graphic Design Photography Offset Printing Digital Printing Adobe Creative Suite Microsoft Office Education California State University-Sacramento Master of Business Administration (M.B.A.),  Business Administration and Management , General 2015  – 2016 California State University-Sacramento Bachelor of Science (BS),  Graphic Design 2002  – 2007 Sierra College Associate of Science (A.S.),  Computer and Information Sciences and Support Services 1994  – 1998 Sierra College Associate of Arts (A.A.),  Art/Art Studies , General 1994  – 1998 California State University-Sacramento Master of Business Administration (M.B.A.),  Business Administration and Management , General 2015  – 2016 California State University-Sacramento Master of Business Administration (M.B.A.),  Business Administration and Management , General 2015  – 2016 California State University-Sacramento Master of Business Administration (M.B.A.),  Business Administration and Management , General 2015  – 2016 California State University-Sacramento Bachelor of Science (BS),  Graphic Design 2002  – 2007 California State University-Sacramento Bachelor of Science (BS),  Graphic Design 2002  – 2007 California State University-Sacramento Bachelor of Science (BS),  Graphic Design 2002  – 2007 Sierra College Associate of Science (A.S.),  Computer and Information Sciences and Support Services 1994  – 1998 Sierra College Associate of Science (A.S.),  Computer and Information Sciences and Support Services 1994  – 1998 Sierra College Associate of Science (A.S.),  Computer and Information Sciences and Support Services 1994  – 1998 Sierra College Associate of Arts (A.A.),  Art/Art Studies , General 1994  – 1998 Sierra College Associate of Arts (A.A.),  Art/Art Studies , General 1994  – 1998 Sierra College Associate of Arts (A.A.),  Art/Art Studies , General 1994  – 1998 ", "Summary I have excelled at Intel Corporation for over 6 years in both the Oregon and Arizona in several different capacities that include IT, Manufacturing, and Talent Acquisition. In my current role I am the Technical Training Leader for photolithography and suppor Intel's military talent acquisition program. Summary I have excelled at Intel Corporation for over 6 years in both the Oregon and Arizona in several different capacities that include IT, Manufacturing, and Talent Acquisition. In my current role I am the Technical Training Leader for photolithography and suppor Intel's military talent acquisition program. I have excelled at Intel Corporation for over 6 years in both the Oregon and Arizona in several different capacities that include IT, Manufacturing, and Talent Acquisition. In my current role I am the Technical Training Leader for photolithography and suppor Intel's military talent acquisition program. I have excelled at Intel Corporation for over 6 years in both the Oregon and Arizona in several different capacities that include IT, Manufacturing, and Talent Acquisition. In my current role I am the Technical Training Leader for photolithography and suppor Intel's military talent acquisition program. Experience Workforce Capability Program Manager Intel Corporation August 2015  – Present (1 month) Operational excellence led by capable, inspired, professional and empowered Manufacturing Specialists & Technicians Technical Training Program Manager Intel Corporation September 2012  –  August 2015  (3 years) I support over 800 Engineers and Technicians across all manufacturing processes as a Technical Training Program Manager in Intel's Arizona manufacturing organization, the leading high-volume manufacturer of the company's core product lines. Our department provides world class support to the manufacturing operations at two semiconductor fabrication plants collocated on the Ocotillo campus. My role requires systems support of internal certification and training applications along with departmental productivity improvement initiatives. \n \nThe results of my efforts have led to the proliferation of the first Intel approved secure video capture of the semiconductor manufacturing process, the implementation of a new knowledge transfer repository for the dissemination of IP throughout the launch of a new technology, and the certification of over 300 Technicians on the skill sets of external Field Service Engineers. \nOther responsibilities include: \n \n- SharePoint administration \n- LMS (Learning Management System) administration \n- Coordination of external vendor training \n- Military Veteran Staffing and Recruiting Company Commander Oregon Army National Guard July 2014  –  July 2015  (1 year 1 month) HHD 249th RTI - Oversee the training and readiness for 78 assigned Soldiers of the 249th Regional Training Institute \n- Advise the Regimental Commander on personnel readiness for the Headquarters Detachment. \n- RTI Safety Officer responsible for the ground and vehicle safety programs \n- Account for over $20 million of equipment in 3 geographical locations across the state \n \nPrevious positions in the Army \n \nOregon Army National Guard: \n \nApril 2011 – July 2014 \nThreat Assessment Officer \nAdvised the Detachment Commander on defensive measures against CBRNE attacks to minimize damage to installations and MSRs during Operation Tiger Balm and NTC rotation 14-8. Assisted with the coordination of Area Damage Control, Movement Control, Terrain Management, and Operational Protection functions of the Rear Area during exercises. Planned and recommended Protection Cell training activities.  \nDeveloped CBRNE operations overview training and compiled the objectives and roles of the TSD in the NTC rotation 14-08 in preparation for rotation 15-08 with 7th ID. \nAdvised the 158th MEB Commander on CBRNE defense, reconnaissance, and MTOE capabilities while training for Operation Pegasus Fury with the AZ ARNG. \n \nMay 2008 – August 2010 \nPlatoon Leader \n* Commanded 60+ convoy escort missions tasked with the protection of commodities, personnel, and equipment delivered throughout the Iraqi theater of operations. \n* Responsible for the welfare, morale, and training of 52 soldiers assigned to my command. \n* Personally accountable for the maintenance, operation, and serviceability of over $8 million in vehicles, equipment, and weapons systems. \n \nAugust 2006 – May 2008 \nLegal Specialist \n \nJune 2004 - August 2006 \nFinancial Specialist \n \nUnited States Army: \n \nTraining and Records Supervisor \nAugust 2001 – June 2004 \n IT Training Forecast Manager Intel Corporation January 2009  –  September 2012  (3 years 9 months) Provided direct support to Intel's IT department ranging from continuous tactical engagement with the global help desk to catalog and content management of the internal learning content management system (LCMS). From 2009 to 2012 I engaged in, and led multiple projects impacting the training delivery for over 6,500 IT employees while directing the strategic direction of the $2M central training budget. \n \n- SharePoint administration \n- LMS (Learning Management System) administration \n- Coordination of external vendor training Workforce Capability Program Manager Intel Corporation August 2015  – Present (1 month) Operational excellence led by capable, inspired, professional and empowered Manufacturing Specialists & Technicians Workforce Capability Program Manager Intel Corporation August 2015  – Present (1 month) Operational excellence led by capable, inspired, professional and empowered Manufacturing Specialists & Technicians Technical Training Program Manager Intel Corporation September 2012  –  August 2015  (3 years) I support over 800 Engineers and Technicians across all manufacturing processes as a Technical Training Program Manager in Intel's Arizona manufacturing organization, the leading high-volume manufacturer of the company's core product lines. Our department provides world class support to the manufacturing operations at two semiconductor fabrication plants collocated on the Ocotillo campus. My role requires systems support of internal certification and training applications along with departmental productivity improvement initiatives. \n \nThe results of my efforts have led to the proliferation of the first Intel approved secure video capture of the semiconductor manufacturing process, the implementation of a new knowledge transfer repository for the dissemination of IP throughout the launch of a new technology, and the certification of over 300 Technicians on the skill sets of external Field Service Engineers. \nOther responsibilities include: \n \n- SharePoint administration \n- LMS (Learning Management System) administration \n- Coordination of external vendor training \n- Military Veteran Staffing and Recruiting Technical Training Program Manager Intel Corporation September 2012  –  August 2015  (3 years) I support over 800 Engineers and Technicians across all manufacturing processes as a Technical Training Program Manager in Intel's Arizona manufacturing organization, the leading high-volume manufacturer of the company's core product lines. Our department provides world class support to the manufacturing operations at two semiconductor fabrication plants collocated on the Ocotillo campus. My role requires systems support of internal certification and training applications along with departmental productivity improvement initiatives. \n \nThe results of my efforts have led to the proliferation of the first Intel approved secure video capture of the semiconductor manufacturing process, the implementation of a new knowledge transfer repository for the dissemination of IP throughout the launch of a new technology, and the certification of over 300 Technicians on the skill sets of external Field Service Engineers. \nOther responsibilities include: \n \n- SharePoint administration \n- LMS (Learning Management System) administration \n- Coordination of external vendor training \n- Military Veteran Staffing and Recruiting Company Commander Oregon Army National Guard July 2014  –  July 2015  (1 year 1 month) HHD 249th RTI - Oversee the training and readiness for 78 assigned Soldiers of the 249th Regional Training Institute \n- Advise the Regimental Commander on personnel readiness for the Headquarters Detachment. \n- RTI Safety Officer responsible for the ground and vehicle safety programs \n- Account for over $20 million of equipment in 3 geographical locations across the state \n \nPrevious positions in the Army \n \nOregon Army National Guard: \n \nApril 2011 – July 2014 \nThreat Assessment Officer \nAdvised the Detachment Commander on defensive measures against CBRNE attacks to minimize damage to installations and MSRs during Operation Tiger Balm and NTC rotation 14-8. Assisted with the coordination of Area Damage Control, Movement Control, Terrain Management, and Operational Protection functions of the Rear Area during exercises. Planned and recommended Protection Cell training activities.  \nDeveloped CBRNE operations overview training and compiled the objectives and roles of the TSD in the NTC rotation 14-08 in preparation for rotation 15-08 with 7th ID. \nAdvised the 158th MEB Commander on CBRNE defense, reconnaissance, and MTOE capabilities while training for Operation Pegasus Fury with the AZ ARNG. \n \nMay 2008 – August 2010 \nPlatoon Leader \n* Commanded 60+ convoy escort missions tasked with the protection of commodities, personnel, and equipment delivered throughout the Iraqi theater of operations. \n* Responsible for the welfare, morale, and training of 52 soldiers assigned to my command. \n* Personally accountable for the maintenance, operation, and serviceability of over $8 million in vehicles, equipment, and weapons systems. \n \nAugust 2006 – May 2008 \nLegal Specialist \n \nJune 2004 - August 2006 \nFinancial Specialist \n \nUnited States Army: \n \nTraining and Records Supervisor \nAugust 2001 – June 2004 \n Company Commander Oregon Army National Guard July 2014  –  July 2015  (1 year 1 month) HHD 249th RTI - Oversee the training and readiness for 78 assigned Soldiers of the 249th Regional Training Institute \n- Advise the Regimental Commander on personnel readiness for the Headquarters Detachment. \n- RTI Safety Officer responsible for the ground and vehicle safety programs \n- Account for over $20 million of equipment in 3 geographical locations across the state \n \nPrevious positions in the Army \n \nOregon Army National Guard: \n \nApril 2011 – July 2014 \nThreat Assessment Officer \nAdvised the Detachment Commander on defensive measures against CBRNE attacks to minimize damage to installations and MSRs during Operation Tiger Balm and NTC rotation 14-8. Assisted with the coordination of Area Damage Control, Movement Control, Terrain Management, and Operational Protection functions of the Rear Area during exercises. Planned and recommended Protection Cell training activities.  \nDeveloped CBRNE operations overview training and compiled the objectives and roles of the TSD in the NTC rotation 14-08 in preparation for rotation 15-08 with 7th ID. \nAdvised the 158th MEB Commander on CBRNE defense, reconnaissance, and MTOE capabilities while training for Operation Pegasus Fury with the AZ ARNG. \n \nMay 2008 – August 2010 \nPlatoon Leader \n* Commanded 60+ convoy escort missions tasked with the protection of commodities, personnel, and equipment delivered throughout the Iraqi theater of operations. \n* Responsible for the welfare, morale, and training of 52 soldiers assigned to my command. \n* Personally accountable for the maintenance, operation, and serviceability of over $8 million in vehicles, equipment, and weapons systems. \n \nAugust 2006 – May 2008 \nLegal Specialist \n \nJune 2004 - August 2006 \nFinancial Specialist \n \nUnited States Army: \n \nTraining and Records Supervisor \nAugust 2001 – June 2004 \n IT Training Forecast Manager Intel Corporation January 2009  –  September 2012  (3 years 9 months) Provided direct support to Intel's IT department ranging from continuous tactical engagement with the global help desk to catalog and content management of the internal learning content management system (LCMS). From 2009 to 2012 I engaged in, and led multiple projects impacting the training delivery for over 6,500 IT employees while directing the strategic direction of the $2M central training budget. \n \n- SharePoint administration \n- LMS (Learning Management System) administration \n- Coordination of external vendor training IT Training Forecast Manager Intel Corporation January 2009  –  September 2012  (3 years 9 months) Provided direct support to Intel's IT department ranging from continuous tactical engagement with the global help desk to catalog and content management of the internal learning content management system (LCMS). From 2009 to 2012 I engaged in, and led multiple projects impacting the training delivery for over 6,500 IT employees while directing the strategic direction of the $2M central training budget. \n \n- SharePoint administration \n- LMS (Learning Management System) administration \n- Coordination of external vendor training Languages   Skills Budgeting Planning Military Risk Assessment Process Improvement Project Planning Training Strategic Planning Budgets Leadership Program Management Leadership Development Defense Skills  Budgeting Planning Military Risk Assessment Process Improvement Project Planning Training Strategic Planning Budgets Leadership Program Management Leadership Development Defense Budgeting Planning Military Risk Assessment Process Improvement Project Planning Training Strategic Planning Budgets Leadership Program Management Leadership Development Defense Budgeting Planning Military Risk Assessment Process Improvement Project Planning Training Strategic Planning Budgets Leadership Program Management Leadership Development Defense Education University of Portland MBA,  Business Administration , 3.59 2006  – 2008 Distinguished Military Student, Distinguished Military Graduate Activities and Societies:  Army ROTC Portland State University B.S,  Business Administration , 3.82 2004  – 2006 Magna Cum Laude University of Portland MBA,  Business Administration , 3.59 2006  – 2008 Distinguished Military Student, Distinguished Military Graduate Activities and Societies:  Army ROTC University of Portland MBA,  Business Administration , 3.59 2006  – 2008 Distinguished Military Student, Distinguished Military Graduate Activities and Societies:  Army ROTC University of Portland MBA,  Business Administration , 3.59 2006  – 2008 Distinguished Military Student, Distinguished Military Graduate Activities and Societies:  Army ROTC Portland State University B.S,  Business Administration , 3.82 2004  – 2006 Magna Cum Laude Portland State University B.S,  Business Administration , 3.82 2004  – 2006 Magna Cum Laude Portland State University B.S,  Business Administration , 3.82 2004  – 2006 Magna Cum Laude Honors & Awards ", "Summary -\tOver 13 years experience working at international working environment including multicultural corporations and international development organizations \n-\tMore than 9 years of coordination and management \n-\tOver 8 years experience in Administration and Human Resources functions of which 06 years at management responsibility  \n-\tInternational interaction experience in Malaysia, Thailand and UK. \n- Experience involving in some training and restructuring projects at companies in Vietnam \n \n \nExperienced in HRM, Employee Relations, HR operation, OD,Training & Development,Program-Project development and management, Job levelling Summary -\tOver 13 years experience working at international working environment including multicultural corporations and international development organizations \n-\tMore than 9 years of coordination and management \n-\tOver 8 years experience in Administration and Human Resources functions of which 06 years at management responsibility  \n-\tInternational interaction experience in Malaysia, Thailand and UK. \n- Experience involving in some training and restructuring projects at companies in Vietnam \n \n \nExperienced in HRM, Employee Relations, HR operation, OD,Training & Development,Program-Project development and management, Job levelling -\tOver 13 years experience working at international working environment including multicultural corporations and international development organizations \n-\tMore than 9 years of coordination and management \n-\tOver 8 years experience in Administration and Human Resources functions of which 06 years at management responsibility  \n-\tInternational interaction experience in Malaysia, Thailand and UK. \n- Experience involving in some training and restructuring projects at companies in Vietnam \n \n \nExperienced in HRM, Employee Relations, HR operation, OD,Training & Development,Program-Project development and management, Job levelling -\tOver 13 years experience working at international working environment including multicultural corporations and international development organizations \n-\tMore than 9 years of coordination and management \n-\tOver 8 years experience in Administration and Human Resources functions of which 06 years at management responsibility  \n-\tInternational interaction experience in Malaysia, Thailand and UK. \n- Experience involving in some training and restructuring projects at companies in Vietnam \n \n \nExperienced in HRM, Employee Relations, HR operation, OD,Training & Development,Program-Project development and management, Job levelling Experience Human Resources and Administration Manager Habitat for Humanity International November 2011  –  June 2013  (1 year 8 months) Ho Chi Minh city Consultant- Deputy General Director Hoang Long Group 2008  –  2009  (1 year) Long An Technical Training Program Manager Intel Corporation 2007  –  2008  (1 year) Ho Chi Minh Consultant TMA Solutions 2006  –  2007  (1 year) Project Manager CARE 2005  –  2006  (1 year) An Giang Program Officer Oxfam 2004  –  2005  (1 year) TG, DT Project Officer - Training and Gender IUCN 2002  –  2004  (2 years) Nha trang Human Resources and Administration Manager Habitat for Humanity International November 2011  –  June 2013  (1 year 8 months) Ho Chi Minh city Human Resources and Administration Manager Habitat for Humanity International November 2011  –  June 2013  (1 year 8 months) Ho Chi Minh city Consultant- Deputy General Director Hoang Long Group 2008  –  2009  (1 year) Long An Consultant- Deputy General Director Hoang Long Group 2008  –  2009  (1 year) Long An Technical Training Program Manager Intel Corporation 2007  –  2008  (1 year) Ho Chi Minh Technical Training Program Manager Intel Corporation 2007  –  2008  (1 year) Ho Chi Minh Consultant TMA Solutions 2006  –  2007  (1 year) Consultant TMA Solutions 2006  –  2007  (1 year) Project Manager CARE 2005  –  2006  (1 year) An Giang Project Manager CARE 2005  –  2006  (1 year) An Giang Program Officer Oxfam 2004  –  2005  (1 year) TG, DT Program Officer Oxfam 2004  –  2005  (1 year) TG, DT Project Officer - Training and Gender IUCN 2002  –  2004  (2 years) Nha trang Project Officer - Training and Gender IUCN 2002  –  2004  (2 years) Nha trang Education Cornell University Advanced Certificate,  Strategic HR Management 2013  – 2013 Apollos University Master of Business Administration (MBA) 2007  – 2010 Asian Institute of Technology Master of Science (MS),  Gender and Development 2001  – 2002 Hue University 1997 Cornell University Advanced Certificate,  Strategic HR Management 2013  – 2013 Cornell University Advanced Certificate,  Strategic HR Management 2013  – 2013 Cornell University Advanced Certificate,  Strategic HR Management 2013  – 2013 Apollos University Master of Business Administration (MBA) 2007  – 2010 Apollos University Master of Business Administration (MBA) 2007  – 2010 Apollos University Master of Business Administration (MBA) 2007  – 2010 Asian Institute of Technology Master of Science (MS),  Gender and Development 2001  – 2002 Asian Institute of Technology Master of Science (MS),  Gender and Development 2001  – 2002 Asian Institute of Technology Master of Science (MS),  Gender and Development 2001  – 2002 Hue University 1997 Hue University 1997 Hue University 1997 ", "Skills Cross-functional Team... Software Development Program Management Intel Software Project... eLearning blended learning Training & Develeopment Measurement & Evaluation Instructional Design... Strategic Planning Strategic Thinking Coaching and Mentoring Virtual Learning Social Media Strategist Customer Experience Program/Project... Training Management courseware development Innovation Human Factors... Social Networking Team Leadership Creative Solutions Blended Learning Project Management E-Learning Employee Training Vendor Management Strategy Training Leadership Product Management Process Improvement PMP Integration See 21+     See less Skills  Cross-functional Team... Software Development Program Management Intel Software Project... eLearning blended learning Training & Develeopment Measurement & Evaluation Instructional Design... Strategic Planning Strategic Thinking Coaching and Mentoring Virtual Learning Social Media Strategist Customer Experience Program/Project... Training Management courseware development Innovation Human Factors... Social Networking Team Leadership Creative Solutions Blended Learning Project Management E-Learning Employee Training Vendor Management Strategy Training Leadership Product Management Process Improvement PMP Integration See 21+     See less Cross-functional Team... Software Development Program Management Intel Software Project... eLearning blended learning Training & Develeopment Measurement & Evaluation Instructional Design... Strategic Planning Strategic Thinking Coaching and Mentoring Virtual Learning Social Media Strategist Customer Experience Program/Project... Training Management courseware development Innovation Human Factors... Social Networking Team Leadership Creative Solutions Blended Learning Project Management E-Learning Employee Training Vendor Management Strategy Training Leadership Product Management Process Improvement PMP Integration See 21+     See less Cross-functional Team... Software Development Program Management Intel Software Project... eLearning blended learning Training & Develeopment Measurement & Evaluation Instructional Design... Strategic Planning Strategic Thinking Coaching and Mentoring Virtual Learning Social Media Strategist Customer Experience Program/Project... Training Management courseware development Innovation Human Factors... Social Networking Team Leadership Creative Solutions Blended Learning Project Management E-Learning Employee Training Vendor Management Strategy Training Leadership Product Management Process Improvement PMP Integration See 21+     See less ", "Experience Technical Training Program Manager Intel Corporation Technical Training Program Manager Intel Corporation Technical Training Program Manager Intel Corporation Languages Filipino Filipino Filipino Skills Semiconductors Process Engineering Project Management Data Analysis Business Process Process Improvement Program Management Product Management Six Sigma Skills  Semiconductors Process Engineering Project Management Data Analysis Business Process Process Improvement Program Management Product Management Six Sigma Semiconductors Process Engineering Project Management Data Analysis Business Process Process Improvement Program Management Product Management Six Sigma Semiconductors Process Engineering Project Management Data Analysis Business Process Process Improvement Program Management Product Management Six Sigma Education University of the Philippines B.S.,  Chemical Engineering 1977  – 1982 Activities and Societies:  UP Chemical Engineering Society ,  Inter Varsity Christian Fellowship University of the Philippines B.S.,  Chemical Engineering 1977  – 1982 Activities and Societies:  UP Chemical Engineering Society ,  Inter Varsity Christian Fellowship University of the Philippines B.S.,  Chemical Engineering 1977  – 1982 Activities and Societies:  UP Chemical Engineering Society ,  Inter Varsity Christian Fellowship University of the Philippines B.S.,  Chemical Engineering 1977  – 1982 Activities and Societies:  UP Chemical Engineering Society ,  Inter Varsity Christian Fellowship ", "Summary Summary of Qualifications \nTwelve years of combined project management and manufacturing experience in the semiconductor, healthcare and consumer products industry. Demonstrated skills in Leadership, Business Process Development & Improvement, Strong Communication & Organizational Skills, and Research & Data Analysis. Proven ability to apply project management & leadership skill in various roles. Strong business systems analysis background using LEAN principles. Green Belt 6 sigma certified. Able to report outon critical items and speak effectively before groups of customers or employees of organization. Excellent people skills with strong leadership in diversity \n \nSpecialties: benefits administration, business management, coaching, design, driving, english, human resources, instruction, intel, layout design, macromedia director, marketing, materials management, microsoft windows 98, microsoft works, modeling, negotiation, pc, process engineering, processors, purchasing, quality, safety, spanish, supervisory skills, supply chain management, telephone skills, training, training programs, transportation, Summary Summary of Qualifications \nTwelve years of combined project management and manufacturing experience in the semiconductor, healthcare and consumer products industry. Demonstrated skills in Leadership, Business Process Development & Improvement, Strong Communication & Organizational Skills, and Research & Data Analysis. Proven ability to apply project management & leadership skill in various roles. Strong business systems analysis background using LEAN principles. Green Belt 6 sigma certified. Able to report outon critical items and speak effectively before groups of customers or employees of organization. Excellent people skills with strong leadership in diversity \n \nSpecialties: benefits administration, business management, coaching, design, driving, english, human resources, instruction, intel, layout design, macromedia director, marketing, materials management, microsoft windows 98, microsoft works, modeling, negotiation, pc, process engineering, processors, purchasing, quality, safety, spanish, supervisory skills, supply chain management, telephone skills, training, training programs, transportation, Summary of Qualifications \nTwelve years of combined project management and manufacturing experience in the semiconductor, healthcare and consumer products industry. Demonstrated skills in Leadership, Business Process Development & Improvement, Strong Communication & Organizational Skills, and Research & Data Analysis. Proven ability to apply project management & leadership skill in various roles. Strong business systems analysis background using LEAN principles. Green Belt 6 sigma certified. Able to report outon critical items and speak effectively before groups of customers or employees of organization. Excellent people skills with strong leadership in diversity \n \nSpecialties: benefits administration, business management, coaching, design, driving, english, human resources, instruction, intel, layout design, macromedia director, marketing, materials management, microsoft windows 98, microsoft works, modeling, negotiation, pc, process engineering, processors, purchasing, quality, safety, spanish, supervisory skills, supply chain management, telephone skills, training, training programs, transportation, Summary of Qualifications \nTwelve years of combined project management and manufacturing experience in the semiconductor, healthcare and consumer products industry. Demonstrated skills in Leadership, Business Process Development & Improvement, Strong Communication & Organizational Skills, and Research & Data Analysis. Proven ability to apply project management & leadership skill in various roles. Strong business systems analysis background using LEAN principles. Green Belt 6 sigma certified. Able to report outon critical items and speak effectively before groups of customers or employees of organization. Excellent people skills with strong leadership in diversity \n \nSpecialties: benefits administration, business management, coaching, design, driving, english, human resources, instruction, intel, layout design, macromedia director, marketing, materials management, microsoft windows 98, microsoft works, modeling, negotiation, pc, process engineering, processors, purchasing, quality, safety, spanish, supervisory skills, supply chain management, telephone skills, training, training programs, transportation, Experience ATTD Technical Training Program Manager Intel Corporation April 2013  – Present (2 years 5 months) Chandler, AZ Manage the organization's Methodology; the Kaizen Program and the Lean Summit. Automation Project Management and Organization LEAN Champ Intel Corporation June 2009  – Present (6 years 3 months) Responsible for driving a cultural change at all levels of the organization within by instructing, coaching and role modeling LEAN principles. Trainer POC for all factory employees on common language, direct observation techniques and other LEAN tools. Offered training to target population providing the skills and shared way of thinking to systematically drive out waste through designing and improving the work as activities, connections, and flows. Also resposible for highly complex sotfware project management timely and quality delivery, where multiple systems are interdependent and perfect syncrony on their delivery is essencial for success. Industrial Productivity Engineering GL Intel, Costa Rica March 2008  –  May 2009  (1 year 3 months) Time in role; Company phone number: (506) 22 98 60 00 \nScope and achievements \nResponsible for leading the organization to establish productivity improvement in safety, quality, \nlayout and headcount. Developed metrics to measure equipment and factory capacity and output, \nand identifying equipment and process flow bottlenecks. Developed solutions to problems utilizing \nformal education and judgment. Responsible for the monitoring and maintenance of product \nhealth indicators (PHI's) and accurately reflecting these in the capacity models as part of \nmaintenance of business. CR IDM Mngr Componentes Intel de Costa Rica January 2006  –  March 2008  (2 years 3 months) Indirect Materials Purchasing Manager in charge of management of 500+ suppliers (local and international) and 10k+ parts to purchase. Supervising 12 people (exempts and non-exempts) whose primary role was making sure supplies were on site when needed on the quantity and quality needed for all machines and handling media for both manufacturing facilities in CR: desktop processors and chipsets. Secondly, Supplier Development in the local market (within Costa Rica and the Central American region) was key for cost effective business management. Six Sigma Focal Point for CR Materials Intel July 2006  –  December 2006  (6 months) Indirect Materials Buyer Intel March 2004  –  July 2006  (2 years 5 months) Subdirectora Gestion Municipal MOPT January 2002  –  February 2004  (2 years 2 months) Employee Services Associate Procter and Gamble January 2000  –  December 2002  (3 years) Time in role; Scope and achievements \nProject manager within the HealthCare Division of Procter and Gamble responsible for the \nconsolidation & standardization of flexible benefits for the 19 plants in the US including \nparticipating in negotiations with unions where applicable. Transitioned ownership of sustaining \nsuch services from the US to Costa Rica in a flawless and transparent way. EHS assistant Gerber Products of Central America January 1999  –  January 2000  (1 year 1 month) Time in role; Scope and achievements \nEHS assistant, in charge of determining safety risks and hazards and designing enhancements to \nclose the gaps and training employees on new processes and standards. ATTD Technical Training Program Manager Intel Corporation April 2013  – Present (2 years 5 months) Chandler, AZ Manage the organization's Methodology; the Kaizen Program and the Lean Summit. ATTD Technical Training Program Manager Intel Corporation April 2013  – Present (2 years 5 months) Chandler, AZ Manage the organization's Methodology; the Kaizen Program and the Lean Summit. Automation Project Management and Organization LEAN Champ Intel Corporation June 2009  – Present (6 years 3 months) Responsible for driving a cultural change at all levels of the organization within by instructing, coaching and role modeling LEAN principles. Trainer POC for all factory employees on common language, direct observation techniques and other LEAN tools. Offered training to target population providing the skills and shared way of thinking to systematically drive out waste through designing and improving the work as activities, connections, and flows. Also resposible for highly complex sotfware project management timely and quality delivery, where multiple systems are interdependent and perfect syncrony on their delivery is essencial for success. Automation Project Management and Organization LEAN Champ Intel Corporation June 2009  – Present (6 years 3 months) Responsible for driving a cultural change at all levels of the organization within by instructing, coaching and role modeling LEAN principles. Trainer POC for all factory employees on common language, direct observation techniques and other LEAN tools. Offered training to target population providing the skills and shared way of thinking to systematically drive out waste through designing and improving the work as activities, connections, and flows. Also resposible for highly complex sotfware project management timely and quality delivery, where multiple systems are interdependent and perfect syncrony on their delivery is essencial for success. Industrial Productivity Engineering GL Intel, Costa Rica March 2008  –  May 2009  (1 year 3 months) Time in role; Company phone number: (506) 22 98 60 00 \nScope and achievements \nResponsible for leading the organization to establish productivity improvement in safety, quality, \nlayout and headcount. Developed metrics to measure equipment and factory capacity and output, \nand identifying equipment and process flow bottlenecks. Developed solutions to problems utilizing \nformal education and judgment. Responsible for the monitoring and maintenance of product \nhealth indicators (PHI's) and accurately reflecting these in the capacity models as part of \nmaintenance of business. Industrial Productivity Engineering GL Intel, Costa Rica March 2008  –  May 2009  (1 year 3 months) Time in role; Company phone number: (506) 22 98 60 00 \nScope and achievements \nResponsible for leading the organization to establish productivity improvement in safety, quality, \nlayout and headcount. Developed metrics to measure equipment and factory capacity and output, \nand identifying equipment and process flow bottlenecks. Developed solutions to problems utilizing \nformal education and judgment. Responsible for the monitoring and maintenance of product \nhealth indicators (PHI's) and accurately reflecting these in the capacity models as part of \nmaintenance of business. CR IDM Mngr Componentes Intel de Costa Rica January 2006  –  March 2008  (2 years 3 months) Indirect Materials Purchasing Manager in charge of management of 500+ suppliers (local and international) and 10k+ parts to purchase. Supervising 12 people (exempts and non-exempts) whose primary role was making sure supplies were on site when needed on the quantity and quality needed for all machines and handling media for both manufacturing facilities in CR: desktop processors and chipsets. Secondly, Supplier Development in the local market (within Costa Rica and the Central American region) was key for cost effective business management. CR IDM Mngr Componentes Intel de Costa Rica January 2006  –  March 2008  (2 years 3 months) Indirect Materials Purchasing Manager in charge of management of 500+ suppliers (local and international) and 10k+ parts to purchase. Supervising 12 people (exempts and non-exempts) whose primary role was making sure supplies were on site when needed on the quantity and quality needed for all machines and handling media for both manufacturing facilities in CR: desktop processors and chipsets. Secondly, Supplier Development in the local market (within Costa Rica and the Central American region) was key for cost effective business management. Six Sigma Focal Point for CR Materials Intel July 2006  –  December 2006  (6 months) Six Sigma Focal Point for CR Materials Intel July 2006  –  December 2006  (6 months) Indirect Materials Buyer Intel March 2004  –  July 2006  (2 years 5 months) Indirect Materials Buyer Intel March 2004  –  July 2006  (2 years 5 months) Subdirectora Gestion Municipal MOPT January 2002  –  February 2004  (2 years 2 months) Subdirectora Gestion Municipal MOPT January 2002  –  February 2004  (2 years 2 months) Employee Services Associate Procter and Gamble January 2000  –  December 2002  (3 years) Time in role; Scope and achievements \nProject manager within the HealthCare Division of Procter and Gamble responsible for the \nconsolidation & standardization of flexible benefits for the 19 plants in the US including \nparticipating in negotiations with unions where applicable. Transitioned ownership of sustaining \nsuch services from the US to Costa Rica in a flawless and transparent way. Employee Services Associate Procter and Gamble January 2000  –  December 2002  (3 years) Time in role; Scope and achievements \nProject manager within the HealthCare Division of Procter and Gamble responsible for the \nconsolidation & standardization of flexible benefits for the 19 plants in the US including \nparticipating in negotiations with unions where applicable. Transitioned ownership of sustaining \nsuch services from the US to Costa Rica in a flawless and transparent way. EHS assistant Gerber Products of Central America January 1999  –  January 2000  (1 year 1 month) Time in role; Scope and achievements \nEHS assistant, in charge of determining safety risks and hazards and designing enhancements to \nclose the gaps and training employees on new processes and standards. EHS assistant Gerber Products of Central America January 1999  –  January 2000  (1 year 1 month) Time in role; Scope and achievements \nEHS assistant, in charge of determining safety risks and hazards and designing enhancements to \nclose the gaps and training employees on new processes and standards. Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Intel Process Engineering Supply Chain Management Purchasing Materials Management Six Sigma Management Project Management Business Process Manufacturing Engineering Lean Manufacturing Leadership Kaizen Training Engineering Management Semiconductors Data Analysis Supply Chain Cross-functional Team... Business Analysis Industrial Engineering Program Management SPC See 9+     See less Skills  Intel Process Engineering Supply Chain Management Purchasing Materials Management Six Sigma Management Project Management Business Process Manufacturing Engineering Lean Manufacturing Leadership Kaizen Training Engineering Management Semiconductors Data Analysis Supply Chain Cross-functional Team... Business Analysis Industrial Engineering Program Management SPC See 9+     See less Intel Process Engineering Supply Chain Management Purchasing Materials Management Six Sigma Management Project Management Business Process Manufacturing Engineering Lean Manufacturing Leadership Kaizen Training Engineering Management Semiconductors Data Analysis Supply Chain Cross-functional Team... Business Analysis Industrial Engineering Program Management SPC See 9+     See less Intel Process Engineering Supply Chain Management Purchasing Materials Management Six Sigma Management Project Management Business Process Manufacturing Engineering Lean Manufacturing Leadership Kaizen Training Engineering Management Semiconductors Data Analysis Supply Chain Cross-functional Team... Business Analysis Industrial Engineering Program Management SPC See 9+     See less Education Universidad de Costa Rica Licenciatura,  Industrial Engineering - Licensed 1999 High School Licentiate degree,  Industrial Engineering 1987  – 1991 Universidad de Costa Rica Licenciatura,  Industrial Engineering - Licensed 1999 Universidad de Costa Rica Licenciatura,  Industrial Engineering - Licensed 1999 Universidad de Costa Rica Licenciatura,  Industrial Engineering - Licensed 1999 High School Licentiate degree,  Industrial Engineering 1987  – 1991 High School Licentiate degree,  Industrial Engineering 1987  – 1991 High School Licentiate degree,  Industrial Engineering 1987  – 1991 ", "Summary ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. Summary ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. Experience Training Manager Intel Corporation January 2014  – Present (1 year 8 months) Folsom, California I currently manage the Learning and Development team for the Software and Services Group at Intel Corporation. We deliver learning solutions focused on technical training, technical leadership development, as well as manager and leadership development to over 5,000 globally dispersed software engineers. Technical Training Program Manager Intel Corporation June 2012  –  December 2013  (1 year 7 months) Folsom, California Responsible for developing and executing technical training and technical leadership development strategy for over 5,000 globally-dispersed software engineers at Intel Corporation. \n \nIn this role, I partnered with key stakeholders from various divisions to implement a blended learning approach with instructor-led and virtual training by internal subject matter experts, as well as external training vendors. In addition, I incorporated technical summits, web-based solutions and social learning solutions such as podcasts and blogging. Learning Technologist - Visual & Parallel Computing Group Intel Corporation September 2008  –  May 2012  (3 years 9 months) Folsom, California Responsible for Technical Training, Technical Leadership Development and Technical Events for 3,500 globally dispersed team of visual & parallel computing engineers. \n \nIn this role, I develop the strategy and implement appropriate learning interventions such as instructor-led training by internal subject matter experts, vendor-led training solutions, technical summits, video and web-based solutions, as well as social learning solutions. Training Account Manager - Mobility Group Intel Corporation October 2006  –  September 2008  (2 years) Folsom, California Developed Training Strategy and Programs, including new hire integration and technical training programs in the areas of Graphics Engineering, I/O and Chipset Training. \n \nDevelop appropriate learning interventions such as instructor-led training, vendor training, eLearning or podcasting solutions. Recruiting, New Hire Integration & Training Program Manager - Software Engineering Group Intel Corporation February 2004  –  September 2006  (2 years 8 months) Folsom, California Developed recruiting strategy for Interns, Recent College Graduates and Experienced software engineering candidates. \nManaged and coordinated recruitment efforts at College and Industry events. \nDeveloped new hire integration strategy and programs \nEstablished technical training strategy and programs, including internal technical training and external vendor training for software engineers. Training Program Manager - Information Technology Group Intel Corporation February 2002  –  January 2004  (2 years) Folsom, California Managed development, deployment and maintenance of 350 training courses \nDeveloped and reported training indicators; recommended corrective actions for improvements to training program Recruiting & New Hire Integration Manager - eBusiness Group Intel Corporation August 2000  –  January 2002  (1 year 6 months) Folsom, California Responsible for recruiting and new hire integration strategy for globally dispersed eBusiness Group. Training Manager Intel Corporation January 2014  – Present (1 year 8 months) Folsom, California I currently manage the Learning and Development team for the Software and Services Group at Intel Corporation. We deliver learning solutions focused on technical training, technical leadership development, as well as manager and leadership development to over 5,000 globally dispersed software engineers. Training Manager Intel Corporation January 2014  – Present (1 year 8 months) Folsom, California I currently manage the Learning and Development team for the Software and Services Group at Intel Corporation. We deliver learning solutions focused on technical training, technical leadership development, as well as manager and leadership development to over 5,000 globally dispersed software engineers. Technical Training Program Manager Intel Corporation June 2012  –  December 2013  (1 year 7 months) Folsom, California Responsible for developing and executing technical training and technical leadership development strategy for over 5,000 globally-dispersed software engineers at Intel Corporation. \n \nIn this role, I partnered with key stakeholders from various divisions to implement a blended learning approach with instructor-led and virtual training by internal subject matter experts, as well as external training vendors. In addition, I incorporated technical summits, web-based solutions and social learning solutions such as podcasts and blogging. Technical Training Program Manager Intel Corporation June 2012  –  December 2013  (1 year 7 months) Folsom, California Responsible for developing and executing technical training and technical leadership development strategy for over 5,000 globally-dispersed software engineers at Intel Corporation. \n \nIn this role, I partnered with key stakeholders from various divisions to implement a blended learning approach with instructor-led and virtual training by internal subject matter experts, as well as external training vendors. In addition, I incorporated technical summits, web-based solutions and social learning solutions such as podcasts and blogging. Learning Technologist - Visual & Parallel Computing Group Intel Corporation September 2008  –  May 2012  (3 years 9 months) Folsom, California Responsible for Technical Training, Technical Leadership Development and Technical Events for 3,500 globally dispersed team of visual & parallel computing engineers. \n \nIn this role, I develop the strategy and implement appropriate learning interventions such as instructor-led training by internal subject matter experts, vendor-led training solutions, technical summits, video and web-based solutions, as well as social learning solutions. Learning Technologist - Visual & Parallel Computing Group Intel Corporation September 2008  –  May 2012  (3 years 9 months) Folsom, California Responsible for Technical Training, Technical Leadership Development and Technical Events for 3,500 globally dispersed team of visual & parallel computing engineers. \n \nIn this role, I develop the strategy and implement appropriate learning interventions such as instructor-led training by internal subject matter experts, vendor-led training solutions, technical summits, video and web-based solutions, as well as social learning solutions. Training Account Manager - Mobility Group Intel Corporation October 2006  –  September 2008  (2 years) Folsom, California Developed Training Strategy and Programs, including new hire integration and technical training programs in the areas of Graphics Engineering, I/O and Chipset Training. \n \nDevelop appropriate learning interventions such as instructor-led training, vendor training, eLearning or podcasting solutions. Training Account Manager - Mobility Group Intel Corporation October 2006  –  September 2008  (2 years) Folsom, California Developed Training Strategy and Programs, including new hire integration and technical training programs in the areas of Graphics Engineering, I/O and Chipset Training. \n \nDevelop appropriate learning interventions such as instructor-led training, vendor training, eLearning or podcasting solutions. Recruiting, New Hire Integration & Training Program Manager - Software Engineering Group Intel Corporation February 2004  –  September 2006  (2 years 8 months) Folsom, California Developed recruiting strategy for Interns, Recent College Graduates and Experienced software engineering candidates. \nManaged and coordinated recruitment efforts at College and Industry events. \nDeveloped new hire integration strategy and programs \nEstablished technical training strategy and programs, including internal technical training and external vendor training for software engineers. Recruiting, New Hire Integration & Training Program Manager - Software Engineering Group Intel Corporation February 2004  –  September 2006  (2 years 8 months) Folsom, California Developed recruiting strategy for Interns, Recent College Graduates and Experienced software engineering candidates. \nManaged and coordinated recruitment efforts at College and Industry events. \nDeveloped new hire integration strategy and programs \nEstablished technical training strategy and programs, including internal technical training and external vendor training for software engineers. Training Program Manager - Information Technology Group Intel Corporation February 2002  –  January 2004  (2 years) Folsom, California Managed development, deployment and maintenance of 350 training courses \nDeveloped and reported training indicators; recommended corrective actions for improvements to training program Training Program Manager - Information Technology Group Intel Corporation February 2002  –  January 2004  (2 years) Folsom, California Managed development, deployment and maintenance of 350 training courses \nDeveloped and reported training indicators; recommended corrective actions for improvements to training program Recruiting & New Hire Integration Manager - eBusiness Group Intel Corporation August 2000  –  January 2002  (1 year 6 months) Folsom, California Responsible for recruiting and new hire integration strategy for globally dispersed eBusiness Group. Recruiting & New Hire Integration Manager - eBusiness Group Intel Corporation August 2000  –  January 2002  (1 year 6 months) Folsom, California Responsible for recruiting and new hire integration strategy for globally dispersed eBusiness Group. Languages Spanish Spanish Spanish Skills Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Skills  Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Education University of Phoenix MBA,  Global Management 2002  – 2005 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 University of Phoenix MBA,  Global Management 2002  – 2005 University of Phoenix MBA,  Global Management 2002  – 2005 University of Phoenix MBA,  Global Management 2002  – 2005 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 "]}