{"position": "Training Manager", "company": "Intel Corporation", "profiles": ["Experience Training Manager Intel Corporation Training Manager Intel Corporation Training Manager Intel Corporation Education Waubonsee Community College Waubonsee Community College Waubonsee Community College Waubonsee Community College ", "Skills Demand Generation Mobile Marketing Marketing Product Marketing Strategic Partnerships Product Management Go-to-market Strategy Marketing Strategy Competitive Analysis Management Mobile Devices Product Development Skills  Demand Generation Mobile Marketing Marketing Product Marketing Strategic Partnerships Product Management Go-to-market Strategy Marketing Strategy Competitive Analysis Management Mobile Devices Product Development Demand Generation Mobile Marketing Marketing Product Marketing Strategic Partnerships Product Management Go-to-market Strategy Marketing Strategy Competitive Analysis Management Mobile Devices Product Development Demand Generation Mobile Marketing Marketing Product Marketing Strategic Partnerships Product Management Go-to-market Strategy Marketing Strategy Competitive Analysis Management Mobile Devices Product Development Honors & Awards Intel Achievement Award Intel 2003 For defining the brand and campaign strategy for Intel Centrino mobile technology  Intel Achievement Award Intel 2003 For defining the brand and campaign strategy for Intel Centrino mobile technology  Intel Achievement Award Intel 2003 For defining the brand and campaign strategy for Intel Centrino mobile technology  Intel Achievement Award Intel 2003 For defining the brand and campaign strategy for Intel Centrino mobile technology  ", "Experience Training Manager Intel Corporation Training Manager Intel Corporation Training Manager Intel Corporation ", "Experience Technical Training Manager Intel Corporation, Chengdu January 2010  – Present (5 years 8 months) Technical training engineer Intel Corporation April 2006  –  December 2009  (3 years 9 months) Technical Training Manager Intel Corporation, Chengdu January 2010  – Present (5 years 8 months) Technical Training Manager Intel Corporation, Chengdu January 2010  – Present (5 years 8 months) Technical training engineer Intel Corporation April 2006  –  December 2009  (3 years 9 months) Technical training engineer Intel Corporation April 2006  –  December 2009  (3 years 9 months) Skills Training Delivery People Development engineering background Skills  Training Delivery People Development engineering background Training Delivery People Development engineering background Training Delivery People Development engineering background Education University of Electronic Science and Technology Master's degree,  Telecommunications Engineering 2003  – 2006 Chongqing University of Post and Telecommunications Bachelor's degree,  Management Information Systems , General 1999  – 2003 University of Electronic Science and Technology Master's degree,  Telecommunications Engineering 2003  – 2006 University of Electronic Science and Technology Master's degree,  Telecommunications Engineering 2003  – 2006 University of Electronic Science and Technology Master's degree,  Telecommunications Engineering 2003  – 2006 Chongqing University of Post and Telecommunications Bachelor's degree,  Management Information Systems , General 1999  – 2003 Chongqing University of Post and Telecommunications Bachelor's degree,  Management Information Systems , General 1999  – 2003 Chongqing University of Post and Telecommunications Bachelor's degree,  Management Information Systems , General 1999  – 2003 ", "Skills Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy Skills  Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy ", "Experience Training Manager Intel Corporation June 2011  – Present (4 years 3 months) Taiwan Human Resources Manager Schneider Electric November 2010  –  June 2011  (8 months) Delivery Readiness Manager Hewlett-Packard March 2005  –  October 2010  (5 years 8 months) Special Assistant to Chairman Ulead Systems June 2002  –  March 2005  (2 years 10 months) Training Manager Intel Corporation June 2011  – Present (4 years 3 months) Taiwan Training Manager Intel Corporation June 2011  – Present (4 years 3 months) Taiwan Human Resources Manager Schneider Electric November 2010  –  June 2011  (8 months) Human Resources Manager Schneider Electric November 2010  –  June 2011  (8 months) Delivery Readiness Manager Hewlett-Packard March 2005  –  October 2010  (5 years 8 months) Delivery Readiness Manager Hewlett-Packard March 2005  –  October 2010  (5 years 8 months) Special Assistant to Chairman Ulead Systems June 2002  –  March 2005  (2 years 10 months) Special Assistant to Chairman Ulead Systems June 2002  –  March 2005  (2 years 10 months) Skills Employee Engagement Talent Acquisition Talent Management Performance Management Change Management Organizational... Skills  Employee Engagement Talent Acquisition Talent Management Performance Management Change Management Organizational... Employee Engagement Talent Acquisition Talent Management Performance Management Change Management Organizational... Employee Engagement Talent Acquisition Talent Management Performance Management Change Management Organizational... Education Baruch College, City University of New York (CUNY) Master,  Human Resources Management 2004  – 2006 Baruch College, City University of New York (CUNY) Master,  Human Resources Management 2004  – 2006 Baruch College, City University of New York (CUNY) Master,  Human Resources Management 2004  – 2006 Baruch College, City University of New York (CUNY) Master,  Human Resources Management 2004  – 2006 ", "Languages English Native or bilingual proficiency French Professional working proficiency German Elementary proficiency English Native or bilingual proficiency French Professional working proficiency German Elementary proficiency English Native or bilingual proficiency French Professional working proficiency German Elementary proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Program Management Management Technology Needs... Social Media Editing Strategic Planning Project Management Strategy Public Relations Event Planning Training Organizational... Event Management Entrepreneurship Coaching Change Management Management Consulting Non-profits Recruiting Motivational Speaking Nonprofits See 6+     See less Skills  Program Management Management Technology Needs... Social Media Editing Strategic Planning Project Management Strategy Public Relations Event Planning Training Organizational... Event Management Entrepreneurship Coaching Change Management Management Consulting Non-profits Recruiting Motivational Speaking Nonprofits See 6+     See less Program Management Management Technology Needs... Social Media Editing Strategic Planning Project Management Strategy Public Relations Event Planning Training Organizational... Event Management Entrepreneurship Coaching Change Management Management Consulting Non-profits Recruiting Motivational Speaking Nonprofits See 6+     See less Program Management Management Technology Needs... Social Media Editing Strategic Planning Project Management Strategy Public Relations Event Planning Training Organizational... Event Management Entrepreneurship Coaching Change Management Management Consulting Non-profits Recruiting Motivational Speaking Nonprofits See 6+     See less Honors & Awards ", "Skills Business Planning Skills  Business Planning Business Planning Business Planning ", "Experience Brand and Training Manager Intel Corporation March 2015  – Present (6 months) SAM Microsoft August 2013  –  March 2015  (1 year 8 months) Dublin Software Asset Management consultant to small and medium business' in Ireland Regional Account Manager (West Midlands) Dell February 2013  –  August 2013  (7 months) Dublin Regional Account Manager (South London) Dell November 2011  –  August 2012  (10 months) Dublin Responsible for a number of customers in the South London region covering the postcodes BR,CR,KT,SE,SM,SW and TW. Account Manager Dell August 2008  –  March 2012  (3 years 8 months) Business Acquisitions Dell March 2007  –  August 2008  (1 year 6 months) Assistant Store Manager Vodafone Retail November 2004  –  November 2006  (2 years 1 month) Brand and Training Manager Intel Corporation March 2015  – Present (6 months) Brand and Training Manager Intel Corporation March 2015  – Present (6 months) SAM Microsoft August 2013  –  March 2015  (1 year 8 months) Dublin Software Asset Management consultant to small and medium business' in Ireland SAM Microsoft August 2013  –  March 2015  (1 year 8 months) Dublin Software Asset Management consultant to small and medium business' in Ireland Regional Account Manager (West Midlands) Dell February 2013  –  August 2013  (7 months) Dublin Regional Account Manager (West Midlands) Dell February 2013  –  August 2013  (7 months) Dublin Regional Account Manager (South London) Dell November 2011  –  August 2012  (10 months) Dublin Responsible for a number of customers in the South London region covering the postcodes BR,CR,KT,SE,SM,SW and TW. Regional Account Manager (South London) Dell November 2011  –  August 2012  (10 months) Dublin Responsible for a number of customers in the South London region covering the postcodes BR,CR,KT,SE,SM,SW and TW. Account Manager Dell August 2008  –  March 2012  (3 years 8 months) Account Manager Dell August 2008  –  March 2012  (3 years 8 months) Business Acquisitions Dell March 2007  –  August 2008  (1 year 6 months) Business Acquisitions Dell March 2007  –  August 2008  (1 year 6 months) Assistant Store Manager Vodafone Retail November 2004  –  November 2006  (2 years 1 month) Assistant Store Manager Vodafone Retail November 2004  –  November 2006  (2 years 1 month) Skills Salesforce.com Solution Selling Account Management Direct Sales Sales Management Business Analytics Managed Services CRM Key Account Management New Business Development Sales Process Enterprise Software SaaS Professional Services Cloud Computing Channel Partners Pre-sales Storage Go-to-market Strategy Software Industry See 5+     See less Skills  Salesforce.com Solution Selling Account Management Direct Sales Sales Management Business Analytics Managed Services CRM Key Account Management New Business Development Sales Process Enterprise Software SaaS Professional Services Cloud Computing Channel Partners Pre-sales Storage Go-to-market Strategy Software Industry See 5+     See less Salesforce.com Solution Selling Account Management Direct Sales Sales Management Business Analytics Managed Services CRM Key Account Management New Business Development Sales Process Enterprise Software SaaS Professional Services Cloud Computing Channel Partners Pre-sales Storage Go-to-market Strategy Software Industry See 5+     See less Salesforce.com Solution Selling Account Management Direct Sales Sales Management Business Analytics Managed Services CRM Key Account Management New Business Development Sales Process Enterprise Software SaaS Professional Services Cloud Computing Channel Partners Pre-sales Storage Go-to-market Strategy Software Industry See 5+     See less Education Institute of Technology, Tallaght Mechanical Engineering 2000  – 2001 Mechanical Engineering St. Killians 1996  – 2000 Studied for Junior and Leaving Cert Activities and Societies:  Basketball ,  Adult Education volunteer Institute of Technology, Tallaght Mechanical Engineering 2000  – 2001 Mechanical Engineering Institute of Technology, Tallaght Mechanical Engineering 2000  – 2001 Mechanical Engineering Institute of Technology, Tallaght Mechanical Engineering 2000  – 2001 Mechanical Engineering St. Killians 1996  – 2000 Studied for Junior and Leaving Cert Activities and Societies:  Basketball ,  Adult Education volunteer St. Killians 1996  – 2000 Studied for Junior and Leaving Cert Activities and Societies:  Basketball ,  Adult Education volunteer St. Killians 1996  – 2000 Studied for Junior and Leaving Cert Activities and Societies:  Basketball ,  Adult Education volunteer ", "Summary ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. Summary ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. ASTD certified Human Performance Improvement professional focused on understanding an organization's challenges and then providing the appropriate learning solutions to address those challenges. Specializing in technical training and technical leadership development solutions for globally dispersed engineering teams. Experience Training Manager Intel Corporation January 2014  – Present (1 year 8 months) Folsom, California I currently manage the Learning and Development team for the Software and Services Group at Intel Corporation. We deliver learning solutions focused on technical training, technical leadership development, as well as manager and leadership development to over 5,000 globally dispersed software engineers. Technical Training Program Manager Intel Corporation June 2012  –  December 2013  (1 year 7 months) Folsom, California Responsible for developing and executing technical training and technical leadership development strategy for over 5,000 globally-dispersed software engineers at Intel Corporation. \n \nIn this role, I partnered with key stakeholders from various divisions to implement a blended learning approach with instructor-led and virtual training by internal subject matter experts, as well as external training vendors. In addition, I incorporated technical summits, web-based solutions and social learning solutions such as podcasts and blogging. Learning Technologist - Visual & Parallel Computing Group Intel Corporation September 2008  –  May 2012  (3 years 9 months) Folsom, California Responsible for Technical Training, Technical Leadership Development and Technical Events for 3,500 globally dispersed team of visual & parallel computing engineers. \n \nIn this role, I develop the strategy and implement appropriate learning interventions such as instructor-led training by internal subject matter experts, vendor-led training solutions, technical summits, video and web-based solutions, as well as social learning solutions. Training Account Manager - Mobility Group Intel Corporation October 2006  –  September 2008  (2 years) Folsom, California Developed Training Strategy and Programs, including new hire integration and technical training programs in the areas of Graphics Engineering, I/O and Chipset Training. \n \nDevelop appropriate learning interventions such as instructor-led training, vendor training, eLearning or podcasting solutions. Recruiting, New Hire Integration & Training Program Manager - Software Engineering Group Intel Corporation February 2004  –  September 2006  (2 years 8 months) Folsom, California Developed recruiting strategy for Interns, Recent College Graduates and Experienced software engineering candidates. \nManaged and coordinated recruitment efforts at College and Industry events. \nDeveloped new hire integration strategy and programs \nEstablished technical training strategy and programs, including internal technical training and external vendor training for software engineers. Training Program Manager - Information Technology Group Intel Corporation February 2002  –  January 2004  (2 years) Folsom, California Managed development, deployment and maintenance of 350 training courses \nDeveloped and reported training indicators; recommended corrective actions for improvements to training program Recruiting & New Hire Integration Manager - eBusiness Group Intel Corporation August 2000  –  January 2002  (1 year 6 months) Folsom, California Responsible for recruiting and new hire integration strategy for globally dispersed eBusiness Group. Training Manager Intel Corporation January 2014  – Present (1 year 8 months) Folsom, California I currently manage the Learning and Development team for the Software and Services Group at Intel Corporation. We deliver learning solutions focused on technical training, technical leadership development, as well as manager and leadership development to over 5,000 globally dispersed software engineers. Training Manager Intel Corporation January 2014  – Present (1 year 8 months) Folsom, California I currently manage the Learning and Development team for the Software and Services Group at Intel Corporation. We deliver learning solutions focused on technical training, technical leadership development, as well as manager and leadership development to over 5,000 globally dispersed software engineers. Technical Training Program Manager Intel Corporation June 2012  –  December 2013  (1 year 7 months) Folsom, California Responsible for developing and executing technical training and technical leadership development strategy for over 5,000 globally-dispersed software engineers at Intel Corporation. \n \nIn this role, I partnered with key stakeholders from various divisions to implement a blended learning approach with instructor-led and virtual training by internal subject matter experts, as well as external training vendors. In addition, I incorporated technical summits, web-based solutions and social learning solutions such as podcasts and blogging. Technical Training Program Manager Intel Corporation June 2012  –  December 2013  (1 year 7 months) Folsom, California Responsible for developing and executing technical training and technical leadership development strategy for over 5,000 globally-dispersed software engineers at Intel Corporation. \n \nIn this role, I partnered with key stakeholders from various divisions to implement a blended learning approach with instructor-led and virtual training by internal subject matter experts, as well as external training vendors. In addition, I incorporated technical summits, web-based solutions and social learning solutions such as podcasts and blogging. Learning Technologist - Visual & Parallel Computing Group Intel Corporation September 2008  –  May 2012  (3 years 9 months) Folsom, California Responsible for Technical Training, Technical Leadership Development and Technical Events for 3,500 globally dispersed team of visual & parallel computing engineers. \n \nIn this role, I develop the strategy and implement appropriate learning interventions such as instructor-led training by internal subject matter experts, vendor-led training solutions, technical summits, video and web-based solutions, as well as social learning solutions. Learning Technologist - Visual & Parallel Computing Group Intel Corporation September 2008  –  May 2012  (3 years 9 months) Folsom, California Responsible for Technical Training, Technical Leadership Development and Technical Events for 3,500 globally dispersed team of visual & parallel computing engineers. \n \nIn this role, I develop the strategy and implement appropriate learning interventions such as instructor-led training by internal subject matter experts, vendor-led training solutions, technical summits, video and web-based solutions, as well as social learning solutions. Training Account Manager - Mobility Group Intel Corporation October 2006  –  September 2008  (2 years) Folsom, California Developed Training Strategy and Programs, including new hire integration and technical training programs in the areas of Graphics Engineering, I/O and Chipset Training. \n \nDevelop appropriate learning interventions such as instructor-led training, vendor training, eLearning or podcasting solutions. Training Account Manager - Mobility Group Intel Corporation October 2006  –  September 2008  (2 years) Folsom, California Developed Training Strategy and Programs, including new hire integration and technical training programs in the areas of Graphics Engineering, I/O and Chipset Training. \n \nDevelop appropriate learning interventions such as instructor-led training, vendor training, eLearning or podcasting solutions. Recruiting, New Hire Integration & Training Program Manager - Software Engineering Group Intel Corporation February 2004  –  September 2006  (2 years 8 months) Folsom, California Developed recruiting strategy for Interns, Recent College Graduates and Experienced software engineering candidates. \nManaged and coordinated recruitment efforts at College and Industry events. \nDeveloped new hire integration strategy and programs \nEstablished technical training strategy and programs, including internal technical training and external vendor training for software engineers. Recruiting, New Hire Integration & Training Program Manager - Software Engineering Group Intel Corporation February 2004  –  September 2006  (2 years 8 months) Folsom, California Developed recruiting strategy for Interns, Recent College Graduates and Experienced software engineering candidates. \nManaged and coordinated recruitment efforts at College and Industry events. \nDeveloped new hire integration strategy and programs \nEstablished technical training strategy and programs, including internal technical training and external vendor training for software engineers. Training Program Manager - Information Technology Group Intel Corporation February 2002  –  January 2004  (2 years) Folsom, California Managed development, deployment and maintenance of 350 training courses \nDeveloped and reported training indicators; recommended corrective actions for improvements to training program Training Program Manager - Information Technology Group Intel Corporation February 2002  –  January 2004  (2 years) Folsom, California Managed development, deployment and maintenance of 350 training courses \nDeveloped and reported training indicators; recommended corrective actions for improvements to training program Recruiting & New Hire Integration Manager - eBusiness Group Intel Corporation August 2000  –  January 2002  (1 year 6 months) Folsom, California Responsible for recruiting and new hire integration strategy for globally dispersed eBusiness Group. Recruiting & New Hire Integration Manager - eBusiness Group Intel Corporation August 2000  –  January 2002  (1 year 6 months) Folsom, California Responsible for recruiting and new hire integration strategy for globally dispersed eBusiness Group. Languages Spanish Spanish Spanish Skills Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Skills  Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Blended Learning Technical Training Performance Improvement Needs Analysis Instructor-led Training Instructional Design ADDIE Learning Management Performance Consulting Program Management Talent Management E-Learning Onboarding Recruiting Training Delivery Strategy Training Leadership Organizational... Project Management See 5+     See less Education University of Phoenix MBA,  Global Management 2002  – 2005 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 University of Phoenix MBA,  Global Management 2002  – 2005 University of Phoenix MBA,  Global Management 2002  – 2005 University of Phoenix MBA,  Global Management 2002  – 2005 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Science,  Biology 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 Arizona State University Bachelor of Arts,  Spanish 1989  – 1994 ", "Skills SoC Product Management Embedded Systems Strategic Partnerships Semiconductors Wireless System Architecture Processors Program Management Skills  SoC Product Management Embedded Systems Strategic Partnerships Semiconductors Wireless System Architecture Processors Program Management SoC Product Management Embedded Systems Strategic Partnerships Semiconductors Wireless System Architecture Processors Program Management SoC Product Management Embedded Systems Strategic Partnerships Semiconductors Wireless System Architecture Processors Program Management ", "Experience Implementation Lead and Account Manager Fulfillment Corporation of America, a Source Logistics Company March 2013  – Present (2 years 6 months) Beaverton, OR Implementation Lead: \nResponsible for executing implementation process of new clients and existing clients with new programs. \n\tManage internal and customer expectations based on joint established timelines and Statement of Work \n\tLiaison between client and internal groups – Management, IT, Operations teams \n\tCreated project documentation to streamline implementation of new clients \n\tTrack all communications and provide regular updates to internal teams \n\tResponsible for every set-up detail within IT, Fulfillment, Warehouse and Customer Service teams \n \nAccount Management: \nResponsible for two of the top three clients, including national accounts, for all aspects of account management. Also supports multiple smaller accounts. \n\tPrimary liaison for internal groups and clients, ensuring both party’s real-time needs communicated and met: IT, digital, fulfillment, warehouse \n\tInitiated profitability analysis of clients, comparing labor hours against contract \n\tGenerated training proposal for senior management to design a company-wide training program, emphasizing functional cross training within and across departments \n\tGenerated proposal for senior management to assign a dedicated resource to manage the implementation process for new clients  \n\tGenerates monthly invoices for all accounts owned, supports other account managers in billing as necessary \n Sales & Logistics SolarWorld February 2011  – Present (4 years 7 months) Hillsboro, Oregon Sold over 1/2 million dollars of solar materials in less than 3 months \n•Created & executed change for internal shipping communication  \n•Documented processes within Logistics Department \n•Created formal Terms and Conditions for non-module sales \n•Responsible for all domestic shipments of solar modules \n•Intercompany sales of solar modules, cells, and wafers \n•General logistics administrative support Office Manager Compassion Ministries September 2009  –  February 2011  (1 year 6 months) •Direct responsibility for all aspects of banking, including paying bills, deposits, payroll (through Paychex), monthly reconciliation, and annual tax letters. \n•Back-up position with order fulfillment and donations. \n•Maintain company website updates \n•Responsible for meeting customer needs, including donations and order fulfillment. \n•Handled logistics for two fundraiser dinners \n•Created a catalog of 1100-plus products (primarily audio messages and books). \n•Created and set up books using QuickBooks \n•Assisted in key projects such as a Compassion Ministries sponsored trip to Israel Sales, Training & Program Management Intel Corporation May 1995  –  April 2001  (6 years) Hillsboro, Oregon SMG Learning Solutions Worldwide, Product Training Manager, Intel Corporation \n \nProduct Training strategist and influencer for the newly formed group, the Communications & Embedded Silicon Sales Group (CESSG), which primarily consisted of new business acquisitions. \n\tConducted needs assessments with senior management and field to identify training gaps \n\tDrove worldwide training steering committee consisting of senior management within sales, marketing, and product divisions to ensure successful immersion of newly acquired companies  \n\tPublished training usage models (Best Known Methods) document and implemented worldwide \n\tProgram manager for core team planning CESSG’s first worldwide, face-to-face training events \n\tSuccessfully influenced both field and division management to utilize training tools specific to the appropriate audience and gained buy-in to implement in the field \n\tExecuted merger and acquisition communications within SMG Learning Solutions \n North America Channel Training Manager, Intel Corporation Intel Corporation May 1995  –  April 2001  (6 years) Hillsboro, Oregon North America Channel Training Manager, Intel Corporation \nOrganized, facilitated, and implemented Intel’s preeminent training event for 7,000 resellers in the United States and Canada. \n\tResponsible for 2 million dollar budget \n\tCreated 30-page roles and responsibilities document \n\tManaged communications to all Intel field and business units \n\tInfluenced content development to ensure customer needs met \n\tSecured 3rd party vendors and distributor participation \n\tNegotiated and secured all logistics (hotels, audio-visual, systems, shipping) \n\tInfluenced and secured participation of Intel executives \n Implementation Lead and Account Manager Fulfillment Corporation of America, a Source Logistics Company March 2013  – Present (2 years 6 months) Beaverton, OR Implementation Lead: \nResponsible for executing implementation process of new clients and existing clients with new programs. \n\tManage internal and customer expectations based on joint established timelines and Statement of Work \n\tLiaison between client and internal groups – Management, IT, Operations teams \n\tCreated project documentation to streamline implementation of new clients \n\tTrack all communications and provide regular updates to internal teams \n\tResponsible for every set-up detail within IT, Fulfillment, Warehouse and Customer Service teams \n \nAccount Management: \nResponsible for two of the top three clients, including national accounts, for all aspects of account management. Also supports multiple smaller accounts. \n\tPrimary liaison for internal groups and clients, ensuring both party’s real-time needs communicated and met: IT, digital, fulfillment, warehouse \n\tInitiated profitability analysis of clients, comparing labor hours against contract \n\tGenerated training proposal for senior management to design a company-wide training program, emphasizing functional cross training within and across departments \n\tGenerated proposal for senior management to assign a dedicated resource to manage the implementation process for new clients  \n\tGenerates monthly invoices for all accounts owned, supports other account managers in billing as necessary \n Implementation Lead and Account Manager Fulfillment Corporation of America, a Source Logistics Company March 2013  – Present (2 years 6 months) Beaverton, OR Implementation Lead: \nResponsible for executing implementation process of new clients and existing clients with new programs. \n\tManage internal and customer expectations based on joint established timelines and Statement of Work \n\tLiaison between client and internal groups – Management, IT, Operations teams \n\tCreated project documentation to streamline implementation of new clients \n\tTrack all communications and provide regular updates to internal teams \n\tResponsible for every set-up detail within IT, Fulfillment, Warehouse and Customer Service teams \n \nAccount Management: \nResponsible for two of the top three clients, including national accounts, for all aspects of account management. Also supports multiple smaller accounts. \n\tPrimary liaison for internal groups and clients, ensuring both party’s real-time needs communicated and met: IT, digital, fulfillment, warehouse \n\tInitiated profitability analysis of clients, comparing labor hours against contract \n\tGenerated training proposal for senior management to design a company-wide training program, emphasizing functional cross training within and across departments \n\tGenerated proposal for senior management to assign a dedicated resource to manage the implementation process for new clients  \n\tGenerates monthly invoices for all accounts owned, supports other account managers in billing as necessary \n Sales & Logistics SolarWorld February 2011  – Present (4 years 7 months) Hillsboro, Oregon Sold over 1/2 million dollars of solar materials in less than 3 months \n•Created & executed change for internal shipping communication  \n•Documented processes within Logistics Department \n•Created formal Terms and Conditions for non-module sales \n•Responsible for all domestic shipments of solar modules \n•Intercompany sales of solar modules, cells, and wafers \n•General logistics administrative support Sales & Logistics SolarWorld February 2011  – Present (4 years 7 months) Hillsboro, Oregon Sold over 1/2 million dollars of solar materials in less than 3 months \n•Created & executed change for internal shipping communication  \n•Documented processes within Logistics Department \n•Created formal Terms and Conditions for non-module sales \n•Responsible for all domestic shipments of solar modules \n•Intercompany sales of solar modules, cells, and wafers \n•General logistics administrative support Office Manager Compassion Ministries September 2009  –  February 2011  (1 year 6 months) •Direct responsibility for all aspects of banking, including paying bills, deposits, payroll (through Paychex), monthly reconciliation, and annual tax letters. \n•Back-up position with order fulfillment and donations. \n•Maintain company website updates \n•Responsible for meeting customer needs, including donations and order fulfillment. \n•Handled logistics for two fundraiser dinners \n•Created a catalog of 1100-plus products (primarily audio messages and books). \n•Created and set up books using QuickBooks \n•Assisted in key projects such as a Compassion Ministries sponsored trip to Israel Office Manager Compassion Ministries September 2009  –  February 2011  (1 year 6 months) •Direct responsibility for all aspects of banking, including paying bills, deposits, payroll (through Paychex), monthly reconciliation, and annual tax letters. \n•Back-up position with order fulfillment and donations. \n•Maintain company website updates \n•Responsible for meeting customer needs, including donations and order fulfillment. \n•Handled logistics for two fundraiser dinners \n•Created a catalog of 1100-plus products (primarily audio messages and books). \n•Created and set up books using QuickBooks \n•Assisted in key projects such as a Compassion Ministries sponsored trip to Israel Sales, Training & Program Management Intel Corporation May 1995  –  April 2001  (6 years) Hillsboro, Oregon SMG Learning Solutions Worldwide, Product Training Manager, Intel Corporation \n \nProduct Training strategist and influencer for the newly formed group, the Communications & Embedded Silicon Sales Group (CESSG), which primarily consisted of new business acquisitions. \n\tConducted needs assessments with senior management and field to identify training gaps \n\tDrove worldwide training steering committee consisting of senior management within sales, marketing, and product divisions to ensure successful immersion of newly acquired companies  \n\tPublished training usage models (Best Known Methods) document and implemented worldwide \n\tProgram manager for core team planning CESSG’s first worldwide, face-to-face training events \n\tSuccessfully influenced both field and division management to utilize training tools specific to the appropriate audience and gained buy-in to implement in the field \n\tExecuted merger and acquisition communications within SMG Learning Solutions \n Sales, Training & Program Management Intel Corporation May 1995  –  April 2001  (6 years) Hillsboro, Oregon SMG Learning Solutions Worldwide, Product Training Manager, Intel Corporation \n \nProduct Training strategist and influencer for the newly formed group, the Communications & Embedded Silicon Sales Group (CESSG), which primarily consisted of new business acquisitions. \n\tConducted needs assessments with senior management and field to identify training gaps \n\tDrove worldwide training steering committee consisting of senior management within sales, marketing, and product divisions to ensure successful immersion of newly acquired companies  \n\tPublished training usage models (Best Known Methods) document and implemented worldwide \n\tProgram manager for core team planning CESSG’s first worldwide, face-to-face training events \n\tSuccessfully influenced both field and division management to utilize training tools specific to the appropriate audience and gained buy-in to implement in the field \n\tExecuted merger and acquisition communications within SMG Learning Solutions \n North America Channel Training Manager, Intel Corporation Intel Corporation May 1995  –  April 2001  (6 years) Hillsboro, Oregon North America Channel Training Manager, Intel Corporation \nOrganized, facilitated, and implemented Intel’s preeminent training event for 7,000 resellers in the United States and Canada. \n\tResponsible for 2 million dollar budget \n\tCreated 30-page roles and responsibilities document \n\tManaged communications to all Intel field and business units \n\tInfluenced content development to ensure customer needs met \n\tSecured 3rd party vendors and distributor participation \n\tNegotiated and secured all logistics (hotels, audio-visual, systems, shipping) \n\tInfluenced and secured participation of Intel executives \n North America Channel Training Manager, Intel Corporation Intel Corporation May 1995  –  April 2001  (6 years) Hillsboro, Oregon North America Channel Training Manager, Intel Corporation \nOrganized, facilitated, and implemented Intel’s preeminent training event for 7,000 resellers in the United States and Canada. \n\tResponsible for 2 million dollar budget \n\tCreated 30-page roles and responsibilities document \n\tManaged communications to all Intel field and business units \n\tInfluenced content development to ensure customer needs met \n\tSecured 3rd party vendors and distributor participation \n\tNegotiated and secured all logistics (hotels, audio-visual, systems, shipping) \n\tInfluenced and secured participation of Intel executives \n Skills Logistics Sales Project Planning New Client... Management Program Management Communication Administrative... Customer Service Process Improvement Manufacturing Cross-functional Team... Start-ups Negotiation Skills  Logistics Sales Project Planning New Client... Management Program Management Communication Administrative... Customer Service Process Improvement Manufacturing Cross-functional Team... Start-ups Negotiation Logistics Sales Project Planning New Client... Management Program Management Communication Administrative... Customer Service Process Improvement Manufacturing Cross-functional Team... Start-ups Negotiation Logistics Sales Project Planning New Client... Management Program Management Communication Administrative... Customer Service Process Improvement Manufacturing Cross-functional Team... Start-ups Negotiation Education Portland Community College General Education Portland Community College General Education Portland Community College General Education Portland Community College General Education ", "Experience Enterprise Capability Training Manager Intel Corporation Enterprise Capability Training Manager Intel Corporation Enterprise Capability Training Manager Intel Corporation Skills Cross-functional Team... Process Improvement Blended Learning Program Management Intel Technical Marketing Performance Consulting User-centered Design Needs Analysis Organizational... Talent Management Instructor-led Training Team Management Learning Management Virtual Teams Skills  Cross-functional Team... Process Improvement Blended Learning Program Management Intel Technical Marketing Performance Consulting User-centered Design Needs Analysis Organizational... Talent Management Instructor-led Training Team Management Learning Management Virtual Teams Cross-functional Team... Process Improvement Blended Learning Program Management Intel Technical Marketing Performance Consulting User-centered Design Needs Analysis Organizational... Talent Management Instructor-led Training Team Management Learning Management Virtual Teams Cross-functional Team... Process Improvement Blended Learning Program Management Intel Technical Marketing Performance Consulting User-centered Design Needs Analysis Organizational... Talent Management Instructor-led Training Team Management Learning Management Virtual Teams ", "Skills Processors Program Management Intel Debugging Hardware Microprocessors Semiconductors Technical Marketing Training Testing Mobile Devices Skills  Processors Program Management Intel Debugging Hardware Microprocessors Semiconductors Technical Marketing Training Testing Mobile Devices Processors Program Management Intel Debugging Hardware Microprocessors Semiconductors Technical Marketing Training Testing Mobile Devices Processors Program Management Intel Debugging Hardware Microprocessors Semiconductors Technical Marketing Training Testing Mobile Devices ", "Experience Brand Training Manager Intel Corporation July 2008  – Present (7 years 2 months) I have been working with Intel Corporation as a Brand Development and Training manager since 2008. \nI basically handle Dell accounts and ensure that all there EMEA segments established in Hyderabad sell Intel products. \nMy role also includes selling and marketing of Intel products.Launching the new generation Intel cores every year on client and server products. \nI have been a key source to grow business for Intel from the Call Centre perspective. \nThe group that I influence my sales is to more 250 Sales people in Call centre. \nI also ensure that the Relationship between Dell and Intel is maintained in a smooth fashion which in return ensures smooth business between both the partners. \nThere are lots of road shows of products conducted every quarter which in return helps to grow the sales of various focussed products. \n \n \n Sales Manager Dell Computers 2003  –  2008  (5 years) Brand Training Manager Intel Corporation July 2008  – Present (7 years 2 months) I have been working with Intel Corporation as a Brand Development and Training manager since 2008. \nI basically handle Dell accounts and ensure that all there EMEA segments established in Hyderabad sell Intel products. \nMy role also includes selling and marketing of Intel products.Launching the new generation Intel cores every year on client and server products. \nI have been a key source to grow business for Intel from the Call Centre perspective. \nThe group that I influence my sales is to more 250 Sales people in Call centre. \nI also ensure that the Relationship between Dell and Intel is maintained in a smooth fashion which in return ensures smooth business between both the partners. \nThere are lots of road shows of products conducted every quarter which in return helps to grow the sales of various focussed products. \n \n \n Brand Training Manager Intel Corporation July 2008  – Present (7 years 2 months) I have been working with Intel Corporation as a Brand Development and Training manager since 2008. \nI basically handle Dell accounts and ensure that all there EMEA segments established in Hyderabad sell Intel products. \nMy role also includes selling and marketing of Intel products.Launching the new generation Intel cores every year on client and server products. \nI have been a key source to grow business for Intel from the Call Centre perspective. \nThe group that I influence my sales is to more 250 Sales people in Call centre. \nI also ensure that the Relationship between Dell and Intel is maintained in a smooth fashion which in return ensures smooth business between both the partners. \nThere are lots of road shows of products conducted every quarter which in return helps to grow the sales of various focussed products. \n \n \n Sales Manager Dell Computers 2003  –  2008  (5 years) Sales Manager Dell Computers 2003  –  2008  (5 years) Skills Team Management Solution Selling Sales Management Sales Operations Vendor Management Cross-functional Team... Direct Sales Branding or Product Marketing of the Product Training of the Products Launches and Roadshows Skills  Team Management Solution Selling Sales Management Sales Operations Vendor Management Cross-functional Team... Direct Sales Branding or Product Marketing of the Product Training of the Products Launches and Roadshows Team Management Solution Selling Sales Management Sales Operations Vendor Management Cross-functional Team... Direct Sales Branding or Product Marketing of the Product Training of the Products Launches and Roadshows Team Management Solution Selling Sales Management Sales Operations Vendor Management Cross-functional Team... Direct Sales Branding or Product Marketing of the Product Training of the Products Launches and Roadshows Education Regency College(Osmania University BHM 1998  – 2001 Convent of Jesus and Mary Baroda Bachelors of Hotel Management,  Sales and Marketing Operations/Marketing and Distribution 1984  – 1998 Regency College(Osmania University BHM 1998  – 2001 Regency College(Osmania University BHM 1998  – 2001 Regency College(Osmania University BHM 1998  – 2001 Convent of Jesus and Mary Baroda Bachelors of Hotel Management,  Sales and Marketing Operations/Marketing and Distribution 1984  – 1998 Convent of Jesus and Mary Baroda Bachelors of Hotel Management,  Sales and Marketing Operations/Marketing and Distribution 1984  – 1998 Convent of Jesus and Mary Baroda Bachelors of Hotel Management,  Sales and Marketing Operations/Marketing and Distribution 1984  – 1998 ", "Experience Regional Channel Training Manager Intel Corporation Regional Channel Training Manager Intel Corporation Regional Channel Training Manager Intel Corporation ", "Summary An accomplished communications and eBusiness professional with comprehensive experience in internal communications, marketing communications, product and service positioning, web design, development, and metrics.  \n \nExcel in developing processes and communications across global teams and multiple business units.  \n \nSpecialties: Communications: Internal communications, IT communications, communications planning, budget management, Print and online advertising, Direct marketing, Copywriting, Product public relations, Trade show management, trademarks and brands \n \neBusiness: Intranet and Web site creation and management, Transition and change management, User-centered design, eLearning  \n \nTraining: Online and instructor-led training, Sales training Summary An accomplished communications and eBusiness professional with comprehensive experience in internal communications, marketing communications, product and service positioning, web design, development, and metrics.  \n \nExcel in developing processes and communications across global teams and multiple business units.  \n \nSpecialties: Communications: Internal communications, IT communications, communications planning, budget management, Print and online advertising, Direct marketing, Copywriting, Product public relations, Trade show management, trademarks and brands \n \neBusiness: Intranet and Web site creation and management, Transition and change management, User-centered design, eLearning  \n \nTraining: Online and instructor-led training, Sales training An accomplished communications and eBusiness professional with comprehensive experience in internal communications, marketing communications, product and service positioning, web design, development, and metrics.  \n \nExcel in developing processes and communications across global teams and multiple business units.  \n \nSpecialties: Communications: Internal communications, IT communications, communications planning, budget management, Print and online advertising, Direct marketing, Copywriting, Product public relations, Trade show management, trademarks and brands \n \neBusiness: Intranet and Web site creation and management, Transition and change management, User-centered design, eLearning  \n \nTraining: Online and instructor-led training, Sales training An accomplished communications and eBusiness professional with comprehensive experience in internal communications, marketing communications, product and service positioning, web design, development, and metrics.  \n \nExcel in developing processes and communications across global teams and multiple business units.  \n \nSpecialties: Communications: Internal communications, IT communications, communications planning, budget management, Print and online advertising, Direct marketing, Copywriting, Product public relations, Trade show management, trademarks and brands \n \neBusiness: Intranet and Web site creation and management, Transition and change management, User-centered design, eLearning  \n \nTraining: Online and instructor-led training, Sales training Experience Marketing and Communications Legacy Health 2010  – Present (5 years) Portland, Oregon Area Plan, manage, and edit company-wide employee publication and publications for key employee groups. Manage company intranet. Plan and execute communications programs—including incentive programs, employee benefits, and company initiatives. Member of core project team implementing a new SharePoint-based employee intranet. President, Oregon chapter International Association of Business Communicators 2010  –  2013  (3 years) Portland, Oregon Area Co-president 2010-2012. Led local chapter of an international professional association for communications professionals. Grew membership, received Chapter Management Award of Excellence. \n \nVP Communications 2008-2010: Produced chapter e-newsletter. Managed chapter’s social media presence. Migrated website to Wordpress, initiated monitoring with Google Analytics. Internal Communications Manager Regence 2007  –  2009  (2 years) Planned and executed employee communications programs—via employee publications, video, intranet, and print. Interacted across multiple functional divisions and at all levels of management to ensure programs helped grow employee engagement.  \n- Managed communications for a corporate strategic initiative that encompassed new information technology, new business processes, and new products.  \n- Planned and executed employee communications for new product launches  \n- Led training and transition and built multiple sites for the rollout of a new corporate intranet. Communications & Transition-Change Manager Intel Corporation 2003  –  2007  (4 years) Managed communications and user readiness to accelerate the capturing of the business value from worldwide eBusiness software deployments. Manager, User Experience Services Intel Corporation 2001  –  2003  (2 years) Built and managed team of six Human Factors Engineers that evangelized and delivered user-centered design to eBusiness software development teams. eBusiness Training Manager Intel Corporation 1999  –  2001  (2 years) Developed and executed training and marketing programs for successful implementations of CRM and content management solutions. Web Site Manager Intel Corporation 1996  –  1999  (3 years) Managed Intel’s web site for computer resellers and retailers. Took a site that had been a disparate collection of content and grew it into a cohesive whole that met an aggressive goal of four-fold increase in annual usage. eMarcom Manager Intel Corporation 1994  –  1996  (2 years) Led integration of online and electronic media into the marketing communications mix. Extended corporate brand identity into software product user interfaces to ensure consistency of Intel branding throughout the product adoption cycle. Communications Manager Intel 1984  –  1993  (9 years) Communications Management for PC enhancements, supercomputer, and real-time computing businesses. \n \nCreated channel publication that promoted Intel products and solutions to 16,000 computer resellers. Marketing and Communications Legacy Health 2010  – Present (5 years) Portland, Oregon Area Plan, manage, and edit company-wide employee publication and publications for key employee groups. Manage company intranet. Plan and execute communications programs—including incentive programs, employee benefits, and company initiatives. Member of core project team implementing a new SharePoint-based employee intranet. Marketing and Communications Legacy Health 2010  – Present (5 years) Portland, Oregon Area Plan, manage, and edit company-wide employee publication and publications for key employee groups. Manage company intranet. Plan and execute communications programs—including incentive programs, employee benefits, and company initiatives. Member of core project team implementing a new SharePoint-based employee intranet. President, Oregon chapter International Association of Business Communicators 2010  –  2013  (3 years) Portland, Oregon Area Co-president 2010-2012. Led local chapter of an international professional association for communications professionals. Grew membership, received Chapter Management Award of Excellence. \n \nVP Communications 2008-2010: Produced chapter e-newsletter. Managed chapter’s social media presence. Migrated website to Wordpress, initiated monitoring with Google Analytics. President, Oregon chapter International Association of Business Communicators 2010  –  2013  (3 years) Portland, Oregon Area Co-president 2010-2012. Led local chapter of an international professional association for communications professionals. Grew membership, received Chapter Management Award of Excellence. \n \nVP Communications 2008-2010: Produced chapter e-newsletter. Managed chapter’s social media presence. Migrated website to Wordpress, initiated monitoring with Google Analytics. Internal Communications Manager Regence 2007  –  2009  (2 years) Planned and executed employee communications programs—via employee publications, video, intranet, and print. Interacted across multiple functional divisions and at all levels of management to ensure programs helped grow employee engagement.  \n- Managed communications for a corporate strategic initiative that encompassed new information technology, new business processes, and new products.  \n- Planned and executed employee communications for new product launches  \n- Led training and transition and built multiple sites for the rollout of a new corporate intranet. Internal Communications Manager Regence 2007  –  2009  (2 years) Planned and executed employee communications programs—via employee publications, video, intranet, and print. Interacted across multiple functional divisions and at all levels of management to ensure programs helped grow employee engagement.  \n- Managed communications for a corporate strategic initiative that encompassed new information technology, new business processes, and new products.  \n- Planned and executed employee communications for new product launches  \n- Led training and transition and built multiple sites for the rollout of a new corporate intranet. Communications & Transition-Change Manager Intel Corporation 2003  –  2007  (4 years) Managed communications and user readiness to accelerate the capturing of the business value from worldwide eBusiness software deployments. Communications & Transition-Change Manager Intel Corporation 2003  –  2007  (4 years) Managed communications and user readiness to accelerate the capturing of the business value from worldwide eBusiness software deployments. Manager, User Experience Services Intel Corporation 2001  –  2003  (2 years) Built and managed team of six Human Factors Engineers that evangelized and delivered user-centered design to eBusiness software development teams. Manager, User Experience Services Intel Corporation 2001  –  2003  (2 years) Built and managed team of six Human Factors Engineers that evangelized and delivered user-centered design to eBusiness software development teams. eBusiness Training Manager Intel Corporation 1999  –  2001  (2 years) Developed and executed training and marketing programs for successful implementations of CRM and content management solutions. eBusiness Training Manager Intel Corporation 1999  –  2001  (2 years) Developed and executed training and marketing programs for successful implementations of CRM and content management solutions. Web Site Manager Intel Corporation 1996  –  1999  (3 years) Managed Intel’s web site for computer resellers and retailers. Took a site that had been a disparate collection of content and grew it into a cohesive whole that met an aggressive goal of four-fold increase in annual usage. Web Site Manager Intel Corporation 1996  –  1999  (3 years) Managed Intel’s web site for computer resellers and retailers. Took a site that had been a disparate collection of content and grew it into a cohesive whole that met an aggressive goal of four-fold increase in annual usage. eMarcom Manager Intel Corporation 1994  –  1996  (2 years) Led integration of online and electronic media into the marketing communications mix. Extended corporate brand identity into software product user interfaces to ensure consistency of Intel branding throughout the product adoption cycle. eMarcom Manager Intel Corporation 1994  –  1996  (2 years) Led integration of online and electronic media into the marketing communications mix. Extended corporate brand identity into software product user interfaces to ensure consistency of Intel branding throughout the product adoption cycle. Communications Manager Intel 1984  –  1993  (9 years) Communications Management for PC enhancements, supercomputer, and real-time computing businesses. \n \nCreated channel publication that promoted Intel products and solutions to 16,000 computer resellers. Communications Manager Intel 1984  –  1993  (9 years) Communications Management for PC enhancements, supercomputer, and real-time computing businesses. \n \nCreated channel publication that promoted Intel products and solutions to 16,000 computer resellers. Languages German, French German, French German, French Skills Marketing communications eBusiness and website... Budget Management Copywriting Communications Planning E-business User-centered Design Website Management Newsletters Corporate Communications Transition Management Change Management Internal Communications Market Research Marketing Communications Public Relations Budgets Program Management Strategy Webmaster Services Leadership Editing Email Marketing Marketing User Experience Management Event Management Direct Marketing Online Advertising CRM Strategic Communications Training Web Content Employee Engagement Media Relations Integrated Marketing Communication Training Google Analytics Content Management Press Releases WordPress Online Marketing Content Development Content Strategy Social Media Marketing Web Design Facebook Social Media Corporate Branding See 34+     See less Skills  Marketing communications eBusiness and website... Budget Management Copywriting Communications Planning E-business User-centered Design Website Management Newsletters Corporate Communications Transition Management Change Management Internal Communications Market Research Marketing Communications Public Relations Budgets Program Management Strategy Webmaster Services Leadership Editing Email Marketing Marketing User Experience Management Event Management Direct Marketing Online Advertising CRM Strategic Communications Training Web Content Employee Engagement Media Relations Integrated Marketing Communication Training Google Analytics Content Management Press Releases WordPress Online Marketing Content Development Content Strategy Social Media Marketing Web Design Facebook Social Media Corporate Branding See 34+     See less Marketing communications eBusiness and website... Budget Management Copywriting Communications Planning E-business User-centered Design Website Management Newsletters Corporate Communications Transition Management Change Management Internal Communications Market Research Marketing Communications Public Relations Budgets Program Management Strategy Webmaster Services Leadership Editing Email Marketing Marketing User Experience Management Event Management Direct Marketing Online Advertising CRM Strategic Communications Training Web Content Employee Engagement Media Relations Integrated Marketing Communication Training Google Analytics Content Management Press Releases WordPress Online Marketing Content Development Content Strategy Social Media Marketing Web Design Facebook Social Media Corporate Branding See 34+     See less Marketing communications eBusiness and website... Budget Management Copywriting Communications Planning E-business User-centered Design Website Management Newsletters Corporate Communications Transition Management Change Management Internal Communications Market Research Marketing Communications Public Relations Budgets Program Management Strategy Webmaster Services Leadership Editing Email Marketing Marketing User Experience Management Event Management Direct Marketing Online Advertising CRM Strategic Communications Training Web Content Employee Engagement Media Relations Integrated Marketing Communication Training Google Analytics Content Management Press Releases WordPress Online Marketing Content Development Content Strategy Social Media Marketing Web Design Facebook Social Media Corporate Branding See 34+     See less Education Lafayette College BA,  Psychology-English Portland State University Digital Marketing Program UCLA Anderson School of Management MBA,  Marketing-Finance Lafayette College BA,  Psychology-English Lafayette College BA,  Psychology-English Lafayette College BA,  Psychology-English Portland State University Digital Marketing Program Portland State University Digital Marketing Program Portland State University Digital Marketing Program UCLA Anderson School of Management MBA,  Marketing-Finance UCLA Anderson School of Management MBA,  Marketing-Finance UCLA Anderson School of Management MBA,  Marketing-Finance Honors & Awards Beacon Award of Excellence (Legacy Health intranet) International Association of Business Communicators-Oregon chapter 2012 Silver Quill Award of Excellence (Legacy Health publication) International Association of Business Communicators-Pacific Plains Region 2011 Beacon Award of Excellence (Legacy Health intranet) International Association of Business Communicators-Oregon chapter 2012 Beacon Award of Excellence (Legacy Health intranet) International Association of Business Communicators-Oregon chapter 2012 Beacon Award of Excellence (Legacy Health intranet) International Association of Business Communicators-Oregon chapter 2012 Silver Quill Award of Excellence (Legacy Health publication) International Association of Business Communicators-Pacific Plains Region 2011 Silver Quill Award of Excellence (Legacy Health publication) International Association of Business Communicators-Pacific Plains Region 2011 Silver Quill Award of Excellence (Legacy Health publication) International Association of Business Communicators-Pacific Plains Region 2011 ", "Experience Technical Training Manager Intel Corporation 1983  – Present (32 years) Technical Training Manager Intel Corporation 1983  – Present (32 years) Technical Training Manager Intel Corporation 1983  – Present (32 years) Skills Technical Training Semiconductors Instructor-led Training Instructional Design Cross-functional Team... Program Management Captivate Technical Writing Training Skills  Technical Training Semiconductors Instructor-led Training Instructional Design Cross-functional Team... Program Management Captivate Technical Writing Training Technical Training Semiconductors Instructor-led Training Instructional Design Cross-functional Team... Program Management Captivate Technical Writing Training Technical Training Semiconductors Instructor-led Training Instructional Design Cross-functional Team... Program Management Captivate Technical Writing Training Education Pacific Lutheran University Sports Medicine Portland Community College Computer Science ,  Technical Writing University of Phoenix Organizational Management University of Portland Computer Science Pacific Lutheran University Sports Medicine Pacific Lutheran University Sports Medicine Pacific Lutheran University Sports Medicine Portland Community College Computer Science ,  Technical Writing Portland Community College Computer Science ,  Technical Writing Portland Community College Computer Science ,  Technical Writing University of Phoenix Organizational Management University of Phoenix Organizational Management University of Phoenix Organizational Management University of Portland Computer Science University of Portland Computer Science University of Portland Computer Science "]}