{"position": "VP Engineering", "company": "Intel Corporation", "profiles": ["Summary Technology/business leader. Specialized in products in the Security, Internet, Mobile, Video/Media, Cloud, and Network Management areas. Consistent track record of building and leading high performing organizations and products. Currently racking his brains to try and secure users in an increasingly mobile and converged world. Summary Technology/business leader. Specialized in products in the Security, Internet, Mobile, Video/Media, Cloud, and Network Management areas. Consistent track record of building and leading high performing organizations and products. Currently racking his brains to try and secure users in an increasingly mobile and converged world. Technology/business leader. Specialized in products in the Security, Internet, Mobile, Video/Media, Cloud, and Network Management areas. Consistent track record of building and leading high performing organizations and products. Currently racking his brains to try and secure users in an increasingly mobile and converged world. Technology/business leader. Specialized in products in the Security, Internet, Mobile, Video/Media, Cloud, and Network Management areas. Consistent track record of building and leading high performing organizations and products. Currently racking his brains to try and secure users in an increasingly mobile and converged world. Experience VP Engineering Intel Corporation July 2015  – Present (2 months) Santa Clara, California Lead product development for Security Management BU. Product portfolio includes: McAfee ESM (SIEM), ePolicy Orchestrator, Enterprise Mobile Management, Vulnerability Manager, and others. Distributed team, 500+ strong, and growing. SVP - Security Management McAfee Security March 2014  –  July 2015  (1 year 5 months) santa clara Lead product development for Security Management BU. Product portfolio includes: McAfee ESM (SIEM), ePolicy Orchestrator, Enterprise Mobile Management, Vulnerability Manager, and others. Distributed team, 500+ strong, and growing. VP, Mobile Product Development McAfee Security January 2012  –  March 2014  (2 years 3 months) Santa Clara, CA Responsible for leading the product development of McAfee's mobile portfolio, including McAfee's Mobile Security (consumer), McAfee's Enterprise Mobility Management (enterprise), and McAfee Mobile Labs (mobile-focused threat research). Lead a global 200+ people team, targeting all major mobile operating systems and form factors. President and GM, Intel Software, Argentina; Director of McAfee's integration Intel Corporation March 2006  –  January 2012  (5 years 11 months) Started this R&D center, and the Argentina software subsidiary of Intel. Responsible for all aspects of the creation, ramp, and operations of the subsidiary, which ramped from scratch to 200+ employees. Responsibilities included organization of the design center, marketing, product development, HR, finances, operations, and public relations. The center won all kinds of awards, set a new benchmark for how to start new remote sites, and was pivotal in the two most strategic projects within the Software and Services Group during the time of my tenure: (1) the inception, development, and launch of AppUp, Intel's foray into the appstore business, and (2) expansion through inorganic growth, leading to the acquisition of McAfee. \n \nMcAfee is the largest acquisition in Intel's history, by far. It is also a bold move into commercial software for a semiconductor company. Having been involved with initiating and supporting this strategic move, I was responsible for driving the overall business interaction between Intel and McAfee by helping maintain the stand-alone integrity of the subsidiary; and leading the team to identify and deliver Intel-McAfee synergy opportunities in products, sales, infrastructure, etc. Executive Director, Concept Design & Business Development Verizon September 2000  –  March 2006  (5 years 7 months) Recruited back to Verizon to build a business transformation group tasked with conceptualizing and launching new services, and optimizing the Web infrastructure. Managed a 250+people, $25M budget. \n \nWe created a number of products and services within Verizon, as well as the underlying infrastructure required to actually deploy and operate these services. In addition, I was the lead for information technology when Verizon went into the television business, creating FiOS TV. I led the strategic work, business development, and negotiation with key vendors (Microsoft, Motorola), as well as the engineering execution of key programs until \"lights on\". Principal Verizon April 1997  –  October 2000  (3 years 7 months) Senior member of a team of 20+ computer scientists, engineers, and software developers. Notably, I designed and built a rule-based form validation engine which automated processing of service request forms, thus fulfilling an FCC mandate, saving GTE hundreds of millions of dollars. The system was operational long after I left that job, and continued to hum and withstand a number of \"requirement revisions\" without any needs for refactoring or any major overhauling. Senior Technical Specialist Fidelity Investments November 1996  –  April 1997  (6 months) Recruited to introduce advanced reengineering and application development methodologies. The core FX system was indeed sped up (to spec), but I was looking for a more research-oriented environment, so upon finishing the committed projects, I moved on. Lead Software Engineer Harmonix Corporation October 1994  –  December 1996  (2 years 3 months) Recruited to core technical team; rose to leadership of software development. Hired software team with seven advanced developers; implemented (IBM) Rational’s Unified Process for software design and development—achieved 100% on-time release delivery. Went crazy about Object Oriented Programming Languages and Design Patterns... Research Associate Information Science Research Institute January 1993  –  October 1994  (1 year 10 months) Research Assistant \nConducted research on image-quality metrics; developed image processing software. Systems Engineer Techint E&C January 1992  –  December 1992  (1 year) Served as Technical Lead for development of a comprehensive IS plan for a major utility—engaged with customers to define business requirements; met all milestones and highest quality standards. VP Engineering Intel Corporation July 2015  – Present (2 months) Santa Clara, California Lead product development for Security Management BU. Product portfolio includes: McAfee ESM (SIEM), ePolicy Orchestrator, Enterprise Mobile Management, Vulnerability Manager, and others. Distributed team, 500+ strong, and growing. VP Engineering Intel Corporation July 2015  – Present (2 months) Santa Clara, California Lead product development for Security Management BU. Product portfolio includes: McAfee ESM (SIEM), ePolicy Orchestrator, Enterprise Mobile Management, Vulnerability Manager, and others. Distributed team, 500+ strong, and growing. SVP - Security Management McAfee Security March 2014  –  July 2015  (1 year 5 months) santa clara Lead product development for Security Management BU. Product portfolio includes: McAfee ESM (SIEM), ePolicy Orchestrator, Enterprise Mobile Management, Vulnerability Manager, and others. Distributed team, 500+ strong, and growing. SVP - Security Management McAfee Security March 2014  –  July 2015  (1 year 5 months) santa clara Lead product development for Security Management BU. Product portfolio includes: McAfee ESM (SIEM), ePolicy Orchestrator, Enterprise Mobile Management, Vulnerability Manager, and others. Distributed team, 500+ strong, and growing. VP, Mobile Product Development McAfee Security January 2012  –  March 2014  (2 years 3 months) Santa Clara, CA Responsible for leading the product development of McAfee's mobile portfolio, including McAfee's Mobile Security (consumer), McAfee's Enterprise Mobility Management (enterprise), and McAfee Mobile Labs (mobile-focused threat research). Lead a global 200+ people team, targeting all major mobile operating systems and form factors. VP, Mobile Product Development McAfee Security January 2012  –  March 2014  (2 years 3 months) Santa Clara, CA Responsible for leading the product development of McAfee's mobile portfolio, including McAfee's Mobile Security (consumer), McAfee's Enterprise Mobility Management (enterprise), and McAfee Mobile Labs (mobile-focused threat research). Lead a global 200+ people team, targeting all major mobile operating systems and form factors. President and GM, Intel Software, Argentina; Director of McAfee's integration Intel Corporation March 2006  –  January 2012  (5 years 11 months) Started this R&D center, and the Argentina software subsidiary of Intel. Responsible for all aspects of the creation, ramp, and operations of the subsidiary, which ramped from scratch to 200+ employees. Responsibilities included organization of the design center, marketing, product development, HR, finances, operations, and public relations. The center won all kinds of awards, set a new benchmark for how to start new remote sites, and was pivotal in the two most strategic projects within the Software and Services Group during the time of my tenure: (1) the inception, development, and launch of AppUp, Intel's foray into the appstore business, and (2) expansion through inorganic growth, leading to the acquisition of McAfee. \n \nMcAfee is the largest acquisition in Intel's history, by far. It is also a bold move into commercial software for a semiconductor company. Having been involved with initiating and supporting this strategic move, I was responsible for driving the overall business interaction between Intel and McAfee by helping maintain the stand-alone integrity of the subsidiary; and leading the team to identify and deliver Intel-McAfee synergy opportunities in products, sales, infrastructure, etc. President and GM, Intel Software, Argentina; Director of McAfee's integration Intel Corporation March 2006  –  January 2012  (5 years 11 months) Started this R&D center, and the Argentina software subsidiary of Intel. Responsible for all aspects of the creation, ramp, and operations of the subsidiary, which ramped from scratch to 200+ employees. Responsibilities included organization of the design center, marketing, product development, HR, finances, operations, and public relations. The center won all kinds of awards, set a new benchmark for how to start new remote sites, and was pivotal in the two most strategic projects within the Software and Services Group during the time of my tenure: (1) the inception, development, and launch of AppUp, Intel's foray into the appstore business, and (2) expansion through inorganic growth, leading to the acquisition of McAfee. \n \nMcAfee is the largest acquisition in Intel's history, by far. It is also a bold move into commercial software for a semiconductor company. Having been involved with initiating and supporting this strategic move, I was responsible for driving the overall business interaction between Intel and McAfee by helping maintain the stand-alone integrity of the subsidiary; and leading the team to identify and deliver Intel-McAfee synergy opportunities in products, sales, infrastructure, etc. Executive Director, Concept Design & Business Development Verizon September 2000  –  March 2006  (5 years 7 months) Recruited back to Verizon to build a business transformation group tasked with conceptualizing and launching new services, and optimizing the Web infrastructure. Managed a 250+people, $25M budget. \n \nWe created a number of products and services within Verizon, as well as the underlying infrastructure required to actually deploy and operate these services. In addition, I was the lead for information technology when Verizon went into the television business, creating FiOS TV. I led the strategic work, business development, and negotiation with key vendors (Microsoft, Motorola), as well as the engineering execution of key programs until \"lights on\". Executive Director, Concept Design & Business Development Verizon September 2000  –  March 2006  (5 years 7 months) Recruited back to Verizon to build a business transformation group tasked with conceptualizing and launching new services, and optimizing the Web infrastructure. Managed a 250+people, $25M budget. \n \nWe created a number of products and services within Verizon, as well as the underlying infrastructure required to actually deploy and operate these services. In addition, I was the lead for information technology when Verizon went into the television business, creating FiOS TV. I led the strategic work, business development, and negotiation with key vendors (Microsoft, Motorola), as well as the engineering execution of key programs until \"lights on\". Principal Verizon April 1997  –  October 2000  (3 years 7 months) Senior member of a team of 20+ computer scientists, engineers, and software developers. Notably, I designed and built a rule-based form validation engine which automated processing of service request forms, thus fulfilling an FCC mandate, saving GTE hundreds of millions of dollars. The system was operational long after I left that job, and continued to hum and withstand a number of \"requirement revisions\" without any needs for refactoring or any major overhauling. Principal Verizon April 1997  –  October 2000  (3 years 7 months) Senior member of a team of 20+ computer scientists, engineers, and software developers. Notably, I designed and built a rule-based form validation engine which automated processing of service request forms, thus fulfilling an FCC mandate, saving GTE hundreds of millions of dollars. The system was operational long after I left that job, and continued to hum and withstand a number of \"requirement revisions\" without any needs for refactoring or any major overhauling. Senior Technical Specialist Fidelity Investments November 1996  –  April 1997  (6 months) Recruited to introduce advanced reengineering and application development methodologies. The core FX system was indeed sped up (to spec), but I was looking for a more research-oriented environment, so upon finishing the committed projects, I moved on. Senior Technical Specialist Fidelity Investments November 1996  –  April 1997  (6 months) Recruited to introduce advanced reengineering and application development methodologies. The core FX system was indeed sped up (to spec), but I was looking for a more research-oriented environment, so upon finishing the committed projects, I moved on. Lead Software Engineer Harmonix Corporation October 1994  –  December 1996  (2 years 3 months) Recruited to core technical team; rose to leadership of software development. Hired software team with seven advanced developers; implemented (IBM) Rational’s Unified Process for software design and development—achieved 100% on-time release delivery. Went crazy about Object Oriented Programming Languages and Design Patterns... Lead Software Engineer Harmonix Corporation October 1994  –  December 1996  (2 years 3 months) Recruited to core technical team; rose to leadership of software development. Hired software team with seven advanced developers; implemented (IBM) Rational’s Unified Process for software design and development—achieved 100% on-time release delivery. Went crazy about Object Oriented Programming Languages and Design Patterns... Research Associate Information Science Research Institute January 1993  –  October 1994  (1 year 10 months) Research Assistant \nConducted research on image-quality metrics; developed image processing software. Research Associate Information Science Research Institute January 1993  –  October 1994  (1 year 10 months) Research Assistant \nConducted research on image-quality metrics; developed image processing software. Systems Engineer Techint E&C January 1992  –  December 1992  (1 year) Served as Technical Lead for development of a comprehensive IS plan for a major utility—engaged with customers to define business requirements; met all milestones and highest quality standards. Systems Engineer Techint E&C January 1992  –  December 1992  (1 year) Served as Technical Lead for development of a comprehensive IS plan for a major utility—engaged with customers to define business requirements; met all milestones and highest quality standards. Languages Spanish Spanish Spanish Skills International Management Engineering Management Product Development Security Software Development Telecommunications Mobile Wireless Mobile Devices Strategy Leadership Strategic Partnerships Mobile Applications Software Design Software Engineering Agile Methodologies Mobile Technology IT Strategy Scrum Distributed Systems Team Leadership SaaS Enterprise Software Business Development Cloud Computing Product Management Go-to-market Strategy Professional Services Program Management Channel Partners Product Marketing Solution Selling Partner Management Integration Architecture Business Alliances Management Entrepreneurship See 23+     See less Skills  International Management Engineering Management Product Development Security Software Development Telecommunications Mobile Wireless Mobile Devices Strategy Leadership Strategic Partnerships Mobile Applications Software Design Software Engineering Agile Methodologies Mobile Technology IT Strategy Scrum Distributed Systems Team Leadership SaaS Enterprise Software Business Development Cloud Computing Product Management Go-to-market Strategy Professional Services Program Management Channel Partners Product Marketing Solution Selling Partner Management Integration Architecture Business Alliances Management Entrepreneurship See 23+     See less International Management Engineering Management Product Development Security Software Development Telecommunications Mobile Wireless Mobile Devices Strategy Leadership Strategic Partnerships Mobile Applications Software Design Software Engineering Agile Methodologies Mobile Technology IT Strategy Scrum Distributed Systems Team Leadership SaaS Enterprise Software Business Development Cloud Computing Product Management Go-to-market Strategy Professional Services Program Management Channel Partners Product Marketing Solution Selling Partner Management Integration Architecture Business Alliances Management Entrepreneurship See 23+     See less International Management Engineering Management Product Development Security Software Development Telecommunications Mobile Wireless Mobile Devices Strategy Leadership Strategic Partnerships Mobile Applications Software Design Software Engineering Agile Methodologies Mobile Technology IT Strategy Scrum Distributed Systems Team Leadership SaaS Enterprise Software Business Development Cloud Computing Product Management Go-to-market Strategy Professional Services Program Management Channel Partners Product Marketing Solution Selling Partner Management Integration Architecture Business Alliances Management Entrepreneurship See 23+     See less Education Massachusetts Institute of Technology - Sloan School of Management MS in Management,  System Dynamics , Finance, Management 1999  – 2000 Northeastern University MS in Computer Science,  Software Engineering (object oriented) 1997  – 1998 University of Nevada, Las Vegas MS in Computer Science,  Pattern Recognizition, OCR 1993  – 1994 Catholic University of Cordoba MS, BS in Systems Engineering,  Systems Engineering , software development,  computer graphics 1987  – 1991 Massachusetts Institute of Technology - Sloan School of Management MS in Management,  System Dynamics , Finance, Management 1999  – 2000 Massachusetts Institute of Technology - Sloan School of Management MS in Management,  System Dynamics , Finance, Management 1999  – 2000 Massachusetts Institute of Technology - Sloan School of Management MS in Management,  System Dynamics , Finance, Management 1999  – 2000 Northeastern University MS in Computer Science,  Software Engineering (object oriented) 1997  – 1998 Northeastern University MS in Computer Science,  Software Engineering (object oriented) 1997  – 1998 Northeastern University MS in Computer Science,  Software Engineering (object oriented) 1997  – 1998 University of Nevada, Las Vegas MS in Computer Science,  Pattern Recognizition, OCR 1993  – 1994 University of Nevada, Las Vegas MS in Computer Science,  Pattern Recognizition, OCR 1993  – 1994 University of Nevada, Las Vegas MS in Computer Science,  Pattern Recognizition, OCR 1993  – 1994 Catholic University of Cordoba MS, BS in Systems Engineering,  Systems Engineering , software development,  computer graphics 1987  – 1991 Catholic University of Cordoba MS, BS in Systems Engineering,  Systems Engineering , software development,  computer graphics 1987  – 1991 Catholic University of Cordoba MS, BS in Systems Engineering,  Systems Engineering , software development,  computer graphics 1987  – 1991 ", "Experience VP Engineering Intel Corporation VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) VP Engineering Intel Corporation VP Engineering Intel Corporation VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) Skills Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Skills  Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Education Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ "]}