{"position": "Applied Scientist", "company": "Google", "profiles": ["Experience Principal Applied Scientist Microsoft June 2014  – Present (1 year 3 months) Bellevue Bing Ads. Researcher Microsoft Research January 2012  –  June 2014  (2 years 6 months) Redmond Machine Learning Group Principal Scientist Microsoft AdCenter March 2009  –  January 2012  (2 years 11 months) Bellevue Scientist Microsoft Live Labs March 2007  –  March 2009  (2 years 1 month) Bellevue Postdoctoral Researcher Microsoft Research July 2005  –  March 2007  (1 year 9 months) Redmond Cryptography group. Principal Applied Scientist Microsoft June 2014  – Present (1 year 3 months) Bellevue Bing Ads. Principal Applied Scientist Microsoft June 2014  – Present (1 year 3 months) Bellevue Bing Ads. Researcher Microsoft Research January 2012  –  June 2014  (2 years 6 months) Redmond Machine Learning Group Researcher Microsoft Research January 2012  –  June 2014  (2 years 6 months) Redmond Machine Learning Group Principal Scientist Microsoft AdCenter March 2009  –  January 2012  (2 years 11 months) Bellevue Principal Scientist Microsoft AdCenter March 2009  –  January 2012  (2 years 11 months) Bellevue Scientist Microsoft Live Labs March 2007  –  March 2009  (2 years 1 month) Bellevue Scientist Microsoft Live Labs March 2007  –  March 2009  (2 years 1 month) Bellevue Postdoctoral Researcher Microsoft Research July 2005  –  March 2007  (1 year 9 months) Redmond Cryptography group. Postdoctoral Researcher Microsoft Research July 2005  –  March 2007  (1 year 9 months) Redmond Cryptography group. Skills Machine Learning Game Theory Computational Number... Theory of Computation Optimization Programming Algorithms Data Analysis Distributed Systems Big Data Software Design Skills  Machine Learning Game Theory Computational Number... Theory of Computation Optimization Programming Algorithms Data Analysis Distributed Systems Big Data Software Design Machine Learning Game Theory Computational Number... Theory of Computation Optimization Programming Algorithms Data Analysis Distributed Systems Big Data Software Design Machine Learning Game Theory Computational Number... Theory of Computation Optimization Programming Algorithms Data Analysis Distributed Systems Big Data Software Design Education University of Wisconsin-Madison Doctor of Philosophy (Ph.D.),  Computer Science 2001  – 2005 University at Buffalo Master’s Degree,  Computer Science 1998  – 2001 Birla Institute of Technology & Science, Pilani Bachelor’s Degree,  Computer Science 1994  – 1998 University of Wisconsin-Madison Doctor of Philosophy (Ph.D.),  Computer Science 2001  – 2005 University of Wisconsin-Madison Doctor of Philosophy (Ph.D.),  Computer Science 2001  – 2005 University of Wisconsin-Madison Doctor of Philosophy (Ph.D.),  Computer Science 2001  – 2005 University at Buffalo Master’s Degree,  Computer Science 1998  – 2001 University at Buffalo Master’s Degree,  Computer Science 1998  – 2001 University at Buffalo Master’s Degree,  Computer Science 1998  – 2001 Birla Institute of Technology & Science, Pilani Bachelor’s Degree,  Computer Science 1994  – 1998 Birla Institute of Technology & Science, Pilani Bachelor’s Degree,  Computer Science 1994  – 1998 Birla Institute of Technology & Science, Pilani Bachelor’s Degree,  Computer Science 1994  – 1998 ", "Experience Principal Applied Scientist Microsoft September 2014  – Present (1 year) Bangalore (Microsoft Research India) Senior Applied Scientist Microsoft July 2012  – Present (3 years 2 months) Bangalore (Microsoft Research India) Sr. Research Scientist Yahoo! October 2006  –  June 2012  (5 years 9 months) Yahoo! Labs, Bangalore Research in the fields of machine learning (problem formulation, algorithm development, optimization) and data mining for (large scale) web (text and image) applications (classification, information extraction, information retrieval). Architect/Competence Manager Philips Semiconductors / NXP Semiconductors May 2001  –  October 2006  (5 years 6 months) Bangalore, India Digital signal processing algorithms - speech codecs, echo canceller - VoIP. Embedded systems - USB (Drivers and HW/SW co-verification - FPGA) and WLAN (MAC and Physical layers (DSP)). Project/People Management, mentoring of SW architects. Scientist Naval Physical and Oceanography Laboratory (NPOL), Defence R&D (DRDO) November 1986  –  April 2001  (14 years 6 months) Cochin Area, India Specialization in digital signal processing (DSP) with applications to sonar system development. Keywords: adaptive signal processing, array signal processing, DSP system simulation. Principal Applied Scientist Microsoft September 2014  – Present (1 year) Bangalore (Microsoft Research India) Principal Applied Scientist Microsoft September 2014  – Present (1 year) Bangalore (Microsoft Research India) Senior Applied Scientist Microsoft July 2012  – Present (3 years 2 months) Bangalore (Microsoft Research India) Senior Applied Scientist Microsoft July 2012  – Present (3 years 2 months) Bangalore (Microsoft Research India) Sr. Research Scientist Yahoo! October 2006  –  June 2012  (5 years 9 months) Yahoo! Labs, Bangalore Research in the fields of machine learning (problem formulation, algorithm development, optimization) and data mining for (large scale) web (text and image) applications (classification, information extraction, information retrieval). Sr. Research Scientist Yahoo! October 2006  –  June 2012  (5 years 9 months) Yahoo! Labs, Bangalore Research in the fields of machine learning (problem formulation, algorithm development, optimization) and data mining for (large scale) web (text and image) applications (classification, information extraction, information retrieval). Architect/Competence Manager Philips Semiconductors / NXP Semiconductors May 2001  –  October 2006  (5 years 6 months) Bangalore, India Digital signal processing algorithms - speech codecs, echo canceller - VoIP. Embedded systems - USB (Drivers and HW/SW co-verification - FPGA) and WLAN (MAC and Physical layers (DSP)). Project/People Management, mentoring of SW architects. Architect/Competence Manager Philips Semiconductors / NXP Semiconductors May 2001  –  October 2006  (5 years 6 months) Bangalore, India Digital signal processing algorithms - speech codecs, echo canceller - VoIP. Embedded systems - USB (Drivers and HW/SW co-verification - FPGA) and WLAN (MAC and Physical layers (DSP)). Project/People Management, mentoring of SW architects. Scientist Naval Physical and Oceanography Laboratory (NPOL), Defence R&D (DRDO) November 1986  –  April 2001  (14 years 6 months) Cochin Area, India Specialization in digital signal processing (DSP) with applications to sonar system development. Keywords: adaptive signal processing, array signal processing, DSP system simulation. Scientist Naval Physical and Oceanography Laboratory (NPOL), Defence R&D (DRDO) November 1986  –  April 2001  (14 years 6 months) Cochin Area, India Specialization in digital signal processing (DSP) with applications to sonar system development. Keywords: adaptive signal processing, array signal processing, DSP system simulation. Languages Tamil Malayalam Tamil Malayalam Tamil Malayalam Skills Machine Learning Data Mining Research Algorithms Computer Science Information Retrieval Signal Processing Digital Signal... Digital Signal... Device Drivers Embedded Systems Skills  Machine Learning Data Mining Research Algorithms Computer Science Information Retrieval Signal Processing Digital Signal... Digital Signal... Device Drivers Embedded Systems Machine Learning Data Mining Research Algorithms Computer Science Information Retrieval Signal Processing Digital Signal... Digital Signal... Device Drivers Embedded Systems Machine Learning Data Mining Research Algorithms Computer Science Information Retrieval Signal Processing Digital Signal... Digital Signal... Device Drivers Embedded Systems Education Indian Institute of Science Phd,  Computer Science 1995  – 2000 Thesis Title: Predictive Approaches for Choosing Hyperparameters in Linear and Nonlinear Regression Problems. \nArea: Machine Learning, Data Mining Indian Institute of Science ME,  Systems Science and Automation 1990  – 1992 Madurai Kamaraj University BE,  Electronics and Communication 1981  – 1985 Indian Institute of Science Phd,  Computer Science 1995  – 2000 Thesis Title: Predictive Approaches for Choosing Hyperparameters in Linear and Nonlinear Regression Problems. \nArea: Machine Learning, Data Mining Indian Institute of Science Phd,  Computer Science 1995  – 2000 Thesis Title: Predictive Approaches for Choosing Hyperparameters in Linear and Nonlinear Regression Problems. \nArea: Machine Learning, Data Mining Indian Institute of Science Phd,  Computer Science 1995  – 2000 Thesis Title: Predictive Approaches for Choosing Hyperparameters in Linear and Nonlinear Regression Problems. \nArea: Machine Learning, Data Mining Indian Institute of Science ME,  Systems Science and Automation 1990  – 1992 Indian Institute of Science ME,  Systems Science and Automation 1990  – 1992 Indian Institute of Science ME,  Systems Science and Automation 1990  – 1992 Madurai Kamaraj University BE,  Electronics and Communication 1981  – 1985 Madurai Kamaraj University BE,  Electronics and Communication 1981  – 1985 Madurai Kamaraj University BE,  Electronics and Communication 1981  – 1985 ", "Summary Passionate about the right content at the right time for the right customer in web services.  \n \nI am with Microsoft now. The mission of my team is to develop personalization in Bing search engine. It is fascinating to conduct applied research in machine learning on large-scale data and online experiments with millions of users via interactive web services. \n \nReceived my doctoral degree from the National University of Singapore and took postdoc training on machine learning at Gatsby, University College London. Then moved to USA and worked for Columbia University, Yahoo! Labs and now Microsoft.  \n \nBig data analytic on Hadoop and Cosmos, experienced developer in C# and C, and R&D team leader \n \nAward-winning researcher, published 40+ papers with h-index 25+ \nhttp://scholar.google.com/citations?user=3J4zb7gAAAAJ&hl=en \nhttp://www.gatsby.ucl.ac.uk/~chuwei/ Summary Passionate about the right content at the right time for the right customer in web services.  \n \nI am with Microsoft now. The mission of my team is to develop personalization in Bing search engine. It is fascinating to conduct applied research in machine learning on large-scale data and online experiments with millions of users via interactive web services. \n \nReceived my doctoral degree from the National University of Singapore and took postdoc training on machine learning at Gatsby, University College London. Then moved to USA and worked for Columbia University, Yahoo! Labs and now Microsoft.  \n \nBig data analytic on Hadoop and Cosmos, experienced developer in C# and C, and R&D team leader \n \nAward-winning researcher, published 40+ papers with h-index 25+ \nhttp://scholar.google.com/citations?user=3J4zb7gAAAAJ&hl=en \nhttp://www.gatsby.ucl.ac.uk/~chuwei/ Passionate about the right content at the right time for the right customer in web services.  \n \nI am with Microsoft now. The mission of my team is to develop personalization in Bing search engine. It is fascinating to conduct applied research in machine learning on large-scale data and online experiments with millions of users via interactive web services. \n \nReceived my doctoral degree from the National University of Singapore and took postdoc training on machine learning at Gatsby, University College London. Then moved to USA and worked for Columbia University, Yahoo! Labs and now Microsoft.  \n \nBig data analytic on Hadoop and Cosmos, experienced developer in C# and C, and R&D team leader \n \nAward-winning researcher, published 40+ papers with h-index 25+ \nhttp://scholar.google.com/citations?user=3J4zb7gAAAAJ&hl=en \nhttp://www.gatsby.ucl.ac.uk/~chuwei/ Passionate about the right content at the right time for the right customer in web services.  \n \nI am with Microsoft now. The mission of my team is to develop personalization in Bing search engine. It is fascinating to conduct applied research in machine learning on large-scale data and online experiments with millions of users via interactive web services. \n \nReceived my doctoral degree from the National University of Singapore and took postdoc training on machine learning at Gatsby, University College London. Then moved to USA and worked for Columbia University, Yahoo! Labs and now Microsoft.  \n \nBig data analytic on Hadoop and Cosmos, experienced developer in C# and C, and R&D team leader \n \nAward-winning researcher, published 40+ papers with h-index 25+ \nhttp://scholar.google.com/citations?user=3J4zb7gAAAAJ&hl=en \nhttp://www.gatsby.ucl.ac.uk/~chuwei/ Experience Principal Applied Scientist Lead Microsoft January 2014  – Present (1 year 8 months) Bellevue, WA The mission of my team is to develop personalization in Bing search engine.  \nMy responsibilities include  \n- Product development on personalized web search \n- Management on contextual relevance research \n- User understanding on search intent, demographics and interests... Senior Applied Researcher Microsoft May 2011  –  December 2013  (2 years 8 months) Bellevue, WA Scientist Yahoo! Labs January 2008  –  May 2011  (3 years 5 months) Santa Clara, CA Associate Research Scientist Columbia University, CCLS January 2006  –  January 2008  (2 years 1 month) Manhattan, New York City Research Fellow University College London, Gatsby Unit February 2003  –  January 2006  (3 years) London, United Kingdom Principal Applied Scientist Lead Microsoft January 2014  – Present (1 year 8 months) Bellevue, WA The mission of my team is to develop personalization in Bing search engine.  \nMy responsibilities include  \n- Product development on personalized web search \n- Management on contextual relevance research \n- User understanding on search intent, demographics and interests... Principal Applied Scientist Lead Microsoft January 2014  – Present (1 year 8 months) Bellevue, WA The mission of my team is to develop personalization in Bing search engine.  \nMy responsibilities include  \n- Product development on personalized web search \n- Management on contextual relevance research \n- User understanding on search intent, demographics and interests... Senior Applied Researcher Microsoft May 2011  –  December 2013  (2 years 8 months) Bellevue, WA Senior Applied Researcher Microsoft May 2011  –  December 2013  (2 years 8 months) Bellevue, WA Scientist Yahoo! Labs January 2008  –  May 2011  (3 years 5 months) Santa Clara, CA Scientist Yahoo! Labs January 2008  –  May 2011  (3 years 5 months) Santa Clara, CA Associate Research Scientist Columbia University, CCLS January 2006  –  January 2008  (2 years 1 month) Manhattan, New York City Associate Research Scientist Columbia University, CCLS January 2006  –  January 2008  (2 years 1 month) Manhattan, New York City Research Fellow University College London, Gatsby Unit February 2003  –  January 2006  (3 years) London, United Kingdom Research Fellow University College London, Gatsby Unit February 2003  –  January 2006  (3 years) London, United Kingdom Skills Machine Learning Algorithms Natural Language... Data Mining Information Retrieval Hadoop Artificial Intelligence Pattern Recognition Text Mining Distributed Systems MapReduce Computer Science Foosball Predictive Modeling Bayesian statistics Soccer Cloud Computing Search Personalization Big Data See 5+     See less Skills  Machine Learning Algorithms Natural Language... Data Mining Information Retrieval Hadoop Artificial Intelligence Pattern Recognition Text Mining Distributed Systems MapReduce Computer Science Foosball Predictive Modeling Bayesian statistics Soccer Cloud Computing Search Personalization Big Data See 5+     See less Machine Learning Algorithms Natural Language... Data Mining Information Retrieval Hadoop Artificial Intelligence Pattern Recognition Text Mining Distributed Systems MapReduce Computer Science Foosball Predictive Modeling Bayesian statistics Soccer Cloud Computing Search Personalization Big Data See 5+     See less Machine Learning Algorithms Natural Language... Data Mining Information Retrieval Hadoop Artificial Intelligence Pattern Recognition Text Mining Distributed Systems MapReduce Computer Science Foosball Predictive Modeling Bayesian statistics Soccer Cloud Computing Search Personalization Big Data See 5+     See less Education National University of Singapore / NUS Ph.D. 1999  – 2003 National University of Singapore / NUS Ph.D. 1999  – 2003 National University of Singapore / NUS Ph.D. 1999  – 2003 National University of Singapore / NUS Ph.D. 1999  – 2003 Honors & Awards Best Paper Award WSDM 2011 Super Star Team Award Yahoo! 2008 Best Paper Award WSDM 2011 Best Paper Award WSDM 2011 Best Paper Award WSDM 2011 Super Star Team Award Yahoo! 2008 Super Star Team Award Yahoo! 2008 Super Star Team Award Yahoo! 2008 ", "Experience Principal Applied Scientist Microsoft February 2014  – Present (1 year 7 months) Senior Applied Researcher Microsoft April 2010  –  February 2014  (3 years 11 months) Research Scientist Yahoo! November 2007  –  April 2010  (2 years 6 months) Principal Applied Scientist Microsoft February 2014  – Present (1 year 7 months) Principal Applied Scientist Microsoft February 2014  – Present (1 year 7 months) Senior Applied Researcher Microsoft April 2010  –  February 2014  (3 years 11 months) Senior Applied Researcher Microsoft April 2010  –  February 2014  (3 years 11 months) Research Scientist Yahoo! November 2007  –  April 2010  (2 years 6 months) Research Scientist Yahoo! November 2007  –  April 2010  (2 years 6 months) Languages English English English Skills Information Retrieval Machine Learning Natural Language... Hadoop Text Mining Skills  Information Retrieval Machine Learning Natural Language... Hadoop Text Mining Information Retrieval Machine Learning Natural Language... Hadoop Text Mining Information Retrieval Machine Learning Natural Language... Hadoop Text Mining Education Université de Montréal Ph.D,  Computer Science 2002  – 2007 Université de Montréal Ph.D,  Computer Science 2002  – 2007 Université de Montréal Ph.D,  Computer Science 2002  – 2007 Université de Montréal Ph.D,  Computer Science 2002  – 2007 ", "Summary My entire career has involved developing software to manage and analyze large amounts of data, initially geographic data (22 years) and most recently web search data (8 years). \n \nOne year ago Microsoft moved my team to a new \"discipline\": Data and Applied Scientist. Same job as I was previously doing, just a new title. I still code, play with data, and run experiments to find out what moves our metrics. \n \nMy ideal job is at the confluence of Big Data, GIS, and Machine Learning. It would involve using data for good, to improve the world, rather than just for profit. It would support a healthy work/life balance in a location with good quality of life. \n \nSpecialties: Web Search. Big Data. GIS software development. Local Search and Online Mapping. Data Mining. Machine Learning. Summary My entire career has involved developing software to manage and analyze large amounts of data, initially geographic data (22 years) and most recently web search data (8 years). \n \nOne year ago Microsoft moved my team to a new \"discipline\": Data and Applied Scientist. Same job as I was previously doing, just a new title. I still code, play with data, and run experiments to find out what moves our metrics. \n \nMy ideal job is at the confluence of Big Data, GIS, and Machine Learning. It would involve using data for good, to improve the world, rather than just for profit. It would support a healthy work/life balance in a location with good quality of life. \n \nSpecialties: Web Search. Big Data. GIS software development. Local Search and Online Mapping. Data Mining. Machine Learning. My entire career has involved developing software to manage and analyze large amounts of data, initially geographic data (22 years) and most recently web search data (8 years). \n \nOne year ago Microsoft moved my team to a new \"discipline\": Data and Applied Scientist. Same job as I was previously doing, just a new title. I still code, play with data, and run experiments to find out what moves our metrics. \n \nMy ideal job is at the confluence of Big Data, GIS, and Machine Learning. It would involve using data for good, to improve the world, rather than just for profit. It would support a healthy work/life balance in a location with good quality of life. \n \nSpecialties: Web Search. Big Data. GIS software development. Local Search and Online Mapping. Data Mining. Machine Learning. My entire career has involved developing software to manage and analyze large amounts of data, initially geographic data (22 years) and most recently web search data (8 years). \n \nOne year ago Microsoft moved my team to a new \"discipline\": Data and Applied Scientist. Same job as I was previously doing, just a new title. I still code, play with data, and run experiments to find out what moves our metrics. \n \nMy ideal job is at the confluence of Big Data, GIS, and Machine Learning. It would involve using data for good, to improve the world, rather than just for profit. It would support a healthy work/life balance in a location with good quality of life. \n \nSpecialties: Web Search. Big Data. GIS software development. Local Search and Online Mapping. Data Mining. Machine Learning. Experience Principal Applied Scientist Manager (formerly known as Software Development Lead) Microsoft July 2010  – Present (5 years 2 months) Bellevue, WA Senior Program Manager Microsoft July 2007  –  June 2010  (3 years) Beijing, Redmond Senior Program Manager Microsoft July 2005  –  June 2007  (2 years) Redmond Senior Software Development Lead Microsoft May 2002  –  June 2005  (3 years 2 months) Redmond Lead Programmer, ArcInfo Metadata Team ESRI January 1999  –  May 2002  (3 years 5 months) Redlands, CA Lead Programmer, MapObjects 2.0 Esri UK February 1998  –  November 1998  (10 months) Edinburgh, Scotland GIS Consultant Esri UK May 1997  –  February 1998  (10 months) Watford, England Lead Programmer, ArcView Internet Map Server Esri September 1996  –  May 1997  (9 months) Redlands, CA Programmer Esri May 1995  –  August 1996  (1 year 4 months) Redlands, CA Programmer Esri July 1994  –  May 1995  (11 months) Redlands, CA Programmer, ArcView Versions 2.0 and 2.1 Esri December 1992  –  July 1994  (1 year 8 months) Redlands, CA Lead Programmer, Arc/Info Versions 6.0 and 6.1 Network Team Esri September 1990  –  December 1992  (2 years 4 months) Redlands, CA Platform Programmer, Arc/Info UNIX Platforms Release Team Esri March 1990  –  August 1990  (6 months) Redlands, CA Senior Software Analyst, Federal Systems Division Intergraph Corp. March 1989  –  March 1990  (1 year 1 month) Rockville, MD Senior Software Analyst, Federal Systems Division Intergraph September 1987  –  March 1989  (1 year 7 months) Reston, VA Software Analyst, TIGRIS Mapping Nucleus Group Intergraph September 1986  –  August 1987  (1 year) Huntsville, AL Software Analyst, Land Information Systems and Distributed Graphics Software Products Intergraph June 1985  –  August 1986  (1 year 3 months) Huntsville, AL Principal Applied Scientist Manager (formerly known as Software Development Lead) Microsoft July 2010  – Present (5 years 2 months) Bellevue, WA Principal Applied Scientist Manager (formerly known as Software Development Lead) Microsoft July 2010  – Present (5 years 2 months) Bellevue, WA Senior Program Manager Microsoft July 2007  –  June 2010  (3 years) Beijing, Redmond Senior Program Manager Microsoft July 2007  –  June 2010  (3 years) Beijing, Redmond Senior Program Manager Microsoft July 2005  –  June 2007  (2 years) Redmond Senior Program Manager Microsoft July 2005  –  June 2007  (2 years) Redmond Senior Software Development Lead Microsoft May 2002  –  June 2005  (3 years 2 months) Redmond Senior Software Development Lead Microsoft May 2002  –  June 2005  (3 years 2 months) Redmond Lead Programmer, ArcInfo Metadata Team ESRI January 1999  –  May 2002  (3 years 5 months) Redlands, CA Lead Programmer, ArcInfo Metadata Team ESRI January 1999  –  May 2002  (3 years 5 months) Redlands, CA Lead Programmer, MapObjects 2.0 Esri UK February 1998  –  November 1998  (10 months) Edinburgh, Scotland Lead Programmer, MapObjects 2.0 Esri UK February 1998  –  November 1998  (10 months) Edinburgh, Scotland GIS Consultant Esri UK May 1997  –  February 1998  (10 months) Watford, England GIS Consultant Esri UK May 1997  –  February 1998  (10 months) Watford, England Lead Programmer, ArcView Internet Map Server Esri September 1996  –  May 1997  (9 months) Redlands, CA Lead Programmer, ArcView Internet Map Server Esri September 1996  –  May 1997  (9 months) Redlands, CA Programmer Esri May 1995  –  August 1996  (1 year 4 months) Redlands, CA Programmer Esri May 1995  –  August 1996  (1 year 4 months) Redlands, CA Programmer Esri July 1994  –  May 1995  (11 months) Redlands, CA Programmer Esri July 1994  –  May 1995  (11 months) Redlands, CA Programmer, ArcView Versions 2.0 and 2.1 Esri December 1992  –  July 1994  (1 year 8 months) Redlands, CA Programmer, ArcView Versions 2.0 and 2.1 Esri December 1992  –  July 1994  (1 year 8 months) Redlands, CA Lead Programmer, Arc/Info Versions 6.0 and 6.1 Network Team Esri September 1990  –  December 1992  (2 years 4 months) Redlands, CA Lead Programmer, Arc/Info Versions 6.0 and 6.1 Network Team Esri September 1990  –  December 1992  (2 years 4 months) Redlands, CA Platform Programmer, Arc/Info UNIX Platforms Release Team Esri March 1990  –  August 1990  (6 months) Redlands, CA Platform Programmer, Arc/Info UNIX Platforms Release Team Esri March 1990  –  August 1990  (6 months) Redlands, CA Senior Software Analyst, Federal Systems Division Intergraph Corp. March 1989  –  March 1990  (1 year 1 month) Rockville, MD Senior Software Analyst, Federal Systems Division Intergraph Corp. March 1989  –  March 1990  (1 year 1 month) Rockville, MD Senior Software Analyst, Federal Systems Division Intergraph September 1987  –  March 1989  (1 year 7 months) Reston, VA Senior Software Analyst, Federal Systems Division Intergraph September 1987  –  March 1989  (1 year 7 months) Reston, VA Software Analyst, TIGRIS Mapping Nucleus Group Intergraph September 1986  –  August 1987  (1 year) Huntsville, AL Software Analyst, TIGRIS Mapping Nucleus Group Intergraph September 1986  –  August 1987  (1 year) Huntsville, AL Software Analyst, Land Information Systems and Distributed Graphics Software Products Intergraph June 1985  –  August 1986  (1 year 3 months) Huntsville, AL Software Analyst, Land Information Systems and Distributed Graphics Software Products Intergraph June 1985  –  August 1986  (1 year 3 months) Huntsville, AL Skills Machine Learning Distributed Systems Information Retrieval C# Software Engineering Scalability Data Mining Algorithms Software Development Software Design Agile Methodologies C++ Cloud Computing Software Project... .NET Computer Science Scrum GIS Web Search Web Applications Big Data Microsoft SQL Server See 7+     See less Skills  Machine Learning Distributed Systems Information Retrieval C# Software Engineering Scalability Data Mining Algorithms Software Development Software Design Agile Methodologies C++ Cloud Computing Software Project... .NET Computer Science Scrum GIS Web Search Web Applications Big Data Microsoft SQL Server See 7+     See less Machine Learning Distributed Systems Information Retrieval C# Software Engineering Scalability Data Mining Algorithms Software Development Software Design Agile Methodologies C++ Cloud Computing Software Project... .NET Computer Science Scrum GIS Web Search Web Applications Big Data Microsoft SQL Server See 7+     See less Machine Learning Distributed Systems Information Retrieval C# Software Engineering Scalability Data Mining Algorithms Software Development Software Design Agile Methodologies C++ Cloud Computing Software Project... .NET Computer Science Scrum GIS Web Search Web Applications Big Data Microsoft SQL Server See 7+     See less Education Rice University BSEE August 1981  – May 1985 Rice University BSEE August 1981  – May 1985 Rice University BSEE August 1981  – May 1985 Rice University BSEE August 1981  – May 1985 ", "Skills Speech Recognition Algorithms Natural Language... Computational... Machine Learning Search Advertising Online Advertising Data Mining Ad Networks Skills  Speech Recognition Algorithms Natural Language... Computational... Machine Learning Search Advertising Online Advertising Data Mining Ad Networks Speech Recognition Algorithms Natural Language... Computational... Machine Learning Search Advertising Online Advertising Data Mining Ad Networks Speech Recognition Algorithms Natural Language... Computational... Machine Learning Search Advertising Online Advertising Data Mining Ad Networks ", "Summary Results-driven professional offering a strong balance between business, engineering, and technical savvy. Possess a proven track record of leading the design, development, and production of multi-disciplinary engineering products, with a focus on alternative energy, renewable energy, and industrial manufacturing. Oversee the entire lifecycle of new product development — from conceptualization and R&D to prototyping and testing to transfer for commercialization and manufacturing. Effectively aligns product development activities with corporate goals and client objectives to achieve multiple patents, readily marketable products, and ultimately high ROI. Capitalize on solid engineering, problem solving, and analysis skills to identify and pursue opportunities for improving manufacturing processes and optimizing product quality while reducing overall production costs. Leverage superior communication and interpersonal skills to cultivate strong internal and stakeholder relations. Build and spearhead top-performing, cross-functional teams, providing the tactical direction, guidance, and support to ensure the on time and within budget completion of deliverables that consistently exceed expectations.  \n* Engineering Expertise: PEM Fuel Cell Systems, Distributed Power, Combustion, Energy Conservation Management, Alternative/Renewable/Clean Energy, Fuels, Engines (IC And Fuel Cell), Preliminary Engineering, Feasibility Studies, Compressors, Pumps, Humidifiers, Hydrogen, Emissions, Steam Power Boilers, Furnaces, Fans, Pipelines, Burners, Stacks, Silencers, Chemical Engineering, Heat Exchangers, Thermofluids, Thermodynamics \n* Fuel Cell Product Development: Stack Integration, Applications, Operating Strategies, Balance Of Plant Development, Technical Leadership \n* Industrial Projects: Engineering Calculations, Equipment Design/Sizing, Energy Utilization Optimization, Specifications, Flue Gas Cleaning, Sluge & Bark Thermal Utilization, Boiler Design Changes, Testing Coordination Summary Results-driven professional offering a strong balance between business, engineering, and technical savvy. Possess a proven track record of leading the design, development, and production of multi-disciplinary engineering products, with a focus on alternative energy, renewable energy, and industrial manufacturing. Oversee the entire lifecycle of new product development — from conceptualization and R&D to prototyping and testing to transfer for commercialization and manufacturing. Effectively aligns product development activities with corporate goals and client objectives to achieve multiple patents, readily marketable products, and ultimately high ROI. Capitalize on solid engineering, problem solving, and analysis skills to identify and pursue opportunities for improving manufacturing processes and optimizing product quality while reducing overall production costs. Leverage superior communication and interpersonal skills to cultivate strong internal and stakeholder relations. Build and spearhead top-performing, cross-functional teams, providing the tactical direction, guidance, and support to ensure the on time and within budget completion of deliverables that consistently exceed expectations.  \n* Engineering Expertise: PEM Fuel Cell Systems, Distributed Power, Combustion, Energy Conservation Management, Alternative/Renewable/Clean Energy, Fuels, Engines (IC And Fuel Cell), Preliminary Engineering, Feasibility Studies, Compressors, Pumps, Humidifiers, Hydrogen, Emissions, Steam Power Boilers, Furnaces, Fans, Pipelines, Burners, Stacks, Silencers, Chemical Engineering, Heat Exchangers, Thermofluids, Thermodynamics \n* Fuel Cell Product Development: Stack Integration, Applications, Operating Strategies, Balance Of Plant Development, Technical Leadership \n* Industrial Projects: Engineering Calculations, Equipment Design/Sizing, Energy Utilization Optimization, Specifications, Flue Gas Cleaning, Sluge & Bark Thermal Utilization, Boiler Design Changes, Testing Coordination Results-driven professional offering a strong balance between business, engineering, and technical savvy. Possess a proven track record of leading the design, development, and production of multi-disciplinary engineering products, with a focus on alternative energy, renewable energy, and industrial manufacturing. Oversee the entire lifecycle of new product development — from conceptualization and R&D to prototyping and testing to transfer for commercialization and manufacturing. Effectively aligns product development activities with corporate goals and client objectives to achieve multiple patents, readily marketable products, and ultimately high ROI. Capitalize on solid engineering, problem solving, and analysis skills to identify and pursue opportunities for improving manufacturing processes and optimizing product quality while reducing overall production costs. Leverage superior communication and interpersonal skills to cultivate strong internal and stakeholder relations. Build and spearhead top-performing, cross-functional teams, providing the tactical direction, guidance, and support to ensure the on time and within budget completion of deliverables that consistently exceed expectations.  \n* Engineering Expertise: PEM Fuel Cell Systems, Distributed Power, Combustion, Energy Conservation Management, Alternative/Renewable/Clean Energy, Fuels, Engines (IC And Fuel Cell), Preliminary Engineering, Feasibility Studies, Compressors, Pumps, Humidifiers, Hydrogen, Emissions, Steam Power Boilers, Furnaces, Fans, Pipelines, Burners, Stacks, Silencers, Chemical Engineering, Heat Exchangers, Thermofluids, Thermodynamics \n* Fuel Cell Product Development: Stack Integration, Applications, Operating Strategies, Balance Of Plant Development, Technical Leadership \n* Industrial Projects: Engineering Calculations, Equipment Design/Sizing, Energy Utilization Optimization, Specifications, Flue Gas Cleaning, Sluge & Bark Thermal Utilization, Boiler Design Changes, Testing Coordination Results-driven professional offering a strong balance between business, engineering, and technical savvy. Possess a proven track record of leading the design, development, and production of multi-disciplinary engineering products, with a focus on alternative energy, renewable energy, and industrial manufacturing. Oversee the entire lifecycle of new product development — from conceptualization and R&D to prototyping and testing to transfer for commercialization and manufacturing. Effectively aligns product development activities with corporate goals and client objectives to achieve multiple patents, readily marketable products, and ultimately high ROI. Capitalize on solid engineering, problem solving, and analysis skills to identify and pursue opportunities for improving manufacturing processes and optimizing product quality while reducing overall production costs. Leverage superior communication and interpersonal skills to cultivate strong internal and stakeholder relations. Build and spearhead top-performing, cross-functional teams, providing the tactical direction, guidance, and support to ensure the on time and within budget completion of deliverables that consistently exceed expectations.  \n* Engineering Expertise: PEM Fuel Cell Systems, Distributed Power, Combustion, Energy Conservation Management, Alternative/Renewable/Clean Energy, Fuels, Engines (IC And Fuel Cell), Preliminary Engineering, Feasibility Studies, Compressors, Pumps, Humidifiers, Hydrogen, Emissions, Steam Power Boilers, Furnaces, Fans, Pipelines, Burners, Stacks, Silencers, Chemical Engineering, Heat Exchangers, Thermofluids, Thermodynamics \n* Fuel Cell Product Development: Stack Integration, Applications, Operating Strategies, Balance Of Plant Development, Technical Leadership \n* Industrial Projects: Engineering Calculations, Equipment Design/Sizing, Energy Utilization Optimization, Specifications, Flue Gas Cleaning, Sluge & Bark Thermal Utilization, Boiler Design Changes, Testing Coordination Experience Director of Engineering, Mechanical/Systems Team Lead Shanghai Everpower Technologies Co. Ltd. June 2011  – Present (4 years 3 months) Shanghai Senior-level position overseeing functional activities (mechanical and systems) to transition products from R&D to industrial development and production, including establishing policies/procedures, organizational structures, job descriptions, work packages, project objectives, design reviews, unified filing structure, and employee productivity. Focus on Fuel Cell technology development/improvement for Stationary Backup Power Systems and Solar PV- Electrolysis- Energy Storage-Fuel Cell Power Systems. Establish corporate strategies, goals, and work plans and ensure capabilities for advanced transformation into more structured/efficient organization, including leading seminars on technical and organizational improvement issues. Conduct preliminary engineering studies on potential and in-development products, real-life demonstrations, create cost / energy utilization models, and writing proposals for customer implementation. Partner, Product Development Specialist Exergy Systems August 2009  –  August 2011  (2 years 1 month) Provided a broad range of engineering and technical consulting for key clients Ogura Industrial Company (Japan), Wood Stone Corp. (US), and PowerCell Sweden AB (Volvo Subsidiary). Evaluated client product and production and worked closely with both management and front-line contributors on developing best possible product using the most efficient and advanced techniques. \nConsulting and Engineering services in the area of \"Green\" Technologies Development: \n- Fuel Cell Systems \n- Energy Utilization Models (Load Duration Curves) \n- Hydrogen Applications \n- Components Development \n- Design Verification & Validation Principal Applied Scientist Ballard Power Systems Inc. March 1999  –  August 2009  (10 years 6 months) Promoted through positions of increasing authority, including Development Engineer, Technical Lead, and Project / Program Manager, to provide technical, functional, and development leadership to the Mechanical Engineering Department and Product Development Systems Division. Managed projects related to fuel cell stacks integration, including developing plant components and operating strategies for heavy duty bus engines, light duty car engines, forklift power plants, and stationary back-up power systems. Focused on P5 Fuel Cell Power Module project consisting of 50 improvement projects and carrying a $5,000,000 budget. Directed development projects from concepts and design verification to qualified product advancement, including requirements cascading, prototyping, multiple iterations at lab rig and full engine level, technical reviews, cost evaluation, selecting production methods, preliminary hazard analysis, and commissioning procedures. Constantly evaluated breakthrough technologies and advances for possible application. Supervised 10 engineers and coordinated as many as 40 engineers and technicians, defining scopes of responsibilities, overseeing daily workflow, monitoring activities, and evaluating performance. Process Engineer and Combustion & Modelling Specialist UTILITY & RECOVERY ENGINEERING LTD January 1996  –  March 1999  (3 years 3 months) Managed power boiler improvement projects : equipment sizing, specifications, bidding process organization, bids comparison, evaluations and equipment selection. Design of custom industrial equipment in relation to the erection of industrial power boilers. Proposals writing. Energy utilization models (Load Duration Curves). Pipelines (stress analysis) and pumping systems. \nConducted physical and numerical modelling of steam power boiler flow processes (15% boiler output increase). Carried out calculations to predict boiler performance (on-grate gasification of sluge and bark; superheater & economizer performance, airflow, airfoils and annubars ). Research Engineer & Project Manager, Department of Mechanical Engineering The University of British Columbia January 1990  –  December 1995  (6 years) Vancouver, Canada Area Researched and managed various projects related to Engine Development and Testing. Senior Research Fellow & Lecturer UNIVERSITY OF ZIMBABWE October 1986  –  October 1989  (3 years 1 month) Research and course work in the general subject of Mechanical Engineering with an emphasis on  \nThermo-Fluids systems and laboratory exercises. Assistant Professor & Researcher Technical University of Silesia January 1977  –  September 1986  (9 years 9 months) Research and course work in the general subject of Mechanical Engineering with an emphasis on Thermo-Fluids systems and laboratory exercises. Consulting work in the area of energy efficiency improvements in complex industrial processes. Director of Engineering, Mechanical/Systems Team Lead Shanghai Everpower Technologies Co. Ltd. June 2011  – Present (4 years 3 months) Shanghai Senior-level position overseeing functional activities (mechanical and systems) to transition products from R&D to industrial development and production, including establishing policies/procedures, organizational structures, job descriptions, work packages, project objectives, design reviews, unified filing structure, and employee productivity. Focus on Fuel Cell technology development/improvement for Stationary Backup Power Systems and Solar PV- Electrolysis- Energy Storage-Fuel Cell Power Systems. Establish corporate strategies, goals, and work plans and ensure capabilities for advanced transformation into more structured/efficient organization, including leading seminars on technical and organizational improvement issues. Conduct preliminary engineering studies on potential and in-development products, real-life demonstrations, create cost / energy utilization models, and writing proposals for customer implementation. Director of Engineering, Mechanical/Systems Team Lead Shanghai Everpower Technologies Co. Ltd. June 2011  – Present (4 years 3 months) Shanghai Senior-level position overseeing functional activities (mechanical and systems) to transition products from R&D to industrial development and production, including establishing policies/procedures, organizational structures, job descriptions, work packages, project objectives, design reviews, unified filing structure, and employee productivity. Focus on Fuel Cell technology development/improvement for Stationary Backup Power Systems and Solar PV- Electrolysis- Energy Storage-Fuel Cell Power Systems. Establish corporate strategies, goals, and work plans and ensure capabilities for advanced transformation into more structured/efficient organization, including leading seminars on technical and organizational improvement issues. Conduct preliminary engineering studies on potential and in-development products, real-life demonstrations, create cost / energy utilization models, and writing proposals for customer implementation. Partner, Product Development Specialist Exergy Systems August 2009  –  August 2011  (2 years 1 month) Provided a broad range of engineering and technical consulting for key clients Ogura Industrial Company (Japan), Wood Stone Corp. (US), and PowerCell Sweden AB (Volvo Subsidiary). Evaluated client product and production and worked closely with both management and front-line contributors on developing best possible product using the most efficient and advanced techniques. \nConsulting and Engineering services in the area of \"Green\" Technologies Development: \n- Fuel Cell Systems \n- Energy Utilization Models (Load Duration Curves) \n- Hydrogen Applications \n- Components Development \n- Design Verification & Validation Partner, Product Development Specialist Exergy Systems August 2009  –  August 2011  (2 years 1 month) Provided a broad range of engineering and technical consulting for key clients Ogura Industrial Company (Japan), Wood Stone Corp. (US), and PowerCell Sweden AB (Volvo Subsidiary). Evaluated client product and production and worked closely with both management and front-line contributors on developing best possible product using the most efficient and advanced techniques. \nConsulting and Engineering services in the area of \"Green\" Technologies Development: \n- Fuel Cell Systems \n- Energy Utilization Models (Load Duration Curves) \n- Hydrogen Applications \n- Components Development \n- Design Verification & Validation Principal Applied Scientist Ballard Power Systems Inc. March 1999  –  August 2009  (10 years 6 months) Promoted through positions of increasing authority, including Development Engineer, Technical Lead, and Project / Program Manager, to provide technical, functional, and development leadership to the Mechanical Engineering Department and Product Development Systems Division. Managed projects related to fuel cell stacks integration, including developing plant components and operating strategies for heavy duty bus engines, light duty car engines, forklift power plants, and stationary back-up power systems. Focused on P5 Fuel Cell Power Module project consisting of 50 improvement projects and carrying a $5,000,000 budget. Directed development projects from concepts and design verification to qualified product advancement, including requirements cascading, prototyping, multiple iterations at lab rig and full engine level, technical reviews, cost evaluation, selecting production methods, preliminary hazard analysis, and commissioning procedures. Constantly evaluated breakthrough technologies and advances for possible application. Supervised 10 engineers and coordinated as many as 40 engineers and technicians, defining scopes of responsibilities, overseeing daily workflow, monitoring activities, and evaluating performance. Principal Applied Scientist Ballard Power Systems Inc. March 1999  –  August 2009  (10 years 6 months) Promoted through positions of increasing authority, including Development Engineer, Technical Lead, and Project / Program Manager, to provide technical, functional, and development leadership to the Mechanical Engineering Department and Product Development Systems Division. Managed projects related to fuel cell stacks integration, including developing plant components and operating strategies for heavy duty bus engines, light duty car engines, forklift power plants, and stationary back-up power systems. Focused on P5 Fuel Cell Power Module project consisting of 50 improvement projects and carrying a $5,000,000 budget. Directed development projects from concepts and design verification to qualified product advancement, including requirements cascading, prototyping, multiple iterations at lab rig and full engine level, technical reviews, cost evaluation, selecting production methods, preliminary hazard analysis, and commissioning procedures. Constantly evaluated breakthrough technologies and advances for possible application. Supervised 10 engineers and coordinated as many as 40 engineers and technicians, defining scopes of responsibilities, overseeing daily workflow, monitoring activities, and evaluating performance. Process Engineer and Combustion & Modelling Specialist UTILITY & RECOVERY ENGINEERING LTD January 1996  –  March 1999  (3 years 3 months) Managed power boiler improvement projects : equipment sizing, specifications, bidding process organization, bids comparison, evaluations and equipment selection. Design of custom industrial equipment in relation to the erection of industrial power boilers. Proposals writing. Energy utilization models (Load Duration Curves). Pipelines (stress analysis) and pumping systems. \nConducted physical and numerical modelling of steam power boiler flow processes (15% boiler output increase). Carried out calculations to predict boiler performance (on-grate gasification of sluge and bark; superheater & economizer performance, airflow, airfoils and annubars ). Process Engineer and Combustion & Modelling Specialist UTILITY & RECOVERY ENGINEERING LTD January 1996  –  March 1999  (3 years 3 months) Managed power boiler improvement projects : equipment sizing, specifications, bidding process organization, bids comparison, evaluations and equipment selection. Design of custom industrial equipment in relation to the erection of industrial power boilers. Proposals writing. Energy utilization models (Load Duration Curves). Pipelines (stress analysis) and pumping systems. \nConducted physical and numerical modelling of steam power boiler flow processes (15% boiler output increase). Carried out calculations to predict boiler performance (on-grate gasification of sluge and bark; superheater & economizer performance, airflow, airfoils and annubars ). Research Engineer & Project Manager, Department of Mechanical Engineering The University of British Columbia January 1990  –  December 1995  (6 years) Vancouver, Canada Area Researched and managed various projects related to Engine Development and Testing. Research Engineer & Project Manager, Department of Mechanical Engineering The University of British Columbia January 1990  –  December 1995  (6 years) Vancouver, Canada Area Researched and managed various projects related to Engine Development and Testing. Senior Research Fellow & Lecturer UNIVERSITY OF ZIMBABWE October 1986  –  October 1989  (3 years 1 month) Research and course work in the general subject of Mechanical Engineering with an emphasis on  \nThermo-Fluids systems and laboratory exercises. Senior Research Fellow & Lecturer UNIVERSITY OF ZIMBABWE October 1986  –  October 1989  (3 years 1 month) Research and course work in the general subject of Mechanical Engineering with an emphasis on  \nThermo-Fluids systems and laboratory exercises. Assistant Professor & Researcher Technical University of Silesia January 1977  –  September 1986  (9 years 9 months) Research and course work in the general subject of Mechanical Engineering with an emphasis on Thermo-Fluids systems and laboratory exercises. Consulting work in the area of energy efficiency improvements in complex industrial processes. Assistant Professor & Researcher Technical University of Silesia January 1977  –  September 1986  (9 years 9 months) Research and course work in the general subject of Mechanical Engineering with an emphasis on Thermo-Fluids systems and laboratory exercises. Consulting work in the area of energy efficiency improvements in complex industrial processes. Languages English Full professional proficiency Polish Native or bilingual proficiency Russian Elementary proficiency French Elementary proficiency English Full professional proficiency Polish Native or bilingual proficiency Russian Elementary proficiency French Elementary proficiency English Full professional proficiency Polish Native or bilingual proficiency Russian Elementary proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Hydrogen Fuel Cells Thermodynamics Engineering FMEA Materials Testing R&D Renewable Energy Product Development ISO Systems Engineering System Design Fuel Integration Problem Solving Energy Automotive Requirements Analysis Research Microsoft Office MS Project APQP Documentation Prototyping Team Building Data Acquisition Technology Development Design of Experiments Engineering Management Root Cause Analysis Hybrid Process Engineering Continuous Improvement Heat Transfer Failure Analysis Process Development Process Control Reliability Alternative Energy Product Design Project Engineering Cross-functional Team... Team Leadership Commercialization Electric Vehicles Cost Reduction Project Planning Commissioning Combustion See 35+     See less Skills  Hydrogen Fuel Cells Thermodynamics Engineering FMEA Materials Testing R&D Renewable Energy Product Development ISO Systems Engineering System Design Fuel Integration Problem Solving Energy Automotive Requirements Analysis Research Microsoft Office MS Project APQP Documentation Prototyping Team Building Data Acquisition Technology Development Design of Experiments Engineering Management Root Cause Analysis Hybrid Process Engineering Continuous Improvement Heat Transfer Failure Analysis Process Development Process Control Reliability Alternative Energy Product Design Project Engineering Cross-functional Team... Team Leadership Commercialization Electric Vehicles Cost Reduction Project Planning Commissioning Combustion See 35+     See less Hydrogen Fuel Cells Thermodynamics Engineering FMEA Materials Testing R&D Renewable Energy Product Development ISO Systems Engineering System Design Fuel Integration Problem Solving Energy Automotive Requirements Analysis Research Microsoft Office MS Project APQP Documentation Prototyping Team Building Data Acquisition Technology Development Design of Experiments Engineering Management Root Cause Analysis Hybrid Process Engineering Continuous Improvement Heat Transfer Failure Analysis Process Development Process Control Reliability Alternative Energy Product Design Project Engineering Cross-functional Team... Team Leadership Commercialization Electric Vehicles Cost Reduction Project Planning Commissioning Combustion See 35+     See less Hydrogen Fuel Cells Thermodynamics Engineering FMEA Materials Testing R&D Renewable Energy Product Development ISO Systems Engineering System Design Fuel Integration Problem Solving Energy Automotive Requirements Analysis Research Microsoft Office MS Project APQP Documentation Prototyping Team Building Data Acquisition Technology Development Design of Experiments Engineering Management Root Cause Analysis Hybrid Process Engineering Continuous Improvement Heat Transfer Failure Analysis Process Development Process Control Reliability Alternative Energy Product Design Project Engineering Cross-functional Team... Team Leadership Commercialization Electric Vehicles Cost Reduction Project Planning Commissioning Combustion See 35+     See less Education Technical University of Silesia Doctorate of Philosophy,  Mechanical Engineering 1978  – 1982 Mechanical and Power Engineering Department. Dissertation: Investigations of Coal-in-Oil Fuel Viscosity. Technical University of Silesia Master of Science,  Mechanical Engineering 1972  – 1978 Mechanical and Power Engineering Department.  \nThesis: Investigations of the Methods of Preparation and Combustion of Coal-in-Oil Fuels in Industrial Furnaces. Simon Fraser University Technical University of Silesia Doctorate of Philosophy,  Mechanical Engineering 1978  – 1982 Mechanical and Power Engineering Department. Dissertation: Investigations of Coal-in-Oil Fuel Viscosity. Technical University of Silesia Doctorate of Philosophy,  Mechanical Engineering 1978  – 1982 Mechanical and Power Engineering Department. Dissertation: Investigations of Coal-in-Oil Fuel Viscosity. Technical University of Silesia Doctorate of Philosophy,  Mechanical Engineering 1978  – 1982 Mechanical and Power Engineering Department. Dissertation: Investigations of Coal-in-Oil Fuel Viscosity. Technical University of Silesia Master of Science,  Mechanical Engineering 1972  – 1978 Mechanical and Power Engineering Department.  \nThesis: Investigations of the Methods of Preparation and Combustion of Coal-in-Oil Fuels in Industrial Furnaces. Technical University of Silesia Master of Science,  Mechanical Engineering 1972  – 1978 Mechanical and Power Engineering Department.  \nThesis: Investigations of the Methods of Preparation and Combustion of Coal-in-Oil Fuels in Industrial Furnaces. Technical University of Silesia Master of Science,  Mechanical Engineering 1972  – 1978 Mechanical and Power Engineering Department.  \nThesis: Investigations of the Methods of Preparation and Combustion of Coal-in-Oil Fuels in Industrial Furnaces. Simon Fraser University Simon Fraser University Simon Fraser University Honors & Awards Additional Honors & Awards - Ballard Award of Excellence (2008) ;Customer Success -BC Transit Bus Program Team; \n- Ballard Award of Excellence (2006) ;P5 Fuel Cell Bus Program Team; \n- Ballard Award of Excellence (2001) ;Teamwork - P5 Bus Program; \n \nUS Patents \n1. 7, 309, 537 Fuel cell system with fluid stream recirculation  \n2. 6, 926, 987 Fuel cell system and method for operating the same  \n3. 6, 699, 608 Method and apparatus for humidifying a gas flow... \n \nPatent PUB. APP. NO. Title \n \n1. 20090047551 Methods of operating Fuel Cell systems ... \n2. 20080213635 System and method of purging fuel cell stacks  \n3. 20080187788 System and method of operation of a fuel cell system .... \n4. 20070281201 Fuel Release Management ... \n5. 20070248858 Fuel cell system with improved fuel recirculation  \n6. 20070087233 System and method of controlling fuel cell shutdown  \n7. 20020053368 Apparatus and method for filling a tank... \n8. 20020041823 Storage tank for a gaseous medium Additional Honors & Awards - Ballard Award of Excellence (2008) ;Customer Success -BC Transit Bus Program Team; \n- Ballard Award of Excellence (2006) ;P5 Fuel Cell Bus Program Team; \n- Ballard Award of Excellence (2001) ;Teamwork - P5 Bus Program; \n \nUS Patents \n1. 7, 309, 537 Fuel cell system with fluid stream recirculation  \n2. 6, 926, 987 Fuel cell system and method for operating the same  \n3. 6, 699, 608 Method and apparatus for humidifying a gas flow... \n \nPatent PUB. APP. NO. Title \n \n1. 20090047551 Methods of operating Fuel Cell systems ... \n2. 20080213635 System and method of purging fuel cell stacks  \n3. 20080187788 System and method of operation of a fuel cell system .... \n4. 20070281201 Fuel Release Management ... \n5. 20070248858 Fuel cell system with improved fuel recirculation  \n6. 20070087233 System and method of controlling fuel cell shutdown  \n7. 20020053368 Apparatus and method for filling a tank... \n8. 20020041823 Storage tank for a gaseous medium Additional Honors & Awards - Ballard Award of Excellence (2008) ;Customer Success -BC Transit Bus Program Team; \n- Ballard Award of Excellence (2006) ;P5 Fuel Cell Bus Program Team; \n- Ballard Award of Excellence (2001) ;Teamwork - P5 Bus Program; \n \nUS Patents \n1. 7, 309, 537 Fuel cell system with fluid stream recirculation  \n2. 6, 926, 987 Fuel cell system and method for operating the same  \n3. 6, 699, 608 Method and apparatus for humidifying a gas flow... \n \nPatent PUB. APP. NO. Title \n \n1. 20090047551 Methods of operating Fuel Cell systems ... \n2. 20080213635 System and method of purging fuel cell stacks  \n3. 20080187788 System and method of operation of a fuel cell system .... \n4. 20070281201 Fuel Release Management ... \n5. 20070248858 Fuel cell system with improved fuel recirculation  \n6. 20070087233 System and method of controlling fuel cell shutdown  \n7. 20020053368 Apparatus and method for filling a tank... \n8. 20020041823 Storage tank for a gaseous medium Additional Honors & Awards - Ballard Award of Excellence (2008) ;Customer Success -BC Transit Bus Program Team; \n- Ballard Award of Excellence (2006) ;P5 Fuel Cell Bus Program Team; \n- Ballard Award of Excellence (2001) ;Teamwork - P5 Bus Program; \n \nUS Patents \n1. 7, 309, 537 Fuel cell system with fluid stream recirculation  \n2. 6, 926, 987 Fuel cell system and method for operating the same  \n3. 6, 699, 608 Method and apparatus for humidifying a gas flow... \n \nPatent PUB. APP. NO. Title \n \n1. 20090047551 Methods of operating Fuel Cell systems ... \n2. 20080213635 System and method of purging fuel cell stacks  \n3. 20080187788 System and method of operation of a fuel cell system .... \n4. 20070281201 Fuel Release Management ... \n5. 20070248858 Fuel cell system with improved fuel recirculation  \n6. 20070087233 System and method of controlling fuel cell shutdown  \n7. 20020053368 Apparatus and method for filling a tank... \n8. 20020041823 Storage tank for a gaseous medium ", "Summary I have built large scale distributed software systems in the areas of Recommender Systems, Information Retrieval, Text/Data Mining, and Machine Learning to improve product discovery and selection at Amazon.com.  \n \nMy technical experience includes developing Recommender systems, machine learning, web crawlers, scrapers, text classifiers, product matching, large scale distributed transaction processing and search engines  \n \nOver the years, i have engineered several mining algorithms to improve product pricing. In addition, I enhanced search/browse experience for Amazon.com customers by reducing duplicate search results and finding related product advertisements.  \n \nI am also very passionate about hiring and mentoring. I was recognized by my director for my interviewing skills and was nominated and trained to lead interview panels at Amazon.com  \n \nAt SensorLogic, I was voted the best employee for my leadership and engineering contributions while developing the Machine to Machine (M2M) platform aimed at monitoring soft real time systems.  \n \nMy career growth can be attributed to  \n1. Strong bias towards innovation and algorithmic solutions to difficult problems while keeping things simple. \n2. Consistent delivery of projects with no defects on or before deadline  \n3. Maintaining high quality bar for me and my organization \n4. Making data driven decisions \n \nSpecialties: Java, Distributed Systems, Software Architecture, Text mining, Information Retrieval, Recommender Systems, Machine Learning, Artificial Intelligence Summary I have built large scale distributed software systems in the areas of Recommender Systems, Information Retrieval, Text/Data Mining, and Machine Learning to improve product discovery and selection at Amazon.com.  \n \nMy technical experience includes developing Recommender systems, machine learning, web crawlers, scrapers, text classifiers, product matching, large scale distributed transaction processing and search engines  \n \nOver the years, i have engineered several mining algorithms to improve product pricing. In addition, I enhanced search/browse experience for Amazon.com customers by reducing duplicate search results and finding related product advertisements.  \n \nI am also very passionate about hiring and mentoring. I was recognized by my director for my interviewing skills and was nominated and trained to lead interview panels at Amazon.com  \n \nAt SensorLogic, I was voted the best employee for my leadership and engineering contributions while developing the Machine to Machine (M2M) platform aimed at monitoring soft real time systems.  \n \nMy career growth can be attributed to  \n1. Strong bias towards innovation and algorithmic solutions to difficult problems while keeping things simple. \n2. Consistent delivery of projects with no defects on or before deadline  \n3. Maintaining high quality bar for me and my organization \n4. Making data driven decisions \n \nSpecialties: Java, Distributed Systems, Software Architecture, Text mining, Information Retrieval, Recommender Systems, Machine Learning, Artificial Intelligence I have built large scale distributed software systems in the areas of Recommender Systems, Information Retrieval, Text/Data Mining, and Machine Learning to improve product discovery and selection at Amazon.com.  \n \nMy technical experience includes developing Recommender systems, machine learning, web crawlers, scrapers, text classifiers, product matching, large scale distributed transaction processing and search engines  \n \nOver the years, i have engineered several mining algorithms to improve product pricing. In addition, I enhanced search/browse experience for Amazon.com customers by reducing duplicate search results and finding related product advertisements.  \n \nI am also very passionate about hiring and mentoring. I was recognized by my director for my interviewing skills and was nominated and trained to lead interview panels at Amazon.com  \n \nAt SensorLogic, I was voted the best employee for my leadership and engineering contributions while developing the Machine to Machine (M2M) platform aimed at monitoring soft real time systems.  \n \nMy career growth can be attributed to  \n1. Strong bias towards innovation and algorithmic solutions to difficult problems while keeping things simple. \n2. Consistent delivery of projects with no defects on or before deadline  \n3. Maintaining high quality bar for me and my organization \n4. Making data driven decisions \n \nSpecialties: Java, Distributed Systems, Software Architecture, Text mining, Information Retrieval, Recommender Systems, Machine Learning, Artificial Intelligence I have built large scale distributed software systems in the areas of Recommender Systems, Information Retrieval, Text/Data Mining, and Machine Learning to improve product discovery and selection at Amazon.com.  \n \nMy technical experience includes developing Recommender systems, machine learning, web crawlers, scrapers, text classifiers, product matching, large scale distributed transaction processing and search engines  \n \nOver the years, i have engineered several mining algorithms to improve product pricing. In addition, I enhanced search/browse experience for Amazon.com customers by reducing duplicate search results and finding related product advertisements.  \n \nI am also very passionate about hiring and mentoring. I was recognized by my director for my interviewing skills and was nominated and trained to lead interview panels at Amazon.com  \n \nAt SensorLogic, I was voted the best employee for my leadership and engineering contributions while developing the Machine to Machine (M2M) platform aimed at monitoring soft real time systems.  \n \nMy career growth can be attributed to  \n1. Strong bias towards innovation and algorithmic solutions to difficult problems while keeping things simple. \n2. Consistent delivery of projects with no defects on or before deadline  \n3. Maintaining high quality bar for me and my organization \n4. Making data driven decisions \n \nSpecialties: Java, Distributed Systems, Software Architecture, Text mining, Information Retrieval, Recommender Systems, Machine Learning, Artificial Intelligence Experience Principal Software Engineer Amazon.com March 2015  – Present (6 months) Seattle Principal Applied Scientist (Machine Learning) Amazon.com March 2015  – Present (6 months) Seattle Senior Software Development Engineer Amazon.com February 2010  –  October 2014  (4 years 9 months) Greater Seattle Area Senior Software Development Engineer Amazon.com April 2009  –  February 2010  (11 months) Chennai Area, India Software Development Engineer Amazon.com February 2008  –  April 2009  (1 year 3 months) Chennai Area, India Software Development Engineer Amazon.com November 2006  –  January 2008  (1 year 3 months) Software Design Engineer SensorLogic May 2004  –  November 2006  (2 years 7 months) Software Engineering Intern SensorLogic January 2004  –  May 2004  (5 months) Worked with the development team to design and develop a Message Oriented Multi Agent System in Java to remotely monitor devices. Principal Software Engineer Amazon.com March 2015  – Present (6 months) Seattle Principal Software Engineer Amazon.com March 2015  – Present (6 months) Seattle Principal Applied Scientist (Machine Learning) Amazon.com March 2015  – Present (6 months) Seattle Principal Applied Scientist (Machine Learning) Amazon.com March 2015  – Present (6 months) Seattle Senior Software Development Engineer Amazon.com February 2010  –  October 2014  (4 years 9 months) Greater Seattle Area Senior Software Development Engineer Amazon.com February 2010  –  October 2014  (4 years 9 months) Greater Seattle Area Senior Software Development Engineer Amazon.com April 2009  –  February 2010  (11 months) Chennai Area, India Senior Software Development Engineer Amazon.com April 2009  –  February 2010  (11 months) Chennai Area, India Software Development Engineer Amazon.com February 2008  –  April 2009  (1 year 3 months) Chennai Area, India Software Development Engineer Amazon.com February 2008  –  April 2009  (1 year 3 months) Chennai Area, India Software Development Engineer Amazon.com November 2006  –  January 2008  (1 year 3 months) Software Development Engineer Amazon.com November 2006  –  January 2008  (1 year 3 months) Software Design Engineer SensorLogic May 2004  –  November 2006  (2 years 7 months) Software Design Engineer SensorLogic May 2004  –  November 2006  (2 years 7 months) Software Engineering Intern SensorLogic January 2004  –  May 2004  (5 months) Worked with the development team to design and develop a Message Oriented Multi Agent System in Java to remotely monitor devices. Software Engineering Intern SensorLogic January 2004  –  May 2004  (5 months) Worked with the development team to design and develop a Message Oriented Multi Agent System in Java to remotely monitor devices. Languages Tamil Hindi Tamil Hindi Tamil Hindi Skills Distributed Systems Machine Learning Java Information Retrieval Algorithms Software Design Artificial Intelligence Software Development Data Mining Linux User Interface Design Text Mining Object Oriented Design Technical Leadership Enterprise Software Architecture JavaScript Agile Methodologies SOA Hadoop Oracle Mentoring Big Data Transaction Processing Web Scraping Recommender Systems Web Crawling Text Classification Deep Learning Neural Networks See 15+     See less Skills  Distributed Systems Machine Learning Java Information Retrieval Algorithms Software Design Artificial Intelligence Software Development Data Mining Linux User Interface Design Text Mining Object Oriented Design Technical Leadership Enterprise Software Architecture JavaScript Agile Methodologies SOA Hadoop Oracle Mentoring Big Data Transaction Processing Web Scraping Recommender Systems Web Crawling Text Classification Deep Learning Neural Networks See 15+     See less Distributed Systems Machine Learning Java Information Retrieval Algorithms Software Design Artificial Intelligence Software Development Data Mining Linux User Interface Design Text Mining Object Oriented Design Technical Leadership Enterprise Software Architecture JavaScript Agile Methodologies SOA Hadoop Oracle Mentoring Big Data Transaction Processing Web Scraping Recommender Systems Web Crawling Text Classification Deep Learning Neural Networks See 15+     See less Distributed Systems Machine Learning Java Information Retrieval Algorithms Software Design Artificial Intelligence Software Development Data Mining Linux User Interface Design Text Mining Object Oriented Design Technical Leadership Enterprise Software Architecture JavaScript Agile Methodologies SOA Hadoop Oracle Mentoring Big Data Transaction Processing Web Scraping Recommender Systems Web Crawling Text Classification Deep Learning Neural Networks See 15+     See less Education University of Texas at Arlington M.S,  Computer Science August 2002  – May 2004 University of Texas at Arlington M.S,  Civil Engineering August 2000  – May 2002 Bharath Engineering College B.E,  Civil Engineering August 1996  – May 2000 NIIT 1997  – 2000 Shrine Vailankanni University of Texas at Arlington M.S,  Computer Science August 2002  – May 2004 University of Texas at Arlington M.S,  Computer Science August 2002  – May 2004 University of Texas at Arlington M.S,  Computer Science August 2002  – May 2004 University of Texas at Arlington M.S,  Civil Engineering August 2000  – May 2002 University of Texas at Arlington M.S,  Civil Engineering August 2000  – May 2002 University of Texas at Arlington M.S,  Civil Engineering August 2000  – May 2002 Bharath Engineering College B.E,  Civil Engineering August 1996  – May 2000 Bharath Engineering College B.E,  Civil Engineering August 1996  – May 2000 Bharath Engineering College B.E,  Civil Engineering August 1996  – May 2000 NIIT 1997  – 2000 NIIT 1997  – 2000 NIIT 1997  – 2000 Shrine Vailankanni Shrine Vailankanni Shrine Vailankanni ", "Summary Seasoned professional in quantitative analysis and statistical modeling in a variety of areas including internet behavioral targeting, credit/debit card and online banking fraud detection, and risk management. Specialties:Behavioral targeting, Fraud detection, risk management, data mining, business intelligence, data driven predictive modeling Summary Seasoned professional in quantitative analysis and statistical modeling in a variety of areas including internet behavioral targeting, credit/debit card and online banking fraud detection, and risk management. Specialties:Behavioral targeting, Fraud detection, risk management, data mining, business intelligence, data driven predictive modeling Seasoned professional in quantitative analysis and statistical modeling in a variety of areas including internet behavioral targeting, credit/debit card and online banking fraud detection, and risk management. Specialties:Behavioral targeting, Fraud detection, risk management, data mining, business intelligence, data driven predictive modeling Seasoned professional in quantitative analysis and statistical modeling in a variety of areas including internet behavioral targeting, credit/debit card and online banking fraud detection, and risk management. Specialties:Behavioral targeting, Fraud detection, risk management, data mining, business intelligence, data driven predictive modeling Experience Director Alibaba Group October 2014  – Present (11 months) China Principal Applied Scientist / Principal Development Lead Microsoft April 2013  –  October 2014  (1 year 7 months) Principal Scientist Opera Solutions September 2011  –  April 2013  (1 year 8 months) Greater San Diego Area Research Scientist Yahoo! July 2008  –  September 2011  (3 years 3 months) Building behavioral targeting models for display advertisement. Lead Scientist Fair Isaac Corp. July 2003  –  July 2008  (5 years 1 month) Designing and developing data-driven predictive models for credit card, debit card and online access fraud detection using the latest technologies in neural networks, machine learning, statistical modeling, pattern recognition, and artificial intelligence. Research Intern NEC USA C&C Research Laboratories April 2002  –  December 2002  (9 months) Research Intern IBM T.J. Watson Research Center May 2000  –  August 2000  (4 months) Director Alibaba Group October 2014  – Present (11 months) China Director Alibaba Group October 2014  – Present (11 months) China Principal Applied Scientist / Principal Development Lead Microsoft April 2013  –  October 2014  (1 year 7 months) Principal Applied Scientist / Principal Development Lead Microsoft April 2013  –  October 2014  (1 year 7 months) Principal Scientist Opera Solutions September 2011  –  April 2013  (1 year 8 months) Greater San Diego Area Principal Scientist Opera Solutions September 2011  –  April 2013  (1 year 8 months) Greater San Diego Area Research Scientist Yahoo! July 2008  –  September 2011  (3 years 3 months) Building behavioral targeting models for display advertisement. Research Scientist Yahoo! July 2008  –  September 2011  (3 years 3 months) Building behavioral targeting models for display advertisement. Lead Scientist Fair Isaac Corp. July 2003  –  July 2008  (5 years 1 month) Designing and developing data-driven predictive models for credit card, debit card and online access fraud detection using the latest technologies in neural networks, machine learning, statistical modeling, pattern recognition, and artificial intelligence. Lead Scientist Fair Isaac Corp. July 2003  –  July 2008  (5 years 1 month) Designing and developing data-driven predictive models for credit card, debit card and online access fraud detection using the latest technologies in neural networks, machine learning, statistical modeling, pattern recognition, and artificial intelligence. Research Intern NEC USA C&C Research Laboratories April 2002  –  December 2002  (9 months) Research Intern NEC USA C&C Research Laboratories April 2002  –  December 2002  (9 months) Research Intern IBM T.J. Watson Research Center May 2000  –  August 2000  (4 months) Research Intern IBM T.J. Watson Research Center May 2000  –  August 2000  (4 months) Skills Data Mining Fraud Business Intelligence Risk Management Behavioral Targeting Predictive Modeling Predictive Analytics Machine Learning Statistical Modeling Analytics Pattern Recognition Neural Networks Artificial Intelligence Quantitative Analysis Hadoop Logistic Regression Big Data Text Mining Algorithms Natural Language... Quantitative Analytics R See 7+     See less Skills  Data Mining Fraud Business Intelligence Risk Management Behavioral Targeting Predictive Modeling Predictive Analytics Machine Learning Statistical Modeling Analytics Pattern Recognition Neural Networks Artificial Intelligence Quantitative Analysis Hadoop Logistic Regression Big Data Text Mining Algorithms Natural Language... Quantitative Analytics R See 7+     See less Data Mining Fraud Business Intelligence Risk Management Behavioral Targeting Predictive Modeling Predictive Analytics Machine Learning Statistical Modeling Analytics Pattern Recognition Neural Networks Artificial Intelligence Quantitative Analysis Hadoop Logistic Regression Big Data Text Mining Algorithms Natural Language... Quantitative Analytics R See 7+     See less Data Mining Fraud Business Intelligence Risk Management Behavioral Targeting Predictive Modeling Predictive Analytics Machine Learning Statistical Modeling Analytics Pattern Recognition Neural Networks Artificial Intelligence Quantitative Analysis Hadoop Logistic Regression Big Data Text Mining Algorithms Natural Language... Quantitative Analytics R See 7+     See less Education University of Illinois at Urbana-Champaign Ph.D.,  Electrical and Computer Engineering 1997  – 2003 Tsinghua University BE,  Electrical Engineering -- Biomedical Engineering 1990  – 1995 University of Illinois at Urbana-Champaign Ph.D.,  Electrical and Computer Engineering 1997  – 2003 University of Illinois at Urbana-Champaign Ph.D.,  Electrical and Computer Engineering 1997  – 2003 University of Illinois at Urbana-Champaign Ph.D.,  Electrical and Computer Engineering 1997  – 2003 Tsinghua University BE,  Electrical Engineering -- Biomedical Engineering 1990  – 1995 Tsinghua University BE,  Electrical Engineering -- Biomedical Engineering 1990  – 1995 Tsinghua University BE,  Electrical Engineering -- Biomedical Engineering 1990  – 1995 ", "Skills Product Development Engineering Mechanical Engineering Failure Analysis FMEA Systems Engineering Alternative Energy Fuel Cells Functional Management Technology Product... Materials Development R&D Technical Leadership Hands-on Technical... Materials Engineering Management HEV See 2+     See less Skills  Product Development Engineering Mechanical Engineering Failure Analysis FMEA Systems Engineering Alternative Energy Fuel Cells Functional Management Technology Product... Materials Development R&D Technical Leadership Hands-on Technical... Materials Engineering Management HEV See 2+     See less Product Development Engineering Mechanical Engineering Failure Analysis FMEA Systems Engineering Alternative Energy Fuel Cells Functional Management Technology Product... Materials Development R&D Technical Leadership Hands-on Technical... Materials Engineering Management HEV See 2+     See less Product Development Engineering Mechanical Engineering Failure Analysis FMEA Systems Engineering Alternative Energy Fuel Cells Functional Management Technology Product... Materials Development R&D Technical Leadership Hands-on Technical... Materials Engineering Management HEV See 2+     See less ", "Summary Specialties:Information Extraction, Natural Language Processing, Machine Learning Summary Specialties:Information Extraction, Natural Language Processing, Machine Learning Specialties:Information Extraction, Natural Language Processing, Machine Learning Specialties:Information Extraction, Natural Language Processing, Machine Learning Experience Principal Applied Scientist, Bing Relevance and Intent Microsoft September 2014  – Present (1 year) Bellevue, WA I develop scalable techniques for language understanding to support web and mobile search. Senior Applied Scientist, Bing Relevance Sciences Microsoft August 2013  –  September 2014  (1 year 2 months) Bellevue, WA Senior Development Lead Microsoft June 2011  –  August 2013  (2 years 3 months) Bellevue, WA Engineering lead for Query Understanding and Selection for Bing Ads. Senior Software Engineer Wavii, Inc. November 2009  –  April 2011  (1 year 6 months) Acquired by Google Applied Scientist EVRI.com January 2009  –  November 2009  (11 months) PhD Student University of Washington, Department of Computer Science September 2004  –  March 2009  (4 years 7 months) Software Engineering Intern Google 2008  –  2008  (less than a year) Research Engineer Microsoft Research January 2001  –  June 2004  (3 years 6 months) Principal Applied Scientist, Bing Relevance and Intent Microsoft September 2014  – Present (1 year) Bellevue, WA I develop scalable techniques for language understanding to support web and mobile search. Principal Applied Scientist, Bing Relevance and Intent Microsoft September 2014  – Present (1 year) Bellevue, WA I develop scalable techniques for language understanding to support web and mobile search. Senior Applied Scientist, Bing Relevance Sciences Microsoft August 2013  –  September 2014  (1 year 2 months) Bellevue, WA Senior Applied Scientist, Bing Relevance Sciences Microsoft August 2013  –  September 2014  (1 year 2 months) Bellevue, WA Senior Development Lead Microsoft June 2011  –  August 2013  (2 years 3 months) Bellevue, WA Engineering lead for Query Understanding and Selection for Bing Ads. Senior Development Lead Microsoft June 2011  –  August 2013  (2 years 3 months) Bellevue, WA Engineering lead for Query Understanding and Selection for Bing Ads. Senior Software Engineer Wavii, Inc. November 2009  –  April 2011  (1 year 6 months) Acquired by Google Senior Software Engineer Wavii, Inc. November 2009  –  April 2011  (1 year 6 months) Acquired by Google Applied Scientist EVRI.com January 2009  –  November 2009  (11 months) Applied Scientist EVRI.com January 2009  –  November 2009  (11 months) PhD Student University of Washington, Department of Computer Science September 2004  –  March 2009  (4 years 7 months) PhD Student University of Washington, Department of Computer Science September 2004  –  March 2009  (4 years 7 months) Software Engineering Intern Google 2008  –  2008  (less than a year) Software Engineering Intern Google 2008  –  2008  (less than a year) Research Engineer Microsoft Research January 2001  –  June 2004  (3 years 6 months) Research Engineer Microsoft Research January 2001  –  June 2004  (3 years 6 months) Skills Natural Language... Information Extraction Text Mining Information Retrieval Machine Learning Skills  Natural Language... Information Extraction Text Mining Information Retrieval Machine Learning Natural Language... Information Extraction Text Mining Information Retrieval Machine Learning Natural Language... Information Extraction Text Mining Information Retrieval Machine Learning Education University of Washington PhD,  Computer Science 2004  – 2009 University of Washington M.S.,  Computer Science 2004  – 2006 Carnegie Mellon University B.S.,  Logic and Computation 1995  – 1999 University of Washington PhD,  Computer Science 2004  – 2009 University of Washington PhD,  Computer Science 2004  – 2009 University of Washington PhD,  Computer Science 2004  – 2009 University of Washington M.S.,  Computer Science 2004  – 2006 University of Washington M.S.,  Computer Science 2004  – 2006 University of Washington M.S.,  Computer Science 2004  – 2006 Carnegie Mellon University B.S.,  Logic and Computation 1995  – 1999 Carnegie Mellon University B.S.,  Logic and Computation 1995  – 1999 Carnegie Mellon University B.S.,  Logic and Computation 1995  – 1999 Honors & Awards Additional Honors & Awards Google Anita Borg Fellowship 2006-2007 \nYahoo! Research Key Technical Challenges Grant 2007-2008 Additional Honors & Awards Google Anita Borg Fellowship 2006-2007 \nYahoo! Research Key Technical Challenges Grant 2007-2008 Additional Honors & Awards Google Anita Borg Fellowship 2006-2007 \nYahoo! Research Key Technical Challenges Grant 2007-2008 Additional Honors & Awards Google Anita Borg Fellowship 2006-2007 \nYahoo! Research Key Technical Challenges Grant 2007-2008 ", "Experience General Manager PING AN INSURANCE (GROUP) COMPANY OF CHINA, LTD March 2015  – Present (6 months) Shanghai/Shenzhen, China General Manager PING AN INSURANCE (GROUP) COMPANY OF CHINA, LTD March 2015  – Present (6 months) Shanghai/Shenzhen, China General Manager PING AN INSURANCE (GROUP) COMPANY OF CHINA, LTD March 2015  – Present (6 months) Shanghai/Shenzhen, China Languages Chinese English Chinese English Chinese English Skills Algorithms Robotics Computer Science Computer Vision Image Processing Machine Learning Pattern Recognition C++ Matlab C Data Mining Statistics Optimization Signal Processing Medical Imaging Imaging R&D Research Product Management Visual Studio Analysis Information Retrieval Artificial Intelligence Digital Imaging OpenCV Optimizations Perl Sensors Image Analysis Software Engineering Human Computer... Programming Distributed Systems LaTeX Algorithm Design Embedded Software System Architecture Mathematical Modeling Visual C  Cloud Computing Video Processing See 26+     See less Skills  Algorithms Robotics Computer Science Computer Vision Image Processing Machine Learning Pattern Recognition C++ Matlab C Data Mining Statistics Optimization Signal Processing Medical Imaging Imaging R&D Research Product Management Visual Studio Analysis Information Retrieval Artificial Intelligence Digital Imaging OpenCV Optimizations Perl Sensors Image Analysis Software Engineering Human Computer... Programming Distributed Systems LaTeX Algorithm Design Embedded Software System Architecture Mathematical Modeling Visual C  Cloud Computing Video Processing See 26+     See less Algorithms Robotics Computer Science Computer Vision Image Processing Machine Learning Pattern Recognition C++ Matlab C Data Mining Statistics Optimization Signal Processing Medical Imaging Imaging R&D Research Product Management Visual Studio Analysis Information Retrieval Artificial Intelligence Digital Imaging OpenCV Optimizations Perl Sensors Image Analysis Software Engineering Human Computer... Programming Distributed Systems LaTeX Algorithm Design Embedded Software System Architecture Mathematical Modeling Visual C  Cloud Computing Video Processing See 26+     See less Algorithms Robotics Computer Science Computer Vision Image Processing Machine Learning Pattern Recognition C++ Matlab C Data Mining Statistics Optimization Signal Processing Medical Imaging Imaging R&D Research Product Management Visual Studio Analysis Information Retrieval Artificial Intelligence Digital Imaging OpenCV Optimizations Perl Sensors Image Analysis Software Engineering Human Computer... Programming Distributed Systems LaTeX Algorithm Design Embedded Software System Architecture Mathematical Modeling Visual C  Cloud Computing Video Processing See 26+     See less Education Carnegie Mellon University PHD 1999  – 2005 Chinese Academy of Sciences MS 1996  – 1999 University of Science and Technology of China BS 1991  – 1996 Carnegie Mellon University PHD 1999  – 2005 Carnegie Mellon University PHD 1999  – 2005 Carnegie Mellon University PHD 1999  – 2005 Chinese Academy of Sciences MS 1996  – 1999 Chinese Academy of Sciences MS 1996  – 1999 Chinese Academy of Sciences MS 1996  – 1999 University of Science and Technology of China BS 1991  – 1996 University of Science and Technology of China BS 1991  – 1996 University of Science and Technology of China BS 1991  – 1996 ", "Experience Principal Applied Scientist Lead Microsoft November 2014  – Present (10 months) San Francisco Bay Area Founder Vaidika Vignanam (www.vignanam.org) January 2010  – Present (5 years 8 months) Senior Research Development Lead Microsoft August 2013  –  November 2014  (1 year 4 months) San Francisco Bay Area Senior SDE / Applied Researcher Microsoft April 2012  –  August 2013  (1 year 5 months) San Francisco Bay Area Senior Research Scientist Yahoo! Labs April 2007  –  April 2012  (5 years 1 month) San Francisco Bay Area Intern - Windows Live Search Microsoft May 2006  –  August 2006  (4 months) Intern - MSN Search Microsoft June 2005  –  August 2005  (3 months) Research Scientist - Innovation Center Humana May 2004  –  December 2004  (8 months) Principal Applied Scientist Lead Microsoft November 2014  – Present (10 months) San Francisco Bay Area Principal Applied Scientist Lead Microsoft November 2014  – Present (10 months) San Francisco Bay Area Founder Vaidika Vignanam (www.vignanam.org) January 2010  – Present (5 years 8 months) Founder Vaidika Vignanam (www.vignanam.org) January 2010  – Present (5 years 8 months) Senior Research Development Lead Microsoft August 2013  –  November 2014  (1 year 4 months) San Francisco Bay Area Senior Research Development Lead Microsoft August 2013  –  November 2014  (1 year 4 months) San Francisco Bay Area Senior SDE / Applied Researcher Microsoft April 2012  –  August 2013  (1 year 5 months) San Francisco Bay Area Senior SDE / Applied Researcher Microsoft April 2012  –  August 2013  (1 year 5 months) San Francisco Bay Area Senior Research Scientist Yahoo! Labs April 2007  –  April 2012  (5 years 1 month) San Francisco Bay Area Senior Research Scientist Yahoo! Labs April 2007  –  April 2012  (5 years 1 month) San Francisco Bay Area Intern - Windows Live Search Microsoft May 2006  –  August 2006  (4 months) Intern - Windows Live Search Microsoft May 2006  –  August 2006  (4 months) Intern - MSN Search Microsoft June 2005  –  August 2005  (3 months) Intern - MSN Search Microsoft June 2005  –  August 2005  (3 months) Research Scientist - Innovation Center Humana May 2004  –  December 2004  (8 months) Research Scientist - Innovation Center Humana May 2004  –  December 2004  (8 months) Languages   Skills Machine Learning Big Data Recommender Systems Data Mining MapReduce Information Retrieval Information Extraction Hadoop Search Algorithms Natural Language... Text Mining Pattern Recognition Search Engine Ranking Web Mining Ranking Computer Science Distributed Systems See 3+     See less Skills  Machine Learning Big Data Recommender Systems Data Mining MapReduce Information Retrieval Information Extraction Hadoop Search Algorithms Natural Language... Text Mining Pattern Recognition Search Engine Ranking Web Mining Ranking Computer Science Distributed Systems See 3+     See less Machine Learning Big Data Recommender Systems Data Mining MapReduce Information Retrieval Information Extraction Hadoop Search Algorithms Natural Language... Text Mining Pattern Recognition Search Engine Ranking Web Mining Ranking Computer Science Distributed Systems See 3+     See less Machine Learning Big Data Recommender Systems Data Mining MapReduce Information Retrieval Information Extraction Hadoop Search Algorithms Natural Language... Text Mining Pattern Recognition Search Engine Ranking Web Mining Ranking Computer Science Distributed Systems See 3+     See less Education Arizona State University Ph.D. 2003  – 2007 University of Minnesota Duluth M.S. 2000  – 2002 Nagarjuna University, V.R. Siddhardha Engineering College B. Tech 1996  – 2000 Arizona State University Ph.D. 2003  – 2007 Arizona State University Ph.D. 2003  – 2007 Arizona State University Ph.D. 2003  – 2007 University of Minnesota Duluth M.S. 2000  – 2002 University of Minnesota Duluth M.S. 2000  – 2002 University of Minnesota Duluth M.S. 2000  – 2002 Nagarjuna University, V.R. Siddhardha Engineering College B. Tech 1996  – 2000 Nagarjuna University, V.R. Siddhardha Engineering College B. Tech 1996  – 2000 Nagarjuna University, V.R. Siddhardha Engineering College B. Tech 1996  – 2000 Honors & Awards You Rock! Award Yahoo! Inc. December 2010 Patent Filing Milestone Award Yahoo! Inc. October 2010 Patent Filing Milestone Award Yahoo! Inc. January 2012 You Rock! Award Yahoo! Inc. December 2010 You Rock! Award Yahoo! Inc. December 2010 You Rock! Award Yahoo! Inc. December 2010 Patent Filing Milestone Award Yahoo! Inc. October 2010 Patent Filing Milestone Award Yahoo! Inc. October 2010 Patent Filing Milestone Award Yahoo! Inc. October 2010 Patent Filing Milestone Award Yahoo! Inc. January 2012 Patent Filing Milestone Award Yahoo! Inc. January 2012 Patent Filing Milestone Award Yahoo! Inc. January 2012 ", "Summary Markus works on Skype Call Quality team committed to drive calling experience at Skype to even higher level. He is one of the key persons designing, implementating and analysing Skype's user facing Call Quality Feedback system and the massive stats it produces. He is co-author of Skype audio hardware specifications (Skype Cert. Audio specs) and creator of Skype TV audio requirements. He is actively involved on audio and video quality, machine learning, quality modeling, testing, SW planning, audio HW, key partners and university co-operations, standardization, and audio lab development. He is very motivated to improve audio quality at Skype with wide perspective. \n \nSpecialities:  \n- advanced audio testing  \n- machine learning and data analysis \n- call quality modeling and statistics \n- User and tech. based audio and video quality requirements, for example Skype TV audio requirements  \n- audio lab building & management  \n- objective speech quality tools  \n- audio research  \n- university co-operation  \n- standardization  \n- audio processing algorithms  \n- acoustics competence: room, mobile/small size, transducer - audio training  \n- management  \n- working and leading multinational and multi-site teams Summary Markus works on Skype Call Quality team committed to drive calling experience at Skype to even higher level. He is one of the key persons designing, implementating and analysing Skype's user facing Call Quality Feedback system and the massive stats it produces. He is co-author of Skype audio hardware specifications (Skype Cert. Audio specs) and creator of Skype TV audio requirements. He is actively involved on audio and video quality, machine learning, quality modeling, testing, SW planning, audio HW, key partners and university co-operations, standardization, and audio lab development. He is very motivated to improve audio quality at Skype with wide perspective. \n \nSpecialities:  \n- advanced audio testing  \n- machine learning and data analysis \n- call quality modeling and statistics \n- User and tech. based audio and video quality requirements, for example Skype TV audio requirements  \n- audio lab building & management  \n- objective speech quality tools  \n- audio research  \n- university co-operation  \n- standardization  \n- audio processing algorithms  \n- acoustics competence: room, mobile/small size, transducer - audio training  \n- management  \n- working and leading multinational and multi-site teams Markus works on Skype Call Quality team committed to drive calling experience at Skype to even higher level. He is one of the key persons designing, implementating and analysing Skype's user facing Call Quality Feedback system and the massive stats it produces. He is co-author of Skype audio hardware specifications (Skype Cert. Audio specs) and creator of Skype TV audio requirements. He is actively involved on audio and video quality, machine learning, quality modeling, testing, SW planning, audio HW, key partners and university co-operations, standardization, and audio lab development. He is very motivated to improve audio quality at Skype with wide perspective. \n \nSpecialities:  \n- advanced audio testing  \n- machine learning and data analysis \n- call quality modeling and statistics \n- User and tech. based audio and video quality requirements, for example Skype TV audio requirements  \n- audio lab building & management  \n- objective speech quality tools  \n- audio research  \n- university co-operation  \n- standardization  \n- audio processing algorithms  \n- acoustics competence: room, mobile/small size, transducer - audio training  \n- management  \n- working and leading multinational and multi-site teams Markus works on Skype Call Quality team committed to drive calling experience at Skype to even higher level. He is one of the key persons designing, implementating and analysing Skype's user facing Call Quality Feedback system and the massive stats it produces. He is co-author of Skype audio hardware specifications (Skype Cert. Audio specs) and creator of Skype TV audio requirements. He is actively involved on audio and video quality, machine learning, quality modeling, testing, SW planning, audio HW, key partners and university co-operations, standardization, and audio lab development. He is very motivated to improve audio quality at Skype with wide perspective. \n \nSpecialities:  \n- advanced audio testing  \n- machine learning and data analysis \n- call quality modeling and statistics \n- User and tech. based audio and video quality requirements, for example Skype TV audio requirements  \n- audio lab building & management  \n- objective speech quality tools  \n- audio research  \n- university co-operation  \n- standardization  \n- audio processing algorithms  \n- acoustics competence: room, mobile/small size, transducer - audio training  \n- management  \n- working and leading multinational and multi-site teams Experience Principal Applied Scientist / Researcher - Audio Quality Skype / Microsoft February 2006  – Present (9 years 7 months) Helsinki, Finland Scientist on Audio and Call quality: massive call quality data analysis. QoE model building, temporal aggregation, user based requirements, testing and analysing quality of mobile, desktop, tablet etc. devices, audio DSP development, university and partner co-operation and audio training. \n \nAlso involved in: hardware devices and SW testing, standardization, quality requirements, advanced audio testing tools, listening tests. Designed and built Skype Audio laboratory. Audio SW \n Project Manager, specialist... Nokia January 2000  –  February 2006  (6 years 2 months) Nokia Technology Platforms; Audio: Project manager, Audio quality and research: managed a 7-people team on Nokia global audio quality & testing development (2003-2004), steering of Nokia Research Center projects & subcontracting (~5 projects), audio DSP, quality and psychoacoustic related research & development, 2003 onwards  \n \nNokia Mobile Phones: Acoustic Research & Technology Access: Research engineer, Acoustic technologies: development of speech and audio enhancement algorithms, intelligibility and sound quality research, participating on steering of research projects, subjective testing, psychoacoustic, audio coding and listening test consultancy. 1.1.2000 – 2002 Researcher Acoustic lab of Helsinki University of Technology March 1998  –  December 1999  (1 year 10 months) Laboratory of Acoustics and Audio Signal Processing, Helsinki University of Technology. Researcher/research assistant: audio and speech coding, MPEG-techniques, psychoacoustics and signal processing. 1.3.1998 – 24.5.1999 (research assistant), from 24.5.1999 – 31.12.1999 as a researcher. Master's Thesis worker, part time, trainee Nokia June 1996  –  November 1997  (1 year 6 months) Nokia Research Center. Master’s thesis employee: development of speech coding methods, especially coding of linear prediction coefficients of speech spectrum, and making of listening tests. 26.5. – 12.11.1997. \n \nNokia Research Center. Trainee: speech coding, vector quantization, linear prediction methods, optimization algorithms. 3.6. – 31.8.1996 (summer job), 1.10.1996 – 31.3.1997 (part-time). Principal Applied Scientist / Researcher - Audio Quality Skype / Microsoft February 2006  – Present (9 years 7 months) Helsinki, Finland Scientist on Audio and Call quality: massive call quality data analysis. QoE model building, temporal aggregation, user based requirements, testing and analysing quality of mobile, desktop, tablet etc. devices, audio DSP development, university and partner co-operation and audio training. \n \nAlso involved in: hardware devices and SW testing, standardization, quality requirements, advanced audio testing tools, listening tests. Designed and built Skype Audio laboratory. Audio SW \n Principal Applied Scientist / Researcher - Audio Quality Skype / Microsoft February 2006  – Present (9 years 7 months) Helsinki, Finland Scientist on Audio and Call quality: massive call quality data analysis. QoE model building, temporal aggregation, user based requirements, testing and analysing quality of mobile, desktop, tablet etc. devices, audio DSP development, university and partner co-operation and audio training. \n \nAlso involved in: hardware devices and SW testing, standardization, quality requirements, advanced audio testing tools, listening tests. Designed and built Skype Audio laboratory. Audio SW \n Project Manager, specialist... Nokia January 2000  –  February 2006  (6 years 2 months) Nokia Technology Platforms; Audio: Project manager, Audio quality and research: managed a 7-people team on Nokia global audio quality & testing development (2003-2004), steering of Nokia Research Center projects & subcontracting (~5 projects), audio DSP, quality and psychoacoustic related research & development, 2003 onwards  \n \nNokia Mobile Phones: Acoustic Research & Technology Access: Research engineer, Acoustic technologies: development of speech and audio enhancement algorithms, intelligibility and sound quality research, participating on steering of research projects, subjective testing, psychoacoustic, audio coding and listening test consultancy. 1.1.2000 – 2002 Project Manager, specialist... Nokia January 2000  –  February 2006  (6 years 2 months) Nokia Technology Platforms; Audio: Project manager, Audio quality and research: managed a 7-people team on Nokia global audio quality & testing development (2003-2004), steering of Nokia Research Center projects & subcontracting (~5 projects), audio DSP, quality and psychoacoustic related research & development, 2003 onwards  \n \nNokia Mobile Phones: Acoustic Research & Technology Access: Research engineer, Acoustic technologies: development of speech and audio enhancement algorithms, intelligibility and sound quality research, participating on steering of research projects, subjective testing, psychoacoustic, audio coding and listening test consultancy. 1.1.2000 – 2002 Researcher Acoustic lab of Helsinki University of Technology March 1998  –  December 1999  (1 year 10 months) Laboratory of Acoustics and Audio Signal Processing, Helsinki University of Technology. Researcher/research assistant: audio and speech coding, MPEG-techniques, psychoacoustics and signal processing. 1.3.1998 – 24.5.1999 (research assistant), from 24.5.1999 – 31.12.1999 as a researcher. Researcher Acoustic lab of Helsinki University of Technology March 1998  –  December 1999  (1 year 10 months) Laboratory of Acoustics and Audio Signal Processing, Helsinki University of Technology. Researcher/research assistant: audio and speech coding, MPEG-techniques, psychoacoustics and signal processing. 1.3.1998 – 24.5.1999 (research assistant), from 24.5.1999 – 31.12.1999 as a researcher. Master's Thesis worker, part time, trainee Nokia June 1996  –  November 1997  (1 year 6 months) Nokia Research Center. Master’s thesis employee: development of speech coding methods, especially coding of linear prediction coefficients of speech spectrum, and making of listening tests. 26.5. – 12.11.1997. \n \nNokia Research Center. Trainee: speech coding, vector quantization, linear prediction methods, optimization algorithms. 3.6. – 31.8.1996 (summer job), 1.10.1996 – 31.3.1997 (part-time). Master's Thesis worker, part time, trainee Nokia June 1996  –  November 1997  (1 year 6 months) Nokia Research Center. Master’s thesis employee: development of speech coding methods, especially coding of linear prediction coefficients of speech spectrum, and making of listening tests. 26.5. – 12.11.1997. \n \nNokia Research Center. Trainee: speech coding, vector quantization, linear prediction methods, optimization algorithms. 3.6. – 31.8.1996 (summer job), 1.10.1996 – 31.3.1997 (part-time). Skills Audio Engineering User Experience Acoustics call quality Design Consulting Software Development Product Management Research co-operations VoIP Digital Signal... Psychoacoustics Management Call Quality Mobile Communications Algorithms Sound Audio Processing Positive Personality Mobile Devices Testing Embedded Systems Mobile Technology Consumer Electronics Signal Processing Mobile Applications System Architecture Video Symbian See 13+     See less Skills  Audio Engineering User Experience Acoustics call quality Design Consulting Software Development Product Management Research co-operations VoIP Digital Signal... Psychoacoustics Management Call Quality Mobile Communications Algorithms Sound Audio Processing Positive Personality Mobile Devices Testing Embedded Systems Mobile Technology Consumer Electronics Signal Processing Mobile Applications System Architecture Video Symbian See 13+     See less Audio Engineering User Experience Acoustics call quality Design Consulting Software Development Product Management Research co-operations VoIP Digital Signal... Psychoacoustics Management Call Quality Mobile Communications Algorithms Sound Audio Processing Positive Personality Mobile Devices Testing Embedded Systems Mobile Technology Consumer Electronics Signal Processing Mobile Applications System Architecture Video Symbian See 13+     See less Audio Engineering User Experience Acoustics call quality Design Consulting Software Development Product Management Research co-operations VoIP Digital Signal... Psychoacoustics Management Call Quality Mobile Communications Algorithms Sound Audio Processing Positive Personality Mobile Devices Testing Embedded Systems Mobile Technology Consumer Electronics Signal Processing Mobile Applications System Architecture Video Symbian See 13+     See less Education Teknillinen korkeakoulu-Tekniska högskolan Master of Science in Technology,  Electrical Engineering , Acoustic and Audio Signal Processing 1992  – 1999 Master of Science in Technology, Helsinki University of Technology, 24.5.1999. \nDepartment: Electrical and Communications Engineering, major: Acoustics and audio signal processing, minor: Information technology. Grade of degree: with Distinction (4.0/5). Master’s Thesis: Moving average vector quantization in speech coding (done at Nokia). Grade: very good (4/5). Activities and Societies:  Choir: Hämäläis-Osakunnan laulajat (acted as the host for few years and member of the board)\nStudent society for Acoustics\nStudent Theatre/Musical of Technical University: Criminuendo (1993) Teknillinen korkeakoulu-Tekniska högskolan Master of Science in Technology,  Electrical Engineering , Acoustic and Audio Signal Processing 1992  – 1999 Master of Science in Technology, Helsinki University of Technology, 24.5.1999. \nDepartment: Electrical and Communications Engineering, major: Acoustics and audio signal processing, minor: Information technology. Grade of degree: with Distinction (4.0/5). Master’s Thesis: Moving average vector quantization in speech coding (done at Nokia). Grade: very good (4/5). Activities and Societies:  Choir: Hämäläis-Osakunnan laulajat (acted as the host for few years and member of the board)\nStudent society for Acoustics\nStudent Theatre/Musical of Technical University: Criminuendo (1993) Teknillinen korkeakoulu-Tekniska högskolan Master of Science in Technology,  Electrical Engineering , Acoustic and Audio Signal Processing 1992  – 1999 Master of Science in Technology, Helsinki University of Technology, 24.5.1999. \nDepartment: Electrical and Communications Engineering, major: Acoustics and audio signal processing, minor: Information technology. Grade of degree: with Distinction (4.0/5). Master’s Thesis: Moving average vector quantization in speech coding (done at Nokia). Grade: very good (4/5). Activities and Societies:  Choir: Hämäläis-Osakunnan laulajat (acted as the host for few years and member of the board)\nStudent society for Acoustics\nStudent Theatre/Musical of Technical University: Criminuendo (1993) Teknillinen korkeakoulu-Tekniska högskolan Master of Science in Technology,  Electrical Engineering , Acoustic and Audio Signal Processing 1992  – 1999 Master of Science in Technology, Helsinki University of Technology, 24.5.1999. \nDepartment: Electrical and Communications Engineering, major: Acoustics and audio signal processing, minor: Information technology. Grade of degree: with Distinction (4.0/5). Master’s Thesis: Moving average vector quantization in speech coding (done at Nokia). Grade: very good (4/5). Activities and Societies:  Choir: Hämäläis-Osakunnan laulajat (acted as the host for few years and member of the board)\nStudent society for Acoustics\nStudent Theatre/Musical of Technical University: Criminuendo (1993) ", "Experience Senior Development Lead Microsoft February 2006  –  November 2009  (3 years 10 months) Redmond, WA Responsible for several Office365 feature components, including \n \n1. AdManager, which helps small business customers publish search ads on multiple search engines. \n2. TeleAssistant, which helps small business customers establish a toll-free number with service menu and call routing. \n3. Infrastructure components including Azure migration, service deployment, monitoring and reporting. Senior Development Lead Microsoft February 2006  –  November 2009  (3 years 10 months) Redmond, WA Responsible for several Office365 feature components, including \n \n1. AdManager, which helps small business customers publish search ads on multiple search engines. \n2. TeleAssistant, which helps small business customers establish a toll-free number with service menu and call routing. \n3. Infrastructure components including Azure migration, service deployment, monitoring and reporting. Senior Development Lead Microsoft February 2006  –  November 2009  (3 years 10 months) Redmond, WA Responsible for several Office365 feature components, including \n \n1. AdManager, which helps small business customers publish search ads on multiple search engines. \n2. TeleAssistant, which helps small business customers establish a toll-free number with service menu and call routing. \n3. Infrastructure components including Azure migration, service deployment, monitoring and reporting. Education Rochester Institute of Technology M.S.,  Computer Science 1999  – 2000 University of Rochester Materials Science 1997  – 1999 Zhejiang University 1993  – 1997 Rochester Institute of Technology M.S.,  Computer Science 1999  – 2000 Rochester Institute of Technology M.S.,  Computer Science 1999  – 2000 Rochester Institute of Technology M.S.,  Computer Science 1999  – 2000 University of Rochester Materials Science 1997  – 1999 University of Rochester Materials Science 1997  – 1999 University of Rochester Materials Science 1997  – 1999 Zhejiang University 1993  – 1997 Zhejiang University 1993  – 1997 Zhejiang University 1993  – 1997 ", "Summary Extensive experience in: \n• corrosion and its prevention. \n• metallic and non metallic materials \n• industrial water cycle chemistry \n• non-metallic material failure analysis, \n• tile and tiling failure analysis \n• design and preparation of specifications involving coating systems, remedial advice and applications for industrial plants, wharf installations and infrastructure \n• commercial aspects of forensic science \n \nMain goal is to provide my expertist to assist customers in investigating and solving their concerns relating to the above. Specialties:Expert witness in expert areas \nFailure analysis relating to coating failure and corrosion related failures \nCoating Specifications - Power Stations, Coal Handling Plants, Bus Station Network Summary Extensive experience in: \n• corrosion and its prevention. \n• metallic and non metallic materials \n• industrial water cycle chemistry \n• non-metallic material failure analysis, \n• tile and tiling failure analysis \n• design and preparation of specifications involving coating systems, remedial advice and applications for industrial plants, wharf installations and infrastructure \n• commercial aspects of forensic science \n \nMain goal is to provide my expertist to assist customers in investigating and solving their concerns relating to the above. Specialties:Expert witness in expert areas \nFailure analysis relating to coating failure and corrosion related failures \nCoating Specifications - Power Stations, Coal Handling Plants, Bus Station Network Extensive experience in: \n• corrosion and its prevention. \n• metallic and non metallic materials \n• industrial water cycle chemistry \n• non-metallic material failure analysis, \n• tile and tiling failure analysis \n• design and preparation of specifications involving coating systems, remedial advice and applications for industrial plants, wharf installations and infrastructure \n• commercial aspects of forensic science \n \nMain goal is to provide my expertist to assist customers in investigating and solving their concerns relating to the above. Specialties:Expert witness in expert areas \nFailure analysis relating to coating failure and corrosion related failures \nCoating Specifications - Power Stations, Coal Handling Plants, Bus Station Network Extensive experience in: \n• corrosion and its prevention. \n• metallic and non metallic materials \n• industrial water cycle chemistry \n• non-metallic material failure analysis, \n• tile and tiling failure analysis \n• design and preparation of specifications involving coating systems, remedial advice and applications for industrial plants, wharf installations and infrastructure \n• commercial aspects of forensic science \n \nMain goal is to provide my expertist to assist customers in investigating and solving their concerns relating to the above. Specialties:Expert witness in expert areas \nFailure analysis relating to coating failure and corrosion related failures \nCoating Specifications - Power Stations, Coal Handling Plants, Bus Station Network Experience Principal Applied Scientist ALS Industrial November 1987  – Present (27 years 10 months) Specialising in Root Cause Corrosion Investigations and problem solving, Coating Failures and Coating Specifications. Principal Applied Scientist ALS Laboratory Group 1987  – Present (28 years) Investigation Chemist Queensland Electricity Generating Board January 1974  –  November 1987  (13 years 11 months) Chemist responsible for the direction and control of investigation chemistry section, incorporating materials failures; corrosion and related failures; non-metallic and associated failures; paints, coatings and associated failures; author and responsible officer for standard paint specifications; industry representative to Federal Government Paint Committee; aqueous chemistry and chemical equilibria. Assistant Powert Station Chemist Queensland Electricity Generating Board 1972  –  1974  (2 years) Power Station (Coal fired Steam) Chemistry and water quality control (Cooling, raw, feed, steam) Research and Development Chemist Pioneer Chemicals 1971  –  1972  (1 year) Chemist responsible for the development and formulation of paints; paint exposure test facility including Atmospheric Exposure and Atlas Weatherometer, and the quality control testing of factory production. Principal Applied Scientist ALS Industrial November 1987  – Present (27 years 10 months) Specialising in Root Cause Corrosion Investigations and problem solving, Coating Failures and Coating Specifications. Principal Applied Scientist ALS Industrial November 1987  – Present (27 years 10 months) Specialising in Root Cause Corrosion Investigations and problem solving, Coating Failures and Coating Specifications. Principal Applied Scientist ALS Laboratory Group 1987  – Present (28 years) Principal Applied Scientist ALS Laboratory Group 1987  – Present (28 years) Investigation Chemist Queensland Electricity Generating Board January 1974  –  November 1987  (13 years 11 months) Chemist responsible for the direction and control of investigation chemistry section, incorporating materials failures; corrosion and related failures; non-metallic and associated failures; paints, coatings and associated failures; author and responsible officer for standard paint specifications; industry representative to Federal Government Paint Committee; aqueous chemistry and chemical equilibria. Investigation Chemist Queensland Electricity Generating Board January 1974  –  November 1987  (13 years 11 months) Chemist responsible for the direction and control of investigation chemistry section, incorporating materials failures; corrosion and related failures; non-metallic and associated failures; paints, coatings and associated failures; author and responsible officer for standard paint specifications; industry representative to Federal Government Paint Committee; aqueous chemistry and chemical equilibria. Assistant Powert Station Chemist Queensland Electricity Generating Board 1972  –  1974  (2 years) Power Station (Coal fired Steam) Chemistry and water quality control (Cooling, raw, feed, steam) Assistant Powert Station Chemist Queensland Electricity Generating Board 1972  –  1974  (2 years) Power Station (Coal fired Steam) Chemistry and water quality control (Cooling, raw, feed, steam) Research and Development Chemist Pioneer Chemicals 1971  –  1972  (1 year) Chemist responsible for the development and formulation of paints; paint exposure test facility including Atmospheric Exposure and Atlas Weatherometer, and the quality control testing of factory production. Research and Development Chemist Pioneer Chemicals 1971  –  1972  (1 year) Chemist responsible for the development and formulation of paints; paint exposure test facility including Atmospheric Exposure and Atlas Weatherometer, and the quality control testing of factory production. Skills Coatings Failure Analysis Engineering Materials Science Corrosion Chemistry Water Materials Analysis Metallurgy Root Cause Analysis Mechanical Engineering Inspection Skills  Coatings Failure Analysis Engineering Materials Science Corrosion Chemistry Water Materials Analysis Metallurgy Root Cause Analysis Mechanical Engineering Inspection Coatings Failure Analysis Engineering Materials Science Corrosion Chemistry Water Materials Analysis Metallurgy Root Cause Analysis Mechanical Engineering Inspection Coatings Failure Analysis Engineering Materials Science Corrosion Chemistry Water Materials Analysis Metallurgy Root Cause Analysis Mechanical Engineering Inspection Education Queensland Institute of Technology ( now Queensland University of Technology) Bachelor Applied Science,  Applied Chemistry - Biology Strand 1968  – 1970 Queensland Institute of Technology ( now Queensland University of Technology) Bachelor Applied Science,  Applied Chemistry - Biology Strand 1968  – 1970 Queensland Institute of Technology ( now Queensland University of Technology) Bachelor Applied Science,  Applied Chemistry - Biology Strand 1968  – 1970 Queensland Institute of Technology ( now Queensland University of Technology) Bachelor Applied Science,  Applied Chemistry - Biology Strand 1968  – 1970 ", "Summary Experienced software developer, data analyst and researcher specializing in creative, out-of-the-box thinking and pragmatic solutions to complex problems. Specialties:Information retrieval, machine learning, user data analysis, A/B experimentation, statistical analysis. Summary Experienced software developer, data analyst and researcher specializing in creative, out-of-the-box thinking and pragmatic solutions to complex problems. Specialties:Information retrieval, machine learning, user data analysis, A/B experimentation, statistical analysis. Experienced software developer, data analyst and researcher specializing in creative, out-of-the-box thinking and pragmatic solutions to complex problems. Specialties:Information retrieval, machine learning, user data analysis, A/B experimentation, statistical analysis. Experienced software developer, data analyst and researcher specializing in creative, out-of-the-box thinking and pragmatic solutions to complex problems. Specialties:Information retrieval, machine learning, user data analysis, A/B experimentation, statistical analysis. Experience Principal Applied Scientist Microsoft September 2014  – Present (1 year) Bellevue, Washington Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Senior Software Development Lead Microsoft March 2012  –  August 2014  (2 years 6 months) Bellevue, Washington Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Software Development Lead Microsoft November 2011  –  March 2012  (5 months) Bellevue, WA Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Research Software Development Engineer Microsoft June 2008  –  November 2011  (3 years 6 months) Bing Seach Engine - \nDevelopment of features including related searches, table of contents and alterions.  \n \nResponsibilities include: \n∙ Data generation and ranking using data mining and machine learning \n∙ Ensuring live-site availability and performance \n∙ Feature development driven by online experiments (A/B tests) \n∙ Defining and measuring offline relevance and quality metrics \n∙ Production coding \n \nDeveloped the QuickTabs / table of contents, “the most noticeable new feature” in the Bing launch according to the  \nNew York Times -- \nhttp://www.nytimes.com/2009/05/29/technology/companies/29soft.html -- and later highlighted with related searches -- http://www.nytimes.com/2009/07/09/technology/personaltech/09pogue.html?_r=1 Post Doctoral Scholar Case Western Reserve University June 2007  –  June 2008  (1 year 1 month) Case Center for Proteomics - Designed and developed multi domain biomedical experimentation platform via user studies and experimental analysis Principal Applied Scientist Microsoft September 2014  – Present (1 year) Bellevue, Washington Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Principal Applied Scientist Microsoft September 2014  – Present (1 year) Bellevue, Washington Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Senior Software Development Lead Microsoft March 2012  –  August 2014  (2 years 6 months) Bellevue, Washington Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Senior Software Development Lead Microsoft March 2012  –  August 2014  (2 years 6 months) Bellevue, Washington Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Software Development Lead Microsoft November 2011  –  March 2012  (5 months) Bellevue, WA Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Software Development Lead Microsoft November 2011  –  March 2012  (5 months) Bellevue, WA Lead data team which specializes in web scale data mining and data analysis powering multiple Bing web search engine features including spell correction and query expansion. Research Software Development Engineer Microsoft June 2008  –  November 2011  (3 years 6 months) Bing Seach Engine - \nDevelopment of features including related searches, table of contents and alterions.  \n \nResponsibilities include: \n∙ Data generation and ranking using data mining and machine learning \n∙ Ensuring live-site availability and performance \n∙ Feature development driven by online experiments (A/B tests) \n∙ Defining and measuring offline relevance and quality metrics \n∙ Production coding \n \nDeveloped the QuickTabs / table of contents, “the most noticeable new feature” in the Bing launch according to the  \nNew York Times -- \nhttp://www.nytimes.com/2009/05/29/technology/companies/29soft.html -- and later highlighted with related searches -- http://www.nytimes.com/2009/07/09/technology/personaltech/09pogue.html?_r=1 Research Software Development Engineer Microsoft June 2008  –  November 2011  (3 years 6 months) Bing Seach Engine - \nDevelopment of features including related searches, table of contents and alterions.  \n \nResponsibilities include: \n∙ Data generation and ranking using data mining and machine learning \n∙ Ensuring live-site availability and performance \n∙ Feature development driven by online experiments (A/B tests) \n∙ Defining and measuring offline relevance and quality metrics \n∙ Production coding \n \nDeveloped the QuickTabs / table of contents, “the most noticeable new feature” in the Bing launch according to the  \nNew York Times -- \nhttp://www.nytimes.com/2009/05/29/technology/companies/29soft.html -- and later highlighted with related searches -- http://www.nytimes.com/2009/07/09/technology/personaltech/09pogue.html?_r=1 Post Doctoral Scholar Case Western Reserve University June 2007  –  June 2008  (1 year 1 month) Case Center for Proteomics - Designed and developed multi domain biomedical experimentation platform via user studies and experimental analysis Post Doctoral Scholar Case Western Reserve University June 2007  –  June 2008  (1 year 1 month) Case Center for Proteomics - Designed and developed multi domain biomedical experimentation platform via user studies and experimental analysis Skills Machine Learning Information Retrieval Data Mining Data Analysis Statistics Distributed Systems Algorithms Software Engineering Computer Science Perl Scalability Software Design Software Development Hadoop Programming C# Artificial Intelligence Object Oriented Design C Python C++ Natural Language... High Performance... Java MapReduce Pattern Recognition Big Data See 12+     See less Skills  Machine Learning Information Retrieval Data Mining Data Analysis Statistics Distributed Systems Algorithms Software Engineering Computer Science Perl Scalability Software Design Software Development Hadoop Programming C# Artificial Intelligence Object Oriented Design C Python C++ Natural Language... High Performance... Java MapReduce Pattern Recognition Big Data See 12+     See less Machine Learning Information Retrieval Data Mining Data Analysis Statistics Distributed Systems Algorithms Software Engineering Computer Science Perl Scalability Software Design Software Development Hadoop Programming C# Artificial Intelligence Object Oriented Design C Python C++ Natural Language... High Performance... Java MapReduce Pattern Recognition Big Data See 12+     See less Machine Learning Information Retrieval Data Mining Data Analysis Statistics Distributed Systems Algorithms Software Engineering Computer Science Perl Scalability Software Design Software Development Hadoop Programming C# Artificial Intelligence Object Oriented Design C Python C++ Natural Language... High Performance... Java MapReduce Pattern Recognition Big Data See 12+     See less Education Case Western Reserve University PhD,  Computer Science 2003  – 2007 Select Publications \n \nZhang GQ, Troy A, Bourgoin K. Bootstrapping ontology learning for information retrieval using formal concept analysis. ICCS 06. Proceedings of the 14th International Conference on Conceptual Structures; 2006 July 16-21; Aalborg, Denmark. Aalborg University Press; 2006. \n \nTroy A, Zhang GQ. Enhancing relevance scoring with chronological term rank. SIGIR 07. Proceedings of the 30th Annual International ACM SIGIR Conference; 2007 July 23-27; Amsterdam. ACM Press; 2007. p. 599-606. \n \nTroy A, Zhang GQ, Tian Y. Faster concept analysis. ICCS 07. Proceedings of the 15th International Conference on Conceptual Structures; 2007 July 22-27; Sheffield, UK. Springer Lecture Notes in Computer Science 2007;4604:206-19. Miami University BS,  Systems Analysis 1999  – 2003 Case Western Reserve University PhD,  Computer Science 2003  – 2007 Select Publications \n \nZhang GQ, Troy A, Bourgoin K. Bootstrapping ontology learning for information retrieval using formal concept analysis. ICCS 06. Proceedings of the 14th International Conference on Conceptual Structures; 2006 July 16-21; Aalborg, Denmark. Aalborg University Press; 2006. \n \nTroy A, Zhang GQ. Enhancing relevance scoring with chronological term rank. SIGIR 07. Proceedings of the 30th Annual International ACM SIGIR Conference; 2007 July 23-27; Amsterdam. ACM Press; 2007. p. 599-606. \n \nTroy A, Zhang GQ, Tian Y. Faster concept analysis. ICCS 07. Proceedings of the 15th International Conference on Conceptual Structures; 2007 July 22-27; Sheffield, UK. Springer Lecture Notes in Computer Science 2007;4604:206-19. Case Western Reserve University PhD,  Computer Science 2003  – 2007 Select Publications \n \nZhang GQ, Troy A, Bourgoin K. Bootstrapping ontology learning for information retrieval using formal concept analysis. ICCS 06. Proceedings of the 14th International Conference on Conceptual Structures; 2006 July 16-21; Aalborg, Denmark. Aalborg University Press; 2006. \n \nTroy A, Zhang GQ. Enhancing relevance scoring with chronological term rank. SIGIR 07. Proceedings of the 30th Annual International ACM SIGIR Conference; 2007 July 23-27; Amsterdam. ACM Press; 2007. p. 599-606. \n \nTroy A, Zhang GQ, Tian Y. Faster concept analysis. ICCS 07. Proceedings of the 15th International Conference on Conceptual Structures; 2007 July 22-27; Sheffield, UK. Springer Lecture Notes in Computer Science 2007;4604:206-19. Case Western Reserve University PhD,  Computer Science 2003  – 2007 Select Publications \n \nZhang GQ, Troy A, Bourgoin K. Bootstrapping ontology learning for information retrieval using formal concept analysis. ICCS 06. Proceedings of the 14th International Conference on Conceptual Structures; 2006 July 16-21; Aalborg, Denmark. Aalborg University Press; 2006. \n \nTroy A, Zhang GQ. Enhancing relevance scoring with chronological term rank. SIGIR 07. Proceedings of the 30th Annual International ACM SIGIR Conference; 2007 July 23-27; Amsterdam. ACM Press; 2007. p. 599-606. \n \nTroy A, Zhang GQ, Tian Y. Faster concept analysis. ICCS 07. Proceedings of the 15th International Conference on Conceptual Structures; 2007 July 22-27; Sheffield, UK. Springer Lecture Notes in Computer Science 2007;4604:206-19. Miami University BS,  Systems Analysis 1999  – 2003 Miami University BS,  Systems Analysis 1999  – 2003 Miami University BS,  Systems Analysis 1999  – 2003 ", "Experience Senior Engineer Vail Systems 2009  – Present (6 years) Greater Chicago Area Principal Applied Scientist Dash Navigation 2007  –  2008  (1 year) Engineer Manager Vail Systems 2005  –  2007  (2 years) Greater Chicago Area Principal Applied Scientist NAVTEQ 1995  –  2005  (10 years) President Japan Technology Services 1987  –  1995  (8 years) Program Manager Motorola 1983  –  1987  (4 years) Schaumburg, IL Engineer Exxon Research & Engineering 1981  –  1982  (1 year) Florham Park, NJ Sales Engineer Yokogawa America 1980  –  1981  (1 year) Newton, GA Sales Engineer - Translator Yokogawa 1976  –  1980  (4 years) Tokyo, Japan Editor/Translator Dempa Shimbunsha 1975  –  1976  (1 year) Tokyo, Japan Electronics Technician/Instructor U.S. Coast Guard 1970  –  1974  (4 years) Various Senior Engineer Vail Systems 2009  – Present (6 years) Greater Chicago Area Senior Engineer Vail Systems 2009  – Present (6 years) Greater Chicago Area Principal Applied Scientist Dash Navigation 2007  –  2008  (1 year) Principal Applied Scientist Dash Navigation 2007  –  2008  (1 year) Engineer Manager Vail Systems 2005  –  2007  (2 years) Greater Chicago Area Engineer Manager Vail Systems 2005  –  2007  (2 years) Greater Chicago Area Principal Applied Scientist NAVTEQ 1995  –  2005  (10 years) Principal Applied Scientist NAVTEQ 1995  –  2005  (10 years) President Japan Technology Services 1987  –  1995  (8 years) President Japan Technology Services 1987  –  1995  (8 years) Program Manager Motorola 1983  –  1987  (4 years) Schaumburg, IL Program Manager Motorola 1983  –  1987  (4 years) Schaumburg, IL Engineer Exxon Research & Engineering 1981  –  1982  (1 year) Florham Park, NJ Engineer Exxon Research & Engineering 1981  –  1982  (1 year) Florham Park, NJ Sales Engineer Yokogawa America 1980  –  1981  (1 year) Newton, GA Sales Engineer Yokogawa America 1980  –  1981  (1 year) Newton, GA Sales Engineer - Translator Yokogawa 1976  –  1980  (4 years) Tokyo, Japan Sales Engineer - Translator Yokogawa 1976  –  1980  (4 years) Tokyo, Japan Editor/Translator Dempa Shimbunsha 1975  –  1976  (1 year) Tokyo, Japan Editor/Translator Dempa Shimbunsha 1975  –  1976  (1 year) Tokyo, Japan Electronics Technician/Instructor U.S. Coast Guard 1970  –  1974  (4 years) Various Electronics Technician/Instructor U.S. Coast Guard 1970  –  1974  (4 years) Various Skills Software Development Unix C VXML Perl CGI/Perl JavaScript Linux Agile Methodologies C++ SQL Software Engineering Japanese to English... Assembly Language XML Software Project... Mobile Applications Japanese Language... English to Japanese... Ruby HTML scripting GPS navigation See 7+     See less Skills  Software Development Unix C VXML Perl CGI/Perl JavaScript Linux Agile Methodologies C++ SQL Software Engineering Japanese to English... Assembly Language XML Software Project... Mobile Applications Japanese Language... English to Japanese... Ruby HTML scripting GPS navigation See 7+     See less Software Development Unix C VXML Perl CGI/Perl JavaScript Linux Agile Methodologies C++ SQL Software Engineering Japanese to English... Assembly Language XML Software Project... Mobile Applications Japanese Language... English to Japanese... Ruby HTML scripting GPS navigation See 7+     See less Software Development Unix C VXML Perl CGI/Perl JavaScript Linux Agile Methodologies C++ SQL Software Engineering Japanese to English... Assembly Language XML Software Project... Mobile Applications Japanese Language... English to Japanese... Ruby HTML scripting GPS navigation See 7+     See less Education Rensselaer Polytechnic Institute Bachelor's degree,  Chemistry 1965  – 1969 Rensselaer Polytechnic Institute Bachelor's degree,  Chemistry 1965  – 1969 Rensselaer Polytechnic Institute Bachelor's degree,  Chemistry 1965  – 1969 Rensselaer Polytechnic Institute Bachelor's degree,  Chemistry 1965  – 1969 ", "Summary In my current role at Microsoft/Skype I develop and optimise algorithms to improve the video experience in Skype for our millions of users. I’m passionate about algorithmic development and system optimization and like driving it all the way from idea to shipping. I also find it rewarding to lead projects within our team.  \n \nWhen I started at Skype in 2006 my focus was on speech coding and speech processing where I among other things worked on Skype’s first proprietary speech codec. Since 2009 I have primarily worked on video coding, processing, quality assessment, and transmission. One of my later efforts was to develop a low-complex low-light enhancement algorithm. The algorithm was shipped on a wide range of platforms during 2013.  \n \nI’m an inventor/co-inventor of about 40 patent applications covering areas of speech coding, artificial speech bandwidth extension, robust video coding, forward error correction, video coding, video processing, jitter buffer control, and quality estimation. Summary In my current role at Microsoft/Skype I develop and optimise algorithms to improve the video experience in Skype for our millions of users. I’m passionate about algorithmic development and system optimization and like driving it all the way from idea to shipping. I also find it rewarding to lead projects within our team.  \n \nWhen I started at Skype in 2006 my focus was on speech coding and speech processing where I among other things worked on Skype’s first proprietary speech codec. Since 2009 I have primarily worked on video coding, processing, quality assessment, and transmission. One of my later efforts was to develop a low-complex low-light enhancement algorithm. The algorithm was shipped on a wide range of platforms during 2013.  \n \nI’m an inventor/co-inventor of about 40 patent applications covering areas of speech coding, artificial speech bandwidth extension, robust video coding, forward error correction, video coding, video processing, jitter buffer control, and quality estimation. In my current role at Microsoft/Skype I develop and optimise algorithms to improve the video experience in Skype for our millions of users. I’m passionate about algorithmic development and system optimization and like driving it all the way from idea to shipping. I also find it rewarding to lead projects within our team.  \n \nWhen I started at Skype in 2006 my focus was on speech coding and speech processing where I among other things worked on Skype’s first proprietary speech codec. Since 2009 I have primarily worked on video coding, processing, quality assessment, and transmission. One of my later efforts was to develop a low-complex low-light enhancement algorithm. The algorithm was shipped on a wide range of platforms during 2013.  \n \nI’m an inventor/co-inventor of about 40 patent applications covering areas of speech coding, artificial speech bandwidth extension, robust video coding, forward error correction, video coding, video processing, jitter buffer control, and quality estimation. In my current role at Microsoft/Skype I develop and optimise algorithms to improve the video experience in Skype for our millions of users. I’m passionate about algorithmic development and system optimization and like driving it all the way from idea to shipping. I also find it rewarding to lead projects within our team.  \n \nWhen I started at Skype in 2006 my focus was on speech coding and speech processing where I among other things worked on Skype’s first proprietary speech codec. Since 2009 I have primarily worked on video coding, processing, quality assessment, and transmission. One of my later efforts was to develop a low-complex low-light enhancement algorithm. The algorithm was shipped on a wide range of platforms during 2013.  \n \nI’m an inventor/co-inventor of about 40 patent applications covering areas of speech coding, artificial speech bandwidth extension, robust video coding, forward error correction, video coding, video processing, jitter buffer control, and quality estimation. Experience Principal Applied Scientist Microsoft November 2014  – Present (10 months) Stockholm, Sweden Senior Researcher Microsoft January 2012  – Present (3 years 8 months) Stockholm, Sweden Audio and Video Researcher Skype August 2006  –  December 2011  (5 years 5 months) Engineer Ericsson 1997  –  1999  (2 years) Principal Applied Scientist Microsoft November 2014  – Present (10 months) Stockholm, Sweden Principal Applied Scientist Microsoft November 2014  – Present (10 months) Stockholm, Sweden Senior Researcher Microsoft January 2012  – Present (3 years 8 months) Stockholm, Sweden Senior Researcher Microsoft January 2012  – Present (3 years 8 months) Stockholm, Sweden Audio and Video Researcher Skype August 2006  –  December 2011  (5 years 5 months) Audio and Video Researcher Skype August 2006  –  December 2011  (5 years 5 months) Engineer Ericsson 1997  –  1999  (2 years) Engineer Ericsson 1997  –  1999  (2 years) Languages English Full professional proficiency Swedish Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Swedish Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Swedish Native or bilingual proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Video Processing Pattern Recognition Signal Processing Digital Signal... Speech Processing Digital Signal... Algorithms Machine Learning H.264 Computer Vision C++ Image Processing Python Artificial Intelligence Information Theory Matlab See 1+     See less Skills  Video Processing Pattern Recognition Signal Processing Digital Signal... Speech Processing Digital Signal... Algorithms Machine Learning H.264 Computer Vision C++ Image Processing Python Artificial Intelligence Information Theory Matlab See 1+     See less Video Processing Pattern Recognition Signal Processing Digital Signal... Speech Processing Digital Signal... Algorithms Machine Learning H.264 Computer Vision C++ Image Processing Python Artificial Intelligence Information Theory Matlab See 1+     See less Video Processing Pattern Recognition Signal Processing Digital Signal... Speech Processing Digital Signal... Algorithms Machine Learning H.264 Computer Vision C++ Image Processing Python Artificial Intelligence Information Theory Matlab See 1+     See less Education KTH Royal Institute of Technology Ph.D.,  Acoustic signal processing, Thesis title:\"Entropy and Speech\" 1999  – 2006 KTH Royal Institute of Technology M.Sc.,  Electrical Engineering 1992  – 1997 KTH Royal Institute of Technology Ph.D.,  Acoustic signal processing, Thesis title:\"Entropy and Speech\" 1999  – 2006 KTH Royal Institute of Technology Ph.D.,  Acoustic signal processing, Thesis title:\"Entropy and Speech\" 1999  – 2006 KTH Royal Institute of Technology Ph.D.,  Acoustic signal processing, Thesis title:\"Entropy and Speech\" 1999  – 2006 KTH Royal Institute of Technology M.Sc.,  Electrical Engineering 1992  – 1997 KTH Royal Institute of Technology M.Sc.,  Electrical Engineering 1992  – 1997 KTH Royal Institute of Technology M.Sc.,  Electrical Engineering 1992  – 1997 ", "Summary Principal research scientist in the area of statistical methods for natural language processing. \n \nSpecialties: Syntax/parsing, information extraction, multilingual systems, NLP systems design, machine learning toolkits, language modeling. Summary Principal research scientist in the area of statistical methods for natural language processing. \n \nSpecialties: Syntax/parsing, information extraction, multilingual systems, NLP systems design, machine learning toolkits, language modeling. Principal research scientist in the area of statistical methods for natural language processing. \n \nSpecialties: Syntax/parsing, information extraction, multilingual systems, NLP systems design, machine learning toolkits, language modeling. Principal research scientist in the area of statistical methods for natural language processing. \n \nSpecialties: Syntax/parsing, information extraction, multilingual systems, NLP systems design, machine learning toolkits, language modeling. Experience Principal Applied Scientist & Sr. Manager, NLP LinkedIn June 2015  – Present (3 months) Sunnyvale, California Investigate cutting-edge methods for multilingual NLP, so we can then build efficient models that work at planet-scale. Process unstructured textual data, both inside and outside LinkedIn, providing useful structured representations to help all of LinkedIn's products and services, and to help build the Economic Graph (https://www.linkedin.com/company/linkedin-economic-graph), connecting more people to more opportunities the world over. Research Scientist Google May 2010  –  May 2015  (5 years 1 month) New York, NY and Mountain View, CA Senior research scientist, exploring statistical models for text analysis and understanding. \n* Event extraction and understanding from text (technical lead) \n* Semantic parser for queries, e.g., currently used for Google Now \n* Adaptive language models for transcribing speech in all YouTube videos Research Staff Member IBM October 2004  –  July 2010  (5 years 10 months) Yorktown Heights, NY I work on natural language processing (NLP) problems, using statistical methods. I've worked on methods for parsing, information extraction and machine translation problems, among others. Associate Scientist BBN Technologies 1994  –  1997  (3 years) Cambridge, MA * Designed and built high-performance stochastic named entity recognizer, called IdentiFinder™ (née Nymble). \n* Designed and built tools for porting natural language understanding tools from one domain to another. Principal Applied Scientist & Sr. Manager, NLP LinkedIn June 2015  – Present (3 months) Sunnyvale, California Investigate cutting-edge methods for multilingual NLP, so we can then build efficient models that work at planet-scale. Process unstructured textual data, both inside and outside LinkedIn, providing useful structured representations to help all of LinkedIn's products and services, and to help build the Economic Graph (https://www.linkedin.com/company/linkedin-economic-graph), connecting more people to more opportunities the world over. Principal Applied Scientist & Sr. Manager, NLP LinkedIn June 2015  – Present (3 months) Sunnyvale, California Investigate cutting-edge methods for multilingual NLP, so we can then build efficient models that work at planet-scale. Process unstructured textual data, both inside and outside LinkedIn, providing useful structured representations to help all of LinkedIn's products and services, and to help build the Economic Graph (https://www.linkedin.com/company/linkedin-economic-graph), connecting more people to more opportunities the world over. Research Scientist Google May 2010  –  May 2015  (5 years 1 month) New York, NY and Mountain View, CA Senior research scientist, exploring statistical models for text analysis and understanding. \n* Event extraction and understanding from text (technical lead) \n* Semantic parser for queries, e.g., currently used for Google Now \n* Adaptive language models for transcribing speech in all YouTube videos Research Scientist Google May 2010  –  May 2015  (5 years 1 month) New York, NY and Mountain View, CA Senior research scientist, exploring statistical models for text analysis and understanding. \n* Event extraction and understanding from text (technical lead) \n* Semantic parser for queries, e.g., currently used for Google Now \n* Adaptive language models for transcribing speech in all YouTube videos Research Staff Member IBM October 2004  –  July 2010  (5 years 10 months) Yorktown Heights, NY I work on natural language processing (NLP) problems, using statistical methods. I've worked on methods for parsing, information extraction and machine translation problems, among others. Research Staff Member IBM October 2004  –  July 2010  (5 years 10 months) Yorktown Heights, NY I work on natural language processing (NLP) problems, using statistical methods. I've worked on methods for parsing, information extraction and machine translation problems, among others. Associate Scientist BBN Technologies 1994  –  1997  (3 years) Cambridge, MA * Designed and built high-performance stochastic named entity recognizer, called IdentiFinder™ (née Nymble). \n* Designed and built tools for porting natural language understanding tools from one domain to another. Associate Scientist BBN Technologies 1994  –  1997  (3 years) Cambridge, MA * Designed and built high-performance stochastic named entity recognizer, called IdentiFinder™ (née Nymble). \n* Designed and built tools for porting natural language understanding tools from one domain to another. Languages English Latin English Latin English Latin Skills Machine Learning Text Analytics Natural Language... Information Extraction Hadoop Machine Translation MapReduce Artificial Intelligence Human Computer... Information Retrieval Text Mining Pattern Recognition Speech Recognition Algorithms Text Classification Distributed Systems Predictive Analytics Parsing Statistical Modeling Computational... NLP Big Data Data Mining Software Engineering Computer Science Semantics Algorithm Design Predictive Modeling Software Design Knowledge Representation Scientific Computing C++ Sentiment Analysis Semantic Web Signal Processing Ontologies Optimization Impersonations High Performance... LaTeX See 25+     See less Skills  Machine Learning Text Analytics Natural Language... Information Extraction Hadoop Machine Translation MapReduce Artificial Intelligence Human Computer... Information Retrieval Text Mining Pattern Recognition Speech Recognition Algorithms Text Classification Distributed Systems Predictive Analytics Parsing Statistical Modeling Computational... NLP Big Data Data Mining Software Engineering Computer Science Semantics Algorithm Design Predictive Modeling Software Design Knowledge Representation Scientific Computing C++ Sentiment Analysis Semantic Web Signal Processing Ontologies Optimization Impersonations High Performance... LaTeX See 25+     See less Machine Learning Text Analytics Natural Language... Information Extraction Hadoop Machine Translation MapReduce Artificial Intelligence Human Computer... Information Retrieval Text Mining Pattern Recognition Speech Recognition Algorithms Text Classification Distributed Systems Predictive Analytics Parsing Statistical Modeling Computational... NLP Big Data Data Mining Software Engineering Computer Science Semantics Algorithm Design Predictive Modeling Software Design Knowledge Representation Scientific Computing C++ Sentiment Analysis Semantic Web Signal Processing Ontologies Optimization Impersonations High Performance... LaTeX See 25+     See less Machine Learning Text Analytics Natural Language... Information Extraction Hadoop Machine Translation MapReduce Artificial Intelligence Human Computer... Information Retrieval Text Mining Pattern Recognition Speech Recognition Algorithms Text Classification Distributed Systems Predictive Analytics Parsing Statistical Modeling Computational... NLP Big Data Data Mining Software Engineering Computer Science Semantics Algorithm Design Predictive Modeling Software Design Knowledge Representation Scientific Computing C++ Sentiment Analysis Semantic Web Signal Processing Ontologies Optimization Impersonations High Performance... LaTeX See 25+     See less Education University of Pennsylvania Ph.D.,  Computer Science , 4.0 1997  – 2004 Ph.D. dissertation: \"On the parameter space of generative lexicalized statistical parsing models\" \nhttp://repository.upenn.edu/dissertations/AAI3152016/ \nTurned into book: \nStatistical Parsing Exposed: Viewing the Model as Data \nhttp://www.amazon.com/Statistical-Parsing-Exposed-Viewing-Model/dp/3639145615 University of Pennsylvania M.S.,  Computer Science , 4.0 1997  – 1999 Harvard University A.B.,  Classics (Ancient Greek and Latin) 1989  – 1993 Activities and Societies:  Harvard Glee Club University of Pennsylvania Ph.D.,  Computer Science , 4.0 1997  – 2004 Ph.D. dissertation: \"On the parameter space of generative lexicalized statistical parsing models\" \nhttp://repository.upenn.edu/dissertations/AAI3152016/ \nTurned into book: \nStatistical Parsing Exposed: Viewing the Model as Data \nhttp://www.amazon.com/Statistical-Parsing-Exposed-Viewing-Model/dp/3639145615 University of Pennsylvania Ph.D.,  Computer Science , 4.0 1997  – 2004 Ph.D. dissertation: \"On the parameter space of generative lexicalized statistical parsing models\" \nhttp://repository.upenn.edu/dissertations/AAI3152016/ \nTurned into book: \nStatistical Parsing Exposed: Viewing the Model as Data \nhttp://www.amazon.com/Statistical-Parsing-Exposed-Viewing-Model/dp/3639145615 University of Pennsylvania Ph.D.,  Computer Science , 4.0 1997  – 2004 Ph.D. dissertation: \"On the parameter space of generative lexicalized statistical parsing models\" \nhttp://repository.upenn.edu/dissertations/AAI3152016/ \nTurned into book: \nStatistical Parsing Exposed: Viewing the Model as Data \nhttp://www.amazon.com/Statistical-Parsing-Exposed-Viewing-Model/dp/3639145615 University of Pennsylvania M.S.,  Computer Science , 4.0 1997  – 1999 University of Pennsylvania M.S.,  Computer Science , 4.0 1997  – 1999 University of Pennsylvania M.S.,  Computer Science , 4.0 1997  – 1999 Harvard University A.B.,  Classics (Ancient Greek and Latin) 1989  – 1993 Activities and Societies:  Harvard Glee Club Harvard University A.B.,  Classics (Ancient Greek and Latin) 1989  – 1993 Activities and Societies:  Harvard Glee Club Harvard University A.B.,  Classics (Ancient Greek and Latin) 1989  – 1993 Activities and Societies:  Harvard Glee Club ", "Languages English Native or bilingual proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency Swedish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills C# Distributed Systems Software Engineering Software Design Agile Methodologies Software Development Scalability .NET Software Project... C++ Algorithms Scrum Computer Science Skills  C# Distributed Systems Software Engineering Software Design Agile Methodologies Software Development Scalability .NET Software Project... C++ Algorithms Scrum Computer Science C# Distributed Systems Software Engineering Software Design Agile Methodologies Software Development Scalability .NET Software Project... C++ Algorithms Scrum Computer Science C# Distributed Systems Software Engineering Software Design Agile Methodologies Software Development Scalability .NET Software Project... C++ Algorithms Scrum Computer Science ", "Experience Principal Applied Scientist Microsoft July 2009  – Present (6 years 2 months) Principal Applied Scientist Microsoft July 2009  – Present (6 years 2 months) Principal Applied Scientist Microsoft July 2009  – Present (6 years 2 months) Skills Machine Learning Information Retrieval MapReduce Computer Vision Data Mining Distributed Systems Hadoop Natural Language... Signal Processing Algorithms Statistics Neural Networks Computer Science Big Data Artificial Intelligence Scalability Software Engineering C++ Software Development See 4+     See less Skills  Machine Learning Information Retrieval MapReduce Computer Vision Data Mining Distributed Systems Hadoop Natural Language... Signal Processing Algorithms Statistics Neural Networks Computer Science Big Data Artificial Intelligence Scalability Software Engineering C++ Software Development See 4+     See less Machine Learning Information Retrieval MapReduce Computer Vision Data Mining Distributed Systems Hadoop Natural Language... Signal Processing Algorithms Statistics Neural Networks Computer Science Big Data Artificial Intelligence Scalability Software Engineering C++ Software Development See 4+     See less Machine Learning Information Retrieval MapReduce Computer Vision Data Mining Distributed Systems Hadoop Natural Language... Signal Processing Algorithms Statistics Neural Networks Computer Science Big Data Artificial Intelligence Scalability Software Engineering C++ Software Development See 4+     See less ", "Experience Principal Applied Scientist, Skype Microsoft July 2014  – Present (1 year 2 months) Palo Alto, CA Machine learning - applications in communication & collaboration. Principal Software Development Engineer, Skype Microsoft October 2011  –  June 2014  (2 years 9 months) Palo Alto, CA Next generation services for Skype, based on cloud architecture. \n \nMy key contributions included: \n \n- Trouter: large scale web notification service implemented fully in node.js, and deployed on Windows Azure. It uses socket.io to handle comet and websocket communication. I created an early prototype of the service and then followed through in architecture and software development leading to production release. I co-authored a patent application based on this work. \n \n- Sharks: library for combining together several key-value stores hosted in different data centers in order to create a composite, replicated key-value store of higher reliability, surviving outages of individual data centers. Worked on interesting synchronization properties, better than eventual consistency, under mild quorum write & read assumptions. Developed in C#, using async-await framework. Utilized in production services. Chief Software Architect, Skype Enterprise Skype September 2010  –  October 2011  (1 year 2 months) Palo Alto, CA Web collaboration software for enterprises. \n \nMy main accomplishment: defining architecture of a hybrid web and native client for Skype Enterprise. The client aimed to bridge the legacy Skype peer to peer architecture with next generation cloud architecture. Much of the complexity and finesse was in arranging inter-working between web and native domains of the client to meet various requirements that go beyond the needs of standard web applications. I authored two patent applications based on this work. Software Architect, Reuters Messaging Thomson Reuters September 2006  –  August 2010  (4 years) New York City, NY Web collaboration software for financial industry. \n \nMy main accomplishment: creating a next generation communication platform for Reuters Messaging. It was called Web Collaboration Platform and it was a radical departure from and modernization of the legacy architecture of Reuters Messaging based on SIP and Microsoft Lync platform. Distinguishing features of the Web Collaboration Platform included: single unifying abstraction of a collaboration channel, focus on HTTP web services, web friendly JSON data format, real time web notifications using a dedicated web push service based on comet, open source components, primarily Java jetty. Above all, the architecture addressed an intersection of synchronous and asynchronous modes of messaging, unifying traditionally separate applications of Instant Messaging and persistent chat rooms under one roof. I defined architecture of this new technology, and worked with a small team on developing it and deploying at Reuters Messaging as a complement and in many instances a replacement of the legacy SIP / Lync architecture. WCP currently carries a traffic load on the same level as the original legacy platform. \n \nI also contributed as architect to other projects at Reuters Messaging, including web messenger (AJAX, web services accessed via XHR, comet), integration of web messenger with Thomson Reuters trading platforms (Single Sign On among other requirements), and compliance service for Reuters Messaging. Senior Software Engineer Telcordia Technologies 1999  –  2006  (7 years) piscataway, nj Telecommunication systems software, Internet communication software. \n \nI worked in a technology incubation team, developing software prototypes for new telecommunication products of Telcordia. The example contributions included: \n \n- Architecture and a corresponding software prototype for Converged Communication Services, a Java web services platform that allows building various applications on top of PSTN, such as a TV telecom portal, an application executing in a TV set top box. It offered features such as TV caller ID, call logs, click to call, interactive call routing using a TV remote etc. \n \n- Services controlling dual mode WiFi and cellular phones. The service handled registration on either network, and seamless mid-call hand-offs between the networks, based on the strength of the signal. This technology was based on Java and SIP servlets.  \n \n- Web application allowing a quick transition from a phone call to a web conference. I received a US patent for the idea, as a co-author. \n \n- Enhanced services on top of Telcordia MGCP-based softswitch. \n \n- Enterprise broadcast application, using web services combined with IP multicast, based on .NET and Windows Media Services. Senior Software Engineer Melita International 1995  –  1999  (4 years) Norcross, GA Telecommunication systems software, Computer Telephony Integration, call center applications. \n \nC++ development for PC-based telecom server, utilized in call center applications. The platform used Dialogic and other CTI boards. This was a distributed CORBA environment, with a cluster of servers. My main accomplishment was in design and implementation of a distributed connection broker service that managed audio connections between geographically distributed servers, utilizing Asynchronous Transfer Mode (ATM) technology, a precursor to VoIP. Principal Applied Scientist, Skype Microsoft July 2014  – Present (1 year 2 months) Palo Alto, CA Machine learning - applications in communication & collaboration. Principal Applied Scientist, Skype Microsoft July 2014  – Present (1 year 2 months) Palo Alto, CA Machine learning - applications in communication & collaboration. Principal Software Development Engineer, Skype Microsoft October 2011  –  June 2014  (2 years 9 months) Palo Alto, CA Next generation services for Skype, based on cloud architecture. \n \nMy key contributions included: \n \n- Trouter: large scale web notification service implemented fully in node.js, and deployed on Windows Azure. It uses socket.io to handle comet and websocket communication. I created an early prototype of the service and then followed through in architecture and software development leading to production release. I co-authored a patent application based on this work. \n \n- Sharks: library for combining together several key-value stores hosted in different data centers in order to create a composite, replicated key-value store of higher reliability, surviving outages of individual data centers. Worked on interesting synchronization properties, better than eventual consistency, under mild quorum write & read assumptions. Developed in C#, using async-await framework. Utilized in production services. Principal Software Development Engineer, Skype Microsoft October 2011  –  June 2014  (2 years 9 months) Palo Alto, CA Next generation services for Skype, based on cloud architecture. \n \nMy key contributions included: \n \n- Trouter: large scale web notification service implemented fully in node.js, and deployed on Windows Azure. It uses socket.io to handle comet and websocket communication. I created an early prototype of the service and then followed through in architecture and software development leading to production release. I co-authored a patent application based on this work. \n \n- Sharks: library for combining together several key-value stores hosted in different data centers in order to create a composite, replicated key-value store of higher reliability, surviving outages of individual data centers. Worked on interesting synchronization properties, better than eventual consistency, under mild quorum write & read assumptions. Developed in C#, using async-await framework. Utilized in production services. Chief Software Architect, Skype Enterprise Skype September 2010  –  October 2011  (1 year 2 months) Palo Alto, CA Web collaboration software for enterprises. \n \nMy main accomplishment: defining architecture of a hybrid web and native client for Skype Enterprise. The client aimed to bridge the legacy Skype peer to peer architecture with next generation cloud architecture. Much of the complexity and finesse was in arranging inter-working between web and native domains of the client to meet various requirements that go beyond the needs of standard web applications. I authored two patent applications based on this work. Chief Software Architect, Skype Enterprise Skype September 2010  –  October 2011  (1 year 2 months) Palo Alto, CA Web collaboration software for enterprises. \n \nMy main accomplishment: defining architecture of a hybrid web and native client for Skype Enterprise. The client aimed to bridge the legacy Skype peer to peer architecture with next generation cloud architecture. Much of the complexity and finesse was in arranging inter-working between web and native domains of the client to meet various requirements that go beyond the needs of standard web applications. I authored two patent applications based on this work. Software Architect, Reuters Messaging Thomson Reuters September 2006  –  August 2010  (4 years) New York City, NY Web collaboration software for financial industry. \n \nMy main accomplishment: creating a next generation communication platform for Reuters Messaging. It was called Web Collaboration Platform and it was a radical departure from and modernization of the legacy architecture of Reuters Messaging based on SIP and Microsoft Lync platform. Distinguishing features of the Web Collaboration Platform included: single unifying abstraction of a collaboration channel, focus on HTTP web services, web friendly JSON data format, real time web notifications using a dedicated web push service based on comet, open source components, primarily Java jetty. Above all, the architecture addressed an intersection of synchronous and asynchronous modes of messaging, unifying traditionally separate applications of Instant Messaging and persistent chat rooms under one roof. I defined architecture of this new technology, and worked with a small team on developing it and deploying at Reuters Messaging as a complement and in many instances a replacement of the legacy SIP / Lync architecture. WCP currently carries a traffic load on the same level as the original legacy platform. \n \nI also contributed as architect to other projects at Reuters Messaging, including web messenger (AJAX, web services accessed via XHR, comet), integration of web messenger with Thomson Reuters trading platforms (Single Sign On among other requirements), and compliance service for Reuters Messaging. Software Architect, Reuters Messaging Thomson Reuters September 2006  –  August 2010  (4 years) New York City, NY Web collaboration software for financial industry. \n \nMy main accomplishment: creating a next generation communication platform for Reuters Messaging. It was called Web Collaboration Platform and it was a radical departure from and modernization of the legacy architecture of Reuters Messaging based on SIP and Microsoft Lync platform. Distinguishing features of the Web Collaboration Platform included: single unifying abstraction of a collaboration channel, focus on HTTP web services, web friendly JSON data format, real time web notifications using a dedicated web push service based on comet, open source components, primarily Java jetty. Above all, the architecture addressed an intersection of synchronous and asynchronous modes of messaging, unifying traditionally separate applications of Instant Messaging and persistent chat rooms under one roof. I defined architecture of this new technology, and worked with a small team on developing it and deploying at Reuters Messaging as a complement and in many instances a replacement of the legacy SIP / Lync architecture. WCP currently carries a traffic load on the same level as the original legacy platform. \n \nI also contributed as architect to other projects at Reuters Messaging, including web messenger (AJAX, web services accessed via XHR, comet), integration of web messenger with Thomson Reuters trading platforms (Single Sign On among other requirements), and compliance service for Reuters Messaging. Senior Software Engineer Telcordia Technologies 1999  –  2006  (7 years) piscataway, nj Telecommunication systems software, Internet communication software. \n \nI worked in a technology incubation team, developing software prototypes for new telecommunication products of Telcordia. The example contributions included: \n \n- Architecture and a corresponding software prototype for Converged Communication Services, a Java web services platform that allows building various applications on top of PSTN, such as a TV telecom portal, an application executing in a TV set top box. It offered features such as TV caller ID, call logs, click to call, interactive call routing using a TV remote etc. \n \n- Services controlling dual mode WiFi and cellular phones. The service handled registration on either network, and seamless mid-call hand-offs between the networks, based on the strength of the signal. This technology was based on Java and SIP servlets.  \n \n- Web application allowing a quick transition from a phone call to a web conference. I received a US patent for the idea, as a co-author. \n \n- Enhanced services on top of Telcordia MGCP-based softswitch. \n \n- Enterprise broadcast application, using web services combined with IP multicast, based on .NET and Windows Media Services. Senior Software Engineer Telcordia Technologies 1999  –  2006  (7 years) piscataway, nj Telecommunication systems software, Internet communication software. \n \nI worked in a technology incubation team, developing software prototypes for new telecommunication products of Telcordia. The example contributions included: \n \n- Architecture and a corresponding software prototype for Converged Communication Services, a Java web services platform that allows building various applications on top of PSTN, such as a TV telecom portal, an application executing in a TV set top box. It offered features such as TV caller ID, call logs, click to call, interactive call routing using a TV remote etc. \n \n- Services controlling dual mode WiFi and cellular phones. The service handled registration on either network, and seamless mid-call hand-offs between the networks, based on the strength of the signal. This technology was based on Java and SIP servlets.  \n \n- Web application allowing a quick transition from a phone call to a web conference. I received a US patent for the idea, as a co-author. \n \n- Enhanced services on top of Telcordia MGCP-based softswitch. \n \n- Enterprise broadcast application, using web services combined with IP multicast, based on .NET and Windows Media Services. Senior Software Engineer Melita International 1995  –  1999  (4 years) Norcross, GA Telecommunication systems software, Computer Telephony Integration, call center applications. \n \nC++ development for PC-based telecom server, utilized in call center applications. The platform used Dialogic and other CTI boards. This was a distributed CORBA environment, with a cluster of servers. My main accomplishment was in design and implementation of a distributed connection broker service that managed audio connections between geographically distributed servers, utilizing Asynchronous Transfer Mode (ATM) technology, a precursor to VoIP. Senior Software Engineer Melita International 1995  –  1999  (4 years) Norcross, GA Telecommunication systems software, Computer Telephony Integration, call center applications. \n \nC++ development for PC-based telecom server, utilized in call center applications. The platform used Dialogic and other CTI boards. This was a distributed CORBA environment, with a cluster of servers. My main accomplishment was in design and implementation of a distributed connection broker service that managed audio connections between geographically distributed servers, utilizing Asynchronous Transfer Mode (ATM) technology, a precursor to VoIP. Skills Software Architecture Internet Web Collaboration VoIP Node.js Javascript HTML 5 Java Comet Cloud Computing Windows Azure Security Architecture Agile Methodologies Integration Enterprise Software Distributed Systems .NET Web Applications C++ See 6+     See less Skills  Software Architecture Internet Web Collaboration VoIP Node.js Javascript HTML 5 Java Comet Cloud Computing Windows Azure Security Architecture Agile Methodologies Integration Enterprise Software Distributed Systems .NET Web Applications C++ See 6+     See less Software Architecture Internet Web Collaboration VoIP Node.js Javascript HTML 5 Java Comet Cloud Computing Windows Azure Security Architecture Agile Methodologies Integration Enterprise Software Distributed Systems .NET Web Applications C++ See 6+     See less Software Architecture Internet Web Collaboration VoIP Node.js Javascript HTML 5 Java Comet Cloud Computing Windows Azure Security Architecture Agile Methodologies Integration Enterprise Software Distributed Systems .NET Web Applications C++ See 6+     See less Education Clemson University PhD,  Mathematical Sciences 1993  – 1995 Politechnika Warszawska MS,  Electronic Engineering 1987  – 1992 Activities and Societies:  Completed MS thesis as an exchange student at the University of Birmingham ,  UK ,  January - July 1992 Liceum Gottwalda Profile: mathematical - experimental 1984  – 1987 Clemson University PhD,  Mathematical Sciences 1993  – 1995 Clemson University PhD,  Mathematical Sciences 1993  – 1995 Clemson University PhD,  Mathematical Sciences 1993  – 1995 Politechnika Warszawska MS,  Electronic Engineering 1987  – 1992 Activities and Societies:  Completed MS thesis as an exchange student at the University of Birmingham ,  UK ,  January - July 1992 Politechnika Warszawska MS,  Electronic Engineering 1987  – 1992 Activities and Societies:  Completed MS thesis as an exchange student at the University of Birmingham ,  UK ,  January - July 1992 Politechnika Warszawska MS,  Electronic Engineering 1987  – 1992 Activities and Societies:  Completed MS thesis as an exchange student at the University of Birmingham ,  UK ,  January - July 1992 Liceum Gottwalda Profile: mathematical - experimental 1984  – 1987 Liceum Gottwalda Profile: mathematical - experimental 1984  – 1987 Liceum Gottwalda Profile: mathematical - experimental 1984  – 1987 Honors & Awards Additional Honors & Awards MS degree with High Honors from Department of Electronic Engineering, Politechnika Warszawska Additional Honors & Awards MS degree with High Honors from Department of Electronic Engineering, Politechnika Warszawska Additional Honors & Awards MS degree with High Honors from Department of Electronic Engineering, Politechnika Warszawska Additional Honors & Awards MS degree with High Honors from Department of Electronic Engineering, Politechnika Warszawska ", "Skills Personalization Information Retrieval Research Management Search Engines Data Mining CMS Machine Learning Computer Science Big Data Scalability User Experience Text Mining Software Engineering Natural Language... Distributed Systems Search See 1+     See less Skills  Personalization Information Retrieval Research Management Search Engines Data Mining CMS Machine Learning Computer Science Big Data Scalability User Experience Text Mining Software Engineering Natural Language... Distributed Systems Search See 1+     See less Personalization Information Retrieval Research Management Search Engines Data Mining CMS Machine Learning Computer Science Big Data Scalability User Experience Text Mining Software Engineering Natural Language... Distributed Systems Search See 1+     See less Personalization Information Retrieval Research Management Search Engines Data Mining CMS Machine Learning Computer Science Big Data Scalability User Experience Text Mining Software Engineering Natural Language... Distributed Systems Search See 1+     See less "]}