{"position": "Business Intelligence Engineer", "company": "Google", "profiles": ["Summary I am a generalist in Business Intelligence domain with strong problem solving, debugging and analytical skills. Highly focussed, motivated and hard working to achieve short and long term goals. \n \nSpecialities:- \n \nData Warehousing, Data Modeling, ETL, Business Intelligence, Amazon Redshift, Amazon S3, SQL, Informatica, MicroStrategy, Linux/Unix, Oracle, PostgreSQL, Shell scripting, Hive, Pig, HDFS, Cassandra, Performance Tuning, Scalability, Java/J2EE. \n Summary I am a generalist in Business Intelligence domain with strong problem solving, debugging and analytical skills. Highly focussed, motivated and hard working to achieve short and long term goals. \n \nSpecialities:- \n \nData Warehousing, Data Modeling, ETL, Business Intelligence, Amazon Redshift, Amazon S3, SQL, Informatica, MicroStrategy, Linux/Unix, Oracle, PostgreSQL, Shell scripting, Hive, Pig, HDFS, Cassandra, Performance Tuning, Scalability, Java/J2EE. \n I am a generalist in Business Intelligence domain with strong problem solving, debugging and analytical skills. Highly focussed, motivated and hard working to achieve short and long term goals. \n \nSpecialities:- \n \nData Warehousing, Data Modeling, ETL, Business Intelligence, Amazon Redshift, Amazon S3, SQL, Informatica, MicroStrategy, Linux/Unix, Oracle, PostgreSQL, Shell scripting, Hive, Pig, HDFS, Cassandra, Performance Tuning, Scalability, Java/J2EE. \n I am a generalist in Business Intelligence domain with strong problem solving, debugging and analytical skills. Highly focussed, motivated and hard working to achieve short and long term goals. \n \nSpecialities:- \n \nData Warehousing, Data Modeling, ETL, Business Intelligence, Amazon Redshift, Amazon S3, SQL, Informatica, MicroStrategy, Linux/Unix, Oracle, PostgreSQL, Shell scripting, Hive, Pig, HDFS, Cassandra, Performance Tuning, Scalability, Java/J2EE. \n Experience Senior Business Intelligence Engineer Expedia, Inc October 2011  – Present (3 years 11 months) San Francisco Bay Area Business Intelligence Engineer Clearwire April 2010  –  September 2011  (1 year 6 months) Bellevue Senior Business Intelligence Engineer Expedia, Inc October 2011  – Present (3 years 11 months) San Francisco Bay Area Senior Business Intelligence Engineer Expedia, Inc October 2011  – Present (3 years 11 months) San Francisco Bay Area Business Intelligence Engineer Clearwire April 2010  –  September 2011  (1 year 6 months) Bellevue Business Intelligence Engineer Clearwire April 2010  –  September 2011  (1 year 6 months) Bellevue Skills ETL Data Warehousing Agile Methodologies Business Intelligence Informatica SQL MicroStrategy Unix Oracle SDLC Business Analysis Hadoop Hive Apache Pig Testing Data Integration Netezza Unix Shell Scripting Machine Learning Python Java/J2EE C++ JavaScript Amazon Web Services... Amazon S3 Amazon Redshift PostgreSQL Cassandra jQuery HTML CSS Eclipse Performance Tuning Distributed Systems Scalability Data Modeling See 21+     See less Skills  ETL Data Warehousing Agile Methodologies Business Intelligence Informatica SQL MicroStrategy Unix Oracle SDLC Business Analysis Hadoop Hive Apache Pig Testing Data Integration Netezza Unix Shell Scripting Machine Learning Python Java/J2EE C++ JavaScript Amazon Web Services... Amazon S3 Amazon Redshift PostgreSQL Cassandra jQuery HTML CSS Eclipse Performance Tuning Distributed Systems Scalability Data Modeling See 21+     See less ETL Data Warehousing Agile Methodologies Business Intelligence Informatica SQL MicroStrategy Unix Oracle SDLC Business Analysis Hadoop Hive Apache Pig Testing Data Integration Netezza Unix Shell Scripting Machine Learning Python Java/J2EE C++ JavaScript Amazon Web Services... Amazon S3 Amazon Redshift PostgreSQL Cassandra jQuery HTML CSS Eclipse Performance Tuning Distributed Systems Scalability Data Modeling See 21+     See less ETL Data Warehousing Agile Methodologies Business Intelligence Informatica SQL MicroStrategy Unix Oracle SDLC Business Analysis Hadoop Hive Apache Pig Testing Data Integration Netezza Unix Shell Scripting Machine Learning Python Java/J2EE C++ JavaScript Amazon Web Services... Amazon S3 Amazon Redshift PostgreSQL Cassandra jQuery HTML CSS Eclipse Performance Tuning Distributed Systems Scalability Data Modeling See 21+     See less Education Florida International University Master's degree,  Electrical Engineering 2008  – 2009 Anna University Bachelor's degree,  Electronics and Communication Engineering 2003  – 2007 Florida International University Master's degree,  Electrical Engineering 2008  – 2009 Florida International University Master's degree,  Electrical Engineering 2008  – 2009 Florida International University Master's degree,  Electrical Engineering 2008  – 2009 Anna University Bachelor's degree,  Electronics and Communication Engineering 2003  – 2007 Anna University Bachelor's degree,  Electronics and Communication Engineering 2003  – 2007 Anna University Bachelor's degree,  Electronics and Communication Engineering 2003  – 2007 Honors & Awards Stellar and Thankyou Awards at Expedia, Inc Stellar and Thankyou Awards at Expedia, Inc Stellar and Thankyou Awards at Expedia, Inc Stellar and Thankyou Awards at Expedia, Inc ", "Experience Sr. Oracle Business Intelligence Engineer Polycom December 2009  – Present (5 years 9 months) San Jose, CA Data Integration Architect Anheuser-Busch InBev June 2006  –  December 2009  (3 years 7 months) St Louis, MO Analyst/Siebel Analytics Consultant Mars January 2006  –  June 2006  (6 months) Hackettstown, NJ Data Warehouse Developer GE Capital January 2004  –  December 2005  (2 years) Minneapolis, MN Data Warehouse Developer GE Supply December 2003  –  January 2004  (2 months) Data Warehouse Developer GE Aviation June 2003  –  November 2003  (6 months) Sr. Oracle Business Intelligence Engineer Polycom December 2009  – Present (5 years 9 months) San Jose, CA Sr. Oracle Business Intelligence Engineer Polycom December 2009  – Present (5 years 9 months) San Jose, CA Data Integration Architect Anheuser-Busch InBev June 2006  –  December 2009  (3 years 7 months) St Louis, MO Data Integration Architect Anheuser-Busch InBev June 2006  –  December 2009  (3 years 7 months) St Louis, MO Analyst/Siebel Analytics Consultant Mars January 2006  –  June 2006  (6 months) Hackettstown, NJ Analyst/Siebel Analytics Consultant Mars January 2006  –  June 2006  (6 months) Hackettstown, NJ Data Warehouse Developer GE Capital January 2004  –  December 2005  (2 years) Minneapolis, MN Data Warehouse Developer GE Capital January 2004  –  December 2005  (2 years) Minneapolis, MN Data Warehouse Developer GE Supply December 2003  –  January 2004  (2 months) Data Warehouse Developer GE Supply December 2003  –  January 2004  (2 months) Data Warehouse Developer GE Aviation June 2003  –  November 2003  (6 months) Data Warehouse Developer GE Aviation June 2003  –  November 2003  (6 months) Skills Informatica OBIEE Data Integration Data Warehousing ETL IT Strategy Data Modeling Skills  Informatica OBIEE Data Integration Data Warehousing ETL IT Strategy Data Modeling Informatica OBIEE Data Integration Data Warehousing ETL IT Strategy Data Modeling Informatica OBIEE Data Integration Data Warehousing ETL IT Strategy Data Modeling Education Amrita University Bachelor in Computer Science and Engineering,  Computer Engineering 1999  – 2003 Amrita University Bachelor in Computer Science and Engineering,  Computer Engineering 1999  – 2003 Amrita University Bachelor in Computer Science and Engineering,  Computer Engineering 1999  – 2003 Amrita University Bachelor in Computer Science and Engineering,  Computer Engineering 1999  – 2003 ", "Experience Principal Business Intelligence Engineer Symantec November 2012  – Present (2 years 10 months) Mountain View, CA Sr. Business Intelligence Engineer Symantec December 2008  – Present (6 years 9 months) Business Intelligence Engineer Symantec April 2007  –  December 2008  (1 year 9 months) Business Intelligence Engineer Commission Junction April 2006  –  April 2007  (1 year 1 month) Business Intelligence Engineer Intern Commission Junction June 2005  –  September 2005  (4 months) Principal Business Intelligence Engineer Symantec November 2012  – Present (2 years 10 months) Mountain View, CA Principal Business Intelligence Engineer Symantec November 2012  – Present (2 years 10 months) Mountain View, CA Sr. Business Intelligence Engineer Symantec December 2008  – Present (6 years 9 months) Sr. Business Intelligence Engineer Symantec December 2008  – Present (6 years 9 months) Business Intelligence Engineer Symantec April 2007  –  December 2008  (1 year 9 months) Business Intelligence Engineer Symantec April 2007  –  December 2008  (1 year 9 months) Business Intelligence Engineer Commission Junction April 2006  –  April 2007  (1 year 1 month) Business Intelligence Engineer Commission Junction April 2006  –  April 2007  (1 year 1 month) Business Intelligence Engineer Intern Commission Junction June 2005  –  September 2005  (4 months) Business Intelligence Engineer Intern Commission Junction June 2005  –  September 2005  (4 months) Languages Turkish Native or bilingual proficiency English Professional working proficiency Turkish Native or bilingual proficiency English Professional working proficiency Turkish Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills SQL Agile Methodologies Java Business Intelligence Microsoft SQL Server JavaScript Oracle Unix XML Linux Software Development Data Warehousing Hyperion Enterprise Hyperion Reports Hyperion Interactive... QlikView Cognos Cognos ReportNet Business Objects Hadoop Distributed Systems Spring Web Services Databases PL/SQL Data Modeling Enterprise Software Perl Software Engineering Software Project... SDLC Database Design See 17+     See less Skills  SQL Agile Methodologies Java Business Intelligence Microsoft SQL Server JavaScript Oracle Unix XML Linux Software Development Data Warehousing Hyperion Enterprise Hyperion Reports Hyperion Interactive... QlikView Cognos Cognos ReportNet Business Objects Hadoop Distributed Systems Spring Web Services Databases PL/SQL Data Modeling Enterprise Software Perl Software Engineering Software Project... SDLC Database Design See 17+     See less SQL Agile Methodologies Java Business Intelligence Microsoft SQL Server JavaScript Oracle Unix XML Linux Software Development Data Warehousing Hyperion Enterprise Hyperion Reports Hyperion Interactive... QlikView Cognos Cognos ReportNet Business Objects Hadoop Distributed Systems Spring Web Services Databases PL/SQL Data Modeling Enterprise Software Perl Software Engineering Software Project... SDLC Database Design See 17+     See less SQL Agile Methodologies Java Business Intelligence Microsoft SQL Server JavaScript Oracle Unix XML Linux Software Development Data Warehousing Hyperion Enterprise Hyperion Reports Hyperion Interactive... QlikView Cognos Cognos ReportNet Business Objects Hadoop Distributed Systems Spring Web Services Databases PL/SQL Data Modeling Enterprise Software Perl Software Engineering Software Project... SDLC Database Design See 17+     See less Education University of California, Santa Barbara B.S.,  Computer Science 2002  – 2006 Besiktas Anadolu Lisesi Foothill College University of California, Santa Barbara B.S.,  Computer Science 2002  – 2006 University of California, Santa Barbara B.S.,  Computer Science 2002  – 2006 University of California, Santa Barbara B.S.,  Computer Science 2002  – 2006 Besiktas Anadolu Lisesi Besiktas Anadolu Lisesi Besiktas Anadolu Lisesi Foothill College Foothill College Foothill College ", "Summary Extensive IT experience in Project Implementation, Analysis, Design, Development and Administration of applications using Business Intelligence Tools with industry domains: Banking & Financial, Media, Sales, HR, Mortgage &Insurance. \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator.  \nHave been instrumental in providing technical solutions to complex business programs Specialties:Installation/Administration of BO application \nScaling the BO Architecture \nSetting up the BO cluster Environment and single sign on  \nMigration of Business Objects XIR2 to Business Objects XI 3.1 SP3 \nExtensive experience in BOXI R2/BOXI 3.1 \nSetting up Disaster recovery for BO application Summary Extensive IT experience in Project Implementation, Analysis, Design, Development and Administration of applications using Business Intelligence Tools with industry domains: Banking & Financial, Media, Sales, HR, Mortgage &Insurance. \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator.  \nHave been instrumental in providing technical solutions to complex business programs Specialties:Installation/Administration of BO application \nScaling the BO Architecture \nSetting up the BO cluster Environment and single sign on  \nMigration of Business Objects XIR2 to Business Objects XI 3.1 SP3 \nExtensive experience in BOXI R2/BOXI 3.1 \nSetting up Disaster recovery for BO application Extensive IT experience in Project Implementation, Analysis, Design, Development and Administration of applications using Business Intelligence Tools with industry domains: Banking & Financial, Media, Sales, HR, Mortgage &Insurance. \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator.  \nHave been instrumental in providing technical solutions to complex business programs Specialties:Installation/Administration of BO application \nScaling the BO Architecture \nSetting up the BO cluster Environment and single sign on  \nMigration of Business Objects XIR2 to Business Objects XI 3.1 SP3 \nExtensive experience in BOXI R2/BOXI 3.1 \nSetting up Disaster recovery for BO application Extensive IT experience in Project Implementation, Analysis, Design, Development and Administration of applications using Business Intelligence Tools with industry domains: Banking & Financial, Media, Sales, HR, Mortgage &Insurance. \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator.  \nHave been instrumental in providing technical solutions to complex business programs Specialties:Installation/Administration of BO application \nScaling the BO Architecture \nSetting up the BO cluster Environment and single sign on  \nMigration of Business Objects XIR2 to Business Objects XI 3.1 SP3 \nExtensive experience in BOXI R2/BOXI 3.1 \nSetting up Disaster recovery for BO application Experience Senior Business Intelligence Engineer Salesforce July 2015  – Present (2 months) San Francisco Bay Area Enterprise Data Warehouse Support Engineer salesforce.com March 2014  – Present (1 year 6 months) San Francisco Bay Area Trained in Hortonworks HDP Operations Install and Manage with Apache Ambari \nSupport for Informatica, Business Objects and Hadoop \nExperience in Tidal scheduling application  \nContribute to the evolving architecture of our services to meet changing requirements for scaling, reliability, performance, manageability \nSupport and enhance existing data warehouse platform by applying system solutions \nApplies knowledge and expertise with technology and application development methodologies to perform system analysis techniques, testing, debugging, design, and storage. \nParticipate in on-call production support rotation. \nWork with cross-functional teams to identify technology modifications that will impact business processes. \nProvides support of all system/service components, including installation, configuration, maintenance and support. \nMaintain confidentiality with regard to information and data being processed, stored or accessed. \nProvide support of the data warehouse 24/7. \nConduct run list reviews, code deployments and post deploy validations following standard software development lifecycle (SDLC). Sr. Business intelligence Tools Administrator Providence Health & Services November 2011  –  March 2014  (2 years 5 months) renton, washington Design and deploy BI tools and environments in support of multiple concurrent initiatives. \nEnsure system availability through active management and monitoring of system resources and capacity, application of patches and bug fixes, and review of system logs. \nCoordinate planned downtimes with developers, customers, and other IT teams. \nPlan and execute all system upgrades and migrations. Plan ahead for future growth. \nEnsure appropriate and maximum use of tools by teaching best practices to developers and imparting expert advice to management. \nStay abreast of general trends in BI and the specific product roadmaps of the tools in the HI portfolio \nGained comprehensive knowledge on tools programming skills like Unix Shell scripting, and project management principles; Agile development methodologies and other SDLC principles \n \nEnterprise Data warehousing and business intelligence principles, familiarity with quantitative methods. Expertise in BOXI 3.1 /SAP BI 4.0 Administration, BI 4.0 CMC, Designer, Web intelligence, Crystal Reports, Data Services, Xcelsius 2008 Tableau, Epic Clarity Reporting Solutions. Technical Yahoo /Apps Dev Engineer Yahoo! August 2008  –  December 2011  (3 years 5 months) Responsible for full life cycle Development, Administration and maintenance of datawarehouse using Business Objects \nExtensive experience with Business Objects 6.5,Business Objects XI R2, BOXI R2 SP5/FP5.5 ,BOXI 3.1 SP3 \nExtensive experience in Xcelsius 2008  \nHands on experience in QaaWS and Live Office  \nExtensive experience in upgrading the service packs and fix packs \nExperience on Infoburst in creating the catalogs and bursting the reports \nExpertise in designing Universe(s) from scratch, migrating to different environments, designing WebI documents and maintaining them on Business Objects XI R2 SP5/BOXI3.1. Senior Software Engineer Tavant Technologies June 2005  –  August 2008  (3 years 3 months) Responsible for full life cycle Development, Administration and Maintenance of datawarehouses using Business Objects both Full-Client Modules (Business Objects Reporting Tool, Designer) and Server-Side Modules (Web Intelligence, Dashboard Manager) \nExtensive experience with Business Objects 6.5,Business Objects XI R2 \nGood Hands on Experience on SAS TOOLS  \nSAS OLAP Cube Studio SAS Data Integration Studio \nSAS Web Report Studio SAS Information Map Studio \nExperience in Installation, configuration & deployment of Business Objects. \nDeployment of BO XI R2 on Windows and Linux. \nHands on experience in Support, Development and Administration of Business Objects \nExtensively involved in the end user training demos  \nGone through SDLC phases during development of reports in Business Objects, Web intelligence \nExperience in migrating Business Objects 6.5 reports into Business Objects XI  \nExtensive experience on Business Objects (CMC, Supervisor, Designer and Reporting) \nExtensive business knowledge in Insurance, Mortgage, Banking and Media industries. BusinessObjects Consultant TiVo 2007  –  2008  (1 year) Experience in Analysis, Design, Development and Administration of Business Objects application . \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator. \nInvolved in the scaling of the BO architecture \nCreated users and groups and applied row level and objects level securities using Central Management Console and designer \nExtensively supported the external Stop||Watch clients \nManaging the execution and coordination with the offshore team that comprised of 10 team members. \nConstructed Business Objects universes using Designer.  \nInvolved in creation of report technical specification documents. \nResponsible for Setting up User access, File support, Universe etc. \nResponsible for creating all the auditing universe and auditing reports \nExpertise in creation of Test plans, Test Scripts and Unit Testing for Business Objects Senior Business Intelligence Engineer Salesforce July 2015  – Present (2 months) San Francisco Bay Area Senior Business Intelligence Engineer Salesforce July 2015  – Present (2 months) San Francisco Bay Area Enterprise Data Warehouse Support Engineer salesforce.com March 2014  – Present (1 year 6 months) San Francisco Bay Area Trained in Hortonworks HDP Operations Install and Manage with Apache Ambari \nSupport for Informatica, Business Objects and Hadoop \nExperience in Tidal scheduling application  \nContribute to the evolving architecture of our services to meet changing requirements for scaling, reliability, performance, manageability \nSupport and enhance existing data warehouse platform by applying system solutions \nApplies knowledge and expertise with technology and application development methodologies to perform system analysis techniques, testing, debugging, design, and storage. \nParticipate in on-call production support rotation. \nWork with cross-functional teams to identify technology modifications that will impact business processes. \nProvides support of all system/service components, including installation, configuration, maintenance and support. \nMaintain confidentiality with regard to information and data being processed, stored or accessed. \nProvide support of the data warehouse 24/7. \nConduct run list reviews, code deployments and post deploy validations following standard software development lifecycle (SDLC). Enterprise Data Warehouse Support Engineer salesforce.com March 2014  – Present (1 year 6 months) San Francisco Bay Area Trained in Hortonworks HDP Operations Install and Manage with Apache Ambari \nSupport for Informatica, Business Objects and Hadoop \nExperience in Tidal scheduling application  \nContribute to the evolving architecture of our services to meet changing requirements for scaling, reliability, performance, manageability \nSupport and enhance existing data warehouse platform by applying system solutions \nApplies knowledge and expertise with technology and application development methodologies to perform system analysis techniques, testing, debugging, design, and storage. \nParticipate in on-call production support rotation. \nWork with cross-functional teams to identify technology modifications that will impact business processes. \nProvides support of all system/service components, including installation, configuration, maintenance and support. \nMaintain confidentiality with regard to information and data being processed, stored or accessed. \nProvide support of the data warehouse 24/7. \nConduct run list reviews, code deployments and post deploy validations following standard software development lifecycle (SDLC). Sr. Business intelligence Tools Administrator Providence Health & Services November 2011  –  March 2014  (2 years 5 months) renton, washington Design and deploy BI tools and environments in support of multiple concurrent initiatives. \nEnsure system availability through active management and monitoring of system resources and capacity, application of patches and bug fixes, and review of system logs. \nCoordinate planned downtimes with developers, customers, and other IT teams. \nPlan and execute all system upgrades and migrations. Plan ahead for future growth. \nEnsure appropriate and maximum use of tools by teaching best practices to developers and imparting expert advice to management. \nStay abreast of general trends in BI and the specific product roadmaps of the tools in the HI portfolio \nGained comprehensive knowledge on tools programming skills like Unix Shell scripting, and project management principles; Agile development methodologies and other SDLC principles \n \nEnterprise Data warehousing and business intelligence principles, familiarity with quantitative methods. Expertise in BOXI 3.1 /SAP BI 4.0 Administration, BI 4.0 CMC, Designer, Web intelligence, Crystal Reports, Data Services, Xcelsius 2008 Tableau, Epic Clarity Reporting Solutions. Sr. Business intelligence Tools Administrator Providence Health & Services November 2011  –  March 2014  (2 years 5 months) renton, washington Design and deploy BI tools and environments in support of multiple concurrent initiatives. \nEnsure system availability through active management and monitoring of system resources and capacity, application of patches and bug fixes, and review of system logs. \nCoordinate planned downtimes with developers, customers, and other IT teams. \nPlan and execute all system upgrades and migrations. Plan ahead for future growth. \nEnsure appropriate and maximum use of tools by teaching best practices to developers and imparting expert advice to management. \nStay abreast of general trends in BI and the specific product roadmaps of the tools in the HI portfolio \nGained comprehensive knowledge on tools programming skills like Unix Shell scripting, and project management principles; Agile development methodologies and other SDLC principles \n \nEnterprise Data warehousing and business intelligence principles, familiarity with quantitative methods. Expertise in BOXI 3.1 /SAP BI 4.0 Administration, BI 4.0 CMC, Designer, Web intelligence, Crystal Reports, Data Services, Xcelsius 2008 Tableau, Epic Clarity Reporting Solutions. Technical Yahoo /Apps Dev Engineer Yahoo! August 2008  –  December 2011  (3 years 5 months) Responsible for full life cycle Development, Administration and maintenance of datawarehouse using Business Objects \nExtensive experience with Business Objects 6.5,Business Objects XI R2, BOXI R2 SP5/FP5.5 ,BOXI 3.1 SP3 \nExtensive experience in Xcelsius 2008  \nHands on experience in QaaWS and Live Office  \nExtensive experience in upgrading the service packs and fix packs \nExperience on Infoburst in creating the catalogs and bursting the reports \nExpertise in designing Universe(s) from scratch, migrating to different environments, designing WebI documents and maintaining them on Business Objects XI R2 SP5/BOXI3.1. Technical Yahoo /Apps Dev Engineer Yahoo! August 2008  –  December 2011  (3 years 5 months) Responsible for full life cycle Development, Administration and maintenance of datawarehouse using Business Objects \nExtensive experience with Business Objects 6.5,Business Objects XI R2, BOXI R2 SP5/FP5.5 ,BOXI 3.1 SP3 \nExtensive experience in Xcelsius 2008  \nHands on experience in QaaWS and Live Office  \nExtensive experience in upgrading the service packs and fix packs \nExperience on Infoburst in creating the catalogs and bursting the reports \nExpertise in designing Universe(s) from scratch, migrating to different environments, designing WebI documents and maintaining them on Business Objects XI R2 SP5/BOXI3.1. Senior Software Engineer Tavant Technologies June 2005  –  August 2008  (3 years 3 months) Responsible for full life cycle Development, Administration and Maintenance of datawarehouses using Business Objects both Full-Client Modules (Business Objects Reporting Tool, Designer) and Server-Side Modules (Web Intelligence, Dashboard Manager) \nExtensive experience with Business Objects 6.5,Business Objects XI R2 \nGood Hands on Experience on SAS TOOLS  \nSAS OLAP Cube Studio SAS Data Integration Studio \nSAS Web Report Studio SAS Information Map Studio \nExperience in Installation, configuration & deployment of Business Objects. \nDeployment of BO XI R2 on Windows and Linux. \nHands on experience in Support, Development and Administration of Business Objects \nExtensively involved in the end user training demos  \nGone through SDLC phases during development of reports in Business Objects, Web intelligence \nExperience in migrating Business Objects 6.5 reports into Business Objects XI  \nExtensive experience on Business Objects (CMC, Supervisor, Designer and Reporting) \nExtensive business knowledge in Insurance, Mortgage, Banking and Media industries. Senior Software Engineer Tavant Technologies June 2005  –  August 2008  (3 years 3 months) Responsible for full life cycle Development, Administration and Maintenance of datawarehouses using Business Objects both Full-Client Modules (Business Objects Reporting Tool, Designer) and Server-Side Modules (Web Intelligence, Dashboard Manager) \nExtensive experience with Business Objects 6.5,Business Objects XI R2 \nGood Hands on Experience on SAS TOOLS  \nSAS OLAP Cube Studio SAS Data Integration Studio \nSAS Web Report Studio SAS Information Map Studio \nExperience in Installation, configuration & deployment of Business Objects. \nDeployment of BO XI R2 on Windows and Linux. \nHands on experience in Support, Development and Administration of Business Objects \nExtensively involved in the end user training demos  \nGone through SDLC phases during development of reports in Business Objects, Web intelligence \nExperience in migrating Business Objects 6.5 reports into Business Objects XI  \nExtensive experience on Business Objects (CMC, Supervisor, Designer and Reporting) \nExtensive business knowledge in Insurance, Mortgage, Banking and Media industries. BusinessObjects Consultant TiVo 2007  –  2008  (1 year) Experience in Analysis, Design, Development and Administration of Business Objects application . \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator. \nInvolved in the scaling of the BO architecture \nCreated users and groups and applied row level and objects level securities using Central Management Console and designer \nExtensively supported the external Stop||Watch clients \nManaging the execution and coordination with the offshore team that comprised of 10 team members. \nConstructed Business Objects universes using Designer.  \nInvolved in creation of report technical specification documents. \nResponsible for Setting up User access, File support, Universe etc. \nResponsible for creating all the auditing universe and auditing reports \nExpertise in creation of Test plans, Test Scripts and Unit Testing for Business Objects BusinessObjects Consultant TiVo 2007  –  2008  (1 year) Experience in Analysis, Design, Development and Administration of Business Objects application . \nWorked on a number of diversified projects at various capacities like Software, Senior Software Engineer & Administrator. \nInvolved in the scaling of the BO architecture \nCreated users and groups and applied row level and objects level securities using Central Management Console and designer \nExtensively supported the external Stop||Watch clients \nManaging the execution and coordination with the offshore team that comprised of 10 team members. \nConstructed Business Objects universes using Designer.  \nInvolved in creation of report technical specification documents. \nResponsible for Setting up User access, File support, Universe etc. \nResponsible for creating all the auditing universe and auditing reports \nExpertise in creation of Test plans, Test Scripts and Unit Testing for Business Objects Skills Business Objects Web Intelligence Administration Crystal Reports Business Intelligence ETL Business Intelligence... Informatica System Administration Unix SDLC Oracle Unix Shell Scripting Data Warehousing PL/SQL SQL SAS Requirements Analysis Linux Microsoft SQL Server Data Modeling Disaster Recovery Databases Hadoop See 9+     See less Skills  Business Objects Web Intelligence Administration Crystal Reports Business Intelligence ETL Business Intelligence... Informatica System Administration Unix SDLC Oracle Unix Shell Scripting Data Warehousing PL/SQL SQL SAS Requirements Analysis Linux Microsoft SQL Server Data Modeling Disaster Recovery Databases Hadoop See 9+     See less Business Objects Web Intelligence Administration Crystal Reports Business Intelligence ETL Business Intelligence... Informatica System Administration Unix SDLC Oracle Unix Shell Scripting Data Warehousing PL/SQL SQL SAS Requirements Analysis Linux Microsoft SQL Server Data Modeling Disaster Recovery Databases Hadoop See 9+     See less Business Objects Web Intelligence Administration Crystal Reports Business Intelligence ETL Business Intelligence... Informatica System Administration Unix SDLC Oracle Unix Shell Scripting Data Warehousing PL/SQL SQL SAS Requirements Analysis Linux Microsoft SQL Server Data Modeling Disaster Recovery Databases Hadoop See 9+     See less Education Jawaharlal Nehru Technological University BTECH,  Computer Science and Information Tech 2000  – 2004 Jawaharlal Nehru Technological University BTECH,  Computer Science and Information Tech 2000  – 2004 Jawaharlal Nehru Technological University BTECH,  Computer Science and Information Tech 2000  – 2004 Jawaharlal Nehru Technological University BTECH,  Computer Science and Information Tech 2000  – 2004 ", "Experience Statistician/Business Intelligence Engineer Freelance Statistician November 2009  – Present (5 years 10 months) Focus on providing statistical research solutions including: \n* Regression studies (simple and mutli-variate) \n* Data mining for populations greater than 1 million in SPSS \n* Financial modeling and simulation \n* ad-hoc analysis \n* MySQL database management \n* Support for databases running on .NET framework Statistician/Business Intelligence Engineer Freelance Statistician November 2009  – Present (5 years 10 months) Focus on providing statistical research solutions including: \n* Regression studies (simple and mutli-variate) \n* Data mining for populations greater than 1 million in SPSS \n* Financial modeling and simulation \n* ad-hoc analysis \n* MySQL database management \n* Support for databases running on .NET framework Research Analyst II CoStar Group November 2005  –  January 2009  (3 years 3 months) *Ad hoc analisys on the sale and lease of commercial buildings. \n \n*Performing regression analysis via proprietary MySQL databases, MS Excel, and CRM \n \n*cash flow and future value analyses for commercial property sales over $5 million, including rent rolls, operating expenses, and loan data.  \n \n*researched relationships between vacancy rates, property types and absorption leasing activity in major Texas cities and Southern California. Statistician/Business Intelligence Engineer Freelance Statistician November 2009  – Present (5 years 10 months) Focus on providing statistical research solutions including: \n* Regression studies (simple and mutli-variate) \n* Data mining for populations greater than 1 million in SPSS \n* Financial modeling and simulation \n* ad-hoc analysis \n* MySQL database management \n* Support for databases running on .NET framework Statistician/Business Intelligence Engineer Freelance Statistician November 2009  – Present (5 years 10 months) Focus on providing statistical research solutions including: \n* Regression studies (simple and mutli-variate) \n* Data mining for populations greater than 1 million in SPSS \n* Financial modeling and simulation \n* ad-hoc analysis \n* MySQL database management \n* Support for databases running on .NET framework Statistician/Business Intelligence Engineer Freelance Statistician November 2009  – Present (5 years 10 months) Focus on providing statistical research solutions including: \n* Regression studies (simple and mutli-variate) \n* Data mining for populations greater than 1 million in SPSS \n* Financial modeling and simulation \n* ad-hoc analysis \n* MySQL database management \n* Support for databases running on .NET framework Statistician/Business Intelligence Engineer Freelance Statistician November 2009  – Present (5 years 10 months) Focus on providing statistical research solutions including: \n* Regression studies (simple and mutli-variate) \n* Data mining for populations greater than 1 million in SPSS \n* Financial modeling and simulation \n* ad-hoc analysis \n* MySQL database management \n* Support for databases running on .NET framework Research Analyst II CoStar Group November 2005  –  January 2009  (3 years 3 months) *Ad hoc analisys on the sale and lease of commercial buildings. \n \n*Performing regression analysis via proprietary MySQL databases, MS Excel, and CRM \n \n*cash flow and future value analyses for commercial property sales over $5 million, including rent rolls, operating expenses, and loan data.  \n \n*researched relationships between vacancy rates, property types and absorption leasing activity in major Texas cities and Southern California. Research Analyst II CoStar Group November 2005  –  January 2009  (3 years 3 months) *Ad hoc analisys on the sale and lease of commercial buildings. \n \n*Performing regression analysis via proprietary MySQL databases, MS Excel, and CRM \n \n*cash flow and future value analyses for commercial property sales over $5 million, including rent rolls, operating expenses, and loan data.  \n \n*researched relationships between vacancy rates, property types and absorption leasing activity in major Texas cities and Southern California. Education San Francisco State University, College of Business B.S.,  Decsion Science/E-Commerce 2008  – 2010 AACSB International accreditation Activities and Societies:  DSSA Student Association;\nIMSA (information management student association) San Francisco State University, College of Business B.S.,  Decsion Science/E-Commerce 2008  – 2010 AACSB International accreditation Activities and Societies:  DSSA Student Association;\nIMSA (information management student association) San Francisco State University, College of Business B.S.,  Decsion Science/E-Commerce 2008  – 2010 AACSB International accreditation Activities and Societies:  DSSA Student Association;\nIMSA (information management student association) San Francisco State University, College of Business B.S.,  Decsion Science/E-Commerce 2008  – 2010 AACSB International accreditation Activities and Societies:  DSSA Student Association;\nIMSA (information management student association) ", "Skills XML Microsoft SQL Server Web Services User Experience .NET PHP JavaScript HTML Data Warehousing Databases MySQL SQL Agile Methodologies Business Intelligence CSS SEO ActionScript AJAX See 3+     See less Skills  XML Microsoft SQL Server Web Services User Experience .NET PHP JavaScript HTML Data Warehousing Databases MySQL SQL Agile Methodologies Business Intelligence CSS SEO ActionScript AJAX See 3+     See less XML Microsoft SQL Server Web Services User Experience .NET PHP JavaScript HTML Data Warehousing Databases MySQL SQL Agile Methodologies Business Intelligence CSS SEO ActionScript AJAX See 3+     See less XML Microsoft SQL Server Web Services User Experience .NET PHP JavaScript HTML Data Warehousing Databases MySQL SQL Agile Methodologies Business Intelligence CSS SEO ActionScript AJAX See 3+     See less ", "Summary \t8+ years of IT experience with expertise in Design and Development of Business Intelligence Reporting and dashboard solutions using Tableau Desktop 8.1, IBM Cognos BI 8.X/10.X Suite, IBM Cognos-TM1, SQL Server and Oracle 11g/9i for Higher Education, Retail, Digital Publishing, Travel and Expense management solutions. \n\tExpertise in: \no\tAdvanced Reporting using OLAP tool- IBM Cognos 8 & 10.2 BI Suite- (Report Studio, Query Studio, and Analysis Studio). \no\tCreating multifaceted data visualization charts and reports for Power users utilizing Tableau Desktop 8.1. \no\tExperience creating dimensions and cubes using Cognos TM1 Turbo Integrator processes. \no\tCreating projects, models, packages, publishing them in the Cognos Framework manager using various data sources. \no\tCreating and publishing Dashboards using Cognos Workspace and Tableau. \no\tDeployment of reports from QA to Production environment. \no\tBursting Reports for the planned and requested schedules. \no\tBuilding multidimensional cubes using Cognos Power play Transformers. \no\tDatabase verification using Oracle PL/SQL Developer, TOAD. \no\tUnit testing, Cross testing of Cognos reports. \n\tExperience in: \no\tDeveloping database objects like Views, functions using Oracle (SQL, PL/SQL)  \no\tDefect tracking tools like Salesforce Issue Tracker, Remedy, Rational- Clear Quest, Bugzilla, and Jira. \no\tTest management tools like HP-Quality Center ,Test Runner \no\tData verification using DML statements \n\tKnowledge on Cognos Administration and Cognos Cafe. \n\tExperience with transactional and data warehouse database concepts; strong SQL skills; \n\tAbility to use complex logic to develop BI deliverables across multiple data sources; and the capability to work with business users one-on-one or in small groups to iteratively develop reporting solutions that meet their needs.  \n Summary \t8+ years of IT experience with expertise in Design and Development of Business Intelligence Reporting and dashboard solutions using Tableau Desktop 8.1, IBM Cognos BI 8.X/10.X Suite, IBM Cognos-TM1, SQL Server and Oracle 11g/9i for Higher Education, Retail, Digital Publishing, Travel and Expense management solutions. \n\tExpertise in: \no\tAdvanced Reporting using OLAP tool- IBM Cognos 8 & 10.2 BI Suite- (Report Studio, Query Studio, and Analysis Studio). \no\tCreating multifaceted data visualization charts and reports for Power users utilizing Tableau Desktop 8.1. \no\tExperience creating dimensions and cubes using Cognos TM1 Turbo Integrator processes. \no\tCreating projects, models, packages, publishing them in the Cognos Framework manager using various data sources. \no\tCreating and publishing Dashboards using Cognos Workspace and Tableau. \no\tDeployment of reports from QA to Production environment. \no\tBursting Reports for the planned and requested schedules. \no\tBuilding multidimensional cubes using Cognos Power play Transformers. \no\tDatabase verification using Oracle PL/SQL Developer, TOAD. \no\tUnit testing, Cross testing of Cognos reports. \n\tExperience in: \no\tDeveloping database objects like Views, functions using Oracle (SQL, PL/SQL)  \no\tDefect tracking tools like Salesforce Issue Tracker, Remedy, Rational- Clear Quest, Bugzilla, and Jira. \no\tTest management tools like HP-Quality Center ,Test Runner \no\tData verification using DML statements \n\tKnowledge on Cognos Administration and Cognos Cafe. \n\tExperience with transactional and data warehouse database concepts; strong SQL skills; \n\tAbility to use complex logic to develop BI deliverables across multiple data sources; and the capability to work with business users one-on-one or in small groups to iteratively develop reporting solutions that meet their needs.  \n \t8+ years of IT experience with expertise in Design and Development of Business Intelligence Reporting and dashboard solutions using Tableau Desktop 8.1, IBM Cognos BI 8.X/10.X Suite, IBM Cognos-TM1, SQL Server and Oracle 11g/9i for Higher Education, Retail, Digital Publishing, Travel and Expense management solutions. \n\tExpertise in: \no\tAdvanced Reporting using OLAP tool- IBM Cognos 8 & 10.2 BI Suite- (Report Studio, Query Studio, and Analysis Studio). \no\tCreating multifaceted data visualization charts and reports for Power users utilizing Tableau Desktop 8.1. \no\tExperience creating dimensions and cubes using Cognos TM1 Turbo Integrator processes. \no\tCreating projects, models, packages, publishing them in the Cognos Framework manager using various data sources. \no\tCreating and publishing Dashboards using Cognos Workspace and Tableau. \no\tDeployment of reports from QA to Production environment. \no\tBursting Reports for the planned and requested schedules. \no\tBuilding multidimensional cubes using Cognos Power play Transformers. \no\tDatabase verification using Oracle PL/SQL Developer, TOAD. \no\tUnit testing, Cross testing of Cognos reports. \n\tExperience in: \no\tDeveloping database objects like Views, functions using Oracle (SQL, PL/SQL)  \no\tDefect tracking tools like Salesforce Issue Tracker, Remedy, Rational- Clear Quest, Bugzilla, and Jira. \no\tTest management tools like HP-Quality Center ,Test Runner \no\tData verification using DML statements \n\tKnowledge on Cognos Administration and Cognos Cafe. \n\tExperience with transactional and data warehouse database concepts; strong SQL skills; \n\tAbility to use complex logic to develop BI deliverables across multiple data sources; and the capability to work with business users one-on-one or in small groups to iteratively develop reporting solutions that meet their needs.  \n \t8+ years of IT experience with expertise in Design and Development of Business Intelligence Reporting and dashboard solutions using Tableau Desktop 8.1, IBM Cognos BI 8.X/10.X Suite, IBM Cognos-TM1, SQL Server and Oracle 11g/9i for Higher Education, Retail, Digital Publishing, Travel and Expense management solutions. \n\tExpertise in: \no\tAdvanced Reporting using OLAP tool- IBM Cognos 8 & 10.2 BI Suite- (Report Studio, Query Studio, and Analysis Studio). \no\tCreating multifaceted data visualization charts and reports for Power users utilizing Tableau Desktop 8.1. \no\tExperience creating dimensions and cubes using Cognos TM1 Turbo Integrator processes. \no\tCreating projects, models, packages, publishing them in the Cognos Framework manager using various data sources. \no\tCreating and publishing Dashboards using Cognos Workspace and Tableau. \no\tDeployment of reports from QA to Production environment. \no\tBursting Reports for the planned and requested schedules. \no\tBuilding multidimensional cubes using Cognos Power play Transformers. \no\tDatabase verification using Oracle PL/SQL Developer, TOAD. \no\tUnit testing, Cross testing of Cognos reports. \n\tExperience in: \no\tDeveloping database objects like Views, functions using Oracle (SQL, PL/SQL)  \no\tDefect tracking tools like Salesforce Issue Tracker, Remedy, Rational- Clear Quest, Bugzilla, and Jira. \no\tTest management tools like HP-Quality Center ,Test Runner \no\tData verification using DML statements \n\tKnowledge on Cognos Administration and Cognos Cafe. \n\tExperience with transactional and data warehouse database concepts; strong SQL skills; \n\tAbility to use complex logic to develop BI deliverables across multiple data sources; and the capability to work with business users one-on-one or in small groups to iteratively develop reporting solutions that meet their needs.  \n Experience Business Intelligence Engineer-III Ericsson October 2014  – Present (11 months) San Jose,CA Tableau Desktop 8.1 Business Intelligence Developer/Analyst-III Concur September 2013  –  October 2014  (1 year 2 months) Bellevue,WA Business Intelligence Engineer/Analyst DeVry University March 2012  –  September 2013  (1 year 7 months) Business Intelligence Consultant Senturus, Inc. October 2011  –  March 2012  (6 months) San Francisco Bay Area Business Intelligence Consultant Zinio Systems 2010  –  2011  (1 year) San Francisco,CA Senior Engineer -Product Development(BI) Symphony Services 2005  –  2010  (5 years) Bengaluru Area, India Business Intelligence Engineer-III Ericsson October 2014  – Present (11 months) San Jose,CA Tableau Desktop 8.1 Business Intelligence Engineer-III Ericsson October 2014  – Present (11 months) San Jose,CA Tableau Desktop 8.1 Business Intelligence Developer/Analyst-III Concur September 2013  –  October 2014  (1 year 2 months) Bellevue,WA Business Intelligence Developer/Analyst-III Concur September 2013  –  October 2014  (1 year 2 months) Bellevue,WA Business Intelligence Engineer/Analyst DeVry University March 2012  –  September 2013  (1 year 7 months) Business Intelligence Engineer/Analyst DeVry University March 2012  –  September 2013  (1 year 7 months) Business Intelligence Consultant Senturus, Inc. October 2011  –  March 2012  (6 months) San Francisco Bay Area Business Intelligence Consultant Senturus, Inc. October 2011  –  March 2012  (6 months) San Francisco Bay Area Business Intelligence Consultant Zinio Systems 2010  –  2011  (1 year) San Francisco,CA Business Intelligence Consultant Zinio Systems 2010  –  2011  (1 year) San Francisco,CA Senior Engineer -Product Development(BI) Symphony Services 2005  –  2010  (5 years) Bengaluru Area, India Senior Engineer -Product Development(BI) Symphony Services 2005  –  2010  (5 years) Bengaluru Area, India Skills Business Intelligence Cognos 8.4 Cognos 10 Report Studio PL/SQL SQL SDLC OLAP Query Studio Analysis Studio DDL DML Education Software Online Retail Oracle Agile PLM Digital publishing TM1 Toad Cognos Databases Analysis Crystal Reports Agile Methodologies ETL Testing Data Modeling Informatica Cognos ReportNet SSIS Business Objects SSRS Dashboard Cubes Dimensional Modeling Tableau See 20+     See less Skills  Business Intelligence Cognos 8.4 Cognos 10 Report Studio PL/SQL SQL SDLC OLAP Query Studio Analysis Studio DDL DML Education Software Online Retail Oracle Agile PLM Digital publishing TM1 Toad Cognos Databases Analysis Crystal Reports Agile Methodologies ETL Testing Data Modeling Informatica Cognos ReportNet SSIS Business Objects SSRS Dashboard Cubes Dimensional Modeling Tableau See 20+     See less Business Intelligence Cognos 8.4 Cognos 10 Report Studio PL/SQL SQL SDLC OLAP Query Studio Analysis Studio DDL DML Education Software Online Retail Oracle Agile PLM Digital publishing TM1 Toad Cognos Databases Analysis Crystal Reports Agile Methodologies ETL Testing Data Modeling Informatica Cognos ReportNet SSIS Business Objects SSRS Dashboard Cubes Dimensional Modeling Tableau See 20+     See less Business Intelligence Cognos 8.4 Cognos 10 Report Studio PL/SQL SQL SDLC OLAP Query Studio Analysis Studio DDL DML Education Software Online Retail Oracle Agile PLM Digital publishing TM1 Toad Cognos Databases Analysis Crystal Reports Agile Methodologies ETL Testing Data Modeling Informatica Cognos ReportNet SSIS Business Objects SSRS Dashboard Cubes Dimensional Modeling Tableau See 20+     See less Education Sri Siddhartha Institute of Technology (SSIT),India Bachelors of Engineering,  Computer Science 2000  – 2004 Activities and Societies:  http://www.ssit.edu.in/ Sri Siddhartha Institute of Technology (SSIT),India Bachelors of Engineering,  Computer Science 2000  – 2004 Activities and Societies:  http://www.ssit.edu.in/ Sri Siddhartha Institute of Technology (SSIT),India Bachelors of Engineering,  Computer Science 2000  – 2004 Activities and Societies:  http://www.ssit.edu.in/ Sri Siddhartha Institute of Technology (SSIT),India Bachelors of Engineering,  Computer Science 2000  – 2004 Activities and Societies:  http://www.ssit.edu.in/ Honors & Awards Additional Honors & Awards \tAward of Achievement certificate from SQL STAR INTERNATIONAL LIMITED, Bangalore for successfully completing the ORACLE Workforce Development Program in SQL and PL/SQL, 2009 \n\tHonored by “Hall of Fame Award” for completing the critical & complex testing phase of project –Concur, 2007 \n\tAwarded “Hall of Fame Award” for outstanding contribution for Project- Century21, 2008 \n\tRecognized and rewarded by “Going the Extra Mile” Award for project- Motricity, 2006 Additional Honors & Awards \tAward of Achievement certificate from SQL STAR INTERNATIONAL LIMITED, Bangalore for successfully completing the ORACLE Workforce Development Program in SQL and PL/SQL, 2009 \n\tHonored by “Hall of Fame Award” for completing the critical & complex testing phase of project –Concur, 2007 \n\tAwarded “Hall of Fame Award” for outstanding contribution for Project- Century21, 2008 \n\tRecognized and rewarded by “Going the Extra Mile” Award for project- Motricity, 2006 Additional Honors & Awards \tAward of Achievement certificate from SQL STAR INTERNATIONAL LIMITED, Bangalore for successfully completing the ORACLE Workforce Development Program in SQL and PL/SQL, 2009 \n\tHonored by “Hall of Fame Award” for completing the critical & complex testing phase of project –Concur, 2007 \n\tAwarded “Hall of Fame Award” for outstanding contribution for Project- Century21, 2008 \n\tRecognized and rewarded by “Going the Extra Mile” Award for project- Motricity, 2006 Additional Honors & Awards \tAward of Achievement certificate from SQL STAR INTERNATIONAL LIMITED, Bangalore for successfully completing the ORACLE Workforce Development Program in SQL and PL/SQL, 2009 \n\tHonored by “Hall of Fame Award” for completing the critical & complex testing phase of project –Concur, 2007 \n\tAwarded “Hall of Fame Award” for outstanding contribution for Project- Century21, 2008 \n\tRecognized and rewarded by “Going the Extra Mile” Award for project- Motricity, 2006 ", "Experience Business Intelligence Engineer III Electronic Arts (EA) August 2014  – Present (1 year 1 month) Redwood City, California Business Intelligence Engineer III Electronic Arts September 2010  –  August 2014  (4 years) Hyderabad Area, India Business Intelligence Engineer III Electronic Arts (EA) August 2014  – Present (1 year 1 month) Redwood City, California Business Intelligence Engineer III Electronic Arts (EA) August 2014  – Present (1 year 1 month) Redwood City, California Business Intelligence Engineer III Electronic Arts September 2010  –  August 2014  (4 years) Hyderabad Area, India Business Intelligence Engineer III Electronic Arts September 2010  –  August 2014  (4 years) Hyderabad Area, India Skills Business Intelligence Hyperion Planning Essabase Teradata Master Data Management Hyperion EPM Informatica Data Quality Data Warehousing Agile Methodologies Oracle SQL PL/SQL Software Project... XML Teradata Data Warehouse Business Intelligence... Requirements Analysis SDLC See 4+     See less Skills  Business Intelligence Hyperion Planning Essabase Teradata Master Data Management Hyperion EPM Informatica Data Quality Data Warehousing Agile Methodologies Oracle SQL PL/SQL Software Project... XML Teradata Data Warehouse Business Intelligence... Requirements Analysis SDLC See 4+     See less Business Intelligence Hyperion Planning Essabase Teradata Master Data Management Hyperion EPM Informatica Data Quality Data Warehousing Agile Methodologies Oracle SQL PL/SQL Software Project... XML Teradata Data Warehouse Business Intelligence... Requirements Analysis SDLC See 4+     See less Business Intelligence Hyperion Planning Essabase Teradata Master Data Management Hyperion EPM Informatica Data Quality Data Warehousing Agile Methodologies Oracle SQL PL/SQL Software Project... XML Teradata Data Warehouse Business Intelligence... Requirements Analysis SDLC See 4+     See less ", "Summary Professional Highlights: \n•\t6+ years of experience in data analysis, reporting and visualization \n•\t2 years in People Analytics  \n•\tAptitude for Math and intuition for data  \n•\tAbility to understand people’s data needs and deliver beyond expectations  \n•\tContinuous studies and practice of programming, data analysis and visualization techniques \n•\tExperience leading a small team  \n•\tA desire to contribute to society and help others \n \nSpecialties:  \n•\tData visualization, dashboard creation \n•\tTableau (creative/power user) \n•\tSQL (MySQL and Oracle) \n•\tPython, JavaScript, Dart, Scala, Java \n•\tD3.js, React.js, PyData,  \n•\tApplied statistics and machine learning  \n•\tFunctional programming and object oriented programming  \n•\tA/B and multivariate testing \n•\tWeb analytics Summary Professional Highlights: \n•\t6+ years of experience in data analysis, reporting and visualization \n•\t2 years in People Analytics  \n•\tAptitude for Math and intuition for data  \n•\tAbility to understand people’s data needs and deliver beyond expectations  \n•\tContinuous studies and practice of programming, data analysis and visualization techniques \n•\tExperience leading a small team  \n•\tA desire to contribute to society and help others \n \nSpecialties:  \n•\tData visualization, dashboard creation \n•\tTableau (creative/power user) \n•\tSQL (MySQL and Oracle) \n•\tPython, JavaScript, Dart, Scala, Java \n•\tD3.js, React.js, PyData,  \n•\tApplied statistics and machine learning  \n•\tFunctional programming and object oriented programming  \n•\tA/B and multivariate testing \n•\tWeb analytics Professional Highlights: \n•\t6+ years of experience in data analysis, reporting and visualization \n•\t2 years in People Analytics  \n•\tAptitude for Math and intuition for data  \n•\tAbility to understand people’s data needs and deliver beyond expectations  \n•\tContinuous studies and practice of programming, data analysis and visualization techniques \n•\tExperience leading a small team  \n•\tA desire to contribute to society and help others \n \nSpecialties:  \n•\tData visualization, dashboard creation \n•\tTableau (creative/power user) \n•\tSQL (MySQL and Oracle) \n•\tPython, JavaScript, Dart, Scala, Java \n•\tD3.js, React.js, PyData,  \n•\tApplied statistics and machine learning  \n•\tFunctional programming and object oriented programming  \n•\tA/B and multivariate testing \n•\tWeb analytics Professional Highlights: \n•\t6+ years of experience in data analysis, reporting and visualization \n•\t2 years in People Analytics  \n•\tAptitude for Math and intuition for data  \n•\tAbility to understand people’s data needs and deliver beyond expectations  \n•\tContinuous studies and practice of programming, data analysis and visualization techniques \n•\tExperience leading a small team  \n•\tA desire to contribute to society and help others \n \nSpecialties:  \n•\tData visualization, dashboard creation \n•\tTableau (creative/power user) \n•\tSQL (MySQL and Oracle) \n•\tPython, JavaScript, Dart, Scala, Java \n•\tD3.js, React.js, PyData,  \n•\tApplied statistics and machine learning  \n•\tFunctional programming and object oriented programming  \n•\tA/B and multivariate testing \n•\tWeb analytics Experience Business Intelligence Engineer, People Analytics Facebook February 2013  – Present (2 years 7 months) San Francisco Bay Area •\tBuild people-info dashboards for audiences from HR to executives, team managers, and all employees \n•\tProvide analytics and inform decisions in hiring and growing employees. \n•\tHack on new data visualizations and data tools. Data Tool Builder Pacific Gas and Electric Company December 2011  –  January 2013  (1 year 2 months) San Francisco Bay Area •\tWrote Python & SQL scripts to automate data wrangling processes; delivered reports to all North CA cities. \n•\tDeveloped interactive Tableau dashboards on energy efficiency data; uncovered analytical insights. \n•\tProtected the environment by helping customers reduce energy usage and green house gas emission. Data Analyst Remilon, LLC February 2011  –  November 2011  (10 months) Mountain View, CA • Distilled insights to increase traffic and revenue by analyzing data on millions of organic visitors to multiple web sites. Established KPIs, wrote complex queries and scripts for data aggregation, built and automated dashboards, performed statistical analyses and delivered insights across all levels of the organization \n• Lead site optimization analytics efforts to enhance user experience and boost conversion funnel success \n• Helped launch and run a profitable Google Adwords campaign on thousands of keywords, with increasing ROI \n• Ensured quality of decision-driving data with methodical data validation and keen attention to detail Business Process Analyst/Data Analyst State Farm Insurance Companies July 2008  –  February 2011  (2 years 8 months) Los Angeles + San Diego, CA •\tImproved operational efficiency by leading Lean Six Sigma projects and spearheading data analysis efforts \n•\tImproved and implemented Resource Prioritization Model, eliminated low-impact project efforts, saving $1.4M \n•\tPerformed market analysis and prepared marketing strategy recommendations for Senior Vice Presidents \n•\tReceived Outstanding & Special Achievement Awards, also commended for “the most impactful analysis ever” College Intern State Farm Insurance July 2007  –  December 2007  (6 months) Roseville, CA •\tImproved state-wide internal communication methods by extracting insights from survey data.  \n•\tPerformed ad-hoc data analyses. Mathematics Tutor California State University, Sacramento August 2005  –  May 2007  (1 year 10 months) Business Intelligence Engineer, People Analytics Facebook February 2013  – Present (2 years 7 months) San Francisco Bay Area •\tBuild people-info dashboards for audiences from HR to executives, team managers, and all employees \n•\tProvide analytics and inform decisions in hiring and growing employees. \n•\tHack on new data visualizations and data tools. Business Intelligence Engineer, People Analytics Facebook February 2013  – Present (2 years 7 months) San Francisco Bay Area •\tBuild people-info dashboards for audiences from HR to executives, team managers, and all employees \n•\tProvide analytics and inform decisions in hiring and growing employees. \n•\tHack on new data visualizations and data tools. Data Tool Builder Pacific Gas and Electric Company December 2011  –  January 2013  (1 year 2 months) San Francisco Bay Area •\tWrote Python & SQL scripts to automate data wrangling processes; delivered reports to all North CA cities. \n•\tDeveloped interactive Tableau dashboards on energy efficiency data; uncovered analytical insights. \n•\tProtected the environment by helping customers reduce energy usage and green house gas emission. Data Tool Builder Pacific Gas and Electric Company December 2011  –  January 2013  (1 year 2 months) San Francisco Bay Area •\tWrote Python & SQL scripts to automate data wrangling processes; delivered reports to all North CA cities. \n•\tDeveloped interactive Tableau dashboards on energy efficiency data; uncovered analytical insights. \n•\tProtected the environment by helping customers reduce energy usage and green house gas emission. Data Analyst Remilon, LLC February 2011  –  November 2011  (10 months) Mountain View, CA • Distilled insights to increase traffic and revenue by analyzing data on millions of organic visitors to multiple web sites. Established KPIs, wrote complex queries and scripts for data aggregation, built and automated dashboards, performed statistical analyses and delivered insights across all levels of the organization \n• Lead site optimization analytics efforts to enhance user experience and boost conversion funnel success \n• Helped launch and run a profitable Google Adwords campaign on thousands of keywords, with increasing ROI \n• Ensured quality of decision-driving data with methodical data validation and keen attention to detail Data Analyst Remilon, LLC February 2011  –  November 2011  (10 months) Mountain View, CA • Distilled insights to increase traffic and revenue by analyzing data on millions of organic visitors to multiple web sites. Established KPIs, wrote complex queries and scripts for data aggregation, built and automated dashboards, performed statistical analyses and delivered insights across all levels of the organization \n• Lead site optimization analytics efforts to enhance user experience and boost conversion funnel success \n• Helped launch and run a profitable Google Adwords campaign on thousands of keywords, with increasing ROI \n• Ensured quality of decision-driving data with methodical data validation and keen attention to detail Business Process Analyst/Data Analyst State Farm Insurance Companies July 2008  –  February 2011  (2 years 8 months) Los Angeles + San Diego, CA •\tImproved operational efficiency by leading Lean Six Sigma projects and spearheading data analysis efforts \n•\tImproved and implemented Resource Prioritization Model, eliminated low-impact project efforts, saving $1.4M \n•\tPerformed market analysis and prepared marketing strategy recommendations for Senior Vice Presidents \n•\tReceived Outstanding & Special Achievement Awards, also commended for “the most impactful analysis ever” Business Process Analyst/Data Analyst State Farm Insurance Companies July 2008  –  February 2011  (2 years 8 months) Los Angeles + San Diego, CA •\tImproved operational efficiency by leading Lean Six Sigma projects and spearheading data analysis efforts \n•\tImproved and implemented Resource Prioritization Model, eliminated low-impact project efforts, saving $1.4M \n•\tPerformed market analysis and prepared marketing strategy recommendations for Senior Vice Presidents \n•\tReceived Outstanding & Special Achievement Awards, also commended for “the most impactful analysis ever” College Intern State Farm Insurance July 2007  –  December 2007  (6 months) Roseville, CA •\tImproved state-wide internal communication methods by extracting insights from survey data.  \n•\tPerformed ad-hoc data analyses. College Intern State Farm Insurance July 2007  –  December 2007  (6 months) Roseville, CA •\tImproved state-wide internal communication methods by extracting insights from survey data.  \n•\tPerformed ad-hoc data analyses. Mathematics Tutor California State University, Sacramento August 2005  –  May 2007  (1 year 10 months) Mathematics Tutor California State University, Sacramento August 2005  –  May 2007  (1 year 10 months) Skills Data Analysis Data Mining Python Tableau MySQL A/B testing Google Adwords Oracle SQL JavaScript D3.js Analytics SQL Business Intelligence Web Analytics Skills  Data Analysis Data Mining Python Tableau MySQL A/B testing Google Adwords Oracle SQL JavaScript D3.js Analytics SQL Business Intelligence Web Analytics Data Analysis Data Mining Python Tableau MySQL A/B testing Google Adwords Oracle SQL JavaScript D3.js Analytics SQL Business Intelligence Web Analytics Data Analysis Data Mining Python Tableau MySQL A/B testing Google Adwords Oracle SQL JavaScript D3.js Analytics SQL Business Intelligence Web Analytics Education California State University-Sacramento Bachelor of Arts (B.A.),  Applied Mathematics and Statistics , 3.87 2005  – 2007 Graduated Magna Cum Laude Activities and Societies:  Pi Mu Epsilon INTI International College, Penang General studies,  Economics 2002  – 2004 USSH English Language and Literature/Letters 2000  – 2002 California State University-Sacramento Bachelor of Arts (B.A.),  Applied Mathematics and Statistics , 3.87 2005  – 2007 Graduated Magna Cum Laude Activities and Societies:  Pi Mu Epsilon California State University-Sacramento Bachelor of Arts (B.A.),  Applied Mathematics and Statistics , 3.87 2005  – 2007 Graduated Magna Cum Laude Activities and Societies:  Pi Mu Epsilon California State University-Sacramento Bachelor of Arts (B.A.),  Applied Mathematics and Statistics , 3.87 2005  – 2007 Graduated Magna Cum Laude Activities and Societies:  Pi Mu Epsilon INTI International College, Penang General studies,  Economics 2002  – 2004 INTI International College, Penang General studies,  Economics 2002  – 2004 INTI International College, Penang General studies,  Economics 2002  – 2004 USSH English Language and Literature/Letters 2000  – 2002 USSH English Language and Literature/Letters 2000  – 2002 USSH English Language and Literature/Letters 2000  – 2002 ", "Summary -8+ years of Data warehousing experience in SQL Server 2005/2008R2, SQL Server Analysis Services (SSAS) and SQL Server Integration Services (SSIS)  \n-Microsoft Certified Technology Specialist (MCTS) in SQL Server 2008, Business Intelligence Development and Maintenance \n \nSpecialties:  \nDatabases: SQL Server 2005/2008R2/2012 \nETL Tools: SQL Server Integration Server, Microsoft BI Studio \nReporting Tools: SQL Server Reporting Services \nBuild Automation using Microsoft Team Build Summary -8+ years of Data warehousing experience in SQL Server 2005/2008R2, SQL Server Analysis Services (SSAS) and SQL Server Integration Services (SSIS)  \n-Microsoft Certified Technology Specialist (MCTS) in SQL Server 2008, Business Intelligence Development and Maintenance \n \nSpecialties:  \nDatabases: SQL Server 2005/2008R2/2012 \nETL Tools: SQL Server Integration Server, Microsoft BI Studio \nReporting Tools: SQL Server Reporting Services \nBuild Automation using Microsoft Team Build -8+ years of Data warehousing experience in SQL Server 2005/2008R2, SQL Server Analysis Services (SSAS) and SQL Server Integration Services (SSIS)  \n-Microsoft Certified Technology Specialist (MCTS) in SQL Server 2008, Business Intelligence Development and Maintenance \n \nSpecialties:  \nDatabases: SQL Server 2005/2008R2/2012 \nETL Tools: SQL Server Integration Server, Microsoft BI Studio \nReporting Tools: SQL Server Reporting Services \nBuild Automation using Microsoft Team Build -8+ years of Data warehousing experience in SQL Server 2005/2008R2, SQL Server Analysis Services (SSAS) and SQL Server Integration Services (SSIS)  \n-Microsoft Certified Technology Specialist (MCTS) in SQL Server 2008, Business Intelligence Development and Maintenance \n \nSpecialties:  \nDatabases: SQL Server 2005/2008R2/2012 \nETL Tools: SQL Server Integration Server, Microsoft BI Studio \nReporting Tools: SQL Server Reporting Services \nBuild Automation using Microsoft Team Build Experience Sr. Business Intelligence Engineer Cost Plus World Market July 2013  – Present (2 years 2 months) Oakland Sr. Business Intelligence Engineer Avaya January 2006  –  June 2013  (7 years 6 months) Santa Clara, CA - Designed and implemented Business Intelligence Systems to provide timely and accurate information to several groups across Avaya, such as Engineering, System Verification, Customer Support and Sales Support.  \n- Lead several projects through the entire BI lifecycle from Requirements gathering, Dimensional modeling, Database Design to Deployment, User Training and Maintenance Support. \n- Automated the deployment of packages, cubes and reports to QA and Production. \n- Trained BI developers to follow best practices when developing packages and cubes. Peer reviewed code to ensure consistency and maintainability. \n- Customized TFS/Team Build to build Microsoft BI project types. Set up continuous builds to notify users of build failures almost immediately after check-in \n- Planned and implemented upgrades of all components of the SQL Server and Team Foundation Server. Customer Support Engineer Avaya Inc January 2001  –  December 2005  (5 years) Milpitas, CA Regarded as a subject matter expert on the Modular Messaging product. Consulted by development and QA teams \nExpedited bug-fixes by acting as a liaison between customer, field support and product development teams \nInitiated weekly knowledge sharing sessions, authored training plans for new team members and published several knowledge base articles Sr. Business Intelligence Engineer Cost Plus World Market July 2013  – Present (2 years 2 months) Oakland Sr. Business Intelligence Engineer Cost Plus World Market July 2013  – Present (2 years 2 months) Oakland Sr. Business Intelligence Engineer Avaya January 2006  –  June 2013  (7 years 6 months) Santa Clara, CA - Designed and implemented Business Intelligence Systems to provide timely and accurate information to several groups across Avaya, such as Engineering, System Verification, Customer Support and Sales Support.  \n- Lead several projects through the entire BI lifecycle from Requirements gathering, Dimensional modeling, Database Design to Deployment, User Training and Maintenance Support. \n- Automated the deployment of packages, cubes and reports to QA and Production. \n- Trained BI developers to follow best practices when developing packages and cubes. Peer reviewed code to ensure consistency and maintainability. \n- Customized TFS/Team Build to build Microsoft BI project types. Set up continuous builds to notify users of build failures almost immediately after check-in \n- Planned and implemented upgrades of all components of the SQL Server and Team Foundation Server. Sr. Business Intelligence Engineer Avaya January 2006  –  June 2013  (7 years 6 months) Santa Clara, CA - Designed and implemented Business Intelligence Systems to provide timely and accurate information to several groups across Avaya, such as Engineering, System Verification, Customer Support and Sales Support.  \n- Lead several projects through the entire BI lifecycle from Requirements gathering, Dimensional modeling, Database Design to Deployment, User Training and Maintenance Support. \n- Automated the deployment of packages, cubes and reports to QA and Production. \n- Trained BI developers to follow best practices when developing packages and cubes. Peer reviewed code to ensure consistency and maintainability. \n- Customized TFS/Team Build to build Microsoft BI project types. Set up continuous builds to notify users of build failures almost immediately after check-in \n- Planned and implemented upgrades of all components of the SQL Server and Team Foundation Server. Customer Support Engineer Avaya Inc January 2001  –  December 2005  (5 years) Milpitas, CA Regarded as a subject matter expert on the Modular Messaging product. Consulted by development and QA teams \nExpedited bug-fixes by acting as a liaison between customer, field support and product development teams \nInitiated weekly knowledge sharing sessions, authored training plans for new team members and published several knowledge base articles Customer Support Engineer Avaya Inc January 2001  –  December 2005  (5 years) Milpitas, CA Regarded as a subject matter expert on the Modular Messaging product. Consulted by development and QA teams \nExpedited bug-fixes by acting as a liaison between customer, field support and product development teams \nInitiated weekly knowledge sharing sessions, authored training plans for new team members and published several knowledge base articles Languages   Skills SSRS Microsoft SQL Server Data Warehousing Business Intelligence SSIS Agile Methodologies Software Development TFS C# Analysis Services VB.NET SQL Business Intelligence... Scrum Visual Studio Databases SSAS ETL Tableau See 4+     See less Skills  SSRS Microsoft SQL Server Data Warehousing Business Intelligence SSIS Agile Methodologies Software Development TFS C# Analysis Services VB.NET SQL Business Intelligence... Scrum Visual Studio Databases SSAS ETL Tableau See 4+     See less SSRS Microsoft SQL Server Data Warehousing Business Intelligence SSIS Agile Methodologies Software Development TFS C# Analysis Services VB.NET SQL Business Intelligence... Scrum Visual Studio Databases SSAS ETL Tableau See 4+     See less SSRS Microsoft SQL Server Data Warehousing Business Intelligence SSIS Agile Methodologies Software Development TFS C# Analysis Services VB.NET SQL Business Intelligence... Scrum Visual Studio Databases SSAS ETL Tableau See 4+     See less Education Manipal Academy of Higher Education Bachelor of Engineering (B.E.),  Computer Engineering 1994  – 1998 Manipal Academy of Higher Education Bachelor of Engineering (B.E.),  Computer Engineering 1994  – 1998 Manipal Academy of Higher Education Bachelor of Engineering (B.E.),  Computer Engineering 1994  – 1998 Manipal Academy of Higher Education Bachelor of Engineering (B.E.),  Computer Engineering 1994  – 1998 ", "Skills SaaS Mergers & Acquisitions Program Management Management HTML Enterprise Software Business Development SQL Negotiation Contract Negotiation CRM Human Resources Solution Selling Mergers Salesforce.com Accounting Business Intelligence Strategic Planning Sales Process Strategic Partnerships Venture Capital Team Leadership Strategy Business Strategy Selling Sales Finance Leadership Product Marketing Data Warehousing Start-ups Sales Management Product Management See 18+     See less Skills  SaaS Mergers & Acquisitions Program Management Management HTML Enterprise Software Business Development SQL Negotiation Contract Negotiation CRM Human Resources Solution Selling Mergers Salesforce.com Accounting Business Intelligence Strategic Planning Sales Process Strategic Partnerships Venture Capital Team Leadership Strategy Business Strategy Selling Sales Finance Leadership Product Marketing Data Warehousing Start-ups Sales Management Product Management See 18+     See less SaaS Mergers & Acquisitions Program Management Management HTML Enterprise Software Business Development SQL Negotiation Contract Negotiation CRM Human Resources Solution Selling Mergers Salesforce.com Accounting Business Intelligence Strategic Planning Sales Process Strategic Partnerships Venture Capital Team Leadership Strategy Business Strategy Selling Sales Finance Leadership Product Marketing Data Warehousing Start-ups Sales Management Product Management See 18+     See less SaaS Mergers & Acquisitions Program Management Management HTML Enterprise Software Business Development SQL Negotiation Contract Negotiation CRM Human Resources Solution Selling Mergers Salesforce.com Accounting Business Intelligence Strategic Planning Sales Process Strategic Partnerships Venture Capital Team Leadership Strategy Business Strategy Selling Sales Finance Leadership Product Marketing Data Warehousing Start-ups Sales Management Product Management See 18+     See less ", "Skills Database Administration Data Warehousing Database Design Database Management OBIEE Oracle Sybase MySQL Microsoft SQL Server Unix Shell Scripting Red Hat Linux Relational Databases Database Security ETL Team Leadership Teamwork Team Management Business Intelligence Data Migration Shell Scripting Master Data Management Unix Databases Integration Performance Tuning High Availability SAP Perl PL/SQL Database Admin Data Modeling Solaris Data Warehouse... Erwin Dimensional Modeling Data Integration SSIS See 22+     See less Skills  Database Administration Data Warehousing Database Design Database Management OBIEE Oracle Sybase MySQL Microsoft SQL Server Unix Shell Scripting Red Hat Linux Relational Databases Database Security ETL Team Leadership Teamwork Team Management Business Intelligence Data Migration Shell Scripting Master Data Management Unix Databases Integration Performance Tuning High Availability SAP Perl PL/SQL Database Admin Data Modeling Solaris Data Warehouse... Erwin Dimensional Modeling Data Integration SSIS See 22+     See less Database Administration Data Warehousing Database Design Database Management OBIEE Oracle Sybase MySQL Microsoft SQL Server Unix Shell Scripting Red Hat Linux Relational Databases Database Security ETL Team Leadership Teamwork Team Management Business Intelligence Data Migration Shell Scripting Master Data Management Unix Databases Integration Performance Tuning High Availability SAP Perl PL/SQL Database Admin Data Modeling Solaris Data Warehouse... Erwin Dimensional Modeling Data Integration SSIS See 22+     See less Database Administration Data Warehousing Database Design Database Management OBIEE Oracle Sybase MySQL Microsoft SQL Server Unix Shell Scripting Red Hat Linux Relational Databases Database Security ETL Team Leadership Teamwork Team Management Business Intelligence Data Migration Shell Scripting Master Data Management Unix Databases Integration Performance Tuning High Availability SAP Perl PL/SQL Database Admin Data Modeling Solaris Data Warehouse... Erwin Dimensional Modeling Data Integration SSIS See 22+     See less ", "Summary Specialties:Participate in technical database design and planning and coordinate changes to systems to accommodate changing business requirements \nDesign and develop Decision Support Systems and Analytics for tracking programs and metrics to measure and optimize traffic using Omniture tools and MicroStrategy \nEstablish sound Database Administration best practices Summary Specialties:Participate in technical database design and planning and coordinate changes to systems to accommodate changing business requirements \nDesign and develop Decision Support Systems and Analytics for tracking programs and metrics to measure and optimize traffic using Omniture tools and MicroStrategy \nEstablish sound Database Administration best practices Specialties:Participate in technical database design and planning and coordinate changes to systems to accommodate changing business requirements \nDesign and develop Decision Support Systems and Analytics for tracking programs and metrics to measure and optimize traffic using Omniture tools and MicroStrategy \nEstablish sound Database Administration best practices Specialties:Participate in technical database design and planning and coordinate changes to systems to accommodate changing business requirements \nDesign and develop Decision Support Systems and Analytics for tracking programs and metrics to measure and optimize traffic using Omniture tools and MicroStrategy \nEstablish sound Database Administration best practices Experience Senior Business Intelligence Engineer, Analytics and Data Sciences Zoosk April 2011  – Present (4 years 5 months) San Francisco Bay Area Business Intelligence Database Administrator ZAG INC March 2010  –  December 2011  (1 year 10 months) Database Administrator Tribune Company December 2009  –  March 2010  (4 months) Application Developer Los Angeles Times August 2007  –  December 2009  (2 years 5 months) Software Engineer Hewlett Packard June 2005  –  July 2006  (1 year 2 months) Worked as an ETL developer in the data warehouse practice. Senior Business Intelligence Engineer, Analytics and Data Sciences Zoosk April 2011  – Present (4 years 5 months) San Francisco Bay Area Senior Business Intelligence Engineer, Analytics and Data Sciences Zoosk April 2011  – Present (4 years 5 months) San Francisco Bay Area Business Intelligence Database Administrator ZAG INC March 2010  –  December 2011  (1 year 10 months) Business Intelligence Database Administrator ZAG INC March 2010  –  December 2011  (1 year 10 months) Database Administrator Tribune Company December 2009  –  March 2010  (4 months) Database Administrator Tribune Company December 2009  –  March 2010  (4 months) Application Developer Los Angeles Times August 2007  –  December 2009  (2 years 5 months) Application Developer Los Angeles Times August 2007  –  December 2009  (2 years 5 months) Software Engineer Hewlett Packard June 2005  –  July 2006  (1 year 2 months) Worked as an ETL developer in the data warehouse practice. Software Engineer Hewlett Packard June 2005  –  July 2006  (1 year 2 months) Worked as an ETL developer in the data warehouse practice. Skills Business Intelligence Database Design Data Warehousing Analytics Program Management Web Services Software Project... ETL Omniture SQL SDLC Database Administration Project Management Business Analysis Agile Methodologies Microstrategy Databases Data Mining See 3+     See less Skills  Business Intelligence Database Design Data Warehousing Analytics Program Management Web Services Software Project... ETL Omniture SQL SDLC Database Administration Project Management Business Analysis Agile Methodologies Microstrategy Databases Data Mining See 3+     See less Business Intelligence Database Design Data Warehousing Analytics Program Management Web Services Software Project... ETL Omniture SQL SDLC Database Administration Project Management Business Analysis Agile Methodologies Microstrategy Databases Data Mining See 3+     See less Business Intelligence Database Design Data Warehousing Analytics Program Management Web Services Software Project... ETL Omniture SQL SDLC Database Administration Project Management Business Analysis Agile Methodologies Microstrategy Databases Data Mining See 3+     See less Education University of Southern California M.S,  Computer Science 2006  – 2007 Visvesvaraya Technological University BE,  CS 2001  – 2005 University of Southern California M.S,  Computer Science 2006  – 2007 University of Southern California M.S,  Computer Science 2006  – 2007 University of Southern California M.S,  Computer Science 2006  – 2007 Visvesvaraya Technological University BE,  CS 2001  – 2005 Visvesvaraya Technological University BE,  CS 2001  – 2005 Visvesvaraya Technological University BE,  CS 2001  – 2005 ", "Skills ETL Data Warehousing Business Intelligence OLAP SaaS Data Marts Cloud Computing Web Services J2EE Agile Scalability Dashboard Web 2.0 Incentive Programs Databases Agile Methodologies Unix SOA Java Enterprise Edition Salesforce.com Enterprise Software Oracle Scrum Web Applications See 9+     See less Skills  ETL Data Warehousing Business Intelligence OLAP SaaS Data Marts Cloud Computing Web Services J2EE Agile Scalability Dashboard Web 2.0 Incentive Programs Databases Agile Methodologies Unix SOA Java Enterprise Edition Salesforce.com Enterprise Software Oracle Scrum Web Applications See 9+     See less ETL Data Warehousing Business Intelligence OLAP SaaS Data Marts Cloud Computing Web Services J2EE Agile Scalability Dashboard Web 2.0 Incentive Programs Databases Agile Methodologies Unix SOA Java Enterprise Edition Salesforce.com Enterprise Software Oracle Scrum Web Applications See 9+     See less ETL Data Warehousing Business Intelligence OLAP SaaS Data Marts Cloud Computing Web Services J2EE Agile Scalability Dashboard Web 2.0 Incentive Programs Databases Agile Methodologies Unix SOA Java Enterprise Edition Salesforce.com Enterprise Software Oracle Scrum Web Applications See 9+     See less ", "Experience BI Analyst (contract) Intel Corporation February 2013  –  April 2013  (3 months) Hillsboro, OR Business Intelligence Consultant Analytics8 2011  –  2012  (1 year) Chicago, IL Business Intelligence Consultant Lunexa 2008  –  2010  (2 years) San Francisco Bay Area Production Consultant MicroStrategy 2005  –  2007  (2 years) San Francisco/Washington D.C. BI Analyst (contract) Intel Corporation February 2013  –  April 2013  (3 months) Hillsboro, OR BI Analyst (contract) Intel Corporation February 2013  –  April 2013  (3 months) Hillsboro, OR Business Intelligence Consultant Analytics8 2011  –  2012  (1 year) Chicago, IL Business Intelligence Consultant Analytics8 2011  –  2012  (1 year) Chicago, IL Business Intelligence Consultant Lunexa 2008  –  2010  (2 years) San Francisco Bay Area Business Intelligence Consultant Lunexa 2008  –  2010  (2 years) San Francisco Bay Area Production Consultant MicroStrategy 2005  –  2007  (2 years) San Francisco/Washington D.C. Production Consultant MicroStrategy 2005  –  2007  (2 years) San Francisco/Washington D.C. Languages English Native or bilingual proficiency Russian Native or bilingual proficiency Chinese (Mandarin) Elementary proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Chinese (Mandarin) Elementary proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Chinese (Mandarin) Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Business Intelligence Data Warehousing Microstrategy Tableau Analytics SQL Data Modeling JavaScript Python Data Visualization D3 jQuery CSS Bootstrap Skills  Business Intelligence Data Warehousing Microstrategy Tableau Analytics SQL Data Modeling JavaScript Python Data Visualization D3 jQuery CSS Bootstrap Business Intelligence Data Warehousing Microstrategy Tableau Analytics SQL Data Modeling JavaScript Python Data Visualization D3 jQuery CSS Bootstrap Business Intelligence Data Warehousing Microstrategy Tableau Analytics SQL Data Modeling JavaScript Python Data Visualization D3 jQuery CSS Bootstrap Education University of California, Davis BA,  Economics 2004  – 2005 University of California, Davis BA,  Economics 2004  – 2005 University of California, Davis BA,  Economics 2004  – 2005 University of California, Davis BA,  Economics 2004  – 2005 ", "Summary In all of the positions I have held the common theme is that of a troubleshooter by being detail-oriented, solving problems, taking a business view, and looking for better ways to do the job. Whether it was planning, reporting, or sytems adminstration. Specialties:MES Systems, Planning Systems, MS Access and SQL SERVER Databases Summary In all of the positions I have held the common theme is that of a troubleshooter by being detail-oriented, solving problems, taking a business view, and looking for better ways to do the job. Whether it was planning, reporting, or sytems adminstration. Specialties:MES Systems, Planning Systems, MS Access and SQL SERVER Databases In all of the positions I have held the common theme is that of a troubleshooter by being detail-oriented, solving problems, taking a business view, and looking for better ways to do the job. Whether it was planning, reporting, or sytems adminstration. Specialties:MES Systems, Planning Systems, MS Access and SQL SERVER Databases In all of the positions I have held the common theme is that of a troubleshooter by being detail-oriented, solving problems, taking a business view, and looking for better ways to do the job. Whether it was planning, reporting, or sytems adminstration. Specialties:MES Systems, Planning Systems, MS Access and SQL SERVER Databases Experience Business Intelligence Engineer TiVo June 2011  – Present (4 years 3 months) Alviso, CA Business Intelligence QA of ETL processes and reports with OBIEE, Oracle PL/SQL, Hyperion and Internal TiVo tools. Technical Operations Support TiVo August 2010  –  November 2011  (1 year 4 months) Currently working at TiVo as a contract employee DATABASE ANALYST & APPLICATION SUPPORT Unemployed and Looking January 2009  –  July 2010  (1 year 7 months) Currently working at TiVo as a contract employee Business Systems Analyst Dimatix August 2007  –  January 2009  (1 year 6 months) Eyelit MES administration including performance monitoring, patch / upgrade implementation and system troubleshooting. \n \nSQL Server 2005 database maintenance and troubleshooting \n \nSQL Queries from Eyelit database \n \nCollaborate with manufacturing to define business rules to insure data and system integrity IT Analyst / Business Planning Analog Devices February 1982  –  November 2006  (24 years 10 months) I started at Precision Monolithics which was acquired by Analog Devices in 1990. My career track went from various levels of business / manufacturing planning to systems support / reporting for the planning community. Business Intelligence Engineer TiVo June 2011  – Present (4 years 3 months) Alviso, CA Business Intelligence QA of ETL processes and reports with OBIEE, Oracle PL/SQL, Hyperion and Internal TiVo tools. Business Intelligence Engineer TiVo June 2011  – Present (4 years 3 months) Alviso, CA Business Intelligence QA of ETL processes and reports with OBIEE, Oracle PL/SQL, Hyperion and Internal TiVo tools. Technical Operations Support TiVo August 2010  –  November 2011  (1 year 4 months) Currently working at TiVo as a contract employee Technical Operations Support TiVo August 2010  –  November 2011  (1 year 4 months) Currently working at TiVo as a contract employee DATABASE ANALYST & APPLICATION SUPPORT Unemployed and Looking January 2009  –  July 2010  (1 year 7 months) Currently working at TiVo as a contract employee DATABASE ANALYST & APPLICATION SUPPORT Unemployed and Looking January 2009  –  July 2010  (1 year 7 months) Currently working at TiVo as a contract employee Business Systems Analyst Dimatix August 2007  –  January 2009  (1 year 6 months) Eyelit MES administration including performance monitoring, patch / upgrade implementation and system troubleshooting. \n \nSQL Server 2005 database maintenance and troubleshooting \n \nSQL Queries from Eyelit database \n \nCollaborate with manufacturing to define business rules to insure data and system integrity Business Systems Analyst Dimatix August 2007  –  January 2009  (1 year 6 months) Eyelit MES administration including performance monitoring, patch / upgrade implementation and system troubleshooting. \n \nSQL Server 2005 database maintenance and troubleshooting \n \nSQL Queries from Eyelit database \n \nCollaborate with manufacturing to define business rules to insure data and system integrity IT Analyst / Business Planning Analog Devices February 1982  –  November 2006  (24 years 10 months) I started at Precision Monolithics which was acquired by Analog Devices in 1990. My career track went from various levels of business / manufacturing planning to systems support / reporting for the planning community. IT Analyst / Business Planning Analog Devices February 1982  –  November 2006  (24 years 10 months) I started at Precision Monolithics which was acquired by Analog Devices in 1990. My career track went from various levels of business / manufacturing planning to systems support / reporting for the planning community. Skills Troubleshooting Databases Manufacturing Quality Assurance Semiconductors ETL PL/SQL Integration Microsoft SQL Server SQL Leadership Business Intelligence SDLC Cross-functional Team... MES Software Project... Product Management Unix Access See 4+     See less Skills  Troubleshooting Databases Manufacturing Quality Assurance Semiconductors ETL PL/SQL Integration Microsoft SQL Server SQL Leadership Business Intelligence SDLC Cross-functional Team... MES Software Project... Product Management Unix Access See 4+     See less Troubleshooting Databases Manufacturing Quality Assurance Semiconductors ETL PL/SQL Integration Microsoft SQL Server SQL Leadership Business Intelligence SDLC Cross-functional Team... MES Software Project... Product Management Unix Access See 4+     See less Troubleshooting Databases Manufacturing Quality Assurance Semiconductors ETL PL/SQL Integration Microsoft SQL Server SQL Leadership Business Intelligence SDLC Cross-functional Team... MES Software Project... Product Management Unix Access See 4+     See less Education National University BS,  Computer Science 1996  – 1998 National University BS,  Computer Science 1996  – 1998 National University BS,  Computer Science 1996  – 1998 National University BS,  Computer Science 1996  – 1998 ", "Experience Sr. Business Intelligence Engineer Mindspark Interactive Network, Inc. December 2012  – Present (2 years 9 months) Sr. Business Intelligence Engineer Yellowpages (formerly AT&T Interactive) May 2008  –  November 2012  (4 years 7 months) Technology & Operations Reporting Analyst Google February 2007  –  April 2008  (1 year 3 months) Intern H&R Block 2005  –  2005  (less than a year) Sr. Business Intelligence Engineer Mindspark Interactive Network, Inc. December 2012  – Present (2 years 9 months) Sr. Business Intelligence Engineer Mindspark Interactive Network, Inc. December 2012  – Present (2 years 9 months) Sr. Business Intelligence Engineer Yellowpages (formerly AT&T Interactive) May 2008  –  November 2012  (4 years 7 months) Sr. Business Intelligence Engineer Yellowpages (formerly AT&T Interactive) May 2008  –  November 2012  (4 years 7 months) Technology & Operations Reporting Analyst Google February 2007  –  April 2008  (1 year 3 months) Technology & Operations Reporting Analyst Google February 2007  –  April 2008  (1 year 3 months) Intern H&R Block 2005  –  2005  (less than a year) Intern H&R Block 2005  –  2005  (less than a year) Skills Business Objects Data... SSIS Informatica ETL Vertica Microsoft SQL Server Oracle MySQL SQL Business Objects Agile Methodologies Java JavaScript XML Data Warehousing Unix Scrum C# Business Intelligence Unix Shell Scripting Hadoop HBase Microstrategy SSRS SSAS 2008 PL/SQL Database Design Data Modeling See 13+     See less Skills  Business Objects Data... SSIS Informatica ETL Vertica Microsoft SQL Server Oracle MySQL SQL Business Objects Agile Methodologies Java JavaScript XML Data Warehousing Unix Scrum C# Business Intelligence Unix Shell Scripting Hadoop HBase Microstrategy SSRS SSAS 2008 PL/SQL Database Design Data Modeling See 13+     See less Business Objects Data... SSIS Informatica ETL Vertica Microsoft SQL Server Oracle MySQL SQL Business Objects Agile Methodologies Java JavaScript XML Data Warehousing Unix Scrum C# Business Intelligence Unix Shell Scripting Hadoop HBase Microstrategy SSRS SSAS 2008 PL/SQL Database Design Data Modeling See 13+     See less Business Objects Data... SSIS Informatica ETL Vertica Microsoft SQL Server Oracle MySQL SQL Business Objects Agile Methodologies Java JavaScript XML Data Warehousing Unix Scrum C# Business Intelligence Unix Shell Scripting Hadoop HBase Microstrategy SSRS SSAS 2008 PL/SQL Database Design Data Modeling See 13+     See less Education Kansas State University M.S.,  Computing and Information Sciences 2004  – 2006 Goa University B.E.,  Computer Engineering 1998  – 2002 Kansas State University M.S.,  Computing and Information Sciences 2004  – 2006 Kansas State University M.S.,  Computing and Information Sciences 2004  – 2006 Kansas State University M.S.,  Computing and Information Sciences 2004  – 2006 Goa University B.E.,  Computer Engineering 1998  – 2002 Goa University B.E.,  Computer Engineering 1998  – 2002 Goa University B.E.,  Computer Engineering 1998  – 2002 ", "Skills Data Warehousing Business Intelligence Data Analysis Business Objects Data Quality Dashboard Data Modeling ETL Business Intelligence... Master Data Management SAP BI MicroSrategy Tableau BI tools training Skills  Data Warehousing Business Intelligence Data Analysis Business Objects Data Quality Dashboard Data Modeling ETL Business Intelligence... Master Data Management SAP BI MicroSrategy Tableau BI tools training Data Warehousing Business Intelligence Data Analysis Business Objects Data Quality Dashboard Data Modeling ETL Business Intelligence... Master Data Management SAP BI MicroSrategy Tableau BI tools training Data Warehousing Business Intelligence Data Analysis Business Objects Data Quality Dashboard Data Modeling ETL Business Intelligence... Master Data Management SAP BI MicroSrategy Tableau BI tools training ", "Summary •\tOver 10 years of experience developing Analytical,Data warehousing/ Business Intelligence solutions for business areas like Retail, Finance and Manufacturing \n•\tExtensive Working Experience with Microstrategy Report suite, Tableau, Business Objects and Teradata \n•\tStrong understanding of Data warehousing, Data modeling and OLAP concepts \n•\tProven success and track record with commitment to schedule, quality, and cost-effectiveness \n•\tWorked on all types of environments ranging from Waterfall, SDLC and Scrum/Agile Methodologies \n•\tDemonstrated ability to work in both independent and team environments \n•\tStrong Leadership, Excellent Communication and People skills along with solid analytical and design skills Specialties:Analytics, Data Mining, Data warehousing, Business Intelligence, MicroStrategy Report Suite Summary •\tOver 10 years of experience developing Analytical,Data warehousing/ Business Intelligence solutions for business areas like Retail, Finance and Manufacturing \n•\tExtensive Working Experience with Microstrategy Report suite, Tableau, Business Objects and Teradata \n•\tStrong understanding of Data warehousing, Data modeling and OLAP concepts \n•\tProven success and track record with commitment to schedule, quality, and cost-effectiveness \n•\tWorked on all types of environments ranging from Waterfall, SDLC and Scrum/Agile Methodologies \n•\tDemonstrated ability to work in both independent and team environments \n•\tStrong Leadership, Excellent Communication and People skills along with solid analytical and design skills Specialties:Analytics, Data Mining, Data warehousing, Business Intelligence, MicroStrategy Report Suite •\tOver 10 years of experience developing Analytical,Data warehousing/ Business Intelligence solutions for business areas like Retail, Finance and Manufacturing \n•\tExtensive Working Experience with Microstrategy Report suite, Tableau, Business Objects and Teradata \n•\tStrong understanding of Data warehousing, Data modeling and OLAP concepts \n•\tProven success and track record with commitment to schedule, quality, and cost-effectiveness \n•\tWorked on all types of environments ranging from Waterfall, SDLC and Scrum/Agile Methodologies \n•\tDemonstrated ability to work in both independent and team environments \n•\tStrong Leadership, Excellent Communication and People skills along with solid analytical and design skills Specialties:Analytics, Data Mining, Data warehousing, Business Intelligence, MicroStrategy Report Suite •\tOver 10 years of experience developing Analytical,Data warehousing/ Business Intelligence solutions for business areas like Retail, Finance and Manufacturing \n•\tExtensive Working Experience with Microstrategy Report suite, Tableau, Business Objects and Teradata \n•\tStrong understanding of Data warehousing, Data modeling and OLAP concepts \n•\tProven success and track record with commitment to schedule, quality, and cost-effectiveness \n•\tWorked on all types of environments ranging from Waterfall, SDLC and Scrum/Agile Methodologies \n•\tDemonstrated ability to work in both independent and team environments \n•\tStrong Leadership, Excellent Communication and People skills along with solid analytical and design skills Specialties:Analytics, Data Mining, Data warehousing, Business Intelligence, MicroStrategy Report Suite Experience Staff Business Intelligence Engineer eBay April 2007  – Present (8 years 5 months) San Jose •\tArchitect, design, and develop Analytics solutions for various eBay groups like Finance, Site Operations, Marketing, Fraud Investigation and Inventory management for their reporting needs \n•\tDesign, develop, and deliver complex reports, function-rich FLEX and DHTML dashboards using MicroStrategy and Tableau \n•\tWork with Product Managers, ETL, and Data Architect teams in understanding the requirements and in designing database layer needed for the BI reporting \n•\tTest, troubleshoot, and performance tune the reports by closely working with Database Administrators and Teradata performance engineers \n•\tStrong SQL skills and extensive experience on RDBMS (Teradata) technologies \n•\tEffectively worked in Scrum/Agile mode and performed Scrum Master tasks for sprints assigned \n•\tExtend MicroStrategy platform using SDK/SOA and TaskProc functionalities to deliver function rich FLEX Dashboards \n•\tPerform various MicroStrategy administrative tasks and architect MicroStrategy Narrowcast services of email and file delivery of user reports \n•\tDemo the reporting solutions to the business community and help and train them all the way for complete adoption of the solutions \n•\tDevelop companywide BI technical/development standards and training documents and mentor new hires and consultants \n•\tLead on-shore and off-shore consulting team in the development efforts in delivery of the BI solutions \n•\tAnalytics lead on more than 10 eBay BI projects Senior BI Consultant/Architect eBay July 2005  –  April 2007  (1 year 10 months) •\tLead Architect on Internet Marketing Project internally known as Triton Analytics \n•\tInvolved in business processes understanding, developing and finalizing the Datawarehouse requirements \n•\tDesigned the Developed the primary MicroStrategy Architecture based on the Data Model \n•\tDesigned and developed more than 30 MicroStrategy Reports and Dashboards for the Business users \n•\tWork with SQL Assistant, and Queryman to test the back end data on Teradata database \n•\tClosely work with the Data Modeler, ETL developers, and DBA’s for troubleshooting and overall improvement of the application BI Consultant/Architect Meijer February 2005  –  July 2005  (6 months) •\tMicroStrategy Consultant for Store Promotion and Coupons Project \n•\tDesigned and developed physical data model using snow flake methodologies with Erwin \n•\tAnalyzed and redesigned the existing Data model and have improved overall performance by 50% \n•\tAnalyzed and redesigned existing Microstrategy reports to improve their performance \n•\tInvolved in developing basic and user-specified Metrics (level, conditional, compound, non-aggregatable) with complete usage of MicroStrategy OLAP services \n•\tExtensively used MicroStrategy Desktop and Web to enable users to run Pre-Event and Post-Event sales reports, build their own customized reports and download information into Excel spreadsheets BI Consultant/Architect Freddie Mac June 2004  –  January 2005  (8 months) •\tInvolved in gathering customer input, business processes understanding, developing and finalizing the Data warehouse requirements. \n•\tIdentified Freddie Mac wide conformed dimensions and facts and incorporated in all the projects \n•\tDeveloped MicroStrategy objects like Attributes, Metrics, Filters as per specifications \n•\tDeveloped Reports and HTML Documents for daily, weekly, monthly, and yearly levels \n•\tMaintained and updated MicroStrategy Design document, testing document, and project-specific user documents \n•\tProvided technical and warranty support for the Data marts created, worked with users for any further enhancements and assist other technical areas as required \n•\tProvided technical support, training and involved with user groups. Engineer/Assistant Manager Reliance February 1998  –  July 2001  (3 years 6 months) •\tInvolved in development the PMMS systems, which helps to get Project materials from Project Stores, vendors and deliver across the company \n•\tDeveloped a proto-type system for expediting project material flow using Foxboro and MS-Access \n•\tInvolved in database programming with SQL and PL/SQL \n•\tInvolved in developing test cases, manual testing of the software codes \n•\tGenerated reports using Crystal Reports for weekly meetings Staff Business Intelligence Engineer eBay April 2007  – Present (8 years 5 months) San Jose •\tArchitect, design, and develop Analytics solutions for various eBay groups like Finance, Site Operations, Marketing, Fraud Investigation and Inventory management for their reporting needs \n•\tDesign, develop, and deliver complex reports, function-rich FLEX and DHTML dashboards using MicroStrategy and Tableau \n•\tWork with Product Managers, ETL, and Data Architect teams in understanding the requirements and in designing database layer needed for the BI reporting \n•\tTest, troubleshoot, and performance tune the reports by closely working with Database Administrators and Teradata performance engineers \n•\tStrong SQL skills and extensive experience on RDBMS (Teradata) technologies \n•\tEffectively worked in Scrum/Agile mode and performed Scrum Master tasks for sprints assigned \n•\tExtend MicroStrategy platform using SDK/SOA and TaskProc functionalities to deliver function rich FLEX Dashboards \n•\tPerform various MicroStrategy administrative tasks and architect MicroStrategy Narrowcast services of email and file delivery of user reports \n•\tDemo the reporting solutions to the business community and help and train them all the way for complete adoption of the solutions \n•\tDevelop companywide BI technical/development standards and training documents and mentor new hires and consultants \n•\tLead on-shore and off-shore consulting team in the development efforts in delivery of the BI solutions \n•\tAnalytics lead on more than 10 eBay BI projects Staff Business Intelligence Engineer eBay April 2007  – Present (8 years 5 months) San Jose •\tArchitect, design, and develop Analytics solutions for various eBay groups like Finance, Site Operations, Marketing, Fraud Investigation and Inventory management for their reporting needs \n•\tDesign, develop, and deliver complex reports, function-rich FLEX and DHTML dashboards using MicroStrategy and Tableau \n•\tWork with Product Managers, ETL, and Data Architect teams in understanding the requirements and in designing database layer needed for the BI reporting \n•\tTest, troubleshoot, and performance tune the reports by closely working with Database Administrators and Teradata performance engineers \n•\tStrong SQL skills and extensive experience on RDBMS (Teradata) technologies \n•\tEffectively worked in Scrum/Agile mode and performed Scrum Master tasks for sprints assigned \n•\tExtend MicroStrategy platform using SDK/SOA and TaskProc functionalities to deliver function rich FLEX Dashboards \n•\tPerform various MicroStrategy administrative tasks and architect MicroStrategy Narrowcast services of email and file delivery of user reports \n•\tDemo the reporting solutions to the business community and help and train them all the way for complete adoption of the solutions \n•\tDevelop companywide BI technical/development standards and training documents and mentor new hires and consultants \n•\tLead on-shore and off-shore consulting team in the development efforts in delivery of the BI solutions \n•\tAnalytics lead on more than 10 eBay BI projects Senior BI Consultant/Architect eBay July 2005  –  April 2007  (1 year 10 months) •\tLead Architect on Internet Marketing Project internally known as Triton Analytics \n•\tInvolved in business processes understanding, developing and finalizing the Datawarehouse requirements \n•\tDesigned the Developed the primary MicroStrategy Architecture based on the Data Model \n•\tDesigned and developed more than 30 MicroStrategy Reports and Dashboards for the Business users \n•\tWork with SQL Assistant, and Queryman to test the back end data on Teradata database \n•\tClosely work with the Data Modeler, ETL developers, and DBA’s for troubleshooting and overall improvement of the application Senior BI Consultant/Architect eBay July 2005  –  April 2007  (1 year 10 months) •\tLead Architect on Internet Marketing Project internally known as Triton Analytics \n•\tInvolved in business processes understanding, developing and finalizing the Datawarehouse requirements \n•\tDesigned the Developed the primary MicroStrategy Architecture based on the Data Model \n•\tDesigned and developed more than 30 MicroStrategy Reports and Dashboards for the Business users \n•\tWork with SQL Assistant, and Queryman to test the back end data on Teradata database \n•\tClosely work with the Data Modeler, ETL developers, and DBA’s for troubleshooting and overall improvement of the application BI Consultant/Architect Meijer February 2005  –  July 2005  (6 months) •\tMicroStrategy Consultant for Store Promotion and Coupons Project \n•\tDesigned and developed physical data model using snow flake methodologies with Erwin \n•\tAnalyzed and redesigned the existing Data model and have improved overall performance by 50% \n•\tAnalyzed and redesigned existing Microstrategy reports to improve their performance \n•\tInvolved in developing basic and user-specified Metrics (level, conditional, compound, non-aggregatable) with complete usage of MicroStrategy OLAP services \n•\tExtensively used MicroStrategy Desktop and Web to enable users to run Pre-Event and Post-Event sales reports, build their own customized reports and download information into Excel spreadsheets BI Consultant/Architect Meijer February 2005  –  July 2005  (6 months) •\tMicroStrategy Consultant for Store Promotion and Coupons Project \n•\tDesigned and developed physical data model using snow flake methodologies with Erwin \n•\tAnalyzed and redesigned the existing Data model and have improved overall performance by 50% \n•\tAnalyzed and redesigned existing Microstrategy reports to improve their performance \n•\tInvolved in developing basic and user-specified Metrics (level, conditional, compound, non-aggregatable) with complete usage of MicroStrategy OLAP services \n•\tExtensively used MicroStrategy Desktop and Web to enable users to run Pre-Event and Post-Event sales reports, build their own customized reports and download information into Excel spreadsheets BI Consultant/Architect Freddie Mac June 2004  –  January 2005  (8 months) •\tInvolved in gathering customer input, business processes understanding, developing and finalizing the Data warehouse requirements. \n•\tIdentified Freddie Mac wide conformed dimensions and facts and incorporated in all the projects \n•\tDeveloped MicroStrategy objects like Attributes, Metrics, Filters as per specifications \n•\tDeveloped Reports and HTML Documents for daily, weekly, monthly, and yearly levels \n•\tMaintained and updated MicroStrategy Design document, testing document, and project-specific user documents \n•\tProvided technical and warranty support for the Data marts created, worked with users for any further enhancements and assist other technical areas as required \n•\tProvided technical support, training and involved with user groups. BI Consultant/Architect Freddie Mac June 2004  –  January 2005  (8 months) •\tInvolved in gathering customer input, business processes understanding, developing and finalizing the Data warehouse requirements. \n•\tIdentified Freddie Mac wide conformed dimensions and facts and incorporated in all the projects \n•\tDeveloped MicroStrategy objects like Attributes, Metrics, Filters as per specifications \n•\tDeveloped Reports and HTML Documents for daily, weekly, monthly, and yearly levels \n•\tMaintained and updated MicroStrategy Design document, testing document, and project-specific user documents \n•\tProvided technical and warranty support for the Data marts created, worked with users for any further enhancements and assist other technical areas as required \n•\tProvided technical support, training and involved with user groups. Engineer/Assistant Manager Reliance February 1998  –  July 2001  (3 years 6 months) •\tInvolved in development the PMMS systems, which helps to get Project materials from Project Stores, vendors and deliver across the company \n•\tDeveloped a proto-type system for expediting project material flow using Foxboro and MS-Access \n•\tInvolved in database programming with SQL and PL/SQL \n•\tInvolved in developing test cases, manual testing of the software codes \n•\tGenerated reports using Crystal Reports for weekly meetings Engineer/Assistant Manager Reliance February 1998  –  July 2001  (3 years 6 months) •\tInvolved in development the PMMS systems, which helps to get Project materials from Project Stores, vendors and deliver across the company \n•\tDeveloped a proto-type system for expediting project material flow using Foxboro and MS-Access \n•\tInvolved in database programming with SQL and PL/SQL \n•\tInvolved in developing test cases, manual testing of the software codes \n•\tGenerated reports using Crystal Reports for weekly meetings Skills Data Warehousing Business Intelligence Teradata Microstrategy Data Modeling Analytics SQL SDLC Databases Business Objects OLAP Software Project... Agile Methodologies Requirements Analysis Data Mining Scrum ETL MicroStrategy See 3+     See less Skills  Data Warehousing Business Intelligence Teradata Microstrategy Data Modeling Analytics SQL SDLC Databases Business Objects OLAP Software Project... Agile Methodologies Requirements Analysis Data Mining Scrum ETL MicroStrategy See 3+     See less Data Warehousing Business Intelligence Teradata Microstrategy Data Modeling Analytics SQL SDLC Databases Business Objects OLAP Software Project... Agile Methodologies Requirements Analysis Data Mining Scrum ETL MicroStrategy See 3+     See less Data Warehousing Business Intelligence Teradata Microstrategy Data Modeling Analytics SQL SDLC Databases Business Objects OLAP Software Project... Agile Methodologies Requirements Analysis Data Mining Scrum ETL MicroStrategy See 3+     See less Education Oklahoma State University M.S. 2003 Vellore Institute of Technology B.E Oklahoma State University M.S. 2003 Oklahoma State University M.S. 2003 Oklahoma State University M.S. 2003 Vellore Institute of Technology B.E Vellore Institute of Technology B.E Vellore Institute of Technology B.E Honors & Awards Additional Honors & Awards Technical Speaker at MicroStrategy World 2011, Las Vegas on \" Integrating MicroStrategy with Adobe Flex to Deliver Functionally Rich Applications\" topic. Additional Honors & Awards Technical Speaker at MicroStrategy World 2011, Las Vegas on \" Integrating MicroStrategy with Adobe Flex to Deliver Functionally Rich Applications\" topic. Additional Honors & Awards Technical Speaker at MicroStrategy World 2011, Las Vegas on \" Integrating MicroStrategy with Adobe Flex to Deliver Functionally Rich Applications\" topic. Additional Honors & Awards Technical Speaker at MicroStrategy World 2011, Las Vegas on \" Integrating MicroStrategy with Adobe Flex to Deliver Functionally Rich Applications\" topic. ", "Experience Sr. Business Intelligence Engineer PROS December 2013  – Present (1 year 9 months) San Francisco Bay Area Sr. Business Intelligence Engineer PROS December 2013  – Present (1 year 9 months) San Francisco Bay Area Sr. Business Intelligence Engineer PROS December 2013  – Present (1 year 9 months) San Francisco Bay Area Languages English Telugu Hindi English Telugu Hindi English Telugu Hindi Skills Data Warehousing OBIEE Data Modeling ETL Business Intelligence PL/SQL Oracle SQL Informatica Cognos Microsoft SQL Server Requirements Analysis Databases Perl SDLC Visio Statistical Modeling SAS Linear Programming Operations Research Crystal Reports AutoCAD Pro Engineer See 8+     See less Skills  Data Warehousing OBIEE Data Modeling ETL Business Intelligence PL/SQL Oracle SQL Informatica Cognos Microsoft SQL Server Requirements Analysis Databases Perl SDLC Visio Statistical Modeling SAS Linear Programming Operations Research Crystal Reports AutoCAD Pro Engineer See 8+     See less Data Warehousing OBIEE Data Modeling ETL Business Intelligence PL/SQL Oracle SQL Informatica Cognos Microsoft SQL Server Requirements Analysis Databases Perl SDLC Visio Statistical Modeling SAS Linear Programming Operations Research Crystal Reports AutoCAD Pro Engineer See 8+     See less Data Warehousing OBIEE Data Modeling ETL Business Intelligence PL/SQL Oracle SQL Informatica Cognos Microsoft SQL Server Requirements Analysis Databases Perl SDLC Visio Statistical Modeling SAS Linear Programming Operations Research Crystal Reports AutoCAD Pro Engineer See 8+     See less Education Texas Tech University Master's 2006  – 2008 Kakatiya University Bachelor of Technology 2002  – 2006 Texas Tech University Master's 2006  – 2008 Texas Tech University Master's 2006  – 2008 Texas Tech University Master's 2006  – 2008 Kakatiya University Bachelor of Technology 2002  – 2006 Kakatiya University Bachelor of Technology 2002  – 2006 Kakatiya University Bachelor of Technology 2002  – 2006 ", "Summary * 10+ Years in the Information Systems area. \n* 10+ Years diverse applications experience on internal web, client/server and midrange based applications. Experience includes \n- new feature planning and implementation \n- system configuration \n- change control activities and life cycle management \n- computer system validation \n- code QA testing and debugging \n- system and supporting business process documentation and training \n- enterprise level data standardization activities \n- end user support \n- report and query development \n* 9 Years relational database experience (Oracle, SQL Server & Sybase). \n* 4 Years delivering computer system and process solutions in an FDA regulated environment. \n \nSpecialties: Business Application software, Manufacturing Execution Systems, Relational Databases Summary * 10+ Years in the Information Systems area. \n* 10+ Years diverse applications experience on internal web, client/server and midrange based applications. Experience includes \n- new feature planning and implementation \n- system configuration \n- change control activities and life cycle management \n- computer system validation \n- code QA testing and debugging \n- system and supporting business process documentation and training \n- enterprise level data standardization activities \n- end user support \n- report and query development \n* 9 Years relational database experience (Oracle, SQL Server & Sybase). \n* 4 Years delivering computer system and process solutions in an FDA regulated environment. \n \nSpecialties: Business Application software, Manufacturing Execution Systems, Relational Databases * 10+ Years in the Information Systems area. \n* 10+ Years diverse applications experience on internal web, client/server and midrange based applications. Experience includes \n- new feature planning and implementation \n- system configuration \n- change control activities and life cycle management \n- computer system validation \n- code QA testing and debugging \n- system and supporting business process documentation and training \n- enterprise level data standardization activities \n- end user support \n- report and query development \n* 9 Years relational database experience (Oracle, SQL Server & Sybase). \n* 4 Years delivering computer system and process solutions in an FDA regulated environment. \n \nSpecialties: Business Application software, Manufacturing Execution Systems, Relational Databases * 10+ Years in the Information Systems area. \n* 10+ Years diverse applications experience on internal web, client/server and midrange based applications. Experience includes \n- new feature planning and implementation \n- system configuration \n- change control activities and life cycle management \n- computer system validation \n- code QA testing and debugging \n- system and supporting business process documentation and training \n- enterprise level data standardization activities \n- end user support \n- report and query development \n* 9 Years relational database experience (Oracle, SQL Server & Sybase). \n* 4 Years delivering computer system and process solutions in an FDA regulated environment. \n \nSpecialties: Business Application software, Manufacturing Execution Systems, Relational Databases Experience Business Intelligence Engineer Sakata Seed America, Inc. September 2013  – Present (2 years) Morgan Hill, CA Business Systems Analyst 3 JDSU September 2011  –  August 2013  (2 years) Milpitas, CA Project/Systems Engineer Hospira, Inc. August 2005  –  July 2011  (6 years) *\tSubject matter expert for the electronic Device History Record (eDHR) / Manufacturing Execution System (MES) Visiprise (purchased and renamed SAP ME as of 2009). \n*\tDesign and execute test protocols for all incoming software upgrades.  \n*\tDelivered all system analyses and documentation in the creation of a risk based validation approach for the eDHR system. \n*\tDatabase content and layout expert for the Business Objects Universe design for the eDHR system.  \n*\tMaintain and expand all system and business process documentation to ensure compliance and procedural clarity as system usage develops. IS Manager Komag, Inc. 1995  –  2000  (5 years) *\tProvided daily support for the AS400 based Manufacturing Execution System MESA by Camstar, Inc. \n*\tAdvised, taught and wrote training documents for end users \n*\tDeveloped and delivered data management routines to maintain system performance and ensure availability of key data elements \n*\tManaged a team of developers working on a wide range of projects including Data Warehousing applications, transactional Manufacturing and Business Applications, as well as various PC-based auxiliary systems \n \n*\tWorked with local and international manufacturing sites to develop, document and enforce system and data standards Sr. Programmer/Analyst Software Publishing 1991  –  1995  (4 years) * Programmer on the AS400 based Pansophic Business Application system.  \n* Provided solutions to reported software bugs and created new functionality in Financial, Order Billing and Purchasing modules. \n* Maintained Customer Support and Registration Information relational database. Worked with external vendor to define data transmission protocols, cleansing procedures and expansion opportunities.  \n* Automated nightly and month end procedures to reduce need for after hours support. \n* Provided end user instruction and operational support for the AS400 system. Business Intelligence Engineer Sakata Seed America, Inc. September 2013  – Present (2 years) Morgan Hill, CA Business Intelligence Engineer Sakata Seed America, Inc. September 2013  – Present (2 years) Morgan Hill, CA Business Systems Analyst 3 JDSU September 2011  –  August 2013  (2 years) Milpitas, CA Business Systems Analyst 3 JDSU September 2011  –  August 2013  (2 years) Milpitas, CA Project/Systems Engineer Hospira, Inc. August 2005  –  July 2011  (6 years) *\tSubject matter expert for the electronic Device History Record (eDHR) / Manufacturing Execution System (MES) Visiprise (purchased and renamed SAP ME as of 2009). \n*\tDesign and execute test protocols for all incoming software upgrades.  \n*\tDelivered all system analyses and documentation in the creation of a risk based validation approach for the eDHR system. \n*\tDatabase content and layout expert for the Business Objects Universe design for the eDHR system.  \n*\tMaintain and expand all system and business process documentation to ensure compliance and procedural clarity as system usage develops. Project/Systems Engineer Hospira, Inc. August 2005  –  July 2011  (6 years) *\tSubject matter expert for the electronic Device History Record (eDHR) / Manufacturing Execution System (MES) Visiprise (purchased and renamed SAP ME as of 2009). \n*\tDesign and execute test protocols for all incoming software upgrades.  \n*\tDelivered all system analyses and documentation in the creation of a risk based validation approach for the eDHR system. \n*\tDatabase content and layout expert for the Business Objects Universe design for the eDHR system.  \n*\tMaintain and expand all system and business process documentation to ensure compliance and procedural clarity as system usage develops. IS Manager Komag, Inc. 1995  –  2000  (5 years) *\tProvided daily support for the AS400 based Manufacturing Execution System MESA by Camstar, Inc. \n*\tAdvised, taught and wrote training documents for end users \n*\tDeveloped and delivered data management routines to maintain system performance and ensure availability of key data elements \n*\tManaged a team of developers working on a wide range of projects including Data Warehousing applications, transactional Manufacturing and Business Applications, as well as various PC-based auxiliary systems \n \n*\tWorked with local and international manufacturing sites to develop, document and enforce system and data standards IS Manager Komag, Inc. 1995  –  2000  (5 years) *\tProvided daily support for the AS400 based Manufacturing Execution System MESA by Camstar, Inc. \n*\tAdvised, taught and wrote training documents for end users \n*\tDeveloped and delivered data management routines to maintain system performance and ensure availability of key data elements \n*\tManaged a team of developers working on a wide range of projects including Data Warehousing applications, transactional Manufacturing and Business Applications, as well as various PC-based auxiliary systems \n \n*\tWorked with local and international manufacturing sites to develop, document and enforce system and data standards Sr. Programmer/Analyst Software Publishing 1991  –  1995  (4 years) * Programmer on the AS400 based Pansophic Business Application system.  \n* Provided solutions to reported software bugs and created new functionality in Financial, Order Billing and Purchasing modules. \n* Maintained Customer Support and Registration Information relational database. Worked with external vendor to define data transmission protocols, cleansing procedures and expansion opportunities.  \n* Automated nightly and month end procedures to reduce need for after hours support. \n* Provided end user instruction and operational support for the AS400 system. Sr. Programmer/Analyst Software Publishing 1991  –  1995  (4 years) * Programmer on the AS400 based Pansophic Business Application system.  \n* Provided solutions to reported software bugs and created new functionality in Financial, Order Billing and Purchasing modules. \n* Maintained Customer Support and Registration Information relational database. Worked with external vendor to define data transmission protocols, cleansing procedures and expansion opportunities.  \n* Automated nightly and month end procedures to reduce need for after hours support. \n* Provided end user instruction and operational support for the AS400 system. Skills Relational Databases MES Documentation Validation Testing Software Documentation FDA Quality Assurance Databases Business Applications Business Process Oracle Manufacturing Integration SQL Enterprise Architecture SDLC Cross-functional Team... Vendor Management Analysis Data Warehousing Project Planning SAP Automation Enterprise Software Process Engineering Business Intelligence Requirements Analysis See 13+     See less Skills  Relational Databases MES Documentation Validation Testing Software Documentation FDA Quality Assurance Databases Business Applications Business Process Oracle Manufacturing Integration SQL Enterprise Architecture SDLC Cross-functional Team... Vendor Management Analysis Data Warehousing Project Planning SAP Automation Enterprise Software Process Engineering Business Intelligence Requirements Analysis See 13+     See less Relational Databases MES Documentation Validation Testing Software Documentation FDA Quality Assurance Databases Business Applications Business Process Oracle Manufacturing Integration SQL Enterprise Architecture SDLC Cross-functional Team... Vendor Management Analysis Data Warehousing Project Planning SAP Automation Enterprise Software Process Engineering Business Intelligence Requirements Analysis See 13+     See less Relational Databases MES Documentation Validation Testing Software Documentation FDA Quality Assurance Databases Business Applications Business Process Oracle Manufacturing Integration SQL Enterprise Architecture SDLC Cross-functional Team... Vendor Management Analysis Data Warehousing Project Planning SAP Automation Enterprise Software Process Engineering Business Intelligence Requirements Analysis See 13+     See less Education University of California, Santa Cruz Extension Professional Achievement Award,  Biotechnology Management 2002  – 2002 University of California, Berkeley BS,  Mechanical Engineering 1984  – 1988 University of California, Santa Cruz Extension Professional Achievement Award,  Biotechnology Management 2002  – 2002 University of California, Santa Cruz Extension Professional Achievement Award,  Biotechnology Management 2002  – 2002 University of California, Santa Cruz Extension Professional Achievement Award,  Biotechnology Management 2002  – 2002 University of California, Berkeley BS,  Mechanical Engineering 1984  – 1988 University of California, Berkeley BS,  Mechanical Engineering 1984  – 1988 University of California, Berkeley BS,  Mechanical Engineering 1984  – 1988 ", "Summary Current full-time Business Intelligence Engineer at Amazon \n1+ years working experience in Tableau and SQL programming \n2+ years user experience in SAS, SPSS, R, Tableau, GIS, and SQL \n3+ years academic experience in data analytics, spatial analysis, and statistics \n1+ years academic experience in data visualization, database design and database management \n \n \nOwner of two sites: http://www.evafeng.com and my blog http://evafengeva.blogspot.com Summary Current full-time Business Intelligence Engineer at Amazon \n1+ years working experience in Tableau and SQL programming \n2+ years user experience in SAS, SPSS, R, Tableau, GIS, and SQL \n3+ years academic experience in data analytics, spatial analysis, and statistics \n1+ years academic experience in data visualization, database design and database management \n \n \nOwner of two sites: http://www.evafeng.com and my blog http://evafengeva.blogspot.com Current full-time Business Intelligence Engineer at Amazon \n1+ years working experience in Tableau and SQL programming \n2+ years user experience in SAS, SPSS, R, Tableau, GIS, and SQL \n3+ years academic experience in data analytics, spatial analysis, and statistics \n1+ years academic experience in data visualization, database design and database management \n \n \nOwner of two sites: http://www.evafeng.com and my blog http://evafengeva.blogspot.com Current full-time Business Intelligence Engineer at Amazon \n1+ years working experience in Tableau and SQL programming \n2+ years user experience in SAS, SPSS, R, Tableau, GIS, and SQL \n3+ years academic experience in data analytics, spatial analysis, and statistics \n1+ years academic experience in data visualization, database design and database management \n \n \nOwner of two sites: http://www.evafeng.com and my blog http://evafengeva.blogspot.com Experience Business Intelligence Engineer Amazon November 2014  – Present (10 months) Greater Seattle Area Instant Digital Video Team, Data Visualization \n- Developed SQL query to extract, load, and transform data from the Amazon Data Warehouse to empower data-driven modeling \n- Designed and constructed the dashboards on Tableau in order to provide supports for the finance team and marketing team \n- Data Engineering Geography Research Intern National Geographic May 2013  –  August 2013  (4 months) Washington D.C. Metro Area - Worked as a producer a GeoStoryMedia Spotlight for Participatory Mapping in the Caribbean. The interactive map has published on the official National Geographic website. (The link of the GeoStories is below the description) \n- Managed the metadata of the 180 digital maps and prepare them ready for publishing online \n- Cooperated with another intern in researching photos for the data points in 4 states of the Underground Rail Road project and creating the first-handed metadata and database of the photos for the Underground Rail Road project \n- Performed manual quality assurance checks for the descriptions and functions on the 5th version of Fieldscope of Chesapeake Bay Business Intelligence Engineer Amazon November 2014  – Present (10 months) Greater Seattle Area Instant Digital Video Team, Data Visualization \n- Developed SQL query to extract, load, and transform data from the Amazon Data Warehouse to empower data-driven modeling \n- Designed and constructed the dashboards on Tableau in order to provide supports for the finance team and marketing team \n- Data Engineering Business Intelligence Engineer Amazon November 2014  – Present (10 months) Greater Seattle Area Instant Digital Video Team, Data Visualization \n- Developed SQL query to extract, load, and transform data from the Amazon Data Warehouse to empower data-driven modeling \n- Designed and constructed the dashboards on Tableau in order to provide supports for the finance team and marketing team \n- Data Engineering Geography Research Intern National Geographic May 2013  –  August 2013  (4 months) Washington D.C. Metro Area - Worked as a producer a GeoStoryMedia Spotlight for Participatory Mapping in the Caribbean. The interactive map has published on the official National Geographic website. (The link of the GeoStories is below the description) \n- Managed the metadata of the 180 digital maps and prepare them ready for publishing online \n- Cooperated with another intern in researching photos for the data points in 4 states of the Underground Rail Road project and creating the first-handed metadata and database of the photos for the Underground Rail Road project \n- Performed manual quality assurance checks for the descriptions and functions on the 5th version of Fieldscope of Chesapeake Bay Geography Research Intern National Geographic May 2013  –  August 2013  (4 months) Washington D.C. Metro Area - Worked as a producer a GeoStoryMedia Spotlight for Participatory Mapping in the Caribbean. The interactive map has published on the official National Geographic website. (The link of the GeoStories is below the description) \n- Managed the metadata of the 180 digital maps and prepare them ready for publishing online \n- Cooperated with another intern in researching photos for the data points in 4 states of the Underground Rail Road project and creating the first-handed metadata and database of the photos for the Underground Rail Road project \n- Performed manual quality assurance checks for the descriptions and functions on the 5th version of Fieldscope of Chesapeake Bay Languages   Skills Skills     Education University of Cincinnati Master of Science (M.S.) 2013  – 2014 University of Cincinnati Bachelor of Arts (B.A.) 2011  – 2013 Sun Yat-Sen University Bachelor of Science (B.S.) 2009  – 2013 University of Cincinnati Master of Science (M.S.) 2013  – 2014 University of Cincinnati Master of Science (M.S.) 2013  – 2014 University of Cincinnati Master of Science (M.S.) 2013  – 2014 University of Cincinnati Bachelor of Arts (B.A.) 2011  – 2013 University of Cincinnati Bachelor of Arts (B.A.) 2011  – 2013 University of Cincinnati Bachelor of Arts (B.A.) 2011  – 2013 Sun Yat-Sen University Bachelor of Science (B.S.) 2009  – 2013 Sun Yat-Sen University Bachelor of Science (B.S.) 2009  – 2013 Sun Yat-Sen University Bachelor of Science (B.S.) 2009  – 2013 Honors & Awards ", "Summary •\tOver nine years of strong working experience in building business intelligence and data warehousing solutions. \n•\tExpertise in analyzing complex business data to provide strong business solutions. \n•\tHands on experience in designing and developing Business Intelligence dashboards/visualizations/adhoc reports/alerts using Tableau7.0/8.0, OBIEE 10g/11g, SQL and Brio.  \n•\tWorked on all phases of data warehouse development life cycle from gathering requirements to design, development, testing, implementation, and support. \n•\tStrong team lead capabilities and was thoroughly involved in building offshore BI team and providing technical guidance on regular basis. Summary •\tOver nine years of strong working experience in building business intelligence and data warehousing solutions. \n•\tExpertise in analyzing complex business data to provide strong business solutions. \n•\tHands on experience in designing and developing Business Intelligence dashboards/visualizations/adhoc reports/alerts using Tableau7.0/8.0, OBIEE 10g/11g, SQL and Brio.  \n•\tWorked on all phases of data warehouse development life cycle from gathering requirements to design, development, testing, implementation, and support. \n•\tStrong team lead capabilities and was thoroughly involved in building offshore BI team and providing technical guidance on regular basis. •\tOver nine years of strong working experience in building business intelligence and data warehousing solutions. \n•\tExpertise in analyzing complex business data to provide strong business solutions. \n•\tHands on experience in designing and developing Business Intelligence dashboards/visualizations/adhoc reports/alerts using Tableau7.0/8.0, OBIEE 10g/11g, SQL and Brio.  \n•\tWorked on all phases of data warehouse development life cycle from gathering requirements to design, development, testing, implementation, and support. \n•\tStrong team lead capabilities and was thoroughly involved in building offshore BI team and providing technical guidance on regular basis. •\tOver nine years of strong working experience in building business intelligence and data warehousing solutions. \n•\tExpertise in analyzing complex business data to provide strong business solutions. \n•\tHands on experience in designing and developing Business Intelligence dashboards/visualizations/adhoc reports/alerts using Tableau7.0/8.0, OBIEE 10g/11g, SQL and Brio.  \n•\tWorked on all phases of data warehouse development life cycle from gathering requirements to design, development, testing, implementation, and support. \n•\tStrong team lead capabilities and was thoroughly involved in building offshore BI team and providing technical guidance on regular basis. Experience Senior Business Intelligence Engineer QuinStreet October 2011  – Present (3 years 11 months) Foster City,CA •\tAnalyzed business requirements from management and business users to define the architecture of the BI solutions needed to produce the required reporting. \n•\tGathered data from different sources like Oracle, Hadoop, Excel and blending it in Tableau and building meaningful visualizations. \n•\tBuilding reports pulling online data for web media from big data environments like Hadoop and Google Analytics. \n•\tHandled Tableau admin activities by creating and managing sites, projects, users ,subscriptions and schedules in Tableau \n•\tBuilding data extracts and scheduling incremental/full refresh in Tableau  \n•\tGenerated Dashboards with Quick filters, Parameters and sets to handle views more efficiently. \n•\tPublished Workbooks by creating user filters so that only appropriate teams can view it. \n•\tConnecting to Google Analytics data using tableau to analyze online data for web media. \n•\tProficient in understanding business processes / requirements and translating them into technical requirements Business Intelligence Engineer QuinStreet April 2008  –  September 2011  (3 years 6 months) Foster City,CA •\tInvolved in business requirements gathering and translated the requirements into technical requirements. \n•\tCustomized and developed RPD (Physical, Business model and Presentation Layer), configured metadata objects and Web Catalog Objects. \n•\tDeveloped Reports / Dashboards with different Analytics Views (Drill-Down / Dynamic, Pivot Table, Chart, Column Selector, with global and local filters) using Oracle BI Presentation Services. \n•\tCreate groups for different users to provide suitable securities for different dashboards and reports. \n•\tDesigned the layout for different dashboards and reports. \n•\tManaged day-to-day .rpd, Scheduler & iBots. \n•\tImplemented BI Publisher and created business reports using BI Publisher. \n•\tUsed OBIEE time series function to show reports at daily, weekly, monthly and quarterly level.  \n•\tCreated automated reports and scheduled those through Ibots. Senior QA Engineer (Business Intelligence) QuinStreet July 2006  –  March 2008  (1 year 9 months) •\tI was responsible in gathering requirements from business users and to develop a Management Reporting roadmap. \n•\tConducted ad hoc data analysis and data quality investigations. \n•\tImplemented training and documentation solutions that enable business stakeholders to get the most out of our self-serve reporting tools. \n•\tPrepared high level technical/user documentation for reports and dashboards. \n•\tProvided training on the use of reports and dashboards for business users Senior Business Intelligence Engineer QuinStreet October 2011  – Present (3 years 11 months) Foster City,CA •\tAnalyzed business requirements from management and business users to define the architecture of the BI solutions needed to produce the required reporting. \n•\tGathered data from different sources like Oracle, Hadoop, Excel and blending it in Tableau and building meaningful visualizations. \n•\tBuilding reports pulling online data for web media from big data environments like Hadoop and Google Analytics. \n•\tHandled Tableau admin activities by creating and managing sites, projects, users ,subscriptions and schedules in Tableau \n•\tBuilding data extracts and scheduling incremental/full refresh in Tableau  \n•\tGenerated Dashboards with Quick filters, Parameters and sets to handle views more efficiently. \n•\tPublished Workbooks by creating user filters so that only appropriate teams can view it. \n•\tConnecting to Google Analytics data using tableau to analyze online data for web media. \n•\tProficient in understanding business processes / requirements and translating them into technical requirements Senior Business Intelligence Engineer QuinStreet October 2011  – Present (3 years 11 months) Foster City,CA •\tAnalyzed business requirements from management and business users to define the architecture of the BI solutions needed to produce the required reporting. \n•\tGathered data from different sources like Oracle, Hadoop, Excel and blending it in Tableau and building meaningful visualizations. \n•\tBuilding reports pulling online data for web media from big data environments like Hadoop and Google Analytics. \n•\tHandled Tableau admin activities by creating and managing sites, projects, users ,subscriptions and schedules in Tableau \n•\tBuilding data extracts and scheduling incremental/full refresh in Tableau  \n•\tGenerated Dashboards with Quick filters, Parameters and sets to handle views more efficiently. \n•\tPublished Workbooks by creating user filters so that only appropriate teams can view it. \n•\tConnecting to Google Analytics data using tableau to analyze online data for web media. \n•\tProficient in understanding business processes / requirements and translating them into technical requirements Business Intelligence Engineer QuinStreet April 2008  –  September 2011  (3 years 6 months) Foster City,CA •\tInvolved in business requirements gathering and translated the requirements into technical requirements. \n•\tCustomized and developed RPD (Physical, Business model and Presentation Layer), configured metadata objects and Web Catalog Objects. \n•\tDeveloped Reports / Dashboards with different Analytics Views (Drill-Down / Dynamic, Pivot Table, Chart, Column Selector, with global and local filters) using Oracle BI Presentation Services. \n•\tCreate groups for different users to provide suitable securities for different dashboards and reports. \n•\tDesigned the layout for different dashboards and reports. \n•\tManaged day-to-day .rpd, Scheduler & iBots. \n•\tImplemented BI Publisher and created business reports using BI Publisher. \n•\tUsed OBIEE time series function to show reports at daily, weekly, monthly and quarterly level.  \n•\tCreated automated reports and scheduled those through Ibots. Business Intelligence Engineer QuinStreet April 2008  –  September 2011  (3 years 6 months) Foster City,CA •\tInvolved in business requirements gathering and translated the requirements into technical requirements. \n•\tCustomized and developed RPD (Physical, Business model and Presentation Layer), configured metadata objects and Web Catalog Objects. \n•\tDeveloped Reports / Dashboards with different Analytics Views (Drill-Down / Dynamic, Pivot Table, Chart, Column Selector, with global and local filters) using Oracle BI Presentation Services. \n•\tCreate groups for different users to provide suitable securities for different dashboards and reports. \n•\tDesigned the layout for different dashboards and reports. \n•\tManaged day-to-day .rpd, Scheduler & iBots. \n•\tImplemented BI Publisher and created business reports using BI Publisher. \n•\tUsed OBIEE time series function to show reports at daily, weekly, monthly and quarterly level.  \n•\tCreated automated reports and scheduled those through Ibots. Senior QA Engineer (Business Intelligence) QuinStreet July 2006  –  March 2008  (1 year 9 months) •\tI was responsible in gathering requirements from business users and to develop a Management Reporting roadmap. \n•\tConducted ad hoc data analysis and data quality investigations. \n•\tImplemented training and documentation solutions that enable business stakeholders to get the most out of our self-serve reporting tools. \n•\tPrepared high level technical/user documentation for reports and dashboards. \n•\tProvided training on the use of reports and dashboards for business users Senior QA Engineer (Business Intelligence) QuinStreet July 2006  –  March 2008  (1 year 9 months) •\tI was responsible in gathering requirements from business users and to develop a Management Reporting roadmap. \n•\tConducted ad hoc data analysis and data quality investigations. \n•\tImplemented training and documentation solutions that enable business stakeholders to get the most out of our self-serve reporting tools. \n•\tPrepared high level technical/user documentation for reports and dashboards. \n•\tProvided training on the use of reports and dashboards for business users Skills Data Warehousing Business Intelligence Tableau 8 Analytics OBIEE Oracle SQL Hyperion Brio Hive Skills  Data Warehousing Business Intelligence Tableau 8 Analytics OBIEE Oracle SQL Hyperion Brio Hive Data Warehousing Business Intelligence Tableau 8 Analytics OBIEE Oracle SQL Hyperion Brio Hive Data Warehousing Business Intelligence Tableau 8 Analytics OBIEE Oracle SQL Hyperion Brio Hive Education Utkal University Masters in Computer Applications,  Computer Science Utkal University Masters in Computer Applications,  Computer Science Utkal University Masters in Computer Applications,  Computer Science Utkal University Masters in Computer Applications,  Computer Science ", "Summary Professional Summary: \n \nOver 8 years experience in Enterprise Business Intelligence Systems, Enterprise Data Warehousing, OLAP, and Dashboard/Data Visualization designed. \n \nExperienced with complete SDLC processes including Requirement Gathering and Analysis, Design, Development, Testing, Implementation and Maintenance.  \n \nAble to analyze a given business process and user requirements to design custom BI solutions addressing organizational needs.  \n \nExpertise in handling Data Warehousing and Business Intelligence tools. \n \nExcellent knowledge on Data warehousing concepts - Star schema, Snow-flake Schema and worked on both OLAP and OLTP databases. \n \nSpecialties: Business Intelligence, Tableau, MicroStrategy, Data Analysis, Data Warehousing, Datawarehousing, Decision Support, Documentation, Requirements, Requirements Analysis, SQL Summary Professional Summary: \n \nOver 8 years experience in Enterprise Business Intelligence Systems, Enterprise Data Warehousing, OLAP, and Dashboard/Data Visualization designed. \n \nExperienced with complete SDLC processes including Requirement Gathering and Analysis, Design, Development, Testing, Implementation and Maintenance.  \n \nAble to analyze a given business process and user requirements to design custom BI solutions addressing organizational needs.  \n \nExpertise in handling Data Warehousing and Business Intelligence tools. \n \nExcellent knowledge on Data warehousing concepts - Star schema, Snow-flake Schema and worked on both OLAP and OLTP databases. \n \nSpecialties: Business Intelligence, Tableau, MicroStrategy, Data Analysis, Data Warehousing, Datawarehousing, Decision Support, Documentation, Requirements, Requirements Analysis, SQL Professional Summary: \n \nOver 8 years experience in Enterprise Business Intelligence Systems, Enterprise Data Warehousing, OLAP, and Dashboard/Data Visualization designed. \n \nExperienced with complete SDLC processes including Requirement Gathering and Analysis, Design, Development, Testing, Implementation and Maintenance.  \n \nAble to analyze a given business process and user requirements to design custom BI solutions addressing organizational needs.  \n \nExpertise in handling Data Warehousing and Business Intelligence tools. \n \nExcellent knowledge on Data warehousing concepts - Star schema, Snow-flake Schema and worked on both OLAP and OLTP databases. \n \nSpecialties: Business Intelligence, Tableau, MicroStrategy, Data Analysis, Data Warehousing, Datawarehousing, Decision Support, Documentation, Requirements, Requirements Analysis, SQL Professional Summary: \n \nOver 8 years experience in Enterprise Business Intelligence Systems, Enterprise Data Warehousing, OLAP, and Dashboard/Data Visualization designed. \n \nExperienced with complete SDLC processes including Requirement Gathering and Analysis, Design, Development, Testing, Implementation and Maintenance.  \n \nAble to analyze a given business process and user requirements to design custom BI solutions addressing organizational needs.  \n \nExpertise in handling Data Warehousing and Business Intelligence tools. \n \nExcellent knowledge on Data warehousing concepts - Star schema, Snow-flake Schema and worked on both OLAP and OLTP databases. \n \nSpecialties: Business Intelligence, Tableau, MicroStrategy, Data Analysis, Data Warehousing, Datawarehousing, Decision Support, Documentation, Requirements, Requirements Analysis, SQL Skills Data Warehousing Business Intelligence Data Modeling Microstrategy OLAP Business Intelligence... Cognos SDLC Requirements Analysis Databases SQL Requirements Gathering Data Analysis Business Process Business Analytics Testing Analysis Dashboard ETL See 4+     See less Skills  Data Warehousing Business Intelligence Data Modeling Microstrategy OLAP Business Intelligence... Cognos SDLC Requirements Analysis Databases SQL Requirements Gathering Data Analysis Business Process Business Analytics Testing Analysis Dashboard ETL See 4+     See less Data Warehousing Business Intelligence Data Modeling Microstrategy OLAP Business Intelligence... Cognos SDLC Requirements Analysis Databases SQL Requirements Gathering Data Analysis Business Process Business Analytics Testing Analysis Dashboard ETL See 4+     See less Data Warehousing Business Intelligence Data Modeling Microstrategy OLAP Business Intelligence... Cognos SDLC Requirements Analysis Databases SQL Requirements Gathering Data Analysis Business Process Business Analytics Testing Analysis Dashboard ETL See 4+     See less "]}