{"position": "Director, Design", "company": "Google", "profiles": ["Summary I seek to find balance of a strong concept as well as the aesthetic beauty of any project I take on. Whether it is for web design, print layouts, experiential design, mobile design, photography, illustration, digital design, or motion graphics. Summary I seek to find balance of a strong concept as well as the aesthetic beauty of any project I take on. Whether it is for web design, print layouts, experiential design, mobile design, photography, illustration, digital design, or motion graphics. I seek to find balance of a strong concept as well as the aesthetic beauty of any project I take on. Whether it is for web design, print layouts, experiential design, mobile design, photography, illustration, digital design, or motion graphics. I seek to find balance of a strong concept as well as the aesthetic beauty of any project I take on. Whether it is for web design, print layouts, experiential design, mobile design, photography, illustration, digital design, or motion graphics. Experience Art Director Jessi Michelle Freelance Art Director November 2013  – Present (1 year 10 months) Paris Area, France Clients: TheRealReal, Wildcare, Parisian Inspired Art Director + Designer (Contract) Yahoo! August 2013  –  October 2013  (3 months) sunnyvale, ca I worked within Yahoo's Brand Creative Group (BCG) art directing and designing launch campaigns for Yahoo products as well as contributing to brand design projects as well. \nYahoo Sports Fantasy Football, Yahoo Messenger, Yahoo at Ad Week and more. Art Director Chemistry Club (formerly Engine Company 1) September 2011  –  August 2013  (2 years) san francisco bay area Clients: \nMonterey Bay Aquarium, LinkedIn, San Francisco 49ers, NBC, Portola Hotel & Spa, Mozilla Firefox \n \n- Freelanced for 8 months before being hired on full-time. Creative Intern - Art Director Chemistry Club (formerly Engine Company 1) June 2011  –  September 2011  (4 months) San Francisco Bay Area Clients: \nDial, San Francisco 49ers, Monterey Bay Aquarium Office Manager Noise 13 February 2010  –  June 2010  (5 months) San Francisco Bay Area + Helped get the business Green Certified  \n+ Coordinated special events \n+ Marketing \n+ Clerical Work  \n+ Assisted designers as production artists as needed Social Media & Web Marketing Intern Betsey Johnson June 2009  –  August 2009  (3 months) New York, NY + Developed and implemented a social media strategy. \n+ Established and maintained social networking presence on Facebook, Twitter, and other social networking sites. \n+ Assisted in the implementation of a content monetization strategy for social networks and measuring performance. \n+ Managed online communications. \n+ Monitored rich media content sites and social networking strategies in the industry and reported on trends. \n+ Maintained the weekly online selling data of all merchandise on E-Commerce site. Production Assistant Intern & Account Managment Intern Daniel Burton Dean Advertising January 2009  –  May 2009  (5 months) Logo design, competitve analysis, SEO, interactive marketing \nresearch, web analytics, & web content development. Art Director Jessi Michelle Freelance Art Director November 2013  – Present (1 year 10 months) Paris Area, France Clients: TheRealReal, Wildcare, Parisian Inspired Art Director Jessi Michelle Freelance Art Director November 2013  – Present (1 year 10 months) Paris Area, France Clients: TheRealReal, Wildcare, Parisian Inspired Art Director + Designer (Contract) Yahoo! August 2013  –  October 2013  (3 months) sunnyvale, ca I worked within Yahoo's Brand Creative Group (BCG) art directing and designing launch campaigns for Yahoo products as well as contributing to brand design projects as well. \nYahoo Sports Fantasy Football, Yahoo Messenger, Yahoo at Ad Week and more. Art Director + Designer (Contract) Yahoo! August 2013  –  October 2013  (3 months) sunnyvale, ca I worked within Yahoo's Brand Creative Group (BCG) art directing and designing launch campaigns for Yahoo products as well as contributing to brand design projects as well. \nYahoo Sports Fantasy Football, Yahoo Messenger, Yahoo at Ad Week and more. Art Director Chemistry Club (formerly Engine Company 1) September 2011  –  August 2013  (2 years) san francisco bay area Clients: \nMonterey Bay Aquarium, LinkedIn, San Francisco 49ers, NBC, Portola Hotel & Spa, Mozilla Firefox \n \n- Freelanced for 8 months before being hired on full-time. Art Director Chemistry Club (formerly Engine Company 1) September 2011  –  August 2013  (2 years) san francisco bay area Clients: \nMonterey Bay Aquarium, LinkedIn, San Francisco 49ers, NBC, Portola Hotel & Spa, Mozilla Firefox \n \n- Freelanced for 8 months before being hired on full-time. Creative Intern - Art Director Chemistry Club (formerly Engine Company 1) June 2011  –  September 2011  (4 months) San Francisco Bay Area Clients: \nDial, San Francisco 49ers, Monterey Bay Aquarium Creative Intern - Art Director Chemistry Club (formerly Engine Company 1) June 2011  –  September 2011  (4 months) San Francisco Bay Area Clients: \nDial, San Francisco 49ers, Monterey Bay Aquarium Office Manager Noise 13 February 2010  –  June 2010  (5 months) San Francisco Bay Area + Helped get the business Green Certified  \n+ Coordinated special events \n+ Marketing \n+ Clerical Work  \n+ Assisted designers as production artists as needed Office Manager Noise 13 February 2010  –  June 2010  (5 months) San Francisco Bay Area + Helped get the business Green Certified  \n+ Coordinated special events \n+ Marketing \n+ Clerical Work  \n+ Assisted designers as production artists as needed Social Media & Web Marketing Intern Betsey Johnson June 2009  –  August 2009  (3 months) New York, NY + Developed and implemented a social media strategy. \n+ Established and maintained social networking presence on Facebook, Twitter, and other social networking sites. \n+ Assisted in the implementation of a content monetization strategy for social networks and measuring performance. \n+ Managed online communications. \n+ Monitored rich media content sites and social networking strategies in the industry and reported on trends. \n+ Maintained the weekly online selling data of all merchandise on E-Commerce site. Social Media & Web Marketing Intern Betsey Johnson June 2009  –  August 2009  (3 months) New York, NY + Developed and implemented a social media strategy. \n+ Established and maintained social networking presence on Facebook, Twitter, and other social networking sites. \n+ Assisted in the implementation of a content monetization strategy for social networks and measuring performance. \n+ Managed online communications. \n+ Monitored rich media content sites and social networking strategies in the industry and reported on trends. \n+ Maintained the weekly online selling data of all merchandise on E-Commerce site. Production Assistant Intern & Account Managment Intern Daniel Burton Dean Advertising January 2009  –  May 2009  (5 months) Logo design, competitve analysis, SEO, interactive marketing \nresearch, web analytics, & web content development. Production Assistant Intern & Account Managment Intern Daniel Burton Dean Advertising January 2009  –  May 2009  (5 months) Logo design, competitve analysis, SEO, interactive marketing \nresearch, web analytics, & web content development. Languages English Native or bilingual proficiency French English Native or bilingual proficiency French English Native or bilingual proficiency French Native or bilingual proficiency Skills Advertising Art Direction Graphic Design Illustrator Photography Photoshop InDesign Illustration Logo Design After Effects Social Media Marketing Creative Direction Social Media Lighting Techniques SEO Social Networking Layout Creative Strategy See 3+     See less Skills  Advertising Art Direction Graphic Design Illustrator Photography Photoshop InDesign Illustration Logo Design After Effects Social Media Marketing Creative Direction Social Media Lighting Techniques SEO Social Networking Layout Creative Strategy See 3+     See less Advertising Art Direction Graphic Design Illustrator Photography Photoshop InDesign Illustration Logo Design After Effects Social Media Marketing Creative Direction Social Media Lighting Techniques SEO Social Networking Layout Creative Strategy See 3+     See less Advertising Art Direction Graphic Design Illustrator Photography Photoshop InDesign Illustration Logo Design After Effects Social Media Marketing Creative Direction Social Media Lighting Techniques SEO Social Networking Layout Creative Strategy See 3+     See less Education Academy of Art University MFA,  Advertising: specializing in Art Direction 2009  – 2011 University of Southern Indiana BA,  Advertising & PR 2005  – 2009 Santa Reparata International School of Art Art - Jewelry 2007  – 2007 Academy of Art University MFA,  Advertising: specializing in Art Direction 2009  – 2011 Academy of Art University MFA,  Advertising: specializing in Art Direction 2009  – 2011 Academy of Art University MFA,  Advertising: specializing in Art Direction 2009  – 2011 University of Southern Indiana BA,  Advertising & PR 2005  – 2009 University of Southern Indiana BA,  Advertising & PR 2005  – 2009 University of Southern Indiana BA,  Advertising & PR 2005  – 2009 Santa Reparata International School of Art Art - Jewelry 2007  – 2007 Santa Reparata International School of Art Art - Jewelry 2007  – 2007 Santa Reparata International School of Art Art - Jewelry 2007  – 2007 Honors & Awards Additional Honors & Awards 2013 OBIE Awards - SILVER \n \n2012 Digital Screenmedia Association’s Crown Awards Show - GOLD \n \n2012 CMYK Magazine \"Top 100 New Creatives #52\" \n \n2011 Academy of Art University Spring Show  \n \n2010 24hr SF Film Race 2010, Runner Up Additional Honors & Awards 2013 OBIE Awards - SILVER \n \n2012 Digital Screenmedia Association’s Crown Awards Show - GOLD \n \n2012 CMYK Magazine \"Top 100 New Creatives #52\" \n \n2011 Academy of Art University Spring Show  \n \n2010 24hr SF Film Race 2010, Runner Up Additional Honors & Awards 2013 OBIE Awards - SILVER \n \n2012 Digital Screenmedia Association’s Crown Awards Show - GOLD \n \n2012 CMYK Magazine \"Top 100 New Creatives #52\" \n \n2011 Academy of Art University Spring Show  \n \n2010 24hr SF Film Race 2010, Runner Up Additional Honors & Awards 2013 OBIE Awards - SILVER \n \n2012 Digital Screenmedia Association’s Crown Awards Show - GOLD \n \n2012 CMYK Magazine \"Top 100 New Creatives #52\" \n \n2011 Academy of Art University Spring Show  \n \n2010 24hr SF Film Race 2010, Runner Up ", "Summary Dvira is a designer and an expert in everything to do with residential and commercial design. In addition to her interior designer title, Dvira is also a tv personality, a prop stylist, a style editor, a trend specialist and everything in between. With a degree in architecture from the University of Toronto and a masters in interior design from Pratt Institute in New York, Dvira has also managed to trot the globe on a mission to discover the world in the context of design and architecture. Her career has led her to work on an extensive line of design projects and be a part of some of the most renowned design firms. Most notably Dvira was a winner of a reality show called From The Ground Up, where she beat out 9,000 applicants and 14 finalists who competed to become Debbie Travis's Chief Designer. Dvira is the current leed designer and art director for the hit television show \"Income Property\" (season I, II & III). Dvira also currently manages and runs her own design firm. Specialties:interior design, architecture, decor, staging, style editing, TV appearances, design consulting Summary Dvira is a designer and an expert in everything to do with residential and commercial design. In addition to her interior designer title, Dvira is also a tv personality, a prop stylist, a style editor, a trend specialist and everything in between. With a degree in architecture from the University of Toronto and a masters in interior design from Pratt Institute in New York, Dvira has also managed to trot the globe on a mission to discover the world in the context of design and architecture. Her career has led her to work on an extensive line of design projects and be a part of some of the most renowned design firms. Most notably Dvira was a winner of a reality show called From The Ground Up, where she beat out 9,000 applicants and 14 finalists who competed to become Debbie Travis's Chief Designer. Dvira is the current leed designer and art director for the hit television show \"Income Property\" (season I, II & III). Dvira also currently manages and runs her own design firm. Specialties:interior design, architecture, decor, staging, style editing, TV appearances, design consulting Dvira is a designer and an expert in everything to do with residential and commercial design. In addition to her interior designer title, Dvira is also a tv personality, a prop stylist, a style editor, a trend specialist and everything in between. With a degree in architecture from the University of Toronto and a masters in interior design from Pratt Institute in New York, Dvira has also managed to trot the globe on a mission to discover the world in the context of design and architecture. Her career has led her to work on an extensive line of design projects and be a part of some of the most renowned design firms. Most notably Dvira was a winner of a reality show called From The Ground Up, where she beat out 9,000 applicants and 14 finalists who competed to become Debbie Travis's Chief Designer. Dvira is the current leed designer and art director for the hit television show \"Income Property\" (season I, II & III). Dvira also currently manages and runs her own design firm. Specialties:interior design, architecture, decor, staging, style editing, TV appearances, design consulting Dvira is a designer and an expert in everything to do with residential and commercial design. In addition to her interior designer title, Dvira is also a tv personality, a prop stylist, a style editor, a trend specialist and everything in between. With a degree in architecture from the University of Toronto and a masters in interior design from Pratt Institute in New York, Dvira has also managed to trot the globe on a mission to discover the world in the context of design and architecture. Her career has led her to work on an extensive line of design projects and be a part of some of the most renowned design firms. Most notably Dvira was a winner of a reality show called From The Ground Up, where she beat out 9,000 applicants and 14 finalists who competed to become Debbie Travis's Chief Designer. Dvira is the current leed designer and art director for the hit television show \"Income Property\" (season I, II & III). Dvira also currently manages and runs her own design firm. Specialties:interior design, architecture, decor, staging, style editing, TV appearances, design consulting Experience Style Editor/Blogger Yahoo! Canada Lifestyle March 2008  – Present (7 years 6 months) Weekly contribution on the latest design trends and events at Yahoo! Lifestyle Home and Garden section. Senior Designer & Art Director RTR Media Inc. January 2008  – Present (7 years 8 months) Designer & Art Director for the hit Television Show on HGTV \"Income Property\" for seasons I, II, & III Proprietor of Interior Design firm Dvira INK January 2007  – Present (8 years 8 months) Interior Design firm specializing in residential and commercial design projects. Leed Designer on the televison show 'Unsellables' Cineflix June 2007  –  August 2009  (2 years 3 months) Chief Designer of Debbie Travis Tribute Communities June 2007  –  June 2008  (1 year 1 month) Was awarded a contract to design and develop ten (10) Debbie Travis model homes Tribute Communities, a housing developer across the GTA. Winner of From the Ground Up with Debbie Travis Debbie Travis November 2007  –  February 2008  (4 months) Selected out of 9,000 applicants and 14 finalists by Debbie Travis on the television series ‘From the Ground Up, Season II’ to become Debbie Travis’s Chief Designer. Was awarded the prize to work side by side with Debbie Travis to design and develop Debbie Travis Homes with Tribute Communities, one of Canada’s most respected builder and developer. Designer Munge Leung Design Associates September 2005  –  October 2007  (2 years 2 months) Designer at Munge Leung design associates, one of Toronto's leading design firms in cutting edge commercial design. Style Editor/Blogger Yahoo! Canada Lifestyle March 2008  – Present (7 years 6 months) Weekly contribution on the latest design trends and events at Yahoo! Lifestyle Home and Garden section. Style Editor/Blogger Yahoo! Canada Lifestyle March 2008  – Present (7 years 6 months) Weekly contribution on the latest design trends and events at Yahoo! Lifestyle Home and Garden section. Senior Designer & Art Director RTR Media Inc. January 2008  – Present (7 years 8 months) Designer & Art Director for the hit Television Show on HGTV \"Income Property\" for seasons I, II, & III Senior Designer & Art Director RTR Media Inc. January 2008  – Present (7 years 8 months) Designer & Art Director for the hit Television Show on HGTV \"Income Property\" for seasons I, II, & III Proprietor of Interior Design firm Dvira INK January 2007  – Present (8 years 8 months) Interior Design firm specializing in residential and commercial design projects. Proprietor of Interior Design firm Dvira INK January 2007  – Present (8 years 8 months) Interior Design firm specializing in residential and commercial design projects. Leed Designer on the televison show 'Unsellables' Cineflix June 2007  –  August 2009  (2 years 3 months) Leed Designer on the televison show 'Unsellables' Cineflix June 2007  –  August 2009  (2 years 3 months) Chief Designer of Debbie Travis Tribute Communities June 2007  –  June 2008  (1 year 1 month) Was awarded a contract to design and develop ten (10) Debbie Travis model homes Tribute Communities, a housing developer across the GTA. Chief Designer of Debbie Travis Tribute Communities June 2007  –  June 2008  (1 year 1 month) Was awarded a contract to design and develop ten (10) Debbie Travis model homes Tribute Communities, a housing developer across the GTA. Winner of From the Ground Up with Debbie Travis Debbie Travis November 2007  –  February 2008  (4 months) Selected out of 9,000 applicants and 14 finalists by Debbie Travis on the television series ‘From the Ground Up, Season II’ to become Debbie Travis’s Chief Designer. Was awarded the prize to work side by side with Debbie Travis to design and develop Debbie Travis Homes with Tribute Communities, one of Canada’s most respected builder and developer. Winner of From the Ground Up with Debbie Travis Debbie Travis November 2007  –  February 2008  (4 months) Selected out of 9,000 applicants and 14 finalists by Debbie Travis on the television series ‘From the Ground Up, Season II’ to become Debbie Travis’s Chief Designer. Was awarded the prize to work side by side with Debbie Travis to design and develop Debbie Travis Homes with Tribute Communities, one of Canada’s most respected builder and developer. Designer Munge Leung Design Associates September 2005  –  October 2007  (2 years 2 months) Designer at Munge Leung design associates, one of Toronto's leading design firms in cutting edge commercial design. Designer Munge Leung Design Associates September 2005  –  October 2007  (2 years 2 months) Designer at Munge Leung design associates, one of Toronto's leading design firms in cutting edge commercial design. Education Pratt Institute Master of Science,  Interior Architecture 2002  – 2005 Activities and Societies:  Participated in one semester of studies in Copenhagen's\nDIS (Danish Institute for Study Abroad) University of Toronto BA,  Architecture 1998  – 2004 Pratt Institute Master of Science,  Interior Architecture 2002  – 2005 Activities and Societies:  Participated in one semester of studies in Copenhagen's\nDIS (Danish Institute for Study Abroad) Pratt Institute Master of Science,  Interior Architecture 2002  – 2005 Activities and Societies:  Participated in one semester of studies in Copenhagen's\nDIS (Danish Institute for Study Abroad) Pratt Institute Master of Science,  Interior Architecture 2002  – 2005 Activities and Societies:  Participated in one semester of studies in Copenhagen's\nDIS (Danish Institute for Study Abroad) University of Toronto BA,  Architecture 1998  – 2004 University of Toronto BA,  Architecture 1998  – 2004 University of Toronto BA,  Architecture 1998  – 2004 ", "Summary I'm Will Ward, a Designer with over 4 years of professional experience working in ad agencies and small design shops. I have a passion for creating meaningful products people care about and solving problems through research, insight, and exploration of great ideas. \n \nI'm a firm believer in user focused visual communications, where great ideas start from small insights and grow into powerful executions. Insists that the best designers are only as good as the team that pushes each other to new heights, and can bring new perspectives to the table, encourage one another’s growth, and development. \n \nBRAINSTORMING \nExperienced at developing ideas that not only aim to solve client / brand problems, but also creates a meaningful product experience for it’s audience through well planned research and insights that drive creative execution. \n \nDESIGN \nWell versed in traditional design principals that give purpose, and life to a product; significantly resonating with it’s audience through the process of intuitive exploration, and refinement. \n \nCOLLABORATIVE \nAccustomed to working within a team environment, whether it’s collectively solving problems together or independently exploring solutions and regrouping as a team throughout the process. \n \nTECHNICAL \nEfficient at developing productive and organized work flows to tackle a wide range of project mediums and deadlines. \nIndustry skill sets: Art Direction, Visual Design, Brand Identity, Packaging, Concepting, Campaign Development, E-mail Marketing, Banner Ads, Mobile Development, Advanced Typography, and Production of final deliverables. \n \nSoftware skill sets: Adobe Creative Cloud Photoshop, Illustrator, InDesign, Dreamweaver Flash, and Sketch 3. Summary I'm Will Ward, a Designer with over 4 years of professional experience working in ad agencies and small design shops. I have a passion for creating meaningful products people care about and solving problems through research, insight, and exploration of great ideas. \n \nI'm a firm believer in user focused visual communications, where great ideas start from small insights and grow into powerful executions. Insists that the best designers are only as good as the team that pushes each other to new heights, and can bring new perspectives to the table, encourage one another’s growth, and development. \n \nBRAINSTORMING \nExperienced at developing ideas that not only aim to solve client / brand problems, but also creates a meaningful product experience for it’s audience through well planned research and insights that drive creative execution. \n \nDESIGN \nWell versed in traditional design principals that give purpose, and life to a product; significantly resonating with it’s audience through the process of intuitive exploration, and refinement. \n \nCOLLABORATIVE \nAccustomed to working within a team environment, whether it’s collectively solving problems together or independently exploring solutions and regrouping as a team throughout the process. \n \nTECHNICAL \nEfficient at developing productive and organized work flows to tackle a wide range of project mediums and deadlines. \nIndustry skill sets: Art Direction, Visual Design, Brand Identity, Packaging, Concepting, Campaign Development, E-mail Marketing, Banner Ads, Mobile Development, Advanced Typography, and Production of final deliverables. \n \nSoftware skill sets: Adobe Creative Cloud Photoshop, Illustrator, InDesign, Dreamweaver Flash, and Sketch 3. I'm Will Ward, a Designer with over 4 years of professional experience working in ad agencies and small design shops. I have a passion for creating meaningful products people care about and solving problems through research, insight, and exploration of great ideas. \n \nI'm a firm believer in user focused visual communications, where great ideas start from small insights and grow into powerful executions. Insists that the best designers are only as good as the team that pushes each other to new heights, and can bring new perspectives to the table, encourage one another’s growth, and development. \n \nBRAINSTORMING \nExperienced at developing ideas that not only aim to solve client / brand problems, but also creates a meaningful product experience for it’s audience through well planned research and insights that drive creative execution. \n \nDESIGN \nWell versed in traditional design principals that give purpose, and life to a product; significantly resonating with it’s audience through the process of intuitive exploration, and refinement. \n \nCOLLABORATIVE \nAccustomed to working within a team environment, whether it’s collectively solving problems together or independently exploring solutions and regrouping as a team throughout the process. \n \nTECHNICAL \nEfficient at developing productive and organized work flows to tackle a wide range of project mediums and deadlines. \nIndustry skill sets: Art Direction, Visual Design, Brand Identity, Packaging, Concepting, Campaign Development, E-mail Marketing, Banner Ads, Mobile Development, Advanced Typography, and Production of final deliverables. \n \nSoftware skill sets: Adobe Creative Cloud Photoshop, Illustrator, InDesign, Dreamweaver Flash, and Sketch 3. I'm Will Ward, a Designer with over 4 years of professional experience working in ad agencies and small design shops. I have a passion for creating meaningful products people care about and solving problems through research, insight, and exploration of great ideas. \n \nI'm a firm believer in user focused visual communications, where great ideas start from small insights and grow into powerful executions. Insists that the best designers are only as good as the team that pushes each other to new heights, and can bring new perspectives to the table, encourage one another’s growth, and development. \n \nBRAINSTORMING \nExperienced at developing ideas that not only aim to solve client / brand problems, but also creates a meaningful product experience for it’s audience through well planned research and insights that drive creative execution. \n \nDESIGN \nWell versed in traditional design principals that give purpose, and life to a product; significantly resonating with it’s audience through the process of intuitive exploration, and refinement. \n \nCOLLABORATIVE \nAccustomed to working within a team environment, whether it’s collectively solving problems together or independently exploring solutions and regrouping as a team throughout the process. \n \nTECHNICAL \nEfficient at developing productive and organized work flows to tackle a wide range of project mediums and deadlines. \nIndustry skill sets: Art Direction, Visual Design, Brand Identity, Packaging, Concepting, Campaign Development, E-mail Marketing, Banner Ads, Mobile Development, Advanced Typography, and Production of final deliverables. \n \nSoftware skill sets: Adobe Creative Cloud Photoshop, Illustrator, InDesign, Dreamweaver Flash, and Sketch 3. Experience Freelance Art Director Yahoo May 2015  – Present (4 months) Sunnyvale, California Working as an Art Director / Designer for a world-class brand within the Creative Department, operating on an ad agency model, and servicing a wide range of internal and consumer facing creative needs.  \n \nResponsibilities include:  \n \n— Reporting to the Creative Director and VP of Creative, vetting concepts and creative for approval. \n— Concepting with a Sr. Copywriter to develop over-arching brand campaign ideas that work across video, web and social media platforms. \n— Collaborating with the product team and working within Sketch files to develop custom UI Screens that pair with campaign creative. Art Director and Designer Freelance March 2011  – Present (4 years 6 months) San Francisco Bay Area Studio Artist, Art Direction Geometry Global (Formerly G2 Direct and Digital) April 2014  –  April 2015  (1 year 1 month) San Francisco Bay Area Worked within a hybrid role between art direction and production design. \n \nClients: Adobe, Microsoft Mobile, Docusign, Flexjet and SFSPCA. \n \nType of art direction and design work includes: email campaigns, brand identity, point of sale displays, brand standards, animated banners, storyboards \n \n— Developing write-ups for digital and experiential campaigns pairing up with a writer or as group and creating proof of concepts. \n— Executing look and feel of concepts, flushing out multiple directions to present to client. \n— Refining creative for client presentations and building out the presentation decks. \n— Finalizing and packaging projects, both for web and print to either hand off to vendors or directly to the client.  \n— Working with a web developer to insure creative concepts accurately get carried through to html. Associate, Designer (Contract) True Action, an eBay Inc. Company July 2013  –  April 2014  (10 months) san francisco, california Clients: PayPal, Wells Fargo, eBay and new business pitches. \n \nWorked within a team along side another Designer, Copywriter and Production Artist, with oversight from our ACD Writer, and Sr Designer.  \n \n- Developed a large-scale website concept, comping up individual pages of content at a time often on an accelerated timeline and presenting progress to the client at check-points. \n- Responsible for providing design support on digital campaigns containing: websites, email communications, web banners and social media content. \n- As a designer I was responsible for working with and developing some user interface components, layouts comps, and developing photography styles for digital campaigns, and presentation materials. Freelance Designer International Color Services September 2011  –  April 2012  (8 months) Scottsdale, Arizona Was part of a iPad application development team \"iCatalog\" My team and I were responsible for taking existing catalogs and creating a unique catalog experience on the iPad. I produced graphics and elements within the apps for fashion and retail clients Lilly Pulitzer, Down East Basics, Steve Madden, and Tumi.  \n \nIn addition I was trained to perform color retouching on clothing products and product cutouts using masking techniques in Photoshop. Student The Art Institutes January 2008  –  March 2011  (3 years 3 months) Phoenix, Arizona Area Majored in Graphic Design, received a BA in Graphic Design. Graphic Designer Knoodle Shop August 2010  –  December 2010  (5 months) Phoenix, Arizona Area 5 Month Internship \n \n— Collaborated with the Creative Director producing work with a high turnaround rate.  \n— Produced and designed multiple publication ads, event signs, flyers, web cells, website designs and direct mail pieces. \n \nWorked on projects for The Shops at Norterra, Fulton Ranch Town Centre, The Promenade at Fulton Ranch, El Pedregal at The Boulders, and Bill Johnson's Big Apple. Freelance Art Director Yahoo May 2015  – Present (4 months) Sunnyvale, California Working as an Art Director / Designer for a world-class brand within the Creative Department, operating on an ad agency model, and servicing a wide range of internal and consumer facing creative needs.  \n \nResponsibilities include:  \n \n— Reporting to the Creative Director and VP of Creative, vetting concepts and creative for approval. \n— Concepting with a Sr. Copywriter to develop over-arching brand campaign ideas that work across video, web and social media platforms. \n— Collaborating with the product team and working within Sketch files to develop custom UI Screens that pair with campaign creative. Freelance Art Director Yahoo May 2015  – Present (4 months) Sunnyvale, California Working as an Art Director / Designer for a world-class brand within the Creative Department, operating on an ad agency model, and servicing a wide range of internal and consumer facing creative needs.  \n \nResponsibilities include:  \n \n— Reporting to the Creative Director and VP of Creative, vetting concepts and creative for approval. \n— Concepting with a Sr. Copywriter to develop over-arching brand campaign ideas that work across video, web and social media platforms. \n— Collaborating with the product team and working within Sketch files to develop custom UI Screens that pair with campaign creative. Art Director and Designer Freelance March 2011  – Present (4 years 6 months) San Francisco Bay Area Art Director and Designer Freelance March 2011  – Present (4 years 6 months) San Francisco Bay Area Studio Artist, Art Direction Geometry Global (Formerly G2 Direct and Digital) April 2014  –  April 2015  (1 year 1 month) San Francisco Bay Area Worked within a hybrid role between art direction and production design. \n \nClients: Adobe, Microsoft Mobile, Docusign, Flexjet and SFSPCA. \n \nType of art direction and design work includes: email campaigns, brand identity, point of sale displays, brand standards, animated banners, storyboards \n \n— Developing write-ups for digital and experiential campaigns pairing up with a writer or as group and creating proof of concepts. \n— Executing look and feel of concepts, flushing out multiple directions to present to client. \n— Refining creative for client presentations and building out the presentation decks. \n— Finalizing and packaging projects, both for web and print to either hand off to vendors or directly to the client.  \n— Working with a web developer to insure creative concepts accurately get carried through to html. Studio Artist, Art Direction Geometry Global (Formerly G2 Direct and Digital) April 2014  –  April 2015  (1 year 1 month) San Francisco Bay Area Worked within a hybrid role between art direction and production design. \n \nClients: Adobe, Microsoft Mobile, Docusign, Flexjet and SFSPCA. \n \nType of art direction and design work includes: email campaigns, brand identity, point of sale displays, brand standards, animated banners, storyboards \n \n— Developing write-ups for digital and experiential campaigns pairing up with a writer or as group and creating proof of concepts. \n— Executing look and feel of concepts, flushing out multiple directions to present to client. \n— Refining creative for client presentations and building out the presentation decks. \n— Finalizing and packaging projects, both for web and print to either hand off to vendors or directly to the client.  \n— Working with a web developer to insure creative concepts accurately get carried through to html. Associate, Designer (Contract) True Action, an eBay Inc. Company July 2013  –  April 2014  (10 months) san francisco, california Clients: PayPal, Wells Fargo, eBay and new business pitches. \n \nWorked within a team along side another Designer, Copywriter and Production Artist, with oversight from our ACD Writer, and Sr Designer.  \n \n- Developed a large-scale website concept, comping up individual pages of content at a time often on an accelerated timeline and presenting progress to the client at check-points. \n- Responsible for providing design support on digital campaigns containing: websites, email communications, web banners and social media content. \n- As a designer I was responsible for working with and developing some user interface components, layouts comps, and developing photography styles for digital campaigns, and presentation materials. Associate, Designer (Contract) True Action, an eBay Inc. Company July 2013  –  April 2014  (10 months) san francisco, california Clients: PayPal, Wells Fargo, eBay and new business pitches. \n \nWorked within a team along side another Designer, Copywriter and Production Artist, with oversight from our ACD Writer, and Sr Designer.  \n \n- Developed a large-scale website concept, comping up individual pages of content at a time often on an accelerated timeline and presenting progress to the client at check-points. \n- Responsible for providing design support on digital campaigns containing: websites, email communications, web banners and social media content. \n- As a designer I was responsible for working with and developing some user interface components, layouts comps, and developing photography styles for digital campaigns, and presentation materials. Freelance Designer International Color Services September 2011  –  April 2012  (8 months) Scottsdale, Arizona Was part of a iPad application development team \"iCatalog\" My team and I were responsible for taking existing catalogs and creating a unique catalog experience on the iPad. I produced graphics and elements within the apps for fashion and retail clients Lilly Pulitzer, Down East Basics, Steve Madden, and Tumi.  \n \nIn addition I was trained to perform color retouching on clothing products and product cutouts using masking techniques in Photoshop. Freelance Designer International Color Services September 2011  –  April 2012  (8 months) Scottsdale, Arizona Was part of a iPad application development team \"iCatalog\" My team and I were responsible for taking existing catalogs and creating a unique catalog experience on the iPad. I produced graphics and elements within the apps for fashion and retail clients Lilly Pulitzer, Down East Basics, Steve Madden, and Tumi.  \n \nIn addition I was trained to perform color retouching on clothing products and product cutouts using masking techniques in Photoshop. Student The Art Institutes January 2008  –  March 2011  (3 years 3 months) Phoenix, Arizona Area Majored in Graphic Design, received a BA in Graphic Design. Student The Art Institutes January 2008  –  March 2011  (3 years 3 months) Phoenix, Arizona Area Majored in Graphic Design, received a BA in Graphic Design. Graphic Designer Knoodle Shop August 2010  –  December 2010  (5 months) Phoenix, Arizona Area 5 Month Internship \n \n— Collaborated with the Creative Director producing work with a high turnaround rate.  \n— Produced and designed multiple publication ads, event signs, flyers, web cells, website designs and direct mail pieces. \n \nWorked on projects for The Shops at Norterra, Fulton Ranch Town Centre, The Promenade at Fulton Ranch, El Pedregal at The Boulders, and Bill Johnson's Big Apple. Graphic Designer Knoodle Shop August 2010  –  December 2010  (5 months) Phoenix, Arizona Area 5 Month Internship \n \n— Collaborated with the Creative Director producing work with a high turnaround rate.  \n— Produced and designed multiple publication ads, event signs, flyers, web cells, website designs and direct mail pieces. \n \nWorked on projects for The Shops at Norterra, Fulton Ranch Town Centre, The Promenade at Fulton Ranch, El Pedregal at The Boulders, and Bill Johnson's Big Apple. Skills Art Direction Advertising Graphics Web Design Logo Design Graphic Design Layout Brand Development Adobe Creative Suite Illustrator Photoshop Image Manipulation Email Marketing Creative Direction Color Correction Typography Photography Brochures HTML CSS Dreamweaver Business Cards Banner Ads Visual Communication Flyers Branding & Identity Mobile Applications Print Production Corporate Identity Banners Digital Illustration Production Retouching Web Banners Mobile Website Updating Vector Illustration Catalogs See 23+     See less Skills  Art Direction Advertising Graphics Web Design Logo Design Graphic Design Layout Brand Development Adobe Creative Suite Illustrator Photoshop Image Manipulation Email Marketing Creative Direction Color Correction Typography Photography Brochures HTML CSS Dreamweaver Business Cards Banner Ads Visual Communication Flyers Branding & Identity Mobile Applications Print Production Corporate Identity Banners Digital Illustration Production Retouching Web Banners Mobile Website Updating Vector Illustration Catalogs See 23+     See less Art Direction Advertising Graphics Web Design Logo Design Graphic Design Layout Brand Development Adobe Creative Suite Illustrator Photoshop Image Manipulation Email Marketing Creative Direction Color Correction Typography Photography Brochures HTML CSS Dreamweaver Business Cards Banner Ads Visual Communication Flyers Branding & Identity Mobile Applications Print Production Corporate Identity Banners Digital Illustration Production Retouching Web Banners Mobile Website Updating Vector Illustration Catalogs See 23+     See less Art Direction Advertising Graphics Web Design Logo Design Graphic Design Layout Brand Development Adobe Creative Suite Illustrator Photoshop Image Manipulation Email Marketing Creative Direction Color Correction Typography Photography Brochures HTML CSS Dreamweaver Business Cards Banner Ads Visual Communication Flyers Branding & Identity Mobile Applications Print Production Corporate Identity Banners Digital Illustration Production Retouching Web Banners Mobile Website Updating Vector Illustration Catalogs See 23+     See less Education The Art Institutes of Phoenix Bachelor of Arts,  Graphic Design 2008  – 2011 The Art Institutes of Phoenix Bachelor of Arts,  Graphic Design 2008  – 2011 The Art Institutes of Phoenix Bachelor of Arts,  Graphic Design 2008  – 2011 The Art Institutes of Phoenix Bachelor of Arts,  Graphic Design 2008  – 2011 Honors & Awards Additional Honors & Awards ADDY Award 2011 | Logo Design | New Leaf Standard \nAAF - Metro Phoenix Additional Honors & Awards ADDY Award 2011 | Logo Design | New Leaf Standard \nAAF - Metro Phoenix Additional Honors & Awards ADDY Award 2011 | Logo Design | New Leaf Standard \nAAF - Metro Phoenix Additional Honors & Awards ADDY Award 2011 | Logo Design | New Leaf Standard \nAAF - Metro Phoenix ", "Summary “You can never be a mathematician. \nYou spend more time on drawing graphs  \nand diagrams than on the actual questions.” \n \n- My high school math teacher - Summary “You can never be a mathematician. \nYou spend more time on drawing graphs  \nand diagrams than on the actual questions.” \n \n- My high school math teacher - “You can never be a mathematician. \nYou spend more time on drawing graphs  \nand diagrams than on the actual questions.” \n \n- My high school math teacher - “You can never be a mathematician. \nYou spend more time on drawing graphs  \nand diagrams than on the actual questions.” \n \n- My high school math teacher - Experience Art Director Yahoo March 2014  – Present (1 year 6 months) Sunnyvale, California Creative concept on branding and advertising projects. \nCreate design solutions and apply to various media and formats: Print, Digital, Out of Home and animation/videos. \nWork accross platforms with external agencies, animation teams and engineering team to produce design-unified campaigns. \nDesign hand-typed Post-It note size poster for co-workers to resolve their distressed situations Freelance Art Director Pickwick & Weller August 2013  –  February 2014  (7 months) San Francisco Bay Area Creative Rockmelt June 2013  –  August 2013  (3 months) Mountainview In charge of concepting and art directing a series of short commercials to promote Rockmelt Android app, online promoting materials on social media channels and S.W.A.G. \nAssist Design team creating motion graphic videos for product development. Art Director Intern Composition4 September 2012  –  June 2013  (10 months) San Francisco Bay Area Conceptualize creative campaign for clients such as: SF travel and SFPD. \nCreate and present solutions to client Graphic Designer Formation8 June 2012  –  December 2012  (7 months) Palo Alto Work as in-house graphic designer specializing in print materials. \nDesign annual reports, presentations and invitations for events. Assistant Photographer Travel Magazine June 2009  –  December 2010  (1 year 7 months) In charge of lighting and staging for fashion and commercial shootings. Managed and \nmaintained photographic equipment for outdoor shooting. Junior Graphic Designer Rossett Ltd June 2008  –  August 2009  (1 year 3 months) Managed typographical and photographical styles in poster and business card design for \nclients, such as Techcombank and Marinetime Bank. Made crucial corrections on final designs \nbefore printing. \nLogo design team member in branding project for Vietstar Bank. \n \n Art Director Yahoo March 2014  – Present (1 year 6 months) Sunnyvale, California Creative concept on branding and advertising projects. \nCreate design solutions and apply to various media and formats: Print, Digital, Out of Home and animation/videos. \nWork accross platforms with external agencies, animation teams and engineering team to produce design-unified campaigns. \nDesign hand-typed Post-It note size poster for co-workers to resolve their distressed situations Art Director Yahoo March 2014  – Present (1 year 6 months) Sunnyvale, California Creative concept on branding and advertising projects. \nCreate design solutions and apply to various media and formats: Print, Digital, Out of Home and animation/videos. \nWork accross platforms with external agencies, animation teams and engineering team to produce design-unified campaigns. \nDesign hand-typed Post-It note size poster for co-workers to resolve their distressed situations Freelance Art Director Pickwick & Weller August 2013  –  February 2014  (7 months) San Francisco Bay Area Freelance Art Director Pickwick & Weller August 2013  –  February 2014  (7 months) San Francisco Bay Area Creative Rockmelt June 2013  –  August 2013  (3 months) Mountainview In charge of concepting and art directing a series of short commercials to promote Rockmelt Android app, online promoting materials on social media channels and S.W.A.G. \nAssist Design team creating motion graphic videos for product development. Creative Rockmelt June 2013  –  August 2013  (3 months) Mountainview In charge of concepting and art directing a series of short commercials to promote Rockmelt Android app, online promoting materials on social media channels and S.W.A.G. \nAssist Design team creating motion graphic videos for product development. Art Director Intern Composition4 September 2012  –  June 2013  (10 months) San Francisco Bay Area Conceptualize creative campaign for clients such as: SF travel and SFPD. \nCreate and present solutions to client Art Director Intern Composition4 September 2012  –  June 2013  (10 months) San Francisco Bay Area Conceptualize creative campaign for clients such as: SF travel and SFPD. \nCreate and present solutions to client Graphic Designer Formation8 June 2012  –  December 2012  (7 months) Palo Alto Work as in-house graphic designer specializing in print materials. \nDesign annual reports, presentations and invitations for events. Graphic Designer Formation8 June 2012  –  December 2012  (7 months) Palo Alto Work as in-house graphic designer specializing in print materials. \nDesign annual reports, presentations and invitations for events. Assistant Photographer Travel Magazine June 2009  –  December 2010  (1 year 7 months) In charge of lighting and staging for fashion and commercial shootings. Managed and \nmaintained photographic equipment for outdoor shooting. Assistant Photographer Travel Magazine June 2009  –  December 2010  (1 year 7 months) In charge of lighting and staging for fashion and commercial shootings. Managed and \nmaintained photographic equipment for outdoor shooting. Junior Graphic Designer Rossett Ltd June 2008  –  August 2009  (1 year 3 months) Managed typographical and photographical styles in poster and business card design for \nclients, such as Techcombank and Marinetime Bank. Made crucial corrections on final designs \nbefore printing. \nLogo design team member in branding project for Vietstar Bank. \n \n Junior Graphic Designer Rossett Ltd June 2008  –  August 2009  (1 year 3 months) Managed typographical and photographical styles in poster and business card design for \nclients, such as Techcombank and Marinetime Bank. Made crucial corrections on final designs \nbefore printing. \nLogo design team member in branding project for Vietstar Bank. \n \n Languages English Vietnamese English Vietnamese English Vietnamese Skills Graphic Design Art Direction Photography Advertising Concept Development Fortune Cookie... Personal Hygiene Skills  Graphic Design Art Direction Photography Advertising Concept Development Fortune Cookie... Personal Hygiene Graphic Design Art Direction Photography Advertising Concept Development Fortune Cookie... Personal Hygiene Graphic Design Art Direction Photography Advertising Concept Development Fortune Cookie... Personal Hygiene Education Academy of Art University M.F.A,  Advertising 2011  – 2014 Central Saint Martin College of Arts and Design B.A. (Honours),  Graphic Design 2008  – 2011 Academy of Art University M.F.A,  Advertising 2011  – 2014 Academy of Art University M.F.A,  Advertising 2011  – 2014 Academy of Art University M.F.A,  Advertising 2011  – 2014 Central Saint Martin College of Arts and Design B.A. (Honours),  Graphic Design 2008  – 2011 Central Saint Martin College of Arts and Design B.A. (Honours),  Graphic Design 2008  – 2011 Central Saint Martin College of Arts and Design B.A. (Honours),  Graphic Design 2008  – 2011 Honors & Awards 2013 One Show Young Ones Winner One Show Young Ones Competition : Integrated Branding Campaign April 2013 http://kaytranad.com/?portfolio=vacation-for-education 2013 One Show Young Ones Winner One Show Young Ones Competition : Non-Traditional Advertising April 2013 http://kaytranad.com/?portfolio=vacation-for-education Creativity International Award 2013 Winner Creativity International Awards: 43rd Media & Interactive Awards May 2013 Change is in the Wind-A campaign for Persil \n \nhttp://kaytranad.com/?portfolio=persil-tree-2 2015 Clio Award Winner Clio Award 2015 June 2015 Yahoo Fantasy Football 2014 Campaign: \"It's Smack Talk Season\" 2013 One Show Young Ones Winner One Show Young Ones Competition : Integrated Branding Campaign April 2013 http://kaytranad.com/?portfolio=vacation-for-education 2013 One Show Young Ones Winner One Show Young Ones Competition : Integrated Branding Campaign April 2013 http://kaytranad.com/?portfolio=vacation-for-education 2013 One Show Young Ones Winner One Show Young Ones Competition : Integrated Branding Campaign April 2013 http://kaytranad.com/?portfolio=vacation-for-education 2013 One Show Young Ones Winner One Show Young Ones Competition : Non-Traditional Advertising April 2013 http://kaytranad.com/?portfolio=vacation-for-education 2013 One Show Young Ones Winner One Show Young Ones Competition : Non-Traditional Advertising April 2013 http://kaytranad.com/?portfolio=vacation-for-education 2013 One Show Young Ones Winner One Show Young Ones Competition : Non-Traditional Advertising April 2013 http://kaytranad.com/?portfolio=vacation-for-education Creativity International Award 2013 Winner Creativity International Awards: 43rd Media & Interactive Awards May 2013 Change is in the Wind-A campaign for Persil \n \nhttp://kaytranad.com/?portfolio=persil-tree-2 Creativity International Award 2013 Winner Creativity International Awards: 43rd Media & Interactive Awards May 2013 Change is in the Wind-A campaign for Persil \n \nhttp://kaytranad.com/?portfolio=persil-tree-2 Creativity International Award 2013 Winner Creativity International Awards: 43rd Media & Interactive Awards May 2013 Change is in the Wind-A campaign for Persil \n \nhttp://kaytranad.com/?portfolio=persil-tree-2 2015 Clio Award Winner Clio Award 2015 June 2015 Yahoo Fantasy Football 2014 Campaign: \"It's Smack Talk Season\" 2015 Clio Award Winner Clio Award 2015 June 2015 Yahoo Fantasy Football 2014 Campaign: \"It's Smack Talk Season\" 2015 Clio Award Winner Clio Award 2015 June 2015 Yahoo Fantasy Football 2014 Campaign: \"It's Smack Talk Season\" ", "Experience Art Director/ Graphic Designer Freelance Graphic Design / Art Direction Services January 2001  – Present (14 years 8 months) Milpitas, CA Presently doing freelance work producing Print Ads, PowerPoint presentations and Marketing materials on a per project basis. Search Editor YAHOO August 2014  –  December 2014  (5 months) Sunnyvale, CA Language Specialist Content Curator/ Welocalize (Apple) Welocalize May 2012  –  May 2014  (2 years 1 month) Cupertino, CA Quality Control: Review and curate iTunes ebook media content to ensure compliance with Apple quality standards and customer expectations. Collaborate with content providers to troubleshoot and resolve production and content-related issues. Verify and correct metadata on books content that is imported into Apple's internal database. Troubleshooting display of books content visible in online bookstores. Senior Art Director The Uhlan Group August 2000  –  July 2004  (4 years) San Jose, CA • Concept and Brand Building \n• Advertising Campaigns \n• Design and Production Management \n• On-site Press Check \n• Print Collateral, Direct Mail, Interactive Presentation. Graphic Designer / Document Control Komag September 1994  –  August 2000  (6 years) San Jose, CA • Interactive Training Production for kiosk \n• Video and Photo Documentation  \n• Machine Concept Drawing  \n• Intranet Web Pages  \n• Designed and Authored Disk Defect Library  \n• Presentation Materials Production for Senior Management Executive Art Director Lowe Lintas and Partners August 1993  –  May 1994  (10 months) Makati, Philippines • Managed Art Department, Art Directors and Final Artists \n• Concept and Brand Building \n• Design and Production Management \n• Attended TV Commercial Pre-production, Shoot, Editing and Post-prod \n• Client Presentation Art Director Basic / Foote, Cone & Belding December 1989  –  July 1993  (3 years 8 months) Makati, Philippines • Managed Art Department, Art Directors and Final Artists \n• Concept and Brand Building \n• Design and Production Management \n• Attended TV Commercial Pre-production, Shoot, Editing and Post-prod \n• Client Presentation Art Director/ Graphic Designer Freelance Graphic Design / Art Direction Services January 2001  – Present (14 years 8 months) Milpitas, CA Presently doing freelance work producing Print Ads, PowerPoint presentations and Marketing materials on a per project basis. Art Director/ Graphic Designer Freelance Graphic Design / Art Direction Services January 2001  – Present (14 years 8 months) Milpitas, CA Presently doing freelance work producing Print Ads, PowerPoint presentations and Marketing materials on a per project basis. Search Editor YAHOO August 2014  –  December 2014  (5 months) Sunnyvale, CA Search Editor YAHOO August 2014  –  December 2014  (5 months) Sunnyvale, CA Language Specialist Content Curator/ Welocalize (Apple) Welocalize May 2012  –  May 2014  (2 years 1 month) Cupertino, CA Quality Control: Review and curate iTunes ebook media content to ensure compliance with Apple quality standards and customer expectations. Collaborate with content providers to troubleshoot and resolve production and content-related issues. Verify and correct metadata on books content that is imported into Apple's internal database. Troubleshooting display of books content visible in online bookstores. Language Specialist Content Curator/ Welocalize (Apple) Welocalize May 2012  –  May 2014  (2 years 1 month) Cupertino, CA Quality Control: Review and curate iTunes ebook media content to ensure compliance with Apple quality standards and customer expectations. Collaborate with content providers to troubleshoot and resolve production and content-related issues. Verify and correct metadata on books content that is imported into Apple's internal database. Troubleshooting display of books content visible in online bookstores. Senior Art Director The Uhlan Group August 2000  –  July 2004  (4 years) San Jose, CA • Concept and Brand Building \n• Advertising Campaigns \n• Design and Production Management \n• On-site Press Check \n• Print Collateral, Direct Mail, Interactive Presentation. Senior Art Director The Uhlan Group August 2000  –  July 2004  (4 years) San Jose, CA • Concept and Brand Building \n• Advertising Campaigns \n• Design and Production Management \n• On-site Press Check \n• Print Collateral, Direct Mail, Interactive Presentation. Graphic Designer / Document Control Komag September 1994  –  August 2000  (6 years) San Jose, CA • Interactive Training Production for kiosk \n• Video and Photo Documentation  \n• Machine Concept Drawing  \n• Intranet Web Pages  \n• Designed and Authored Disk Defect Library  \n• Presentation Materials Production for Senior Management Graphic Designer / Document Control Komag September 1994  –  August 2000  (6 years) San Jose, CA • Interactive Training Production for kiosk \n• Video and Photo Documentation  \n• Machine Concept Drawing  \n• Intranet Web Pages  \n• Designed and Authored Disk Defect Library  \n• Presentation Materials Production for Senior Management Executive Art Director Lowe Lintas and Partners August 1993  –  May 1994  (10 months) Makati, Philippines • Managed Art Department, Art Directors and Final Artists \n• Concept and Brand Building \n• Design and Production Management \n• Attended TV Commercial Pre-production, Shoot, Editing and Post-prod \n• Client Presentation Executive Art Director Lowe Lintas and Partners August 1993  –  May 1994  (10 months) Makati, Philippines • Managed Art Department, Art Directors and Final Artists \n• Concept and Brand Building \n• Design and Production Management \n• Attended TV Commercial Pre-production, Shoot, Editing and Post-prod \n• Client Presentation Art Director Basic / Foote, Cone & Belding December 1989  –  July 1993  (3 years 8 months) Makati, Philippines • Managed Art Department, Art Directors and Final Artists \n• Concept and Brand Building \n• Design and Production Management \n• Attended TV Commercial Pre-production, Shoot, Editing and Post-prod \n• Client Presentation Art Director Basic / Foote, Cone & Belding December 1989  –  July 1993  (3 years 8 months) Makati, Philippines • Managed Art Department, Art Directors and Final Artists \n• Concept and Brand Building \n• Design and Production Management \n• Attended TV Commercial Pre-production, Shoot, Editing and Post-prod \n• Client Presentation Languages English Professional working proficiency Tagalog Native or bilingual proficiency English Professional working proficiency Tagalog Native or bilingual proficiency English Professional working proficiency Tagalog Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Art Direction Photo Art Direction Illustration Graphic Design PowerPoint Visual Communication Photography Corporate Identity Catalogs Posters Banners Art Concept Design Interactive Advertising Creative Direction Adobe Creative Suite Web Design Logo Design Advertising Typography See 5+     See less Skills  Art Direction Photo Art Direction Illustration Graphic Design PowerPoint Visual Communication Photography Corporate Identity Catalogs Posters Banners Art Concept Design Interactive Advertising Creative Direction Adobe Creative Suite Web Design Logo Design Advertising Typography See 5+     See less Art Direction Photo Art Direction Illustration Graphic Design PowerPoint Visual Communication Photography Corporate Identity Catalogs Posters Banners Art Concept Design Interactive Advertising Creative Direction Adobe Creative Suite Web Design Logo Design Advertising Typography See 5+     See less Art Direction Photo Art Direction Illustration Graphic Design PowerPoint Visual Communication Photography Corporate Identity Catalogs Posters Banners Art Concept Design Interactive Advertising Creative Direction Adobe Creative Suite Web Design Logo Design Advertising Typography See 5+     See less Education University of the East BFA,  Advertising 1972  – 1980 University of the East BFA,  Advertising 1972  – 1980 University of the East BFA,  Advertising 1972  – 1980 University of the East BFA,  Advertising 1972  – 1980 ", "Summary Specialties: Design + Art Direction + Illustration + Strategy + Branding / Identity + Packaging + Retail + Campaigns + Story Telling \n \nwww.aliciapompei.com Summary Specialties: Design + Art Direction + Illustration + Strategy + Branding / Identity + Packaging + Retail + Campaigns + Story Telling \n \nwww.aliciapompei.com Specialties: Design + Art Direction + Illustration + Strategy + Branding / Identity + Packaging + Retail + Campaigns + Story Telling \n \nwww.aliciapompei.com Specialties: Design + Art Direction + Illustration + Strategy + Branding / Identity + Packaging + Retail + Campaigns + Story Telling \n \nwww.aliciapompei.com Experience Senior Designer IDEO September 2013  – Present (2 years) San Francisco Bay Area Graphic Designer for the award-winning global design firm that takes a human-centered, design-based approach to helping organizations in the public and private sectors innovate and grow. \n \n**** Please, no résumés, portfolios, internship or career inquiries as I will only redirect you here: http://www.ideo.com/careers Art Director / Designer Freelance Design + Art Direction May 2005  – Present (10 years 4 months) Collaborate with clients ranging from small start-ups to large corporations. \n \nClients: \nChronicle Books \nTwitter \nPottery Barn Teen \nWorkman Publishing Company \nVisually \nABB Ltd. \nShoe Fitr \nSeven Sundays Muesli \nProduct Lexicon \nCraftsman Marketing \nNeat-o-Kiddo Clothing \nConfluence Marketing \nEleven 56 Design \nP.L.A.Y. Lifestyle Art Director / Sr. Visual Designer Twilio June 2012  –  September 2013  (1 year 4 months) San Francisco Bay Area Role included everything from traditional marketing material to web design to help advance Twilio's brand and bring better understanding to APIs, technology, and the future of telephony. Art Director Yahoo! December 2011  –  June 2012  (7 months) Sunnyvale, California Art Director and Graphic Designer for Yahoo!'s internal creative group. Responsible for concept through execution of everything Yahoo! - including their properties, products, and events. \n \nProjects: \n2011 Sundance Film Festival Competition \n2012 Fantasy Football Campaign \n2012 Cannes Lions Presence Art Director / Designer Target September 2010  –  November 2011  (1 year 3 months) Greater Minneapolis-St. Paul Area PROJECT OF NOTE:  \nTeam Lead, Back to College Catalog 2011:  \nDirected a team of designers and copywriters in creating a tabloid-sized catalog marketed at new and returning college students. Publication highlighted both private label and name-brand products for the upcoming school year. Associate Art Director / Designer Target July 2008  –  September 2010  (2 years 3 months) Greater Minneapolis-St. Paul Area Campaign Focus:  \nTarget Diversity, Red and White Branding, and Earth Month  \nMedia: Target gift cards, reusable bags, company store merchandise, packaging \n \nPROJECTS OF NOTE:  \nPlay Wonder Toy Packaging Rebrand: \nRe-branded Target's high-end toy line packaging to have a more whimsical/premium photography style and copy tone. Sales have increased over 20% since redesign. \n \nLiberty of London and Spring 2011 Store Campaign: \nCreated in-store marketing campaign to announce the arrival of Spring andTarget's exclusive limited-time partnership with Liberty of London. Graphic Design Intern Target June 2007  –  August 2007  (3 months) Greater Minneapolis-St. Paul Area Key Licensing Partnerships: Hello Kitty, Ally & AJ, WordWorld, The Hulk Senior Designer IDEO September 2013  – Present (2 years) San Francisco Bay Area Graphic Designer for the award-winning global design firm that takes a human-centered, design-based approach to helping organizations in the public and private sectors innovate and grow. \n \n**** Please, no résumés, portfolios, internship or career inquiries as I will only redirect you here: http://www.ideo.com/careers Senior Designer IDEO September 2013  – Present (2 years) San Francisco Bay Area Graphic Designer for the award-winning global design firm that takes a human-centered, design-based approach to helping organizations in the public and private sectors innovate and grow. \n \n**** Please, no résumés, portfolios, internship or career inquiries as I will only redirect you here: http://www.ideo.com/careers Art Director / Designer Freelance Design + Art Direction May 2005  – Present (10 years 4 months) Collaborate with clients ranging from small start-ups to large corporations. \n \nClients: \nChronicle Books \nTwitter \nPottery Barn Teen \nWorkman Publishing Company \nVisually \nABB Ltd. \nShoe Fitr \nSeven Sundays Muesli \nProduct Lexicon \nCraftsman Marketing \nNeat-o-Kiddo Clothing \nConfluence Marketing \nEleven 56 Design \nP.L.A.Y. Lifestyle Art Director / Designer Freelance Design + Art Direction May 2005  – Present (10 years 4 months) Collaborate with clients ranging from small start-ups to large corporations. \n \nClients: \nChronicle Books \nTwitter \nPottery Barn Teen \nWorkman Publishing Company \nVisually \nABB Ltd. \nShoe Fitr \nSeven Sundays Muesli \nProduct Lexicon \nCraftsman Marketing \nNeat-o-Kiddo Clothing \nConfluence Marketing \nEleven 56 Design \nP.L.A.Y. Lifestyle Art Director / Sr. Visual Designer Twilio June 2012  –  September 2013  (1 year 4 months) San Francisco Bay Area Role included everything from traditional marketing material to web design to help advance Twilio's brand and bring better understanding to APIs, technology, and the future of telephony. Art Director / Sr. Visual Designer Twilio June 2012  –  September 2013  (1 year 4 months) San Francisco Bay Area Role included everything from traditional marketing material to web design to help advance Twilio's brand and bring better understanding to APIs, technology, and the future of telephony. Art Director Yahoo! December 2011  –  June 2012  (7 months) Sunnyvale, California Art Director and Graphic Designer for Yahoo!'s internal creative group. Responsible for concept through execution of everything Yahoo! - including their properties, products, and events. \n \nProjects: \n2011 Sundance Film Festival Competition \n2012 Fantasy Football Campaign \n2012 Cannes Lions Presence Art Director Yahoo! December 2011  –  June 2012  (7 months) Sunnyvale, California Art Director and Graphic Designer for Yahoo!'s internal creative group. Responsible for concept through execution of everything Yahoo! - including their properties, products, and events. \n \nProjects: \n2011 Sundance Film Festival Competition \n2012 Fantasy Football Campaign \n2012 Cannes Lions Presence Art Director / Designer Target September 2010  –  November 2011  (1 year 3 months) Greater Minneapolis-St. Paul Area PROJECT OF NOTE:  \nTeam Lead, Back to College Catalog 2011:  \nDirected a team of designers and copywriters in creating a tabloid-sized catalog marketed at new and returning college students. Publication highlighted both private label and name-brand products for the upcoming school year. Art Director / Designer Target September 2010  –  November 2011  (1 year 3 months) Greater Minneapolis-St. Paul Area PROJECT OF NOTE:  \nTeam Lead, Back to College Catalog 2011:  \nDirected a team of designers and copywriters in creating a tabloid-sized catalog marketed at new and returning college students. Publication highlighted both private label and name-brand products for the upcoming school year. Associate Art Director / Designer Target July 2008  –  September 2010  (2 years 3 months) Greater Minneapolis-St. Paul Area Campaign Focus:  \nTarget Diversity, Red and White Branding, and Earth Month  \nMedia: Target gift cards, reusable bags, company store merchandise, packaging \n \nPROJECTS OF NOTE:  \nPlay Wonder Toy Packaging Rebrand: \nRe-branded Target's high-end toy line packaging to have a more whimsical/premium photography style and copy tone. Sales have increased over 20% since redesign. \n \nLiberty of London and Spring 2011 Store Campaign: \nCreated in-store marketing campaign to announce the arrival of Spring andTarget's exclusive limited-time partnership with Liberty of London. Associate Art Director / Designer Target July 2008  –  September 2010  (2 years 3 months) Greater Minneapolis-St. Paul Area Campaign Focus:  \nTarget Diversity, Red and White Branding, and Earth Month  \nMedia: Target gift cards, reusable bags, company store merchandise, packaging \n \nPROJECTS OF NOTE:  \nPlay Wonder Toy Packaging Rebrand: \nRe-branded Target's high-end toy line packaging to have a more whimsical/premium photography style and copy tone. Sales have increased over 20% since redesign. \n \nLiberty of London and Spring 2011 Store Campaign: \nCreated in-store marketing campaign to announce the arrival of Spring andTarget's exclusive limited-time partnership with Liberty of London. Graphic Design Intern Target June 2007  –  August 2007  (3 months) Greater Minneapolis-St. Paul Area Key Licensing Partnerships: Hello Kitty, Ally & AJ, WordWorld, The Hulk Graphic Design Intern Target June 2007  –  August 2007  (3 months) Greater Minneapolis-St. Paul Area Key Licensing Partnerships: Hello Kitty, Ally & AJ, WordWorld, The Hulk Skills Art Direction Illustration Packaging Catalogs Typography Adobe Creative Suite Creative Strategy Creative Direction Graphic Design Integrated Marketing Logo Design Marketing Web Design Copywriting Advertising Skills  Art Direction Illustration Packaging Catalogs Typography Adobe Creative Suite Creative Strategy Creative Direction Graphic Design Integrated Marketing Logo Design Marketing Web Design Copywriting Advertising Art Direction Illustration Packaging Catalogs Typography Adobe Creative Suite Creative Strategy Creative Direction Graphic Design Integrated Marketing Logo Design Marketing Web Design Copywriting Advertising Art Direction Illustration Packaging Catalogs Typography Adobe Creative Suite Creative Strategy Creative Direction Graphic Design Integrated Marketing Logo Design Marketing Web Design Copywriting Advertising Education Carnegie Mellon University BFA,  Communication (Graphic) Design 2003  – 2008 Activities and Societies:  Recipient of the Fifth Year Scholar Award\nSchool of Design Teaching Assistant\nResident Assistant\nCommunity Adviser\nGLBT Safezone Member\nSexual Assault Adviser\nCareer Center Design Intern\nMember Delta Gamma Sorority\n(Pledge Mom ,  Booth Chair ,  Rho Sigma)\nStudied abroad in Sydney ,  Australia University of New South Wales Semester Abroad 2006 Expanded upon design studies while earning distinctions in graphic design work. Carnegie Mellon University BFA,  Communication (Graphic) Design 2003  – 2008 Activities and Societies:  Recipient of the Fifth Year Scholar Award\nSchool of Design Teaching Assistant\nResident Assistant\nCommunity Adviser\nGLBT Safezone Member\nSexual Assault Adviser\nCareer Center Design Intern\nMember Delta Gamma Sorority\n(Pledge Mom ,  Booth Chair ,  Rho Sigma)\nStudied abroad in Sydney ,  Australia Carnegie Mellon University BFA,  Communication (Graphic) Design 2003  – 2008 Activities and Societies:  Recipient of the Fifth Year Scholar Award\nSchool of Design Teaching Assistant\nResident Assistant\nCommunity Adviser\nGLBT Safezone Member\nSexual Assault Adviser\nCareer Center Design Intern\nMember Delta Gamma Sorority\n(Pledge Mom ,  Booth Chair ,  Rho Sigma)\nStudied abroad in Sydney ,  Australia Carnegie Mellon University BFA,  Communication (Graphic) Design 2003  – 2008 Activities and Societies:  Recipient of the Fifth Year Scholar Award\nSchool of Design Teaching Assistant\nResident Assistant\nCommunity Adviser\nGLBT Safezone Member\nSexual Assault Adviser\nCareer Center Design Intern\nMember Delta Gamma Sorority\n(Pledge Mom ,  Booth Chair ,  Rho Sigma)\nStudied abroad in Sydney ,  Australia University of New South Wales Semester Abroad 2006 Expanded upon design studies while earning distinctions in graphic design work. University of New South Wales Semester Abroad 2006 Expanded upon design studies while earning distinctions in graphic design work. University of New South Wales Semester Abroad 2006 Expanded upon design studies while earning distinctions in graphic design work. Honors & Awards Additional Honors & Awards AIGA Minnesota Annual Show: 2010, 2011, 2012 \nAd Fed \"The Show\" 2010 \nRecipient of inHouse Award: Remarkable Results, 2011 \nUS Patent Award for Product Design \nCarnegie Mellon Dean's List: 2003 - 2007 \nCarnegie Mellon School of Design Service Award: 2007 \nDelta Gamma Beta Nu Sister of the Year Award Additional Honors & Awards AIGA Minnesota Annual Show: 2010, 2011, 2012 \nAd Fed \"The Show\" 2010 \nRecipient of inHouse Award: Remarkable Results, 2011 \nUS Patent Award for Product Design \nCarnegie Mellon Dean's List: 2003 - 2007 \nCarnegie Mellon School of Design Service Award: 2007 \nDelta Gamma Beta Nu Sister of the Year Award Additional Honors & Awards AIGA Minnesota Annual Show: 2010, 2011, 2012 \nAd Fed \"The Show\" 2010 \nRecipient of inHouse Award: Remarkable Results, 2011 \nUS Patent Award for Product Design \nCarnegie Mellon Dean's List: 2003 - 2007 \nCarnegie Mellon School of Design Service Award: 2007 \nDelta Gamma Beta Nu Sister of the Year Award Additional Honors & Awards AIGA Minnesota Annual Show: 2010, 2011, 2012 \nAd Fed \"The Show\" 2010 \nRecipient of inHouse Award: Remarkable Results, 2011 \nUS Patent Award for Product Design \nCarnegie Mellon Dean's List: 2003 - 2007 \nCarnegie Mellon School of Design Service Award: 2007 \nDelta Gamma Beta Nu Sister of the Year Award ", "Summary Creative/Art director with over a decade of experience in show branding and design.  \n \nSpecialties: Creative Direction, Art Direction, Concepting, Motion Graphic Design, After Effects, Photoshop, Illustrator, Branding and Identity, Layout, Web Design, Creative Team Management, Production, Video Production Summary Creative/Art director with over a decade of experience in show branding and design.  \n \nSpecialties: Creative Direction, Art Direction, Concepting, Motion Graphic Design, After Effects, Photoshop, Illustrator, Branding and Identity, Layout, Web Design, Creative Team Management, Production, Video Production Creative/Art director with over a decade of experience in show branding and design.  \n \nSpecialties: Creative Direction, Art Direction, Concepting, Motion Graphic Design, After Effects, Photoshop, Illustrator, Branding and Identity, Layout, Web Design, Creative Team Management, Production, Video Production Creative/Art director with over a decade of experience in show branding and design.  \n \nSpecialties: Creative Direction, Art Direction, Concepting, Motion Graphic Design, After Effects, Photoshop, Illustrator, Branding and Identity, Layout, Web Design, Creative Team Management, Production, Video Production Experience Creative Director, Yahoo Studios Yahoo! September 2011  – Present (4 years) Santa Monica, CA Working with Yahoo! Studios handling creative direction, branding and art direction for all original programming. Creative Director/Owner The Great Escape Club July 2014  – Present (1 year 2 months) Los Angeles, CA - Atwater Village Creative Director/Co-owner of The Great Escape Club, an innovative playspace for children and retreat for adults and caregivers. The Great Escape Club flips the idea of a traditional playroom for children by taking parents’ needs and desires into equal account. The traditional playroom experience is fun for kids but often leaves parents’ and caregivers’ enjoyment out of the equation. The Great Escape Club meets the needs of L.A. families in multiple new ways, offering not only a creative and safe environment for children to explore, but also a haven for adults to relax, find their focus, and socialize—in a dedicated space, designed to inspire tranquillity and help parents re-energize. Art Director \"The Early Show\" CBS News January 2011  –  June 2011  (6 months) Associate Creative Director Aniden Interactive June 2010  –  January 2011  (8 months) Lead Graphics Producer - Last Call with Carson Daly NBC Universal October 2008  –  June 2010  (1 year 9 months) Art Director/Creative Director Ripe Digital Entertainment January 2005  –  October 2008  (3 years 10 months) Founder, Head Designer ATIK Media January 2003  –  January 2005  (2 years 1 month) Editor/Motion Graphic Designer Accelerated Images December 2001  –  June 2003  (1 year 7 months) Creative Director, Yahoo Studios Yahoo! September 2011  – Present (4 years) Santa Monica, CA Working with Yahoo! Studios handling creative direction, branding and art direction for all original programming. Creative Director, Yahoo Studios Yahoo! September 2011  – Present (4 years) Santa Monica, CA Working with Yahoo! Studios handling creative direction, branding and art direction for all original programming. Creative Director/Owner The Great Escape Club July 2014  – Present (1 year 2 months) Los Angeles, CA - Atwater Village Creative Director/Co-owner of The Great Escape Club, an innovative playspace for children and retreat for adults and caregivers. The Great Escape Club flips the idea of a traditional playroom for children by taking parents’ needs and desires into equal account. The traditional playroom experience is fun for kids but often leaves parents’ and caregivers’ enjoyment out of the equation. The Great Escape Club meets the needs of L.A. families in multiple new ways, offering not only a creative and safe environment for children to explore, but also a haven for adults to relax, find their focus, and socialize—in a dedicated space, designed to inspire tranquillity and help parents re-energize. Creative Director/Owner The Great Escape Club July 2014  – Present (1 year 2 months) Los Angeles, CA - Atwater Village Creative Director/Co-owner of The Great Escape Club, an innovative playspace for children and retreat for adults and caregivers. The Great Escape Club flips the idea of a traditional playroom for children by taking parents’ needs and desires into equal account. The traditional playroom experience is fun for kids but often leaves parents’ and caregivers’ enjoyment out of the equation. The Great Escape Club meets the needs of L.A. families in multiple new ways, offering not only a creative and safe environment for children to explore, but also a haven for adults to relax, find their focus, and socialize—in a dedicated space, designed to inspire tranquillity and help parents re-energize. Art Director \"The Early Show\" CBS News January 2011  –  June 2011  (6 months) Art Director \"The Early Show\" CBS News January 2011  –  June 2011  (6 months) Associate Creative Director Aniden Interactive June 2010  –  January 2011  (8 months) Associate Creative Director Aniden Interactive June 2010  –  January 2011  (8 months) Lead Graphics Producer - Last Call with Carson Daly NBC Universal October 2008  –  June 2010  (1 year 9 months) Lead Graphics Producer - Last Call with Carson Daly NBC Universal October 2008  –  June 2010  (1 year 9 months) Art Director/Creative Director Ripe Digital Entertainment January 2005  –  October 2008  (3 years 10 months) Art Director/Creative Director Ripe Digital Entertainment January 2005  –  October 2008  (3 years 10 months) Founder, Head Designer ATIK Media January 2003  –  January 2005  (2 years 1 month) Founder, Head Designer ATIK Media January 2003  –  January 2005  (2 years 1 month) Editor/Motion Graphic Designer Accelerated Images December 2001  –  June 2003  (1 year 7 months) Editor/Motion Graphic Designer Accelerated Images December 2001  –  June 2003  (1 year 7 months) Skills Graphic Design Creative Direction Art Direction Video Production InDesign Corporate Identity Web Design After Effects Illustrator Branding & Identity Multimedia Graphics Logo Design User Interface Design User Experience Social Media Layout Digital Media Motion Graphics Adobe Creative Suite Animation Interaction Design Photography Video Editing Television Integrated Marketing Final Cut Pro Creative Strategy New Media Post Production Video Information Architecture Art Entertainment Film Photoshop Broadcast Advertising Film Production See 24+     See less Skills  Graphic Design Creative Direction Art Direction Video Production InDesign Corporate Identity Web Design After Effects Illustrator Branding & Identity Multimedia Graphics Logo Design User Interface Design User Experience Social Media Layout Digital Media Motion Graphics Adobe Creative Suite Animation Interaction Design Photography Video Editing Television Integrated Marketing Final Cut Pro Creative Strategy New Media Post Production Video Information Architecture Art Entertainment Film Photoshop Broadcast Advertising Film Production See 24+     See less Graphic Design Creative Direction Art Direction Video Production InDesign Corporate Identity Web Design After Effects Illustrator Branding & Identity Multimedia Graphics Logo Design User Interface Design User Experience Social Media Layout Digital Media Motion Graphics Adobe Creative Suite Animation Interaction Design Photography Video Editing Television Integrated Marketing Final Cut Pro Creative Strategy New Media Post Production Video Information Architecture Art Entertainment Film Photoshop Broadcast Advertising Film Production See 24+     See less Graphic Design Creative Direction Art Direction Video Production InDesign Corporate Identity Web Design After Effects Illustrator Branding & Identity Multimedia Graphics Logo Design User Interface Design User Experience Social Media Layout Digital Media Motion Graphics Adobe Creative Suite Animation Interaction Design Photography Video Editing Television Integrated Marketing Final Cut Pro Creative Strategy New Media Post Production Video Information Architecture Art Entertainment Film Photoshop Broadcast Advertising Film Production See 24+     See less Education Art Institute of Atlanta Associate of Art 1999  – 2001 Kennesaw State University English 1998  – 2000 Art Institute of Atlanta Associate of Art 1999  – 2001 Art Institute of Atlanta Associate of Art 1999  – 2001 Art Institute of Atlanta Associate of Art 1999  – 2001 Kennesaw State University English 1998  – 2000 Kennesaw State University English 1998  – 2000 Kennesaw State University English 1998  – 2000 ", "Experience Art Director Yahoo! November 2009  – Present (5 years 10 months) Graphic Designer Seagate Technology February 2007  –  October 2009  (2 years 9 months) Desktop Publisher Getronics Mexico 2003  –  2007  (4 years) Art Director Yahoo! November 2009  – Present (5 years 10 months) Art Director Yahoo! November 2009  – Present (5 years 10 months) Graphic Designer Seagate Technology February 2007  –  October 2009  (2 years 9 months) Graphic Designer Seagate Technology February 2007  –  October 2009  (2 years 9 months) Desktop Publisher Getronics Mexico 2003  –  2007  (4 years) Desktop Publisher Getronics Mexico 2003  –  2007  (4 years) Education Universidad Tecnológica de México Graphic Designer,  Design 1999  – 2003 Universidad Tecnológica de México Graphic Designer,  Design 1999  – 2003 Universidad Tecnológica de México Graphic Designer,  Design 1999  – 2003 Universidad Tecnológica de México Graphic Designer,  Design 1999  – 2003 ", "Experience Art Director at Yahoo Studios Yahoo September 2007  – Present (8 years) Sunnyvale, California Art Director at Yahoo Studios Yahoo September 2007  – Present (8 years) Sunnyvale, California Art Director at Yahoo Studios Yahoo September 2007  – Present (8 years) Sunnyvale, California Languages   Skills Motion Graphics InDesign Cinema 4D After Effects Illustrator Photoshop Digital Photography Final Cut Pro Motion Design Graphic Design Music Production Animation Digital Media Media Production Video Editing Video Production Videography Visual Effects Ross Xpression Streaming Media Post Production Digital Video Web Video Multimedia New Media Final Cut Studio Broadcast Television Avid Media Composer Content Strategy Creative Direction Film Camera Storyboarding Art Direction WordPress Logo Design Interactive Media See 23+     See less Skills  Motion Graphics InDesign Cinema 4D After Effects Illustrator Photoshop Digital Photography Final Cut Pro Motion Design Graphic Design Music Production Animation Digital Media Media Production Video Editing Video Production Videography Visual Effects Ross Xpression Streaming Media Post Production Digital Video Web Video Multimedia New Media Final Cut Studio Broadcast Television Avid Media Composer Content Strategy Creative Direction Film Camera Storyboarding Art Direction WordPress Logo Design Interactive Media See 23+     See less Motion Graphics InDesign Cinema 4D After Effects Illustrator Photoshop Digital Photography Final Cut Pro Motion Design Graphic Design Music Production Animation Digital Media Media Production Video Editing Video Production Videography Visual Effects Ross Xpression Streaming Media Post Production Digital Video Web Video Multimedia New Media Final Cut Studio Broadcast Television Avid Media Composer Content Strategy Creative Direction Film Camera Storyboarding Art Direction WordPress Logo Design Interactive Media See 23+     See less Motion Graphics InDesign Cinema 4D After Effects Illustrator Photoshop Digital Photography Final Cut Pro Motion Design Graphic Design Music Production Animation Digital Media Media Production Video Editing Video Production Videography Visual Effects Ross Xpression Streaming Media Post Production Digital Video Web Video Multimedia New Media Final Cut Studio Broadcast Television Avid Media Composer Content Strategy Creative Direction Film Camera Storyboarding Art Direction WordPress Logo Design Interactive Media See 23+     See less Education State University of New York at Buffalo Master of Fine Arts (MFA) 2003  – 2007 Yonsei University Bachelor of Science (BS) 1992  – 1997 State University of New York at Buffalo Master of Fine Arts (MFA) 2003  – 2007 State University of New York at Buffalo Master of Fine Arts (MFA) 2003  – 2007 State University of New York at Buffalo Master of Fine Arts (MFA) 2003  – 2007 Yonsei University Bachelor of Science (BS) 1992  – 1997 Yonsei University Bachelor of Science (BS) 1992  – 1997 Yonsei University Bachelor of Science (BS) 1992  – 1997 ", "Experience Art Director at Yahoo! Style Yahoo August 2014  – Present (1 year 1 month) Art Director DuJour April 2012  –  November 2014  (2 years 8 months) Greater New York City Area Art Director at Elle.com ELLE Magazine August 2010  –  April 2012  (1 year 9 months) Greater New York City Area Art Director at Yahoo! Style Yahoo August 2014  – Present (1 year 1 month) Art Director at Yahoo! Style Yahoo August 2014  – Present (1 year 1 month) Art Director DuJour April 2012  –  November 2014  (2 years 8 months) Greater New York City Area Art Director DuJour April 2012  –  November 2014  (2 years 8 months) Greater New York City Area Art Director at Elle.com ELLE Magazine August 2010  –  April 2012  (1 year 9 months) Greater New York City Area Art Director at Elle.com ELLE Magazine August 2010  –  April 2012  (1 year 9 months) Greater New York City Area Skills Photoshop Illustrator InDesign Graphic Design Web Design Typography Illustration Logo Design Layout Photography Creative Development Art Direction Creative Direction Concept Development Image Manipulation Art Mac Catalogs Corporate Identity See 4+     See less Skills  Photoshop Illustrator InDesign Graphic Design Web Design Typography Illustration Logo Design Layout Photography Creative Development Art Direction Creative Direction Concept Development Image Manipulation Art Mac Catalogs Corporate Identity See 4+     See less Photoshop Illustrator InDesign Graphic Design Web Design Typography Illustration Logo Design Layout Photography Creative Development Art Direction Creative Direction Concept Development Image Manipulation Art Mac Catalogs Corporate Identity See 4+     See less Photoshop Illustrator InDesign Graphic Design Web Design Typography Illustration Logo Design Layout Photography Creative Development Art Direction Creative Direction Concept Development Image Manipulation Art Mac Catalogs Corporate Identity See 4+     See less Education Texas Christian University BFA,  Graphic Design Activities and Societies:  Track & Field Texas Christian University BFA,  Graphic Design Activities and Societies:  Track & Field Texas Christian University BFA,  Graphic Design Activities and Societies:  Track & Field Texas Christian University BFA,  Graphic Design Activities and Societies:  Track & Field ", "Summary CD/AD to top advertising agencies; archival photographer to museums, publications and historical preservation societies. Summary CD/AD to top advertising agencies; archival photographer to museums, publications and historical preservation societies. CD/AD to top advertising agencies; archival photographer to museums, publications and historical preservation societies. CD/AD to top advertising agencies; archival photographer to museums, publications and historical preservation societies. Experience Owner Jeremy Blakeslee Photography August 2002  – Present (13 years 1 month) San Francisco Bay Area www.jeremyblakesleephoto.com Art Director/Creative Director Freelance 2001  – Present (14 years) san francisco bay area Freelance Creative Director Yahoo December 2014  –  July 2015  (8 months) San Francisco Bay Area Architectural Photographer San Francisco Architectural Heritage 2012  –  2015  (3 years) San Francisco Bay Area Ongoing preservation work Architectural Photographer National Trust for HIstoric Preservation 2010  –  2015  (5 years) Ongoing photographic preservation work Freelance Creative Director Fathom Communications October 2014  –  December 2014  (3 months) New York City Freelance Creative Director - Art Razorfish July 2014  –  August 2014  (2 months) san francisco bay area Pitched and won Qualcomm Freelance Creative Director Free Range Studios July 2014  –  July 2014  (1 month) san francisco bay area Freelance Art Director / ACD Grey San Francisco February 2014  –  May 2014  (4 months) San Francisco Bay Area Norton Freelance Art Director / ACD Geometry Global January 2014  –  January 2014  (1 month) San Francisco Pitched and won (retained) Flexjet. Established new brand direction. Photographer Best Made Company 2010  –  2014  (4 years) New York City Ongoing photo essays Freelance Art Director / ACD DigitasLBi September 2013  –  November 2013  (3 months) San Francisco Bay Area Launched Ebay 3.0 Senior Art Director :: Digital Sephora 2012  –  2013  (1 year) San Francisco Bay Area Senior Art Director Venables Bell and Partners 2012  –  2012  (less than a year) San Francisco Bay Area Intel Senior Art Director Crispin Porter + Bogusky 2011  –  2012  (1 year) Toronto Tourism, Groupon, Molson Senior Art Director TAXI 2011  –  2011  (less than a year) Telus Senior Art Director JWT NY 2011  –  2011  (less than a year) New York City Tony & Guy Hair Tailors Photographer National Park Service 2011  –  2011  (less than a year) San Francisco Bay Area Ongoing Freelance Photographer MIT Technology Review 2011  –  2011  (less than a year) Senior Art Director Lowe Roche 2010  –  2010  (less than a year) Toronto, Canada Area Crystal Head Vodka, Miela, Magnum Ice Cream and Purina Architectural Photographer The National Museum of Industrial History 2003  –  2010  (7 years) Bethlehem, Pennsylvania ongoing Interactive Art Director Young & Rubicam NY 2008  –  2009  (1 year) New York, NY Accenture, Sears, Rubbermaid and LG. Interactive Art Director Euro RSCG NY 2008  –  2009  (1 year) New York City Jaguar Freelance Graphic Designer Print Magazine 2007  –  2007  (less than a year) New York City Art Director Bartle Bogle Hegarty NY 2005  –  2007  (2 years) New York City City of New York, Mentos, SoBe Art Director The VOX Collective 2002  –  2005  (3 years) New York City Motorola, General Motors, UNICEF, Arts International Owner Jeremy Blakeslee Photography August 2002  – Present (13 years 1 month) San Francisco Bay Area www.jeremyblakesleephoto.com Owner Jeremy Blakeslee Photography August 2002  – Present (13 years 1 month) San Francisco Bay Area www.jeremyblakesleephoto.com Art Director/Creative Director Freelance 2001  – Present (14 years) san francisco bay area Art Director/Creative Director Freelance 2001  – Present (14 years) san francisco bay area Freelance Creative Director Yahoo December 2014  –  July 2015  (8 months) San Francisco Bay Area Freelance Creative Director Yahoo December 2014  –  July 2015  (8 months) San Francisco Bay Area Architectural Photographer San Francisco Architectural Heritage 2012  –  2015  (3 years) San Francisco Bay Area Ongoing preservation work Architectural Photographer San Francisco Architectural Heritage 2012  –  2015  (3 years) San Francisco Bay Area Ongoing preservation work Architectural Photographer National Trust for HIstoric Preservation 2010  –  2015  (5 years) Ongoing photographic preservation work Architectural Photographer National Trust for HIstoric Preservation 2010  –  2015  (5 years) Ongoing photographic preservation work Freelance Creative Director Fathom Communications October 2014  –  December 2014  (3 months) New York City Freelance Creative Director Fathom Communications October 2014  –  December 2014  (3 months) New York City Freelance Creative Director - Art Razorfish July 2014  –  August 2014  (2 months) san francisco bay area Pitched and won Qualcomm Freelance Creative Director - Art Razorfish July 2014  –  August 2014  (2 months) san francisco bay area Pitched and won Qualcomm Freelance Creative Director Free Range Studios July 2014  –  July 2014  (1 month) san francisco bay area Freelance Creative Director Free Range Studios July 2014  –  July 2014  (1 month) san francisco bay area Freelance Art Director / ACD Grey San Francisco February 2014  –  May 2014  (4 months) San Francisco Bay Area Norton Freelance Art Director / ACD Grey San Francisco February 2014  –  May 2014  (4 months) San Francisco Bay Area Norton Freelance Art Director / ACD Geometry Global January 2014  –  January 2014  (1 month) San Francisco Pitched and won (retained) Flexjet. Established new brand direction. Freelance Art Director / ACD Geometry Global January 2014  –  January 2014  (1 month) San Francisco Pitched and won (retained) Flexjet. Established new brand direction. Photographer Best Made Company 2010  –  2014  (4 years) New York City Ongoing photo essays Photographer Best Made Company 2010  –  2014  (4 years) New York City Ongoing photo essays Freelance Art Director / ACD DigitasLBi September 2013  –  November 2013  (3 months) San Francisco Bay Area Launched Ebay 3.0 Freelance Art Director / ACD DigitasLBi September 2013  –  November 2013  (3 months) San Francisco Bay Area Launched Ebay 3.0 Senior Art Director :: Digital Sephora 2012  –  2013  (1 year) San Francisco Bay Area Senior Art Director :: Digital Sephora 2012  –  2013  (1 year) San Francisco Bay Area Senior Art Director Venables Bell and Partners 2012  –  2012  (less than a year) San Francisco Bay Area Intel Senior Art Director Venables Bell and Partners 2012  –  2012  (less than a year) San Francisco Bay Area Intel Senior Art Director Crispin Porter + Bogusky 2011  –  2012  (1 year) Toronto Tourism, Groupon, Molson Senior Art Director Crispin Porter + Bogusky 2011  –  2012  (1 year) Toronto Tourism, Groupon, Molson Senior Art Director TAXI 2011  –  2011  (less than a year) Telus Senior Art Director TAXI 2011  –  2011  (less than a year) Telus Senior Art Director JWT NY 2011  –  2011  (less than a year) New York City Tony & Guy Hair Tailors Senior Art Director JWT NY 2011  –  2011  (less than a year) New York City Tony & Guy Hair Tailors Photographer National Park Service 2011  –  2011  (less than a year) San Francisco Bay Area Ongoing Photographer National Park Service 2011  –  2011  (less than a year) San Francisco Bay Area Ongoing Freelance Photographer MIT Technology Review 2011  –  2011  (less than a year) Freelance Photographer MIT Technology Review 2011  –  2011  (less than a year) Senior Art Director Lowe Roche 2010  –  2010  (less than a year) Toronto, Canada Area Crystal Head Vodka, Miela, Magnum Ice Cream and Purina Senior Art Director Lowe Roche 2010  –  2010  (less than a year) Toronto, Canada Area Crystal Head Vodka, Miela, Magnum Ice Cream and Purina Architectural Photographer The National Museum of Industrial History 2003  –  2010  (7 years) Bethlehem, Pennsylvania ongoing Architectural Photographer The National Museum of Industrial History 2003  –  2010  (7 years) Bethlehem, Pennsylvania ongoing Interactive Art Director Young & Rubicam NY 2008  –  2009  (1 year) New York, NY Accenture, Sears, Rubbermaid and LG. Interactive Art Director Young & Rubicam NY 2008  –  2009  (1 year) New York, NY Accenture, Sears, Rubbermaid and LG. Interactive Art Director Euro RSCG NY 2008  –  2009  (1 year) New York City Jaguar Interactive Art Director Euro RSCG NY 2008  –  2009  (1 year) New York City Jaguar Freelance Graphic Designer Print Magazine 2007  –  2007  (less than a year) New York City Freelance Graphic Designer Print Magazine 2007  –  2007  (less than a year) New York City Art Director Bartle Bogle Hegarty NY 2005  –  2007  (2 years) New York City City of New York, Mentos, SoBe Art Director Bartle Bogle Hegarty NY 2005  –  2007  (2 years) New York City City of New York, Mentos, SoBe Art Director The VOX Collective 2002  –  2005  (3 years) New York City Motorola, General Motors, UNICEF, Arts International Art Director The VOX Collective 2002  –  2005  (3 years) New York City Motorola, General Motors, UNICEF, Arts International Languages English English English Skills Photography Art Direction Advertising Fine Art Photography Creative Strategy Graphic Design Social Media Broadcast Interactive Advertising Creative Direction Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 15+     See less Skills  Photography Art Direction Advertising Fine Art Photography Creative Strategy Graphic Design Social Media Broadcast Interactive Advertising Creative Direction Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 15+     See less Photography Art Direction Advertising Fine Art Photography Creative Strategy Graphic Design Social Media Broadcast Interactive Advertising Creative Direction Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 15+     See less Photography Art Direction Advertising Fine Art Photography Creative Strategy Graphic Design Social Media Broadcast Interactive Advertising Creative Direction Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 15+     See less Education School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club Honors & Awards Additional Honors & Awards Yes, but its not polite to brag. Additional Honors & Awards Yes, but its not polite to brag. Additional Honors & Awards Yes, but its not polite to brag. Additional Honors & Awards Yes, but its not polite to brag. ", "Summary Photo Editor | Photo Art Director | Photographer \nCollaborates with a global network of media brands, photo agencies and photographers.  \nContent management, photo research, brand identity and photography strategy \nCreative and trend research \nDigital asset management \nMobile content development and media curation \nImage licensing and copyright infringement \nPhotography production relations and location scouting Summary Photo Editor | Photo Art Director | Photographer \nCollaborates with a global network of media brands, photo agencies and photographers.  \nContent management, photo research, brand identity and photography strategy \nCreative and trend research \nDigital asset management \nMobile content development and media curation \nImage licensing and copyright infringement \nPhotography production relations and location scouting Photo Editor | Photo Art Director | Photographer \nCollaborates with a global network of media brands, photo agencies and photographers.  \nContent management, photo research, brand identity and photography strategy \nCreative and trend research \nDigital asset management \nMobile content development and media curation \nImage licensing and copyright infringement \nPhotography production relations and location scouting Photo Editor | Photo Art Director | Photographer \nCollaborates with a global network of media brands, photo agencies and photographers.  \nContent management, photo research, brand identity and photography strategy \nCreative and trend research \nDigital asset management \nMobile content development and media curation \nImage licensing and copyright infringement \nPhotography production relations and location scouting Skills Skills     ", "Summary I am an art director eager to give life to new projects and ideas! Born in Nicaragua (nod and act like you know where that is) Although I can’t really tell how I ended up here, here I am, growing and learning out of myself and enthusiastic about my career path.  \n \nI am also a tireless seeker of knowledge, passionate storyteller through design and fervent lover of digital platforms. I’ve never been sick of the past but I’m healthier in the present. I love food, feel in colors and breathe design. Summary I am an art director eager to give life to new projects and ideas! Born in Nicaragua (nod and act like you know where that is) Although I can’t really tell how I ended up here, here I am, growing and learning out of myself and enthusiastic about my career path.  \n \nI am also a tireless seeker of knowledge, passionate storyteller through design and fervent lover of digital platforms. I’ve never been sick of the past but I’m healthier in the present. I love food, feel in colors and breathe design. I am an art director eager to give life to new projects and ideas! Born in Nicaragua (nod and act like you know where that is) Although I can’t really tell how I ended up here, here I am, growing and learning out of myself and enthusiastic about my career path.  \n \nI am also a tireless seeker of knowledge, passionate storyteller through design and fervent lover of digital platforms. I’ve never been sick of the past but I’m healthier in the present. I love food, feel in colors and breathe design. I am an art director eager to give life to new projects and ideas! Born in Nicaragua (nod and act like you know where that is) Although I can’t really tell how I ended up here, here I am, growing and learning out of myself and enthusiastic about my career path.  \n \nI am also a tireless seeker of knowledge, passionate storyteller through design and fervent lover of digital platforms. I’ve never been sick of the past but I’m healthier in the present. I love food, feel in colors and breathe design. Experience Jr. Visual Designer Glassdoor July 2015  – Present (2 months) Jr. Art Director Yahoo November 2014  – Present (10 months) Freelance Jr. Art Director Geometry Global September 2014  –  October 2014  (2 months) San Francisco Bay Area Student Savannah College of Art and Design March 2010  –  May 2014  (4 years 3 months) Graduate at SCAD with a BFA in Advertising Intern Target Ogilvy June 2013  –  August 2013  (3 months) Managua, Nicaragua Jr. Visual Designer Glassdoor July 2015  – Present (2 months) Jr. Visual Designer Glassdoor July 2015  – Present (2 months) Jr. Art Director Yahoo November 2014  – Present (10 months) Jr. Art Director Yahoo November 2014  – Present (10 months) Freelance Jr. Art Director Geometry Global September 2014  –  October 2014  (2 months) San Francisco Bay Area Freelance Jr. Art Director Geometry Global September 2014  –  October 2014  (2 months) San Francisco Bay Area Student Savannah College of Art and Design March 2010  –  May 2014  (4 years 3 months) Graduate at SCAD with a BFA in Advertising Student Savannah College of Art and Design March 2010  –  May 2014  (4 years 3 months) Graduate at SCAD with a BFA in Advertising Intern Target Ogilvy June 2013  –  August 2013  (3 months) Managua, Nicaragua Intern Target Ogilvy June 2013  –  August 2013  (3 months) Managua, Nicaragua Languages Spanish English Spanish English Spanish English Skills Photoshop Illustrator Microsoft Office Research InDesign PowerPoint Adobe Creative Suite Higher Education Microsoft Word Public Speaking Social Media Drawing Microsoft Excel After Effects Sketching Communication Skills See 1+     See less Skills  Photoshop Illustrator Microsoft Office Research InDesign PowerPoint Adobe Creative Suite Higher Education Microsoft Word Public Speaking Social Media Drawing Microsoft Excel After Effects Sketching Communication Skills See 1+     See less Photoshop Illustrator Microsoft Office Research InDesign PowerPoint Adobe Creative Suite Higher Education Microsoft Word Public Speaking Social Media Drawing Microsoft Excel After Effects Sketching Communication Skills See 1+     See less Photoshop Illustrator Microsoft Office Research InDesign PowerPoint Adobe Creative Suite Higher Education Microsoft Word Public Speaking Social Media Drawing Microsoft Excel After Effects Sketching Communication Skills See 1+     See less Education Savannah College of Art and Design Bachelor of Fine Arts (BFA),  Advertising 2011  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (B.F.A.) ,  Advertising 2010  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (BFA),  Advertising 2011  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (BFA),  Advertising 2011  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (BFA),  Advertising 2011  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (B.F.A.) ,  Advertising 2010  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (B.F.A.) ,  Advertising 2010  – 2014 Savannah College of Art and Design Bachelor of Fine Arts (B.F.A.) ,  Advertising 2010  – 2014 ", "Summary Provide marketing & advertising services as: \n \nArt direction \nCopy-writingvent \nDesign \nDigital marketing \nEvent \nStill shooting \nStrategy consultant \nTranslation \nTVC Specialties:More than 5 years experiences in marketing & advertising industry. Summary Provide marketing & advertising services as: \n \nArt direction \nCopy-writingvent \nDesign \nDigital marketing \nEvent \nStill shooting \nStrategy consultant \nTranslation \nTVC Specialties:More than 5 years experiences in marketing & advertising industry. Provide marketing & advertising services as: \n \nArt direction \nCopy-writingvent \nDesign \nDigital marketing \nEvent \nStill shooting \nStrategy consultant \nTranslation \nTVC Specialties:More than 5 years experiences in marketing & advertising industry. Provide marketing & advertising services as: \n \nArt direction \nCopy-writingvent \nDesign \nDigital marketing \nEvent \nStill shooting \nStrategy consultant \nTranslation \nTVC Specialties:More than 5 years experiences in marketing & advertising industry. Experience Owner OTB Freelancer group January 2009  – Present (6 years 8 months) We're offering freelancer service in copy-writing, translating, design, art, photography, digital marketing...  \n \nDon't want to get more headcount to finish your urgent project? A freelancer will be your perfect solution. Just ask us! Creative Director, Senior Copywriter, Art Director, Senior Designer, Visualizer JWT, Lowe, O&M, Asatsu, Chuo Senko, Yahoo! January 2009  – Present (6 years 8 months) Our freelancers are from these well-known agency as JWT, Dentsu, Lowe, Asatsu DK, Chuo Senko, Yahoo!... Marketing services Chuo Senko Agency. April 2000  –  November 2008  (8 years 8 months) Provide marketing, brand campaign services. Owner OTB Freelancer group January 2009  – Present (6 years 8 months) We're offering freelancer service in copy-writing, translating, design, art, photography, digital marketing...  \n \nDon't want to get more headcount to finish your urgent project? A freelancer will be your perfect solution. Just ask us! Owner OTB Freelancer group January 2009  – Present (6 years 8 months) We're offering freelancer service in copy-writing, translating, design, art, photography, digital marketing...  \n \nDon't want to get more headcount to finish your urgent project? A freelancer will be your perfect solution. Just ask us! Creative Director, Senior Copywriter, Art Director, Senior Designer, Visualizer JWT, Lowe, O&M, Asatsu, Chuo Senko, Yahoo! January 2009  – Present (6 years 8 months) Our freelancers are from these well-known agency as JWT, Dentsu, Lowe, Asatsu DK, Chuo Senko, Yahoo!... Creative Director, Senior Copywriter, Art Director, Senior Designer, Visualizer JWT, Lowe, O&M, Asatsu, Chuo Senko, Yahoo! January 2009  – Present (6 years 8 months) Our freelancers are from these well-known agency as JWT, Dentsu, Lowe, Asatsu DK, Chuo Senko, Yahoo!... Marketing services Chuo Senko Agency. April 2000  –  November 2008  (8 years 8 months) Provide marketing, brand campaign services. Marketing services Chuo Senko Agency. April 2000  –  November 2008  (8 years 8 months) Provide marketing, brand campaign services. ", "Skills Advertising Photoshop Adobe Creative Suite Digital Marketing Illustrator Pre-press Graphics Brochures Online Marketing Brand Development Illustration Typography QuarkXPress Web Development Creative Direction Art Direction Web Design Corporate Identity Mac See 4+     See less Skills  Advertising Photoshop Adobe Creative Suite Digital Marketing Illustrator Pre-press Graphics Brochures Online Marketing Brand Development Illustration Typography QuarkXPress Web Development Creative Direction Art Direction Web Design Corporate Identity Mac See 4+     See less Advertising Photoshop Adobe Creative Suite Digital Marketing Illustrator Pre-press Graphics Brochures Online Marketing Brand Development Illustration Typography QuarkXPress Web Development Creative Direction Art Direction Web Design Corporate Identity Mac See 4+     See less Advertising Photoshop Adobe Creative Suite Digital Marketing Illustrator Pre-press Graphics Brochures Online Marketing Brand Development Illustration Typography QuarkXPress Web Development Creative Direction Art Direction Web Design Corporate Identity Mac See 4+     See less ", "Skills Typography Art Direction Interaction Design Graphic Design Corporate Identity Logo Design Web Design Photoshop Illustrator Dreamweaver Illustration InDesign Advertising Brochures QuarkXPress Online Advertising Layout Mac Logos Mobile Creative Direction User Experience Art Creative Strategy Concept Development Branding & Identity Brand Development Motion Graphics Information Architecture Mobile Devices See 15+     See less Skills  Typography Art Direction Interaction Design Graphic Design Corporate Identity Logo Design Web Design Photoshop Illustrator Dreamweaver Illustration InDesign Advertising Brochures QuarkXPress Online Advertising Layout Mac Logos Mobile Creative Direction User Experience Art Creative Strategy Concept Development Branding & Identity Brand Development Motion Graphics Information Architecture Mobile Devices See 15+     See less Typography Art Direction Interaction Design Graphic Design Corporate Identity Logo Design Web Design Photoshop Illustrator Dreamweaver Illustration InDesign Advertising Brochures QuarkXPress Online Advertising Layout Mac Logos Mobile Creative Direction User Experience Art Creative Strategy Concept Development Branding & Identity Brand Development Motion Graphics Information Architecture Mobile Devices See 15+     See less Typography Art Direction Interaction Design Graphic Design Corporate Identity Logo Design Web Design Photoshop Illustrator Dreamweaver Illustration InDesign Advertising Brochures QuarkXPress Online Advertising Layout Mac Logos Mobile Creative Direction User Experience Art Creative Strategy Concept Development Branding & Identity Brand Development Motion Graphics Information Architecture Mobile Devices See 15+     See less ", "Experience Set Decorating Buyer Danny Boyle feature STEVE JOBS December 2014  – Present (9 months) San Francisco Producer and Creator Maker's Inc. May 2014  – Present (1 year 4 months) Oakland, CA I'm creating a documentary series about makers, artists and innovators in the Bay Area. \nI oversee casting, budget, crew, writing, filming and editing. Freelance Writer Oakland Local. Lucie's List. The Yolk. April 2014  – Present (1 year 5 months) Oakland, CA 2nd-round finalist in Austin Film Festival and semi-finalist in Beverly Hills Screenwriting Contest. \n Freelance Art Director and Set Decorator Yahoo Studios, Mekanism, Warner Bros. October 2013  – Present (1 year 11 months) Greater Bay Area Projects include Yahoo's live webcast shows: The Oscars, Quarterly Earnings Reports, Divergent Movie Premier, Golden Globe and Grammy Shows.  \n \nCommercial/Marketing recent projects include: Toyota Japan and Nordstrom's Gift Box in Union Square.  \n \nRecent film project: Assistant Set Decorator on Warner Bros. 'San Andreas' filmed in San Francisco. Marketing & Social Media Director, Co-Founder Mothership HackerMoms August 2011  –  October 2013  (2 years 3 months) Berkeley, CA I created HackerMom's successful Kickstarter video overseeing a team of filmmakers. I spearheaded the 125% funded Kickstarter's social media and press campaign. I also managed the website, social media, branding strategy, fundraising and press for the organization. Press included featured stories in Wired, Fast Company, Oakland Magazine and The San Francisco Chronicle. \n \nThe winner of SF/Bay Guardian's 'Small Business Award for Women,' Mothership HackerMoms is the first women's hackerspace in the world. Founded by mothers, The Mothership offers DIY/maker culture, workshops, tools, equipment, business support, community and affordable on-site childcare. Set Decorator on TV series HUNG HBO January 2010  –  July 2010  (7 months) Los Angeles I resourced, purchased and selected charcter-driven props, set dressing and furniture. \nI forecast and supervised my departments' budget.  \nI managed resources for the design and fabrication of custom props and graphics. \nI brokered product placement deals with outside vendors.  \nI managed set dressing crews, including drapery persons, a lead person, buyers and set dressers.  \nI oversaw the dressing of sets with my team.  \nI collaborated with Production Designers, Producers and Directors on location scouts and creative meetings to determine the look and feel of a project. Set Decorator on feature film EASY A Sony Pictures Entertainment May 2009  –  November 2009  (7 months) Ojai, CA Set Decorator on series pilot MEN OF A CERTAIN AGE TNT February 2009  –  April 2009  (3 months) Freelance Prop Stylist. Tommy Hilfiger Magazine Shoot January 2009  –  January 2009  (1 month) Set Decorator on feature film The SQUEAKQUEL Fox Filmed Entertainment August 2008  –  December 2008  (5 months) Freelance Set Decorator & Buyer, Owner Film, TV and Commercial Projects January 1995  –  November 2008  (13 years 11 months) FEATURES & TV include: \nDrowning Mona, Kingdom Come, Las Vegas, Fired Up, American Pie2, The Big Lebowski, Being John Malkovich, Dreams May Come, GI Jane, Dead Man, Waiting to Exhale, Tank Girl. \n \nCOMMERCIALS: Visa, Monster.com, AT&T, Sony, Motorola, Desperate Housewives... the list is long! \nDirectors: Joe Pytka, Jeff Preiss, David LaChapelle.  \nDesigners: Randall Peacock, Juliane Laverne, John Hutman, Jennifer Davis. Set Decorating Buyer Danny Boyle feature STEVE JOBS December 2014  – Present (9 months) San Francisco Set Decorating Buyer Danny Boyle feature STEVE JOBS December 2014  – Present (9 months) San Francisco Producer and Creator Maker's Inc. May 2014  – Present (1 year 4 months) Oakland, CA I'm creating a documentary series about makers, artists and innovators in the Bay Area. \nI oversee casting, budget, crew, writing, filming and editing. Producer and Creator Maker's Inc. May 2014  – Present (1 year 4 months) Oakland, CA I'm creating a documentary series about makers, artists and innovators in the Bay Area. \nI oversee casting, budget, crew, writing, filming and editing. Freelance Writer Oakland Local. Lucie's List. The Yolk. April 2014  – Present (1 year 5 months) Oakland, CA 2nd-round finalist in Austin Film Festival and semi-finalist in Beverly Hills Screenwriting Contest. \n Freelance Writer Oakland Local. Lucie's List. The Yolk. April 2014  – Present (1 year 5 months) Oakland, CA 2nd-round finalist in Austin Film Festival and semi-finalist in Beverly Hills Screenwriting Contest. \n Freelance Art Director and Set Decorator Yahoo Studios, Mekanism, Warner Bros. October 2013  – Present (1 year 11 months) Greater Bay Area Projects include Yahoo's live webcast shows: The Oscars, Quarterly Earnings Reports, Divergent Movie Premier, Golden Globe and Grammy Shows.  \n \nCommercial/Marketing recent projects include: Toyota Japan and Nordstrom's Gift Box in Union Square.  \n \nRecent film project: Assistant Set Decorator on Warner Bros. 'San Andreas' filmed in San Francisco. Freelance Art Director and Set Decorator Yahoo Studios, Mekanism, Warner Bros. October 2013  – Present (1 year 11 months) Greater Bay Area Projects include Yahoo's live webcast shows: The Oscars, Quarterly Earnings Reports, Divergent Movie Premier, Golden Globe and Grammy Shows.  \n \nCommercial/Marketing recent projects include: Toyota Japan and Nordstrom's Gift Box in Union Square.  \n \nRecent film project: Assistant Set Decorator on Warner Bros. 'San Andreas' filmed in San Francisco. Marketing & Social Media Director, Co-Founder Mothership HackerMoms August 2011  –  October 2013  (2 years 3 months) Berkeley, CA I created HackerMom's successful Kickstarter video overseeing a team of filmmakers. I spearheaded the 125% funded Kickstarter's social media and press campaign. I also managed the website, social media, branding strategy, fundraising and press for the organization. Press included featured stories in Wired, Fast Company, Oakland Magazine and The San Francisco Chronicle. \n \nThe winner of SF/Bay Guardian's 'Small Business Award for Women,' Mothership HackerMoms is the first women's hackerspace in the world. Founded by mothers, The Mothership offers DIY/maker culture, workshops, tools, equipment, business support, community and affordable on-site childcare. Marketing & Social Media Director, Co-Founder Mothership HackerMoms August 2011  –  October 2013  (2 years 3 months) Berkeley, CA I created HackerMom's successful Kickstarter video overseeing a team of filmmakers. I spearheaded the 125% funded Kickstarter's social media and press campaign. I also managed the website, social media, branding strategy, fundraising and press for the organization. Press included featured stories in Wired, Fast Company, Oakland Magazine and The San Francisco Chronicle. \n \nThe winner of SF/Bay Guardian's 'Small Business Award for Women,' Mothership HackerMoms is the first women's hackerspace in the world. Founded by mothers, The Mothership offers DIY/maker culture, workshops, tools, equipment, business support, community and affordable on-site childcare. Set Decorator on TV series HUNG HBO January 2010  –  July 2010  (7 months) Los Angeles I resourced, purchased and selected charcter-driven props, set dressing and furniture. \nI forecast and supervised my departments' budget.  \nI managed resources for the design and fabrication of custom props and graphics. \nI brokered product placement deals with outside vendors.  \nI managed set dressing crews, including drapery persons, a lead person, buyers and set dressers.  \nI oversaw the dressing of sets with my team.  \nI collaborated with Production Designers, Producers and Directors on location scouts and creative meetings to determine the look and feel of a project. Set Decorator on TV series HUNG HBO January 2010  –  July 2010  (7 months) Los Angeles I resourced, purchased and selected charcter-driven props, set dressing and furniture. \nI forecast and supervised my departments' budget.  \nI managed resources for the design and fabrication of custom props and graphics. \nI brokered product placement deals with outside vendors.  \nI managed set dressing crews, including drapery persons, a lead person, buyers and set dressers.  \nI oversaw the dressing of sets with my team.  \nI collaborated with Production Designers, Producers and Directors on location scouts and creative meetings to determine the look and feel of a project. Set Decorator on feature film EASY A Sony Pictures Entertainment May 2009  –  November 2009  (7 months) Ojai, CA Set Decorator on feature film EASY A Sony Pictures Entertainment May 2009  –  November 2009  (7 months) Ojai, CA Set Decorator on series pilot MEN OF A CERTAIN AGE TNT February 2009  –  April 2009  (3 months) Set Decorator on series pilot MEN OF A CERTAIN AGE TNT February 2009  –  April 2009  (3 months) Freelance Prop Stylist. Tommy Hilfiger Magazine Shoot January 2009  –  January 2009  (1 month) Freelance Prop Stylist. Tommy Hilfiger Magazine Shoot January 2009  –  January 2009  (1 month) Set Decorator on feature film The SQUEAKQUEL Fox Filmed Entertainment August 2008  –  December 2008  (5 months) Set Decorator on feature film The SQUEAKQUEL Fox Filmed Entertainment August 2008  –  December 2008  (5 months) Freelance Set Decorator & Buyer, Owner Film, TV and Commercial Projects January 1995  –  November 2008  (13 years 11 months) FEATURES & TV include: \nDrowning Mona, Kingdom Come, Las Vegas, Fired Up, American Pie2, The Big Lebowski, Being John Malkovich, Dreams May Come, GI Jane, Dead Man, Waiting to Exhale, Tank Girl. \n \nCOMMERCIALS: Visa, Monster.com, AT&T, Sony, Motorola, Desperate Housewives... the list is long! \nDirectors: Joe Pytka, Jeff Preiss, David LaChapelle.  \nDesigners: Randall Peacock, Juliane Laverne, John Hutman, Jennifer Davis. Freelance Set Decorator & Buyer, Owner Film, TV and Commercial Projects January 1995  –  November 2008  (13 years 11 months) FEATURES & TV include: \nDrowning Mona, Kingdom Come, Las Vegas, Fired Up, American Pie2, The Big Lebowski, Being John Malkovich, Dreams May Come, GI Jane, Dead Man, Waiting to Exhale, Tank Girl. \n \nCOMMERCIALS: Visa, Monster.com, AT&T, Sony, Motorola, Desperate Housewives... the list is long! \nDirectors: Joe Pytka, Jeff Preiss, David LaChapelle.  \nDesigners: Randall Peacock, Juliane Laverne, John Hutman, Jennifer Davis. Skills Feature Films Facebook Brand Development Art Marketing Screenwriting Video Production Managment Photography Videography Set Dressing Broadcast Television Blogging Short Films Skills  Feature Films Facebook Brand Development Art Marketing Screenwriting Video Production Managment Photography Videography Set Dressing Broadcast Television Blogging Short Films Feature Films Facebook Brand Development Art Marketing Screenwriting Video Production Managment Photography Videography Set Dressing Broadcast Television Blogging Short Films Feature Films Facebook Brand Development Art Marketing Screenwriting Video Production Managment Photography Videography Set Dressing Broadcast Television Blogging Short Films Education San Francisco State University Bachelor's degree,  Business , Management, Marketing, and Related Support Services University of Washington Film Certificate Program,  Film San Francisco State University Bachelor's degree,  Business , Management, Marketing, and Related Support Services San Francisco State University Bachelor's degree,  Business , Management, Marketing, and Related Support Services San Francisco State University Bachelor's degree,  Business , Management, Marketing, and Related Support Services University of Washington Film Certificate Program,  Film University of Washington Film Certificate Program,  Film University of Washington Film Certificate Program,  Film ", "Summary Sr. Experience Designer passionate about creating transparent design based on clean workflows.  \n \nStrong visual design background with a talent for conceptual thinking.  \n \nExperience: Search Monetization and Search Product Design, Innovation Management Software, Internal Tools and Platforms, E-commerce, Non-profits, Voting Mechanisms, Branding \n \nkcdesinglab.com \nkatrinatempero.com Summary Sr. Experience Designer passionate about creating transparent design based on clean workflows.  \n \nStrong visual design background with a talent for conceptual thinking.  \n \nExperience: Search Monetization and Search Product Design, Innovation Management Software, Internal Tools and Platforms, E-commerce, Non-profits, Voting Mechanisms, Branding \n \nkcdesinglab.com \nkatrinatempero.com Sr. Experience Designer passionate about creating transparent design based on clean workflows.  \n \nStrong visual design background with a talent for conceptual thinking.  \n \nExperience: Search Monetization and Search Product Design, Innovation Management Software, Internal Tools and Platforms, E-commerce, Non-profits, Voting Mechanisms, Branding \n \nkcdesinglab.com \nkatrinatempero.com Sr. Experience Designer passionate about creating transparent design based on clean workflows.  \n \nStrong visual design background with a talent for conceptual thinking.  \n \nExperience: Search Monetization and Search Product Design, Innovation Management Software, Internal Tools and Platforms, E-commerce, Non-profits, Voting Mechanisms, Branding \n \nkcdesinglab.com \nkatrinatempero.com Experience Sr. Experience Designer Yahoo! August 2013  – Present (2 years 1 month) Sunnyvale, CA UX for Search Monetization: Work with project managers to iterate, design and spec design requirements for product features/enhancements. Visual Interaction Designer / Art Director KC Design Lab November 2006  – Present (8 years 10 months) - Manage and direct the design and programming teams to ensure a quality end product that is delivered on time. \n- Collaborate with client marketing teams to develop a targeted user interface work flow.  \n- Produce detailed reports of web performance and ongoing technical and content updates for clients. \n- Create website plans with detailed wireframes for complex web-based environments that use current web applications including a variety of CMSs, Flash, HTML/DHTML, CSS, PHP, MySQL  \n- Graphic design + brand identity \n \nClients include: Power.org, IEEE-ISTO, New York Women's Foundation, Mavericks Invitational, Advanced Footcare Group, Brandularity, Jeff Clark Mavericks Sr. Interaction Designer, UX spigit August 2012  –  August 2013  (1 year 1 month) Pleasanton, CA Take concepts from project managers and work with UX team to brain storm solutions, create workflow diagrams, wireframes, test prototypes, create final interface designs and support Agile development team in executing the final design. \n \nOther tasks include: \n- Assisting project managers in keeping User Stories thorough and current \n- Identify expensive user interactions Art Director / Graphic Designer Embedded Insight May 1999  –  June 2006  (7 years 2 months) Oversee design process from concept to delivery. \nProduce original art and design. \nCreate CSS style templates for backend CMS programmers to develop. \nCollaborate with a variety of clients and colleagues. \n \nClients include: HyperTransport Consortium, Allayer Communications, Broadcom, LightWire, Storm Communications, Blade.org Sr. Experience Designer Yahoo! August 2013  – Present (2 years 1 month) Sunnyvale, CA UX for Search Monetization: Work with project managers to iterate, design and spec design requirements for product features/enhancements. Sr. Experience Designer Yahoo! August 2013  – Present (2 years 1 month) Sunnyvale, CA UX for Search Monetization: Work with project managers to iterate, design and spec design requirements for product features/enhancements. Visual Interaction Designer / Art Director KC Design Lab November 2006  – Present (8 years 10 months) - Manage and direct the design and programming teams to ensure a quality end product that is delivered on time. \n- Collaborate with client marketing teams to develop a targeted user interface work flow.  \n- Produce detailed reports of web performance and ongoing technical and content updates for clients. \n- Create website plans with detailed wireframes for complex web-based environments that use current web applications including a variety of CMSs, Flash, HTML/DHTML, CSS, PHP, MySQL  \n- Graphic design + brand identity \n \nClients include: Power.org, IEEE-ISTO, New York Women's Foundation, Mavericks Invitational, Advanced Footcare Group, Brandularity, Jeff Clark Mavericks Visual Interaction Designer / Art Director KC Design Lab November 2006  – Present (8 years 10 months) - Manage and direct the design and programming teams to ensure a quality end product that is delivered on time. \n- Collaborate with client marketing teams to develop a targeted user interface work flow.  \n- Produce detailed reports of web performance and ongoing technical and content updates for clients. \n- Create website plans with detailed wireframes for complex web-based environments that use current web applications including a variety of CMSs, Flash, HTML/DHTML, CSS, PHP, MySQL  \n- Graphic design + brand identity \n \nClients include: Power.org, IEEE-ISTO, New York Women's Foundation, Mavericks Invitational, Advanced Footcare Group, Brandularity, Jeff Clark Mavericks Sr. Interaction Designer, UX spigit August 2012  –  August 2013  (1 year 1 month) Pleasanton, CA Take concepts from project managers and work with UX team to brain storm solutions, create workflow diagrams, wireframes, test prototypes, create final interface designs and support Agile development team in executing the final design. \n \nOther tasks include: \n- Assisting project managers in keeping User Stories thorough and current \n- Identify expensive user interactions Sr. Interaction Designer, UX spigit August 2012  –  August 2013  (1 year 1 month) Pleasanton, CA Take concepts from project managers and work with UX team to brain storm solutions, create workflow diagrams, wireframes, test prototypes, create final interface designs and support Agile development team in executing the final design. \n \nOther tasks include: \n- Assisting project managers in keeping User Stories thorough and current \n- Identify expensive user interactions Art Director / Graphic Designer Embedded Insight May 1999  –  June 2006  (7 years 2 months) Oversee design process from concept to delivery. \nProduce original art and design. \nCreate CSS style templates for backend CMS programmers to develop. \nCollaborate with a variety of clients and colleagues. \n \nClients include: HyperTransport Consortium, Allayer Communications, Broadcom, LightWire, Storm Communications, Blade.org Art Director / Graphic Designer Embedded Insight May 1999  –  June 2006  (7 years 2 months) Oversee design process from concept to delivery. \nProduce original art and design. \nCreate CSS style templates for backend CMS programmers to develop. \nCollaborate with a variety of clients and colleagues. \n \nClients include: HyperTransport Consortium, Allayer Communications, Broadcom, LightWire, Storm Communications, Blade.org Languages English Native or bilingual proficiency Portuguese Professional working proficiency English Native or bilingual proficiency Portuguese Professional working proficiency English Native or bilingual proficiency Portuguese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Graphic Design Art Direction Web Design Art Logo Design Illustration Creative Direction Photoshop Adobe Creative Suite Interaction Design Email Marketing User Experience CSS Digital Marketing Advertising Flash SEO User Interface Design User-centered Design Web Applications E-commerce Web Development User Experience Design Information Architecture CMS User Interface Wireframes Graphics Integrated Marketing Dreamweaver Visual Communication Visual Design Layout Concept Development Typography InDesign Illustrator Digital Illustration Front-end After Effects WordPress Design Thinking Brand Development HTML 5 Mobile Design See 30+     See less Skills  Graphic Design Art Direction Web Design Art Logo Design Illustration Creative Direction Photoshop Adobe Creative Suite Interaction Design Email Marketing User Experience CSS Digital Marketing Advertising Flash SEO User Interface Design User-centered Design Web Applications E-commerce Web Development User Experience Design Information Architecture CMS User Interface Wireframes Graphics Integrated Marketing Dreamweaver Visual Communication Visual Design Layout Concept Development Typography InDesign Illustrator Digital Illustration Front-end After Effects WordPress Design Thinking Brand Development HTML 5 Mobile Design See 30+     See less Graphic Design Art Direction Web Design Art Logo Design Illustration Creative Direction Photoshop Adobe Creative Suite Interaction Design Email Marketing User Experience CSS Digital Marketing Advertising Flash SEO User Interface Design User-centered Design Web Applications E-commerce Web Development User Experience Design Information Architecture CMS User Interface Wireframes Graphics Integrated Marketing Dreamweaver Visual Communication Visual Design Layout Concept Development Typography InDesign Illustrator Digital Illustration Front-end After Effects WordPress Design Thinking Brand Development HTML 5 Mobile Design See 30+     See less Graphic Design Art Direction Web Design Art Logo Design Illustration Creative Direction Photoshop Adobe Creative Suite Interaction Design Email Marketing User Experience CSS Digital Marketing Advertising Flash SEO User Interface Design User-centered Design Web Applications E-commerce Web Development User Experience Design Information Architecture CMS User Interface Wireframes Graphics Integrated Marketing Dreamweaver Visual Communication Visual Design Layout Concept Development Typography InDesign Illustrator Digital Illustration Front-end After Effects WordPress Design Thinking Brand Development HTML 5 Mobile Design See 30+     See less Education Humboldt State University Bachelor's of Arts,  Studio Art 2003  – 2006 Academy of Art University Credit towards Bachelor's,  3D Animation 2000  – 2001 Aragon High School International House - Lisbon Humboldt State University Bachelor's of Arts,  Studio Art 2003  – 2006 Humboldt State University Bachelor's of Arts,  Studio Art 2003  – 2006 Humboldt State University Bachelor's of Arts,  Studio Art 2003  – 2006 Academy of Art University Credit towards Bachelor's,  3D Animation 2000  – 2001 Academy of Art University Credit towards Bachelor's,  3D Animation 2000  – 2001 Academy of Art University Credit towards Bachelor's,  3D Animation 2000  – 2001 Aragon High School Aragon High School Aragon High School International House - Lisbon International House - Lisbon International House - Lisbon Honors & Awards Yahoo! Q2 Hack Day Award, Greater Good Category (2014) Yahoo! May 2014 Yahoo! Q2 Hack Day Finalist, Consumer Category (2014) Yahoo! May 2014 Yahoo! Q4 Hack Day Award, Mobile Category (2013) Yahoo! November 2013 Yahoo! Q3 Hack Day Award, Best Overall Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Award, Best Intern Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Finalist, Greater Good Category (2014) Yahoo! August 2014 Yahoo! Q2 Hack Day Winner, Greater Good Category (2015) Yahoo! June 2015 Additional Honors & Awards Art Department Award - Aragon High School \nJournalism Department Award - Aragon High School Yahoo! Q2 Hack Day Award, Greater Good Category (2014) Yahoo! May 2014 Yahoo! Q2 Hack Day Award, Greater Good Category (2014) Yahoo! May 2014 Yahoo! Q2 Hack Day Award, Greater Good Category (2014) Yahoo! May 2014 Yahoo! Q2 Hack Day Finalist, Consumer Category (2014) Yahoo! May 2014 Yahoo! Q2 Hack Day Finalist, Consumer Category (2014) Yahoo! May 2014 Yahoo! Q2 Hack Day Finalist, Consumer Category (2014) Yahoo! May 2014 Yahoo! Q4 Hack Day Award, Mobile Category (2013) Yahoo! November 2013 Yahoo! Q4 Hack Day Award, Mobile Category (2013) Yahoo! November 2013 Yahoo! Q4 Hack Day Award, Mobile Category (2013) Yahoo! November 2013 Yahoo! Q3 Hack Day Award, Best Overall Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Award, Best Overall Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Award, Best Overall Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Award, Best Intern Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Award, Best Intern Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Award, Best Intern Hack (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Finalist, Greater Good Category (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Finalist, Greater Good Category (2014) Yahoo! August 2014 Yahoo! Q3 Hack Day Finalist, Greater Good Category (2014) Yahoo! August 2014 Yahoo! Q2 Hack Day Winner, Greater Good Category (2015) Yahoo! June 2015 Yahoo! Q2 Hack Day Winner, Greater Good Category (2015) Yahoo! June 2015 Yahoo! Q2 Hack Day Winner, Greater Good Category (2015) Yahoo! June 2015 Additional Honors & Awards Art Department Award - Aragon High School \nJournalism Department Award - Aragon High School Additional Honors & Awards Art Department Award - Aragon High School \nJournalism Department Award - Aragon High School Additional Honors & Awards Art Department Award - Aragon High School \nJournalism Department Award - Aragon High School ", "Summary Energetic and creative motion graphic designer with a sharp eye for level of detail. Passionate about process and workflow; articulate when discussing ideas and concepts. Specialties:Motion Graphics, Compositing, Editing, Grading, Adobe Creative Suite, Final Cut Pro. Summary Energetic and creative motion graphic designer with a sharp eye for level of detail. Passionate about process and workflow; articulate when discussing ideas and concepts. Specialties:Motion Graphics, Compositing, Editing, Grading, Adobe Creative Suite, Final Cut Pro. Energetic and creative motion graphic designer with a sharp eye for level of detail. Passionate about process and workflow; articulate when discussing ideas and concepts. Specialties:Motion Graphics, Compositing, Editing, Grading, Adobe Creative Suite, Final Cut Pro. Energetic and creative motion graphic designer with a sharp eye for level of detail. Passionate about process and workflow; articulate when discussing ideas and concepts. Specialties:Motion Graphics, Compositing, Editing, Grading, Adobe Creative Suite, Final Cut Pro. Experience Art Director Yahoo October 2014  – Present (11 months) Editor/Media Services Yahoo! May 2012  –  October 2014  (2 years 6 months) Senior Video Editor Prime Content September 2011  –  May 2012  (9 months) Motion Designer Freelance / Graphic Design Services September 2010  –  September 2011  (1 year 1 month) Freelance Motion Graphics Designer specializing in: \n•After Effects Animation & Compositing \n•Editing and Grading (FCP and Premiere) \n•3D Capabilities for pre-visualization and animatics. Motion Graphics Designer Vertic Portals August 2009  –  September 2010  (1 year 2 months) •Served as the sole Motion Designer in New York Branch often working multiple projects at once; worked with Creative/Technical director to meet deadlines with very quick turnarounds, adhered to technical limitations of video size and quality. \n \n•Produced numerous final animations for clients for web content, corporate video presentation, and proof of concept pitch work. Major clients include Kodak and Microsoft. \n \n•Traveled to Copenhagen Headquarters to assist in projects overseas. \n \n•Greenscreen and Location shooting experience, clients include Garia, SAP, Konica Minolta, Microsoft. \n \n•Honed workflow and process to minimize risks and delays. Designer Perfect Fools 2007  –  2009  (2 years) •Assisted in the design and production of major commercial websites, including clients such as Smirnoff, Stolichnaya, Huggies, and Umbro. \n \n•Touched every part of the production process from brainstorming to final production. \n \n•Worked closely with Art Directors and Creative Directors to achieve best possible results for our clients in very short production schedules. \n \n•Assisted in troubleshooting and bug reporting of websites produced. Art Director Yahoo October 2014  – Present (11 months) Art Director Yahoo October 2014  – Present (11 months) Editor/Media Services Yahoo! May 2012  –  October 2014  (2 years 6 months) Editor/Media Services Yahoo! May 2012  –  October 2014  (2 years 6 months) Senior Video Editor Prime Content September 2011  –  May 2012  (9 months) Senior Video Editor Prime Content September 2011  –  May 2012  (9 months) Motion Designer Freelance / Graphic Design Services September 2010  –  September 2011  (1 year 1 month) Freelance Motion Graphics Designer specializing in: \n•After Effects Animation & Compositing \n•Editing and Grading (FCP and Premiere) \n•3D Capabilities for pre-visualization and animatics. Motion Designer Freelance / Graphic Design Services September 2010  –  September 2011  (1 year 1 month) Freelance Motion Graphics Designer specializing in: \n•After Effects Animation & Compositing \n•Editing and Grading (FCP and Premiere) \n•3D Capabilities for pre-visualization and animatics. Motion Graphics Designer Vertic Portals August 2009  –  September 2010  (1 year 2 months) •Served as the sole Motion Designer in New York Branch often working multiple projects at once; worked with Creative/Technical director to meet deadlines with very quick turnarounds, adhered to technical limitations of video size and quality. \n \n•Produced numerous final animations for clients for web content, corporate video presentation, and proof of concept pitch work. Major clients include Kodak and Microsoft. \n \n•Traveled to Copenhagen Headquarters to assist in projects overseas. \n \n•Greenscreen and Location shooting experience, clients include Garia, SAP, Konica Minolta, Microsoft. \n \n•Honed workflow and process to minimize risks and delays. Motion Graphics Designer Vertic Portals August 2009  –  September 2010  (1 year 2 months) •Served as the sole Motion Designer in New York Branch often working multiple projects at once; worked with Creative/Technical director to meet deadlines with very quick turnarounds, adhered to technical limitations of video size and quality. \n \n•Produced numerous final animations for clients for web content, corporate video presentation, and proof of concept pitch work. Major clients include Kodak and Microsoft. \n \n•Traveled to Copenhagen Headquarters to assist in projects overseas. \n \n•Greenscreen and Location shooting experience, clients include Garia, SAP, Konica Minolta, Microsoft. \n \n•Honed workflow and process to minimize risks and delays. Designer Perfect Fools 2007  –  2009  (2 years) •Assisted in the design and production of major commercial websites, including clients such as Smirnoff, Stolichnaya, Huggies, and Umbro. \n \n•Touched every part of the production process from brainstorming to final production. \n \n•Worked closely with Art Directors and Creative Directors to achieve best possible results for our clients in very short production schedules. \n \n•Assisted in troubleshooting and bug reporting of websites produced. Designer Perfect Fools 2007  –  2009  (2 years) •Assisted in the design and production of major commercial websites, including clients such as Smirnoff, Stolichnaya, Huggies, and Umbro. \n \n•Touched every part of the production process from brainstorming to final production. \n \n•Worked closely with Art Directors and Creative Directors to achieve best possible results for our clients in very short production schedules. \n \n•Assisted in troubleshooting and bug reporting of websites produced. Skills After Effects Motion Graphics Animation Visual Effects Premiere Final Cut Pro Compositing Adobe Creative Suite Video 3D Color Grading Interaction Design Skills  After Effects Motion Graphics Animation Visual Effects Premiere Final Cut Pro Compositing Adobe Creative Suite Video 3D Color Grading Interaction Design After Effects Motion Graphics Animation Visual Effects Premiere Final Cut Pro Compositing Adobe Creative Suite Video 3D Color Grading Interaction Design After Effects Motion Graphics Animation Visual Effects Premiere Final Cut Pro Compositing Adobe Creative Suite Video 3D Color Grading Interaction Design Education Drexel University B.S.,  Digital Media 2003  – 2007 Drexel University B.S.,  Digital Media 2003  – 2007 Drexel University B.S.,  Digital Media 2003  – 2007 Drexel University B.S.,  Digital Media 2003  – 2007 ", "Summary I have a passion for developing and executing digital marketing strategy and exploring new media and communication possibilities that are aligned with target customer needs. \n \nI am energetic, lively, and optimistic. I consider it important to find companionship, respect and professionalism in my work place. \nInnate ability and passion for fostering trusted colleague and client relationships by leveraging strong listening and communication skills. Summary I have a passion for developing and executing digital marketing strategy and exploring new media and communication possibilities that are aligned with target customer needs. \n \nI am energetic, lively, and optimistic. I consider it important to find companionship, respect and professionalism in my work place. \nInnate ability and passion for fostering trusted colleague and client relationships by leveraging strong listening and communication skills. I have a passion for developing and executing digital marketing strategy and exploring new media and communication possibilities that are aligned with target customer needs. \n \nI am energetic, lively, and optimistic. I consider it important to find companionship, respect and professionalism in my work place. \nInnate ability and passion for fostering trusted colleague and client relationships by leveraging strong listening and communication skills. I have a passion for developing and executing digital marketing strategy and exploring new media and communication possibilities that are aligned with target customer needs. \n \nI am energetic, lively, and optimistic. I consider it important to find companionship, respect and professionalism in my work place. \nInnate ability and passion for fostering trusted colleague and client relationships by leveraging strong listening and communication skills. Experience Advertising Account Executive Yahoo March 2015  – Present (6 months) Barcellona, Spagna I'm the point of contact for digital marketing campaigns for Yahoo!'s national and global advertisers.  \nI develop branding and performance based strategies for clients specializing in various global industries  \nUtilize Yahoo!'s reach and industry leading targeting technology to execute results focused advertising solutions. Owner and Art Director Indepth MusicRec December 2010  – Present (4 years 9 months) Manage the label activities, develop marketing strategies, art director, ideas provider and musical and brand curator. Account Manager, EMEA Facebook December 2013  –  March 2015  (1 year 4 months) Barcellona, Spagna Strategic consultancy for social communication and advertising on Facebook. Analysis of data and ad hoc optimization of Facebook Ads. Sales regarding advertising products and new featuring. New Business/Project Manager Xplace March 2013  –  November 2013  (9 months) Osimo I Managed the whole acquisition process of a new customer for the agency. \nI developed customized online marketing projects according to customers needing and features. I coordinated the staff dedicated to every project. Stageur area marketing dieleutefürkommunikation November 2012  –  March 2013  (5 months) Sindelfingen, Germany I managed and I was responsible for the Italian market area, for agency’s costumers. \nMarket analysis, marketing research, writing and selling articles for specialized magazines, audio and video editing. SAP pointer team member. Intern AIESEC Manipal University July 2012  –  September 2012  (3 months) Mangalore Area, India I worked together with Financial Literacy and Credit Counseling Centre in Karnataka and with faculty members and professors of Manipal University’s Department of Commerce, local NGOs and colleges in rural areas, to develop an specific area around Udupi applying microfinance and micro insurance theories. Vice president Information Management AIESEC Ancona 2010  –  2012  (2 years) Brand positioning, marketing strategies, social media campaigns, internal communications, web site management, advertising. Advertising Account Executive Yahoo March 2015  – Present (6 months) Barcellona, Spagna I'm the point of contact for digital marketing campaigns for Yahoo!'s national and global advertisers.  \nI develop branding and performance based strategies for clients specializing in various global industries  \nUtilize Yahoo!'s reach and industry leading targeting technology to execute results focused advertising solutions. Advertising Account Executive Yahoo March 2015  – Present (6 months) Barcellona, Spagna I'm the point of contact for digital marketing campaigns for Yahoo!'s national and global advertisers.  \nI develop branding and performance based strategies for clients specializing in various global industries  \nUtilize Yahoo!'s reach and industry leading targeting technology to execute results focused advertising solutions. Owner and Art Director Indepth MusicRec December 2010  – Present (4 years 9 months) Manage the label activities, develop marketing strategies, art director, ideas provider and musical and brand curator. Owner and Art Director Indepth MusicRec December 2010  – Present (4 years 9 months) Manage the label activities, develop marketing strategies, art director, ideas provider and musical and brand curator. Account Manager, EMEA Facebook December 2013  –  March 2015  (1 year 4 months) Barcellona, Spagna Strategic consultancy for social communication and advertising on Facebook. Analysis of data and ad hoc optimization of Facebook Ads. Sales regarding advertising products and new featuring. Account Manager, EMEA Facebook December 2013  –  March 2015  (1 year 4 months) Barcellona, Spagna Strategic consultancy for social communication and advertising on Facebook. Analysis of data and ad hoc optimization of Facebook Ads. Sales regarding advertising products and new featuring. New Business/Project Manager Xplace March 2013  –  November 2013  (9 months) Osimo I Managed the whole acquisition process of a new customer for the agency. \nI developed customized online marketing projects according to customers needing and features. I coordinated the staff dedicated to every project. New Business/Project Manager Xplace March 2013  –  November 2013  (9 months) Osimo I Managed the whole acquisition process of a new customer for the agency. \nI developed customized online marketing projects according to customers needing and features. I coordinated the staff dedicated to every project. Stageur area marketing dieleutefürkommunikation November 2012  –  March 2013  (5 months) Sindelfingen, Germany I managed and I was responsible for the Italian market area, for agency’s costumers. \nMarket analysis, marketing research, writing and selling articles for specialized magazines, audio and video editing. SAP pointer team member. Stageur area marketing dieleutefürkommunikation November 2012  –  March 2013  (5 months) Sindelfingen, Germany I managed and I was responsible for the Italian market area, for agency’s costumers. \nMarket analysis, marketing research, writing and selling articles for specialized magazines, audio and video editing. SAP pointer team member. Intern AIESEC Manipal University July 2012  –  September 2012  (3 months) Mangalore Area, India I worked together with Financial Literacy and Credit Counseling Centre in Karnataka and with faculty members and professors of Manipal University’s Department of Commerce, local NGOs and colleges in rural areas, to develop an specific area around Udupi applying microfinance and micro insurance theories. Intern AIESEC Manipal University July 2012  –  September 2012  (3 months) Mangalore Area, India I worked together with Financial Literacy and Credit Counseling Centre in Karnataka and with faculty members and professors of Manipal University’s Department of Commerce, local NGOs and colleges in rural areas, to develop an specific area around Udupi applying microfinance and micro insurance theories. Vice president Information Management AIESEC Ancona 2010  –  2012  (2 years) Brand positioning, marketing strategies, social media campaigns, internal communications, web site management, advertising. Vice president Information Management AIESEC Ancona 2010  –  2012  (2 years) Brand positioning, marketing strategies, social media campaigns, internal communications, web site management, advertising. Languages Inglese Full professional proficiency Tedesco Elementary proficiency Spanish Professional working proficiency Italian Native or bilingual proficiency Inglese Full professional proficiency Tedesco Elementary proficiency Spanish Professional working proficiency Italian Native or bilingual proficiency Inglese Full professional proficiency Tedesco Elementary proficiency Spanish Professional working proficiency Italian Native or bilingual proficiency Full professional proficiency Elementary proficiency Professional working proficiency Native or bilingual proficiency Skills Marketing Strategy Marketing Communications Social Media Marketing Online Marketing Market Research Sales Management Internal Communications Internal Marketing International Economics Non-profits NGOs Graphic Design Adobe Creative Suite Audio Editing Music Production Microsoft Office Data Collection Editorial Social media marketing Public Speaking Social Media Advertising See 7+     See less Skills  Marketing Strategy Marketing Communications Social Media Marketing Online Marketing Market Research Sales Management Internal Communications Internal Marketing International Economics Non-profits NGOs Graphic Design Adobe Creative Suite Audio Editing Music Production Microsoft Office Data Collection Editorial Social media marketing Public Speaking Social Media Advertising See 7+     See less Marketing Strategy Marketing Communications Social Media Marketing Online Marketing Market Research Sales Management Internal Communications Internal Marketing International Economics Non-profits NGOs Graphic Design Adobe Creative Suite Audio Editing Music Production Microsoft Office Data Collection Editorial Social media marketing Public Speaking Social Media Advertising See 7+     See less Marketing Strategy Marketing Communications Social Media Marketing Online Marketing Market Research Sales Management Internal Communications Internal Marketing International Economics Non-profits NGOs Graphic Design Adobe Creative Suite Audio Editing Music Production Microsoft Office Data Collection Editorial Social media marketing Public Speaking Social Media Advertising See 7+     See less Education Università Politecnica delle Marche Laurea Magistrale,  International Economics and Marketing , 102 2010  – 2012 Titolo tesi di Laurea: Il ricorso al green marketing nelle imprese agrituristiche: un indagine nell'area del Conero Activities and Societies:  AIESEC Ancona Università Politecnica delle Marche Laurea Triennale in Economia e Commercio,  Marketing e Gestione Commerciale , 96 2006  – 2009 Università Politecnica delle Marche Laurea Magistrale,  International Economics and Marketing , 102 2010  – 2012 Titolo tesi di Laurea: Il ricorso al green marketing nelle imprese agrituristiche: un indagine nell'area del Conero Activities and Societies:  AIESEC Ancona Università Politecnica delle Marche Laurea Magistrale,  International Economics and Marketing , 102 2010  – 2012 Titolo tesi di Laurea: Il ricorso al green marketing nelle imprese agrituristiche: un indagine nell'area del Conero Activities and Societies:  AIESEC Ancona Università Politecnica delle Marche Laurea Magistrale,  International Economics and Marketing , 102 2010  – 2012 Titolo tesi di Laurea: Il ricorso al green marketing nelle imprese agrituristiche: un indagine nell'area del Conero Activities and Societies:  AIESEC Ancona Università Politecnica delle Marche Laurea Triennale in Economia e Commercio,  Marketing e Gestione Commerciale , 96 2006  – 2009 Università Politecnica delle Marche Laurea Triennale in Economia e Commercio,  Marketing e Gestione Commerciale , 96 2006  – 2009 Università Politecnica delle Marche Laurea Triennale in Economia e Commercio,  Marketing e Gestione Commerciale , 96 2006  – 2009 ", "Skills Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less Skills  Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less ", "Experience Sr Art Director Yahoo November 2009  – Present (5 years 10 months) Creating trend-setting digital experiences, marketing campaigns, visual brand identities and graphic design for over a billion users. Sr Art Director Yahoo November 2009  – Present (5 years 10 months) Creating trend-setting digital experiences, marketing campaigns, visual brand identities and graphic design for over a billion users. Sr Art Director Yahoo November 2009  – Present (5 years 10 months) Creating trend-setting digital experiences, marketing campaigns, visual brand identities and graphic design for over a billion users. Skills Art Direction Creative Direction Global Marketing Corporate Branding Corporate Identity Online Advertising Brand Design Employer Branding Mobile Marketing Interactive Advertising Branding & Identity Web Design Social Media Marketing Typography Branding Experience Graphic Design Direct Marketing Print Ads User Experience Email Marketing Logo Design Visual Storytelling Interaction Design Digital Strategy Advertising Creative Strategy Concept Development Interactive Marketing Brand Development Branding See 15+     See less Skills  Art Direction Creative Direction Global Marketing Corporate Branding Corporate Identity Online Advertising Brand Design Employer Branding Mobile Marketing Interactive Advertising Branding & Identity Web Design Social Media Marketing Typography Branding Experience Graphic Design Direct Marketing Print Ads User Experience Email Marketing Logo Design Visual Storytelling Interaction Design Digital Strategy Advertising Creative Strategy Concept Development Interactive Marketing Brand Development Branding See 15+     See less Art Direction Creative Direction Global Marketing Corporate Branding Corporate Identity Online Advertising Brand Design Employer Branding Mobile Marketing Interactive Advertising Branding & Identity Web Design Social Media Marketing Typography Branding Experience Graphic Design Direct Marketing Print Ads User Experience Email Marketing Logo Design Visual Storytelling Interaction Design Digital Strategy Advertising Creative Strategy Concept Development Interactive Marketing Brand Development Branding See 15+     See less Art Direction Creative Direction Global Marketing Corporate Branding Corporate Identity Online Advertising Brand Design Employer Branding Mobile Marketing Interactive Advertising Branding & Identity Web Design Social Media Marketing Typography Branding Experience Graphic Design Direct Marketing Print Ads User Experience Email Marketing Logo Design Visual Storytelling Interaction Design Digital Strategy Advertising Creative Strategy Concept Development Interactive Marketing Brand Development Branding See 15+     See less Education Academy of Art University BFA,  Advertising 2002  – 2006 Academy of Art University Bachelor of Arts (B.A.),  Advertising 2002  – 2006 Academy of Art University BFA,  Advertising 2002  – 2006 Academy of Art University BFA,  Advertising 2002  – 2006 Academy of Art University BFA,  Advertising 2002  – 2006 Academy of Art University Bachelor of Arts (B.A.),  Advertising 2002  – 2006 Academy of Art University Bachelor of Arts (B.A.),  Advertising 2002  – 2006 Academy of Art University Bachelor of Arts (B.A.),  Advertising 2002  – 2006 Honors & Awards "]}