{"position": "Director of Marketing", "company": "Google", "profiles": ["Skills Maps Local Search Product Management User Experience Strategy User Interface Design Interaction Design Product Planning Analytics Project Management Architectures Mobile Applications Management Hadoop Location Based Services Wire Framing Usability Testing Strategic Partnerships Team Management Agile Methodologies Software Development Start-ups User Research Web Applications Digital Media Cloud Computing Content Management Content Strategy Product Development Mobile Design Big Data Competitive Analysis Software Product... Mobile Devices Product Marketing User Interface See 21+     See less Skills  Maps Local Search Product Management User Experience Strategy User Interface Design Interaction Design Product Planning Analytics Project Management Architectures Mobile Applications Management Hadoop Location Based Services Wire Framing Usability Testing Strategic Partnerships Team Management Agile Methodologies Software Development Start-ups User Research Web Applications Digital Media Cloud Computing Content Management Content Strategy Product Development Mobile Design Big Data Competitive Analysis Software Product... Mobile Devices Product Marketing User Interface See 21+     See less Maps Local Search Product Management User Experience Strategy User Interface Design Interaction Design Product Planning Analytics Project Management Architectures Mobile Applications Management Hadoop Location Based Services Wire Framing Usability Testing Strategic Partnerships Team Management Agile Methodologies Software Development Start-ups User Research Web Applications Digital Media Cloud Computing Content Management Content Strategy Product Development Mobile Design Big Data Competitive Analysis Software Product... Mobile Devices Product Marketing User Interface See 21+     See less Maps Local Search Product Management User Experience Strategy User Interface Design Interaction Design Product Planning Analytics Project Management Architectures Mobile Applications Management Hadoop Location Based Services Wire Framing Usability Testing Strategic Partnerships Team Management Agile Methodologies Software Development Start-ups User Research Web Applications Digital Media Cloud Computing Content Management Content Strategy Product Development Mobile Design Big Data Competitive Analysis Software Product... Mobile Devices Product Marketing User Interface See 21+     See less ", "Languages English French English French English French Skills Online Advertising Strategic Partnerships Digital Media Advertising Sales Digital Strategy Ad Networks Sales Management Mobile Advertising Advertising Mobile Marketing Digital Marketing New Media Display Advertising Business Development Interactive Marketing SEM See 1+     See less Skills  Online Advertising Strategic Partnerships Digital Media Advertising Sales Digital Strategy Ad Networks Sales Management Mobile Advertising Advertising Mobile Marketing Digital Marketing New Media Display Advertising Business Development Interactive Marketing SEM See 1+     See less Online Advertising Strategic Partnerships Digital Media Advertising Sales Digital Strategy Ad Networks Sales Management Mobile Advertising Advertising Mobile Marketing Digital Marketing New Media Display Advertising Business Development Interactive Marketing SEM See 1+     See less Online Advertising Strategic Partnerships Digital Media Advertising Sales Digital Strategy Ad Networks Sales Management Mobile Advertising Advertising Mobile Marketing Digital Marketing New Media Display Advertising Business Development Interactive Marketing SEM See 1+     See less ", "Skills Intellectual Property Privacy Law Cyberlaw Data Privacy Licensing Copyright Law Corporate Law IT law Corporate Governance Privacy Policies Entertainment Law Trademarks Strategy International Law Consumer Law Competition Law Trademark Infringement IT Law See 3+     See less Skills  Intellectual Property Privacy Law Cyberlaw Data Privacy Licensing Copyright Law Corporate Law IT law Corporate Governance Privacy Policies Entertainment Law Trademarks Strategy International Law Consumer Law Competition Law Trademark Infringement IT Law See 3+     See less Intellectual Property Privacy Law Cyberlaw Data Privacy Licensing Copyright Law Corporate Law IT law Corporate Governance Privacy Policies Entertainment Law Trademarks Strategy International Law Consumer Law Competition Law Trademark Infringement IT Law See 3+     See less Intellectual Property Privacy Law Cyberlaw Data Privacy Licensing Copyright Law Corporate Law IT law Corporate Governance Privacy Policies Entertainment Law Trademarks Strategy International Law Consumer Law Competition Law Trademark Infringement IT Law See 3+     See less ", "Summary Multi media experience: Advertising Agency, Press, Magazines & Online media. The Observer, BBC Magazines, The Guardian & Yahoo! \nEXPERIENCE \n* Managing large teams across multi markets \n* Identifying/developing emerging markets \n* Part of EU strategic leadership team \n* Managing, budgets, targets & P&L \n* Devising, communciating & implementing sales strategies \n* Cost cutting/reorganising/restructuring teams \n* Driving new business partnerships \n* Senior level business reviews (internal & clients) \n* Identified/developed new sales tools/revenue streams \n* Global sales deals (incl all local market laws & complexities) \n* Developed & managed award winning sales teams Summary Multi media experience: Advertising Agency, Press, Magazines & Online media. The Observer, BBC Magazines, The Guardian & Yahoo! \nEXPERIENCE \n* Managing large teams across multi markets \n* Identifying/developing emerging markets \n* Part of EU strategic leadership team \n* Managing, budgets, targets & P&L \n* Devising, communciating & implementing sales strategies \n* Cost cutting/reorganising/restructuring teams \n* Driving new business partnerships \n* Senior level business reviews (internal & clients) \n* Identified/developed new sales tools/revenue streams \n* Global sales deals (incl all local market laws & complexities) \n* Developed & managed award winning sales teams Multi media experience: Advertising Agency, Press, Magazines & Online media. The Observer, BBC Magazines, The Guardian & Yahoo! \nEXPERIENCE \n* Managing large teams across multi markets \n* Identifying/developing emerging markets \n* Part of EU strategic leadership team \n* Managing, budgets, targets & P&L \n* Devising, communciating & implementing sales strategies \n* Cost cutting/reorganising/restructuring teams \n* Driving new business partnerships \n* Senior level business reviews (internal & clients) \n* Identified/developed new sales tools/revenue streams \n* Global sales deals (incl all local market laws & complexities) \n* Developed & managed award winning sales teams Multi media experience: Advertising Agency, Press, Magazines & Online media. The Observer, BBC Magazines, The Guardian & Yahoo! \nEXPERIENCE \n* Managing large teams across multi markets \n* Identifying/developing emerging markets \n* Part of EU strategic leadership team \n* Managing, budgets, targets & P&L \n* Devising, communciating & implementing sales strategies \n* Cost cutting/reorganising/restructuring teams \n* Driving new business partnerships \n* Senior level business reviews (internal & clients) \n* Identified/developed new sales tools/revenue streams \n* Global sales deals (incl all local market laws & complexities) \n* Developed & managed award winning sales teams Experience Executive Director - Global Agency Development Yahoo! February 2012  – Present (3 years 7 months) London, United Kingdom Managing the London based Yahoo! Global Agency Development Team. Developing regional and global c suite level relationships at the most influential holding companies and their respective brand agencies. Key objective is to help grow Yahoo! revenues globally through strategic partnerships and alliances. Senior Director Global Agency Development Yahoo June 2011  –  February 2012  (9 months) Launched global agency development in EMEA. Initially managed the top 4 holding companies single handed before building out the team. Key objective was to nurture senior level global relationships at the most influential holding companies and their key brand agencies to ultimately lay the foundations for future revenue growth. Commercial Director Global Sales (Europe) Yahoo! June 2007  –  May 2011  (4 years) As part of the EU leadership team, involved in strategic planning for the European business. Devising and implementing through my management team; sales goals, business rationale, strategic vision, targets & MBOs. Managing a sales team in three different countries & coordinating global sales efforts with teams in the US & APAC. The global sales team sell pan regional or Global sales solutions to European based advertisers & advertising agencies. Interim Commercial Director Uk Yahoo! 2008  –  2009  (1 year) Interim commercial director UK managed the agency and client direct sales teams, account management, Ad Operations & Planning & Strategy teams for one of EMEA's most influential markets from both a strategic and revenue generating perspective. Pan Euro Sales Director Yahoo! 2003  –  2007  (4 years) Launched Yahoo!'s first pan regional sales efforts in Europe. Identified and planned online pan regional campaigns and multi market sponsorship opportunities. Collaborated with local markets to identify any central budgets, to plan, book and optimise all multi market campaigns. Head of UK Client Sales Yahoo! 2000  –  2003  (3 years) Managed UK client Sales team which generated majority of sales revenues in the early days of Yahoo! Pioneered some key deals and helped commercially shape and launch some of the most successful products in the history of Yahoo! (Mail, Messenger, Homepage, Answers, E Commerce/Shopping). Defined online strategies with clients direct, conceptually sold digital as a medium and it's position in the then media landscape. Helped transform the way the industry planned, bought & measured online media. Helped promote and pave the commercial success of Yahoo! into what it has become today in the UK. Also helped promote online as a new, credible and measurable medium and was responsible for managing some of the largest YoY revenue growths. Grew sales and support teams. Executive Director - Global Agency Development Yahoo! February 2012  – Present (3 years 7 months) London, United Kingdom Managing the London based Yahoo! Global Agency Development Team. Developing regional and global c suite level relationships at the most influential holding companies and their respective brand agencies. Key objective is to help grow Yahoo! revenues globally through strategic partnerships and alliances. Executive Director - Global Agency Development Yahoo! February 2012  – Present (3 years 7 months) London, United Kingdom Managing the London based Yahoo! Global Agency Development Team. Developing regional and global c suite level relationships at the most influential holding companies and their respective brand agencies. Key objective is to help grow Yahoo! revenues globally through strategic partnerships and alliances. Senior Director Global Agency Development Yahoo June 2011  –  February 2012  (9 months) Launched global agency development in EMEA. Initially managed the top 4 holding companies single handed before building out the team. Key objective was to nurture senior level global relationships at the most influential holding companies and their key brand agencies to ultimately lay the foundations for future revenue growth. Senior Director Global Agency Development Yahoo June 2011  –  February 2012  (9 months) Launched global agency development in EMEA. Initially managed the top 4 holding companies single handed before building out the team. Key objective was to nurture senior level global relationships at the most influential holding companies and their key brand agencies to ultimately lay the foundations for future revenue growth. Commercial Director Global Sales (Europe) Yahoo! June 2007  –  May 2011  (4 years) As part of the EU leadership team, involved in strategic planning for the European business. Devising and implementing through my management team; sales goals, business rationale, strategic vision, targets & MBOs. Managing a sales team in three different countries & coordinating global sales efforts with teams in the US & APAC. The global sales team sell pan regional or Global sales solutions to European based advertisers & advertising agencies. Commercial Director Global Sales (Europe) Yahoo! June 2007  –  May 2011  (4 years) As part of the EU leadership team, involved in strategic planning for the European business. Devising and implementing through my management team; sales goals, business rationale, strategic vision, targets & MBOs. Managing a sales team in three different countries & coordinating global sales efforts with teams in the US & APAC. The global sales team sell pan regional or Global sales solutions to European based advertisers & advertising agencies. Interim Commercial Director Uk Yahoo! 2008  –  2009  (1 year) Interim commercial director UK managed the agency and client direct sales teams, account management, Ad Operations & Planning & Strategy teams for one of EMEA's most influential markets from both a strategic and revenue generating perspective. Interim Commercial Director Uk Yahoo! 2008  –  2009  (1 year) Interim commercial director UK managed the agency and client direct sales teams, account management, Ad Operations & Planning & Strategy teams for one of EMEA's most influential markets from both a strategic and revenue generating perspective. Pan Euro Sales Director Yahoo! 2003  –  2007  (4 years) Launched Yahoo!'s first pan regional sales efforts in Europe. Identified and planned online pan regional campaigns and multi market sponsorship opportunities. Collaborated with local markets to identify any central budgets, to plan, book and optimise all multi market campaigns. Pan Euro Sales Director Yahoo! 2003  –  2007  (4 years) Launched Yahoo!'s first pan regional sales efforts in Europe. Identified and planned online pan regional campaigns and multi market sponsorship opportunities. Collaborated with local markets to identify any central budgets, to plan, book and optimise all multi market campaigns. Head of UK Client Sales Yahoo! 2000  –  2003  (3 years) Managed UK client Sales team which generated majority of sales revenues in the early days of Yahoo! Pioneered some key deals and helped commercially shape and launch some of the most successful products in the history of Yahoo! (Mail, Messenger, Homepage, Answers, E Commerce/Shopping). Defined online strategies with clients direct, conceptually sold digital as a medium and it's position in the then media landscape. Helped transform the way the industry planned, bought & measured online media. Helped promote and pave the commercial success of Yahoo! into what it has become today in the UK. Also helped promote online as a new, credible and measurable medium and was responsible for managing some of the largest YoY revenue growths. Grew sales and support teams. Head of UK Client Sales Yahoo! 2000  –  2003  (3 years) Managed UK client Sales team which generated majority of sales revenues in the early days of Yahoo! Pioneered some key deals and helped commercially shape and launch some of the most successful products in the history of Yahoo! (Mail, Messenger, Homepage, Answers, E Commerce/Shopping). Defined online strategies with clients direct, conceptually sold digital as a medium and it's position in the then media landscape. Helped transform the way the industry planned, bought & measured online media. Helped promote and pave the commercial success of Yahoo! into what it has become today in the UK. Also helped promote online as a new, credible and measurable medium and was responsible for managing some of the largest YoY revenue growths. Grew sales and support teams. Skills Integrated Marketing Mobile Marketing Online Marketing Strategy Strategic Partnerships Marketing Strategy Advertising Management Team Building Team Leadership Digital Marketing Online Advertising Digital Strategy Digital Media SEO Social Media Marketing Sales Management New Media Sales Public Relations Public Speaking Team Management Leadership Account Management Mobile Advertising Media Planning Agency Agreements Email Marketing Analytics Cross-functional Team... Strategic Planning Advertising Sales Web Analytics See 18+     See less Skills  Integrated Marketing Mobile Marketing Online Marketing Strategy Strategic Partnerships Marketing Strategy Advertising Management Team Building Team Leadership Digital Marketing Online Advertising Digital Strategy Digital Media SEO Social Media Marketing Sales Management New Media Sales Public Relations Public Speaking Team Management Leadership Account Management Mobile Advertising Media Planning Agency Agreements Email Marketing Analytics Cross-functional Team... Strategic Planning Advertising Sales Web Analytics See 18+     See less Integrated Marketing Mobile Marketing Online Marketing Strategy Strategic Partnerships Marketing Strategy Advertising Management Team Building Team Leadership Digital Marketing Online Advertising Digital Strategy Digital Media SEO Social Media Marketing Sales Management New Media Sales Public Relations Public Speaking Team Management Leadership Account Management Mobile Advertising Media Planning Agency Agreements Email Marketing Analytics Cross-functional Team... Strategic Planning Advertising Sales Web Analytics See 18+     See less Integrated Marketing Mobile Marketing Online Marketing Strategy Strategic Partnerships Marketing Strategy Advertising Management Team Building Team Leadership Digital Marketing Online Advertising Digital Strategy Digital Media SEO Social Media Marketing Sales Management New Media Sales Public Relations Public Speaking Team Management Leadership Account Management Mobile Advertising Media Planning Agency Agreements Email Marketing Analytics Cross-functional Team... Strategic Planning Advertising Sales Web Analytics See 18+     See less ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling Skills  Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling ", "Summary Leo has worked in and around the Online sector for most of his career, primarily in marketing, sales and product development roles, as well as in broader business strategy positions supporting executive management at both startups and fortune 500 companies.  \n \nCurrently, Leo is the Head of Client Services for the Americas at Yahoo. Previously, he was Vice President of Search Account Management at Yahoo!, leading the North America organization servicing 8,000 clients with $3Billion in annual revenue. Previously, he led the Mid Market Search Sales teams and the Sales Effectiveness team at Yahoo!, responsible for managing the Strategic Partnership with Microsoft for Search Advertising - a 10 year, multi-billion dollar a year relationship.  \n \nPrior to joining Yahoo!, he held positions of increasing responsibility in the corporate headquarters of Charles Schwab as an officer and VP, reporting to the President of Schwab Retail Brokerage. During that tenure, Leo led the Corporate Strategy team and managed teams to explore growth opportunities with responsibility for negotiation and operational implementation, and was the key stakeholder representing Schwab retail on numerous product and offering committees. Prior to this exec role, Leo held various Director level positions in Business Strategy, Product Marketing, and Technology Development for Schwab’s Institutional and Corporate Services Enterprises. \n \nBefore joining Charles Schwab, Leo worked as Director of Marketing and Product Development for a late-stage startup providing technology solutions to the Mortgage Brokerage and Banking industry. Leo also spent time as a Financial Analyst with Deutsche Alex Brown's Investment Banking Group, focusing on the eCommerce sector.  \n \nHe holds a BioMedical Engineering Degree from Harvard. \n \nSpecialties: General Management, Corporate Strategy, Sales and Service Management, Product Development, Product Marketing, Operational Engineering, Financial Planning and Analysis Summary Leo has worked in and around the Online sector for most of his career, primarily in marketing, sales and product development roles, as well as in broader business strategy positions supporting executive management at both startups and fortune 500 companies.  \n \nCurrently, Leo is the Head of Client Services for the Americas at Yahoo. Previously, he was Vice President of Search Account Management at Yahoo!, leading the North America organization servicing 8,000 clients with $3Billion in annual revenue. Previously, he led the Mid Market Search Sales teams and the Sales Effectiveness team at Yahoo!, responsible for managing the Strategic Partnership with Microsoft for Search Advertising - a 10 year, multi-billion dollar a year relationship.  \n \nPrior to joining Yahoo!, he held positions of increasing responsibility in the corporate headquarters of Charles Schwab as an officer and VP, reporting to the President of Schwab Retail Brokerage. During that tenure, Leo led the Corporate Strategy team and managed teams to explore growth opportunities with responsibility for negotiation and operational implementation, and was the key stakeholder representing Schwab retail on numerous product and offering committees. Prior to this exec role, Leo held various Director level positions in Business Strategy, Product Marketing, and Technology Development for Schwab’s Institutional and Corporate Services Enterprises. \n \nBefore joining Charles Schwab, Leo worked as Director of Marketing and Product Development for a late-stage startup providing technology solutions to the Mortgage Brokerage and Banking industry. Leo also spent time as a Financial Analyst with Deutsche Alex Brown's Investment Banking Group, focusing on the eCommerce sector.  \n \nHe holds a BioMedical Engineering Degree from Harvard. \n \nSpecialties: General Management, Corporate Strategy, Sales and Service Management, Product Development, Product Marketing, Operational Engineering, Financial Planning and Analysis Leo has worked in and around the Online sector for most of his career, primarily in marketing, sales and product development roles, as well as in broader business strategy positions supporting executive management at both startups and fortune 500 companies.  \n \nCurrently, Leo is the Head of Client Services for the Americas at Yahoo. Previously, he was Vice President of Search Account Management at Yahoo!, leading the North America organization servicing 8,000 clients with $3Billion in annual revenue. Previously, he led the Mid Market Search Sales teams and the Sales Effectiveness team at Yahoo!, responsible for managing the Strategic Partnership with Microsoft for Search Advertising - a 10 year, multi-billion dollar a year relationship.  \n \nPrior to joining Yahoo!, he held positions of increasing responsibility in the corporate headquarters of Charles Schwab as an officer and VP, reporting to the President of Schwab Retail Brokerage. During that tenure, Leo led the Corporate Strategy team and managed teams to explore growth opportunities with responsibility for negotiation and operational implementation, and was the key stakeholder representing Schwab retail on numerous product and offering committees. Prior to this exec role, Leo held various Director level positions in Business Strategy, Product Marketing, and Technology Development for Schwab’s Institutional and Corporate Services Enterprises. \n \nBefore joining Charles Schwab, Leo worked as Director of Marketing and Product Development for a late-stage startup providing technology solutions to the Mortgage Brokerage and Banking industry. Leo also spent time as a Financial Analyst with Deutsche Alex Brown's Investment Banking Group, focusing on the eCommerce sector.  \n \nHe holds a BioMedical Engineering Degree from Harvard. \n \nSpecialties: General Management, Corporate Strategy, Sales and Service Management, Product Development, Product Marketing, Operational Engineering, Financial Planning and Analysis Leo has worked in and around the Online sector for most of his career, primarily in marketing, sales and product development roles, as well as in broader business strategy positions supporting executive management at both startups and fortune 500 companies.  \n \nCurrently, Leo is the Head of Client Services for the Americas at Yahoo. Previously, he was Vice President of Search Account Management at Yahoo!, leading the North America organization servicing 8,000 clients with $3Billion in annual revenue. Previously, he led the Mid Market Search Sales teams and the Sales Effectiveness team at Yahoo!, responsible for managing the Strategic Partnership with Microsoft for Search Advertising - a 10 year, multi-billion dollar a year relationship.  \n \nPrior to joining Yahoo!, he held positions of increasing responsibility in the corporate headquarters of Charles Schwab as an officer and VP, reporting to the President of Schwab Retail Brokerage. During that tenure, Leo led the Corporate Strategy team and managed teams to explore growth opportunities with responsibility for negotiation and operational implementation, and was the key stakeholder representing Schwab retail on numerous product and offering committees. Prior to this exec role, Leo held various Director level positions in Business Strategy, Product Marketing, and Technology Development for Schwab’s Institutional and Corporate Services Enterprises. \n \nBefore joining Charles Schwab, Leo worked as Director of Marketing and Product Development for a late-stage startup providing technology solutions to the Mortgage Brokerage and Banking industry. Leo also spent time as a Financial Analyst with Deutsche Alex Brown's Investment Banking Group, focusing on the eCommerce sector.  \n \nHe holds a BioMedical Engineering Degree from Harvard. \n \nSpecialties: General Management, Corporate Strategy, Sales and Service Management, Product Development, Product Marketing, Operational Engineering, Financial Planning and Analysis Experience Head of Client Services - Americas Yahoo October 2013  – Present (1 year 11 months) I lead the client facing teams for the Americas across the Search, Display and Native Advertising Businesses. Functional areas include Account Management, Optimization and Creative Services within Global Operations in support of the Americas Revenue organization. Vice President - Account Management, North America Yahoo! February 2013  – Present (2 years 7 months) Sunnyvale CA Leader of the Search Account Management Organization for the North America Region. These teams spanning Field Sales, Mid Market, Reseller Programs and 3rd Party Software Tool Providers service over 8000 Premium Advertisers, Agencies and Partners on behalf of the Yahoo! Bing Network in Paid Search Advertising, generating $3Billion in annual spend for Yahoo! and Microsoft Online. Senior Director - National Account Management Yahoo! January 2012  – Present (3 years 8 months) San Francisco Bay Area Leader of the Mid-Market Search teams, responsible for national account management of $1B+ annual Search Advertising business for Yahoo! / MSFT Search Alliance. Senior Director, Sales Effectiveness & Programs, Search Advertising Yahoo! April 2010  –  January 2012  (1 year 10 months) Sunnyvale, CA Working within Global Search Business Operations and with Senior Sales Leadership, responsible for defining the Americas region sales targets and objectives that will set the direction for Yahoo’s Search Advertising Sales teams to ensure programs and performance will achieve collective goals of the 10 year Microsoft / Yahoo! Strategic Partnership in Sponsored Search. Leads the Sales Effectiveness team responsible for representing a $2B+ revenue business, with direct accountability for $100M+ strategic sales initiatives. Consultant, Strategy Self Employed 2008  –  April 2010  (2 years) •\tKey bio-medical technology consultant on overall business strategy, developing business model and positioning for investment community, seek and secure private funding to sustain operating budget and develop future growth for a medical technology start up. \n•\tWork solely with CEO, CFO. Ability to bring to bear a combination of business strategy experience, banking experience and domain experience (bio medical) Vice President, Corporate Strategy Charles Schwab 2002  –  2007  (5 years) •\tReported to the President of Schwab Retail Brokerage, responsible for leading key strategic initiatives that span the entirety of the Schwab retail business.  \n•\tLed a cross functional team of officers to develop the strategy, planning, communications, and execution for the new Schwab “Investor Services Platform” - the tech and services for all client facing and support staff, as well as online users.  \n•\tHired and led a separate cross functional team to negotiate, developed and implemented a significant new business opportunity leading to a potential 30% increase in the new client base. Director, Product Marketing and Technology Platform Charles Schwab 2002  –  2007  (5 years) •\tResponsible for development and deployment of investment products (stocks, bonds, hedge funds, mutual funds) to 3,000+ independent financial advisors.  \n•\tTechnology platform, infrastructure and solutions: responsible for providing the overall vision, coordination, and specific initiative execution for Schwab institutional tech offering to 5,000+ investment advisors and systems for over 500 internal users (operations and client support).  \n•\tHired and lead leading market technology vendors on multiple projects and collaborated internally with multiple teams and groups. Director, Product Development. IMX 2000  –  2002  (2 years) •\tResponsible for directing the development of all new software applications for the company from inception to production, reporting to the CIO/CTO for an internet-based software development company focused on the U.S. mortgage market.  \n•\tManaged the strategic business development relationships of the company, reporting to the CEO. \n•\tRedesigned and managed the launch of company website, including differentiation of corporate site and application based entry points. Designed and managed the stages from development to successful launch of IMX’s second ASP-based application.  \n•\tNegotiated integral business partnership to insure quick launch and adoption of product. Corporate Finance Analyst Technology Deutsche Bank June 1999  –  July 2000  (1 year 2 months) Worked on IPOs, Secondary Offerings, Private Placements and M&A for DB Alex Brown in the eCommerce Group. Head of Client Services - Americas Yahoo October 2013  – Present (1 year 11 months) I lead the client facing teams for the Americas across the Search, Display and Native Advertising Businesses. Functional areas include Account Management, Optimization and Creative Services within Global Operations in support of the Americas Revenue organization. Head of Client Services - Americas Yahoo October 2013  – Present (1 year 11 months) I lead the client facing teams for the Americas across the Search, Display and Native Advertising Businesses. Functional areas include Account Management, Optimization and Creative Services within Global Operations in support of the Americas Revenue organization. Vice President - Account Management, North America Yahoo! February 2013  – Present (2 years 7 months) Sunnyvale CA Leader of the Search Account Management Organization for the North America Region. These teams spanning Field Sales, Mid Market, Reseller Programs and 3rd Party Software Tool Providers service over 8000 Premium Advertisers, Agencies and Partners on behalf of the Yahoo! Bing Network in Paid Search Advertising, generating $3Billion in annual spend for Yahoo! and Microsoft Online. Vice President - Account Management, North America Yahoo! February 2013  – Present (2 years 7 months) Sunnyvale CA Leader of the Search Account Management Organization for the North America Region. These teams spanning Field Sales, Mid Market, Reseller Programs and 3rd Party Software Tool Providers service over 8000 Premium Advertisers, Agencies and Partners on behalf of the Yahoo! Bing Network in Paid Search Advertising, generating $3Billion in annual spend for Yahoo! and Microsoft Online. Senior Director - National Account Management Yahoo! January 2012  – Present (3 years 8 months) San Francisco Bay Area Leader of the Mid-Market Search teams, responsible for national account management of $1B+ annual Search Advertising business for Yahoo! / MSFT Search Alliance. Senior Director - National Account Management Yahoo! January 2012  – Present (3 years 8 months) San Francisco Bay Area Leader of the Mid-Market Search teams, responsible for national account management of $1B+ annual Search Advertising business for Yahoo! / MSFT Search Alliance. Senior Director, Sales Effectiveness & Programs, Search Advertising Yahoo! April 2010  –  January 2012  (1 year 10 months) Sunnyvale, CA Working within Global Search Business Operations and with Senior Sales Leadership, responsible for defining the Americas region sales targets and objectives that will set the direction for Yahoo’s Search Advertising Sales teams to ensure programs and performance will achieve collective goals of the 10 year Microsoft / Yahoo! Strategic Partnership in Sponsored Search. Leads the Sales Effectiveness team responsible for representing a $2B+ revenue business, with direct accountability for $100M+ strategic sales initiatives. Senior Director, Sales Effectiveness & Programs, Search Advertising Yahoo! April 2010  –  January 2012  (1 year 10 months) Sunnyvale, CA Working within Global Search Business Operations and with Senior Sales Leadership, responsible for defining the Americas region sales targets and objectives that will set the direction for Yahoo’s Search Advertising Sales teams to ensure programs and performance will achieve collective goals of the 10 year Microsoft / Yahoo! Strategic Partnership in Sponsored Search. Leads the Sales Effectiveness team responsible for representing a $2B+ revenue business, with direct accountability for $100M+ strategic sales initiatives. Consultant, Strategy Self Employed 2008  –  April 2010  (2 years) •\tKey bio-medical technology consultant on overall business strategy, developing business model and positioning for investment community, seek and secure private funding to sustain operating budget and develop future growth for a medical technology start up. \n•\tWork solely with CEO, CFO. Ability to bring to bear a combination of business strategy experience, banking experience and domain experience (bio medical) Consultant, Strategy Self Employed 2008  –  April 2010  (2 years) •\tKey bio-medical technology consultant on overall business strategy, developing business model and positioning for investment community, seek and secure private funding to sustain operating budget and develop future growth for a medical technology start up. \n•\tWork solely with CEO, CFO. Ability to bring to bear a combination of business strategy experience, banking experience and domain experience (bio medical) Vice President, Corporate Strategy Charles Schwab 2002  –  2007  (5 years) •\tReported to the President of Schwab Retail Brokerage, responsible for leading key strategic initiatives that span the entirety of the Schwab retail business.  \n•\tLed a cross functional team of officers to develop the strategy, planning, communications, and execution for the new Schwab “Investor Services Platform” - the tech and services for all client facing and support staff, as well as online users.  \n•\tHired and led a separate cross functional team to negotiate, developed and implemented a significant new business opportunity leading to a potential 30% increase in the new client base. Vice President, Corporate Strategy Charles Schwab 2002  –  2007  (5 years) •\tReported to the President of Schwab Retail Brokerage, responsible for leading key strategic initiatives that span the entirety of the Schwab retail business.  \n•\tLed a cross functional team of officers to develop the strategy, planning, communications, and execution for the new Schwab “Investor Services Platform” - the tech and services for all client facing and support staff, as well as online users.  \n•\tHired and led a separate cross functional team to negotiate, developed and implemented a significant new business opportunity leading to a potential 30% increase in the new client base. Director, Product Marketing and Technology Platform Charles Schwab 2002  –  2007  (5 years) •\tResponsible for development and deployment of investment products (stocks, bonds, hedge funds, mutual funds) to 3,000+ independent financial advisors.  \n•\tTechnology platform, infrastructure and solutions: responsible for providing the overall vision, coordination, and specific initiative execution for Schwab institutional tech offering to 5,000+ investment advisors and systems for over 500 internal users (operations and client support).  \n•\tHired and lead leading market technology vendors on multiple projects and collaborated internally with multiple teams and groups. Director, Product Marketing and Technology Platform Charles Schwab 2002  –  2007  (5 years) •\tResponsible for development and deployment of investment products (stocks, bonds, hedge funds, mutual funds) to 3,000+ independent financial advisors.  \n•\tTechnology platform, infrastructure and solutions: responsible for providing the overall vision, coordination, and specific initiative execution for Schwab institutional tech offering to 5,000+ investment advisors and systems for over 500 internal users (operations and client support).  \n•\tHired and lead leading market technology vendors on multiple projects and collaborated internally with multiple teams and groups. Director, Product Development. IMX 2000  –  2002  (2 years) •\tResponsible for directing the development of all new software applications for the company from inception to production, reporting to the CIO/CTO for an internet-based software development company focused on the U.S. mortgage market.  \n•\tManaged the strategic business development relationships of the company, reporting to the CEO. \n•\tRedesigned and managed the launch of company website, including differentiation of corporate site and application based entry points. Designed and managed the stages from development to successful launch of IMX’s second ASP-based application.  \n•\tNegotiated integral business partnership to insure quick launch and adoption of product. Director, Product Development. IMX 2000  –  2002  (2 years) •\tResponsible for directing the development of all new software applications for the company from inception to production, reporting to the CIO/CTO for an internet-based software development company focused on the U.S. mortgage market.  \n•\tManaged the strategic business development relationships of the company, reporting to the CEO. \n•\tRedesigned and managed the launch of company website, including differentiation of corporate site and application based entry points. Designed and managed the stages from development to successful launch of IMX’s second ASP-based application.  \n•\tNegotiated integral business partnership to insure quick launch and adoption of product. Corporate Finance Analyst Technology Deutsche Bank June 1999  –  July 2000  (1 year 2 months) Worked on IPOs, Secondary Offerings, Private Placements and M&A for DB Alex Brown in the eCommerce Group. Corporate Finance Analyst Technology Deutsche Bank June 1999  –  July 2000  (1 year 2 months) Worked on IPOs, Secondary Offerings, Private Placements and M&A for DB Alex Brown in the eCommerce Group. Skills E-commerce Strategy Strategic Partnerships Start-ups Product Marketing Cross-functional Team... Search Advertising PPC Management SEM Web Analytics Business Strategy Business Development Online Advertising Program Management Product Development New Business Development Leadership Marketing Account Management Display Advertising See 6+     See less Skills  E-commerce Strategy Strategic Partnerships Start-ups Product Marketing Cross-functional Team... Search Advertising PPC Management SEM Web Analytics Business Strategy Business Development Online Advertising Program Management Product Development New Business Development Leadership Marketing Account Management Display Advertising See 6+     See less E-commerce Strategy Strategic Partnerships Start-ups Product Marketing Cross-functional Team... Search Advertising PPC Management SEM Web Analytics Business Strategy Business Development Online Advertising Program Management Product Development New Business Development Leadership Marketing Account Management Display Advertising See 6+     See less E-commerce Strategy Strategic Partnerships Start-ups Product Marketing Cross-functional Team... Search Advertising PPC Management SEM Web Analytics Business Strategy Business Development Online Advertising Program Management Product Development New Business Development Leadership Marketing Account Management Display Advertising See 6+     See less Education Harvard University Biomedical Engineering,  Engineering 1994  – 1999 Activities and Societies:  Fly Club ,  Hasty Pudding Club Harvard University Biomedical Engineering,  Engineering 1994  – 1999 Activities and Societies:  Fly Club ,  Hasty Pudding Club Harvard University Biomedical Engineering,  Engineering 1994  – 1999 Activities and Societies:  Fly Club ,  Hasty Pudding Club Harvard University Biomedical Engineering,  Engineering 1994  – 1999 Activities and Societies:  Fly Club ,  Hasty Pudding Club ", "Summary Web site producer, Payment service in the Internet. \nProduct marketing at wireless devices. Specialties:Competitive analysis, financing, web site producing. Summary Web site producer, Payment service in the Internet. \nProduct marketing at wireless devices. Specialties:Competitive analysis, financing, web site producing. Web site producer, Payment service in the Internet. \nProduct marketing at wireless devices. Specialties:Competitive analysis, financing, web site producing. Web site producer, Payment service in the Internet. \nProduct marketing at wireless devices. Specialties:Competitive analysis, financing, web site producing. Experience Executive Director Yahoo Custmer Relations October 2013  – Present (1 year 11 months) Risk Management Office manager Yahoo! JAPAN July 2013  – Present (2 years 2 months) Senior VP, Executive Director Yahoo Customer Relations July 2012  –  September 2013  (1 year 3 months) Consumer Svc Div. Ceo And President Netrust Pte Ltd June 2012  –  June 2013  (1 year 1 month) Executive Director Y's insurance June 2009  –  June 2013  (4 years 1 month) Executive Director Japannetbank (Mitsui-Sumitomo bank's subsidiary) June 2009  –  June 2013  (4 years 1 month) VP ID&Payment Service Dept and Biz Dev Dept., Consumer Biz Unit at Yahoo! JAPAN Yahoo! JAPAN January 2010  –  June 2012  (2 years 6 months) Manager for Payment service and Consumer service(ie. Social game, Comics, Avator, Matching, Y!Premium, Y!BB, Insuarance, etc.). Executive director Netrust Pte Ltd April 2006  –  June 2012  (6 years 3 months) VP ID&Payment Service Dept, Consumer Biz Unit Yahoo! JAPAN April 2009  –  December 2010  (1 year 9 months) Working for Payment service and Personal service(ie. Comics, Avator, Matching, etc.). VP, Auction Business Unit Yahoo! JAPAN October 2000  –  March 2009  (8 years 6 months) Producer of JP Auction Yahoo Inc. October 2000  –  March 2009  (8 years 6 months) a part-time teacher Waseda University April 2006  –  March 2008  (2 years) as part-time teacher for the internet business at University of Waseda sponcered by Yahoo! JAPAN Product Mgr Motorola April 1991  –  October 2000  (9 years 7 months) Program mgr Motorola Japan Ltd. 1998  –  2000  (2 years) Marketing Motorola. Inc. Communication sector. 1991  –  1998  (7 years) Executive Director Yahoo Custmer Relations October 2013  – Present (1 year 11 months) Executive Director Yahoo Custmer Relations October 2013  – Present (1 year 11 months) Risk Management Office manager Yahoo! JAPAN July 2013  – Present (2 years 2 months) Risk Management Office manager Yahoo! JAPAN July 2013  – Present (2 years 2 months) Senior VP, Executive Director Yahoo Customer Relations July 2012  –  September 2013  (1 year 3 months) Consumer Svc Div. Senior VP, Executive Director Yahoo Customer Relations July 2012  –  September 2013  (1 year 3 months) Consumer Svc Div. Ceo And President Netrust Pte Ltd June 2012  –  June 2013  (1 year 1 month) Ceo And President Netrust Pte Ltd June 2012  –  June 2013  (1 year 1 month) Executive Director Y's insurance June 2009  –  June 2013  (4 years 1 month) Executive Director Y's insurance June 2009  –  June 2013  (4 years 1 month) Executive Director Japannetbank (Mitsui-Sumitomo bank's subsidiary) June 2009  –  June 2013  (4 years 1 month) Executive Director Japannetbank (Mitsui-Sumitomo bank's subsidiary) June 2009  –  June 2013  (4 years 1 month) VP ID&Payment Service Dept and Biz Dev Dept., Consumer Biz Unit at Yahoo! JAPAN Yahoo! JAPAN January 2010  –  June 2012  (2 years 6 months) Manager for Payment service and Consumer service(ie. Social game, Comics, Avator, Matching, Y!Premium, Y!BB, Insuarance, etc.). VP ID&Payment Service Dept and Biz Dev Dept., Consumer Biz Unit at Yahoo! JAPAN Yahoo! JAPAN January 2010  –  June 2012  (2 years 6 months) Manager for Payment service and Consumer service(ie. Social game, Comics, Avator, Matching, Y!Premium, Y!BB, Insuarance, etc.). Executive director Netrust Pte Ltd April 2006  –  June 2012  (6 years 3 months) Executive director Netrust Pte Ltd April 2006  –  June 2012  (6 years 3 months) VP ID&Payment Service Dept, Consumer Biz Unit Yahoo! JAPAN April 2009  –  December 2010  (1 year 9 months) Working for Payment service and Personal service(ie. Comics, Avator, Matching, etc.). VP ID&Payment Service Dept, Consumer Biz Unit Yahoo! JAPAN April 2009  –  December 2010  (1 year 9 months) Working for Payment service and Personal service(ie. Comics, Avator, Matching, etc.). VP, Auction Business Unit Yahoo! JAPAN October 2000  –  March 2009  (8 years 6 months) VP, Auction Business Unit Yahoo! JAPAN October 2000  –  March 2009  (8 years 6 months) Producer of JP Auction Yahoo Inc. October 2000  –  March 2009  (8 years 6 months) Producer of JP Auction Yahoo Inc. October 2000  –  March 2009  (8 years 6 months) a part-time teacher Waseda University April 2006  –  March 2008  (2 years) as part-time teacher for the internet business at University of Waseda sponcered by Yahoo! JAPAN a part-time teacher Waseda University April 2006  –  March 2008  (2 years) as part-time teacher for the internet business at University of Waseda sponcered by Yahoo! JAPAN Product Mgr Motorola April 1991  –  October 2000  (9 years 7 months) Product Mgr Motorola April 1991  –  October 2000  (9 years 7 months) Program mgr Motorola Japan Ltd. 1998  –  2000  (2 years) Program mgr Motorola Japan Ltd. 1998  –  2000  (2 years) Marketing Motorola. Inc. Communication sector. 1991  –  1998  (7 years) Marketing Motorola. Inc. Communication sector. 1991  –  1998  (7 years) Languages English Limited working proficiency Japanese Full professional proficiency English Limited working proficiency Japanese Full professional proficiency English Limited working proficiency Japanese Full professional proficiency Limited working proficiency Full professional proficiency Skills Product Marketing Competitive Analysis e-commerce producing Online Auctions Telecommunications Vendor Management Wireless Mobile Devices Cloud Computing Strategic Partnerships Account Management Product Management Business Development Marketing E-commerce Skills  Product Marketing Competitive Analysis e-commerce producing Online Auctions Telecommunications Vendor Management Wireless Mobile Devices Cloud Computing Strategic Partnerships Account Management Product Management Business Development Marketing E-commerce Product Marketing Competitive Analysis e-commerce producing Online Auctions Telecommunications Vendor Management Wireless Mobile Devices Cloud Computing Strategic Partnerships Account Management Product Management Business Development Marketing E-commerce Product Marketing Competitive Analysis e-commerce producing Online Auctions Telecommunications Vendor Management Wireless Mobile Devices Cloud Computing Strategic Partnerships Account Management Product Management Business Development Marketing E-commerce ", "Summary 20 years experience in Digital and Media Industry, building winning teams, with solid track record of overachieved results, business growth, successful launches. \nSenior leadership positions in General Management, Sales, Marketing and Strategic Partnerships. \nStrategic and creative leader, driving innovative projects in fast moving environment across international teams. Summary 20 years experience in Digital and Media Industry, building winning teams, with solid track record of overachieved results, business growth, successful launches. \nSenior leadership positions in General Management, Sales, Marketing and Strategic Partnerships. \nStrategic and creative leader, driving innovative projects in fast moving environment across international teams. 20 years experience in Digital and Media Industry, building winning teams, with solid track record of overachieved results, business growth, successful launches. \nSenior leadership positions in General Management, Sales, Marketing and Strategic Partnerships. \nStrategic and creative leader, driving innovative projects in fast moving environment across international teams. 20 years experience in Digital and Media Industry, building winning teams, with solid track record of overachieved results, business growth, successful launches. \nSenior leadership positions in General Management, Sales, Marketing and Strategic Partnerships. \nStrategic and creative leader, driving innovative projects in fast moving environment across international teams. Experience VP, Yahoo EMEA Commercial Director Yahoo February 2014  – Present (1 year 7 months) London, United Kingdom Responsible for $M400+ advertising revenue (Search, Display, Video, Programmatic, Social and Content marketing including Tumblr).  \nLeading a sales team of 280+ persons in 8 offices. \nMember of the Yahoo EMEA Leadership Team. Managing Director & VP Sales, Yahoo France Yahoo October 2009  –  January 2014  (4 years 4 months) Paris, France Country Manager of a team of 140+, leading a sales team of 80+ (Sales, B2B Marketing, Research, Ad solutions, Ad Production and Sponsorship). \nIncreased Yahoo revenue and display market share (#2 online sales house in France). \nBuilt the best Digital Sales team in France (Yahoo France scored Best sales team in Yahoo Client Survey in Dec 2012) and the most engaged in Yahoo EMEA (#1 at the Yahoo EMEA employee engagement survey in 2013). \nSuccessful partnerships created with Media and top advertisers around original content. \nLaunch of Yahoo Studio, in house team dedicated to brand content and social marketing. This Yahoo France initiative was awarded Yahoo EMEA best practice in 2011 and then rolled out in all EMEA in 2012. \nBoards member: IAB France, SRI, ARPP, MEDIAMETRIE Internet Committe and Renaissance Numerique. Commercial Director, Yahoo France Yahoo January 2008  –  October 2009  (1 year 10 months) Paris Area, France Designed and led the new combined Search & Display Yahoo France Sales team of 70+. \nTeam ranked #1 at the Yahoo EMEA engagement survey in 2008. \nCreated and launched the new Yahoo combined advertiser offer for the French market. \nOverachieved Sales targets and increased Display market share (50% higher than the average Yahoo Market share in EMEA). Commercial Director Display, Yahoo France Yahoo November 2006  –  December 2007  (1 year 2 months) Paris Area, France Responsible of a sales team of 20+ driving Display revenue. \nRepositioned offer and pricing for the French market \nLaunched the Yahoo Research Panel, French best practice rolled out in EMEA Sales Director, L'EXPRESS L'Express February 2002  –  October 2006  (4 years 9 months) Paris Area, France Responsible of a team of 10, driving advertising revenue. \nIncreased L'EXPRESS advertising market share, which became #1 News in advertising (Secodip). \nLaunched L'EXPRESS Style (the lifestyle edition, renamed L'ExpressMag). Partnerships and Marketing Director, Square Finance (in charge of Groupe Expansion Internet sites) Groupe Expansion January 2000  –  January 2002  (2 years 1 month) Paris Area, France Square Finance was the Internet Department of Groupe Expansion in joint Venture with Vivendi Net. \nCreated the Marketing and Communication department and successfully launched the financial site Squarefinance.com. \nIn charge of all partnerships to increase the audience of the web sites and monetise their contents. \nManagement of a team of 10. Sales Director, La Vie Financière Magazine Groupe Expansion January 1996  –  December 1999  (4 years) Paris Area, France Responsible of a team of 4, driving advertising revenue for a leading financial magazine. \nQuadrupled the revenue and Increased advertising market share by +10 pts (Secodip). Sales Executive, L'Expansion and L'Entreprise magazines Groupe Expansion January 1992  –  December 1995  (4 years) Paris Area, France VP, Yahoo EMEA Commercial Director Yahoo February 2014  – Present (1 year 7 months) London, United Kingdom Responsible for $M400+ advertising revenue (Search, Display, Video, Programmatic, Social and Content marketing including Tumblr).  \nLeading a sales team of 280+ persons in 8 offices. \nMember of the Yahoo EMEA Leadership Team. VP, Yahoo EMEA Commercial Director Yahoo February 2014  – Present (1 year 7 months) London, United Kingdom Responsible for $M400+ advertising revenue (Search, Display, Video, Programmatic, Social and Content marketing including Tumblr).  \nLeading a sales team of 280+ persons in 8 offices. \nMember of the Yahoo EMEA Leadership Team. Managing Director & VP Sales, Yahoo France Yahoo October 2009  –  January 2014  (4 years 4 months) Paris, France Country Manager of a team of 140+, leading a sales team of 80+ (Sales, B2B Marketing, Research, Ad solutions, Ad Production and Sponsorship). \nIncreased Yahoo revenue and display market share (#2 online sales house in France). \nBuilt the best Digital Sales team in France (Yahoo France scored Best sales team in Yahoo Client Survey in Dec 2012) and the most engaged in Yahoo EMEA (#1 at the Yahoo EMEA employee engagement survey in 2013). \nSuccessful partnerships created with Media and top advertisers around original content. \nLaunch of Yahoo Studio, in house team dedicated to brand content and social marketing. This Yahoo France initiative was awarded Yahoo EMEA best practice in 2011 and then rolled out in all EMEA in 2012. \nBoards member: IAB France, SRI, ARPP, MEDIAMETRIE Internet Committe and Renaissance Numerique. Managing Director & VP Sales, Yahoo France Yahoo October 2009  –  January 2014  (4 years 4 months) Paris, France Country Manager of a team of 140+, leading a sales team of 80+ (Sales, B2B Marketing, Research, Ad solutions, Ad Production and Sponsorship). \nIncreased Yahoo revenue and display market share (#2 online sales house in France). \nBuilt the best Digital Sales team in France (Yahoo France scored Best sales team in Yahoo Client Survey in Dec 2012) and the most engaged in Yahoo EMEA (#1 at the Yahoo EMEA employee engagement survey in 2013). \nSuccessful partnerships created with Media and top advertisers around original content. \nLaunch of Yahoo Studio, in house team dedicated to brand content and social marketing. This Yahoo France initiative was awarded Yahoo EMEA best practice in 2011 and then rolled out in all EMEA in 2012. \nBoards member: IAB France, SRI, ARPP, MEDIAMETRIE Internet Committe and Renaissance Numerique. Commercial Director, Yahoo France Yahoo January 2008  –  October 2009  (1 year 10 months) Paris Area, France Designed and led the new combined Search & Display Yahoo France Sales team of 70+. \nTeam ranked #1 at the Yahoo EMEA engagement survey in 2008. \nCreated and launched the new Yahoo combined advertiser offer for the French market. \nOverachieved Sales targets and increased Display market share (50% higher than the average Yahoo Market share in EMEA). Commercial Director, Yahoo France Yahoo January 2008  –  October 2009  (1 year 10 months) Paris Area, France Designed and led the new combined Search & Display Yahoo France Sales team of 70+. \nTeam ranked #1 at the Yahoo EMEA engagement survey in 2008. \nCreated and launched the new Yahoo combined advertiser offer for the French market. \nOverachieved Sales targets and increased Display market share (50% higher than the average Yahoo Market share in EMEA). Commercial Director Display, Yahoo France Yahoo November 2006  –  December 2007  (1 year 2 months) Paris Area, France Responsible of a sales team of 20+ driving Display revenue. \nRepositioned offer and pricing for the French market \nLaunched the Yahoo Research Panel, French best practice rolled out in EMEA Commercial Director Display, Yahoo France Yahoo November 2006  –  December 2007  (1 year 2 months) Paris Area, France Responsible of a sales team of 20+ driving Display revenue. \nRepositioned offer and pricing for the French market \nLaunched the Yahoo Research Panel, French best practice rolled out in EMEA Sales Director, L'EXPRESS L'Express February 2002  –  October 2006  (4 years 9 months) Paris Area, France Responsible of a team of 10, driving advertising revenue. \nIncreased L'EXPRESS advertising market share, which became #1 News in advertising (Secodip). \nLaunched L'EXPRESS Style (the lifestyle edition, renamed L'ExpressMag). Sales Director, L'EXPRESS L'Express February 2002  –  October 2006  (4 years 9 months) Paris Area, France Responsible of a team of 10, driving advertising revenue. \nIncreased L'EXPRESS advertising market share, which became #1 News in advertising (Secodip). \nLaunched L'EXPRESS Style (the lifestyle edition, renamed L'ExpressMag). Partnerships and Marketing Director, Square Finance (in charge of Groupe Expansion Internet sites) Groupe Expansion January 2000  –  January 2002  (2 years 1 month) Paris Area, France Square Finance was the Internet Department of Groupe Expansion in joint Venture with Vivendi Net. \nCreated the Marketing and Communication department and successfully launched the financial site Squarefinance.com. \nIn charge of all partnerships to increase the audience of the web sites and monetise their contents. \nManagement of a team of 10. Partnerships and Marketing Director, Square Finance (in charge of Groupe Expansion Internet sites) Groupe Expansion January 2000  –  January 2002  (2 years 1 month) Paris Area, France Square Finance was the Internet Department of Groupe Expansion in joint Venture with Vivendi Net. \nCreated the Marketing and Communication department and successfully launched the financial site Squarefinance.com. \nIn charge of all partnerships to increase the audience of the web sites and monetise their contents. \nManagement of a team of 10. Sales Director, La Vie Financière Magazine Groupe Expansion January 1996  –  December 1999  (4 years) Paris Area, France Responsible of a team of 4, driving advertising revenue for a leading financial magazine. \nQuadrupled the revenue and Increased advertising market share by +10 pts (Secodip). Sales Director, La Vie Financière Magazine Groupe Expansion January 1996  –  December 1999  (4 years) Paris Area, France Responsible of a team of 4, driving advertising revenue for a leading financial magazine. \nQuadrupled the revenue and Increased advertising market share by +10 pts (Secodip). Sales Executive, L'Expansion and L'Entreprise magazines Groupe Expansion January 1992  –  December 1995  (4 years) Paris Area, France Sales Executive, L'Expansion and L'Entreprise magazines Groupe Expansion January 1992  –  December 1995  (4 years) Paris Area, France Languages French Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Russian Elementary proficiency French Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Russian Elementary proficiency French Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Russian Elementary proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Digital Strategy Online Advertising Digital Marketing Digital Media Mobile Marketing Mobile Advertising SEM Advertising E-commerce Web Analytics Strategic Partnerships Online Marketing Affiliate Marketing New Media Marketing Strategy Strategy Management Marketing Business Development Marketing Communications See 5+     See less Skills  Digital Strategy Online Advertising Digital Marketing Digital Media Mobile Marketing Mobile Advertising SEM Advertising E-commerce Web Analytics Strategic Partnerships Online Marketing Affiliate Marketing New Media Marketing Strategy Strategy Management Marketing Business Development Marketing Communications See 5+     See less Digital Strategy Online Advertising Digital Marketing Digital Media Mobile Marketing Mobile Advertising SEM Advertising E-commerce Web Analytics Strategic Partnerships Online Marketing Affiliate Marketing New Media Marketing Strategy Strategy Management Marketing Business Development Marketing Communications See 5+     See less Digital Strategy Online Advertising Digital Marketing Digital Media Mobile Marketing Mobile Advertising SEM Advertising E-commerce Web Analytics Strategic Partnerships Online Marketing Affiliate Marketing New Media Marketing Strategy Strategy Management Marketing Business Development Marketing Communications See 5+     See less Education EDHEC Business School Master's degree,  Business Administration and Management , General 1988  – 1991 EDHEC Business School Master's degree,  Business Administration and Management , General 1988  – 1991 EDHEC Business School Master's degree,  Business Administration and Management , General 1988  – 1991 EDHEC Business School Master's degree,  Business Administration and Management , General 1988  – 1991 ", "Summary Strategic marketing leader with proven history of team development, brand building, revenue growth, vision, innovation and customer-focused marketing solutions for B2C and B2B audiences. Extensive experience of working within fast-paced environments for both large corporations and start-ups in EMEA and the US. 13+ years working in the digital industry. Summary Strategic marketing leader with proven history of team development, brand building, revenue growth, vision, innovation and customer-focused marketing solutions for B2C and B2B audiences. Extensive experience of working within fast-paced environments for both large corporations and start-ups in EMEA and the US. 13+ years working in the digital industry. Strategic marketing leader with proven history of team development, brand building, revenue growth, vision, innovation and customer-focused marketing solutions for B2C and B2B audiences. Extensive experience of working within fast-paced environments for both large corporations and start-ups in EMEA and the US. 13+ years working in the digital industry. Strategic marketing leader with proven history of team development, brand building, revenue growth, vision, innovation and customer-focused marketing solutions for B2C and B2B audiences. Extensive experience of working within fast-paced environments for both large corporations and start-ups in EMEA and the US. 13+ years working in the digital industry. Experience VP, Head of International Marketing and Editorial Yahoo April 2015  – Present (5 months) VP, Head of International Marketing Yahoo October 2013  – Present (1 year 11 months) London, United Kingdom Lead consumer and business marketer at Yahoo! for EMEA, APAC, LATAM and Canada Senior Director, Head of International Marketing Yahoo! March 2013  – Present (2 years 6 months) Lead consumer and business marketer at Yahoo! for EMEA, APAC, LATAM and Canada Senior Director, Head of Marketing EMEA Yahoo! January 2012  –  February 2013  (1 year 2 months) B2B Marketing Director, EMEA Yahoo! May 2010  –  January 2012  (1 year 9 months) Global Marketing Director Phorm October 2007  –  May 2010  (2 years 8 months) VP Marketing and Business Development Transit Televison Network 2003  –  2007  (4 years) Strategic Development Manager Telegraph Group January 2001  –  May 2003  (2 years 5 months) Business Development Analyst Firstmark Communications April 2000  –  December 2000  (9 months) VP, Head of International Marketing and Editorial Yahoo April 2015  – Present (5 months) VP, Head of International Marketing and Editorial Yahoo April 2015  – Present (5 months) VP, Head of International Marketing Yahoo October 2013  – Present (1 year 11 months) London, United Kingdom Lead consumer and business marketer at Yahoo! for EMEA, APAC, LATAM and Canada VP, Head of International Marketing Yahoo October 2013  – Present (1 year 11 months) London, United Kingdom Lead consumer and business marketer at Yahoo! for EMEA, APAC, LATAM and Canada Senior Director, Head of International Marketing Yahoo! March 2013  – Present (2 years 6 months) Lead consumer and business marketer at Yahoo! for EMEA, APAC, LATAM and Canada Senior Director, Head of International Marketing Yahoo! March 2013  – Present (2 years 6 months) Lead consumer and business marketer at Yahoo! for EMEA, APAC, LATAM and Canada Senior Director, Head of Marketing EMEA Yahoo! January 2012  –  February 2013  (1 year 2 months) Senior Director, Head of Marketing EMEA Yahoo! January 2012  –  February 2013  (1 year 2 months) B2B Marketing Director, EMEA Yahoo! May 2010  –  January 2012  (1 year 9 months) B2B Marketing Director, EMEA Yahoo! May 2010  –  January 2012  (1 year 9 months) Global Marketing Director Phorm October 2007  –  May 2010  (2 years 8 months) Global Marketing Director Phorm October 2007  –  May 2010  (2 years 8 months) VP Marketing and Business Development Transit Televison Network 2003  –  2007  (4 years) VP Marketing and Business Development Transit Televison Network 2003  –  2007  (4 years) Strategic Development Manager Telegraph Group January 2001  –  May 2003  (2 years 5 months) Strategic Development Manager Telegraph Group January 2001  –  May 2003  (2 years 5 months) Business Development Analyst Firstmark Communications April 2000  –  December 2000  (9 months) Business Development Analyst Firstmark Communications April 2000  –  December 2000  (9 months) Skills Online Advertising Digital Marketing Digital Strategy Digital Media Mobile Marketing SEM Advertising Strategic Partnerships Marketing Strategy E-commerce Product Management Behavioral Targeting Mobile Devices Product Marketing PPC Email Marketing Marketing Communications Social Media Marketing Social Media SEO Online Marketing See 6+     See less Skills  Online Advertising Digital Marketing Digital Strategy Digital Media Mobile Marketing SEM Advertising Strategic Partnerships Marketing Strategy E-commerce Product Management Behavioral Targeting Mobile Devices Product Marketing PPC Email Marketing Marketing Communications Social Media Marketing Social Media SEO Online Marketing See 6+     See less Online Advertising Digital Marketing Digital Strategy Digital Media Mobile Marketing SEM Advertising Strategic Partnerships Marketing Strategy E-commerce Product Management Behavioral Targeting Mobile Devices Product Marketing PPC Email Marketing Marketing Communications Social Media Marketing Social Media SEO Online Marketing See 6+     See less Online Advertising Digital Marketing Digital Strategy Digital Media Mobile Marketing SEM Advertising Strategic Partnerships Marketing Strategy E-commerce Product Management Behavioral Targeting Mobile Devices Product Marketing PPC Email Marketing Marketing Communications Social Media Marketing Social Media SEO Online Marketing See 6+     See less Education Newcastle University 1994  – 1997 Wellington College 1989  – 1994 Newcastle University 1994  – 1997 Newcastle University 1994  – 1997 Newcastle University 1994  – 1997 Wellington College 1989  – 1994 Wellington College 1989  – 1994 Wellington College 1989  – 1994 ", "Languages English Spanish German (20%) English Spanish German (20%) English Spanish German (20%) Skills Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Skills  Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Honors & Awards Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award ", "Experience Sr. Director, Global Ad Creative Technology Yahoo May 2014  – Present (1 year 4 months) Sunnyvale Global Premium Rich Media, Technical Operations, Creative Services; overseeing teams in NAR, EMEA, LATAM and APAC executing advertising solutions across Yahoo and Global Partners. Sr. Director, Ad Tech Americas Yahoo January 2011  –  May 2014  (3 years 5 months) I'm responsible for Rich Media operations for the Yahoo! I manage teams responsible for 3PAS certification, Custom Solutions, Creative Services, Tech Ops and Campaign management. to executing Rich Media across PC, Tablet, Mobile, and Video. I work with sales, agencies and their clients on new Rich Media formats utilizing the latest technologies allowing advertisers new ways to reach users effectively. Additionally, I partner with product teams to develop existing and new ad products ensuring a quality user and advertising experience. My goal is always to innovative ensuring users have a great experience and continue to come back. Sr. Director Product Management, Global Homepage advertising Yahoo! April 2009  –  January 2011  (1 year 10 months) Developed and launched globalization for Homepage advertising, Rich Media and Marketing products. I worked with regional Homepage teams to develop advertising products capable of cross border penetration understanding regional constraints with legal, policy and user restrictions and capabilities. I represented the Products org regionally for new Homepage designs and product releases. Creative Director/ Director of Product Management Yahoo! December 2006  –  March 2009  (2 years 4 months) Managed Rich Media Creative team. Launched new products adding incremental revenue. Creative Director Yahoo! October 2004  –  December 2006  (2 years 3 months) Sunnyvale Creative direction for Yahoo advertising and marketing products. Additionally responsible for educating the sales force and product teams of Rich Media capabilities. Continued overseeing the interactive Creative team in charge of developing Rich Media products. Manager, UED Homepage Yahoo! October 2003  –  October 2004  (1 year 1 month) Sunnyvale Developed a Rich Media Interactive/Creative team of Flash designers, developers and front end engineers focused on white glove out of the box innovative campaigns. The team focused on customer service and creative innovation developing a leadership position amongst its direct competition. Art Director Yahoo! August 2002  –  October 2003  (1 year 3 months) Sunnyvale, CA Responsible for creating and developing early Rich Media advertising for Yahoo! Homepage. As one of the first Yahoo Homepage employees focused on advertising I created and developed new innovative Rich Media products, establishing Yahoo! as a leader in the industry. Worked with the Yahoo Sales team to develop presentations for fortune 100 companies. Met with agencies and their clients during the pitch process for creative brainstorms and technical representation. Interactive Designer Perimetre Design December 1999  –  August 2002  (2 years 9 months) CE Columbia Pictures 1996  –  1999  (3 years) Culver City EA to SVP of Production Turner Pictures October 1994  –  December 1996  (2 years 3 months) Los Angeles Sr. Director, Global Ad Creative Technology Yahoo May 2014  – Present (1 year 4 months) Sunnyvale Global Premium Rich Media, Technical Operations, Creative Services; overseeing teams in NAR, EMEA, LATAM and APAC executing advertising solutions across Yahoo and Global Partners. Sr. Director, Global Ad Creative Technology Yahoo May 2014  – Present (1 year 4 months) Sunnyvale Global Premium Rich Media, Technical Operations, Creative Services; overseeing teams in NAR, EMEA, LATAM and APAC executing advertising solutions across Yahoo and Global Partners. Sr. Director, Ad Tech Americas Yahoo January 2011  –  May 2014  (3 years 5 months) I'm responsible for Rich Media operations for the Yahoo! I manage teams responsible for 3PAS certification, Custom Solutions, Creative Services, Tech Ops and Campaign management. to executing Rich Media across PC, Tablet, Mobile, and Video. I work with sales, agencies and their clients on new Rich Media formats utilizing the latest technologies allowing advertisers new ways to reach users effectively. Additionally, I partner with product teams to develop existing and new ad products ensuring a quality user and advertising experience. My goal is always to innovative ensuring users have a great experience and continue to come back. Sr. Director, Ad Tech Americas Yahoo January 2011  –  May 2014  (3 years 5 months) I'm responsible for Rich Media operations for the Yahoo! I manage teams responsible for 3PAS certification, Custom Solutions, Creative Services, Tech Ops and Campaign management. to executing Rich Media across PC, Tablet, Mobile, and Video. I work with sales, agencies and their clients on new Rich Media formats utilizing the latest technologies allowing advertisers new ways to reach users effectively. Additionally, I partner with product teams to develop existing and new ad products ensuring a quality user and advertising experience. My goal is always to innovative ensuring users have a great experience and continue to come back. Sr. Director Product Management, Global Homepage advertising Yahoo! April 2009  –  January 2011  (1 year 10 months) Developed and launched globalization for Homepage advertising, Rich Media and Marketing products. I worked with regional Homepage teams to develop advertising products capable of cross border penetration understanding regional constraints with legal, policy and user restrictions and capabilities. I represented the Products org regionally for new Homepage designs and product releases. Sr. Director Product Management, Global Homepage advertising Yahoo! April 2009  –  January 2011  (1 year 10 months) Developed and launched globalization for Homepage advertising, Rich Media and Marketing products. I worked with regional Homepage teams to develop advertising products capable of cross border penetration understanding regional constraints with legal, policy and user restrictions and capabilities. I represented the Products org regionally for new Homepage designs and product releases. Creative Director/ Director of Product Management Yahoo! December 2006  –  March 2009  (2 years 4 months) Managed Rich Media Creative team. Launched new products adding incremental revenue. Creative Director/ Director of Product Management Yahoo! December 2006  –  March 2009  (2 years 4 months) Managed Rich Media Creative team. Launched new products adding incremental revenue. Creative Director Yahoo! October 2004  –  December 2006  (2 years 3 months) Sunnyvale Creative direction for Yahoo advertising and marketing products. Additionally responsible for educating the sales force and product teams of Rich Media capabilities. Continued overseeing the interactive Creative team in charge of developing Rich Media products. Creative Director Yahoo! October 2004  –  December 2006  (2 years 3 months) Sunnyvale Creative direction for Yahoo advertising and marketing products. Additionally responsible for educating the sales force and product teams of Rich Media capabilities. Continued overseeing the interactive Creative team in charge of developing Rich Media products. Manager, UED Homepage Yahoo! October 2003  –  October 2004  (1 year 1 month) Sunnyvale Developed a Rich Media Interactive/Creative team of Flash designers, developers and front end engineers focused on white glove out of the box innovative campaigns. The team focused on customer service and creative innovation developing a leadership position amongst its direct competition. Manager, UED Homepage Yahoo! October 2003  –  October 2004  (1 year 1 month) Sunnyvale Developed a Rich Media Interactive/Creative team of Flash designers, developers and front end engineers focused on white glove out of the box innovative campaigns. The team focused on customer service and creative innovation developing a leadership position amongst its direct competition. Art Director Yahoo! August 2002  –  October 2003  (1 year 3 months) Sunnyvale, CA Responsible for creating and developing early Rich Media advertising for Yahoo! Homepage. As one of the first Yahoo Homepage employees focused on advertising I created and developed new innovative Rich Media products, establishing Yahoo! as a leader in the industry. Worked with the Yahoo Sales team to develop presentations for fortune 100 companies. Met with agencies and their clients during the pitch process for creative brainstorms and technical representation. Art Director Yahoo! August 2002  –  October 2003  (1 year 3 months) Sunnyvale, CA Responsible for creating and developing early Rich Media advertising for Yahoo! Homepage. As one of the first Yahoo Homepage employees focused on advertising I created and developed new innovative Rich Media products, establishing Yahoo! as a leader in the industry. Worked with the Yahoo Sales team to develop presentations for fortune 100 companies. Met with agencies and their clients during the pitch process for creative brainstorms and technical representation. Interactive Designer Perimetre Design December 1999  –  August 2002  (2 years 9 months) Interactive Designer Perimetre Design December 1999  –  August 2002  (2 years 9 months) CE Columbia Pictures 1996  –  1999  (3 years) Culver City CE Columbia Pictures 1996  –  1999  (3 years) Culver City EA to SVP of Production Turner Pictures October 1994  –  December 1996  (2 years 3 months) Los Angeles EA to SVP of Production Turner Pictures October 1994  –  December 1996  (2 years 3 months) Los Angeles Skills User Experience Rich Media Monetization Interaction Design Mobile Advertising Ad Serving Behavioral Targeting Digital Media Digital Strategy Information Architecture User Interface Design Visual Design User-centered Design Mobile Devices Display Advertising User Experience Design Online Advertising Mobile Design Web Analytics Mobile Applications User Interface Experience Design See 7+     See less Skills  User Experience Rich Media Monetization Interaction Design Mobile Advertising Ad Serving Behavioral Targeting Digital Media Digital Strategy Information Architecture User Interface Design Visual Design User-centered Design Mobile Devices Display Advertising User Experience Design Online Advertising Mobile Design Web Analytics Mobile Applications User Interface Experience Design See 7+     See less User Experience Rich Media Monetization Interaction Design Mobile Advertising Ad Serving Behavioral Targeting Digital Media Digital Strategy Information Architecture User Interface Design Visual Design User-centered Design Mobile Devices Display Advertising User Experience Design Online Advertising Mobile Design Web Analytics Mobile Applications User Interface Experience Design See 7+     See less User Experience Rich Media Monetization Interaction Design Mobile Advertising Ad Serving Behavioral Targeting Digital Media Digital Strategy Information Architecture User Interface Design Visual Design User-centered Design Mobile Devices Display Advertising User Experience Design Online Advertising Mobile Design Web Analytics Mobile Applications User Interface Experience Design See 7+     See less Education University of Iowa 1989  – 1993 University of Iowa 1989  – 1993 University of Iowa 1989  – 1993 University of Iowa 1989  – 1993 ", "Summary Creative Director /Art DIrector to top advertising agencies; archival photographer to museums, publications and historical preservation societies. Summary Creative Director /Art DIrector to top advertising agencies; archival photographer to museums, publications and historical preservation societies. Creative Director /Art DIrector to top advertising agencies; archival photographer to museums, publications and historical preservation societies. Creative Director /Art DIrector to top advertising agencies; archival photographer to museums, publications and historical preservation societies. Experience Owner Jeremy Blakeslee Photography August 2002  – Present (13 years 1 month) San Francisco Bay Area www.jeremyblakesleephoto.com Creative Director / Art Director Freelance 2001  – Present (14 years) san francisco bay area Freelance Creative Director / Art Director Yahoo December 2014  –  July 2015  (8 months) San Francisco Bay Area Freelance Architectural Photographer San Francisco Architectural Heritage 2012  –  2015  (3 years) San Francisco Bay Area Ongoing preservation work Architectural Photographer National Trust for Historic Preservation 2010  –  2015  (5 years) Ongoing photographic preservation work Freelance Creative Director / Art Director Fathom Communications October 2014  –  December 2014  (3 months) New York City Freelance Creative Director - Art Director Razorfish July 2014  –  August 2014  (2 months) san francisco bay area Pitched and won Qualcomm Freelance Creative Director / Art Director Free Range Studios July 2014  –  July 2014  (1 month) san francisco bay area Freelance Creative Director / Art Director Grey San Francisco February 2014  –  May 2014  (4 months) San Francisco Bay Area Norton Freelance Creative Director / Art Director Geometry Global January 2014  –  January 2014  (1 month) San Francisco Pitched and won (retained) Flexjet. Established new brand direction. Photographer Best Made Company 2010  –  2014  (4 years) New York City Ongoing photo essays Freelance Art Director / ACD DigitasLBi September 2013  –  November 2013  (3 months) San Francisco Bay Area Launched Ebay 3.0 Senior Art Director :: Digital Sephora 2012  –  2013  (1 year) San Francisco Bay Area Senior Art Director Venables Bell and Partners 2012  –  2012  (less than a year) San Francisco Bay Area Intel Senior Art Director Crispin Porter + Bogusky 2011  –  2012  (1 year) Toronto Tourism, Groupon, Molson Senior Art Director TAXI 2011  –  2011  (less than a year) Telus Senior Art Director JWT NY 2011  –  2011  (less than a year) New York City Tony & Guy Hair Tailors Photographer National Park Service 2011  –  2011  (less than a year) San Francisco Bay Area Ongoing Freelance Photographer MIT Technology Review 2011  –  2011  (less than a year) Senior Art Director Lowe Roche 2010  –  2010  (less than a year) Toronto, Canada Area Crystal Head Vodka, Miela, Magnum Ice Cream and Purina Architectural Photographer The National Museum of Industrial History 2003  –  2010  (7 years) Bethlehem, Pennsylvania ongoing Interactive Art Director Young & Rubicam NY 2008  –  2009  (1 year) New York, NY Accenture, Sears, Rubbermaid and LG. Interactive Art Director Euro RSCG NY 2008  –  2009  (1 year) New York City Jaguar Freelance Graphic Designer Print Magazine 2007  –  2007  (less than a year) New York City Art Director Bartle Bogle Hegarty NY 2005  –  2007  (2 years) New York City City of New York, Mentos, SoBe Art Director The VOX Collective 2002  –  2005  (3 years) New York City Motorola, General Motors, UNICEF, Arts International Owner Jeremy Blakeslee Photography August 2002  – Present (13 years 1 month) San Francisco Bay Area www.jeremyblakesleephoto.com Owner Jeremy Blakeslee Photography August 2002  – Present (13 years 1 month) San Francisco Bay Area www.jeremyblakesleephoto.com Creative Director / Art Director Freelance 2001  – Present (14 years) san francisco bay area Creative Director / Art Director Freelance 2001  – Present (14 years) san francisco bay area Freelance Creative Director / Art Director Yahoo December 2014  –  July 2015  (8 months) San Francisco Bay Area Freelance Creative Director / Art Director Yahoo December 2014  –  July 2015  (8 months) San Francisco Bay Area Freelance Architectural Photographer San Francisco Architectural Heritage 2012  –  2015  (3 years) San Francisco Bay Area Ongoing preservation work Freelance Architectural Photographer San Francisco Architectural Heritage 2012  –  2015  (3 years) San Francisco Bay Area Ongoing preservation work Architectural Photographer National Trust for Historic Preservation 2010  –  2015  (5 years) Ongoing photographic preservation work Architectural Photographer National Trust for Historic Preservation 2010  –  2015  (5 years) Ongoing photographic preservation work Freelance Creative Director / Art Director Fathom Communications October 2014  –  December 2014  (3 months) New York City Freelance Creative Director / Art Director Fathom Communications October 2014  –  December 2014  (3 months) New York City Freelance Creative Director - Art Director Razorfish July 2014  –  August 2014  (2 months) san francisco bay area Pitched and won Qualcomm Freelance Creative Director - Art Director Razorfish July 2014  –  August 2014  (2 months) san francisco bay area Pitched and won Qualcomm Freelance Creative Director / Art Director Free Range Studios July 2014  –  July 2014  (1 month) san francisco bay area Freelance Creative Director / Art Director Free Range Studios July 2014  –  July 2014  (1 month) san francisco bay area Freelance Creative Director / Art Director Grey San Francisco February 2014  –  May 2014  (4 months) San Francisco Bay Area Norton Freelance Creative Director / Art Director Grey San Francisco February 2014  –  May 2014  (4 months) San Francisco Bay Area Norton Freelance Creative Director / Art Director Geometry Global January 2014  –  January 2014  (1 month) San Francisco Pitched and won (retained) Flexjet. Established new brand direction. Freelance Creative Director / Art Director Geometry Global January 2014  –  January 2014  (1 month) San Francisco Pitched and won (retained) Flexjet. Established new brand direction. Photographer Best Made Company 2010  –  2014  (4 years) New York City Ongoing photo essays Photographer Best Made Company 2010  –  2014  (4 years) New York City Ongoing photo essays Freelance Art Director / ACD DigitasLBi September 2013  –  November 2013  (3 months) San Francisco Bay Area Launched Ebay 3.0 Freelance Art Director / ACD DigitasLBi September 2013  –  November 2013  (3 months) San Francisco Bay Area Launched Ebay 3.0 Senior Art Director :: Digital Sephora 2012  –  2013  (1 year) San Francisco Bay Area Senior Art Director :: Digital Sephora 2012  –  2013  (1 year) San Francisco Bay Area Senior Art Director Venables Bell and Partners 2012  –  2012  (less than a year) San Francisco Bay Area Intel Senior Art Director Venables Bell and Partners 2012  –  2012  (less than a year) San Francisco Bay Area Intel Senior Art Director Crispin Porter + Bogusky 2011  –  2012  (1 year) Toronto Tourism, Groupon, Molson Senior Art Director Crispin Porter + Bogusky 2011  –  2012  (1 year) Toronto Tourism, Groupon, Molson Senior Art Director TAXI 2011  –  2011  (less than a year) Telus Senior Art Director TAXI 2011  –  2011  (less than a year) Telus Senior Art Director JWT NY 2011  –  2011  (less than a year) New York City Tony & Guy Hair Tailors Senior Art Director JWT NY 2011  –  2011  (less than a year) New York City Tony & Guy Hair Tailors Photographer National Park Service 2011  –  2011  (less than a year) San Francisco Bay Area Ongoing Photographer National Park Service 2011  –  2011  (less than a year) San Francisco Bay Area Ongoing Freelance Photographer MIT Technology Review 2011  –  2011  (less than a year) Freelance Photographer MIT Technology Review 2011  –  2011  (less than a year) Senior Art Director Lowe Roche 2010  –  2010  (less than a year) Toronto, Canada Area Crystal Head Vodka, Miela, Magnum Ice Cream and Purina Senior Art Director Lowe Roche 2010  –  2010  (less than a year) Toronto, Canada Area Crystal Head Vodka, Miela, Magnum Ice Cream and Purina Architectural Photographer The National Museum of Industrial History 2003  –  2010  (7 years) Bethlehem, Pennsylvania ongoing Architectural Photographer The National Museum of Industrial History 2003  –  2010  (7 years) Bethlehem, Pennsylvania ongoing Interactive Art Director Young & Rubicam NY 2008  –  2009  (1 year) New York, NY Accenture, Sears, Rubbermaid and LG. Interactive Art Director Young & Rubicam NY 2008  –  2009  (1 year) New York, NY Accenture, Sears, Rubbermaid and LG. Interactive Art Director Euro RSCG NY 2008  –  2009  (1 year) New York City Jaguar Interactive Art Director Euro RSCG NY 2008  –  2009  (1 year) New York City Jaguar Freelance Graphic Designer Print Magazine 2007  –  2007  (less than a year) New York City Freelance Graphic Designer Print Magazine 2007  –  2007  (less than a year) New York City Art Director Bartle Bogle Hegarty NY 2005  –  2007  (2 years) New York City City of New York, Mentos, SoBe Art Director Bartle Bogle Hegarty NY 2005  –  2007  (2 years) New York City City of New York, Mentos, SoBe Art Director The VOX Collective 2002  –  2005  (3 years) New York City Motorola, General Motors, UNICEF, Arts International Art Director The VOX Collective 2002  –  2005  (3 years) New York City Motorola, General Motors, UNICEF, Arts International Languages English English English Skills Photography Creative Direction Art Direction Advertising Fine Art Photography Creative Strategy Social Media Broadcast Interactive Advertising Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 14+     See less Skills  Photography Creative Direction Art Direction Advertising Fine Art Photography Creative Strategy Social Media Broadcast Interactive Advertising Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 14+     See less Photography Creative Direction Art Direction Advertising Fine Art Photography Creative Strategy Social Media Broadcast Interactive Advertising Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 14+     See less Photography Creative Direction Art Direction Advertising Fine Art Photography Creative Strategy Social Media Broadcast Interactive Advertising Concept Development Typography Adobe Creative Suite New Media Campaign Concepting digital Photojournalism Motion Graphics Installation Design Architectural... Editorial Content Based... Outdoor Advertising Team Leadership Historical Buildings Historic American... Industrial Architecture Photo Art Direction Calling Bullshit Dressage See 14+     See less Education School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club School of Visual Arts Bachelor of Fine Arts (BFA),  Advertising and Graphic Design 2000  – 2004 Graduated With Honors \nAlumni Scholarship Award Recipient. Activities and Societies:  Art Directors Club ,  Type Directors Club Honors & Awards Additional Honors & Awards Yes, but its not polite to brag. Additional Honors & Awards Yes, but its not polite to brag. Additional Honors & Awards Yes, but its not polite to brag. Additional Honors & Awards Yes, but its not polite to brag. ", "Summary • Digital media and advertising operations expertise, including: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video.  \n• Extensive leadership and account management experience with a primary focus to protect and grow revenue by providing world class customer service and operational excellence.  \n• Build, structure and evolve high impact teams spanning multiple regions with a national scope of responsibility.  \n• Highly effective networking and relationship building skill set leveraged to identify expertise, drive engagement, and provide solutions to execute, optimize and grow business. \n• International experience, including leading Yahoo!’s Global Partner Program for the 2006 FIFA World Cup held in Germany. Summary • Digital media and advertising operations expertise, including: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video.  \n• Extensive leadership and account management experience with a primary focus to protect and grow revenue by providing world class customer service and operational excellence.  \n• Build, structure and evolve high impact teams spanning multiple regions with a national scope of responsibility.  \n• Highly effective networking and relationship building skill set leveraged to identify expertise, drive engagement, and provide solutions to execute, optimize and grow business. \n• International experience, including leading Yahoo!’s Global Partner Program for the 2006 FIFA World Cup held in Germany. • Digital media and advertising operations expertise, including: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video.  \n• Extensive leadership and account management experience with a primary focus to protect and grow revenue by providing world class customer service and operational excellence.  \n• Build, structure and evolve high impact teams spanning multiple regions with a national scope of responsibility.  \n• Highly effective networking and relationship building skill set leveraged to identify expertise, drive engagement, and provide solutions to execute, optimize and grow business. \n• International experience, including leading Yahoo!’s Global Partner Program for the 2006 FIFA World Cup held in Germany. • Digital media and advertising operations expertise, including: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video.  \n• Extensive leadership and account management experience with a primary focus to protect and grow revenue by providing world class customer service and operational excellence.  \n• Build, structure and evolve high impact teams spanning multiple regions with a national scope of responsibility.  \n• Highly effective networking and relationship building skill set leveraged to identify expertise, drive engagement, and provide solutions to execute, optimize and grow business. \n• International experience, including leading Yahoo!’s Global Partner Program for the 2006 FIFA World Cup held in Germany. Experience Sr. Director, Yahoo! Client Services – Display & Search Yahoo! January 2014  – Present (1 year 8 months) New York, NY • Lead the national Display & Search Client Services teams aligned to the Finance/Insurance vertical and Canada region. \n• Book valued at more than $620MM, representing 20% of Yahoo!’s NA field revenue. \n• Product span of control and expertise includes: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video. \n• Manage a team of 39 direct reports, including 3 managers, located across every major market in the US and Toronto. \n• Oversee all organization responsibilities enabling team to develop solutions, pitch & close proposals, launch & execute plans, optimize programs, identify opportunities and up-sell buys, and renew Yahoo!’s premium advertising business. \n• Build and evolve high impact teams spanning multiple regions with a national scope of responsibility. Lead all people related initiatives including identifying & hiring top talent, compensation, account delegation, supporting career growth & diversification, goal setting, annual reviews, sustaining team morale, etc. \n• Navigate and build strong relationships throughout Yahoo!’s complex corporate matrix (Executive Management, Sales, BD, Legal, Marketing, Finance, Ops, HR, etc.) to facilitate and grow business. \n• Ensure team is adhering to and in full compliance with established Yahoo! and industry standard policies & practices. \n• Act as senior escalation point to help clients and Yahoo! teams assess, address and resolve issues. \n• Successfully led team through Yahoo!’s ad server migration initiative. Transitioned Display, Mobile Search and Native advertising to 3 new platforms (APT; YAM/Gemini; YAM+) leveraged to book, manage and optimize the business. Sr. Director, Yahoo! Account Management – Display Yahoo! April 2013  –  December 2013  (9 months) New York, NY • Restructured and realigned Display Account Management org into national vertical strategy. Transitioned regionally focused managers and AMs into new national industry-based verticals, ensured clear alignment with sales, and seamlessly re-mapped 700 total entities across six defined business units. \n• Directly aligned and managed Display AM team for three of these verticals: 1) Financial Services/Insurance; 2) CPG/Health/Wellness; and 3) Tech/Telco; and directly responsible for entire Canada display AM team.  \n• Revenue under management increased 27% YoY to $617MM.  \n• Geographical span increased from east region to include every office in the United States + Toronto, Canada.  \n• Identified and hired top talent leading to 49 total employees under direct management, including 5 direct managers. \n• Accounts under direct management increased 46% YoY, representing 62% of all field sales entities.  \n• Team submitted 1.7k total Solution Selling Insight (SSI) pitches and converted 1.2k (70%) of these revenue opportunities into wins valued at $43MM. SSI wins value increased 107% year-over-year. \n• Successfully managed Quarterly Performance Ratings, including taking disciplined approach to assess talent, calibrate with management, meet corporate guidelines, communicate to front lines, and fairly rate, distinguish and reward employees.  \n• Drove team to aggressively and robustly adopt Sales Force platform. AM org became model of how system can be leveraged to help focus priorities, track progress and goals, and capture critical information to drive their business. \n• Navigated team through multiple Yahoo property re-launches (News; Weather; Sports; Entertainment; Finance; etc.) with minimal disruption to business booked on these sites. Ensured all aligned media was properly rescheduled and changes were clearly communicated to reduce impact, recognize revenue, and preserve partnerships. Director, Yahoo! Account Management Yahoo! April 2010  –  March 2013  (3 years) New York, NY • Head of east region field display Account Management team. Sole Director aligned to and fully responsible for the New York, Boston, Atlanta, and Toronto teams including 5 Managers & 35 front line Account Managers. \n• Book valued at more than $485M, representing 40% of Yahoo!’s North American field display revenue. \n• Aligned to 500 entities including top global brands such as AT&T, P&G, American Express, Unilever, Fidelity, Verizon, Pfizer, General Mills, and Walmart.  \n• Played integral role in the overall structure, development, strategy, perception and stature of AM org, including evolving from being a primary reactive/subordinate ops resource to a proactive, revenue driving team and true peer group with sales. Sr. Manager, Yahoo! Account Management Yahoo! January 2008  –  March 2010  (2 years 3 months) New York, NY • Managed and directly responsible for the Display, Network and Search Account Management teams in east region. \n• Regional span of control: expanded from NYC only (shared with 3 managers) to become single manager in charge of NYC, Boston, Atlanta, and Canada. \n• Revenue under management grew 83% from $300M to $550M, representing 37% of all Yahoo! NA field revenue. \n• Resources under management increased 180% from 20 to 56, including building management team from 1 manager to 5. \n•\tEntities under direct management expanded 132% – from 140 to 325. Sr. Manager, Yahoo! Strategic Partnerships Yahoo! January 2007  –  December 2007  (1 year) New York, NY • Managed the implementation & execution of Yahoo!’s highly integrated and complex strategic partnerships, including: American Express Broadway, Capital One Saving Zone, & Unilever/Hellmann’s In Search of Real Food. \n• Extended senior level partner management resources to these complex platforms valued at more than $13M that included highly integrated components and demanded in-depth client management to ensure program success. \n• Revenue achievement: 100% of $13M book allocated & recognized by Yahoo! Sr. Manager, Yahoo!-FIFA World Cup Germany Partnership Yahoo! January 2005  –  December 2006  (2 years) New York, NY • Responsible for all official global partner programs associated with FIFAworldcup.com – the official 2006 FIFA World Cup Germany web site produced, operated & hosted by Yahoo! in 9 languages. \n• Global partners under management included: Adidas; Anheuser-Busch; Avaya; Coca-Cola; Continental Tires; Emirates Airline; FujiFilm; Gillette; Hyundai; MasterCard; and McDonald’s,  \n• Extensive worldwide travel including business conducted in Dubai, Seoul, London, Frankfurt, Berlin, Munich & Zurich. \n• Revenue achievement: 100% of $16.5M book allocated & recognized by Yahoo! \n• Other responsibilities included supervision, purchase & distribution of Yahoo!’s 28k tickets to the 64 World Cup matches and participation in the strategy, organization & coordination of Yahoo!’s Final Match Hospitality event. \n• Supervised and directly responsible for one Yahoo!-FIFA Account Manager located in London, UK. Business Manager, Yahoo! Global Alliances Yahoo! August 2001  –  December 2004  (3 years 5 months) New York, NY • Envisioned, structured and staffed new Alliance Account Management model created exclusively to manage, expand and renew Yahoo!’s highest priority partner programs. \n• Relocated to NYC specifically to lead the 3-year, $30M Sony Corporation of America partnership. \n• Expanded Sony responsibilities to include leadership over entire org. Managed team of 13 direct reports aligned to alliance partners (Sony, HP, HSBC, Best Buy, Bank One) representing more than $364M in total contractual revenue.  \n• Championed necessity of having AM resources within region. Strategy adopted and rolled-out across entire organization. \n• Initiated, structured & implemented new Alliance AM compensation plan. Represented first time direct reports were compensated via a quarterly incentive plan plus annual base salary.  \n• Expanded Alliance Account Management globally by placing one direct report into Yahoo!’s London, UK headquarters.  \n• Achievement: FY04: 132% ($18.7M vs. $14.1M); FY03: 133% ($24M vs. $18M); FY02: 150% ($12M vs. $8M) \n• Recipient of Y! Sales Operations Superstar Award. Manager, Yahoo! Corporate Account Management Yahoo! May 2000  –  July 2001  (1 year 3 months) Sunnyvale, CA • Responsible for a team of 21 direct reports assigned to grow & deepen relationships with Yahoo!’s marquee partners. \n• Managed more than $400M in revenue distributed across 45+ partners, including: Barnes & Noble, Compaq, Disney, E*Trade, Ford, FTD, the NBA, Pepsi, Ralston Purina, State Farm, Ticketmaster & others. Supervisor, Yahoo! Account Management Yahoo! January 2000  –  April 2000  (4 months) Sunnyvale, CA • Expanded responsibilities to include management of 4 direct reports within Yahoo! Account Management org. \n• Retained ownership of primary Merchant Partner account base (see below) and associated responsibilities. Yahoo! Account Manager Yahoo! October 1998  –  December 1999  (1 year 3 months) Sunnyvale, CA • Acted as primary point of contact & chief advocate for Yahoo!’s highest valued account base, The Merchant Partners.  \n• Managed an account base of 14 partners valued at ~$30M, including dot-com start ups: Art.com, Ashford.com, AutoWeb, BlueLight.com, ChipShot.com, ApartmentGuide.com, Living.com, Wrenchead.com, and others. Account Executive Yoyodyne Entertainment, Inc. June 1998  –  October 1998  (5 months) Irvington, NY • Primary point of contact for MasterCard and HP, the premier sponsors of Yoyodyne’s online media properties.  \n• Responsible for maintaining internal and partner relationships, coordinating day-to-day operations, identifying and aggregating team resources, managing expectations, and directing all communications flow. Account Executive Bachurski Associates, Inc. April 1996  –  May 1998  (2 years 2 months) Washington, DC • Responsible for managing direct marketing programs for client base including The Nature Conservancy, Brown University, and Smithsonian Institution. Accountable for and successfully met annual fundraising budgets exceeding $13M. Circulation Manager Spin Magazine May 1995  –  March 1996  (11 months) New York, NY •\tAccountable for all direct-to-retail sales, including the management of five separate national distributors.  \n• Responsible for identifying and breaking into new markets the magazine was not previously sold.  \n• Successfully placed Spin back into all 850 Musicland Group retail accounts resulting in an additional 82k issues being drawn annually and representing an increase in circulation of ~47k issues per year. Production Manager Bachurski Associates, Inc. December 1991  –  April 1995  (3 years 5 months) Washington, DC • Coordinated the production, bidding, scheduling and final implementation of all direct marketing projects for the entire roster of company clients. Account Executive MWM, Inc. May 1990  –  November 1991  (1 year 7 months) Washington, DC • Responsible for coordinating, designing and producing direct marketing packages for assigned account portfolio.  \n• Oversaw art and copy and approved all production procedures involved in the completion of each job.  \n• Tracked mailing results and performed in-depth analysis of each campaign. Sr. Director, Yahoo! Client Services – Display & Search Yahoo! January 2014  – Present (1 year 8 months) New York, NY • Lead the national Display & Search Client Services teams aligned to the Finance/Insurance vertical and Canada region. \n• Book valued at more than $620MM, representing 20% of Yahoo!’s NA field revenue. \n• Product span of control and expertise includes: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video. \n• Manage a team of 39 direct reports, including 3 managers, located across every major market in the US and Toronto. \n• Oversee all organization responsibilities enabling team to develop solutions, pitch & close proposals, launch & execute plans, optimize programs, identify opportunities and up-sell buys, and renew Yahoo!’s premium advertising business. \n• Build and evolve high impact teams spanning multiple regions with a national scope of responsibility. Lead all people related initiatives including identifying & hiring top talent, compensation, account delegation, supporting career growth & diversification, goal setting, annual reviews, sustaining team morale, etc. \n• Navigate and build strong relationships throughout Yahoo!’s complex corporate matrix (Executive Management, Sales, BD, Legal, Marketing, Finance, Ops, HR, etc.) to facilitate and grow business. \n• Ensure team is adhering to and in full compliance with established Yahoo! and industry standard policies & practices. \n• Act as senior escalation point to help clients and Yahoo! teams assess, address and resolve issues. \n• Successfully led team through Yahoo!’s ad server migration initiative. Transitioned Display, Mobile Search and Native advertising to 3 new platforms (APT; YAM/Gemini; YAM+) leveraged to book, manage and optimize the business. Sr. Director, Yahoo! Client Services – Display & Search Yahoo! January 2014  – Present (1 year 8 months) New York, NY • Lead the national Display & Search Client Services teams aligned to the Finance/Insurance vertical and Canada region. \n• Book valued at more than $620MM, representing 20% of Yahoo!’s NA field revenue. \n• Product span of control and expertise includes: Premium Display, Audience & Programmatic, Native, Search, Mobile, Content Marketing, and Video. \n• Manage a team of 39 direct reports, including 3 managers, located across every major market in the US and Toronto. \n• Oversee all organization responsibilities enabling team to develop solutions, pitch & close proposals, launch & execute plans, optimize programs, identify opportunities and up-sell buys, and renew Yahoo!’s premium advertising business. \n• Build and evolve high impact teams spanning multiple regions with a national scope of responsibility. Lead all people related initiatives including identifying & hiring top talent, compensation, account delegation, supporting career growth & diversification, goal setting, annual reviews, sustaining team morale, etc. \n• Navigate and build strong relationships throughout Yahoo!’s complex corporate matrix (Executive Management, Sales, BD, Legal, Marketing, Finance, Ops, HR, etc.) to facilitate and grow business. \n• Ensure team is adhering to and in full compliance with established Yahoo! and industry standard policies & practices. \n• Act as senior escalation point to help clients and Yahoo! teams assess, address and resolve issues. \n• Successfully led team through Yahoo!’s ad server migration initiative. Transitioned Display, Mobile Search and Native advertising to 3 new platforms (APT; YAM/Gemini; YAM+) leveraged to book, manage and optimize the business. Sr. Director, Yahoo! Account Management – Display Yahoo! April 2013  –  December 2013  (9 months) New York, NY • Restructured and realigned Display Account Management org into national vertical strategy. Transitioned regionally focused managers and AMs into new national industry-based verticals, ensured clear alignment with sales, and seamlessly re-mapped 700 total entities across six defined business units. \n• Directly aligned and managed Display AM team for three of these verticals: 1) Financial Services/Insurance; 2) CPG/Health/Wellness; and 3) Tech/Telco; and directly responsible for entire Canada display AM team.  \n• Revenue under management increased 27% YoY to $617MM.  \n• Geographical span increased from east region to include every office in the United States + Toronto, Canada.  \n• Identified and hired top talent leading to 49 total employees under direct management, including 5 direct managers. \n• Accounts under direct management increased 46% YoY, representing 62% of all field sales entities.  \n• Team submitted 1.7k total Solution Selling Insight (SSI) pitches and converted 1.2k (70%) of these revenue opportunities into wins valued at $43MM. SSI wins value increased 107% year-over-year. \n• Successfully managed Quarterly Performance Ratings, including taking disciplined approach to assess talent, calibrate with management, meet corporate guidelines, communicate to front lines, and fairly rate, distinguish and reward employees.  \n• Drove team to aggressively and robustly adopt Sales Force platform. AM org became model of how system can be leveraged to help focus priorities, track progress and goals, and capture critical information to drive their business. \n• Navigated team through multiple Yahoo property re-launches (News; Weather; Sports; Entertainment; Finance; etc.) with minimal disruption to business booked on these sites. Ensured all aligned media was properly rescheduled and changes were clearly communicated to reduce impact, recognize revenue, and preserve partnerships. Sr. Director, Yahoo! Account Management – Display Yahoo! April 2013  –  December 2013  (9 months) New York, NY • Restructured and realigned Display Account Management org into national vertical strategy. Transitioned regionally focused managers and AMs into new national industry-based verticals, ensured clear alignment with sales, and seamlessly re-mapped 700 total entities across six defined business units. \n• Directly aligned and managed Display AM team for three of these verticals: 1) Financial Services/Insurance; 2) CPG/Health/Wellness; and 3) Tech/Telco; and directly responsible for entire Canada display AM team.  \n• Revenue under management increased 27% YoY to $617MM.  \n• Geographical span increased from east region to include every office in the United States + Toronto, Canada.  \n• Identified and hired top talent leading to 49 total employees under direct management, including 5 direct managers. \n• Accounts under direct management increased 46% YoY, representing 62% of all field sales entities.  \n• Team submitted 1.7k total Solution Selling Insight (SSI) pitches and converted 1.2k (70%) of these revenue opportunities into wins valued at $43MM. SSI wins value increased 107% year-over-year. \n• Successfully managed Quarterly Performance Ratings, including taking disciplined approach to assess talent, calibrate with management, meet corporate guidelines, communicate to front lines, and fairly rate, distinguish and reward employees.  \n• Drove team to aggressively and robustly adopt Sales Force platform. AM org became model of how system can be leveraged to help focus priorities, track progress and goals, and capture critical information to drive their business. \n• Navigated team through multiple Yahoo property re-launches (News; Weather; Sports; Entertainment; Finance; etc.) with minimal disruption to business booked on these sites. Ensured all aligned media was properly rescheduled and changes were clearly communicated to reduce impact, recognize revenue, and preserve partnerships. Director, Yahoo! Account Management Yahoo! April 2010  –  March 2013  (3 years) New York, NY • Head of east region field display Account Management team. Sole Director aligned to and fully responsible for the New York, Boston, Atlanta, and Toronto teams including 5 Managers & 35 front line Account Managers. \n• Book valued at more than $485M, representing 40% of Yahoo!’s North American field display revenue. \n• Aligned to 500 entities including top global brands such as AT&T, P&G, American Express, Unilever, Fidelity, Verizon, Pfizer, General Mills, and Walmart.  \n• Played integral role in the overall structure, development, strategy, perception and stature of AM org, including evolving from being a primary reactive/subordinate ops resource to a proactive, revenue driving team and true peer group with sales. Director, Yahoo! Account Management Yahoo! April 2010  –  March 2013  (3 years) New York, NY • Head of east region field display Account Management team. Sole Director aligned to and fully responsible for the New York, Boston, Atlanta, and Toronto teams including 5 Managers & 35 front line Account Managers. \n• Book valued at more than $485M, representing 40% of Yahoo!’s North American field display revenue. \n• Aligned to 500 entities including top global brands such as AT&T, P&G, American Express, Unilever, Fidelity, Verizon, Pfizer, General Mills, and Walmart.  \n• Played integral role in the overall structure, development, strategy, perception and stature of AM org, including evolving from being a primary reactive/subordinate ops resource to a proactive, revenue driving team and true peer group with sales. Sr. Manager, Yahoo! Account Management Yahoo! January 2008  –  March 2010  (2 years 3 months) New York, NY • Managed and directly responsible for the Display, Network and Search Account Management teams in east region. \n• Regional span of control: expanded from NYC only (shared with 3 managers) to become single manager in charge of NYC, Boston, Atlanta, and Canada. \n• Revenue under management grew 83% from $300M to $550M, representing 37% of all Yahoo! NA field revenue. \n• Resources under management increased 180% from 20 to 56, including building management team from 1 manager to 5. \n•\tEntities under direct management expanded 132% – from 140 to 325. Sr. Manager, Yahoo! Account Management Yahoo! January 2008  –  March 2010  (2 years 3 months) New York, NY • Managed and directly responsible for the Display, Network and Search Account Management teams in east region. \n• Regional span of control: expanded from NYC only (shared with 3 managers) to become single manager in charge of NYC, Boston, Atlanta, and Canada. \n• Revenue under management grew 83% from $300M to $550M, representing 37% of all Yahoo! NA field revenue. \n• Resources under management increased 180% from 20 to 56, including building management team from 1 manager to 5. \n•\tEntities under direct management expanded 132% – from 140 to 325. Sr. Manager, Yahoo! Strategic Partnerships Yahoo! January 2007  –  December 2007  (1 year) New York, NY • Managed the implementation & execution of Yahoo!’s highly integrated and complex strategic partnerships, including: American Express Broadway, Capital One Saving Zone, & Unilever/Hellmann’s In Search of Real Food. \n• Extended senior level partner management resources to these complex platforms valued at more than $13M that included highly integrated components and demanded in-depth client management to ensure program success. \n• Revenue achievement: 100% of $13M book allocated & recognized by Yahoo! Sr. Manager, Yahoo! Strategic Partnerships Yahoo! January 2007  –  December 2007  (1 year) New York, NY • Managed the implementation & execution of Yahoo!’s highly integrated and complex strategic partnerships, including: American Express Broadway, Capital One Saving Zone, & Unilever/Hellmann’s In Search of Real Food. \n• Extended senior level partner management resources to these complex platforms valued at more than $13M that included highly integrated components and demanded in-depth client management to ensure program success. \n• Revenue achievement: 100% of $13M book allocated & recognized by Yahoo! Sr. Manager, Yahoo!-FIFA World Cup Germany Partnership Yahoo! January 2005  –  December 2006  (2 years) New York, NY • Responsible for all official global partner programs associated with FIFAworldcup.com – the official 2006 FIFA World Cup Germany web site produced, operated & hosted by Yahoo! in 9 languages. \n• Global partners under management included: Adidas; Anheuser-Busch; Avaya; Coca-Cola; Continental Tires; Emirates Airline; FujiFilm; Gillette; Hyundai; MasterCard; and McDonald’s,  \n• Extensive worldwide travel including business conducted in Dubai, Seoul, London, Frankfurt, Berlin, Munich & Zurich. \n• Revenue achievement: 100% of $16.5M book allocated & recognized by Yahoo! \n• Other responsibilities included supervision, purchase & distribution of Yahoo!’s 28k tickets to the 64 World Cup matches and participation in the strategy, organization & coordination of Yahoo!’s Final Match Hospitality event. \n• Supervised and directly responsible for one Yahoo!-FIFA Account Manager located in London, UK. Sr. Manager, Yahoo!-FIFA World Cup Germany Partnership Yahoo! January 2005  –  December 2006  (2 years) New York, NY • Responsible for all official global partner programs associated with FIFAworldcup.com – the official 2006 FIFA World Cup Germany web site produced, operated & hosted by Yahoo! in 9 languages. \n• Global partners under management included: Adidas; Anheuser-Busch; Avaya; Coca-Cola; Continental Tires; Emirates Airline; FujiFilm; Gillette; Hyundai; MasterCard; and McDonald’s,  \n• Extensive worldwide travel including business conducted in Dubai, Seoul, London, Frankfurt, Berlin, Munich & Zurich. \n• Revenue achievement: 100% of $16.5M book allocated & recognized by Yahoo! \n• Other responsibilities included supervision, purchase & distribution of Yahoo!’s 28k tickets to the 64 World Cup matches and participation in the strategy, organization & coordination of Yahoo!’s Final Match Hospitality event. \n• Supervised and directly responsible for one Yahoo!-FIFA Account Manager located in London, UK. Business Manager, Yahoo! Global Alliances Yahoo! August 2001  –  December 2004  (3 years 5 months) New York, NY • Envisioned, structured and staffed new Alliance Account Management model created exclusively to manage, expand and renew Yahoo!’s highest priority partner programs. \n• Relocated to NYC specifically to lead the 3-year, $30M Sony Corporation of America partnership. \n• Expanded Sony responsibilities to include leadership over entire org. Managed team of 13 direct reports aligned to alliance partners (Sony, HP, HSBC, Best Buy, Bank One) representing more than $364M in total contractual revenue.  \n• Championed necessity of having AM resources within region. Strategy adopted and rolled-out across entire organization. \n• Initiated, structured & implemented new Alliance AM compensation plan. Represented first time direct reports were compensated via a quarterly incentive plan plus annual base salary.  \n• Expanded Alliance Account Management globally by placing one direct report into Yahoo!’s London, UK headquarters.  \n• Achievement: FY04: 132% ($18.7M vs. $14.1M); FY03: 133% ($24M vs. $18M); FY02: 150% ($12M vs. $8M) \n• Recipient of Y! Sales Operations Superstar Award. Business Manager, Yahoo! Global Alliances Yahoo! August 2001  –  December 2004  (3 years 5 months) New York, NY • Envisioned, structured and staffed new Alliance Account Management model created exclusively to manage, expand and renew Yahoo!’s highest priority partner programs. \n• Relocated to NYC specifically to lead the 3-year, $30M Sony Corporation of America partnership. \n• Expanded Sony responsibilities to include leadership over entire org. Managed team of 13 direct reports aligned to alliance partners (Sony, HP, HSBC, Best Buy, Bank One) representing more than $364M in total contractual revenue.  \n• Championed necessity of having AM resources within region. Strategy adopted and rolled-out across entire organization. \n• Initiated, structured & implemented new Alliance AM compensation plan. Represented first time direct reports were compensated via a quarterly incentive plan plus annual base salary.  \n• Expanded Alliance Account Management globally by placing one direct report into Yahoo!’s London, UK headquarters.  \n• Achievement: FY04: 132% ($18.7M vs. $14.1M); FY03: 133% ($24M vs. $18M); FY02: 150% ($12M vs. $8M) \n• Recipient of Y! Sales Operations Superstar Award. Manager, Yahoo! Corporate Account Management Yahoo! May 2000  –  July 2001  (1 year 3 months) Sunnyvale, CA • Responsible for a team of 21 direct reports assigned to grow & deepen relationships with Yahoo!’s marquee partners. \n• Managed more than $400M in revenue distributed across 45+ partners, including: Barnes & Noble, Compaq, Disney, E*Trade, Ford, FTD, the NBA, Pepsi, Ralston Purina, State Farm, Ticketmaster & others. Manager, Yahoo! Corporate Account Management Yahoo! May 2000  –  July 2001  (1 year 3 months) Sunnyvale, CA • Responsible for a team of 21 direct reports assigned to grow & deepen relationships with Yahoo!’s marquee partners. \n• Managed more than $400M in revenue distributed across 45+ partners, including: Barnes & Noble, Compaq, Disney, E*Trade, Ford, FTD, the NBA, Pepsi, Ralston Purina, State Farm, Ticketmaster & others. Supervisor, Yahoo! Account Management Yahoo! January 2000  –  April 2000  (4 months) Sunnyvale, CA • Expanded responsibilities to include management of 4 direct reports within Yahoo! Account Management org. \n• Retained ownership of primary Merchant Partner account base (see below) and associated responsibilities. Supervisor, Yahoo! Account Management Yahoo! January 2000  –  April 2000  (4 months) Sunnyvale, CA • Expanded responsibilities to include management of 4 direct reports within Yahoo! Account Management org. \n• Retained ownership of primary Merchant Partner account base (see below) and associated responsibilities. Yahoo! Account Manager Yahoo! October 1998  –  December 1999  (1 year 3 months) Sunnyvale, CA • Acted as primary point of contact & chief advocate for Yahoo!’s highest valued account base, The Merchant Partners.  \n• Managed an account base of 14 partners valued at ~$30M, including dot-com start ups: Art.com, Ashford.com, AutoWeb, BlueLight.com, ChipShot.com, ApartmentGuide.com, Living.com, Wrenchead.com, and others. Yahoo! Account Manager Yahoo! October 1998  –  December 1999  (1 year 3 months) Sunnyvale, CA • Acted as primary point of contact & chief advocate for Yahoo!’s highest valued account base, The Merchant Partners.  \n• Managed an account base of 14 partners valued at ~$30M, including dot-com start ups: Art.com, Ashford.com, AutoWeb, BlueLight.com, ChipShot.com, ApartmentGuide.com, Living.com, Wrenchead.com, and others. Account Executive Yoyodyne Entertainment, Inc. June 1998  –  October 1998  (5 months) Irvington, NY • Primary point of contact for MasterCard and HP, the premier sponsors of Yoyodyne’s online media properties.  \n• Responsible for maintaining internal and partner relationships, coordinating day-to-day operations, identifying and aggregating team resources, managing expectations, and directing all communications flow. Account Executive Yoyodyne Entertainment, Inc. June 1998  –  October 1998  (5 months) Irvington, NY • Primary point of contact for MasterCard and HP, the premier sponsors of Yoyodyne’s online media properties.  \n• Responsible for maintaining internal and partner relationships, coordinating day-to-day operations, identifying and aggregating team resources, managing expectations, and directing all communications flow. Account Executive Bachurski Associates, Inc. April 1996  –  May 1998  (2 years 2 months) Washington, DC • Responsible for managing direct marketing programs for client base including The Nature Conservancy, Brown University, and Smithsonian Institution. Accountable for and successfully met annual fundraising budgets exceeding $13M. Account Executive Bachurski Associates, Inc. April 1996  –  May 1998  (2 years 2 months) Washington, DC • Responsible for managing direct marketing programs for client base including The Nature Conservancy, Brown University, and Smithsonian Institution. Accountable for and successfully met annual fundraising budgets exceeding $13M. Circulation Manager Spin Magazine May 1995  –  March 1996  (11 months) New York, NY •\tAccountable for all direct-to-retail sales, including the management of five separate national distributors.  \n• Responsible for identifying and breaking into new markets the magazine was not previously sold.  \n• Successfully placed Spin back into all 850 Musicland Group retail accounts resulting in an additional 82k issues being drawn annually and representing an increase in circulation of ~47k issues per year. Circulation Manager Spin Magazine May 1995  –  March 1996  (11 months) New York, NY •\tAccountable for all direct-to-retail sales, including the management of five separate national distributors.  \n• Responsible for identifying and breaking into new markets the magazine was not previously sold.  \n• Successfully placed Spin back into all 850 Musicland Group retail accounts resulting in an additional 82k issues being drawn annually and representing an increase in circulation of ~47k issues per year. Production Manager Bachurski Associates, Inc. December 1991  –  April 1995  (3 years 5 months) Washington, DC • Coordinated the production, bidding, scheduling and final implementation of all direct marketing projects for the entire roster of company clients. Production Manager Bachurski Associates, Inc. December 1991  –  April 1995  (3 years 5 months) Washington, DC • Coordinated the production, bidding, scheduling and final implementation of all direct marketing projects for the entire roster of company clients. Account Executive MWM, Inc. May 1990  –  November 1991  (1 year 7 months) Washington, DC • Responsible for coordinating, designing and producing direct marketing packages for assigned account portfolio.  \n• Oversaw art and copy and approved all production procedures involved in the completion of each job.  \n• Tracked mailing results and performed in-depth analysis of each campaign. Account Executive MWM, Inc. May 1990  –  November 1991  (1 year 7 months) Washington, DC • Responsible for coordinating, designing and producing direct marketing packages for assigned account portfolio.  \n• Oversaw art and copy and approved all production procedures involved in the completion of each job.  \n• Tracked mailing results and performed in-depth analysis of each campaign. Skills Strategic Partnerships Strategy Integrated Marketing Start-ups CRM Direct Marketing Account Management Display Advertising Management Sales Operations Leadership New Media Team Leadership Mobile Marketing Online Advertising Sales Ad Networks Monetization Digital Media See 4+     See less Skills  Strategic Partnerships Strategy Integrated Marketing Start-ups CRM Direct Marketing Account Management Display Advertising Management Sales Operations Leadership New Media Team Leadership Mobile Marketing Online Advertising Sales Ad Networks Monetization Digital Media See 4+     See less Strategic Partnerships Strategy Integrated Marketing Start-ups CRM Direct Marketing Account Management Display Advertising Management Sales Operations Leadership New Media Team Leadership Mobile Marketing Online Advertising Sales Ad Networks Monetization Digital Media See 4+     See less Strategic Partnerships Strategy Integrated Marketing Start-ups CRM Direct Marketing Account Management Display Advertising Management Sales Operations Leadership New Media Team Leadership Mobile Marketing Online Advertising Sales Ad Networks Monetization Digital Media See 4+     See less Education West Virginia University BS,  Journalism/Advertising 1986  – 1989 Magna Cum Laude \nRugby Club West Virginia University BS,  Journalism/Advertising 1986  – 1989 Magna Cum Laude \nRugby Club West Virginia University BS,  Journalism/Advertising 1986  – 1989 Magna Cum Laude \nRugby Club West Virginia University BS,  Journalism/Advertising 1986  – 1989 Magna Cum Laude \nRugby Club ", "Experience Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Skills Mobile Devices GIS Perl Skills  Mobile Devices GIS Perl Mobile Devices GIS Perl Mobile Devices GIS Perl Education Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 ", "Skills XSL Linux Engineering Management Apache PHP Scalability LDAP Mobile Devices Engineering MySQL User Interface Product Management MapReduce Software Development Software Engineering JavaScript System Architecture Node.js Python Technical Leadership JSON Web Services CSS Algorithms Front-end Hadoop Distributed Systems E-commerce Java Web Applications Agile Methodologies Perl Unix AJAX See 19+     See less Skills  XSL Linux Engineering Management Apache PHP Scalability LDAP Mobile Devices Engineering MySQL User Interface Product Management MapReduce Software Development Software Engineering JavaScript System Architecture Node.js Python Technical Leadership JSON Web Services CSS Algorithms Front-end Hadoop Distributed Systems E-commerce Java Web Applications Agile Methodologies Perl Unix AJAX See 19+     See less XSL Linux Engineering Management Apache PHP Scalability LDAP Mobile Devices Engineering MySQL User Interface Product Management MapReduce Software Development Software Engineering JavaScript System Architecture Node.js Python Technical Leadership JSON Web Services CSS Algorithms Front-end Hadoop Distributed Systems E-commerce Java Web Applications Agile Methodologies Perl Unix AJAX See 19+     See less XSL Linux Engineering Management Apache PHP Scalability LDAP Mobile Devices Engineering MySQL User Interface Product Management MapReduce Software Development Software Engineering JavaScript System Architecture Node.js Python Technical Leadership JSON Web Services CSS Algorithms Front-end Hadoop Distributed Systems E-commerce Java Web Applications Agile Methodologies Perl Unix AJAX See 19+     See less ", "Summary I've spent over 20 years in business development, advertising and media sales with most of that time being spent in interactive media. For much of my career I've been fortunate enough to work for such companies as Ziff-Davis, Forbes, Yahoo!, and LinkedIn. Over the years I've spent considerable time helping companies such as IBM, BMW, Intel, HSBC and Charles Schwab build their brands and connect with customers on the Internet and in mobile. \n \nI currently lead the Publisher Sales team at Yahoo. My team helps mobile developers and publishers monetize their applications with Flurry's SDK and Yahoo's mobile advertising solutions. \n \nIn my most recent roles at Jumptap and AppRedeem, I helped developers and marketers utilize mobile advertising to drive revenue. Prior to focusing on mobile advertising, I built and lead the Western Region sales team at LinkedIn. I'm proud to have been part of such an incredible organization and to have been an integral part of it's meteoric growth. \n \nSpecialties: Internet Advertising, Internet Marketing, Brand Advertising, Customer Engagement, Social Media Marketing, Advertising Strategy, Bicycle Touring, Travel, Mobile Advertising, App Promotion, App Advertising, Mobile Gaming, Mobile Advertising, Publisher Development, Business Development Summary I've spent over 20 years in business development, advertising and media sales with most of that time being spent in interactive media. For much of my career I've been fortunate enough to work for such companies as Ziff-Davis, Forbes, Yahoo!, and LinkedIn. Over the years I've spent considerable time helping companies such as IBM, BMW, Intel, HSBC and Charles Schwab build their brands and connect with customers on the Internet and in mobile. \n \nI currently lead the Publisher Sales team at Yahoo. My team helps mobile developers and publishers monetize their applications with Flurry's SDK and Yahoo's mobile advertising solutions. \n \nIn my most recent roles at Jumptap and AppRedeem, I helped developers and marketers utilize mobile advertising to drive revenue. Prior to focusing on mobile advertising, I built and lead the Western Region sales team at LinkedIn. I'm proud to have been part of such an incredible organization and to have been an integral part of it's meteoric growth. \n \nSpecialties: Internet Advertising, Internet Marketing, Brand Advertising, Customer Engagement, Social Media Marketing, Advertising Strategy, Bicycle Touring, Travel, Mobile Advertising, App Promotion, App Advertising, Mobile Gaming, Mobile Advertising, Publisher Development, Business Development I've spent over 20 years in business development, advertising and media sales with most of that time being spent in interactive media. For much of my career I've been fortunate enough to work for such companies as Ziff-Davis, Forbes, Yahoo!, and LinkedIn. Over the years I've spent considerable time helping companies such as IBM, BMW, Intel, HSBC and Charles Schwab build their brands and connect with customers on the Internet and in mobile. \n \nI currently lead the Publisher Sales team at Yahoo. My team helps mobile developers and publishers monetize their applications with Flurry's SDK and Yahoo's mobile advertising solutions. \n \nIn my most recent roles at Jumptap and AppRedeem, I helped developers and marketers utilize mobile advertising to drive revenue. Prior to focusing on mobile advertising, I built and lead the Western Region sales team at LinkedIn. I'm proud to have been part of such an incredible organization and to have been an integral part of it's meteoric growth. \n \nSpecialties: Internet Advertising, Internet Marketing, Brand Advertising, Customer Engagement, Social Media Marketing, Advertising Strategy, Bicycle Touring, Travel, Mobile Advertising, App Promotion, App Advertising, Mobile Gaming, Mobile Advertising, Publisher Development, Business Development I've spent over 20 years in business development, advertising and media sales with most of that time being spent in interactive media. For much of my career I've been fortunate enough to work for such companies as Ziff-Davis, Forbes, Yahoo!, and LinkedIn. Over the years I've spent considerable time helping companies such as IBM, BMW, Intel, HSBC and Charles Schwab build their brands and connect with customers on the Internet and in mobile. \n \nI currently lead the Publisher Sales team at Yahoo. My team helps mobile developers and publishers monetize their applications with Flurry's SDK and Yahoo's mobile advertising solutions. \n \nIn my most recent roles at Jumptap and AppRedeem, I helped developers and marketers utilize mobile advertising to drive revenue. Prior to focusing on mobile advertising, I built and lead the Western Region sales team at LinkedIn. I'm proud to have been part of such an incredible organization and to have been an integral part of it's meteoric growth. \n \nSpecialties: Internet Advertising, Internet Marketing, Brand Advertising, Customer Engagement, Social Media Marketing, Advertising Strategy, Bicycle Touring, Travel, Mobile Advertising, App Promotion, App Advertising, Mobile Gaming, Mobile Advertising, Publisher Development, Business Development Experience Senior Director, Publisher Sales Yahoo February 2015  – Present (7 months) San Francisco Bay Area I lead the team in North America responsible for syndicating Yahoo's native and video advertising products to app developers and publishers.  Senior Director, Publisher Relations Flurry, Inc. (acquired by Yahoo) January 2014  –  February 2015  (1 year 2 months) San Francisco Bay Area I led the Flurry Publisher Relations Team in N. and S. America, Asia and Australia. The team worked with mobile developers and publishers to help them monetize their apps. Using Flurry's video and RTB marketplace, these media solutions help publishers maximize their revenue and increase user retention within their apps.  \nFlurry powers the app ecosystem with its analytics, user acquisition and monetization tools. Over 600,000 applications use Flurry's tools and help make sense of data from over 1.8 billion mobile devices each month. \nFlurry was acquired by Yahoo in August of 2014 and my team evolved into the team leading the syndication of Yahoo's mobile monetization tools via the Flurry SDK. \n Senior Director of Sales, West Millennial Media November 2013  –  December 2013  (2 months) San Francisco Bay Area Jumptap was acquired by Millennial Media in November 2013. Senior Director of Sales, West Jumptap (acquired by Millennial Media) April 2013  –  November 2013  (8 months) San Francisco Bay Area Lead the West Coast brand sales team in the San Francisco and LA offices for Jumptap. Worked with leading advertisers to help them succeed in their mobile marketing efforts. VP of Sales AppRedeem August 2012  –  March 2013  (8 months) Mountain View, CA In my role as VP of Sales I built the sales and account management teams, and developed our relationships with the world's leading mobile app and game developers. Entrepreneur inGamba January 2012  –  December 2012  (1 year) San Francisco Bay Area I founded and helped to build inGamba, a new kind of bicycle touring company for discerning and experienced riders. inGamba is committed to challenging riding but also to enjoying the food, wine and culture of all of the great places they visit. Director, Western Region Marketing Solutions LinkedIn February 2008  –  September 2011  (3 years 8 months) San Francisco Bay Area During my time at LinkedIn I built and managed the Western Region media sales team. I had the opportunity to help build LinkedIn's media business from its very earliest stages. When I arrived in 2008 our team had 8 people, when I departed in 2011, we had over 180. With the talented team of Account Executives that I managed we brought in new advertisers such as HP, Cisco, Charles Schwab, Visa, Acura, Infiniti and countless others. My team's revenue grew over 800% during my tenure. In addition to developing strategy, hiring numerous staff, and helping to shape the structure of LinkedIn's Marketing Solutions team, I had the opportunity to spearhead the opening of both of LinkedIn's San Francisco offices. In the end I feel proud to have been a part of generating significant revenue and value for a company that ultimately had one of the most successful IPO's of the decade. Account Director Yahoo! April 2002  –  February 2008  (5 years 11 months) Account Director covering Finance, Technology and Automotive accounts in Yahoo!'s NYC and San Francisco offices. During my time at Yahoo! we became the largest and most effective seller of display media in the world, and helped many of the world's best companies understand how to market effectively on the internet. Volunteer Account Director Taproot Foundation September 2005  –  June 2007  (1 year 10 months) Taproot is a non-profit that connects marketing and creative professionals with other non-profits in need of their services. I managed three website development projects in which my team built brand new sites for some very deserving non-profits. Account Executive Forbes.com November 1998  –  April 2002  (3 years 6 months) I started at Forbes.com in 1998 as the second internet advertising salesperson. As Forbes.com was in it's earliest stages I had a great deal of interaction with product, editorial, general management, and advertising management to help build the groundwork for what became one of the Internet's premier business sites. During my time at Forbes.com I was also fortunate to be able to transition from the San Francisco office to New York City, and therefore gain experience covering the Finance, Tech and Automotive categories on both coasts. Eastern Ad Director CFO.com 2001  –  2001  (less than a year) Account Executive Ziff-Davis Publishing October 1996  –  October 1998  (2 years 1 month) Account Executive covering the Southwest and Northwest territories for MacWeek and Windows Sources magazines. Senior Director, Publisher Sales Yahoo February 2015  – Present (7 months) San Francisco Bay Area I lead the team in North America responsible for syndicating Yahoo's native and video advertising products to app developers and publishers.  Senior Director, Publisher Sales Yahoo February 2015  – Present (7 months) San Francisco Bay Area I lead the team in North America responsible for syndicating Yahoo's native and video advertising products to app developers and publishers.  Senior Director, Publisher Relations Flurry, Inc. (acquired by Yahoo) January 2014  –  February 2015  (1 year 2 months) San Francisco Bay Area I led the Flurry Publisher Relations Team in N. and S. America, Asia and Australia. The team worked with mobile developers and publishers to help them monetize their apps. Using Flurry's video and RTB marketplace, these media solutions help publishers maximize their revenue and increase user retention within their apps.  \nFlurry powers the app ecosystem with its analytics, user acquisition and monetization tools. Over 600,000 applications use Flurry's tools and help make sense of data from over 1.8 billion mobile devices each month. \nFlurry was acquired by Yahoo in August of 2014 and my team evolved into the team leading the syndication of Yahoo's mobile monetization tools via the Flurry SDK. \n Senior Director, Publisher Relations Flurry, Inc. (acquired by Yahoo) January 2014  –  February 2015  (1 year 2 months) San Francisco Bay Area I led the Flurry Publisher Relations Team in N. and S. America, Asia and Australia. The team worked with mobile developers and publishers to help them monetize their apps. Using Flurry's video and RTB marketplace, these media solutions help publishers maximize their revenue and increase user retention within their apps.  \nFlurry powers the app ecosystem with its analytics, user acquisition and monetization tools. Over 600,000 applications use Flurry's tools and help make sense of data from over 1.8 billion mobile devices each month. \nFlurry was acquired by Yahoo in August of 2014 and my team evolved into the team leading the syndication of Yahoo's mobile monetization tools via the Flurry SDK. \n Senior Director of Sales, West Millennial Media November 2013  –  December 2013  (2 months) San Francisco Bay Area Jumptap was acquired by Millennial Media in November 2013. Senior Director of Sales, West Millennial Media November 2013  –  December 2013  (2 months) San Francisco Bay Area Jumptap was acquired by Millennial Media in November 2013. Senior Director of Sales, West Jumptap (acquired by Millennial Media) April 2013  –  November 2013  (8 months) San Francisco Bay Area Lead the West Coast brand sales team in the San Francisco and LA offices for Jumptap. Worked with leading advertisers to help them succeed in their mobile marketing efforts. Senior Director of Sales, West Jumptap (acquired by Millennial Media) April 2013  –  November 2013  (8 months) San Francisco Bay Area Lead the West Coast brand sales team in the San Francisco and LA offices for Jumptap. Worked with leading advertisers to help them succeed in their mobile marketing efforts. VP of Sales AppRedeem August 2012  –  March 2013  (8 months) Mountain View, CA In my role as VP of Sales I built the sales and account management teams, and developed our relationships with the world's leading mobile app and game developers. VP of Sales AppRedeem August 2012  –  March 2013  (8 months) Mountain View, CA In my role as VP of Sales I built the sales and account management teams, and developed our relationships with the world's leading mobile app and game developers. Entrepreneur inGamba January 2012  –  December 2012  (1 year) San Francisco Bay Area I founded and helped to build inGamba, a new kind of bicycle touring company for discerning and experienced riders. inGamba is committed to challenging riding but also to enjoying the food, wine and culture of all of the great places they visit. Entrepreneur inGamba January 2012  –  December 2012  (1 year) San Francisco Bay Area I founded and helped to build inGamba, a new kind of bicycle touring company for discerning and experienced riders. inGamba is committed to challenging riding but also to enjoying the food, wine and culture of all of the great places they visit. Director, Western Region Marketing Solutions LinkedIn February 2008  –  September 2011  (3 years 8 months) San Francisco Bay Area During my time at LinkedIn I built and managed the Western Region media sales team. I had the opportunity to help build LinkedIn's media business from its very earliest stages. When I arrived in 2008 our team had 8 people, when I departed in 2011, we had over 180. With the talented team of Account Executives that I managed we brought in new advertisers such as HP, Cisco, Charles Schwab, Visa, Acura, Infiniti and countless others. My team's revenue grew over 800% during my tenure. In addition to developing strategy, hiring numerous staff, and helping to shape the structure of LinkedIn's Marketing Solutions team, I had the opportunity to spearhead the opening of both of LinkedIn's San Francisco offices. In the end I feel proud to have been a part of generating significant revenue and value for a company that ultimately had one of the most successful IPO's of the decade. Director, Western Region Marketing Solutions LinkedIn February 2008  –  September 2011  (3 years 8 months) San Francisco Bay Area During my time at LinkedIn I built and managed the Western Region media sales team. I had the opportunity to help build LinkedIn's media business from its very earliest stages. When I arrived in 2008 our team had 8 people, when I departed in 2011, we had over 180. With the talented team of Account Executives that I managed we brought in new advertisers such as HP, Cisco, Charles Schwab, Visa, Acura, Infiniti and countless others. My team's revenue grew over 800% during my tenure. In addition to developing strategy, hiring numerous staff, and helping to shape the structure of LinkedIn's Marketing Solutions team, I had the opportunity to spearhead the opening of both of LinkedIn's San Francisco offices. In the end I feel proud to have been a part of generating significant revenue and value for a company that ultimately had one of the most successful IPO's of the decade. Account Director Yahoo! April 2002  –  February 2008  (5 years 11 months) Account Director covering Finance, Technology and Automotive accounts in Yahoo!'s NYC and San Francisco offices. During my time at Yahoo! we became the largest and most effective seller of display media in the world, and helped many of the world's best companies understand how to market effectively on the internet. Account Director Yahoo! April 2002  –  February 2008  (5 years 11 months) Account Director covering Finance, Technology and Automotive accounts in Yahoo!'s NYC and San Francisco offices. During my time at Yahoo! we became the largest and most effective seller of display media in the world, and helped many of the world's best companies understand how to market effectively on the internet. Volunteer Account Director Taproot Foundation September 2005  –  June 2007  (1 year 10 months) Taproot is a non-profit that connects marketing and creative professionals with other non-profits in need of their services. I managed three website development projects in which my team built brand new sites for some very deserving non-profits. Volunteer Account Director Taproot Foundation September 2005  –  June 2007  (1 year 10 months) Taproot is a non-profit that connects marketing and creative professionals with other non-profits in need of their services. I managed three website development projects in which my team built brand new sites for some very deserving non-profits. Account Executive Forbes.com November 1998  –  April 2002  (3 years 6 months) I started at Forbes.com in 1998 as the second internet advertising salesperson. As Forbes.com was in it's earliest stages I had a great deal of interaction with product, editorial, general management, and advertising management to help build the groundwork for what became one of the Internet's premier business sites. During my time at Forbes.com I was also fortunate to be able to transition from the San Francisco office to New York City, and therefore gain experience covering the Finance, Tech and Automotive categories on both coasts. Account Executive Forbes.com November 1998  –  April 2002  (3 years 6 months) I started at Forbes.com in 1998 as the second internet advertising salesperson. As Forbes.com was in it's earliest stages I had a great deal of interaction with product, editorial, general management, and advertising management to help build the groundwork for what became one of the Internet's premier business sites. During my time at Forbes.com I was also fortunate to be able to transition from the San Francisco office to New York City, and therefore gain experience covering the Finance, Tech and Automotive categories on both coasts. Eastern Ad Director CFO.com 2001  –  2001  (less than a year) Eastern Ad Director CFO.com 2001  –  2001  (less than a year) Account Executive Ziff-Davis Publishing October 1996  –  October 1998  (2 years 1 month) Account Executive covering the Southwest and Northwest territories for MacWeek and Windows Sources magazines. Account Executive Ziff-Davis Publishing October 1996  –  October 1998  (2 years 1 month) Account Executive covering the Southwest and Northwest territories for MacWeek and Windows Sources magazines. Skills Brand advertising Social Media Direct Marketing Online Advertising Web Marketing Social Media Marketing Customer Engagement Advertising Digital Strategy Digital Marketing Digital Media Lead Generation Integrated Marketing Strategic Partnerships Salesforce.com Email Marketing New Media B2B Marketing Start-ups Strategy Marketing Entrepreneurship See 7+     See less Skills  Brand advertising Social Media Direct Marketing Online Advertising Web Marketing Social Media Marketing Customer Engagement Advertising Digital Strategy Digital Marketing Digital Media Lead Generation Integrated Marketing Strategic Partnerships Salesforce.com Email Marketing New Media B2B Marketing Start-ups Strategy Marketing Entrepreneurship See 7+     See less Brand advertising Social Media Direct Marketing Online Advertising Web Marketing Social Media Marketing Customer Engagement Advertising Digital Strategy Digital Marketing Digital Media Lead Generation Integrated Marketing Strategic Partnerships Salesforce.com Email Marketing New Media B2B Marketing Start-ups Strategy Marketing Entrepreneurship See 7+     See less Brand advertising Social Media Direct Marketing Online Advertising Web Marketing Social Media Marketing Customer Engagement Advertising Digital Strategy Digital Marketing Digital Media Lead Generation Integrated Marketing Strategic Partnerships Salesforce.com Email Marketing New Media B2B Marketing Start-ups Strategy Marketing Entrepreneurship See 7+     See less Education University of California, Santa Cruz BA, Cum Laude,  Politics ,  History 1990  – 1995 Activities and Societies:  Phi Beta Kappa Ukiah High School 1986  – 1990 University of California, Santa Cruz BA, Cum Laude,  Politics ,  History 1990  – 1995 Activities and Societies:  Phi Beta Kappa University of California, Santa Cruz BA, Cum Laude,  Politics ,  History 1990  – 1995 Activities and Societies:  Phi Beta Kappa University of California, Santa Cruz BA, Cum Laude,  Politics ,  History 1990  – 1995 Activities and Societies:  Phi Beta Kappa Ukiah High School 1986  – 1990 Ukiah High School 1986  – 1990 Ukiah High School 1986  – 1990 Honors & Awards Additional Honors & Awards Yahoo! Platinum MVP Additional Honors & Awards Yahoo! Platinum MVP Additional Honors & Awards Yahoo! Platinum MVP Additional Honors & Awards Yahoo! Platinum MVP ", "Skills Scalability Strategy Display Advertising Computer Network... Mobile Devices Unix Big Data Search Mobile Applications Perl Ad Networks Operations Management Management Strategic Partnerships Skills  Scalability Strategy Display Advertising Computer Network... Mobile Devices Unix Big Data Search Mobile Applications Perl Ad Networks Operations Management Management Strategic Partnerships Scalability Strategy Display Advertising Computer Network... Mobile Devices Unix Big Data Search Mobile Applications Perl Ad Networks Operations Management Management Strategic Partnerships Scalability Strategy Display Advertising Computer Network... Mobile Devices Unix Big Data Search Mobile Applications Perl Ad Networks Operations Management Management Strategic Partnerships ", "Skills Online Publishing User Experience Design Mobile Applications Interaction Design Digital Media User Interface Design User-centered Design Creative Direction Information Architecture User Experience Product Management Agile Methodologies Editorial Content Strategy Online Advertising Management See 1+     See less Skills  Online Publishing User Experience Design Mobile Applications Interaction Design Digital Media User Interface Design User-centered Design Creative Direction Information Architecture User Experience Product Management Agile Methodologies Editorial Content Strategy Online Advertising Management See 1+     See less Online Publishing User Experience Design Mobile Applications Interaction Design Digital Media User Interface Design User-centered Design Creative Direction Information Architecture User Experience Product Management Agile Methodologies Editorial Content Strategy Online Advertising Management See 1+     See less Online Publishing User Experience Design Mobile Applications Interaction Design Digital Media User Interface Design User-centered Design Creative Direction Information Architecture User Experience Product Management Agile Methodologies Editorial Content Strategy Online Advertising Management See 1+     See less ", "Summary Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Summary Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Experience Senior Director Production Engineering Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manage Yahoo Native Ad Operations Director Data Operations Yahoo! August 2013  – Present (2 years 1 month) United States Manage Yahoo entire data infrastructure that generates over 150 Billion events from multiple data centers across the globe which feeds into various pipelines that generates over 30TB of data in Hadoop infrastructure to generate deep insights into user and revenue metrics for Yahoo. Head of Cloud Operations BitYota November 2012  –  August 2013  (10 months) San Francisco Bay Area o\tEngaged in BitYota’s Infrastructure/Operational Roadmap discussions with Venture Capitalists \no\tCustomer C level staff engagement on BitYota’s Architecture and Performance/Operational benefits \no\tEngaged in pre-sale technical discussions with customers \no\tBudget and Burn rate discussions with BitYota’s Founders and Directors \no\tEngaged in Product stratergy and Product Roadmap course correction meetings \no\tCompetitor landscape analysis for Cost/Performance/Differentiation \no\tManage BitYota’s DataCenter Infrastructure and provisioning \n Director Database Operations Yahoo! August 2011  –  November 2012  (1 year 4 months) Sunnyvale,CA Manage day-to-day operations of databases that generate multiple billion dollars in revenue. This includes architecting, sizing, capacity planning and performance tuning of applications to support the millions of advertisers. Setup Vision, Goals and Mission Statement for the team and rally the troops to successfully complete all milestones. Hire, Mentor and Coach 50+ direct and indirect reports. Manage 1000+ database systems that serve more than 5 Petabyte of storage and databases ranging from few Terabytes to 500+TB. Sr.Manager Database Technologies Yahoo! March 2009  –  August 2011  (2 years 6 months) DBA Manager Yahoo January 2007  –  February 2009  (2 years 2 months) Senior DBA Yahoo! April 2004  –  December 2006  (2 years 9 months) Sr. DBA Altavista January 2000  –  April 2004  (4 years 4 months) Systems Analyst Hofinsoft January 1996  –  July 1997  (1 year 7 months) Senior Director Production Engineering Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manage Yahoo Native Ad Operations Senior Director Production Engineering Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manage Yahoo Native Ad Operations Director Data Operations Yahoo! August 2013  – Present (2 years 1 month) United States Manage Yahoo entire data infrastructure that generates over 150 Billion events from multiple data centers across the globe which feeds into various pipelines that generates over 30TB of data in Hadoop infrastructure to generate deep insights into user and revenue metrics for Yahoo. Director Data Operations Yahoo! August 2013  – Present (2 years 1 month) United States Manage Yahoo entire data infrastructure that generates over 150 Billion events from multiple data centers across the globe which feeds into various pipelines that generates over 30TB of data in Hadoop infrastructure to generate deep insights into user and revenue metrics for Yahoo. Head of Cloud Operations BitYota November 2012  –  August 2013  (10 months) San Francisco Bay Area o\tEngaged in BitYota’s Infrastructure/Operational Roadmap discussions with Venture Capitalists \no\tCustomer C level staff engagement on BitYota’s Architecture and Performance/Operational benefits \no\tEngaged in pre-sale technical discussions with customers \no\tBudget and Burn rate discussions with BitYota’s Founders and Directors \no\tEngaged in Product stratergy and Product Roadmap course correction meetings \no\tCompetitor landscape analysis for Cost/Performance/Differentiation \no\tManage BitYota’s DataCenter Infrastructure and provisioning \n Head of Cloud Operations BitYota November 2012  –  August 2013  (10 months) San Francisco Bay Area o\tEngaged in BitYota’s Infrastructure/Operational Roadmap discussions with Venture Capitalists \no\tCustomer C level staff engagement on BitYota’s Architecture and Performance/Operational benefits \no\tEngaged in pre-sale technical discussions with customers \no\tBudget and Burn rate discussions with BitYota’s Founders and Directors \no\tEngaged in Product stratergy and Product Roadmap course correction meetings \no\tCompetitor landscape analysis for Cost/Performance/Differentiation \no\tManage BitYota’s DataCenter Infrastructure and provisioning \n Director Database Operations Yahoo! August 2011  –  November 2012  (1 year 4 months) Sunnyvale,CA Manage day-to-day operations of databases that generate multiple billion dollars in revenue. This includes architecting, sizing, capacity planning and performance tuning of applications to support the millions of advertisers. Setup Vision, Goals and Mission Statement for the team and rally the troops to successfully complete all milestones. Hire, Mentor and Coach 50+ direct and indirect reports. Manage 1000+ database systems that serve more than 5 Petabyte of storage and databases ranging from few Terabytes to 500+TB. Director Database Operations Yahoo! August 2011  –  November 2012  (1 year 4 months) Sunnyvale,CA Manage day-to-day operations of databases that generate multiple billion dollars in revenue. This includes architecting, sizing, capacity planning and performance tuning of applications to support the millions of advertisers. Setup Vision, Goals and Mission Statement for the team and rally the troops to successfully complete all milestones. Hire, Mentor and Coach 50+ direct and indirect reports. Manage 1000+ database systems that serve more than 5 Petabyte of storage and databases ranging from few Terabytes to 500+TB. Sr.Manager Database Technologies Yahoo! March 2009  –  August 2011  (2 years 6 months) Sr.Manager Database Technologies Yahoo! March 2009  –  August 2011  (2 years 6 months) DBA Manager Yahoo January 2007  –  February 2009  (2 years 2 months) DBA Manager Yahoo January 2007  –  February 2009  (2 years 2 months) Senior DBA Yahoo! April 2004  –  December 2006  (2 years 9 months) Senior DBA Yahoo! April 2004  –  December 2006  (2 years 9 months) Sr. DBA Altavista January 2000  –  April 2004  (4 years 4 months) Sr. DBA Altavista January 2000  –  April 2004  (4 years 4 months) Systems Analyst Hofinsoft January 1996  –  July 1997  (1 year 7 months) Systems Analyst Hofinsoft January 1996  –  July 1997  (1 year 7 months) Skills Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Skills  Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Education Madras University B.S,  Math 1989  – 1992 Madras University B.S,  Math 1989  – 1992 Madras University B.S,  Math 1989  – 1992 Madras University B.S,  Math 1989  – 1992 ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Management Agile Methodologies Strategy Business Intelligence Customer Experience Program Management Team Leadership Management Product Development Integration Mobile Devices Cross-functional Team... Vendor Management Software Documentation Project Management Quality Assurance Web Analytics E-commerce Leadership Analysis Enterprise Software See 6+     See less Skills  Product Management Agile Methodologies Strategy Business Intelligence Customer Experience Program Management Team Leadership Management Product Development Integration Mobile Devices Cross-functional Team... Vendor Management Software Documentation Project Management Quality Assurance Web Analytics E-commerce Leadership Analysis Enterprise Software See 6+     See less Product Management Agile Methodologies Strategy Business Intelligence Customer Experience Program Management Team Leadership Management Product Development Integration Mobile Devices Cross-functional Team... Vendor Management Software Documentation Project Management Quality Assurance Web Analytics E-commerce Leadership Analysis Enterprise Software See 6+     See less Product Management Agile Methodologies Strategy Business Intelligence Customer Experience Program Management Team Leadership Management Product Development Integration Mobile Devices Cross-functional Team... Vendor Management Software Documentation Project Management Quality Assurance Web Analytics E-commerce Leadership Analysis Enterprise Software See 6+     See less ", "Summary Manage, grow and develop a wide range of product and implementation opportunities across Yahoo's 300+ North American Search and Distribution partnerships. \n \n- Experienced with business operations in a multi-billion dollar environment. \n- Manage a team with broad responsibilities and multiple layers of management, multiple offices and countries. \n- Global publisher revenue management, revenue optimization consulting, business process improvement, revenue optimization modeling. \n- Complex-issue rapid problem solving, enterprise content syndication and content management strategy development. \n- Extensive executive presentation skills and experience. \n \nCurrently manage a department across four offices in the U.S. and Canada delivering solutions to 300+ search, software, distribution and mobile partnerships. \nManage three main channels of partner business: Search Affiliate, Toolbar/Software Distribution and Y! O&O Vertical Properties Search monetization. \n \nGoals: \nContinue growing Yahoo's U.S. and International partnerships and distribution business. Support multinational content and monetization projects to improve end user experience, revenue and productivity online - with a focus on mobile. \n \nSpecialties:  \n- Search, Sponsored Search, Native and Display Advertising. \n- Developing high performance, highly functioning teams. \n- Revenue growth and diversification. \n- Business development Summary Manage, grow and develop a wide range of product and implementation opportunities across Yahoo's 300+ North American Search and Distribution partnerships. \n \n- Experienced with business operations in a multi-billion dollar environment. \n- Manage a team with broad responsibilities and multiple layers of management, multiple offices and countries. \n- Global publisher revenue management, revenue optimization consulting, business process improvement, revenue optimization modeling. \n- Complex-issue rapid problem solving, enterprise content syndication and content management strategy development. \n- Extensive executive presentation skills and experience. \n \nCurrently manage a department across four offices in the U.S. and Canada delivering solutions to 300+ search, software, distribution and mobile partnerships. \nManage three main channels of partner business: Search Affiliate, Toolbar/Software Distribution and Y! O&O Vertical Properties Search monetization. \n \nGoals: \nContinue growing Yahoo's U.S. and International partnerships and distribution business. Support multinational content and monetization projects to improve end user experience, revenue and productivity online - with a focus on mobile. \n \nSpecialties:  \n- Search, Sponsored Search, Native and Display Advertising. \n- Developing high performance, highly functioning teams. \n- Revenue growth and diversification. \n- Business development Manage, grow and develop a wide range of product and implementation opportunities across Yahoo's 300+ North American Search and Distribution partnerships. \n \n- Experienced with business operations in a multi-billion dollar environment. \n- Manage a team with broad responsibilities and multiple layers of management, multiple offices and countries. \n- Global publisher revenue management, revenue optimization consulting, business process improvement, revenue optimization modeling. \n- Complex-issue rapid problem solving, enterprise content syndication and content management strategy development. \n- Extensive executive presentation skills and experience. \n \nCurrently manage a department across four offices in the U.S. and Canada delivering solutions to 300+ search, software, distribution and mobile partnerships. \nManage three main channels of partner business: Search Affiliate, Toolbar/Software Distribution and Y! O&O Vertical Properties Search monetization. \n \nGoals: \nContinue growing Yahoo's U.S. and International partnerships and distribution business. Support multinational content and monetization projects to improve end user experience, revenue and productivity online - with a focus on mobile. \n \nSpecialties:  \n- Search, Sponsored Search, Native and Display Advertising. \n- Developing high performance, highly functioning teams. \n- Revenue growth and diversification. \n- Business development Manage, grow and develop a wide range of product and implementation opportunities across Yahoo's 300+ North American Search and Distribution partnerships. \n \n- Experienced with business operations in a multi-billion dollar environment. \n- Manage a team with broad responsibilities and multiple layers of management, multiple offices and countries. \n- Global publisher revenue management, revenue optimization consulting, business process improvement, revenue optimization modeling. \n- Complex-issue rapid problem solving, enterprise content syndication and content management strategy development. \n- Extensive executive presentation skills and experience. \n \nCurrently manage a department across four offices in the U.S. and Canada delivering solutions to 300+ search, software, distribution and mobile partnerships. \nManage three main channels of partner business: Search Affiliate, Toolbar/Software Distribution and Y! O&O Vertical Properties Search monetization. \n \nGoals: \nContinue growing Yahoo's U.S. and International partnerships and distribution business. Support multinational content and monetization projects to improve end user experience, revenue and productivity online - with a focus on mobile. \n \nSpecialties:  \n- Search, Sponsored Search, Native and Display Advertising. \n- Developing high performance, highly functioning teams. \n- Revenue growth and diversification. \n- Business development Experience Vice President, Global Partner Management Yahoo March 2014  – Present (1 year 6 months) Burbank, ca Sr. Director, Yahoo Publisher Revenue Optimization & Business Development Yahoo October 2007  – Present (7 years 11 months) Sr. Director Yahoo! / Right Media 2008  –  2008  (less than a year) Director, Publisher Professional Services Yahoo! Search Marketing October 2003  –  September 2007  (4 years) Director Overture Services, Inc. 2002  –  2004  (2 years) Director of Search Operations Overture October 2002  –  December 2003  (1 year 3 months) Practice Manager - Mobile Computing Sprint December 2000  –  September 2002  (1 year 10 months) Enterprise Consulting Paranet May 1998  –  November 2000  (2 years 7 months) e-Commerce Consultant Careerpath.com 1998  –  2000  (2 years) Film Studio - Head of Operations American Film Production Services November 1994  –  April 1998  (3 years 6 months) Head of Operations HollyWired January 1994  –  April 1998  (4 years 4 months) Film Location Manager Santa Barbara Locations November 1992  –  October 1994  (2 years) Co-Owner Omni Distribution May 1990  –  October 1992  (2 years 6 months) Salesperson Tony Rose Camera & Video June 1988  –  May 1990  (2 years) Vice President, Global Partner Management Yahoo March 2014  – Present (1 year 6 months) Burbank, ca Vice President, Global Partner Management Yahoo March 2014  – Present (1 year 6 months) Burbank, ca Sr. Director, Yahoo Publisher Revenue Optimization & Business Development Yahoo October 2007  – Present (7 years 11 months) Sr. Director, Yahoo Publisher Revenue Optimization & Business Development Yahoo October 2007  – Present (7 years 11 months) Sr. Director Yahoo! / Right Media 2008  –  2008  (less than a year) Sr. Director Yahoo! / Right Media 2008  –  2008  (less than a year) Director, Publisher Professional Services Yahoo! Search Marketing October 2003  –  September 2007  (4 years) Director, Publisher Professional Services Yahoo! Search Marketing October 2003  –  September 2007  (4 years) Director Overture Services, Inc. 2002  –  2004  (2 years) Director Overture Services, Inc. 2002  –  2004  (2 years) Director of Search Operations Overture October 2002  –  December 2003  (1 year 3 months) Director of Search Operations Overture October 2002  –  December 2003  (1 year 3 months) Practice Manager - Mobile Computing Sprint December 2000  –  September 2002  (1 year 10 months) Practice Manager - Mobile Computing Sprint December 2000  –  September 2002  (1 year 10 months) Enterprise Consulting Paranet May 1998  –  November 2000  (2 years 7 months) Enterprise Consulting Paranet May 1998  –  November 2000  (2 years 7 months) e-Commerce Consultant Careerpath.com 1998  –  2000  (2 years) e-Commerce Consultant Careerpath.com 1998  –  2000  (2 years) Film Studio - Head of Operations American Film Production Services November 1994  –  April 1998  (3 years 6 months) Film Studio - Head of Operations American Film Production Services November 1994  –  April 1998  (3 years 6 months) Head of Operations HollyWired January 1994  –  April 1998  (4 years 4 months) Head of Operations HollyWired January 1994  –  April 1998  (4 years 4 months) Film Location Manager Santa Barbara Locations November 1992  –  October 1994  (2 years) Film Location Manager Santa Barbara Locations November 1992  –  October 1994  (2 years) Co-Owner Omni Distribution May 1990  –  October 1992  (2 years 6 months) Co-Owner Omni Distribution May 1990  –  October 1992  (2 years 6 months) Salesperson Tony Rose Camera & Video June 1988  –  May 1990  (2 years) Salesperson Tony Rose Camera & Video June 1988  –  May 1990  (2 years) Languages English English English Skills Online Publisher... Business Development Strategic Partnerships Monetization Product Management SEM E-commerce Mobile Advertising Analytics PPC Digital Media Mobile Devices Display Advertising Web Analytics Start-ups Search Advertising Online Advertising Revenue Microsoft Publisher Strategy New Media SEO Product Marketing Cross-functional Team... Advertising Lead Generation Marketing Content Management Digital Marketing Online Marketing Leadership Management Digital Strategy See 18+     See less Skills  Online Publisher... Business Development Strategic Partnerships Monetization Product Management SEM E-commerce Mobile Advertising Analytics PPC Digital Media Mobile Devices Display Advertising Web Analytics Start-ups Search Advertising Online Advertising Revenue Microsoft Publisher Strategy New Media SEO Product Marketing Cross-functional Team... Advertising Lead Generation Marketing Content Management Digital Marketing Online Marketing Leadership Management Digital Strategy See 18+     See less Online Publisher... Business Development Strategic Partnerships Monetization Product Management SEM E-commerce Mobile Advertising Analytics PPC Digital Media Mobile Devices Display Advertising Web Analytics Start-ups Search Advertising Online Advertising Revenue Microsoft Publisher Strategy New Media SEO Product Marketing Cross-functional Team... Advertising Lead Generation Marketing Content Management Digital Marketing Online Marketing Leadership Management Digital Strategy See 18+     See less Online Publisher... Business Development Strategic Partnerships Monetization Product Management SEM E-commerce Mobile Advertising Analytics PPC Digital Media Mobile Devices Display Advertising Web Analytics Start-ups Search Advertising Online Advertising Revenue Microsoft Publisher Strategy New Media SEO Product Marketing Cross-functional Team... Advertising Lead Generation Marketing Content Management Digital Marketing Online Marketing Leadership Management Digital Strategy See 18+     See less Honors & Awards Additional Honors & Awards Regional Award: Southern California Consultant, Year 2000 \nQuarterly Award: Southern California Consultant, Q2, 1999 Additional Honors & Awards Regional Award: Southern California Consultant, Year 2000 \nQuarterly Award: Southern California Consultant, Q2, 1999 Additional Honors & Awards Regional Award: Southern California Consultant, Year 2000 \nQuarterly Award: Southern California Consultant, Q2, 1999 Additional Honors & Awards Regional Award: Southern California Consultant, Year 2000 \nQuarterly Award: Southern California Consultant, Q2, 1999 ", "Skills Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less Skills  Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less Film Storytelling Final Cut Pro Video Television Music Videos Feature Films Reality Set Design Props Screenwriting Film Production Entertainment Commercials Producing Independent Film Art Camera Theatre Documentaries Short Films Set Dressing Pre-production Special Effects Production Managment Post Production Video Production Photography Art Direction Final Draft Cinematography Directing Set Construction Reality TV See 19+     See less ", "Summary A strong analytical and technologically savvy manager with excellent communication skills, graduated from a Top-20 MBA program, 10 years experience in developing business initiatives, leading teams, and managing cross-functional projects. Specialties:Search and Display ad operations management \nOperational design \nOffshoring/Outsourcing \nRelevance/editorial test design and execution  \nGlobalization/localization \nTaxonomy development \nMatching algorithms \nClassifier testing and tuning \nProject management \nPeople management \nAnalysis Summary A strong analytical and technologically savvy manager with excellent communication skills, graduated from a Top-20 MBA program, 10 years experience in developing business initiatives, leading teams, and managing cross-functional projects. Specialties:Search and Display ad operations management \nOperational design \nOffshoring/Outsourcing \nRelevance/editorial test design and execution  \nGlobalization/localization \nTaxonomy development \nMatching algorithms \nClassifier testing and tuning \nProject management \nPeople management \nAnalysis A strong analytical and technologically savvy manager with excellent communication skills, graduated from a Top-20 MBA program, 10 years experience in developing business initiatives, leading teams, and managing cross-functional projects. Specialties:Search and Display ad operations management \nOperational design \nOffshoring/Outsourcing \nRelevance/editorial test design and execution  \nGlobalization/localization \nTaxonomy development \nMatching algorithms \nClassifier testing and tuning \nProject management \nPeople management \nAnalysis A strong analytical and technologically savvy manager with excellent communication skills, graduated from a Top-20 MBA program, 10 years experience in developing business initiatives, leading teams, and managing cross-functional projects. Specialties:Search and Display ad operations management \nOperational design \nOffshoring/Outsourcing \nRelevance/editorial test design and execution  \nGlobalization/localization \nTaxonomy development \nMatching algorithms \nClassifier testing and tuning \nProject management \nPeople management \nAnalysis Experience Executive Director, Search Marketplace Operations YP January 2015  – Present (8 months) Glendale, CA Implement and manage policies and practices that represent the network engagement model for large, strategic partners and advertisers in the National Direct Sales Channel for YP's Search Marketplace Director, Network Quality Yahoo August 2013  – Present (2 years 1 month) Burbank Responsible for Network Quality which includes ad quality, supply quality, traffic quality, and malvertising across Yahoo's display platforms which includes the Yahoo Ad Exchange (formerly Right Media Exchange). \nParticipate in Trust and Safety initiatives which include product, policy or process programs to improve the health our marketplaces. Director, Planning and Insights Yahoo! June 2011  – Present (4 years 3 months) Represent Network Quality across Y! with all internal stakeholders including Product, Engineering, and Business teams. Ensure that business needs are supported through the design of mechanisms – tools, products, processes, policies that prevent risky and fraudulent activities on our network or platforms. Provide centralized project management, reporting, dashboard development, and tool development support for Network Quality teams. Director, Exchange Operations Yahoo! August 2010  –  June 2011  (11 months) * Managed team responsible for risk management and abuse prevention processes for supply and demand across multiple platforms, including Yahoo's Right Media Exchange.  \n* Evaluated advertiser and publisher requirements, assessed current business processes and operating results, made recommendations for improvements and increased efficiencies, and drove the implementation of new programs to scale the operation \n* Nominated for Yahoo's Superstar Award Director, Search Ad Quality Operations and Offshoring Yahoo Search Marketing May 2008  –  August 2010  (2 years 4 months) * Set the strategy, drive process improvement and efficiently manage the Search Ad Quality Operations \n* Act as the key leader in offshored operations from the relationship, financial, and performance perspectives \n* Lead a team of Managers (and their respective teams both in Burbank and offshore) while partnering with core stakeholders across the organization to drive projects that enhance advertiser experience, the quality of ads, the operational efficiency, and revenue \n* Own Ad Quality Operations service levels including turnaround time, productivity, quality, revenue, and cost for a 24x7 operation \n* Lead a team dedicated to credit card fraud operations, subject to similar service levels, productivity, and quality measures \n* Evaluate advertiser requirements, assess current business processes and operating results, make recommendations for improvements and increased efficiencies, and drive the implementation of new programs to scale the operation Sr. Manager, Product Quality and Analysis Yahoo! Search Marketing October 2006  –  May 2008  (1 year 8 months) * Design of relevance tests for Sponsored Search, Domain Match, and Content Match products \n* Led localization effort to build content matching classifers for 8 markets \n* Tuning of matching technologies \n* Lead organization responsible for execution of relevance assessments \n* Product analysis for opportunities to improve quality \n* Construction of datasets and taxonomy used to train algorithms/classifiers \n* Work closely with Product Mangement and Engineering \n* Named as an inventor on patented Associative Matching technology \n \nDistinguished Recognition: Nominated for Yahoo!'s Superstar Award for leading the relevance and editorial efforts to localize content match algorithms in 8 markets Manager, Relevance Assessment Team YSM January 2005  –  October 2006  (1 year 10 months) * Built and led an organization that included editorial functions, analysis, and project management responsible for measurement and analysis of sponsored search result quality including contextual matching technologies, evaluation of proposed sponsored search product changes, assessment of user experience and revenue impact, and competitive analysis.  \n*Worked closely with Sciences, Product, and Engineering Assistant Manager, Forecasting Universal Studios Home Video December 2002  –  December 2003  (1 year 1 month) * Provided forecasts of home video sales \n* Ad hoc analysis of sales opportunities and trends \n* Liased with CEO and CFO on daily basis Actuarial Training Manager/Sr. Actuarial Analyst Allstate Insurance Company May 1997  –  August 2000  (3 years 4 months) * Trained new hires and interns in actuarial methodology \n* Managed team of new hires in conducting rate filings \n* Performed rate filings and led Engineering in execution of changes, developed test case scenarios, executed test plan, reviewed results after implementation Executive Director, Search Marketplace Operations YP January 2015  – Present (8 months) Glendale, CA Implement and manage policies and practices that represent the network engagement model for large, strategic partners and advertisers in the National Direct Sales Channel for YP's Search Marketplace Executive Director, Search Marketplace Operations YP January 2015  – Present (8 months) Glendale, CA Implement and manage policies and practices that represent the network engagement model for large, strategic partners and advertisers in the National Direct Sales Channel for YP's Search Marketplace Director, Network Quality Yahoo August 2013  – Present (2 years 1 month) Burbank Responsible for Network Quality which includes ad quality, supply quality, traffic quality, and malvertising across Yahoo's display platforms which includes the Yahoo Ad Exchange (formerly Right Media Exchange). \nParticipate in Trust and Safety initiatives which include product, policy or process programs to improve the health our marketplaces. Director, Network Quality Yahoo August 2013  – Present (2 years 1 month) Burbank Responsible for Network Quality which includes ad quality, supply quality, traffic quality, and malvertising across Yahoo's display platforms which includes the Yahoo Ad Exchange (formerly Right Media Exchange). \nParticipate in Trust and Safety initiatives which include product, policy or process programs to improve the health our marketplaces. Director, Planning and Insights Yahoo! June 2011  – Present (4 years 3 months) Represent Network Quality across Y! with all internal stakeholders including Product, Engineering, and Business teams. Ensure that business needs are supported through the design of mechanisms – tools, products, processes, policies that prevent risky and fraudulent activities on our network or platforms. Provide centralized project management, reporting, dashboard development, and tool development support for Network Quality teams. Director, Planning and Insights Yahoo! June 2011  – Present (4 years 3 months) Represent Network Quality across Y! with all internal stakeholders including Product, Engineering, and Business teams. Ensure that business needs are supported through the design of mechanisms – tools, products, processes, policies that prevent risky and fraudulent activities on our network or platforms. Provide centralized project management, reporting, dashboard development, and tool development support for Network Quality teams. Director, Exchange Operations Yahoo! August 2010  –  June 2011  (11 months) * Managed team responsible for risk management and abuse prevention processes for supply and demand across multiple platforms, including Yahoo's Right Media Exchange.  \n* Evaluated advertiser and publisher requirements, assessed current business processes and operating results, made recommendations for improvements and increased efficiencies, and drove the implementation of new programs to scale the operation \n* Nominated for Yahoo's Superstar Award Director, Exchange Operations Yahoo! August 2010  –  June 2011  (11 months) * Managed team responsible for risk management and abuse prevention processes for supply and demand across multiple platforms, including Yahoo's Right Media Exchange.  \n* Evaluated advertiser and publisher requirements, assessed current business processes and operating results, made recommendations for improvements and increased efficiencies, and drove the implementation of new programs to scale the operation \n* Nominated for Yahoo's Superstar Award Director, Search Ad Quality Operations and Offshoring Yahoo Search Marketing May 2008  –  August 2010  (2 years 4 months) * Set the strategy, drive process improvement and efficiently manage the Search Ad Quality Operations \n* Act as the key leader in offshored operations from the relationship, financial, and performance perspectives \n* Lead a team of Managers (and their respective teams both in Burbank and offshore) while partnering with core stakeholders across the organization to drive projects that enhance advertiser experience, the quality of ads, the operational efficiency, and revenue \n* Own Ad Quality Operations service levels including turnaround time, productivity, quality, revenue, and cost for a 24x7 operation \n* Lead a team dedicated to credit card fraud operations, subject to similar service levels, productivity, and quality measures \n* Evaluate advertiser requirements, assess current business processes and operating results, make recommendations for improvements and increased efficiencies, and drive the implementation of new programs to scale the operation Director, Search Ad Quality Operations and Offshoring Yahoo Search Marketing May 2008  –  August 2010  (2 years 4 months) * Set the strategy, drive process improvement and efficiently manage the Search Ad Quality Operations \n* Act as the key leader in offshored operations from the relationship, financial, and performance perspectives \n* Lead a team of Managers (and their respective teams both in Burbank and offshore) while partnering with core stakeholders across the organization to drive projects that enhance advertiser experience, the quality of ads, the operational efficiency, and revenue \n* Own Ad Quality Operations service levels including turnaround time, productivity, quality, revenue, and cost for a 24x7 operation \n* Lead a team dedicated to credit card fraud operations, subject to similar service levels, productivity, and quality measures \n* Evaluate advertiser requirements, assess current business processes and operating results, make recommendations for improvements and increased efficiencies, and drive the implementation of new programs to scale the operation Sr. Manager, Product Quality and Analysis Yahoo! Search Marketing October 2006  –  May 2008  (1 year 8 months) * Design of relevance tests for Sponsored Search, Domain Match, and Content Match products \n* Led localization effort to build content matching classifers for 8 markets \n* Tuning of matching technologies \n* Lead organization responsible for execution of relevance assessments \n* Product analysis for opportunities to improve quality \n* Construction of datasets and taxonomy used to train algorithms/classifiers \n* Work closely with Product Mangement and Engineering \n* Named as an inventor on patented Associative Matching technology \n \nDistinguished Recognition: Nominated for Yahoo!'s Superstar Award for leading the relevance and editorial efforts to localize content match algorithms in 8 markets Sr. Manager, Product Quality and Analysis Yahoo! Search Marketing October 2006  –  May 2008  (1 year 8 months) * Design of relevance tests for Sponsored Search, Domain Match, and Content Match products \n* Led localization effort to build content matching classifers for 8 markets \n* Tuning of matching technologies \n* Lead organization responsible for execution of relevance assessments \n* Product analysis for opportunities to improve quality \n* Construction of datasets and taxonomy used to train algorithms/classifiers \n* Work closely with Product Mangement and Engineering \n* Named as an inventor on patented Associative Matching technology \n \nDistinguished Recognition: Nominated for Yahoo!'s Superstar Award for leading the relevance and editorial efforts to localize content match algorithms in 8 markets Manager, Relevance Assessment Team YSM January 2005  –  October 2006  (1 year 10 months) * Built and led an organization that included editorial functions, analysis, and project management responsible for measurement and analysis of sponsored search result quality including contextual matching technologies, evaluation of proposed sponsored search product changes, assessment of user experience and revenue impact, and competitive analysis.  \n*Worked closely with Sciences, Product, and Engineering Manager, Relevance Assessment Team YSM January 2005  –  October 2006  (1 year 10 months) * Built and led an organization that included editorial functions, analysis, and project management responsible for measurement and analysis of sponsored search result quality including contextual matching technologies, evaluation of proposed sponsored search product changes, assessment of user experience and revenue impact, and competitive analysis.  \n*Worked closely with Sciences, Product, and Engineering Assistant Manager, Forecasting Universal Studios Home Video December 2002  –  December 2003  (1 year 1 month) * Provided forecasts of home video sales \n* Ad hoc analysis of sales opportunities and trends \n* Liased with CEO and CFO on daily basis Assistant Manager, Forecasting Universal Studios Home Video December 2002  –  December 2003  (1 year 1 month) * Provided forecasts of home video sales \n* Ad hoc analysis of sales opportunities and trends \n* Liased with CEO and CFO on daily basis Actuarial Training Manager/Sr. Actuarial Analyst Allstate Insurance Company May 1997  –  August 2000  (3 years 4 months) * Trained new hires and interns in actuarial methodology \n* Managed team of new hires in conducting rate filings \n* Performed rate filings and led Engineering in execution of changes, developed test case scenarios, executed test plan, reviewed results after implementation Actuarial Training Manager/Sr. Actuarial Analyst Allstate Insurance Company May 1997  –  August 2000  (3 years 4 months) * Trained new hires and interns in actuarial methodology \n* Managed team of new hires in conducting rate filings \n* Performed rate filings and led Engineering in execution of changes, developed test case scenarios, executed test plan, reviewed results after implementation Skills Information Architecture Project Management Management Analysis Operational Planning Taxonomy Analytics Online Advertising PPC Outsourcing Offshoring Classification Categorization Relevance Team Leadership Monetization Online Fraud Text Classification Operations Management Search Advertising Contextual Advertising Competitive Analysis Cross-functional Team... Strategic Partnerships E-commerce SEM Strategy Web Analytics See 13+     See less Skills  Information Architecture Project Management Management Analysis Operational Planning Taxonomy Analytics Online Advertising PPC Outsourcing Offshoring Classification Categorization Relevance Team Leadership Monetization Online Fraud Text Classification Operations Management Search Advertising Contextual Advertising Competitive Analysis Cross-functional Team... Strategic Partnerships E-commerce SEM Strategy Web Analytics See 13+     See less Information Architecture Project Management Management Analysis Operational Planning Taxonomy Analytics Online Advertising PPC Outsourcing Offshoring Classification Categorization Relevance Team Leadership Monetization Online Fraud Text Classification Operations Management Search Advertising Contextual Advertising Competitive Analysis Cross-functional Team... Strategic Partnerships E-commerce SEM Strategy Web Analytics See 13+     See less Information Architecture Project Management Management Analysis Operational Planning Taxonomy Analytics Online Advertising PPC Outsourcing Offshoring Classification Categorization Relevance Team Leadership Monetization Online Fraud Text Classification Operations Management Search Advertising Contextual Advertising Competitive Analysis Cross-functional Team... Strategic Partnerships E-commerce SEM Strategy Web Analytics See 13+     See less Education University of California, Los Angeles - The Anderson School of Management MBA,  Entertainment Management 2000  – 2002 University of Notre Dame BS,  Mathematics University of California, Los Angeles - The Anderson School of Management MBA,  Entertainment Management 2000  – 2002 University of California, Los Angeles - The Anderson School of Management MBA,  Entertainment Management 2000  – 2002 University of California, Los Angeles - The Anderson School of Management MBA,  Entertainment Management 2000  – 2002 University of Notre Dame BS,  Mathematics University of Notre Dame BS,  Mathematics University of Notre Dame BS,  Mathematics "]}