{"position": "Engineering Manager, SCM-Build-Release", "company": "Google", "profiles": ["Summary Over 10 years of experience in Continuous Delivery, Linux Administration, Software configuration Management, Software Build and Release, Process automation using scripts, Database Administration Summary Over 10 years of experience in Continuous Delivery, Linux Administration, Software configuration Management, Software Build and Release, Process automation using scripts, Database Administration Over 10 years of experience in Continuous Delivery, Linux Administration, Software configuration Management, Software Build and Release, Process automation using scripts, Database Administration Over 10 years of experience in Continuous Delivery, Linux Administration, Software configuration Management, Software Build and Release, Process automation using scripts, Database Administration Experience Principal Engineer (Build and Release) Yahoo October 2013  – Present (1 year 11 months) Build and Release Manager Nagarro January 2013  –  October 2013  (10 months) Linux Administrator Nagarro July 2008  –  December 2012  (4 years 6 months) Infrastructure Specialist Nagarro Software AB August 2010  –  May 2011  (10 months) MTS (Member of Technical Staff) Cadence Design Systems October 2007  –  May 2008  (8 months) Build and Release Engineer Nagarro Software January 2006  –  August 2007  (1 year 8 months) Build and Release Senior Software Engineer GrapeCity 2005  –  2006  (1 year) Software Engineer Infosys Technologies Ltd 2004  –  2005  (1 year) Principal Engineer (Build and Release) Yahoo October 2013  – Present (1 year 11 months) Principal Engineer (Build and Release) Yahoo October 2013  – Present (1 year 11 months) Build and Release Manager Nagarro January 2013  –  October 2013  (10 months) Build and Release Manager Nagarro January 2013  –  October 2013  (10 months) Linux Administrator Nagarro July 2008  –  December 2012  (4 years 6 months) Linux Administrator Nagarro July 2008  –  December 2012  (4 years 6 months) Infrastructure Specialist Nagarro Software AB August 2010  –  May 2011  (10 months) Infrastructure Specialist Nagarro Software AB August 2010  –  May 2011  (10 months) MTS (Member of Technical Staff) Cadence Design Systems October 2007  –  May 2008  (8 months) MTS (Member of Technical Staff) Cadence Design Systems October 2007  –  May 2008  (8 months) Build and Release Engineer Nagarro Software January 2006  –  August 2007  (1 year 8 months) Build and Release Build and Release Engineer Nagarro Software January 2006  –  August 2007  (1 year 8 months) Build and Release Senior Software Engineer GrapeCity 2005  –  2006  (1 year) Senior Software Engineer GrapeCity 2005  –  2006  (1 year) Software Engineer Infosys Technologies Ltd 2004  –  2005  (1 year) Software Engineer Infosys Technologies Ltd 2004  –  2005  (1 year) Skills Unix Linux Maven Tomcat Ant Shell Scripting Jenkins Web Services Solaris Apache Artifactory Subversion Amazon Web Services... Sonar Agile Methodologies Scrum MySQL GNU Make Continuous Integration Continuous Delivery Awk Sed Bash Capistrano Ruby Chef Git Github See 13+     See less Skills  Unix Linux Maven Tomcat Ant Shell Scripting Jenkins Web Services Solaris Apache Artifactory Subversion Amazon Web Services... Sonar Agile Methodologies Scrum MySQL GNU Make Continuous Integration Continuous Delivery Awk Sed Bash Capistrano Ruby Chef Git Github See 13+     See less Unix Linux Maven Tomcat Ant Shell Scripting Jenkins Web Services Solaris Apache Artifactory Subversion Amazon Web Services... Sonar Agile Methodologies Scrum MySQL GNU Make Continuous Integration Continuous Delivery Awk Sed Bash Capistrano Ruby Chef Git Github See 13+     See less Unix Linux Maven Tomcat Ant Shell Scripting Jenkins Web Services Solaris Apache Artifactory Subversion Amazon Web Services... Sonar Agile Methodologies Scrum MySQL GNU Make Continuous Integration Continuous Delivery Awk Sed Bash Capistrano Ruby Chef Git Github See 13+     See less Education Karnataka State Open University M.Tech,  Information Technology 2010  – 2011 Tiffin Aviation Services Commercial Pilot License,  Fixed Wing Aircraft 2007  – 2008 Guru Gobind Singh Indraprastha University B.Tech,  Information Technology 2000  – 2004 Veda Vyas DAV Public School XIIth,  Physics ,  Chemistry ,  Maths 1999  – 2000 Veda Vyas DAV Pulic School Xth,  Science , Maths 1997  – 1998 Activities and Societies:  Qualified in Olympiad Mathematics Exam. Karnataka State Open University M.Tech,  Information Technology 2010  – 2011 Karnataka State Open University M.Tech,  Information Technology 2010  – 2011 Karnataka State Open University M.Tech,  Information Technology 2010  – 2011 Tiffin Aviation Services Commercial Pilot License,  Fixed Wing Aircraft 2007  – 2008 Tiffin Aviation Services Commercial Pilot License,  Fixed Wing Aircraft 2007  – 2008 Tiffin Aviation Services Commercial Pilot License,  Fixed Wing Aircraft 2007  – 2008 Guru Gobind Singh Indraprastha University B.Tech,  Information Technology 2000  – 2004 Guru Gobind Singh Indraprastha University B.Tech,  Information Technology 2000  – 2004 Guru Gobind Singh Indraprastha University B.Tech,  Information Technology 2000  – 2004 Veda Vyas DAV Public School XIIth,  Physics ,  Chemistry ,  Maths 1999  – 2000 Veda Vyas DAV Public School XIIth,  Physics ,  Chemistry ,  Maths 1999  – 2000 Veda Vyas DAV Public School XIIth,  Physics ,  Chemistry ,  Maths 1999  – 2000 Veda Vyas DAV Pulic School Xth,  Science , Maths 1997  – 1998 Activities and Societies:  Qualified in Olympiad Mathematics Exam. Veda Vyas DAV Pulic School Xth,  Science , Maths 1997  – 1998 Activities and Societies:  Qualified in Olympiad Mathematics Exam. Veda Vyas DAV Pulic School Xth,  Science , Maths 1997  – 1998 Activities and Societies:  Qualified in Olympiad Mathematics Exam. Honors & Awards Employee of the Quarter Nagarro Quarterly Awards April 2013 Received Employee of the Quarter award for taking initiative and centralizing Build and Release infrastructure of over 10 java and Andriod based projects at Nagarro. Employee of the Quarter Nagarro Quarterly Awards April 2013 Received Employee of the Quarter award for taking initiative and centralizing Build and Release infrastructure of over 10 java and Andriod based projects at Nagarro. Employee of the Quarter Nagarro Quarterly Awards April 2013 Received Employee of the Quarter award for taking initiative and centralizing Build and Release infrastructure of over 10 java and Andriod based projects at Nagarro. Employee of the Quarter Nagarro Quarterly Awards April 2013 Received Employee of the Quarter award for taking initiative and centralizing Build and Release infrastructure of over 10 java and Andriod based projects at Nagarro. ", "Skills Perforce Agile Methodologies Unix Perl Shell Scripting Continuous Integration Scrum Scalability Software Development Jenkins Python Subversion Ruby Git Java SiteScope REST Mobile Devices JIRA Bash Django See 6+     See less Skills  Perforce Agile Methodologies Unix Perl Shell Scripting Continuous Integration Scrum Scalability Software Development Jenkins Python Subversion Ruby Git Java SiteScope REST Mobile Devices JIRA Bash Django See 6+     See less Perforce Agile Methodologies Unix Perl Shell Scripting Continuous Integration Scrum Scalability Software Development Jenkins Python Subversion Ruby Git Java SiteScope REST Mobile Devices JIRA Bash Django See 6+     See less Perforce Agile Methodologies Unix Perl Shell Scripting Continuous Integration Scrum Scalability Software Development Jenkins Python Subversion Ruby Git Java SiteScope REST Mobile Devices JIRA Bash Django See 6+     See less ", "Skills Continuous Integration Hudson CVS Perl Release Engineering Software Configuration... Release Management Subversion Shell Scripting Quality Assurance Integration Jenkins Git XML JSON Rally REST HTML Bugzilla Apache Maven SBT Github Linux Unix Software Development Agile Methodologies See 12+     See less Skills  Continuous Integration Hudson CVS Perl Release Engineering Software Configuration... Release Management Subversion Shell Scripting Quality Assurance Integration Jenkins Git XML JSON Rally REST HTML Bugzilla Apache Maven SBT Github Linux Unix Software Development Agile Methodologies See 12+     See less Continuous Integration Hudson CVS Perl Release Engineering Software Configuration... Release Management Subversion Shell Scripting Quality Assurance Integration Jenkins Git XML JSON Rally REST HTML Bugzilla Apache Maven SBT Github Linux Unix Software Development Agile Methodologies See 12+     See less Continuous Integration Hudson CVS Perl Release Engineering Software Configuration... Release Management Subversion Shell Scripting Quality Assurance Integration Jenkins Git XML JSON Rally REST HTML Bugzilla Apache Maven SBT Github Linux Unix Software Development Agile Methodologies See 12+     See less ", "Summary Specialties: Platforms Scalability \nCapacity Planning \nBuild and Release Engineer \nHardware and Software Monitoring \nSoftware development \nSoftware Design and Architecture Summary Specialties: Platforms Scalability \nCapacity Planning \nBuild and Release Engineer \nHardware and Software Monitoring \nSoftware development \nSoftware Design and Architecture Specialties: Platforms Scalability \nCapacity Planning \nBuild and Release Engineer \nHardware and Software Monitoring \nSoftware development \nSoftware Design and Architecture Specialties: Platforms Scalability \nCapacity Planning \nBuild and Release Engineer \nHardware and Software Monitoring \nSoftware development \nSoftware Design and Architecture Experience Global Media Build and Release Engineer Yahoo! March 2013  – Present (2 years 6 months) United States - Work with Engineering, Operations, Quality Assurance and Project Management to define and execute projects that implement build and release of software.  \n \n- Responsible for building, releasing, automating and configuring changes into Integration, QA, Staging and Production environments.  \n \n- Develop an automated, continuous, build process that reviews the source code, identifies build errors and notifies appropriate parties to expedite/facilitate synchronization to the latest positive build.  \n \n- Improve productivity by designing & developing full-featured build systems; implementing tools and scripts that enable efficient, flexible builds (Shell, Perl, Python)  \n \n- Customize source code and bug tracking tools to meet release process requirements and/or Identify new tools/technologies that will make the release and CM process more efficient, reliable, and cost effective \n \n- Building customized platforms using NodeJS to create pipelines, build and test code to on-board NodeJS applications OpenStack Build Engineer Yahoo! January 2012  –  February 2013  (1 year 2 months) United States - Build the entire Continuous Integration infrastructure and processes to build OpenStack at Yahoo! using open source tools and internal tools. \n \n- Integrate CI with Yahoo! OpenStack to build packages and build a stable state that could be shipped to production. \n \n- Use of Anvil Open Source Tools built by yahoo to build every package needed to build OpenStack on RHEL \n \n- Integrate code unit test in OpenStack package build \n \n- Build and configure the package infrastructure use by OpenStack during deploy time. \n \n- Work closely with developers and train them on the CI process. Global Media Build and Release Engineer Yahoo! December 2010  –  January 2012  (1 year 2 months) - Work with Engineering, Operations, Quality Assurance and Project Management to define and execute projects that implement build and release of software.  \n \n- Responsible for building, releasing, automating and configuring changes into Integration, QA, Staging and Production environments.  \n \n- Develop an automated, continuous, build process that reviews the source code, identifies build errors and notifies appropriate parties to expedite/facilitate synchronization to the latest positive build.  \n \n- Improve productivity by designing & developing full-featured build systems; implementing tools and scripts that enable efficient, flexible builds (Shell, Perl)  \n \n- Customize source code and bug tracking tools to meet release process requirements and/or Identify new tools/technologies that will make the release and CM process more efficient, reliable, and cost effective \n \n- Build Monitoring around the build and release systems to keep the health of the system in good shape \n \n- Keep the build environment flowing by proactively fixing blocking builds or hardware failures \n \n- Currently working on moving Media software to the Cloud Media Service Engineer Yahoo! June 2009  –  December 2010  (1 year 7 months) Take project requirements and map them to hardware configurations  \n \nWork closely with development teams to ensure products are built to optimum performance and maintainability standards.  \n \nMaintain distributed systems for fault detection and SLA compliance.  \n \nHelp develop and implement tools to aid tracking and monitoring of all performance, uptime and metrics benchmarks.  \n \nIntegrate tightly with other Yahoo Operations groups to address service outages and capacity planning. Software Engineer - News Yahoo! October 2007  –  June 2009  (1 year 9 months) Yahoo! News Engineer \n- PHP \n- MySQL \n- Perl \n- HTML/CSS/Javascript \n \nInfrastructure platform team for news.yahoo.com \n \nDesign of backend servers infrastructure \nBackend engineering and feed processing expert \nPerl programming feed processing \nSupport, Scalability and Monitoring of the Content Management System \nCapacity Planing \nMonitoring production servers and services (nagios) \nRelease cycles \nJake support for US/CA/Latam \n \nBackend infrastructure: \nSupporting and extending high performance systems to ingest, process and distribute breaking news from thousands of sources, including hundreds of newspapers \nSupporting, developing and optimizing massively scaled database-driven applications \nTroubleshooting and resolving complex issues on live sites, during heaviest traffic \nLeading efforts, with support from the Tech Lead, to plan for long-term scalability and stability of Yahoo! News platform \nWorking with operations team to transfer ongoing maintenance and monitoring responsibilities Software Engineer - Latam Yahoo! June 2005  –  September 2007  (2 years 4 months) Engineering/Developer \n \n- PHP \n- Perl \n- HTML/CSS/Javascript \n- MySQL \n \nDesign and Development of different sites for Yahoo! Americas \nExperience with localization/internationalization and testing techniques \nMonitoring and maintenance of production servers \n \nWork directly with Product to define new sites and features \nProject planing  \nWork in Sprint/Scrum cycles Software Engineer - Mexico Yahoo! December 2000  –  December 2002  (2 years 1 month) Programmer and Development \n- Perl \n- C \n- PHP \n- MySQL \n- HTML/CSS/Javascript \n \nDesign and development for Yahoo Mexico Sites \nMaintenance and upgrades to current sites \nBuild devel environment for different projects \nBuild Custom Sites for Yahoo Mexico Software Developer Universidad de las Americas Puebla 1998  –  2000  (2 years) Fundacion Universidad de las Americas Puebla (UDLA-P)  \nSunRay 1.1 Administrator (SUN Microsystems thin clients)  \nUNIX Administrator \nWindows NT Terminal Server Administrator  \nCitrix MetaFrame 1.8 Administrator \n \n \nFundacion Universidad de las Americas Puebla (UDLA-P)  \nProgramming, Maintenance and Developing Department  \nProgramming and maintenance for all the university internal systems \nBuild some of the Internal websites Global Media Build and Release Engineer Yahoo! March 2013  – Present (2 years 6 months) United States - Work with Engineering, Operations, Quality Assurance and Project Management to define and execute projects that implement build and release of software.  \n \n- Responsible for building, releasing, automating and configuring changes into Integration, QA, Staging and Production environments.  \n \n- Develop an automated, continuous, build process that reviews the source code, identifies build errors and notifies appropriate parties to expedite/facilitate synchronization to the latest positive build.  \n \n- Improve productivity by designing & developing full-featured build systems; implementing tools and scripts that enable efficient, flexible builds (Shell, Perl, Python)  \n \n- Customize source code and bug tracking tools to meet release process requirements and/or Identify new tools/technologies that will make the release and CM process more efficient, reliable, and cost effective \n \n- Building customized platforms using NodeJS to create pipelines, build and test code to on-board NodeJS applications Global Media Build and Release Engineer Yahoo! March 2013  – Present (2 years 6 months) United States - Work with Engineering, Operations, Quality Assurance and Project Management to define and execute projects that implement build and release of software.  \n \n- Responsible for building, releasing, automating and configuring changes into Integration, QA, Staging and Production environments.  \n \n- Develop an automated, continuous, build process that reviews the source code, identifies build errors and notifies appropriate parties to expedite/facilitate synchronization to the latest positive build.  \n \n- Improve productivity by designing & developing full-featured build systems; implementing tools and scripts that enable efficient, flexible builds (Shell, Perl, Python)  \n \n- Customize source code and bug tracking tools to meet release process requirements and/or Identify new tools/technologies that will make the release and CM process more efficient, reliable, and cost effective \n \n- Building customized platforms using NodeJS to create pipelines, build and test code to on-board NodeJS applications OpenStack Build Engineer Yahoo! January 2012  –  February 2013  (1 year 2 months) United States - Build the entire Continuous Integration infrastructure and processes to build OpenStack at Yahoo! using open source tools and internal tools. \n \n- Integrate CI with Yahoo! OpenStack to build packages and build a stable state that could be shipped to production. \n \n- Use of Anvil Open Source Tools built by yahoo to build every package needed to build OpenStack on RHEL \n \n- Integrate code unit test in OpenStack package build \n \n- Build and configure the package infrastructure use by OpenStack during deploy time. \n \n- Work closely with developers and train them on the CI process. OpenStack Build Engineer Yahoo! January 2012  –  February 2013  (1 year 2 months) United States - Build the entire Continuous Integration infrastructure and processes to build OpenStack at Yahoo! using open source tools and internal tools. \n \n- Integrate CI with Yahoo! OpenStack to build packages and build a stable state that could be shipped to production. \n \n- Use of Anvil Open Source Tools built by yahoo to build every package needed to build OpenStack on RHEL \n \n- Integrate code unit test in OpenStack package build \n \n- Build and configure the package infrastructure use by OpenStack during deploy time. \n \n- Work closely with developers and train them on the CI process. Global Media Build and Release Engineer Yahoo! December 2010  –  January 2012  (1 year 2 months) - Work with Engineering, Operations, Quality Assurance and Project Management to define and execute projects that implement build and release of software.  \n \n- Responsible for building, releasing, automating and configuring changes into Integration, QA, Staging and Production environments.  \n \n- Develop an automated, continuous, build process that reviews the source code, identifies build errors and notifies appropriate parties to expedite/facilitate synchronization to the latest positive build.  \n \n- Improve productivity by designing & developing full-featured build systems; implementing tools and scripts that enable efficient, flexible builds (Shell, Perl)  \n \n- Customize source code and bug tracking tools to meet release process requirements and/or Identify new tools/technologies that will make the release and CM process more efficient, reliable, and cost effective \n \n- Build Monitoring around the build and release systems to keep the health of the system in good shape \n \n- Keep the build environment flowing by proactively fixing blocking builds or hardware failures \n \n- Currently working on moving Media software to the Cloud Global Media Build and Release Engineer Yahoo! December 2010  –  January 2012  (1 year 2 months) - Work with Engineering, Operations, Quality Assurance and Project Management to define and execute projects that implement build and release of software.  \n \n- Responsible for building, releasing, automating and configuring changes into Integration, QA, Staging and Production environments.  \n \n- Develop an automated, continuous, build process that reviews the source code, identifies build errors and notifies appropriate parties to expedite/facilitate synchronization to the latest positive build.  \n \n- Improve productivity by designing & developing full-featured build systems; implementing tools and scripts that enable efficient, flexible builds (Shell, Perl)  \n \n- Customize source code and bug tracking tools to meet release process requirements and/or Identify new tools/technologies that will make the release and CM process more efficient, reliable, and cost effective \n \n- Build Monitoring around the build and release systems to keep the health of the system in good shape \n \n- Keep the build environment flowing by proactively fixing blocking builds or hardware failures \n \n- Currently working on moving Media software to the Cloud Media Service Engineer Yahoo! June 2009  –  December 2010  (1 year 7 months) Take project requirements and map them to hardware configurations  \n \nWork closely with development teams to ensure products are built to optimum performance and maintainability standards.  \n \nMaintain distributed systems for fault detection and SLA compliance.  \n \nHelp develop and implement tools to aid tracking and monitoring of all performance, uptime and metrics benchmarks.  \n \nIntegrate tightly with other Yahoo Operations groups to address service outages and capacity planning. Media Service Engineer Yahoo! June 2009  –  December 2010  (1 year 7 months) Take project requirements and map them to hardware configurations  \n \nWork closely with development teams to ensure products are built to optimum performance and maintainability standards.  \n \nMaintain distributed systems for fault detection and SLA compliance.  \n \nHelp develop and implement tools to aid tracking and monitoring of all performance, uptime and metrics benchmarks.  \n \nIntegrate tightly with other Yahoo Operations groups to address service outages and capacity planning. Software Engineer - News Yahoo! October 2007  –  June 2009  (1 year 9 months) Yahoo! News Engineer \n- PHP \n- MySQL \n- Perl \n- HTML/CSS/Javascript \n \nInfrastructure platform team for news.yahoo.com \n \nDesign of backend servers infrastructure \nBackend engineering and feed processing expert \nPerl programming feed processing \nSupport, Scalability and Monitoring of the Content Management System \nCapacity Planing \nMonitoring production servers and services (nagios) \nRelease cycles \nJake support for US/CA/Latam \n \nBackend infrastructure: \nSupporting and extending high performance systems to ingest, process and distribute breaking news from thousands of sources, including hundreds of newspapers \nSupporting, developing and optimizing massively scaled database-driven applications \nTroubleshooting and resolving complex issues on live sites, during heaviest traffic \nLeading efforts, with support from the Tech Lead, to plan for long-term scalability and stability of Yahoo! News platform \nWorking with operations team to transfer ongoing maintenance and monitoring responsibilities Software Engineer - News Yahoo! October 2007  –  June 2009  (1 year 9 months) Yahoo! News Engineer \n- PHP \n- MySQL \n- Perl \n- HTML/CSS/Javascript \n \nInfrastructure platform team for news.yahoo.com \n \nDesign of backend servers infrastructure \nBackend engineering and feed processing expert \nPerl programming feed processing \nSupport, Scalability and Monitoring of the Content Management System \nCapacity Planing \nMonitoring production servers and services (nagios) \nRelease cycles \nJake support for US/CA/Latam \n \nBackend infrastructure: \nSupporting and extending high performance systems to ingest, process and distribute breaking news from thousands of sources, including hundreds of newspapers \nSupporting, developing and optimizing massively scaled database-driven applications \nTroubleshooting and resolving complex issues on live sites, during heaviest traffic \nLeading efforts, with support from the Tech Lead, to plan for long-term scalability and stability of Yahoo! News platform \nWorking with operations team to transfer ongoing maintenance and monitoring responsibilities Software Engineer - Latam Yahoo! June 2005  –  September 2007  (2 years 4 months) Engineering/Developer \n \n- PHP \n- Perl \n- HTML/CSS/Javascript \n- MySQL \n \nDesign and Development of different sites for Yahoo! Americas \nExperience with localization/internationalization and testing techniques \nMonitoring and maintenance of production servers \n \nWork directly with Product to define new sites and features \nProject planing  \nWork in Sprint/Scrum cycles Software Engineer - Latam Yahoo! June 2005  –  September 2007  (2 years 4 months) Engineering/Developer \n \n- PHP \n- Perl \n- HTML/CSS/Javascript \n- MySQL \n \nDesign and Development of different sites for Yahoo! Americas \nExperience with localization/internationalization and testing techniques \nMonitoring and maintenance of production servers \n \nWork directly with Product to define new sites and features \nProject planing  \nWork in Sprint/Scrum cycles Software Engineer - Mexico Yahoo! December 2000  –  December 2002  (2 years 1 month) Programmer and Development \n- Perl \n- C \n- PHP \n- MySQL \n- HTML/CSS/Javascript \n \nDesign and development for Yahoo Mexico Sites \nMaintenance and upgrades to current sites \nBuild devel environment for different projects \nBuild Custom Sites for Yahoo Mexico Software Engineer - Mexico Yahoo! December 2000  –  December 2002  (2 years 1 month) Programmer and Development \n- Perl \n- C \n- PHP \n- MySQL \n- HTML/CSS/Javascript \n \nDesign and development for Yahoo Mexico Sites \nMaintenance and upgrades to current sites \nBuild devel environment for different projects \nBuild Custom Sites for Yahoo Mexico Software Developer Universidad de las Americas Puebla 1998  –  2000  (2 years) Fundacion Universidad de las Americas Puebla (UDLA-P)  \nSunRay 1.1 Administrator (SUN Microsystems thin clients)  \nUNIX Administrator \nWindows NT Terminal Server Administrator  \nCitrix MetaFrame 1.8 Administrator \n \n \nFundacion Universidad de las Americas Puebla (UDLA-P)  \nProgramming, Maintenance and Developing Department  \nProgramming and maintenance for all the university internal systems \nBuild some of the Internal websites Software Developer Universidad de las Americas Puebla 1998  –  2000  (2 years) Fundacion Universidad de las Americas Puebla (UDLA-P)  \nSunRay 1.1 Administrator (SUN Microsystems thin clients)  \nUNIX Administrator \nWindows NT Terminal Server Administrator  \nCitrix MetaFrame 1.8 Administrator \n \n \nFundacion Universidad de las Americas Puebla (UDLA-P)  \nProgramming, Maintenance and Developing Department  \nProgramming and maintenance for all the university internal systems \nBuild some of the Internal websites Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Perl Apache Unix HTML Software Development MySQL Continuous Integration Scalability PHP Subversion Shell Scripting Bash Linux Nagios Performance Tuning Software Design Scrum Git GNU Make Python Databases Distributed Systems Node.js RHEL Systems Monitoring High Availability FreeBSD Capacity Planning Scripting Bugzilla C Github Release Engineering Building Automation Kanban See 20+     See less Skills  Perl Apache Unix HTML Software Development MySQL Continuous Integration Scalability PHP Subversion Shell Scripting Bash Linux Nagios Performance Tuning Software Design Scrum Git GNU Make Python Databases Distributed Systems Node.js RHEL Systems Monitoring High Availability FreeBSD Capacity Planning Scripting Bugzilla C Github Release Engineering Building Automation Kanban See 20+     See less Perl Apache Unix HTML Software Development MySQL Continuous Integration Scalability PHP Subversion Shell Scripting Bash Linux Nagios Performance Tuning Software Design Scrum Git GNU Make Python Databases Distributed Systems Node.js RHEL Systems Monitoring High Availability FreeBSD Capacity Planning Scripting Bugzilla C Github Release Engineering Building Automation Kanban See 20+     See less Perl Apache Unix HTML Software Development MySQL Continuous Integration Scalability PHP Subversion Shell Scripting Bash Linux Nagios Performance Tuning Software Design Scrum Git GNU Make Python Databases Distributed Systems Node.js RHEL Systems Monitoring High Availability FreeBSD Capacity Planning Scripting Bugzilla C Github Release Engineering Building Automation Kanban See 20+     See less Education Universidad de Las Americas Puebla BS,  Computer Systems Engineer 1993  – 2000 Colegio Americano de Puebla Universidad de Las Americas Puebla BS,  Computer Systems Engineer 1993  – 2000 Universidad de Las Americas Puebla BS,  Computer Systems Engineer 1993  – 2000 Universidad de Las Americas Puebla BS,  Computer Systems Engineer 1993  – 2000 Colegio Americano de Puebla Colegio Americano de Puebla Colegio Americano de Puebla Honors & Awards Yahoo! Super Star Yahoo! December 2011 Lego and Content Agility Team Yahoo! Latam Award Yahoo! June 2007 Award for Launching News for Mexico, Argentina, Brasil, Canada and Espanol You Rock! Yahoo Award Yahoo! December 2011 You Rock! Agile Award \nLego Build & Release Team \n Additional Honors & Awards Yahoo International odysseyaward \nYahoo Canada Honor Award Yahoo! Super Star Yahoo! December 2011 Lego and Content Agility Team Yahoo! Super Star Yahoo! December 2011 Lego and Content Agility Team Yahoo! Super Star Yahoo! December 2011 Lego and Content Agility Team Yahoo! Latam Award Yahoo! June 2007 Award for Launching News for Mexico, Argentina, Brasil, Canada and Espanol Yahoo! Latam Award Yahoo! June 2007 Award for Launching News for Mexico, Argentina, Brasil, Canada and Espanol Yahoo! Latam Award Yahoo! June 2007 Award for Launching News for Mexico, Argentina, Brasil, Canada and Espanol You Rock! Yahoo Award Yahoo! December 2011 You Rock! Agile Award \nLego Build & Release Team \n You Rock! Yahoo Award Yahoo! December 2011 You Rock! Agile Award \nLego Build & Release Team \n You Rock! Yahoo Award Yahoo! December 2011 You Rock! Agile Award \nLego Build & Release Team \n Additional Honors & Awards Yahoo International odysseyaward \nYahoo Canada Honor Award Additional Honors & Awards Yahoo International odysseyaward \nYahoo Canada Honor Award Additional Honors & Awards Yahoo International odysseyaward \nYahoo Canada Honor Award ", "Experience Release Engineer Yahoo Release Engineer Yahoo Release Engineer Yahoo Education BS BS BS BS ", "Summary Software Build, Release, Gatekeeping, and configuration management. Specialties:Software Build, Release, Gatekeeping, and configuration management. Summary Software Build, Release, Gatekeeping, and configuration management. Specialties:Software Build, Release, Gatekeeping, and configuration management. Software Build, Release, Gatekeeping, and configuration management. Specialties:Software Build, Release, Gatekeeping, and configuration management. Software Build, Release, Gatekeeping, and configuration management. Specialties:Software Build, Release, Gatekeeping, and configuration management. Experience Senior Release Engineer Yahoo, Inc. May 2006  – Present (9 years 4 months) Senior Software Release Engineer Kazeon Systems, Inc. December 2004  –  May 2006  (1 year 6 months) Managed all aspects of the build and release process. for a Linux based product sold as a turnkey solution. Also worked on the Anaconda based installer for the product. Manager/Technical Lead, Software Release Engineering & Lab Mgt Sun Microsystems, Inc. February 1995  –  December 2004  (9 years 11 months) Manager and Technical lead for a team of Release Engineers \nand Lab administrators. Sucessfully released dozeons of \nmajor and minor releases. Key contributor to policy and \nprocedure design and implementation. Represented several  \ndevelopment teams in cross-organizational roles. Senior Release Engineer Yahoo, Inc. May 2006  – Present (9 years 4 months) Senior Release Engineer Yahoo, Inc. May 2006  – Present (9 years 4 months) Senior Software Release Engineer Kazeon Systems, Inc. December 2004  –  May 2006  (1 year 6 months) Managed all aspects of the build and release process. for a Linux based product sold as a turnkey solution. Also worked on the Anaconda based installer for the product. Senior Software Release Engineer Kazeon Systems, Inc. December 2004  –  May 2006  (1 year 6 months) Managed all aspects of the build and release process. for a Linux based product sold as a turnkey solution. Also worked on the Anaconda based installer for the product. Manager/Technical Lead, Software Release Engineering & Lab Mgt Sun Microsystems, Inc. February 1995  –  December 2004  (9 years 11 months) Manager and Technical lead for a team of Release Engineers \nand Lab administrators. Sucessfully released dozeons of \nmajor and minor releases. Key contributor to policy and \nprocedure design and implementation. Represented several  \ndevelopment teams in cross-organizational roles. Manager/Technical Lead, Software Release Engineering & Lab Mgt Sun Microsystems, Inc. February 1995  –  December 2004  (9 years 11 months) Manager and Technical lead for a team of Release Engineers \nand Lab administrators. Sucessfully released dozeons of \nmajor and minor releases. Key contributor to policy and \nprocedure design and implementation. Represented several  \ndevelopment teams in cross-organizational roles. Skills Configuration Management Software Lifecycle Release Engineering Perl Agile Methodologies Solaris Continuous Integration Unix Distributed Systems Release Management Linux Hudson CVS Shell Scripting Subversion Test Automation Ant Scalability Bash See 4+     See less Skills  Configuration Management Software Lifecycle Release Engineering Perl Agile Methodologies Solaris Continuous Integration Unix Distributed Systems Release Management Linux Hudson CVS Shell Scripting Subversion Test Automation Ant Scalability Bash See 4+     See less Configuration Management Software Lifecycle Release Engineering Perl Agile Methodologies Solaris Continuous Integration Unix Distributed Systems Release Management Linux Hudson CVS Shell Scripting Subversion Test Automation Ant Scalability Bash See 4+     See less Configuration Management Software Lifecycle Release Engineering Perl Agile Methodologies Solaris Continuous Integration Unix Distributed Systems Release Management Linux Hudson CVS Shell Scripting Subversion Test Automation Ant Scalability Bash See 4+     See less ", "Experience Build/Release Engineer Yahoo November 2006  – Present (8 years 10 months) Sr System Engineer Zultys Technologies July 2002  –  July 2006  (4 years 1 month) Build/Release Engineer Yahoo November 2006  – Present (8 years 10 months) Build/Release Engineer Yahoo November 2006  – Present (8 years 10 months) Sr System Engineer Zultys Technologies July 2002  –  July 2006  (4 years 1 month) Sr System Engineer Zultys Technologies July 2002  –  July 2006  (4 years 1 month) Education Old Dominion University Ph.D.,  Physics Saint Petersburg State University M.S.,  Physics Old Dominion University Ph.D.,  Physics Old Dominion University Ph.D.,  Physics Old Dominion University Ph.D.,  Physics Saint Petersburg State University M.S.,  Physics Saint Petersburg State University M.S.,  Physics Saint Petersburg State University M.S.,  Physics ", "Skills Continuous Integration Jenkins Hudson Maven Ant GNU Make Perl Bourne Shell Git Subversion CVS Perforce ClearCase Release Engineering Open Source Skills  Continuous Integration Jenkins Hudson Maven Ant GNU Make Perl Bourne Shell Git Subversion CVS Perforce ClearCase Release Engineering Open Source Continuous Integration Jenkins Hudson Maven Ant GNU Make Perl Bourne Shell Git Subversion CVS Perforce ClearCase Release Engineering Open Source Continuous Integration Jenkins Hudson Maven Ant GNU Make Perl Bourne Shell Git Subversion CVS Perforce ClearCase Release Engineering Open Source ", "Skills Release Management Perl Unix Quality Assurance Testing Integration Software Documentation Unix Shell Scripting Databases CVS SQL Perforce Microsoft SQL Server JIRA Skills  Release Management Perl Unix Quality Assurance Testing Integration Software Documentation Unix Shell Scripting Databases CVS SQL Perforce Microsoft SQL Server JIRA Release Management Perl Unix Quality Assurance Testing Integration Software Documentation Unix Shell Scripting Databases CVS SQL Perforce Microsoft SQL Server JIRA Release Management Perl Unix Quality Assurance Testing Integration Software Documentation Unix Shell Scripting Databases CVS SQL Perforce Microsoft SQL Server JIRA ", "Experience Release Engineer Yahoo Inc Release Engineer Yahoo Inc Release Engineer Yahoo Inc Education City University of New York City College 1999  – 2001 City University of New York City College 1999  – 2001 City University of New York City College 1999  – 2001 City University of New York City College 1999  – 2001 ", "Experience Principal - Release Engineer Yahoo April 2014  – Present (1 year 5 months) Build and Release Engineer Yahoo! August 2010  – Present (5 years 1 month) Build and Release Engineer Yahoo! India November 2008  –  August 2010  (1 year 10 months) Software Analyst Hewlett-Packard October 2005  –  October 2008  (3 years 1 month) Worked as an Build & Release Lead for HP-UX OS. Senior CM Infineon Technologies India Pvt Ltd 2004  –  2005  (1 year) Senior Design Engineer WiproGE Medical Systems 1999  –  2003  (4 years) system Administartor National Semiconductor 1998  –  1999  (1 year) Bangalore Principal - Release Engineer Yahoo April 2014  – Present (1 year 5 months) Principal - Release Engineer Yahoo April 2014  – Present (1 year 5 months) Build and Release Engineer Yahoo! August 2010  – Present (5 years 1 month) Build and Release Engineer Yahoo! August 2010  – Present (5 years 1 month) Build and Release Engineer Yahoo! India November 2008  –  August 2010  (1 year 10 months) Build and Release Engineer Yahoo! India November 2008  –  August 2010  (1 year 10 months) Software Analyst Hewlett-Packard October 2005  –  October 2008  (3 years 1 month) Worked as an Build & Release Lead for HP-UX OS. Software Analyst Hewlett-Packard October 2005  –  October 2008  (3 years 1 month) Worked as an Build & Release Lead for HP-UX OS. Senior CM Infineon Technologies India Pvt Ltd 2004  –  2005  (1 year) Senior CM Infineon Technologies India Pvt Ltd 2004  –  2005  (1 year) Senior Design Engineer WiproGE Medical Systems 1999  –  2003  (4 years) Senior Design Engineer WiproGE Medical Systems 1999  –  2003  (4 years) system Administartor National Semiconductor 1998  –  1999  (1 year) Bangalore system Administartor National Semiconductor 1998  –  1999  (1 year) Bangalore Skills ClearCase Shell Scripting Perl Unix C Linux HP-UX Software Development Agile Methodologies Jenkins Skills  ClearCase Shell Scripting Perl Unix C Linux HP-UX Software Development Agile Methodologies Jenkins ClearCase Shell Scripting Perl Unix C Linux HP-UX Software Development Agile Methodologies Jenkins ClearCase Shell Scripting Perl Unix C Linux HP-UX Software Development Agile Methodologies Jenkins Education The National Institute of Engineering BE,  Electronics & Communication 1993  – 1997 The National Institute of Engineering BE,  Electronics & Communication 1993  – 1997 The National Institute of Engineering BE,  Electronics & Communication 1993  – 1997 The National Institute of Engineering BE,  Electronics & Communication 1993  – 1997 ", "Experience Release Engineer Yahoo! Search and Marketplaces January 2011  – Present (4 years 8 months) Release Engineer Yahoo! Search Technology October 2007  –  January 2011  (3 years 4 months) Release Engineer Narus, Inc. March 1999  –  October 2007  (8 years 8 months) Release Engineer Yahoo! Search and Marketplaces January 2011  – Present (4 years 8 months) Release Engineer Yahoo! Search and Marketplaces January 2011  – Present (4 years 8 months) Release Engineer Yahoo! Search Technology October 2007  –  January 2011  (3 years 4 months) Release Engineer Yahoo! Search Technology October 2007  –  January 2011  (3 years 4 months) Release Engineer Narus, Inc. March 1999  –  October 2007  (8 years 8 months) Release Engineer Narus, Inc. March 1999  –  October 2007  (8 years 8 months) Skills Skills     ", "Experience Build and Release Engineer Amazon Lab126 November 2014  – Present (10 months) San Francisco Bay Area All fun thing with Embedded Systems .... Principal Engineer -- Build, Release and Infrastructure Pivotal Inc April 2013  –  October 2014  (1 year 7 months) Palo Alto Califonia Responsible for all Build and Release activities for the Pivotal Hadoop Line of Products. Principal Engineer, Build and Release Greenplum August 2011  –  March 2013  (1 year 8 months) San Mateo, Callifornia Senior Build/Release Engineer Yahoo! January 2011  –  August 2011  (8 months) Senior Build/Release Engineer (SCM) for the Advertising Product Group. Incident Manager Wells Fargo Bank November 2009  –  June 2011  (1 year 8 months) Co-ordinate the various Pre production Environment Management teams as well as other technical shared services groups to define and execute against plans and processes for managing environment and infrastructure incidents and unplanned outages which have the potential to impact the timing and success of critical business projects. SCM (Build and Release) Engineer Yahoo! 2011  –  2011  (less than a year) Software Expert Amdocs July 2001  –  October 2009  (8 years 4 months) Build and Release Engineering. Configuration Management for CRM product. SCM Engineer Pretzel Logic Software June 1994  –  January 2001  (6 years 8 months) SCM consultant. Design and Implement Configuration Management Best Practices for Fortune 100 companies. Configuration Management Consultant NE Communications 2000  –  2000  (less than a year) Hardware Engineer Processor System India 1991  –  1994  (3 years) Build and Release Engineer Amazon Lab126 November 2014  – Present (10 months) San Francisco Bay Area All fun thing with Embedded Systems .... Build and Release Engineer Amazon Lab126 November 2014  – Present (10 months) San Francisco Bay Area All fun thing with Embedded Systems .... Principal Engineer -- Build, Release and Infrastructure Pivotal Inc April 2013  –  October 2014  (1 year 7 months) Palo Alto Califonia Responsible for all Build and Release activities for the Pivotal Hadoop Line of Products. Principal Engineer -- Build, Release and Infrastructure Pivotal Inc April 2013  –  October 2014  (1 year 7 months) Palo Alto Califonia Responsible for all Build and Release activities for the Pivotal Hadoop Line of Products. Principal Engineer, Build and Release Greenplum August 2011  –  March 2013  (1 year 8 months) San Mateo, Callifornia Principal Engineer, Build and Release Greenplum August 2011  –  March 2013  (1 year 8 months) San Mateo, Callifornia Senior Build/Release Engineer Yahoo! January 2011  –  August 2011  (8 months) Senior Build/Release Engineer (SCM) for the Advertising Product Group. Senior Build/Release Engineer Yahoo! January 2011  –  August 2011  (8 months) Senior Build/Release Engineer (SCM) for the Advertising Product Group. Incident Manager Wells Fargo Bank November 2009  –  June 2011  (1 year 8 months) Co-ordinate the various Pre production Environment Management teams as well as other technical shared services groups to define and execute against plans and processes for managing environment and infrastructure incidents and unplanned outages which have the potential to impact the timing and success of critical business projects. Incident Manager Wells Fargo Bank November 2009  –  June 2011  (1 year 8 months) Co-ordinate the various Pre production Environment Management teams as well as other technical shared services groups to define and execute against plans and processes for managing environment and infrastructure incidents and unplanned outages which have the potential to impact the timing and success of critical business projects. SCM (Build and Release) Engineer Yahoo! 2011  –  2011  (less than a year) SCM (Build and Release) Engineer Yahoo! 2011  –  2011  (less than a year) Software Expert Amdocs July 2001  –  October 2009  (8 years 4 months) Build and Release Engineering. Configuration Management for CRM product. Software Expert Amdocs July 2001  –  October 2009  (8 years 4 months) Build and Release Engineering. Configuration Management for CRM product. SCM Engineer Pretzel Logic Software June 1994  –  January 2001  (6 years 8 months) SCM consultant. Design and Implement Configuration Management Best Practices for Fortune 100 companies. SCM Engineer Pretzel Logic Software June 1994  –  January 2001  (6 years 8 months) SCM consultant. Design and Implement Configuration Management Best Practices for Fortune 100 companies. Configuration Management Consultant NE Communications 2000  –  2000  (less than a year) Configuration Management Consultant NE Communications 2000  –  2000  (less than a year) Hardware Engineer Processor System India 1991  –  1994  (3 years) Hardware Engineer Processor System India 1991  –  1994  (3 years) Skills Management Change Management Quality Assurance Configuration Management Agile Methodologies CRM Unix Java Process Improvement Integration Perl Release Management Hadoop Weblogic Testing Cloud Computing Software Configuration... Software Development Distributed Systems Enterprise Software See 5+     See less Skills  Management Change Management Quality Assurance Configuration Management Agile Methodologies CRM Unix Java Process Improvement Integration Perl Release Management Hadoop Weblogic Testing Cloud Computing Software Configuration... Software Development Distributed Systems Enterprise Software See 5+     See less Management Change Management Quality Assurance Configuration Management Agile Methodologies CRM Unix Java Process Improvement Integration Perl Release Management Hadoop Weblogic Testing Cloud Computing Software Configuration... Software Development Distributed Systems Enterprise Software See 5+     See less Management Change Management Quality Assurance Configuration Management Agile Methodologies CRM Unix Java Process Improvement Integration Perl Release Management Hadoop Weblogic Testing Cloud Computing Software Configuration... Software Development Distributed Systems Enterprise Software See 5+     See less Education U V C E B E,  Electronics and Telecommunications 1987  – 1991 U V C E B E,  Electronics and Telecommunications 1987  – 1991 U V C E B E,  Electronics and Telecommunications 1987  – 1991 U V C E B E,  Electronics and Telecommunications 1987  – 1991 ", "Experience Release Engineer Yahoo! October 2014  – Present (11 months) Release Engineer Yahoo! October 2014  – Present (11 months) Release Engineer Yahoo! October 2014  – Present (11 months) Languages English Professional working proficiency English Professional working proficiency English Professional working proficiency Professional working proficiency Skills Continuous Integration Continuous Delivery Python Git Release Management Make Shell Scripting Skills  Continuous Integration Continuous Delivery Python Git Release Management Make Shell Scripting Continuous Integration Continuous Delivery Python Git Release Management Make Shell Scripting Continuous Integration Continuous Delivery Python Git Release Management Make Shell Scripting Education Xidian University Master's degree,  Computer Science 2007  – 2010 Xidian University Master's degree,  Computer Science 2007  – 2010 Xidian University Master's degree,  Computer Science 2007  – 2010 Xidian University Master's degree,  Computer Science 2007  – 2010 ", "Summary Specialties: Software Build & Release Engineering, DevOps, and Tools development Summary Specialties: Software Build & Release Engineering, DevOps, and Tools development Specialties: Software Build & Release Engineering, DevOps, and Tools development Specialties: Software Build & Release Engineering, DevOps, and Tools development Languages   Skills Skills     ", "Experience Release Engineer Yahoo.com Release Engineering Netscape 1995  –  1999  (4 years) Release Engineer Yahoo.com Release Engineer Yahoo.com Release Engineering Netscape 1995  –  1999  (4 years) Release Engineering Netscape 1995  –  1999  (4 years) Skills Perl C Agile Methodologies Distributed Systems Product Launch Skills  Perl C Agile Methodologies Distributed Systems Product Launch Perl C Agile Methodologies Distributed Systems Product Launch Perl C Agile Methodologies Distributed Systems Product Launch ", "Summary I am interested positions that would best utilize my build process experience or programming placements with interesting problems to solve. I have an excellent understanding of source control systems and have in particular administrated an IBM Rational ClearCase system. I have good working knowledge of Perl, Linux Scripting Languages, Makefile, C, C++, and Java. \n \nAs to goals, I would like to get into a gaming company, work with emerging medical technology, or create tools for education. Specialties:Build Analysis and Maintenance \nConfiguration Management \nIBM Rational ClearCase Summary I am interested positions that would best utilize my build process experience or programming placements with interesting problems to solve. I have an excellent understanding of source control systems and have in particular administrated an IBM Rational ClearCase system. I have good working knowledge of Perl, Linux Scripting Languages, Makefile, C, C++, and Java. \n \nAs to goals, I would like to get into a gaming company, work with emerging medical technology, or create tools for education. Specialties:Build Analysis and Maintenance \nConfiguration Management \nIBM Rational ClearCase I am interested positions that would best utilize my build process experience or programming placements with interesting problems to solve. I have an excellent understanding of source control systems and have in particular administrated an IBM Rational ClearCase system. I have good working knowledge of Perl, Linux Scripting Languages, Makefile, C, C++, and Java. \n \nAs to goals, I would like to get into a gaming company, work with emerging medical technology, or create tools for education. Specialties:Build Analysis and Maintenance \nConfiguration Management \nIBM Rational ClearCase I am interested positions that would best utilize my build process experience or programming placements with interesting problems to solve. I have an excellent understanding of source control systems and have in particular administrated an IBM Rational ClearCase system. I have good working knowledge of Perl, Linux Scripting Languages, Makefile, C, C++, and Java. \n \nAs to goals, I would like to get into a gaming company, work with emerging medical technology, or create tools for education. Specialties:Build Analysis and Maintenance \nConfiguration Management \nIBM Rational ClearCase Experience Release Engineer Elastica June 2014  – Present (1 year 3 months) San Jose Build and Release Engineer Deutsche Telekom HBS July 2013  –  May 2014  (11 months) Mountain View Build and Release Engineer ChooChee May 2013  –  July 2013  (3 months) Mountain View Release Engineer Yahoo! May 2011  –  March 2013  (1 year 11 months) Santa Clara, CA and Sunnyvale, CA Build/Release Engineer Rockwell Automation March 2010  –  December 2010  (10 months) San Jose, California Build Engineer SS8 Networks September 2006  –  September 2009  (3 years 1 month) Build Engineer, Tools Creation, ClearCase Admin Release Engineer Elastica June 2014  – Present (1 year 3 months) San Jose Release Engineer Elastica June 2014  – Present (1 year 3 months) San Jose Build and Release Engineer Deutsche Telekom HBS July 2013  –  May 2014  (11 months) Mountain View Build and Release Engineer Deutsche Telekom HBS July 2013  –  May 2014  (11 months) Mountain View Build and Release Engineer ChooChee May 2013  –  July 2013  (3 months) Mountain View Build and Release Engineer ChooChee May 2013  –  July 2013  (3 months) Mountain View Release Engineer Yahoo! May 2011  –  March 2013  (1 year 11 months) Santa Clara, CA and Sunnyvale, CA Release Engineer Yahoo! May 2011  –  March 2013  (1 year 11 months) Santa Clara, CA and Sunnyvale, CA Build/Release Engineer Rockwell Automation March 2010  –  December 2010  (10 months) San Jose, California Build/Release Engineer Rockwell Automation March 2010  –  December 2010  (10 months) San Jose, California Build Engineer SS8 Networks September 2006  –  September 2009  (3 years 1 month) Build Engineer, Tools Creation, ClearCase Admin Build Engineer SS8 Networks September 2006  –  September 2009  (3 years 1 month) Build Engineer, Tools Creation, ClearCase Admin Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Perl Linux Jenkins Debian Git Subversion ClearCase Repository Management Github C++ Java TCP/IP Apache Skills  Perl Linux Jenkins Debian Git Subversion ClearCase Repository Management Github C++ Java TCP/IP Apache Perl Linux Jenkins Debian Git Subversion ClearCase Repository Management Github C++ Java TCP/IP Apache Perl Linux Jenkins Debian Git Subversion ClearCase Repository Management Github C++ Java TCP/IP Apache Education Northern Michigan University BS,  Computer Science , Mathematics 2001  – 2006 Activities and Societies:  ACM Programming Contests Marquette Senior High School 1997  – 2001 Northern Michigan University BS,  Computer Science , Mathematics 2001  – 2006 Activities and Societies:  ACM Programming Contests Northern Michigan University BS,  Computer Science , Mathematics 2001  – 2006 Activities and Societies:  ACM Programming Contests Northern Michigan University BS,  Computer Science , Mathematics 2001  – 2006 Activities and Societies:  ACM Programming Contests Marquette Senior High School 1997  – 2001 Marquette Senior High School 1997  – 2001 Marquette Senior High School 1997  – 2001 ", "Summary • Self-motivated, detail-oriented, quick learner, and energetic problem solver. \n• Strong hands-on experience in software builds of Java/C++ products. Excellent troubleshooting skills. \n• Outstanding system test, software installation and configuration experience . Products include Java, media, Sun Thin Client, and telecommunication. \n• Great understanding of product release cycle, QA methodologies and processes. Great test strategy, planning and tasking skills. \n \nSpecialties:  \n• Release Engineering: Hudson, Jenkins, Ant, Maven 2, Make/GNU Make \n• SCM: Git, Mercurial, Subversion \n• Languages: Shell scripts, PERL, JavaFX, Java, C, SQL \n• Operating Systems: MacOS, Linux, Windows \n• Toolkits: Junit, NetBeans IDE, ANT, Apple FinalCut Pro, On2 Flix, Flip4Mac, VMWare Summary • Self-motivated, detail-oriented, quick learner, and energetic problem solver. \n• Strong hands-on experience in software builds of Java/C++ products. Excellent troubleshooting skills. \n• Outstanding system test, software installation and configuration experience . Products include Java, media, Sun Thin Client, and telecommunication. \n• Great understanding of product release cycle, QA methodologies and processes. Great test strategy, planning and tasking skills. \n \nSpecialties:  \n• Release Engineering: Hudson, Jenkins, Ant, Maven 2, Make/GNU Make \n• SCM: Git, Mercurial, Subversion \n• Languages: Shell scripts, PERL, JavaFX, Java, C, SQL \n• Operating Systems: MacOS, Linux, Windows \n• Toolkits: Junit, NetBeans IDE, ANT, Apple FinalCut Pro, On2 Flix, Flip4Mac, VMWare • Self-motivated, detail-oriented, quick learner, and energetic problem solver. \n• Strong hands-on experience in software builds of Java/C++ products. Excellent troubleshooting skills. \n• Outstanding system test, software installation and configuration experience . Products include Java, media, Sun Thin Client, and telecommunication. \n• Great understanding of product release cycle, QA methodologies and processes. Great test strategy, planning and tasking skills. \n \nSpecialties:  \n• Release Engineering: Hudson, Jenkins, Ant, Maven 2, Make/GNU Make \n• SCM: Git, Mercurial, Subversion \n• Languages: Shell scripts, PERL, JavaFX, Java, C, SQL \n• Operating Systems: MacOS, Linux, Windows \n• Toolkits: Junit, NetBeans IDE, ANT, Apple FinalCut Pro, On2 Flix, Flip4Mac, VMWare • Self-motivated, detail-oriented, quick learner, and energetic problem solver. \n• Strong hands-on experience in software builds of Java/C++ products. Excellent troubleshooting skills. \n• Outstanding system test, software installation and configuration experience . Products include Java, media, Sun Thin Client, and telecommunication. \n• Great understanding of product release cycle, QA methodologies and processes. Great test strategy, planning and tasking skills. \n \nSpecialties:  \n• Release Engineering: Hudson, Jenkins, Ant, Maven 2, Make/GNU Make \n• SCM: Git, Mercurial, Subversion \n• Languages: Shell scripts, PERL, JavaFX, Java, C, SQL \n• Operating Systems: MacOS, Linux, Windows \n• Toolkits: Junit, NetBeans IDE, ANT, Apple FinalCut Pro, On2 Flix, Flip4Mac, VMWare Experience Release Engineer Yahoo! September 2011  – Present (4 years) Sunnyvale, CA Release Engineer Yahoo! September 2011  – Present (4 years) Sunnyvale, CA Release Engineer Yahoo! September 2011  – Present (4 years) Sunnyvale, CA Languages   Skills Perl Subversion Shell Scripting Testing Unix Linux JUnit Ant Java SQL Release Engineering Hudson Jenkins Mercurial Maven2 GNU Make Git See 2+     See less Skills  Perl Subversion Shell Scripting Testing Unix Linux JUnit Ant Java SQL Release Engineering Hudson Jenkins Mercurial Maven2 GNU Make Git See 2+     See less Perl Subversion Shell Scripting Testing Unix Linux JUnit Ant Java SQL Release Engineering Hudson Jenkins Mercurial Maven2 GNU Make Git See 2+     See less Perl Subversion Shell Scripting Testing Unix Linux JUnit Ant Java SQL Release Engineering Hudson Jenkins Mercurial Maven2 GNU Make Git See 2+     See less ", "Summary Unix / Linux Infrastructure and Release Engineer Summary Unix / Linux Infrastructure and Release Engineer Unix / Linux Infrastructure and Release Engineer Unix / Linux Infrastructure and Release Engineer Experience Staff Release Engineer Jive Software December 2012  – Present (2 years 9 months) Portland, Oregon Principal Release Engineer Yahoo! December 2007  –  December 2012  (5 years 1 month) Sunnyvale, CA Introduced CI into Yahoo build and release practices. \n \nExpanded role of CI throughout 2 organizations. \n \nParticipated in unifying build and release practices throughout multiple organizations. Senior Release Engineer DreamWorks Animation April 2002  –  November 2006  (4 years 8 months) Redwood City, CA Initially on my own and eventually as a member of a team of 5, unified build and release practices between two disparate studios (PDI and Dreamworks Animation) for providing software to 6 simultaneous productions. Sr. Release Engineer Desana Systems August 2001  –  March 2002  (8 months) Milpitas, CA Release Engineer for a large networking switch. Senior Developer iSyndicate November 1998  –  November 2000  (2 years 1 month) San Francisco, CA Designed and wrote internal infrastructure tools. Sr. Release Engineer Xerox AODS June 1994  –  November 1996  (2 years 6 months) Palo Alto, CA Release Engineer duties for intelligent copiers. \n \nWrote software emulators for internal hardware. Senior Release Engineer Frame Technology September 1989  –  March 1994  (4 years 7 months) San Jose, CA Led the release effort for all of Frame Technology's products. QA Engineer The Santa Cruz Operation June 1985  –  June 1989  (4 years 1 month) Santa Cruz, California Led the QA effort for SCO Unix. QA Engineer Parallel Computers April 1983  –  April 1985  (2 years 1 month) Santa Cruz, California System administration, QA, and Release Engineering. Programmer Online Systems September 1979  –  June 1981  (1 year 10 months) Coarsegold, CA Wrote copy protections and did release engineering for Apple][ games. Staff Release Engineer Jive Software December 2012  – Present (2 years 9 months) Portland, Oregon Staff Release Engineer Jive Software December 2012  – Present (2 years 9 months) Portland, Oregon Principal Release Engineer Yahoo! December 2007  –  December 2012  (5 years 1 month) Sunnyvale, CA Introduced CI into Yahoo build and release practices. \n \nExpanded role of CI throughout 2 organizations. \n \nParticipated in unifying build and release practices throughout multiple organizations. Principal Release Engineer Yahoo! December 2007  –  December 2012  (5 years 1 month) Sunnyvale, CA Introduced CI into Yahoo build and release practices. \n \nExpanded role of CI throughout 2 organizations. \n \nParticipated in unifying build and release practices throughout multiple organizations. Senior Release Engineer DreamWorks Animation April 2002  –  November 2006  (4 years 8 months) Redwood City, CA Initially on my own and eventually as a member of a team of 5, unified build and release practices between two disparate studios (PDI and Dreamworks Animation) for providing software to 6 simultaneous productions. Senior Release Engineer DreamWorks Animation April 2002  –  November 2006  (4 years 8 months) Redwood City, CA Initially on my own and eventually as a member of a team of 5, unified build and release practices between two disparate studios (PDI and Dreamworks Animation) for providing software to 6 simultaneous productions. Sr. Release Engineer Desana Systems August 2001  –  March 2002  (8 months) Milpitas, CA Release Engineer for a large networking switch. Sr. Release Engineer Desana Systems August 2001  –  March 2002  (8 months) Milpitas, CA Release Engineer for a large networking switch. Senior Developer iSyndicate November 1998  –  November 2000  (2 years 1 month) San Francisco, CA Designed and wrote internal infrastructure tools. Senior Developer iSyndicate November 1998  –  November 2000  (2 years 1 month) San Francisco, CA Designed and wrote internal infrastructure tools. Sr. Release Engineer Xerox AODS June 1994  –  November 1996  (2 years 6 months) Palo Alto, CA Release Engineer duties for intelligent copiers. \n \nWrote software emulators for internal hardware. Sr. Release Engineer Xerox AODS June 1994  –  November 1996  (2 years 6 months) Palo Alto, CA Release Engineer duties for intelligent copiers. \n \nWrote software emulators for internal hardware. Senior Release Engineer Frame Technology September 1989  –  March 1994  (4 years 7 months) San Jose, CA Led the release effort for all of Frame Technology's products. Senior Release Engineer Frame Technology September 1989  –  March 1994  (4 years 7 months) San Jose, CA Led the release effort for all of Frame Technology's products. QA Engineer The Santa Cruz Operation June 1985  –  June 1989  (4 years 1 month) Santa Cruz, California Led the QA effort for SCO Unix. QA Engineer The Santa Cruz Operation June 1985  –  June 1989  (4 years 1 month) Santa Cruz, California Led the QA effort for SCO Unix. QA Engineer Parallel Computers April 1983  –  April 1985  (2 years 1 month) Santa Cruz, California System administration, QA, and Release Engineering. QA Engineer Parallel Computers April 1983  –  April 1985  (2 years 1 month) Santa Cruz, California System administration, QA, and Release Engineering. Programmer Online Systems September 1979  –  June 1981  (1 year 10 months) Coarsegold, CA Wrote copy protections and did release engineering for Apple][ games. Programmer Online Systems September 1979  –  June 1981  (1 year 10 months) Coarsegold, CA Wrote copy protections and did release engineering for Apple][ games. Skills Release Engineering Linux Continuous Integration jenkins Perl Maven2 Subversion make XML SQL PHP MySQL Perforce CVS Bash RPM Ant C Python Unix Shell Scripting Jenkins Unix Shell Scripting See 8+     See less Skills  Release Engineering Linux Continuous Integration jenkins Perl Maven2 Subversion make XML SQL PHP MySQL Perforce CVS Bash RPM Ant C Python Unix Shell Scripting Jenkins Unix Shell Scripting See 8+     See less Release Engineering Linux Continuous Integration jenkins Perl Maven2 Subversion make XML SQL PHP MySQL Perforce CVS Bash RPM Ant C Python Unix Shell Scripting Jenkins Unix Shell Scripting See 8+     See less Release Engineering Linux Continuous Integration jenkins Perl Maven2 Subversion make XML SQL PHP MySQL Perforce CVS Bash RPM Ant C Python Unix Shell Scripting Jenkins Unix Shell Scripting See 8+     See less ", "Skills Perl Python Jenkins Artifactory Puppet GNU Make Maven Ant Subversion Academic exposure to C... Skills  Perl Python Jenkins Artifactory Puppet GNU Make Maven Ant Subversion Academic exposure to C... Perl Python Jenkins Artifactory Puppet GNU Make Maven Ant Subversion Academic exposure to C... Perl Python Jenkins Artifactory Puppet GNU Make Maven Ant Subversion Academic exposure to C... ", "Summary Career \n- Eight years in software development as SCM, Build, Release Engineering, CI/CD Architect at Yahoo Inc. \n- Nine years in manufacturing (MFG) of high-speed routers and peripherals as MFG Test Automation Engineer at Juniper Networks.  \n- Over two years in router software development as QA, Build, Release Engineer at Fore Systems. \n- Combined nine years in the medical field as Biotech Medical Engineer and Technician at InnerDyne Inc. and Target Therapeutics respectively. \n \nQualifications \n- Able to define, implement, and oversee end-to-end build and release process with CI/CD pipelines for wide-ranging projects with complex requirements. Able to set up and manage modern CI/CD tools and services with service level agreements (SLAs). \n- Seasoned contributor in charge as resident Release Engineer and Automation Specialist for large business units. At Yahoo: Sponsored Search, Ads & Data CD, User Profiling & Platforms; Juniper Networks: Manufacturing & Operations. \n- Adept at solving problems, developing standard solutions, strategies, workflows, conventions, and configurations. Especially adept and passionate with automation using Perl, Ruby, Shells and Linux commands. \n- Avid practitioner and facilitator of practical concepts: Domain Driven Design (DDD), Agile, DevOps, Frameworks, Templates, OOD, Structured Analysis, Data Driven, DocScripts. \n- Ability to perform research, create experiments, and prototype solutions with structured analysis for thought leadership and decision-making on corporate mandates and CI/CD subject matters. \n- Hands-on experience with multitude of software development environments, tools, and technologies: Jenkins (Hudson), Git, Github, Gerrit, Subversion (SVN), CVS, Perl, Ruby, Chef, Make, Maven, Ant, YINST, Dist, RolesDB, RPM, Redhat, Ubuntu, FreeBSD, Windows, Mac, Jira, Jive, Bugzilla, MySQL, Apache, Drupal, RoR, HTML, YAML, JSON, Wiki, Google Docs, MS Office. Summary Career \n- Eight years in software development as SCM, Build, Release Engineering, CI/CD Architect at Yahoo Inc. \n- Nine years in manufacturing (MFG) of high-speed routers and peripherals as MFG Test Automation Engineer at Juniper Networks.  \n- Over two years in router software development as QA, Build, Release Engineer at Fore Systems. \n- Combined nine years in the medical field as Biotech Medical Engineer and Technician at InnerDyne Inc. and Target Therapeutics respectively. \n \nQualifications \n- Able to define, implement, and oversee end-to-end build and release process with CI/CD pipelines for wide-ranging projects with complex requirements. Able to set up and manage modern CI/CD tools and services with service level agreements (SLAs). \n- Seasoned contributor in charge as resident Release Engineer and Automation Specialist for large business units. At Yahoo: Sponsored Search, Ads & Data CD, User Profiling & Platforms; Juniper Networks: Manufacturing & Operations. \n- Adept at solving problems, developing standard solutions, strategies, workflows, conventions, and configurations. Especially adept and passionate with automation using Perl, Ruby, Shells and Linux commands. \n- Avid practitioner and facilitator of practical concepts: Domain Driven Design (DDD), Agile, DevOps, Frameworks, Templates, OOD, Structured Analysis, Data Driven, DocScripts. \n- Ability to perform research, create experiments, and prototype solutions with structured analysis for thought leadership and decision-making on corporate mandates and CI/CD subject matters. \n- Hands-on experience with multitude of software development environments, tools, and technologies: Jenkins (Hudson), Git, Github, Gerrit, Subversion (SVN), CVS, Perl, Ruby, Chef, Make, Maven, Ant, YINST, Dist, RolesDB, RPM, Redhat, Ubuntu, FreeBSD, Windows, Mac, Jira, Jive, Bugzilla, MySQL, Apache, Drupal, RoR, HTML, YAML, JSON, Wiki, Google Docs, MS Office. Career \n- Eight years in software development as SCM, Build, Release Engineering, CI/CD Architect at Yahoo Inc. \n- Nine years in manufacturing (MFG) of high-speed routers and peripherals as MFG Test Automation Engineer at Juniper Networks.  \n- Over two years in router software development as QA, Build, Release Engineer at Fore Systems. \n- Combined nine years in the medical field as Biotech Medical Engineer and Technician at InnerDyne Inc. and Target Therapeutics respectively. \n \nQualifications \n- Able to define, implement, and oversee end-to-end build and release process with CI/CD pipelines for wide-ranging projects with complex requirements. Able to set up and manage modern CI/CD tools and services with service level agreements (SLAs). \n- Seasoned contributor in charge as resident Release Engineer and Automation Specialist for large business units. At Yahoo: Sponsored Search, Ads & Data CD, User Profiling & Platforms; Juniper Networks: Manufacturing & Operations. \n- Adept at solving problems, developing standard solutions, strategies, workflows, conventions, and configurations. Especially adept and passionate with automation using Perl, Ruby, Shells and Linux commands. \n- Avid practitioner and facilitator of practical concepts: Domain Driven Design (DDD), Agile, DevOps, Frameworks, Templates, OOD, Structured Analysis, Data Driven, DocScripts. \n- Ability to perform research, create experiments, and prototype solutions with structured analysis for thought leadership and decision-making on corporate mandates and CI/CD subject matters. \n- Hands-on experience with multitude of software development environments, tools, and technologies: Jenkins (Hudson), Git, Github, Gerrit, Subversion (SVN), CVS, Perl, Ruby, Chef, Make, Maven, Ant, YINST, Dist, RolesDB, RPM, Redhat, Ubuntu, FreeBSD, Windows, Mac, Jira, Jive, Bugzilla, MySQL, Apache, Drupal, RoR, HTML, YAML, JSON, Wiki, Google Docs, MS Office. Career \n- Eight years in software development as SCM, Build, Release Engineering, CI/CD Architect at Yahoo Inc. \n- Nine years in manufacturing (MFG) of high-speed routers and peripherals as MFG Test Automation Engineer at Juniper Networks.  \n- Over two years in router software development as QA, Build, Release Engineer at Fore Systems. \n- Combined nine years in the medical field as Biotech Medical Engineer and Technician at InnerDyne Inc. and Target Therapeutics respectively. \n \nQualifications \n- Able to define, implement, and oversee end-to-end build and release process with CI/CD pipelines for wide-ranging projects with complex requirements. Able to set up and manage modern CI/CD tools and services with service level agreements (SLAs). \n- Seasoned contributor in charge as resident Release Engineer and Automation Specialist for large business units. At Yahoo: Sponsored Search, Ads & Data CD, User Profiling & Platforms; Juniper Networks: Manufacturing & Operations. \n- Adept at solving problems, developing standard solutions, strategies, workflows, conventions, and configurations. Especially adept and passionate with automation using Perl, Ruby, Shells and Linux commands. \n- Avid practitioner and facilitator of practical concepts: Domain Driven Design (DDD), Agile, DevOps, Frameworks, Templates, OOD, Structured Analysis, Data Driven, DocScripts. \n- Ability to perform research, create experiments, and prototype solutions with structured analysis for thought leadership and decision-making on corporate mandates and CI/CD subject matters. \n- Hands-on experience with multitude of software development environments, tools, and technologies: Jenkins (Hudson), Git, Github, Gerrit, Subversion (SVN), CVS, Perl, Ruby, Chef, Make, Maven, Ant, YINST, Dist, RolesDB, RPM, Redhat, Ubuntu, FreeBSD, Windows, Mac, Jira, Jive, Bugzilla, MySQL, Apache, Drupal, RoR, HTML, YAML, JSON, Wiki, Google Docs, MS Office. Experience SCM, Build, Release Engineer, CI/CD Architect Yahoo Inc. March 2007  – Present (8 years 6 months) Burbank, California - Devised build and release strategies, documented guidelines, best practices, and created project templates for wide ranging software products with different workflows. \n- Automated manual intensive tasks for identified patterns, project specific requirements, and gaps in the technology stack as provided by Central Tools organization.  \n- Automated self-service deployment process for Sponsored Search and Domain Match organizations including production deployments dealing with thousands of servers. \n- Managed robust Jenkins build farm with tens of thousands of builds when Advertising and Data RE team members were a combined service organization. Performed routine maintenance and upgrades. Developed gap-filling monitoring and auto-cleanup process that run as scheduled on Jenkins master and slave servers for early problem detection and keeping build farm running optimally. \n- Promoted knowledge sharing across the organization via RE services with open-office hours, daily support, documentations, training sessions, and newsletters. \n- Proactively updated the organization with advances in technologies, processes, and company wide mandates. Anticipated the impact, and along with engineering teams, developed and executed plans for mandatory changes. \n- Day-to-day hands on support for engineering teams covering many software development disciplines: project planning and task execution, tool and system changes, process changes, setting up CI/CD pipelines, troubleshooting broad range of issues from build to release. \n- Developed simple collaborative automation framework (aka DocScripts) with Service Engineering (SE) partners. From this collaboration, useful automated tasks (scripts) were produced in the form of Jenkins utility jobs for one-click automation. \n \nProjects: User Profiling and Platforms (Grid/Hadoop/Hive based), Advertising and Data CD (development tools, systems, services), Sponsored Search (Java, C++), Domain Match. Senior MFG Test Automation Engineer Juniper Networks September 1998  –  March 2007  (8 years 7 months) Sunnyvale, CA - Architected and developed Manufacturing (MFG) Test Framework in Perl that featured object-oriented, data-driven, error codes, database, logging, and statistics. Led growing MFG Software Test Development team through three generations of re-architecting for scalability, manageability, and support of new product lines. \n- Developed robust complex functional, system , and burn-in tests for high-speed routers and peripherals. Provided high coverage - particularly during quarter’s end 24/7 - training, execution, and debugging support of MFG tests running in hardware (HW) lab and production facilities of original equipment manufacturers (OEMs), Solectron and Flextronics. \n- Validated newly designed HW router product lines and components with available MFG tests. Developed new test suites and extended test coverage for new HW and configurations. \n- Automated end-to-end build, test, release, and deployment process for MFG tests. Iteratively improved the process for high performance and reliability as the company grew out of start-up mode. \n- Implemented early software development infrastructure and processes for MFG organization including source control (CVS), flat-file database, server setup and monitoring. Performed hand off tasks and transitioned support to a more matured IT department with database migration to Oracle. \n \nProjects: T-series and M-series high speed routers and peripherals including NICs, PICs, Chassis, Power Supplies. QA, Build, Release Engineer Fore Systems January 1996  –  August 1998  (2 years 8 months) San Jose, CA - Managed the build and release process of Powerhub software. Performed hands on tasks throughout the process including on demand builds and packaging of candidate releases for Development, QA, and Production use. \n- Set up complex network topologies with test-beds. Performed functional and system testing of routers and peripherals. \n- Performed process escalation tasks from discovery to final resolution of software bugs. \n \nProjects: Powerhub family of routers and peripherals. Biotech Medical Engineer InnerDyne Inc. November 1993  –  September 1995  (1 year 11 months) Sunnyvale, CA * Designed laparoscopic products and parts; developed and tested prototypes in labs. \n* Performed in vivo testing of product prototypes and samples at medical facilities. \n* Performed legal experiments; recorded test data; compiled legal records for patents and FDA filings. \n* Engaged with doctors and patients to ensure quality and performance of products. \n \nProjects: STEP Trocar and Cannula family of products and parts. Senior Biotech Medical Technician Target Therapeutics July 1988  –  October 1993  (5 years 4 months) Fremont, CA - Assisted lead engineers with project designs, tasks and functions. \n- Built medical device prototypes in labs and cleanrooms. \n- Performed tests on product samples for quality and conformance of lamination, pressurization, dimension, tensile strength, coating, viscosity, friction, shipping, and shelf-life (aging). \n- Generated CAD drawings; produced medical fixtures and prototypes with machine shop equipment [extrusions, mills, lathes, sanders]. \n- Researched the characteristics of plastics, polymers, gases, and metals; applied their effects into manufacturing processes to achieve desired product designs and specifications. \n \nProjects: Catheters, Guidewires, Embolic Coils. SCM, Build, Release Engineer, CI/CD Architect Yahoo Inc. March 2007  – Present (8 years 6 months) Burbank, California - Devised build and release strategies, documented guidelines, best practices, and created project templates for wide ranging software products with different workflows. \n- Automated manual intensive tasks for identified patterns, project specific requirements, and gaps in the technology stack as provided by Central Tools organization.  \n- Automated self-service deployment process for Sponsored Search and Domain Match organizations including production deployments dealing with thousands of servers. \n- Managed robust Jenkins build farm with tens of thousands of builds when Advertising and Data RE team members were a combined service organization. Performed routine maintenance and upgrades. Developed gap-filling monitoring and auto-cleanup process that run as scheduled on Jenkins master and slave servers for early problem detection and keeping build farm running optimally. \n- Promoted knowledge sharing across the organization via RE services with open-office hours, daily support, documentations, training sessions, and newsletters. \n- Proactively updated the organization with advances in technologies, processes, and company wide mandates. Anticipated the impact, and along with engineering teams, developed and executed plans for mandatory changes. \n- Day-to-day hands on support for engineering teams covering many software development disciplines: project planning and task execution, tool and system changes, process changes, setting up CI/CD pipelines, troubleshooting broad range of issues from build to release. \n- Developed simple collaborative automation framework (aka DocScripts) with Service Engineering (SE) partners. From this collaboration, useful automated tasks (scripts) were produced in the form of Jenkins utility jobs for one-click automation. \n \nProjects: User Profiling and Platforms (Grid/Hadoop/Hive based), Advertising and Data CD (development tools, systems, services), Sponsored Search (Java, C++), Domain Match. SCM, Build, Release Engineer, CI/CD Architect Yahoo Inc. March 2007  – Present (8 years 6 months) Burbank, California - Devised build and release strategies, documented guidelines, best practices, and created project templates for wide ranging software products with different workflows. \n- Automated manual intensive tasks for identified patterns, project specific requirements, and gaps in the technology stack as provided by Central Tools organization.  \n- Automated self-service deployment process for Sponsored Search and Domain Match organizations including production deployments dealing with thousands of servers. \n- Managed robust Jenkins build farm with tens of thousands of builds when Advertising and Data RE team members were a combined service organization. Performed routine maintenance and upgrades. Developed gap-filling monitoring and auto-cleanup process that run as scheduled on Jenkins master and slave servers for early problem detection and keeping build farm running optimally. \n- Promoted knowledge sharing across the organization via RE services with open-office hours, daily support, documentations, training sessions, and newsletters. \n- Proactively updated the organization with advances in technologies, processes, and company wide mandates. Anticipated the impact, and along with engineering teams, developed and executed plans for mandatory changes. \n- Day-to-day hands on support for engineering teams covering many software development disciplines: project planning and task execution, tool and system changes, process changes, setting up CI/CD pipelines, troubleshooting broad range of issues from build to release. \n- Developed simple collaborative automation framework (aka DocScripts) with Service Engineering (SE) partners. From this collaboration, useful automated tasks (scripts) were produced in the form of Jenkins utility jobs for one-click automation. \n \nProjects: User Profiling and Platforms (Grid/Hadoop/Hive based), Advertising and Data CD (development tools, systems, services), Sponsored Search (Java, C++), Domain Match. Senior MFG Test Automation Engineer Juniper Networks September 1998  –  March 2007  (8 years 7 months) Sunnyvale, CA - Architected and developed Manufacturing (MFG) Test Framework in Perl that featured object-oriented, data-driven, error codes, database, logging, and statistics. Led growing MFG Software Test Development team through three generations of re-architecting for scalability, manageability, and support of new product lines. \n- Developed robust complex functional, system , and burn-in tests for high-speed routers and peripherals. Provided high coverage - particularly during quarter’s end 24/7 - training, execution, and debugging support of MFG tests running in hardware (HW) lab and production facilities of original equipment manufacturers (OEMs), Solectron and Flextronics. \n- Validated newly designed HW router product lines and components with available MFG tests. Developed new test suites and extended test coverage for new HW and configurations. \n- Automated end-to-end build, test, release, and deployment process for MFG tests. Iteratively improved the process for high performance and reliability as the company grew out of start-up mode. \n- Implemented early software development infrastructure and processes for MFG organization including source control (CVS), flat-file database, server setup and monitoring. Performed hand off tasks and transitioned support to a more matured IT department with database migration to Oracle. \n \nProjects: T-series and M-series high speed routers and peripherals including NICs, PICs, Chassis, Power Supplies. Senior MFG Test Automation Engineer Juniper Networks September 1998  –  March 2007  (8 years 7 months) Sunnyvale, CA - Architected and developed Manufacturing (MFG) Test Framework in Perl that featured object-oriented, data-driven, error codes, database, logging, and statistics. Led growing MFG Software Test Development team through three generations of re-architecting for scalability, manageability, and support of new product lines. \n- Developed robust complex functional, system , and burn-in tests for high-speed routers and peripherals. Provided high coverage - particularly during quarter’s end 24/7 - training, execution, and debugging support of MFG tests running in hardware (HW) lab and production facilities of original equipment manufacturers (OEMs), Solectron and Flextronics. \n- Validated newly designed HW router product lines and components with available MFG tests. Developed new test suites and extended test coverage for new HW and configurations. \n- Automated end-to-end build, test, release, and deployment process for MFG tests. Iteratively improved the process for high performance and reliability as the company grew out of start-up mode. \n- Implemented early software development infrastructure and processes for MFG organization including source control (CVS), flat-file database, server setup and monitoring. Performed hand off tasks and transitioned support to a more matured IT department with database migration to Oracle. \n \nProjects: T-series and M-series high speed routers and peripherals including NICs, PICs, Chassis, Power Supplies. QA, Build, Release Engineer Fore Systems January 1996  –  August 1998  (2 years 8 months) San Jose, CA - Managed the build and release process of Powerhub software. Performed hands on tasks throughout the process including on demand builds and packaging of candidate releases for Development, QA, and Production use. \n- Set up complex network topologies with test-beds. Performed functional and system testing of routers and peripherals. \n- Performed process escalation tasks from discovery to final resolution of software bugs. \n \nProjects: Powerhub family of routers and peripherals. QA, Build, Release Engineer Fore Systems January 1996  –  August 1998  (2 years 8 months) San Jose, CA - Managed the build and release process of Powerhub software. Performed hands on tasks throughout the process including on demand builds and packaging of candidate releases for Development, QA, and Production use. \n- Set up complex network topologies with test-beds. Performed functional and system testing of routers and peripherals. \n- Performed process escalation tasks from discovery to final resolution of software bugs. \n \nProjects: Powerhub family of routers and peripherals. Biotech Medical Engineer InnerDyne Inc. November 1993  –  September 1995  (1 year 11 months) Sunnyvale, CA * Designed laparoscopic products and parts; developed and tested prototypes in labs. \n* Performed in vivo testing of product prototypes and samples at medical facilities. \n* Performed legal experiments; recorded test data; compiled legal records for patents and FDA filings. \n* Engaged with doctors and patients to ensure quality and performance of products. \n \nProjects: STEP Trocar and Cannula family of products and parts. Biotech Medical Engineer InnerDyne Inc. November 1993  –  September 1995  (1 year 11 months) Sunnyvale, CA * Designed laparoscopic products and parts; developed and tested prototypes in labs. \n* Performed in vivo testing of product prototypes and samples at medical facilities. \n* Performed legal experiments; recorded test data; compiled legal records for patents and FDA filings. \n* Engaged with doctors and patients to ensure quality and performance of products. \n \nProjects: STEP Trocar and Cannula family of products and parts. Senior Biotech Medical Technician Target Therapeutics July 1988  –  October 1993  (5 years 4 months) Fremont, CA - Assisted lead engineers with project designs, tasks and functions. \n- Built medical device prototypes in labs and cleanrooms. \n- Performed tests on product samples for quality and conformance of lamination, pressurization, dimension, tensile strength, coating, viscosity, friction, shipping, and shelf-life (aging). \n- Generated CAD drawings; produced medical fixtures and prototypes with machine shop equipment [extrusions, mills, lathes, sanders]. \n- Researched the characteristics of plastics, polymers, gases, and metals; applied their effects into manufacturing processes to achieve desired product designs and specifications. \n \nProjects: Catheters, Guidewires, Embolic Coils. Senior Biotech Medical Technician Target Therapeutics July 1988  –  October 1993  (5 years 4 months) Fremont, CA - Assisted lead engineers with project designs, tasks and functions. \n- Built medical device prototypes in labs and cleanrooms. \n- Performed tests on product samples for quality and conformance of lamination, pressurization, dimension, tensile strength, coating, viscosity, friction, shipping, and shelf-life (aging). \n- Generated CAD drawings; produced medical fixtures and prototypes with machine shop equipment [extrusions, mills, lathes, sanders]. \n- Researched the characteristics of plastics, polymers, gases, and metals; applied their effects into manufacturing processes to achieve desired product designs and specifications. \n \nProjects: Catheters, Guidewires, Embolic Coils. Skills Hudson Bugzilla Software Configuration... Continuous Integration Perl CVS Shell Scripting Bash Release Management Apache Subversion Red Hat Linux Linux MySQL Unix GIT GNU Make Maven2 Java TWiki Jenkins Ruby on Rails Ruby PHP C++ See 10+     See less Skills  Hudson Bugzilla Software Configuration... Continuous Integration Perl CVS Shell Scripting Bash Release Management Apache Subversion Red Hat Linux Linux MySQL Unix GIT GNU Make Maven2 Java TWiki Jenkins Ruby on Rails Ruby PHP C++ See 10+     See less Hudson Bugzilla Software Configuration... Continuous Integration Perl CVS Shell Scripting Bash Release Management Apache Subversion Red Hat Linux Linux MySQL Unix GIT GNU Make Maven2 Java TWiki Jenkins Ruby on Rails Ruby PHP C++ See 10+     See less Hudson Bugzilla Software Configuration... Continuous Integration Perl CVS Shell Scripting Bash Release Management Apache Subversion Red Hat Linux Linux MySQL Unix GIT GNU Make Maven2 Java TWiki Jenkins Ruby on Rails Ruby PHP C++ See 10+     See less Education San Jose State University Bachelor of Science (BS),  Computer Science (CS) 1990  – 1996 San Jose State University Bachelor of Science (BS),  Computer Science (CS) 1990  – 1996 San Jose State University Bachelor of Science (BS),  Computer Science (CS) 1990  – 1996 San Jose State University Bachelor of Science (BS),  Computer Science (CS) 1990  – 1996 ", "Summary • Over 7 years experience as Build and Release Engineer \n• Proven track record of developing and maintaining of automated build releases in a large scale distributed environment \n• Application development experience \n• My experience and skills' set allow me to understand quickly new technologies required by projects. I am methodical, analytical, self-motivated with strong organizational skills and rank a team player attitude.higher than anything. Specialties:• Languages: C, JAVA, PHP, Perl, Javascript, SQL, XML, XSLT, HTML \n• Operating platforms: DOS, Windows, UNIX \n• Internet technologies: TCP/IP, UDP, HTTP protocols \n• System Environment: shell scripts and batch files, make files, ANT. \n• Continuous Integration, Hudson \n• Source Control Management Software: VSS, CVS, SVN. Extensive experience with source management systems and Bug Track system Summary • Over 7 years experience as Build and Release Engineer \n• Proven track record of developing and maintaining of automated build releases in a large scale distributed environment \n• Application development experience \n• My experience and skills' set allow me to understand quickly new technologies required by projects. I am methodical, analytical, self-motivated with strong organizational skills and rank a team player attitude.higher than anything. Specialties:• Languages: C, JAVA, PHP, Perl, Javascript, SQL, XML, XSLT, HTML \n• Operating platforms: DOS, Windows, UNIX \n• Internet technologies: TCP/IP, UDP, HTTP protocols \n• System Environment: shell scripts and batch files, make files, ANT. \n• Continuous Integration, Hudson \n• Source Control Management Software: VSS, CVS, SVN. Extensive experience with source management systems and Bug Track system • Over 7 years experience as Build and Release Engineer \n• Proven track record of developing and maintaining of automated build releases in a large scale distributed environment \n• Application development experience \n• My experience and skills' set allow me to understand quickly new technologies required by projects. I am methodical, analytical, self-motivated with strong organizational skills and rank a team player attitude.higher than anything. Specialties:• Languages: C, JAVA, PHP, Perl, Javascript, SQL, XML, XSLT, HTML \n• Operating platforms: DOS, Windows, UNIX \n• Internet technologies: TCP/IP, UDP, HTTP protocols \n• System Environment: shell scripts and batch files, make files, ANT. \n• Continuous Integration, Hudson \n• Source Control Management Software: VSS, CVS, SVN. Extensive experience with source management systems and Bug Track system • Over 7 years experience as Build and Release Engineer \n• Proven track record of developing and maintaining of automated build releases in a large scale distributed environment \n• Application development experience \n• My experience and skills' set allow me to understand quickly new technologies required by projects. I am methodical, analytical, self-motivated with strong organizational skills and rank a team player attitude.higher than anything. Specialties:• Languages: C, JAVA, PHP, Perl, Javascript, SQL, XML, XSLT, HTML \n• Operating platforms: DOS, Windows, UNIX \n• Internet technologies: TCP/IP, UDP, HTTP protocols \n• System Environment: shell scripts and batch files, make files, ANT. \n• Continuous Integration, Hudson \n• Source Control Management Software: VSS, CVS, SVN. Extensive experience with source management systems and Bug Track system Experience Sr. Release Engineer Yahoo! January 2010  – Present (5 years 8 months) Content Engineering Senior Release Engineer / Product Manager Creative Science Systems April 2003  –  June 2009  (6 years 3 months) Windows, Linux RedHat (2.6.9-5.ELsmp), Linux SuSE (2.4.19-64GB-SMP), FreeBSD (7.0), Solaris i386 (5.9), Solaris sparc (5.9), MacOS X (Darwin), WinCE (Pocket PC), Palm OS (Garnet), .Net 2003 \nJava, C; Python; SQL, XML; Windows nmake, GNU Makefile, ant, batch; script languages (bash, csh);  \nVSS, CVS, SVN; Bugzilla; eclipse IDE \n \nHigh level responsibility for the s/w release process and production. \n \n• Designed build infrastructure, developed and maintained the completely automated build process for all company projects and products. It included API build using all supported platforms, image creation for the separation of components for various products, build of installations and CD images of products. Handled new projects and maintained a high level of quality and automation.  \n• Created automated logging and reporting system of build process, developed Java applications to parse build reports. \n• Developed installers for all products using InstallShield, Nullsoft, Java \n• Developed and maintained API of tests and products examples, automated build and execution of tests and samples. \n• Developed and maintained documentation. Automated javadoc and cdoc generation, User Guides, examples, auto-run CDs HTML presentation, ReadMe files. \n• Developed license applications, automated generation and build-process of licenses for all products. \n• Maintained porting of “C” source code from Windows OS to the supported platforms. \n• Administered Bugzilla, CVS, SVN, branching of releases and backup \n• Build of all required SW and tools for the supported platforms, i.e. JDKs on UNIX boxes, OpenSSL and so on. \n• Managed and controlled QA group. Created test framework to automate tests process. \n• Managed the life cycle of all products from the design phase to the marketing. Coordinated the departments of R&D, quality control, production and marketing, followed targeted tasks from the creativity and technical sectors to the management of releases. Senior SW Engineer Siftology, Inc September 2002  –  January 2003  (5 months) Linux RH, Windows 2000; JAVA, PHP, JavaScript, Perl; XML-RPC, XSLT, HTML; mySQL; VisualAge \n \n• Smart Writer - the real time server applications (PHP, JavaScript, XML-RPC, SQL) to deliver related data to the users.  \n• XML-RPC interface (Java) between Java Client Applications and servers (Perl, SQL). \n• Java client-server applications for using archived content in workflow and research. Senior SW Engineer Creative Science Systems July 2000  –  July 2002  (2 years 1 month) UNIX, Windows NT; JAVA; C; XML, XSLT, HTML; TCP/IP, UDP; JUNIT \n \n• Data acquisition subsystem (C language), to collect primary stock market information for on-line web-based stock trading system.  \n• Re-broadcaster subsystem (Java) and set of Data Processors (Java, xslt, xml) to perform transformations of the data packages and transmission them to the recipients. \n• Test communicators (Java, xml) for messaging systems (TCP/IP, UDP). Software (Java applications, batch, make, shell scripts, data emulation) for the integration test of the project. \n• Simple types (Java) of XML Schema to Java compiler. Senior SW Engineer, contractor Pacific Tech, Co. (ADDR.com, Inc.) October 1999  –  July 2000  (10 months) Linux RH, Windows NT; Apache; C, PERL; HTML; HTTP \n \n• Web systems for registrations, invoicing and billing: Reseller and Affiliate systems. \n• Administration systems: Time Sheet Management System, Password Protection System. \n• Tools: File Manager. \n• Services: Image Scanning System. \n• Customer support systems. Software developer 3Cube, Inc. April 1999  –  October 1999  (7 months) Windows NT, IIS; Linux, Apache; MS SQL Server; ASP, PERL, PHP, Javascript, HTML; HTTP \n \n• Company’s dynamic web page design and development, including PHP code to load information to and from Microsoft SQL database. \n• Internet communication software (ASP) for 3Cube customer support service with HTML to SQL and SQL to HTML transformations. Senior Research Associate St. Petersburg State University, Russia January 1990  –  June 1998  (8 years 6 months) Windows 3.x/95, MS-DOS, DR-DOS; FORTRAN \n \n• Various software packages for solving research problems in the area of large dynamic systems such as machinery assemblies, lines, ecological systems. \n• Design and implementation of proprietary direct access database. Programmer St. Petersburg Research Institute, Russia 1982  –  1989  (7 years) PDP-11, IBM; FORTRAN, ASSEMBLER \n \n• Designed and implemented various software tools for porting source codes between operating systems VAX, IBM 370, PDP-11 and HP, etc. \n• Designed and implemented various data control program for I/O control unit. \n• Designed and implemented algorithms for solving the systems of none-linear differential equations with peace wise constant coefficients. Sr. Release Engineer Yahoo! January 2010  – Present (5 years 8 months) Content Engineering Sr. Release Engineer Yahoo! January 2010  – Present (5 years 8 months) Content Engineering Senior Release Engineer / Product Manager Creative Science Systems April 2003  –  June 2009  (6 years 3 months) Windows, Linux RedHat (2.6.9-5.ELsmp), Linux SuSE (2.4.19-64GB-SMP), FreeBSD (7.0), Solaris i386 (5.9), Solaris sparc (5.9), MacOS X (Darwin), WinCE (Pocket PC), Palm OS (Garnet), .Net 2003 \nJava, C; Python; SQL, XML; Windows nmake, GNU Makefile, ant, batch; script languages (bash, csh);  \nVSS, CVS, SVN; Bugzilla; eclipse IDE \n \nHigh level responsibility for the s/w release process and production. \n \n• Designed build infrastructure, developed and maintained the completely automated build process for all company projects and products. It included API build using all supported platforms, image creation for the separation of components for various products, build of installations and CD images of products. Handled new projects and maintained a high level of quality and automation.  \n• Created automated logging and reporting system of build process, developed Java applications to parse build reports. \n• Developed installers for all products using InstallShield, Nullsoft, Java \n• Developed and maintained API of tests and products examples, automated build and execution of tests and samples. \n• Developed and maintained documentation. Automated javadoc and cdoc generation, User Guides, examples, auto-run CDs HTML presentation, ReadMe files. \n• Developed license applications, automated generation and build-process of licenses for all products. \n• Maintained porting of “C” source code from Windows OS to the supported platforms. \n• Administered Bugzilla, CVS, SVN, branching of releases and backup \n• Build of all required SW and tools for the supported platforms, i.e. JDKs on UNIX boxes, OpenSSL and so on. \n• Managed and controlled QA group. Created test framework to automate tests process. \n• Managed the life cycle of all products from the design phase to the marketing. Coordinated the departments of R&D, quality control, production and marketing, followed targeted tasks from the creativity and technical sectors to the management of releases. Senior Release Engineer / Product Manager Creative Science Systems April 2003  –  June 2009  (6 years 3 months) Windows, Linux RedHat (2.6.9-5.ELsmp), Linux SuSE (2.4.19-64GB-SMP), FreeBSD (7.0), Solaris i386 (5.9), Solaris sparc (5.9), MacOS X (Darwin), WinCE (Pocket PC), Palm OS (Garnet), .Net 2003 \nJava, C; Python; SQL, XML; Windows nmake, GNU Makefile, ant, batch; script languages (bash, csh);  \nVSS, CVS, SVN; Bugzilla; eclipse IDE \n \nHigh level responsibility for the s/w release process and production. \n \n• Designed build infrastructure, developed and maintained the completely automated build process for all company projects and products. It included API build using all supported platforms, image creation for the separation of components for various products, build of installations and CD images of products. Handled new projects and maintained a high level of quality and automation.  \n• Created automated logging and reporting system of build process, developed Java applications to parse build reports. \n• Developed installers for all products using InstallShield, Nullsoft, Java \n• Developed and maintained API of tests and products examples, automated build and execution of tests and samples. \n• Developed and maintained documentation. Automated javadoc and cdoc generation, User Guides, examples, auto-run CDs HTML presentation, ReadMe files. \n• Developed license applications, automated generation and build-process of licenses for all products. \n• Maintained porting of “C” source code from Windows OS to the supported platforms. \n• Administered Bugzilla, CVS, SVN, branching of releases and backup \n• Build of all required SW and tools for the supported platforms, i.e. JDKs on UNIX boxes, OpenSSL and so on. \n• Managed and controlled QA group. Created test framework to automate tests process. \n• Managed the life cycle of all products from the design phase to the marketing. Coordinated the departments of R&D, quality control, production and marketing, followed targeted tasks from the creativity and technical sectors to the management of releases. Senior SW Engineer Siftology, Inc September 2002  –  January 2003  (5 months) Linux RH, Windows 2000; JAVA, PHP, JavaScript, Perl; XML-RPC, XSLT, HTML; mySQL; VisualAge \n \n• Smart Writer - the real time server applications (PHP, JavaScript, XML-RPC, SQL) to deliver related data to the users.  \n• XML-RPC interface (Java) between Java Client Applications and servers (Perl, SQL). \n• Java client-server applications for using archived content in workflow and research. Senior SW Engineer Siftology, Inc September 2002  –  January 2003  (5 months) Linux RH, Windows 2000; JAVA, PHP, JavaScript, Perl; XML-RPC, XSLT, HTML; mySQL; VisualAge \n \n• Smart Writer - the real time server applications (PHP, JavaScript, XML-RPC, SQL) to deliver related data to the users.  \n• XML-RPC interface (Java) between Java Client Applications and servers (Perl, SQL). \n• Java client-server applications for using archived content in workflow and research. Senior SW Engineer Creative Science Systems July 2000  –  July 2002  (2 years 1 month) UNIX, Windows NT; JAVA; C; XML, XSLT, HTML; TCP/IP, UDP; JUNIT \n \n• Data acquisition subsystem (C language), to collect primary stock market information for on-line web-based stock trading system.  \n• Re-broadcaster subsystem (Java) and set of Data Processors (Java, xslt, xml) to perform transformations of the data packages and transmission them to the recipients. \n• Test communicators (Java, xml) for messaging systems (TCP/IP, UDP). Software (Java applications, batch, make, shell scripts, data emulation) for the integration test of the project. \n• Simple types (Java) of XML Schema to Java compiler. Senior SW Engineer Creative Science Systems July 2000  –  July 2002  (2 years 1 month) UNIX, Windows NT; JAVA; C; XML, XSLT, HTML; TCP/IP, UDP; JUNIT \n \n• Data acquisition subsystem (C language), to collect primary stock market information for on-line web-based stock trading system.  \n• Re-broadcaster subsystem (Java) and set of Data Processors (Java, xslt, xml) to perform transformations of the data packages and transmission them to the recipients. \n• Test communicators (Java, xml) for messaging systems (TCP/IP, UDP). Software (Java applications, batch, make, shell scripts, data emulation) for the integration test of the project. \n• Simple types (Java) of XML Schema to Java compiler. Senior SW Engineer, contractor Pacific Tech, Co. (ADDR.com, Inc.) October 1999  –  July 2000  (10 months) Linux RH, Windows NT; Apache; C, PERL; HTML; HTTP \n \n• Web systems for registrations, invoicing and billing: Reseller and Affiliate systems. \n• Administration systems: Time Sheet Management System, Password Protection System. \n• Tools: File Manager. \n• Services: Image Scanning System. \n• Customer support systems. Senior SW Engineer, contractor Pacific Tech, Co. (ADDR.com, Inc.) October 1999  –  July 2000  (10 months) Linux RH, Windows NT; Apache; C, PERL; HTML; HTTP \n \n• Web systems for registrations, invoicing and billing: Reseller and Affiliate systems. \n• Administration systems: Time Sheet Management System, Password Protection System. \n• Tools: File Manager. \n• Services: Image Scanning System. \n• Customer support systems. Software developer 3Cube, Inc. April 1999  –  October 1999  (7 months) Windows NT, IIS; Linux, Apache; MS SQL Server; ASP, PERL, PHP, Javascript, HTML; HTTP \n \n• Company’s dynamic web page design and development, including PHP code to load information to and from Microsoft SQL database. \n• Internet communication software (ASP) for 3Cube customer support service with HTML to SQL and SQL to HTML transformations. Software developer 3Cube, Inc. April 1999  –  October 1999  (7 months) Windows NT, IIS; Linux, Apache; MS SQL Server; ASP, PERL, PHP, Javascript, HTML; HTTP \n \n• Company’s dynamic web page design and development, including PHP code to load information to and from Microsoft SQL database. \n• Internet communication software (ASP) for 3Cube customer support service with HTML to SQL and SQL to HTML transformations. Senior Research Associate St. Petersburg State University, Russia January 1990  –  June 1998  (8 years 6 months) Windows 3.x/95, MS-DOS, DR-DOS; FORTRAN \n \n• Various software packages for solving research problems in the area of large dynamic systems such as machinery assemblies, lines, ecological systems. \n• Design and implementation of proprietary direct access database. Senior Research Associate St. Petersburg State University, Russia January 1990  –  June 1998  (8 years 6 months) Windows 3.x/95, MS-DOS, DR-DOS; FORTRAN \n \n• Various software packages for solving research problems in the area of large dynamic systems such as machinery assemblies, lines, ecological systems. \n• Design and implementation of proprietary direct access database. Programmer St. Petersburg Research Institute, Russia 1982  –  1989  (7 years) PDP-11, IBM; FORTRAN, ASSEMBLER \n \n• Designed and implemented various software tools for porting source codes between operating systems VAX, IBM 370, PDP-11 and HP, etc. \n• Designed and implemented various data control program for I/O control unit. \n• Designed and implemented algorithms for solving the systems of none-linear differential equations with peace wise constant coefficients. Programmer St. Petersburg Research Institute, Russia 1982  –  1989  (7 years) PDP-11, IBM; FORTRAN, ASSEMBLER \n \n• Designed and implemented various software tools for porting source codes between operating systems VAX, IBM 370, PDP-11 and HP, etc. \n• Designed and implemented various data control program for I/O control unit. \n• Designed and implemented algorithms for solving the systems of none-linear differential equations with peace wise constant coefficients. Skills Perl Subversion XML Linux Unix Java Apache Shell Scripting Eclipse CVS Software Development MySQL Web Applications Bash Ant Web Services See 1+     See less Skills  Perl Subversion XML Linux Unix Java Apache Shell Scripting Eclipse CVS Software Development MySQL Web Applications Bash Ant Web Services See 1+     See less Perl Subversion XML Linux Unix Java Apache Shell Scripting Eclipse CVS Software Development MySQL Web Applications Bash Ant Web Services See 1+     See less Perl Subversion XML Linux Unix Java Apache Shell Scripting Eclipse CVS Software Development MySQL Web Applications Bash Ant Web Services See 1+     See less Education Saint Petersburg State Engineering Institute (VTUZ LMZ) Ph.D.,  Industrial Technology 1997  – 1998 Dissertation, 1998. 23 publications in Russian and international magazines Activities and Societies:  Science ,  music ,  literature Saint Petersburg State Electrotechnical University \"LETI\" MS,  Computer Science Engineering 1974  – 1980 Activities and Societies:  Rowing ,  swimming ,  running ,  skiing Saint Petersburg State Engineering Institute (VTUZ LMZ) Ph.D.,  Industrial Technology 1997  – 1998 Dissertation, 1998. 23 publications in Russian and international magazines Activities and Societies:  Science ,  music ,  literature Saint Petersburg State Engineering Institute (VTUZ LMZ) Ph.D.,  Industrial Technology 1997  – 1998 Dissertation, 1998. 23 publications in Russian and international magazines Activities and Societies:  Science ,  music ,  literature Saint Petersburg State Engineering Institute (VTUZ LMZ) Ph.D.,  Industrial Technology 1997  – 1998 Dissertation, 1998. 23 publications in Russian and international magazines Activities and Societies:  Science ,  music ,  literature Saint Petersburg State Electrotechnical University \"LETI\" MS,  Computer Science Engineering 1974  – 1980 Activities and Societies:  Rowing ,  swimming ,  running ,  skiing Saint Petersburg State Electrotechnical University \"LETI\" MS,  Computer Science Engineering 1974  – 1980 Activities and Societies:  Rowing ,  swimming ,  running ,  skiing Saint Petersburg State Electrotechnical University \"LETI\" MS,  Computer Science Engineering 1974  – 1980 Activities and Societies:  Rowing ,  swimming ,  running ,  skiing "]}