{"position": "Front End Engineer", "company": "Google", "profiles": ["Summary I'm a Yahoo! Front-End Engineer who's passionate about creating scalable, innovative interfaces for Yahoo! Fantasy Football, among other fantasy games and sports content. I'm big on delivering modular, well-tested code, and am an advocate for intuitive user experiences. I work primarily with various NodeJS frameworks to build robust HTML5 apps. \n \nSpecialties: HTML5, CSS3, JavaScript, NodeJS, PHP, Responsive Design, Progressive Enhancement, Scrum. University education in C++ and Java. Continuous Integration: Jenkins, Hudson. Version Control: GitHub and SVN. Summary I'm a Yahoo! Front-End Engineer who's passionate about creating scalable, innovative interfaces for Yahoo! Fantasy Football, among other fantasy games and sports content. I'm big on delivering modular, well-tested code, and am an advocate for intuitive user experiences. I work primarily with various NodeJS frameworks to build robust HTML5 apps. \n \nSpecialties: HTML5, CSS3, JavaScript, NodeJS, PHP, Responsive Design, Progressive Enhancement, Scrum. University education in C++ and Java. Continuous Integration: Jenkins, Hudson. Version Control: GitHub and SVN. I'm a Yahoo! Front-End Engineer who's passionate about creating scalable, innovative interfaces for Yahoo! Fantasy Football, among other fantasy games and sports content. I'm big on delivering modular, well-tested code, and am an advocate for intuitive user experiences. I work primarily with various NodeJS frameworks to build robust HTML5 apps. \n \nSpecialties: HTML5, CSS3, JavaScript, NodeJS, PHP, Responsive Design, Progressive Enhancement, Scrum. University education in C++ and Java. Continuous Integration: Jenkins, Hudson. Version Control: GitHub and SVN. I'm a Yahoo! Front-End Engineer who's passionate about creating scalable, innovative interfaces for Yahoo! Fantasy Football, among other fantasy games and sports content. I'm big on delivering modular, well-tested code, and am an advocate for intuitive user experiences. I work primarily with various NodeJS frameworks to build robust HTML5 apps. \n \nSpecialties: HTML5, CSS3, JavaScript, NodeJS, PHP, Responsive Design, Progressive Enhancement, Scrum. University education in C++ and Java. Continuous Integration: Jenkins, Hudson. Version Control: GitHub and SVN. Experience Front End Engineer, Yahoo! Fantasy Sports Yahoo! Sports April 2012  – Present (3 years 5 months) Santa Monica Web Developer UCLA Digital Library November 2009  –  March 2012  (2 years 5 months) Draft creative interfaces for users to access millions of digitized media records. Implement and design all layout, original graphics, front end code, and front-end interfacing Front End Engineer, Yahoo! Fantasy Sports Yahoo! June 2011  –  September 2011  (4 months) Santa Monica Used HTML, CSS, JavaScript, and PHP skills to enhance parts of Yahoo! Fantasy Sports. Pitched, sold, and developed a new feature of Fantasy Sports that will soon launch. Refactored and skinned message boards for Rivals.com, a newly acquired site of Yahoo! Sports Web Designer UCLA Simul8 May 2009  –  October 2009  (6 months) Created mockups for digital image navigation interfaces. Edited and animated an explanatory video for one of the interfaces. Production Coordinator Pointe Studios July 2008  –  August 2008  (2 months) Fighting 4 Kidz Mixed Martial Arts Fight (MMA) television special. Tutor Self-Employed October 2003  –  June 2008  (4 years 9 months) Art Department Intern for \"The OC\" United States August 2006  –  August 2006  (1 month) Trained in all areas of set decoration and set design. Directly assisted Set Director, Set Designer, and Production Designer. Dressed multiple sets and crafted props for \"The OC\" show. Intern Raleigh Studios June 2006  –  August 2006  (3 months) Intern of Set Lighting/Operations \nTrained in a variety of production lights, gels, and expendables. Designed graphics/labeling system for expendable warehouse. Conducted phone and mail work for Director of Lot Operations. Special Effects Production Assistant for Ciara's Music Video for the movie \"Step Up.\" Raleigh Studios in Manhattan Beach houses the production of television shows such as \"The OC,\" \"CSI Miami,\" \"Boston Legal,\" and \"Medium.\" Front End Engineer, Yahoo! Fantasy Sports Yahoo! Sports April 2012  – Present (3 years 5 months) Santa Monica Front End Engineer, Yahoo! Fantasy Sports Yahoo! Sports April 2012  – Present (3 years 5 months) Santa Monica Web Developer UCLA Digital Library November 2009  –  March 2012  (2 years 5 months) Draft creative interfaces for users to access millions of digitized media records. Implement and design all layout, original graphics, front end code, and front-end interfacing Web Developer UCLA Digital Library November 2009  –  March 2012  (2 years 5 months) Draft creative interfaces for users to access millions of digitized media records. Implement and design all layout, original graphics, front end code, and front-end interfacing Front End Engineer, Yahoo! Fantasy Sports Yahoo! June 2011  –  September 2011  (4 months) Santa Monica Used HTML, CSS, JavaScript, and PHP skills to enhance parts of Yahoo! Fantasy Sports. Pitched, sold, and developed a new feature of Fantasy Sports that will soon launch. Refactored and skinned message boards for Rivals.com, a newly acquired site of Yahoo! Sports Front End Engineer, Yahoo! Fantasy Sports Yahoo! June 2011  –  September 2011  (4 months) Santa Monica Used HTML, CSS, JavaScript, and PHP skills to enhance parts of Yahoo! Fantasy Sports. Pitched, sold, and developed a new feature of Fantasy Sports that will soon launch. Refactored and skinned message boards for Rivals.com, a newly acquired site of Yahoo! Sports Web Designer UCLA Simul8 May 2009  –  October 2009  (6 months) Created mockups for digital image navigation interfaces. Edited and animated an explanatory video for one of the interfaces. Web Designer UCLA Simul8 May 2009  –  October 2009  (6 months) Created mockups for digital image navigation interfaces. Edited and animated an explanatory video for one of the interfaces. Production Coordinator Pointe Studios July 2008  –  August 2008  (2 months) Fighting 4 Kidz Mixed Martial Arts Fight (MMA) television special. Production Coordinator Pointe Studios July 2008  –  August 2008  (2 months) Fighting 4 Kidz Mixed Martial Arts Fight (MMA) television special. Tutor Self-Employed October 2003  –  June 2008  (4 years 9 months) Tutor Self-Employed October 2003  –  June 2008  (4 years 9 months) Art Department Intern for \"The OC\" United States August 2006  –  August 2006  (1 month) Trained in all areas of set decoration and set design. Directly assisted Set Director, Set Designer, and Production Designer. Dressed multiple sets and crafted props for \"The OC\" show. Art Department Intern for \"The OC\" United States August 2006  –  August 2006  (1 month) Trained in all areas of set decoration and set design. Directly assisted Set Director, Set Designer, and Production Designer. Dressed multiple sets and crafted props for \"The OC\" show. Intern Raleigh Studios June 2006  –  August 2006  (3 months) Intern of Set Lighting/Operations \nTrained in a variety of production lights, gels, and expendables. Designed graphics/labeling system for expendable warehouse. Conducted phone and mail work for Director of Lot Operations. Special Effects Production Assistant for Ciara's Music Video for the movie \"Step Up.\" Raleigh Studios in Manhattan Beach houses the production of television shows such as \"The OC,\" \"CSI Miami,\" \"Boston Legal,\" and \"Medium.\" Intern Raleigh Studios June 2006  –  August 2006  (3 months) Intern of Set Lighting/Operations \nTrained in a variety of production lights, gels, and expendables. Designed graphics/labeling system for expendable warehouse. Conducted phone and mail work for Director of Lot Operations. Special Effects Production Assistant for Ciara's Music Video for the movie \"Step Up.\" Raleigh Studios in Manhattan Beach houses the production of television shows such as \"The OC,\" \"CSI Miami,\" \"Boston Legal,\" and \"Medium.\" Languages Spanish Spanish Spanish Skills Node.js HTML 5 CSS3 JavaScript PHP Photoshop Web Design YUI jQuery Cross-browser... C# C++ Java Skills  Node.js HTML 5 CSS3 JavaScript PHP Photoshop Web Design YUI jQuery Cross-browser... C# C++ Java Node.js HTML 5 CSS3 JavaScript PHP Photoshop Web Design YUI jQuery Cross-browser... C# C++ Java Node.js HTML 5 CSS3 JavaScript PHP Photoshop Web Design YUI jQuery Cross-browser... C# C++ Java Education University of California, Los Angeles BA,  Mass Communications with a Specialization in Computer Programming 2008  – 2012 C++ Basics | Grade: A \nC++ Data Structures and Algorithms | Grade: A \nJava | Grade: A \nInternet Programming | Grade: A Activities and Societies:  UCLA Alumni Association Scholar ,  Alumni Scholar's Club University of California, Los Angeles BA,  Mass Communications with a Specialization in Computer Programming 2008  – 2012 C++ Basics | Grade: A \nC++ Data Structures and Algorithms | Grade: A \nJava | Grade: A \nInternet Programming | Grade: A Activities and Societies:  UCLA Alumni Association Scholar ,  Alumni Scholar's Club University of California, Los Angeles BA,  Mass Communications with a Specialization in Computer Programming 2008  – 2012 C++ Basics | Grade: A \nC++ Data Structures and Algorithms | Grade: A \nJava | Grade: A \nInternet Programming | Grade: A Activities and Societies:  UCLA Alumni Association Scholar ,  Alumni Scholar's Club University of California, Los Angeles BA,  Mass Communications with a Specialization in Computer Programming 2008  – 2012 C++ Basics | Grade: A \nC++ Data Structures and Algorithms | Grade: A \nJava | Grade: A \nInternet Programming | Grade: A Activities and Societies:  UCLA Alumni Association Scholar ,  Alumni Scholar's Club Honors & Awards Additional Honors & Awards Valedictorian - Mira Costa High School, 2008 \n \nUCLA Alumni Association Scholarship - less than 250 awarded to incoming UCLA students per year, 2008-2012 \n \n1st place in the nation \"Best News Story\" - Student Television Network, 2006 \n \n2nd place in the nation \"Best Human Interest/Feature Story\" - Student Television Network, 2007 \n \nGirl Scout Gold Award - developed a family history preservation program that documented the stories of 10 members of a senior's assisted living home. Helped to bridge family ties. Personally shot and edited 10, 1hr each documentaries, one per participant. 200+ hours of leadership service, 2008 Additional Honors & Awards Valedictorian - Mira Costa High School, 2008 \n \nUCLA Alumni Association Scholarship - less than 250 awarded to incoming UCLA students per year, 2008-2012 \n \n1st place in the nation \"Best News Story\" - Student Television Network, 2006 \n \n2nd place in the nation \"Best Human Interest/Feature Story\" - Student Television Network, 2007 \n \nGirl Scout Gold Award - developed a family history preservation program that documented the stories of 10 members of a senior's assisted living home. Helped to bridge family ties. Personally shot and edited 10, 1hr each documentaries, one per participant. 200+ hours of leadership service, 2008 Additional Honors & Awards Valedictorian - Mira Costa High School, 2008 \n \nUCLA Alumni Association Scholarship - less than 250 awarded to incoming UCLA students per year, 2008-2012 \n \n1st place in the nation \"Best News Story\" - Student Television Network, 2006 \n \n2nd place in the nation \"Best Human Interest/Feature Story\" - Student Television Network, 2007 \n \nGirl Scout Gold Award - developed a family history preservation program that documented the stories of 10 members of a senior's assisted living home. Helped to bridge family ties. Personally shot and edited 10, 1hr each documentaries, one per participant. 200+ hours of leadership service, 2008 Additional Honors & Awards Valedictorian - Mira Costa High School, 2008 \n \nUCLA Alumni Association Scholarship - less than 250 awarded to incoming UCLA students per year, 2008-2012 \n \n1st place in the nation \"Best News Story\" - Student Television Network, 2006 \n \n2nd place in the nation \"Best Human Interest/Feature Story\" - Student Television Network, 2007 \n \nGirl Scout Gold Award - developed a family history preservation program that documented the stories of 10 members of a senior's assisted living home. Helped to bridge family ties. Personally shot and edited 10, 1hr each documentaries, one per participant. 200+ hours of leadership service, 2008 ", "Summary I'm very happy working with Nest at Google and am not interested in any proposals: Please and thanks.  Summary I'm very happy working with Nest at Google and am not interested in any proposals: Please and thanks.  I'm very happy working with Nest at Google and am not interested in any proposals: Please and thanks.  I'm very happy working with Nest at Google and am not interested in any proposals: Please and thanks.  Experience Senior Front-End Engineer & UI Team Lead Google May 2015  – Present (4 months) Nest Labs, Palo Alto, CA store.nest.com Senior Front-End Engineer & UI Team Lead Yahoo October 2014  –  May 2015  (8 months) San Francisco Bay Area Front-End Engineer Yahoo July 2012  –  October 2014  (2 years 4 months) interclick, Boca Raton, FL Primary responsibilities include implementation and maintenance of the internal Ad management web application that was announced by Marissa Mayer at CES 2014. (In jQuery, Ember JS, Bootstrap.) Working closely with management to implement new features, designing and implementing high quality software as part of enterprise software IT projects, and lead tasks for the design, specification, development, integration, test, documentation, and release of software components. Web Developer The GEO Group, Inc. August 2011  –  July 2012  (1 year) Boca Raton, FL Responsible for development and implementation of GEO's web-based prisoner tracking system (PTS) using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. GEO's PTS manages information necessary to complete the processing, housing, administration, safekeeping, health care, and disposition of over seventy thousand individual beds worldwide. Involved in the design, creation, and onsite installation of GEOamey's UK based prisoner escort and custody services system (PECS). PECS's web-based system manages more than twelve thousand prisoner movements every week between police custody suites, courts, and prisons; as well as managing court custody suites and dock areas. As a senior-level developer, I lead mid-level developers in day-to-day development tasks. I communicate project status, issues, and resolutions directly with management. Web Developer US Gas and Electric Inc. February 2011  –  August 2011  (7 months) North Miami Beach, FL Enhanced and maintained USG&E's customer management system (CMS) using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. Prototyped the replacement CMS including all business analysis, function specifications, and business owner interfacing. Designed and implemented the aged trial balance system; integrating disparate financial information reporting methods and standards across all of the eleven states that USG&E operates in; including scheduled reporting, archival, and retrieval. Directed and assisted consultants in the design and development of the invoice to payment matching and management application. Web Developer The GEO Group, Inc. June 2009  –  February 2011  (1 year 9 months) Boca Raton, FL Responsible for development and implementation of GEO's intranet using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. Developed web applications for the management of GEO's armories, customer visits, business development, and performance indicators; including a complete re-write of the main landing page for over seventeen thousand GEO employees. Web Developer / Network Engineer Capital Business Credit 1993  –  2009  (16 years) Fort Lauderdale, FL Managed all facets of web application and site development, from initial design and architecture to site deployment, management, optimization, and web traffic analysis, for all of CBC’s Web needs; including our corporate presence (since 1996), intranet, custom document management / imaging system, vendor invoice tracking and reporting system, client invoice entry, and expense tracking application. Web Developer R2 Unified Technologies 2005  –  2006  (1 year) Boca Raton, FL [Side Project] -- Awarded the contract to design, develop, and deploy the Web front end for the Rolex Women’s World Golf Rankings. Network Administrator / Jr. Programmer Chiron IntraOptics 1991  –  1993  (2 years) Boca Raton, FL Creating / maintaining the Novell NetWare network, operation of a System/38 and AS/400, programming in RPG and CL, administration of a network of Macs, including a Twinax Gateway. Senior Front-End Engineer & UI Team Lead Google May 2015  – Present (4 months) Nest Labs, Palo Alto, CA store.nest.com Senior Front-End Engineer & UI Team Lead Google May 2015  – Present (4 months) Nest Labs, Palo Alto, CA store.nest.com Senior Front-End Engineer & UI Team Lead Yahoo October 2014  –  May 2015  (8 months) San Francisco Bay Area Senior Front-End Engineer & UI Team Lead Yahoo October 2014  –  May 2015  (8 months) San Francisco Bay Area Front-End Engineer Yahoo July 2012  –  October 2014  (2 years 4 months) interclick, Boca Raton, FL Primary responsibilities include implementation and maintenance of the internal Ad management web application that was announced by Marissa Mayer at CES 2014. (In jQuery, Ember JS, Bootstrap.) Working closely with management to implement new features, designing and implementing high quality software as part of enterprise software IT projects, and lead tasks for the design, specification, development, integration, test, documentation, and release of software components. Front-End Engineer Yahoo July 2012  –  October 2014  (2 years 4 months) interclick, Boca Raton, FL Primary responsibilities include implementation and maintenance of the internal Ad management web application that was announced by Marissa Mayer at CES 2014. (In jQuery, Ember JS, Bootstrap.) Working closely with management to implement new features, designing and implementing high quality software as part of enterprise software IT projects, and lead tasks for the design, specification, development, integration, test, documentation, and release of software components. Web Developer The GEO Group, Inc. August 2011  –  July 2012  (1 year) Boca Raton, FL Responsible for development and implementation of GEO's web-based prisoner tracking system (PTS) using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. GEO's PTS manages information necessary to complete the processing, housing, administration, safekeeping, health care, and disposition of over seventy thousand individual beds worldwide. Involved in the design, creation, and onsite installation of GEOamey's UK based prisoner escort and custody services system (PECS). PECS's web-based system manages more than twelve thousand prisoner movements every week between police custody suites, courts, and prisons; as well as managing court custody suites and dock areas. As a senior-level developer, I lead mid-level developers in day-to-day development tasks. I communicate project status, issues, and resolutions directly with management. Web Developer The GEO Group, Inc. August 2011  –  July 2012  (1 year) Boca Raton, FL Responsible for development and implementation of GEO's web-based prisoner tracking system (PTS) using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. GEO's PTS manages information necessary to complete the processing, housing, administration, safekeeping, health care, and disposition of over seventy thousand individual beds worldwide. Involved in the design, creation, and onsite installation of GEOamey's UK based prisoner escort and custody services system (PECS). PECS's web-based system manages more than twelve thousand prisoner movements every week between police custody suites, courts, and prisons; as well as managing court custody suites and dock areas. As a senior-level developer, I lead mid-level developers in day-to-day development tasks. I communicate project status, issues, and resolutions directly with management. Web Developer US Gas and Electric Inc. February 2011  –  August 2011  (7 months) North Miami Beach, FL Enhanced and maintained USG&E's customer management system (CMS) using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. Prototyped the replacement CMS including all business analysis, function specifications, and business owner interfacing. Designed and implemented the aged trial balance system; integrating disparate financial information reporting methods and standards across all of the eleven states that USG&E operates in; including scheduled reporting, archival, and retrieval. Directed and assisted consultants in the design and development of the invoice to payment matching and management application. Web Developer US Gas and Electric Inc. February 2011  –  August 2011  (7 months) North Miami Beach, FL Enhanced and maintained USG&E's customer management system (CMS) using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. Prototyped the replacement CMS including all business analysis, function specifications, and business owner interfacing. Designed and implemented the aged trial balance system; integrating disparate financial information reporting methods and standards across all of the eleven states that USG&E operates in; including scheduled reporting, archival, and retrieval. Directed and assisted consultants in the design and development of the invoice to payment matching and management application. Web Developer The GEO Group, Inc. June 2009  –  February 2011  (1 year 9 months) Boca Raton, FL Responsible for development and implementation of GEO's intranet using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. Developed web applications for the management of GEO's armories, customer visits, business development, and performance indicators; including a complete re-write of the main landing page for over seventeen thousand GEO employees. Web Developer The GEO Group, Inc. June 2009  –  February 2011  (1 year 9 months) Boca Raton, FL Responsible for development and implementation of GEO's intranet using JavaScript, HTML, CSS, ASP.NET, and Microsoft SQL. Developed web applications for the management of GEO's armories, customer visits, business development, and performance indicators; including a complete re-write of the main landing page for over seventeen thousand GEO employees. Web Developer / Network Engineer Capital Business Credit 1993  –  2009  (16 years) Fort Lauderdale, FL Managed all facets of web application and site development, from initial design and architecture to site deployment, management, optimization, and web traffic analysis, for all of CBC’s Web needs; including our corporate presence (since 1996), intranet, custom document management / imaging system, vendor invoice tracking and reporting system, client invoice entry, and expense tracking application. Web Developer / Network Engineer Capital Business Credit 1993  –  2009  (16 years) Fort Lauderdale, FL Managed all facets of web application and site development, from initial design and architecture to site deployment, management, optimization, and web traffic analysis, for all of CBC’s Web needs; including our corporate presence (since 1996), intranet, custom document management / imaging system, vendor invoice tracking and reporting system, client invoice entry, and expense tracking application. Web Developer R2 Unified Technologies 2005  –  2006  (1 year) Boca Raton, FL [Side Project] -- Awarded the contract to design, develop, and deploy the Web front end for the Rolex Women’s World Golf Rankings. Web Developer R2 Unified Technologies 2005  –  2006  (1 year) Boca Raton, FL [Side Project] -- Awarded the contract to design, develop, and deploy the Web front end for the Rolex Women’s World Golf Rankings. Network Administrator / Jr. Programmer Chiron IntraOptics 1991  –  1993  (2 years) Boca Raton, FL Creating / maintaining the Novell NetWare network, operation of a System/38 and AS/400, programming in RPG and CL, administration of a network of Macs, including a Twinax Gateway. Network Administrator / Jr. Programmer Chiron IntraOptics 1991  –  1993  (2 years) Boca Raton, FL Creating / maintaining the Novell NetWare network, operation of a System/38 and AS/400, programming in RPG and CL, administration of a network of Macs, including a Twinax Gateway. Languages   Skills JavaScript Skills  JavaScript JavaScript JavaScript Honors & Awards Yahoo Excellence Award 2014 Marissa Mayer February 2015 \"I’m thrilled to let you know that you’ve received the Excellence Award for 2014! Your performance in 2014 puts you in the top 10% of the company. \n \nYou have set an incredibly high bar – and you are a key driver of innovation, commitment, and enthusiasm across the company. I’m honored to recognize you with this distinction. \n \nWe want to continue to invest in and recognize top talent like you, and I cannot do enough to celebrate your efforts to bring Yahoo back to greatness. \n \nCongratulations! \nMarissa\" Yahoo Excellence Award 2014 Marissa Mayer February 2015 \"I’m thrilled to let you know that you’ve received the Excellence Award for 2014! Your performance in 2014 puts you in the top 10% of the company. \n \nYou have set an incredibly high bar – and you are a key driver of innovation, commitment, and enthusiasm across the company. I’m honored to recognize you with this distinction. \n \nWe want to continue to invest in and recognize top talent like you, and I cannot do enough to celebrate your efforts to bring Yahoo back to greatness. \n \nCongratulations! \nMarissa\" Yahoo Excellence Award 2014 Marissa Mayer February 2015 \"I’m thrilled to let you know that you’ve received the Excellence Award for 2014! Your performance in 2014 puts you in the top 10% of the company. \n \nYou have set an incredibly high bar – and you are a key driver of innovation, commitment, and enthusiasm across the company. I’m honored to recognize you with this distinction. \n \nWe want to continue to invest in and recognize top talent like you, and I cannot do enough to celebrate your efforts to bring Yahoo back to greatness. \n \nCongratulations! \nMarissa\" Yahoo Excellence Award 2014 Marissa Mayer February 2015 \"I’m thrilled to let you know that you’ve received the Excellence Award for 2014! Your performance in 2014 puts you in the top 10% of the company. \n \nYou have set an incredibly high bar – and you are a key driver of innovation, commitment, and enthusiasm across the company. I’m honored to recognize you with this distinction. \n \nWe want to continue to invest in and recognize top talent like you, and I cannot do enough to celebrate your efforts to bring Yahoo back to greatness. \n \nCongratulations! \nMarissa\" ", "Summary I'm a front end engineer with 8+ years experience in large media organisations, digital agencies, and as a freelance developer. \n \n/** Javascript */ \nMy world is largely Javascript-centric. I love using it and, mostly, I love learning about it. I have a sound understanding of Javascript fundamentals and design patterns, and write my JS using the ES6 standard at every opportunity. \n \nI have various levels of experience and familiarity with frameworks (React.js, Angular, Backbone, Polymer), libraries (jQuery, YUI, Zepto), micro-libraries and utilities. However, I’ve developed a particular fondness for React.js and think it’s just the bees knees (yes, even the JSX).  \n \nWhile I haven’t had the opportunity in any of my current or previous roles, I have spent time using Node.js, Express and MongoDB to create server-side Javascript applications and web-services for my own projects. So if a project has an Node back-end, I know enough that I can roll-up my sleeves and at least pitch in, if not get knee-deep. \n \n/** CSS */ \nI have experience architecting large, scalable, modular CSS frameworks with an emphasis on maintainability. I have a firm understanding of both the benefits and the pitfalls of using CSS pre-processors (SASS, LESS). I may have even animated an element or two with that fancy CSS3 stuff the cool kids are all talking about. \n \n/** Workflow and Processes */ \nI’m experienced using Git for version control, pull requests, branching and code reviews. I’ve written task managers (Gulp, Grunt) to automate code compilation, linting and testing; and a familiarity with continuous integration systems (Jenkins) to manage releases and deployment. I also have a working knowledge of Bash. \n \nI've also has plenty of experience working in agile environments, mostly Scrum based, and have familiarity with issue tracking and project management tools such as Jira and Rally. \n \n/** HTML */ \nI’ve heard of it. Summary I'm a front end engineer with 8+ years experience in large media organisations, digital agencies, and as a freelance developer. \n \n/** Javascript */ \nMy world is largely Javascript-centric. I love using it and, mostly, I love learning about it. I have a sound understanding of Javascript fundamentals and design patterns, and write my JS using the ES6 standard at every opportunity. \n \nI have various levels of experience and familiarity with frameworks (React.js, Angular, Backbone, Polymer), libraries (jQuery, YUI, Zepto), micro-libraries and utilities. However, I’ve developed a particular fondness for React.js and think it’s just the bees knees (yes, even the JSX).  \n \nWhile I haven’t had the opportunity in any of my current or previous roles, I have spent time using Node.js, Express and MongoDB to create server-side Javascript applications and web-services for my own projects. So if a project has an Node back-end, I know enough that I can roll-up my sleeves and at least pitch in, if not get knee-deep. \n \n/** CSS */ \nI have experience architecting large, scalable, modular CSS frameworks with an emphasis on maintainability. I have a firm understanding of both the benefits and the pitfalls of using CSS pre-processors (SASS, LESS). I may have even animated an element or two with that fancy CSS3 stuff the cool kids are all talking about. \n \n/** Workflow and Processes */ \nI’m experienced using Git for version control, pull requests, branching and code reviews. I’ve written task managers (Gulp, Grunt) to automate code compilation, linting and testing; and a familiarity with continuous integration systems (Jenkins) to manage releases and deployment. I also have a working knowledge of Bash. \n \nI've also has plenty of experience working in agile environments, mostly Scrum based, and have familiarity with issue tracking and project management tools such as Jira and Rally. \n \n/** HTML */ \nI’ve heard of it. I'm a front end engineer with 8+ years experience in large media organisations, digital agencies, and as a freelance developer. \n \n/** Javascript */ \nMy world is largely Javascript-centric. I love using it and, mostly, I love learning about it. I have a sound understanding of Javascript fundamentals and design patterns, and write my JS using the ES6 standard at every opportunity. \n \nI have various levels of experience and familiarity with frameworks (React.js, Angular, Backbone, Polymer), libraries (jQuery, YUI, Zepto), micro-libraries and utilities. However, I’ve developed a particular fondness for React.js and think it’s just the bees knees (yes, even the JSX).  \n \nWhile I haven’t had the opportunity in any of my current or previous roles, I have spent time using Node.js, Express and MongoDB to create server-side Javascript applications and web-services for my own projects. So if a project has an Node back-end, I know enough that I can roll-up my sleeves and at least pitch in, if not get knee-deep. \n \n/** CSS */ \nI have experience architecting large, scalable, modular CSS frameworks with an emphasis on maintainability. I have a firm understanding of both the benefits and the pitfalls of using CSS pre-processors (SASS, LESS). I may have even animated an element or two with that fancy CSS3 stuff the cool kids are all talking about. \n \n/** Workflow and Processes */ \nI’m experienced using Git for version control, pull requests, branching and code reviews. I’ve written task managers (Gulp, Grunt) to automate code compilation, linting and testing; and a familiarity with continuous integration systems (Jenkins) to manage releases and deployment. I also have a working knowledge of Bash. \n \nI've also has plenty of experience working in agile environments, mostly Scrum based, and have familiarity with issue tracking and project management tools such as Jira and Rally. \n \n/** HTML */ \nI’ve heard of it. I'm a front end engineer with 8+ years experience in large media organisations, digital agencies, and as a freelance developer. \n \n/** Javascript */ \nMy world is largely Javascript-centric. I love using it and, mostly, I love learning about it. I have a sound understanding of Javascript fundamentals and design patterns, and write my JS using the ES6 standard at every opportunity. \n \nI have various levels of experience and familiarity with frameworks (React.js, Angular, Backbone, Polymer), libraries (jQuery, YUI, Zepto), micro-libraries and utilities. However, I’ve developed a particular fondness for React.js and think it’s just the bees knees (yes, even the JSX).  \n \nWhile I haven’t had the opportunity in any of my current or previous roles, I have spent time using Node.js, Express and MongoDB to create server-side Javascript applications and web-services for my own projects. So if a project has an Node back-end, I know enough that I can roll-up my sleeves and at least pitch in, if not get knee-deep. \n \n/** CSS */ \nI have experience architecting large, scalable, modular CSS frameworks with an emphasis on maintainability. I have a firm understanding of both the benefits and the pitfalls of using CSS pre-processors (SASS, LESS). I may have even animated an element or two with that fancy CSS3 stuff the cool kids are all talking about. \n \n/** Workflow and Processes */ \nI’m experienced using Git for version control, pull requests, branching and code reviews. I’ve written task managers (Gulp, Grunt) to automate code compilation, linting and testing; and a familiarity with continuous integration systems (Jenkins) to manage releases and deployment. I also have a working knowledge of Bash. \n \nI've also has plenty of experience working in agile environments, mostly Scrum based, and have familiarity with issue tracking and project management tools such as Jira and Rally. \n \n/** HTML */ \nI’ve heard of it. Experience Senior Front End Engineer Yahoo!7 April 2014  – Present (1 year 5 months) Sydney Area, Australia Advocated the use of React.js within the business and subsequently led development of the implementation of key data-driven results and fixtures components for the Australian Tennis Open using the framework. \n \nContributed to a large-scale refactoring of internal front-end framework. Key contributions included re-architecting SASS framework, development of a new grid system, introduction of new naming convention and pattern for CSS, introduction of SASS linting and Gulp.js task management to workflows. \n \nConducted on-site training for Yahoo! New Zealand’s front-end developers on the processes and technologies used in the development and implementation of Yahoo!7’s multi-device platform. \n \nLead front-end developer on the migration of the Yahoo!7 front-page to a Yahoo! global multi-device platform and framework. \n \nSubmitted winning hack in Yahoo! Hack Day for Australia and the Asia-Pacific region. Front End Engineer Yahoo!7 April 2013  –  March 2014  (1 year) Sydney Area, Australia Lead front-end development of a bespoke SASS framework and JavaScript YUI widget library which are the foundation of the multi-device platform being rolled out to all Yahoo!7 verticals. Subsequently lead development on the implementation of the framework on the 7News, The West Australian and Marie Claire properties. Javascript Developer Creative Licence Digital December 2012  –  April 2013  (5 months) Manly, NSW JavaScript development for enterprise iOS hybrid applications. Primary responsibilities included developing Zepto plugins and constructing user interfaces with Jade templating and LESS stylesheets. Web Developer Ionata Web Solutions September 2009  –  December 2012  (3 years 4 months) Hobart, Tasmania Primary developer on the majority of CMS and ecommerce builds, and lead front-end on bespoke web applications. Main technical responsibilities included developing HTML and CSS layouts and interactive JavaScript elements and integration with server-side platforms, third party plugins and APIs. Senior Front End Engineer Yahoo!7 April 2014  – Present (1 year 5 months) Sydney Area, Australia Advocated the use of React.js within the business and subsequently led development of the implementation of key data-driven results and fixtures components for the Australian Tennis Open using the framework. \n \nContributed to a large-scale refactoring of internal front-end framework. Key contributions included re-architecting SASS framework, development of a new grid system, introduction of new naming convention and pattern for CSS, introduction of SASS linting and Gulp.js task management to workflows. \n \nConducted on-site training for Yahoo! New Zealand’s front-end developers on the processes and technologies used in the development and implementation of Yahoo!7’s multi-device platform. \n \nLead front-end developer on the migration of the Yahoo!7 front-page to a Yahoo! global multi-device platform and framework. \n \nSubmitted winning hack in Yahoo! Hack Day for Australia and the Asia-Pacific region. Senior Front End Engineer Yahoo!7 April 2014  – Present (1 year 5 months) Sydney Area, Australia Advocated the use of React.js within the business and subsequently led development of the implementation of key data-driven results and fixtures components for the Australian Tennis Open using the framework. \n \nContributed to a large-scale refactoring of internal front-end framework. Key contributions included re-architecting SASS framework, development of a new grid system, introduction of new naming convention and pattern for CSS, introduction of SASS linting and Gulp.js task management to workflows. \n \nConducted on-site training for Yahoo! New Zealand’s front-end developers on the processes and technologies used in the development and implementation of Yahoo!7’s multi-device platform. \n \nLead front-end developer on the migration of the Yahoo!7 front-page to a Yahoo! global multi-device platform and framework. \n \nSubmitted winning hack in Yahoo! Hack Day for Australia and the Asia-Pacific region. Front End Engineer Yahoo!7 April 2013  –  March 2014  (1 year) Sydney Area, Australia Lead front-end development of a bespoke SASS framework and JavaScript YUI widget library which are the foundation of the multi-device platform being rolled out to all Yahoo!7 verticals. Subsequently lead development on the implementation of the framework on the 7News, The West Australian and Marie Claire properties. Front End Engineer Yahoo!7 April 2013  –  March 2014  (1 year) Sydney Area, Australia Lead front-end development of a bespoke SASS framework and JavaScript YUI widget library which are the foundation of the multi-device platform being rolled out to all Yahoo!7 verticals. Subsequently lead development on the implementation of the framework on the 7News, The West Australian and Marie Claire properties. Javascript Developer Creative Licence Digital December 2012  –  April 2013  (5 months) Manly, NSW JavaScript development for enterprise iOS hybrid applications. Primary responsibilities included developing Zepto plugins and constructing user interfaces with Jade templating and LESS stylesheets. Javascript Developer Creative Licence Digital December 2012  –  April 2013  (5 months) Manly, NSW JavaScript development for enterprise iOS hybrid applications. Primary responsibilities included developing Zepto plugins and constructing user interfaces with Jade templating and LESS stylesheets. Web Developer Ionata Web Solutions September 2009  –  December 2012  (3 years 4 months) Hobart, Tasmania Primary developer on the majority of CMS and ecommerce builds, and lead front-end on bespoke web applications. Main technical responsibilities included developing HTML and CSS layouts and interactive JavaScript elements and integration with server-side platforms, third party plugins and APIs. Web Developer Ionata Web Solutions September 2009  –  December 2012  (3 years 4 months) Hobart, Tasmania Primary developer on the majority of CMS and ecommerce builds, and lead front-end on bespoke web applications. Main technical responsibilities included developing HTML and CSS layouts and interactive JavaScript elements and integration with server-side platforms, third party plugins and APIs. Languages   Skills WordPress JavaScript CSS PHP HTML jQuery Wordpress HTML 5 AJAX XHTML Web Development Git Front-end Photoshop JSON Node.js YUI HTML5 See 3+     See less Skills  WordPress JavaScript CSS PHP HTML jQuery Wordpress HTML 5 AJAX XHTML Web Development Git Front-end Photoshop JSON Node.js YUI HTML5 See 3+     See less WordPress JavaScript CSS PHP HTML jQuery Wordpress HTML 5 AJAX XHTML Web Development Git Front-end Photoshop JSON Node.js YUI HTML5 See 3+     See less WordPress JavaScript CSS PHP HTML jQuery Wordpress HTML 5 AJAX XHTML Web Development Git Front-end Photoshop JSON Node.js YUI HTML5 See 3+     See less Education University of Tasmania Bachelor of Computing,  Computer Science 2007  – 2009 University of Tasmania Bachelor of Computing,  Computer Science 2007  – 2009 University of Tasmania Bachelor of Computing,  Computer Science 2007  – 2009 University of Tasmania Bachelor of Computing,  Computer Science 2007  – 2009 Honors & Awards ", "Experience Senior Front End Engineer Flickr January 2013  – Present (2 years 8 months) San Francisco Bay Area Senior Front End Engineer Yahoo March 2010  –  January 2013  (2 years 11 months) Sunnyvale, CA Front End Engineer Yahoo! October 2007  –  March 2010  (2 years 6 months) Sunnyvale, CA User Interface Developer Momentum Design Lab January 2007  –  July 2007  (7 months) San Francisco Bay Area Senior Front End Engineer Flickr January 2013  – Present (2 years 8 months) San Francisco Bay Area Senior Front End Engineer Flickr January 2013  – Present (2 years 8 months) San Francisco Bay Area Senior Front End Engineer Yahoo March 2010  –  January 2013  (2 years 11 months) Sunnyvale, CA Senior Front End Engineer Yahoo March 2010  –  January 2013  (2 years 11 months) Sunnyvale, CA Front End Engineer Yahoo! October 2007  –  March 2010  (2 years 6 months) Sunnyvale, CA Front End Engineer Yahoo! October 2007  –  March 2010  (2 years 6 months) Sunnyvale, CA User Interface Developer Momentum Design Lab January 2007  –  July 2007  (7 months) San Francisco Bay Area User Interface Developer Momentum Design Lab January 2007  –  July 2007  (7 months) San Francisco Bay Area Skills JavaScript HTML + CSS PHP Java Advanced CSS Skills  JavaScript HTML + CSS PHP Java Advanced CSS JavaScript HTML + CSS PHP Java Advanced CSS JavaScript HTML + CSS PHP Java Advanced CSS Education University of California, Berkeley B.A.,  Cognitive Science 2001  – 2005 University of California, Berkeley B.A.,  Cognitive Science 2001  – 2005 University of California, Berkeley B.A.,  Cognitive Science 2001  – 2005 University of California, Berkeley B.A.,  Cognitive Science 2001  – 2005 ", "Summary I'm always hiring great people, if your interested to join my team get in touch! \n \n****** RECRUITERS ****** \n- I like to absorb information at my leisure via email, please don't hassle me for phone calls upfront. \n- If you want to connect with me, drop me a message or quick introduction. \n \nI'm pretty easy going, so feel free to contact me or get in touch should you have any questions or want to have a chat. \n \n****** ABOUT ME ****** \nExtensive experience in web technologies and well versed in user interface development of high performance, large scale web applications. Strong belief in maintainability, scalability, internationalization and performance optimisation of modular code from concept through to implementation. \n \nSpecialties: JavaScript, Node, PHP, HTML5, CSS3, DOM, Agile (Scrum / Kanban) Summary I'm always hiring great people, if your interested to join my team get in touch! \n \n****** RECRUITERS ****** \n- I like to absorb information at my leisure via email, please don't hassle me for phone calls upfront. \n- If you want to connect with me, drop me a message or quick introduction. \n \nI'm pretty easy going, so feel free to contact me or get in touch should you have any questions or want to have a chat. \n \n****** ABOUT ME ****** \nExtensive experience in web technologies and well versed in user interface development of high performance, large scale web applications. Strong belief in maintainability, scalability, internationalization and performance optimisation of modular code from concept through to implementation. \n \nSpecialties: JavaScript, Node, PHP, HTML5, CSS3, DOM, Agile (Scrum / Kanban) I'm always hiring great people, if your interested to join my team get in touch! \n \n****** RECRUITERS ****** \n- I like to absorb information at my leisure via email, please don't hassle me for phone calls upfront. \n- If you want to connect with me, drop me a message or quick introduction. \n \nI'm pretty easy going, so feel free to contact me or get in touch should you have any questions or want to have a chat. \n \n****** ABOUT ME ****** \nExtensive experience in web technologies and well versed in user interface development of high performance, large scale web applications. Strong belief in maintainability, scalability, internationalization and performance optimisation of modular code from concept through to implementation. \n \nSpecialties: JavaScript, Node, PHP, HTML5, CSS3, DOM, Agile (Scrum / Kanban) I'm always hiring great people, if your interested to join my team get in touch! \n \n****** RECRUITERS ****** \n- I like to absorb information at my leisure via email, please don't hassle me for phone calls upfront. \n- If you want to connect with me, drop me a message or quick introduction. \n \nI'm pretty easy going, so feel free to contact me or get in touch should you have any questions or want to have a chat. \n \n****** ABOUT ME ****** \nExtensive experience in web technologies and well versed in user interface development of high performance, large scale web applications. Strong belief in maintainability, scalability, internationalization and performance optimisation of modular code from concept through to implementation. \n \nSpecialties: JavaScript, Node, PHP, HTML5, CSS3, DOM, Agile (Scrum / Kanban) Experience Sr. Engineering Manager Yahoo! August 2014  – Present (1 year 1 month) London, United Kingdom I'm building a new team at Yahoo! London for EMEA Search. This team is working on large scale, high-traffic, globally distributed systems to build next-generation contextual, personal and socially relevant experiences. \n \nEnd-to-end ownership of feed ingestion, indexing, presentation, ranking, structured data, serving and triggering systems. \n \nThis team designed and built a Knowledge Graph pipeline to map entities, in multiple languages, being used across Europe. Vice President - Markets & International Banking Royal Bank of Scotland December 2013  –  August 2014  (9 months) London, United Kingdom Lead the UI development of a realtime streaming FX trading platform, providing end-­to-end delivery of complex data rich transactional applications. Director of Engineering Richi July 2012  –  October 2013  (1 year 4 months) Richi is the winner of 2010 Red Herring 100 Asia and 2011 TechCrunch Disrupt Beijing.  \n \nAfter raising US$ 2,360,000, we are an open virtual currency exchange platform allowing anyone with points from loyalty programs, in-store value cards, or frequent flyer miles to use them for something of more immediate value. \n \nI managed the engineering department in bringing our global product to multiple markets: \n \n- Direct line managed, grew, recruited and hired a team of highly skilled engineers. \n- Introduced agile development, continuous integration, deployment and bug tracking processes. \n- Instilled TDD, documenting, unit-testing, pre-commit code checks, and auditing reviews. \n- Focused on scalability, performance and internationalization best practices. \n- Responsible for evaluating and selecting the technology requirements to meet business needs. \n- Speaker at TechOrange event on HTML5 - Content First: \nhttp://www.slideshare.net/davidshariff/html5-content-first-a-new-way-of-thinking \n- Speaker at JSDC.tw on RequireJS - Using AMD to fight the good,the bad and the ugly of JavaScript: http://slid.es/davidshariff/requirejs-jsdc-tw-2013 \n \nPersonally implemented several key features of the flagship points exchange product: \n \n- Created a configuration system to serve multiple development environments. \n- Implemented the UI for the consumer platform, giving a rich JavaScript experience. \n- Developed the HTML5 and CSS architecture used by consumer and merchant areas. \n- Authored several tools to make developers more productive: including translation, template, CSS and configuration dependency validators.  \n- Designed the server side exchange platform architecture to handle multiple exchange channels. \n- Built a hybird HTML5 mobile app that allowed consumers to prepay and use credits inside merchant stores. Web Technologies Evangelist Yahoo! March 2012  –  July 2012  (5 months) - As an Evangelist / Ambassador I promoted internally and externally, the latest cutting edge, web technologies and best practices from inside Yahoo! \n \n- Speaker at the JavaScript Developer's Conference (JSDC, 700+ people) introducing Yahoo! Mojito, a new client and server side framework written 100% in JavaScript capable of using 1 code-base to run on multiple devices. Front End Engineer - Global Search Team Yahoo! April 2011  –  July 2012  (1 year 4 months) - Lead all Front End UI (CSS, JavaScript, PHP and HTML) development of the Global Search Platform (~39 Million DAU, ~290 Million Daily Page Views) for vertical search related products across all 40 international markets including US, APAC, EMEA and North America. \n \n- Built 15+ search products across all 40 international locations, including US, APAC and EMEA for desktop and tablet devices. \n \n- Developed several tools to automate testing and avoid human errors during deployment process. \n \n- Wrote a tool that detected, compared, and updated deployed assets in a large content delivery network (CDN). \n \n- Lead global redesign roll-out across company for all products and international locations. \n \n- Cross-functional development with PMs, UI & UX Designers, QA, Editorial and Localization teams to synchronize global bi-weekly releases. \n \n- Production level code on all major Yahoo! global search sites including, but not limited to News, Sports, Finance, Blog, Lifestyle, Local, Shine, Directory, Knowledge and Finance products. UI Engineer - Human Interface Engineering Trend Micro December 2010  –  April 2011  (5 months) - Rapidly prototyped production level applications for 2011 Flagship Datacenter & Enterprise products using CSS, JavaScript and HTML. \n \n- Built JavaScript and HTML5 widgets for a component library used throughout the company. Applications Developer Imprint Group August 2009  –  September 2010  (1 year 2 months) Newcastle upon Tyne, United Kingdom - Managed development of the Imprint Group JTS (Job Tracking System) to track and update point of sale jobs from order through to delivery for CBS Outdoor UK. \n \n- Created and developed the Staples UK national online POS internal ordering system for every store in the United Kingdom. Implemented both client and server side to handle the entire e-commerce operations including reports, warehouse stock control and real-time tracking of shipments from CityLink. Freelance UI Consultant Various Clients February 2005  –  August 2009  (4 years 7 months) Newcastle upon Tyne, United Kingdom Produced wire-frames, specifications, designs and implemented small web applications for various clients using a variety of web technologies. Sr. Engineering Manager Yahoo! August 2014  – Present (1 year 1 month) London, United Kingdom I'm building a new team at Yahoo! London for EMEA Search. This team is working on large scale, high-traffic, globally distributed systems to build next-generation contextual, personal and socially relevant experiences. \n \nEnd-to-end ownership of feed ingestion, indexing, presentation, ranking, structured data, serving and triggering systems. \n \nThis team designed and built a Knowledge Graph pipeline to map entities, in multiple languages, being used across Europe. Sr. Engineering Manager Yahoo! August 2014  – Present (1 year 1 month) London, United Kingdom I'm building a new team at Yahoo! London for EMEA Search. This team is working on large scale, high-traffic, globally distributed systems to build next-generation contextual, personal and socially relevant experiences. \n \nEnd-to-end ownership of feed ingestion, indexing, presentation, ranking, structured data, serving and triggering systems. \n \nThis team designed and built a Knowledge Graph pipeline to map entities, in multiple languages, being used across Europe. Vice President - Markets & International Banking Royal Bank of Scotland December 2013  –  August 2014  (9 months) London, United Kingdom Lead the UI development of a realtime streaming FX trading platform, providing end-­to-end delivery of complex data rich transactional applications. Vice President - Markets & International Banking Royal Bank of Scotland December 2013  –  August 2014  (9 months) London, United Kingdom Lead the UI development of a realtime streaming FX trading platform, providing end-­to-end delivery of complex data rich transactional applications. Director of Engineering Richi July 2012  –  October 2013  (1 year 4 months) Richi is the winner of 2010 Red Herring 100 Asia and 2011 TechCrunch Disrupt Beijing.  \n \nAfter raising US$ 2,360,000, we are an open virtual currency exchange platform allowing anyone with points from loyalty programs, in-store value cards, or frequent flyer miles to use them for something of more immediate value. \n \nI managed the engineering department in bringing our global product to multiple markets: \n \n- Direct line managed, grew, recruited and hired a team of highly skilled engineers. \n- Introduced agile development, continuous integration, deployment and bug tracking processes. \n- Instilled TDD, documenting, unit-testing, pre-commit code checks, and auditing reviews. \n- Focused on scalability, performance and internationalization best practices. \n- Responsible for evaluating and selecting the technology requirements to meet business needs. \n- Speaker at TechOrange event on HTML5 - Content First: \nhttp://www.slideshare.net/davidshariff/html5-content-first-a-new-way-of-thinking \n- Speaker at JSDC.tw on RequireJS - Using AMD to fight the good,the bad and the ugly of JavaScript: http://slid.es/davidshariff/requirejs-jsdc-tw-2013 \n \nPersonally implemented several key features of the flagship points exchange product: \n \n- Created a configuration system to serve multiple development environments. \n- Implemented the UI for the consumer platform, giving a rich JavaScript experience. \n- Developed the HTML5 and CSS architecture used by consumer and merchant areas. \n- Authored several tools to make developers more productive: including translation, template, CSS and configuration dependency validators.  \n- Designed the server side exchange platform architecture to handle multiple exchange channels. \n- Built a hybird HTML5 mobile app that allowed consumers to prepay and use credits inside merchant stores. Director of Engineering Richi July 2012  –  October 2013  (1 year 4 months) Richi is the winner of 2010 Red Herring 100 Asia and 2011 TechCrunch Disrupt Beijing.  \n \nAfter raising US$ 2,360,000, we are an open virtual currency exchange platform allowing anyone with points from loyalty programs, in-store value cards, or frequent flyer miles to use them for something of more immediate value. \n \nI managed the engineering department in bringing our global product to multiple markets: \n \n- Direct line managed, grew, recruited and hired a team of highly skilled engineers. \n- Introduced agile development, continuous integration, deployment and bug tracking processes. \n- Instilled TDD, documenting, unit-testing, pre-commit code checks, and auditing reviews. \n- Focused on scalability, performance and internationalization best practices. \n- Responsible for evaluating and selecting the technology requirements to meet business needs. \n- Speaker at TechOrange event on HTML5 - Content First: \nhttp://www.slideshare.net/davidshariff/html5-content-first-a-new-way-of-thinking \n- Speaker at JSDC.tw on RequireJS - Using AMD to fight the good,the bad and the ugly of JavaScript: http://slid.es/davidshariff/requirejs-jsdc-tw-2013 \n \nPersonally implemented several key features of the flagship points exchange product: \n \n- Created a configuration system to serve multiple development environments. \n- Implemented the UI for the consumer platform, giving a rich JavaScript experience. \n- Developed the HTML5 and CSS architecture used by consumer and merchant areas. \n- Authored several tools to make developers more productive: including translation, template, CSS and configuration dependency validators.  \n- Designed the server side exchange platform architecture to handle multiple exchange channels. \n- Built a hybird HTML5 mobile app that allowed consumers to prepay and use credits inside merchant stores. Web Technologies Evangelist Yahoo! March 2012  –  July 2012  (5 months) - As an Evangelist / Ambassador I promoted internally and externally, the latest cutting edge, web technologies and best practices from inside Yahoo! \n \n- Speaker at the JavaScript Developer's Conference (JSDC, 700+ people) introducing Yahoo! Mojito, a new client and server side framework written 100% in JavaScript capable of using 1 code-base to run on multiple devices. Web Technologies Evangelist Yahoo! March 2012  –  July 2012  (5 months) - As an Evangelist / Ambassador I promoted internally and externally, the latest cutting edge, web technologies and best practices from inside Yahoo! \n \n- Speaker at the JavaScript Developer's Conference (JSDC, 700+ people) introducing Yahoo! Mojito, a new client and server side framework written 100% in JavaScript capable of using 1 code-base to run on multiple devices. Front End Engineer - Global Search Team Yahoo! April 2011  –  July 2012  (1 year 4 months) - Lead all Front End UI (CSS, JavaScript, PHP and HTML) development of the Global Search Platform (~39 Million DAU, ~290 Million Daily Page Views) for vertical search related products across all 40 international markets including US, APAC, EMEA and North America. \n \n- Built 15+ search products across all 40 international locations, including US, APAC and EMEA for desktop and tablet devices. \n \n- Developed several tools to automate testing and avoid human errors during deployment process. \n \n- Wrote a tool that detected, compared, and updated deployed assets in a large content delivery network (CDN). \n \n- Lead global redesign roll-out across company for all products and international locations. \n \n- Cross-functional development with PMs, UI & UX Designers, QA, Editorial and Localization teams to synchronize global bi-weekly releases. \n \n- Production level code on all major Yahoo! global search sites including, but not limited to News, Sports, Finance, Blog, Lifestyle, Local, Shine, Directory, Knowledge and Finance products. Front End Engineer - Global Search Team Yahoo! April 2011  –  July 2012  (1 year 4 months) - Lead all Front End UI (CSS, JavaScript, PHP and HTML) development of the Global Search Platform (~39 Million DAU, ~290 Million Daily Page Views) for vertical search related products across all 40 international markets including US, APAC, EMEA and North America. \n \n- Built 15+ search products across all 40 international locations, including US, APAC and EMEA for desktop and tablet devices. \n \n- Developed several tools to automate testing and avoid human errors during deployment process. \n \n- Wrote a tool that detected, compared, and updated deployed assets in a large content delivery network (CDN). \n \n- Lead global redesign roll-out across company for all products and international locations. \n \n- Cross-functional development with PMs, UI & UX Designers, QA, Editorial and Localization teams to synchronize global bi-weekly releases. \n \n- Production level code on all major Yahoo! global search sites including, but not limited to News, Sports, Finance, Blog, Lifestyle, Local, Shine, Directory, Knowledge and Finance products. UI Engineer - Human Interface Engineering Trend Micro December 2010  –  April 2011  (5 months) - Rapidly prototyped production level applications for 2011 Flagship Datacenter & Enterprise products using CSS, JavaScript and HTML. \n \n- Built JavaScript and HTML5 widgets for a component library used throughout the company. UI Engineer - Human Interface Engineering Trend Micro December 2010  –  April 2011  (5 months) - Rapidly prototyped production level applications for 2011 Flagship Datacenter & Enterprise products using CSS, JavaScript and HTML. \n \n- Built JavaScript and HTML5 widgets for a component library used throughout the company. Applications Developer Imprint Group August 2009  –  September 2010  (1 year 2 months) Newcastle upon Tyne, United Kingdom - Managed development of the Imprint Group JTS (Job Tracking System) to track and update point of sale jobs from order through to delivery for CBS Outdoor UK. \n \n- Created and developed the Staples UK national online POS internal ordering system for every store in the United Kingdom. Implemented both client and server side to handle the entire e-commerce operations including reports, warehouse stock control and real-time tracking of shipments from CityLink. Applications Developer Imprint Group August 2009  –  September 2010  (1 year 2 months) Newcastle upon Tyne, United Kingdom - Managed development of the Imprint Group JTS (Job Tracking System) to track and update point of sale jobs from order through to delivery for CBS Outdoor UK. \n \n- Created and developed the Staples UK national online POS internal ordering system for every store in the United Kingdom. Implemented both client and server side to handle the entire e-commerce operations including reports, warehouse stock control and real-time tracking of shipments from CityLink. Freelance UI Consultant Various Clients February 2005  –  August 2009  (4 years 7 months) Newcastle upon Tyne, United Kingdom Produced wire-frames, specifications, designs and implemented small web applications for various clients using a variety of web technologies. Freelance UI Consultant Various Clients February 2005  –  August 2009  (4 years 7 months) Newcastle upon Tyne, United Kingdom Produced wire-frames, specifications, designs and implemented small web applications for various clients using a variety of web technologies. Languages English Native or bilingual proficiency Chinese - Basic English Native or bilingual proficiency Chinese - Basic English Native or bilingual proficiency Chinese - Basic Native or bilingual proficiency Skills PHP JavaScript CSS HTML MySQL HTML 5 jQuery Git Java Subversion Agile Methodologies YUI Web Development User Interface Web Applications Software Engineering Facebook API Mootools Hudson DOM L10n i18n User Experience Design Scrum Backbone.js PhoneGap RequireJS Modernizr Mustache.js Handlebars.js Mocha Jasmine Angular Node.js See 19+     See less Skills  PHP JavaScript CSS HTML MySQL HTML 5 jQuery Git Java Subversion Agile Methodologies YUI Web Development User Interface Web Applications Software Engineering Facebook API Mootools Hudson DOM L10n i18n User Experience Design Scrum Backbone.js PhoneGap RequireJS Modernizr Mustache.js Handlebars.js Mocha Jasmine Angular Node.js See 19+     See less PHP JavaScript CSS HTML MySQL HTML 5 jQuery Git Java Subversion Agile Methodologies YUI Web Development User Interface Web Applications Software Engineering Facebook API Mootools Hudson DOM L10n i18n User Experience Design Scrum Backbone.js PhoneGap RequireJS Modernizr Mustache.js Handlebars.js Mocha Jasmine Angular Node.js See 19+     See less PHP JavaScript CSS HTML MySQL HTML 5 jQuery Git Java Subversion Agile Methodologies YUI Web Development User Interface Web Applications Software Engineering Facebook API Mootools Hudson DOM L10n i18n User Experience Design Scrum Backbone.js PhoneGap RequireJS Modernizr Mustache.js Handlebars.js Mocha Jasmine Angular Node.js See 19+     See less Education University of Sunderland MSc,  E-Technology 2007  – 2009 • Dynamic Web Engineering. \n• Web Interaction Design. \n• Database Systems Engineering. \n• Information Management. \n• Information Systems Security Engineering. \n• Research Ethical Professional and Legal Issues. University of Sunderland BSc,  Network Computing 2004  – 2007 • OO Development & Algorithms, Distributed Object Systems. \n• Advanced Software Development & Engineering, Network Models. \n• Network Configuration & Management, Telecommunications Technology. University of Sunderland MSc,  E-Technology 2007  – 2009 • Dynamic Web Engineering. \n• Web Interaction Design. \n• Database Systems Engineering. \n• Information Management. \n• Information Systems Security Engineering. \n• Research Ethical Professional and Legal Issues. University of Sunderland MSc,  E-Technology 2007  – 2009 • Dynamic Web Engineering. \n• Web Interaction Design. \n• Database Systems Engineering. \n• Information Management. \n• Information Systems Security Engineering. \n• Research Ethical Professional and Legal Issues. University of Sunderland MSc,  E-Technology 2007  – 2009 • Dynamic Web Engineering. \n• Web Interaction Design. \n• Database Systems Engineering. \n• Information Management. \n• Information Systems Security Engineering. \n• Research Ethical Professional and Legal Issues. University of Sunderland BSc,  Network Computing 2004  – 2007 • OO Development & Algorithms, Distributed Object Systems. \n• Advanced Software Development & Engineering, Network Models. \n• Network Configuration & Management, Telecommunications Technology. University of Sunderland BSc,  Network Computing 2004  – 2007 • OO Development & Algorithms, Distributed Object Systems. \n• Advanced Software Development & Engineering, Network Models. \n• Network Configuration & Management, Telecommunications Technology. University of Sunderland BSc,  Network Computing 2004  – 2007 • OO Development & Algorithms, Distributed Object Systems. \n• Advanced Software Development & Engineering, Network Models. \n• Network Configuration & Management, Telecommunications Technology. Honors & Awards ", "Experience Front end engineer Yahoo! April 2013  – Present (2 years 5 months) Greater Los Angeles Area I work as a Front End Engineer in the video group at Yahoo! Media.  \n \nYahoo! Player \n2015 \nBuild features for the latest Yahoo! player with focus on user engagement and experience.  \n \nYahoo! Movie re-launch  \n2014 \nwww.yahoo.com/movies \nMove to a new tech stack with Node and fresh new design. \n \nYahoo! Screen re-launch \n2013 \nscreen.yahoo.com  \nRelaunched Yahoo! Video site in two month with a totally user experience and tech support. \n \nYahoo! News \n2013 \nnews.yahoo.com/ \nWorked in the core content experience team leading redesign of Yahoo News site. \n \nFocus on user experience, cross platform presentation, and both server and client side performance. Front end engineer, UI/UX designer Nice Shoes Post Production October 2011  –  December 2012  (1 year 3 months) Greater New York City Area - Redesign and develop the company website with wordpress customization \n- Design and work on the front end of a media sharing web application on Django framework \n- Design and develop company intranet with Twitter Bootstrap Project Assistant Cisco April 2010  –  June 2010  (3 months) Shanghai, China - Assist the project called Smart+Connected Communities Project on data collection, UI framework design, technical research. Communicated and coordinated the project with the local government, industries and universities. Front end engineer Yahoo! April 2013  – Present (2 years 5 months) Greater Los Angeles Area I work as a Front End Engineer in the video group at Yahoo! Media.  \n \nYahoo! Player \n2015 \nBuild features for the latest Yahoo! player with focus on user engagement and experience.  \n \nYahoo! Movie re-launch  \n2014 \nwww.yahoo.com/movies \nMove to a new tech stack with Node and fresh new design. \n \nYahoo! Screen re-launch \n2013 \nscreen.yahoo.com  \nRelaunched Yahoo! Video site in two month with a totally user experience and tech support. \n \nYahoo! News \n2013 \nnews.yahoo.com/ \nWorked in the core content experience team leading redesign of Yahoo News site. \n \nFocus on user experience, cross platform presentation, and both server and client side performance. Front end engineer Yahoo! April 2013  – Present (2 years 5 months) Greater Los Angeles Area I work as a Front End Engineer in the video group at Yahoo! Media.  \n \nYahoo! Player \n2015 \nBuild features for the latest Yahoo! player with focus on user engagement and experience.  \n \nYahoo! Movie re-launch  \n2014 \nwww.yahoo.com/movies \nMove to a new tech stack with Node and fresh new design. \n \nYahoo! Screen re-launch \n2013 \nscreen.yahoo.com  \nRelaunched Yahoo! Video site in two month with a totally user experience and tech support. \n \nYahoo! News \n2013 \nnews.yahoo.com/ \nWorked in the core content experience team leading redesign of Yahoo News site. \n \nFocus on user experience, cross platform presentation, and both server and client side performance. Front end engineer, UI/UX designer Nice Shoes Post Production October 2011  –  December 2012  (1 year 3 months) Greater New York City Area - Redesign and develop the company website with wordpress customization \n- Design and work on the front end of a media sharing web application on Django framework \n- Design and develop company intranet with Twitter Bootstrap Front end engineer, UI/UX designer Nice Shoes Post Production October 2011  –  December 2012  (1 year 3 months) Greater New York City Area - Redesign and develop the company website with wordpress customization \n- Design and work on the front end of a media sharing web application on Django framework \n- Design and develop company intranet with Twitter Bootstrap Project Assistant Cisco April 2010  –  June 2010  (3 months) Shanghai, China - Assist the project called Smart+Connected Communities Project on data collection, UI framework design, technical research. Communicated and coordinated the project with the local government, industries and universities. Project Assistant Cisco April 2010  –  June 2010  (3 months) Shanghai, China - Assist the project called Smart+Connected Communities Project on data collection, UI framework design, technical research. Communicated and coordinated the project with the local government, industries and universities. Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills HTML CSS JavaScript jQuery Git PHP Java Front-end Web Development Web Design Interaction Design User Interface Design Usability Testing User Experience Design Github Node.js YUI Dust MySQL Python Wordpress Data Structures Algorithms Linux Mobile Applications Eclipse Android Web Services See 13+     See less Skills  HTML CSS JavaScript jQuery Git PHP Java Front-end Web Development Web Design Interaction Design User Interface Design Usability Testing User Experience Design Github Node.js YUI Dust MySQL Python Wordpress Data Structures Algorithms Linux Mobile Applications Eclipse Android Web Services See 13+     See less HTML CSS JavaScript jQuery Git PHP Java Front-end Web Development Web Design Interaction Design User Interface Design Usability Testing User Experience Design Github Node.js YUI Dust MySQL Python Wordpress Data Structures Algorithms Linux Mobile Applications Eclipse Android Web Services See 13+     See less HTML CSS JavaScript jQuery Git PHP Java Front-end Web Development Web Design Interaction Design User Interface Design Usability Testing User Experience Design Github Node.js YUI Dust MySQL Python Wordpress Data Structures Algorithms Linux Mobile Applications Eclipse Android Web Services See 13+     See less Education Carnegie Mellon University M.S,  Computer Science/MSIT - eBusiness 2010  – 2011 Fudan University BS,  Computer Science 2006  – 2010 Awards:  \nExcellent Student Award (Awarded to top 2% students who assume leadership roles in student affairs) Helsinki University of Technology Exchange Study,  Computer Science 2009  – 2009 Shanghai High School 2003  – 2006 Carnegie Mellon University M.S,  Computer Science/MSIT - eBusiness 2010  – 2011 Carnegie Mellon University M.S,  Computer Science/MSIT - eBusiness 2010  – 2011 Carnegie Mellon University M.S,  Computer Science/MSIT - eBusiness 2010  – 2011 Fudan University BS,  Computer Science 2006  – 2010 Awards:  \nExcellent Student Award (Awarded to top 2% students who assume leadership roles in student affairs) Fudan University BS,  Computer Science 2006  – 2010 Awards:  \nExcellent Student Award (Awarded to top 2% students who assume leadership roles in student affairs) Fudan University BS,  Computer Science 2006  – 2010 Awards:  \nExcellent Student Award (Awarded to top 2% students who assume leadership roles in student affairs) Helsinki University of Technology Exchange Study,  Computer Science 2009  – 2009 Helsinki University of Technology Exchange Study,  Computer Science 2009  – 2009 Helsinki University of Technology Exchange Study,  Computer Science 2009  – 2009 Shanghai High School 2003  – 2006 Shanghai High School 2003  – 2006 Shanghai High School 2003  – 2006 Honors & Awards ", "Summary Specialties:Clientside / Front End Development (JavaScript, AJAX, HTML, CSS, PHP, YUI, jQuery) Summary Specialties:Clientside / Front End Development (JavaScript, AJAX, HTML, CSS, PHP, YUI, jQuery) Specialties:Clientside / Front End Development (JavaScript, AJAX, HTML, CSS, PHP, YUI, jQuery) Specialties:Clientside / Front End Development (JavaScript, AJAX, HTML, CSS, PHP, YUI, jQuery) Experience Principal Engineer Yahoo! May 2012  – Present (3 years 4 months) Sunnyvale, CA Current: \nhttps://developer.yahoo.com \n \nPrevious: \nhttps://developer.yahoo.com/yql/ \nhttps://pipes.yahoo.com Principal Engineer Yahoo! May 2012  – Present (3 years 4 months) Sunnyvale, CA Current: \nhttps://developer.yahoo.com \n \nPrevious: \nhttps://developer.yahoo.com/yql/ \nhttps://pipes.yahoo.com Principal Engineer Yahoo! May 2012  – Present (3 years 4 months) Sunnyvale, CA Current: \nhttps://developer.yahoo.com \n \nPrevious: \nhttps://developer.yahoo.com/yql/ \nhttps://pipes.yahoo.com Skills jQuery CSS PHP JavaScript Front-end User Experience Agile Methodologies HTML 5 Web Design Information Architecture Interaction Design Usability Testing User-centered Design Usability XML RESTful WebServices YUI HTML Node.js See 4+     See less Skills  jQuery CSS PHP JavaScript Front-end User Experience Agile Methodologies HTML 5 Web Design Information Architecture Interaction Design Usability Testing User-centered Design Usability XML RESTful WebServices YUI HTML Node.js See 4+     See less jQuery CSS PHP JavaScript Front-end User Experience Agile Methodologies HTML 5 Web Design Information Architecture Interaction Design Usability Testing User-centered Design Usability XML RESTful WebServices YUI HTML Node.js See 4+     See less jQuery CSS PHP JavaScript Front-end User Experience Agile Methodologies HTML 5 Web Design Information Architecture Interaction Design Usability Testing User-centered Design Usability XML RESTful WebServices YUI HTML Node.js See 4+     See less ", "Skills Web Standards CSS User Interface Design Web Development HTML User Experience Agile Methodologies Web Design Front-end Mobile Devices SEO Accessibility HTML 5 Mobile Applications Skills  Web Standards CSS User Interface Design Web Development HTML User Experience Agile Methodologies Web Design Front-end Mobile Devices SEO Accessibility HTML 5 Mobile Applications Web Standards CSS User Interface Design Web Development HTML User Experience Agile Methodologies Web Design Front-end Mobile Devices SEO Accessibility HTML 5 Mobile Applications Web Standards CSS User Interface Design Web Development HTML User Experience Agile Methodologies Web Design Front-end Mobile Devices SEO Accessibility HTML 5 Mobile Applications ", "Summary Having been developing web applications for the past ten years has taught me a lot about the quality and dedication needed to create projects that engage users. Working with product managers, software engineers and designers has instilled in me a profound desire to communicate with team members to ensure successfully completed projects. \n \nSpecialties: Semantic HTML, CSS, JavaScript, Node.js, JSON, PHP, Accessibility, Search Engine Optimization, Web Performance, Cross Browser Development. Summary Having been developing web applications for the past ten years has taught me a lot about the quality and dedication needed to create projects that engage users. Working with product managers, software engineers and designers has instilled in me a profound desire to communicate with team members to ensure successfully completed projects. \n \nSpecialties: Semantic HTML, CSS, JavaScript, Node.js, JSON, PHP, Accessibility, Search Engine Optimization, Web Performance, Cross Browser Development. Having been developing web applications for the past ten years has taught me a lot about the quality and dedication needed to create projects that engage users. Working with product managers, software engineers and designers has instilled in me a profound desire to communicate with team members to ensure successfully completed projects. \n \nSpecialties: Semantic HTML, CSS, JavaScript, Node.js, JSON, PHP, Accessibility, Search Engine Optimization, Web Performance, Cross Browser Development. Having been developing web applications for the past ten years has taught me a lot about the quality and dedication needed to create projects that engage users. Working with product managers, software engineers and designers has instilled in me a profound desire to communicate with team members to ensure successfully completed projects. \n \nSpecialties: Semantic HTML, CSS, JavaScript, Node.js, JSON, PHP, Accessibility, Search Engine Optimization, Web Performance, Cross Browser Development. Experience Principal Software Engineer Yahoo! September 2012  – Present (3 years) Sunnyvale, CA Architecting and building the next generation NodeJS MVC framework for Yahoo. \n \nPowering such sites as Yahoo Screen, Tech, Food and a variety of other Sports web apps while supporting over 200 engineers with training, documentation and tech talks. Frontend Technical Lead Engineer, Media Experiences Team Yahoo! January 2011  –  September 2012  (1 year 9 months) As the frontend technical lead, I was responsible for overall frontend code quality, this included maintainability, performance, accessibility, and internationalization. I created a set of coding guidelines to ensure all engineers were developing with the same set of standards. \n \nOne of our main goals, from the engineering perspective, was to leverage a brand new NodeJS based technology stack that Yahoo created (i.e. Mojito). I worked with the Mojito development team to ensure any code contributions were submitted into the Mojito codebase for other developers to benefit from. Senior Frontend Engineer, Media Foundation Team Yahoo! January 2010  –  January 2011  (1 year 1 month) Sunnyvale, CA Helping to develop Yahoo!’s next generation front-end system. Working with teams across the globe to deliver a state of the art code base that meets international and accessibility standards. \n \nMentor high potential engineers to grow influence and take on leaderships roles. \n \nLeading software engineers towards a unified, test driven development framework. Front End Engineer - News Yahoo! January 2006  –  December 2009  (4 years) Worked on the Yahoo News team to create complex dynamic web applications for over 45 million users that viewed our web pages per month. Improved the original News code base to enhance user accessibility and site performance. Developed robust applications that could be used cross properties. Created side projects that included two portable news badges and a simple submit image uploader tool. Mentored fellow team members to ensure a smooth transition into News development. Web Developer audioMIDI September 2004  –  December 2005  (1 year 4 months) Worked on advanced e-shopping website built using Coldfusion and ASP. Created and maintained HTML, CSS and JavaScript functionality. Designed interactive flash video players for user engagement and built complex code to enhance the website search engine. Principal Software Engineer Yahoo! September 2012  – Present (3 years) Sunnyvale, CA Architecting and building the next generation NodeJS MVC framework for Yahoo. \n \nPowering such sites as Yahoo Screen, Tech, Food and a variety of other Sports web apps while supporting over 200 engineers with training, documentation and tech talks. Principal Software Engineer Yahoo! September 2012  – Present (3 years) Sunnyvale, CA Architecting and building the next generation NodeJS MVC framework for Yahoo. \n \nPowering such sites as Yahoo Screen, Tech, Food and a variety of other Sports web apps while supporting over 200 engineers with training, documentation and tech talks. Frontend Technical Lead Engineer, Media Experiences Team Yahoo! January 2011  –  September 2012  (1 year 9 months) As the frontend technical lead, I was responsible for overall frontend code quality, this included maintainability, performance, accessibility, and internationalization. I created a set of coding guidelines to ensure all engineers were developing with the same set of standards. \n \nOne of our main goals, from the engineering perspective, was to leverage a brand new NodeJS based technology stack that Yahoo created (i.e. Mojito). I worked with the Mojito development team to ensure any code contributions were submitted into the Mojito codebase for other developers to benefit from. Frontend Technical Lead Engineer, Media Experiences Team Yahoo! January 2011  –  September 2012  (1 year 9 months) As the frontend technical lead, I was responsible for overall frontend code quality, this included maintainability, performance, accessibility, and internationalization. I created a set of coding guidelines to ensure all engineers were developing with the same set of standards. \n \nOne of our main goals, from the engineering perspective, was to leverage a brand new NodeJS based technology stack that Yahoo created (i.e. Mojito). I worked with the Mojito development team to ensure any code contributions were submitted into the Mojito codebase for other developers to benefit from. Senior Frontend Engineer, Media Foundation Team Yahoo! January 2010  –  January 2011  (1 year 1 month) Sunnyvale, CA Helping to develop Yahoo!’s next generation front-end system. Working with teams across the globe to deliver a state of the art code base that meets international and accessibility standards. \n \nMentor high potential engineers to grow influence and take on leaderships roles. \n \nLeading software engineers towards a unified, test driven development framework. Senior Frontend Engineer, Media Foundation Team Yahoo! January 2010  –  January 2011  (1 year 1 month) Sunnyvale, CA Helping to develop Yahoo!’s next generation front-end system. Working with teams across the globe to deliver a state of the art code base that meets international and accessibility standards. \n \nMentor high potential engineers to grow influence and take on leaderships roles. \n \nLeading software engineers towards a unified, test driven development framework. Front End Engineer - News Yahoo! January 2006  –  December 2009  (4 years) Worked on the Yahoo News team to create complex dynamic web applications for over 45 million users that viewed our web pages per month. Improved the original News code base to enhance user accessibility and site performance. Developed robust applications that could be used cross properties. Created side projects that included two portable news badges and a simple submit image uploader tool. Mentored fellow team members to ensure a smooth transition into News development. Front End Engineer - News Yahoo! January 2006  –  December 2009  (4 years) Worked on the Yahoo News team to create complex dynamic web applications for over 45 million users that viewed our web pages per month. Improved the original News code base to enhance user accessibility and site performance. Developed robust applications that could be used cross properties. Created side projects that included two portable news badges and a simple submit image uploader tool. Mentored fellow team members to ensure a smooth transition into News development. Web Developer audioMIDI September 2004  –  December 2005  (1 year 4 months) Worked on advanced e-shopping website built using Coldfusion and ASP. Created and maintained HTML, CSS and JavaScript functionality. Designed interactive flash video players for user engagement and built complex code to enhance the website search engine. Web Developer audioMIDI September 2004  –  December 2005  (1 year 4 months) Worked on advanced e-shopping website built using Coldfusion and ASP. Created and maintained HTML, CSS and JavaScript functionality. Designed interactive flash video players for user engagement and built complex code to enhance the website search engine. Languages English English English Skills YUI PHP JavaScript JSON CSS AJAX Accessibility APIs XML SEO Cross-browser... Node.js LAMP HTML 5 jQuery Apache REST Test Driven Development Web Applications Subversion Front-end Git Scalability MVC MySQL Continuous Integration Web Standards Web Development OOP Open Source SASS Advanced CSS Github User Experience User Interface Scrum HTML5 Code Review See 23+     See less Skills  YUI PHP JavaScript JSON CSS AJAX Accessibility APIs XML SEO Cross-browser... Node.js LAMP HTML 5 jQuery Apache REST Test Driven Development Web Applications Subversion Front-end Git Scalability MVC MySQL Continuous Integration Web Standards Web Development OOP Open Source SASS Advanced CSS Github User Experience User Interface Scrum HTML5 Code Review See 23+     See less YUI PHP JavaScript JSON CSS AJAX Accessibility APIs XML SEO Cross-browser... Node.js LAMP HTML 5 jQuery Apache REST Test Driven Development Web Applications Subversion Front-end Git Scalability MVC MySQL Continuous Integration Web Standards Web Development OOP Open Source SASS Advanced CSS Github User Experience User Interface Scrum HTML5 Code Review See 23+     See less YUI PHP JavaScript JSON CSS AJAX Accessibility APIs XML SEO Cross-browser... Node.js LAMP HTML 5 jQuery Apache REST Test Driven Development Web Applications Subversion Front-end Git Scalability MVC MySQL Continuous Integration Web Standards Web Development OOP Open Source SASS Advanced CSS Github User Experience User Interface Scrum HTML5 Code Review See 23+     See less Education Westfield State University Bachelors,  Computer Science 2000  – 2004 Westfield State University Bachelors,  Computer Science 2000  – 2004 Westfield State University Bachelors,  Computer Science 2000  – 2004 Westfield State University Bachelors,  Computer Science 2000  – 2004 Honors & Awards ", "Skills Bowstaff Skills Nunchuck Skills Drunken Monkey Skills JavaScript jQuery CSS HTML Photoshop Front-end XHTML User Experience Mobile Devices Web Applications User Interface Design User Interface Git HTML 5 Ruby AJAX Mobile Applications See 5+     See less Skills  Bowstaff Skills Nunchuck Skills Drunken Monkey Skills JavaScript jQuery CSS HTML Photoshop Front-end XHTML User Experience Mobile Devices Web Applications User Interface Design User Interface Git HTML 5 Ruby AJAX Mobile Applications See 5+     See less Bowstaff Skills Nunchuck Skills Drunken Monkey Skills JavaScript jQuery CSS HTML Photoshop Front-end XHTML User Experience Mobile Devices Web Applications User Interface Design User Interface Git HTML 5 Ruby AJAX Mobile Applications See 5+     See less Bowstaff Skills Nunchuck Skills Drunken Monkey Skills JavaScript jQuery CSS HTML Photoshop Front-end XHTML User Experience Mobile Devices Web Applications User Interface Design User Interface Git HTML 5 Ruby AJAX Mobile Applications See 5+     See less ", "Summary - Provide expertize for Native Ad (Gemini) Integrations to external publishers for Mobile Web and Desktop Web \n \n- New Publisher partnerships to drive revenue growth, increase recirculation and engagement, and grow traffic for sites (desktop, mobile web, app)  \n \n- Front End Engineer building large scale, distributed, highly scalable and available internet enabled enterprise server systems \n \n- Developing cross-browser high performance Web Applications using HTML/HTML5, Javascript, Object Oriented Javascript, CSS, CSS3, XML, JSP, Java, which are semantic, SEO friendly and accessible \n \n- Experience working with JQuery, YUI widgets, AJAX, and developing interactive web applications \n \n- Experience working on JBoss, Apache, Maven, Ant \n \n- Object Oriented Design and development \n \nSpecialties: Advanced Javascript, ReactJS, Ember, Semantic HTML/DHTML, CSS2, CSS3, YUI, JQuery, JSP, FTL, Java, C#, Object Oriented Javascript, Accessibility, AJAX, XML, Struts Summary - Provide expertize for Native Ad (Gemini) Integrations to external publishers for Mobile Web and Desktop Web \n \n- New Publisher partnerships to drive revenue growth, increase recirculation and engagement, and grow traffic for sites (desktop, mobile web, app)  \n \n- Front End Engineer building large scale, distributed, highly scalable and available internet enabled enterprise server systems \n \n- Developing cross-browser high performance Web Applications using HTML/HTML5, Javascript, Object Oriented Javascript, CSS, CSS3, XML, JSP, Java, which are semantic, SEO friendly and accessible \n \n- Experience working with JQuery, YUI widgets, AJAX, and developing interactive web applications \n \n- Experience working on JBoss, Apache, Maven, Ant \n \n- Object Oriented Design and development \n \nSpecialties: Advanced Javascript, ReactJS, Ember, Semantic HTML/DHTML, CSS2, CSS3, YUI, JQuery, JSP, FTL, Java, C#, Object Oriented Javascript, Accessibility, AJAX, XML, Struts - Provide expertize for Native Ad (Gemini) Integrations to external publishers for Mobile Web and Desktop Web \n \n- New Publisher partnerships to drive revenue growth, increase recirculation and engagement, and grow traffic for sites (desktop, mobile web, app)  \n \n- Front End Engineer building large scale, distributed, highly scalable and available internet enabled enterprise server systems \n \n- Developing cross-browser high performance Web Applications using HTML/HTML5, Javascript, Object Oriented Javascript, CSS, CSS3, XML, JSP, Java, which are semantic, SEO friendly and accessible \n \n- Experience working with JQuery, YUI widgets, AJAX, and developing interactive web applications \n \n- Experience working on JBoss, Apache, Maven, Ant \n \n- Object Oriented Design and development \n \nSpecialties: Advanced Javascript, ReactJS, Ember, Semantic HTML/DHTML, CSS2, CSS3, YUI, JQuery, JSP, FTL, Java, C#, Object Oriented Javascript, Accessibility, AJAX, XML, Struts - Provide expertize for Native Ad (Gemini) Integrations to external publishers for Mobile Web and Desktop Web \n \n- New Publisher partnerships to drive revenue growth, increase recirculation and engagement, and grow traffic for sites (desktop, mobile web, app)  \n \n- Front End Engineer building large scale, distributed, highly scalable and available internet enabled enterprise server systems \n \n- Developing cross-browser high performance Web Applications using HTML/HTML5, Javascript, Object Oriented Javascript, CSS, CSS3, XML, JSP, Java, which are semantic, SEO friendly and accessible \n \n- Experience working with JQuery, YUI widgets, AJAX, and developing interactive web applications \n \n- Experience working on JBoss, Apache, Maven, Ant \n \n- Object Oriented Design and development \n \nSpecialties: Advanced Javascript, ReactJS, Ember, Semantic HTML/DHTML, CSS2, CSS3, YUI, JQuery, JSP, FTL, Java, C#, Object Oriented Javascript, Accessibility, AJAX, XML, Struts Experience Technical Product Specialist Yahoo November 2014  – Present (10 months) San Francisco Bay Area - Integration Specialist for Gemini Native Ads on Mobile Web, Desktop Web \n- Pre Sales and Post Sales guidance for increasing revenue and performance on Publisher Sites \n- Manage customer on-boarding, training Account Managers Sr Front End Engineer Yahoo November 2013  – Present (1 year 10 months) Sunnyvale Create Single Page Applications using Frameworks such as Angular, Ember, ReactJS for Yahoo Gemini, Flurry, etc \n Sr. Front End Engineer BlackRock May 2011  –  October 2013  (2 years 6 months) Front End Engineer Yahoo! May 2008  –  May 2011  (3 years 1 month) Worked across different teams in developing, cross browser and W3C compatible, Enterprise Web Application using Struts 2.0, JBoss, JSP, Java, AJAX,Advanced Javascript, Eclipse, Semantic HTML, CSS, YUI, YSlow, Firebug, IEDeveloper, Maven Software Developer Jefferson National Financial Corporation June 2007  –  May 2008  (1 year) C#, SQL Server 2005 Windows Application development \nin Fixed Income (RMBS, CMBS, CDO) Software Developer Koch Industries April 2006  –  May 2007  (1 year 2 months) C# .NET, SQL Server 2000, Web Services, Crystal Reports development in Fixed Income, focusing on CDO and RMBS Technical Product Specialist Yahoo November 2014  – Present (10 months) San Francisco Bay Area - Integration Specialist for Gemini Native Ads on Mobile Web, Desktop Web \n- Pre Sales and Post Sales guidance for increasing revenue and performance on Publisher Sites \n- Manage customer on-boarding, training Account Managers Technical Product Specialist Yahoo November 2014  – Present (10 months) San Francisco Bay Area - Integration Specialist for Gemini Native Ads on Mobile Web, Desktop Web \n- Pre Sales and Post Sales guidance for increasing revenue and performance on Publisher Sites \n- Manage customer on-boarding, training Account Managers Sr Front End Engineer Yahoo November 2013  – Present (1 year 10 months) Sunnyvale Create Single Page Applications using Frameworks such as Angular, Ember, ReactJS for Yahoo Gemini, Flurry, etc \n Sr Front End Engineer Yahoo November 2013  – Present (1 year 10 months) Sunnyvale Create Single Page Applications using Frameworks such as Angular, Ember, ReactJS for Yahoo Gemini, Flurry, etc \n Sr. Front End Engineer BlackRock May 2011  –  October 2013  (2 years 6 months) Sr. Front End Engineer BlackRock May 2011  –  October 2013  (2 years 6 months) Front End Engineer Yahoo! May 2008  –  May 2011  (3 years 1 month) Worked across different teams in developing, cross browser and W3C compatible, Enterprise Web Application using Struts 2.0, JBoss, JSP, Java, AJAX,Advanced Javascript, Eclipse, Semantic HTML, CSS, YUI, YSlow, Firebug, IEDeveloper, Maven Front End Engineer Yahoo! May 2008  –  May 2011  (3 years 1 month) Worked across different teams in developing, cross browser and W3C compatible, Enterprise Web Application using Struts 2.0, JBoss, JSP, Java, AJAX,Advanced Javascript, Eclipse, Semantic HTML, CSS, YUI, YSlow, Firebug, IEDeveloper, Maven Software Developer Jefferson National Financial Corporation June 2007  –  May 2008  (1 year) C#, SQL Server 2005 Windows Application development \nin Fixed Income (RMBS, CMBS, CDO) Software Developer Jefferson National Financial Corporation June 2007  –  May 2008  (1 year) C#, SQL Server 2005 Windows Application development \nin Fixed Income (RMBS, CMBS, CDO) Software Developer Koch Industries April 2006  –  May 2007  (1 year 2 months) C# .NET, SQL Server 2000, Web Services, Crystal Reports development in Fixed Income, focusing on CDO and RMBS Software Developer Koch Industries April 2006  –  May 2007  (1 year 2 months) C# .NET, SQL Server 2000, Web Services, Crystal Reports development in Fixed Income, focusing on CDO and RMBS Skills JavaScript AJAX jQuery XML CSS Web Services Web Applications Eclipse C# HTML5 HTML 5 Maven Agile Methodologies Ember.js jQuery UI GruntJS Node.js Backbone.js D3.js Highcharts Product Development Product Management Partner Management Customer Relations Mobile Technology Java Software Development JSP Object Oriented Design SQL Microsoft SQL Server Front-end JBoss Application Server Ant Struts See 20+     See less Skills  JavaScript AJAX jQuery XML CSS Web Services Web Applications Eclipse C# HTML5 HTML 5 Maven Agile Methodologies Ember.js jQuery UI GruntJS Node.js Backbone.js D3.js Highcharts Product Development Product Management Partner Management Customer Relations Mobile Technology Java Software Development JSP Object Oriented Design SQL Microsoft SQL Server Front-end JBoss Application Server Ant Struts See 20+     See less JavaScript AJAX jQuery XML CSS Web Services Web Applications Eclipse C# HTML5 HTML 5 Maven Agile Methodologies Ember.js jQuery UI GruntJS Node.js Backbone.js D3.js Highcharts Product Development Product Management Partner Management Customer Relations Mobile Technology Java Software Development JSP Object Oriented Design SQL Microsoft SQL Server Front-end JBoss Application Server Ant Struts See 20+     See less JavaScript AJAX jQuery XML CSS Web Services Web Applications Eclipse C# HTML5 HTML 5 Maven Agile Methodologies Ember.js jQuery UI GruntJS Node.js Backbone.js D3.js Highcharts Product Development Product Management Partner Management Customer Relations Mobile Technology Java Software Development JSP Object Oriented Design SQL Microsoft SQL Server Front-end JBoss Application Server Ant Struts See 20+     See less Education Illinois State University MS 2004  – 2005 Visvesvaraya Technological University 1998  – 2002 Illinois State University MS 2004  – 2005 Illinois State University MS 2004  – 2005 Illinois State University MS 2004  – 2005 Visvesvaraya Technological University 1998  – 2002 Visvesvaraya Technological University 1998  – 2002 Visvesvaraya Technological University 1998  – 2002 ", "Summary Specialties: JS, Nodejs, jQuery, Emberjs, Sass & Compass Summary Specialties: JS, Nodejs, jQuery, Emberjs, Sass & Compass Specialties: JS, Nodejs, jQuery, Emberjs, Sass & Compass Specialties: JS, Nodejs, jQuery, Emberjs, Sass & Compass Experience Senior Front-End Engineer RetailNext January 2015  – Present (8 months) San Francisco Bay Area Senior Front-End Engineer - Mobile and Emerging Tech. Group Yahoo! July 2011  –  November 2014  (3 years 5 months) Sunnyvale, CA Emberjs and Android application development as part of the mobile and emerging tech. group, I was also the lead engineer working on HTML5, CSS3 & Javascript mobile applications and in app widgets for Yahoo's IntoNow. \n \nI was part of the front end team that built and released the 2014 Flickr redesign and built several Emberjs and Nodejs based internal tools for Yahoo weather, Yahoo groups and others. Senior Front-End Engineer - Flip Video Cisco May 2009  –  July 2011  (2 years 3 months) San Francisco, CA Projects included: \n \n* Video Sharing Web Application (flipshare.com). \n* QT Embedded Web Based Video Sharing Application. \n* jQuery Plugins. \n* Scalable Javascript Architecture development. \n* Javascript bridge API for Flash and QT \n* jQuery based video playback widgets. \n \nand more... \n \nMy main areas included Javascript application development, Javascript application architecture and widget development with OO Javascript, jQuery, Semantic HTML 4 & 5 and CSS 2 & 3. Freelance Web Developer 831 Media February 2009  –  April 2009  (3 months) I built a custom CMS system using cakePHP which included a blog, photo gallery, publishing system and youtube integration. \n \nI also built a front end for the admin and consumer facing sides of this CMS. Web Developer Trio Display August 2008  –  January 2009  (6 months) Front End web design, OS Commerce administration, MYSQL administration, PHP and jQuery application development, Linux server administration, Wordpress integration and theme development. Web Developer Waveriders Gallery August 2008  –  January 2009  (6 months) Converted static pages to MYSQL based dynamic pages. \nDeveloping PHP based web applications for updating the site. \nOptimized site speed through CSS and table-less design practices. Information Management Specialist BikeBandit.com April 2008  –  August 2008  (5 months) Wrote MySQL queries for data analytics and data processing of large data sets from product vendors. Web Operations Ridegear.com February 2005  –  March 2008  (3 years 2 months) Managed all aspects of web development including managing remote outsourcing teams, data processing, PHP development and front end development. Senior Front-End Engineer RetailNext January 2015  – Present (8 months) San Francisco Bay Area Senior Front-End Engineer RetailNext January 2015  – Present (8 months) San Francisco Bay Area Senior Front-End Engineer - Mobile and Emerging Tech. Group Yahoo! July 2011  –  November 2014  (3 years 5 months) Sunnyvale, CA Emberjs and Android application development as part of the mobile and emerging tech. group, I was also the lead engineer working on HTML5, CSS3 & Javascript mobile applications and in app widgets for Yahoo's IntoNow. \n \nI was part of the front end team that built and released the 2014 Flickr redesign and built several Emberjs and Nodejs based internal tools for Yahoo weather, Yahoo groups and others. Senior Front-End Engineer - Mobile and Emerging Tech. Group Yahoo! July 2011  –  November 2014  (3 years 5 months) Sunnyvale, CA Emberjs and Android application development as part of the mobile and emerging tech. group, I was also the lead engineer working on HTML5, CSS3 & Javascript mobile applications and in app widgets for Yahoo's IntoNow. \n \nI was part of the front end team that built and released the 2014 Flickr redesign and built several Emberjs and Nodejs based internal tools for Yahoo weather, Yahoo groups and others. Senior Front-End Engineer - Flip Video Cisco May 2009  –  July 2011  (2 years 3 months) San Francisco, CA Projects included: \n \n* Video Sharing Web Application (flipshare.com). \n* QT Embedded Web Based Video Sharing Application. \n* jQuery Plugins. \n* Scalable Javascript Architecture development. \n* Javascript bridge API for Flash and QT \n* jQuery based video playback widgets. \n \nand more... \n \nMy main areas included Javascript application development, Javascript application architecture and widget development with OO Javascript, jQuery, Semantic HTML 4 & 5 and CSS 2 & 3. Senior Front-End Engineer - Flip Video Cisco May 2009  –  July 2011  (2 years 3 months) San Francisco, CA Projects included: \n \n* Video Sharing Web Application (flipshare.com). \n* QT Embedded Web Based Video Sharing Application. \n* jQuery Plugins. \n* Scalable Javascript Architecture development. \n* Javascript bridge API for Flash and QT \n* jQuery based video playback widgets. \n \nand more... \n \nMy main areas included Javascript application development, Javascript application architecture and widget development with OO Javascript, jQuery, Semantic HTML 4 & 5 and CSS 2 & 3. Freelance Web Developer 831 Media February 2009  –  April 2009  (3 months) I built a custom CMS system using cakePHP which included a blog, photo gallery, publishing system and youtube integration. \n \nI also built a front end for the admin and consumer facing sides of this CMS. Freelance Web Developer 831 Media February 2009  –  April 2009  (3 months) I built a custom CMS system using cakePHP which included a blog, photo gallery, publishing system and youtube integration. \n \nI also built a front end for the admin and consumer facing sides of this CMS. Web Developer Trio Display August 2008  –  January 2009  (6 months) Front End web design, OS Commerce administration, MYSQL administration, PHP and jQuery application development, Linux server administration, Wordpress integration and theme development. Web Developer Trio Display August 2008  –  January 2009  (6 months) Front End web design, OS Commerce administration, MYSQL administration, PHP and jQuery application development, Linux server administration, Wordpress integration and theme development. Web Developer Waveriders Gallery August 2008  –  January 2009  (6 months) Converted static pages to MYSQL based dynamic pages. \nDeveloping PHP based web applications for updating the site. \nOptimized site speed through CSS and table-less design practices. Web Developer Waveriders Gallery August 2008  –  January 2009  (6 months) Converted static pages to MYSQL based dynamic pages. \nDeveloping PHP based web applications for updating the site. \nOptimized site speed through CSS and table-less design practices. Information Management Specialist BikeBandit.com April 2008  –  August 2008  (5 months) Wrote MySQL queries for data analytics and data processing of large data sets from product vendors. Information Management Specialist BikeBandit.com April 2008  –  August 2008  (5 months) Wrote MySQL queries for data analytics and data processing of large data sets from product vendors. Web Operations Ridegear.com February 2005  –  March 2008  (3 years 2 months) Managed all aspects of web development including managing remote outsourcing teams, data processing, PHP development and front end development. Web Operations Ridegear.com February 2005  –  March 2008  (3 years 2 months) Managed all aspects of web development including managing remote outsourcing teams, data processing, PHP development and front end development. Skills HTML 5 jQuery JavaScript Ember.js Web Applications Nodejs Front-end Compass SASS CSS Advanced CSS PHP Agile Methodologies Node.js Web Development MySQL Mobile Applications WordPress JSON REST LAMP HTML Objective-C Software Development OOP AJAX Subversion Apache MVC CMS Performance Tuning Front-end Development Web Standards Linux Agile YUI Canvas HTML5 See 23+     See less Skills  HTML 5 jQuery JavaScript Ember.js Web Applications Nodejs Front-end Compass SASS CSS Advanced CSS PHP Agile Methodologies Node.js Web Development MySQL Mobile Applications WordPress JSON REST LAMP HTML Objective-C Software Development OOP AJAX Subversion Apache MVC CMS Performance Tuning Front-end Development Web Standards Linux Agile YUI Canvas HTML5 See 23+     See less HTML 5 jQuery JavaScript Ember.js Web Applications Nodejs Front-end Compass SASS CSS Advanced CSS PHP Agile Methodologies Node.js Web Development MySQL Mobile Applications WordPress JSON REST LAMP HTML Objective-C Software Development OOP AJAX Subversion Apache MVC CMS Performance Tuning Front-end Development Web Standards Linux Agile YUI Canvas HTML5 See 23+     See less HTML 5 jQuery JavaScript Ember.js Web Applications Nodejs Front-end Compass SASS CSS Advanced CSS PHP Agile Methodologies Node.js Web Development MySQL Mobile Applications WordPress JSON REST LAMP HTML Objective-C Software Development OOP AJAX Subversion Apache MVC CMS Performance Tuning Front-end Development Web Standards Linux Agile YUI Canvas HTML5 See 23+     See less Education San Diego Mesa College Computer Science 2007  – 2008 Cabrillo College Philosophy San Diego Mesa College Computer Science 2007  – 2008 San Diego Mesa College Computer Science 2007  – 2008 San Diego Mesa College Computer Science 2007  – 2008 Cabrillo College Philosophy Cabrillo College Philosophy Cabrillo College Philosophy Honors & Awards Yahoo! Super Star Award Yahoo! Inc. November 2012 I received a Yahoo! Super Star award for my work with IntoNow. Yahoo! Super Star Award Yahoo! Inc. November 2012 I received a Yahoo! Super Star award for my work with IntoNow. Yahoo! Super Star Award Yahoo! Inc. November 2012 I received a Yahoo! Super Star award for my work with IntoNow. Yahoo! Super Star Award Yahoo! Inc. November 2012 I received a Yahoo! Super Star award for my work with IntoNow. ", "Summary Sr. front-end engineer at Yahoo!, focusing on Search product. Front-end development using web technologies (JavaScript, YUI 3, CSS, HTML and PHP). Extensive experience in creating compelling user interfaces, reusable components and sophisticated tools for application developers. Summary Sr. front-end engineer at Yahoo!, focusing on Search product. Front-end development using web technologies (JavaScript, YUI 3, CSS, HTML and PHP). Extensive experience in creating compelling user interfaces, reusable components and sophisticated tools for application developers. Sr. front-end engineer at Yahoo!, focusing on Search product. Front-end development using web technologies (JavaScript, YUI 3, CSS, HTML and PHP). Extensive experience in creating compelling user interfaces, reusable components and sophisticated tools for application developers. Sr. front-end engineer at Yahoo!, focusing on Search product. Front-end development using web technologies (JavaScript, YUI 3, CSS, HTML and PHP). Extensive experience in creating compelling user interfaces, reusable components and sophisticated tools for application developers. Experience Senior Front End Engineer Yahoo! October 2011  – Present (3 years 11 months) Taiwan As front end technical lead for Yahoo! Local Search, created complex web-based user interfaces. I was brought on to help complete the transition to a rich user experience Yahoo! Local Search that featured increased JavaScript and Ajax interactions. Front End Engineer Yahoo! December 2009  –  October 2011  (1 year 11 months) Taiwan In this front-line role, I worked on several international Yahoo! Search projects. Used HTML, CSS, JavaScript and XML to design new functionality. Led research, development, and evaluation of new client-side technologies for use in our web applications. Senior Engineer Shinewave International Inc. October 2008  –  December 2009  (1 year 3 months) Taiwan IBM Alliance Project Office Intern ZyXEL October 2005  –  August 2007  (1 year 11 months) Hsinchu, Taiwan Assistant in General Manager Office.  \n♦ Writing report of government procurement.  \n♦ Marketing intelligence daily report. \n♦ Potential wireless technology valuation. \n♦ Build internal Blog and Wiki system. Intern National Credit Card Center of R.O.C. September 2003  –  January 2005  (1 year 5 months) Taiwan Call center Senior Front End Engineer Yahoo! October 2011  – Present (3 years 11 months) Taiwan As front end technical lead for Yahoo! Local Search, created complex web-based user interfaces. I was brought on to help complete the transition to a rich user experience Yahoo! Local Search that featured increased JavaScript and Ajax interactions. Senior Front End Engineer Yahoo! October 2011  – Present (3 years 11 months) Taiwan As front end technical lead for Yahoo! Local Search, created complex web-based user interfaces. I was brought on to help complete the transition to a rich user experience Yahoo! Local Search that featured increased JavaScript and Ajax interactions. Front End Engineer Yahoo! December 2009  –  October 2011  (1 year 11 months) Taiwan In this front-line role, I worked on several international Yahoo! Search projects. Used HTML, CSS, JavaScript and XML to design new functionality. Led research, development, and evaluation of new client-side technologies for use in our web applications. Front End Engineer Yahoo! December 2009  –  October 2011  (1 year 11 months) Taiwan In this front-line role, I worked on several international Yahoo! Search projects. Used HTML, CSS, JavaScript and XML to design new functionality. Led research, development, and evaluation of new client-side technologies for use in our web applications. Senior Engineer Shinewave International Inc. October 2008  –  December 2009  (1 year 3 months) Taiwan IBM Alliance Project Office Senior Engineer Shinewave International Inc. October 2008  –  December 2009  (1 year 3 months) Taiwan IBM Alliance Project Office Intern ZyXEL October 2005  –  August 2007  (1 year 11 months) Hsinchu, Taiwan Assistant in General Manager Office.  \n♦ Writing report of government procurement.  \n♦ Marketing intelligence daily report. \n♦ Potential wireless technology valuation. \n♦ Build internal Blog and Wiki system. Intern ZyXEL October 2005  –  August 2007  (1 year 11 months) Hsinchu, Taiwan Assistant in General Manager Office.  \n♦ Writing report of government procurement.  \n♦ Marketing intelligence daily report. \n♦ Potential wireless technology valuation. \n♦ Build internal Blog and Wiki system. Intern National Credit Card Center of R.O.C. September 2003  –  January 2005  (1 year 5 months) Taiwan Call center Intern National Credit Card Center of R.O.C. September 2003  –  January 2005  (1 year 5 months) Taiwan Call center Languages English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills JavaScript CSS PHP HTML YUI jQuery Node.js Python Skills  JavaScript CSS PHP HTML YUI jQuery Node.js Python JavaScript CSS PHP HTML YUI jQuery Node.js Python JavaScript CSS PHP HTML YUI jQuery Node.js Python Education National Tsing Hua University MS,  Technology Management 2005  – 2007 National Tsing Hua University SOC Business Management Program 2005  – 2007 National Tsing Hua University Intellectual Property and Patent Program 2005  – 2007 National Taipei University BS,  Business Administration 2001  – 2005 National Tsing Hua University MS,  Technology Management 2005  – 2007 National Tsing Hua University MS,  Technology Management 2005  – 2007 National Tsing Hua University MS,  Technology Management 2005  – 2007 National Tsing Hua University SOC Business Management Program 2005  – 2007 National Tsing Hua University SOC Business Management Program 2005  – 2007 National Tsing Hua University SOC Business Management Program 2005  – 2007 National Tsing Hua University Intellectual Property and Patent Program 2005  – 2007 National Tsing Hua University Intellectual Property and Patent Program 2005  – 2007 National Tsing Hua University Intellectual Property and Patent Program 2005  – 2007 National Taipei University BS,  Business Administration 2001  – 2005 National Taipei University BS,  Business Administration 2001  – 2005 National Taipei University BS,  Business Administration 2001  – 2005 Honors & Awards Web 2.0 Innovative Service Campaign Ministry of Economic Affairs, R.O.C April 2007 The Best Web Service Nomination Award GlobalTic Talentrepreneur Award & Forum July 2007 Web 2.0 Innovative Service Campaign Ministry of Economic Affairs, R.O.C April 2007 Web 2.0 Innovative Service Campaign Ministry of Economic Affairs, R.O.C April 2007 Web 2.0 Innovative Service Campaign Ministry of Economic Affairs, R.O.C April 2007 The Best Web Service Nomination Award GlobalTic Talentrepreneur Award & Forum July 2007 The Best Web Service Nomination Award GlobalTic Talentrepreneur Award & Forum July 2007 The Best Web Service Nomination Award GlobalTic Talentrepreneur Award & Forum July 2007 ", "Summary I work as a UI Engineer Manager by day developing web applications using frameworks such as AngularJS with bootstrap. My background is focused around strong fundamentals in HTML, CSS, and JavaScript. More recently I have done quite a bit of work with real time data over websockets, and visualizing large live record sets utilizing many different charting libraries from flot, highcharts, D3 etc. Summary I work as a UI Engineer Manager by day developing web applications using frameworks such as AngularJS with bootstrap. My background is focused around strong fundamentals in HTML, CSS, and JavaScript. More recently I have done quite a bit of work with real time data over websockets, and visualizing large live record sets utilizing many different charting libraries from flot, highcharts, D3 etc. I work as a UI Engineer Manager by day developing web applications using frameworks such as AngularJS with bootstrap. My background is focused around strong fundamentals in HTML, CSS, and JavaScript. More recently I have done quite a bit of work with real time data over websockets, and visualizing large live record sets utilizing many different charting libraries from flot, highcharts, D3 etc. I work as a UI Engineer Manager by day developing web applications using frameworks such as AngularJS with bootstrap. My background is focused around strong fundamentals in HTML, CSS, and JavaScript. More recently I have done quite a bit of work with real time data over websockets, and visualizing large live record sets utilizing many different charting libraries from flot, highcharts, D3 etc. Experience Engineering Manager Netflix September 2014  – Present (1 year) Los Gatos I manage a team that focuses on the UI for Netflix's Partner Tools. We build the tools that validate a device is up to Netflix's standards. This is done through a cloud based automation suite that is backed by a custom CRM, web analytics and client/device side Javascript. Sr. Front End Engineer Netflix July 2013  – Present (2 years 2 months) Los Gatos I work on the following systems within the Partner Tools Organization:  \n- Analytics - Allow users to quickly see trends in millions of records of test data that is cross referenced across several databases through real time analytics. \n- Netflix Test Studio - an RIA that provides powerful Client Automation and device testing. This application enables hundreds of devices to be tested from anywhere in the world. \n- Client Automation - working with the Production UI and Client Application teams we build embedded JS components to enable remote testing and automation. \n- Partner Device Portal - A comprehensive CRM system that provides administrative interfaces for the settings and properties of all devices in Netflix. This system serves as the gateway for all devices into Netflix. \n \nPrimary development is done with AngularJS, Bootstrap, and varies other plugins. We also do work with ExtJS and write several cross functional libraries in raw JavaScript. Sr. UI Engineer Skybox Imaging January 2012  –  July 2013  (1 year 7 months) Mountain View -Developed the architecture for an event driven JavaScript platform to display satellite and ground station telemetry in near real time. Spoke at jQuery Conf 12 about this architecture: http://www.youtube.com/watch?v=RaZaLCbfF-Q \n-Built a web application that reads in an engineering schematic in SVG and allows engineers to associate real time space craft data to quick diagnose the state of the system. \n-Worked with google maps api for the display of satellite imagery. \n-Created a SQL autocomplete application as an engineer's interface to satellite data. \n-Utilized real time technologies such as Websockets and previously comet for the streaming of critical data. Sr. UI Engineer Netflix September 2011  –  December 2011  (4 months) San Jose Area I was hired to help develop a PHP platform and was laid off with the majority of my team during the Qwikster customer fallout. Digital Operations Lead Conde Nast March 2011  –  September 2011  (7 months) I served as a technical product manager to help envision, architect and provide engineering guidance for online products. Sr. Front End Engineer Yahoo! September 2010  –  April 2011  (8 months) Front End Engineer Yahoo! Inc. August 2007  –  September 2010  (3 years 2 months) Web Developer - Consultant Artemis Solutions Group August 2005  –  August 2007  (2 years 1 month) Student Web Programmer and Computer Tech Michigan State University 2003  –  2006  (3 years) Engineering Manager Netflix September 2014  – Present (1 year) Los Gatos I manage a team that focuses on the UI for Netflix's Partner Tools. We build the tools that validate a device is up to Netflix's standards. This is done through a cloud based automation suite that is backed by a custom CRM, web analytics and client/device side Javascript. Engineering Manager Netflix September 2014  – Present (1 year) Los Gatos I manage a team that focuses on the UI for Netflix's Partner Tools. We build the tools that validate a device is up to Netflix's standards. This is done through a cloud based automation suite that is backed by a custom CRM, web analytics and client/device side Javascript. Sr. Front End Engineer Netflix July 2013  – Present (2 years 2 months) Los Gatos I work on the following systems within the Partner Tools Organization:  \n- Analytics - Allow users to quickly see trends in millions of records of test data that is cross referenced across several databases through real time analytics. \n- Netflix Test Studio - an RIA that provides powerful Client Automation and device testing. This application enables hundreds of devices to be tested from anywhere in the world. \n- Client Automation - working with the Production UI and Client Application teams we build embedded JS components to enable remote testing and automation. \n- Partner Device Portal - A comprehensive CRM system that provides administrative interfaces for the settings and properties of all devices in Netflix. This system serves as the gateway for all devices into Netflix. \n \nPrimary development is done with AngularJS, Bootstrap, and varies other plugins. We also do work with ExtJS and write several cross functional libraries in raw JavaScript. Sr. Front End Engineer Netflix July 2013  – Present (2 years 2 months) Los Gatos I work on the following systems within the Partner Tools Organization:  \n- Analytics - Allow users to quickly see trends in millions of records of test data that is cross referenced across several databases through real time analytics. \n- Netflix Test Studio - an RIA that provides powerful Client Automation and device testing. This application enables hundreds of devices to be tested from anywhere in the world. \n- Client Automation - working with the Production UI and Client Application teams we build embedded JS components to enable remote testing and automation. \n- Partner Device Portal - A comprehensive CRM system that provides administrative interfaces for the settings and properties of all devices in Netflix. This system serves as the gateway for all devices into Netflix. \n \nPrimary development is done with AngularJS, Bootstrap, and varies other plugins. We also do work with ExtJS and write several cross functional libraries in raw JavaScript. Sr. UI Engineer Skybox Imaging January 2012  –  July 2013  (1 year 7 months) Mountain View -Developed the architecture for an event driven JavaScript platform to display satellite and ground station telemetry in near real time. Spoke at jQuery Conf 12 about this architecture: http://www.youtube.com/watch?v=RaZaLCbfF-Q \n-Built a web application that reads in an engineering schematic in SVG and allows engineers to associate real time space craft data to quick diagnose the state of the system. \n-Worked with google maps api for the display of satellite imagery. \n-Created a SQL autocomplete application as an engineer's interface to satellite data. \n-Utilized real time technologies such as Websockets and previously comet for the streaming of critical data. Sr. UI Engineer Skybox Imaging January 2012  –  July 2013  (1 year 7 months) Mountain View -Developed the architecture for an event driven JavaScript platform to display satellite and ground station telemetry in near real time. Spoke at jQuery Conf 12 about this architecture: http://www.youtube.com/watch?v=RaZaLCbfF-Q \n-Built a web application that reads in an engineering schematic in SVG and allows engineers to associate real time space craft data to quick diagnose the state of the system. \n-Worked with google maps api for the display of satellite imagery. \n-Created a SQL autocomplete application as an engineer's interface to satellite data. \n-Utilized real time technologies such as Websockets and previously comet for the streaming of critical data. Sr. UI Engineer Netflix September 2011  –  December 2011  (4 months) San Jose Area I was hired to help develop a PHP platform and was laid off with the majority of my team during the Qwikster customer fallout. Sr. UI Engineer Netflix September 2011  –  December 2011  (4 months) San Jose Area I was hired to help develop a PHP platform and was laid off with the majority of my team during the Qwikster customer fallout. Digital Operations Lead Conde Nast March 2011  –  September 2011  (7 months) I served as a technical product manager to help envision, architect and provide engineering guidance for online products. Digital Operations Lead Conde Nast March 2011  –  September 2011  (7 months) I served as a technical product manager to help envision, architect and provide engineering guidance for online products. Sr. Front End Engineer Yahoo! September 2010  –  April 2011  (8 months) Sr. Front End Engineer Yahoo! September 2010  –  April 2011  (8 months) Front End Engineer Yahoo! Inc. August 2007  –  September 2010  (3 years 2 months) Front End Engineer Yahoo! Inc. August 2007  –  September 2010  (3 years 2 months) Web Developer - Consultant Artemis Solutions Group August 2005  –  August 2007  (2 years 1 month) Web Developer - Consultant Artemis Solutions Group August 2005  –  August 2007  (2 years 1 month) Student Web Programmer and Computer Tech Michigan State University 2003  –  2006  (3 years) Student Web Programmer and Computer Tech Michigan State University 2003  –  2006  (3 years) Skills HTML 5 JavaScript YUI jQuery User Experience CSS PHP Web Applications Front-end SQL Agile Methodologies User Interface Usability Testing Software Development Java Mobile Applications Linux Apache Web Development HTML MySQL Programming REST Databases See 9+     See less Skills  HTML 5 JavaScript YUI jQuery User Experience CSS PHP Web Applications Front-end SQL Agile Methodologies User Interface Usability Testing Software Development Java Mobile Applications Linux Apache Web Development HTML MySQL Programming REST Databases See 9+     See less HTML 5 JavaScript YUI jQuery User Experience CSS PHP Web Applications Front-end SQL Agile Methodologies User Interface Usability Testing Software Development Java Mobile Applications Linux Apache Web Development HTML MySQL Programming REST Databases See 9+     See less HTML 5 JavaScript YUI jQuery User Experience CSS PHP Web Applications Front-end SQL Agile Methodologies User Interface Usability Testing Software Development Java Mobile Applications Linux Apache Web Development HTML MySQL Programming REST Databases See 9+     See less Education Michigan State University BA,  Telecommunications Information Studies and Media 2003  – 2007 Michigan State University Michigan State University BA,  Telecommunications Information Studies and Media 2003  – 2007 Michigan State University BA,  Telecommunications Information Studies and Media 2003  – 2007 Michigan State University BA,  Telecommunications Information Studies and Media 2003  – 2007 Michigan State University Michigan State University Michigan State University Honors & Awards Additional Honors & Awards Skybox Imaging Hack Day Winner \n \nYahoo Hack Days: \n2010 ICE Hack Day Winner,  \n2010 Winter Hack Day Winner,  \n2009 Spring Hack Day Winner,  \n2008 Q3 Yahoo Media Hack Day Winner \n \nEditors Choice for 3d Printer Design Maker's Faire 2012 Additional Honors & Awards Skybox Imaging Hack Day Winner \n \nYahoo Hack Days: \n2010 ICE Hack Day Winner,  \n2010 Winter Hack Day Winner,  \n2009 Spring Hack Day Winner,  \n2008 Q3 Yahoo Media Hack Day Winner \n \nEditors Choice for 3d Printer Design Maker's Faire 2012 Additional Honors & Awards Skybox Imaging Hack Day Winner \n \nYahoo Hack Days: \n2010 ICE Hack Day Winner,  \n2010 Winter Hack Day Winner,  \n2009 Spring Hack Day Winner,  \n2008 Q3 Yahoo Media Hack Day Winner \n \nEditors Choice for 3d Printer Design Maker's Faire 2012 Additional Honors & Awards Skybox Imaging Hack Day Winner \n \nYahoo Hack Days: \n2010 ICE Hack Day Winner,  \n2010 Winter Hack Day Winner,  \n2009 Spring Hack Day Winner,  \n2008 Q3 Yahoo Media Hack Day Winner \n \nEditors Choice for 3d Printer Design Maker's Faire 2012 ", "Summary I don't know who you are. I don't know what you want. If you are looking for just another random programmer, I can tell you I don't have what you need. But what I do have are a very particular set of skills; skills I have acquired over a very long career. Skills that make me a nightmare for the competition. \n \nI have won the most number of Hack Days in Yahoo's history. I love all things about Hack Day. \n \nSpecialties: PHP, Architecture, Performance, Innovation, Product Management, Distributed Software Development, Prototyping, Front-end, User Experience, A/B Testing, Security, Search Engine Optimization, Mentoring, Internationalization, Globalization Summary I don't know who you are. I don't know what you want. If you are looking for just another random programmer, I can tell you I don't have what you need. But what I do have are a very particular set of skills; skills I have acquired over a very long career. Skills that make me a nightmare for the competition. \n \nI have won the most number of Hack Days in Yahoo's history. I love all things about Hack Day. \n \nSpecialties: PHP, Architecture, Performance, Innovation, Product Management, Distributed Software Development, Prototyping, Front-end, User Experience, A/B Testing, Security, Search Engine Optimization, Mentoring, Internationalization, Globalization I don't know who you are. I don't know what you want. If you are looking for just another random programmer, I can tell you I don't have what you need. But what I do have are a very particular set of skills; skills I have acquired over a very long career. Skills that make me a nightmare for the competition. \n \nI have won the most number of Hack Days in Yahoo's history. I love all things about Hack Day. \n \nSpecialties: PHP, Architecture, Performance, Innovation, Product Management, Distributed Software Development, Prototyping, Front-end, User Experience, A/B Testing, Security, Search Engine Optimization, Mentoring, Internationalization, Globalization I don't know who you are. I don't know what you want. If you are looking for just another random programmer, I can tell you I don't have what you need. But what I do have are a very particular set of skills; skills I have acquired over a very long career. Skills that make me a nightmare for the competition. \n \nI have won the most number of Hack Days in Yahoo's history. I love all things about Hack Day. \n \nSpecialties: PHP, Architecture, Performance, Innovation, Product Management, Distributed Software Development, Prototyping, Front-end, User Experience, A/B Testing, Security, Search Engine Optimization, Mentoring, Internationalization, Globalization Experience Hacker Yahoo August 2015  – Present (1 month) -Yahoo Mobile Search \n-Team Delta Force \n-Hack Council Member (May, 2014 - Present) \n-Yahoo For Good Council Member (Aug, 2014 - Present) Front-end Engineer Yahoo August 2007  –  August 2015  (8 years 1 month) -Yahoo Search Front-end team Web Application Developer University of Victoria 2002  –  2007  (5 years) -Wrote Mamook software system using PHP, Javascript, XHTML, CSS, MySQL, and PERL on a Linux platform. \n-Helped release the Mamook software system as open source software, and helped foster an open source community. Web Assistant (Co-op Internship) Department of National Defence August 2001  –  December 2001  (5 months) Classified Hacker Yahoo August 2015  – Present (1 month) -Yahoo Mobile Search \n-Team Delta Force \n-Hack Council Member (May, 2014 - Present) \n-Yahoo For Good Council Member (Aug, 2014 - Present) Hacker Yahoo August 2015  – Present (1 month) -Yahoo Mobile Search \n-Team Delta Force \n-Hack Council Member (May, 2014 - Present) \n-Yahoo For Good Council Member (Aug, 2014 - Present) Front-end Engineer Yahoo August 2007  –  August 2015  (8 years 1 month) -Yahoo Search Front-end team Front-end Engineer Yahoo August 2007  –  August 2015  (8 years 1 month) -Yahoo Search Front-end team Web Application Developer University of Victoria 2002  –  2007  (5 years) -Wrote Mamook software system using PHP, Javascript, XHTML, CSS, MySQL, and PERL on a Linux platform. \n-Helped release the Mamook software system as open source software, and helped foster an open source community. Web Application Developer University of Victoria 2002  –  2007  (5 years) -Wrote Mamook software system using PHP, Javascript, XHTML, CSS, MySQL, and PERL on a Linux platform. \n-Helped release the Mamook software system as open source software, and helped foster an open source community. Web Assistant (Co-op Internship) Department of National Defence August 2001  –  December 2001  (5 months) Classified Web Assistant (Co-op Internship) Department of National Defence August 2001  –  December 2001  (5 months) Classified Languages   Skills Skills     Education University of Victoria Master's Degree,  Computer Science 2005  – 2007 Research interests: software engineering, web applications, computer graphics, human computer interaction, user interfaces, and open source software development. \n \nMaster's Technical Project Topic − \"A Resume Template System for the Mamook Software System.\" Performed user studies and built a resume system with a plug-in architecture. This work was successfully defended in Feb 2007. University of Victoria Bachelor's Degree,  Computer Science 2000  – 2005 -Graduated with academic and co-op distinction \n-Business option (like a minor) \n-Completed 5 co-op work terms Pacific Christian School University of Victoria Master's Degree,  Computer Science 2005  – 2007 Research interests: software engineering, web applications, computer graphics, human computer interaction, user interfaces, and open source software development. \n \nMaster's Technical Project Topic − \"A Resume Template System for the Mamook Software System.\" Performed user studies and built a resume system with a plug-in architecture. This work was successfully defended in Feb 2007. University of Victoria Master's Degree,  Computer Science 2005  – 2007 Research interests: software engineering, web applications, computer graphics, human computer interaction, user interfaces, and open source software development. \n \nMaster's Technical Project Topic − \"A Resume Template System for the Mamook Software System.\" Performed user studies and built a resume system with a plug-in architecture. This work was successfully defended in Feb 2007. University of Victoria Master's Degree,  Computer Science 2005  – 2007 Research interests: software engineering, web applications, computer graphics, human computer interaction, user interfaces, and open source software development. \n \nMaster's Technical Project Topic − \"A Resume Template System for the Mamook Software System.\" Performed user studies and built a resume system with a plug-in architecture. This work was successfully defended in Feb 2007. University of Victoria Bachelor's Degree,  Computer Science 2000  – 2005 -Graduated with academic and co-op distinction \n-Business option (like a minor) \n-Completed 5 co-op work terms University of Victoria Bachelor's Degree,  Computer Science 2000  – 2005 -Graduated with academic and co-op distinction \n-Business option (like a minor) \n-Completed 5 co-op work terms University of Victoria Bachelor's Degree,  Computer Science 2000  – 2005 -Graduated with academic and co-op distinction \n-Business option (like a minor) \n-Completed 5 co-op work terms Pacific Christian School Pacific Christian School Pacific Christian School Honors & Awards Yahoo Patent Filing Milestone Yahoo June 2015 5th patent filed. Yahoo Q2 Hack Day Award, Tech For Good Category Yahoo June 2015 Yahoo Q1 Hack Day Finalist Yahoo February 2015 Yahoo Q4 Hack Day Finalist Yahoo November 2014 Yahoo Q3 Hack Day Award, Best Overall Hack Yahoo July 2014 Yahoo Q3 Hack Day Award, Consumer Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Tech For Good Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Best Intern Hack Yahoo July 2014 Yahoo Q2 Hack Day Award, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Consumer Category Yahoo May 2014 Yahoo Q4 Hack Day Award, Mobile Category Yahoo November 2013 Yahoo Q3 Hack Day Finalist, Outer Space Category Yahoo August 2013 Yahoo Q2 Hack Day Finalist, Search Category Yahoo May 2013 Yahoo Q1 Hack Day Finalist, Mobile Category Yahoo February 2013 Yahoo Q3 Hack Day Hacker's Choice Award Yahoo September 2012 Yahoo Q2 Hack Day Hacker's Choice Award Yahoo May 2012 Yahoo Q1 Hack Day Hacker's Choice Award Yahoo February 2012 Yahoo Q1 Hack Day Award, Design Category Yahoo February 2012 You Rock Team Award Yahoo 2009 Metro SERP Global Launch Superstar Team Award Yahoo 2008 Team Award for SearchMonkey launch, the top award from Yahoo. You Rock Team Award Yahoo 2008 Search Assist Global Launch UVIC President's Distinguished Service Award University of Victoria 2002 Team Award for Innovation (http://ring.uvic.ca/03jan09/awards.html) Yahoo Patent Filing Milestone Yahoo June 2015 5th patent filed. Yahoo Patent Filing Milestone Yahoo June 2015 5th patent filed. Yahoo Patent Filing Milestone Yahoo June 2015 5th patent filed. Yahoo Q2 Hack Day Award, Tech For Good Category Yahoo June 2015 Yahoo Q2 Hack Day Award, Tech For Good Category Yahoo June 2015 Yahoo Q2 Hack Day Award, Tech For Good Category Yahoo June 2015 Yahoo Q1 Hack Day Finalist Yahoo February 2015 Yahoo Q1 Hack Day Finalist Yahoo February 2015 Yahoo Q1 Hack Day Finalist Yahoo February 2015 Yahoo Q4 Hack Day Finalist Yahoo November 2014 Yahoo Q4 Hack Day Finalist Yahoo November 2014 Yahoo Q4 Hack Day Finalist Yahoo November 2014 Yahoo Q3 Hack Day Award, Best Overall Hack Yahoo July 2014 Yahoo Q3 Hack Day Award, Best Overall Hack Yahoo July 2014 Yahoo Q3 Hack Day Award, Best Overall Hack Yahoo July 2014 Yahoo Q3 Hack Day Award, Consumer Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Consumer Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Consumer Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Tech For Good Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Tech For Good Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Tech For Good Category Yahoo July 2014 Yahoo Q3 Hack Day Award, Best Intern Hack Yahoo July 2014 Yahoo Q3 Hack Day Award, Best Intern Hack Yahoo July 2014 Yahoo Q3 Hack Day Award, Best Intern Hack Yahoo July 2014 Yahoo Q2 Hack Day Award, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Award, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Award, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Greater Good Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Consumer Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Consumer Category Yahoo May 2014 Yahoo Q2 Hack Day Finalist, Consumer Category Yahoo May 2014 Yahoo Q4 Hack Day Award, Mobile Category Yahoo November 2013 Yahoo Q4 Hack Day Award, Mobile Category Yahoo November 2013 Yahoo Q4 Hack Day Award, Mobile Category Yahoo November 2013 Yahoo Q3 Hack Day Finalist, Outer Space Category Yahoo August 2013 Yahoo Q3 Hack Day Finalist, Outer Space Category Yahoo August 2013 Yahoo Q3 Hack Day Finalist, Outer Space Category Yahoo August 2013 Yahoo Q2 Hack Day Finalist, Search Category Yahoo May 2013 Yahoo Q2 Hack Day Finalist, Search Category Yahoo May 2013 Yahoo Q2 Hack Day Finalist, Search Category Yahoo May 2013 Yahoo Q1 Hack Day Finalist, Mobile Category Yahoo February 2013 Yahoo Q1 Hack Day Finalist, Mobile Category Yahoo February 2013 Yahoo Q1 Hack Day Finalist, Mobile Category Yahoo February 2013 Yahoo Q3 Hack Day Hacker's Choice Award Yahoo September 2012 Yahoo Q3 Hack Day Hacker's Choice Award Yahoo September 2012 Yahoo Q3 Hack Day Hacker's Choice Award Yahoo September 2012 Yahoo Q2 Hack Day Hacker's Choice Award Yahoo May 2012 Yahoo Q2 Hack Day Hacker's Choice Award Yahoo May 2012 Yahoo Q2 Hack Day Hacker's Choice Award Yahoo May 2012 Yahoo Q1 Hack Day Hacker's Choice Award Yahoo February 2012 Yahoo Q1 Hack Day Hacker's Choice Award Yahoo February 2012 Yahoo Q1 Hack Day Hacker's Choice Award Yahoo February 2012 Yahoo Q1 Hack Day Award, Design Category Yahoo February 2012 Yahoo Q1 Hack Day Award, Design Category Yahoo February 2012 Yahoo Q1 Hack Day Award, Design Category Yahoo February 2012 You Rock Team Award Yahoo 2009 Metro SERP Global Launch You Rock Team Award Yahoo 2009 Metro SERP Global Launch You Rock Team Award Yahoo 2009 Metro SERP Global Launch Superstar Team Award Yahoo 2008 Team Award for SearchMonkey launch, the top award from Yahoo. Superstar Team Award Yahoo 2008 Team Award for SearchMonkey launch, the top award from Yahoo. Superstar Team Award Yahoo 2008 Team Award for SearchMonkey launch, the top award from Yahoo. You Rock Team Award Yahoo 2008 Search Assist Global Launch You Rock Team Award Yahoo 2008 Search Assist Global Launch You Rock Team Award Yahoo 2008 Search Assist Global Launch UVIC President's Distinguished Service Award University of Victoria 2002 Team Award for Innovation (http://ring.uvic.ca/03jan09/awards.html) UVIC President's Distinguished Service Award University of Victoria 2002 Team Award for Innovation (http://ring.uvic.ca/03jan09/awards.html) UVIC President's Distinguished Service Award University of Victoria 2002 Team Award for Innovation (http://ring.uvic.ca/03jan09/awards.html) ", "Summary I mostly create things inside web browsers. I specialize in HTML, CSS and JavaScript (Backbone, Ember, React, d3) but I've also done a lot of other random stuff, here and there. \n \nDisclaimer: No formal CS education :-) Summary I mostly create things inside web browsers. I specialize in HTML, CSS and JavaScript (Backbone, Ember, React, d3) but I've also done a lot of other random stuff, here and there. \n \nDisclaimer: No formal CS education :-) I mostly create things inside web browsers. I specialize in HTML, CSS and JavaScript (Backbone, Ember, React, d3) but I've also done a lot of other random stuff, here and there. \n \nDisclaimer: No formal CS education :-) I mostly create things inside web browsers. I specialize in HTML, CSS and JavaScript (Backbone, Ember, React, d3) but I've also done a lot of other random stuff, here and there. \n \nDisclaimer: No formal CS education :-) Experience Front-End Engineer Yahoo, Homepage and Verticals November 2014  – Present (10 months) San Francisco, CA I work on Yahoo's next generation content creation and publishing. \n \n- Concept and development of \"Isomorphic\" React on Tumblr Theme \n- Yahoo Style Victoria's Secret Fashion Show Live Blog \n- Yahoo Sports Contributors Front-End Engineer Yahoo, Ads & Data October 2013  –  November 2014  (1 year 2 months) Sunnyvale, CA Worked on the development of Yahoo Ad Manager Plus, while at the same time helping to support and build out the organization's front-end technology stack based on Ember JS and a new design language. \n \n- Main developer of Ember components, which are in use by multiple teams and consumed using bower over our internal enterprise GitHub instance. Due to the nature of building an ad platform, many components had to be capable of gracefully handling very large amounts of data e.g. displaying thousands of zip codes being targeted in a single form field \n \n- Built and helped to design a living style guide for the organization's design language, which serves as a reference for use by both designers and developers, including the Yahoo Gemini team \n \n- Made some super custom d3 based charts and tools for Yahoo Audiences Front-End Engineer, Founding Team Bread (acquired by Yahoo) November 2010  –  October 2013  (3 years) San Francisco, CA I was the first hire and full time engineer. \n \nSome highlights of my work at at Bread: \n \n- Built the logged in site, a single page app that included: a widget-based drag-and-drop advertisement editor, a link shortening and management tool, heavy Facebook and Twitter integration as well as all account management UIs. Built using Backbone, Marionette, RequireJS, jQuery, Compass/SASS and grunt. \n \n- Interstitial development: public facing page designed to display ads and track detailed analytics while leaving only a minimal size and performance footprint (it had a lot of traffic). Built using native/barebones JavaScript and optimized stylesheets, offloaded to CloudFront. \n \n- Developed the Ad snippet code that allowed publishers to dynamically convert all the links on their site into shortened \"bre.ad links\" and alternatively to simply display an ad directly on their site based on referrer data. Built using native JavaScript, JSONP and easyXDM (for cross domain messaging). \n \nIn October 2013, Bread was acquired by Yahoo. Front-End Developer SolutionSet September 2008  –  November 2010  (2 years 3 months) Palo Alto, CA - Create websites using HTML and CSS based on provided designs \n- Rapidly prototype pages and individual features from wireframes  \n- Frontend templating with PHP, Java (Freemarker), .Net, and ColdFusion \n- Troubleshoot CSS issues on existing websites \n- Lots and lots of JavaScript \n \nA few clients I worked with: \nApple, Better Place, California Lottery, Chevron, Chronicle Books, Cisco, Duke University, eBay, Endicia, Flickr, Genentech, IT Business Edge, Nordstrom, PayPal, Revinate, SFBIG, Thales, Wells Fargo and Yahoo! Web Producer Stanford University School of Medicine May 2008  –  August 2008  (4 months) Menlo Park, CA • Assisted with a total redesign of the Stanford School of Medicine website, consisting of over 350 different sites. Web Design Intern University of the Pacific (Marketing & Relations) September 2005  –  March 2006  (7 months) - Worked on a variety of web development projects, including CMS implementations as well as a web re-design for the University’s main website \n- Helped coordinate with the different departments and schools at Pacific to include their content in a way that conformed with the branding guidelines Front-End Engineer Yahoo, Homepage and Verticals November 2014  – Present (10 months) San Francisco, CA I work on Yahoo's next generation content creation and publishing. \n \n- Concept and development of \"Isomorphic\" React on Tumblr Theme \n- Yahoo Style Victoria's Secret Fashion Show Live Blog \n- Yahoo Sports Contributors Front-End Engineer Yahoo, Homepage and Verticals November 2014  – Present (10 months) San Francisco, CA I work on Yahoo's next generation content creation and publishing. \n \n- Concept and development of \"Isomorphic\" React on Tumblr Theme \n- Yahoo Style Victoria's Secret Fashion Show Live Blog \n- Yahoo Sports Contributors Front-End Engineer Yahoo, Ads & Data October 2013  –  November 2014  (1 year 2 months) Sunnyvale, CA Worked on the development of Yahoo Ad Manager Plus, while at the same time helping to support and build out the organization's front-end technology stack based on Ember JS and a new design language. \n \n- Main developer of Ember components, which are in use by multiple teams and consumed using bower over our internal enterprise GitHub instance. Due to the nature of building an ad platform, many components had to be capable of gracefully handling very large amounts of data e.g. displaying thousands of zip codes being targeted in a single form field \n \n- Built and helped to design a living style guide for the organization's design language, which serves as a reference for use by both designers and developers, including the Yahoo Gemini team \n \n- Made some super custom d3 based charts and tools for Yahoo Audiences Front-End Engineer Yahoo, Ads & Data October 2013  –  November 2014  (1 year 2 months) Sunnyvale, CA Worked on the development of Yahoo Ad Manager Plus, while at the same time helping to support and build out the organization's front-end technology stack based on Ember JS and a new design language. \n \n- Main developer of Ember components, which are in use by multiple teams and consumed using bower over our internal enterprise GitHub instance. Due to the nature of building an ad platform, many components had to be capable of gracefully handling very large amounts of data e.g. displaying thousands of zip codes being targeted in a single form field \n \n- Built and helped to design a living style guide for the organization's design language, which serves as a reference for use by both designers and developers, including the Yahoo Gemini team \n \n- Made some super custom d3 based charts and tools for Yahoo Audiences Front-End Engineer, Founding Team Bread (acquired by Yahoo) November 2010  –  October 2013  (3 years) San Francisco, CA I was the first hire and full time engineer. \n \nSome highlights of my work at at Bread: \n \n- Built the logged in site, a single page app that included: a widget-based drag-and-drop advertisement editor, a link shortening and management tool, heavy Facebook and Twitter integration as well as all account management UIs. Built using Backbone, Marionette, RequireJS, jQuery, Compass/SASS and grunt. \n \n- Interstitial development: public facing page designed to display ads and track detailed analytics while leaving only a minimal size and performance footprint (it had a lot of traffic). Built using native/barebones JavaScript and optimized stylesheets, offloaded to CloudFront. \n \n- Developed the Ad snippet code that allowed publishers to dynamically convert all the links on their site into shortened \"bre.ad links\" and alternatively to simply display an ad directly on their site based on referrer data. Built using native JavaScript, JSONP and easyXDM (for cross domain messaging). \n \nIn October 2013, Bread was acquired by Yahoo. Front-End Engineer, Founding Team Bread (acquired by Yahoo) November 2010  –  October 2013  (3 years) San Francisco, CA I was the first hire and full time engineer. \n \nSome highlights of my work at at Bread: \n \n- Built the logged in site, a single page app that included: a widget-based drag-and-drop advertisement editor, a link shortening and management tool, heavy Facebook and Twitter integration as well as all account management UIs. Built using Backbone, Marionette, RequireJS, jQuery, Compass/SASS and grunt. \n \n- Interstitial development: public facing page designed to display ads and track detailed analytics while leaving only a minimal size and performance footprint (it had a lot of traffic). Built using native/barebones JavaScript and optimized stylesheets, offloaded to CloudFront. \n \n- Developed the Ad snippet code that allowed publishers to dynamically convert all the links on their site into shortened \"bre.ad links\" and alternatively to simply display an ad directly on their site based on referrer data. Built using native JavaScript, JSONP and easyXDM (for cross domain messaging). \n \nIn October 2013, Bread was acquired by Yahoo. Front-End Developer SolutionSet September 2008  –  November 2010  (2 years 3 months) Palo Alto, CA - Create websites using HTML and CSS based on provided designs \n- Rapidly prototype pages and individual features from wireframes  \n- Frontend templating with PHP, Java (Freemarker), .Net, and ColdFusion \n- Troubleshoot CSS issues on existing websites \n- Lots and lots of JavaScript \n \nA few clients I worked with: \nApple, Better Place, California Lottery, Chevron, Chronicle Books, Cisco, Duke University, eBay, Endicia, Flickr, Genentech, IT Business Edge, Nordstrom, PayPal, Revinate, SFBIG, Thales, Wells Fargo and Yahoo! Front-End Developer SolutionSet September 2008  –  November 2010  (2 years 3 months) Palo Alto, CA - Create websites using HTML and CSS based on provided designs \n- Rapidly prototype pages and individual features from wireframes  \n- Frontend templating with PHP, Java (Freemarker), .Net, and ColdFusion \n- Troubleshoot CSS issues on existing websites \n- Lots and lots of JavaScript \n \nA few clients I worked with: \nApple, Better Place, California Lottery, Chevron, Chronicle Books, Cisco, Duke University, eBay, Endicia, Flickr, Genentech, IT Business Edge, Nordstrom, PayPal, Revinate, SFBIG, Thales, Wells Fargo and Yahoo! Web Producer Stanford University School of Medicine May 2008  –  August 2008  (4 months) Menlo Park, CA • Assisted with a total redesign of the Stanford School of Medicine website, consisting of over 350 different sites. Web Producer Stanford University School of Medicine May 2008  –  August 2008  (4 months) Menlo Park, CA • Assisted with a total redesign of the Stanford School of Medicine website, consisting of over 350 different sites. Web Design Intern University of the Pacific (Marketing & Relations) September 2005  –  March 2006  (7 months) - Worked on a variety of web development projects, including CMS implementations as well as a web re-design for the University’s main website \n- Helped coordinate with the different departments and schools at Pacific to include their content in a way that conformed with the branding guidelines Web Design Intern University of the Pacific (Marketing & Relations) September 2005  –  March 2006  (7 months) - Worked on a variety of web development projects, including CMS implementations as well as a web re-design for the University’s main website \n- Helped coordinate with the different departments and schools at Pacific to include their content in a way that conformed with the branding guidelines Skills Wordpress CSS jQuery JavaScript Drupal HTML Cross-browser... SASS YUI MODx Silverstripe CoffeeScript Backbone.js Fantasy Football Git Compass REST User Experience HTML 5 Web Design Photoshop JSON Subversion Front-end Web Applications Web Standards AJAX Information Architecture Graphic Design SEO WordPress MVC Web Development User Interface Apache Advanced CSS CSS3 CMS XHTML LAMP Social Media HTML5 See 27+     See less Skills  Wordpress CSS jQuery JavaScript Drupal HTML Cross-browser... SASS YUI MODx Silverstripe CoffeeScript Backbone.js Fantasy Football Git Compass REST User Experience HTML 5 Web Design Photoshop JSON Subversion Front-end Web Applications Web Standards AJAX Information Architecture Graphic Design SEO WordPress MVC Web Development User Interface Apache Advanced CSS CSS3 CMS XHTML LAMP Social Media HTML5 See 27+     See less Wordpress CSS jQuery JavaScript Drupal HTML Cross-browser... SASS YUI MODx Silverstripe CoffeeScript Backbone.js Fantasy Football Git Compass REST User Experience HTML 5 Web Design Photoshop JSON Subversion Front-end Web Applications Web Standards AJAX Information Architecture Graphic Design SEO WordPress MVC Web Development User Interface Apache Advanced CSS CSS3 CMS XHTML LAMP Social Media HTML5 See 27+     See less Wordpress CSS jQuery JavaScript Drupal HTML Cross-browser... SASS YUI MODx Silverstripe CoffeeScript Backbone.js Fantasy Football Git Compass REST User Experience HTML 5 Web Design Photoshop JSON Subversion Front-end Web Applications Web Standards AJAX Information Architecture Graphic Design SEO WordPress MVC Web Development User Interface Apache Advanced CSS CSS3 CMS XHTML LAMP Social Media HTML5 See 27+     See less Education University of the Pacific Business Administration,  Marketing 2004  – 2008 I think I'm still an art class or two short of graduating. University of the Pacific Business Administration,  Marketing 2004  – 2008 I think I'm still an art class or two short of graduating. University of the Pacific Business Administration,  Marketing 2004  – 2008 I think I'm still an art class or two short of graduating. University of the Pacific Business Administration,  Marketing 2004  – 2008 I think I'm still an art class or two short of graduating. ", "Experience Front-End Engineer / Widgeteer Pinterest February 2012  – Present (3 years 7 months) San Francisco, CA Front-End Engineer Lexity (formerly Vurve) October 2010  –  February 2012  (1 year 5 months) Mountain View, CA Senior Front-End Engineer Netflix March 2009  –  October 2010  (1 year 8 months) Technology Evangelist and Front-End Engineer Yahoo! August 2004  –  March 2009  (4 years 8 months) Sunnyvale, CA Director of Electronic Communications WebMD Practice Management June 1984  –  March 2003  (18 years 10 months) Front-End Engineer / Widgeteer Pinterest February 2012  – Present (3 years 7 months) San Francisco, CA Front-End Engineer / Widgeteer Pinterest February 2012  – Present (3 years 7 months) San Francisco, CA Front-End Engineer Lexity (formerly Vurve) October 2010  –  February 2012  (1 year 5 months) Mountain View, CA Front-End Engineer Lexity (formerly Vurve) October 2010  –  February 2012  (1 year 5 months) Mountain View, CA Senior Front-End Engineer Netflix March 2009  –  October 2010  (1 year 8 months) Senior Front-End Engineer Netflix March 2009  –  October 2010  (1 year 8 months) Technology Evangelist and Front-End Engineer Yahoo! August 2004  –  March 2009  (4 years 8 months) Sunnyvale, CA Technology Evangelist and Front-End Engineer Yahoo! August 2004  –  March 2009  (4 years 8 months) Sunnyvale, CA Director of Electronic Communications WebMD Practice Management June 1984  –  March 2003  (18 years 10 months) Director of Electronic Communications WebMD Practice Management June 1984  –  March 2003  (18 years 10 months) Skills CSS JavaScript Front-end User Experience HTML 5 YUI Web Standards APIs HTML Web 2.0 Git DOM Mobile Applications User Interface Node.js Ruby on Rails Web Applications Databases AJAX Web Development HTML5 Chickens See 7+     See less Skills  CSS JavaScript Front-end User Experience HTML 5 YUI Web Standards APIs HTML Web 2.0 Git DOM Mobile Applications User Interface Node.js Ruby on Rails Web Applications Databases AJAX Web Development HTML5 Chickens See 7+     See less CSS JavaScript Front-end User Experience HTML 5 YUI Web Standards APIs HTML Web 2.0 Git DOM Mobile Applications User Interface Node.js Ruby on Rails Web Applications Databases AJAX Web Development HTML5 Chickens See 7+     See less CSS JavaScript Front-end User Experience HTML 5 YUI Web Standards APIs HTML Web 2.0 Git DOM Mobile Applications User Interface Node.js Ruby on Rails Web Applications Databases AJAX Web Development HTML5 Chickens See 7+     See less Honors & Awards City Frisbee Champion, Boys 10-12 Sunnyvale Parks & Recreation Department August 1973 Additional Honors & Awards Nebula Award nominee for Best Short Story, 1994 \nHugo Award nominee for Best Semiprozine, 1997-2003 City Frisbee Champion, Boys 10-12 Sunnyvale Parks & Recreation Department August 1973 City Frisbee Champion, Boys 10-12 Sunnyvale Parks & Recreation Department August 1973 City Frisbee Champion, Boys 10-12 Sunnyvale Parks & Recreation Department August 1973 Additional Honors & Awards Nebula Award nominee for Best Short Story, 1994 \nHugo Award nominee for Best Semiprozine, 1997-2003 Additional Honors & Awards Nebula Award nominee for Best Short Story, 1994 \nHugo Award nominee for Best Semiprozine, 1997-2003 Additional Honors & Awards Nebula Award nominee for Best Short Story, 1994 \nHugo Award nominee for Best Semiprozine, 1997-2003 ", "Summary I'm a technologist and a builder of teams determined to build awesome experiences. \n \nThis quest and ambition has taken me from sales at Dell, to Tech Support and ecommerce consulting at Yahoo! to now partnering with amazing people and companies to develop innovative web applications and games. I'm currently partnered with a start up in Boulder Colorado leading and building small teams focused on jaavascript application and game development. \n \nCurrently my primary language focuses and interests are: html5, css3 / Sass, Javascript, Angular, Node, and Mongo. \n \n\"Here is the prime condition of success: Concentrate your energy, thought and capital exclusively upon the business in which you are engaged. Having begun on one line, resolve to fight it out on that line, to lead in it, adopt every improvement, have the best machinery, and know the most about it.\" \n— Andrew Carnegie Summary I'm a technologist and a builder of teams determined to build awesome experiences. \n \nThis quest and ambition has taken me from sales at Dell, to Tech Support and ecommerce consulting at Yahoo! to now partnering with amazing people and companies to develop innovative web applications and games. I'm currently partnered with a start up in Boulder Colorado leading and building small teams focused on jaavascript application and game development. \n \nCurrently my primary language focuses and interests are: html5, css3 / Sass, Javascript, Angular, Node, and Mongo. \n \n\"Here is the prime condition of success: Concentrate your energy, thought and capital exclusively upon the business in which you are engaged. Having begun on one line, resolve to fight it out on that line, to lead in it, adopt every improvement, have the best machinery, and know the most about it.\" \n— Andrew Carnegie I'm a technologist and a builder of teams determined to build awesome experiences. \n \nThis quest and ambition has taken me from sales at Dell, to Tech Support and ecommerce consulting at Yahoo! to now partnering with amazing people and companies to develop innovative web applications and games. I'm currently partnered with a start up in Boulder Colorado leading and building small teams focused on jaavascript application and game development. \n \nCurrently my primary language focuses and interests are: html5, css3 / Sass, Javascript, Angular, Node, and Mongo. \n \n\"Here is the prime condition of success: Concentrate your energy, thought and capital exclusively upon the business in which you are engaged. Having begun on one line, resolve to fight it out on that line, to lead in it, adopt every improvement, have the best machinery, and know the most about it.\" \n— Andrew Carnegie I'm a technologist and a builder of teams determined to build awesome experiences. \n \nThis quest and ambition has taken me from sales at Dell, to Tech Support and ecommerce consulting at Yahoo! to now partnering with amazing people and companies to develop innovative web applications and games. I'm currently partnered with a start up in Boulder Colorado leading and building small teams focused on jaavascript application and game development. \n \nCurrently my primary language focuses and interests are: html5, css3 / Sass, Javascript, Angular, Node, and Mongo. \n \n\"Here is the prime condition of success: Concentrate your energy, thought and capital exclusively upon the business in which you are engaged. Having begun on one line, resolve to fight it out on that line, to lead in it, adopt every improvement, have the best machinery, and know the most about it.\" \n— Andrew Carnegie Experience Senior Front End Engineer Singularity Interactive November 2013  – Present (1 year 10 months) Boulder Colorado We provide games and engagement strategies across multiple platforms and devices in the web and mobile space. Primary focus is on mobile first responsive html5 and javascript driven rich web applications. Owner Ollomedia January 2007  – Present (8 years 8 months) Internet Periodic freelance work in web design and promotional media for small businesses. Project technologies include : CSS3, HTML5, JavaScript/Jquery, Content Management Systems, online payment features, and form processing. Creating web graphics, including logos and advertisements for blogs, Facebook pages, newsletters, site launches, events and product announcements. Lead Organizer for WordCamp St. Louis WordPress August 2013  –  March 2014  (8 months) Washington University St. Louis WordCamp St. Louis is a conference for Developers and Users of WordPress. I'm leading a core team of organizers to plan the event. National and local speakers will give talk sessions all around using and developing WordPress. WordPress Developer Red8 Interactive June 2013  –  November 2013  (6 months) Greater St. Louis Area Worked with a small team as a senior WordPress developer to build dynamic custom WordPress themes and web applications. Web Developer UpTrending February 2013  –  May 2013  (4 months) Greater St. Louis Area Telecommute position with a team of developers and designers to create awesome web applications and custom WordPress themes for small businesses and startups. Focused on responsive design with html5, CSS3 and Javascript / jQuery. Lead Front-End Engineer Integrity Corporation October 2011  –  January 2013  (1 year 4 months) Greater St. Louis Area Lead front end engineer responsible for a small team to execute pixel perfect websites and applications. Built fully custom WordPress, CodeIgniter, and static websites and applications. Utilized html5, css3, jQuery, and frameworks such as Twitter Bootstrap. Also initiated development processes and workflows to standardized and document tools and frameworks through the entire engineering organization. Merchant Development Account Specialist Yahoo! March 2010  –  September 2011  (1 year 7 months) Hillsboro, Oregon Yahoo! Small Business, Hillsboro Oregon \n \nFunctioned as an ecommerce consultant and account manager for 300 mid-tier accounts on the Yahoo! Store / Merchant Solutions platform. Provided consultation on best practices in design, layout, SEO, and feature implementation. Also functioned in a dual role as Priority Technical Support for the highest revenue segment. \nDid contract work developing theme variants in CSS for web hosting design product Yahoo! Site Solutions. Was lead developer and designer on two custom Facebook pages / applications now in production. Senior Client Advocate Yahoo! April 2008  –  March 2010  (2 years) Yahoo! Small Business, Hillsboro Oregon \n \nFunctioned as general technical support agent for Yahoo! Small business in product areas of Domain registration renewal and management, Web hosting tool and account usage. Troubleshooting of website code and installations through FTP. Ecommerce support for sign up, proper store configuration to properly open for business, as well as customization and usage support for existing stores. Senior Consumer Sales Agent Dell Inc October 2006  –  December 2007  (1 year 3 months) Performed inbound sales to the highest level of efficiency and profit for Dell's Consumer sales Division. Grossed over one million dollars in sales while attaining key metrics in applicable up-sells for support, hardware upgrades and financing options. Attained platinum team of the quarter in Q4 of 2006 status and was part of a pilot program that extended into follow up on leads from retail kiosks and previous sales calls regarding larger scale configurations including small businesses and larger scale purchases for home networking and luxury system upgrades. Senior Front End Engineer Singularity Interactive November 2013  – Present (1 year 10 months) Boulder Colorado We provide games and engagement strategies across multiple platforms and devices in the web and mobile space. Primary focus is on mobile first responsive html5 and javascript driven rich web applications. Senior Front End Engineer Singularity Interactive November 2013  – Present (1 year 10 months) Boulder Colorado We provide games and engagement strategies across multiple platforms and devices in the web and mobile space. Primary focus is on mobile first responsive html5 and javascript driven rich web applications. Owner Ollomedia January 2007  – Present (8 years 8 months) Internet Periodic freelance work in web design and promotional media for small businesses. Project technologies include : CSS3, HTML5, JavaScript/Jquery, Content Management Systems, online payment features, and form processing. Creating web graphics, including logos and advertisements for blogs, Facebook pages, newsletters, site launches, events and product announcements. Owner Ollomedia January 2007  – Present (8 years 8 months) Internet Periodic freelance work in web design and promotional media for small businesses. Project technologies include : CSS3, HTML5, JavaScript/Jquery, Content Management Systems, online payment features, and form processing. Creating web graphics, including logos and advertisements for blogs, Facebook pages, newsletters, site launches, events and product announcements. Lead Organizer for WordCamp St. Louis WordPress August 2013  –  March 2014  (8 months) Washington University St. Louis WordCamp St. Louis is a conference for Developers and Users of WordPress. I'm leading a core team of organizers to plan the event. National and local speakers will give talk sessions all around using and developing WordPress. Lead Organizer for WordCamp St. Louis WordPress August 2013  –  March 2014  (8 months) Washington University St. Louis WordCamp St. Louis is a conference for Developers and Users of WordPress. I'm leading a core team of organizers to plan the event. National and local speakers will give talk sessions all around using and developing WordPress. WordPress Developer Red8 Interactive June 2013  –  November 2013  (6 months) Greater St. Louis Area Worked with a small team as a senior WordPress developer to build dynamic custom WordPress themes and web applications. WordPress Developer Red8 Interactive June 2013  –  November 2013  (6 months) Greater St. Louis Area Worked with a small team as a senior WordPress developer to build dynamic custom WordPress themes and web applications. Web Developer UpTrending February 2013  –  May 2013  (4 months) Greater St. Louis Area Telecommute position with a team of developers and designers to create awesome web applications and custom WordPress themes for small businesses and startups. Focused on responsive design with html5, CSS3 and Javascript / jQuery. Web Developer UpTrending February 2013  –  May 2013  (4 months) Greater St. Louis Area Telecommute position with a team of developers and designers to create awesome web applications and custom WordPress themes for small businesses and startups. Focused on responsive design with html5, CSS3 and Javascript / jQuery. Lead Front-End Engineer Integrity Corporation October 2011  –  January 2013  (1 year 4 months) Greater St. Louis Area Lead front end engineer responsible for a small team to execute pixel perfect websites and applications. Built fully custom WordPress, CodeIgniter, and static websites and applications. Utilized html5, css3, jQuery, and frameworks such as Twitter Bootstrap. Also initiated development processes and workflows to standardized and document tools and frameworks through the entire engineering organization. Lead Front-End Engineer Integrity Corporation October 2011  –  January 2013  (1 year 4 months) Greater St. Louis Area Lead front end engineer responsible for a small team to execute pixel perfect websites and applications. Built fully custom WordPress, CodeIgniter, and static websites and applications. Utilized html5, css3, jQuery, and frameworks such as Twitter Bootstrap. Also initiated development processes and workflows to standardized and document tools and frameworks through the entire engineering organization. Merchant Development Account Specialist Yahoo! March 2010  –  September 2011  (1 year 7 months) Hillsboro, Oregon Yahoo! Small Business, Hillsboro Oregon \n \nFunctioned as an ecommerce consultant and account manager for 300 mid-tier accounts on the Yahoo! Store / Merchant Solutions platform. Provided consultation on best practices in design, layout, SEO, and feature implementation. Also functioned in a dual role as Priority Technical Support for the highest revenue segment. \nDid contract work developing theme variants in CSS for web hosting design product Yahoo! Site Solutions. Was lead developer and designer on two custom Facebook pages / applications now in production. Merchant Development Account Specialist Yahoo! March 2010  –  September 2011  (1 year 7 months) Hillsboro, Oregon Yahoo! Small Business, Hillsboro Oregon \n \nFunctioned as an ecommerce consultant and account manager for 300 mid-tier accounts on the Yahoo! Store / Merchant Solutions platform. Provided consultation on best practices in design, layout, SEO, and feature implementation. Also functioned in a dual role as Priority Technical Support for the highest revenue segment. \nDid contract work developing theme variants in CSS for web hosting design product Yahoo! Site Solutions. Was lead developer and designer on two custom Facebook pages / applications now in production. Senior Client Advocate Yahoo! April 2008  –  March 2010  (2 years) Yahoo! Small Business, Hillsboro Oregon \n \nFunctioned as general technical support agent for Yahoo! Small business in product areas of Domain registration renewal and management, Web hosting tool and account usage. Troubleshooting of website code and installations through FTP. Ecommerce support for sign up, proper store configuration to properly open for business, as well as customization and usage support for existing stores. Senior Client Advocate Yahoo! April 2008  –  March 2010  (2 years) Yahoo! Small Business, Hillsboro Oregon \n \nFunctioned as general technical support agent for Yahoo! Small business in product areas of Domain registration renewal and management, Web hosting tool and account usage. Troubleshooting of website code and installations through FTP. Ecommerce support for sign up, proper store configuration to properly open for business, as well as customization and usage support for existing stores. Senior Consumer Sales Agent Dell Inc October 2006  –  December 2007  (1 year 3 months) Performed inbound sales to the highest level of efficiency and profit for Dell's Consumer sales Division. Grossed over one million dollars in sales while attaining key metrics in applicable up-sells for support, hardware upgrades and financing options. Attained platinum team of the quarter in Q4 of 2006 status and was part of a pilot program that extended into follow up on leads from retail kiosks and previous sales calls regarding larger scale configurations including small businesses and larger scale purchases for home networking and luxury system upgrades. Senior Consumer Sales Agent Dell Inc October 2006  –  December 2007  (1 year 3 months) Performed inbound sales to the highest level of efficiency and profit for Dell's Consumer sales Division. Grossed over one million dollars in sales while attaining key metrics in applicable up-sells for support, hardware upgrades and financing options. Attained platinum team of the quarter in Q4 of 2006 status and was part of a pilot program that extended into follow up on leads from retail kiosks and previous sales calls regarding larger scale configurations including small businesses and larger scale purchases for home networking and luxury system upgrades. Languages   Skills HTML 5 CSS WordPress jQuery Web Development PHP Web Design SEO HTML JavaScript CSS3 E-commerce Git User Experience CMS MySQL Facebook API GIF LAMP MVC Web Applications AJAX Apache SASS Communication JSON angular HTML5 See 13+     See less Skills  HTML 5 CSS WordPress jQuery Web Development PHP Web Design SEO HTML JavaScript CSS3 E-commerce Git User Experience CMS MySQL Facebook API GIF LAMP MVC Web Applications AJAX Apache SASS Communication JSON angular HTML5 See 13+     See less HTML 5 CSS WordPress jQuery Web Development PHP Web Design SEO HTML JavaScript CSS3 E-commerce Git User Experience CMS MySQL Facebook API GIF LAMP MVC Web Applications AJAX Apache SASS Communication JSON angular HTML5 See 13+     See less HTML 5 CSS WordPress jQuery Web Development PHP Web Design SEO HTML JavaScript CSS3 E-commerce Git User Experience CMS MySQL Facebook API GIF LAMP MVC Web Applications AJAX Apache SASS Communication JSON angular HTML5 See 13+     See less Education Portland State University General Education,  Marketing / Ecommerce ,  Computer Science 2010  – 2011 Studied General business as well as general programming C++ Portland Community College NA,  Web Development ,  Design 2009  – 2010 Working through specific classes for web development. Western Governors University IT,  Information Technology 2009  – 2009 Did a short tour of duty to brush up on some web technologies and received the CIW Internet Professional Certificate. University of Central Oklahoma Photo Journalism 2002  – 2004 Portland State University General Education,  Marketing / Ecommerce ,  Computer Science 2010  – 2011 Studied General business as well as general programming C++ Portland State University General Education,  Marketing / Ecommerce ,  Computer Science 2010  – 2011 Studied General business as well as general programming C++ Portland State University General Education,  Marketing / Ecommerce ,  Computer Science 2010  – 2011 Studied General business as well as general programming C++ Portland Community College NA,  Web Development ,  Design 2009  – 2010 Working through specific classes for web development. Portland Community College NA,  Web Development ,  Design 2009  – 2010 Working through specific classes for web development. Portland Community College NA,  Web Development ,  Design 2009  – 2010 Working through specific classes for web development. Western Governors University IT,  Information Technology 2009  – 2009 Did a short tour of duty to brush up on some web technologies and received the CIW Internet Professional Certificate. Western Governors University IT,  Information Technology 2009  – 2009 Did a short tour of duty to brush up on some web technologies and received the CIW Internet Professional Certificate. Western Governors University IT,  Information Technology 2009  – 2009 Did a short tour of duty to brush up on some web technologies and received the CIW Internet Professional Certificate. University of Central Oklahoma Photo Journalism 2002  – 2004 University of Central Oklahoma Photo Journalism 2002  – 2004 University of Central Oklahoma Photo Journalism 2002  – 2004 Honors & Awards ", "Summary Currently a senior web front-end engineer at Yahoo!. Expert in HTML, Javascript, and CSS with professional training of usability. Formally an Apple sales consultant. Also a Mac OS X book author for ten years, a guitarist for twenty years, and a life-long avid cyclist/activist. Summary Currently a senior web front-end engineer at Yahoo!. Expert in HTML, Javascript, and CSS with professional training of usability. Formally an Apple sales consultant. Also a Mac OS X book author for ten years, a guitarist for twenty years, and a life-long avid cyclist/activist. Currently a senior web front-end engineer at Yahoo!. Expert in HTML, Javascript, and CSS with professional training of usability. Formally an Apple sales consultant. Also a Mac OS X book author for ten years, a guitarist for twenty years, and a life-long avid cyclist/activist. Currently a senior web front-end engineer at Yahoo!. Expert in HTML, Javascript, and CSS with professional training of usability. Formally an Apple sales consultant. Also a Mac OS X book author for ten years, a guitarist for twenty years, and a life-long avid cyclist/activist. Experience Senior Front-End Engineer Yahoo! August 2010  – Present (5 years 1 month) Taipei, Taiwan • Yahoo! E-commerce Store O2O (React+Flux framework) \n• Yahoo! Taiwan E-commerce Mobile Store (Node.js) \n• Yahoo! Taiwan E-commerce Mobile Shopping (Node.js) \n• Yahoo! Touchdown Platform (Node.js): Listing module \n• Yahoo! Lego Platform: Photo Slideshow \n• Yahoo! Lego Platform: Photo Lightbox on Desktop, Smartphone and Tablet \n• Yahoo! Taiwan Homepage HTML5 for iPhone and Android \n• Yahoo! Taiwan Sports HTML5 for iPhone and Android \n• Yahoo Touchdown: A Node.js framework Front-End Engineer Yahoo! 2010  –  2011  (1 year) Taipei, Taiwan Work on HTML, CSS and Javascript. User Experience Engineer Aspera, Inc. March 2007  –  July 2010  (3 years 5 months) • Product documentation \n• Implemented documentation deployment framework with DITA (XML and XSL) \n• Website maintenance UI Designer KeenScreen Inc. 2007  –  2007  (less than a year) Empty Space Ads project Intern Factotem 2006  –  2006  (less than a year) Apple Solution Consultant Apple Taiwan July 2003  –  October 2004  (1 year 4 months) Taipei City, Taiwan Product solution consultation, reseller training, end-user training Senior Front-End Engineer Yahoo! August 2010  – Present (5 years 1 month) Taipei, Taiwan • Yahoo! E-commerce Store O2O (React+Flux framework) \n• Yahoo! Taiwan E-commerce Mobile Store (Node.js) \n• Yahoo! Taiwan E-commerce Mobile Shopping (Node.js) \n• Yahoo! Touchdown Platform (Node.js): Listing module \n• Yahoo! Lego Platform: Photo Slideshow \n• Yahoo! Lego Platform: Photo Lightbox on Desktop, Smartphone and Tablet \n• Yahoo! Taiwan Homepage HTML5 for iPhone and Android \n• Yahoo! Taiwan Sports HTML5 for iPhone and Android \n• Yahoo Touchdown: A Node.js framework Senior Front-End Engineer Yahoo! August 2010  – Present (5 years 1 month) Taipei, Taiwan • Yahoo! E-commerce Store O2O (React+Flux framework) \n• Yahoo! Taiwan E-commerce Mobile Store (Node.js) \n• Yahoo! Taiwan E-commerce Mobile Shopping (Node.js) \n• Yahoo! Touchdown Platform (Node.js): Listing module \n• Yahoo! Lego Platform: Photo Slideshow \n• Yahoo! Lego Platform: Photo Lightbox on Desktop, Smartphone and Tablet \n• Yahoo! Taiwan Homepage HTML5 for iPhone and Android \n• Yahoo! Taiwan Sports HTML5 for iPhone and Android \n• Yahoo Touchdown: A Node.js framework Front-End Engineer Yahoo! 2010  –  2011  (1 year) Taipei, Taiwan Work on HTML, CSS and Javascript. Front-End Engineer Yahoo! 2010  –  2011  (1 year) Taipei, Taiwan Work on HTML, CSS and Javascript. User Experience Engineer Aspera, Inc. March 2007  –  July 2010  (3 years 5 months) • Product documentation \n• Implemented documentation deployment framework with DITA (XML and XSL) \n• Website maintenance User Experience Engineer Aspera, Inc. March 2007  –  July 2010  (3 years 5 months) • Product documentation \n• Implemented documentation deployment framework with DITA (XML and XSL) \n• Website maintenance UI Designer KeenScreen Inc. 2007  –  2007  (less than a year) Empty Space Ads project UI Designer KeenScreen Inc. 2007  –  2007  (less than a year) Empty Space Ads project Intern Factotem 2006  –  2006  (less than a year) Intern Factotem 2006  –  2006  (less than a year) Apple Solution Consultant Apple Taiwan July 2003  –  October 2004  (1 year 4 months) Taipei City, Taiwan Product solution consultation, reseller training, end-user training Apple Solution Consultant Apple Taiwan July 2003  –  October 2004  (1 year 4 months) Taipei City, Taiwan Product solution consultation, reseller training, end-user training Languages Chinese English Chinese English Chinese English Skills JavaScript CSS Mac OS X MySQL Python HTML5 Mobile Internet yui PHP YUI HTML 5 OS X Android Linux Web Applications Mobile Applications Subversion User Interface Design Apache Usability REST User Experience JSON User Interface jQuery Front-end Ruby AJAX Scrum Node.js Web Development LAMP Agile Methodologies XHTML Open Source Information Architecture iOS development User-centered Design Objective-C XML Git Drupal See 27+     See less Skills  JavaScript CSS Mac OS X MySQL Python HTML5 Mobile Internet yui PHP YUI HTML 5 OS X Android Linux Web Applications Mobile Applications Subversion User Interface Design Apache Usability REST User Experience JSON User Interface jQuery Front-end Ruby AJAX Scrum Node.js Web Development LAMP Agile Methodologies XHTML Open Source Information Architecture iOS development User-centered Design Objective-C XML Git Drupal See 27+     See less JavaScript CSS Mac OS X MySQL Python HTML5 Mobile Internet yui PHP YUI HTML 5 OS X Android Linux Web Applications Mobile Applications Subversion User Interface Design Apache Usability REST User Experience JSON User Interface jQuery Front-end Ruby AJAX Scrum Node.js Web Development LAMP Agile Methodologies XHTML Open Source Information Architecture iOS development User-centered Design Objective-C XML Git Drupal See 27+     See less JavaScript CSS Mac OS X MySQL Python HTML5 Mobile Internet yui PHP YUI HTML 5 OS X Android Linux Web Applications Mobile Applications Subversion User Interface Design Apache Usability REST User Experience JSON User Interface jQuery Front-end Ruby AJAX Scrum Node.js Web Development LAMP Agile Methodologies XHTML Open Source Information Architecture iOS development User-centered Design Objective-C XML Git Drupal See 27+     See less Education University of Michigan - School of Information Master of Science (M.S.),  Human-Computer Interaction 2005  – 2006 National Taiwan University Bachelor of Arts (B.A.),  Sociology 1999  – 2004 • Certificate of Communication Program \n• Bank of Taiwan Schlorship Activities and Societies:  President of Global Life and Friends Club University of Michigan - School of Information Master of Science (M.S.),  Human-Computer Interaction 2005  – 2006 University of Michigan - School of Information Master of Science (M.S.),  Human-Computer Interaction 2005  – 2006 University of Michigan - School of Information Master of Science (M.S.),  Human-Computer Interaction 2005  – 2006 National Taiwan University Bachelor of Arts (B.A.),  Sociology 1999  – 2004 • Certificate of Communication Program \n• Bank of Taiwan Schlorship Activities and Societies:  President of Global Life and Friends Club National Taiwan University Bachelor of Arts (B.A.),  Sociology 1999  – 2004 • Certificate of Communication Program \n• Bank of Taiwan Schlorship Activities and Societies:  President of Global Life and Friends Club National Taiwan University Bachelor of Arts (B.A.),  Sociology 1999  – 2004 • Certificate of Communication Program \n• Bank of Taiwan Schlorship Activities and Societies:  President of Global Life and Friends Club Honors & Awards Additional Honors & Awards Bank of Taiwan Schlorship, 2003 Additional Honors & Awards Bank of Taiwan Schlorship, 2003 Additional Honors & Awards Bank of Taiwan Schlorship, 2003 Additional Honors & Awards Bank of Taiwan Schlorship, 2003 ", "Summary Front-end engineer who enjoys building web experiences that leverage principles of human-centered computing to provide better user experience and usability. Summary Front-end engineer who enjoys building web experiences that leverage principles of human-centered computing to provide better user experience and usability. Front-end engineer who enjoys building web experiences that leverage principles of human-centered computing to provide better user experience and usability. Front-end engineer who enjoys building web experiences that leverage principles of human-centered computing to provide better user experience and usability. Experience Front end Engineer Yahoo March 2014  – Present (1 year 6 months) Sunnyvale, California Digital Magazines front-end team: building modern desktop & mobile web experiences such as Yahoo Tech and Yahoo Food, that impact millions of users daily.  \nBuilding isomorphic Javascript apps using the Yahoo-flavored Express stack, YUI and React.js components. Front end Engineer Yahoo March 2014  – Present (1 year 6 months) Sunnyvale, California Digital Magazines front-end team: building modern desktop & mobile web experiences such as Yahoo Tech and Yahoo Food, that impact millions of users daily.  \nBuilding isomorphic Javascript apps using the Yahoo-flavored Express stack, YUI and React.js components. Front end Engineer Yahoo March 2014  – Present (1 year 6 months) Sunnyvale, California Digital Magazines front-end team: building modern desktop & mobile web experiences such as Yahoo Tech and Yahoo Food, that impact millions of users daily.  \nBuilding isomorphic Javascript apps using the Yahoo-flavored Express stack, YUI and React.js components. Languages English Full professional proficiency Hindi Limited working proficiency Marathi Professional working proficiency German Elementary proficiency English Full professional proficiency Hindi Limited working proficiency Marathi Professional working proficiency German Elementary proficiency English Full professional proficiency Hindi Limited working proficiency Marathi Professional working proficiency German Elementary proficiency Full professional proficiency Limited working proficiency Professional working proficiency Elementary proficiency Skills Human Computer... JavaScript HTML 5 CSS3 Node.js React.js PHP Git Java C++ Programming User Interface Design MySQL User Experience Web Development Skills  Human Computer... JavaScript HTML 5 CSS3 Node.js React.js PHP Git Java C++ Programming User Interface Design MySQL User Experience Web Development Human Computer... JavaScript HTML 5 CSS3 Node.js React.js PHP Git Java C++ Programming User Interface Design MySQL User Experience Web Development Human Computer... JavaScript HTML 5 CSS3 Node.js React.js PHP Git Java C++ Programming User Interface Design MySQL User Experience Web Development Education Georgia Tech Master of Science (M.S.),  Computer Science , 3.87 2012  – 2014 Human Computer Interaction Activities and Societies:  Member of Student Alumni Association(SAA) Vishwakarma Institute of Technology Bachelor of Engineering (B.E.),  Computer Engineering , 8.83 (on scale of 10) 2008  – 2012 Hutchings High School, Pune 1997  – 2006 Activities and Societies:  Student Member of Mensa ,  School Choir ,  Music Competition ,  English Elocution Georgia Tech Master of Science (M.S.),  Computer Science , 3.87 2012  – 2014 Human Computer Interaction Activities and Societies:  Member of Student Alumni Association(SAA) Georgia Tech Master of Science (M.S.),  Computer Science , 3.87 2012  – 2014 Human Computer Interaction Activities and Societies:  Member of Student Alumni Association(SAA) Georgia Tech Master of Science (M.S.),  Computer Science , 3.87 2012  – 2014 Human Computer Interaction Activities and Societies:  Member of Student Alumni Association(SAA) Vishwakarma Institute of Technology Bachelor of Engineering (B.E.),  Computer Engineering , 8.83 (on scale of 10) 2008  – 2012 Vishwakarma Institute of Technology Bachelor of Engineering (B.E.),  Computer Engineering , 8.83 (on scale of 10) 2008  – 2012 Vishwakarma Institute of Technology Bachelor of Engineering (B.E.),  Computer Engineering , 8.83 (on scale of 10) 2008  – 2012 Hutchings High School, Pune 1997  – 2006 Activities and Societies:  Student Member of Mensa ,  School Choir ,  Music Competition ,  English Elocution Hutchings High School, Pune 1997  – 2006 Activities and Societies:  Student Member of Mensa ,  School Choir ,  Music Competition ,  English Elocution Hutchings High School, Pune 1997  – 2006 Activities and Societies:  Student Member of Mensa ,  School Choir ,  Music Competition ,  English Elocution Honors & Awards ", "Summary I'm a killer of bugs no matter what, I investigate and resolve the issue promptly. \n \nI'm Technical Solution with attention to small details creating big results. I live in a jungle and you're welcome here! \n \nLet me come back to work to fix a lot of bugs and build a better World. \n \n \nSenior Front End Engineer, JavaScript Engineer at @RGA, Ex-Yahoo! in a serious relationship with HTML5, CSS3, JavaScript, SEO, Web Performance, WAI-ARIA, etc. \n \n----- \n \n \nBachelor in Computer Science with experience in development and maintenance of web sites with more than 15 years of solid skills in HTML5 (hand-code), CSS3 (OOCSS/SMACSS/BEM), Preprocessor (SASS/LESS/Stylus), JavaScript/AJAX/DOM, SEO, Web Performance, Java, Ruby on Rails, Python, .Net, PHP, ColdFusion and databases MongoDB, MySQL and SQL Server. \n \n• Professional clean code and high-quality having as practical implementation cross-platform, cross-browsers, usability, accessibility (WAI-ARIA), SEO and Web Performance with best practices for speed sites (paranoid). \n \n• Excellent knowledge of Photoshop, slicing assets from PSDs and producing HTML markup. \n \n• Strong knowledge of JavaScript (OOP) and frameworks, template engines and MV* frameworks (JQuery, YUI, Backbone.js, Underscore.js, AngularJS, Handlebars.js) also CSS Preprocessor (SASS/LESS). \n \n• Strong experience with tests using Selenium, Jasmine, JQUnit and Development Tool for Version Control GIT and Subversion also issue/bug tracking tools (Jira, Basecamp, FogBugz, Bugzilla, Pivotal Tracker among others). \n \n• Experience with Responsive Web Design (RWD), Mobile First and CSS3 Animations. \n \n• Agile delivery of software using practices from Scrum. \n \n• Familiarity in Unix and Apache. \n \nI invite you to watch my presentations about HTML5, CSS3, JavaScript, Performance, Accessibility, SEO and other related subjects: \n \nhttp://www.slideshare.net/rodcast/ Summary I'm a killer of bugs no matter what, I investigate and resolve the issue promptly. \n \nI'm Technical Solution with attention to small details creating big results. I live in a jungle and you're welcome here! \n \nLet me come back to work to fix a lot of bugs and build a better World. \n \n \nSenior Front End Engineer, JavaScript Engineer at @RGA, Ex-Yahoo! in a serious relationship with HTML5, CSS3, JavaScript, SEO, Web Performance, WAI-ARIA, etc. \n \n----- \n \n \nBachelor in Computer Science with experience in development and maintenance of web sites with more than 15 years of solid skills in HTML5 (hand-code), CSS3 (OOCSS/SMACSS/BEM), Preprocessor (SASS/LESS/Stylus), JavaScript/AJAX/DOM, SEO, Web Performance, Java, Ruby on Rails, Python, .Net, PHP, ColdFusion and databases MongoDB, MySQL and SQL Server. \n \n• Professional clean code and high-quality having as practical implementation cross-platform, cross-browsers, usability, accessibility (WAI-ARIA), SEO and Web Performance with best practices for speed sites (paranoid). \n \n• Excellent knowledge of Photoshop, slicing assets from PSDs and producing HTML markup. \n \n• Strong knowledge of JavaScript (OOP) and frameworks, template engines and MV* frameworks (JQuery, YUI, Backbone.js, Underscore.js, AngularJS, Handlebars.js) also CSS Preprocessor (SASS/LESS). \n \n• Strong experience with tests using Selenium, Jasmine, JQUnit and Development Tool for Version Control GIT and Subversion also issue/bug tracking tools (Jira, Basecamp, FogBugz, Bugzilla, Pivotal Tracker among others). \n \n• Experience with Responsive Web Design (RWD), Mobile First and CSS3 Animations. \n \n• Agile delivery of software using practices from Scrum. \n \n• Familiarity in Unix and Apache. \n \nI invite you to watch my presentations about HTML5, CSS3, JavaScript, Performance, Accessibility, SEO and other related subjects: \n \nhttp://www.slideshare.net/rodcast/ I'm a killer of bugs no matter what, I investigate and resolve the issue promptly. \n \nI'm Technical Solution with attention to small details creating big results. I live in a jungle and you're welcome here! \n \nLet me come back to work to fix a lot of bugs and build a better World. \n \n \nSenior Front End Engineer, JavaScript Engineer at @RGA, Ex-Yahoo! in a serious relationship with HTML5, CSS3, JavaScript, SEO, Web Performance, WAI-ARIA, etc. \n \n----- \n \n \nBachelor in Computer Science with experience in development and maintenance of web sites with more than 15 years of solid skills in HTML5 (hand-code), CSS3 (OOCSS/SMACSS/BEM), Preprocessor (SASS/LESS/Stylus), JavaScript/AJAX/DOM, SEO, Web Performance, Java, Ruby on Rails, Python, .Net, PHP, ColdFusion and databases MongoDB, MySQL and SQL Server. \n \n• Professional clean code and high-quality having as practical implementation cross-platform, cross-browsers, usability, accessibility (WAI-ARIA), SEO and Web Performance with best practices for speed sites (paranoid). \n \n• Excellent knowledge of Photoshop, slicing assets from PSDs and producing HTML markup. \n \n• Strong knowledge of JavaScript (OOP) and frameworks, template engines and MV* frameworks (JQuery, YUI, Backbone.js, Underscore.js, AngularJS, Handlebars.js) also CSS Preprocessor (SASS/LESS). \n \n• Strong experience with tests using Selenium, Jasmine, JQUnit and Development Tool for Version Control GIT and Subversion also issue/bug tracking tools (Jira, Basecamp, FogBugz, Bugzilla, Pivotal Tracker among others). \n \n• Experience with Responsive Web Design (RWD), Mobile First and CSS3 Animations. \n \n• Agile delivery of software using practices from Scrum. \n \n• Familiarity in Unix and Apache. \n \nI invite you to watch my presentations about HTML5, CSS3, JavaScript, Performance, Accessibility, SEO and other related subjects: \n \nhttp://www.slideshare.net/rodcast/ I'm a killer of bugs no matter what, I investigate and resolve the issue promptly. \n \nI'm Technical Solution with attention to small details creating big results. I live in a jungle and you're welcome here! \n \nLet me come back to work to fix a lot of bugs and build a better World. \n \n \nSenior Front End Engineer, JavaScript Engineer at @RGA, Ex-Yahoo! in a serious relationship with HTML5, CSS3, JavaScript, SEO, Web Performance, WAI-ARIA, etc. \n \n----- \n \n \nBachelor in Computer Science with experience in development and maintenance of web sites with more than 15 years of solid skills in HTML5 (hand-code), CSS3 (OOCSS/SMACSS/BEM), Preprocessor (SASS/LESS/Stylus), JavaScript/AJAX/DOM, SEO, Web Performance, Java, Ruby on Rails, Python, .Net, PHP, ColdFusion and databases MongoDB, MySQL and SQL Server. \n \n• Professional clean code and high-quality having as practical implementation cross-platform, cross-browsers, usability, accessibility (WAI-ARIA), SEO and Web Performance with best practices for speed sites (paranoid). \n \n• Excellent knowledge of Photoshop, slicing assets from PSDs and producing HTML markup. \n \n• Strong knowledge of JavaScript (OOP) and frameworks, template engines and MV* frameworks (JQuery, YUI, Backbone.js, Underscore.js, AngularJS, Handlebars.js) also CSS Preprocessor (SASS/LESS). \n \n• Strong experience with tests using Selenium, Jasmine, JQUnit and Development Tool for Version Control GIT and Subversion also issue/bug tracking tools (Jira, Basecamp, FogBugz, Bugzilla, Pivotal Tracker among others). \n \n• Experience with Responsive Web Design (RWD), Mobile First and CSS3 Animations. \n \n• Agile delivery of software using practices from Scrum. \n \n• Familiarity in Unix and Apache. \n \nI invite you to watch my presentations about HTML5, CSS3, JavaScript, Performance, Accessibility, SEO and other related subjects: \n \nhttp://www.slideshare.net/rodcast/ Experience Senior Front End Engineer, JavaScript Engineer R/GA September 2011  – Present (4 years) São Paulo Area, Brazil Senior Front End Engineer, JavaScript Architect Lopes Real Estate Brokerage January 2010  –  September 2011  (1 year 9 months) São Paulo Area, Brazil Senior Front End Engineer Yahoo! May 2008  –  January 2010  (1 year 9 months) São Paulo Area, Brazil Senior Front End Engineer, Front End Lead AgênciaClick May 2001  –  May 2008  (7 years 1 month) São Paulo Area, Brazil Front End Engineer Ogilvy & Mather May 2000  –  May 2001  (1 year 1 month) São Paulo Area, Brazil Senior Front End Engineer, JavaScript Engineer R/GA September 2011  – Present (4 years) São Paulo Area, Brazil Senior Front End Engineer, JavaScript Engineer R/GA September 2011  – Present (4 years) São Paulo Area, Brazil Senior Front End Engineer, JavaScript Architect Lopes Real Estate Brokerage January 2010  –  September 2011  (1 year 9 months) São Paulo Area, Brazil Senior Front End Engineer, JavaScript Architect Lopes Real Estate Brokerage January 2010  –  September 2011  (1 year 9 months) São Paulo Area, Brazil Senior Front End Engineer Yahoo! May 2008  –  January 2010  (1 year 9 months) São Paulo Area, Brazil Senior Front End Engineer Yahoo! May 2008  –  January 2010  (1 year 9 months) São Paulo Area, Brazil Senior Front End Engineer, Front End Lead AgênciaClick May 2001  –  May 2008  (7 years 1 month) São Paulo Area, Brazil Senior Front End Engineer, Front End Lead AgênciaClick May 2001  –  May 2008  (7 years 1 month) São Paulo Area, Brazil Front End Engineer Ogilvy & Mather May 2000  –  May 2001  (1 year 1 month) São Paulo Area, Brazil Front End Engineer Ogilvy & Mather May 2000  –  May 2001  (1 year 1 month) São Paulo Area, Brazil Languages Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills jQuery HTML 5 JavaScript AJAX JSON Front-end AngularJS CSS Git HTML PHP SEO Web Development MySQL Subversion CSS3 Scrum Java Web Applications Apache User Experience Ruby Ruby on Rails .NET Usability XHTML Web Standards Accessibility Information Architecture YUI DOM Web Performance ColdFusion Cross-browser... Agile Project Management REST See 21+     See less Skills  jQuery HTML 5 JavaScript AJAX JSON Front-end AngularJS CSS Git HTML PHP SEO Web Development MySQL Subversion CSS3 Scrum Java Web Applications Apache User Experience Ruby Ruby on Rails .NET Usability XHTML Web Standards Accessibility Information Architecture YUI DOM Web Performance ColdFusion Cross-browser... Agile Project Management REST See 21+     See less jQuery HTML 5 JavaScript AJAX JSON Front-end AngularJS CSS Git HTML PHP SEO Web Development MySQL Subversion CSS3 Scrum Java Web Applications Apache User Experience Ruby Ruby on Rails .NET Usability XHTML Web Standards Accessibility Information Architecture YUI DOM Web Performance ColdFusion Cross-browser... Agile Project Management REST See 21+     See less jQuery HTML 5 JavaScript AJAX JSON Front-end AngularJS CSS Git HTML PHP SEO Web Development MySQL Subversion CSS3 Scrum Java Web Applications Apache User Experience Ruby Ruby on Rails .NET Usability XHTML Web Standards Accessibility Information Architecture YUI DOM Web Performance ColdFusion Cross-browser... Agile Project Management REST See 21+     See less Education Universidade Santa Cecília Bachelor's degree,  Computer Science , 3.5 1997  – 2000 College Integração Data Processing 1994  – 1996 Universidade Santa Cecília Bachelor's degree,  Computer Science , 3.5 1997  – 2000 Universidade Santa Cecília Bachelor's degree,  Computer Science , 3.5 1997  – 2000 Universidade Santa Cecília Bachelor's degree,  Computer Science , 3.5 1997  – 2000 College Integração Data Processing 1994  – 1996 College Integração Data Processing 1994  – 1996 College Integração Data Processing 1994  – 1996 Honors & Awards ", "Summary I am a Senior Engineering Manager that applies fast development methodologies to deliver great user experiences iteratively validating hypotheses along the process in build-measure-learn cycles. \n \nI am an Inspiring Leader specialized in identifying talent and assembling high efficient and functional teams that abide by the highest standards on development processes and product quality. \n \nI am a very passionate and well-rounded Front-End Engineer / Web Developer / Web Designer with more than 15 years of experience in the Internet industry designing, developing and maintaining web sites and web applications for different scales, markets, languages and cultures. Summary I am a Senior Engineering Manager that applies fast development methodologies to deliver great user experiences iteratively validating hypotheses along the process in build-measure-learn cycles. \n \nI am an Inspiring Leader specialized in identifying talent and assembling high efficient and functional teams that abide by the highest standards on development processes and product quality. \n \nI am a very passionate and well-rounded Front-End Engineer / Web Developer / Web Designer with more than 15 years of experience in the Internet industry designing, developing and maintaining web sites and web applications for different scales, markets, languages and cultures. I am a Senior Engineering Manager that applies fast development methodologies to deliver great user experiences iteratively validating hypotheses along the process in build-measure-learn cycles. \n \nI am an Inspiring Leader specialized in identifying talent and assembling high efficient and functional teams that abide by the highest standards on development processes and product quality. \n \nI am a very passionate and well-rounded Front-End Engineer / Web Developer / Web Designer with more than 15 years of experience in the Internet industry designing, developing and maintaining web sites and web applications for different scales, markets, languages and cultures. I am a Senior Engineering Manager that applies fast development methodologies to deliver great user experiences iteratively validating hypotheses along the process in build-measure-learn cycles. \n \nI am an Inspiring Leader specialized in identifying talent and assembling high efficient and functional teams that abide by the highest standards on development processes and product quality. \n \nI am a very passionate and well-rounded Front-End Engineer / Web Developer / Web Designer with more than 15 years of experience in the Internet industry designing, developing and maintaining web sites and web applications for different scales, markets, languages and cultures. Experience Senior Engineering Manager Yahoo October 2013  – Present (1 year 11 months) Santa Monica, CA US Front-End Engineer / Web Developer bergbrandt.com November 1999  – Present (15 years 10 months) Engineering Manager Yahoo! January 2013  –  September 2013  (9 months) Santa Monica, CA US Engineering Team Leader Yahoo! July 2011  –  January 2013  (1 year 7 months) Santa Monica, CA US Senior Front-End Engineer Yahoo! March 2011  –  January 2013  (1 year 11 months) Santa Monica, CA US Front-End Engineer Yahoo! July 2007  –  January 2013  (5 years 7 months) Front-End Engineer Yahoo! September 2009  –  February 2011  (1 year 6 months) Santa Monica, CA US Front-End Engineer Yahoo! Canada July 2007  –  August 2009  (2 years 2 months) Front-End Engineer & Designer - Extension Course Instructor Faculdade Marista do Recife March 2007  –  September 2007  (7 months) Front-End Engineer Pitang March 2006  –  July 2007  (1 year 5 months) Interface Designer Lab. P&D Unicap-Itautec May 2003  –  February 2006  (2 years 10 months) Web/Multimedia Director Mid Comunicação e Editora Digital September 2001  –  October 2002  (1 year 2 months) Web Designer Inovação Comunicação Interativa March 2001  –  June 2001  (4 months) Web Designer Mundi Direct September 2000  –  February 2001  (6 months) Senior Engineering Manager Yahoo October 2013  – Present (1 year 11 months) Santa Monica, CA US Senior Engineering Manager Yahoo October 2013  – Present (1 year 11 months) Santa Monica, CA US Front-End Engineer / Web Developer bergbrandt.com November 1999  – Present (15 years 10 months) Front-End Engineer / Web Developer bergbrandt.com November 1999  – Present (15 years 10 months) Engineering Manager Yahoo! January 2013  –  September 2013  (9 months) Santa Monica, CA US Engineering Manager Yahoo! January 2013  –  September 2013  (9 months) Santa Monica, CA US Engineering Team Leader Yahoo! July 2011  –  January 2013  (1 year 7 months) Santa Monica, CA US Engineering Team Leader Yahoo! July 2011  –  January 2013  (1 year 7 months) Santa Monica, CA US Senior Front-End Engineer Yahoo! March 2011  –  January 2013  (1 year 11 months) Santa Monica, CA US Senior Front-End Engineer Yahoo! March 2011  –  January 2013  (1 year 11 months) Santa Monica, CA US Front-End Engineer Yahoo! July 2007  –  January 2013  (5 years 7 months) Front-End Engineer Yahoo! July 2007  –  January 2013  (5 years 7 months) Front-End Engineer Yahoo! September 2009  –  February 2011  (1 year 6 months) Santa Monica, CA US Front-End Engineer Yahoo! September 2009  –  February 2011  (1 year 6 months) Santa Monica, CA US Front-End Engineer Yahoo! Canada July 2007  –  August 2009  (2 years 2 months) Front-End Engineer Yahoo! Canada July 2007  –  August 2009  (2 years 2 months) Front-End Engineer & Designer - Extension Course Instructor Faculdade Marista do Recife March 2007  –  September 2007  (7 months) Front-End Engineer & Designer - Extension Course Instructor Faculdade Marista do Recife March 2007  –  September 2007  (7 months) Front-End Engineer Pitang March 2006  –  July 2007  (1 year 5 months) Front-End Engineer Pitang March 2006  –  July 2007  (1 year 5 months) Interface Designer Lab. P&D Unicap-Itautec May 2003  –  February 2006  (2 years 10 months) Interface Designer Lab. P&D Unicap-Itautec May 2003  –  February 2006  (2 years 10 months) Web/Multimedia Director Mid Comunicação e Editora Digital September 2001  –  October 2002  (1 year 2 months) Web/Multimedia Director Mid Comunicação e Editora Digital September 2001  –  October 2002  (1 year 2 months) Web Designer Inovação Comunicação Interativa March 2001  –  June 2001  (4 months) Web Designer Inovação Comunicação Interativa March 2001  –  June 2001  (4 months) Web Designer Mundi Direct September 2000  –  February 2001  (6 months) Web Designer Mundi Direct September 2000  –  February 2001  (6 months) Languages Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Elementary proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Elementary proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Front-end Engineering Front-end Development Web Development Web Design User Experience User Interface Design Team Leadership Team Management Lean Startup Lean Software... CSS CSS3 HTML HTML 5 JavaScript OOP PHP Scrum Kanban Mobile Devices Software Design Software Design Patterns Team Building Teamwork Photoshop Illustrator SASS Compass Front-end Agile Methodologies Cross-functional Team... User Interface Ruby on Rails Software Development Web Applications Apache Linux REST JSON Git LAMP jQuery Accessibility AJAX XHTML Ruby Mobile Applications Subversion MVC Usability See 35+     See less Skills  Front-end Engineering Front-end Development Web Development Web Design User Experience User Interface Design Team Leadership Team Management Lean Startup Lean Software... CSS CSS3 HTML HTML 5 JavaScript OOP PHP Scrum Kanban Mobile Devices Software Design Software Design Patterns Team Building Teamwork Photoshop Illustrator SASS Compass Front-end Agile Methodologies Cross-functional Team... User Interface Ruby on Rails Software Development Web Applications Apache Linux REST JSON Git LAMP jQuery Accessibility AJAX XHTML Ruby Mobile Applications Subversion MVC Usability See 35+     See less Front-end Engineering Front-end Development Web Development Web Design User Experience User Interface Design Team Leadership Team Management Lean Startup Lean Software... CSS CSS3 HTML HTML 5 JavaScript OOP PHP Scrum Kanban Mobile Devices Software Design Software Design Patterns Team Building Teamwork Photoshop Illustrator SASS Compass Front-end Agile Methodologies Cross-functional Team... User Interface Ruby on Rails Software Development Web Applications Apache Linux REST JSON Git LAMP jQuery Accessibility AJAX XHTML Ruby Mobile Applications Subversion MVC Usability See 35+     See less Front-end Engineering Front-end Development Web Development Web Design User Experience User Interface Design Team Leadership Team Management Lean Startup Lean Software... CSS CSS3 HTML HTML 5 JavaScript OOP PHP Scrum Kanban Mobile Devices Software Design Software Design Patterns Team Building Teamwork Photoshop Illustrator SASS Compass Front-end Agile Methodologies Cross-functional Team... User Interface Ruby on Rails Software Development Web Applications Apache Linux REST JSON Git LAMP jQuery Accessibility AJAX XHTML Ruby Mobile Applications Subversion MVC Usability See 35+     See less Education Frassinetti School of Recife - FAFIRE PGP/MBA 2004  – 2005 Universidade Federal de Pernambuco Bachelor 1996  – 2003 Colégio Vera Cruz High School 1987  – 1995 Frassinetti School of Recife - FAFIRE PGP/MBA 2004  – 2005 Frassinetti School of Recife - FAFIRE PGP/MBA 2004  – 2005 Frassinetti School of Recife - FAFIRE PGP/MBA 2004  – 2005 Universidade Federal de Pernambuco Bachelor 1996  – 2003 Universidade Federal de Pernambuco Bachelor 1996  – 2003 Universidade Federal de Pernambuco Bachelor 1996  – 2003 Colégio Vera Cruz High School 1987  – 1995 Colégio Vera Cruz High School 1987  – 1995 Colégio Vera Cruz High School 1987  – 1995 Honors & Awards Yahoo! Superstar 2011 (team) – Yahoo Publishing Platform Yahoo! September 2011 Peixe Grande 2005 (Big Fish 2005) – Web Design Magazine – Top 5 Brazilian portfolios. Arteccom December 2005 Yahoo! Global Media and Commerce - Technical Excellence Award Yahoo! October 2012 Additional Honors & Awards Peixe Grande Portfolio Awards 2005 - Winner Yahoo! Superstar 2011 (team) – Yahoo Publishing Platform Yahoo! September 2011 Yahoo! Superstar 2011 (team) – Yahoo Publishing Platform Yahoo! September 2011 Yahoo! Superstar 2011 (team) – Yahoo Publishing Platform Yahoo! September 2011 Peixe Grande 2005 (Big Fish 2005) – Web Design Magazine – Top 5 Brazilian portfolios. Arteccom December 2005 Peixe Grande 2005 (Big Fish 2005) – Web Design Magazine – Top 5 Brazilian portfolios. Arteccom December 2005 Peixe Grande 2005 (Big Fish 2005) – Web Design Magazine – Top 5 Brazilian portfolios. Arteccom December 2005 Yahoo! Global Media and Commerce - Technical Excellence Award Yahoo! October 2012 Yahoo! Global Media and Commerce - Technical Excellence Award Yahoo! October 2012 Yahoo! Global Media and Commerce - Technical Excellence Award Yahoo! October 2012 Additional Honors & Awards Peixe Grande Portfolio Awards 2005 - Winner Additional Honors & Awards Peixe Grande Portfolio Awards 2005 - Winner Additional Honors & Awards Peixe Grande Portfolio Awards 2005 - Winner ", "Summary Lead Front end developer for Yahoo! Deals. Expert in PHP and Mojito based wed applications. Specialties:Oracle Certified PL/SQL Developer(9i) \nJava, J2EE, PL/SQL, Javascript, CSS/CSS3 and HTML/HTML5 \nBEA Weblogic, JBoss, Glassfish.Site Speed, Performance Improvements, Browser quirks, Mojito Summary Lead Front end developer for Yahoo! Deals. Expert in PHP and Mojito based wed applications. Specialties:Oracle Certified PL/SQL Developer(9i) \nJava, J2EE, PL/SQL, Javascript, CSS/CSS3 and HTML/HTML5 \nBEA Weblogic, JBoss, Glassfish.Site Speed, Performance Improvements, Browser quirks, Mojito Lead Front end developer for Yahoo! Deals. Expert in PHP and Mojito based wed applications. Specialties:Oracle Certified PL/SQL Developer(9i) \nJava, J2EE, PL/SQL, Javascript, CSS/CSS3 and HTML/HTML5 \nBEA Weblogic, JBoss, Glassfish.Site Speed, Performance Improvements, Browser quirks, Mojito Lead Front end developer for Yahoo! Deals. Expert in PHP and Mojito based wed applications. Specialties:Oracle Certified PL/SQL Developer(9i) \nJava, J2EE, PL/SQL, Javascript, CSS/CSS3 and HTML/HTML5 \nBEA Weblogic, JBoss, Glassfish.Site Speed, Performance Improvements, Browser quirks, Mojito Experience Staff Front End Engineer Intuit July 2014  – Present (1 year 2 months) Menlo Park Senior Front End Engineer Intuit September 2012  –  June 2014  (1 year 10 months) Menlo park, CA Front End Developer Yahoo! Deals August 2010  –  August 2012  (2 years 1 month) Sunnyvale, CA End to End Developer for the following pages/services in Yahoo! Deals\t \n•\tLocal deals landing/details page(v1.0/v2.0/v3.0). \n•\tLocal deals browse page and search page. \n•\tUser location detection feature enhancement. \n•\tGlobalization of Yahoo! Deals.  \n•\tHong Kong Local deals pages. \n•\tSite wide traffic tracking features. \n•\tAdept in browser quirks and page speed improvements \n•\tDeals mobile app for Iphone (Creator and Implemented prototype). \n•\tSeasonal page developments like black Friday, Christmas eve etc \n•\tCurrently working on tablet version of Yahoo! deals using Mojito \n•\tLead front end developer for various upcoming Yahoo! Deals’s pages.www.deals.yahoo.com and www.hk.deals.yahoo.com Front End Developer Yahoo! Personals June 2009  –  July 2010  (1 year 2 months) Sunnyvale, CA •\tEmail templates for Matches by Mail Alert service of Yahoo! Personals. \n•\tRedesign of Yahoo! Personals home page. \n•\tSearch monkey inforbar plugin for Yahoo! Personals. \n•\tFront End Dev for New Profile search options like search by Ethnicity/Religion etc. \n•\tFront End Lead for Yahoo! Personals Migration with Match.com and responsible for completion of interstitial, migration and payment pages. \nwww.personals.yahoo.com Front End Developer Intern Yahoo! Personals June 2008  –  May 2009  (1 year) Assistant System Engineer Tata Consultancy Services September 2005  –  July 2007  (1 year 11 months) Developer and Production Support for the Electronic Billing Presentment and Payment portal of British Telecom. Had been in direct exposure to clients and have good experience in understanding customer requirements and needs. The Portal has its base on technologies like J2EE, Oracle and Ab-Initio. Had also been involved in few phases of system testing and audits. Staff Front End Engineer Intuit July 2014  – Present (1 year 2 months) Menlo Park Staff Front End Engineer Intuit July 2014  – Present (1 year 2 months) Menlo Park Senior Front End Engineer Intuit September 2012  –  June 2014  (1 year 10 months) Menlo park, CA Senior Front End Engineer Intuit September 2012  –  June 2014  (1 year 10 months) Menlo park, CA Front End Developer Yahoo! Deals August 2010  –  August 2012  (2 years 1 month) Sunnyvale, CA End to End Developer for the following pages/services in Yahoo! Deals\t \n•\tLocal deals landing/details page(v1.0/v2.0/v3.0). \n•\tLocal deals browse page and search page. \n•\tUser location detection feature enhancement. \n•\tGlobalization of Yahoo! Deals.  \n•\tHong Kong Local deals pages. \n•\tSite wide traffic tracking features. \n•\tAdept in browser quirks and page speed improvements \n•\tDeals mobile app for Iphone (Creator and Implemented prototype). \n•\tSeasonal page developments like black Friday, Christmas eve etc \n•\tCurrently working on tablet version of Yahoo! deals using Mojito \n•\tLead front end developer for various upcoming Yahoo! Deals’s pages.www.deals.yahoo.com and www.hk.deals.yahoo.com Front End Developer Yahoo! Deals August 2010  –  August 2012  (2 years 1 month) Sunnyvale, CA End to End Developer for the following pages/services in Yahoo! Deals\t \n•\tLocal deals landing/details page(v1.0/v2.0/v3.0). \n•\tLocal deals browse page and search page. \n•\tUser location detection feature enhancement. \n•\tGlobalization of Yahoo! Deals.  \n•\tHong Kong Local deals pages. \n•\tSite wide traffic tracking features. \n•\tAdept in browser quirks and page speed improvements \n•\tDeals mobile app for Iphone (Creator and Implemented prototype). \n•\tSeasonal page developments like black Friday, Christmas eve etc \n•\tCurrently working on tablet version of Yahoo! deals using Mojito \n•\tLead front end developer for various upcoming Yahoo! Deals’s pages.www.deals.yahoo.com and www.hk.deals.yahoo.com Front End Developer Yahoo! Personals June 2009  –  July 2010  (1 year 2 months) Sunnyvale, CA •\tEmail templates for Matches by Mail Alert service of Yahoo! Personals. \n•\tRedesign of Yahoo! Personals home page. \n•\tSearch monkey inforbar plugin for Yahoo! Personals. \n•\tFront End Dev for New Profile search options like search by Ethnicity/Religion etc. \n•\tFront End Lead for Yahoo! Personals Migration with Match.com and responsible for completion of interstitial, migration and payment pages. \nwww.personals.yahoo.com Front End Developer Yahoo! Personals June 2009  –  July 2010  (1 year 2 months) Sunnyvale, CA •\tEmail templates for Matches by Mail Alert service of Yahoo! Personals. \n•\tRedesign of Yahoo! Personals home page. \n•\tSearch monkey inforbar plugin for Yahoo! Personals. \n•\tFront End Dev for New Profile search options like search by Ethnicity/Religion etc. \n•\tFront End Lead for Yahoo! Personals Migration with Match.com and responsible for completion of interstitial, migration and payment pages. \nwww.personals.yahoo.com Front End Developer Intern Yahoo! Personals June 2008  –  May 2009  (1 year) Front End Developer Intern Yahoo! Personals June 2008  –  May 2009  (1 year) Assistant System Engineer Tata Consultancy Services September 2005  –  July 2007  (1 year 11 months) Developer and Production Support for the Electronic Billing Presentment and Payment portal of British Telecom. Had been in direct exposure to clients and have good experience in understanding customer requirements and needs. The Portal has its base on technologies like J2EE, Oracle and Ab-Initio. Had also been involved in few phases of system testing and audits. Assistant System Engineer Tata Consultancy Services September 2005  –  July 2007  (1 year 11 months) Developer and Production Support for the Electronic Billing Presentment and Payment portal of British Telecom. Had been in direct exposure to clients and have good experience in understanding customer requirements and needs. The Portal has its base on technologies like J2EE, Oracle and Ab-Initio. Had also been involved in few phases of system testing and audits. Skills HTML/HTML 5 Advanced CSS JavaScript PHP Oracle PL/SQL AJAX YUI Photoshop Gimp XML Mojito Skills  HTML/HTML 5 Advanced CSS JavaScript PHP Oracle PL/SQL AJAX YUI Photoshop Gimp XML Mojito HTML/HTML 5 Advanced CSS JavaScript PHP Oracle PL/SQL AJAX YUI Photoshop Gimp XML Mojito HTML/HTML 5 Advanced CSS JavaScript PHP Oracle PL/SQL AJAX YUI Photoshop Gimp XML Mojito Education San Jose State University Masters,  Software Engineering 2007  – 2009 Shanmugha Arts, Science, Technology and Research Academy B.Tech,  Information Technology 2001  – 2005 MLM Mamallan Matriculation School Schooling 1991  – 2001 San Jose State University Masters,  Software Engineering 2007  – 2009 San Jose State University Masters,  Software Engineering 2007  – 2009 San Jose State University Masters,  Software Engineering 2007  – 2009 Shanmugha Arts, Science, Technology and Research Academy B.Tech,  Information Technology 2001  – 2005 Shanmugha Arts, Science, Technology and Research Academy B.Tech,  Information Technology 2001  – 2005 Shanmugha Arts, Science, Technology and Research Academy B.Tech,  Information Technology 2001  – 2005 MLM Mamallan Matriculation School Schooling 1991  – 2001 MLM Mamallan Matriculation School Schooling 1991  – 2001 MLM Mamallan Matriculation School Schooling 1991  – 2001 Honors & Awards Additional Honors & Awards Univerity topper and Best Outgoing Student of the Academic year(2004-2005) \nState level Table tennis player during high school. \nBest Sportsperson award in School and College. Additional Honors & Awards Univerity topper and Best Outgoing Student of the Academic year(2004-2005) \nState level Table tennis player during high school. \nBest Sportsperson award in School and College. Additional Honors & Awards Univerity topper and Best Outgoing Student of the Academic year(2004-2005) \nState level Table tennis player during high school. \nBest Sportsperson award in School and College. Additional Honors & Awards Univerity topper and Best Outgoing Student of the Academic year(2004-2005) \nState level Table tennis player during high school. \nBest Sportsperson award in School and College. ", "Summary System designer, Software Engineer, Application developer, Web Front-end Engineer, Technical lead in financial and internet domain applications. Interested in the design of client/server model applications, relational databases, search engine and related middleware engineering. Summary System designer, Software Engineer, Application developer, Web Front-end Engineer, Technical lead in financial and internet domain applications. Interested in the design of client/server model applications, relational databases, search engine and related middleware engineering. System designer, Software Engineer, Application developer, Web Front-end Engineer, Technical lead in financial and internet domain applications. Interested in the design of client/server model applications, relational databases, search engine and related middleware engineering. System designer, Software Engineer, Application developer, Web Front-end Engineer, Technical lead in financial and internet domain applications. Interested in the design of client/server model applications, relational databases, search engine and related middleware engineering. Experience Senior Front-end Engineer Indochino Apparel Inc October 2013  – Present (1 year 11 months) Highlights:  \n \n1. Web application development & maintenance expertise \n2. Responsive, Cross-browser compliant, engaging User experience \n3. Expert skillset in HTML5, CSS3 & Javascript technologies \n4. Committed, motivated & driven individual contributor with Integrity \n5. Performed Lead & supervisory role Senior Front-end Engineer Indochino 2013  –  2015  (2 years) Senior Front-end Engineer Indochino 2013  –  2015  (2 years) Technical Lead Yahoo! March 2008  –  October 2013  (5 years 8 months) Highlights: \n \n1. Lead of web front-end systems \n2. Design and development of front-end  \n3. Estimation and sprinting of tasks \n4. Evaluation and proposal of MVC presentation frameworks  \n5. Rich Internet application development \n6. Development of ajax-driven, performant widgets \n7. Configuration, packaging and deployment of the user interface files Senior software engineer Yahoo! Inc October 2007  –  March 2008  (6 months) Web front-end systems architecture, Web developer, Front-end engineer, design/development of REST based web services, Local paranoid (FE security expert), web performance and design for globalization (internationalization and localization) Software Engineer Yahoo! India October 2005  –  August 2006  (11 months) Highlights/specialities: \n \n1. Design and development of Feed processing system \n2. Design and creation of database schema for jobs feed \n3. Exploration, design and deployment of Vertical search engine \n4. Development of software components  \n5. Search engine optimization \n6. Front-end and database performance tuning  \n7. Addressing scalability requirements of the site, tuning of MySQL database. \n8. Development/coding/rapid prototyping of web page designs,  \n9. Conformance reviews/implementations covering all aspects of usability, W3C - accessibility, scalability & security. Assistant Systems Engineer Tata Consultancy Services Ltd. October 2003  –  October 2005  (2 years 1 month) Senior Front-end Engineer Indochino Apparel Inc October 2013  – Present (1 year 11 months) Highlights:  \n \n1. Web application development & maintenance expertise \n2. Responsive, Cross-browser compliant, engaging User experience \n3. Expert skillset in HTML5, CSS3 & Javascript technologies \n4. Committed, motivated & driven individual contributor with Integrity \n5. Performed Lead & supervisory role Senior Front-end Engineer Indochino Apparel Inc October 2013  – Present (1 year 11 months) Highlights:  \n \n1. Web application development & maintenance expertise \n2. Responsive, Cross-browser compliant, engaging User experience \n3. Expert skillset in HTML5, CSS3 & Javascript technologies \n4. Committed, motivated & driven individual contributor with Integrity \n5. Performed Lead & supervisory role Senior Front-end Engineer Indochino 2013  –  2015  (2 years) Senior Front-end Engineer Indochino 2013  –  2015  (2 years) Senior Front-end Engineer Indochino 2013  –  2015  (2 years) Senior Front-end Engineer Indochino 2013  –  2015  (2 years) Technical Lead Yahoo! March 2008  –  October 2013  (5 years 8 months) Highlights: \n \n1. Lead of web front-end systems \n2. Design and development of front-end  \n3. Estimation and sprinting of tasks \n4. Evaluation and proposal of MVC presentation frameworks  \n5. Rich Internet application development \n6. Development of ajax-driven, performant widgets \n7. Configuration, packaging and deployment of the user interface files Technical Lead Yahoo! March 2008  –  October 2013  (5 years 8 months) Highlights: \n \n1. Lead of web front-end systems \n2. Design and development of front-end  \n3. Estimation and sprinting of tasks \n4. Evaluation and proposal of MVC presentation frameworks  \n5. Rich Internet application development \n6. Development of ajax-driven, performant widgets \n7. Configuration, packaging and deployment of the user interface files Senior software engineer Yahoo! Inc October 2007  –  March 2008  (6 months) Web front-end systems architecture, Web developer, Front-end engineer, design/development of REST based web services, Local paranoid (FE security expert), web performance and design for globalization (internationalization and localization) Senior software engineer Yahoo! Inc October 2007  –  March 2008  (6 months) Web front-end systems architecture, Web developer, Front-end engineer, design/development of REST based web services, Local paranoid (FE security expert), web performance and design for globalization (internationalization and localization) Software Engineer Yahoo! India October 2005  –  August 2006  (11 months) Highlights/specialities: \n \n1. Design and development of Feed processing system \n2. Design and creation of database schema for jobs feed \n3. Exploration, design and deployment of Vertical search engine \n4. Development of software components  \n5. Search engine optimization \n6. Front-end and database performance tuning  \n7. Addressing scalability requirements of the site, tuning of MySQL database. \n8. Development/coding/rapid prototyping of web page designs,  \n9. Conformance reviews/implementations covering all aspects of usability, W3C - accessibility, scalability & security. Software Engineer Yahoo! India October 2005  –  August 2006  (11 months) Highlights/specialities: \n \n1. Design and development of Feed processing system \n2. Design and creation of database schema for jobs feed \n3. Exploration, design and deployment of Vertical search engine \n4. Development of software components  \n5. Search engine optimization \n6. Front-end and database performance tuning  \n7. Addressing scalability requirements of the site, tuning of MySQL database. \n8. Development/coding/rapid prototyping of web page designs,  \n9. Conformance reviews/implementations covering all aspects of usability, W3C - accessibility, scalability & security. Assistant Systems Engineer Tata Consultancy Services Ltd. October 2003  –  October 2005  (2 years 1 month) Assistant Systems Engineer Tata Consultancy Services Ltd. October 2003  –  October 2005  (2 years 1 month) Skills JavaScript Linux PHP CSS DHTML MVC Semantic Web HTML C++ Front-end Development Unix User Interface Design Patterns JSON Apache Subversion CVS Data Structures AJAX Web Services OOP Shell Scripting Front-end Perl MySQL jQuery Web Applications Java Enterprise Edition REST See 14+     See less Skills  JavaScript Linux PHP CSS DHTML MVC Semantic Web HTML C++ Front-end Development Unix User Interface Design Patterns JSON Apache Subversion CVS Data Structures AJAX Web Services OOP Shell Scripting Front-end Perl MySQL jQuery Web Applications Java Enterprise Edition REST See 14+     See less JavaScript Linux PHP CSS DHTML MVC Semantic Web HTML C++ Front-end Development Unix User Interface Design Patterns JSON Apache Subversion CVS Data Structures AJAX Web Services OOP Shell Scripting Front-end Perl MySQL jQuery Web Applications Java Enterprise Edition REST See 14+     See less JavaScript Linux PHP CSS DHTML MVC Semantic Web HTML C++ Front-end Development Unix User Interface Design Patterns JSON Apache Subversion CVS Data Structures AJAX Web Services OOP Shell Scripting Front-end Perl MySQL jQuery Web Applications Java Enterprise Edition REST See 14+     See less Education Anna University B.E.,  Computer Science & Engg 1999  – 2003 Activities and Societies:  Computer Society ,  Students Quality Club ,  NSS Anna University B.E.,  Computer Science & Engg 1999  – 2003 Activities and Societies:  Computer Society ,  Students Quality Club ,  NSS Anna University B.E.,  Computer Science & Engg 1999  – 2003 Activities and Societies:  Computer Society ,  Students Quality Club ,  NSS Anna University B.E.,  Computer Science & Engg 1999  – 2003 Activities and Societies:  Computer Society ,  Students Quality Club ,  NSS "]}