{"position": "Internationalization Solutions", "company": "Google", "profiles": ["Skills SOA Weblogic Java Enterprise Edition Distributed Systems Middleware Enterprise Software Cloud Computing Java Enterprise Architecture Oracle Software Development XML Agile Methodologies Web Services SaaS REST Software Engineering Solution Architecture Unix See 4+     See less Skills  SOA Weblogic Java Enterprise Edition Distributed Systems Middleware Enterprise Software Cloud Computing Java Enterprise Architecture Oracle Software Development XML Agile Methodologies Web Services SaaS REST Software Engineering Solution Architecture Unix See 4+     See less SOA Weblogic Java Enterprise Edition Distributed Systems Middleware Enterprise Software Cloud Computing Java Enterprise Architecture Oracle Software Development XML Agile Methodologies Web Services SaaS REST Software Engineering Solution Architecture Unix See 4+     See less SOA Weblogic Java Enterprise Edition Distributed Systems Middleware Enterprise Software Cloud Computing Java Enterprise Architecture Oracle Software Development XML Agile Methodologies Web Services SaaS REST Software Engineering Solution Architecture Unix See 4+     See less ", "Summary Proven translation and technical support skills Summary Proven translation and technical support skills Proven translation and technical support skills Proven translation and technical support skills Experience Internationalization Specialist Applied Systems Canada September 2013  – Present (2 years) Montreal, Quebec Translate and localize insurance software for Canada and other markets Technical Support \\ Translator Home-Based Business April 2008  –  September 2013  (5 years 6 months) Provide professional technical support and translation services \n \nAchievements \nDelivered technical support (clients in Canada), translation/language-related services (HP, Yale University and Université Jean Moulin 3, Lyon, France) Senior Translator Ernst & Young Canada, LLP, Montreal, Quebec April 2007  –  April 2008  (1 year 1 month) Translated financial documents (French to English). Principal Translator SDL International (Canada) Inc., Montreal, Quebec March 2003  –  March 2007  (4 years 1 month) Translated and revised medical, pharmaceutical, insurance, legal, telecommunications, computer and other business documents for major companies (French to Canadian and US English). Occasionally translated and revised German-to-English documents. \n \nAchievements \nDelivered translations for Petro-Canada, GE Healthcare, Hoffmann-LaRoche, Merck Frosst Canada, GM Canada, Cour du Québec, Vidéotron, Pratt & Whitney, TELUS and other clients. Technical Support Traf-Park Inc., Boucherville, Quebec August 2002  –  January 2003  (6 months) Installed and provided technical support in English and French for Windows software used to centrally manage car parks. Did software support, testing and development. Company acquired by Cubic Transportation Systems, Inc. in the USA. \n \nAchievements \nEnsured the efficient operation of parking systems for major clients, including Lakeshore General Hospital and the Old Port of Montréal. Technical Support eSys Medical, Montreal, Quebec (now Eclipsys) March 2002  –  August 2002  (6 months) Installed and provided technical support in English and French for Windows software used to manage radiology clinics. Did software support, testing and development. Company acquired by Eclipsys Corporation in the USA and relocated. \n \nAchievements \nInstalled and supported radiology information systems (RIS) at Radiologie Laënnec (Montréal), Imagerie Médicale Westmount Square (Montréal), Hawkesbury & District General Hospital (Ontario) and other clients. Technical Support Director Idex Med Inc., Montreal, Quebec January 1996  –  February 2002  (6 years 2 months) Managed client relationships with asthma centres across Canada sponsored by GlaxoSmithKline (international pharmaceutical company). Installed and networked client-server applications and computer hardware for disease management in various Windows environments. Diagnosed and tracked technical problems and provided user support. \n \nAchievements \nProvided remote and onsite technical support in English and French to more than 50 asthma centres in hospitals and clinics across Canada. Customized the system to meet the needs of each centre. Internationalization Specialist Applied Systems Canada September 2013  – Present (2 years) Montreal, Quebec Translate and localize insurance software for Canada and other markets Internationalization Specialist Applied Systems Canada September 2013  – Present (2 years) Montreal, Quebec Translate and localize insurance software for Canada and other markets Technical Support \\ Translator Home-Based Business April 2008  –  September 2013  (5 years 6 months) Provide professional technical support and translation services \n \nAchievements \nDelivered technical support (clients in Canada), translation/language-related services (HP, Yale University and Université Jean Moulin 3, Lyon, France) Technical Support \\ Translator Home-Based Business April 2008  –  September 2013  (5 years 6 months) Provide professional technical support and translation services \n \nAchievements \nDelivered technical support (clients in Canada), translation/language-related services (HP, Yale University and Université Jean Moulin 3, Lyon, France) Senior Translator Ernst & Young Canada, LLP, Montreal, Quebec April 2007  –  April 2008  (1 year 1 month) Translated financial documents (French to English). Senior Translator Ernst & Young Canada, LLP, Montreal, Quebec April 2007  –  April 2008  (1 year 1 month) Translated financial documents (French to English). Principal Translator SDL International (Canada) Inc., Montreal, Quebec March 2003  –  March 2007  (4 years 1 month) Translated and revised medical, pharmaceutical, insurance, legal, telecommunications, computer and other business documents for major companies (French to Canadian and US English). Occasionally translated and revised German-to-English documents. \n \nAchievements \nDelivered translations for Petro-Canada, GE Healthcare, Hoffmann-LaRoche, Merck Frosst Canada, GM Canada, Cour du Québec, Vidéotron, Pratt & Whitney, TELUS and other clients. Principal Translator SDL International (Canada) Inc., Montreal, Quebec March 2003  –  March 2007  (4 years 1 month) Translated and revised medical, pharmaceutical, insurance, legal, telecommunications, computer and other business documents for major companies (French to Canadian and US English). Occasionally translated and revised German-to-English documents. \n \nAchievements \nDelivered translations for Petro-Canada, GE Healthcare, Hoffmann-LaRoche, Merck Frosst Canada, GM Canada, Cour du Québec, Vidéotron, Pratt & Whitney, TELUS and other clients. Technical Support Traf-Park Inc., Boucherville, Quebec August 2002  –  January 2003  (6 months) Installed and provided technical support in English and French for Windows software used to centrally manage car parks. Did software support, testing and development. Company acquired by Cubic Transportation Systems, Inc. in the USA. \n \nAchievements \nEnsured the efficient operation of parking systems for major clients, including Lakeshore General Hospital and the Old Port of Montréal. Technical Support Traf-Park Inc., Boucherville, Quebec August 2002  –  January 2003  (6 months) Installed and provided technical support in English and French for Windows software used to centrally manage car parks. Did software support, testing and development. Company acquired by Cubic Transportation Systems, Inc. in the USA. \n \nAchievements \nEnsured the efficient operation of parking systems for major clients, including Lakeshore General Hospital and the Old Port of Montréal. Technical Support eSys Medical, Montreal, Quebec (now Eclipsys) March 2002  –  August 2002  (6 months) Installed and provided technical support in English and French for Windows software used to manage radiology clinics. Did software support, testing and development. Company acquired by Eclipsys Corporation in the USA and relocated. \n \nAchievements \nInstalled and supported radiology information systems (RIS) at Radiologie Laënnec (Montréal), Imagerie Médicale Westmount Square (Montréal), Hawkesbury & District General Hospital (Ontario) and other clients. Technical Support eSys Medical, Montreal, Quebec (now Eclipsys) March 2002  –  August 2002  (6 months) Installed and provided technical support in English and French for Windows software used to manage radiology clinics. Did software support, testing and development. Company acquired by Eclipsys Corporation in the USA and relocated. \n \nAchievements \nInstalled and supported radiology information systems (RIS) at Radiologie Laënnec (Montréal), Imagerie Médicale Westmount Square (Montréal), Hawkesbury & District General Hospital (Ontario) and other clients. Technical Support Director Idex Med Inc., Montreal, Quebec January 1996  –  February 2002  (6 years 2 months) Managed client relationships with asthma centres across Canada sponsored by GlaxoSmithKline (international pharmaceutical company). Installed and networked client-server applications and computer hardware for disease management in various Windows environments. Diagnosed and tracked technical problems and provided user support. \n \nAchievements \nProvided remote and onsite technical support in English and French to more than 50 asthma centres in hospitals and clinics across Canada. Customized the system to meet the needs of each centre. Technical Support Director Idex Med Inc., Montreal, Quebec January 1996  –  February 2002  (6 years 2 months) Managed client relationships with asthma centres across Canada sponsored by GlaxoSmithKline (international pharmaceutical company). Installed and networked client-server applications and computer hardware for disease management in various Windows environments. Diagnosed and tracked technical problems and provided user support. \n \nAchievements \nProvided remote and onsite technical support in English and French to more than 50 asthma centres in hospitals and clinics across Canada. Customized the system to meet the needs of each centre. Languages English Native or bilingual proficiency French Native or bilingual proficiency German Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Native or bilingual proficiency German Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Native or bilingual proficiency German Professional working proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Healthcare Information... French German Irish Medical Devices Windows Technical Translation Windows 7 Windows XP Professional Computer Hardware... Software Installation Hardware Installation Hardware Diagnostics Foreign Languages European Studies Western Europe Fluent English International Background English Microsoft Office Teamwork Fast Learner Word Chrome Help Desk Management Export Development MS Office tools Remote Support Trados Bug Tracking International... Remote Desktop Troubleshooting International Relations Microsoft Word Export SDL Editing Localization Machine Translation Website Localization Globalization XP Linguistics Help Desk Support Technical Support Language Services Spanish International Business Translation See 35+     See less Skills  Healthcare Information... French German Irish Medical Devices Windows Technical Translation Windows 7 Windows XP Professional Computer Hardware... Software Installation Hardware Installation Hardware Diagnostics Foreign Languages European Studies Western Europe Fluent English International Background English Microsoft Office Teamwork Fast Learner Word Chrome Help Desk Management Export Development MS Office tools Remote Support Trados Bug Tracking International... Remote Desktop Troubleshooting International Relations Microsoft Word Export SDL Editing Localization Machine Translation Website Localization Globalization XP Linguistics Help Desk Support Technical Support Language Services Spanish International Business Translation See 35+     See less Healthcare Information... French German Irish Medical Devices Windows Technical Translation Windows 7 Windows XP Professional Computer Hardware... Software Installation Hardware Installation Hardware Diagnostics Foreign Languages European Studies Western Europe Fluent English International Background English Microsoft Office Teamwork Fast Learner Word Chrome Help Desk Management Export Development MS Office tools Remote Support Trados Bug Tracking International... Remote Desktop Troubleshooting International Relations Microsoft Word Export SDL Editing Localization Machine Translation Website Localization Globalization XP Linguistics Help Desk Support Technical Support Language Services Spanish International Business Translation See 35+     See less Healthcare Information... French German Irish Medical Devices Windows Technical Translation Windows 7 Windows XP Professional Computer Hardware... Software Installation Hardware Installation Hardware Diagnostics Foreign Languages European Studies Western Europe Fluent English International Background English Microsoft Office Teamwork Fast Learner Word Chrome Help Desk Management Export Development MS Office tools Remote Support Trados Bug Tracking International... Remote Desktop Troubleshooting International Relations Microsoft Word Export SDL Editing Localization Machine Translation Website Localization Globalization XP Linguistics Help Desk Support Technical Support Language Services Spanish International Business Translation See 35+     See less Education University of Limerick B.A. (European Studies),  French ,  German , translation,  computing and business subjects 1974  – 1978 University of Limerick B.A. (European Studies),  French ,  German , translation,  computing and business subjects 1974  – 1978 University of Limerick B.A. (European Studies),  French ,  German , translation,  computing and business subjects 1974  – 1978 University of Limerick B.A. (European Studies),  French ,  German , translation,  computing and business subjects 1974  – 1978 ", "Languages German English French German English French German English French Skills Intercultural... Intercultural Training Localization Editing Program Evaluation Translation Higher Education Communications... University Teaching German Teaching Instructional Design Student Development Curriculum Development Curriculum Design Grant Writing Distance Learning E-Learning Instructional Technology Research Nonprofits Program Management Program Coordination French Program Development Student Advising Working Abroad International Business... Web Design Curriculum Management See 15+     See less Skills  Intercultural... Intercultural Training Localization Editing Program Evaluation Translation Higher Education Communications... University Teaching German Teaching Instructional Design Student Development Curriculum Development Curriculum Design Grant Writing Distance Learning E-Learning Instructional Technology Research Nonprofits Program Management Program Coordination French Program Development Student Advising Working Abroad International Business... Web Design Curriculum Management See 15+     See less Intercultural... Intercultural Training Localization Editing Program Evaluation Translation Higher Education Communications... University Teaching German Teaching Instructional Design Student Development Curriculum Development Curriculum Design Grant Writing Distance Learning E-Learning Instructional Technology Research Nonprofits Program Management Program Coordination French Program Development Student Advising Working Abroad International Business... Web Design Curriculum Management See 15+     See less Intercultural... Intercultural Training Localization Editing Program Evaluation Translation Higher Education Communications... University Teaching German Teaching Instructional Design Student Development Curriculum Development Curriculum Design Grant Writing Distance Learning E-Learning Instructional Technology Research Nonprofits Program Management Program Coordination French Program Development Student Advising Working Abroad International Business... Web Design Curriculum Management See 15+     See less ", "Summary I am an internationalization specialist and have worked in various fields of software localization industry with consistent, proven success record of excellent quality major iOS and OS X releases. \n \nI am originally from Helsinki, Finland, and during last 12 years I have had the amazing opportunity to work with amazing people and get explore experience different cultures through living and working in number of different countries, including Italy, Germany, Ireland, and most recently in United States. \n \nFor over a decade I have been part of the great successes of Apple's international product releases. \n \nRecent successes include leadership of localization and internationalization quality of every major iOS software release for iPhone, iPad and iPod touch. \n \nI've held variety of positions from hands-on localization engineering of iOS and OS X projects to managing, leading and developing international quality assurance of iOS releases. Summary I am an internationalization specialist and have worked in various fields of software localization industry with consistent, proven success record of excellent quality major iOS and OS X releases. \n \nI am originally from Helsinki, Finland, and during last 12 years I have had the amazing opportunity to work with amazing people and get explore experience different cultures through living and working in number of different countries, including Italy, Germany, Ireland, and most recently in United States. \n \nFor over a decade I have been part of the great successes of Apple's international product releases. \n \nRecent successes include leadership of localization and internationalization quality of every major iOS software release for iPhone, iPad and iPod touch. \n \nI've held variety of positions from hands-on localization engineering of iOS and OS X projects to managing, leading and developing international quality assurance of iOS releases. I am an internationalization specialist and have worked in various fields of software localization industry with consistent, proven success record of excellent quality major iOS and OS X releases. \n \nI am originally from Helsinki, Finland, and during last 12 years I have had the amazing opportunity to work with amazing people and get explore experience different cultures through living and working in number of different countries, including Italy, Germany, Ireland, and most recently in United States. \n \nFor over a decade I have been part of the great successes of Apple's international product releases. \n \nRecent successes include leadership of localization and internationalization quality of every major iOS software release for iPhone, iPad and iPod touch. \n \nI've held variety of positions from hands-on localization engineering of iOS and OS X projects to managing, leading and developing international quality assurance of iOS releases. I am an internationalization specialist and have worked in various fields of software localization industry with consistent, proven success record of excellent quality major iOS and OS X releases. \n \nI am originally from Helsinki, Finland, and during last 12 years I have had the amazing opportunity to work with amazing people and get explore experience different cultures through living and working in number of different countries, including Italy, Germany, Ireland, and most recently in United States. \n \nFor over a decade I have been part of the great successes of Apple's international product releases. \n \nRecent successes include leadership of localization and internationalization quality of every major iOS software release for iPhone, iPad and iPod touch. \n \nI've held variety of positions from hands-on localization engineering of iOS and OS X projects to managing, leading and developing international quality assurance of iOS releases. Experience Worldwide iOS Quality Program Manager Apple July 2013  – Present (2 years 2 months) Software Engineering Operations iOS International Quality Project Manager Apple September 2009  –  July 2013  (3 years 11 months) Software Engineering Operations Sr. Software Engineer Apple June 2007  –  September 2009  (2 years 4 months) Localization Specialist Self Employed Consultant September 2004  –  June 2007  (2 years 10 months) Lead Localization Engineer People Group Oy April 2004  –  September 2004  (6 months) Localization Engineer LocalEyes December 2003  –  February 2004  (3 months) Localization Engineer LocalEyes November 2002  –  October 2003  (1 year) Test Lead LocalEyes November 2001  –  October 2002  (1 year) System Specialist Siemens June 1999  –  October 2001  (2 years 5 months) Military Police Finnish Defence Forces July 1998  –  April 1999  (10 months) Worldwide iOS Quality Program Manager Apple July 2013  – Present (2 years 2 months) Software Engineering Operations Worldwide iOS Quality Program Manager Apple July 2013  – Present (2 years 2 months) Software Engineering Operations iOS International Quality Project Manager Apple September 2009  –  July 2013  (3 years 11 months) Software Engineering Operations iOS International Quality Project Manager Apple September 2009  –  July 2013  (3 years 11 months) Software Engineering Operations Sr. Software Engineer Apple June 2007  –  September 2009  (2 years 4 months) Sr. Software Engineer Apple June 2007  –  September 2009  (2 years 4 months) Localization Specialist Self Employed Consultant September 2004  –  June 2007  (2 years 10 months) Localization Specialist Self Employed Consultant September 2004  –  June 2007  (2 years 10 months) Lead Localization Engineer People Group Oy April 2004  –  September 2004  (6 months) Lead Localization Engineer People Group Oy April 2004  –  September 2004  (6 months) Localization Engineer LocalEyes December 2003  –  February 2004  (3 months) Localization Engineer LocalEyes December 2003  –  February 2004  (3 months) Localization Engineer LocalEyes November 2002  –  October 2003  (1 year) Localization Engineer LocalEyes November 2002  –  October 2003  (1 year) Test Lead LocalEyes November 2001  –  October 2002  (1 year) Test Lead LocalEyes November 2001  –  October 2002  (1 year) System Specialist Siemens June 1999  –  October 2001  (2 years 5 months) System Specialist Siemens June 1999  –  October 2001  (2 years 5 months) Military Police Finnish Defence Forces July 1998  –  April 1999  (10 months) Military Police Finnish Defence Forces July 1998  –  April 1999  (10 months) Skills Internationalization Localization Localization Testing Globalization OS X L10n Quality Assurance Software Development Cross-functional Team... iPhone I18n Perl Software Engineering Translation Testing iOS Apple Culture Organizational... General Administrative... Leading Diverse Teams Cross-functional... Quality Management Quality Assurance... G11n Test Case Generation Software Localizability... Software... watchOS tvOS See 14+     See less Skills  Internationalization Localization Localization Testing Globalization OS X L10n Quality Assurance Software Development Cross-functional Team... iPhone I18n Perl Software Engineering Translation Testing iOS Apple Culture Organizational... General Administrative... Leading Diverse Teams Cross-functional... Quality Management Quality Assurance... G11n Test Case Generation Software Localizability... Software... watchOS tvOS See 14+     See less Internationalization Localization Localization Testing Globalization OS X L10n Quality Assurance Software Development Cross-functional Team... iPhone I18n Perl Software Engineering Translation Testing iOS Apple Culture Organizational... General Administrative... Leading Diverse Teams Cross-functional... Quality Management Quality Assurance... G11n Test Case Generation Software Localizability... Software... watchOS tvOS See 14+     See less Internationalization Localization Localization Testing Globalization OS X L10n Quality Assurance Software Development Cross-functional Team... iPhone I18n Perl Software Engineering Translation Testing iOS Apple Culture Organizational... General Administrative... Leading Diverse Teams Cross-functional... Quality Management Quality Assurance... G11n Test Case Generation Software Localizability... Software... watchOS tvOS See 14+     See less ", "Summary More than 10 years project management and software development experience in software globalization (g11n), internationalization (i18n), and localization (l10n) \n \nExpert in specifying and supporting end-to-end localization and translation requirements, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development, in local and remote offices (USA, Europe, India). \n \nTrack record of successful, timely and on budget delivery \n \nProject management with Agile software development processes \n \nLinguistic analysis of major European and Asian languages, including Polish, Russian, and Arabic \n \nStrong technical background in software development Summary More than 10 years project management and software development experience in software globalization (g11n), internationalization (i18n), and localization (l10n) \n \nExpert in specifying and supporting end-to-end localization and translation requirements, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development, in local and remote offices (USA, Europe, India). \n \nTrack record of successful, timely and on budget delivery \n \nProject management with Agile software development processes \n \nLinguistic analysis of major European and Asian languages, including Polish, Russian, and Arabic \n \nStrong technical background in software development More than 10 years project management and software development experience in software globalization (g11n), internationalization (i18n), and localization (l10n) \n \nExpert in specifying and supporting end-to-end localization and translation requirements, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development, in local and remote offices (USA, Europe, India). \n \nTrack record of successful, timely and on budget delivery \n \nProject management with Agile software development processes \n \nLinguistic analysis of major European and Asian languages, including Polish, Russian, and Arabic \n \nStrong technical background in software development More than 10 years project management and software development experience in software globalization (g11n), internationalization (i18n), and localization (l10n) \n \nExpert in specifying and supporting end-to-end localization and translation requirements, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development, in local and remote offices (USA, Europe, India). \n \nTrack record of successful, timely and on budget delivery \n \nProject management with Agile software development processes \n \nLinguistic analysis of major European and Asian languages, including Polish, Russian, and Arabic \n \nStrong technical background in software development Experience Localization and Engineering Manager - Linguistic Technology Zynga December 2010  –  June 2013  (2 years 7 months) San Francisco Bay Area Provided end-to-end localization and translation support for multiple triple-A games, e.g. CityVille, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development \n \nTimely launch within budget of multiple triple-A games in up to 15 languages \n \nProduct ownership and project management of Zynga's localization framework \n \nUnder my ownership the framework has been extended to offer localization support for ActionScript, PHP, JavaScript, C#, C++, Objective-C, and Java. It also increased support of originally 6 languages to 23 languages, including Arabic, Hebrew, Polish, and Russian, plus date, time, and number formats not available in Unicode CLDR \n \nImplemented training and quality assurance process for the localization framework, resulting in a fully tested, cross-platform library whose feature parity and backward compatibility enabled teams to reuse existing translation memory and game code, keeping transition costs minimal and investments secure \n \nProduct and project management of various machine-aided translation and monitoring tools (e.g. profanity filter), in collaboration with remote teams in Dublin (Ireland) and Bangalore (India), reducing overall translation costs with the help of machine-aided translation by 10-15% \n \nManaged a team of up to five amazing and highly skilled software developers Internationalization Specialist Yahoo! April 2005  –  December 2010  (5 years 9 months) Internationalization and localization specialist for Yahoo! Finance, managing the Yahoo! Finance translation and global on-boarding process. \n \nInternational Software Developer and Localization Coordinator for Yahoo! Video, responsible for the internationalization of video.yahoo.com and localization in 13 countries in Europe, Latin America and South-East Asia, coordinating localization requirements with local teams, and their international roll-outs. \n \nInternational Software Developer for Yahoo! Search Technologies, with focus on data-driven search query analysis to increase search result relevance for German speaking markets in collaboration with US and locally based editorial teams. Application of machine-learning algorithms for spam/adult content detection and spelling suggestions. Coordination of feature improvements to the Yahoo! Search experience in Europe. Software Developer Yahoo! April 1999  –  March 2005  (6 years) European Software Developer for Yahoo! Global Search Platform, migrating a new Yahoo! Search front-end to Europe, based on a global search platform developed by the search team in the US, and, responsible for the implementation of Local Search (white and yellow pages) on said platform for Italy, Germany and UK, in close collaboration with external partners. \n \nEuropean Software Developer for Yahoo! Classifieds, responsible for the redesign and implementation of a new European classifieds platform and its verticals \"careers\", \"real-estate\", \"autos\", and \"personals\", contributing in all product and project planning decisions. \n \nSoftware Developer for Yahoo! Media/Community/Mobile, integrating external partner content and internal feeds in Yahoo! News, Finance, Mobile, My Yahoo!, and others. Software Developer Softlab August 1998  –  March 1999  (8 months) Implementation of a document management solution in MS Visual Basic Localization and Engineering Manager - Linguistic Technology Zynga December 2010  –  June 2013  (2 years 7 months) San Francisco Bay Area Provided end-to-end localization and translation support for multiple triple-A games, e.g. CityVille, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development \n \nTimely launch within budget of multiple triple-A games in up to 15 languages \n \nProduct ownership and project management of Zynga's localization framework \n \nUnder my ownership the framework has been extended to offer localization support for ActionScript, PHP, JavaScript, C#, C++, Objective-C, and Java. It also increased support of originally 6 languages to 23 languages, including Arabic, Hebrew, Polish, and Russian, plus date, time, and number formats not available in Unicode CLDR \n \nImplemented training and quality assurance process for the localization framework, resulting in a fully tested, cross-platform library whose feature parity and backward compatibility enabled teams to reuse existing translation memory and game code, keeping transition costs minimal and investments secure \n \nProduct and project management of various machine-aided translation and monitoring tools (e.g. profanity filter), in collaboration with remote teams in Dublin (Ireland) and Bangalore (India), reducing overall translation costs with the help of machine-aided translation by 10-15% \n \nManaged a team of up to five amazing and highly skilled software developers Localization and Engineering Manager - Linguistic Technology Zynga December 2010  –  June 2013  (2 years 7 months) San Francisco Bay Area Provided end-to-end localization and translation support for multiple triple-A games, e.g. CityVille, i.e. market research, vendor/linguist management, translation memory management, cost analysis, and bug triage, in close collaboration with engineering, art, marketing, PR, statistical analysis, and business development \n \nTimely launch within budget of multiple triple-A games in up to 15 languages \n \nProduct ownership and project management of Zynga's localization framework \n \nUnder my ownership the framework has been extended to offer localization support for ActionScript, PHP, JavaScript, C#, C++, Objective-C, and Java. It also increased support of originally 6 languages to 23 languages, including Arabic, Hebrew, Polish, and Russian, plus date, time, and number formats not available in Unicode CLDR \n \nImplemented training and quality assurance process for the localization framework, resulting in a fully tested, cross-platform library whose feature parity and backward compatibility enabled teams to reuse existing translation memory and game code, keeping transition costs minimal and investments secure \n \nProduct and project management of various machine-aided translation and monitoring tools (e.g. profanity filter), in collaboration with remote teams in Dublin (Ireland) and Bangalore (India), reducing overall translation costs with the help of machine-aided translation by 10-15% \n \nManaged a team of up to five amazing and highly skilled software developers Internationalization Specialist Yahoo! April 2005  –  December 2010  (5 years 9 months) Internationalization and localization specialist for Yahoo! Finance, managing the Yahoo! Finance translation and global on-boarding process. \n \nInternational Software Developer and Localization Coordinator for Yahoo! Video, responsible for the internationalization of video.yahoo.com and localization in 13 countries in Europe, Latin America and South-East Asia, coordinating localization requirements with local teams, and their international roll-outs. \n \nInternational Software Developer for Yahoo! Search Technologies, with focus on data-driven search query analysis to increase search result relevance for German speaking markets in collaboration with US and locally based editorial teams. Application of machine-learning algorithms for spam/adult content detection and spelling suggestions. Coordination of feature improvements to the Yahoo! Search experience in Europe. Internationalization Specialist Yahoo! April 2005  –  December 2010  (5 years 9 months) Internationalization and localization specialist for Yahoo! Finance, managing the Yahoo! Finance translation and global on-boarding process. \n \nInternational Software Developer and Localization Coordinator for Yahoo! Video, responsible for the internationalization of video.yahoo.com and localization in 13 countries in Europe, Latin America and South-East Asia, coordinating localization requirements with local teams, and their international roll-outs. \n \nInternational Software Developer for Yahoo! Search Technologies, with focus on data-driven search query analysis to increase search result relevance for German speaking markets in collaboration with US and locally based editorial teams. Application of machine-learning algorithms for spam/adult content detection and spelling suggestions. Coordination of feature improvements to the Yahoo! Search experience in Europe. Software Developer Yahoo! April 1999  –  March 2005  (6 years) European Software Developer for Yahoo! Global Search Platform, migrating a new Yahoo! Search front-end to Europe, based on a global search platform developed by the search team in the US, and, responsible for the implementation of Local Search (white and yellow pages) on said platform for Italy, Germany and UK, in close collaboration with external partners. \n \nEuropean Software Developer for Yahoo! Classifieds, responsible for the redesign and implementation of a new European classifieds platform and its verticals \"careers\", \"real-estate\", \"autos\", and \"personals\", contributing in all product and project planning decisions. \n \nSoftware Developer for Yahoo! Media/Community/Mobile, integrating external partner content and internal feeds in Yahoo! News, Finance, Mobile, My Yahoo!, and others. Software Developer Yahoo! April 1999  –  March 2005  (6 years) European Software Developer for Yahoo! Global Search Platform, migrating a new Yahoo! Search front-end to Europe, based on a global search platform developed by the search team in the US, and, responsible for the implementation of Local Search (white and yellow pages) on said platform for Italy, Germany and UK, in close collaboration with external partners. \n \nEuropean Software Developer for Yahoo! Classifieds, responsible for the redesign and implementation of a new European classifieds platform and its verticals \"careers\", \"real-estate\", \"autos\", and \"personals\", contributing in all product and project planning decisions. \n \nSoftware Developer for Yahoo! Media/Community/Mobile, integrating external partner content and internal feeds in Yahoo! News, Finance, Mobile, My Yahoo!, and others. Software Developer Softlab August 1998  –  March 1999  (8 months) Implementation of a document management solution in MS Visual Basic Software Developer Softlab August 1998  –  March 1999  (8 months) Implementation of a document management solution in MS Visual Basic Languages Englisch Full professional proficiency Deutsch Native or bilingual proficiency Englisch Full professional proficiency Deutsch Native or bilingual proficiency Englisch Full professional proficiency Deutsch Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Mobile Devices Software Engineering Search Internationalization Machine Learning PHP Project Management Marketing Agile Methodologies Scalability Translation Localization Perl Strategy Process Improvement L10n Globalization Linguistics OOP Project Planning JavaScript Management E-commerce I18n G11n See 10+     See less Skills  Mobile Devices Software Engineering Search Internationalization Machine Learning PHP Project Management Marketing Agile Methodologies Scalability Translation Localization Perl Strategy Process Improvement L10n Globalization Linguistics OOP Project Planning JavaScript Management E-commerce I18n G11n See 10+     See less Mobile Devices Software Engineering Search Internationalization Machine Learning PHP Project Management Marketing Agile Methodologies Scalability Translation Localization Perl Strategy Process Improvement L10n Globalization Linguistics OOP Project Planning JavaScript Management E-commerce I18n G11n See 10+     See less Mobile Devices Software Engineering Search Internationalization Machine Learning PHP Project Management Marketing Agile Methodologies Scalability Translation Localization Perl Strategy Process Improvement L10n Globalization Linguistics OOP Project Planning JavaScript Management E-commerce I18n G11n See 10+     See less Education Technische Universität München M.Sc.,  Computer Science 1992  – 1998 Secondary subject: Psychology, master thesis: Concepts for the Design of Interactive Tutorial Systems in HTML/Java Activities and Societies:  Elected student representative of the computer science department council in 1994 ,  Erasmus exchange student at the Queen's University of Belfast in 1995 ,  Tempus exchange student at the Vilniaus Universitetas in 1996. University of Hagen Certificate,  Business Administration 2002  – 2003 \"Intensivkurs Betriebswirtschaftslehre und betriebliches Management\", offered by the Fernuniversität Hagen as an introduction into business administration and management, focusing on corporate strategies, marketing and human resources. Technische Universität München M.Sc.,  Computer Science 1992  – 1998 Secondary subject: Psychology, master thesis: Concepts for the Design of Interactive Tutorial Systems in HTML/Java Activities and Societies:  Elected student representative of the computer science department council in 1994 ,  Erasmus exchange student at the Queen's University of Belfast in 1995 ,  Tempus exchange student at the Vilniaus Universitetas in 1996. Technische Universität München M.Sc.,  Computer Science 1992  – 1998 Secondary subject: Psychology, master thesis: Concepts for the Design of Interactive Tutorial Systems in HTML/Java Activities and Societies:  Elected student representative of the computer science department council in 1994 ,  Erasmus exchange student at the Queen's University of Belfast in 1995 ,  Tempus exchange student at the Vilniaus Universitetas in 1996. Technische Universität München M.Sc.,  Computer Science 1992  – 1998 Secondary subject: Psychology, master thesis: Concepts for the Design of Interactive Tutorial Systems in HTML/Java Activities and Societies:  Elected student representative of the computer science department council in 1994 ,  Erasmus exchange student at the Queen's University of Belfast in 1995 ,  Tempus exchange student at the Vilniaus Universitetas in 1996. University of Hagen Certificate,  Business Administration 2002  – 2003 \"Intensivkurs Betriebswirtschaftslehre und betriebliches Management\", offered by the Fernuniversität Hagen as an introduction into business administration and management, focusing on corporate strategies, marketing and human resources. University of Hagen Certificate,  Business Administration 2002  – 2003 \"Intensivkurs Betriebswirtschaftslehre und betriebliches Management\", offered by the Fernuniversität Hagen as an introduction into business administration and management, focusing on corporate strategies, marketing and human resources. University of Hagen Certificate,  Business Administration 2002  – 2003 \"Intensivkurs Betriebswirtschaftslehre und betriebliches Management\", offered by the Fernuniversität Hagen as an introduction into business administration and management, focusing on corporate strategies, marketing and human resources. ", "Summary +20 years of management-level experience in the localization industry. Operations Manager in France, UK and Spain, overseeing the Production, Finance, HR, IT & Logistics Departments. \n \nHeld different positions for some of the industry leaders. Focused on implementing strategies that drive growth and operations improvements: management of client-focused global service organization, process optimization and development of individuals and teams. \n \nFamiliar with all translation processes, creating TranslatorsVillage to share all best practices in the industry, was the natural step forward. Summary +20 years of management-level experience in the localization industry. Operations Manager in France, UK and Spain, overseeing the Production, Finance, HR, IT & Logistics Departments. \n \nHeld different positions for some of the industry leaders. Focused on implementing strategies that drive growth and operations improvements: management of client-focused global service organization, process optimization and development of individuals and teams. \n \nFamiliar with all translation processes, creating TranslatorsVillage to share all best practices in the industry, was the natural step forward. +20 years of management-level experience in the localization industry. Operations Manager in France, UK and Spain, overseeing the Production, Finance, HR, IT & Logistics Departments. \n \nHeld different positions for some of the industry leaders. Focused on implementing strategies that drive growth and operations improvements: management of client-focused global service organization, process optimization and development of individuals and teams. \n \nFamiliar with all translation processes, creating TranslatorsVillage to share all best practices in the industry, was the natural step forward. +20 years of management-level experience in the localization industry. Operations Manager in France, UK and Spain, overseeing the Production, Finance, HR, IT & Logistics Departments. \n \nHeld different positions for some of the industry leaders. Focused on implementing strategies that drive growth and operations improvements: management of client-focused global service organization, process optimization and development of individuals and teams. \n \nFamiliar with all translation processes, creating TranslatorsVillage to share all best practices in the industry, was the natural step forward. Experience Founder / CEO TranslatorsVillage January 2013  – Present (2 years 8 months) Leeds, United Kingdom Co-Founder Spanish Business Quarter January 2014  – Present (1 year 8 months) Leeds, United Kingdom Senior Executive / Management Consultant - Translation & localization industry Expanding Worldwide May 2011  –  April 2015  (4 years) Director of Worldwide Sales BQT Inc. September 2012  –  September 2013  (1 year 1 month) Leeds, United Kingdom WW Operations Manager Tek Translation International June 2011  –  September 2012  (1 year 4 months) Madrid Area, Spain VP of Group Operations thebigword September 2008  –  May 2011  (2 years 9 months) Leeds, United Kingdom Operations Manager Lexcelera March 2007  –  August 2007  (6 months) Operations Manager France Lionbridge April 2004  –  January 2007  (2 years 10 months) Finance Controller Bowne Global Solutions January 2003  –  March 2004  (1 year 3 months) Country Manager Berlitz GlobalNET July 1995  –  December 2002  (7 years 6 months) Founder / CEO TranslatorsVillage January 2013  – Present (2 years 8 months) Leeds, United Kingdom Founder / CEO TranslatorsVillage January 2013  – Present (2 years 8 months) Leeds, United Kingdom Co-Founder Spanish Business Quarter January 2014  – Present (1 year 8 months) Leeds, United Kingdom Co-Founder Spanish Business Quarter January 2014  – Present (1 year 8 months) Leeds, United Kingdom Senior Executive / Management Consultant - Translation & localization industry Expanding Worldwide May 2011  –  April 2015  (4 years) Senior Executive / Management Consultant - Translation & localization industry Expanding Worldwide May 2011  –  April 2015  (4 years) Director of Worldwide Sales BQT Inc. September 2012  –  September 2013  (1 year 1 month) Leeds, United Kingdom Director of Worldwide Sales BQT Inc. September 2012  –  September 2013  (1 year 1 month) Leeds, United Kingdom WW Operations Manager Tek Translation International June 2011  –  September 2012  (1 year 4 months) Madrid Area, Spain WW Operations Manager Tek Translation International June 2011  –  September 2012  (1 year 4 months) Madrid Area, Spain VP of Group Operations thebigword September 2008  –  May 2011  (2 years 9 months) Leeds, United Kingdom VP of Group Operations thebigword September 2008  –  May 2011  (2 years 9 months) Leeds, United Kingdom Operations Manager Lexcelera March 2007  –  August 2007  (6 months) Operations Manager Lexcelera March 2007  –  August 2007  (6 months) Operations Manager France Lionbridge April 2004  –  January 2007  (2 years 10 months) Operations Manager France Lionbridge April 2004  –  January 2007  (2 years 10 months) Finance Controller Bowne Global Solutions January 2003  –  March 2004  (1 year 3 months) Finance Controller Bowne Global Solutions January 2003  –  March 2004  (1 year 3 months) Country Manager Berlitz GlobalNET July 1995  –  December 2002  (7 years 6 months) Country Manager Berlitz GlobalNET July 1995  –  December 2002  (7 years 6 months) Languages English Full professional proficiency Spanish Native or bilingual proficiency French Full professional proficiency English Full professional proficiency Spanish Native or bilingual proficiency French Full professional proficiency English Full professional proficiency Spanish Native or bilingual proficiency French Full professional proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Best Practices Bridging Gaps Business Analysis Business Planning Business Process... Business Requirements Business Strategy CAT tools Conflict Management Community Outreach Cross-functional Team... Creative Solutions Customer Service... Distributed Team... Getting the Best Out Of... Globalization Internationalization ISO Implementation KPI implementation Localization Multilingual New Market Expansion Operations Management Out Of the Box Outsourcing Management Process Consulting People Development Quality Assurance Spanish Strategic Consulting Translation Team Management Vendor Management Translation Memory Virtual Teams Visionary Thinking Language Services International Business Proofreading Terminology Management Technical Translation Trados Leadership Language Development Linguistics Manuals Interpreting Business Development Italian See 35+     See less Skills  Best Practices Bridging Gaps Business Analysis Business Planning Business Process... Business Requirements Business Strategy CAT tools Conflict Management Community Outreach Cross-functional Team... Creative Solutions Customer Service... Distributed Team... Getting the Best Out Of... Globalization Internationalization ISO Implementation KPI implementation Localization Multilingual New Market Expansion Operations Management Out Of the Box Outsourcing Management Process Consulting People Development Quality Assurance Spanish Strategic Consulting Translation Team Management Vendor Management Translation Memory Virtual Teams Visionary Thinking Language Services International Business Proofreading Terminology Management Technical Translation Trados Leadership Language Development Linguistics Manuals Interpreting Business Development Italian See 35+     See less Best Practices Bridging Gaps Business Analysis Business Planning Business Process... Business Requirements Business Strategy CAT tools Conflict Management Community Outreach Cross-functional Team... Creative Solutions Customer Service... Distributed Team... Getting the Best Out Of... Globalization Internationalization ISO Implementation KPI implementation Localization Multilingual New Market Expansion Operations Management Out Of the Box Outsourcing Management Process Consulting People Development Quality Assurance Spanish Strategic Consulting Translation Team Management Vendor Management Translation Memory Virtual Teams Visionary Thinking Language Services International Business Proofreading Terminology Management Technical Translation Trados Leadership Language Development Linguistics Manuals Interpreting Business Development Italian See 35+     See less Best Practices Bridging Gaps Business Analysis Business Planning Business Process... Business Requirements Business Strategy CAT tools Conflict Management Community Outreach Cross-functional Team... Creative Solutions Customer Service... Distributed Team... Getting the Best Out Of... Globalization Internationalization ISO Implementation KPI implementation Localization Multilingual New Market Expansion Operations Management Out Of the Box Outsourcing Management Process Consulting People Development Quality Assurance Spanish Strategic Consulting Translation Team Management Vendor Management Translation Memory Virtual Teams Visionary Thinking Language Services International Business Proofreading Terminology Management Technical Translation Trados Leadership Language Development Linguistics Manuals Interpreting Business Development Italian See 35+     See less Education Universidad Politécnica de Madrid MBA,  Business Administration 2000  – 2002 Georgetown University MA,  Translation 1988  – 1989 Universidad Complutense de Madrid MA,  Filologia Francesa 1977  – 1982 Universidad Politécnica de Madrid MBA,  Business Administration 2000  – 2002 Universidad Politécnica de Madrid MBA,  Business Administration 2000  – 2002 Universidad Politécnica de Madrid MBA,  Business Administration 2000  – 2002 Georgetown University MA,  Translation 1988  – 1989 Georgetown University MA,  Translation 1988  – 1989 Georgetown University MA,  Translation 1988  – 1989 Universidad Complutense de Madrid MA,  Filologia Francesa 1977  – 1982 Universidad Complutense de Madrid MA,  Filologia Francesa 1977  – 1982 Universidad Complutense de Madrid MA,  Filologia Francesa 1977  – 1982 ", "Languages Spanish Spanish Spanish Skills Java PL/SQL Analysis SQL Windows Operating Systems C Agile Methodologies Linux Databases Skills  Java PL/SQL Analysis SQL Windows Operating Systems C Agile Methodologies Linux Databases Java PL/SQL Analysis SQL Windows Operating Systems C Agile Methodologies Linux Databases Java PL/SQL Analysis SQL Windows Operating Systems C Agile Methodologies Linux Databases ", "Experience Internationalization Specialist Stockton University September 2013  – Present (2 years) Galloway, NJ 1. Provide professional development to faculty members of all disciplines on internationalizing the curriculum; \n2. Disseminate the latest research and practices on internationalization; \n3. Assist faculty members on internationalizing their own lessons, units, and courses; \n4. Coordinate curricular internationalization activities in collaboration with related areas at the College (e.g., Office of International Services, Institute for Faculty Development, World Languages, SRI & ETTC - K-12 school professional development);  \n5. Teach one course per term, including but not limited to an international-curriculum focused class; \n6. Serve as guest lecturer or activity facilitator to model best practices for faculty; \n7. Prepare reports, data and formal presentations as needed. Lead Language Resource Specialist Binghamton University January 2011  –  August 2013  (2 years 8 months) Language Across the Curriculum Program, Binghamton University I design, instruct, and evaluate different kinds of learning activities for undergraduate students to use a second language and culture to build an in-depth and sophisticated understanding towards the academic study and develop a critical thinking ability. Research and Teaching Assistant Binghamton University, 2011  –  June 2013  (2 years) Graduate School of Education I am currently teaching a course titled Current Issues and Trends in Education and will teach a course titled Learning and Instruction in Education in Spring 2012 to undergraduate students who may go on to graduate programs in education after graduation.  \nMy current course provides students with in-depth critical look at education in America and provides an opportunity to use current issues, along with the students' personal school histories, to understand the conflicts of opinion in current practices and trends in schools, and thus develop their own educational philosophies. \nThe Learning and Instruction course will familiarize students with multiple learning theories and help students develop curricula and instructional methods based on their specialized area in education. Lecturer Beijing University of Technology August 2002  –  August 2008  (6 years 1 month) Teaching six English courses to English majors and non-English majors. Internationalization Specialist Stockton University September 2013  – Present (2 years) Galloway, NJ 1. Provide professional development to faculty members of all disciplines on internationalizing the curriculum; \n2. Disseminate the latest research and practices on internationalization; \n3. Assist faculty members on internationalizing their own lessons, units, and courses; \n4. Coordinate curricular internationalization activities in collaboration with related areas at the College (e.g., Office of International Services, Institute for Faculty Development, World Languages, SRI & ETTC - K-12 school professional development);  \n5. Teach one course per term, including but not limited to an international-curriculum focused class; \n6. Serve as guest lecturer or activity facilitator to model best practices for faculty; \n7. Prepare reports, data and formal presentations as needed. Internationalization Specialist Stockton University September 2013  – Present (2 years) Galloway, NJ 1. Provide professional development to faculty members of all disciplines on internationalizing the curriculum; \n2. Disseminate the latest research and practices on internationalization; \n3. Assist faculty members on internationalizing their own lessons, units, and courses; \n4. Coordinate curricular internationalization activities in collaboration with related areas at the College (e.g., Office of International Services, Institute for Faculty Development, World Languages, SRI & ETTC - K-12 school professional development);  \n5. Teach one course per term, including but not limited to an international-curriculum focused class; \n6. Serve as guest lecturer or activity facilitator to model best practices for faculty; \n7. Prepare reports, data and formal presentations as needed. Lead Language Resource Specialist Binghamton University January 2011  –  August 2013  (2 years 8 months) Language Across the Curriculum Program, Binghamton University I design, instruct, and evaluate different kinds of learning activities for undergraduate students to use a second language and culture to build an in-depth and sophisticated understanding towards the academic study and develop a critical thinking ability. Lead Language Resource Specialist Binghamton University January 2011  –  August 2013  (2 years 8 months) Language Across the Curriculum Program, Binghamton University I design, instruct, and evaluate different kinds of learning activities for undergraduate students to use a second language and culture to build an in-depth and sophisticated understanding towards the academic study and develop a critical thinking ability. Research and Teaching Assistant Binghamton University, 2011  –  June 2013  (2 years) Graduate School of Education I am currently teaching a course titled Current Issues and Trends in Education and will teach a course titled Learning and Instruction in Education in Spring 2012 to undergraduate students who may go on to graduate programs in education after graduation.  \nMy current course provides students with in-depth critical look at education in America and provides an opportunity to use current issues, along with the students' personal school histories, to understand the conflicts of opinion in current practices and trends in schools, and thus develop their own educational philosophies. \nThe Learning and Instruction course will familiarize students with multiple learning theories and help students develop curricula and instructional methods based on their specialized area in education. Research and Teaching Assistant Binghamton University, 2011  –  June 2013  (2 years) Graduate School of Education I am currently teaching a course titled Current Issues and Trends in Education and will teach a course titled Learning and Instruction in Education in Spring 2012 to undergraduate students who may go on to graduate programs in education after graduation.  \nMy current course provides students with in-depth critical look at education in America and provides an opportunity to use current issues, along with the students' personal school histories, to understand the conflicts of opinion in current practices and trends in schools, and thus develop their own educational philosophies. \nThe Learning and Instruction course will familiarize students with multiple learning theories and help students develop curricula and instructional methods based on their specialized area in education. Lecturer Beijing University of Technology August 2002  –  August 2008  (6 years 1 month) Teaching six English courses to English majors and non-English majors. Lecturer Beijing University of Technology August 2002  –  August 2008  (6 years 1 month) Teaching six English courses to English majors and non-English majors. Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Teaching Teaching and Learning Research Teacher Education International Education Higher Education Instructional Design University Teaching English Curriculum Design Mandarin Curriculum Development Chinese Microsoft Office PowerPoint Teacher Training Student Affairs Student Development Academic Advising Tutoring College Teaching Qualitative Research Statistics Intercultural... Grant Writing Academic Writing Distance Learning Literature Courses History Staff Development Adult Education Theory Teaching English as a... TESOL Literacy International... Student-Centered... Social Media Public Speaking Program Development See 26+     See less Skills  Teaching Teaching and Learning Research Teacher Education International Education Higher Education Instructional Design University Teaching English Curriculum Design Mandarin Curriculum Development Chinese Microsoft Office PowerPoint Teacher Training Student Affairs Student Development Academic Advising Tutoring College Teaching Qualitative Research Statistics Intercultural... Grant Writing Academic Writing Distance Learning Literature Courses History Staff Development Adult Education Theory Teaching English as a... TESOL Literacy International... Student-Centered... Social Media Public Speaking Program Development See 26+     See less Teaching Teaching and Learning Research Teacher Education International Education Higher Education Instructional Design University Teaching English Curriculum Design Mandarin Curriculum Development Chinese Microsoft Office PowerPoint Teacher Training Student Affairs Student Development Academic Advising Tutoring College Teaching Qualitative Research Statistics Intercultural... Grant Writing Academic Writing Distance Learning Literature Courses History Staff Development Adult Education Theory Teaching English as a... TESOL Literacy International... Student-Centered... Social Media Public Speaking Program Development See 26+     See less Teaching Teaching and Learning Research Teacher Education International Education Higher Education Instructional Design University Teaching English Curriculum Design Mandarin Curriculum Development Chinese Microsoft Office PowerPoint Teacher Training Student Affairs Student Development Academic Advising Tutoring College Teaching Qualitative Research Statistics Intercultural... Grant Writing Academic Writing Distance Learning Literature Courses History Staff Development Adult Education Theory Teaching English as a... TESOL Literacy International... Student-Centered... Social Media Public Speaking Program Development See 26+     See less Education State University of New York at Binghamton Ed.D.,  Educational Theory and Practice 2008  – 2014 Anhui Normal University Master of Arts,  English Linguistics and Applied Linguistics 1999  – 2002 State University of New York at Binghamton Ed.D.,  Educational Theory and Practice 2008  – 2014 State University of New York at Binghamton Ed.D.,  Educational Theory and Practice 2008  – 2014 State University of New York at Binghamton Ed.D.,  Educational Theory and Practice 2008  – 2014 Anhui Normal University Master of Arts,  English Linguistics and Applied Linguistics 1999  – 2002 Anhui Normal University Master of Arts,  English Linguistics and Applied Linguistics 1999  – 2002 Anhui Normal University Master of Arts,  English Linguistics and Applied Linguistics 1999  – 2002 ", "Experience business services and internationalization specialist Poznan Science and Technology Park September 2011  – Present (4 years) Working in Technology InQbator.  \nProjects: Innovation Audit, Erasmus for Young Entrepreneurs Administrative Erasmus For Young Entrepreneurs 2011  – Present (4 years) trainee Fraunhofer MOEZ December 2012  –  February 2013  (3 months) Leipzig, Germany deliverer Kyokai Sushi Bar October 2010  –  July 2011  (10 months) Deliver business services and internationalization specialist Poznan Science and Technology Park September 2011  – Present (4 years) Working in Technology InQbator.  \nProjects: Innovation Audit, Erasmus for Young Entrepreneurs business services and internationalization specialist Poznan Science and Technology Park September 2011  – Present (4 years) Working in Technology InQbator.  \nProjects: Innovation Audit, Erasmus for Young Entrepreneurs Administrative Erasmus For Young Entrepreneurs 2011  – Present (4 years) Administrative Erasmus For Young Entrepreneurs 2011  – Present (4 years) trainee Fraunhofer MOEZ December 2012  –  February 2013  (3 months) Leipzig, Germany trainee Fraunhofer MOEZ December 2012  –  February 2013  (3 months) Leipzig, Germany deliverer Kyokai Sushi Bar October 2010  –  July 2011  (10 months) Deliver deliverer Kyokai Sushi Bar October 2010  –  July 2011  (10 months) Deliver Languages English Professional working proficiency Spanish Limited working proficiency German Elementary proficiency English Professional working proficiency Spanish Limited working proficiency German Elementary proficiency English Professional working proficiency Spanish Limited working proficiency German Elementary proficiency Professional working proficiency Limited working proficiency Elementary proficiency Skills Microsoft Office Excel Word PowerPoint Photoshop Corel Draw Prezi Skills  Microsoft Office Excel Word PowerPoint Photoshop Corel Draw Prezi Microsoft Office Excel Word PowerPoint Photoshop Corel Draw Prezi Microsoft Office Excel Word PowerPoint Photoshop Corel Draw Prezi Education University of Leipzig Erasmus Exchange,  Economics&Management 2012  – 2013 Poznan University of Economics Master Degree,  Corporate Finance and Accounting 2011  – 2013 Poznan University of Economics Bachelor Degree,  Corporate finances and accounting 2008  – 2011 University of Leipzig Erasmus Exchange,  Economics&Management 2012  – 2013 University of Leipzig Erasmus Exchange,  Economics&Management 2012  – 2013 University of Leipzig Erasmus Exchange,  Economics&Management 2012  – 2013 Poznan University of Economics Master Degree,  Corporate Finance and Accounting 2011  – 2013 Poznan University of Economics Master Degree,  Corporate Finance and Accounting 2011  – 2013 Poznan University of Economics Master Degree,  Corporate Finance and Accounting 2011  – 2013 Poznan University of Economics Bachelor Degree,  Corporate finances and accounting 2008  – 2011 Poznan University of Economics Bachelor Degree,  Corporate finances and accounting 2008  – 2011 Poznan University of Economics Bachelor Degree,  Corporate finances and accounting 2008  – 2011 ", "Summary Apple is hiring!!!! \n \nI am looking for a JavaScript Ninja to join my group. \n \n\"Be a part of the team creating the cutting-edge Photos Web Application for Apple’s iCloud.com service. We’re looking for a detail-oriented, creative engineer with extensive knowledge of JavaScript, CSS3, and HTML5 to build the world’s best web applications.\" \n \nhttp://tinyurl.com/ngyslra \n \n Summary Apple is hiring!!!! \n \nI am looking for a JavaScript Ninja to join my group. \n \n\"Be a part of the team creating the cutting-edge Photos Web Application for Apple’s iCloud.com service. We’re looking for a detail-oriented, creative engineer with extensive knowledge of JavaScript, CSS3, and HTML5 to build the world’s best web applications.\" \n \nhttp://tinyurl.com/ngyslra \n \n Apple is hiring!!!! \n \nI am looking for a JavaScript Ninja to join my group. \n \n\"Be a part of the team creating the cutting-edge Photos Web Application for Apple’s iCloud.com service. We’re looking for a detail-oriented, creative engineer with extensive knowledge of JavaScript, CSS3, and HTML5 to build the world’s best web applications.\" \n \nhttp://tinyurl.com/ngyslra \n \n Apple is hiring!!!! \n \nI am looking for a JavaScript Ninja to join my group. \n \n\"Be a part of the team creating the cutting-edge Photos Web Application for Apple’s iCloud.com service. We’re looking for a detail-oriented, creative engineer with extensive knowledge of JavaScript, CSS3, and HTML5 to build the world’s best web applications.\" \n \nhttp://tinyurl.com/ngyslra \n \n Experience Software Architect / Project Manager - Apple Inc. Apple May 2009  – Present (6 years 4 months) Helping to design Apple's next generation cloud experience. Project Manager / Architect and Senior Developer Camber Corporation April 2008  –  May 2009  (1 year 2 months) Architecting and implementing the Department of Defense Personal Safety Metrics Web Application.  \n \nA Ruby on Rails data driven site that leverages Microsoft SQL Server, the Adobe Flex Charting API’s, and an AJAX enabled Ext-JS Grid Component to generate and save customizable report metrics for the Department of Defense to track per pay period progress across all the Armed Services branches towards the mandate of reducing Service Installation lost days by 50%.  \n \nArchitected, designed, and implemented the Camber Deployment Application Suite, a set of highly configurable Ruby API’s tied to a Capistrano deployment front-end. The robust transactional frame-  \nwork, was designed to maintain data synchronization and schema integrity between Camber’s internal ETL, Warehouse, and Staging database servers in Honolulu, Hawaii, and the production database server located in a secure facility with no remote internet access at Fleet Forces Command Norfolk, Virginia. Senior Web / Desktop Engineer and I18n Guru Open Source Applications Foundation March 2004  –  April 2008  (4 years 2 months) I have done many projects while at OSAF including \n \nA Java based server and Ajax web UI for managing and sharing calendars, events, and tasks. It implements open data standards including CalDAV, WebDAV, Atom, and Atompub and leverages Tomcat, Spring, Hibernate, Acegi Security, ical4j, Abdera 0.4, and Derby or MySQL for data storage. \n \n- Designed, architected, and implemented Mail client functionality for Chandler Desktop, an Open Source Collaborative Personal Information Management Application that runs on Windows, Linux, and Apple OS X.  \n \n- Internationalization Architect for the Chandler Desktop. \n \n- Debugged and fixed core dumps in the C++ WxWidgets API using GDB. \n \n- Core contributor to the Twisted SMTP, POP3, and IMAP4 client libraries including timeout support, MD5 authentication, and error handling. Twisted is an asynchronous Python event-driven engine that provides low-level networking support for Chandler Desktop. Senior Java Developer (Contract) JobFlash December 2003  –  March 2004  (4 months) Architected Java Server Framework to power JobFlash V2.0 platform. Senior Lead Developer MetricStream (formerly Zaplet) 2003  –  2004  (1 year) Senior Software Engineer and Internationalization specialist Zaplet July 2002  –  December 2003  (1 year 6 months) Senior Client / Server Architect Macrovision June 2001  –  July 2002  (1 year 2 months) Java Client / Server Developer (Contract) eBoomerang September 2001  –  December 2001  (4 months) Web Services Engineer (Contract) Appiant Technologies June 2001  –  August 2001  (3 months) Server Infrastructure and Protocol Architect (Contract) Excite@Home August 2000  –  June 2001  (11 months) Web UI Specialist and Email Application Engineer (Contract) Quaartz Inc. October 1999  –  August 2000  (11 months) Web Architect WebTraverse 1999  –  2000  (1 year) Web Developer Consultant Tellem Worldwide 1999  –  1999  (less than a year) Lead Developer - SETI Program Voyages Through Time NASA January 1998  –  December 1998  (1 year) Software Architect / Project Manager - Apple Inc. Apple May 2009  – Present (6 years 4 months) Helping to design Apple's next generation cloud experience. Software Architect / Project Manager - Apple Inc. Apple May 2009  – Present (6 years 4 months) Helping to design Apple's next generation cloud experience. Project Manager / Architect and Senior Developer Camber Corporation April 2008  –  May 2009  (1 year 2 months) Architecting and implementing the Department of Defense Personal Safety Metrics Web Application.  \n \nA Ruby on Rails data driven site that leverages Microsoft SQL Server, the Adobe Flex Charting API’s, and an AJAX enabled Ext-JS Grid Component to generate and save customizable report metrics for the Department of Defense to track per pay period progress across all the Armed Services branches towards the mandate of reducing Service Installation lost days by 50%.  \n \nArchitected, designed, and implemented the Camber Deployment Application Suite, a set of highly configurable Ruby API’s tied to a Capistrano deployment front-end. The robust transactional frame-  \nwork, was designed to maintain data synchronization and schema integrity between Camber’s internal ETL, Warehouse, and Staging database servers in Honolulu, Hawaii, and the production database server located in a secure facility with no remote internet access at Fleet Forces Command Norfolk, Virginia. Project Manager / Architect and Senior Developer Camber Corporation April 2008  –  May 2009  (1 year 2 months) Architecting and implementing the Department of Defense Personal Safety Metrics Web Application.  \n \nA Ruby on Rails data driven site that leverages Microsoft SQL Server, the Adobe Flex Charting API’s, and an AJAX enabled Ext-JS Grid Component to generate and save customizable report metrics for the Department of Defense to track per pay period progress across all the Armed Services branches towards the mandate of reducing Service Installation lost days by 50%.  \n \nArchitected, designed, and implemented the Camber Deployment Application Suite, a set of highly configurable Ruby API’s tied to a Capistrano deployment front-end. The robust transactional frame-  \nwork, was designed to maintain data synchronization and schema integrity between Camber’s internal ETL, Warehouse, and Staging database servers in Honolulu, Hawaii, and the production database server located in a secure facility with no remote internet access at Fleet Forces Command Norfolk, Virginia. Senior Web / Desktop Engineer and I18n Guru Open Source Applications Foundation March 2004  –  April 2008  (4 years 2 months) I have done many projects while at OSAF including \n \nA Java based server and Ajax web UI for managing and sharing calendars, events, and tasks. It implements open data standards including CalDAV, WebDAV, Atom, and Atompub and leverages Tomcat, Spring, Hibernate, Acegi Security, ical4j, Abdera 0.4, and Derby or MySQL for data storage. \n \n- Designed, architected, and implemented Mail client functionality for Chandler Desktop, an Open Source Collaborative Personal Information Management Application that runs on Windows, Linux, and Apple OS X.  \n \n- Internationalization Architect for the Chandler Desktop. \n \n- Debugged and fixed core dumps in the C++ WxWidgets API using GDB. \n \n- Core contributor to the Twisted SMTP, POP3, and IMAP4 client libraries including timeout support, MD5 authentication, and error handling. Twisted is an asynchronous Python event-driven engine that provides low-level networking support for Chandler Desktop. Senior Web / Desktop Engineer and I18n Guru Open Source Applications Foundation March 2004  –  April 2008  (4 years 2 months) I have done many projects while at OSAF including \n \nA Java based server and Ajax web UI for managing and sharing calendars, events, and tasks. It implements open data standards including CalDAV, WebDAV, Atom, and Atompub and leverages Tomcat, Spring, Hibernate, Acegi Security, ical4j, Abdera 0.4, and Derby or MySQL for data storage. \n \n- Designed, architected, and implemented Mail client functionality for Chandler Desktop, an Open Source Collaborative Personal Information Management Application that runs on Windows, Linux, and Apple OS X.  \n \n- Internationalization Architect for the Chandler Desktop. \n \n- Debugged and fixed core dumps in the C++ WxWidgets API using GDB. \n \n- Core contributor to the Twisted SMTP, POP3, and IMAP4 client libraries including timeout support, MD5 authentication, and error handling. Twisted is an asynchronous Python event-driven engine that provides low-level networking support for Chandler Desktop. Senior Java Developer (Contract) JobFlash December 2003  –  March 2004  (4 months) Architected Java Server Framework to power JobFlash V2.0 platform. Senior Java Developer (Contract) JobFlash December 2003  –  March 2004  (4 months) Architected Java Server Framework to power JobFlash V2.0 platform. Senior Lead Developer MetricStream (formerly Zaplet) 2003  –  2004  (1 year) Senior Lead Developer MetricStream (formerly Zaplet) 2003  –  2004  (1 year) Senior Software Engineer and Internationalization specialist Zaplet July 2002  –  December 2003  (1 year 6 months) Senior Software Engineer and Internationalization specialist Zaplet July 2002  –  December 2003  (1 year 6 months) Senior Client / Server Architect Macrovision June 2001  –  July 2002  (1 year 2 months) Senior Client / Server Architect Macrovision June 2001  –  July 2002  (1 year 2 months) Java Client / Server Developer (Contract) eBoomerang September 2001  –  December 2001  (4 months) Java Client / Server Developer (Contract) eBoomerang September 2001  –  December 2001  (4 months) Web Services Engineer (Contract) Appiant Technologies June 2001  –  August 2001  (3 months) Web Services Engineer (Contract) Appiant Technologies June 2001  –  August 2001  (3 months) Server Infrastructure and Protocol Architect (Contract) Excite@Home August 2000  –  June 2001  (11 months) Server Infrastructure and Protocol Architect (Contract) Excite@Home August 2000  –  June 2001  (11 months) Web UI Specialist and Email Application Engineer (Contract) Quaartz Inc. October 1999  –  August 2000  (11 months) Web UI Specialist and Email Application Engineer (Contract) Quaartz Inc. October 1999  –  August 2000  (11 months) Web Architect WebTraverse 1999  –  2000  (1 year) Web Architect WebTraverse 1999  –  2000  (1 year) Web Developer Consultant Tellem Worldwide 1999  –  1999  (less than a year) Web Developer Consultant Tellem Worldwide 1999  –  1999  (less than a year) Lead Developer - SETI Program Voyages Through Time NASA January 1998  –  December 1998  (1 year) Lead Developer - SETI Program Voyages Through Time NASA January 1998  –  December 1998  (1 year) Skills Web Applications JavaScript AJAX Java Software Development XML NodeJS Perl Python Ruby Ruby on Rails Web Services MySQL Management C# Microsoft SQL Server PHP Recruiting Objective-C Cloud Computing Git Linux See 7+     See less Skills  Web Applications JavaScript AJAX Java Software Development XML NodeJS Perl Python Ruby Ruby on Rails Web Services MySQL Management C# Microsoft SQL Server PHP Recruiting Objective-C Cloud Computing Git Linux See 7+     See less Web Applications JavaScript AJAX Java Software Development XML NodeJS Perl Python Ruby Ruby on Rails Web Services MySQL Management C# Microsoft SQL Server PHP Recruiting Objective-C Cloud Computing Git Linux See 7+     See less Web Applications JavaScript AJAX Java Software Development XML NodeJS Perl Python Ruby Ruby on Rails Web Services MySQL Management C# Microsoft SQL Server PHP Recruiting Objective-C Cloud Computing Git Linux See 7+     See less Education San Francisco State University M.A.,  Instructional Technology 1996  – 1998 San Francisco State University B.A.,  Jazz Performance 1995  – 1996 Activities and Societies:  Graduated Magna Cum Laude San Francisco State University M.A.,  Instructional Technology 1996  – 1998 San Francisco State University M.A.,  Instructional Technology 1996  – 1998 San Francisco State University M.A.,  Instructional Technology 1996  – 1998 San Francisco State University B.A.,  Jazz Performance 1995  – 1996 Activities and Societies:  Graduated Magna Cum Laude San Francisco State University B.A.,  Jazz Performance 1995  – 1996 Activities and Societies:  Graduated Magna Cum Laude San Francisco State University B.A.,  Jazz Performance 1995  – 1996 Activities and Societies:  Graduated Magna Cum Laude Honors & Awards ", "Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Web Analytics SEO E-commerce Google Analytics User Experience Community Management Information Architecture SEM Social Media Marketing Google Adwords Mobile Marketing Digital Marketing Web Development HTML Online Marketing CSS MySQL Wordpress Digital Strategy Bootstrap Adobe Marketing Cloud See 6+     See less Skills  Web Analytics SEO E-commerce Google Analytics User Experience Community Management Information Architecture SEM Social Media Marketing Google Adwords Mobile Marketing Digital Marketing Web Development HTML Online Marketing CSS MySQL Wordpress Digital Strategy Bootstrap Adobe Marketing Cloud See 6+     See less Web Analytics SEO E-commerce Google Analytics User Experience Community Management Information Architecture SEM Social Media Marketing Google Adwords Mobile Marketing Digital Marketing Web Development HTML Online Marketing CSS MySQL Wordpress Digital Strategy Bootstrap Adobe Marketing Cloud See 6+     See less Web Analytics SEO E-commerce Google Analytics User Experience Community Management Information Architecture SEM Social Media Marketing Google Adwords Mobile Marketing Digital Marketing Web Development HTML Online Marketing CSS MySQL Wordpress Digital Strategy Bootstrap Adobe Marketing Cloud See 6+     See less ", "Summary Proven track record of managing and delivering complex, high-visibility products in education, financial, B2B, e-commerce and health care. Products under my leadership were delivered consistently on time with high quality and within budget.  \n \nCurrently working on developing cutting edge products in the online education space for course designers, faculty and students. These products leverage adaptive learning to engage the students and increase retention.  \n \n19+ years’ experience in the areas of Engineering management, Product Requirements, Software Architecture, Design and Development and Services \n \nStrong leadership skills with the ability to work with cross functional teams  \n \nManaged on-shore and offshore engineering teams and QA teams of 70+ members with excellent talent retention.  \n \nExcellent problem-solving, communication and analytical skills. \n \nExperience with: J2EE, Java, SQL, XML, Oracle, MySQL, HTML, Javascript, AJAX, JSON, REST, Eclipse, Toad, weblogic, JBOSS \n \nSpecialties:  \nProduct Development \nEngineering Management  \nServices \nProduct Management \nOffshore management \nInternationalization Summary Proven track record of managing and delivering complex, high-visibility products in education, financial, B2B, e-commerce and health care. Products under my leadership were delivered consistently on time with high quality and within budget.  \n \nCurrently working on developing cutting edge products in the online education space for course designers, faculty and students. These products leverage adaptive learning to engage the students and increase retention.  \n \n19+ years’ experience in the areas of Engineering management, Product Requirements, Software Architecture, Design and Development and Services \n \nStrong leadership skills with the ability to work with cross functional teams  \n \nManaged on-shore and offshore engineering teams and QA teams of 70+ members with excellent talent retention.  \n \nExcellent problem-solving, communication and analytical skills. \n \nExperience with: J2EE, Java, SQL, XML, Oracle, MySQL, HTML, Javascript, AJAX, JSON, REST, Eclipse, Toad, weblogic, JBOSS \n \nSpecialties:  \nProduct Development \nEngineering Management  \nServices \nProduct Management \nOffshore management \nInternationalization Proven track record of managing and delivering complex, high-visibility products in education, financial, B2B, e-commerce and health care. Products under my leadership were delivered consistently on time with high quality and within budget.  \n \nCurrently working on developing cutting edge products in the online education space for course designers, faculty and students. These products leverage adaptive learning to engage the students and increase retention.  \n \n19+ years’ experience in the areas of Engineering management, Product Requirements, Software Architecture, Design and Development and Services \n \nStrong leadership skills with the ability to work with cross functional teams  \n \nManaged on-shore and offshore engineering teams and QA teams of 70+ members with excellent talent retention.  \n \nExcellent problem-solving, communication and analytical skills. \n \nExperience with: J2EE, Java, SQL, XML, Oracle, MySQL, HTML, Javascript, AJAX, JSON, REST, Eclipse, Toad, weblogic, JBOSS \n \nSpecialties:  \nProduct Development \nEngineering Management  \nServices \nProduct Management \nOffshore management \nInternationalization Proven track record of managing and delivering complex, high-visibility products in education, financial, B2B, e-commerce and health care. Products under my leadership were delivered consistently on time with high quality and within budget.  \n \nCurrently working on developing cutting edge products in the online education space for course designers, faculty and students. These products leverage adaptive learning to engage the students and increase retention.  \n \n19+ years’ experience in the areas of Engineering management, Product Requirements, Software Architecture, Design and Development and Services \n \nStrong leadership skills with the ability to work with cross functional teams  \n \nManaged on-shore and offshore engineering teams and QA teams of 70+ members with excellent talent retention.  \n \nExcellent problem-solving, communication and analytical skills. \n \nExperience with: J2EE, Java, SQL, XML, Oracle, MySQL, HTML, Javascript, AJAX, JSON, REST, Eclipse, Toad, weblogic, JBOSS \n \nSpecialties:  \nProduct Development \nEngineering Management  \nServices \nProduct Management \nOffshore management \nInternationalization Experience Director of Engineering Apollo Group May 2011  – Present (4 years 4 months) San Jose Bay Area Founded in 1973, Apollo Education Group, is a higher education leader, with more than 300,000 degree candidates and annual revenue of $5 billion. Apollo’s technology, advanced learning methodologies, and international reach are dramatically accelerating the innovation that is essential to transform higher education throughout the world. \n \no Managing development of multiple products (Classroom, Curriculum, Application Center and Financial Plan, Curriculum operations) with distributed teams (70+) across US and India  \no Developed excellent relationship with business and product team and soon became their primary liaison for development teams.  \no Led the design and development of complex features and developed a deep knowledge of the education domain and the product \no Continuous improvement of development processes to ensure high quality releases always delivered on time and within budget.  \no Worked with cross functional teams product, QA, platform teams, release and support. Continuously monitored risks and identified mitigations / solutions to deliver a successful product  \no Recently delivered a project at 1/4 the original estimate by finding innovative approaches and seeking high efficiency \no Frequently assisted in competitive analysis of the market for external customers.  \no In addition to leading engineering teams, built an operations team from ground up to assist our customers. This team has always received high acclaim for on time delivery and efficiency.  \no Ability to turn around failing products. Delivered a successful product Curriculum within 6 months of taking it over. It was initially slated for closure due to significant development delays and low budget. Provided guidance on architecture and design. Motivated the team to ensure a successful release. \no Ability to turn angry customers to highly satisfied customers by working closely with them to understand their concerns and ensuring we build the necessary features to address any gaps  \n Director, Engineering and Products Nomis Solutions April 2004  –  May 2011  (7 years 2 months) San Francisco Bay Area Provider of Pricing & Profitability Management software solutions for financial services companies \n \nManaging multiple products successfully deployed at several large banks and financial institutions in several countries \nUnderstand customer requirements and establish product roadmap for two products. \nManage interaction and visual design teams to enhance user experience \nResponsible for product requirements, architecture, design, development and QA  \nManage geographically distributed teams Internationalization Specialist Active Decision and Covigna November 2002  –  March 2004  (1 year 5 months) o\tEnabled ADI to move their products to the global markets in a timely manner \no\tWorked closely with executive management, sales, professional services, product management, development and QA \no Analyzed current and potential customer requirements for  \nlarge companies such as Sony, Staples, etc. \no Architected and developed the i18n framework layer to  \nenable deployment in European countries Engineering Manager (Internalization) i2/Rightworks March 2000  –  August 2002  (2 years 6 months) Rightworks was a startup company providing eBusiness/e-procurement applications for global enterprises. It was acquired by i2 Technologies. \no Given global charter to drive Supply Chain, Demand Fulfillment, CRM, Negotiate, Procurement, Logistics, Catalog and Content Management products into global markets \no Central point of contact for product management, sales, QA, development, support and professional services for internationalization \no Managed development, QA and internationalization for 3 products \no Provided internationalization specifications, requirements and guidelines for all i2 products \no Worked in the core technology group for server side and front end development of an e-procurement application. Involved in the complete life cycle from architecture, design and development \no Developed the java framework for modules such as i18n, import/export feature, multi-zone bid/supply Senior Engineer. Project Lead CKS February 1998  –  March 2000  (2 years 2 months) Involved in the specification of user requirements and ensuring deployment of projects from design, development, support and training for companies such as: \no Johnson & Johnson: Intranet site for OBI to facilitate automation and archival of their entire processes between 50 operating companies in 140 countries \no Televisa: Content management and e-commerce site for major television/media conglomerate in Mexico. Dealt with real time data feeds of large amount of bilingual content \no Levis Strauss & Co, Logitech: Technical lead/Architect for measurement and analysis for their e-commerce sites in 10 countries worldwide Sr. Software Engineer Viewlogic January 1997  –  December 1997  (1 year) o Led architecture and design of the object model for a new tool called the “Behavioral Synthesis Tool” \no Developed requirements for integrations into other products Software Engineer Micro-Frame Technologies (now Business Engine) January 1996  –  January 1997  (1 year 1 month) o Designed and developed various modules in Project planning and management software \no Designed and developed assignment wizard to do a multi-dimensional cost analysis based on resources, skill set, price and time Director of Engineering Apollo Group May 2011  – Present (4 years 4 months) San Jose Bay Area Founded in 1973, Apollo Education Group, is a higher education leader, with more than 300,000 degree candidates and annual revenue of $5 billion. Apollo’s technology, advanced learning methodologies, and international reach are dramatically accelerating the innovation that is essential to transform higher education throughout the world. \n \no Managing development of multiple products (Classroom, Curriculum, Application Center and Financial Plan, Curriculum operations) with distributed teams (70+) across US and India  \no Developed excellent relationship with business and product team and soon became their primary liaison for development teams.  \no Led the design and development of complex features and developed a deep knowledge of the education domain and the product \no Continuous improvement of development processes to ensure high quality releases always delivered on time and within budget.  \no Worked with cross functional teams product, QA, platform teams, release and support. Continuously monitored risks and identified mitigations / solutions to deliver a successful product  \no Recently delivered a project at 1/4 the original estimate by finding innovative approaches and seeking high efficiency \no Frequently assisted in competitive analysis of the market for external customers.  \no In addition to leading engineering teams, built an operations team from ground up to assist our customers. This team has always received high acclaim for on time delivery and efficiency.  \no Ability to turn around failing products. Delivered a successful product Curriculum within 6 months of taking it over. It was initially slated for closure due to significant development delays and low budget. Provided guidance on architecture and design. Motivated the team to ensure a successful release. \no Ability to turn angry customers to highly satisfied customers by working closely with them to understand their concerns and ensuring we build the necessary features to address any gaps  \n Director of Engineering Apollo Group May 2011  – Present (4 years 4 months) San Jose Bay Area Founded in 1973, Apollo Education Group, is a higher education leader, with more than 300,000 degree candidates and annual revenue of $5 billion. Apollo’s technology, advanced learning methodologies, and international reach are dramatically accelerating the innovation that is essential to transform higher education throughout the world. \n \no Managing development of multiple products (Classroom, Curriculum, Application Center and Financial Plan, Curriculum operations) with distributed teams (70+) across US and India  \no Developed excellent relationship with business and product team and soon became their primary liaison for development teams.  \no Led the design and development of complex features and developed a deep knowledge of the education domain and the product \no Continuous improvement of development processes to ensure high quality releases always delivered on time and within budget.  \no Worked with cross functional teams product, QA, platform teams, release and support. Continuously monitored risks and identified mitigations / solutions to deliver a successful product  \no Recently delivered a project at 1/4 the original estimate by finding innovative approaches and seeking high efficiency \no Frequently assisted in competitive analysis of the market for external customers.  \no In addition to leading engineering teams, built an operations team from ground up to assist our customers. This team has always received high acclaim for on time delivery and efficiency.  \no Ability to turn around failing products. Delivered a successful product Curriculum within 6 months of taking it over. It was initially slated for closure due to significant development delays and low budget. Provided guidance on architecture and design. Motivated the team to ensure a successful release. \no Ability to turn angry customers to highly satisfied customers by working closely with them to understand their concerns and ensuring we build the necessary features to address any gaps  \n Director, Engineering and Products Nomis Solutions April 2004  –  May 2011  (7 years 2 months) San Francisco Bay Area Provider of Pricing & Profitability Management software solutions for financial services companies \n \nManaging multiple products successfully deployed at several large banks and financial institutions in several countries \nUnderstand customer requirements and establish product roadmap for two products. \nManage interaction and visual design teams to enhance user experience \nResponsible for product requirements, architecture, design, development and QA  \nManage geographically distributed teams Director, Engineering and Products Nomis Solutions April 2004  –  May 2011  (7 years 2 months) San Francisco Bay Area Provider of Pricing & Profitability Management software solutions for financial services companies \n \nManaging multiple products successfully deployed at several large banks and financial institutions in several countries \nUnderstand customer requirements and establish product roadmap for two products. \nManage interaction and visual design teams to enhance user experience \nResponsible for product requirements, architecture, design, development and QA  \nManage geographically distributed teams Internationalization Specialist Active Decision and Covigna November 2002  –  March 2004  (1 year 5 months) o\tEnabled ADI to move their products to the global markets in a timely manner \no\tWorked closely with executive management, sales, professional services, product management, development and QA \no Analyzed current and potential customer requirements for  \nlarge companies such as Sony, Staples, etc. \no Architected and developed the i18n framework layer to  \nenable deployment in European countries Internationalization Specialist Active Decision and Covigna November 2002  –  March 2004  (1 year 5 months) o\tEnabled ADI to move their products to the global markets in a timely manner \no\tWorked closely with executive management, sales, professional services, product management, development and QA \no Analyzed current and potential customer requirements for  \nlarge companies such as Sony, Staples, etc. \no Architected and developed the i18n framework layer to  \nenable deployment in European countries Engineering Manager (Internalization) i2/Rightworks March 2000  –  August 2002  (2 years 6 months) Rightworks was a startup company providing eBusiness/e-procurement applications for global enterprises. It was acquired by i2 Technologies. \no Given global charter to drive Supply Chain, Demand Fulfillment, CRM, Negotiate, Procurement, Logistics, Catalog and Content Management products into global markets \no Central point of contact for product management, sales, QA, development, support and professional services for internationalization \no Managed development, QA and internationalization for 3 products \no Provided internationalization specifications, requirements and guidelines for all i2 products \no Worked in the core technology group for server side and front end development of an e-procurement application. Involved in the complete life cycle from architecture, design and development \no Developed the java framework for modules such as i18n, import/export feature, multi-zone bid/supply Engineering Manager (Internalization) i2/Rightworks March 2000  –  August 2002  (2 years 6 months) Rightworks was a startup company providing eBusiness/e-procurement applications for global enterprises. It was acquired by i2 Technologies. \no Given global charter to drive Supply Chain, Demand Fulfillment, CRM, Negotiate, Procurement, Logistics, Catalog and Content Management products into global markets \no Central point of contact for product management, sales, QA, development, support and professional services for internationalization \no Managed development, QA and internationalization for 3 products \no Provided internationalization specifications, requirements and guidelines for all i2 products \no Worked in the core technology group for server side and front end development of an e-procurement application. Involved in the complete life cycle from architecture, design and development \no Developed the java framework for modules such as i18n, import/export feature, multi-zone bid/supply Senior Engineer. Project Lead CKS February 1998  –  March 2000  (2 years 2 months) Involved in the specification of user requirements and ensuring deployment of projects from design, development, support and training for companies such as: \no Johnson & Johnson: Intranet site for OBI to facilitate automation and archival of their entire processes between 50 operating companies in 140 countries \no Televisa: Content management and e-commerce site for major television/media conglomerate in Mexico. Dealt with real time data feeds of large amount of bilingual content \no Levis Strauss & Co, Logitech: Technical lead/Architect for measurement and analysis for their e-commerce sites in 10 countries worldwide Senior Engineer. Project Lead CKS February 1998  –  March 2000  (2 years 2 months) Involved in the specification of user requirements and ensuring deployment of projects from design, development, support and training for companies such as: \no Johnson & Johnson: Intranet site for OBI to facilitate automation and archival of their entire processes between 50 operating companies in 140 countries \no Televisa: Content management and e-commerce site for major television/media conglomerate in Mexico. Dealt with real time data feeds of large amount of bilingual content \no Levis Strauss & Co, Logitech: Technical lead/Architect for measurement and analysis for their e-commerce sites in 10 countries worldwide Sr. Software Engineer Viewlogic January 1997  –  December 1997  (1 year) o Led architecture and design of the object model for a new tool called the “Behavioral Synthesis Tool” \no Developed requirements for integrations into other products Sr. Software Engineer Viewlogic January 1997  –  December 1997  (1 year) o Led architecture and design of the object model for a new tool called the “Behavioral Synthesis Tool” \no Developed requirements for integrations into other products Software Engineer Micro-Frame Technologies (now Business Engine) January 1996  –  January 1997  (1 year 1 month) o Designed and developed various modules in Project planning and management software \no Designed and developed assignment wizard to do a multi-dimensional cost analysis based on resources, skill set, price and time Software Engineer Micro-Frame Technologies (now Business Engine) January 1996  –  January 1997  (1 year 1 month) o Designed and developed various modules in Project planning and management software \no Designed and developed assignment wizard to do a multi-dimensional cost analysis based on resources, skill set, price and time Languages Hindi Telugu Tamil French Elementary proficiency Hindi Telugu Tamil French Elementary proficiency Hindi Telugu Tamil French Elementary proficiency Elementary proficiency Skills Engineering Management Product Development Software Development Software Design SDLC Offshore Software... Enterprise Software Analytics Web Applications Software Engineering Project Management Quality Assurance SQL Business Intelligence E-commerce Eclipse J2EE Requirements Analysis Integration Product Management Java XML Java Enterprise Edition See 8+     See less Skills  Engineering Management Product Development Software Development Software Design SDLC Offshore Software... Enterprise Software Analytics Web Applications Software Engineering Project Management Quality Assurance SQL Business Intelligence E-commerce Eclipse J2EE Requirements Analysis Integration Product Management Java XML Java Enterprise Edition See 8+     See less Engineering Management Product Development Software Development Software Design SDLC Offshore Software... Enterprise Software Analytics Web Applications Software Engineering Project Management Quality Assurance SQL Business Intelligence E-commerce Eclipse J2EE Requirements Analysis Integration Product Management Java XML Java Enterprise Edition See 8+     See less Engineering Management Product Development Software Development Software Design SDLC Offshore Software... Enterprise Software Analytics Web Applications Software Engineering Project Management Quality Assurance SQL Business Intelligence E-commerce Eclipse J2EE Requirements Analysis Integration Product Management Java XML Java Enterprise Edition See 8+     See less Education University of California, Riverside MS,  Computer Science 1994  – 1995 Anna University BE,  Electrical Engineering (ECE) 1989  – 1993 University of California, Riverside MS,  Computer Science 1994  – 1995 University of California, Riverside MS,  Computer Science 1994  – 1995 University of California, Riverside MS,  Computer Science 1994  – 1995 Anna University BE,  Electrical Engineering (ECE) 1989  – 1993 Anna University BE,  Electrical Engineering (ECE) 1989  – 1993 Anna University BE,  Electrical Engineering (ECE) 1989  – 1993 ", "Summary Career Summary:  \nLea is a globally competent project & knowledge management, and capacity & relationships development expert, seasoned in the education sector and at multinationals, and passionate about organizational/leadership development via education, information and communication technologies, and in particularly higher education internationalization. Summary Career Summary:  \nLea is a globally competent project & knowledge management, and capacity & relationships development expert, seasoned in the education sector and at multinationals, and passionate about organizational/leadership development via education, information and communication technologies, and in particularly higher education internationalization. Career Summary:  \nLea is a globally competent project & knowledge management, and capacity & relationships development expert, seasoned in the education sector and at multinationals, and passionate about organizational/leadership development via education, information and communication technologies, and in particularly higher education internationalization. Career Summary:  \nLea is a globally competent project & knowledge management, and capacity & relationships development expert, seasoned in the education sector and at multinationals, and passionate about organizational/leadership development via education, information and communication technologies, and in particularly higher education internationalization. Experience Higher Education Internationalization Specialist Higher Education Internationalization January 2015  – Present (8 months) Greater Jakarta Area, Indonesia -\tDrive internationalization of Indonesian academic feminist thought by editing Indonesian Feminist Journal, helping to construct journal webpage, and facilitating international visibilty events/networks \n-\tInvestigate trends and issues in higher education internationalization in Indonesia and SE Asia in a personally launched quarterly HEIzation Blog to advocate sectoral benefits at the national and regional levels \n-\tModerate a self-initiated LinkedIn informational and professional networking group HEI-SEA on higher education internationalization in Southeast Asia (with focus on Indonesia) to enhance professional development in the region \n-\tProvided Lone Star College Jakarta with short-term technical support in internationalization efforts investigating German cooperation opportunities  \n Business Process Enhancer on IT Projects in the U.S., Poland, and Croatia Commercial Metals Company December 2008  –  February 2012  (3 years 3 months) Irving, TX, SAD; Zawiercie, Poland; Sisak, Croatia - Designed, coordinated, executed and evaluated ICT workshops and online courses for end users and future trainers in managing the training phase of 2 software solution implementation projects (300 people per implementation)  \n- Improved business intelligence in production planning and tracking through production floor, inter-departmental and virtual consolidation and automation proposals (team designed as-is and to-be process comparisons on 7 projects based on identified stakeholder needs) \n- Managed change and stabilized solutions through stakeholder and risk analyses, troubleshooting solution bugs or gaps through on-site and telephone customer support, and maintenance of translation databases Management Board Assistant/English-Croatian Interpreter (Finance, Human Resources, and Operations) CMC Sisak d.o.o. August 2007  –  November 2008  (1 year 4 months) Sisak, Croatia - Facilitated public relations and internal communication interpreting operational meetings between executives and other management personnel, trade unions, customers and auditors, as well as procedural documents \n- Recruited and selected a foreign language school for the English language training project (300 employees), negotiated and drafted a two-year contract, and assisted in logistical organization (facilities/schedule) and quality supervision Higher Education Internationalization Specialist Higher Education Internationalization January 2015  – Present (8 months) Greater Jakarta Area, Indonesia -\tDrive internationalization of Indonesian academic feminist thought by editing Indonesian Feminist Journal, helping to construct journal webpage, and facilitating international visibilty events/networks \n-\tInvestigate trends and issues in higher education internationalization in Indonesia and SE Asia in a personally launched quarterly HEIzation Blog to advocate sectoral benefits at the national and regional levels \n-\tModerate a self-initiated LinkedIn informational and professional networking group HEI-SEA on higher education internationalization in Southeast Asia (with focus on Indonesia) to enhance professional development in the region \n-\tProvided Lone Star College Jakarta with short-term technical support in internationalization efforts investigating German cooperation opportunities  \n Higher Education Internationalization Specialist Higher Education Internationalization January 2015  – Present (8 months) Greater Jakarta Area, Indonesia -\tDrive internationalization of Indonesian academic feminist thought by editing Indonesian Feminist Journal, helping to construct journal webpage, and facilitating international visibilty events/networks \n-\tInvestigate trends and issues in higher education internationalization in Indonesia and SE Asia in a personally launched quarterly HEIzation Blog to advocate sectoral benefits at the national and regional levels \n-\tModerate a self-initiated LinkedIn informational and professional networking group HEI-SEA on higher education internationalization in Southeast Asia (with focus on Indonesia) to enhance professional development in the region \n-\tProvided Lone Star College Jakarta with short-term technical support in internationalization efforts investigating German cooperation opportunities  \n Business Process Enhancer on IT Projects in the U.S., Poland, and Croatia Commercial Metals Company December 2008  –  February 2012  (3 years 3 months) Irving, TX, SAD; Zawiercie, Poland; Sisak, Croatia - Designed, coordinated, executed and evaluated ICT workshops and online courses for end users and future trainers in managing the training phase of 2 software solution implementation projects (300 people per implementation)  \n- Improved business intelligence in production planning and tracking through production floor, inter-departmental and virtual consolidation and automation proposals (team designed as-is and to-be process comparisons on 7 projects based on identified stakeholder needs) \n- Managed change and stabilized solutions through stakeholder and risk analyses, troubleshooting solution bugs or gaps through on-site and telephone customer support, and maintenance of translation databases Business Process Enhancer on IT Projects in the U.S., Poland, and Croatia Commercial Metals Company December 2008  –  February 2012  (3 years 3 months) Irving, TX, SAD; Zawiercie, Poland; Sisak, Croatia - Designed, coordinated, executed and evaluated ICT workshops and online courses for end users and future trainers in managing the training phase of 2 software solution implementation projects (300 people per implementation)  \n- Improved business intelligence in production planning and tracking through production floor, inter-departmental and virtual consolidation and automation proposals (team designed as-is and to-be process comparisons on 7 projects based on identified stakeholder needs) \n- Managed change and stabilized solutions through stakeholder and risk analyses, troubleshooting solution bugs or gaps through on-site and telephone customer support, and maintenance of translation databases Management Board Assistant/English-Croatian Interpreter (Finance, Human Resources, and Operations) CMC Sisak d.o.o. August 2007  –  November 2008  (1 year 4 months) Sisak, Croatia - Facilitated public relations and internal communication interpreting operational meetings between executives and other management personnel, trade unions, customers and auditors, as well as procedural documents \n- Recruited and selected a foreign language school for the English language training project (300 employees), negotiated and drafted a two-year contract, and assisted in logistical organization (facilities/schedule) and quality supervision Management Board Assistant/English-Croatian Interpreter (Finance, Human Resources, and Operations) CMC Sisak d.o.o. August 2007  –  November 2008  (1 year 4 months) Sisak, Croatia - Facilitated public relations and internal communication interpreting operational meetings between executives and other management personnel, trade unions, customers and auditors, as well as procedural documents \n- Recruited and selected a foreign language school for the English language training project (300 employees), negotiated and drafted a two-year contract, and assisted in logistical organization (facilities/schedule) and quality supervision Languages Croatian Native or bilingual proficiency English Native or bilingual proficiency German Full professional proficiency Indonesisch Elementary proficiency Croatian Native or bilingual proficiency English Native or bilingual proficiency German Full professional proficiency Indonesisch Elementary proficiency Croatian Native or bilingual proficiency English Native or bilingual proficiency German Full professional proficiency Indonesisch Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Project Management Research Business Analysis Project Planning Microsoft Office English Data Analysis SAP ERP Adult Education International Education SAP Teaching Business Process... Business Process German Analysis Training Marketing Management Curriculum Design Academic Advising Organizational... Business Development Works well in a team Intercultural... Global Outlook Interdisciplinary... ICT E-Learning Capacity Development Croatian See 16+     See less Skills  Project Management Research Business Analysis Project Planning Microsoft Office English Data Analysis SAP ERP Adult Education International Education SAP Teaching Business Process... Business Process German Analysis Training Marketing Management Curriculum Design Academic Advising Organizational... Business Development Works well in a team Intercultural... Global Outlook Interdisciplinary... ICT E-Learning Capacity Development Croatian See 16+     See less Project Management Research Business Analysis Project Planning Microsoft Office English Data Analysis SAP ERP Adult Education International Education SAP Teaching Business Process... Business Process German Analysis Training Marketing Management Curriculum Design Academic Advising Organizational... Business Development Works well in a team Intercultural... Global Outlook Interdisciplinary... ICT E-Learning Capacity Development Croatian See 16+     See less Project Management Research Business Analysis Project Planning Microsoft Office English Data Analysis SAP ERP Adult Education International Education SAP Teaching Business Process... Business Process German Analysis Training Marketing Management Curriculum Design Academic Advising Organizational... Business Development Works well in a team Intercultural... Global Outlook Interdisciplinary... ICT E-Learning Capacity Development Croatian See 16+     See less Education University of Leipzig Master's Degree,  International/Global Studies , ECTS: 120; Grade average: 90% 2012  – 2014 Focus fields: theory of knowledge; theory, history and sociology of socio-geographic engineering; network and flow systems of knowledge, trade and people; international political economy; higher education internationalization and development; long distance learning technologies and politics \n \nFocus regions: Africa, Southeast Asia, and Europe Whitman College Bachelor's Degree,  German Literature and Psychology , ECTS: 276; Grade average: 86% 2002  – 2006 Focus fields: experimental design, statistics, and literary analysis Mahindra United World College of India International Baccalaureate Diploma 1999  – 2001 Focus areas: languages, statistics, history, biology University of Leipzig Master's Degree,  International/Global Studies , ECTS: 120; Grade average: 90% 2012  – 2014 Focus fields: theory of knowledge; theory, history and sociology of socio-geographic engineering; network and flow systems of knowledge, trade and people; international political economy; higher education internationalization and development; long distance learning technologies and politics \n \nFocus regions: Africa, Southeast Asia, and Europe University of Leipzig Master's Degree,  International/Global Studies , ECTS: 120; Grade average: 90% 2012  – 2014 Focus fields: theory of knowledge; theory, history and sociology of socio-geographic engineering; network and flow systems of knowledge, trade and people; international political economy; higher education internationalization and development; long distance learning technologies and politics \n \nFocus regions: Africa, Southeast Asia, and Europe University of Leipzig Master's Degree,  International/Global Studies , ECTS: 120; Grade average: 90% 2012  – 2014 Focus fields: theory of knowledge; theory, history and sociology of socio-geographic engineering; network and flow systems of knowledge, trade and people; international political economy; higher education internationalization and development; long distance learning technologies and politics \n \nFocus regions: Africa, Southeast Asia, and Europe Whitman College Bachelor's Degree,  German Literature and Psychology , ECTS: 276; Grade average: 86% 2002  – 2006 Focus fields: experimental design, statistics, and literary analysis Whitman College Bachelor's Degree,  German Literature and Psychology , ECTS: 276; Grade average: 86% 2002  – 2006 Focus fields: experimental design, statistics, and literary analysis Whitman College Bachelor's Degree,  German Literature and Psychology , ECTS: 276; Grade average: 86% 2002  – 2006 Focus fields: experimental design, statistics, and literary analysis Mahindra United World College of India International Baccalaureate Diploma 1999  – 2001 Focus areas: languages, statistics, history, biology Mahindra United World College of India International Baccalaureate Diploma 1999  – 2001 Focus areas: languages, statistics, history, biology Mahindra United World College of India International Baccalaureate Diploma 1999  – 2001 Focus areas: languages, statistics, history, biology ", "Experience PhD Office Administrator - Department of Mechanical Engineering Politecnico di Milano January 2012  – Present (3 years 8 months) Milan Area, Italy Managing administrative and academic procedures and agenda for the Doctoral Programme in Mechanical Engineering; planning, developing and implementing PR and internationalization strategies; preparing and supervising the production of brochures, handouts, leaflets, web contents; career tracing and development of recruiting strategies; foreign and Italian PhD candidates' support. Press Officer Ge.Fi. spa October 2011  –  December 2011  (3 months) Milan Area, Italy Artigiano in Fiera 2011: Developing and implementing PR strategies; managing press releases and media coverage; writing of case studies, speeches, articles; preparing and supervising production of brochures, handouts, direct mail leaflets; organizing events including press conferences, exhibitions, open days and press tours. Press officer, Department of Education, Family and Support Services Comune di Milano April 2010  –  June 2011  (1 year 3 months) Milan Area, Italy Developing and implementing PR strategies; managing press releases and media coverage; writing of case studies, speeches, articles and annual reports; preparing and supervising production of brochures, handouts, direct mail leaflets; organizing events including press conferences, exhibitions, open days and press tours. Journalist Radio Lombardia January 2010  –  April 2010  (4 months) Producing and editing nationwide an local radio news, in-depth analysis, interviews; weather forecast and traffic news. Journalist RCS MediaGroup January 2005  –  September 2009  (4 years 9 months) Milan Area, Italy Producing and editing nationwide radio news, weather forecast and traffic news programs. PhD Office Administrator - Department of Mechanical Engineering Politecnico di Milano January 2012  – Present (3 years 8 months) Milan Area, Italy Managing administrative and academic procedures and agenda for the Doctoral Programme in Mechanical Engineering; planning, developing and implementing PR and internationalization strategies; preparing and supervising the production of brochures, handouts, leaflets, web contents; career tracing and development of recruiting strategies; foreign and Italian PhD candidates' support. PhD Office Administrator - Department of Mechanical Engineering Politecnico di Milano January 2012  – Present (3 years 8 months) Milan Area, Italy Managing administrative and academic procedures and agenda for the Doctoral Programme in Mechanical Engineering; planning, developing and implementing PR and internationalization strategies; preparing and supervising the production of brochures, handouts, leaflets, web contents; career tracing and development of recruiting strategies; foreign and Italian PhD candidates' support. Press Officer Ge.Fi. spa October 2011  –  December 2011  (3 months) Milan Area, Italy Artigiano in Fiera 2011: Developing and implementing PR strategies; managing press releases and media coverage; writing of case studies, speeches, articles; preparing and supervising production of brochures, handouts, direct mail leaflets; organizing events including press conferences, exhibitions, open days and press tours. Press Officer Ge.Fi. spa October 2011  –  December 2011  (3 months) Milan Area, Italy Artigiano in Fiera 2011: Developing and implementing PR strategies; managing press releases and media coverage; writing of case studies, speeches, articles; preparing and supervising production of brochures, handouts, direct mail leaflets; organizing events including press conferences, exhibitions, open days and press tours. Press officer, Department of Education, Family and Support Services Comune di Milano April 2010  –  June 2011  (1 year 3 months) Milan Area, Italy Developing and implementing PR strategies; managing press releases and media coverage; writing of case studies, speeches, articles and annual reports; preparing and supervising production of brochures, handouts, direct mail leaflets; organizing events including press conferences, exhibitions, open days and press tours. Press officer, Department of Education, Family and Support Services Comune di Milano April 2010  –  June 2011  (1 year 3 months) Milan Area, Italy Developing and implementing PR strategies; managing press releases and media coverage; writing of case studies, speeches, articles and annual reports; preparing and supervising production of brochures, handouts, direct mail leaflets; organizing events including press conferences, exhibitions, open days and press tours. Journalist Radio Lombardia January 2010  –  April 2010  (4 months) Producing and editing nationwide an local radio news, in-depth analysis, interviews; weather forecast and traffic news. Journalist Radio Lombardia January 2010  –  April 2010  (4 months) Producing and editing nationwide an local radio news, in-depth analysis, interviews; weather forecast and traffic news. Journalist RCS MediaGroup January 2005  –  September 2009  (4 years 9 months) Milan Area, Italy Producing and editing nationwide radio news, weather forecast and traffic news programs. Journalist RCS MediaGroup January 2005  –  September 2009  (4 years 9 months) Milan Area, Italy Producing and editing nationwide radio news, weather forecast and traffic news programs. Languages Italiano Native or bilingual proficiency Inglese Native or bilingual proficiency Francese Professional working proficiency Italiano Native or bilingual proficiency Inglese Native or bilingual proficiency Francese Professional working proficiency Italiano Native or bilingual proficiency Inglese Native or bilingual proficiency Francese Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Social Networking Editing New Media Media Relations Editorial Web Editing Event Management Journalism Speech Writing News Writing Communication International Relations International... Procedure Development History Gender Studies Political Science Political Philosophy Pubbliche relazioni Comunicati stampa Lingua italiana Scrittura See 7+     See less Skills  Social Networking Editing New Media Media Relations Editorial Web Editing Event Management Journalism Speech Writing News Writing Communication International Relations International... Procedure Development History Gender Studies Political Science Political Philosophy Pubbliche relazioni Comunicati stampa Lingua italiana Scrittura See 7+     See less Social Networking Editing New Media Media Relations Editorial Web Editing Event Management Journalism Speech Writing News Writing Communication International Relations International... Procedure Development History Gender Studies Political Science Political Philosophy Pubbliche relazioni Comunicati stampa Lingua italiana Scrittura See 7+     See less Social Networking Editing New Media Media Relations Editorial Web Editing Event Management Journalism Speech Writing News Writing Communication International Relations International... Procedure Development History Gender Studies Political Science Political Philosophy Pubbliche relazioni Comunicati stampa Lingua italiana Scrittura See 7+     See less Education PhD Università degli Studi di Milano Doctor of Philosophy (PhD),  Political History 2007  – 2010 PhD thesis \nAlexis de Tocqueville and the Americans: the reception of Democracy Università degli Studi di Milano Master's degree,  History , Cum Laude 1999  – 2004 PhD Università degli Studi di Milano Doctor of Philosophy (PhD),  Political History 2007  – 2010 PhD thesis \nAlexis de Tocqueville and the Americans: the reception of Democracy PhD Università degli Studi di Milano Doctor of Philosophy (PhD),  Political History 2007  – 2010 PhD thesis \nAlexis de Tocqueville and the Americans: the reception of Democracy PhD Università degli Studi di Milano Doctor of Philosophy (PhD),  Political History 2007  – 2010 PhD thesis \nAlexis de Tocqueville and the Americans: the reception of Democracy Università degli Studi di Milano Master's degree,  History , Cum Laude 1999  – 2004 Università degli Studi di Milano Master's degree,  History , Cum Laude 1999  – 2004 Università degli Studi di Milano Master's degree,  History , Cum Laude 1999  – 2004 ", "Summary Aki is a product guy turned into the venture capitalist. He is also passionate about building the new business, fostering the entrepreneurs and facilitating the design thinking workshop. \n \n \nAki is a partner with WiL, a $360M hybrid venture fund based in Palo Alto with three business missions to bridge the gap between startups and corporates: 1. Investment, 2. Incubation, 3. Education. \nSweet spot is in the middle stage with $5M-$20M investment. Aki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \nPrior to WiL, Aki was in charge of early stage investment for Digital Garage focused on social, advertisement and payment vertical. Aki has worked with Twitter, Path, Udemy, Kamcord, etc to accelerate their Japan business backed by Digital Garage Tokyo team and led 30+ early stage investments over 3 years. \nAki joined Digital Garage as a product manager at Tokyo office in 2003. He led the engineering team and UX team in various projects for clients. He moved to Bay Area in 2008 to open up the first office in US to support portfolio companies. He worked at Twitter HQ in San Francisco to grow the early Twitter Japan until 2011. \nPrior to Digital Garage, Aki was a software programmer such as Java, Perl, Visual Basic and Cobol at AIS for 3 years. Prior to that, Aki was a construction site manager at Kumagai-Gumi, the general contractor in Japan. \n \nSpecialties: VC, early stage investment, marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable, advertisement, cross-border business development between US and Japan, product development, off-shore development, online marketing, buzz marketing, social media, CakePHP, iPhone App, LAMP, Japanese, English Summary Aki is a product guy turned into the venture capitalist. He is also passionate about building the new business, fostering the entrepreneurs and facilitating the design thinking workshop. \n \n \nAki is a partner with WiL, a $360M hybrid venture fund based in Palo Alto with three business missions to bridge the gap between startups and corporates: 1. Investment, 2. Incubation, 3. Education. \nSweet spot is in the middle stage with $5M-$20M investment. Aki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \nPrior to WiL, Aki was in charge of early stage investment for Digital Garage focused on social, advertisement and payment vertical. Aki has worked with Twitter, Path, Udemy, Kamcord, etc to accelerate their Japan business backed by Digital Garage Tokyo team and led 30+ early stage investments over 3 years. \nAki joined Digital Garage as a product manager at Tokyo office in 2003. He led the engineering team and UX team in various projects for clients. He moved to Bay Area in 2008 to open up the first office in US to support portfolio companies. He worked at Twitter HQ in San Francisco to grow the early Twitter Japan until 2011. \nPrior to Digital Garage, Aki was a software programmer such as Java, Perl, Visual Basic and Cobol at AIS for 3 years. Prior to that, Aki was a construction site manager at Kumagai-Gumi, the general contractor in Japan. \n \nSpecialties: VC, early stage investment, marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable, advertisement, cross-border business development between US and Japan, product development, off-shore development, online marketing, buzz marketing, social media, CakePHP, iPhone App, LAMP, Japanese, English Aki is a product guy turned into the venture capitalist. He is also passionate about building the new business, fostering the entrepreneurs and facilitating the design thinking workshop. \n \n \nAki is a partner with WiL, a $360M hybrid venture fund based in Palo Alto with three business missions to bridge the gap between startups and corporates: 1. Investment, 2. Incubation, 3. Education. \nSweet spot is in the middle stage with $5M-$20M investment. Aki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \nPrior to WiL, Aki was in charge of early stage investment for Digital Garage focused on social, advertisement and payment vertical. Aki has worked with Twitter, Path, Udemy, Kamcord, etc to accelerate their Japan business backed by Digital Garage Tokyo team and led 30+ early stage investments over 3 years. \nAki joined Digital Garage as a product manager at Tokyo office in 2003. He led the engineering team and UX team in various projects for clients. He moved to Bay Area in 2008 to open up the first office in US to support portfolio companies. He worked at Twitter HQ in San Francisco to grow the early Twitter Japan until 2011. \nPrior to Digital Garage, Aki was a software programmer such as Java, Perl, Visual Basic and Cobol at AIS for 3 years. Prior to that, Aki was a construction site manager at Kumagai-Gumi, the general contractor in Japan. \n \nSpecialties: VC, early stage investment, marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable, advertisement, cross-border business development between US and Japan, product development, off-shore development, online marketing, buzz marketing, social media, CakePHP, iPhone App, LAMP, Japanese, English Aki is a product guy turned into the venture capitalist. He is also passionate about building the new business, fostering the entrepreneurs and facilitating the design thinking workshop. \n \n \nAki is a partner with WiL, a $360M hybrid venture fund based in Palo Alto with three business missions to bridge the gap between startups and corporates: 1. Investment, 2. Incubation, 3. Education. \nSweet spot is in the middle stage with $5M-$20M investment. Aki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \nPrior to WiL, Aki was in charge of early stage investment for Digital Garage focused on social, advertisement and payment vertical. Aki has worked with Twitter, Path, Udemy, Kamcord, etc to accelerate their Japan business backed by Digital Garage Tokyo team and led 30+ early stage investments over 3 years. \nAki joined Digital Garage as a product manager at Tokyo office in 2003. He led the engineering team and UX team in various projects for clients. He moved to Bay Area in 2008 to open up the first office in US to support portfolio companies. He worked at Twitter HQ in San Francisco to grow the early Twitter Japan until 2011. \nPrior to Digital Garage, Aki was a software programmer such as Java, Perl, Visual Basic and Cobol at AIS for 3 years. Prior to that, Aki was a construction site manager at Kumagai-Gumi, the general contractor in Japan. \n \nSpecialties: VC, early stage investment, marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable, advertisement, cross-border business development between US and Japan, product development, off-shore development, online marketing, buzz marketing, social media, CakePHP, iPhone App, LAMP, Japanese, English Experience Partner World Innovation Lab (WiL) March 2014  – Present (1 year 6 months) Palo Alto, CA 1. Investment - Foster new global ventures \nWiL invests in startups with global appeal and disruptive potential. \nWe typically invest $5M to $30M in mid-to-late-stage startups in the US. \nAki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \n2. Business creation - Promote open innovation with corporate partners \nWe incubate new businesses, with an approach that merges our Japanese corporate partners' expertise and resources with Silicon Valley's talent pool and culture of open innovation. \n \n3. Education - Cultivate global entrepreneurial mindset \nWe provide education programs in global entrepreneurship for our Japanese corporate partners, tailored to executives and intrepreneurs (internal entrepreneurs). \nIn the near future, we plan to open this program to the larger community. Investment Director DG Incubation, Inc. July 2011  –  January 2014  (2 years 7 months) San Francisco Bay Area - Portfolio companies: Twitter, Path, Udemy, Kamcord, Intercom, etc \n- Stage agnostic investment from seed funding to A/B/C/D round. \n- Finding great startups in Silicon Valley to invest \n- Adding more values to bring them to Japan and make it succeed (go-to-market for Japan) \n- Structure the business at Digital Garage HQ in Tokyo to help startups General Manager/Vice President Digital Garage US, Inc. July 2011  –  January 2014  (2 years 7 months) San Francisco Bay Area Digital Garage US, Inc. operates as a subsidiary of Digital Garage, Inc. and holding company of Neo Innovation, Inc. \n \n- Founding member of DG717 (http://www.dg717.com/), the co-working space ran by Digital Garage US \n- Investment activity on behalf of DG Incubation Japan Specialist Twitter January 2010  –  August 2011  (1 year 8 months) San Francisco Bay Area - Digital Garage invested in Twitter since series B \n- Working for Twitter International team as part of the investment to accelerate Twitter Japan business \n- Project management between Twitter HQ and Digital Garage who runs Twitter Japan in Tokyo \n- Twitter advertisement for Japan \n- Verifying the new product for Japanese users \n- Moderating the cloud-sourced Japanese translation community \n- Localization and product management Product Manager CGM Marketing, Inc. August 2006  –  July 2011  (5 years) Tokyo, Japan (~'08), Bay Area, CA ('08~) Product Management: \n- Strong skill for web product design such as grand design from scratch, creating detail design document for UI and back-end system.  \n- 1st product was the online advertisement platform through water-fall development methodology for social media. 2nd product was Twitter management tool through agile development methodology using Twitter API. \n- Off-shore development experience for 2+ years with China \n \nBusiness Development: \n- Good at proposals and executions to maximize the different product's/company's strength \n \nInternationalization Specialist for Japanese: \n- Experience as Japanese internationalization specialist at the global social media website Project Manager Digital Garage, Inc. May 2003  –  July 2006  (3 years 3 months) Tokyo, Japan Made bunch of websites, mobile sites, ECs, CRMs for clients as the product manager in both front end and back end. Programmer Advanced Information Supply, Inc. March 2000  –  March 2003  (3 years 1 month) Tokyo, Japan Language: JSP, Servlet, Perl, Visual Basic, Cobol, Unix Shell Scripts, C, PHP, Java Script, HTML \nOperating System: UNIX, WindowNT, Linux \nData Base: Oracle, LDAP, MySQL Partner World Innovation Lab (WiL) March 2014  – Present (1 year 6 months) Palo Alto, CA 1. Investment - Foster new global ventures \nWiL invests in startups with global appeal and disruptive potential. \nWe typically invest $5M to $30M in mid-to-late-stage startups in the US. \nAki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \n2. Business creation - Promote open innovation with corporate partners \nWe incubate new businesses, with an approach that merges our Japanese corporate partners' expertise and resources with Silicon Valley's talent pool and culture of open innovation. \n \n3. Education - Cultivate global entrepreneurial mindset \nWe provide education programs in global entrepreneurship for our Japanese corporate partners, tailored to executives and intrepreneurs (internal entrepreneurs). \nIn the near future, we plan to open this program to the larger community. Partner World Innovation Lab (WiL) March 2014  – Present (1 year 6 months) Palo Alto, CA 1. Investment - Foster new global ventures \nWiL invests in startups with global appeal and disruptive potential. \nWe typically invest $5M to $30M in mid-to-late-stage startups in the US. \nAki's particular interest is in marketplace, VR/AR, mobile, smart home, IoT, connected car, wearable. \n \n2. Business creation - Promote open innovation with corporate partners \nWe incubate new businesses, with an approach that merges our Japanese corporate partners' expertise and resources with Silicon Valley's talent pool and culture of open innovation. \n \n3. Education - Cultivate global entrepreneurial mindset \nWe provide education programs in global entrepreneurship for our Japanese corporate partners, tailored to executives and intrepreneurs (internal entrepreneurs). \nIn the near future, we plan to open this program to the larger community. Investment Director DG Incubation, Inc. July 2011  –  January 2014  (2 years 7 months) San Francisco Bay Area - Portfolio companies: Twitter, Path, Udemy, Kamcord, Intercom, etc \n- Stage agnostic investment from seed funding to A/B/C/D round. \n- Finding great startups in Silicon Valley to invest \n- Adding more values to bring them to Japan and make it succeed (go-to-market for Japan) \n- Structure the business at Digital Garage HQ in Tokyo to help startups Investment Director DG Incubation, Inc. July 2011  –  January 2014  (2 years 7 months) San Francisco Bay Area - Portfolio companies: Twitter, Path, Udemy, Kamcord, Intercom, etc \n- Stage agnostic investment from seed funding to A/B/C/D round. \n- Finding great startups in Silicon Valley to invest \n- Adding more values to bring them to Japan and make it succeed (go-to-market for Japan) \n- Structure the business at Digital Garage HQ in Tokyo to help startups General Manager/Vice President Digital Garage US, Inc. July 2011  –  January 2014  (2 years 7 months) San Francisco Bay Area Digital Garage US, Inc. operates as a subsidiary of Digital Garage, Inc. and holding company of Neo Innovation, Inc. \n \n- Founding member of DG717 (http://www.dg717.com/), the co-working space ran by Digital Garage US \n- Investment activity on behalf of DG Incubation General Manager/Vice President Digital Garage US, Inc. July 2011  –  January 2014  (2 years 7 months) San Francisco Bay Area Digital Garage US, Inc. operates as a subsidiary of Digital Garage, Inc. and holding company of Neo Innovation, Inc. \n \n- Founding member of DG717 (http://www.dg717.com/), the co-working space ran by Digital Garage US \n- Investment activity on behalf of DG Incubation Japan Specialist Twitter January 2010  –  August 2011  (1 year 8 months) San Francisco Bay Area - Digital Garage invested in Twitter since series B \n- Working for Twitter International team as part of the investment to accelerate Twitter Japan business \n- Project management between Twitter HQ and Digital Garage who runs Twitter Japan in Tokyo \n- Twitter advertisement for Japan \n- Verifying the new product for Japanese users \n- Moderating the cloud-sourced Japanese translation community \n- Localization and product management Japan Specialist Twitter January 2010  –  August 2011  (1 year 8 months) San Francisco Bay Area - Digital Garage invested in Twitter since series B \n- Working for Twitter International team as part of the investment to accelerate Twitter Japan business \n- Project management between Twitter HQ and Digital Garage who runs Twitter Japan in Tokyo \n- Twitter advertisement for Japan \n- Verifying the new product for Japanese users \n- Moderating the cloud-sourced Japanese translation community \n- Localization and product management Product Manager CGM Marketing, Inc. August 2006  –  July 2011  (5 years) Tokyo, Japan (~'08), Bay Area, CA ('08~) Product Management: \n- Strong skill for web product design such as grand design from scratch, creating detail design document for UI and back-end system.  \n- 1st product was the online advertisement platform through water-fall development methodology for social media. 2nd product was Twitter management tool through agile development methodology using Twitter API. \n- Off-shore development experience for 2+ years with China \n \nBusiness Development: \n- Good at proposals and executions to maximize the different product's/company's strength \n \nInternationalization Specialist for Japanese: \n- Experience as Japanese internationalization specialist at the global social media website Product Manager CGM Marketing, Inc. August 2006  –  July 2011  (5 years) Tokyo, Japan (~'08), Bay Area, CA ('08~) Product Management: \n- Strong skill for web product design such as grand design from scratch, creating detail design document for UI and back-end system.  \n- 1st product was the online advertisement platform through water-fall development methodology for social media. 2nd product was Twitter management tool through agile development methodology using Twitter API. \n- Off-shore development experience for 2+ years with China \n \nBusiness Development: \n- Good at proposals and executions to maximize the different product's/company's strength \n \nInternationalization Specialist for Japanese: \n- Experience as Japanese internationalization specialist at the global social media website Project Manager Digital Garage, Inc. May 2003  –  July 2006  (3 years 3 months) Tokyo, Japan Made bunch of websites, mobile sites, ECs, CRMs for clients as the product manager in both front end and back end. Project Manager Digital Garage, Inc. May 2003  –  July 2006  (3 years 3 months) Tokyo, Japan Made bunch of websites, mobile sites, ECs, CRMs for clients as the product manager in both front end and back end. Programmer Advanced Information Supply, Inc. March 2000  –  March 2003  (3 years 1 month) Tokyo, Japan Language: JSP, Servlet, Perl, Visual Basic, Cobol, Unix Shell Scripts, C, PHP, Java Script, HTML \nOperating System: UNIX, WindowNT, Linux \nData Base: Oracle, LDAP, MySQL Programmer Advanced Information Supply, Inc. March 2000  –  March 2003  (3 years 1 month) Tokyo, Japan Language: JSP, Servlet, Perl, Visual Basic, Cobol, Unix Shell Scripts, C, PHP, Java Script, HTML \nOperating System: UNIX, WindowNT, Linux \nData Base: Oracle, LDAP, MySQL Languages English Japanese English Japanese English Japanese Skills Agile Methodologies Product Management Japanese E-commerce Start-ups Web Development Project Management Online Advertising Business Development Social Media Marketing User Experience Online Marketing Product Development Marketing Entrepreneurship Advertising See 1+     See less Skills  Agile Methodologies Product Management Japanese E-commerce Start-ups Web Development Project Management Online Advertising Business Development Social Media Marketing User Experience Online Marketing Product Development Marketing Entrepreneurship Advertising See 1+     See less Agile Methodologies Product Management Japanese E-commerce Start-ups Web Development Project Management Online Advertising Business Development Social Media Marketing User Experience Online Marketing Product Development Marketing Entrepreneurship Advertising See 1+     See less Agile Methodologies Product Management Japanese E-commerce Start-ups Web Development Project Management Online Advertising Business Development Social Media Marketing User Experience Online Marketing Product Development Marketing Entrepreneurship Advertising See 1+     See less Education Kansai University Bachelor's Degree,  Architecture 1995  – 1999 Kansai University Bachelor's Degree,  Architecture 1995  – 1999 Kansai University Bachelor's Degree,  Architecture 1995  – 1999 Kansai University Bachelor's Degree,  Architecture 1995  – 1999 Honors & Awards Additional Honors & Awards - http://www.sonysonpo.co.jp/ : official site renewal \n- http://from.sonysonpo.co.jp/ : communication site based on movable type \nThe sites above get the first prize in 2007’s Gomez ranking in the insurance category. \n \n- http://www.americanexpress.com/japan/personal_main.shtml : site renewal \nThe site above, Amex Japan site renewal gets the gold prize in 2007 ICSS Marketing Communications Excellence Awards that is the world wide award in American Express. Additional Honors & Awards - http://www.sonysonpo.co.jp/ : official site renewal \n- http://from.sonysonpo.co.jp/ : communication site based on movable type \nThe sites above get the first prize in 2007’s Gomez ranking in the insurance category. \n \n- http://www.americanexpress.com/japan/personal_main.shtml : site renewal \nThe site above, Amex Japan site renewal gets the gold prize in 2007 ICSS Marketing Communications Excellence Awards that is the world wide award in American Express. Additional Honors & Awards - http://www.sonysonpo.co.jp/ : official site renewal \n- http://from.sonysonpo.co.jp/ : communication site based on movable type \nThe sites above get the first prize in 2007’s Gomez ranking in the insurance category. \n \n- http://www.americanexpress.com/japan/personal_main.shtml : site renewal \nThe site above, Amex Japan site renewal gets the gold prize in 2007 ICSS Marketing Communications Excellence Awards that is the world wide award in American Express. Additional Honors & Awards - http://www.sonysonpo.co.jp/ : official site renewal \n- http://from.sonysonpo.co.jp/ : communication site based on movable type \nThe sites above get the first prize in 2007’s Gomez ranking in the insurance category. \n \n- http://www.americanexpress.com/japan/personal_main.shtml : site renewal \nThe site above, Amex Japan site renewal gets the gold prize in 2007 ICSS Marketing Communications Excellence Awards that is the world wide award in American Express. ", "Summary With over twenty years experience as a professional Japanese interpreter, my past eight years in Japan have finely honed my skills. For communication with your Japanese counterparts so direct - as if the interpreter were not even there - you need someone with skills like mine. \n \nSpecialties: Business negotiations, sales meetings, technical discussions - all go so much more smoothly, with everyone getting much more from them, when an interpreter like me is present. Also experienced in depositions and legal proceedings of all kinds. Summary With over twenty years experience as a professional Japanese interpreter, my past eight years in Japan have finely honed my skills. For communication with your Japanese counterparts so direct - as if the interpreter were not even there - you need someone with skills like mine. \n \nSpecialties: Business negotiations, sales meetings, technical discussions - all go so much more smoothly, with everyone getting much more from them, when an interpreter like me is present. Also experienced in depositions and legal proceedings of all kinds. With over twenty years experience as a professional Japanese interpreter, my past eight years in Japan have finely honed my skills. For communication with your Japanese counterparts so direct - as if the interpreter were not even there - you need someone with skills like mine. \n \nSpecialties: Business negotiations, sales meetings, technical discussions - all go so much more smoothly, with everyone getting much more from them, when an interpreter like me is present. Also experienced in depositions and legal proceedings of all kinds. With over twenty years experience as a professional Japanese interpreter, my past eight years in Japan have finely honed my skills. For communication with your Japanese counterparts so direct - as if the interpreter were not even there - you need someone with skills like mine. \n \nSpecialties: Business negotiations, sales meetings, technical discussions - all go so much more smoothly, with everyone getting much more from them, when an interpreter like me is present. Also experienced in depositions and legal proceedings of all kinds. Experience Chairperson, 2014 Annual Conference, 2015 Annual Conference New England Translators Association May 2010  – Present (5 years 4 months) New England Led the Conference Committee team to successfully produce a full day of professional development sessions which were incredibly useful to over 200 participants. Enrolled exhibitors and sponsors from regional language services companies and educational institutions. Chairperson, 2014 Annual Conference, 2015 Annual Conference New England Translators Association 2010  – Present (5 years) Japanese Technical Interpreter/Translator Baron Charms International Services 1990  – Present (25 years) Japanese Interpretation and Translation. Legal, deposition, medical, electronics, engineering, automotive Translator / Internationalization Specialist Yamagata Prefectural Museum September 2011  –  April 2012  (8 months) Making museums in Yamagata, northeastern Japan, accessible to people who don't read Japanese. Translator, Internationalization Specialist Yamagata Municipal Culture Promotion Foundation April 2009  –  March 2010  (1 year) Making two municipal museums in Yamagata accessible to non-Japanese readers. A wonderful job, with lasting value! I enjoyed the study and research involved enormously. Chairperson, 2014 Annual Conference, 2015 Annual Conference New England Translators Association May 2010  – Present (5 years 4 months) New England Led the Conference Committee team to successfully produce a full day of professional development sessions which were incredibly useful to over 200 participants. Enrolled exhibitors and sponsors from regional language services companies and educational institutions. Chairperson, 2014 Annual Conference, 2015 Annual Conference New England Translators Association May 2010  – Present (5 years 4 months) New England Led the Conference Committee team to successfully produce a full day of professional development sessions which were incredibly useful to over 200 participants. Enrolled exhibitors and sponsors from regional language services companies and educational institutions. Chairperson, 2014 Annual Conference, 2015 Annual Conference New England Translators Association 2010  – Present (5 years) Chairperson, 2014 Annual Conference, 2015 Annual Conference New England Translators Association 2010  – Present (5 years) Japanese Technical Interpreter/Translator Baron Charms International Services 1990  – Present (25 years) Japanese Interpretation and Translation. Legal, deposition, medical, electronics, engineering, automotive Japanese Technical Interpreter/Translator Baron Charms International Services 1990  – Present (25 years) Japanese Interpretation and Translation. Legal, deposition, medical, electronics, engineering, automotive Translator / Internationalization Specialist Yamagata Prefectural Museum September 2011  –  April 2012  (8 months) Making museums in Yamagata, northeastern Japan, accessible to people who don't read Japanese. Translator / Internationalization Specialist Yamagata Prefectural Museum September 2011  –  April 2012  (8 months) Making museums in Yamagata, northeastern Japan, accessible to people who don't read Japanese. Translator, Internationalization Specialist Yamagata Municipal Culture Promotion Foundation April 2009  –  March 2010  (1 year) Making two municipal museums in Yamagata accessible to non-Japanese readers. A wonderful job, with lasting value! I enjoyed the study and research involved enormously. Translator, Internationalization Specialist Yamagata Municipal Culture Promotion Foundation April 2009  –  March 2010  (1 year) Making two municipal museums in Yamagata accessible to non-Japanese readers. A wonderful job, with lasting value! I enjoyed the study and research involved enormously. Languages Japanese Japanese Japanese Skills Translation Localization Technical Translation Proofreading Foreign Languages Trados Internationalization Language Services Multilingual Interpreting Legal Translation English Medical Translation Japanese Editing Wordfast Japanese culture Machine Translation Globalization International Relations Simultaneous... Intercultural... Terminology Consecutive... See 9+     See less Skills  Translation Localization Technical Translation Proofreading Foreign Languages Trados Internationalization Language Services Multilingual Interpreting Legal Translation English Medical Translation Japanese Editing Wordfast Japanese culture Machine Translation Globalization International Relations Simultaneous... Intercultural... Terminology Consecutive... See 9+     See less Translation Localization Technical Translation Proofreading Foreign Languages Trados Internationalization Language Services Multilingual Interpreting Legal Translation English Medical Translation Japanese Editing Wordfast Japanese culture Machine Translation Globalization International Relations Simultaneous... Intercultural... Terminology Consecutive... See 9+     See less Translation Localization Technical Translation Proofreading Foreign Languages Trados Internationalization Language Services Multilingual Interpreting Legal Translation English Medical Translation Japanese Editing Wordfast Japanese culture Machine Translation Globalization International Relations Simultaneous... Intercultural... Terminology Consecutive... See 9+     See less Education University of Washington Japanese Art History 1973  – 1974 Washington University in St. Louis BA,  Japanese and Chinese 1969  – 1973 早稲田大学 / Waseda University BA,  Japanese Language and Culture 1970  – 1971 I learned a little about so many different Japanese traditional arts - from the way of tea to sumo, calligraphy, theater, even folksongs from a great ethnomusicologist who was at Waseda then. It was a wonderful time, and I hitchhiked all over the country too, leaving Tokyo more weekends than not. Pattonville High School 1966  – 1969 University of Washington Japanese Art History 1973  – 1974 University of Washington Japanese Art History 1973  – 1974 University of Washington Japanese Art History 1973  – 1974 Washington University in St. Louis BA,  Japanese and Chinese 1969  – 1973 Washington University in St. Louis BA,  Japanese and Chinese 1969  – 1973 Washington University in St. Louis BA,  Japanese and Chinese 1969  – 1973 早稲田大学 / Waseda University BA,  Japanese Language and Culture 1970  – 1971 I learned a little about so many different Japanese traditional arts - from the way of tea to sumo, calligraphy, theater, even folksongs from a great ethnomusicologist who was at Waseda then. It was a wonderful time, and I hitchhiked all over the country too, leaving Tokyo more weekends than not. 早稲田大学 / Waseda University BA,  Japanese Language and Culture 1970  – 1971 I learned a little about so many different Japanese traditional arts - from the way of tea to sumo, calligraphy, theater, even folksongs from a great ethnomusicologist who was at Waseda then. It was a wonderful time, and I hitchhiked all over the country too, leaving Tokyo more weekends than not. 早稲田大学 / Waseda University BA,  Japanese Language and Culture 1970  – 1971 I learned a little about so many different Japanese traditional arts - from the way of tea to sumo, calligraphy, theater, even folksongs from a great ethnomusicologist who was at Waseda then. It was a wonderful time, and I hitchhiked all over the country too, leaving Tokyo more weekends than not. Pattonville High School 1966  – 1969 Pattonville High School 1966  – 1969 Pattonville High School 1966  – 1969 ", "Summary Sur le plan personnel je suis une personne active, passionné de sport en plein air. Je suis curieux et j’aime découvrir et comprendre des nouvelles cultures. \n \nSur le plan professionnel, je me caractérise par ma capacité d’écoute et de traitement des problèmes complexe. Dans mes relations avec les partenaires commerciaux, je recherche avant tout la création de liens durables et de confiance. J’apprécie le travail en équipe dynamique et les relations professionnelles franches et directes. \n \nJe possède un outre une bonne faculté didactique que je souhaite développer dans le futur, probablement en enseignant l’internationalisation en Université. Summary Sur le plan personnel je suis une personne active, passionné de sport en plein air. Je suis curieux et j’aime découvrir et comprendre des nouvelles cultures. \n \nSur le plan professionnel, je me caractérise par ma capacité d’écoute et de traitement des problèmes complexe. Dans mes relations avec les partenaires commerciaux, je recherche avant tout la création de liens durables et de confiance. J’apprécie le travail en équipe dynamique et les relations professionnelles franches et directes. \n \nJe possède un outre une bonne faculté didactique que je souhaite développer dans le futur, probablement en enseignant l’internationalisation en Université. Sur le plan personnel je suis une personne active, passionné de sport en plein air. Je suis curieux et j’aime découvrir et comprendre des nouvelles cultures. \n \nSur le plan professionnel, je me caractérise par ma capacité d’écoute et de traitement des problèmes complexe. Dans mes relations avec les partenaires commerciaux, je recherche avant tout la création de liens durables et de confiance. J’apprécie le travail en équipe dynamique et les relations professionnelles franches et directes. \n \nJe possède un outre une bonne faculté didactique que je souhaite développer dans le futur, probablement en enseignant l’internationalisation en Université. Sur le plan personnel je suis une personne active, passionné de sport en plein air. Je suis curieux et j’aime découvrir et comprendre des nouvelles cultures. \n \nSur le plan professionnel, je me caractérise par ma capacité d’écoute et de traitement des problèmes complexe. Dans mes relations avec les partenaires commerciaux, je recherche avant tout la création de liens durables et de confiance. J’apprécie le travail en équipe dynamique et les relations professionnelles franches et directes. \n \nJe possède un outre une bonne faculté didactique que je souhaite développer dans le futur, probablement en enseignant l’internationalisation en Université. Experience Spécialiste en Internationalisation Andes Partners June 2012  – Present (3 years 3 months) Rome Area, Italy Activité autonome de conseil et d’accompagnement à l’international.  \nRéalisation de missions de courte et moyenne durée auprès de : \n-\tEntreprises, groupements d’entreprise et institutions Italiennes pour la formation et l’accompagnement à l’international, recherche de partenaire commerciaux et représentation lors de salons. \n-\tEntreprises et groupement d’entreprises d’Amérique Latine pour la recherche de partenaires commerciaux, représentation sur salons et intelligence économique en France et en Italie. International Business Developer Tregoo May 2014  –  March 2015  (11 months) Florence Area, Italy Lancement commercial international de la nouvelle marque Tregoo et des autres marques du groupe En-Eco SpA à l'international. \nPrincipaux marchés: Afrique, Amérique Latine, Europe \nRéseaux de distribution: \n- Grande distribution de produits électroniques \n- Fourniture industriel et de sécurité (industrie minière, forestière, maritime, BTP) \n- Sauvetage, secourisme et développement rural (organismes gouvernementaux, ONG et distributeurs du secteur privé). Export Manager Nic Impex November 2008  –  April 2012  (3 years 6 months) Rhone-Alpes, France Développement des ventes export de la société. Gestion de 35 distributeurs internationaux, 6 agents commerciaux en Italie, et une filiale aux États Unis. Sales Manager Top Impex April 2007  –  October 2008  (1 year 7 months) Chile Responsable commercial des marques hiver sur le marché Chilien. Product Manager adidas May 2005  –  April 2007  (2 years) Chile Responsable commercial des produits Hardgoods de la marque Salomon sur le marché Chilien. Marketing Assistant Salomon September 2003  –  August 2004  (1 year) France Stage. Assistant service Communication Internationale. Spécialiste en Internationalisation Andes Partners June 2012  – Present (3 years 3 months) Rome Area, Italy Activité autonome de conseil et d’accompagnement à l’international.  \nRéalisation de missions de courte et moyenne durée auprès de : \n-\tEntreprises, groupements d’entreprise et institutions Italiennes pour la formation et l’accompagnement à l’international, recherche de partenaire commerciaux et représentation lors de salons. \n-\tEntreprises et groupement d’entreprises d’Amérique Latine pour la recherche de partenaires commerciaux, représentation sur salons et intelligence économique en France et en Italie. Spécialiste en Internationalisation Andes Partners June 2012  – Present (3 years 3 months) Rome Area, Italy Activité autonome de conseil et d’accompagnement à l’international.  \nRéalisation de missions de courte et moyenne durée auprès de : \n-\tEntreprises, groupements d’entreprise et institutions Italiennes pour la formation et l’accompagnement à l’international, recherche de partenaire commerciaux et représentation lors de salons. \n-\tEntreprises et groupement d’entreprises d’Amérique Latine pour la recherche de partenaires commerciaux, représentation sur salons et intelligence économique en France et en Italie. International Business Developer Tregoo May 2014  –  March 2015  (11 months) Florence Area, Italy Lancement commercial international de la nouvelle marque Tregoo et des autres marques du groupe En-Eco SpA à l'international. \nPrincipaux marchés: Afrique, Amérique Latine, Europe \nRéseaux de distribution: \n- Grande distribution de produits électroniques \n- Fourniture industriel et de sécurité (industrie minière, forestière, maritime, BTP) \n- Sauvetage, secourisme et développement rural (organismes gouvernementaux, ONG et distributeurs du secteur privé). International Business Developer Tregoo May 2014  –  March 2015  (11 months) Florence Area, Italy Lancement commercial international de la nouvelle marque Tregoo et des autres marques du groupe En-Eco SpA à l'international. \nPrincipaux marchés: Afrique, Amérique Latine, Europe \nRéseaux de distribution: \n- Grande distribution de produits électroniques \n- Fourniture industriel et de sécurité (industrie minière, forestière, maritime, BTP) \n- Sauvetage, secourisme et développement rural (organismes gouvernementaux, ONG et distributeurs du secteur privé). Export Manager Nic Impex November 2008  –  April 2012  (3 years 6 months) Rhone-Alpes, France Développement des ventes export de la société. Gestion de 35 distributeurs internationaux, 6 agents commerciaux en Italie, et une filiale aux États Unis. Export Manager Nic Impex November 2008  –  April 2012  (3 years 6 months) Rhone-Alpes, France Développement des ventes export de la société. Gestion de 35 distributeurs internationaux, 6 agents commerciaux en Italie, et une filiale aux États Unis. Sales Manager Top Impex April 2007  –  October 2008  (1 year 7 months) Chile Responsable commercial des marques hiver sur le marché Chilien. Sales Manager Top Impex April 2007  –  October 2008  (1 year 7 months) Chile Responsable commercial des marques hiver sur le marché Chilien. Product Manager adidas May 2005  –  April 2007  (2 years) Chile Responsable commercial des produits Hardgoods de la marque Salomon sur le marché Chilien. Product Manager adidas May 2005  –  April 2007  (2 years) Chile Responsable commercial des produits Hardgoods de la marque Salomon sur le marché Chilien. Marketing Assistant Salomon September 2003  –  August 2004  (1 year) France Stage. Assistant service Communication Internationale. Marketing Assistant Salomon September 2003  –  August 2004  (1 year) France Stage. Assistant service Communication Internationale. Languages Français Native or bilingual proficiency Anglais Full professional proficiency Espagnol Native or bilingual proficiency Italien Full professional proficiency Français Native or bilingual proficiency Anglais Full professional proficiency Espagnol Native or bilingual proficiency Italien Full professional proficiency Français Native or bilingual proficiency Anglais Full professional proficiency Espagnol Native or bilingual proficiency Italien Full professional proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills International Sales International Marketing Product Development Tender Management Solar Energy International Relations International Business South America Sporting Goods Sports Industry Sporting Goods Industry Commercial Product... International Trade Food Industry Agricultural Machinery Food & Beverage Industrial Safety Search & Rescue Web Marketing International... Solar Power Management See 7+     See less Skills  International Sales International Marketing Product Development Tender Management Solar Energy International Relations International Business South America Sporting Goods Sports Industry Sporting Goods Industry Commercial Product... International Trade Food Industry Agricultural Machinery Food & Beverage Industrial Safety Search & Rescue Web Marketing International... Solar Power Management See 7+     See less International Sales International Marketing Product Development Tender Management Solar Energy International Relations International Business South America Sporting Goods Sports Industry Sporting Goods Industry Commercial Product... International Trade Food Industry Agricultural Machinery Food & Beverage Industrial Safety Search & Rescue Web Marketing International... Solar Power Management See 7+     See less International Sales International Marketing Product Development Tender Management Solar Energy International Relations International Business South America Sporting Goods Sports Industry Sporting Goods Industry Commercial Product... International Trade Food Industry Agricultural Machinery Food & Beverage Industrial Safety Search & Rescue Web Marketing International... Solar Power Management See 7+     See less Education Groupe Ecole supérieure de Commerce de Dijon-Bourgogne Master's degree,  Commerce international / commerce 2001  – 2005 Activities and Societies:  BDE Esc'aliente! Universidad Autonoma de Mexico Master's degree,  Management 2004  – 2005 Université Joseph Fourier (Grenoble I) DUT Génie Mécanique,  Ingénierie physique 1999  – 2001 lycée les lazaristes Baccalauréat,  S option TI , Mention AB 1996  – 1999 Groupe Ecole supérieure de Commerce de Dijon-Bourgogne Master's degree,  Commerce international / commerce 2001  – 2005 Activities and Societies:  BDE Esc'aliente! Groupe Ecole supérieure de Commerce de Dijon-Bourgogne Master's degree,  Commerce international / commerce 2001  – 2005 Activities and Societies:  BDE Esc'aliente! Groupe Ecole supérieure de Commerce de Dijon-Bourgogne Master's degree,  Commerce international / commerce 2001  – 2005 Activities and Societies:  BDE Esc'aliente! Universidad Autonoma de Mexico Master's degree,  Management 2004  – 2005 Universidad Autonoma de Mexico Master's degree,  Management 2004  – 2005 Universidad Autonoma de Mexico Master's degree,  Management 2004  – 2005 Université Joseph Fourier (Grenoble I) DUT Génie Mécanique,  Ingénierie physique 1999  – 2001 Université Joseph Fourier (Grenoble I) DUT Génie Mécanique,  Ingénierie physique 1999  – 2001 Université Joseph Fourier (Grenoble I) DUT Génie Mécanique,  Ingénierie physique 1999  – 2001 lycée les lazaristes Baccalauréat,  S option TI , Mention AB 1996  – 1999 lycée les lazaristes Baccalauréat,  S option TI , Mention AB 1996  – 1999 lycée les lazaristes Baccalauréat,  S option TI , Mention AB 1996  – 1999 ", "Summary gfma.emba2014@alumni.ie.edu \n+34 616 50 88 90 \n \nDiferentes puestos profesionales relacionados con la Dirección, el Desarrollo de Negocio, Relaciones Institucionales y Consultoría Estratégica e internacionalización de empresas \n \nFormación en Derecho y Dirección empresarial (EMBA en el IE) combinada con altos conocimientos en el mundo internacional (Oposiciones a la Carrera Diplomática y Máster en Relaciones Internacionales y Diplomacia). Alta experiencia en B2B. Especializado en Centroamérica donde ha internacionalizado varias empresas con éxito. \n \nFacilidad retórica y capacidad escrita. Alta habilidad para la síntesis y análisis tanto en español como en inglés y francés. Perfil directivo y dinamizador con clara inclinación al emprendimiento. \n \nProfesor en materia de emprendimiento e internacionalización de empresas en el master mba de la universidad Camilo José Cela de Madrid. \n \nInglés y Francés alto: Nivel de negociación. Disponibilidad internacional. Summary gfma.emba2014@alumni.ie.edu \n+34 616 50 88 90 \n \nDiferentes puestos profesionales relacionados con la Dirección, el Desarrollo de Negocio, Relaciones Institucionales y Consultoría Estratégica e internacionalización de empresas \n \nFormación en Derecho y Dirección empresarial (EMBA en el IE) combinada con altos conocimientos en el mundo internacional (Oposiciones a la Carrera Diplomática y Máster en Relaciones Internacionales y Diplomacia). Alta experiencia en B2B. Especializado en Centroamérica donde ha internacionalizado varias empresas con éxito. \n \nFacilidad retórica y capacidad escrita. Alta habilidad para la síntesis y análisis tanto en español como en inglés y francés. Perfil directivo y dinamizador con clara inclinación al emprendimiento. \n \nProfesor en materia de emprendimiento e internacionalización de empresas en el master mba de la universidad Camilo José Cela de Madrid. \n \nInglés y Francés alto: Nivel de negociación. Disponibilidad internacional. gfma.emba2014@alumni.ie.edu \n+34 616 50 88 90 \n \nDiferentes puestos profesionales relacionados con la Dirección, el Desarrollo de Negocio, Relaciones Institucionales y Consultoría Estratégica e internacionalización de empresas \n \nFormación en Derecho y Dirección empresarial (EMBA en el IE) combinada con altos conocimientos en el mundo internacional (Oposiciones a la Carrera Diplomática y Máster en Relaciones Internacionales y Diplomacia). Alta experiencia en B2B. Especializado en Centroamérica donde ha internacionalizado varias empresas con éxito. \n \nFacilidad retórica y capacidad escrita. Alta habilidad para la síntesis y análisis tanto en español como en inglés y francés. Perfil directivo y dinamizador con clara inclinación al emprendimiento. \n \nProfesor en materia de emprendimiento e internacionalización de empresas en el master mba de la universidad Camilo José Cela de Madrid. \n \nInglés y Francés alto: Nivel de negociación. Disponibilidad internacional. gfma.emba2014@alumni.ie.edu \n+34 616 50 88 90 \n \nDiferentes puestos profesionales relacionados con la Dirección, el Desarrollo de Negocio, Relaciones Institucionales y Consultoría Estratégica e internacionalización de empresas \n \nFormación en Derecho y Dirección empresarial (EMBA en el IE) combinada con altos conocimientos en el mundo internacional (Oposiciones a la Carrera Diplomática y Máster en Relaciones Internacionales y Diplomacia). Alta experiencia en B2B. Especializado en Centroamérica donde ha internacionalizado varias empresas con éxito. \n \nFacilidad retórica y capacidad escrita. Alta habilidad para la síntesis y análisis tanto en español como en inglés y francés. Perfil directivo y dinamizador con clara inclinación al emprendimiento. \n \nProfesor en materia de emprendimiento e internacionalización de empresas en el master mba de la universidad Camilo José Cela de Madrid. \n \nInglés y Francés alto: Nivel de negociación. Disponibilidad internacional. Experience Consultoría Estratégica Innet-gbs September 2011  – Present (4 years) España-Panamá Consultoría estratégica e internacionalización de empresas: \n• España-Panamá \n• Especialidad en Licitaciones Públicas y relaciones con la Administración \n \nPosiciones: \n• Consultoría estratégica \n• Desarrollo de Negocio \n• Relaciones Institucionales Director Gerente GEED Arquitectos January 2010  – Present (5 years 8 months) España y Centroamérica Procesos concluidos con éxito: \n• Reestructuración \n• Refinanciación \n• Internacionalización. 3 adjudicaciones públicas de las primeras 4 presentadas en Panamá \n• Especialidad en Licitaciones Públicas y relaciones con la Administración \n \nPosiciones: \n• Dirección \n• Desarrollo de Negocio \n• Relaciones Institucionales Director Gerente. Empresa Pública Ayuntamiento de Madrid January 2009  –  December 2009  (1 year) Madrid Area, Spain Adjunto a la Dirección del Master in International Management Escuela Diplomática (Ministerio de Exteriores) October 2008  –  January 2009  (4 months) Madrid Area, Spain Presidente de asociación de networking sectorial NEXEN Management Asociation September 1994  –  December 2008  (14 years 4 months) Madrid Area, Spain Consultoría Estratégica Innet-gbs September 2011  – Present (4 years) España-Panamá Consultoría estratégica e internacionalización de empresas: \n• España-Panamá \n• Especialidad en Licitaciones Públicas y relaciones con la Administración \n \nPosiciones: \n• Consultoría estratégica \n• Desarrollo de Negocio \n• Relaciones Institucionales Consultoría Estratégica Innet-gbs September 2011  – Present (4 years) España-Panamá Consultoría estratégica e internacionalización de empresas: \n• España-Panamá \n• Especialidad en Licitaciones Públicas y relaciones con la Administración \n \nPosiciones: \n• Consultoría estratégica \n• Desarrollo de Negocio \n• Relaciones Institucionales Director Gerente GEED Arquitectos January 2010  – Present (5 years 8 months) España y Centroamérica Procesos concluidos con éxito: \n• Reestructuración \n• Refinanciación \n• Internacionalización. 3 adjudicaciones públicas de las primeras 4 presentadas en Panamá \n• Especialidad en Licitaciones Públicas y relaciones con la Administración \n \nPosiciones: \n• Dirección \n• Desarrollo de Negocio \n• Relaciones Institucionales Director Gerente GEED Arquitectos January 2010  – Present (5 years 8 months) España y Centroamérica Procesos concluidos con éxito: \n• Reestructuración \n• Refinanciación \n• Internacionalización. 3 adjudicaciones públicas de las primeras 4 presentadas en Panamá \n• Especialidad en Licitaciones Públicas y relaciones con la Administración \n \nPosiciones: \n• Dirección \n• Desarrollo de Negocio \n• Relaciones Institucionales Director Gerente. Empresa Pública Ayuntamiento de Madrid January 2009  –  December 2009  (1 year) Madrid Area, Spain Director Gerente. Empresa Pública Ayuntamiento de Madrid January 2009  –  December 2009  (1 year) Madrid Area, Spain Adjunto a la Dirección del Master in International Management Escuela Diplomática (Ministerio de Exteriores) October 2008  –  January 2009  (4 months) Madrid Area, Spain Adjunto a la Dirección del Master in International Management Escuela Diplomática (Ministerio de Exteriores) October 2008  –  January 2009  (4 months) Madrid Area, Spain Presidente de asociación de networking sectorial NEXEN Management Asociation September 1994  –  December 2008  (14 years 4 months) Madrid Area, Spain Presidente de asociación de networking sectorial NEXEN Management Asociation September 1994  –  December 2008  (14 years 4 months) Madrid Area, Spain Languages Inglés Full professional proficiency Francés Full professional proficiency Español Native or bilingual proficiency Inglés Full professional proficiency Francés Full professional proficiency Español Native or bilingual proficiency Inglés Full professional proficiency Francés Full professional proficiency Español Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills Skills     Education Instituto de Empresa Master of Business Administration (MBA), Executive,  Finalizado en febrero 2014 2012  – 2014 Harvard University, John F. Kennedy School of Government Programa en comunicación y liderazgo,  Political management program 2011  – 2011 • Impartido por la Universidad de Harvard Kennedy School of Government e IESE Business School Escuela Diplomática de España Master in International Management 2007  – 2008 • Especialidad en Unión Europea. \n• Memoria Final \"Energía y Política Exterior\". \n• Calificación final del máster: A Instituto de Practica Empresarial Programa de Internacionalización de Empresas,  International Management , A 2010  – 2010 Ministerio de Asuntos Exteriores y Cooperación de España Administración General del Estado (Oposiciones tipo A) 2002  – 2008 Universidad Complutense de Madrid Licenciatura en Derecho 1995  – 2001 • Fundador de la Delegación de Alumnos \n• Delegado de Clase, Curso, Carrera y Universidad (UFVi) \n• Representante de Universidad para UCM (2001-2002) Fomento COU Bachelor's degree,  Universidad Villanueva 1994  – 1995 Colegio Aldovea 1980  – 1994 Instituto de Empresa Master of Business Administration (MBA), Executive,  Finalizado en febrero 2014 2012  – 2014 Instituto de Empresa Master of Business Administration (MBA), Executive,  Finalizado en febrero 2014 2012  – 2014 Instituto de Empresa Master of Business Administration (MBA), Executive,  Finalizado en febrero 2014 2012  – 2014 Harvard University, John F. Kennedy School of Government Programa en comunicación y liderazgo,  Political management program 2011  – 2011 • Impartido por la Universidad de Harvard Kennedy School of Government e IESE Business School Harvard University, John F. Kennedy School of Government Programa en comunicación y liderazgo,  Political management program 2011  – 2011 • Impartido por la Universidad de Harvard Kennedy School of Government e IESE Business School Harvard University, John F. Kennedy School of Government Programa en comunicación y liderazgo,  Political management program 2011  – 2011 • Impartido por la Universidad de Harvard Kennedy School of Government e IESE Business School Escuela Diplomática de España Master in International Management 2007  – 2008 • Especialidad en Unión Europea. \n• Memoria Final \"Energía y Política Exterior\". \n• Calificación final del máster: A Escuela Diplomática de España Master in International Management 2007  – 2008 • Especialidad en Unión Europea. \n• Memoria Final \"Energía y Política Exterior\". \n• Calificación final del máster: A Escuela Diplomática de España Master in International Management 2007  – 2008 • Especialidad en Unión Europea. \n• Memoria Final \"Energía y Política Exterior\". \n• Calificación final del máster: A Instituto de Practica Empresarial Programa de Internacionalización de Empresas,  International Management , A 2010  – 2010 Instituto de Practica Empresarial Programa de Internacionalización de Empresas,  International Management , A 2010  – 2010 Instituto de Practica Empresarial Programa de Internacionalización de Empresas,  International Management , A 2010  – 2010 Ministerio de Asuntos Exteriores y Cooperación de España Administración General del Estado (Oposiciones tipo A) 2002  – 2008 Ministerio de Asuntos Exteriores y Cooperación de España Administración General del Estado (Oposiciones tipo A) 2002  – 2008 Ministerio de Asuntos Exteriores y Cooperación de España Administración General del Estado (Oposiciones tipo A) 2002  – 2008 Universidad Complutense de Madrid Licenciatura en Derecho 1995  – 2001 • Fundador de la Delegación de Alumnos \n• Delegado de Clase, Curso, Carrera y Universidad (UFVi) \n• Representante de Universidad para UCM (2001-2002) Universidad Complutense de Madrid Licenciatura en Derecho 1995  – 2001 • Fundador de la Delegación de Alumnos \n• Delegado de Clase, Curso, Carrera y Universidad (UFVi) \n• Representante de Universidad para UCM (2001-2002) Universidad Complutense de Madrid Licenciatura en Derecho 1995  – 2001 • Fundador de la Delegación de Alumnos \n• Delegado de Clase, Curso, Carrera y Universidad (UFVi) \n• Representante de Universidad para UCM (2001-2002) Fomento COU Bachelor's degree,  Universidad Villanueva 1994  – 1995 Fomento COU Bachelor's degree,  Universidad Villanueva 1994  – 1995 Fomento COU Bachelor's degree,  Universidad Villanueva 1994  – 1995 Colegio Aldovea 1980  – 1994 Colegio Aldovea 1980  – 1994 Colegio Aldovea 1980  – 1994 Honors & Awards ", "Skills E-commerce Customer Experience Web Applications Analytics Software Development Product Management Management Mobile Applications Social Media CRM Leadership SOA Customer Service SaaS Scalability Cross-functional Team... Retail See 2+     See less Skills  E-commerce Customer Experience Web Applications Analytics Software Development Product Management Management Mobile Applications Social Media CRM Leadership SOA Customer Service SaaS Scalability Cross-functional Team... Retail See 2+     See less E-commerce Customer Experience Web Applications Analytics Software Development Product Management Management Mobile Applications Social Media CRM Leadership SOA Customer Service SaaS Scalability Cross-functional Team... Retail See 2+     See less E-commerce Customer Experience Web Applications Analytics Software Development Product Management Management Mobile Applications Social Media CRM Leadership SOA Customer Service SaaS Scalability Cross-functional Team... Retail See 2+     See less ", "Summary A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. Summary A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. Experience Senior Localization Strategist ENLASO February 2012  – Present (3 years 7 months) Colorado Springs, Colorado A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. Independent Consultant ENLASO January 2006  –  February 2012  (6 years 2 months) Describe your position Project Manager Level 3 Communications July 2000  –  December 2001  (1 year 6 months) Senior Project Manager ILE Corporation 1996  –  2000  (4 years) Santa Clara, CA Provide on‑site Localization Project Management for numerous clients, assist in the development of their localization and internationalization strategies. Senior Localization Strategist ENLASO February 2012  – Present (3 years 7 months) Colorado Springs, Colorado A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. Senior Localization Strategist ENLASO February 2012  – Present (3 years 7 months) Colorado Springs, Colorado A localization and internationalization specialist, providing solution development, strategic account management, business analysis, project management, quality control (ISO standards), terminology management, multilingual consulting, RFI/RFP response and strategy. Independent Consultant ENLASO January 2006  –  February 2012  (6 years 2 months) Describe your position Independent Consultant ENLASO January 2006  –  February 2012  (6 years 2 months) Describe your position Project Manager Level 3 Communications July 2000  –  December 2001  (1 year 6 months) Project Manager Level 3 Communications July 2000  –  December 2001  (1 year 6 months) Senior Project Manager ILE Corporation 1996  –  2000  (4 years) Santa Clara, CA Provide on‑site Localization Project Management for numerous clients, assist in the development of their localization and internationalization strategies. Senior Project Manager ILE Corporation 1996  –  2000  (4 years) Santa Clara, CA Provide on‑site Localization Project Management for numerous clients, assist in the development of their localization and internationalization strategies. Languages German German German Skills Localization Internationalization Translation Multilingual Globalization Language Services Terminology Technical Translation Website Localization Account Management Strategic Planning Strategy Linguistics Trados International Relations International Sales International Business Quality Assurance Medical Devices Medical Terminology Adobe eLearning Suite New Business Development German Literature See 8+     See less Skills  Localization Internationalization Translation Multilingual Globalization Language Services Terminology Technical Translation Website Localization Account Management Strategic Planning Strategy Linguistics Trados International Relations International Sales International Business Quality Assurance Medical Devices Medical Terminology Adobe eLearning Suite New Business Development German Literature See 8+     See less Localization Internationalization Translation Multilingual Globalization Language Services Terminology Technical Translation Website Localization Account Management Strategic Planning Strategy Linguistics Trados International Relations International Sales International Business Quality Assurance Medical Devices Medical Terminology Adobe eLearning Suite New Business Development German Literature See 8+     See less Localization Internationalization Translation Multilingual Globalization Language Services Terminology Technical Translation Website Localization Account Management Strategic Planning Strategy Linguistics Trados International Relations International Sales International Business Quality Assurance Medical Devices Medical Terminology Adobe eLearning Suite New Business Development German Literature See 8+     See less Education Monterey Institute of International Studies Master of Arts (M.A.),  International Policy Studies 1993  – 1995 US Foreign Policy, Defense Policy, International Environmental Policy, German University of Wisconsin-Madison Bachelor of Arts (B.A.),  German Language and Literature 1988  – 1992 German, German Lit, Medieval Studies, Economics, History Monterey Institute of International Studies Master of Arts (M.A.),  International Policy Studies 1993  – 1995 US Foreign Policy, Defense Policy, International Environmental Policy, German Monterey Institute of International Studies Master of Arts (M.A.),  International Policy Studies 1993  – 1995 US Foreign Policy, Defense Policy, International Environmental Policy, German Monterey Institute of International Studies Master of Arts (M.A.),  International Policy Studies 1993  – 1995 US Foreign Policy, Defense Policy, International Environmental Policy, German University of Wisconsin-Madison Bachelor of Arts (B.A.),  German Language and Literature 1988  – 1992 German, German Lit, Medieval Studies, Economics, History University of Wisconsin-Madison Bachelor of Arts (B.A.),  German Language and Literature 1988  – 1992 German, German Lit, Medieval Studies, Economics, History University of Wisconsin-Madison Bachelor of Arts (B.A.),  German Language and Literature 1988  – 1992 German, German Lit, Medieval Studies, Economics, History ", "Skills Software Development XML SQL .NET C++ Agile Methodologies MySQL HTML Web Services C Linux Databases Unix Requirements Analysis Business Requirements GIS ArcGIS Project Management Internationalization Localization See 5+     See less Skills  Software Development XML SQL .NET C++ Agile Methodologies MySQL HTML Web Services C Linux Databases Unix Requirements Analysis Business Requirements GIS ArcGIS Project Management Internationalization Localization See 5+     See less Software Development XML SQL .NET C++ Agile Methodologies MySQL HTML Web Services C Linux Databases Unix Requirements Analysis Business Requirements GIS ArcGIS Project Management Internationalization Localization See 5+     See less Software Development XML SQL .NET C++ Agile Methodologies MySQL HTML Web Services C Linux Databases Unix Requirements Analysis Business Requirements GIS ArcGIS Project Management Internationalization Localization See 5+     See less ", "Summary Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n \nOne year’ experience as origination manager, dedicated to high profile strategic relationship with special focus on developing corporate finance and investment banking towards corporate customers. Ten years’ experience as Relationship Manager with Large, Medium and Small Corporate customers. Five years spent in HK supporting market development and delocalization of European companies in China and Far East. Summary Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n \nOne year’ experience as origination manager, dedicated to high profile strategic relationship with special focus on developing corporate finance and investment banking towards corporate customers. Ten years’ experience as Relationship Manager with Large, Medium and Small Corporate customers. Five years spent in HK supporting market development and delocalization of European companies in China and Far East. Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n \nOne year’ experience as origination manager, dedicated to high profile strategic relationship with special focus on developing corporate finance and investment banking towards corporate customers. Ten years’ experience as Relationship Manager with Large, Medium and Small Corporate customers. Five years spent in HK supporting market development and delocalization of European companies in China and Far East. Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n \nOne year’ experience as origination manager, dedicated to high profile strategic relationship with special focus on developing corporate finance and investment banking towards corporate customers. Ten years’ experience as Relationship Manager with Large, Medium and Small Corporate customers. Five years spent in HK supporting market development and delocalization of European companies in China and Far East. Experience Americas Area Specialist - Internationalization Development Desk - Intesa Sanpaolo Spa Intesa Sanpaolo September 2012  – Present (3 years) Padova Area, Italy Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n- Foreign market research - industrial partner and business opportunities search, support to trade missions, international tenders and bids; \n- Foreign investments planning - information on the selected country, contacts with local institutions and authorities, financial solutions proposal , facilitated terms checking. Onsite consulting for company establishment, solutions for investment financing, trade information on foreign counterparties/partners; \n- Foreign subsidiaries relationship management - activation of accounts abroad and other banking services for onsite financial requirements Head of Internationalization Development Desk for Emilia Romagna and Central Adriatic regions Intesa Sanpaolo July 2011  –  August 2012  (1 year 2 months) Servizio Internazionalizzazione Imprese - Intesa Sanpaolo Spa - Bologna Report to the Head of Internationalization Service, direct relationship with companies' ownership and CFOs. Responsible for first advisory in internationalization and delocalization projects of SME, promotion of the bank international network, Export and Internationalization products and services, and for supporting cross selling and coordination between relationship managers, geographic desks and product specialists, Seminar Speaker. Origination Manager - Strategic Business Origination Desk - Corporate & I.B. Division Intesa Sanpaolo January 2010  –  June 2011  (1 year 6 months) Intesa San Paolo Spa – Milan H.Q. Direct report to the Head of business, direct relationship with companies' ownership and CFOs. Responsible for origination and promotion of wholesale and investment banking products towards a portfolio of mid corporate customers, specialist support to corporate branches for commercial strategies, cross selling and coordination of structured product desks, assistance for structured financing deals. Associate Director - Corporate Banking - Intesa Sanpaolo Hong Kong branch INTESA SANPAOLO SPA May 2006  –  December 2009  (3 years 8 months) Hong Kong Head of Corporate Banking Italian desk – Intesa Sanpaolo Hong Kong branch (after the merger between Intesa Spa and SanpaoloImi Spa). Responsible for a Corporate customers portfolio for Risk Analysis, Lines of credits proposal, Pricing negotiation, Terms and Conditions management, bank’s commercial products sale. Relationship managers’ supervisor. Relationship Manager - Corporate Banking - Intesa Sanpaolo Hong Kong Branch Intesa Sanpaolo Spa Hong Kong branch August 2004  –  April 2006  (1 year 9 months) Hong Kong Responsible of Small and Medium Italian Corporate Enterprises Portfolio for Risk Analysis, Lines of credits proposal preparation, Line of credit management and for Commercial products sale. Americas Area Specialist - Internationalization Development Desk - Intesa Sanpaolo Spa Intesa Sanpaolo September 2012  – Present (3 years) Padova Area, Italy Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n- Foreign market research - industrial partner and business opportunities search, support to trade missions, international tenders and bids; \n- Foreign investments planning - information on the selected country, contacts with local institutions and authorities, financial solutions proposal , facilitated terms checking. Onsite consulting for company establishment, solutions for investment financing, trade information on foreign counterparties/partners; \n- Foreign subsidiaries relationship management - activation of accounts abroad and other banking services for onsite financial requirements Americas Area Specialist - Internationalization Development Desk - Intesa Sanpaolo Spa Intesa Sanpaolo September 2012  – Present (3 years) Padova Area, Italy Internationalization specialist for Americas Area. Advisory and promotion of bank’s international network with the aim to improve customers relationship and maximize customers cross-border business opportunities.  \n- Foreign market research - industrial partner and business opportunities search, support to trade missions, international tenders and bids; \n- Foreign investments planning - information on the selected country, contacts with local institutions and authorities, financial solutions proposal , facilitated terms checking. Onsite consulting for company establishment, solutions for investment financing, trade information on foreign counterparties/partners; \n- Foreign subsidiaries relationship management - activation of accounts abroad and other banking services for onsite financial requirements Head of Internationalization Development Desk for Emilia Romagna and Central Adriatic regions Intesa Sanpaolo July 2011  –  August 2012  (1 year 2 months) Servizio Internazionalizzazione Imprese - Intesa Sanpaolo Spa - Bologna Report to the Head of Internationalization Service, direct relationship with companies' ownership and CFOs. Responsible for first advisory in internationalization and delocalization projects of SME, promotion of the bank international network, Export and Internationalization products and services, and for supporting cross selling and coordination between relationship managers, geographic desks and product specialists, Seminar Speaker. Head of Internationalization Development Desk for Emilia Romagna and Central Adriatic regions Intesa Sanpaolo July 2011  –  August 2012  (1 year 2 months) Servizio Internazionalizzazione Imprese - Intesa Sanpaolo Spa - Bologna Report to the Head of Internationalization Service, direct relationship with companies' ownership and CFOs. Responsible for first advisory in internationalization and delocalization projects of SME, promotion of the bank international network, Export and Internationalization products and services, and for supporting cross selling and coordination between relationship managers, geographic desks and product specialists, Seminar Speaker. Origination Manager - Strategic Business Origination Desk - Corporate & I.B. Division Intesa Sanpaolo January 2010  –  June 2011  (1 year 6 months) Intesa San Paolo Spa – Milan H.Q. Direct report to the Head of business, direct relationship with companies' ownership and CFOs. Responsible for origination and promotion of wholesale and investment banking products towards a portfolio of mid corporate customers, specialist support to corporate branches for commercial strategies, cross selling and coordination of structured product desks, assistance for structured financing deals. Origination Manager - Strategic Business Origination Desk - Corporate & I.B. Division Intesa Sanpaolo January 2010  –  June 2011  (1 year 6 months) Intesa San Paolo Spa – Milan H.Q. Direct report to the Head of business, direct relationship with companies' ownership and CFOs. Responsible for origination and promotion of wholesale and investment banking products towards a portfolio of mid corporate customers, specialist support to corporate branches for commercial strategies, cross selling and coordination of structured product desks, assistance for structured financing deals. Associate Director - Corporate Banking - Intesa Sanpaolo Hong Kong branch INTESA SANPAOLO SPA May 2006  –  December 2009  (3 years 8 months) Hong Kong Head of Corporate Banking Italian desk – Intesa Sanpaolo Hong Kong branch (after the merger between Intesa Spa and SanpaoloImi Spa). Responsible for a Corporate customers portfolio for Risk Analysis, Lines of credits proposal, Pricing negotiation, Terms and Conditions management, bank’s commercial products sale. Relationship managers’ supervisor. Associate Director - Corporate Banking - Intesa Sanpaolo Hong Kong branch INTESA SANPAOLO SPA May 2006  –  December 2009  (3 years 8 months) Hong Kong Head of Corporate Banking Italian desk – Intesa Sanpaolo Hong Kong branch (after the merger between Intesa Spa and SanpaoloImi Spa). Responsible for a Corporate customers portfolio for Risk Analysis, Lines of credits proposal, Pricing negotiation, Terms and Conditions management, bank’s commercial products sale. Relationship managers’ supervisor. Relationship Manager - Corporate Banking - Intesa Sanpaolo Hong Kong Branch Intesa Sanpaolo Spa Hong Kong branch August 2004  –  April 2006  (1 year 9 months) Hong Kong Responsible of Small and Medium Italian Corporate Enterprises Portfolio for Risk Analysis, Lines of credits proposal preparation, Line of credit management and for Commercial products sale. Relationship Manager - Corporate Banking - Intesa Sanpaolo Hong Kong Branch Intesa Sanpaolo Spa Hong Kong branch August 2004  –  April 2006  (1 year 9 months) Hong Kong Responsible of Small and Medium Italian Corporate Enterprises Portfolio for Risk Analysis, Lines of credits proposal preparation, Line of credit management and for Commercial products sale. Languages English French Italian English French Italian English French Italian Skills Commercial Banking Credit Analysis Corporate Finance Capital Markets Structured Finance Investment Banking Credit Risk Banking Financial Analysis Financial Risk Financial Markets Credit Corporate Development Asia Pacific South East Asia Asian Business Latin America International Trade Internationalization International... Americas American Portfolio Management Project Finance Strategy Market Research Trade Finance Private Equity Mergers & Acquisitions Finance Investments Business Strategy See 17+     See less Skills  Commercial Banking Credit Analysis Corporate Finance Capital Markets Structured Finance Investment Banking Credit Risk Banking Financial Analysis Financial Risk Financial Markets Credit Corporate Development Asia Pacific South East Asia Asian Business Latin America International Trade Internationalization International... Americas American Portfolio Management Project Finance Strategy Market Research Trade Finance Private Equity Mergers & Acquisitions Finance Investments Business Strategy See 17+     See less Commercial Banking Credit Analysis Corporate Finance Capital Markets Structured Finance Investment Banking Credit Risk Banking Financial Analysis Financial Risk Financial Markets Credit Corporate Development Asia Pacific South East Asia Asian Business Latin America International Trade Internationalization International... Americas American Portfolio Management Project Finance Strategy Market Research Trade Finance Private Equity Mergers & Acquisitions Finance Investments Business Strategy See 17+     See less Commercial Banking Credit Analysis Corporate Finance Capital Markets Structured Finance Investment Banking Credit Risk Banking Financial Analysis Financial Risk Financial Markets Credit Corporate Development Asia Pacific South East Asia Asian Business Latin America International Trade Internationalization International... Americas American Portfolio Management Project Finance Strategy Market Research Trade Finance Private Equity Mergers & Acquisitions Finance Investments Business Strategy See 17+     See less Education Università degli Studi di Torino 100,  Economics and management 1990  – 1997 Activities and Societies:  AIESEC memeber Liceo Classico A. Mariotti - Perugia (Italy) 60/60,  Humanistic studies , High school 1983  – 1989 Università degli Studi di Torino 100,  Economics and management 1990  – 1997 Activities and Societies:  AIESEC memeber Università degli Studi di Torino 100,  Economics and management 1990  – 1997 Activities and Societies:  AIESEC memeber Università degli Studi di Torino 100,  Economics and management 1990  – 1997 Activities and Societies:  AIESEC memeber Liceo Classico A. Mariotti - Perugia (Italy) 60/60,  Humanistic studies , High school 1983  – 1989 Liceo Classico A. Mariotti - Perugia (Italy) 60/60,  Humanistic studies , High school 1983  – 1989 Liceo Classico A. Mariotti - Perugia (Italy) 60/60,  Humanistic studies , High school 1983  – 1989 ", "Summary Top-notch programmer with two decades of Web development experience. \n \nAccomplished programming language designer with invited talks at OOPSLA and ICFP. \n \nWell-known participant in F/OSS community, with 200+ projects on GitHub, and invited talks at OSCON, OSDC, and YAPC. \n \nSpecialties: Extensive experience with Perl 5/6, Haskell, JavaScript/LiveScript/CoffeeScript/Node.js, Flex/ActionScript, REST Archictecture, Databases, Unix system programming, Internationalization and Localization. \n \nVery familiar with C, Mobile Development, Content Management Systems, Multi-core programming, Version control system design, Social interaction design, and Programming language design. Summary Top-notch programmer with two decades of Web development experience. \n \nAccomplished programming language designer with invited talks at OOPSLA and ICFP. \n \nWell-known participant in F/OSS community, with 200+ projects on GitHub, and invited talks at OSCON, OSDC, and YAPC. \n \nSpecialties: Extensive experience with Perl 5/6, Haskell, JavaScript/LiveScript/CoffeeScript/Node.js, Flex/ActionScript, REST Archictecture, Databases, Unix system programming, Internationalization and Localization. \n \nVery familiar with C, Mobile Development, Content Management Systems, Multi-core programming, Version control system design, Social interaction design, and Programming language design. Top-notch programmer with two decades of Web development experience. \n \nAccomplished programming language designer with invited talks at OOPSLA and ICFP. \n \nWell-known participant in F/OSS community, with 200+ projects on GitHub, and invited talks at OSCON, OSDC, and YAPC. \n \nSpecialties: Extensive experience with Perl 5/6, Haskell, JavaScript/LiveScript/CoffeeScript/Node.js, Flex/ActionScript, REST Archictecture, Databases, Unix system programming, Internationalization and Localization. \n \nVery familiar with C, Mobile Development, Content Management Systems, Multi-core programming, Version control system design, Social interaction design, and Programming language design. Top-notch programmer with two decades of Web development experience. \n \nAccomplished programming language designer with invited talks at OOPSLA and ICFP. \n \nWell-known participant in F/OSS community, with 200+ projects on GitHub, and invited talks at OSCON, OSDC, and YAPC. \n \nSpecialties: Extensive experience with Perl 5/6, Haskell, JavaScript/LiveScript/CoffeeScript/Node.js, Flex/ActionScript, REST Archictecture, Databases, Unix system programming, Internationalization and Localization. \n \nVery familiar with C, Mobile Development, Content Management Systems, Multi-core programming, Version control system design, Social interaction design, and Programming language design. Experience Consultant, Cloud Services Localization Apple Inc. June 2010  – Present (5 years 3 months) Working with Apple on globalization technologies and related infrastructures. Consultant Oxford University Press October 2014  – Present (11 months) Working with the Global Language Solutions team on digital dictionaries. Committee Member National Academy for Education Research July 2015  – Present (2 months) Working with NAER's K-12 Curriculum Committee on due process, transparency, and process reform. Committee Member National Development Council June 2015  – Present (3 months) Working with NDC's Open Data consultation committee on Taiwan's Data Governance policies. Untitled Page Socialtext August 2008  – Present (7 years 1 month) Dedicated \"Untitled Page\" of the company. \n \nNamed, co-designed (with Tracy Ruggles, Gabe Wachob, Alan Lepofsky, and the entire Socialtext staff), and implemented the Socialtext Desktop product. \n \nCo-designed and implemented the HTML5 version of Socialtext Mobile product, based on Mobile jQuery. \n \nDesigned and implemented the internationalization framework for Socialtext, and oversaw initial translations to Traditional and Simplified Chinese. \n \nIntegrated the Wikiwyg rich text editor with CKEditor, adding support for OpenSocial widgets and multimedia assets. \n \nBrought the SocialCalc collaborative spreadsheet to production quality (based on Dan Bricklin's original design and code), and wrote a chapter on it in the book “Architecture of Open Source Applications”. \n \nDesigned and implemented Socialtext's mobile App on iOS and Android platforms, based on PhoneGap. Author \"500 Lines or Less\" November 2013  – Present (1 year 10 months) Wrote the chapter \"Web Spreadsheet in 99 lines\" with AngularJS and ReactJS. Internationalization Specialist Perl 5 May 2002  – Present (13 years 4 months) Member of Unicode and Internationalization working groups, with core contributions such as Locale::Maketext::Simple and encoding::warnings. \n \nMaintainer of Perl 5's Chinese language support, with modules such as Encode::TW, Encode::HanExtra and Encode::HanConvert. Designer and Implementor CPAN 1998  – Present (17 years) Recipient of Perl Foundation grants, for designing and implementing a Public Key Infrastructure for CPAN. \n \nDesigned and implemented the Perl Archive Toolkit (PAR), a JAR-like module deployment mechanism and an application packager. \n \nCo-designed and implemented Module::Install, a popular alternative to ExtUtils::MakeMaker for CPAN module creation. \n \nCo-designed and implemented CPAN Smoke Testing, an effort to automatically test each CPAN module as they are uploaded. Consultant Executive Yuan December 2014  –  June 2015  (7 months) Taipei City, Taiwan Working with Minister Jaclyn Tsai's office on government transparency and cyberlaw reform initiatives. Consultant ChineseCUBES July 2014  –  January 2015  (7 months) Author \"Performance of Open Source Applications\" October 2012  –  November 2012  (2 months) Wrote the chapter on EtherCalc. Contractor Wikimedia Foundation February 2012  –  May 2012  (4 months) Worked with the Visual Editor team on an avg. 4hr/wk basis. Author and Reviewer \"Architecture of Open Source Applications\" August 2010  –  April 2012  (1 year 9 months) Wrote the chapter on SocialCalc, and reviewed several chapters for the second volume. Designer, Platform Specialist and Implementor Haskell Language 2003  –  July 2010  (7 years) Responsible for maintaining the AIX port of GHC, the leading Haskell compiler. \n \nCo-designed and implemented Object-Orientation syntax support for GHC, via existential GADT records. \n \nMember of the Haskell-Prime committee, responsible for designing the Haskell 2010 Standard. Designer and Lead Implementor Perl 6 February 2005  –  November 2008  (3 years 10 months) Designed and implemented Pugs, the first working Perl 6 implementation. \n \nCo-designed the Perl 6 Test Suite, an acceptance test suite for Perl 6, cross-referenced with the language specification. \n \nCo-designed many aspects of the Perl 6 language, in particular the Perl 6 Object Model, subsequently implemented in Perl 5 as Moose.pm. \n \nOperated the #perl6 channel, effectively advocated IRC/Subversion-based online collaboration to 200+ team members, including Larry Wall. Contractor and Local Distributor Best Practical Solutions, LLC May 2002  –  September 2008  (6 years 5 months) Designed and implemented an Atom-based REST API for RT, including both client and server side components. \n \nImplemented modern Ajax-based technologies for the RT UI, including Rich Text editing and Address Autocompletion. \n \nDesigned the internationalization framework for RT, SVK and the Jifty web framework. Senior Consultant S-Team Technology July 2004  –  August 2008  (4 years 2 months) Responsible for establishing an EDP (enterprise document processing) platform for 90%+ of Taiwan's major banks. \n \nImplemented a common software deployment platform (based on GHC 6.8, Jifty, Perl 5.10 and Apache 2) for AIX, Linux and Mac OS X. \n \nDesigned and implemented RQS, a REST-based enhancement and replacement to IBM's Content Manager OnDemand product, with 10,000+ active users in 20+ financial institutions. \n \nDesigned and implemented RMS, an enhancement and replacement to the StreamServe platform. President and Chairperson OurInternet, Inc April 2000  –  February 2005  (4 years 11 months) Established a contractor-oriented company, focusing on internationalizing and productizing Perl-based technologies. \n \nDesigned and implemented www.OpenFoundry.org, a large-scale software collaboration platform sponsored by the Taiwan government, based on RT, Kwiki, SVK and Sympa. \n \nDesigned and implemented 104 eHR, a RT-based Web Workflow system for Taiwan's largest online job site. \n \nManaged translation teams for O'Reilly Taiwan's Perl titles, such as Learning Perl, Programming Perl, Running Weblogs with Slash, Developing Bioinformatics Computer Skills. Senior Consultant BenQ March 1998  –  July 2000  (2 years 5 months) Worked in BenQ China, USA and Taiwan offices on improving and productizing their ERP system. \n \nCo-designed the refactoring roadmap for BenQ's internal workflow system. \n \nHelped establishing www.BenQGuru.com, a BenQ subsidiary specializing on ERP and HR software products. \n \nReported directly to the president of BenQ USA. Chief Technogy Officer Inforian Inc. May 1995  –  May 1997  (2 years 1 month) Led a team of 10 Perl developers, with responsibilities including online services and retail-channel software products. \n \nDesigned and implemented Quest, a meta-search client, winner of the \"Best product of CompuTEX\" award and \"Editor's Pick\" from ZDNet. \n \nDesigned and implemented FusionSearch, a full-text web search engine with support for CJK languages. \n \nDesigned the back-end infrastructure of www.CoolBid.com, Taiwan's first online B2C portal and auction site. Consultant, Cloud Services Localization Apple Inc. June 2010  – Present (5 years 3 months) Working with Apple on globalization technologies and related infrastructures. Consultant, Cloud Services Localization Apple Inc. June 2010  – Present (5 years 3 months) Working with Apple on globalization technologies and related infrastructures. Consultant Oxford University Press October 2014  – Present (11 months) Working with the Global Language Solutions team on digital dictionaries. Consultant Oxford University Press October 2014  – Present (11 months) Working with the Global Language Solutions team on digital dictionaries. Committee Member National Academy for Education Research July 2015  – Present (2 months) Working with NAER's K-12 Curriculum Committee on due process, transparency, and process reform. Committee Member National Academy for Education Research July 2015  – Present (2 months) Working with NAER's K-12 Curriculum Committee on due process, transparency, and process reform. Committee Member National Development Council June 2015  – Present (3 months) Working with NDC's Open Data consultation committee on Taiwan's Data Governance policies. Committee Member National Development Council June 2015  – Present (3 months) Working with NDC's Open Data consultation committee on Taiwan's Data Governance policies. Untitled Page Socialtext August 2008  – Present (7 years 1 month) Dedicated \"Untitled Page\" of the company. \n \nNamed, co-designed (with Tracy Ruggles, Gabe Wachob, Alan Lepofsky, and the entire Socialtext staff), and implemented the Socialtext Desktop product. \n \nCo-designed and implemented the HTML5 version of Socialtext Mobile product, based on Mobile jQuery. \n \nDesigned and implemented the internationalization framework for Socialtext, and oversaw initial translations to Traditional and Simplified Chinese. \n \nIntegrated the Wikiwyg rich text editor with CKEditor, adding support for OpenSocial widgets and multimedia assets. \n \nBrought the SocialCalc collaborative spreadsheet to production quality (based on Dan Bricklin's original design and code), and wrote a chapter on it in the book “Architecture of Open Source Applications”. \n \nDesigned and implemented Socialtext's mobile App on iOS and Android platforms, based on PhoneGap. Untitled Page Socialtext August 2008  – Present (7 years 1 month) Dedicated \"Untitled Page\" of the company. \n \nNamed, co-designed (with Tracy Ruggles, Gabe Wachob, Alan Lepofsky, and the entire Socialtext staff), and implemented the Socialtext Desktop product. \n \nCo-designed and implemented the HTML5 version of Socialtext Mobile product, based on Mobile jQuery. \n \nDesigned and implemented the internationalization framework for Socialtext, and oversaw initial translations to Traditional and Simplified Chinese. \n \nIntegrated the Wikiwyg rich text editor with CKEditor, adding support for OpenSocial widgets and multimedia assets. \n \nBrought the SocialCalc collaborative spreadsheet to production quality (based on Dan Bricklin's original design and code), and wrote a chapter on it in the book “Architecture of Open Source Applications”. \n \nDesigned and implemented Socialtext's mobile App on iOS and Android platforms, based on PhoneGap. Author \"500 Lines or Less\" November 2013  – Present (1 year 10 months) Wrote the chapter \"Web Spreadsheet in 99 lines\" with AngularJS and ReactJS. Author \"500 Lines or Less\" November 2013  – Present (1 year 10 months) Wrote the chapter \"Web Spreadsheet in 99 lines\" with AngularJS and ReactJS. Internationalization Specialist Perl 5 May 2002  – Present (13 years 4 months) Member of Unicode and Internationalization working groups, with core contributions such as Locale::Maketext::Simple and encoding::warnings. \n \nMaintainer of Perl 5's Chinese language support, with modules such as Encode::TW, Encode::HanExtra and Encode::HanConvert. Internationalization Specialist Perl 5 May 2002  – Present (13 years 4 months) Member of Unicode and Internationalization working groups, with core contributions such as Locale::Maketext::Simple and encoding::warnings. \n \nMaintainer of Perl 5's Chinese language support, with modules such as Encode::TW, Encode::HanExtra and Encode::HanConvert. Designer and Implementor CPAN 1998  – Present (17 years) Recipient of Perl Foundation grants, for designing and implementing a Public Key Infrastructure for CPAN. \n \nDesigned and implemented the Perl Archive Toolkit (PAR), a JAR-like module deployment mechanism and an application packager. \n \nCo-designed and implemented Module::Install, a popular alternative to ExtUtils::MakeMaker for CPAN module creation. \n \nCo-designed and implemented CPAN Smoke Testing, an effort to automatically test each CPAN module as they are uploaded. Designer and Implementor CPAN 1998  – Present (17 years) Recipient of Perl Foundation grants, for designing and implementing a Public Key Infrastructure for CPAN. \n \nDesigned and implemented the Perl Archive Toolkit (PAR), a JAR-like module deployment mechanism and an application packager. \n \nCo-designed and implemented Module::Install, a popular alternative to ExtUtils::MakeMaker for CPAN module creation. \n \nCo-designed and implemented CPAN Smoke Testing, an effort to automatically test each CPAN module as they are uploaded. Consultant Executive Yuan December 2014  –  June 2015  (7 months) Taipei City, Taiwan Working with Minister Jaclyn Tsai's office on government transparency and cyberlaw reform initiatives. Consultant Executive Yuan December 2014  –  June 2015  (7 months) Taipei City, Taiwan Working with Minister Jaclyn Tsai's office on government transparency and cyberlaw reform initiatives. Consultant ChineseCUBES July 2014  –  January 2015  (7 months) Consultant ChineseCUBES July 2014  –  January 2015  (7 months) Author \"Performance of Open Source Applications\" October 2012  –  November 2012  (2 months) Wrote the chapter on EtherCalc. Author \"Performance of Open Source Applications\" October 2012  –  November 2012  (2 months) Wrote the chapter on EtherCalc. Contractor Wikimedia Foundation February 2012  –  May 2012  (4 months) Worked with the Visual Editor team on an avg. 4hr/wk basis. Contractor Wikimedia Foundation February 2012  –  May 2012  (4 months) Worked with the Visual Editor team on an avg. 4hr/wk basis. Author and Reviewer \"Architecture of Open Source Applications\" August 2010  –  April 2012  (1 year 9 months) Wrote the chapter on SocialCalc, and reviewed several chapters for the second volume. Author and Reviewer \"Architecture of Open Source Applications\" August 2010  –  April 2012  (1 year 9 months) Wrote the chapter on SocialCalc, and reviewed several chapters for the second volume. Designer, Platform Specialist and Implementor Haskell Language 2003  –  July 2010  (7 years) Responsible for maintaining the AIX port of GHC, the leading Haskell compiler. \n \nCo-designed and implemented Object-Orientation syntax support for GHC, via existential GADT records. \n \nMember of the Haskell-Prime committee, responsible for designing the Haskell 2010 Standard. Designer, Platform Specialist and Implementor Haskell Language 2003  –  July 2010  (7 years) Responsible for maintaining the AIX port of GHC, the leading Haskell compiler. \n \nCo-designed and implemented Object-Orientation syntax support for GHC, via existential GADT records. \n \nMember of the Haskell-Prime committee, responsible for designing the Haskell 2010 Standard. Designer and Lead Implementor Perl 6 February 2005  –  November 2008  (3 years 10 months) Designed and implemented Pugs, the first working Perl 6 implementation. \n \nCo-designed the Perl 6 Test Suite, an acceptance test suite for Perl 6, cross-referenced with the language specification. \n \nCo-designed many aspects of the Perl 6 language, in particular the Perl 6 Object Model, subsequently implemented in Perl 5 as Moose.pm. \n \nOperated the #perl6 channel, effectively advocated IRC/Subversion-based online collaboration to 200+ team members, including Larry Wall. Designer and Lead Implementor Perl 6 February 2005  –  November 2008  (3 years 10 months) Designed and implemented Pugs, the first working Perl 6 implementation. \n \nCo-designed the Perl 6 Test Suite, an acceptance test suite for Perl 6, cross-referenced with the language specification. \n \nCo-designed many aspects of the Perl 6 language, in particular the Perl 6 Object Model, subsequently implemented in Perl 5 as Moose.pm. \n \nOperated the #perl6 channel, effectively advocated IRC/Subversion-based online collaboration to 200+ team members, including Larry Wall. Contractor and Local Distributor Best Practical Solutions, LLC May 2002  –  September 2008  (6 years 5 months) Designed and implemented an Atom-based REST API for RT, including both client and server side components. \n \nImplemented modern Ajax-based technologies for the RT UI, including Rich Text editing and Address Autocompletion. \n \nDesigned the internationalization framework for RT, SVK and the Jifty web framework. Contractor and Local Distributor Best Practical Solutions, LLC May 2002  –  September 2008  (6 years 5 months) Designed and implemented an Atom-based REST API for RT, including both client and server side components. \n \nImplemented modern Ajax-based technologies for the RT UI, including Rich Text editing and Address Autocompletion. \n \nDesigned the internationalization framework for RT, SVK and the Jifty web framework. Senior Consultant S-Team Technology July 2004  –  August 2008  (4 years 2 months) Responsible for establishing an EDP (enterprise document processing) platform for 90%+ of Taiwan's major banks. \n \nImplemented a common software deployment platform (based on GHC 6.8, Jifty, Perl 5.10 and Apache 2) for AIX, Linux and Mac OS X. \n \nDesigned and implemented RQS, a REST-based enhancement and replacement to IBM's Content Manager OnDemand product, with 10,000+ active users in 20+ financial institutions. \n \nDesigned and implemented RMS, an enhancement and replacement to the StreamServe platform. Senior Consultant S-Team Technology July 2004  –  August 2008  (4 years 2 months) Responsible for establishing an EDP (enterprise document processing) platform for 90%+ of Taiwan's major banks. \n \nImplemented a common software deployment platform (based on GHC 6.8, Jifty, Perl 5.10 and Apache 2) for AIX, Linux and Mac OS X. \n \nDesigned and implemented RQS, a REST-based enhancement and replacement to IBM's Content Manager OnDemand product, with 10,000+ active users in 20+ financial institutions. \n \nDesigned and implemented RMS, an enhancement and replacement to the StreamServe platform. President and Chairperson OurInternet, Inc April 2000  –  February 2005  (4 years 11 months) Established a contractor-oriented company, focusing on internationalizing and productizing Perl-based technologies. \n \nDesigned and implemented www.OpenFoundry.org, a large-scale software collaboration platform sponsored by the Taiwan government, based on RT, Kwiki, SVK and Sympa. \n \nDesigned and implemented 104 eHR, a RT-based Web Workflow system for Taiwan's largest online job site. \n \nManaged translation teams for O'Reilly Taiwan's Perl titles, such as Learning Perl, Programming Perl, Running Weblogs with Slash, Developing Bioinformatics Computer Skills. President and Chairperson OurInternet, Inc April 2000  –  February 2005  (4 years 11 months) Established a contractor-oriented company, focusing on internationalizing and productizing Perl-based technologies. \n \nDesigned and implemented www.OpenFoundry.org, a large-scale software collaboration platform sponsored by the Taiwan government, based on RT, Kwiki, SVK and Sympa. \n \nDesigned and implemented 104 eHR, a RT-based Web Workflow system for Taiwan's largest online job site. \n \nManaged translation teams for O'Reilly Taiwan's Perl titles, such as Learning Perl, Programming Perl, Running Weblogs with Slash, Developing Bioinformatics Computer Skills. Senior Consultant BenQ March 1998  –  July 2000  (2 years 5 months) Worked in BenQ China, USA and Taiwan offices on improving and productizing their ERP system. \n \nCo-designed the refactoring roadmap for BenQ's internal workflow system. \n \nHelped establishing www.BenQGuru.com, a BenQ subsidiary specializing on ERP and HR software products. \n \nReported directly to the president of BenQ USA. Senior Consultant BenQ March 1998  –  July 2000  (2 years 5 months) Worked in BenQ China, USA and Taiwan offices on improving and productizing their ERP system. \n \nCo-designed the refactoring roadmap for BenQ's internal workflow system. \n \nHelped establishing www.BenQGuru.com, a BenQ subsidiary specializing on ERP and HR software products. \n \nReported directly to the president of BenQ USA. Chief Technogy Officer Inforian Inc. May 1995  –  May 1997  (2 years 1 month) Led a team of 10 Perl developers, with responsibilities including online services and retail-channel software products. \n \nDesigned and implemented Quest, a meta-search client, winner of the \"Best product of CompuTEX\" award and \"Editor's Pick\" from ZDNet. \n \nDesigned and implemented FusionSearch, a full-text web search engine with support for CJK languages. \n \nDesigned the back-end infrastructure of www.CoolBid.com, Taiwan's first online B2C portal and auction site. Chief Technogy Officer Inforian Inc. May 1995  –  May 1997  (2 years 1 month) Led a team of 10 Perl developers, with responsibilities including online services and retail-channel software products. \n \nDesigned and implemented Quest, a meta-search client, winner of the \"Best product of CompuTEX\" award and \"Editor's Pick\" from ZDNet. \n \nDesigned and implemented FusionSearch, a full-text web search engine with support for CJK languages. \n \nDesigned the back-end infrastructure of www.CoolBid.com, Taiwan's first online B2C portal and auction site. Languages English Chinese English Chinese English Chinese Skills Perl JavaScript SQL Haskell Unix C ActionScript Node.js CoffeeScript LiveScript PostgreSQL Nginx Psychoanalysis Relational Databases Programming Languages Apache OS X MySQL Open Source Linux Subversion Software Engineering Web Services Web Development OOP REST Git Web Applications System Architecture Distributed Systems Operating Systems Software Development Scalability jQuery Programming Shell Scripting Bash See 22+     See less Skills  Perl JavaScript SQL Haskell Unix C ActionScript Node.js CoffeeScript LiveScript PostgreSQL Nginx Psychoanalysis Relational Databases Programming Languages Apache OS X MySQL Open Source Linux Subversion Software Engineering Web Services Web Development OOP REST Git Web Applications System Architecture Distributed Systems Operating Systems Software Development Scalability jQuery Programming Shell Scripting Bash See 22+     See less Perl JavaScript SQL Haskell Unix C ActionScript Node.js CoffeeScript LiveScript PostgreSQL Nginx Psychoanalysis Relational Databases Programming Languages Apache OS X MySQL Open Source Linux Subversion Software Engineering Web Services Web Development OOP REST Git Web Applications System Architecture Distributed Systems Operating Systems Software Development Scalability jQuery Programming Shell Scripting Bash See 22+     See less Perl JavaScript SQL Haskell Unix C ActionScript Node.js CoffeeScript LiveScript PostgreSQL Nginx Psychoanalysis Relational Databases Programming Languages Apache OS X MySQL Open Source Linux Subversion Software Engineering Web Services Web Development OOP REST Git Web Applications System Architecture Distributed Systems Operating Systems Software Development Scalability jQuery Programming Shell Scripting Bash See 22+     See less Education Self-Educated Self-Educated,  Linguistics ,  Philosophy ,  Informatics ,  Psychology , Autodidact 1994  – 2020 I'm entirely self-educated, having quit the school system at 14. Self-Educated Self-Educated,  Linguistics ,  Philosophy ,  Informatics ,  Psychology , Autodidact 1994  – 2020 I'm entirely self-educated, having quit the school system at 14. Self-Educated Self-Educated,  Linguistics ,  Philosophy ,  Informatics ,  Psychology , Autodidact 1994  – 2020 I'm entirely self-educated, having quit the school system at 14. Self-Educated Self-Educated,  Linguistics ,  Philosophy ,  Informatics ,  Psychology , Autodidact 1994  – 2020 I'm entirely self-educated, having quit the school system at 14. "]}