{"position": "Legal Director", "company": "Google", "profiles": ["Languages English Full professional proficiency Spanish Full professional proficiency Italian Professional working proficiency French Elementary proficiency German Elementary proficiency portuguese Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Italian Professional working proficiency French Elementary proficiency German Elementary proficiency portuguese Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Italian Professional working proficiency French Elementary proficiency German Elementary proficiency portuguese Native or bilingual proficiency Full professional proficiency Full professional proficiency Professional working proficiency Elementary proficiency Elementary proficiency Native or bilingual proficiency Skills Strategic Partnerships IT law Corporate Law Project Management Intellectual Property Privacy Law Consumer Law Licensing Software Licensing Joint Ventures Commercial Litigation Patents Strategy Cyberlaw Negotiation Corporate Governance Mobile Devices Management Competition Law Contract Law Litigation International Law See 7+     See less Skills  Strategic Partnerships IT law Corporate Law Project Management Intellectual Property Privacy Law Consumer Law Licensing Software Licensing Joint Ventures Commercial Litigation Patents Strategy Cyberlaw Negotiation Corporate Governance Mobile Devices Management Competition Law Contract Law Litigation International Law See 7+     See less Strategic Partnerships IT law Corporate Law Project Management Intellectual Property Privacy Law Consumer Law Licensing Software Licensing Joint Ventures Commercial Litigation Patents Strategy Cyberlaw Negotiation Corporate Governance Mobile Devices Management Competition Law Contract Law Litigation International Law See 7+     See less Strategic Partnerships IT law Corporate Law Project Management Intellectual Property Privacy Law Consumer Law Licensing Software Licensing Joint Ventures Commercial Litigation Patents Strategy Cyberlaw Negotiation Corporate Governance Mobile Devices Management Competition Law Contract Law Litigation International Law See 7+     See less ", "Experience Chairman and Legal Director Palladium Associates Plc July 2010  – Present (5 years 2 months) Greater Manchester I am the Chairman and Legal Director of Palladium Associates Plc. We are a full service risk consultancy dealing with all aspects of private investigation and security. We act for several high street banks and specialise in asset tracing and investigating fraud. We do however perform every service you would expect a full service risk consultancy to perform. We have offices in London and Frankfurt, but our head office is based in Greater Manchester. Managing Partner Prosperity Law LLP July 2010  – Present (5 years 2 months) Greater Manchester Prosperity Law LLP provides legal services to both Palladium Associates Plc and Prosperity International Sports Management and we effectively act as the in-house lawyers for both companies. We are however an independent law firm who also carry out commercial legal work in a wider context and have an impressive client list. The firm enjoys high quality high value legal work to include acting for a number of high profile individuals in the region. Prosperity Law LLP prides itself on having a highly dynamic and commercial approach. Chairman and Legal Director Prosperity International Sports Management July 2009  – Present (6 years 2 months) Greater Manchester Prosperity International Sports Management Limited is a full service sports management agency. We currently represent around 25 professional footballers (to include many players at Premiership clubs) and 10 leading Olympic athletes (many of whom are medal prospects for London 2012). I am the Chairman and Legal Director of the business. Our aim is to provide a professional, high quality service delivered with the upmost integrity. Legal Director Ultraframe Plc 2000  –  2006  (6 years) Chairman and Legal Director Palladium Associates Plc July 2010  – Present (5 years 2 months) Greater Manchester I am the Chairman and Legal Director of Palladium Associates Plc. We are a full service risk consultancy dealing with all aspects of private investigation and security. We act for several high street banks and specialise in asset tracing and investigating fraud. We do however perform every service you would expect a full service risk consultancy to perform. We have offices in London and Frankfurt, but our head office is based in Greater Manchester. Chairman and Legal Director Palladium Associates Plc July 2010  – Present (5 years 2 months) Greater Manchester I am the Chairman and Legal Director of Palladium Associates Plc. We are a full service risk consultancy dealing with all aspects of private investigation and security. We act for several high street banks and specialise in asset tracing and investigating fraud. We do however perform every service you would expect a full service risk consultancy to perform. We have offices in London and Frankfurt, but our head office is based in Greater Manchester. Managing Partner Prosperity Law LLP July 2010  – Present (5 years 2 months) Greater Manchester Prosperity Law LLP provides legal services to both Palladium Associates Plc and Prosperity International Sports Management and we effectively act as the in-house lawyers for both companies. We are however an independent law firm who also carry out commercial legal work in a wider context and have an impressive client list. The firm enjoys high quality high value legal work to include acting for a number of high profile individuals in the region. Prosperity Law LLP prides itself on having a highly dynamic and commercial approach. Managing Partner Prosperity Law LLP July 2010  – Present (5 years 2 months) Greater Manchester Prosperity Law LLP provides legal services to both Palladium Associates Plc and Prosperity International Sports Management and we effectively act as the in-house lawyers for both companies. We are however an independent law firm who also carry out commercial legal work in a wider context and have an impressive client list. The firm enjoys high quality high value legal work to include acting for a number of high profile individuals in the region. Prosperity Law LLP prides itself on having a highly dynamic and commercial approach. Chairman and Legal Director Prosperity International Sports Management July 2009  – Present (6 years 2 months) Greater Manchester Prosperity International Sports Management Limited is a full service sports management agency. We currently represent around 25 professional footballers (to include many players at Premiership clubs) and 10 leading Olympic athletes (many of whom are medal prospects for London 2012). I am the Chairman and Legal Director of the business. Our aim is to provide a professional, high quality service delivered with the upmost integrity. Chairman and Legal Director Prosperity International Sports Management July 2009  – Present (6 years 2 months) Greater Manchester Prosperity International Sports Management Limited is a full service sports management agency. We currently represent around 25 professional footballers (to include many players at Premiership clubs) and 10 leading Olympic athletes (many of whom are medal prospects for London 2012). I am the Chairman and Legal Director of the business. Our aim is to provide a professional, high quality service delivered with the upmost integrity. Legal Director Ultraframe Plc 2000  –  2006  (6 years) Legal Director Ultraframe Plc 2000  –  2006  (6 years) Skills Legal Assistance Skills  Legal Assistance Legal Assistance Legal Assistance Honors & Awards Additional Honors & Awards LLB (Hons), Solicitor. Additional Honors & Awards LLB (Hons), Solicitor. Additional Honors & Awards LLB (Hons), Solicitor. Additional Honors & Awards LLB (Hons), Solicitor. ", "Skills Legal Advice Corporate Law Mergers International Law Legal Services Contract Negotiation Company Secretarial Compliance Energy Joint Ventures Negotiation Intellectual Property Legal Assistance Corporate Governance Commercial Litigation Mergers & Acquisitions Company Secretarial Work Competition Law Contract Law Litigation Restructuring See 6+     See less Skills  Legal Advice Corporate Law Mergers International Law Legal Services Contract Negotiation Company Secretarial Compliance Energy Joint Ventures Negotiation Intellectual Property Legal Assistance Corporate Governance Commercial Litigation Mergers & Acquisitions Company Secretarial Work Competition Law Contract Law Litigation Restructuring See 6+     See less Legal Advice Corporate Law Mergers International Law Legal Services Contract Negotiation Company Secretarial Compliance Energy Joint Ventures Negotiation Intellectual Property Legal Assistance Corporate Governance Commercial Litigation Mergers & Acquisitions Company Secretarial Work Competition Law Contract Law Litigation Restructuring See 6+     See less Legal Advice Corporate Law Mergers International Law Legal Services Contract Negotiation Company Secretarial Compliance Energy Joint Ventures Negotiation Intellectual Property Legal Assistance Corporate Governance Commercial Litigation Mergers & Acquisitions Company Secretarial Work Competition Law Contract Law Litigation Restructuring See 6+     See less ", "Experience Legal Director for Mexico and Lacmass Eli Lilly and Company February 2011  – Present (4 years 7 months) Legal Director for Mexico and Central America Laureate international June 2007  –  October 2010  (3 years 5 months) Legal Director for Mexico and Central America Pfizer January 2004  –  June 2007  (3 years 6 months) Legal Director for Mexico Merck Sharp & Dohme January 1994  –  November 2003  (9 years 11 months) Mexico City. Legal Director for Mexico and Lacmass Eli Lilly and Company February 2011  – Present (4 years 7 months) Legal Director for Mexico and Lacmass Eli Lilly and Company February 2011  – Present (4 years 7 months) Legal Director for Mexico and Central America Laureate international June 2007  –  October 2010  (3 years 5 months) Legal Director for Mexico and Central America Laureate international June 2007  –  October 2010  (3 years 5 months) Legal Director for Mexico and Central America Pfizer January 2004  –  June 2007  (3 years 6 months) Legal Director for Mexico and Central America Pfizer January 2004  –  June 2007  (3 years 6 months) Legal Director for Mexico Merck Sharp & Dohme January 1994  –  November 2003  (9 years 11 months) Mexico City. Legal Director for Mexico Merck Sharp & Dohme January 1994  –  November 2003  (9 years 11 months) Mexico City. Languages English English English Skills Corporate Law,... Pharmaceutical Sales Oncology Regulatory Submissions Corporate Law Licensing Pharmaceutical Industry Regulatory Affairs Intellectual Property Market Access Biotechnology Clinical Trials Skills  Corporate Law,... Pharmaceutical Sales Oncology Regulatory Submissions Corporate Law Licensing Pharmaceutical Industry Regulatory Affairs Intellectual Property Market Access Biotechnology Clinical Trials Corporate Law,... Pharmaceutical Sales Oncology Regulatory Submissions Corporate Law Licensing Pharmaceutical Industry Regulatory Affairs Intellectual Property Market Access Biotechnology Clinical Trials Corporate Law,... Pharmaceutical Sales Oncology Regulatory Submissions Corporate Law Licensing Pharmaceutical Industry Regulatory Affairs Intellectual Property Market Access Biotechnology Clinical Trials Education Universidad Panamericana Corporate & Economic Law,  Speciality 1988  – 1989 Universidad Iberoamericana Bachelor of Laws (LLB),  Law 1983  – 1987 Universidad Panamericana Corporate & Economic Law,  Speciality 1988  – 1989 Universidad Panamericana Corporate & Economic Law,  Speciality 1988  – 1989 Universidad Panamericana Corporate & Economic Law,  Speciality 1988  – 1989 Universidad Iberoamericana Bachelor of Laws (LLB),  Law 1983  – 1987 Universidad Iberoamericana Bachelor of Laws (LLB),  Law 1983  – 1987 Universidad Iberoamericana Bachelor of Laws (LLB),  Law 1983  – 1987 ", "Experience Senior Legal Director International Yahoo April 2014  – Present (1 year 5 months) London, United Kingdom Legal Director International Yahoo! January 2013  –  March 2014  (1 year 3 months) London, United Kingdom Legal Director International Yahoo! January 2012  –  December 2012  (1 year) Rolle, Switzerland Senior Legal Director Yahoo! August 2006  –  December 2011  (5 years 5 months) Burbank, California Temporary assignment to Rolle, Switzerland from April 2011 through December 2011. Legal and Business Affairs DreamWorks Animation October 2000  –  August 2006  (5 years 11 months) Legal & Business Affairs Pop.com 2000  –  2000  (less than a year) Senior Legal Director International Yahoo April 2014  – Present (1 year 5 months) London, United Kingdom Senior Legal Director International Yahoo April 2014  – Present (1 year 5 months) London, United Kingdom Legal Director International Yahoo! January 2013  –  March 2014  (1 year 3 months) London, United Kingdom Legal Director International Yahoo! January 2013  –  March 2014  (1 year 3 months) London, United Kingdom Legal Director International Yahoo! January 2012  –  December 2012  (1 year) Rolle, Switzerland Legal Director International Yahoo! January 2012  –  December 2012  (1 year) Rolle, Switzerland Senior Legal Director Yahoo! August 2006  –  December 2011  (5 years 5 months) Burbank, California Temporary assignment to Rolle, Switzerland from April 2011 through December 2011. Senior Legal Director Yahoo! August 2006  –  December 2011  (5 years 5 months) Burbank, California Temporary assignment to Rolle, Switzerland from April 2011 through December 2011. Legal and Business Affairs DreamWorks Animation October 2000  –  August 2006  (5 years 11 months) Legal and Business Affairs DreamWorks Animation October 2000  –  August 2006  (5 years 11 months) Legal & Business Affairs Pop.com 2000  –  2000  (less than a year) Legal & Business Affairs Pop.com 2000  –  2000  (less than a year) Education Pepperdine University School of Law JD 1995  – 1998 University of Notre Dame BA,  Political Science 1990  – 1994 Phillips Academy 1988  – 1990 TASIS England 1985  – 1988 Pepperdine University School of Law JD 1995  – 1998 Pepperdine University School of Law JD 1995  – 1998 Pepperdine University School of Law JD 1995  – 1998 University of Notre Dame BA,  Political Science 1990  – 1994 University of Notre Dame BA,  Political Science 1990  – 1994 University of Notre Dame BA,  Political Science 1990  – 1994 Phillips Academy 1988  – 1990 Phillips Academy 1988  – 1990 Phillips Academy 1988  – 1990 TASIS England 1985  – 1988 TASIS England 1985  – 1988 TASIS England 1985  – 1988 ", "Experience Legal Director - EMEA Workday February 2012  – Present (3 years 7 months) London, United Kingdom Senior Legal Director - Strategic Projects Travelport April 2009  –  March 2012  (3 years) Thames Valley Dedicated and professional Senior Legal Director with 10 years’ PQE. General commercial lawyer with IT bias, both contentious and non-contentious work in a truly international environment. Team management and leadership. Senior Legal Director - EMEA Travelport April 2007  –  March 2009  (2 years) Legal Director - EMEA Travelport August 2006  –  March 2007  (8 months) Senior Counsel Cendant Corporation October 2001  –  August 2006  (4 years 11 months) Legal Counsel Galileo International May 2001  –  October 2001  (6 months) Assistant Solicitor Copley Clark & Bennett Solicitors June 2000  –  May 2001  (1 year) Trainee Solicitor Bower & Bailey September 1998  –  June 2000  (1 year 10 months) Legal Director - EMEA Workday February 2012  – Present (3 years 7 months) London, United Kingdom Legal Director - EMEA Workday February 2012  – Present (3 years 7 months) London, United Kingdom Senior Legal Director - Strategic Projects Travelport April 2009  –  March 2012  (3 years) Thames Valley Dedicated and professional Senior Legal Director with 10 years’ PQE. General commercial lawyer with IT bias, both contentious and non-contentious work in a truly international environment. Team management and leadership. Senior Legal Director - Strategic Projects Travelport April 2009  –  March 2012  (3 years) Thames Valley Dedicated and professional Senior Legal Director with 10 years’ PQE. General commercial lawyer with IT bias, both contentious and non-contentious work in a truly international environment. Team management and leadership. Senior Legal Director - EMEA Travelport April 2007  –  March 2009  (2 years) Senior Legal Director - EMEA Travelport April 2007  –  March 2009  (2 years) Legal Director - EMEA Travelport August 2006  –  March 2007  (8 months) Legal Director - EMEA Travelport August 2006  –  March 2007  (8 months) Senior Counsel Cendant Corporation October 2001  –  August 2006  (4 years 11 months) Senior Counsel Cendant Corporation October 2001  –  August 2006  (4 years 11 months) Legal Counsel Galileo International May 2001  –  October 2001  (6 months) Legal Counsel Galileo International May 2001  –  October 2001  (6 months) Assistant Solicitor Copley Clark & Bennett Solicitors June 2000  –  May 2001  (1 year) Assistant Solicitor Copley Clark & Bennett Solicitors June 2000  –  May 2001  (1 year) Trainee Solicitor Bower & Bailey September 1998  –  June 2000  (1 year 10 months) Trainee Solicitor Bower & Bailey September 1998  –  June 2000  (1 year 10 months) Education College of Law LPC 1997  – 1998 College of Law CPE 1996  – 1997 Royal Holloway, University of London 2(i),  Modern History ,  Politics and Economic History 1993  – 1996 St Austell Sixth Form & Mid Cornwall College 1989  – 1991 Looe Secondary School 1984  – 1989 College of Law LPC 1997  – 1998 College of Law LPC 1997  – 1998 College of Law LPC 1997  – 1998 College of Law CPE 1996  – 1997 College of Law CPE 1996  – 1997 College of Law CPE 1996  – 1997 Royal Holloway, University of London 2(i),  Modern History ,  Politics and Economic History 1993  – 1996 Royal Holloway, University of London 2(i),  Modern History ,  Politics and Economic History 1993  – 1996 Royal Holloway, University of London 2(i),  Modern History ,  Politics and Economic History 1993  – 1996 St Austell Sixth Form & Mid Cornwall College 1989  – 1991 St Austell Sixth Form & Mid Cornwall College 1989  – 1991 St Austell Sixth Form & Mid Cornwall College 1989  – 1991 Looe Secondary School 1984  – 1989 Looe Secondary School 1984  – 1989 Looe Secondary School 1984  – 1989 ", "Skills Licensing Contract Negotiation Digital Media Intellectual Property Mergers Video Games Employment Law Advertising Marketing Dispute Resolution Mergers & Acquisitions Corporate Law Digital Distribution Corporate Governance Privacy Law Online Gaming Social Games Venture Capital Mobile Games Interactive... Legal Liability Legal Issues Legal Advice Entertainment Law Legal IT law Legal Assistance Copyright Law See 13+     See less Skills  Licensing Contract Negotiation Digital Media Intellectual Property Mergers Video Games Employment Law Advertising Marketing Dispute Resolution Mergers & Acquisitions Corporate Law Digital Distribution Corporate Governance Privacy Law Online Gaming Social Games Venture Capital Mobile Games Interactive... Legal Liability Legal Issues Legal Advice Entertainment Law Legal IT law Legal Assistance Copyright Law See 13+     See less Licensing Contract Negotiation Digital Media Intellectual Property Mergers Video Games Employment Law Advertising Marketing Dispute Resolution Mergers & Acquisitions Corporate Law Digital Distribution Corporate Governance Privacy Law Online Gaming Social Games Venture Capital Mobile Games Interactive... Legal Liability Legal Issues Legal Advice Entertainment Law Legal IT law Legal Assistance Copyright Law See 13+     See less Licensing Contract Negotiation Digital Media Intellectual Property Mergers Video Games Employment Law Advertising Marketing Dispute Resolution Mergers & Acquisitions Corporate Law Digital Distribution Corporate Governance Privacy Law Online Gaming Social Games Venture Capital Mobile Games Interactive... Legal Liability Legal Issues Legal Advice Entertainment Law Legal IT law Legal Assistance Copyright Law See 13+     See less ", "Summary Mitch is a Legal Director in the Intellectual Property (IP) Group at Hewlett-Packard Company (HP). He manages the team of HP IP Transaction attorneys that provides legal support for HP Labs (the advanced research and development arm of HP); HP Cloud Services; patents sales and acquisitions; and patent, technology and standards licensing at HP. Mitch is also the senior Company lawyer supporting HP Labs for research collaborations with the U.S. Government and universities and research institutions worldwide. \n \nPrior to joining HP, for more than 10 years at Sun Microsystems, Mitch served as lawyer for 3 Executive Vice Presidents, supporting Sun's Chief Technology Officer (Sun Labs and advanced R&D organizations), Sun's largest hardware product group (strategic transactions and development/release of new products), and Worldwide Operations (manufacturing and supply chain operations for server and storage products). \n \nPrior to joining Sun, Mitch was in private practice for 20 years in Washington, DC and the Bay Area, serving as a partner in 2 major law firms. Mitch provided litigation and counseling services to companies engaged in aerospace, computer hardware/software, telecommunications, and electronics on complex government contracts with U.S. military and civilian agencies. Specialties:Technology licensing, intellectual property law, government contracts, manufacturing and supply chain matters, R&D contracting, regulatory compliance, export controls. Summary Mitch is a Legal Director in the Intellectual Property (IP) Group at Hewlett-Packard Company (HP). He manages the team of HP IP Transaction attorneys that provides legal support for HP Labs (the advanced research and development arm of HP); HP Cloud Services; patents sales and acquisitions; and patent, technology and standards licensing at HP. Mitch is also the senior Company lawyer supporting HP Labs for research collaborations with the U.S. Government and universities and research institutions worldwide. \n \nPrior to joining HP, for more than 10 years at Sun Microsystems, Mitch served as lawyer for 3 Executive Vice Presidents, supporting Sun's Chief Technology Officer (Sun Labs and advanced R&D organizations), Sun's largest hardware product group (strategic transactions and development/release of new products), and Worldwide Operations (manufacturing and supply chain operations for server and storage products). \n \nPrior to joining Sun, Mitch was in private practice for 20 years in Washington, DC and the Bay Area, serving as a partner in 2 major law firms. Mitch provided litigation and counseling services to companies engaged in aerospace, computer hardware/software, telecommunications, and electronics on complex government contracts with U.S. military and civilian agencies. Specialties:Technology licensing, intellectual property law, government contracts, manufacturing and supply chain matters, R&D contracting, regulatory compliance, export controls. Mitch is a Legal Director in the Intellectual Property (IP) Group at Hewlett-Packard Company (HP). He manages the team of HP IP Transaction attorneys that provides legal support for HP Labs (the advanced research and development arm of HP); HP Cloud Services; patents sales and acquisitions; and patent, technology and standards licensing at HP. Mitch is also the senior Company lawyer supporting HP Labs for research collaborations with the U.S. Government and universities and research institutions worldwide. \n \nPrior to joining HP, for more than 10 years at Sun Microsystems, Mitch served as lawyer for 3 Executive Vice Presidents, supporting Sun's Chief Technology Officer (Sun Labs and advanced R&D organizations), Sun's largest hardware product group (strategic transactions and development/release of new products), and Worldwide Operations (manufacturing and supply chain operations for server and storage products). \n \nPrior to joining Sun, Mitch was in private practice for 20 years in Washington, DC and the Bay Area, serving as a partner in 2 major law firms. Mitch provided litigation and counseling services to companies engaged in aerospace, computer hardware/software, telecommunications, and electronics on complex government contracts with U.S. military and civilian agencies. Specialties:Technology licensing, intellectual property law, government contracts, manufacturing and supply chain matters, R&D contracting, regulatory compliance, export controls. Mitch is a Legal Director in the Intellectual Property (IP) Group at Hewlett-Packard Company (HP). He manages the team of HP IP Transaction attorneys that provides legal support for HP Labs (the advanced research and development arm of HP); HP Cloud Services; patents sales and acquisitions; and patent, technology and standards licensing at HP. Mitch is also the senior Company lawyer supporting HP Labs for research collaborations with the U.S. Government and universities and research institutions worldwide. \n \nPrior to joining HP, for more than 10 years at Sun Microsystems, Mitch served as lawyer for 3 Executive Vice Presidents, supporting Sun's Chief Technology Officer (Sun Labs and advanced R&D organizations), Sun's largest hardware product group (strategic transactions and development/release of new products), and Worldwide Operations (manufacturing and supply chain operations for server and storage products). \n \nPrior to joining Sun, Mitch was in private practice for 20 years in Washington, DC and the Bay Area, serving as a partner in 2 major law firms. Mitch provided litigation and counseling services to companies engaged in aerospace, computer hardware/software, telecommunications, and electronics on complex government contracts with U.S. military and civilian agencies. Specialties:Technology licensing, intellectual property law, government contracts, manufacturing and supply chain matters, R&D contracting, regulatory compliance, export controls. Experience Legal Director, Intellectual Property Group Hewlett-Packard March 2011  – Present (4 years 6 months) Managing the team of IP transaction attorneys at HP that provides legal support for HP Labs; Cloud Services; patent acquisitions and sales; and patent, technology, and standards licensing.  \n \nSenior lawyer supporting HP Labs. Legal Director, Worldwide Operations and Global Business Services; Associate General Counsel Sun Microsystems September 2005  –  June 2010  (4 years 10 months) Lawyer for Executive VP and Senior VP for Worldwide Operations. Responsible for all legal activities of multi-billion dollar organization that directs global procurement, manufacturing and supply chain operations, and delivery of Sun server and storage products. Member of Products & Technology Law Management Group that supervised more than 40 attorneys. Legal Director, Chief Technology Office and Associate General Counsel Sun Microsystems September 2002  –  September 2005  (3 years 1 month) Lawyer for Executive VP and Chief Technology Officer of Sun. Chief counsel for advanced R&D organizations at Sun, including Sun Labs (East Coast, West Coast and Europe) and Sun's High Productivity Computing Systems Program for the U.S. Defense Advanced Research Projects Agency. Assistant General Counsel Sun Microsystems March 1999  –  September 2002  (3 years 7 months) Lawyer for Executive VP, Volume Systems Products. Member of executive staff for largest hardware product group at Sun. Responsible for all legal activities of multi-billion dollar business unit, including negotiation of strategic transactions and release of new server and storage products. Of Counsel Seyfarth Shaw - San Francisco September 1993  –  February 1999  (5 years 6 months) Provided counseling and litigation services to high tech companies for contracts and complex business transactions. Represented corporations engaged in computer hardware/software, semiconductor manufacturing, telecommunications, aerospace and electronics. Lead counsel in successful U.S. 9th Circuit case. Partner Minutillo & Segal (formerly Minutillo & Gorman) - San Jose October 1990  –  August 1993  (2 years 11 months) Litigated contract claims for companies engaged in computer technology and electronics. Counseled corporations on negotiation of contracts, contract terminations, export compliance, trade secrets, and technology transfer issues relating to foreign acquisition of U.S. manufacturing facilities. Partner Piper & Marbury (now DLA Piper) - Washington, DC June 1988  –  September 1990  (2 years 4 months) Practiced government and commercial contract law. Litigated contract claims for high tech companies in disputes with U.S. military and civilian agencies. Represented national trade association before General Services Administration. Counseled corporations on satellite launch contracts with NASA under Space Shuttle Program. Partner Pierson, Ball & Dowd (now Reed Smith) - Washington, DC May 1982  –  May 1988  (6 years 1 month) Practiced government and commercial contract law, including litigation before federal agency boards of contract appeals and the General Accounting Office, and arbitration before the International Chamber of Commerce. Legal Director, Intellectual Property Group Hewlett-Packard March 2011  – Present (4 years 6 months) Managing the team of IP transaction attorneys at HP that provides legal support for HP Labs; Cloud Services; patent acquisitions and sales; and patent, technology, and standards licensing.  \n \nSenior lawyer supporting HP Labs. Legal Director, Intellectual Property Group Hewlett-Packard March 2011  – Present (4 years 6 months) Managing the team of IP transaction attorneys at HP that provides legal support for HP Labs; Cloud Services; patent acquisitions and sales; and patent, technology, and standards licensing.  \n \nSenior lawyer supporting HP Labs. Legal Director, Worldwide Operations and Global Business Services; Associate General Counsel Sun Microsystems September 2005  –  June 2010  (4 years 10 months) Lawyer for Executive VP and Senior VP for Worldwide Operations. Responsible for all legal activities of multi-billion dollar organization that directs global procurement, manufacturing and supply chain operations, and delivery of Sun server and storage products. Member of Products & Technology Law Management Group that supervised more than 40 attorneys. Legal Director, Worldwide Operations and Global Business Services; Associate General Counsel Sun Microsystems September 2005  –  June 2010  (4 years 10 months) Lawyer for Executive VP and Senior VP for Worldwide Operations. Responsible for all legal activities of multi-billion dollar organization that directs global procurement, manufacturing and supply chain operations, and delivery of Sun server and storage products. Member of Products & Technology Law Management Group that supervised more than 40 attorneys. Legal Director, Chief Technology Office and Associate General Counsel Sun Microsystems September 2002  –  September 2005  (3 years 1 month) Lawyer for Executive VP and Chief Technology Officer of Sun. Chief counsel for advanced R&D organizations at Sun, including Sun Labs (East Coast, West Coast and Europe) and Sun's High Productivity Computing Systems Program for the U.S. Defense Advanced Research Projects Agency. Legal Director, Chief Technology Office and Associate General Counsel Sun Microsystems September 2002  –  September 2005  (3 years 1 month) Lawyer for Executive VP and Chief Technology Officer of Sun. Chief counsel for advanced R&D organizations at Sun, including Sun Labs (East Coast, West Coast and Europe) and Sun's High Productivity Computing Systems Program for the U.S. Defense Advanced Research Projects Agency. Assistant General Counsel Sun Microsystems March 1999  –  September 2002  (3 years 7 months) Lawyer for Executive VP, Volume Systems Products. Member of executive staff for largest hardware product group at Sun. Responsible for all legal activities of multi-billion dollar business unit, including negotiation of strategic transactions and release of new server and storage products. Assistant General Counsel Sun Microsystems March 1999  –  September 2002  (3 years 7 months) Lawyer for Executive VP, Volume Systems Products. Member of executive staff for largest hardware product group at Sun. Responsible for all legal activities of multi-billion dollar business unit, including negotiation of strategic transactions and release of new server and storage products. Of Counsel Seyfarth Shaw - San Francisco September 1993  –  February 1999  (5 years 6 months) Provided counseling and litigation services to high tech companies for contracts and complex business transactions. Represented corporations engaged in computer hardware/software, semiconductor manufacturing, telecommunications, aerospace and electronics. Lead counsel in successful U.S. 9th Circuit case. Of Counsel Seyfarth Shaw - San Francisco September 1993  –  February 1999  (5 years 6 months) Provided counseling and litigation services to high tech companies for contracts and complex business transactions. Represented corporations engaged in computer hardware/software, semiconductor manufacturing, telecommunications, aerospace and electronics. Lead counsel in successful U.S. 9th Circuit case. Partner Minutillo & Segal (formerly Minutillo & Gorman) - San Jose October 1990  –  August 1993  (2 years 11 months) Litigated contract claims for companies engaged in computer technology and electronics. Counseled corporations on negotiation of contracts, contract terminations, export compliance, trade secrets, and technology transfer issues relating to foreign acquisition of U.S. manufacturing facilities. Partner Minutillo & Segal (formerly Minutillo & Gorman) - San Jose October 1990  –  August 1993  (2 years 11 months) Litigated contract claims for companies engaged in computer technology and electronics. Counseled corporations on negotiation of contracts, contract terminations, export compliance, trade secrets, and technology transfer issues relating to foreign acquisition of U.S. manufacturing facilities. Partner Piper & Marbury (now DLA Piper) - Washington, DC June 1988  –  September 1990  (2 years 4 months) Practiced government and commercial contract law. Litigated contract claims for high tech companies in disputes with U.S. military and civilian agencies. Represented national trade association before General Services Administration. Counseled corporations on satellite launch contracts with NASA under Space Shuttle Program. Partner Piper & Marbury (now DLA Piper) - Washington, DC June 1988  –  September 1990  (2 years 4 months) Practiced government and commercial contract law. Litigated contract claims for high tech companies in disputes with U.S. military and civilian agencies. Represented national trade association before General Services Administration. Counseled corporations on satellite launch contracts with NASA under Space Shuttle Program. Partner Pierson, Ball & Dowd (now Reed Smith) - Washington, DC May 1982  –  May 1988  (6 years 1 month) Practiced government and commercial contract law, including litigation before federal agency boards of contract appeals and the General Accounting Office, and arbitration before the International Chamber of Commerce. Partner Pierson, Ball & Dowd (now Reed Smith) - Washington, DC May 1982  –  May 1988  (6 years 1 month) Practiced government and commercial contract law, including litigation before federal agency boards of contract appeals and the General Accounting Office, and arbitration before the International Chamber of Commerce. Education University of Virginia School of Law JD,  Law 1975  – 1978 Yale University BA, magna cum laude,  History (with honors) 1971  – 1975 University of Virginia School of Law JD,  Law 1975  – 1978 University of Virginia School of Law JD,  Law 1975  – 1978 University of Virginia School of Law JD,  Law 1975  – 1978 Yale University BA, magna cum laude,  History (with honors) 1971  – 1975 Yale University BA, magna cum laude,  History (with honors) 1971  – 1975 Yale University BA, magna cum laude,  History (with honors) 1971  – 1975 ", "Experience Legal Director and Company Secretary GloHealth July 2012  – Present (3 years 2 months) Dublin Legal Director - COO Insurance Regulatory Capital 2011  – Present (4 years) Managing Director TKO Consulting Ltd May 2009  –  June 2013  (4 years 2 months) Legal consultancy services in compliance, insurance regulation, competition law and lobby strategies. Guest lecturer on Insurance Regulation - University College Dublin. Head of Legal - Aviva Health Aviva Ireland 2008  –  2010  (2 years) Legal Director VIVAS Health 2003  –  2008  (5 years) Legal Adviser The Pensions Board 2001  –  2003  (2 years) Judicial Resercher - Legal Clerk Courts Service 2000  –  2001  (1 year) Legal Researcher Office of the Attorney General - Ireland May 1999  –  October 1999  (6 months) Traineeship Freshfields September 1998  –  January 1999  (5 months) Madrid Office Legal Director and Company Secretary GloHealth July 2012  – Present (3 years 2 months) Dublin Legal Director and Company Secretary GloHealth July 2012  – Present (3 years 2 months) Dublin Legal Director - COO Insurance Regulatory Capital 2011  – Present (4 years) Legal Director - COO Insurance Regulatory Capital 2011  – Present (4 years) Managing Director TKO Consulting Ltd May 2009  –  June 2013  (4 years 2 months) Legal consultancy services in compliance, insurance regulation, competition law and lobby strategies. Guest lecturer on Insurance Regulation - University College Dublin. Managing Director TKO Consulting Ltd May 2009  –  June 2013  (4 years 2 months) Legal consultancy services in compliance, insurance regulation, competition law and lobby strategies. Guest lecturer on Insurance Regulation - University College Dublin. Head of Legal - Aviva Health Aviva Ireland 2008  –  2010  (2 years) Head of Legal - Aviva Health Aviva Ireland 2008  –  2010  (2 years) Legal Director VIVAS Health 2003  –  2008  (5 years) Legal Director VIVAS Health 2003  –  2008  (5 years) Legal Adviser The Pensions Board 2001  –  2003  (2 years) Legal Adviser The Pensions Board 2001  –  2003  (2 years) Judicial Resercher - Legal Clerk Courts Service 2000  –  2001  (1 year) Judicial Resercher - Legal Clerk Courts Service 2000  –  2001  (1 year) Legal Researcher Office of the Attorney General - Ireland May 1999  –  October 1999  (6 months) Legal Researcher Office of the Attorney General - Ireland May 1999  –  October 1999  (6 months) Traineeship Freshfields September 1998  –  January 1999  (5 months) Madrid Office Traineeship Freshfields September 1998  –  January 1999  (5 months) Madrid Office Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Legal Assistance Competition Law Insurance Law Dispute Resolution Corporate Law Legal Advice Commercial Litigation Insurance Insurance Regulatory Corporate Governance Litigation Legal Research Skills  Legal Assistance Competition Law Insurance Law Dispute Resolution Corporate Law Legal Advice Commercial Litigation Insurance Insurance Regulatory Corporate Governance Litigation Legal Research Legal Assistance Competition Law Insurance Law Dispute Resolution Corporate Law Legal Advice Commercial Litigation Insurance Insurance Regulatory Corporate Governance Litigation Legal Research Legal Assistance Competition Law Insurance Law Dispute Resolution Corporate Law Legal Advice Commercial Litigation Insurance Insurance Regulatory Corporate Governance Litigation Legal Research Education The Honourable Society of the King's Inns Barrister-at-Law 1999  – 2001 Universidad Carlos III de Madrid Master in European Union Law 1997  – 1998 University College Dublin Bachelor of Civil Law and European Studies,  Law 1993  – 1997 Teresian Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca The Honourable Society of the King's Inns Barrister-at-Law 1999  – 2001 The Honourable Society of the King's Inns Barrister-at-Law 1999  – 2001 The Honourable Society of the King's Inns Barrister-at-Law 1999  – 2001 Universidad Carlos III de Madrid Master in European Union Law 1997  – 1998 Universidad Carlos III de Madrid Master in European Union Law 1997  – 1998 Universidad Carlos III de Madrid Master in European Union Law 1997  – 1998 University College Dublin Bachelor of Civil Law and European Studies,  Law 1993  – 1997 University College Dublin Bachelor of Civil Law and European Studies,  Law 1993  – 1997 University College Dublin Bachelor of Civil Law and European Studies,  Law 1993  – 1997 Teresian Teresian Teresian Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Universidad de Salamanca Honors & Awards Short-Listed in category for Business Woman of the Year - Image Magazine Image Magazine November 2014 Shortlist in the category of Senior Management in the Image Magazine Business Woman of the Year.  Short-Listed in category for Business Woman of the Year - Image Magazine Image Magazine November 2014 Shortlist in the category of Senior Management in the Image Magazine Business Woman of the Year.  Short-Listed in category for Business Woman of the Year - Image Magazine Image Magazine November 2014 Shortlist in the category of Senior Management in the Image Magazine Business Woman of the Year.  Short-Listed in category for Business Woman of the Year - Image Magazine Image Magazine November 2014 Shortlist in the category of Senior Management in the Image Magazine Business Woman of the Year.  ", "Experience Senior Counsel, Legal Director Clean Air Task Force Legal Director Clean Air Task Force 2006  –  2015  (9 years) CATF Legal Director EPA Clean Air Act Advisory Committee 2010  –  2014  (4 years) CATF Legal Director EPA Clean Air Act Advisory Committee 2010  –  2014  (4 years) Associate Conservation Law Foundation 1994  –  1996  (2 years) Associate Attorney Dickstein Shapiro LLP 1993  –  1994  (1 year) and Summer Associate 1992 Assistant Director Long Range Planning City County Planning Department, Durham North Carolina 1988  –  1990  (2 years) Senior Planning -- Long Range Planning Carrboro Planning Department, North Carolina 1987  –  1988  (1 year) Associate Cambridge Systematics 1983  –  1987  (4 years) Senior Counsel, Legal Director Clean Air Task Force Senior Counsel, Legal Director Clean Air Task Force Legal Director Clean Air Task Force 2006  –  2015  (9 years) Legal Director Clean Air Task Force 2006  –  2015  (9 years) CATF Legal Director EPA Clean Air Act Advisory Committee 2010  –  2014  (4 years) CATF Legal Director EPA Clean Air Act Advisory Committee 2010  –  2014  (4 years) CATF Legal Director EPA Clean Air Act Advisory Committee 2010  –  2014  (4 years) CATF Legal Director EPA Clean Air Act Advisory Committee 2010  –  2014  (4 years) Associate Conservation Law Foundation 1994  –  1996  (2 years) Associate Conservation Law Foundation 1994  –  1996  (2 years) Associate Attorney Dickstein Shapiro LLP 1993  –  1994  (1 year) and Summer Associate 1992 Associate Attorney Dickstein Shapiro LLP 1993  –  1994  (1 year) and Summer Associate 1992 Assistant Director Long Range Planning City County Planning Department, Durham North Carolina 1988  –  1990  (2 years) Assistant Director Long Range Planning City County Planning Department, Durham North Carolina 1988  –  1990  (2 years) Senior Planning -- Long Range Planning Carrboro Planning Department, North Carolina 1987  –  1988  (1 year) Senior Planning -- Long Range Planning Carrboro Planning Department, North Carolina 1987  –  1988  (1 year) Associate Cambridge Systematics 1983  –  1987  (4 years) Associate Cambridge Systematics 1983  –  1987  (4 years) Skills Legal Advice Advocacy Litigation Management Legal Writing Litigation Civil Litigation Legal Research Public Policy Administrative Law Energy Policy Environmental Law Environmental Policy Renewable Energy Energy Climate Change Sustainable Energy Legislation Legislative Relations Policy Analysis Government See 5+     See less Skills  Legal Advice Advocacy Litigation Management Legal Writing Litigation Civil Litigation Legal Research Public Policy Administrative Law Energy Policy Environmental Law Environmental Policy Renewable Energy Energy Climate Change Sustainable Energy Legislation Legislative Relations Policy Analysis Government See 5+     See less Legal Advice Advocacy Litigation Management Legal Writing Litigation Civil Litigation Legal Research Public Policy Administrative Law Energy Policy Environmental Law Environmental Policy Renewable Energy Energy Climate Change Sustainable Energy Legislation Legislative Relations Policy Analysis Government See 5+     See less Legal Advice Advocacy Litigation Management Legal Writing Litigation Civil Litigation Legal Research Public Policy Administrative Law Energy Policy Environmental Law Environmental Policy Renewable Energy Energy Climate Change Sustainable Energy Legislation Legislative Relations Policy Analysis Government See 5+     See less Education University of North Carolina at Chapel Hill School of Law JD 1990  – 1993 Massachusetts Institute of Technology SM,  Technology and Policy, Ocean Systems Management 1980  – 1982 Boston University BS,  Engineering 1976  – 1980 University of North Carolina at Chapel Hill School of Law JD 1990  – 1993 University of North Carolina at Chapel Hill School of Law JD 1990  – 1993 University of North Carolina at Chapel Hill School of Law JD 1990  – 1993 Massachusetts Institute of Technology SM,  Technology and Policy, Ocean Systems Management 1980  – 1982 Massachusetts Institute of Technology SM,  Technology and Policy, Ocean Systems Management 1980  – 1982 Massachusetts Institute of Technology SM,  Technology and Policy, Ocean Systems Management 1980  – 1982 Boston University BS,  Engineering 1976  – 1980 Boston University BS,  Engineering 1976  – 1980 Boston University BS,  Engineering 1976  – 1980 ", "Experience Executive Director - Policy, Equity & Public Affairs The Law Society of Upper Canada January 2014  – Present (1 year 8 months) 130 Queen St West, Toronto 416-947-3431 \nGwedge@lsuc.on.ca Legal Director, Ministry of Aboriginal Affairs Province of ontario 2006  – Present (9 years) Legal Director Government of Ontario December 2006  –  January 2014  (7 years 2 months) Managing a team of 10 counsel in a high pressure environment providing advice to the Ministry and the Government at large re: Aboriginal issues. Legal Director, Ministry of Aboriginal Affairs Ministry of Aboriginal Affairs December 2006  –  January 2014  (7 years 2 months) Legal Director, Aboriginal Affairs Ministry of the Attorney General December 2006  –  January 2014  (7 years 2 months) Associate Executive Director Aboriginal Business Canada, Industry Canada 1996  –  1998  (2 years) Managed direct reports in Innovation, Communications and Operations. Deputy Minister, Native Affairs Government of Ontario 1994  –  1995  (1 year) Managed the Secretariat for Native Affairs Executive Director - Policy, Equity & Public Affairs The Law Society of Upper Canada January 2014  – Present (1 year 8 months) 130 Queen St West, Toronto 416-947-3431 \nGwedge@lsuc.on.ca Executive Director - Policy, Equity & Public Affairs The Law Society of Upper Canada January 2014  – Present (1 year 8 months) 130 Queen St West, Toronto 416-947-3431 \nGwedge@lsuc.on.ca Legal Director, Ministry of Aboriginal Affairs Province of ontario 2006  – Present (9 years) Legal Director, Ministry of Aboriginal Affairs Province of ontario 2006  – Present (9 years) Legal Director Government of Ontario December 2006  –  January 2014  (7 years 2 months) Managing a team of 10 counsel in a high pressure environment providing advice to the Ministry and the Government at large re: Aboriginal issues. Legal Director Government of Ontario December 2006  –  January 2014  (7 years 2 months) Managing a team of 10 counsel in a high pressure environment providing advice to the Ministry and the Government at large re: Aboriginal issues. Legal Director, Ministry of Aboriginal Affairs Ministry of Aboriginal Affairs December 2006  –  January 2014  (7 years 2 months) Legal Director, Ministry of Aboriginal Affairs Ministry of Aboriginal Affairs December 2006  –  January 2014  (7 years 2 months) Legal Director, Aboriginal Affairs Ministry of the Attorney General December 2006  –  January 2014  (7 years 2 months) Legal Director, Aboriginal Affairs Ministry of the Attorney General December 2006  –  January 2014  (7 years 2 months) Associate Executive Director Aboriginal Business Canada, Industry Canada 1996  –  1998  (2 years) Managed direct reports in Innovation, Communications and Operations. Associate Executive Director Aboriginal Business Canada, Industry Canada 1996  –  1998  (2 years) Managed direct reports in Innovation, Communications and Operations. Deputy Minister, Native Affairs Government of Ontario 1994  –  1995  (1 year) Managed the Secretariat for Native Affairs Deputy Minister, Native Affairs Government of Ontario 1994  –  1995  (1 year) Managed the Secretariat for Native Affairs Languages Spanish German Spanish German Spanish German Skills Aboriginal Affairs Public Policy Policy Analysis Administrative Law Policy Government Mediation Legal Research Legal Writing Alternative Dispute... Legal Advice Legislation Litigation Governance Privacy Law Human Rights Dispute Resolution Employment Law Politics See 4+     See less Skills  Aboriginal Affairs Public Policy Policy Analysis Administrative Law Policy Government Mediation Legal Research Legal Writing Alternative Dispute... Legal Advice Legislation Litigation Governance Privacy Law Human Rights Dispute Resolution Employment Law Politics See 4+     See less Aboriginal Affairs Public Policy Policy Analysis Administrative Law Policy Government Mediation Legal Research Legal Writing Alternative Dispute... Legal Advice Legislation Litigation Governance Privacy Law Human Rights Dispute Resolution Employment Law Politics See 4+     See less Aboriginal Affairs Public Policy Policy Analysis Administrative Law Policy Government Mediation Legal Research Legal Writing Alternative Dispute... Legal Advice Legislation Litigation Governance Privacy Law Human Rights Dispute Resolution Employment Law Politics See 4+     See less Education University of Toronto Faculty of Law Bachelor of Laws (LL.B.),  Banking , Corporate, Finance, and Securities Law 1983  – 1986 York University, School for Social and Political Thought Master's degree,  Canadian Political Economy 1976  – 1977 University of Toronto Faculty of Law Bachelor of Laws (LL.B.),  Banking , Corporate, Finance, and Securities Law 1983  – 1986 University of Toronto Faculty of Law Bachelor of Laws (LL.B.),  Banking , Corporate, Finance, and Securities Law 1983  – 1986 University of Toronto Faculty of Law Bachelor of Laws (LL.B.),  Banking , Corporate, Finance, and Securities Law 1983  – 1986 York University, School for Social and Political Thought Master's degree,  Canadian Political Economy 1976  – 1977 York University, School for Social and Political Thought Master's degree,  Canadian Political Economy 1976  – 1977 York University, School for Social and Political Thought Master's degree,  Canadian Political Economy 1976  – 1977 ", "Summary I am a legal Director / General Counsel with over 20 years' experience in an international law firm as well as in fast moving companies manufacturing and distributing consumer products and services with renown trademarks and know-how. \n \nInterest for each business and skill, experience working with very different people in different countries, are essential to give valuable contributions on most legal matters to my clients and Management Board. \n \nMy focus is finding and improving solutions both from legal and business viewpoints and managing the risk. \n \nSpecialties: Legal Services Management • Contracts Negotiation • Corporate Organization • Management Board • M&A • International Business Development • Brands management • Sales & Marketing projects • Customers and Suppliers relations • Competition • Intellectual Property • Litigation • Compliance Summary I am a legal Director / General Counsel with over 20 years' experience in an international law firm as well as in fast moving companies manufacturing and distributing consumer products and services with renown trademarks and know-how. \n \nInterest for each business and skill, experience working with very different people in different countries, are essential to give valuable contributions on most legal matters to my clients and Management Board. \n \nMy focus is finding and improving solutions both from legal and business viewpoints and managing the risk. \n \nSpecialties: Legal Services Management • Contracts Negotiation • Corporate Organization • Management Board • M&A • International Business Development • Brands management • Sales & Marketing projects • Customers and Suppliers relations • Competition • Intellectual Property • Litigation • Compliance I am a legal Director / General Counsel with over 20 years' experience in an international law firm as well as in fast moving companies manufacturing and distributing consumer products and services with renown trademarks and know-how. \n \nInterest for each business and skill, experience working with very different people in different countries, are essential to give valuable contributions on most legal matters to my clients and Management Board. \n \nMy focus is finding and improving solutions both from legal and business viewpoints and managing the risk. \n \nSpecialties: Legal Services Management • Contracts Negotiation • Corporate Organization • Management Board • M&A • International Business Development • Brands management • Sales & Marketing projects • Customers and Suppliers relations • Competition • Intellectual Property • Litigation • Compliance I am a legal Director / General Counsel with over 20 years' experience in an international law firm as well as in fast moving companies manufacturing and distributing consumer products and services with renown trademarks and know-how. \n \nInterest for each business and skill, experience working with very different people in different countries, are essential to give valuable contributions on most legal matters to my clients and Management Board. \n \nMy focus is finding and improving solutions both from legal and business viewpoints and managing the risk. \n \nSpecialties: Legal Services Management • Contracts Negotiation • Corporate Organization • Management Board • M&A • International Business Development • Brands management • Sales & Marketing projects • Customers and Suppliers relations • Competition • Intellectual Property • Litigation • Compliance Experience General Counsel - Compliance Officer カンパニー　セクレタリー 内部統制プロジェクトリーダー PILOT CORPORATION OF EUROPE 2014  – Present (1 year) Annecy - Paris Managing Legal Services, Risk, Compliance and Internal control \n \nWorld’s number 2 brand in quality writing instruments including Pilot and Namiki  \nhttp://www.pilotpen.eu/en/ Legal Director ETM Management 2012  – Present (3 years) Special advisory inhouse assignments in particular for developing companies such as e-TRACS - Interactive Geolocalisation: adding value securing the offer and the contracts, personal data processing \nManaging special projects (eg. marketing, commercial, corporate, compliance) auditing and managing risks, negotiating contracts and settlements \nImproving legal performance, costs, setting up processes and KPIs  \n \nTeaching seminars on Management of Legal Departments to senior inhouse Lawyers, writing articles in professional publications in management and compliance Legal Director DBApparel (Dim Brands Apparel) 2008  –  2011  (3 years) Rueil-Malmaison Group Legal Director, managing a team of 5 people, advising general management, international Business Units (France, UK, Italy, Spain, Germany, Russia, South Africa, Export and International) Operations Central and Support services \n \nMain activities include: corporate organization (60 cos worldwide) M&A, contracts, litigation, arbitration, marketing and consumer law, distribution, competition, intellectual property \n \nDBApparel owns leading intimates, underwear and hosiery brands such as DIM, PLAYTEX, WONDERBRA, CHANTAL THOMASS, SHOCK ABSORBER, FILA, LOVABLE, UNNO, NUR DIE, ABANDERADO.  \nThe Group designs, develops, sources or manufactures, commercializes its products mainly in Europe, Eastern Europe, Russia and South Africa. It is developing in Asia and the Middle East. . Products are sold through traditional trade channels (department stores, retailers, wholesalers, and mail order) as well as specialized chain stores and mass market retailers... \n \nSales approx. 900 M€ ; Employees approx. 8.000 \nGroup is based in Rueil-Malmaison 92 (Paris) Legal Director Cauval Industries 1994  –  2008  (14 years) Lognes (Paris Area) Group legal Director managing a team of 5 people, advising General management, the heads of the Operational Divisions and factory management \n \nCauval Industries is a European leader in the field of furniture, manufacturing and commercializing mainly seats, sofas and bedding with brands such as SIMMONS, DUNLOPILLO, TRECA, STEINER-PARIS \nSales approx. 650 M€, Employees : 5.000 Advocate - Legal Advisor Coopers & Lybrand (PwC) 1989  –  1993  (4 years) Lyon - Paris General Counsel - Compliance Officer カンパニー　セクレタリー 内部統制プロジェクトリーダー PILOT CORPORATION OF EUROPE 2014  – Present (1 year) Annecy - Paris Managing Legal Services, Risk, Compliance and Internal control \n \nWorld’s number 2 brand in quality writing instruments including Pilot and Namiki  \nhttp://www.pilotpen.eu/en/ General Counsel - Compliance Officer カンパニー　セクレタリー 内部統制プロジェクトリーダー PILOT CORPORATION OF EUROPE 2014  – Present (1 year) Annecy - Paris Managing Legal Services, Risk, Compliance and Internal control \n \nWorld’s number 2 brand in quality writing instruments including Pilot and Namiki  \nhttp://www.pilotpen.eu/en/ Legal Director ETM Management 2012  – Present (3 years) Special advisory inhouse assignments in particular for developing companies such as e-TRACS - Interactive Geolocalisation: adding value securing the offer and the contracts, personal data processing \nManaging special projects (eg. marketing, commercial, corporate, compliance) auditing and managing risks, negotiating contracts and settlements \nImproving legal performance, costs, setting up processes and KPIs  \n \nTeaching seminars on Management of Legal Departments to senior inhouse Lawyers, writing articles in professional publications in management and compliance Legal Director ETM Management 2012  – Present (3 years) Special advisory inhouse assignments in particular for developing companies such as e-TRACS - Interactive Geolocalisation: adding value securing the offer and the contracts, personal data processing \nManaging special projects (eg. marketing, commercial, corporate, compliance) auditing and managing risks, negotiating contracts and settlements \nImproving legal performance, costs, setting up processes and KPIs  \n \nTeaching seminars on Management of Legal Departments to senior inhouse Lawyers, writing articles in professional publications in management and compliance Legal Director DBApparel (Dim Brands Apparel) 2008  –  2011  (3 years) Rueil-Malmaison Group Legal Director, managing a team of 5 people, advising general management, international Business Units (France, UK, Italy, Spain, Germany, Russia, South Africa, Export and International) Operations Central and Support services \n \nMain activities include: corporate organization (60 cos worldwide) M&A, contracts, litigation, arbitration, marketing and consumer law, distribution, competition, intellectual property \n \nDBApparel owns leading intimates, underwear and hosiery brands such as DIM, PLAYTEX, WONDERBRA, CHANTAL THOMASS, SHOCK ABSORBER, FILA, LOVABLE, UNNO, NUR DIE, ABANDERADO.  \nThe Group designs, develops, sources or manufactures, commercializes its products mainly in Europe, Eastern Europe, Russia and South Africa. It is developing in Asia and the Middle East. . Products are sold through traditional trade channels (department stores, retailers, wholesalers, and mail order) as well as specialized chain stores and mass market retailers... \n \nSales approx. 900 M€ ; Employees approx. 8.000 \nGroup is based in Rueil-Malmaison 92 (Paris) Legal Director DBApparel (Dim Brands Apparel) 2008  –  2011  (3 years) Rueil-Malmaison Group Legal Director, managing a team of 5 people, advising general management, international Business Units (France, UK, Italy, Spain, Germany, Russia, South Africa, Export and International) Operations Central and Support services \n \nMain activities include: corporate organization (60 cos worldwide) M&A, contracts, litigation, arbitration, marketing and consumer law, distribution, competition, intellectual property \n \nDBApparel owns leading intimates, underwear and hosiery brands such as DIM, PLAYTEX, WONDERBRA, CHANTAL THOMASS, SHOCK ABSORBER, FILA, LOVABLE, UNNO, NUR DIE, ABANDERADO.  \nThe Group designs, develops, sources or manufactures, commercializes its products mainly in Europe, Eastern Europe, Russia and South Africa. It is developing in Asia and the Middle East. . Products are sold through traditional trade channels (department stores, retailers, wholesalers, and mail order) as well as specialized chain stores and mass market retailers... \n \nSales approx. 900 M€ ; Employees approx. 8.000 \nGroup is based in Rueil-Malmaison 92 (Paris) Legal Director Cauval Industries 1994  –  2008  (14 years) Lognes (Paris Area) Group legal Director managing a team of 5 people, advising General management, the heads of the Operational Divisions and factory management \n \nCauval Industries is a European leader in the field of furniture, manufacturing and commercializing mainly seats, sofas and bedding with brands such as SIMMONS, DUNLOPILLO, TRECA, STEINER-PARIS \nSales approx. 650 M€, Employees : 5.000 Legal Director Cauval Industries 1994  –  2008  (14 years) Lognes (Paris Area) Group legal Director managing a team of 5 people, advising General management, the heads of the Operational Divisions and factory management \n \nCauval Industries is a European leader in the field of furniture, manufacturing and commercializing mainly seats, sofas and bedding with brands such as SIMMONS, DUNLOPILLO, TRECA, STEINER-PARIS \nSales approx. 650 M€, Employees : 5.000 Advocate - Legal Advisor Coopers & Lybrand (PwC) 1989  –  1993  (4 years) Lyon - Paris Advocate - Legal Advisor Coopers & Lybrand (PwC) 1989  –  1993  (4 years) Lyon - Paris Languages   Skills Corporate Law Intellectual Property International Law Mergers & Acquisitions Competition Law Legal Advice Trademarks Contract Negotiation Litigation Joint Ventures IT law Contract Law Legal Management Mergers Corporate Governance Commercial Litigation Negotiating Contracts Licensing Distribution Strategies Cyberlaw Patents Litigation Management Distribution networks Consumer Law Compliance Cross-border... International Groups Software Licensing Data Privacy Dispute Resolution Social Law Restructuring Business development... Arbitration See 19+     See less Skills  Corporate Law Intellectual Property International Law Mergers & Acquisitions Competition Law Legal Advice Trademarks Contract Negotiation Litigation Joint Ventures IT law Contract Law Legal Management Mergers Corporate Governance Commercial Litigation Negotiating Contracts Licensing Distribution Strategies Cyberlaw Patents Litigation Management Distribution networks Consumer Law Compliance Cross-border... International Groups Software Licensing Data Privacy Dispute Resolution Social Law Restructuring Business development... Arbitration See 19+     See less Corporate Law Intellectual Property International Law Mergers & Acquisitions Competition Law Legal Advice Trademarks Contract Negotiation Litigation Joint Ventures IT law Contract Law Legal Management Mergers Corporate Governance Commercial Litigation Negotiating Contracts Licensing Distribution Strategies Cyberlaw Patents Litigation Management Distribution networks Consumer Law Compliance Cross-border... International Groups Software Licensing Data Privacy Dispute Resolution Social Law Restructuring Business development... Arbitration See 19+     See less Corporate Law Intellectual Property International Law Mergers & Acquisitions Competition Law Legal Advice Trademarks Contract Negotiation Litigation Joint Ventures IT law Contract Law Legal Management Mergers Corporate Governance Commercial Litigation Negotiating Contracts Licensing Distribution Strategies Cyberlaw Patents Litigation Management Distribution networks Consumer Law Compliance Cross-border... International Groups Software Licensing Data Privacy Dispute Resolution Social Law Restructuring Business development... Arbitration See 19+     See less Education EM Lyon Business School MBA (Cesma),  Management - International business 1986  – 1987 University of Exeter (UK) Master of Law LLM,  International Business law 1985  – 1986 Paul Cezanne University (Aix-Marseille - France) Maitrise (Master),  International law 1984  – 1985 Jean Moulin university (Lyon - France) Licence (initial degree),  Law 1981  – 1984 EM Lyon Business School MBA (Cesma),  Management - International business 1986  – 1987 EM Lyon Business School MBA (Cesma),  Management - International business 1986  – 1987 EM Lyon Business School MBA (Cesma),  Management - International business 1986  – 1987 University of Exeter (UK) Master of Law LLM,  International Business law 1985  – 1986 University of Exeter (UK) Master of Law LLM,  International Business law 1985  – 1986 University of Exeter (UK) Master of Law LLM,  International Business law 1985  – 1986 Paul Cezanne University (Aix-Marseille - France) Maitrise (Master),  International law 1984  – 1985 Paul Cezanne University (Aix-Marseille - France) Maitrise (Master),  International law 1984  – 1985 Paul Cezanne University (Aix-Marseille - France) Maitrise (Master),  International law 1984  – 1985 Jean Moulin university (Lyon - France) Licence (initial degree),  Law 1981  – 1984 Jean Moulin university (Lyon - France) Licence (initial degree),  Law 1981  – 1984 Jean Moulin university (Lyon - France) Licence (initial degree),  Law 1981  – 1984 Honors & Awards ", "Experience INTERNATIONAL LEGAL DIRECTOR / DIRECTOR COORDINACION JURIDICA INTERNACIONAL GRUPO DIA Group January 2015  – Present (8 months) Madrid Area, Spain International Coordination of Dia Group Legal Directions (Portugal, China, Brazil, Argentina) \nMaster Franchise  \nM&A and Strategic Partnerships \nInternational Litigation \nFinancing Agreements \n LEGAL DIRECTOR DIA France 2006  –  2014  (8 years) Paris Area, France Legal Director of the French Subsidiary of Dia Group in charge of Real Estate, Franchise, Corporate, M&A, Litigation, Commercial legal matters DEPUTY LEGAL DIRECTOR SAS ED 2004  –  2006  (2 years) Directeur Juridique Adjoint de la filiale française Hard Discount du groupe Carrefour MANAGING DIRECTOR_MARKET PLACE Louis Dreyfus 2000  –  2004  (4 years) INTERNAL LAWYER SA Louis Dreyfus & Cie 1996  –  2000  (4 years) Work for several subsidiaries of the group (Louis Dreyfus Citrus (IPO), Ralph Lauren, LD Com) essentially in Corporate and M&A matters INTERNATIONAL LEGAL DIRECTOR / DIRECTOR COORDINACION JURIDICA INTERNACIONAL GRUPO DIA Group January 2015  – Present (8 months) Madrid Area, Spain International Coordination of Dia Group Legal Directions (Portugal, China, Brazil, Argentina) \nMaster Franchise  \nM&A and Strategic Partnerships \nInternational Litigation \nFinancing Agreements \n INTERNATIONAL LEGAL DIRECTOR / DIRECTOR COORDINACION JURIDICA INTERNACIONAL GRUPO DIA Group January 2015  – Present (8 months) Madrid Area, Spain International Coordination of Dia Group Legal Directions (Portugal, China, Brazil, Argentina) \nMaster Franchise  \nM&A and Strategic Partnerships \nInternational Litigation \nFinancing Agreements \n LEGAL DIRECTOR DIA France 2006  –  2014  (8 years) Paris Area, France Legal Director of the French Subsidiary of Dia Group in charge of Real Estate, Franchise, Corporate, M&A, Litigation, Commercial legal matters LEGAL DIRECTOR DIA France 2006  –  2014  (8 years) Paris Area, France Legal Director of the French Subsidiary of Dia Group in charge of Real Estate, Franchise, Corporate, M&A, Litigation, Commercial legal matters DEPUTY LEGAL DIRECTOR SAS ED 2004  –  2006  (2 years) Directeur Juridique Adjoint de la filiale française Hard Discount du groupe Carrefour DEPUTY LEGAL DIRECTOR SAS ED 2004  –  2006  (2 years) Directeur Juridique Adjoint de la filiale française Hard Discount du groupe Carrefour MANAGING DIRECTOR_MARKET PLACE Louis Dreyfus 2000  –  2004  (4 years) MANAGING DIRECTOR_MARKET PLACE Louis Dreyfus 2000  –  2004  (4 years) INTERNAL LAWYER SA Louis Dreyfus & Cie 1996  –  2000  (4 years) Work for several subsidiaries of the group (Louis Dreyfus Citrus (IPO), Ralph Lauren, LD Com) essentially in Corporate and M&A matters INTERNAL LAWYER SA Louis Dreyfus & Cie 1996  –  2000  (4 years) Work for several subsidiaries of the group (Louis Dreyfus Citrus (IPO), Ralph Lauren, LD Com) essentially in Corporate and M&A matters Languages   Skills Business Strategy Management Corporate Law Restructuring Mergers & Acquisitions Negotiation Strategy Corporate Social... Litigation Management Corporate Finance Joint Ventures Franchising Management Consulting Corporate Governance Real Estate Corporate M&A experience Change Management Competition Sustainable Development Corporate Strategy See 6+     See less Skills  Business Strategy Management Corporate Law Restructuring Mergers & Acquisitions Negotiation Strategy Corporate Social... Litigation Management Corporate Finance Joint Ventures Franchising Management Consulting Corporate Governance Real Estate Corporate M&A experience Change Management Competition Sustainable Development Corporate Strategy See 6+     See less Business Strategy Management Corporate Law Restructuring Mergers & Acquisitions Negotiation Strategy Corporate Social... Litigation Management Corporate Finance Joint Ventures Franchising Management Consulting Corporate Governance Real Estate Corporate M&A experience Change Management Competition Sustainable Development Corporate Strategy See 6+     See less Business Strategy Management Corporate Law Restructuring Mergers & Acquisitions Negotiation Strategy Corporate Social... Litigation Management Corporate Finance Joint Ventures Franchising Management Consulting Corporate Governance Real Estate Corporate M&A experience Change Management Competition Sustainable Development Corporate Strategy See 6+     See less Education HEC School of Management / HEC Paris Executive MBA 2012  – 2013 Special degree from Berkley university and Indian Institute of Management Bangalore Indian Institute of Management, Bangalore 2012  – 2013 University of California, Berkeley 2012  – 2013 Institut d'Administration des Entreprises DESS CAAE 1994  – 1995 Université d'Orléans Master 2 - Droit Economique 1992  – 1993 - HEC School of Management / HEC Paris Executive MBA 2012  – 2013 Special degree from Berkley university and Indian Institute of Management Bangalore HEC School of Management / HEC Paris Executive MBA 2012  – 2013 Special degree from Berkley university and Indian Institute of Management Bangalore HEC School of Management / HEC Paris Executive MBA 2012  – 2013 Special degree from Berkley university and Indian Institute of Management Bangalore Indian Institute of Management, Bangalore 2012  – 2013 Indian Institute of Management, Bangalore 2012  – 2013 Indian Institute of Management, Bangalore 2012  – 2013 University of California, Berkeley 2012  – 2013 University of California, Berkeley 2012  – 2013 University of California, Berkeley 2012  – 2013 Institut d'Administration des Entreprises DESS CAAE 1994  – 1995 Institut d'Administration des Entreprises DESS CAAE 1994  – 1995 Institut d'Administration des Entreprises DESS CAAE 1994  – 1995 Université d'Orléans Master 2 - Droit Economique 1992  – 1993 Université d'Orléans Master 2 - Droit Economique 1992  – 1993 Université d'Orléans Master 2 - Droit Economique 1992  – 1993 - - - Honors & Awards ", "Summary General Practice, Business and Corporate Law, Foreign Trade and Tax Law, Labor and Social Security Law, Intellectual Property, Real Estate and Infrastructure, Environmental Law, Criminal Law and Dispute Resolution. Summary General Practice, Business and Corporate Law, Foreign Trade and Tax Law, Labor and Social Security Law, Intellectual Property, Real Estate and Infrastructure, Environmental Law, Criminal Law and Dispute Resolution. General Practice, Business and Corporate Law, Foreign Trade and Tax Law, Labor and Social Security Law, Intellectual Property, Real Estate and Infrastructure, Environmental Law, Criminal Law and Dispute Resolution. General Practice, Business and Corporate Law, Foreign Trade and Tax Law, Labor and Social Security Law, Intellectual Property, Real Estate and Infrastructure, Environmental Law, Criminal Law and Dispute Resolution. Experience Legal Director DCDB Group May 2013  – Present (2 years 4 months) Buenos Aires Founding Partner Negri & Torres, Attorneys at Law June 2003  – Present (12 years 3 months) International Law Firm based in Buenos Aires with offices in Miami, Colombia, Venezuela, México, and Madrid that provides legal services for international companies. \n \nwww.negri-torres.com Legal Director - Founding Partner Avenir Agriculture Fund October 2012  – Present (2 years 11 months) Uruguay Avenir is a strategic aliance between a group of experts in the business of farming and financial services, which aims is to structure and capitalize the sowing business providing higher returns and security for the investors. Legal Director - Partner Elite Polo Management January 2012  – Present (3 years 8 months) Zurich Elite Polo Management is an international management company specializing in high handicap Polo players. \n \nWith a presence in the world's most important seasons, provides a full solution dealing with player representation, contracts, financial transactions, account opening, abroad societies, tax advice, legal department, insurance, sponsors, travel, logistics, image and press. \n \nElite is based in Zurich and has a strategic alliance with Swiss Invest for financial solutions \nwww.aqswissinvest.ch \n \nIt also has strategic alliance with PoloLine International for marketing, media and press. \nServices offered: \n \nWorldwide Representation \nContracts negotiation \nMonitoring and execution of payments and transfers \nComplete financial solution \nTax advice and account movements \nSpecific insurance for polo players \nLegal Department, counseling, support 365 days a year \nInternational Logistics \nGeneration and organization of teams in different countries \nDirect connection between Patrons and Sponsors \nOpening of new businesses and markets \nConsulting \nPublic Relations \nPress \n \nwww.elitepolomanagement.com Legal Counsel - President SI Research June 2003  – Present (12 years 3 months) Buenos Aires Consultoría estratégica para grandes y medianas empresas. Professor University of Buenos Aires, School of Law June 1999  – Present (16 years 3 months) Teaching \nExperience:\t \n \nAssistantship by contest marked 10/10 \nUniversity of Buenos Aires (UBA) \n \nChairs:\tBusiness Law and Environmental Law \n \nSubjects: Corporate and Partnership Law, Mergers and Acquisition, Commercial Law, Bankruptcy, Insolvency & Reorganization, Antitrust Law and Environmental Law. Legal Director House Group March 2006  –  2010  (4 years) Real Estate & Financial Services Legal Director BCN Advisors March 2006  –  2010  (4 years) Real Estate & Financial Services Legal Director Storyline Productora Audiovisual June 2004  –  2010  (6 years) Founding Partner Greener Investments January 2005  –  2009  (4 years) Environemental Project Financing related to Kyoto Protocol. General Counsel The WorldGate Group June 2003  –  January 2005  (1 year 8 months) Associate Baker & McKenzie March 1998  –  June 2003  (5 years 4 months) Baker & McKenzie is one of the largest international law firms in Buenos Aires and ranks among the leading. For more than 30 years we have delivered a wide range of legal services for domestic companies doing business abroad and international clients doing business in Argentina. We represent some of the world’s largest companies across a wide range of industries, and much of our work focuses on helping clients structure new business ventures in Argentina, as well as reorganize, restructure and liquidate companies and divisions. Our legal team is recognized as one of country’s best in international tax, litigation, corporate, real estate, security transactions, banking and finance and labor law. Junior Lawyer Carregal & Funes de Rioja Abogados May 1997  –  March 1998  (11 months) Paralegal Sosa & Casas Abogados March 1993  –  May 1997  (4 years 3 months) Internship American Bar Association November 1996  –  March 1997  (5 months) Internship Argentine Embassy at Washington DC, USA November 1996  –  March 1997  (5 months) Legal Director DCDB Group May 2013  – Present (2 years 4 months) Buenos Aires Legal Director DCDB Group May 2013  – Present (2 years 4 months) Buenos Aires Founding Partner Negri & Torres, Attorneys at Law June 2003  – Present (12 years 3 months) International Law Firm based in Buenos Aires with offices in Miami, Colombia, Venezuela, México, and Madrid that provides legal services for international companies. \n \nwww.negri-torres.com Founding Partner Negri & Torres, Attorneys at Law June 2003  – Present (12 years 3 months) International Law Firm based in Buenos Aires with offices in Miami, Colombia, Venezuela, México, and Madrid that provides legal services for international companies. \n \nwww.negri-torres.com Legal Director - Founding Partner Avenir Agriculture Fund October 2012  – Present (2 years 11 months) Uruguay Avenir is a strategic aliance between a group of experts in the business of farming and financial services, which aims is to structure and capitalize the sowing business providing higher returns and security for the investors. Legal Director - Founding Partner Avenir Agriculture Fund October 2012  – Present (2 years 11 months) Uruguay Avenir is a strategic aliance between a group of experts in the business of farming and financial services, which aims is to structure and capitalize the sowing business providing higher returns and security for the investors. Legal Director - Partner Elite Polo Management January 2012  – Present (3 years 8 months) Zurich Elite Polo Management is an international management company specializing in high handicap Polo players. \n \nWith a presence in the world's most important seasons, provides a full solution dealing with player representation, contracts, financial transactions, account opening, abroad societies, tax advice, legal department, insurance, sponsors, travel, logistics, image and press. \n \nElite is based in Zurich and has a strategic alliance with Swiss Invest for financial solutions \nwww.aqswissinvest.ch \n \nIt also has strategic alliance with PoloLine International for marketing, media and press. \nServices offered: \n \nWorldwide Representation \nContracts negotiation \nMonitoring and execution of payments and transfers \nComplete financial solution \nTax advice and account movements \nSpecific insurance for polo players \nLegal Department, counseling, support 365 days a year \nInternational Logistics \nGeneration and organization of teams in different countries \nDirect connection between Patrons and Sponsors \nOpening of new businesses and markets \nConsulting \nPublic Relations \nPress \n \nwww.elitepolomanagement.com Legal Director - Partner Elite Polo Management January 2012  – Present (3 years 8 months) Zurich Elite Polo Management is an international management company specializing in high handicap Polo players. \n \nWith a presence in the world's most important seasons, provides a full solution dealing with player representation, contracts, financial transactions, account opening, abroad societies, tax advice, legal department, insurance, sponsors, travel, logistics, image and press. \n \nElite is based in Zurich and has a strategic alliance with Swiss Invest for financial solutions \nwww.aqswissinvest.ch \n \nIt also has strategic alliance with PoloLine International for marketing, media and press. \nServices offered: \n \nWorldwide Representation \nContracts negotiation \nMonitoring and execution of payments and transfers \nComplete financial solution \nTax advice and account movements \nSpecific insurance for polo players \nLegal Department, counseling, support 365 days a year \nInternational Logistics \nGeneration and organization of teams in different countries \nDirect connection between Patrons and Sponsors \nOpening of new businesses and markets \nConsulting \nPublic Relations \nPress \n \nwww.elitepolomanagement.com Legal Counsel - President SI Research June 2003  – Present (12 years 3 months) Buenos Aires Consultoría estratégica para grandes y medianas empresas. Legal Counsel - President SI Research June 2003  – Present (12 years 3 months) Buenos Aires Consultoría estratégica para grandes y medianas empresas. Professor University of Buenos Aires, School of Law June 1999  – Present (16 years 3 months) Teaching \nExperience:\t \n \nAssistantship by contest marked 10/10 \nUniversity of Buenos Aires (UBA) \n \nChairs:\tBusiness Law and Environmental Law \n \nSubjects: Corporate and Partnership Law, Mergers and Acquisition, Commercial Law, Bankruptcy, Insolvency & Reorganization, Antitrust Law and Environmental Law. Professor University of Buenos Aires, School of Law June 1999  – Present (16 years 3 months) Teaching \nExperience:\t \n \nAssistantship by contest marked 10/10 \nUniversity of Buenos Aires (UBA) \n \nChairs:\tBusiness Law and Environmental Law \n \nSubjects: Corporate and Partnership Law, Mergers and Acquisition, Commercial Law, Bankruptcy, Insolvency & Reorganization, Antitrust Law and Environmental Law. Legal Director House Group March 2006  –  2010  (4 years) Real Estate & Financial Services Legal Director House Group March 2006  –  2010  (4 years) Real Estate & Financial Services Legal Director BCN Advisors March 2006  –  2010  (4 years) Real Estate & Financial Services Legal Director BCN Advisors March 2006  –  2010  (4 years) Real Estate & Financial Services Legal Director Storyline Productora Audiovisual June 2004  –  2010  (6 years) Legal Director Storyline Productora Audiovisual June 2004  –  2010  (6 years) Founding Partner Greener Investments January 2005  –  2009  (4 years) Environemental Project Financing related to Kyoto Protocol. Founding Partner Greener Investments January 2005  –  2009  (4 years) Environemental Project Financing related to Kyoto Protocol. General Counsel The WorldGate Group June 2003  –  January 2005  (1 year 8 months) General Counsel The WorldGate Group June 2003  –  January 2005  (1 year 8 months) Associate Baker & McKenzie March 1998  –  June 2003  (5 years 4 months) Baker & McKenzie is one of the largest international law firms in Buenos Aires and ranks among the leading. For more than 30 years we have delivered a wide range of legal services for domestic companies doing business abroad and international clients doing business in Argentina. We represent some of the world’s largest companies across a wide range of industries, and much of our work focuses on helping clients structure new business ventures in Argentina, as well as reorganize, restructure and liquidate companies and divisions. Our legal team is recognized as one of country’s best in international tax, litigation, corporate, real estate, security transactions, banking and finance and labor law. Associate Baker & McKenzie March 1998  –  June 2003  (5 years 4 months) Baker & McKenzie is one of the largest international law firms in Buenos Aires and ranks among the leading. For more than 30 years we have delivered a wide range of legal services for domestic companies doing business abroad and international clients doing business in Argentina. We represent some of the world’s largest companies across a wide range of industries, and much of our work focuses on helping clients structure new business ventures in Argentina, as well as reorganize, restructure and liquidate companies and divisions. Our legal team is recognized as one of country’s best in international tax, litigation, corporate, real estate, security transactions, banking and finance and labor law. Junior Lawyer Carregal & Funes de Rioja Abogados May 1997  –  March 1998  (11 months) Junior Lawyer Carregal & Funes de Rioja Abogados May 1997  –  March 1998  (11 months) Paralegal Sosa & Casas Abogados March 1993  –  May 1997  (4 years 3 months) Paralegal Sosa & Casas Abogados March 1993  –  May 1997  (4 years 3 months) Internship American Bar Association November 1996  –  March 1997  (5 months) Internship American Bar Association November 1996  –  March 1997  (5 months) Internship Argentine Embassy at Washington DC, USA November 1996  –  March 1997  (5 months) Internship Argentine Embassy at Washington DC, USA November 1996  –  March 1997  (5 months) Skills Commercial Litigation Corporate Law Real Estate Dispute Resolution Criminal Law International Trade Tax Law International Law Legal Advice Intellectual Property Litigation Competition Law Arbitration Corporate Governance Legal Assistance Licensing Employment Law Civil Litigation Mergers Mediation Legal Research Due Diligence International... Alternative Dispute... Joint Ventures Mergers & Acquisitions Privacy Law Restructuring See 13+     See less Skills  Commercial Litigation Corporate Law Real Estate Dispute Resolution Criminal Law International Trade Tax Law International Law Legal Advice Intellectual Property Litigation Competition Law Arbitration Corporate Governance Legal Assistance Licensing Employment Law Civil Litigation Mergers Mediation Legal Research Due Diligence International... Alternative Dispute... Joint Ventures Mergers & Acquisitions Privacy Law Restructuring See 13+     See less Commercial Litigation Corporate Law Real Estate Dispute Resolution Criminal Law International Trade Tax Law International Law Legal Advice Intellectual Property Litigation Competition Law Arbitration Corporate Governance Legal Assistance Licensing Employment Law Civil Litigation Mergers Mediation Legal Research Due Diligence International... Alternative Dispute... Joint Ventures Mergers & Acquisitions Privacy Law Restructuring See 13+     See less Commercial Litigation Corporate Law Real Estate Dispute Resolution Criminal Law International Trade Tax Law International Law Legal Advice Intellectual Property Litigation Competition Law Arbitration Corporate Governance Legal Assistance Licensing Employment Law Civil Litigation Mergers Mediation Legal Research Due Diligence International... Alternative Dispute... Joint Ventures Mergers & Acquisitions Privacy Law Restructuring See 13+     See less Education Universidad Francisco de Vitoria Spain,  Master in Business Law 2002  – 2003 London School of Economics and Political Science United Kingdom , Strategic Thinking and Game Theory for Managemet 2000  – 2000 American University USA , International Trade & Business Semminar 1997  – 1998 Activities and Societies:  Participant of the Washington Semester and World Capitals Progam University of Buenos Aires Lawyer,  Economic and Business Law 1992  – 1997 American University Secondary School Universidad Francisco de Vitoria Spain,  Master in Business Law 2002  – 2003 Universidad Francisco de Vitoria Spain,  Master in Business Law 2002  – 2003 Universidad Francisco de Vitoria Spain,  Master in Business Law 2002  – 2003 London School of Economics and Political Science United Kingdom , Strategic Thinking and Game Theory for Managemet 2000  – 2000 London School of Economics and Political Science United Kingdom , Strategic Thinking and Game Theory for Managemet 2000  – 2000 London School of Economics and Political Science United Kingdom , Strategic Thinking and Game Theory for Managemet 2000  – 2000 American University USA , International Trade & Business Semminar 1997  – 1998 Activities and Societies:  Participant of the Washington Semester and World Capitals Progam American University USA , International Trade & Business Semminar 1997  – 1998 Activities and Societies:  Participant of the Washington Semester and World Capitals Progam American University USA , International Trade & Business Semminar 1997  – 1998 Activities and Societies:  Participant of the Washington Semester and World Capitals Progam University of Buenos Aires Lawyer,  Economic and Business Law 1992  – 1997 University of Buenos Aires Lawyer,  Economic and Business Law 1992  – 1997 University of Buenos Aires Lawyer,  Economic and Business Law 1992  – 1997 American University American University American University Secondary School Secondary School Secondary School Honors & Awards Additional Honors & Awards Scholarship of Carolina Foundation & Fransisco de Vittoria University (2002)  \nMaster in Business Law  \nMadrid, Spain  \n \n \nScholarship of Argentine Council of International Exchange Students (1997) \nWashington Semester and World Capitals Program of American University \nWashington DC, USA Additional Honors & Awards Scholarship of Carolina Foundation & Fransisco de Vittoria University (2002)  \nMaster in Business Law  \nMadrid, Spain  \n \n \nScholarship of Argentine Council of International Exchange Students (1997) \nWashington Semester and World Capitals Program of American University \nWashington DC, USA Additional Honors & Awards Scholarship of Carolina Foundation & Fransisco de Vittoria University (2002)  \nMaster in Business Law  \nMadrid, Spain  \n \n \nScholarship of Argentine Council of International Exchange Students (1997) \nWashington Semester and World Capitals Program of American University \nWashington DC, USA Additional Honors & Awards Scholarship of Carolina Foundation & Fransisco de Vittoria University (2002)  \nMaster in Business Law  \nMadrid, Spain  \n \n \nScholarship of Argentine Council of International Exchange Students (1997) \nWashington Semester and World Capitals Program of American University \nWashington DC, USA ", "Languages English and Spanish English and Spanish English and Spanish Skills Mergers International Law Competitive Analysis Arbitration Purchasing Financial Planners Corporate Governance Collective Bargaining Corporate Law Branding & Identity Licensing Spanish Legal Assistance Due Diligence Negotiation Privacy Law Employment Law Tax Contract Negotiation Competition Law Project Planning Strategy Mergers & Acquisitions Intellectual Property Joint Ventures Contract Management Trademarks Outsourcing Litigation Management Contract Law Commercial Litigation Legal Compliance Portuguese Leadership Legal Advice Restructuring Risk Management Finance Legal Issues Software Licensing Human Resources Project Finance Private Equity Data Privacy Corporate Finance Telecommunications Analysis See 33+     See less Skills  Mergers International Law Competitive Analysis Arbitration Purchasing Financial Planners Corporate Governance Collective Bargaining Corporate Law Branding & Identity Licensing Spanish Legal Assistance Due Diligence Negotiation Privacy Law Employment Law Tax Contract Negotiation Competition Law Project Planning Strategy Mergers & Acquisitions Intellectual Property Joint Ventures Contract Management Trademarks Outsourcing Litigation Management Contract Law Commercial Litigation Legal Compliance Portuguese Leadership Legal Advice Restructuring Risk Management Finance Legal Issues Software Licensing Human Resources Project Finance Private Equity Data Privacy Corporate Finance Telecommunications Analysis See 33+     See less Mergers International Law Competitive Analysis Arbitration Purchasing Financial Planners Corporate Governance Collective Bargaining Corporate Law Branding & Identity Licensing Spanish Legal Assistance Due Diligence Negotiation Privacy Law Employment Law Tax Contract Negotiation Competition Law Project Planning Strategy Mergers & Acquisitions Intellectual Property Joint Ventures Contract Management Trademarks Outsourcing Litigation Management Contract Law Commercial Litigation Legal Compliance Portuguese Leadership Legal Advice Restructuring Risk Management Finance Legal Issues Software Licensing Human Resources Project Finance Private Equity Data Privacy Corporate Finance Telecommunications Analysis See 33+     See less Mergers International Law Competitive Analysis Arbitration Purchasing Financial Planners Corporate Governance Collective Bargaining Corporate Law Branding & Identity Licensing Spanish Legal Assistance Due Diligence Negotiation Privacy Law Employment Law Tax Contract Negotiation Competition Law Project Planning Strategy Mergers & Acquisitions Intellectual Property Joint Ventures Contract Management Trademarks Outsourcing Litigation Management Contract Law Commercial Litigation Legal Compliance Portuguese Leadership Legal Advice Restructuring Risk Management Finance Legal Issues Software Licensing Human Resources Project Finance Private Equity Data Privacy Corporate Finance Telecommunications Analysis See 33+     See less ", "Summary Legal Director for AEG Europe, including The O2, The SSE Arena, Wembley, AXS.com and other aspects of the AEG business. Summary Legal Director for AEG Europe, including The O2, The SSE Arena, Wembley, AXS.com and other aspects of the AEG business. Legal Director for AEG Europe, including The O2, The SSE Arena, Wembley, AXS.com and other aspects of the AEG business. Legal Director for AEG Europe, including The O2, The SSE Arena, Wembley, AXS.com and other aspects of the AEG business. Experience Legal Director AEG Europe March 2014  – Present (1 year 6 months) Legal Director The O2 October 2012  –  December 2013  (1 year 3 months) London, United Kingdom Legal Director Universal Pictures International September 2011  –  October 2012  (1 year 2 months) Legal Counsel MTV Networks September 2006  –  August 2011  (5 years) Solicitor Osborne Clarke June 2003  –  October 2006  (3 years 5 months) Legal Director AEG Europe March 2014  – Present (1 year 6 months) Legal Director AEG Europe March 2014  – Present (1 year 6 months) Legal Director The O2 October 2012  –  December 2013  (1 year 3 months) London, United Kingdom Legal Director The O2 October 2012  –  December 2013  (1 year 3 months) London, United Kingdom Legal Director Universal Pictures International September 2011  –  October 2012  (1 year 2 months) Legal Director Universal Pictures International September 2011  –  October 2012  (1 year 2 months) Legal Counsel MTV Networks September 2006  –  August 2011  (5 years) Legal Counsel MTV Networks September 2006  –  August 2011  (5 years) Solicitor Osborne Clarke June 2003  –  October 2006  (3 years 5 months) Solicitor Osborne Clarke June 2003  –  October 2006  (3 years 5 months) Skills Copyright Law Trademarks Privacy Law Business Affairs Entertainment Law New Media Entertainment Commercial Litigation Legal Advice Digital Media Licensing Corporate Law Broadcast Skills  Copyright Law Trademarks Privacy Law Business Affairs Entertainment Law New Media Entertainment Commercial Litigation Legal Advice Digital Media Licensing Corporate Law Broadcast Copyright Law Trademarks Privacy Law Business Affairs Entertainment Law New Media Entertainment Commercial Litigation Legal Advice Digital Media Licensing Corporate Law Broadcast Copyright Law Trademarks Privacy Law Business Affairs Entertainment Law New Media Entertainment Commercial Litigation Legal Advice Digital Media Licensing Corporate Law Broadcast Education The College of Law, London PGDL / Legal Practice Course 2001  – 2003 University of Exeter 1997  – 2000 The College of Law, London PGDL / Legal Practice Course 2001  – 2003 The College of Law, London PGDL / Legal Practice Course 2001  – 2003 The College of Law, London PGDL / Legal Practice Course 2001  – 2003 University of Exeter 1997  – 2000 University of Exeter 1997  – 2000 University of Exeter 1997  – 2000 ", "Experience Independent Business Owner + Legal Director legalB. 2015  – Present (less than a year) Amsterdam Area, Netherlands Co Owner & Legal Director Robin Banks December 2009  – Present (5 years 9 months) Amsterdam Area, Netherlands Co Owner + Legal Director DR.MEDIA 2003  –  2013  (10 years) Amsterdam Area, Netherlands Legal Consultant a.i. KIFID September 2008  –  February 2009  (6 months) Den Haag Legal Counsel a.i. Autoriteit Financiële Markten January 2007  –  June 2007  (6 months) Amsterdam Area, Netherlands Project Manager & Compliance Officer a.i. ING Real Estate Development 2006  –  2007  (1 year) Den Haag Senior Legal Counsel a.i. UPC Nederland 2005  –  2006  (1 year) Amsterdam Area, Netherlands Legal Counsel a.i. Autoriteit Financiële Markten 2004  –  2004  (less than a year) Amsterdam Area, Netherlands Legal Counsel OPTA-Onafhankelijke Post en Telecommunicatie Autoriteit (opgegaan in ACM per 1 april 2013) 2002  –  2004  (2 years) Den Haag Employee Income & Corporate Actions ABN AMRO Bank N.V. 2001  –  2001  (less than a year) Amsterdam Area, Netherlands Tax Counsel Arthur Andersen & Co. September 1999  –  February 2000  (6 months) Amsterdam Area, Netherlands Independent Business Owner + Legal Director legalB. 2015  – Present (less than a year) Amsterdam Area, Netherlands Independent Business Owner + Legal Director legalB. 2015  – Present (less than a year) Amsterdam Area, Netherlands Co Owner & Legal Director Robin Banks December 2009  – Present (5 years 9 months) Amsterdam Area, Netherlands Co Owner & Legal Director Robin Banks December 2009  – Present (5 years 9 months) Amsterdam Area, Netherlands Co Owner + Legal Director DR.MEDIA 2003  –  2013  (10 years) Amsterdam Area, Netherlands Co Owner + Legal Director DR.MEDIA 2003  –  2013  (10 years) Amsterdam Area, Netherlands Legal Consultant a.i. KIFID September 2008  –  February 2009  (6 months) Den Haag Legal Consultant a.i. KIFID September 2008  –  February 2009  (6 months) Den Haag Legal Counsel a.i. Autoriteit Financiële Markten January 2007  –  June 2007  (6 months) Amsterdam Area, Netherlands Legal Counsel a.i. Autoriteit Financiële Markten January 2007  –  June 2007  (6 months) Amsterdam Area, Netherlands Project Manager & Compliance Officer a.i. ING Real Estate Development 2006  –  2007  (1 year) Den Haag Project Manager & Compliance Officer a.i. ING Real Estate Development 2006  –  2007  (1 year) Den Haag Senior Legal Counsel a.i. UPC Nederland 2005  –  2006  (1 year) Amsterdam Area, Netherlands Senior Legal Counsel a.i. UPC Nederland 2005  –  2006  (1 year) Amsterdam Area, Netherlands Legal Counsel a.i. Autoriteit Financiële Markten 2004  –  2004  (less than a year) Amsterdam Area, Netherlands Legal Counsel a.i. Autoriteit Financiële Markten 2004  –  2004  (less than a year) Amsterdam Area, Netherlands Legal Counsel OPTA-Onafhankelijke Post en Telecommunicatie Autoriteit (opgegaan in ACM per 1 april 2013) 2002  –  2004  (2 years) Den Haag Legal Counsel OPTA-Onafhankelijke Post en Telecommunicatie Autoriteit (opgegaan in ACM per 1 april 2013) 2002  –  2004  (2 years) Den Haag Employee Income & Corporate Actions ABN AMRO Bank N.V. 2001  –  2001  (less than a year) Amsterdam Area, Netherlands Employee Income & Corporate Actions ABN AMRO Bank N.V. 2001  –  2001  (less than a year) Amsterdam Area, Netherlands Tax Counsel Arthur Andersen & Co. September 1999  –  February 2000  (6 months) Amsterdam Area, Netherlands Tax Counsel Arthur Andersen & Co. September 1999  –  February 2000  (6 months) Amsterdam Area, Netherlands Languages   Skills Skills     Honors & Awards Additional Honors & Awards - Gold and platinum #1 single 'Tuintje in mijn hart (Mi Rowsu)' with Damaru & Jan Smit - 2009 \n- #1 single 'Broodje Bakpao' with Gers Pardoel & Sef - 2010 \n- Multi platinum #1 single 'Ik neem je mee' of Gers Pardoel - 2011 \n- 3 TMF Music Awards \n- Artist Manager of the year 2010 (DR.MEDIA) \n- BUMA Award 2014 'Silhouette\" with Xerxes Bakker \n Additional Honors & Awards - Gold and platinum #1 single 'Tuintje in mijn hart (Mi Rowsu)' with Damaru & Jan Smit - 2009 \n- #1 single 'Broodje Bakpao' with Gers Pardoel & Sef - 2010 \n- Multi platinum #1 single 'Ik neem je mee' of Gers Pardoel - 2011 \n- 3 TMF Music Awards \n- Artist Manager of the year 2010 (DR.MEDIA) \n- BUMA Award 2014 'Silhouette\" with Xerxes Bakker \n Additional Honors & Awards - Gold and platinum #1 single 'Tuintje in mijn hart (Mi Rowsu)' with Damaru & Jan Smit - 2009 \n- #1 single 'Broodje Bakpao' with Gers Pardoel & Sef - 2010 \n- Multi platinum #1 single 'Ik neem je mee' of Gers Pardoel - 2011 \n- 3 TMF Music Awards \n- Artist Manager of the year 2010 (DR.MEDIA) \n- BUMA Award 2014 'Silhouette\" with Xerxes Bakker \n Additional Honors & Awards - Gold and platinum #1 single 'Tuintje in mijn hart (Mi Rowsu)' with Damaru & Jan Smit - 2009 \n- #1 single 'Broodje Bakpao' with Gers Pardoel & Sef - 2010 \n- Multi platinum #1 single 'Ik neem je mee' of Gers Pardoel - 2011 \n- 3 TMF Music Awards \n- Artist Manager of the year 2010 (DR.MEDIA) \n- BUMA Award 2014 'Silhouette\" with Xerxes Bakker \n ", "Skills English Fluent Spanish Fluent Portuguese Native Spanish English Portuguese Negotiation Telecommunications International Law Management Team Leadership Legal Advice Strategy Finance Solution Selling Sales Management Start-ups E-commerce Business Planning New Business Development Government Business Development Strategic Planning Managed Services See 9+     See less Skills  English Fluent Spanish Fluent Portuguese Native Spanish English Portuguese Negotiation Telecommunications International Law Management Team Leadership Legal Advice Strategy Finance Solution Selling Sales Management Start-ups E-commerce Business Planning New Business Development Government Business Development Strategic Planning Managed Services See 9+     See less English Fluent Spanish Fluent Portuguese Native Spanish English Portuguese Negotiation Telecommunications International Law Management Team Leadership Legal Advice Strategy Finance Solution Selling Sales Management Start-ups E-commerce Business Planning New Business Development Government Business Development Strategic Planning Managed Services See 9+     See less English Fluent Spanish Fluent Portuguese Native Spanish English Portuguese Negotiation Telecommunications International Law Management Team Leadership Legal Advice Strategy Finance Solution Selling Sales Management Start-ups E-commerce Business Planning New Business Development Government Business Development Strategic Planning Managed Services See 9+     See less ", "Summary 15 years' experience as International Legal Director in Telecommunications, Internet and Software companies, in a international high technology fast-growth environments (from start-up to 600 employees). Setting up and development of legal departments. Specialties:International contracts (drafting, negotiation, validation - with customers / suppliers / partners / distributors / agents /...), Corporation law, Insurance law, Intellectual property rights. High technology fast-growth environments (Telecommunications, Software, Internet business environment). Business-oriented / Corporate & customers culture. Summary 15 years' experience as International Legal Director in Telecommunications, Internet and Software companies, in a international high technology fast-growth environments (from start-up to 600 employees). Setting up and development of legal departments. Specialties:International contracts (drafting, negotiation, validation - with customers / suppliers / partners / distributors / agents /...), Corporation law, Insurance law, Intellectual property rights. High technology fast-growth environments (Telecommunications, Software, Internet business environment). Business-oriented / Corporate & customers culture. 15 years' experience as International Legal Director in Telecommunications, Internet and Software companies, in a international high technology fast-growth environments (from start-up to 600 employees). Setting up and development of legal departments. Specialties:International contracts (drafting, negotiation, validation - with customers / suppliers / partners / distributors / agents /...), Corporation law, Insurance law, Intellectual property rights. High technology fast-growth environments (Telecommunications, Software, Internet business environment). Business-oriented / Corporate & customers culture. 15 years' experience as International Legal Director in Telecommunications, Internet and Software companies, in a international high technology fast-growth environments (from start-up to 600 employees). Setting up and development of legal departments. Specialties:International contracts (drafting, negotiation, validation - with customers / suppliers / partners / distributors / agents /...), Corporation law, Insurance law, Intellectual property rights. High technology fast-growth environments (Telecommunications, Software, Internet business environment). Business-oriented / Corporate & customers culture. Experience International Legal Director group (Sophia Antipolis) KAPPA Engineering January 2005  – Present (10 years 8 months) In charge of all legal issues for the group in a international environment (15 subsidiaries &/or sales agencies) in a fast-growing market. International contracts management (drafting, negotiation, validation of customers, suppliers, agents, distributors, partnership, Memorandums of understanding, consortium,.. agreements, standard and customized/custom-built contracts, international contracts) + Corporation/Business law (Shareholders meetings & Board of directors minutes, business law formalities relating to the approval of accounts, increase/reduction in capital, companies set-up, merger & acquisition, appointments of directors, auditors, transfer of shares, ...)  \n+ Intellectual property rights (brandnames deposit, patents, copyrights deposit, formalities, advises) \n+ Insurance issues (companies, employees, consultants and management insurance coverage) \n+ Employment law (Employment contracts, regulations, internal rules, ...) + Tax law + International export rules (ECCN/BERR, EIN, Certificate of origin, ...), legal proceedings.  \nLegal management of all subsidiaries through the world (business contracts, corporate law issues, ...).  \nHigh technology fast-growth environment (Software, Telecommunication & Internet).  \nManagement legal advising. Business-oriented (especially in the negociation of the business contracts with customers) / Corporate & customers culture. International Legal Director (Paris) SCOOT France - 118 000 February 2003  –  December 2005  (2 years 11 months) In charge of all legal issues for all subsidiaries (3) in a international environment. Setting up a legal department. Legal Director (Paris) KPNQwest France February 2001  –  December 2002  (1 year 11 months) In charge of the legal issues for all French subsidiaries (4) in a international environment. Setting up a legal department in a fast-growth environment. Legal Director (Paris) TISCALI - Liberty Surf January 2000  –  January 2001  (1 year 1 month) In charge of all legal issues for all subsidiaries in France (15 subsidiaries) in a international environment. Setting up a legal department in a fast-growth environment - 600 employees. Legal Director (Paris) SIRIS (Neuf Telecom Grandes Entreprises) January 1995  –  January 2000  (5 years 1 month) In charge of all legal issues in a international environment. Setting up a legal department in a fast-growth environment (from 30 to 450 employees), management of 2 Lawyers. International Legal Director group (Sophia Antipolis) KAPPA Engineering January 2005  – Present (10 years 8 months) In charge of all legal issues for the group in a international environment (15 subsidiaries &/or sales agencies) in a fast-growing market. International contracts management (drafting, negotiation, validation of customers, suppliers, agents, distributors, partnership, Memorandums of understanding, consortium,.. agreements, standard and customized/custom-built contracts, international contracts) + Corporation/Business law (Shareholders meetings & Board of directors minutes, business law formalities relating to the approval of accounts, increase/reduction in capital, companies set-up, merger & acquisition, appointments of directors, auditors, transfer of shares, ...)  \n+ Intellectual property rights (brandnames deposit, patents, copyrights deposit, formalities, advises) \n+ Insurance issues (companies, employees, consultants and management insurance coverage) \n+ Employment law (Employment contracts, regulations, internal rules, ...) + Tax law + International export rules (ECCN/BERR, EIN, Certificate of origin, ...), legal proceedings.  \nLegal management of all subsidiaries through the world (business contracts, corporate law issues, ...).  \nHigh technology fast-growth environment (Software, Telecommunication & Internet).  \nManagement legal advising. Business-oriented (especially in the negociation of the business contracts with customers) / Corporate & customers culture. International Legal Director group (Sophia Antipolis) KAPPA Engineering January 2005  – Present (10 years 8 months) In charge of all legal issues for the group in a international environment (15 subsidiaries &/or sales agencies) in a fast-growing market. International contracts management (drafting, negotiation, validation of customers, suppliers, agents, distributors, partnership, Memorandums of understanding, consortium,.. agreements, standard and customized/custom-built contracts, international contracts) + Corporation/Business law (Shareholders meetings & Board of directors minutes, business law formalities relating to the approval of accounts, increase/reduction in capital, companies set-up, merger & acquisition, appointments of directors, auditors, transfer of shares, ...)  \n+ Intellectual property rights (brandnames deposit, patents, copyrights deposit, formalities, advises) \n+ Insurance issues (companies, employees, consultants and management insurance coverage) \n+ Employment law (Employment contracts, regulations, internal rules, ...) + Tax law + International export rules (ECCN/BERR, EIN, Certificate of origin, ...), legal proceedings.  \nLegal management of all subsidiaries through the world (business contracts, corporate law issues, ...).  \nHigh technology fast-growth environment (Software, Telecommunication & Internet).  \nManagement legal advising. Business-oriented (especially in the negociation of the business contracts with customers) / Corporate & customers culture. International Legal Director (Paris) SCOOT France - 118 000 February 2003  –  December 2005  (2 years 11 months) In charge of all legal issues for all subsidiaries (3) in a international environment. Setting up a legal department. International Legal Director (Paris) SCOOT France - 118 000 February 2003  –  December 2005  (2 years 11 months) In charge of all legal issues for all subsidiaries (3) in a international environment. Setting up a legal department. Legal Director (Paris) KPNQwest France February 2001  –  December 2002  (1 year 11 months) In charge of the legal issues for all French subsidiaries (4) in a international environment. Setting up a legal department in a fast-growth environment. Legal Director (Paris) KPNQwest France February 2001  –  December 2002  (1 year 11 months) In charge of the legal issues for all French subsidiaries (4) in a international environment. Setting up a legal department in a fast-growth environment. Legal Director (Paris) TISCALI - Liberty Surf January 2000  –  January 2001  (1 year 1 month) In charge of all legal issues for all subsidiaries in France (15 subsidiaries) in a international environment. Setting up a legal department in a fast-growth environment - 600 employees. Legal Director (Paris) TISCALI - Liberty Surf January 2000  –  January 2001  (1 year 1 month) In charge of all legal issues for all subsidiaries in France (15 subsidiaries) in a international environment. Setting up a legal department in a fast-growth environment - 600 employees. Legal Director (Paris) SIRIS (Neuf Telecom Grandes Entreprises) January 1995  –  January 2000  (5 years 1 month) In charge of all legal issues in a international environment. Setting up a legal department in a fast-growth environment (from 30 to 450 employees), management of 2 Lawyers. Legal Director (Paris) SIRIS (Neuf Telecom Grandes Entreprises) January 1995  –  January 2000  (5 years 1 month) In charge of all legal issues in a international environment. Setting up a legal department in a fast-growth environment (from 30 to 450 employees), management of 2 Lawyers. Skills Corporate Law Legal Writing Intellectual Property Negotiation Start-ups Mergers Mergers & Acquisitions Legal Advice Gestion d'équipe Employment Law Skills  Corporate Law Legal Writing Intellectual Property Negotiation Start-ups Mergers Mergers & Acquisitions Legal Advice Gestion d'équipe Employment Law Corporate Law Legal Writing Intellectual Property Negotiation Start-ups Mergers Mergers & Acquisitions Legal Advice Gestion d'équipe Employment Law Corporate Law Legal Writing Intellectual Property Negotiation Start-ups Mergers Mergers & Acquisitions Legal Advice Gestion d'équipe Employment Law Education Université Paris X Nanterre CRFPA - Attorney school 1996  – 1997 Postgraduate legal qualification conferred by the French Attorneys Bar Council (C.R.F.P.A - Paris) - Swearing in as Attorney / Attorney certified. Université Paris X Nanterre D.E.A en Droit des affaires - University post-graduate research degree in business law 1991  – 1992 Université Panthéon Assas (Paris II) Maîtrise en Droit des affaires et fiscalité - University Master's degree in business & tax law,  Deux mentions - Two distinctions 1990  – 1991 Université Paris X Nanterre CRFPA - Attorney school 1996  – 1997 Postgraduate legal qualification conferred by the French Attorneys Bar Council (C.R.F.P.A - Paris) - Swearing in as Attorney / Attorney certified. Université Paris X Nanterre CRFPA - Attorney school 1996  – 1997 Postgraduate legal qualification conferred by the French Attorneys Bar Council (C.R.F.P.A - Paris) - Swearing in as Attorney / Attorney certified. Université Paris X Nanterre CRFPA - Attorney school 1996  – 1997 Postgraduate legal qualification conferred by the French Attorneys Bar Council (C.R.F.P.A - Paris) - Swearing in as Attorney / Attorney certified. Université Paris X Nanterre D.E.A en Droit des affaires - University post-graduate research degree in business law 1991  – 1992 Université Paris X Nanterre D.E.A en Droit des affaires - University post-graduate research degree in business law 1991  – 1992 Université Paris X Nanterre D.E.A en Droit des affaires - University post-graduate research degree in business law 1991  – 1992 Université Panthéon Assas (Paris II) Maîtrise en Droit des affaires et fiscalité - University Master's degree in business & tax law,  Deux mentions - Two distinctions 1990  – 1991 Université Panthéon Assas (Paris II) Maîtrise en Droit des affaires et fiscalité - University Master's degree in business & tax law,  Deux mentions - Two distinctions 1990  – 1991 Université Panthéon Assas (Paris II) Maîtrise en Droit des affaires et fiscalité - University Master's degree in business & tax law,  Deux mentions - Two distinctions 1990  – 1991 ", "Experience Executive Legal Director & Compliance Officer Merck Sharp & Dohme January 2015  – Present (8 months) Executive Legal Director Merck Sharp & Dohme April 2013  – Present (2 years 5 months) Legal Director (South Latin America) Becton, Dickinson & Company March 2009  –  March 2013  (4 years 1 month) Senior Associate Pinheiro Neto Advogados April 1995  –  March 2009  (14 years) Executive Legal Director & Compliance Officer Merck Sharp & Dohme January 2015  – Present (8 months) Executive Legal Director & Compliance Officer Merck Sharp & Dohme January 2015  – Present (8 months) Executive Legal Director Merck Sharp & Dohme April 2013  – Present (2 years 5 months) Executive Legal Director Merck Sharp & Dohme April 2013  – Present (2 years 5 months) Legal Director (South Latin America) Becton, Dickinson & Company March 2009  –  March 2013  (4 years 1 month) Legal Director (South Latin America) Becton, Dickinson & Company March 2009  –  March 2013  (4 years 1 month) Senior Associate Pinheiro Neto Advogados April 1995  –  March 2009  (14 years) Senior Associate Pinheiro Neto Advogados April 1995  –  March 2009  (14 years) Languages English Spanish Portuguese German English Spanish Portuguese German English Spanish Portuguese German Skills Corporate Law Commercial Litigation Litigation Intellectual Property Employment Law Competition Law Corporate Governance Legal Advice Cross-border... FCPA Legal Compliance Merger Control Joint Ventures Legal Assistance Due Diligence Mergers International Law Consumer Law Dispute Resolution Licensing Contract Law Arbitration Tax Law Legal Research International... Administrative Law Banking Law Contract Negotiation Privacy Law Patents Trademarks Patent Litigation Regulatory Affairs Mergers & Acquisitions Spanish M&A experience Securities Regulation Restructuring Foreign Investment Trademark Infringement Litigation Management International Business... See 27+     See less Skills  Corporate Law Commercial Litigation Litigation Intellectual Property Employment Law Competition Law Corporate Governance Legal Advice Cross-border... FCPA Legal Compliance Merger Control Joint Ventures Legal Assistance Due Diligence Mergers International Law Consumer Law Dispute Resolution Licensing Contract Law Arbitration Tax Law Legal Research International... Administrative Law Banking Law Contract Negotiation Privacy Law Patents Trademarks Patent Litigation Regulatory Affairs Mergers & Acquisitions Spanish M&A experience Securities Regulation Restructuring Foreign Investment Trademark Infringement Litigation Management International Business... See 27+     See less Corporate Law Commercial Litigation Litigation Intellectual Property Employment Law Competition Law Corporate Governance Legal Advice Cross-border... FCPA Legal Compliance Merger Control Joint Ventures Legal Assistance Due Diligence Mergers International Law Consumer Law Dispute Resolution Licensing Contract Law Arbitration Tax Law Legal Research International... Administrative Law Banking Law Contract Negotiation Privacy Law Patents Trademarks Patent Litigation Regulatory Affairs Mergers & Acquisitions Spanish M&A experience Securities Regulation Restructuring Foreign Investment Trademark Infringement Litigation Management International Business... See 27+     See less Corporate Law Commercial Litigation Litigation Intellectual Property Employment Law Competition Law Corporate Governance Legal Advice Cross-border... FCPA Legal Compliance Merger Control Joint Ventures Legal Assistance Due Diligence Mergers International Law Consumer Law Dispute Resolution Licensing Contract Law Arbitration Tax Law Legal Research International... Administrative Law Banking Law Contract Negotiation Privacy Law Patents Trademarks Patent Litigation Regulatory Affairs Mergers & Acquisitions Spanish M&A experience Securities Regulation Restructuring Foreign Investment Trademark Infringement Litigation Management International Business... See 27+     See less Education Ibmec LLM,  Finance Law 2003  – 2005 Pontifícia Universidade Católica de São Paulo Bachelor,  Law 1994  – 1998 Ibmec LLM,  Finance Law 2003  – 2005 Ibmec LLM,  Finance Law 2003  – 2005 Ibmec LLM,  Finance Law 2003  – 2005 Pontifícia Universidade Católica de São Paulo Bachelor,  Law 1994  – 1998 Pontifícia Universidade Católica de São Paulo Bachelor,  Law 1994  – 1998 Pontifícia Universidade Católica de São Paulo Bachelor,  Law 1994  – 1998 ", "Experience Regional Legal Director, Northern Europe, Australia and New Zealand RB January 2015  – Present (8 months) Huma Blunt is Regional Legal Director, Northern Europe & ANZ at Reckitt Benckiser, a FTSE 100 multinational consumer goods company and major producer of health, hygiene and home products (such as Dettol, Strepsils, Nurofen, Veet, Air Wick, Calgon, Clearasil and Vanish). She is a member of the Northern European ANZ Management Team leading the legal function for the UK, Ireland, Nordics, Australia and New Zealand. \n \nHuma has a strong focus on people and is passionate about developing diverse legal teams to deliver results through a business partner approach. By providing commercially astute and solution focused advice, Huma and her team enable the business to win in the marketplace whilst protecting the business operating model. \n \nHuma started her career as a lawyer working for Denton Wilde Sapte before moving to Ashfords and then in-house. Prior to Reckitt Benckiser, Huma worked at Coca-Cola Enterprises in a number of legal roles in the sales and marketing and supply chain both at country and European levels, providing Huma with extensive experience of fast moving and dynamic business environments. Legal Director, Northern Europe Reckitt Benckiser May 2013  –  March 2015  (1 year 11 months) Huma Blunt is Legal Director, Northern Europe at Reckitt Benckiser, a FTSE 100 multinational consumer goods company and major producer of health, hygiene and home products (such as Dettol, Strepsils, Nurofen, Veet, Air Wick, Calgon, Clearasil and Vanish). She is a member of the Northern European Management Team and leads the legal function in the UK, Ireland and the Nordic countries. \n \nHuma has a strong focus on people and is passionate about developing diverse legal teams to deliver results through a business partner approach. By providing commercially astute and solution focused advice, Huma and her team enable the business to win in the marketplace whilst protecting the business operating model. \n \nHuma started her career as a lawyer working for Denton Wilde Sapte before moving to Ashfords and then in-house. Prior to Reckitt Benckiser, Huma worked at Coca-Cola Enterprises in a number of legal roles in the sales and marketing and supply chain both at country and European levels, providing Huma with extensive experience of fast moving and dynamic business environments. Associate Legal Director, EU Group Coca-Cola Enterprises January 2012  –  April 2013  (1 year 4 months) EU Senior Legal Counsel Coca-Cola Enterprises September 2011  –  January 2012  (5 months) Senior Legal Counsel, GB Coca-Cola Enterprises April 2011  –  September 2011  (6 months) European Counsel Coca-Cola Enterprises November 2009  –  April 2011  (1 year 6 months) Legal Counsel, Marketing and Commercial Coca-Cola Enterprises June 2007  –  November 2009  (2 years 6 months) Legal Advisor (1 year Maternity Cover) esure 2006  –  2007  (1 year) Assitant Solicitor Ashfords 2005  –  2006  (1 year) Exeter Trainee Solicitor SNR Denton (previously known as Denton Wilde Sapte) 2001  –  2003  (2 years) London (plus 6 months in Hong Kong Office) Paralegal, Asset Finance (Aviation and Shipping) SNR Denton (previously known as Denton Wilde Sapte) 1998  –  2001  (3 years) London, United Kingdom Regional Legal Director, Northern Europe, Australia and New Zealand RB January 2015  – Present (8 months) Huma Blunt is Regional Legal Director, Northern Europe & ANZ at Reckitt Benckiser, a FTSE 100 multinational consumer goods company and major producer of health, hygiene and home products (such as Dettol, Strepsils, Nurofen, Veet, Air Wick, Calgon, Clearasil and Vanish). She is a member of the Northern European ANZ Management Team leading the legal function for the UK, Ireland, Nordics, Australia and New Zealand. \n \nHuma has a strong focus on people and is passionate about developing diverse legal teams to deliver results through a business partner approach. By providing commercially astute and solution focused advice, Huma and her team enable the business to win in the marketplace whilst protecting the business operating model. \n \nHuma started her career as a lawyer working for Denton Wilde Sapte before moving to Ashfords and then in-house. Prior to Reckitt Benckiser, Huma worked at Coca-Cola Enterprises in a number of legal roles in the sales and marketing and supply chain both at country and European levels, providing Huma with extensive experience of fast moving and dynamic business environments. Regional Legal Director, Northern Europe, Australia and New Zealand RB January 2015  – Present (8 months) Huma Blunt is Regional Legal Director, Northern Europe & ANZ at Reckitt Benckiser, a FTSE 100 multinational consumer goods company and major producer of health, hygiene and home products (such as Dettol, Strepsils, Nurofen, Veet, Air Wick, Calgon, Clearasil and Vanish). She is a member of the Northern European ANZ Management Team leading the legal function for the UK, Ireland, Nordics, Australia and New Zealand. \n \nHuma has a strong focus on people and is passionate about developing diverse legal teams to deliver results through a business partner approach. By providing commercially astute and solution focused advice, Huma and her team enable the business to win in the marketplace whilst protecting the business operating model. \n \nHuma started her career as a lawyer working for Denton Wilde Sapte before moving to Ashfords and then in-house. Prior to Reckitt Benckiser, Huma worked at Coca-Cola Enterprises in a number of legal roles in the sales and marketing and supply chain both at country and European levels, providing Huma with extensive experience of fast moving and dynamic business environments. Legal Director, Northern Europe Reckitt Benckiser May 2013  –  March 2015  (1 year 11 months) Huma Blunt is Legal Director, Northern Europe at Reckitt Benckiser, a FTSE 100 multinational consumer goods company and major producer of health, hygiene and home products (such as Dettol, Strepsils, Nurofen, Veet, Air Wick, Calgon, Clearasil and Vanish). She is a member of the Northern European Management Team and leads the legal function in the UK, Ireland and the Nordic countries. \n \nHuma has a strong focus on people and is passionate about developing diverse legal teams to deliver results through a business partner approach. By providing commercially astute and solution focused advice, Huma and her team enable the business to win in the marketplace whilst protecting the business operating model. \n \nHuma started her career as a lawyer working for Denton Wilde Sapte before moving to Ashfords and then in-house. Prior to Reckitt Benckiser, Huma worked at Coca-Cola Enterprises in a number of legal roles in the sales and marketing and supply chain both at country and European levels, providing Huma with extensive experience of fast moving and dynamic business environments. Legal Director, Northern Europe Reckitt Benckiser May 2013  –  March 2015  (1 year 11 months) Huma Blunt is Legal Director, Northern Europe at Reckitt Benckiser, a FTSE 100 multinational consumer goods company and major producer of health, hygiene and home products (such as Dettol, Strepsils, Nurofen, Veet, Air Wick, Calgon, Clearasil and Vanish). She is a member of the Northern European Management Team and leads the legal function in the UK, Ireland and the Nordic countries. \n \nHuma has a strong focus on people and is passionate about developing diverse legal teams to deliver results through a business partner approach. By providing commercially astute and solution focused advice, Huma and her team enable the business to win in the marketplace whilst protecting the business operating model. \n \nHuma started her career as a lawyer working for Denton Wilde Sapte before moving to Ashfords and then in-house. Prior to Reckitt Benckiser, Huma worked at Coca-Cola Enterprises in a number of legal roles in the sales and marketing and supply chain both at country and European levels, providing Huma with extensive experience of fast moving and dynamic business environments. Associate Legal Director, EU Group Coca-Cola Enterprises January 2012  –  April 2013  (1 year 4 months) Associate Legal Director, EU Group Coca-Cola Enterprises January 2012  –  April 2013  (1 year 4 months) EU Senior Legal Counsel Coca-Cola Enterprises September 2011  –  January 2012  (5 months) EU Senior Legal Counsel Coca-Cola Enterprises September 2011  –  January 2012  (5 months) Senior Legal Counsel, GB Coca-Cola Enterprises April 2011  –  September 2011  (6 months) Senior Legal Counsel, GB Coca-Cola Enterprises April 2011  –  September 2011  (6 months) European Counsel Coca-Cola Enterprises November 2009  –  April 2011  (1 year 6 months) European Counsel Coca-Cola Enterprises November 2009  –  April 2011  (1 year 6 months) Legal Counsel, Marketing and Commercial Coca-Cola Enterprises June 2007  –  November 2009  (2 years 6 months) Legal Counsel, Marketing and Commercial Coca-Cola Enterprises June 2007  –  November 2009  (2 years 6 months) Legal Advisor (1 year Maternity Cover) esure 2006  –  2007  (1 year) Legal Advisor (1 year Maternity Cover) esure 2006  –  2007  (1 year) Assitant Solicitor Ashfords 2005  –  2006  (1 year) Exeter Assitant Solicitor Ashfords 2005  –  2006  (1 year) Exeter Trainee Solicitor SNR Denton (previously known as Denton Wilde Sapte) 2001  –  2003  (2 years) London (plus 6 months in Hong Kong Office) Trainee Solicitor SNR Denton (previously known as Denton Wilde Sapte) 2001  –  2003  (2 years) London (plus 6 months in Hong Kong Office) Paralegal, Asset Finance (Aviation and Shipping) SNR Denton (previously known as Denton Wilde Sapte) 1998  –  2001  (3 years) London, United Kingdom Paralegal, Asset Finance (Aviation and Shipping) SNR Denton (previously known as Denton Wilde Sapte) 1998  –  2001  (3 years) London, United Kingdom Skills Procurement Employment Law Corporate Law Negotiation Management Mergers & Acquisitions FMCG Cross-functional Team... Contract Negotiation Competition Law Corporate Governance Legal Advice Supply Chain Intellectual Property Licensing Skills  Procurement Employment Law Corporate Law Negotiation Management Mergers & Acquisitions FMCG Cross-functional Team... Contract Negotiation Competition Law Corporate Governance Legal Advice Supply Chain Intellectual Property Licensing Procurement Employment Law Corporate Law Negotiation Management Mergers & Acquisitions FMCG Cross-functional Team... Contract Negotiation Competition Law Corporate Governance Legal Advice Supply Chain Intellectual Property Licensing Procurement Employment Law Corporate Law Negotiation Management Mergers & Acquisitions FMCG Cross-functional Team... Contract Negotiation Competition Law Corporate Governance Legal Advice Supply Chain Intellectual Property Licensing Education Kingston University Master of Laws (LL.M.),  Business Law 2005  – 2006 Activities and Societies:  Distinction in Thesis London Guildhall University Post Graduate Diploma (Part-time),  Legal Practice Course 1999  – 2001 London Guildhall University Bachelor of Laws (LLB),  Business Law 1995  – 1999 Kingston University Master of Laws (LL.M.),  Business Law 2005  – 2006 Activities and Societies:  Distinction in Thesis Kingston University Master of Laws (LL.M.),  Business Law 2005  – 2006 Activities and Societies:  Distinction in Thesis Kingston University Master of Laws (LL.M.),  Business Law 2005  – 2006 Activities and Societies:  Distinction in Thesis London Guildhall University Post Graduate Diploma (Part-time),  Legal Practice Course 1999  – 2001 London Guildhall University Post Graduate Diploma (Part-time),  Legal Practice Course 1999  – 2001 London Guildhall University Post Graduate Diploma (Part-time),  Legal Practice Course 1999  – 2001 London Guildhall University Bachelor of Laws (LLB),  Business Law 1995  – 1999 London Guildhall University Bachelor of Laws (LLB),  Business Law 1995  – 1999 London Guildhall University Bachelor of Laws (LLB),  Business Law 1995  – 1999 ", "Summary Able to combine technical excellence in legal advice with a level of commercial judgement and input which is rare, having acted as both the Interim Managing Director for a New Zealand business unit, as well as regional HR Director. \n \nUniquely wide ranging and high level experience in the provision of legal advice to substantial corporations at board level (both as a board member and as adviser to the board). Experienced departmental manager across multiple jurisdictions, disciplines and industries.  \n \nPresented and made speeches at the highest international levels (eg. International Bar Association, General Assembly of the United Nations Comprehensive Test Ban Treaty Organisation, industry groups, ministers from various governments internationally, etc.) Specialties:Company/Commercial, Contracts, Intellectual Property, IT, mergers/acquisitions/disposals, Employment, Data Protection, European Union, litigation. Summary Able to combine technical excellence in legal advice with a level of commercial judgement and input which is rare, having acted as both the Interim Managing Director for a New Zealand business unit, as well as regional HR Director. \n \nUniquely wide ranging and high level experience in the provision of legal advice to substantial corporations at board level (both as a board member and as adviser to the board). Experienced departmental manager across multiple jurisdictions, disciplines and industries.  \n \nPresented and made speeches at the highest international levels (eg. International Bar Association, General Assembly of the United Nations Comprehensive Test Ban Treaty Organisation, industry groups, ministers from various governments internationally, etc.) Specialties:Company/Commercial, Contracts, Intellectual Property, IT, mergers/acquisitions/disposals, Employment, Data Protection, European Union, litigation. Able to combine technical excellence in legal advice with a level of commercial judgement and input which is rare, having acted as both the Interim Managing Director for a New Zealand business unit, as well as regional HR Director. \n \nUniquely wide ranging and high level experience in the provision of legal advice to substantial corporations at board level (both as a board member and as adviser to the board). Experienced departmental manager across multiple jurisdictions, disciplines and industries.  \n \nPresented and made speeches at the highest international levels (eg. International Bar Association, General Assembly of the United Nations Comprehensive Test Ban Treaty Organisation, industry groups, ministers from various governments internationally, etc.) Specialties:Company/Commercial, Contracts, Intellectual Property, IT, mergers/acquisitions/disposals, Employment, Data Protection, European Union, litigation. Able to combine technical excellence in legal advice with a level of commercial judgement and input which is rare, having acted as both the Interim Managing Director for a New Zealand business unit, as well as regional HR Director. \n \nUniquely wide ranging and high level experience in the provision of legal advice to substantial corporations at board level (both as a board member and as adviser to the board). Experienced departmental manager across multiple jurisdictions, disciplines and industries.  \n \nPresented and made speeches at the highest international levels (eg. International Bar Association, General Assembly of the United Nations Comprehensive Test Ban Treaty Organisation, industry groups, ministers from various governments internationally, etc.) Specialties:Company/Commercial, Contracts, Intellectual Property, IT, mergers/acquisitions/disposals, Employment, Data Protection, European Union, litigation. Experience Executive Vice President & General Counsel LexisNexis - Legal & Professional January 2012  – Present (3 years 8 months) Greater New York City Area Leading the Global Legal Department VP & Legal Director - LN International LexisNexis Group 2004  – Present (11 years) Head of the Corporate Legal department for the LexisNexis International Region. VP & Legal Director - LN International LexisNexis International 2004  – Present (11 years) Executive Vice President & General Counsel LexisNexis - Legal & Professional January 2012  – Present (3 years 8 months) Greater New York City Area Leading the Global Legal Department Executive Vice President & General Counsel LexisNexis - Legal & Professional January 2012  – Present (3 years 8 months) Greater New York City Area Leading the Global Legal Department VP & Legal Director - LN International LexisNexis Group 2004  – Present (11 years) Head of the Corporate Legal department for the LexisNexis International Region. VP & Legal Director - LN International LexisNexis Group 2004  – Present (11 years) Head of the Corporate Legal department for the LexisNexis International Region. VP & Legal Director - LN International LexisNexis International 2004  – Present (11 years) VP & Legal Director - LN International LexisNexis International 2004  – Present (11 years) Skills Intellectual Property Litigation Data Privacy European Union Privacy Law Corporate Law Commercial Litigation Corporate Governance Legal Advice Licensing Litigation Management Dispute Resolution Legal Research Legal Writing Employment Law Mergers International Law Litigation Support Due Diligence Joint Ventures Trademarks Contract Law Competition Law Copyright Law Mergers & Acquisitions Legal Compliance See 11+     See less Skills  Intellectual Property Litigation Data Privacy European Union Privacy Law Corporate Law Commercial Litigation Corporate Governance Legal Advice Licensing Litigation Management Dispute Resolution Legal Research Legal Writing Employment Law Mergers International Law Litigation Support Due Diligence Joint Ventures Trademarks Contract Law Competition Law Copyright Law Mergers & Acquisitions Legal Compliance See 11+     See less Intellectual Property Litigation Data Privacy European Union Privacy Law Corporate Law Commercial Litigation Corporate Governance Legal Advice Licensing Litigation Management Dispute Resolution Legal Research Legal Writing Employment Law Mergers International Law Litigation Support Due Diligence Joint Ventures Trademarks Contract Law Competition Law Copyright Law Mergers & Acquisitions Legal Compliance See 11+     See less Intellectual Property Litigation Data Privacy European Union Privacy Law Corporate Law Commercial Litigation Corporate Governance Legal Advice Licensing Litigation Management Dispute Resolution Legal Research Legal Writing Employment Law Mergers International Law Litigation Support Due Diligence Joint Ventures Trademarks Contract Law Competition Law Copyright Law Mergers & Acquisitions Legal Compliance See 11+     See less ", "Summary General Counsel with extensive international, commercial, and compliance experience, including over 10 years in the pharmaceutical and healthcare industries. International corporate, regulatory, and compliance experience across multiple businesses and geographic regions. Serve as a strategic thought partner to Senior Business Leaders. Lead a cross-functional group of attorneys & legal specialists across multiple markets. Summary General Counsel with extensive international, commercial, and compliance experience, including over 10 years in the pharmaceutical and healthcare industries. International corporate, regulatory, and compliance experience across multiple businesses and geographic regions. Serve as a strategic thought partner to Senior Business Leaders. Lead a cross-functional group of attorneys & legal specialists across multiple markets. General Counsel with extensive international, commercial, and compliance experience, including over 10 years in the pharmaceutical and healthcare industries. International corporate, regulatory, and compliance experience across multiple businesses and geographic regions. Serve as a strategic thought partner to Senior Business Leaders. Lead a cross-functional group of attorneys & legal specialists across multiple markets. General Counsel with extensive international, commercial, and compliance experience, including over 10 years in the pharmaceutical and healthcare industries. International corporate, regulatory, and compliance experience across multiple businesses and geographic regions. Serve as a strategic thought partner to Senior Business Leaders. Lead a cross-functional group of attorneys & legal specialists across multiple markets. Experience Regional Legal Director, Central & Eastern Europe, Mid-Sized Markets Pfizer Inc. February 2014  – Present (1 year 7 months) Central & Eastern Europe and Israel • Provide primary legal support to Central & Eastern Europe, Mid-Sized Markets, Global Innovative Pharmaceuticals Group, encompassing 32 emerging, high-growth markets in Central & Eastern Europe and Israel. \n• Counsel on a broad range of strategic issues–including complex commercial transactions (acquisitions/licensing/divestitures/co-promotes & joint ventures); sales, marketing and commercialization of products, intellectual property issues, regulatory, antitrust, employment, and privacy/data protection matters. \n• Advise business units on compliance-related matters and oversee policy development, compliance risk monitoring, and implementation of appropriate remediation/corrective action plans. \n• Serve as a member of the CEE, MSM, Executive Leadership Team. Regional Legal Director, Mature Markets Cluster; Cross-EM Counsel-Inflammation & Cardiovascular BUs Pfizer Inc. February 2012  –  February 2014  (2 years 1 month) Emerging Markets Europe, Russia, India & Turkey (EURIT) • Cross-Emerging Markets Counsel to Inflammation and Cardiovascular Business Units—over 70 markets in Central & Eastern Europe; Asia; Latin America; Africa & Middle East.  \n• Regional Legal Director of Emerging Markets Europe--Mature Markets Cluster, responsible for 7 emerging, high growth markets in Central & Eastern Europe & Israel. \n• Provided legal support and guidance on a broad range of strategic issues–including complex commercial transactions (acquisitions/licensing/divestitures/co-promotes & joint ventures); sales, marketing and commercialization of products, intellectual property issues, regulatory, antitrust, employment, and privacy/data protection matters. \n• Monitored the external environment to ensure the implementation of best practices as well as to respond to future business, ethics and compliance developments. Identified new or emerging areas of compliance risk in all business lines. \n• Supported compliance investigations and audits. Developed appropriate responses to investigations and audits, including remedial measures.  \n• Managed complex commercial litigation and negotiated the settlement of cases in the region. \n• Advised Country Business Units on industry-wide issues and the implications of pending legislation. \n• Coordinated the hiring and management of outside counsel, established & maintained regional legal budget and other operating/external expenses.  \n• Served as a member of the Mature Markets Cluster, Executive Leadership Team. Legal Director, Israel; EURIT Area Commercial Counsel-Inflammation & Cardiovascular Business Units Pfizer Inc. September 2008  –  March 2012  (3 years 7 months) Emerging Markets Europe, Russia, India & Turkey (\"EURIT\") • Area Commercial Counsel to Emerging Markets Europe Inflammation and Cardiovascular Business Units—34 markets, including Central & Eastern Europe, Russia, India, Israel and Turkey. \n• Responsible for establishing Legal Division in Israel. General Counsel of the Israel subsidiary of Pfizer Inc. \n• Provided legal support to Pharmaceutical, Consumer, Nutritionals and Animal Health Business Units and all Research & Development activities. \n• Advised and counseled Country Management Team on sales, marketing and commercialization of products, research & development activities and the safeguarding of Pfizer intellectual property rights. Managed litigation and settlement of cases.  \n• Negotiated and executed Agreements including Distribution, Licensing, Clinical Trials, Consulting, Contract Manufacturing, Co-marketing and Co-promotion. \n• Served as Chief Compliance Officer; Conducted internal investigations; Supervised corporate audits and implemented remediation plans.  \n• Developed and established FCPA procedures and Anti-Corruption/Anti-Bribery training programs. Worked across all business lines to ensure implementation of appropriate policies, training, auditing and other compliance controls. \n• Prepared regular reports of compliance findings and presented such reports and training to Senior Business Leaders.  \n• Established and implemented new systems and processes to monitor and audit activities and further compliance monitoring and auditing programs. \n• Served as a member of the Country Leadership Team. Senior Corporate Counsel Pfizer Inc. August 2004  –  September 2008  (4 years 2 months) Greater New York City Area •\tManaged worldwide antitrust matters for Pharmaceutical, Consumer and Animal Health Businesses, including counseling clients on mergers & acquisitions, pricing and promotional planning, distribution arrangements, price-discrimination and other competition issues. \n•\tAdvocated and defended Company interests in antitrust merger and conduct investigations in the U.S., EU, and other jurisdictions including Canada, Mexico, and Brazil. \n•\tCoordinated regulatory filings on a worldwide basis and interacted with U.S., EU and other government agencies. \n•\tNegotiated and executed highly complex commercial agreements. \n•\tGlobal Product Counsel for brand marketing teams: reviewed and approved promotional materials, sales training programs, press releases and other public relations documents. Senior Associate Hughes Hubbard & Reed LLP 2002  –  2004  (2 years) Greater New York City Area •\tSenior Associate in Litigation Department. Concentration in Antitrust & Competition matters; Intellectual Property Licensing; Consumer Protection matters; Securities Litigation and Counseling. \n•\tLitigated complex matters in federal and state courts and managed investigations before the Federal Trade Commission, U.S. Department of Justice, Antitrust Division, and the Securities and Exchange Commission. \n•\tManaged all aspects of discovery, including taking and defending depositions, and responding to government subpoenas or access letters. \n•\tDrafted pleadings, briefs, responses to government inquiries, and various government filings.  \n•\tPrepared and maintained budgets and established budget projections for clients.  \n•\tSupervised and managed mid-level/junior associates on client matters. Attorney Advisor to FTC Commissioner; Senior Antitrust Attorney Federal Trade Commission 1999  –  2002  (3 years) OFFICE OF COMMISSIONER THOMAS B. LEARY\tWashington, DC \nAttorney Advisor\t \n•\tAdvised Commissioner on antitrust, consumer protection, and privacy matters before the Commission. \n•\tPrepared Commissioner for meetings with business representatives, industry leaders, Members of Congress, and consumer advocacy organizations. \n•\tDrafted Commissioner’s statements, testimony, and speeches on antitrust and consumer protection matters. \nNORTHEAST REGION\tNew York, NY \nSenior Attorney\t \n•\tInvestigated and negotiated consent decrees involving alleged antitrust conduct violations. \n•\tAdvised foreign governments on the creation and implementation of effective antitrust enforcement policies. \n•\tLitigated cases in federal district court, deposed witnesses, argued motions, and negotiated consent orders. \n•\tInvestigated alleged privacy violations, false advertising, and deceptive marketing practices. \n•\tLed and managed staff attorneys on antitrust and consumer protection investigations. \nAWARDS: \n•\tSTEPHEN NYE AWARD–OCTOBER 2001, for outstanding service to the FTC.  \n•\tPERFORMANCE AWARD–DECEMBER 2000, for outstanding performance. Federal Prosecutor United States Government 1997  –  1999  (2 years) •\tLitigated federal cases: handled three trials as first-chair; two as co-chair; and two as second-chair;  \n•\tWrote post-trial and appellate briefs, and negotiated settlements. Clerkship The White House, Office of Counsel to the President 1996  –  1996  (less than a year) Washington D.C. Metro Area •\tResearched and prepared legal memoranda for Associate Counsels to the President. \n•\tAnalyzed federal legislation, legislation drafts, and issues related to legal ethics. Regional Legal Director, Central & Eastern Europe, Mid-Sized Markets Pfizer Inc. February 2014  – Present (1 year 7 months) Central & Eastern Europe and Israel • Provide primary legal support to Central & Eastern Europe, Mid-Sized Markets, Global Innovative Pharmaceuticals Group, encompassing 32 emerging, high-growth markets in Central & Eastern Europe and Israel. \n• Counsel on a broad range of strategic issues–including complex commercial transactions (acquisitions/licensing/divestitures/co-promotes & joint ventures); sales, marketing and commercialization of products, intellectual property issues, regulatory, antitrust, employment, and privacy/data protection matters. \n• Advise business units on compliance-related matters and oversee policy development, compliance risk monitoring, and implementation of appropriate remediation/corrective action plans. \n• Serve as a member of the CEE, MSM, Executive Leadership Team. Regional Legal Director, Central & Eastern Europe, Mid-Sized Markets Pfizer Inc. February 2014  – Present (1 year 7 months) Central & Eastern Europe and Israel • Provide primary legal support to Central & Eastern Europe, Mid-Sized Markets, Global Innovative Pharmaceuticals Group, encompassing 32 emerging, high-growth markets in Central & Eastern Europe and Israel. \n• Counsel on a broad range of strategic issues–including complex commercial transactions (acquisitions/licensing/divestitures/co-promotes & joint ventures); sales, marketing and commercialization of products, intellectual property issues, regulatory, antitrust, employment, and privacy/data protection matters. \n• Advise business units on compliance-related matters and oversee policy development, compliance risk monitoring, and implementation of appropriate remediation/corrective action plans. \n• Serve as a member of the CEE, MSM, Executive Leadership Team. Regional Legal Director, Mature Markets Cluster; Cross-EM Counsel-Inflammation & Cardiovascular BUs Pfizer Inc. February 2012  –  February 2014  (2 years 1 month) Emerging Markets Europe, Russia, India & Turkey (EURIT) • Cross-Emerging Markets Counsel to Inflammation and Cardiovascular Business Units—over 70 markets in Central & Eastern Europe; Asia; Latin America; Africa & Middle East.  \n• Regional Legal Director of Emerging Markets Europe--Mature Markets Cluster, responsible for 7 emerging, high growth markets in Central & Eastern Europe & Israel. \n• Provided legal support and guidance on a broad range of strategic issues–including complex commercial transactions (acquisitions/licensing/divestitures/co-promotes & joint ventures); sales, marketing and commercialization of products, intellectual property issues, regulatory, antitrust, employment, and privacy/data protection matters. \n• Monitored the external environment to ensure the implementation of best practices as well as to respond to future business, ethics and compliance developments. Identified new or emerging areas of compliance risk in all business lines. \n• Supported compliance investigations and audits. Developed appropriate responses to investigations and audits, including remedial measures.  \n• Managed complex commercial litigation and negotiated the settlement of cases in the region. \n• Advised Country Business Units on industry-wide issues and the implications of pending legislation. \n• Coordinated the hiring and management of outside counsel, established & maintained regional legal budget and other operating/external expenses.  \n• Served as a member of the Mature Markets Cluster, Executive Leadership Team. Regional Legal Director, Mature Markets Cluster; Cross-EM Counsel-Inflammation & Cardiovascular BUs Pfizer Inc. February 2012  –  February 2014  (2 years 1 month) Emerging Markets Europe, Russia, India & Turkey (EURIT) • Cross-Emerging Markets Counsel to Inflammation and Cardiovascular Business Units—over 70 markets in Central & Eastern Europe; Asia; Latin America; Africa & Middle East.  \n• Regional Legal Director of Emerging Markets Europe--Mature Markets Cluster, responsible for 7 emerging, high growth markets in Central & Eastern Europe & Israel. \n• Provided legal support and guidance on a broad range of strategic issues–including complex commercial transactions (acquisitions/licensing/divestitures/co-promotes & joint ventures); sales, marketing and commercialization of products, intellectual property issues, regulatory, antitrust, employment, and privacy/data protection matters. \n• Monitored the external environment to ensure the implementation of best practices as well as to respond to future business, ethics and compliance developments. Identified new or emerging areas of compliance risk in all business lines. \n• Supported compliance investigations and audits. Developed appropriate responses to investigations and audits, including remedial measures.  \n• Managed complex commercial litigation and negotiated the settlement of cases in the region. \n• Advised Country Business Units on industry-wide issues and the implications of pending legislation. \n• Coordinated the hiring and management of outside counsel, established & maintained regional legal budget and other operating/external expenses.  \n• Served as a member of the Mature Markets Cluster, Executive Leadership Team. Legal Director, Israel; EURIT Area Commercial Counsel-Inflammation & Cardiovascular Business Units Pfizer Inc. September 2008  –  March 2012  (3 years 7 months) Emerging Markets Europe, Russia, India & Turkey (\"EURIT\") • Area Commercial Counsel to Emerging Markets Europe Inflammation and Cardiovascular Business Units—34 markets, including Central & Eastern Europe, Russia, India, Israel and Turkey. \n• Responsible for establishing Legal Division in Israel. General Counsel of the Israel subsidiary of Pfizer Inc. \n• Provided legal support to Pharmaceutical, Consumer, Nutritionals and Animal Health Business Units and all Research & Development activities. \n• Advised and counseled Country Management Team on sales, marketing and commercialization of products, research & development activities and the safeguarding of Pfizer intellectual property rights. Managed litigation and settlement of cases.  \n• Negotiated and executed Agreements including Distribution, Licensing, Clinical Trials, Consulting, Contract Manufacturing, Co-marketing and Co-promotion. \n• Served as Chief Compliance Officer; Conducted internal investigations; Supervised corporate audits and implemented remediation plans.  \n• Developed and established FCPA procedures and Anti-Corruption/Anti-Bribery training programs. Worked across all business lines to ensure implementation of appropriate policies, training, auditing and other compliance controls. \n• Prepared regular reports of compliance findings and presented such reports and training to Senior Business Leaders.  \n• Established and implemented new systems and processes to monitor and audit activities and further compliance monitoring and auditing programs. \n• Served as a member of the Country Leadership Team. Legal Director, Israel; EURIT Area Commercial Counsel-Inflammation & Cardiovascular Business Units Pfizer Inc. September 2008  –  March 2012  (3 years 7 months) Emerging Markets Europe, Russia, India & Turkey (\"EURIT\") • Area Commercial Counsel to Emerging Markets Europe Inflammation and Cardiovascular Business Units—34 markets, including Central & Eastern Europe, Russia, India, Israel and Turkey. \n• Responsible for establishing Legal Division in Israel. General Counsel of the Israel subsidiary of Pfizer Inc. \n• Provided legal support to Pharmaceutical, Consumer, Nutritionals and Animal Health Business Units and all Research & Development activities. \n• Advised and counseled Country Management Team on sales, marketing and commercialization of products, research & development activities and the safeguarding of Pfizer intellectual property rights. Managed litigation and settlement of cases.  \n• Negotiated and executed Agreements including Distribution, Licensing, Clinical Trials, Consulting, Contract Manufacturing, Co-marketing and Co-promotion. \n• Served as Chief Compliance Officer; Conducted internal investigations; Supervised corporate audits and implemented remediation plans.  \n• Developed and established FCPA procedures and Anti-Corruption/Anti-Bribery training programs. Worked across all business lines to ensure implementation of appropriate policies, training, auditing and other compliance controls. \n• Prepared regular reports of compliance findings and presented such reports and training to Senior Business Leaders.  \n• Established and implemented new systems and processes to monitor and audit activities and further compliance monitoring and auditing programs. \n• Served as a member of the Country Leadership Team. Senior Corporate Counsel Pfizer Inc. August 2004  –  September 2008  (4 years 2 months) Greater New York City Area •\tManaged worldwide antitrust matters for Pharmaceutical, Consumer and Animal Health Businesses, including counseling clients on mergers & acquisitions, pricing and promotional planning, distribution arrangements, price-discrimination and other competition issues. \n•\tAdvocated and defended Company interests in antitrust merger and conduct investigations in the U.S., EU, and other jurisdictions including Canada, Mexico, and Brazil. \n•\tCoordinated regulatory filings on a worldwide basis and interacted with U.S., EU and other government agencies. \n•\tNegotiated and executed highly complex commercial agreements. \n•\tGlobal Product Counsel for brand marketing teams: reviewed and approved promotional materials, sales training programs, press releases and other public relations documents. Senior Corporate Counsel Pfizer Inc. August 2004  –  September 2008  (4 years 2 months) Greater New York City Area •\tManaged worldwide antitrust matters for Pharmaceutical, Consumer and Animal Health Businesses, including counseling clients on mergers & acquisitions, pricing and promotional planning, distribution arrangements, price-discrimination and other competition issues. \n•\tAdvocated and defended Company interests in antitrust merger and conduct investigations in the U.S., EU, and other jurisdictions including Canada, Mexico, and Brazil. \n•\tCoordinated regulatory filings on a worldwide basis and interacted with U.S., EU and other government agencies. \n•\tNegotiated and executed highly complex commercial agreements. \n•\tGlobal Product Counsel for brand marketing teams: reviewed and approved promotional materials, sales training programs, press releases and other public relations documents. Senior Associate Hughes Hubbard & Reed LLP 2002  –  2004  (2 years) Greater New York City Area •\tSenior Associate in Litigation Department. Concentration in Antitrust & Competition matters; Intellectual Property Licensing; Consumer Protection matters; Securities Litigation and Counseling. \n•\tLitigated complex matters in federal and state courts and managed investigations before the Federal Trade Commission, U.S. Department of Justice, Antitrust Division, and the Securities and Exchange Commission. \n•\tManaged all aspects of discovery, including taking and defending depositions, and responding to government subpoenas or access letters. \n•\tDrafted pleadings, briefs, responses to government inquiries, and various government filings.  \n•\tPrepared and maintained budgets and established budget projections for clients.  \n•\tSupervised and managed mid-level/junior associates on client matters. Senior Associate Hughes Hubbard & Reed LLP 2002  –  2004  (2 years) Greater New York City Area •\tSenior Associate in Litigation Department. Concentration in Antitrust & Competition matters; Intellectual Property Licensing; Consumer Protection matters; Securities Litigation and Counseling. \n•\tLitigated complex matters in federal and state courts and managed investigations before the Federal Trade Commission, U.S. Department of Justice, Antitrust Division, and the Securities and Exchange Commission. \n•\tManaged all aspects of discovery, including taking and defending depositions, and responding to government subpoenas or access letters. \n•\tDrafted pleadings, briefs, responses to government inquiries, and various government filings.  \n•\tPrepared and maintained budgets and established budget projections for clients.  \n•\tSupervised and managed mid-level/junior associates on client matters. Attorney Advisor to FTC Commissioner; Senior Antitrust Attorney Federal Trade Commission 1999  –  2002  (3 years) OFFICE OF COMMISSIONER THOMAS B. LEARY\tWashington, DC \nAttorney Advisor\t \n•\tAdvised Commissioner on antitrust, consumer protection, and privacy matters before the Commission. \n•\tPrepared Commissioner for meetings with business representatives, industry leaders, Members of Congress, and consumer advocacy organizations. \n•\tDrafted Commissioner’s statements, testimony, and speeches on antitrust and consumer protection matters. \nNORTHEAST REGION\tNew York, NY \nSenior Attorney\t \n•\tInvestigated and negotiated consent decrees involving alleged antitrust conduct violations. \n•\tAdvised foreign governments on the creation and implementation of effective antitrust enforcement policies. \n•\tLitigated cases in federal district court, deposed witnesses, argued motions, and negotiated consent orders. \n•\tInvestigated alleged privacy violations, false advertising, and deceptive marketing practices. \n•\tLed and managed staff attorneys on antitrust and consumer protection investigations. \nAWARDS: \n•\tSTEPHEN NYE AWARD–OCTOBER 2001, for outstanding service to the FTC.  \n•\tPERFORMANCE AWARD–DECEMBER 2000, for outstanding performance. Attorney Advisor to FTC Commissioner; Senior Antitrust Attorney Federal Trade Commission 1999  –  2002  (3 years) OFFICE OF COMMISSIONER THOMAS B. LEARY\tWashington, DC \nAttorney Advisor\t \n•\tAdvised Commissioner on antitrust, consumer protection, and privacy matters before the Commission. \n•\tPrepared Commissioner for meetings with business representatives, industry leaders, Members of Congress, and consumer advocacy organizations. \n•\tDrafted Commissioner’s statements, testimony, and speeches on antitrust and consumer protection matters. \nNORTHEAST REGION\tNew York, NY \nSenior Attorney\t \n•\tInvestigated and negotiated consent decrees involving alleged antitrust conduct violations. \n•\tAdvised foreign governments on the creation and implementation of effective antitrust enforcement policies. \n•\tLitigated cases in federal district court, deposed witnesses, argued motions, and negotiated consent orders. \n•\tInvestigated alleged privacy violations, false advertising, and deceptive marketing practices. \n•\tLed and managed staff attorneys on antitrust and consumer protection investigations. \nAWARDS: \n•\tSTEPHEN NYE AWARD–OCTOBER 2001, for outstanding service to the FTC.  \n•\tPERFORMANCE AWARD–DECEMBER 2000, for outstanding performance. Federal Prosecutor United States Government 1997  –  1999  (2 years) •\tLitigated federal cases: handled three trials as first-chair; two as co-chair; and two as second-chair;  \n•\tWrote post-trial and appellate briefs, and negotiated settlements. Federal Prosecutor United States Government 1997  –  1999  (2 years) •\tLitigated federal cases: handled three trials as first-chair; two as co-chair; and two as second-chair;  \n•\tWrote post-trial and appellate briefs, and negotiated settlements. Clerkship The White House, Office of Counsel to the President 1996  –  1996  (less than a year) Washington D.C. Metro Area •\tResearched and prepared legal memoranda for Associate Counsels to the President. \n•\tAnalyzed federal legislation, legislation drafts, and issues related to legal ethics. Clerkship The White House, Office of Counsel to the President 1996  –  1996  (less than a year) Washington D.C. Metro Area •\tResearched and prepared legal memoranda for Associate Counsels to the President. \n•\tAnalyzed federal legislation, legislation drafts, and issues related to legal ethics. Languages English French Spanish Hebrew English French Spanish Hebrew English French Spanish Hebrew Skills Antitrust Advertising Commercial Litigation Mergers Licensing Compliance FCPA Business Development Privacy Law Joint Ventures Litigation Regulatory Affairs Corporate Governance Legal Research Patent Prosecution Intellectual Property Patents Competition Law International Law Employment Law Corporate Law Due Diligence Trade Secrets Trademarks Legal Advice Legal Writing Patent Litigation Pharmaceutical Industry See 13+     See less Skills  Antitrust Advertising Commercial Litigation Mergers Licensing Compliance FCPA Business Development Privacy Law Joint Ventures Litigation Regulatory Affairs Corporate Governance Legal Research Patent Prosecution Intellectual Property Patents Competition Law International Law Employment Law Corporate Law Due Diligence Trade Secrets Trademarks Legal Advice Legal Writing Patent Litigation Pharmaceutical Industry See 13+     See less Antitrust Advertising Commercial Litigation Mergers Licensing Compliance FCPA Business Development Privacy Law Joint Ventures Litigation Regulatory Affairs Corporate Governance Legal Research Patent Prosecution Intellectual Property Patents Competition Law International Law Employment Law Corporate Law Due Diligence Trade Secrets Trademarks Legal Advice Legal Writing Patent Litigation Pharmaceutical Industry See 13+     See less Antitrust Advertising Commercial Litigation Mergers Licensing Compliance FCPA Business Development Privacy Law Joint Ventures Litigation Regulatory Affairs Corporate Governance Legal Research Patent Prosecution Intellectual Property Patents Competition Law International Law Employment Law Corporate Law Due Diligence Trade Secrets Trademarks Legal Advice Legal Writing Patent Litigation Pharmaceutical Industry See 13+     See less Education University of Michigan Law School J.D.,  Law 1994  – 1997 Dean's Scholar Tufts University B.A.,  Philosophy 1988  – 1992 Dean's List United Nations International School High School 1988 University of Michigan Law School J.D.,  Law 1994  – 1997 Dean's Scholar University of Michigan Law School J.D.,  Law 1994  – 1997 Dean's Scholar University of Michigan Law School J.D.,  Law 1994  – 1997 Dean's Scholar Tufts University B.A.,  Philosophy 1988  – 1992 Dean's List Tufts University B.A.,  Philosophy 1988  – 1992 Dean's List Tufts University B.A.,  Philosophy 1988  – 1992 Dean's List United Nations International School High School 1988 United Nations International School High School 1988 United Nations International School High School 1988 ", "Summary Senior corporate in-house attorney.  \nFields: covering extensive legal fields: M&A and exit, project finance, foreign investment and international business transactions and dispute-resolutions; financial and securities laws, intellectual property, renewable energy law, real-estate transactions, IT laws, and traditional legal and compliance areas  \nIndustry: Renewable energy; financial services; IT service and device; e-commerce, telecommunication; consumer products, toiletry, wholesale, logistics, retail, entertainment. Summary Senior corporate in-house attorney.  \nFields: covering extensive legal fields: M&A and exit, project finance, foreign investment and international business transactions and dispute-resolutions; financial and securities laws, intellectual property, renewable energy law, real-estate transactions, IT laws, and traditional legal and compliance areas  \nIndustry: Renewable energy; financial services; IT service and device; e-commerce, telecommunication; consumer products, toiletry, wholesale, logistics, retail, entertainment. Senior corporate in-house attorney.  \nFields: covering extensive legal fields: M&A and exit, project finance, foreign investment and international business transactions and dispute-resolutions; financial and securities laws, intellectual property, renewable energy law, real-estate transactions, IT laws, and traditional legal and compliance areas  \nIndustry: Renewable energy; financial services; IT service and device; e-commerce, telecommunication; consumer products, toiletry, wholesale, logistics, retail, entertainment. Senior corporate in-house attorney.  \nFields: covering extensive legal fields: M&A and exit, project finance, foreign investment and international business transactions and dispute-resolutions; financial and securities laws, intellectual property, renewable energy law, real-estate transactions, IT laws, and traditional legal and compliance areas  \nIndustry: Renewable energy; financial services; IT service and device; e-commerce, telecommunication; consumer products, toiletry, wholesale, logistics, retail, entertainment. Experience Legal Director Japan,. Senior Legal Counsel SunEdison February 2014  – Present (1 year 7 months) Legal Counsel, Legal Director Japan, head of administrative Dept Gestamp Asetym Solar April 2013  –  January 2014  (10 months) tokyo, japan General Counsel (Japan) Liquidnet March 2008  –  January 2013  (4 years 11 months) Tokyo, Japan Legal Director, Japan Motorola Japan Limited September 2006  –  March 2008  (1 year 7 months) Tokyo, Japan Associate Manager, Legal Department Kao Corporation February 2001  –  September 2006  (5 years 8 months) Tokyo, Japan Assistant Manager, Legal Mycal Corporation April 1994  –  February 2001  (6 years 11 months) Osaka, Japan Visitor Attorney Hughes Hubbard & Reed LLP January 1997  –  April 1998  (1 year 4 months) New York City, NY, USA Legal Director Japan,. Senior Legal Counsel SunEdison February 2014  – Present (1 year 7 months) Legal Director Japan,. Senior Legal Counsel SunEdison February 2014  – Present (1 year 7 months) Legal Counsel, Legal Director Japan, head of administrative Dept Gestamp Asetym Solar April 2013  –  January 2014  (10 months) tokyo, japan Legal Counsel, Legal Director Japan, head of administrative Dept Gestamp Asetym Solar April 2013  –  January 2014  (10 months) tokyo, japan General Counsel (Japan) Liquidnet March 2008  –  January 2013  (4 years 11 months) Tokyo, Japan General Counsel (Japan) Liquidnet March 2008  –  January 2013  (4 years 11 months) Tokyo, Japan Legal Director, Japan Motorola Japan Limited September 2006  –  March 2008  (1 year 7 months) Tokyo, Japan Legal Director, Japan Motorola Japan Limited September 2006  –  March 2008  (1 year 7 months) Tokyo, Japan Associate Manager, Legal Department Kao Corporation February 2001  –  September 2006  (5 years 8 months) Tokyo, Japan Associate Manager, Legal Department Kao Corporation February 2001  –  September 2006  (5 years 8 months) Tokyo, Japan Assistant Manager, Legal Mycal Corporation April 1994  –  February 2001  (6 years 11 months) Osaka, Japan Assistant Manager, Legal Mycal Corporation April 1994  –  February 2001  (6 years 11 months) Osaka, Japan Visitor Attorney Hughes Hubbard & Reed LLP January 1997  –  April 1998  (1 year 4 months) New York City, NY, USA Visitor Attorney Hughes Hubbard & Reed LLP January 1997  –  April 1998  (1 year 4 months) New York City, NY, USA Languages English Native or bilingual proficiency Russian Limited working proficiency Chinese Limited working proficiency Korean Elementary proficiency French Limited working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Russian Limited working proficiency Chinese Limited working proficiency Korean Elementary proficiency French Limited working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Russian Limited working proficiency Chinese Limited working proficiency Korean Elementary proficiency French Limited working proficiency Spanish Elementary proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Elementary proficiency Limited working proficiency Elementary proficiency Skills Corporate Law Joint Ventures Securities Regulation IT law Business Strategy Legal Advice Corporate Governance Cross-border M&A Foreign Investment Real Estate Transactions Anti-corruption Project Finance Figure Skating Mergers & Acquisitions IPO Contracts Equities Intellectual Property Contract Negotiation Licensing Renewable Energy Law Real Estate Development Strategic Consulting Photovoltaics Legal Research Skills Strategy IPO law IP license SOX law compliance anti-monopoly playing tennis GK-TK structure EPC Power purchase agreement Japanese law English language skills Russian language skills... Chinese language skills... French language skills Certified Financial... Bookkeeping Background Checks Anti Money Laundering French See 29+     See less Skills  Corporate Law Joint Ventures Securities Regulation IT law Business Strategy Legal Advice Corporate Governance Cross-border M&A Foreign Investment Real Estate Transactions Anti-corruption Project Finance Figure Skating Mergers & Acquisitions IPO Contracts Equities Intellectual Property Contract Negotiation Licensing Renewable Energy Law Real Estate Development Strategic Consulting Photovoltaics Legal Research Skills Strategy IPO law IP license SOX law compliance anti-monopoly playing tennis GK-TK structure EPC Power purchase agreement Japanese law English language skills Russian language skills... Chinese language skills... French language skills Certified Financial... Bookkeeping Background Checks Anti Money Laundering French See 29+     See less Corporate Law Joint Ventures Securities Regulation IT law Business Strategy Legal Advice Corporate Governance Cross-border M&A Foreign Investment Real Estate Transactions Anti-corruption Project Finance Figure Skating Mergers & Acquisitions IPO Contracts Equities Intellectual Property Contract Negotiation Licensing Renewable Energy Law Real Estate Development Strategic Consulting Photovoltaics Legal Research Skills Strategy IPO law IP license SOX law compliance anti-monopoly playing tennis GK-TK structure EPC Power purchase agreement Japanese law English language skills Russian language skills... Chinese language skills... French language skills Certified Financial... Bookkeeping Background Checks Anti Money Laundering French See 29+     See less Corporate Law Joint Ventures Securities Regulation IT law Business Strategy Legal Advice Corporate Governance Cross-border M&A Foreign Investment Real Estate Transactions Anti-corruption Project Finance Figure Skating Mergers & Acquisitions IPO Contracts Equities Intellectual Property Contract Negotiation Licensing Renewable Energy Law Real Estate Development Strategic Consulting Photovoltaics Legal Research Skills Strategy IPO law IP license SOX law compliance anti-monopoly playing tennis GK-TK structure EPC Power purchase agreement Japanese law English language skills Russian language skills... Chinese language skills... French language skills Certified Financial... Bookkeeping Background Checks Anti Money Laundering French See 29+     See less Education The University of Hong Kong, Asian Institute of Financial Law Visitor fellow 2004  – 2005 Sophia University Master 1991  – 1994 University of Pennsylvania Law School LL.M. 1992  – 1993 Sophia University B.A. 1987  – 1991 The University of Hong Kong, Asian Institute of Financial Law Visitor fellow 2004  – 2005 The University of Hong Kong, Asian Institute of Financial Law Visitor fellow 2004  – 2005 The University of Hong Kong, Asian Institute of Financial Law Visitor fellow 2004  – 2005 Sophia University Master 1991  – 1994 Sophia University Master 1991  – 1994 Sophia University Master 1991  – 1994 University of Pennsylvania Law School LL.M. 1992  – 1993 University of Pennsylvania Law School LL.M. 1992  – 1993 University of Pennsylvania Law School LL.M. 1992  – 1993 Sophia University B.A. 1987  – 1991 Sophia University B.A. 1987  – 1991 Sophia University B.A. 1987  – 1991 Honors & Awards Additional Honors & Awards Sophia University Awards in 1987 and 1991. Additional Honors & Awards Sophia University Awards in 1987 and 1991. Additional Honors & Awards Sophia University Awards in 1987 and 1991. Additional Honors & Awards Sophia University Awards in 1987 and 1991. ", "Experience Legal Director Brazil & Latin America Bristol-Myers Squibb June 2014  – Present (1 year 3 months) Sao Paulo Legal Director Brazil & South America Bristol-Myers Squibb September 2012  –  June 2014  (1 year 10 months) Legal Director Brazil Bristol-Myers Squibb November 2011  –  September 2012  (11 months) Associate Legal Director Brazil Bristol-Myers Squibb July 2009  –  November 2011  (2 years 5 months) Legal Director Brazil & Latin America Bristol-Myers Squibb June 2014  – Present (1 year 3 months) Sao Paulo Legal Director Brazil & Latin America Bristol-Myers Squibb June 2014  – Present (1 year 3 months) Sao Paulo Legal Director Brazil & South America Bristol-Myers Squibb September 2012  –  June 2014  (1 year 10 months) Legal Director Brazil & South America Bristol-Myers Squibb September 2012  –  June 2014  (1 year 10 months) Legal Director Brazil Bristol-Myers Squibb November 2011  –  September 2012  (11 months) Legal Director Brazil Bristol-Myers Squibb November 2011  –  September 2012  (11 months) Associate Legal Director Brazil Bristol-Myers Squibb July 2009  –  November 2011  (2 years 5 months) Associate Legal Director Brazil Bristol-Myers Squibb July 2009  –  November 2011  (2 years 5 months) Skills Biotechnology Oncology Pharmaceutical Industry Clinical Development Regulatory Affairs Market Access Competition Law GMP Clinical Trials Litigation Corporate Governance Pharmacovigilance Legal Advice Skills  Biotechnology Oncology Pharmaceutical Industry Clinical Development Regulatory Affairs Market Access Competition Law GMP Clinical Trials Litigation Corporate Governance Pharmacovigilance Legal Advice Biotechnology Oncology Pharmaceutical Industry Clinical Development Regulatory Affairs Market Access Competition Law GMP Clinical Trials Litigation Corporate Governance Pharmacovigilance Legal Advice Biotechnology Oncology Pharmaceutical Industry Clinical Development Regulatory Affairs Market Access Competition Law GMP Clinical Trials Litigation Corporate Governance Pharmacovigilance Legal Advice Education Law Degree Law Degree Law Degree Law Degree "]}