{"position": "Metrics & Reporting Analyst IV", "company": "Google", "profiles": ["Skills Business Analysis Databases Business Intelligence ASP SDLC ETL Software Project... ASP.NET Crystal Reports Visio Agile Methodologies IT Strategy Vendor Management Requirements Analysis Skills  Business Analysis Databases Business Intelligence ASP SDLC ETL Software Project... ASP.NET Crystal Reports Visio Agile Methodologies IT Strategy Vendor Management Requirements Analysis Business Analysis Databases Business Intelligence ASP SDLC ETL Software Project... ASP.NET Crystal Reports Visio Agile Methodologies IT Strategy Vendor Management Requirements Analysis Business Analysis Databases Business Intelligence ASP SDLC ETL Software Project... ASP.NET Crystal Reports Visio Agile Methodologies IT Strategy Vendor Management Requirements Analysis ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Wireless Project Management Telecommunications Process Improvement Business Process Leadership Cross-functional Team... Vendor Management Call Centers Troubleshooting Strategic Partnerships Mobile Devices Customer Experience Customer Satisfaction Account Management Customer Retention Product Management VoIP Salesforce.com CRM Team Building Management Analysis Customer Service Microsoft Office Program Management Strategic Planning See 12+     See less Skills  Wireless Project Management Telecommunications Process Improvement Business Process Leadership Cross-functional Team... Vendor Management Call Centers Troubleshooting Strategic Partnerships Mobile Devices Customer Experience Customer Satisfaction Account Management Customer Retention Product Management VoIP Salesforce.com CRM Team Building Management Analysis Customer Service Microsoft Office Program Management Strategic Planning See 12+     See less Wireless Project Management Telecommunications Process Improvement Business Process Leadership Cross-functional Team... Vendor Management Call Centers Troubleshooting Strategic Partnerships Mobile Devices Customer Experience Customer Satisfaction Account Management Customer Retention Product Management VoIP Salesforce.com CRM Team Building Management Analysis Customer Service Microsoft Office Program Management Strategic Planning See 12+     See less Wireless Project Management Telecommunications Process Improvement Business Process Leadership Cross-functional Team... Vendor Management Call Centers Troubleshooting Strategic Partnerships Mobile Devices Customer Experience Customer Satisfaction Account Management Customer Retention Product Management VoIP Salesforce.com CRM Team Building Management Analysis Customer Service Microsoft Office Program Management Strategic Planning See 12+     See less Honors & Awards ", "Experience Metrics and Reporting Analyst CB&I June 2015  – Present (3 months) Aiken, South Carolina As the Metrics and Reporting Analyst I am responsible for generating and reporting data in support of corporate and independent assessments. I assist the Director of Performance, Planning & Integration in performing field verifications, communicating with the Board of Governors, NNSA, MOX President and the Executive Team regarding special projects and on-going activities. I am also responsible for identifying cost, planning, scheduling trends and suggesting corrective actions. \nI collaborate with the Director of Performance, Planning & Integration in performing special projects for the Executive Team, NNSA, MOX President and Board of Governors, generate data, compile reports and create presentations using credible, accurate information. I assist in the production of the project review meeting package, communicate and serve as a liaison to ensure the successful completion of goals, assist in performing field verifications, document the variances between actual vs. stated materials, and work closely with project stakeholders to review project schedules and other performance metrics to verify: \n• EVM (Earned Value Management) \n• Cost analysis estimates \n• Baselining \n• Earned Value \n• Planned Value \n• Actual Value \n• Performance Measurement Baseline  \nI document and provide schedule analysis, schedule risk analyses and programmatic schedule assessments, develop and evaluate project performance metrics, support all Corporate and independent reviews including providing pre and post review documents, nondisclosure agreement (NDA) signatures, code of conduct (COC) signatures, presentations and system explanations, provide variance analysis and corrective actions and perform analyses of trends, develop reports, facilitate communication and provide feedback to customers. Project Controls - Scheduler CB&I April 2010  –  June 2015  (5 years 3 months) Savannah River Site, Aiken, SC Construction Scheduler, duties include: Office Manager The Augusta Chronicle March 2001  –  April 2010  (9 years 2 months) Metrics and Reporting Analyst CB&I June 2015  – Present (3 months) Aiken, South Carolina As the Metrics and Reporting Analyst I am responsible for generating and reporting data in support of corporate and independent assessments. I assist the Director of Performance, Planning & Integration in performing field verifications, communicating with the Board of Governors, NNSA, MOX President and the Executive Team regarding special projects and on-going activities. I am also responsible for identifying cost, planning, scheduling trends and suggesting corrective actions. \nI collaborate with the Director of Performance, Planning & Integration in performing special projects for the Executive Team, NNSA, MOX President and Board of Governors, generate data, compile reports and create presentations using credible, accurate information. I assist in the production of the project review meeting package, communicate and serve as a liaison to ensure the successful completion of goals, assist in performing field verifications, document the variances between actual vs. stated materials, and work closely with project stakeholders to review project schedules and other performance metrics to verify: \n• EVM (Earned Value Management) \n• Cost analysis estimates \n• Baselining \n• Earned Value \n• Planned Value \n• Actual Value \n• Performance Measurement Baseline  \nI document and provide schedule analysis, schedule risk analyses and programmatic schedule assessments, develop and evaluate project performance metrics, support all Corporate and independent reviews including providing pre and post review documents, nondisclosure agreement (NDA) signatures, code of conduct (COC) signatures, presentations and system explanations, provide variance analysis and corrective actions and perform analyses of trends, develop reports, facilitate communication and provide feedback to customers. Metrics and Reporting Analyst CB&I June 2015  – Present (3 months) Aiken, South Carolina As the Metrics and Reporting Analyst I am responsible for generating and reporting data in support of corporate and independent assessments. I assist the Director of Performance, Planning & Integration in performing field verifications, communicating with the Board of Governors, NNSA, MOX President and the Executive Team regarding special projects and on-going activities. I am also responsible for identifying cost, planning, scheduling trends and suggesting corrective actions. \nI collaborate with the Director of Performance, Planning & Integration in performing special projects for the Executive Team, NNSA, MOX President and Board of Governors, generate data, compile reports and create presentations using credible, accurate information. I assist in the production of the project review meeting package, communicate and serve as a liaison to ensure the successful completion of goals, assist in performing field verifications, document the variances between actual vs. stated materials, and work closely with project stakeholders to review project schedules and other performance metrics to verify: \n• EVM (Earned Value Management) \n• Cost analysis estimates \n• Baselining \n• Earned Value \n• Planned Value \n• Actual Value \n• Performance Measurement Baseline  \nI document and provide schedule analysis, schedule risk analyses and programmatic schedule assessments, develop and evaluate project performance metrics, support all Corporate and independent reviews including providing pre and post review documents, nondisclosure agreement (NDA) signatures, code of conduct (COC) signatures, presentations and system explanations, provide variance analysis and corrective actions and perform analyses of trends, develop reports, facilitate communication and provide feedback to customers. Project Controls - Scheduler CB&I April 2010  –  June 2015  (5 years 3 months) Savannah River Site, Aiken, SC Construction Scheduler, duties include: Project Controls - Scheduler CB&I April 2010  –  June 2015  (5 years 3 months) Savannah River Site, Aiken, SC Construction Scheduler, duties include: Office Manager The Augusta Chronicle March 2001  –  April 2010  (9 years 2 months) Office Manager The Augusta Chronicle March 2001  –  April 2010  (9 years 2 months) Skills Strategic Planning Microsoft Excel Customer Service Microsoft Office Social Media Event Planning Team Building Public Speaking PowerPoint Process Scheduler Microsoft Word Skills  Strategic Planning Microsoft Excel Customer Service Microsoft Office Social Media Event Planning Team Building Public Speaking PowerPoint Process Scheduler Microsoft Word Strategic Planning Microsoft Excel Customer Service Microsoft Office Social Media Event Planning Team Building Public Speaking PowerPoint Process Scheduler Microsoft Word Strategic Planning Microsoft Excel Customer Service Microsoft Office Social Media Event Planning Team Building Public Speaking PowerPoint Process Scheduler Microsoft Word Education University of South Carolina B.A.,  Communications University of South Carolina B.A.,  Communications University of South Carolina B.A.,  Communications University of South Carolina B.A.,  Communications ", "Experience HR Metrics and Reporting Analyst Lancet Laboratories October 2012  – Present (2 years 11 months) HR Metrics and Reporting Analyst HR Information Analyst Edcon October 2010  –  September 2012  (2 years) Edcon Head Office _ JHB Data Analyst Alexander Forbes (U) Ltd October 2005  –  September 2010  (5 years) HR Metrics and Reporting Analyst Lancet Laboratories October 2012  – Present (2 years 11 months) HR Metrics and Reporting Analyst HR Metrics and Reporting Analyst Lancet Laboratories October 2012  – Present (2 years 11 months) HR Metrics and Reporting Analyst HR Information Analyst Edcon October 2010  –  September 2012  (2 years) Edcon Head Office _ JHB HR Information Analyst Edcon October 2010  –  September 2012  (2 years) Edcon Head Office _ JHB Data Analyst Alexander Forbes (U) Ltd October 2005  –  September 2010  (5 years) Data Analyst Alexander Forbes (U) Ltd October 2005  –  September 2010  (5 years) Skills Human Resources Microsoft Excel Data Analysis Microsoft Office Project Management Outlook Performance Management Access Data Warehousing PowerPoint Skills  Human Resources Microsoft Excel Data Analysis Microsoft Office Project Management Outlook Performance Management Access Data Warehousing PowerPoint Human Resources Microsoft Excel Data Analysis Microsoft Office Project Management Outlook Performance Management Access Data Warehousing PowerPoint Human Resources Microsoft Excel Data Analysis Microsoft Office Project Management Outlook Performance Management Access Data Warehousing PowerPoint Education INTEC College Management Information Systems 2010  – 2012 CIDA City Campus Bachelor of Business Administration (BBA),  HR and Marketing 2001  – 2005 CIDA ICT Academy A+, N+, ICDL, NQF 4 Tech Support,  A+, N+, ICDL, NQF 4 Tech Support 2003  – 2004 INTEC College Management Information Systems 2010  – 2012 INTEC College Management Information Systems 2010  – 2012 INTEC College Management Information Systems 2010  – 2012 CIDA City Campus Bachelor of Business Administration (BBA),  HR and Marketing 2001  – 2005 CIDA City Campus Bachelor of Business Administration (BBA),  HR and Marketing 2001  – 2005 CIDA City Campus Bachelor of Business Administration (BBA),  HR and Marketing 2001  – 2005 CIDA ICT Academy A+, N+, ICDL, NQF 4 Tech Support,  A+, N+, ICDL, NQF 4 Tech Support 2003  – 2004 CIDA ICT Academy A+, N+, ICDL, NQF 4 Tech Support,  A+, N+, ICDL, NQF 4 Tech Support 2003  – 2004 CIDA ICT Academy A+, N+, ICDL, NQF 4 Tech Support,  A+, N+, ICDL, NQF 4 Tech Support 2003  – 2004 ", "Experience Sr Metrics and Reporting Analyst BorrowersFirst, Inc. June 2015  – Present (3 months) BI Engineer GTECH S.p.A. September 2014  –  June 2015  (10 months) Metrics and Reporting Advisor Dell May 2011  –  August 2014  (3 years 4 months) Metrics and Reporting Advisor Dell Financial Services January 2009  –  May 2011  (2 years 5 months) Consultant - Analyst at DFS HigherOut September 2008  –  January 2009  (5 months) Metrics and Reporting Analyst Dell Financial Services August 2005  –  September 2007  (2 years 2 months) Enterprise Reporting Analyst Education Finance Partners 2007  –  2007  (less than a year) Sr Metrics and Reporting Analyst BorrowersFirst, Inc. June 2015  – Present (3 months) Sr Metrics and Reporting Analyst BorrowersFirst, Inc. June 2015  – Present (3 months) BI Engineer GTECH S.p.A. September 2014  –  June 2015  (10 months) BI Engineer GTECH S.p.A. September 2014  –  June 2015  (10 months) Metrics and Reporting Advisor Dell May 2011  –  August 2014  (3 years 4 months) Metrics and Reporting Advisor Dell May 2011  –  August 2014  (3 years 4 months) Metrics and Reporting Advisor Dell Financial Services January 2009  –  May 2011  (2 years 5 months) Metrics and Reporting Advisor Dell Financial Services January 2009  –  May 2011  (2 years 5 months) Consultant - Analyst at DFS HigherOut September 2008  –  January 2009  (5 months) Consultant - Analyst at DFS HigherOut September 2008  –  January 2009  (5 months) Metrics and Reporting Analyst Dell Financial Services August 2005  –  September 2007  (2 years 2 months) Metrics and Reporting Analyst Dell Financial Services August 2005  –  September 2007  (2 years 2 months) Enterprise Reporting Analyst Education Finance Partners 2007  –  2007  (less than a year) Enterprise Reporting Analyst Education Finance Partners 2007  –  2007  (less than a year) Skills Metrics Business Analysis Process Improvement Requirements Analysis Business Objects Access Data Analysis Skills  Metrics Business Analysis Process Improvement Requirements Analysis Business Objects Access Data Analysis Metrics Business Analysis Process Improvement Requirements Analysis Business Objects Access Data Analysis Metrics Business Analysis Process Improvement Requirements Analysis Business Objects Access Data Analysis Education American InterContinental University Master's,  Information Technology 2003  – 2005 Arizona State University West BS,  Accountancy 1999  – 2001 American InterContinental University Master's,  Information Technology 2003  – 2005 American InterContinental University Master's,  Information Technology 2003  – 2005 American InterContinental University Master's,  Information Technology 2003  – 2005 Arizona State University West BS,  Accountancy 1999  – 2001 Arizona State University West BS,  Accountancy 1999  – 2001 Arizona State University West BS,  Accountancy 1999  – 2001 ", "Summary Melissa graduated from Providence College with a Bachelor's Degree in Finance and a Bachelor’s Degree in Management. She is currently apart of the Expense Management team at Unum as a Metrics and Reporting Analyst. She recently ended her career at RSA/EMC as an Associate Financial Analyst and as a member of EMC’s Finance Training Program (FTP). Summary Melissa graduated from Providence College with a Bachelor's Degree in Finance and a Bachelor’s Degree in Management. She is currently apart of the Expense Management team at Unum as a Metrics and Reporting Analyst. She recently ended her career at RSA/EMC as an Associate Financial Analyst and as a member of EMC’s Finance Training Program (FTP). Melissa graduated from Providence College with a Bachelor's Degree in Finance and a Bachelor’s Degree in Management. She is currently apart of the Expense Management team at Unum as a Metrics and Reporting Analyst. She recently ended her career at RSA/EMC as an Associate Financial Analyst and as a member of EMC’s Finance Training Program (FTP). Melissa graduated from Providence College with a Bachelor's Degree in Finance and a Bachelor’s Degree in Management. She is currently apart of the Expense Management team at Unum as a Metrics and Reporting Analyst. She recently ended her career at RSA/EMC as an Associate Financial Analyst and as a member of EMC’s Finance Training Program (FTP). Experience Metrics & Reporting Analyst III Unum July 2015  – Present (2 months) Portland, ME Associate Financial Analyst RSA The Security Division of EMC July 2013  –  July 2015  (2 years 1 month) Bedford, MA • Manages America’s Expense Forecast and Close processes ($150M Budget) \n• Generates Attrition Reporting \n• Assists in cost center strategy and alignment changes \n• Produces quarterly Product Line P&L \n• Assists with the Channel SecurWorld Co-Op Program  \n Financial Training Program EMC 2013  –  May 2015  (2 years) Hopkinton, MA Competitive Training Program consisting of 5 Training Modules led by Babson MBA Professors, providing exposure to EMC Finance Executives through strategic group presentations. Client Services Intern RSi September 2012  –  May 2013  (9 months) Cranston, RI • Segmented Retail Intelligence User Manual into concentrated how-to guides \n• Aided with data valuation support  \n• Managed the Weekly Reporting Client List \n Financial Analyst Intern Woodard & Curran May 2011  –  September 2012  (1 year 5 months) Portland, Maine Area • Assisted in data analysis and forecasting projections for budgeting purposes \n• Utilized multiple programs (Microsoft, Satori, Deltek) to generate and analyze financial data \n• Helped to manage prepaid expenses and fixed asset account processes \n Office Assistant Providence College Women's Basketball September 2009  –  May 2012  (2 years 9 months) Providence, Rhode Island Area • Generated recruiting database through Microsoft Excel \n• Produced and sent recruiting letters  \n• Assisted with generic secretarial duties \n Metrics & Reporting Analyst III Unum July 2015  – Present (2 months) Portland, ME Metrics & Reporting Analyst III Unum July 2015  – Present (2 months) Portland, ME Associate Financial Analyst RSA The Security Division of EMC July 2013  –  July 2015  (2 years 1 month) Bedford, MA • Manages America’s Expense Forecast and Close processes ($150M Budget) \n• Generates Attrition Reporting \n• Assists in cost center strategy and alignment changes \n• Produces quarterly Product Line P&L \n• Assists with the Channel SecurWorld Co-Op Program  \n Associate Financial Analyst RSA The Security Division of EMC July 2013  –  July 2015  (2 years 1 month) Bedford, MA • Manages America’s Expense Forecast and Close processes ($150M Budget) \n• Generates Attrition Reporting \n• Assists in cost center strategy and alignment changes \n• Produces quarterly Product Line P&L \n• Assists with the Channel SecurWorld Co-Op Program  \n Financial Training Program EMC 2013  –  May 2015  (2 years) Hopkinton, MA Competitive Training Program consisting of 5 Training Modules led by Babson MBA Professors, providing exposure to EMC Finance Executives through strategic group presentations. Financial Training Program EMC 2013  –  May 2015  (2 years) Hopkinton, MA Competitive Training Program consisting of 5 Training Modules led by Babson MBA Professors, providing exposure to EMC Finance Executives through strategic group presentations. Client Services Intern RSi September 2012  –  May 2013  (9 months) Cranston, RI • Segmented Retail Intelligence User Manual into concentrated how-to guides \n• Aided with data valuation support  \n• Managed the Weekly Reporting Client List \n Client Services Intern RSi September 2012  –  May 2013  (9 months) Cranston, RI • Segmented Retail Intelligence User Manual into concentrated how-to guides \n• Aided with data valuation support  \n• Managed the Weekly Reporting Client List \n Financial Analyst Intern Woodard & Curran May 2011  –  September 2012  (1 year 5 months) Portland, Maine Area • Assisted in data analysis and forecasting projections for budgeting purposes \n• Utilized multiple programs (Microsoft, Satori, Deltek) to generate and analyze financial data \n• Helped to manage prepaid expenses and fixed asset account processes \n Financial Analyst Intern Woodard & Curran May 2011  –  September 2012  (1 year 5 months) Portland, Maine Area • Assisted in data analysis and forecasting projections for budgeting purposes \n• Utilized multiple programs (Microsoft, Satori, Deltek) to generate and analyze financial data \n• Helped to manage prepaid expenses and fixed asset account processes \n Office Assistant Providence College Women's Basketball September 2009  –  May 2012  (2 years 9 months) Providence, Rhode Island Area • Generated recruiting database through Microsoft Excel \n• Produced and sent recruiting letters  \n• Assisted with generic secretarial duties \n Office Assistant Providence College Women's Basketball September 2009  –  May 2012  (2 years 9 months) Providence, Rhode Island Area • Generated recruiting database through Microsoft Excel \n• Produced and sent recruiting letters  \n• Assisted with generic secretarial duties \n Languages   Skills Microsoft Excel Project Management Event Planning Microsoft Office PowerPoint Account Management Advertising Time Management Social Media Marketing Social Media Customer Service Facebook Microsoft Word Teamwork Social Networking Accounting Data Analysis Outlook Leadership Finance Public Speaking Training See 7+     See less Skills  Microsoft Excel Project Management Event Planning Microsoft Office PowerPoint Account Management Advertising Time Management Social Media Marketing Social Media Customer Service Facebook Microsoft Word Teamwork Social Networking Accounting Data Analysis Outlook Leadership Finance Public Speaking Training See 7+     See less Microsoft Excel Project Management Event Planning Microsoft Office PowerPoint Account Management Advertising Time Management Social Media Marketing Social Media Customer Service Facebook Microsoft Word Teamwork Social Networking Accounting Data Analysis Outlook Leadership Finance Public Speaking Training See 7+     See less Microsoft Excel Project Management Event Planning Microsoft Office PowerPoint Account Management Advertising Time Management Social Media Marketing Social Media Customer Service Facebook Microsoft Word Teamwork Social Networking Accounting Data Analysis Outlook Leadership Finance Public Speaking Training See 7+     See less Education Providence College Finance ,  Business Management 2009  – 2013 Activities and Societies:  Future Friar Executives ,  Student Alumni Association ,  Habitat for Humanity South Portland High School 2005  – 2009 Providence College Finance ,  Business Management 2009  – 2013 Activities and Societies:  Future Friar Executives ,  Student Alumni Association ,  Habitat for Humanity Providence College Finance ,  Business Management 2009  – 2013 Activities and Societies:  Future Friar Executives ,  Student Alumni Association ,  Habitat for Humanity Providence College Finance ,  Business Management 2009  – 2013 Activities and Societies:  Future Friar Executives ,  Student Alumni Association ,  Habitat for Humanity South Portland High School 2005  – 2009 South Portland High School 2005  – 2009 South Portland High School 2005  – 2009 Honors & Awards ", "Languages Chinese Chinese Chinese Skills Balanced Scorecard Key Performance... Process Analysis and... Emptoris Contract... E-sourcing E-Sourcing and e-Auction Business Case Analysis Skills  Balanced Scorecard Key Performance... Process Analysis and... Emptoris Contract... E-sourcing E-Sourcing and e-Auction Business Case Analysis Balanced Scorecard Key Performance... Process Analysis and... Emptoris Contract... E-sourcing E-Sourcing and e-Auction Business Case Analysis Balanced Scorecard Key Performance... Process Analysis and... Emptoris Contract... E-sourcing E-Sourcing and e-Auction Business Case Analysis ", "Experience DP&S Metrics & Reporting Analyst Ally Financial Inc. / GMAC Insurance May 2003  – Present (12 years 4 months) Austin, Texas Area DP&S Metrics & Reporting Analyst \nAugust 2015 - Current \n \nThe Dealer Products & Services Metrics & Reporting Analyst is a dedicated mechanical insurance specialist providing operational reporting, data analysis, and analytical support, while working in partnership with other Ally DP&S divisions.  \nServes as the primary internal point of contact providing management and oversight of all related analytical and reporting duties with holistic focus on divisional relationships and effects on business partners.  \nResponsible for presenting requested, targeted and scheduled operational performance information in a timely, accurate, and secure manner ensuring data integrity. Continually analyze and validate accuracy of data being reported and provide trend/early-warning analysis while teaming with analytics groups throughout Ally DP&S to produce guidance cognizant of impacts to all lines of Ally work streams. \nServes as point of contact for the field staff providing targeted analytics and activity guidance.  \n \n \nDealer Products & Services Senior Account Manager \n2007 – 2015 \n \nResponsible for the profitability of Ally/GMAC mechanical insurance products within an assigned territory while developing and maintaining account relations.  \nAnalyze data, develop reports and provide technical support and assistance in training of department personnel. \nAssist Ally sales personnel in conducting joint sales contacts and serve as a resource for Ally in providing mechanical products and processing training expertise.  \nEvaluate account activity and develop a subsequent strategies for territory. Establish business goals that maximize profitability and enhance efficiency. \n \n \nAccount Service Representative \n2005 – 2007 \n \n \nCustomer Service Representative \n2003 – 2005 \n DP&S Metrics & Reporting Analyst Ally Financial Inc. / GMAC Insurance May 2003  – Present (12 years 4 months) Austin, Texas Area DP&S Metrics & Reporting Analyst \nAugust 2015 - Current \n \nThe Dealer Products & Services Metrics & Reporting Analyst is a dedicated mechanical insurance specialist providing operational reporting, data analysis, and analytical support, while working in partnership with other Ally DP&S divisions.  \nServes as the primary internal point of contact providing management and oversight of all related analytical and reporting duties with holistic focus on divisional relationships and effects on business partners.  \nResponsible for presenting requested, targeted and scheduled operational performance information in a timely, accurate, and secure manner ensuring data integrity. Continually analyze and validate accuracy of data being reported and provide trend/early-warning analysis while teaming with analytics groups throughout Ally DP&S to produce guidance cognizant of impacts to all lines of Ally work streams. \nServes as point of contact for the field staff providing targeted analytics and activity guidance.  \n \n \nDealer Products & Services Senior Account Manager \n2007 – 2015 \n \nResponsible for the profitability of Ally/GMAC mechanical insurance products within an assigned territory while developing and maintaining account relations.  \nAnalyze data, develop reports and provide technical support and assistance in training of department personnel. \nAssist Ally sales personnel in conducting joint sales contacts and serve as a resource for Ally in providing mechanical products and processing training expertise.  \nEvaluate account activity and develop a subsequent strategies for territory. Establish business goals that maximize profitability and enhance efficiency. \n \n \nAccount Service Representative \n2005 – 2007 \n \n \nCustomer Service Representative \n2003 – 2005 \n DP&S Metrics & Reporting Analyst Ally Financial Inc. / GMAC Insurance May 2003  – Present (12 years 4 months) Austin, Texas Area DP&S Metrics & Reporting Analyst \nAugust 2015 - Current \n \nThe Dealer Products & Services Metrics & Reporting Analyst is a dedicated mechanical insurance specialist providing operational reporting, data analysis, and analytical support, while working in partnership with other Ally DP&S divisions.  \nServes as the primary internal point of contact providing management and oversight of all related analytical and reporting duties with holistic focus on divisional relationships and effects on business partners.  \nResponsible for presenting requested, targeted and scheduled operational performance information in a timely, accurate, and secure manner ensuring data integrity. Continually analyze and validate accuracy of data being reported and provide trend/early-warning analysis while teaming with analytics groups throughout Ally DP&S to produce guidance cognizant of impacts to all lines of Ally work streams. \nServes as point of contact for the field staff providing targeted analytics and activity guidance.  \n \n \nDealer Products & Services Senior Account Manager \n2007 – 2015 \n \nResponsible for the profitability of Ally/GMAC mechanical insurance products within an assigned territory while developing and maintaining account relations.  \nAnalyze data, develop reports and provide technical support and assistance in training of department personnel. \nAssist Ally sales personnel in conducting joint sales contacts and serve as a resource for Ally in providing mechanical products and processing training expertise.  \nEvaluate account activity and develop a subsequent strategies for territory. Establish business goals that maximize profitability and enhance efficiency. \n \n \nAccount Service Representative \n2005 – 2007 \n \n \nCustomer Service Representative \n2003 – 2005 \n Languages English English English Skills Insurance Customer Satisfaction Relationship Management Customer Service Finance Property & Casualty... Claim Financial Analysis Forecasting Negotiation Team Building Business Relationship... Competitive Analysis New Business Development Process Improvement Customer Retention Sales Sales Operations Business Analysis Management Strategy Analysis Business Development Data Analysis Human Resources Accounting Direct Sales Team Leadership Leadership Portfolio Management Sales Management Automotive Business Planning Strategic Planning Selling Dealers Cross-functional Team... Salesforce.com Training Sales Process See 25+     See less Skills  Insurance Customer Satisfaction Relationship Management Customer Service Finance Property & Casualty... Claim Financial Analysis Forecasting Negotiation Team Building Business Relationship... Competitive Analysis New Business Development Process Improvement Customer Retention Sales Sales Operations Business Analysis Management Strategy Analysis Business Development Data Analysis Human Resources Accounting Direct Sales Team Leadership Leadership Portfolio Management Sales Management Automotive Business Planning Strategic Planning Selling Dealers Cross-functional Team... Salesforce.com Training Sales Process See 25+     See less Insurance Customer Satisfaction Relationship Management Customer Service Finance Property & Casualty... Claim Financial Analysis Forecasting Negotiation Team Building Business Relationship... Competitive Analysis New Business Development Process Improvement Customer Retention Sales Sales Operations Business Analysis Management Strategy Analysis Business Development Data Analysis Human Resources Accounting Direct Sales Team Leadership Leadership Portfolio Management Sales Management Automotive Business Planning Strategic Planning Selling Dealers Cross-functional Team... Salesforce.com Training Sales Process See 25+     See less Insurance Customer Satisfaction Relationship Management Customer Service Finance Property & Casualty... Claim Financial Analysis Forecasting Negotiation Team Building Business Relationship... Competitive Analysis New Business Development Process Improvement Customer Retention Sales Sales Operations Business Analysis Management Strategy Analysis Business Development Data Analysis Human Resources Accounting Direct Sales Team Leadership Leadership Portfolio Management Sales Management Automotive Business Planning Strategic Planning Selling Dealers Cross-functional Team... Salesforce.com Training Sales Process See 25+     See less Education Harper College Criminal Justice 1998  – 2002 Harper College Criminal Justice 1998  – 2002 Harper College Criminal Justice 1998  – 2002 Harper College Criminal Justice 1998  – 2002 ", "Experience Metrics Reporting Analyst PeopleScout March 2012  – Present (3 years 6 months) Dallas/Fort Worth Area Excel Programmer Residential Credit Solutions, Inc July 2010  –  January 2012  (1 year 7 months) Fort Worth, Texas Global Metrics Reporting Analyst ExxonMobil Corporation June 2005  –  July 2010  (5 years 2 months) Provide worldwide managers with internal customer service helpdesk metrics reporting \nInterface with different levels of the customer service group to ensure objectives are met \nConvert multiple MS Excel reports to MS Access .mdb and .adp automated systems \nTransition MS Access automated systems to MS SQL, including DTS packages, views, stored procedures using T-SQL, and Active-X scripts \nProvide programming support to co-workers to explore system efficiencies \nProficient with complex formula building, pivot tables, and MS Query data sources in MS Excel \nSkilled in VBA coding and modules, as well as form/reporting designing in MS Access \nAdvanced query knowledge in MS Access \nSolid understanding of relational database functionality \nExecute/validate daily, weekly, and monthly reports as well as Adhoc reporting \nProcess large amounts of data from Remedy system using Oracle driver \nDesign system overviews and training documentation \nDeliver on-going training on system updates/changes to co-workers in U.S. and Malaysia \nPoint of contact for Access Administration reporting for counterparts in Malaysia \nAccomplishments: Created original customer survey tracking system, which is used globally today, successfully migrated Access Administration.mdb to MS SQL, traveled to Malaysia for additional metrics reporting training/support, automated several MS Excel reports to \"push-button\" MS Access systems, and finally provided quick and accurate reporting for Adhoc requests Global Metrics Reporting Analyst ExxonMobil June 2005  –  June 2010  (5 years 1 month) Provide worldwide managers with internal customer service helpdesk metrics reporting \nInterface with different levels of the customer service group to ensure objectives are met \nConvert multiple MS Excel reports to MS Access .mdb and .adp automated systems \nTransition MS Access automated systems to MS SQL, including DTS packages, views, stored procedures using T-SQL, and Active-X scripts \nProvide programming support to co-workers to explore system efficiencies \nProficient with complex formula building, pivot tables, and MS Query data sources in MS Excel \nSkilled in VBA coding and modules, as well as form/reporting designing in MS Access \nAdvanced query knowledge in MS Access \nSolid understanding of relational database functionality \nExecute/validate daily, weekly, and monthly reports as well as Adhoc reporting \nProcess large amounts of data from Remedy system using Oracle driver \nDesign system overviews and training documentation \nDeliver on-going training on system updates/changes to co-workers in U.S. and Malaysia \nPoint of contact for Access Administration reporting for counterparts in Malaysia \nAccomplishments: Created original customer survey tracking system, which is used globally today, successfully migrated Access Administration.mdb to MS SQL, traveled to Malaysia for additional metrics reporting training/support, automated several MS Excel reports to \"push-button\" MS Access systems, and finally provided quick and accurate reporting for Adhoc requests Project Coordinator ExxonMobil Corporation January 2005  –  June 2005  (6 months) Coordinated the decommissioning of the Microsoft Exchange service \nServed as central contact point for application support personnel \nProduced detailed and summary progress reports to different staff levels \nAccomplishment: Successfully decommissioned Microsoft Exchange service ahead of schedule Security and Controls Analyst ExxonMobil Corporation July 2004  –  November 2004  (5 months) Designed and maintained an analyst identification [Agent ID] database critical for audit \nCentral contact point for database maintenance \nAccomplishment: The Agent ID database was inherited by ExxonMobil to track analyst accounts worldwide Applications Trainer / Scheduling Analyst ExxonMobil Corporation June 1999  –  July 2004  (5 years 2 months) Provided on-going formal classroom, instructor-led courses to various staff levels on 24x7 helpdesk \nDelivered time-efficient training sessions via remote control applications \nCreated training presentations, materials, and student exercises for training courses \nDesigned weekly training newsletter with application tips and strategies \nConstructed various attendance reports for tracking and forecasting \nFabricated training rosters for training classes \nWorked with Scheduling Team Lead on analysts schedules on 24x7 helpdesk \nAccomplishments: I became the Training Team Lead of the North American Support Center (NASC) helpdesk when hired. Training was performed via various training methods and technologies to over 150 helpdesk analysts and staff. The NASC set the standard in becoming the best of the best in helpdesks and became the measuring stick for all other helpdesks outside of ExxonMobil. Applications Instructor Productivity Point International June 1997  –  June 1999  (2 years 1 month) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Dallas \nProvided desk side application support to over 1400 clients at F.D.I.C. - Dallas \nSupplied one-on-one mentoring sessions while stationed at client site \nWas the primary contact for F.D.I.C.'s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nDesigned monthly training newsletter \nAccomplishment: Was promoted to training lead for F.D.I.C. - Dallas site Applications Instructor Productivity Point International January 1997  –  June 1999  (2 years 6 months) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Dallas \nProvided desk side application support to over 1400 clients at F.D.I.C. - Dallas \nSupplied one-on-one mentoring sessions while stationed at client site \nWas the primary contact for F.D.I.C.’s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nDesigned monthly training newsletter \nAccomplishment: Was promoted to training lead for F.D.I.C. – Dallas & Memphis sites Applications Instructor Productivity Point International January 1997  –  June 1997  (6 months) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Memphis \nProvided desk side application support to over 800 clients at F.D.I.C - Memphis \nWas the primary contact for F.D.I.C.'s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nAccomplishment: Supplied several classroom training courses of 40+ clients at F.D.I.C. - Memphis. Promoted to training lead for F.D.I.C. - Memphis site Application Trainer / Marketing Assistant Rauscher Pierce Refsnes, Incorporated May 1994  –  December 1996  (2 years 8 months) Delivered classroom applications training locally and client sites to new investment executives \nDeveloped training manual with course materials and exercises \nMaintained department calendar with course schedules \nWorked with external vendors on processing marketing pieces \nDesigned marketing pieces, posters, flyers, and personalized brochures for marketing campaigns \nAccomplishment: Got hired on Metrics Reporting Analyst PeopleScout March 2012  – Present (3 years 6 months) Dallas/Fort Worth Area Metrics Reporting Analyst PeopleScout March 2012  – Present (3 years 6 months) Dallas/Fort Worth Area Excel Programmer Residential Credit Solutions, Inc July 2010  –  January 2012  (1 year 7 months) Fort Worth, Texas Excel Programmer Residential Credit Solutions, Inc July 2010  –  January 2012  (1 year 7 months) Fort Worth, Texas Global Metrics Reporting Analyst ExxonMobil Corporation June 2005  –  July 2010  (5 years 2 months) Provide worldwide managers with internal customer service helpdesk metrics reporting \nInterface with different levels of the customer service group to ensure objectives are met \nConvert multiple MS Excel reports to MS Access .mdb and .adp automated systems \nTransition MS Access automated systems to MS SQL, including DTS packages, views, stored procedures using T-SQL, and Active-X scripts \nProvide programming support to co-workers to explore system efficiencies \nProficient with complex formula building, pivot tables, and MS Query data sources in MS Excel \nSkilled in VBA coding and modules, as well as form/reporting designing in MS Access \nAdvanced query knowledge in MS Access \nSolid understanding of relational database functionality \nExecute/validate daily, weekly, and monthly reports as well as Adhoc reporting \nProcess large amounts of data from Remedy system using Oracle driver \nDesign system overviews and training documentation \nDeliver on-going training on system updates/changes to co-workers in U.S. and Malaysia \nPoint of contact for Access Administration reporting for counterparts in Malaysia \nAccomplishments: Created original customer survey tracking system, which is used globally today, successfully migrated Access Administration.mdb to MS SQL, traveled to Malaysia for additional metrics reporting training/support, automated several MS Excel reports to \"push-button\" MS Access systems, and finally provided quick and accurate reporting for Adhoc requests Global Metrics Reporting Analyst ExxonMobil Corporation June 2005  –  July 2010  (5 years 2 months) Provide worldwide managers with internal customer service helpdesk metrics reporting \nInterface with different levels of the customer service group to ensure objectives are met \nConvert multiple MS Excel reports to MS Access .mdb and .adp automated systems \nTransition MS Access automated systems to MS SQL, including DTS packages, views, stored procedures using T-SQL, and Active-X scripts \nProvide programming support to co-workers to explore system efficiencies \nProficient with complex formula building, pivot tables, and MS Query data sources in MS Excel \nSkilled in VBA coding and modules, as well as form/reporting designing in MS Access \nAdvanced query knowledge in MS Access \nSolid understanding of relational database functionality \nExecute/validate daily, weekly, and monthly reports as well as Adhoc reporting \nProcess large amounts of data from Remedy system using Oracle driver \nDesign system overviews and training documentation \nDeliver on-going training on system updates/changes to co-workers in U.S. and Malaysia \nPoint of contact for Access Administration reporting for counterparts in Malaysia \nAccomplishments: Created original customer survey tracking system, which is used globally today, successfully migrated Access Administration.mdb to MS SQL, traveled to Malaysia for additional metrics reporting training/support, automated several MS Excel reports to \"push-button\" MS Access systems, and finally provided quick and accurate reporting for Adhoc requests Global Metrics Reporting Analyst ExxonMobil June 2005  –  June 2010  (5 years 1 month) Provide worldwide managers with internal customer service helpdesk metrics reporting \nInterface with different levels of the customer service group to ensure objectives are met \nConvert multiple MS Excel reports to MS Access .mdb and .adp automated systems \nTransition MS Access automated systems to MS SQL, including DTS packages, views, stored procedures using T-SQL, and Active-X scripts \nProvide programming support to co-workers to explore system efficiencies \nProficient with complex formula building, pivot tables, and MS Query data sources in MS Excel \nSkilled in VBA coding and modules, as well as form/reporting designing in MS Access \nAdvanced query knowledge in MS Access \nSolid understanding of relational database functionality \nExecute/validate daily, weekly, and monthly reports as well as Adhoc reporting \nProcess large amounts of data from Remedy system using Oracle driver \nDesign system overviews and training documentation \nDeliver on-going training on system updates/changes to co-workers in U.S. and Malaysia \nPoint of contact for Access Administration reporting for counterparts in Malaysia \nAccomplishments: Created original customer survey tracking system, which is used globally today, successfully migrated Access Administration.mdb to MS SQL, traveled to Malaysia for additional metrics reporting training/support, automated several MS Excel reports to \"push-button\" MS Access systems, and finally provided quick and accurate reporting for Adhoc requests Global Metrics Reporting Analyst ExxonMobil June 2005  –  June 2010  (5 years 1 month) Provide worldwide managers with internal customer service helpdesk metrics reporting \nInterface with different levels of the customer service group to ensure objectives are met \nConvert multiple MS Excel reports to MS Access .mdb and .adp automated systems \nTransition MS Access automated systems to MS SQL, including DTS packages, views, stored procedures using T-SQL, and Active-X scripts \nProvide programming support to co-workers to explore system efficiencies \nProficient with complex formula building, pivot tables, and MS Query data sources in MS Excel \nSkilled in VBA coding and modules, as well as form/reporting designing in MS Access \nAdvanced query knowledge in MS Access \nSolid understanding of relational database functionality \nExecute/validate daily, weekly, and monthly reports as well as Adhoc reporting \nProcess large amounts of data from Remedy system using Oracle driver \nDesign system overviews and training documentation \nDeliver on-going training on system updates/changes to co-workers in U.S. and Malaysia \nPoint of contact for Access Administration reporting for counterparts in Malaysia \nAccomplishments: Created original customer survey tracking system, which is used globally today, successfully migrated Access Administration.mdb to MS SQL, traveled to Malaysia for additional metrics reporting training/support, automated several MS Excel reports to \"push-button\" MS Access systems, and finally provided quick and accurate reporting for Adhoc requests Project Coordinator ExxonMobil Corporation January 2005  –  June 2005  (6 months) Coordinated the decommissioning of the Microsoft Exchange service \nServed as central contact point for application support personnel \nProduced detailed and summary progress reports to different staff levels \nAccomplishment: Successfully decommissioned Microsoft Exchange service ahead of schedule Project Coordinator ExxonMobil Corporation January 2005  –  June 2005  (6 months) Coordinated the decommissioning of the Microsoft Exchange service \nServed as central contact point for application support personnel \nProduced detailed and summary progress reports to different staff levels \nAccomplishment: Successfully decommissioned Microsoft Exchange service ahead of schedule Security and Controls Analyst ExxonMobil Corporation July 2004  –  November 2004  (5 months) Designed and maintained an analyst identification [Agent ID] database critical for audit \nCentral contact point for database maintenance \nAccomplishment: The Agent ID database was inherited by ExxonMobil to track analyst accounts worldwide Security and Controls Analyst ExxonMobil Corporation July 2004  –  November 2004  (5 months) Designed and maintained an analyst identification [Agent ID] database critical for audit \nCentral contact point for database maintenance \nAccomplishment: The Agent ID database was inherited by ExxonMobil to track analyst accounts worldwide Applications Trainer / Scheduling Analyst ExxonMobil Corporation June 1999  –  July 2004  (5 years 2 months) Provided on-going formal classroom, instructor-led courses to various staff levels on 24x7 helpdesk \nDelivered time-efficient training sessions via remote control applications \nCreated training presentations, materials, and student exercises for training courses \nDesigned weekly training newsletter with application tips and strategies \nConstructed various attendance reports for tracking and forecasting \nFabricated training rosters for training classes \nWorked with Scheduling Team Lead on analysts schedules on 24x7 helpdesk \nAccomplishments: I became the Training Team Lead of the North American Support Center (NASC) helpdesk when hired. Training was performed via various training methods and technologies to over 150 helpdesk analysts and staff. The NASC set the standard in becoming the best of the best in helpdesks and became the measuring stick for all other helpdesks outside of ExxonMobil. Applications Trainer / Scheduling Analyst ExxonMobil Corporation June 1999  –  July 2004  (5 years 2 months) Provided on-going formal classroom, instructor-led courses to various staff levels on 24x7 helpdesk \nDelivered time-efficient training sessions via remote control applications \nCreated training presentations, materials, and student exercises for training courses \nDesigned weekly training newsletter with application tips and strategies \nConstructed various attendance reports for tracking and forecasting \nFabricated training rosters for training classes \nWorked with Scheduling Team Lead on analysts schedules on 24x7 helpdesk \nAccomplishments: I became the Training Team Lead of the North American Support Center (NASC) helpdesk when hired. Training was performed via various training methods and technologies to over 150 helpdesk analysts and staff. The NASC set the standard in becoming the best of the best in helpdesks and became the measuring stick for all other helpdesks outside of ExxonMobil. Applications Instructor Productivity Point International June 1997  –  June 1999  (2 years 1 month) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Dallas \nProvided desk side application support to over 1400 clients at F.D.I.C. - Dallas \nSupplied one-on-one mentoring sessions while stationed at client site \nWas the primary contact for F.D.I.C.'s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nDesigned monthly training newsletter \nAccomplishment: Was promoted to training lead for F.D.I.C. - Dallas site Applications Instructor Productivity Point International June 1997  –  June 1999  (2 years 1 month) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Dallas \nProvided desk side application support to over 1400 clients at F.D.I.C. - Dallas \nSupplied one-on-one mentoring sessions while stationed at client site \nWas the primary contact for F.D.I.C.'s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nDesigned monthly training newsletter \nAccomplishment: Was promoted to training lead for F.D.I.C. - Dallas site Applications Instructor Productivity Point International January 1997  –  June 1999  (2 years 6 months) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Dallas \nProvided desk side application support to over 1400 clients at F.D.I.C. - Dallas \nSupplied one-on-one mentoring sessions while stationed at client site \nWas the primary contact for F.D.I.C.’s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nDesigned monthly training newsletter \nAccomplishment: Was promoted to training lead for F.D.I.C. – Dallas & Memphis sites Applications Instructor Productivity Point International January 1997  –  June 1999  (2 years 6 months) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Dallas \nProvided desk side application support to over 1400 clients at F.D.I.C. - Dallas \nSupplied one-on-one mentoring sessions while stationed at client site \nWas the primary contact for F.D.I.C.’s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nDesigned monthly training newsletter \nAccomplishment: Was promoted to training lead for F.D.I.C. – Dallas & Memphis sites Applications Instructor Productivity Point International January 1997  –  June 1997  (6 months) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Memphis \nProvided desk side application support to over 800 clients at F.D.I.C - Memphis \nWas the primary contact for F.D.I.C.'s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nAccomplishment: Supplied several classroom training courses of 40+ clients at F.D.I.C. - Memphis. Promoted to training lead for F.D.I.C. - Memphis site Applications Instructor Productivity Point International January 1997  –  June 1997  (6 months) Delivered formal classroom training in-house as well as client sites across the U.S. \nSpecialized in the Microsoft Office Suite \nLead instructor at client site F.D.I.C. - Memphis \nProvided desk side application support to over 800 clients at F.D.I.C - Memphis \nWas the primary contact for F.D.I.C.'s help desk for Microsoft Office related issues \nAssisted clients with converting WordPerfect court legal documents to Microsoft Word format \nAccomplishment: Supplied several classroom training courses of 40+ clients at F.D.I.C. - Memphis. Promoted to training lead for F.D.I.C. - Memphis site Application Trainer / Marketing Assistant Rauscher Pierce Refsnes, Incorporated May 1994  –  December 1996  (2 years 8 months) Delivered classroom applications training locally and client sites to new investment executives \nDeveloped training manual with course materials and exercises \nMaintained department calendar with course schedules \nWorked with external vendors on processing marketing pieces \nDesigned marketing pieces, posters, flyers, and personalized brochures for marketing campaigns \nAccomplishment: Got hired on Application Trainer / Marketing Assistant Rauscher Pierce Refsnes, Incorporated May 1994  –  December 1996  (2 years 8 months) Delivered classroom applications training locally and client sites to new investment executives \nDeveloped training manual with course materials and exercises \nMaintained department calendar with course schedules \nWorked with external vendors on processing marketing pieces \nDesigned marketing pieces, posters, flyers, and personalized brochures for marketing campaigns \nAccomplishment: Got hired on Skills Access Excel Microsoft Office Word Outlook Microsoft SQL Server Microsoft Word PowerPoint Software Documentation Microsoft Excel Customer Service Process Improvement Windows Databases Microsoft Exchange Management SharePoint Visio Program Management Active Directory Training Security Call Centers Business Analysis Lotus Notes Troubleshooting HTML SQL Team Leadership Forecasting Windows 7 Technical Support XP Analysis Customer Satisfaction Human Resources Project Management System Administration See 23+     See less Skills  Access Excel Microsoft Office Word Outlook Microsoft SQL Server Microsoft Word PowerPoint Software Documentation Microsoft Excel Customer Service Process Improvement Windows Databases Microsoft Exchange Management SharePoint Visio Program Management Active Directory Training Security Call Centers Business Analysis Lotus Notes Troubleshooting HTML SQL Team Leadership Forecasting Windows 7 Technical Support XP Analysis Customer Satisfaction Human Resources Project Management System Administration See 23+     See less Access Excel Microsoft Office Word Outlook Microsoft SQL Server Microsoft Word PowerPoint Software Documentation Microsoft Excel Customer Service Process Improvement Windows Databases Microsoft Exchange Management SharePoint Visio Program Management Active Directory Training Security Call Centers Business Analysis Lotus Notes Troubleshooting HTML SQL Team Leadership Forecasting Windows 7 Technical Support XP Analysis Customer Satisfaction Human Resources Project Management System Administration See 23+     See less Access Excel Microsoft Office Word Outlook Microsoft SQL Server Microsoft Word PowerPoint Software Documentation Microsoft Excel Customer Service Process Improvement Windows Databases Microsoft Exchange Management SharePoint Visio Program Management Active Directory Training Security Call Centers Business Analysis Lotus Notes Troubleshooting HTML SQL Team Leadership Forecasting Windows 7 Technical Support XP Analysis Customer Satisfaction Human Resources Project Management System Administration See 23+     See less Education Mountain View Community College Business Administration 1995  – 1996 Business and Management Center Magnet High School 1991  – 1995 Business and Management Center Magnet High School 1991  – 1995 Mountain View Community College Mountain View Community College Business Administration 1995  – 1996 Mountain View Community College Business Administration 1995  – 1996 Mountain View Community College Business Administration 1995  – 1996 Business and Management Center Magnet High School 1991  – 1995 Business and Management Center Magnet High School 1991  – 1995 Business and Management Center Magnet High School 1991  – 1995 Business and Management Center Magnet High School 1991  – 1995 Business and Management Center Magnet High School 1991  – 1995 Business and Management Center Magnet High School 1991  – 1995 Mountain View Community College Mountain View Community College Mountain View Community College ", "Experience Metrics and Reporting Analyst Starwood Hotels & Resorts Product Engineer MRIS 2000  –  2005  (5 years) Metrics and Reporting Analyst Starwood Hotels & Resorts Metrics and Reporting Analyst Starwood Hotels & Resorts Product Engineer MRIS 2000  –  2005  (5 years) Product Engineer MRIS 2000  –  2005  (5 years) Skills Microsoft Excel Microsoft Office Access System Administration Microsoft SQL Server SharePoint SQL SDLC Windows Project Management Business Analysis Databases Project Planning HTML Troubleshooting Software Documentation Vendor Management JavaScript Management Web Development Strategic Planning See 6+     See less Skills  Microsoft Excel Microsoft Office Access System Administration Microsoft SQL Server SharePoint SQL SDLC Windows Project Management Business Analysis Databases Project Planning HTML Troubleshooting Software Documentation Vendor Management JavaScript Management Web Development Strategic Planning See 6+     See less Microsoft Excel Microsoft Office Access System Administration Microsoft SQL Server SharePoint SQL SDLC Windows Project Management Business Analysis Databases Project Planning HTML Troubleshooting Software Documentation Vendor Management JavaScript Management Web Development Strategic Planning See 6+     See less Microsoft Excel Microsoft Office Access System Administration Microsoft SQL Server SharePoint SQL SDLC Windows Project Management Business Analysis Databases Project Planning HTML Troubleshooting Software Documentation Vendor Management JavaScript Management Web Development Strategic Planning See 6+     See less Education Northern Virginia Community College Northern Virginia Community College Northern Virginia Community College Northern Virginia Community College ", "Experience Metrics & Reporting Analyst Dell Metrics & Reporting Analyst Dell Metrics & Reporting Analyst Dell ", "Languages Spanish Spanish Spanish Skills Program Management Project Management Business Analysis Vendor Management Risk Management PMO IT Strategy Software Project... SDLC Business Transformation Project Portfolio... Project Delivery IT Management Business Process... Governance Skills  Program Management Project Management Business Analysis Vendor Management Risk Management PMO IT Strategy Software Project... SDLC Business Transformation Project Portfolio... Project Delivery IT Management Business Process... Governance Program Management Project Management Business Analysis Vendor Management Risk Management PMO IT Strategy Software Project... SDLC Business Transformation Project Portfolio... Project Delivery IT Management Business Process... Governance Program Management Project Management Business Analysis Vendor Management Risk Management PMO IT Strategy Software Project... SDLC Business Transformation Project Portfolio... Project Delivery IT Management Business Process... Governance ", "Experience Metrics and reporting analyst Dell Metrics and reporting analyst Dell Metrics and reporting analyst Dell Education The University of Texas at Austin 1990  – 1992 The University of Texas at Austin 1990  – 1992 The University of Texas at Austin 1990  – 1992 The University of Texas at Austin 1990  – 1992 ", "Summary I completed my undergraduate education in three years and graduated with Latin honors. \nSince graduating in 2013, I have taken that same work ethic, passion, and dedication into my professional life. \n \nI often get the question, \"Data, Analytics, Reporting... but weren't a psychology major? \n \nYes, I was! The great thing about a liberal arts education are all the \"bonus\" skills you get along with it.As much as I love psychology, the intangible skills, work ethic, multi-tasking, leadership, and communication are applicable in any field, and I've found my passion in Big Data. \n \nCurrently, I am an Advanced Metrics and Reporting Analyst at Prime Therapeutics. Presently, I am working on strengthening our reporting platform and implementing enhancements \nso we can continually offer the best service to our clients.  \n \nPrior to that, I was a Reporting Analyst at Green Tree. During my time at Green Tree, I coded and developed several reports that had a direct impact on upper management’s \ndecisions regarding multi-million dollar capital projects. I was also part of a special team tasked with developing enhancements to our in-house claims program so we can  \nincrease submissions. Between June 2014 and December 2014 we increased dollars submitted per month from $36 million to $90 million.  \n \n \nMy goal is to provide expedited solutions to ensure our clients have the tools they need, so our consumers can get the medicine they need to feel better and live well. Summary I completed my undergraduate education in three years and graduated with Latin honors. \nSince graduating in 2013, I have taken that same work ethic, passion, and dedication into my professional life. \n \nI often get the question, \"Data, Analytics, Reporting... but weren't a psychology major? \n \nYes, I was! The great thing about a liberal arts education are all the \"bonus\" skills you get along with it.As much as I love psychology, the intangible skills, work ethic, multi-tasking, leadership, and communication are applicable in any field, and I've found my passion in Big Data. \n \nCurrently, I am an Advanced Metrics and Reporting Analyst at Prime Therapeutics. Presently, I am working on strengthening our reporting platform and implementing enhancements \nso we can continually offer the best service to our clients.  \n \nPrior to that, I was a Reporting Analyst at Green Tree. During my time at Green Tree, I coded and developed several reports that had a direct impact on upper management’s \ndecisions regarding multi-million dollar capital projects. I was also part of a special team tasked with developing enhancements to our in-house claims program so we can  \nincrease submissions. Between June 2014 and December 2014 we increased dollars submitted per month from $36 million to $90 million.  \n \n \nMy goal is to provide expedited solutions to ensure our clients have the tools they need, so our consumers can get the medicine they need to feel better and live well. I completed my undergraduate education in three years and graduated with Latin honors. \nSince graduating in 2013, I have taken that same work ethic, passion, and dedication into my professional life. \n \nI often get the question, \"Data, Analytics, Reporting... but weren't a psychology major? \n \nYes, I was! The great thing about a liberal arts education are all the \"bonus\" skills you get along with it.As much as I love psychology, the intangible skills, work ethic, multi-tasking, leadership, and communication are applicable in any field, and I've found my passion in Big Data. \n \nCurrently, I am an Advanced Metrics and Reporting Analyst at Prime Therapeutics. Presently, I am working on strengthening our reporting platform and implementing enhancements \nso we can continually offer the best service to our clients.  \n \nPrior to that, I was a Reporting Analyst at Green Tree. During my time at Green Tree, I coded and developed several reports that had a direct impact on upper management’s \ndecisions regarding multi-million dollar capital projects. I was also part of a special team tasked with developing enhancements to our in-house claims program so we can  \nincrease submissions. Between June 2014 and December 2014 we increased dollars submitted per month from $36 million to $90 million.  \n \n \nMy goal is to provide expedited solutions to ensure our clients have the tools they need, so our consumers can get the medicine they need to feel better and live well. I completed my undergraduate education in three years and graduated with Latin honors. \nSince graduating in 2013, I have taken that same work ethic, passion, and dedication into my professional life. \n \nI often get the question, \"Data, Analytics, Reporting... but weren't a psychology major? \n \nYes, I was! The great thing about a liberal arts education are all the \"bonus\" skills you get along with it.As much as I love psychology, the intangible skills, work ethic, multi-tasking, leadership, and communication are applicable in any field, and I've found my passion in Big Data. \n \nCurrently, I am an Advanced Metrics and Reporting Analyst at Prime Therapeutics. Presently, I am working on strengthening our reporting platform and implementing enhancements \nso we can continually offer the best service to our clients.  \n \nPrior to that, I was a Reporting Analyst at Green Tree. During my time at Green Tree, I coded and developed several reports that had a direct impact on upper management’s \ndecisions regarding multi-million dollar capital projects. I was also part of a special team tasked with developing enhancements to our in-house claims program so we can  \nincrease submissions. Between June 2014 and December 2014 we increased dollars submitted per month from $36 million to $90 million.  \n \n \nMy goal is to provide expedited solutions to ensure our clients have the tools they need, so our consumers can get the medicine they need to feel better and live well. Experience Advanced Metrics and Reporting Analyst Prime Therapeutics May 2015  – Present (4 months) Edina, MN - Support PBM Clinical Review Department \n- Identified key issues with current reporting methodology and implemented changes to enhance reporting platform \n- Created interim reporting solutions that reduced production time by 80% \n- Developed database and key reporting metrics to enhance client engagement \n- Designed reporting for upper management detailing technician productivity by day, week, month & year in order to provide tangible numbers for performance review and bonus eligibility  \n- Implemented a standard reporting package to enhance what Prime can offer clients as an ROI for using our services \n \n Reporting Analyst Green Tree Servicing June 2014  –  May 2015  (1 year) Saint Paul, MN • Analyzed and interpreted data surrounding federal loan programs  \n \n• Forecasted data to demonstrate future earning potential and value of recommended business enhancements  \n \n• Assisted with development of business requirement documents for multi-million dollar capital projects \n \n• Developed recurring and ad hoc reports to update upper management on the progress of capital projects \n \n• Experience writing, executing and documenting QA test cases to ensure system changes met the business expectations \n \n• Assisted as a liaison between Florida and Minnesota Loan Servicing departments for capital projects \n \n• Proficient in Microsoft Access, Microsoft Excel, VBA/SQL coding and schema mapping \n \n• Investigated & solved problems with technical and analytical solutions \n \n \nTechnical \n \n• Advanced Microsoft Excel skills including: macro development, VBA coding, formulas/functions, pivot tables, charts and graphs \n \n• Microsoft Access database creation & management  \n \n• Adept in SQL coding using iSeries & SQL Server Management Studio \n \n \nLoan Servicing Skills \n \n• Fannie Mae, Freddie Mac, and private loan servicing \n \n• Claim filing for foreclosed and delinquent mortgages \n \n• Investment Reporting Package Engineering Analyst 3M December 2013  –  May 2014  (6 months) Saint Paul, MN I worked as a full-time employee with 3M (contracted through Aerotek) in the Package Engineering Department. I was responsible for updating SKUs in company databases in order to get new products delivered to the plants. I was an integral part of the SAP integration team, which was responsible for analyzing, updating, and transferring classified company information from multiple databases into SAP and prepping data for SAP by our target date. \n \n•Assisted the SAP Deployment Manager with Readiness Activities, including computing volumes of 50,000 items and updating 180,000 missing data points while adhering to compliance and regulatory rules \n \n• Enhanced business operations by designing a global standard for Package Engineering SAP requirements to assist distribution centers in achieving Six Sigma manufacturing standards  \n \n• Developed business process to effectively cleanup and manage a large volume of outdated data prior to transition to SAP \n \n• Assisted with creation of benchmark goals to track progress \n \n• Experienced in Excel Formulas, Vlookups, and Pivot Tables \n \n• Responsible for Data Accuracy and Privacy \n \n• Worked with multiple personnel to make sure projects were delivered accurately and ontime Family Studies Intern University of St. Thomas January 2013  –  January 2014  (1 year 1 month) Saint Paul, MN I completed data entry and analyses for a research project and worked on designing and creating promotional materials. One promotional project included managing a large-scale video project, including coordinating meetings and communicating with multiple departments at St. Thomas. \n \n \n•\tResponsible for supporting the Program Director \n•\tWorked with multiple on-campus departments to make sure projects were delivered on time and on budget \n•\tOrganized and budgeted for department-sponsored events \n•\tCoordinated meetings, interviews, and on-campus events to support the program \n•\tResponsible for creating a new marketing campaign, which established lasting relationships with vendors \n•\tTransformed the Family Studies website from outdated to relevant by utilizing new marketing tools, which resulted in a 39% increase in page views Program Assistant Fraser July 2013  –  December 2013  (6 months) Fraser, is a non-profit organization that supports children & adults suffering from mental illnesses and developmental delays. I worked in the Residential Living division as a Program Assistant. My job functions included constant support & aid of adults with developmental delays & mental illnesses while engaging them in beneficial activities and helping them integrate into the community. My role as a direct-support caregiver was very important to the well-being of my clients. \n \n \n•\tResponsible for medication accuracy for adults, which required problem solving and knowledge of medication interactions and side effects. \n•\tResponsible for client health and well-being \n•\tOften volunteered to work additional hours to assist the company, when staffing levels were not met; resulted in an increase in responsibilities and trust with clients, including but not limited to conducting client appointments. Research Assistant University of St. Thomas January 2012  –  September 2013  (1 year 9 months) Saint Paul, MN •\tAssisted project head with data entry, analysis, and collection, while managing timeline set forth by the Institutional Review Board  \n•\tResulted in presentations at multiple regional and international conferences and recognition as an outstanding psychology scholar Office Assistant and Computer Programming Assistant International Education Center, Univ. of St. Thomas January 2011  –  January 2013  (2 years 1 month) As an Office Assistant and CPA I assisted in the coordination of tours and \nvisits for prospective students, trained new student workers,and maintained the front desk by answering phones, scheduling appointments, and working on front desk tasks. \n \n \n•\tCreated, updated, and implemented new orientation materials and ensured the project was completed on time \n•\tManaged registration materials for students while abroad \n•\tActed as a liaison between international students and admissions officers \n•\tReviewed and updated office contacts, policies, and job duties as needed \n•\tUtilized Qualtrix, Microsoft Access and Google Documents to generate year-end reports \n•\tExperienced in updating and utilizing StudioAbroad software \n•\tResulted in a promotion from Office Assistant to Computer Programming Assistant Research Assistant Department of Veterans Affairs June 2011  –  December 2011  (7 months) I assisted with mailings sent to soldiers, performed data entry, generated data analyses, facilitated response coding, assisted with the distribution of research questionnaires and materials to soldiers at National Guard events Advanced Metrics and Reporting Analyst Prime Therapeutics May 2015  – Present (4 months) Edina, MN - Support PBM Clinical Review Department \n- Identified key issues with current reporting methodology and implemented changes to enhance reporting platform \n- Created interim reporting solutions that reduced production time by 80% \n- Developed database and key reporting metrics to enhance client engagement \n- Designed reporting for upper management detailing technician productivity by day, week, month & year in order to provide tangible numbers for performance review and bonus eligibility  \n- Implemented a standard reporting package to enhance what Prime can offer clients as an ROI for using our services \n \n Advanced Metrics and Reporting Analyst Prime Therapeutics May 2015  – Present (4 months) Edina, MN - Support PBM Clinical Review Department \n- Identified key issues with current reporting methodology and implemented changes to enhance reporting platform \n- Created interim reporting solutions that reduced production time by 80% \n- Developed database and key reporting metrics to enhance client engagement \n- Designed reporting for upper management detailing technician productivity by day, week, month & year in order to provide tangible numbers for performance review and bonus eligibility  \n- Implemented a standard reporting package to enhance what Prime can offer clients as an ROI for using our services \n \n Reporting Analyst Green Tree Servicing June 2014  –  May 2015  (1 year) Saint Paul, MN • Analyzed and interpreted data surrounding federal loan programs  \n \n• Forecasted data to demonstrate future earning potential and value of recommended business enhancements  \n \n• Assisted with development of business requirement documents for multi-million dollar capital projects \n \n• Developed recurring and ad hoc reports to update upper management on the progress of capital projects \n \n• Experience writing, executing and documenting QA test cases to ensure system changes met the business expectations \n \n• Assisted as a liaison between Florida and Minnesota Loan Servicing departments for capital projects \n \n• Proficient in Microsoft Access, Microsoft Excel, VBA/SQL coding and schema mapping \n \n• Investigated & solved problems with technical and analytical solutions \n \n \nTechnical \n \n• Advanced Microsoft Excel skills including: macro development, VBA coding, formulas/functions, pivot tables, charts and graphs \n \n• Microsoft Access database creation & management  \n \n• Adept in SQL coding using iSeries & SQL Server Management Studio \n \n \nLoan Servicing Skills \n \n• Fannie Mae, Freddie Mac, and private loan servicing \n \n• Claim filing for foreclosed and delinquent mortgages \n \n• Investment Reporting Reporting Analyst Green Tree Servicing June 2014  –  May 2015  (1 year) Saint Paul, MN • Analyzed and interpreted data surrounding federal loan programs  \n \n• Forecasted data to demonstrate future earning potential and value of recommended business enhancements  \n \n• Assisted with development of business requirement documents for multi-million dollar capital projects \n \n• Developed recurring and ad hoc reports to update upper management on the progress of capital projects \n \n• Experience writing, executing and documenting QA test cases to ensure system changes met the business expectations \n \n• Assisted as a liaison between Florida and Minnesota Loan Servicing departments for capital projects \n \n• Proficient in Microsoft Access, Microsoft Excel, VBA/SQL coding and schema mapping \n \n• Investigated & solved problems with technical and analytical solutions \n \n \nTechnical \n \n• Advanced Microsoft Excel skills including: macro development, VBA coding, formulas/functions, pivot tables, charts and graphs \n \n• Microsoft Access database creation & management  \n \n• Adept in SQL coding using iSeries & SQL Server Management Studio \n \n \nLoan Servicing Skills \n \n• Fannie Mae, Freddie Mac, and private loan servicing \n \n• Claim filing for foreclosed and delinquent mortgages \n \n• Investment Reporting Package Engineering Analyst 3M December 2013  –  May 2014  (6 months) Saint Paul, MN I worked as a full-time employee with 3M (contracted through Aerotek) in the Package Engineering Department. I was responsible for updating SKUs in company databases in order to get new products delivered to the plants. I was an integral part of the SAP integration team, which was responsible for analyzing, updating, and transferring classified company information from multiple databases into SAP and prepping data for SAP by our target date. \n \n•Assisted the SAP Deployment Manager with Readiness Activities, including computing volumes of 50,000 items and updating 180,000 missing data points while adhering to compliance and regulatory rules \n \n• Enhanced business operations by designing a global standard for Package Engineering SAP requirements to assist distribution centers in achieving Six Sigma manufacturing standards  \n \n• Developed business process to effectively cleanup and manage a large volume of outdated data prior to transition to SAP \n \n• Assisted with creation of benchmark goals to track progress \n \n• Experienced in Excel Formulas, Vlookups, and Pivot Tables \n \n• Responsible for Data Accuracy and Privacy \n \n• Worked with multiple personnel to make sure projects were delivered accurately and ontime Package Engineering Analyst 3M December 2013  –  May 2014  (6 months) Saint Paul, MN I worked as a full-time employee with 3M (contracted through Aerotek) in the Package Engineering Department. I was responsible for updating SKUs in company databases in order to get new products delivered to the plants. I was an integral part of the SAP integration team, which was responsible for analyzing, updating, and transferring classified company information from multiple databases into SAP and prepping data for SAP by our target date. \n \n•Assisted the SAP Deployment Manager with Readiness Activities, including computing volumes of 50,000 items and updating 180,000 missing data points while adhering to compliance and regulatory rules \n \n• Enhanced business operations by designing a global standard for Package Engineering SAP requirements to assist distribution centers in achieving Six Sigma manufacturing standards  \n \n• Developed business process to effectively cleanup and manage a large volume of outdated data prior to transition to SAP \n \n• Assisted with creation of benchmark goals to track progress \n \n• Experienced in Excel Formulas, Vlookups, and Pivot Tables \n \n• Responsible for Data Accuracy and Privacy \n \n• Worked with multiple personnel to make sure projects were delivered accurately and ontime Family Studies Intern University of St. Thomas January 2013  –  January 2014  (1 year 1 month) Saint Paul, MN I completed data entry and analyses for a research project and worked on designing and creating promotional materials. One promotional project included managing a large-scale video project, including coordinating meetings and communicating with multiple departments at St. Thomas. \n \n \n•\tResponsible for supporting the Program Director \n•\tWorked with multiple on-campus departments to make sure projects were delivered on time and on budget \n•\tOrganized and budgeted for department-sponsored events \n•\tCoordinated meetings, interviews, and on-campus events to support the program \n•\tResponsible for creating a new marketing campaign, which established lasting relationships with vendors \n•\tTransformed the Family Studies website from outdated to relevant by utilizing new marketing tools, which resulted in a 39% increase in page views Family Studies Intern University of St. Thomas January 2013  –  January 2014  (1 year 1 month) Saint Paul, MN I completed data entry and analyses for a research project and worked on designing and creating promotional materials. One promotional project included managing a large-scale video project, including coordinating meetings and communicating with multiple departments at St. Thomas. \n \n \n•\tResponsible for supporting the Program Director \n•\tWorked with multiple on-campus departments to make sure projects were delivered on time and on budget \n•\tOrganized and budgeted for department-sponsored events \n•\tCoordinated meetings, interviews, and on-campus events to support the program \n•\tResponsible for creating a new marketing campaign, which established lasting relationships with vendors \n•\tTransformed the Family Studies website from outdated to relevant by utilizing new marketing tools, which resulted in a 39% increase in page views Program Assistant Fraser July 2013  –  December 2013  (6 months) Fraser, is a non-profit organization that supports children & adults suffering from mental illnesses and developmental delays. I worked in the Residential Living division as a Program Assistant. My job functions included constant support & aid of adults with developmental delays & mental illnesses while engaging them in beneficial activities and helping them integrate into the community. My role as a direct-support caregiver was very important to the well-being of my clients. \n \n \n•\tResponsible for medication accuracy for adults, which required problem solving and knowledge of medication interactions and side effects. \n•\tResponsible for client health and well-being \n•\tOften volunteered to work additional hours to assist the company, when staffing levels were not met; resulted in an increase in responsibilities and trust with clients, including but not limited to conducting client appointments. Program Assistant Fraser July 2013  –  December 2013  (6 months) Fraser, is a non-profit organization that supports children & adults suffering from mental illnesses and developmental delays. I worked in the Residential Living division as a Program Assistant. My job functions included constant support & aid of adults with developmental delays & mental illnesses while engaging them in beneficial activities and helping them integrate into the community. My role as a direct-support caregiver was very important to the well-being of my clients. \n \n \n•\tResponsible for medication accuracy for adults, which required problem solving and knowledge of medication interactions and side effects. \n•\tResponsible for client health and well-being \n•\tOften volunteered to work additional hours to assist the company, when staffing levels were not met; resulted in an increase in responsibilities and trust with clients, including but not limited to conducting client appointments. Research Assistant University of St. Thomas January 2012  –  September 2013  (1 year 9 months) Saint Paul, MN •\tAssisted project head with data entry, analysis, and collection, while managing timeline set forth by the Institutional Review Board  \n•\tResulted in presentations at multiple regional and international conferences and recognition as an outstanding psychology scholar Research Assistant University of St. Thomas January 2012  –  September 2013  (1 year 9 months) Saint Paul, MN •\tAssisted project head with data entry, analysis, and collection, while managing timeline set forth by the Institutional Review Board  \n•\tResulted in presentations at multiple regional and international conferences and recognition as an outstanding psychology scholar Office Assistant and Computer Programming Assistant International Education Center, Univ. of St. Thomas January 2011  –  January 2013  (2 years 1 month) As an Office Assistant and CPA I assisted in the coordination of tours and \nvisits for prospective students, trained new student workers,and maintained the front desk by answering phones, scheduling appointments, and working on front desk tasks. \n \n \n•\tCreated, updated, and implemented new orientation materials and ensured the project was completed on time \n•\tManaged registration materials for students while abroad \n•\tActed as a liaison between international students and admissions officers \n•\tReviewed and updated office contacts, policies, and job duties as needed \n•\tUtilized Qualtrix, Microsoft Access and Google Documents to generate year-end reports \n•\tExperienced in updating and utilizing StudioAbroad software \n•\tResulted in a promotion from Office Assistant to Computer Programming Assistant Office Assistant and Computer Programming Assistant International Education Center, Univ. of St. Thomas January 2011  –  January 2013  (2 years 1 month) As an Office Assistant and CPA I assisted in the coordination of tours and \nvisits for prospective students, trained new student workers,and maintained the front desk by answering phones, scheduling appointments, and working on front desk tasks. \n \n \n•\tCreated, updated, and implemented new orientation materials and ensured the project was completed on time \n•\tManaged registration materials for students while abroad \n•\tActed as a liaison between international students and admissions officers \n•\tReviewed and updated office contacts, policies, and job duties as needed \n•\tUtilized Qualtrix, Microsoft Access and Google Documents to generate year-end reports \n•\tExperienced in updating and utilizing StudioAbroad software \n•\tResulted in a promotion from Office Assistant to Computer Programming Assistant Research Assistant Department of Veterans Affairs June 2011  –  December 2011  (7 months) I assisted with mailings sent to soldiers, performed data entry, generated data analyses, facilitated response coding, assisted with the distribution of research questionnaires and materials to soldiers at National Guard events Research Assistant Department of Veterans Affairs June 2011  –  December 2011  (7 months) I assisted with mailings sent to soldiers, performed data entry, generated data analyses, facilitated response coding, assisted with the distribution of research questionnaires and materials to soldiers at National Guard events Languages Spanish Spanish Spanish Skills Data entry and analysis... Database applications... Word Processing... Presentation Software... Cash Management Appointment Scheduling... Data analysis for... Understanding of... Leadership Organization Punctuality Time Management Cpr Certified Microsoft Excel Microsoft Office Mental Health Microsoft Word PowerPoint Psychology Data Entry Research Data Analysis Critical Thinking SPSS Customer Service Training See 11+     See less Skills  Data entry and analysis... Database applications... Word Processing... Presentation Software... Cash Management Appointment Scheduling... Data analysis for... Understanding of... Leadership Organization Punctuality Time Management Cpr Certified Microsoft Excel Microsoft Office Mental Health Microsoft Word PowerPoint Psychology Data Entry Research Data Analysis Critical Thinking SPSS Customer Service Training See 11+     See less Data entry and analysis... Database applications... Word Processing... Presentation Software... Cash Management Appointment Scheduling... Data analysis for... Understanding of... Leadership Organization Punctuality Time Management Cpr Certified Microsoft Excel Microsoft Office Mental Health Microsoft Word PowerPoint Psychology Data Entry Research Data Analysis Critical Thinking SPSS Customer Service Training See 11+     See less Data entry and analysis... Database applications... Word Processing... Presentation Software... Cash Management Appointment Scheduling... Data analysis for... Understanding of... Leadership Organization Punctuality Time Management Cpr Certified Microsoft Excel Microsoft Office Mental Health Microsoft Word PowerPoint Psychology Data Entry Research Data Analysis Critical Thinking SPSS Customer Service Training See 11+     See less Education University of Saint Thomas Bachelor of Arts (B.A.),  Psychology 2010  – 2013 Apollo High School Diploma 2006  – 2010 University of Saint Thomas Bachelor of Arts (B.A.),  Psychology 2010  – 2013 University of Saint Thomas Bachelor of Arts (B.A.),  Psychology 2010  – 2013 University of Saint Thomas Bachelor of Arts (B.A.),  Psychology 2010  – 2013 Apollo High School Diploma 2006  – 2010 Apollo High School Diploma 2006  – 2010 Apollo High School Diploma 2006  – 2010 Honors & Awards Institute of Packaging Professionals (IoPP) Institute of Packaging Professionals March 2013 Affiliate Member Page Scholar Alan Page, CEO Page Education Foundation June 2010 Page Scholars spend at least 50 hours a year volunteering with youth. As a Page Scholar, my goal is to mentor young students of color and show them that going to college is an attainable goal.  \n \nScholars can reapply to be a scholar at the end of each academic year. I have been a Page Scholar since 2010.\n \n \n\"Guided by our mission to encourage Minnesota’s youth of color to pursue post-secondary education, the Page Education Foundation promotes their academic achievement, personal responsibility and untapped potential to become vital contributors to their communities.\" - Page Education Foundation, 2012\n \n \n Psi Chi Scholar Psi Chi May 2013 A latin based organization that recognizes young outstanding scholars within the field of psychology. Dean's Honor List Michael C. J0rdan, University of St. Thomas June 2013 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan December 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan, University of St. Thomas June 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan December 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan, University of St. Thomas June 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Institute of Packaging Professionals (IoPP) Institute of Packaging Professionals March 2013 Affiliate Member Institute of Packaging Professionals (IoPP) Institute of Packaging Professionals March 2013 Affiliate Member Institute of Packaging Professionals (IoPP) Institute of Packaging Professionals March 2013 Affiliate Member Page Scholar Alan Page, CEO Page Education Foundation June 2010 Page Scholars spend at least 50 hours a year volunteering with youth. As a Page Scholar, my goal is to mentor young students of color and show them that going to college is an attainable goal.  \n \nScholars can reapply to be a scholar at the end of each academic year. I have been a Page Scholar since 2010.\n \n \n\"Guided by our mission to encourage Minnesota’s youth of color to pursue post-secondary education, the Page Education Foundation promotes their academic achievement, personal responsibility and untapped potential to become vital contributors to their communities.\" - Page Education Foundation, 2012\n \n \n Page Scholar Alan Page, CEO Page Education Foundation June 2010 Page Scholars spend at least 50 hours a year volunteering with youth. As a Page Scholar, my goal is to mentor young students of color and show them that going to college is an attainable goal.  \n \nScholars can reapply to be a scholar at the end of each academic year. I have been a Page Scholar since 2010.\n \n \n\"Guided by our mission to encourage Minnesota’s youth of color to pursue post-secondary education, the Page Education Foundation promotes their academic achievement, personal responsibility and untapped potential to become vital contributors to their communities.\" - Page Education Foundation, 2012\n \n \n Page Scholar Alan Page, CEO Page Education Foundation June 2010 Page Scholars spend at least 50 hours a year volunteering with youth. As a Page Scholar, my goal is to mentor young students of color and show them that going to college is an attainable goal.  \n \nScholars can reapply to be a scholar at the end of each academic year. I have been a Page Scholar since 2010.\n \n \n\"Guided by our mission to encourage Minnesota’s youth of color to pursue post-secondary education, the Page Education Foundation promotes their academic achievement, personal responsibility and untapped potential to become vital contributors to their communities.\" - Page Education Foundation, 2012\n \n \n Psi Chi Scholar Psi Chi May 2013 A latin based organization that recognizes young outstanding scholars within the field of psychology. Psi Chi Scholar Psi Chi May 2013 A latin based organization that recognizes young outstanding scholars within the field of psychology. Psi Chi Scholar Psi Chi May 2013 A latin based organization that recognizes young outstanding scholars within the field of psychology. Dean's Honor List Michael C. J0rdan, University of St. Thomas June 2013 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. J0rdan, University of St. Thomas June 2013 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. J0rdan, University of St. Thomas June 2013 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan December 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan December 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan December 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan, University of St. Thomas June 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan, University of St. Thomas June 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan, University of St. Thomas June 2012 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan December 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan December 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan December 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List. Dean's Honor List Michael C. Jordan, University of St. Thomas June 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan, University of St. Thomas June 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  Dean's Honor List Michael C. Jordan, University of St. Thomas June 2011 Students need to obtain a grade point average of 3.50 or higher in the previous semester to be on the Dean's Honor List.  ", "Experience Metrics & Reporting Analyst, Senior Associate JPMorgan Chase July 2013  – Present (2 years 2 months) Newark, DE Responsible for managing business reporting and tactical projects for the trading services operations space in the Corporate & Investment Bank. Lines serviced include Stock, Borrow, Loan (SBL), Depository Receipts, Exchange Traded Funds (ETF) and Agency Lending. Responsible for partnering with these businesses to identify, collect, review & publish key metrics and business analysis presentations, including establishment of new or more impactful metrics. Presented on projects and metrics to senior management in both written and oral formats. Projects of note include the automation of the quarterly FED PCS submission for the Depository Receipt team, enhanced efficiencies in metrics and reporting, developing of capacity reporting and quarterly metrics reporting.  \nAlso involved with the CADP program to offer assistance with interviews and onsite mentoring through continual management of analysts who each remained with the group through a 6-month rotation, along with interns. \n \n- Interfaces with senior leadership to translate business strategies into specific projects, executables and tactics  \n- Continuous process improvement approach, delivering over 10 hours in metrics input time savings per month for ops teams  \n- Developed strategic metrics to deliver weekly, monthly and quarterly performance \n- Experience working with OMI data warehouse (Online Metrics Input) & Business Objects \n Senior Account Manager, AVP Reliance Trust Company January 2005  –  July 2013  (8 years 7 months) Atlanta, GA & Wilmington, DE Paralegal Hicks, Casey & Foster, P.C. June 2003  –  December 2004  (1 year 7 months) Greater Atlanta Area Metrics & Reporting Analyst, Senior Associate JPMorgan Chase July 2013  – Present (2 years 2 months) Newark, DE Responsible for managing business reporting and tactical projects for the trading services operations space in the Corporate & Investment Bank. Lines serviced include Stock, Borrow, Loan (SBL), Depository Receipts, Exchange Traded Funds (ETF) and Agency Lending. Responsible for partnering with these businesses to identify, collect, review & publish key metrics and business analysis presentations, including establishment of new or more impactful metrics. Presented on projects and metrics to senior management in both written and oral formats. Projects of note include the automation of the quarterly FED PCS submission for the Depository Receipt team, enhanced efficiencies in metrics and reporting, developing of capacity reporting and quarterly metrics reporting.  \nAlso involved with the CADP program to offer assistance with interviews and onsite mentoring through continual management of analysts who each remained with the group through a 6-month rotation, along with interns. \n \n- Interfaces with senior leadership to translate business strategies into specific projects, executables and tactics  \n- Continuous process improvement approach, delivering over 10 hours in metrics input time savings per month for ops teams  \n- Developed strategic metrics to deliver weekly, monthly and quarterly performance \n- Experience working with OMI data warehouse (Online Metrics Input) & Business Objects \n Metrics & Reporting Analyst, Senior Associate JPMorgan Chase July 2013  – Present (2 years 2 months) Newark, DE Responsible for managing business reporting and tactical projects for the trading services operations space in the Corporate & Investment Bank. Lines serviced include Stock, Borrow, Loan (SBL), Depository Receipts, Exchange Traded Funds (ETF) and Agency Lending. Responsible for partnering with these businesses to identify, collect, review & publish key metrics and business analysis presentations, including establishment of new or more impactful metrics. Presented on projects and metrics to senior management in both written and oral formats. Projects of note include the automation of the quarterly FED PCS submission for the Depository Receipt team, enhanced efficiencies in metrics and reporting, developing of capacity reporting and quarterly metrics reporting.  \nAlso involved with the CADP program to offer assistance with interviews and onsite mentoring through continual management of analysts who each remained with the group through a 6-month rotation, along with interns. \n \n- Interfaces with senior leadership to translate business strategies into specific projects, executables and tactics  \n- Continuous process improvement approach, delivering over 10 hours in metrics input time savings per month for ops teams  \n- Developed strategic metrics to deliver weekly, monthly and quarterly performance \n- Experience working with OMI data warehouse (Online Metrics Input) & Business Objects \n Senior Account Manager, AVP Reliance Trust Company January 2005  –  July 2013  (8 years 7 months) Atlanta, GA & Wilmington, DE Senior Account Manager, AVP Reliance Trust Company January 2005  –  July 2013  (8 years 7 months) Atlanta, GA & Wilmington, DE Paralegal Hicks, Casey & Foster, P.C. June 2003  –  December 2004  (1 year 7 months) Greater Atlanta Area Paralegal Hicks, Casey & Foster, P.C. June 2003  –  December 2004  (1 year 7 months) Greater Atlanta Area Skills Data Analysis Financial Modeling Banking Financial Services Management Financial Analysis Skills  Data Analysis Financial Modeling Banking Financial Services Management Financial Analysis Data Analysis Financial Modeling Banking Financial Services Management Financial Analysis Data Analysis Financial Modeling Banking Financial Services Management Financial Analysis Education East Carolina University BSBA,  Business Management 1999  – 2003 Activities and Societies:  Football Team East Carolina University BSBA,  Business Management 1999  – 2003 Activities and Societies:  Football Team East Carolina University BSBA,  Business Management 1999  – 2003 Activities and Societies:  Football Team East Carolina University BSBA,  Business Management 1999  – 2003 Activities and Societies:  Football Team ", "Summary Analyst experienced in applying business consultation with technology and proactive thinking to re-invent and improve success measures. Proven ability to develop strong, productive partnerships and solutions to key strategic initiatives across Unum's Sales and Client Management organization ($750M annual sales). Experience using technology such as Qlikview to integrate multiple data sources and provide new insights and ways of thinking. Extremely passionate about solving complex business issues, determining and measuring success, and providing leadership with concise and actionable insights to help achieve growth objectives. Summary Analyst experienced in applying business consultation with technology and proactive thinking to re-invent and improve success measures. Proven ability to develop strong, productive partnerships and solutions to key strategic initiatives across Unum's Sales and Client Management organization ($750M annual sales). Experience using technology such as Qlikview to integrate multiple data sources and provide new insights and ways of thinking. Extremely passionate about solving complex business issues, determining and measuring success, and providing leadership with concise and actionable insights to help achieve growth objectives. Analyst experienced in applying business consultation with technology and proactive thinking to re-invent and improve success measures. Proven ability to develop strong, productive partnerships and solutions to key strategic initiatives across Unum's Sales and Client Management organization ($750M annual sales). Experience using technology such as Qlikview to integrate multiple data sources and provide new insights and ways of thinking. Extremely passionate about solving complex business issues, determining and measuring success, and providing leadership with concise and actionable insights to help achieve growth objectives. Analyst experienced in applying business consultation with technology and proactive thinking to re-invent and improve success measures. Proven ability to develop strong, productive partnerships and solutions to key strategic initiatives across Unum's Sales and Client Management organization ($750M annual sales). Experience using technology such as Qlikview to integrate multiple data sources and provide new insights and ways of thinking. Extremely passionate about solving complex business issues, determining and measuring success, and providing leadership with concise and actionable insights to help achieve growth objectives. Experience Metrics and Reporting Analyst III Unum January 2014  – Present (1 year 8 months) Portland, Maine Area -Proactively re-designed and aligned Client Management success measures nationally through the development and deployment of: \n---Profiles and personalized targets focused on achieving national growth and persistency goals  \n----Peer analysis, watch areas, YOY comparisons and pipeline management developed to provide CM's tailored insights into their results \n---Trained field office leadership via regional and office level calls and application demos \n-Developed recommendations and presented sales rep profile targets to senior field leadership applying sales trending, forecasted turnover expectations, and the national sales plan \n-Developed staffing tool allowing field and home office leadership to proactively assess regional and market specific staffing needs \n-Eliminated sales office client referral requests through application development Metrics and Reporting Analyst II Unum December 2011  –  December 2013  (2 years 1 month) Portland, Maine Area Responsible for reporting and analysis for Unum's Sales and Client Management organization. \n- Sales rep productivity profile development and staffing modeling \n- Premium/coverage and compensation trends for Group/VB business \n- VB distribution strategy analysis  \n- Core sales rep distribution strategy analysis \n- Sales rep cost/benefit analysis \n- Rep profile sales projections \n- Sales rep retention analysis Sales and Marketing Analyst Unum June 2010  –  December 2011  (1 year 7 months) Supported expense management reporting, analysis, and forecasting for Field Sales and Distribution Development. Helped develop the 2010-2012 annual budgets, led meetings with field staff to teach them how to use the reporting tools and discuss ongoing expense results, and provided senior management with budget recommendations to help achieve expense targets. \n- Designed a bottoms-up budget to improve forecasting and management’s decision making. \n- Helped develop an expense tracking tool to improve accountability and expense benchmarking. Marketing Intern- Strategy Team Hannaford Supermarkets May 2008  –  June 2010  (2 years 2 months) Managed a six-figure promotional account to drive tourists into select seasonal retail locations using coupons, in-store sampling events and print / online advertising. Responsible for media buying and negotiation, working with vendors across New England and New York, and determining how to maximize investment return while ensuring coverage across markets. \n- Selected to work on a Generation Y consumer price-value messaging project for senior management. Provided secondary research to support the recommendation, participated in focus groups and helped vet ideas for the team. \n- Initiated and managed sponsorship of a 4,500 attendee food and wine festival. \n-- Negotiated a 38% reduction in sponsorship price. \n-- Managed a catering company, seven vendors, and an internal staff of twelve. Co-New Media Chair Maine Marketing Association December 2007  –  May 2010  (2 years 6 months) Increase organizational involvement and drive event ticket sales through new media channels. Retail Associate Hannaford Supermarkets June 2004  –  May 2008  (4 years) Cross-trained in several departments to learn more about the business and began training towards assisting in store management. Marketing Intern Catch A Piece of Maine December 2007  –  April 2008  (5 months) Researched business and lifestyle magazines with potential interest in promoting Catch a Piece of Maine’s unique business. Metrics and Reporting Analyst III Unum January 2014  – Present (1 year 8 months) Portland, Maine Area -Proactively re-designed and aligned Client Management success measures nationally through the development and deployment of: \n---Profiles and personalized targets focused on achieving national growth and persistency goals  \n----Peer analysis, watch areas, YOY comparisons and pipeline management developed to provide CM's tailored insights into their results \n---Trained field office leadership via regional and office level calls and application demos \n-Developed recommendations and presented sales rep profile targets to senior field leadership applying sales trending, forecasted turnover expectations, and the national sales plan \n-Developed staffing tool allowing field and home office leadership to proactively assess regional and market specific staffing needs \n-Eliminated sales office client referral requests through application development Metrics and Reporting Analyst III Unum January 2014  – Present (1 year 8 months) Portland, Maine Area -Proactively re-designed and aligned Client Management success measures nationally through the development and deployment of: \n---Profiles and personalized targets focused on achieving national growth and persistency goals  \n----Peer analysis, watch areas, YOY comparisons and pipeline management developed to provide CM's tailored insights into their results \n---Trained field office leadership via regional and office level calls and application demos \n-Developed recommendations and presented sales rep profile targets to senior field leadership applying sales trending, forecasted turnover expectations, and the national sales plan \n-Developed staffing tool allowing field and home office leadership to proactively assess regional and market specific staffing needs \n-Eliminated sales office client referral requests through application development Metrics and Reporting Analyst II Unum December 2011  –  December 2013  (2 years 1 month) Portland, Maine Area Responsible for reporting and analysis for Unum's Sales and Client Management organization. \n- Sales rep productivity profile development and staffing modeling \n- Premium/coverage and compensation trends for Group/VB business \n- VB distribution strategy analysis  \n- Core sales rep distribution strategy analysis \n- Sales rep cost/benefit analysis \n- Rep profile sales projections \n- Sales rep retention analysis Metrics and Reporting Analyst II Unum December 2011  –  December 2013  (2 years 1 month) Portland, Maine Area Responsible for reporting and analysis for Unum's Sales and Client Management organization. \n- Sales rep productivity profile development and staffing modeling \n- Premium/coverage and compensation trends for Group/VB business \n- VB distribution strategy analysis  \n- Core sales rep distribution strategy analysis \n- Sales rep cost/benefit analysis \n- Rep profile sales projections \n- Sales rep retention analysis Sales and Marketing Analyst Unum June 2010  –  December 2011  (1 year 7 months) Supported expense management reporting, analysis, and forecasting for Field Sales and Distribution Development. Helped develop the 2010-2012 annual budgets, led meetings with field staff to teach them how to use the reporting tools and discuss ongoing expense results, and provided senior management with budget recommendations to help achieve expense targets. \n- Designed a bottoms-up budget to improve forecasting and management’s decision making. \n- Helped develop an expense tracking tool to improve accountability and expense benchmarking. Sales and Marketing Analyst Unum June 2010  –  December 2011  (1 year 7 months) Supported expense management reporting, analysis, and forecasting for Field Sales and Distribution Development. Helped develop the 2010-2012 annual budgets, led meetings with field staff to teach them how to use the reporting tools and discuss ongoing expense results, and provided senior management with budget recommendations to help achieve expense targets. \n- Designed a bottoms-up budget to improve forecasting and management’s decision making. \n- Helped develop an expense tracking tool to improve accountability and expense benchmarking. Marketing Intern- Strategy Team Hannaford Supermarkets May 2008  –  June 2010  (2 years 2 months) Managed a six-figure promotional account to drive tourists into select seasonal retail locations using coupons, in-store sampling events and print / online advertising. Responsible for media buying and negotiation, working with vendors across New England and New York, and determining how to maximize investment return while ensuring coverage across markets. \n- Selected to work on a Generation Y consumer price-value messaging project for senior management. Provided secondary research to support the recommendation, participated in focus groups and helped vet ideas for the team. \n- Initiated and managed sponsorship of a 4,500 attendee food and wine festival. \n-- Negotiated a 38% reduction in sponsorship price. \n-- Managed a catering company, seven vendors, and an internal staff of twelve. Marketing Intern- Strategy Team Hannaford Supermarkets May 2008  –  June 2010  (2 years 2 months) Managed a six-figure promotional account to drive tourists into select seasonal retail locations using coupons, in-store sampling events and print / online advertising. Responsible for media buying and negotiation, working with vendors across New England and New York, and determining how to maximize investment return while ensuring coverage across markets. \n- Selected to work on a Generation Y consumer price-value messaging project for senior management. Provided secondary research to support the recommendation, participated in focus groups and helped vet ideas for the team. \n- Initiated and managed sponsorship of a 4,500 attendee food and wine festival. \n-- Negotiated a 38% reduction in sponsorship price. \n-- Managed a catering company, seven vendors, and an internal staff of twelve. Co-New Media Chair Maine Marketing Association December 2007  –  May 2010  (2 years 6 months) Increase organizational involvement and drive event ticket sales through new media channels. Co-New Media Chair Maine Marketing Association December 2007  –  May 2010  (2 years 6 months) Increase organizational involvement and drive event ticket sales through new media channels. Retail Associate Hannaford Supermarkets June 2004  –  May 2008  (4 years) Cross-trained in several departments to learn more about the business and began training towards assisting in store management. Retail Associate Hannaford Supermarkets June 2004  –  May 2008  (4 years) Cross-trained in several departments to learn more about the business and began training towards assisting in store management. Marketing Intern Catch A Piece of Maine December 2007  –  April 2008  (5 months) Researched business and lifestyle magazines with potential interest in promoting Catch a Piece of Maine’s unique business. Marketing Intern Catch A Piece of Maine December 2007  –  April 2008  (5 months) Researched business and lifestyle magazines with potential interest in promoting Catch a Piece of Maine’s unique business. Languages   Skills Training Microsoft Excel Strategy Social Media Budget Process Forecasting Analysis Marketing Leadership Budget Sales Rep Profiling Salesforce.com... QlikView Salesforce.com Business Intelligence Skills  Training Microsoft Excel Strategy Social Media Budget Process Forecasting Analysis Marketing Leadership Budget Sales Rep Profiling Salesforce.com... QlikView Salesforce.com Business Intelligence Training Microsoft Excel Strategy Social Media Budget Process Forecasting Analysis Marketing Leadership Budget Sales Rep Profiling Salesforce.com... QlikView Salesforce.com Business Intelligence Training Microsoft Excel Strategy Social Media Budget Process Forecasting Analysis Marketing Leadership Budget Sales Rep Profiling Salesforce.com... QlikView Salesforce.com Business Intelligence Education University of Southern Maine - School of Business B.S. in Marketing,  Marketing , 3.6 2006  – 2010 Activities and Societies:  Student Marketing Association\nSchool of Business Peer Mentor University of Southern Maine - School of Business B.S. in Marketing,  Marketing , 3.6 2006  – 2010 Activities and Societies:  Student Marketing Association\nSchool of Business Peer Mentor University of Southern Maine - School of Business B.S. in Marketing,  Marketing , 3.6 2006  – 2010 Activities and Societies:  Student Marketing Association\nSchool of Business Peer Mentor University of Southern Maine - School of Business B.S. in Marketing,  Marketing , 3.6 2006  – 2010 Activities and Societies:  Student Marketing Association\nSchool of Business Peer Mentor Honors & Awards Unum USOAR Award for Leadership Excellence January 2013 Unum ASPIRE Award February 2013 Nominated and selected to attend Unum's employee recognition event for high performance and leadership. Additional Honors & Awards 2008 William G. McGowan Full Tuition Scholarship Winner \n2008 Monster DLP Leadership Conference Unum USOAR Award for Leadership Excellence January 2013 Unum USOAR Award for Leadership Excellence January 2013 Unum USOAR Award for Leadership Excellence January 2013 Unum ASPIRE Award February 2013 Nominated and selected to attend Unum's employee recognition event for high performance and leadership. Unum ASPIRE Award February 2013 Nominated and selected to attend Unum's employee recognition event for high performance and leadership. Unum ASPIRE Award February 2013 Nominated and selected to attend Unum's employee recognition event for high performance and leadership. Additional Honors & Awards 2008 William G. McGowan Full Tuition Scholarship Winner \n2008 Monster DLP Leadership Conference Additional Honors & Awards 2008 William G. McGowan Full Tuition Scholarship Winner \n2008 Monster DLP Leadership Conference Additional Honors & Awards 2008 William G. McGowan Full Tuition Scholarship Winner \n2008 Monster DLP Leadership Conference ", "Summary Meticulous, results-oriented editor and analyst experienced in managing multiple tasks and meeting deadlines. Possesses strong leadership capabilities, having guided teams to successful completion of numerous projects for leading marketing firms. Advanced knowledge of entire Office suite, SQL, HTML, FTP, Google Analytics and DoubleClick. Google AdWords advanced certification and adCenter accreditation. Summary Meticulous, results-oriented editor and analyst experienced in managing multiple tasks and meeting deadlines. Possesses strong leadership capabilities, having guided teams to successful completion of numerous projects for leading marketing firms. Advanced knowledge of entire Office suite, SQL, HTML, FTP, Google Analytics and DoubleClick. Google AdWords advanced certification and adCenter accreditation. Meticulous, results-oriented editor and analyst experienced in managing multiple tasks and meeting deadlines. Possesses strong leadership capabilities, having guided teams to successful completion of numerous projects for leading marketing firms. Advanced knowledge of entire Office suite, SQL, HTML, FTP, Google Analytics and DoubleClick. Google AdWords advanced certification and adCenter accreditation. Meticulous, results-oriented editor and analyst experienced in managing multiple tasks and meeting deadlines. Possesses strong leadership capabilities, having guided teams to successful completion of numerous projects for leading marketing firms. Advanced knowledge of entire Office suite, SQL, HTML, FTP, Google Analytics and DoubleClick. Google AdWords advanced certification and adCenter accreditation. Experience Metrics and Reporting Analyst Yahoo March 2014  – Present (1 year 6 months) Burbank, CA Manager, Channel and Feed Services The Search Agency January 2012  –  March 2014  (2 years 3 months) Greater Los Angeles Area -\tStrategized with account managers to formulate and implement goals to best meet client needs and maximize efficiency, decreasing CPCs while increasing conversions and ROIs \n-\tAudited and optimized client feeds for prime performance, increasing conversions and ROAS across all channels \n-\tEstablished weekly and monthly goals based on client KPIs, achieving targets through logic implementation and bidding SEM and SEO Specialist Crisp Content March 2011  –  December 2011  (10 months) Carluke, Scotland -\tConsulted with company founder to construct and implement business growth strategy, resulting in 43% increase in client base and 72% increase in annual revenue \n-\tManaged SEM and SEO content for multiple accounts in various fields of commerce, guiding clients with limited degrees of digital marketing knowledge through the process of building and maintaining their brands Copywriter Business.com August 2011  –  September 2011  (2 months) Santa Monica, CA Relevance Analyst Yahoo! Search Marketing December 2009  –  January 2011  (1 year 2 months) -\tResolved internal and external complaints regarding non-compliant sponsored results, working closely with both management and policy teams to remedy legally sensitive issues requiring immediate action \n-\tManaged internal system rules and datasets that govern routing, blocking and style cleaning Volunteer Committee Chair Yahoo! Employee Foundation March 2007  –  January 2011  (3 years 11 months) -\tOrganized and successfully implemented multiple events for over 1,000 employees \n-\tBuilt and maintained ties between Yahoo! and non-profit organizations throughout California Editor Yahoo! Search Marketing May 2006  –  December 2009  (3 years 8 months) -\tSenior member of Risk Mitigation team, driving 50% quality score increase  \n-\tBalanced multiple responsibilities simultaneously, including account management, distribution support, account optimization and list management, while still maintaining exemplary productivity and audits Associate Head Editor Discovery Research Group May 2000  –  March 2006  (5 years 11 months) -\tManaged productivity of editing staff to consistently uphold quality and satisfy deadlines  \n-\tPerformed on multiple software platforms to meet exacting standards of clients in various fields of commerce Director of Volunteers for English Language Center Utah State University Service Center January 2003  –  May 2004  (1 year 5 months) -\tRecruited and supervised over 30 volunteers, coordinating efforts with English Language Center directors to increase functionality of volunteers and grant funds \n-\tUtilized command of English language to instruct individuals of various ethnicities, ages and educational backgrounds Editor Western Wats September 1999  –  May 2000  (9 months) -\tEdited and proofread all outgoing research data for coherence and accuracy, providing insight into improving data collection methods \n-\tConsulted with researchers and programmers to identify best strategies to meet corporate objectives Assistant Education Curator Nora Eccles Harrison Museum of Art August 1998  –  June 1999  (11 months) -\tEmployed knowledge of museum needs in fundraising discussions with donors \n-\tWrote and developed exhibit-based pamphlets, display abstracts and curriculum for visiting school groups Metrics and Reporting Analyst Yahoo March 2014  – Present (1 year 6 months) Burbank, CA Metrics and Reporting Analyst Yahoo March 2014  – Present (1 year 6 months) Burbank, CA Manager, Channel and Feed Services The Search Agency January 2012  –  March 2014  (2 years 3 months) Greater Los Angeles Area -\tStrategized with account managers to formulate and implement goals to best meet client needs and maximize efficiency, decreasing CPCs while increasing conversions and ROIs \n-\tAudited and optimized client feeds for prime performance, increasing conversions and ROAS across all channels \n-\tEstablished weekly and monthly goals based on client KPIs, achieving targets through logic implementation and bidding Manager, Channel and Feed Services The Search Agency January 2012  –  March 2014  (2 years 3 months) Greater Los Angeles Area -\tStrategized with account managers to formulate and implement goals to best meet client needs and maximize efficiency, decreasing CPCs while increasing conversions and ROIs \n-\tAudited and optimized client feeds for prime performance, increasing conversions and ROAS across all channels \n-\tEstablished weekly and monthly goals based on client KPIs, achieving targets through logic implementation and bidding SEM and SEO Specialist Crisp Content March 2011  –  December 2011  (10 months) Carluke, Scotland -\tConsulted with company founder to construct and implement business growth strategy, resulting in 43% increase in client base and 72% increase in annual revenue \n-\tManaged SEM and SEO content for multiple accounts in various fields of commerce, guiding clients with limited degrees of digital marketing knowledge through the process of building and maintaining their brands SEM and SEO Specialist Crisp Content March 2011  –  December 2011  (10 months) Carluke, Scotland -\tConsulted with company founder to construct and implement business growth strategy, resulting in 43% increase in client base and 72% increase in annual revenue \n-\tManaged SEM and SEO content for multiple accounts in various fields of commerce, guiding clients with limited degrees of digital marketing knowledge through the process of building and maintaining their brands Copywriter Business.com August 2011  –  September 2011  (2 months) Santa Monica, CA Copywriter Business.com August 2011  –  September 2011  (2 months) Santa Monica, CA Relevance Analyst Yahoo! Search Marketing December 2009  –  January 2011  (1 year 2 months) -\tResolved internal and external complaints regarding non-compliant sponsored results, working closely with both management and policy teams to remedy legally sensitive issues requiring immediate action \n-\tManaged internal system rules and datasets that govern routing, blocking and style cleaning Relevance Analyst Yahoo! Search Marketing December 2009  –  January 2011  (1 year 2 months) -\tResolved internal and external complaints regarding non-compliant sponsored results, working closely with both management and policy teams to remedy legally sensitive issues requiring immediate action \n-\tManaged internal system rules and datasets that govern routing, blocking and style cleaning Volunteer Committee Chair Yahoo! Employee Foundation March 2007  –  January 2011  (3 years 11 months) -\tOrganized and successfully implemented multiple events for over 1,000 employees \n-\tBuilt and maintained ties between Yahoo! and non-profit organizations throughout California Volunteer Committee Chair Yahoo! Employee Foundation March 2007  –  January 2011  (3 years 11 months) -\tOrganized and successfully implemented multiple events for over 1,000 employees \n-\tBuilt and maintained ties between Yahoo! and non-profit organizations throughout California Editor Yahoo! Search Marketing May 2006  –  December 2009  (3 years 8 months) -\tSenior member of Risk Mitigation team, driving 50% quality score increase  \n-\tBalanced multiple responsibilities simultaneously, including account management, distribution support, account optimization and list management, while still maintaining exemplary productivity and audits Editor Yahoo! Search Marketing May 2006  –  December 2009  (3 years 8 months) -\tSenior member of Risk Mitigation team, driving 50% quality score increase  \n-\tBalanced multiple responsibilities simultaneously, including account management, distribution support, account optimization and list management, while still maintaining exemplary productivity and audits Associate Head Editor Discovery Research Group May 2000  –  March 2006  (5 years 11 months) -\tManaged productivity of editing staff to consistently uphold quality and satisfy deadlines  \n-\tPerformed on multiple software platforms to meet exacting standards of clients in various fields of commerce Associate Head Editor Discovery Research Group May 2000  –  March 2006  (5 years 11 months) -\tManaged productivity of editing staff to consistently uphold quality and satisfy deadlines  \n-\tPerformed on multiple software platforms to meet exacting standards of clients in various fields of commerce Director of Volunteers for English Language Center Utah State University Service Center January 2003  –  May 2004  (1 year 5 months) -\tRecruited and supervised over 30 volunteers, coordinating efforts with English Language Center directors to increase functionality of volunteers and grant funds \n-\tUtilized command of English language to instruct individuals of various ethnicities, ages and educational backgrounds Director of Volunteers for English Language Center Utah State University Service Center January 2003  –  May 2004  (1 year 5 months) -\tRecruited and supervised over 30 volunteers, coordinating efforts with English Language Center directors to increase functionality of volunteers and grant funds \n-\tUtilized command of English language to instruct individuals of various ethnicities, ages and educational backgrounds Editor Western Wats September 1999  –  May 2000  (9 months) -\tEdited and proofread all outgoing research data for coherence and accuracy, providing insight into improving data collection methods \n-\tConsulted with researchers and programmers to identify best strategies to meet corporate objectives Editor Western Wats September 1999  –  May 2000  (9 months) -\tEdited and proofread all outgoing research data for coherence and accuracy, providing insight into improving data collection methods \n-\tConsulted with researchers and programmers to identify best strategies to meet corporate objectives Assistant Education Curator Nora Eccles Harrison Museum of Art August 1998  –  June 1999  (11 months) -\tEmployed knowledge of museum needs in fundraising discussions with donors \n-\tWrote and developed exhibit-based pamphlets, display abstracts and curriculum for visiting school groups Assistant Education Curator Nora Eccles Harrison Museum of Art August 1998  –  June 1999  (11 months) -\tEmployed knowledge of museum needs in fundraising discussions with donors \n-\tWrote and developed exhibit-based pamphlets, display abstracts and curriculum for visiting school groups Skills Copywriting PPC Content Strategy SEO SEM Link Building Web Analytics Risk Management MSN AdCenter Advertising Search Advertising Display Advertising Integrated Marketing User Experience Google Adwords Google Analytics Web Marketing Digital Marketing Digital Strategy Conversion Optimization Mobile Marketing Landing Page... Omniture Search A/B testing Mobile Advertising Keyword Research Affiliate Marketing Online Marketing See 14+     See less Skills  Copywriting PPC Content Strategy SEO SEM Link Building Web Analytics Risk Management MSN AdCenter Advertising Search Advertising Display Advertising Integrated Marketing User Experience Google Adwords Google Analytics Web Marketing Digital Marketing Digital Strategy Conversion Optimization Mobile Marketing Landing Page... Omniture Search A/B testing Mobile Advertising Keyword Research Affiliate Marketing Online Marketing See 14+     See less Copywriting PPC Content Strategy SEO SEM Link Building Web Analytics Risk Management MSN AdCenter Advertising Search Advertising Display Advertising Integrated Marketing User Experience Google Adwords Google Analytics Web Marketing Digital Marketing Digital Strategy Conversion Optimization Mobile Marketing Landing Page... Omniture Search A/B testing Mobile Advertising Keyword Research Affiliate Marketing Online Marketing See 14+     See less Copywriting PPC Content Strategy SEO SEM Link Building Web Analytics Risk Management MSN AdCenter Advertising Search Advertising Display Advertising Integrated Marketing User Experience Google Adwords Google Analytics Web Marketing Digital Marketing Digital Strategy Conversion Optimization Mobile Marketing Landing Page... Omniture Search A/B testing Mobile Advertising Keyword Research Affiliate Marketing Online Marketing See 14+     See less Education Utah State University Bachelors,  Philosophy Utah State University Bachelors,  Philosophy Utah State University Bachelors,  Philosophy Utah State University Bachelors,  Philosophy ", "Summary I am a customer focused analyst with a strong background in manufacturing and customer service. The past 8 years of my career I worked closely providing data summaries to the Director of Sales. The work involved the assembly of data from a variety of manufacturing data systems. \n \nI am currently a Metrics Reporting Analyst reporting to the PMO Manager at CSC working on the NY-Health Exchange project. Assembling weekly progress reports for presentation to the NY Department of Health. \n \n- Over 20 years’ experience driving profitable growth for North Americas largest soft-alloy extrusions organization. \n- Results-oriented, tenacious, analytical, and highly motivated pricing/data manager, able to achieve results in a very competitive market.  \n- Experienced in profitable-growth. marketing, customer service, product design, and data analysis. \n- Well versed in the aluminum extrusion process. \n \nSpecialties: Proficiency with Excel, Access, PowerPoint, FrontPage, Word, Microsoft Visio, Microsoft Map, pVelocity, Oracle Discoverer Reporting. Summary I am a customer focused analyst with a strong background in manufacturing and customer service. The past 8 years of my career I worked closely providing data summaries to the Director of Sales. The work involved the assembly of data from a variety of manufacturing data systems. \n \nI am currently a Metrics Reporting Analyst reporting to the PMO Manager at CSC working on the NY-Health Exchange project. Assembling weekly progress reports for presentation to the NY Department of Health. \n \n- Over 20 years’ experience driving profitable growth for North Americas largest soft-alloy extrusions organization. \n- Results-oriented, tenacious, analytical, and highly motivated pricing/data manager, able to achieve results in a very competitive market.  \n- Experienced in profitable-growth. marketing, customer service, product design, and data analysis. \n- Well versed in the aluminum extrusion process. \n \nSpecialties: Proficiency with Excel, Access, PowerPoint, FrontPage, Word, Microsoft Visio, Microsoft Map, pVelocity, Oracle Discoverer Reporting. I am a customer focused analyst with a strong background in manufacturing and customer service. The past 8 years of my career I worked closely providing data summaries to the Director of Sales. The work involved the assembly of data from a variety of manufacturing data systems. \n \nI am currently a Metrics Reporting Analyst reporting to the PMO Manager at CSC working on the NY-Health Exchange project. Assembling weekly progress reports for presentation to the NY Department of Health. \n \n- Over 20 years’ experience driving profitable growth for North Americas largest soft-alloy extrusions organization. \n- Results-oriented, tenacious, analytical, and highly motivated pricing/data manager, able to achieve results in a very competitive market.  \n- Experienced in profitable-growth. marketing, customer service, product design, and data analysis. \n- Well versed in the aluminum extrusion process. \n \nSpecialties: Proficiency with Excel, Access, PowerPoint, FrontPage, Word, Microsoft Visio, Microsoft Map, pVelocity, Oracle Discoverer Reporting. I am a customer focused analyst with a strong background in manufacturing and customer service. The past 8 years of my career I worked closely providing data summaries to the Director of Sales. The work involved the assembly of data from a variety of manufacturing data systems. \n \nI am currently a Metrics Reporting Analyst reporting to the PMO Manager at CSC working on the NY-Health Exchange project. Assembling weekly progress reports for presentation to the NY Department of Health. \n \n- Over 20 years’ experience driving profitable growth for North Americas largest soft-alloy extrusions organization. \n- Results-oriented, tenacious, analytical, and highly motivated pricing/data manager, able to achieve results in a very competitive market.  \n- Experienced in profitable-growth. marketing, customer service, product design, and data analysis. \n- Well versed in the aluminum extrusion process. \n \nSpecialties: Proficiency with Excel, Access, PowerPoint, FrontPage, Word, Microsoft Visio, Microsoft Map, pVelocity, Oracle Discoverer Reporting. Experience Metrics Reporting Analyst CSC October 2013  – Present (1 year 11 months) Rensselaer, NY Reporting directly to the PMO Manager. Examines client-facing account level reports for accuracy; gains approval from account program management for adjustments. Creates reports and tools using MS Office software. \nAssists in reviewing project integration processes for reporting accuracy. \n \n•\tWork with Track Managers on New York State of Health project in providing accurate and timely project updates \n•\tDevelop and maintain reports utilizing IBM Rational Jazz Server software \n•\tCollects and compiles metric data for weekly reporting to NY Department of Health \n•\tResponsible for writing AD-HOC queries and, macros to collect and analyze data from various sources \n•\tSupport PMO Manager by analyzing FTE’s and Personnel time tracking \n North American Pricing/Data Manager Sapa Extrusions June 1992  –  October 2013  (21 years 5 months) Cressona, PA Reporting directly to Director of Distribution Branding, Pricing and Programs. Responsible for price-setting for all markets – domestic and international – in order to achieve profitable margin levels at all manufacturing locations across the US. \n \n· Responsible for establishing profitable base pricing for the Soft Alloy Extrusion Division \n· Lead the quoting of long term contracts \n· Analyze customer and market shipments for profitability \n· Secure profitable business for Sapa Extrusions utilizing extrusion facilities in North America & abroad. \n· Direct individuals in the accurate set-up of pricing in Oracle. \n· Supply monthly shipment reports to management \n· Utilizing pVelocity profitability software monitor new /existing products for \nprofitability. \n· Work with Account Managers to gain more profitable business . \n· Audit price lists for accuracy. \nKey Accomplishments \n· Worked with manufacturing and sales to i ncreased revenue and profitability on new \nand existing items \n· Developed and maintained Access database for customer base pricing , and contract \ntracking. \n· Developed Pricing Policy Handbook \n· 18+ years Perfect Attendance Capability Review Manager Sapa Profiler AB January 1999  –  June 2004  (5 years 6 months) •\tSupervised eight individuals responsible for quoting and drafting of new extrusions \n•\tDetermined pricing for new Soft, Hard and Cold Finish extruded products \n•\tSecured profitable business for Alcoa Engineered Products utilizing extrusion facilities in the U.S. and abroad. \n•\tProvided customer assistance in extrusion design \n•\tProvided customer training on aluminum extrusion process and tolerances Capability Review Manager Alcoa Engineered Products January 1999  –  January 2003  (4 years 1 month) · Supervised eight individuals responsible for quoting and drafting of new extrusions \n· Determined pricing for new Soft, Hard and Cold Finish extruded products \n· Secured profitable business for Alcoa Engineered Products utilizing extrusion \nfacilities in the U.S. and abroad. \n· Provided customer assistance in extrusion design \nKey Accomplishments \n· Developed and currently maintain intranet site of technical resources and provide \nsupport for Customer Service Department \n· Authored ISO procedures and trained Customer Service Department in all aspects of \nnew inquiry review \n· Improved 24 hr response time from 58% to 85% on inquiries \n· Created Access database to track new extrusion designs and inquiries \n· Established a searchable referencing system utili zing data extracted from the HP \n3000 and Oracle Senior Presale Estimator/Group Leader Cressona Aluminum/Alumax June 1992  –  April 1999  (6 years 11 months) Directed 8 estimators in the accurate processing of the capability analysis of aluminum extruded profiles under deadline constraints. Presale/Drafting Group Leader Cressona Aluminum/Alumax January 1992  –  January 1999  (7 years 1 month) · Directed Estimators in the accurate processing of the capability analysis under \ndeadline constraints. \n· Contacted customers and assisted Customer Service Department with technical \nsupport. \n· Utilizing Excel and Access developed systems to automate common tasks in \nestimating and drafting functions. \n· Authored and maintained Presale Specification Manual and converted it to an online \nresource. Metrics Reporting Analyst CSC October 2013  – Present (1 year 11 months) Rensselaer, NY Reporting directly to the PMO Manager. Examines client-facing account level reports for accuracy; gains approval from account program management for adjustments. Creates reports and tools using MS Office software. \nAssists in reviewing project integration processes for reporting accuracy. \n \n•\tWork with Track Managers on New York State of Health project in providing accurate and timely project updates \n•\tDevelop and maintain reports utilizing IBM Rational Jazz Server software \n•\tCollects and compiles metric data for weekly reporting to NY Department of Health \n•\tResponsible for writing AD-HOC queries and, macros to collect and analyze data from various sources \n•\tSupport PMO Manager by analyzing FTE’s and Personnel time tracking \n Metrics Reporting Analyst CSC October 2013  – Present (1 year 11 months) Rensselaer, NY Reporting directly to the PMO Manager. Examines client-facing account level reports for accuracy; gains approval from account program management for adjustments. Creates reports and tools using MS Office software. \nAssists in reviewing project integration processes for reporting accuracy. \n \n•\tWork with Track Managers on New York State of Health project in providing accurate and timely project updates \n•\tDevelop and maintain reports utilizing IBM Rational Jazz Server software \n•\tCollects and compiles metric data for weekly reporting to NY Department of Health \n•\tResponsible for writing AD-HOC queries and, macros to collect and analyze data from various sources \n•\tSupport PMO Manager by analyzing FTE’s and Personnel time tracking \n North American Pricing/Data Manager Sapa Extrusions June 1992  –  October 2013  (21 years 5 months) Cressona, PA Reporting directly to Director of Distribution Branding, Pricing and Programs. Responsible for price-setting for all markets – domestic and international – in order to achieve profitable margin levels at all manufacturing locations across the US. \n \n· Responsible for establishing profitable base pricing for the Soft Alloy Extrusion Division \n· Lead the quoting of long term contracts \n· Analyze customer and market shipments for profitability \n· Secure profitable business for Sapa Extrusions utilizing extrusion facilities in North America & abroad. \n· Direct individuals in the accurate set-up of pricing in Oracle. \n· Supply monthly shipment reports to management \n· Utilizing pVelocity profitability software monitor new /existing products for \nprofitability. \n· Work with Account Managers to gain more profitable business . \n· Audit price lists for accuracy. \nKey Accomplishments \n· Worked with manufacturing and sales to i ncreased revenue and profitability on new \nand existing items \n· Developed and maintained Access database for customer base pricing , and contract \ntracking. \n· Developed Pricing Policy Handbook \n· 18+ years Perfect Attendance North American Pricing/Data Manager Sapa Extrusions June 1992  –  October 2013  (21 years 5 months) Cressona, PA Reporting directly to Director of Distribution Branding, Pricing and Programs. Responsible for price-setting for all markets – domestic and international – in order to achieve profitable margin levels at all manufacturing locations across the US. \n \n· Responsible for establishing profitable base pricing for the Soft Alloy Extrusion Division \n· Lead the quoting of long term contracts \n· Analyze customer and market shipments for profitability \n· Secure profitable business for Sapa Extrusions utilizing extrusion facilities in North America & abroad. \n· Direct individuals in the accurate set-up of pricing in Oracle. \n· Supply monthly shipment reports to management \n· Utilizing pVelocity profitability software monitor new /existing products for \nprofitability. \n· Work with Account Managers to gain more profitable business . \n· Audit price lists for accuracy. \nKey Accomplishments \n· Worked with manufacturing and sales to i ncreased revenue and profitability on new \nand existing items \n· Developed and maintained Access database for customer base pricing , and contract \ntracking. \n· Developed Pricing Policy Handbook \n· 18+ years Perfect Attendance Capability Review Manager Sapa Profiler AB January 1999  –  June 2004  (5 years 6 months) •\tSupervised eight individuals responsible for quoting and drafting of new extrusions \n•\tDetermined pricing for new Soft, Hard and Cold Finish extruded products \n•\tSecured profitable business for Alcoa Engineered Products utilizing extrusion facilities in the U.S. and abroad. \n•\tProvided customer assistance in extrusion design \n•\tProvided customer training on aluminum extrusion process and tolerances Capability Review Manager Sapa Profiler AB January 1999  –  June 2004  (5 years 6 months) •\tSupervised eight individuals responsible for quoting and drafting of new extrusions \n•\tDetermined pricing for new Soft, Hard and Cold Finish extruded products \n•\tSecured profitable business for Alcoa Engineered Products utilizing extrusion facilities in the U.S. and abroad. \n•\tProvided customer assistance in extrusion design \n•\tProvided customer training on aluminum extrusion process and tolerances Capability Review Manager Alcoa Engineered Products January 1999  –  January 2003  (4 years 1 month) · Supervised eight individuals responsible for quoting and drafting of new extrusions \n· Determined pricing for new Soft, Hard and Cold Finish extruded products \n· Secured profitable business for Alcoa Engineered Products utilizing extrusion \nfacilities in the U.S. and abroad. \n· Provided customer assistance in extrusion design \nKey Accomplishments \n· Developed and currently maintain intranet site of technical resources and provide \nsupport for Customer Service Department \n· Authored ISO procedures and trained Customer Service Department in all aspects of \nnew inquiry review \n· Improved 24 hr response time from 58% to 85% on inquiries \n· Created Access database to track new extrusion designs and inquiries \n· Established a searchable referencing system utili zing data extracted from the HP \n3000 and Oracle Capability Review Manager Alcoa Engineered Products January 1999  –  January 2003  (4 years 1 month) · Supervised eight individuals responsible for quoting and drafting of new extrusions \n· Determined pricing for new Soft, Hard and Cold Finish extruded products \n· Secured profitable business for Alcoa Engineered Products utilizing extrusion \nfacilities in the U.S. and abroad. \n· Provided customer assistance in extrusion design \nKey Accomplishments \n· Developed and currently maintain intranet site of technical resources and provide \nsupport for Customer Service Department \n· Authored ISO procedures and trained Customer Service Department in all aspects of \nnew inquiry review \n· Improved 24 hr response time from 58% to 85% on inquiries \n· Created Access database to track new extrusion designs and inquiries \n· Established a searchable referencing system utili zing data extracted from the HP \n3000 and Oracle Senior Presale Estimator/Group Leader Cressona Aluminum/Alumax June 1992  –  April 1999  (6 years 11 months) Directed 8 estimators in the accurate processing of the capability analysis of aluminum extruded profiles under deadline constraints. Senior Presale Estimator/Group Leader Cressona Aluminum/Alumax June 1992  –  April 1999  (6 years 11 months) Directed 8 estimators in the accurate processing of the capability analysis of aluminum extruded profiles under deadline constraints. Presale/Drafting Group Leader Cressona Aluminum/Alumax January 1992  –  January 1999  (7 years 1 month) · Directed Estimators in the accurate processing of the capability analysis under \ndeadline constraints. \n· Contacted customers and assisted Customer Service Department with technical \nsupport. \n· Utilizing Excel and Access developed systems to automate common tasks in \nestimating and drafting functions. \n· Authored and maintained Presale Specification Manual and converted it to an online \nresource. Presale/Drafting Group Leader Cressona Aluminum/Alumax January 1992  –  January 1999  (7 years 1 month) · Directed Estimators in the accurate processing of the capability analysis under \ndeadline constraints. \n· Contacted customers and assisted Customer Service Department with technical \nsupport. \n· Utilizing Excel and Access developed systems to automate common tasks in \nestimating and drafting functions. \n· Authored and maintained Presale Specification Manual and converted it to an online \nresource. Languages English English English Skills Excel pVelocity Oracle Discoverer Microsoft Office Access Data Analysis Pricing Pricing Policy Spreadsheet Design Aluminum Management PowerPoint Microsoft Excel Marketing Extrusion Business Analysis Salesforce.com Leadership Manufacturing Metrics Reporting SharePoint Pricing Strategy Analysis Program Management Sales Human Resources See 11+     See less Skills  Excel pVelocity Oracle Discoverer Microsoft Office Access Data Analysis Pricing Pricing Policy Spreadsheet Design Aluminum Management PowerPoint Microsoft Excel Marketing Extrusion Business Analysis Salesforce.com Leadership Manufacturing Metrics Reporting SharePoint Pricing Strategy Analysis Program Management Sales Human Resources See 11+     See less Excel pVelocity Oracle Discoverer Microsoft Office Access Data Analysis Pricing Pricing Policy Spreadsheet Design Aluminum Management PowerPoint Microsoft Excel Marketing Extrusion Business Analysis Salesforce.com Leadership Manufacturing Metrics Reporting SharePoint Pricing Strategy Analysis Program Management Sales Human Resources See 11+     See less Excel pVelocity Oracle Discoverer Microsoft Office Access Data Analysis Pricing Pricing Policy Spreadsheet Design Aluminum Management PowerPoint Microsoft Excel Marketing Extrusion Business Analysis Salesforce.com Leadership Manufacturing Metrics Reporting SharePoint Pricing Strategy Analysis Program Management Sales Human Resources See 11+     See less Education Alvernia College Bachelor Degree,  Business Administration , 3.814 2003  – 2011 Honors: Magna Cum Laude City University of New York City College Associates,  Design Drafting 1980  – 1982 At City University of NY I majored in Design Drafting Alvernia College Bachelor Degree,  Business Administration , 3.814 2003  – 2011 Honors: Magna Cum Laude Alvernia College Bachelor Degree,  Business Administration , 3.814 2003  – 2011 Honors: Magna Cum Laude Alvernia College Bachelor Degree,  Business Administration , 3.814 2003  – 2011 Honors: Magna Cum Laude City University of New York City College Associates,  Design Drafting 1980  – 1982 At City University of NY I majored in Design Drafting City University of New York City College Associates,  Design Drafting 1980  – 1982 At City University of NY I majored in Design Drafting City University of New York City College Associates,  Design Drafting 1980  – 1982 At City University of NY I majored in Design Drafting ", "Experience Metrics and Reporting Analyst Dell Metrics and Reporting Analyst Dell Metrics and Reporting Analyst Dell Education Park University 1998  – 2000 Park University 1998  – 2000 Park University 1998  – 2000 Park University 1998  – 2000 ", "Experience Metrics & Reporting Analyst Dell Metrics & Reporting Analyst Dell Metrics & Reporting Analyst Dell Education Victoria College 1983  – 1985 Victoria College 1983  – 1985 Victoria College 1983  – 1985 Victoria College 1983  – 1985 ", "Experience Metrics & Reporting Analyst Prime Therapeutics August 2013  – Present (2 years 1 month) Senior Analyst UnitedHealthcare July 2010  –  August 2013  (3 years 2 months) Project Manager Affiliated Computer Services March 2009  –  July 2010  (1 year 5 months) Operations Associate GMAC ResCap August 2000  –  December 2007  (7 years 5 months) Metrics & Reporting Analyst Prime Therapeutics August 2013  – Present (2 years 1 month) Metrics & Reporting Analyst Prime Therapeutics August 2013  – Present (2 years 1 month) Senior Analyst UnitedHealthcare July 2010  –  August 2013  (3 years 2 months) Senior Analyst UnitedHealthcare July 2010  –  August 2013  (3 years 2 months) Project Manager Affiliated Computer Services March 2009  –  July 2010  (1 year 5 months) Project Manager Affiliated Computer Services March 2009  –  July 2010  (1 year 5 months) Operations Associate GMAC ResCap August 2000  –  December 2007  (7 years 5 months) Operations Associate GMAC ResCap August 2000  –  December 2007  (7 years 5 months) Skills Project Management Process Improvement Customer Service Microsoft Excel User Acceptance Testing Access Data Analysis Quality Assurance SQL VBA Reporting & Analysis Ad Hoc Reporting Performance Reporting Financial Reporting Webi Skills  Project Management Process Improvement Customer Service Microsoft Excel User Acceptance Testing Access Data Analysis Quality Assurance SQL VBA Reporting & Analysis Ad Hoc Reporting Performance Reporting Financial Reporting Webi Project Management Process Improvement Customer Service Microsoft Excel User Acceptance Testing Access Data Analysis Quality Assurance SQL VBA Reporting & Analysis Ad Hoc Reporting Performance Reporting Financial Reporting Webi Project Management Process Improvement Customer Service Microsoft Excel User Acceptance Testing Access Data Analysis Quality Assurance SQL VBA Reporting & Analysis Ad Hoc Reporting Performance Reporting Financial Reporting Webi Education Minnesota School of Business Business Administration Minnesota School of Business Business Administration Minnesota School of Business Business Administration Minnesota School of Business Business Administration ", "Skills eLearning Technical Writing Training & Development SuccessFactors PeopleSoft PeopleTools Relational Databases Software Training Online Training Learning Management... Enterprise Content... Talent Management Performance Management Website Development Virtual Training Team Management Articulate Instructional Design Learning Management Content Management E-Learning Employee Training Hands-on Training Human Resources Project Management Risk Management Software Documentation Strategy Training Banking Leadership Analysis Requirements Analysis Change Management See 19+     See less Skills  eLearning Technical Writing Training & Development SuccessFactors PeopleSoft PeopleTools Relational Databases Software Training Online Training Learning Management... Enterprise Content... Talent Management Performance Management Website Development Virtual Training Team Management Articulate Instructional Design Learning Management Content Management E-Learning Employee Training Hands-on Training Human Resources Project Management Risk Management Software Documentation Strategy Training Banking Leadership Analysis Requirements Analysis Change Management See 19+     See less eLearning Technical Writing Training & Development SuccessFactors PeopleSoft PeopleTools Relational Databases Software Training Online Training Learning Management... Enterprise Content... Talent Management Performance Management Website Development Virtual Training Team Management Articulate Instructional Design Learning Management Content Management E-Learning Employee Training Hands-on Training Human Resources Project Management Risk Management Software Documentation Strategy Training Banking Leadership Analysis Requirements Analysis Change Management See 19+     See less eLearning Technical Writing Training & Development SuccessFactors PeopleSoft PeopleTools Relational Databases Software Training Online Training Learning Management... Enterprise Content... Talent Management Performance Management Website Development Virtual Training Team Management Articulate Instructional Design Learning Management Content Management E-Learning Employee Training Hands-on Training Human Resources Project Management Risk Management Software Documentation Strategy Training Banking Leadership Analysis Requirements Analysis Change Management See 19+     See less "]}