{"position": "Product Manager, Data Warehouse", "company": "Google", "profiles": ["Summary A self motivated and achievement orientated sales professional, having excellent knowledge and understanding of auto identification solution sales across all verticals, extremely commercially minded with a wealth of experience in opening and closing business. Having expansive product knowledge and is excellent at developing and maintaining long term relationships at all levels. \n \nSpecialties: Auto ID, Solution Sales, Campus Card Solutions, EPOD, EPOS, WMS,ERP, Track & Trace, Voice, Barcodes, RFID, Smart Cards, Labels, Media, Print & Apply Solutions, Barcode Printers, Wireless Networks inside & Outside the 4 Walls, Hand Held Terminals, Scanners, Tablet PC's, Problem Solving, Relationship Development,SaaS, Managed Services, Hosting, Middleware, New Business Development, Hand Held Terminals, Mobile Printing, Account Management, Lead Qualification, Manufacturing, Transport and Logistics, Outsourcing, Managed Services, Enterprise Software, Professional Services, Support, Device Management, BID Process, Strategic Partnerships, Account Development, New Business, Mobile Technology, Mobile Computing, Negotiation, Partner Management, WLAN, Manufacturing, Supply Chain, Vision Systems, Image ID, WLAN, Mobile Computing, Integration,Selling, Consultancy, Sales Operations, Supply Chain, Channel Partners, Summary A self motivated and achievement orientated sales professional, having excellent knowledge and understanding of auto identification solution sales across all verticals, extremely commercially minded with a wealth of experience in opening and closing business. Having expansive product knowledge and is excellent at developing and maintaining long term relationships at all levels. \n \nSpecialties: Auto ID, Solution Sales, Campus Card Solutions, EPOD, EPOS, WMS,ERP, Track & Trace, Voice, Barcodes, RFID, Smart Cards, Labels, Media, Print & Apply Solutions, Barcode Printers, Wireless Networks inside & Outside the 4 Walls, Hand Held Terminals, Scanners, Tablet PC's, Problem Solving, Relationship Development,SaaS, Managed Services, Hosting, Middleware, New Business Development, Hand Held Terminals, Mobile Printing, Account Management, Lead Qualification, Manufacturing, Transport and Logistics, Outsourcing, Managed Services, Enterprise Software, Professional Services, Support, Device Management, BID Process, Strategic Partnerships, Account Development, New Business, Mobile Technology, Mobile Computing, Negotiation, Partner Management, WLAN, Manufacturing, Supply Chain, Vision Systems, Image ID, WLAN, Mobile Computing, Integration,Selling, Consultancy, Sales Operations, Supply Chain, Channel Partners, A self motivated and achievement orientated sales professional, having excellent knowledge and understanding of auto identification solution sales across all verticals, extremely commercially minded with a wealth of experience in opening and closing business. Having expansive product knowledge and is excellent at developing and maintaining long term relationships at all levels. \n \nSpecialties: Auto ID, Solution Sales, Campus Card Solutions, EPOD, EPOS, WMS,ERP, Track & Trace, Voice, Barcodes, RFID, Smart Cards, Labels, Media, Print & Apply Solutions, Barcode Printers, Wireless Networks inside & Outside the 4 Walls, Hand Held Terminals, Scanners, Tablet PC's, Problem Solving, Relationship Development,SaaS, Managed Services, Hosting, Middleware, New Business Development, Hand Held Terminals, Mobile Printing, Account Management, Lead Qualification, Manufacturing, Transport and Logistics, Outsourcing, Managed Services, Enterprise Software, Professional Services, Support, Device Management, BID Process, Strategic Partnerships, Account Development, New Business, Mobile Technology, Mobile Computing, Negotiation, Partner Management, WLAN, Manufacturing, Supply Chain, Vision Systems, Image ID, WLAN, Mobile Computing, Integration,Selling, Consultancy, Sales Operations, Supply Chain, Channel Partners, A self motivated and achievement orientated sales professional, having excellent knowledge and understanding of auto identification solution sales across all verticals, extremely commercially minded with a wealth of experience in opening and closing business. Having expansive product knowledge and is excellent at developing and maintaining long term relationships at all levels. \n \nSpecialties: Auto ID, Solution Sales, Campus Card Solutions, EPOD, EPOS, WMS,ERP, Track & Trace, Voice, Barcodes, RFID, Smart Cards, Labels, Media, Print & Apply Solutions, Barcode Printers, Wireless Networks inside & Outside the 4 Walls, Hand Held Terminals, Scanners, Tablet PC's, Problem Solving, Relationship Development,SaaS, Managed Services, Hosting, Middleware, New Business Development, Hand Held Terminals, Mobile Printing, Account Management, Lead Qualification, Manufacturing, Transport and Logistics, Outsourcing, Managed Services, Enterprise Software, Professional Services, Support, Device Management, BID Process, Strategic Partnerships, Account Development, New Business, Mobile Technology, Mobile Computing, Negotiation, Partner Management, WLAN, Manufacturing, Supply Chain, Vision Systems, Image ID, WLAN, Mobile Computing, Integration,Selling, Consultancy, Sales Operations, Supply Chain, Channel Partners, Experience Account Manager Jade Solutions Ltd April 2013  – Present (2 years 5 months) Newton le Willows Merseyside Key Account Manager Zetes July 2010  –  March 2013  (2 years 9 months) Solutions Sales Manager Fidelity Systems Plc March 2010  –  July 2010  (5 months) Entrusted to organise, motivate and lead the sales teams in the specification and execution of the delivery of EPOS centric solutions in the Higher Education and Local Government Sectors. Responsible for the combined performance of the team and ensuring they had the tools, guidance and focus to meet their targets and margin expectations.  \n \nIdentified and developed strategic relationships with partners, suppliers and customers Business Development Manager Mnetics Holdings Ltd August 2002  –  November 2009  (7 years 4 months) Developed long term mutually beneficial relationships with customers and working partners to deliver innovative data collection solutions both inside and outside the four walls predominantly within supply chain and manufacturing verticals. Product Manager Data Solutions ESP Systex Ltd August 2000  –  July 2002  (2 years) Specified and managed the delivery of contactless smart card and RFID smart label data collection solutions within education, mass transit and the supply chain. Delivered value added services for the production of Photo ID cards by the specification and delivery of turnkey systems and the provision of in house bureau and fulfilment services. Product Manager Data Collection Division ESP Systex Ltd August 1998  –  July 2000  (2 years) Established the divisions largest and technically demanding installed base in the Scottish Whisky industry. Provided bespoke software solutions using hand held barcode scanning and voice data collection devices. Provided embedded ruggedized printing systems to facilitate the trace and trace of spirit throughout the maturation process. Promoted to Product Manager Data Solutions. Sales Executive Data Collection Division ESP Systex Ltd February 1997  –  July 1998  (1 year 6 months) Promoted bespoke designed data collection solutions using Barcode Scanning, RFID and Voice Recognition technologies. Promoted to Product Manager Merchandise Manager Software City PLC November 1995  –  February 1997  (1 year 4 months) Entrusted with the day to day running of the company’s flagship 15,0000 sq-ft retail outlet. Working alongside the store manager being responsible to delivering profit to an agreed budget. Reporting to the Operations Director and Board. Recruited a team of 30 full and part time associates. Initiated and implemented the businesses Operational and Training procedures. Business Machines Team Leader Staples Office Supplies January 1993  –  October 1995  (2 years 10 months) Responsible for the day to day running of 6,000 Sq-ft Business Dept and maintained stock integrity of over 10,000 separate line items. Responsible for the development and training of 9 full and part time staff. Working alongside three other departmental managers reporting to the store and regional managers Store Manager KC Video August 1982  –  December 1992  (10 years 5 months) Managed an independent computer store selling a product portfolio of in house built PC based systems and associated peripherals. Recruited and trained a 3 man sales / support team. Reporting directly to the proprietor. Account Manager Jade Solutions Ltd April 2013  – Present (2 years 5 months) Newton le Willows Merseyside Account Manager Jade Solutions Ltd April 2013  – Present (2 years 5 months) Newton le Willows Merseyside Key Account Manager Zetes July 2010  –  March 2013  (2 years 9 months) Key Account Manager Zetes July 2010  –  March 2013  (2 years 9 months) Solutions Sales Manager Fidelity Systems Plc March 2010  –  July 2010  (5 months) Entrusted to organise, motivate and lead the sales teams in the specification and execution of the delivery of EPOS centric solutions in the Higher Education and Local Government Sectors. Responsible for the combined performance of the team and ensuring they had the tools, guidance and focus to meet their targets and margin expectations.  \n \nIdentified and developed strategic relationships with partners, suppliers and customers Solutions Sales Manager Fidelity Systems Plc March 2010  –  July 2010  (5 months) Entrusted to organise, motivate and lead the sales teams in the specification and execution of the delivery of EPOS centric solutions in the Higher Education and Local Government Sectors. Responsible for the combined performance of the team and ensuring they had the tools, guidance and focus to meet their targets and margin expectations.  \n \nIdentified and developed strategic relationships with partners, suppliers and customers Business Development Manager Mnetics Holdings Ltd August 2002  –  November 2009  (7 years 4 months) Developed long term mutually beneficial relationships with customers and working partners to deliver innovative data collection solutions both inside and outside the four walls predominantly within supply chain and manufacturing verticals. Business Development Manager Mnetics Holdings Ltd August 2002  –  November 2009  (7 years 4 months) Developed long term mutually beneficial relationships with customers and working partners to deliver innovative data collection solutions both inside and outside the four walls predominantly within supply chain and manufacturing verticals. Product Manager Data Solutions ESP Systex Ltd August 2000  –  July 2002  (2 years) Specified and managed the delivery of contactless smart card and RFID smart label data collection solutions within education, mass transit and the supply chain. Delivered value added services for the production of Photo ID cards by the specification and delivery of turnkey systems and the provision of in house bureau and fulfilment services. Product Manager Data Solutions ESP Systex Ltd August 2000  –  July 2002  (2 years) Specified and managed the delivery of contactless smart card and RFID smart label data collection solutions within education, mass transit and the supply chain. Delivered value added services for the production of Photo ID cards by the specification and delivery of turnkey systems and the provision of in house bureau and fulfilment services. Product Manager Data Collection Division ESP Systex Ltd August 1998  –  July 2000  (2 years) Established the divisions largest and technically demanding installed base in the Scottish Whisky industry. Provided bespoke software solutions using hand held barcode scanning and voice data collection devices. Provided embedded ruggedized printing systems to facilitate the trace and trace of spirit throughout the maturation process. Promoted to Product Manager Data Solutions. Product Manager Data Collection Division ESP Systex Ltd August 1998  –  July 2000  (2 years) Established the divisions largest and technically demanding installed base in the Scottish Whisky industry. Provided bespoke software solutions using hand held barcode scanning and voice data collection devices. Provided embedded ruggedized printing systems to facilitate the trace and trace of spirit throughout the maturation process. Promoted to Product Manager Data Solutions. Sales Executive Data Collection Division ESP Systex Ltd February 1997  –  July 1998  (1 year 6 months) Promoted bespoke designed data collection solutions using Barcode Scanning, RFID and Voice Recognition technologies. Promoted to Product Manager Sales Executive Data Collection Division ESP Systex Ltd February 1997  –  July 1998  (1 year 6 months) Promoted bespoke designed data collection solutions using Barcode Scanning, RFID and Voice Recognition technologies. Promoted to Product Manager Merchandise Manager Software City PLC November 1995  –  February 1997  (1 year 4 months) Entrusted with the day to day running of the company’s flagship 15,0000 sq-ft retail outlet. Working alongside the store manager being responsible to delivering profit to an agreed budget. Reporting to the Operations Director and Board. Recruited a team of 30 full and part time associates. Initiated and implemented the businesses Operational and Training procedures. Merchandise Manager Software City PLC November 1995  –  February 1997  (1 year 4 months) Entrusted with the day to day running of the company’s flagship 15,0000 sq-ft retail outlet. Working alongside the store manager being responsible to delivering profit to an agreed budget. Reporting to the Operations Director and Board. Recruited a team of 30 full and part time associates. Initiated and implemented the businesses Operational and Training procedures. Business Machines Team Leader Staples Office Supplies January 1993  –  October 1995  (2 years 10 months) Responsible for the day to day running of 6,000 Sq-ft Business Dept and maintained stock integrity of over 10,000 separate line items. Responsible for the development and training of 9 full and part time staff. Working alongside three other departmental managers reporting to the store and regional managers Business Machines Team Leader Staples Office Supplies January 1993  –  October 1995  (2 years 10 months) Responsible for the day to day running of 6,000 Sq-ft Business Dept and maintained stock integrity of over 10,000 separate line items. Responsible for the development and training of 9 full and part time staff. Working alongside three other departmental managers reporting to the store and regional managers Store Manager KC Video August 1982  –  December 1992  (10 years 5 months) Managed an independent computer store selling a product portfolio of in house built PC based systems and associated peripherals. Recruited and trained a 3 man sales / support team. Reporting directly to the proprietor. Store Manager KC Video August 1982  –  December 1992  (10 years 5 months) Managed an independent computer store selling a product portfolio of in house built PC based systems and associated peripherals. Recruited and trained a 3 man sales / support team. Reporting directly to the proprietor. Skills RFID Smart Cards Barcode Problem Solving WMS ERP Software Solutions Enterprise Mobility Printmaking Printers Voice Solutions Imaging Solutions New Business Generation Building Long-term... Labels Ribbons GPS Applications RF networks RFID+ Warehouse Management Solution Selling POS Scanners Account Management Management Channel Partners Key Account Management Sales Process Mobile Devices Integration Selling Supply Chain Sales Operations Mobile Computing WLAN Partner Management Mobile Device Management Key Account Development Mobile Technology Business Development Strategic Partnerships New Business Development Enterprise Software Professional Services SaaS CRM Solutions Marketing Managed Services Manufacturing Outsourcing See 35+     See less Skills  RFID Smart Cards Barcode Problem Solving WMS ERP Software Solutions Enterprise Mobility Printmaking Printers Voice Solutions Imaging Solutions New Business Generation Building Long-term... Labels Ribbons GPS Applications RF networks RFID+ Warehouse Management Solution Selling POS Scanners Account Management Management Channel Partners Key Account Management Sales Process Mobile Devices Integration Selling Supply Chain Sales Operations Mobile Computing WLAN Partner Management Mobile Device Management Key Account Development Mobile Technology Business Development Strategic Partnerships New Business Development Enterprise Software Professional Services SaaS CRM Solutions Marketing Managed Services Manufacturing Outsourcing See 35+     See less RFID Smart Cards Barcode Problem Solving WMS ERP Software Solutions Enterprise Mobility Printmaking Printers Voice Solutions Imaging Solutions New Business Generation Building Long-term... Labels Ribbons GPS Applications RF networks RFID+ Warehouse Management Solution Selling POS Scanners Account Management Management Channel Partners Key Account Management Sales Process Mobile Devices Integration Selling Supply Chain Sales Operations Mobile Computing WLAN Partner Management Mobile Device Management Key Account Development Mobile Technology Business Development Strategic Partnerships New Business Development Enterprise Software Professional Services SaaS CRM Solutions Marketing Managed Services Manufacturing Outsourcing See 35+     See less RFID Smart Cards Barcode Problem Solving WMS ERP Software Solutions Enterprise Mobility Printmaking Printers Voice Solutions Imaging Solutions New Business Generation Building Long-term... Labels Ribbons GPS Applications RF networks RFID+ Warehouse Management Solution Selling POS Scanners Account Management Management Channel Partners Key Account Management Sales Process Mobile Devices Integration Selling Supply Chain Sales Operations Mobile Computing WLAN Partner Management Mobile Device Management Key Account Development Mobile Technology Business Development Strategic Partnerships New Business Development Enterprise Software Professional Services SaaS CRM Solutions Marketing Managed Services Manufacturing Outsourcing See 35+     See less Education Minsthorpe High School and Community College 1979  – 1984 Minsthorpe High School and Community College 1979  – 1984 Minsthorpe High School and Community College 1979  – 1984 Minsthorpe High School and Community College 1979  – 1984 ", "Summary Seasoned technology strategy and product management leader with experience driving innovation and delivering an enhanced customer experience that achieves bottom line business results. Brings an entrepreneurial approach to identifying market opportunity and building a successful strategy to compete and win. \n \nSpecialties: Product Innovation, Product Management, Product Marketing, Ecommerce Strategy, Project Management, Strategic Planning, Software Development Life Cycle (SDLC), Public Speaking, Presentation and Communication Summary Seasoned technology strategy and product management leader with experience driving innovation and delivering an enhanced customer experience that achieves bottom line business results. Brings an entrepreneurial approach to identifying market opportunity and building a successful strategy to compete and win. \n \nSpecialties: Product Innovation, Product Management, Product Marketing, Ecommerce Strategy, Project Management, Strategic Planning, Software Development Life Cycle (SDLC), Public Speaking, Presentation and Communication Seasoned technology strategy and product management leader with experience driving innovation and delivering an enhanced customer experience that achieves bottom line business results. Brings an entrepreneurial approach to identifying market opportunity and building a successful strategy to compete and win. \n \nSpecialties: Product Innovation, Product Management, Product Marketing, Ecommerce Strategy, Project Management, Strategic Planning, Software Development Life Cycle (SDLC), Public Speaking, Presentation and Communication Seasoned technology strategy and product management leader with experience driving innovation and delivering an enhanced customer experience that achieves bottom line business results. Brings an entrepreneurial approach to identifying market opportunity and building a successful strategy to compete and win. \n \nSpecialties: Product Innovation, Product Management, Product Marketing, Ecommerce Strategy, Project Management, Strategic Planning, Software Development Life Cycle (SDLC), Public Speaking, Presentation and Communication Experience Product Manager, Data and Analytics CSAA Insurance Group July 2013  – Present (2 years 2 months) Glendale Leading product delivery for the property business data warehouse; extending reporting and advanced analytics capabilities to drive business efficiency and revenue growth. \n \nDesigned and implemented the demand management and service request intake process for the Enterprise Analytics and Data Services team at CSAA. Conducted a vendor analysis and selection, held stakeholder reviews and oversaw solution delivery. Product Manager, Data and Analytics Apollo Education Group March 2012  –  June 2013  (1 year 4 months) Envision, build and bring to market new products that leverage big data and predictive analytics to provide business insights and decision point metrics for higher education institutions.  \n \nDeveloped product vision and strategy to deliver a cloud based higher education data warehouse and reporting solution. Created the long-term product roadmap for data and analytics tools to support delivery of an end-to-end education platform. \n \nRelevant Experience: \n•\tEducation software innovation \n•\tMarket and competitive analysis \n•\tAdvanced analytics methods \n•\tProduct innovation with predictive analytics \n•\tData warehouse design and implementation \n•\tBusiness intelligence visualization design \n•\tCloud based software delivery Sr. Product Manager Lumension March 2010  –  January 2012  (1 year 11 months) Innovating IT security solutions addressing Vulnerability Management, Endpoint Protection, Data Protection, Compliance and IT Risk Management. \n \nRelevant Experience: \n•\tEnterprise software development \n•\tProduct Marketing collaboration \n•\tGo-to-market planning \n•\tAgile/SCRUM Product Owner \n•\tBacklog management \n•\tRemote team management Sr. Product Manager DHL Express January 2004  –  March 2010  (6 years 3 months) Manager of eCommerce product management team responsible for customer facing product development and marketing. Driving initiatives in the areas of web services, eCommerce messaging and marketing strategy.  \n \nRelevant Experience:  \n•\tSetting product strategy \n•\tDeveloping marketing plans \n•\tDefining product roadmaps \n•\tManaging products from development through sunset \n•\tVendor selection and management \n•\tLeading cross functional work teams \n•\tLiaison between business and technology groups Online Marketing Consultant / Founder ACH Web Marketing, LLC. March 2002  –  January 2004  (1 year 11 months) Developed and implemented effective ecommerce channel strategies and online marketing programs for corporate clients focused on increasing conversion and customer retention. Project Manager / IT Manager Siemens Business Services March 1997  –  March 2002  (5 years 1 month) On-site Engagement Manager leading team of experienced technology professionals. Established onsite business and technical support teams in the areas of network management and security, desktop support and client help desk. Held contract budget responsibility and successfully maintained new business development targets. \n \n \nRelevant Experience:  \n•\tContract management and client relations \n•\tTechnical staff development \n•\tProcess improvement \n•\tStrategic technology planning \n•\tNew business development Product Manager, Data and Analytics CSAA Insurance Group July 2013  – Present (2 years 2 months) Glendale Leading product delivery for the property business data warehouse; extending reporting and advanced analytics capabilities to drive business efficiency and revenue growth. \n \nDesigned and implemented the demand management and service request intake process for the Enterprise Analytics and Data Services team at CSAA. Conducted a vendor analysis and selection, held stakeholder reviews and oversaw solution delivery. Product Manager, Data and Analytics CSAA Insurance Group July 2013  – Present (2 years 2 months) Glendale Leading product delivery for the property business data warehouse; extending reporting and advanced analytics capabilities to drive business efficiency and revenue growth. \n \nDesigned and implemented the demand management and service request intake process for the Enterprise Analytics and Data Services team at CSAA. Conducted a vendor analysis and selection, held stakeholder reviews and oversaw solution delivery. Product Manager, Data and Analytics Apollo Education Group March 2012  –  June 2013  (1 year 4 months) Envision, build and bring to market new products that leverage big data and predictive analytics to provide business insights and decision point metrics for higher education institutions.  \n \nDeveloped product vision and strategy to deliver a cloud based higher education data warehouse and reporting solution. Created the long-term product roadmap for data and analytics tools to support delivery of an end-to-end education platform. \n \nRelevant Experience: \n•\tEducation software innovation \n•\tMarket and competitive analysis \n•\tAdvanced analytics methods \n•\tProduct innovation with predictive analytics \n•\tData warehouse design and implementation \n•\tBusiness intelligence visualization design \n•\tCloud based software delivery Product Manager, Data and Analytics Apollo Education Group March 2012  –  June 2013  (1 year 4 months) Envision, build and bring to market new products that leverage big data and predictive analytics to provide business insights and decision point metrics for higher education institutions.  \n \nDeveloped product vision and strategy to deliver a cloud based higher education data warehouse and reporting solution. Created the long-term product roadmap for data and analytics tools to support delivery of an end-to-end education platform. \n \nRelevant Experience: \n•\tEducation software innovation \n•\tMarket and competitive analysis \n•\tAdvanced analytics methods \n•\tProduct innovation with predictive analytics \n•\tData warehouse design and implementation \n•\tBusiness intelligence visualization design \n•\tCloud based software delivery Sr. Product Manager Lumension March 2010  –  January 2012  (1 year 11 months) Innovating IT security solutions addressing Vulnerability Management, Endpoint Protection, Data Protection, Compliance and IT Risk Management. \n \nRelevant Experience: \n•\tEnterprise software development \n•\tProduct Marketing collaboration \n•\tGo-to-market planning \n•\tAgile/SCRUM Product Owner \n•\tBacklog management \n•\tRemote team management Sr. Product Manager Lumension March 2010  –  January 2012  (1 year 11 months) Innovating IT security solutions addressing Vulnerability Management, Endpoint Protection, Data Protection, Compliance and IT Risk Management. \n \nRelevant Experience: \n•\tEnterprise software development \n•\tProduct Marketing collaboration \n•\tGo-to-market planning \n•\tAgile/SCRUM Product Owner \n•\tBacklog management \n•\tRemote team management Sr. Product Manager DHL Express January 2004  –  March 2010  (6 years 3 months) Manager of eCommerce product management team responsible for customer facing product development and marketing. Driving initiatives in the areas of web services, eCommerce messaging and marketing strategy.  \n \nRelevant Experience:  \n•\tSetting product strategy \n•\tDeveloping marketing plans \n•\tDefining product roadmaps \n•\tManaging products from development through sunset \n•\tVendor selection and management \n•\tLeading cross functional work teams \n•\tLiaison between business and technology groups Sr. Product Manager DHL Express January 2004  –  March 2010  (6 years 3 months) Manager of eCommerce product management team responsible for customer facing product development and marketing. Driving initiatives in the areas of web services, eCommerce messaging and marketing strategy.  \n \nRelevant Experience:  \n•\tSetting product strategy \n•\tDeveloping marketing plans \n•\tDefining product roadmaps \n•\tManaging products from development through sunset \n•\tVendor selection and management \n•\tLeading cross functional work teams \n•\tLiaison between business and technology groups Online Marketing Consultant / Founder ACH Web Marketing, LLC. March 2002  –  January 2004  (1 year 11 months) Developed and implemented effective ecommerce channel strategies and online marketing programs for corporate clients focused on increasing conversion and customer retention. Online Marketing Consultant / Founder ACH Web Marketing, LLC. March 2002  –  January 2004  (1 year 11 months) Developed and implemented effective ecommerce channel strategies and online marketing programs for corporate clients focused on increasing conversion and customer retention. Project Manager / IT Manager Siemens Business Services March 1997  –  March 2002  (5 years 1 month) On-site Engagement Manager leading team of experienced technology professionals. Established onsite business and technical support teams in the areas of network management and security, desktop support and client help desk. Held contract budget responsibility and successfully maintained new business development targets. \n \n \nRelevant Experience:  \n•\tContract management and client relations \n•\tTechnical staff development \n•\tProcess improvement \n•\tStrategic technology planning \n•\tNew business development Project Manager / IT Manager Siemens Business Services March 1997  –  March 2002  (5 years 1 month) On-site Engagement Manager leading team of experienced technology professionals. Established onsite business and technical support teams in the areas of network management and security, desktop support and client help desk. Held contract budget responsibility and successfully maintained new business development targets. \n \n \nRelevant Experience:  \n•\tContract management and client relations \n•\tTechnical staff development \n•\tProcess improvement \n•\tStrategic technology planning \n•\tNew business development Languages   Skills Product Management Cross-functional Team... Business Intelligence Strategy Analytics SDLC Product Marketing Program Management Leadership Project Management Entrepreneurship IT Strategy Competitive Analysis Management Cloud Computing Data Warehousing Strategic Partnerships Process Improvement Business Analysis Integration Strategic Planning Agile Methodologies SaaS Go-to-market Strategy Start-ups Software Development Marketing Strategy Vendor Management Product Development Team Management See 15+     See less Skills  Product Management Cross-functional Team... Business Intelligence Strategy Analytics SDLC Product Marketing Program Management Leadership Project Management Entrepreneurship IT Strategy Competitive Analysis Management Cloud Computing Data Warehousing Strategic Partnerships Process Improvement Business Analysis Integration Strategic Planning Agile Methodologies SaaS Go-to-market Strategy Start-ups Software Development Marketing Strategy Vendor Management Product Development Team Management See 15+     See less Product Management Cross-functional Team... Business Intelligence Strategy Analytics SDLC Product Marketing Program Management Leadership Project Management Entrepreneurship IT Strategy Competitive Analysis Management Cloud Computing Data Warehousing Strategic Partnerships Process Improvement Business Analysis Integration Strategic Planning Agile Methodologies SaaS Go-to-market Strategy Start-ups Software Development Marketing Strategy Vendor Management Product Development Team Management See 15+     See less Product Management Cross-functional Team... Business Intelligence Strategy Analytics SDLC Product Marketing Program Management Leadership Project Management Entrepreneurship IT Strategy Competitive Analysis Management Cloud Computing Data Warehousing Strategic Partnerships Process Improvement Business Analysis Integration Strategic Planning Agile Methodologies SaaS Go-to-market Strategy Start-ups Software Development Marketing Strategy Vendor Management Product Development Team Management See 15+     See less Education Arizona State University MBA 2001  – 2003 University of Phoenix BS 1998  – 2000 Arizona State University MBA 2001  – 2003 Arizona State University MBA 2001  – 2003 Arizona State University MBA 2001  – 2003 University of Phoenix BS 1998  – 2000 University of Phoenix BS 1998  – 2000 University of Phoenix BS 1998  – 2000 Honors & Awards ", "Summary Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Specialties:Technologies: \nIP VPN, Ethernet, MPLS, GSM-UMTS, VOIP Summary Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Specialties:Technologies: \nIP VPN, Ethernet, MPLS, GSM-UMTS, VOIP Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Specialties:Technologies: \nIP VPN, Ethernet, MPLS, GSM-UMTS, VOIP Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Specialties:Technologies: \nIP VPN, Ethernet, MPLS, GSM-UMTS, VOIP Experience Sr. Product Manager Data Tele2 Zakelijk October 2010  – Present (4 years 11 months) Amsterdam Area, Netherlands Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Sr. Technical Consultant Tele2 Zakelijk January 2005  –  October 2010  (5 years 10 months) Amsterdam Area, Netherlands Sales Consultancy for a large customer base Sales Engineer GTI Vitel March 2002  –  December 2004  (2 years 10 months) Sr. Product Manager Data Tele2 Zakelijk October 2010  – Present (4 years 11 months) Amsterdam Area, Netherlands Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Sr. Product Manager Data Tele2 Zakelijk October 2010  – Present (4 years 11 months) Amsterdam Area, Netherlands Product Manager Data solutions, IP VPN, Ethernet VPN, LAN solutions. Sr. Technical Consultant Tele2 Zakelijk January 2005  –  October 2010  (5 years 10 months) Amsterdam Area, Netherlands Sales Consultancy for a large customer base Sr. Technical Consultant Tele2 Zakelijk January 2005  –  October 2010  (5 years 10 months) Amsterdam Area, Netherlands Sales Consultancy for a large customer base Sales Engineer GTI Vitel March 2002  –  December 2004  (2 years 10 months) Sales Engineer GTI Vitel March 2002  –  December 2004  (2 years 10 months) Languages English Native or bilingual proficiency Dutch Native or bilingual proficiency German Full professional proficiency English Native or bilingual proficiency Dutch Native or bilingual proficiency German Full professional proficiency English Native or bilingual proficiency Dutch Native or bilingual proficiency German Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills Ethernet IP VPN IP QoS VoIP MPLS WAN Telecommunications Unified Communications Product Management Cisco Technologies Mobile Devices Managed Services Broadband VPN B2B Solution Selling See 2+     See less Skills  Ethernet IP VPN IP QoS VoIP MPLS WAN Telecommunications Unified Communications Product Management Cisco Technologies Mobile Devices Managed Services Broadband VPN B2B Solution Selling See 2+     See less Ethernet IP VPN IP QoS VoIP MPLS WAN Telecommunications Unified Communications Product Management Cisco Technologies Mobile Devices Managed Services Broadband VPN B2B Solution Selling See 2+     See less Ethernet IP VPN IP QoS VoIP MPLS WAN Telecommunications Unified Communications Product Management Cisco Technologies Mobile Devices Managed Services Broadband VPN B2B Solution Selling See 2+     See less ", "Experience Head of Data Migration Services Ericsson June 2011  – Present (4 years 3 months) Madrid Area, Spain Ensure Service Readines for Data migration in all possible areas and domains. Product Manager Ericsson España, S.A. 2004  – Present (11 years) Ensure the Data migration service readiness for subscribers databases, mainly in the domain of the mobile networks. \nAlso provide Sales support to the different Customer Units inside Ericsson so that they are able to face customer requirements and opportunities with the right level of information and support. Strategic Product Manager, Data Migration Services Ericsson April 2004  –  June 2011  (7 years 3 months) Strategic Product Manager for Data Migration Services: UDM, VAS, IMS and others. Product Manager Ericsson Spain 2004  –  June 2011  (7 years) Product Manager for Data Migration Services: migration of subscribers' data between databases such as HLR, AUC, FNR, HSS, VPN, AAA for both Ericsson and third party products. \nMy group has the worldwide responsibility for this kind of services of the official Ericsson Services portfolio. Data Migration engineer Ericsson March 2001  –  April 2004  (3 years 2 months) Subscribers data migration services on databases such as HLR, AUC, FNR, HSS, VPN, AAA, EDS, etc. Software designer Ericsson 1997  –  2001  (4 years) -Software Designer in the AXE products are, mainly in HLR, AUC and FNR GSM/WCDMA nodes \n-Member of the SEPG (Software Engineer Process Group) team, in charge of the definition fo Function Design process \n-Teacher of Plex-C languaje for AXE software design Software designer & Sales Support Hewlett-Packard 1995  –  1997  (2 years) -Databases Software designer for internal usage \n-Web pages designer \n-Sales Support for HP and third party products. Providing support on complete bundled solution sales Head of Data Migration Services Ericsson June 2011  – Present (4 years 3 months) Madrid Area, Spain Ensure Service Readines for Data migration in all possible areas and domains. Head of Data Migration Services Ericsson June 2011  – Present (4 years 3 months) Madrid Area, Spain Ensure Service Readines for Data migration in all possible areas and domains. Product Manager Ericsson España, S.A. 2004  – Present (11 years) Ensure the Data migration service readiness for subscribers databases, mainly in the domain of the mobile networks. \nAlso provide Sales support to the different Customer Units inside Ericsson so that they are able to face customer requirements and opportunities with the right level of information and support. Product Manager Ericsson España, S.A. 2004  – Present (11 years) Ensure the Data migration service readiness for subscribers databases, mainly in the domain of the mobile networks. \nAlso provide Sales support to the different Customer Units inside Ericsson so that they are able to face customer requirements and opportunities with the right level of information and support. Strategic Product Manager, Data Migration Services Ericsson April 2004  –  June 2011  (7 years 3 months) Strategic Product Manager for Data Migration Services: UDM, VAS, IMS and others. Strategic Product Manager, Data Migration Services Ericsson April 2004  –  June 2011  (7 years 3 months) Strategic Product Manager for Data Migration Services: UDM, VAS, IMS and others. Product Manager Ericsson Spain 2004  –  June 2011  (7 years) Product Manager for Data Migration Services: migration of subscribers' data between databases such as HLR, AUC, FNR, HSS, VPN, AAA for both Ericsson and third party products. \nMy group has the worldwide responsibility for this kind of services of the official Ericsson Services portfolio. Product Manager Ericsson Spain 2004  –  June 2011  (7 years) Product Manager for Data Migration Services: migration of subscribers' data between databases such as HLR, AUC, FNR, HSS, VPN, AAA for both Ericsson and third party products. \nMy group has the worldwide responsibility for this kind of services of the official Ericsson Services portfolio. Data Migration engineer Ericsson March 2001  –  April 2004  (3 years 2 months) Subscribers data migration services on databases such as HLR, AUC, FNR, HSS, VPN, AAA, EDS, etc. Data Migration engineer Ericsson March 2001  –  April 2004  (3 years 2 months) Subscribers data migration services on databases such as HLR, AUC, FNR, HSS, VPN, AAA, EDS, etc. Software designer Ericsson 1997  –  2001  (4 years) -Software Designer in the AXE products are, mainly in HLR, AUC and FNR GSM/WCDMA nodes \n-Member of the SEPG (Software Engineer Process Group) team, in charge of the definition fo Function Design process \n-Teacher of Plex-C languaje for AXE software design Software designer Ericsson 1997  –  2001  (4 years) -Software Designer in the AXE products are, mainly in HLR, AUC and FNR GSM/WCDMA nodes \n-Member of the SEPG (Software Engineer Process Group) team, in charge of the definition fo Function Design process \n-Teacher of Plex-C languaje for AXE software design Software designer & Sales Support Hewlett-Packard 1995  –  1997  (2 years) -Databases Software designer for internal usage \n-Web pages designer \n-Sales Support for HP and third party products. Providing support on complete bundled solution sales Software designer & Sales Support Hewlett-Packard 1995  –  1997  (2 years) -Databases Software designer for internal usage \n-Web pages designer \n-Sales Support for HP and third party products. Providing support on complete bundled solution sales Languages Inglés Catalán Inglés Catalán Inglés Catalán Skills HLR VAS Telecommunications Project Management Databases Product Management IMS DB/DC GSM 3G Service Delivery Team Leadership Cellular Communications Change Management Service Delivery... Cross-functional Team... Data Migration Computer Science See 2+     See less Skills  HLR VAS Telecommunications Project Management Databases Product Management IMS DB/DC GSM 3G Service Delivery Team Leadership Cellular Communications Change Management Service Delivery... Cross-functional Team... Data Migration Computer Science See 2+     See less HLR VAS Telecommunications Project Management Databases Product Management IMS DB/DC GSM 3G Service Delivery Team Leadership Cellular Communications Change Management Service Delivery... Cross-functional Team... Data Migration Computer Science See 2+     See less HLR VAS Telecommunications Project Management Databases Product Management IMS DB/DC GSM 3G Service Delivery Team Leadership Cellular Communications Change Management Service Delivery... Cross-functional Team... Data Migration Computer Science See 2+     See less Education Universidad Politécnica de Madrid Ingeniero Superior,  Computers 1989  – 1996 Activities and Societies:  -Artificial Inteligence Research group Salesianos Atocha 1981  – 1990 Universidad Politécnica de Madrid Ingeniero Superior,  Computers 1989  – 1996 Activities and Societies:  -Artificial Inteligence Research group Universidad Politécnica de Madrid Ingeniero Superior,  Computers 1989  – 1996 Activities and Societies:  -Artificial Inteligence Research group Universidad Politécnica de Madrid Ingeniero Superior,  Computers 1989  – 1996 Activities and Societies:  -Artificial Inteligence Research group Salesianos Atocha 1981  – 1990 Salesianos Atocha 1981  – 1990 Salesianos Atocha 1981  – 1990 ", "Summary Investment Banker and Senior Management Adviser for growth and middle market companies. Teach students to become investment bankers. Specialties:Strategy, Financing, Marketing, Raising Capital, M & A for technology, media, financial services, manufacturing, consumer products, and biotechnology companies. Summary Investment Banker and Senior Management Adviser for growth and middle market companies. Teach students to become investment bankers. Specialties:Strategy, Financing, Marketing, Raising Capital, M & A for technology, media, financial services, manufacturing, consumer products, and biotechnology companies. Investment Banker and Senior Management Adviser for growth and middle market companies. Teach students to become investment bankers. Specialties:Strategy, Financing, Marketing, Raising Capital, M & A for technology, media, financial services, manufacturing, consumer products, and biotechnology companies. Investment Banker and Senior Management Adviser for growth and middle market companies. Teach students to become investment bankers. Specialties:Strategy, Financing, Marketing, Raising Capital, M & A for technology, media, financial services, manufacturing, consumer products, and biotechnology companies. Experience Investment Banker and Senior Management Advisor Alpha Capital January 2006  – Present (9 years 8 months) Strategy, Finance, Marketing, Capital Raising, M & A, Valuation, Venture Capital President, CEO, Founder Auto America, Inc. August 1995  –  August 2005  (10 years 1 month) Started and ran Auto America, Inc. an auto finance and retailer. Grew company to $50M in profitable sales through innovative marketing, acquisitions, additional locations, and building organizational strength and investor group. Operations based in Los Angeles. Sold my interest in the firm to a large hedge fund in 2005. Visiting Instructor Peking University September 2004  –  January 2005  (5 months) Taught 300 Business Innovation to Mid-Career MBA students Adjunct Professor of Management NYU Stern School June 2003  –  June 2004  (1 year 1 month) Finance and Entrepreneurship Managing Director, Head of Corporate Finance Investment Banking, Boutique Firms June 1983  –  August 2002  (19 years 3 months) 12+ years of experience in investment banking. Originated and Completed numerous IPO's, private placements, mergers and acquisitions, and restructuring s. Last position - Senior Managing Director, Broadband Capital Senior Managing Director Broadband Capital 2002  –  2002  (less than a year) Originate and Execute Private and Public Transactions Managing Director, Head of Corporate Finance Commonwealth Associates June 1993  –  August 1995  (2 years 3 months) Managing Director, Head of Corporate Finance, 200 person investment banking boutique. Originated, managed and completed numerous IPO's, private placements, venture capital investments, and merger and acquisition transactions. Vice President Kaufman & Company, LLC June 1983  –  June 1985  (2 years 1 month) Analyze Mergers, Acquisitions and Private Placements Summer Associate Booz Allen Hamilton 1982  –  1982  (less than a year) Consultant to A Major Telecommunications Company on the Future of the Cable Industry Product Manager Data Resources, Inc. June 1979  –  September 1981  (2 years 4 months) Product Manager for international financial data and credit risk product. Sold and serviced almost all major U.S. banks and investment banks and many foreign banks clients as well. Faculty Award as Outstanding Student Rivers 1968  –  1975  (7 years) Faculty Award as Outstanding Student Rivers 1968  –  1975  (7 years) Investment Banker and Senior Management Advisor Alpha Capital January 2006  – Present (9 years 8 months) Strategy, Finance, Marketing, Capital Raising, M & A, Valuation, Venture Capital Investment Banker and Senior Management Advisor Alpha Capital January 2006  – Present (9 years 8 months) Strategy, Finance, Marketing, Capital Raising, M & A, Valuation, Venture Capital President, CEO, Founder Auto America, Inc. August 1995  –  August 2005  (10 years 1 month) Started and ran Auto America, Inc. an auto finance and retailer. Grew company to $50M in profitable sales through innovative marketing, acquisitions, additional locations, and building organizational strength and investor group. Operations based in Los Angeles. Sold my interest in the firm to a large hedge fund in 2005. President, CEO, Founder Auto America, Inc. August 1995  –  August 2005  (10 years 1 month) Started and ran Auto America, Inc. an auto finance and retailer. Grew company to $50M in profitable sales through innovative marketing, acquisitions, additional locations, and building organizational strength and investor group. Operations based in Los Angeles. Sold my interest in the firm to a large hedge fund in 2005. Visiting Instructor Peking University September 2004  –  January 2005  (5 months) Taught 300 Business Innovation to Mid-Career MBA students Visiting Instructor Peking University September 2004  –  January 2005  (5 months) Taught 300 Business Innovation to Mid-Career MBA students Adjunct Professor of Management NYU Stern School June 2003  –  June 2004  (1 year 1 month) Finance and Entrepreneurship Adjunct Professor of Management NYU Stern School June 2003  –  June 2004  (1 year 1 month) Finance and Entrepreneurship Managing Director, Head of Corporate Finance Investment Banking, Boutique Firms June 1983  –  August 2002  (19 years 3 months) 12+ years of experience in investment banking. Originated and Completed numerous IPO's, private placements, mergers and acquisitions, and restructuring s. Last position - Senior Managing Director, Broadband Capital Managing Director, Head of Corporate Finance Investment Banking, Boutique Firms June 1983  –  August 2002  (19 years 3 months) 12+ years of experience in investment banking. Originated and Completed numerous IPO's, private placements, mergers and acquisitions, and restructuring s. Last position - Senior Managing Director, Broadband Capital Senior Managing Director Broadband Capital 2002  –  2002  (less than a year) Originate and Execute Private and Public Transactions Senior Managing Director Broadband Capital 2002  –  2002  (less than a year) Originate and Execute Private and Public Transactions Managing Director, Head of Corporate Finance Commonwealth Associates June 1993  –  August 1995  (2 years 3 months) Managing Director, Head of Corporate Finance, 200 person investment banking boutique. Originated, managed and completed numerous IPO's, private placements, venture capital investments, and merger and acquisition transactions. Managing Director, Head of Corporate Finance Commonwealth Associates June 1993  –  August 1995  (2 years 3 months) Managing Director, Head of Corporate Finance, 200 person investment banking boutique. Originated, managed and completed numerous IPO's, private placements, venture capital investments, and merger and acquisition transactions. Vice President Kaufman & Company, LLC June 1983  –  June 1985  (2 years 1 month) Analyze Mergers, Acquisitions and Private Placements Vice President Kaufman & Company, LLC June 1983  –  June 1985  (2 years 1 month) Analyze Mergers, Acquisitions and Private Placements Summer Associate Booz Allen Hamilton 1982  –  1982  (less than a year) Consultant to A Major Telecommunications Company on the Future of the Cable Industry Summer Associate Booz Allen Hamilton 1982  –  1982  (less than a year) Consultant to A Major Telecommunications Company on the Future of the Cable Industry Product Manager Data Resources, Inc. June 1979  –  September 1981  (2 years 4 months) Product Manager for international financial data and credit risk product. Sold and serviced almost all major U.S. banks and investment banks and many foreign banks clients as well. Product Manager Data Resources, Inc. June 1979  –  September 1981  (2 years 4 months) Product Manager for international financial data and credit risk product. Sold and serviced almost all major U.S. banks and investment banks and many foreign banks clients as well. Faculty Award as Outstanding Student Rivers 1968  –  1975  (7 years) Faculty Award as Outstanding Student Rivers 1968  –  1975  (7 years) Faculty Award as Outstanding Student Rivers 1968  –  1975  (7 years) Faculty Award as Outstanding Student Rivers 1968  –  1975  (7 years) Skills Strategy Financial Services Marketing Manufacturing Consumer Products Investment Banking Finance Private Equity Mergers Valuation Financial Modeling Start-ups Corporate Finance Mergers & Acquisitions Hedge Funds Corporate Development Entrepreneurship IPO Management Business Development Business Strategy Marketing Strategy Due Diligence Venture Capital Restructuring Financial Analysis Training Executive Management Management Consulting Program Management Alternative Investments M&A experience Investments Capital Emerging Markets Private Placements Acquisitions Capital Raising LBO Business Valuation Financial Structuring Structured Finance Investor Relations Equity Research Capital Markets Funding See 31+     See less Skills  Strategy Financial Services Marketing Manufacturing Consumer Products Investment Banking Finance Private Equity Mergers Valuation Financial Modeling Start-ups Corporate Finance Mergers & Acquisitions Hedge Funds Corporate Development Entrepreneurship IPO Management Business Development Business Strategy Marketing Strategy Due Diligence Venture Capital Restructuring Financial Analysis Training Executive Management Management Consulting Program Management Alternative Investments M&A experience Investments Capital Emerging Markets Private Placements Acquisitions Capital Raising LBO Business Valuation Financial Structuring Structured Finance Investor Relations Equity Research Capital Markets Funding See 31+     See less Strategy Financial Services Marketing Manufacturing Consumer Products Investment Banking Finance Private Equity Mergers Valuation Financial Modeling Start-ups Corporate Finance Mergers & Acquisitions Hedge Funds Corporate Development Entrepreneurship IPO Management Business Development Business Strategy Marketing Strategy Due Diligence Venture Capital Restructuring Financial Analysis Training Executive Management Management Consulting Program Management Alternative Investments M&A experience Investments Capital Emerging Markets Private Placements Acquisitions Capital Raising LBO Business Valuation Financial Structuring Structured Finance Investor Relations Equity Research Capital Markets Funding See 31+     See less Strategy Financial Services Marketing Manufacturing Consumer Products Investment Banking Finance Private Equity Mergers Valuation Financial Modeling Start-ups Corporate Finance Mergers & Acquisitions Hedge Funds Corporate Development Entrepreneurship IPO Management Business Development Business Strategy Marketing Strategy Due Diligence Venture Capital Restructuring Financial Analysis Training Executive Management Management Consulting Program Management Alternative Investments M&A experience Investments Capital Emerging Markets Private Placements Acquisitions Capital Raising LBO Business Valuation Financial Structuring Structured Finance Investor Relations Equity Research Capital Markets Funding See 31+     See less Education Massachusetts Institute of Technology - Sloan School of Management MBA,  Strategy and Finance 1981  – 1983 M.B.A. Finance and Strategy Activities and Societies:  Studied with Nobel Laureates Fisher Black and Robert Merton Harvard University A. B.,  Economics (Honors) 1975  – 1979 Economics, Government, Social Studies Activities and Societies:  Chairman ,  Kennedy Institute of Politics ,  Student Advisory Committee Massachusetts Institute of Technology - Sloan School of Management MBA,  Strategy and Finance 1981  – 1983 M.B.A. Finance and Strategy Activities and Societies:  Studied with Nobel Laureates Fisher Black and Robert Merton Massachusetts Institute of Technology - Sloan School of Management MBA,  Strategy and Finance 1981  – 1983 M.B.A. Finance and Strategy Activities and Societies:  Studied with Nobel Laureates Fisher Black and Robert Merton Massachusetts Institute of Technology - Sloan School of Management MBA,  Strategy and Finance 1981  – 1983 M.B.A. Finance and Strategy Activities and Societies:  Studied with Nobel Laureates Fisher Black and Robert Merton Harvard University A. B.,  Economics (Honors) 1975  – 1979 Economics, Government, Social Studies Activities and Societies:  Chairman ,  Kennedy Institute of Politics ,  Student Advisory Committee Harvard University A. B.,  Economics (Honors) 1975  – 1979 Economics, Government, Social Studies Activities and Societies:  Chairman ,  Kennedy Institute of Politics ,  Student Advisory Committee Harvard University A. B.,  Economics (Honors) 1975  – 1979 Economics, Government, Social Studies Activities and Societies:  Chairman ,  Kennedy Institute of Politics ,  Student Advisory Committee ", "Skills Data Center Pre-sales Sales Vendor Management Business Strategy Telecommunications Solution Selling Account Management Enterprise Software Channel Business Development Managed Services Professional Services Engineering SaaS Wireless See 1+     See less Skills  Data Center Pre-sales Sales Vendor Management Business Strategy Telecommunications Solution Selling Account Management Enterprise Software Channel Business Development Managed Services Professional Services Engineering SaaS Wireless See 1+     See less Data Center Pre-sales Sales Vendor Management Business Strategy Telecommunications Solution Selling Account Management Enterprise Software Channel Business Development Managed Services Professional Services Engineering SaaS Wireless See 1+     See less Data Center Pre-sales Sales Vendor Management Business Strategy Telecommunications Solution Selling Account Management Enterprise Software Channel Business Development Managed Services Professional Services Engineering SaaS Wireless See 1+     See less ", "Experience VP Operations medSage Technologies March 2007  –  December 2010  (3 years 10 months) VP Operations - Sep 2009 - Dec 2010 (company purchased by Philips Respironics Dec 2010) \nDirector Business Development - Mar 2007 - Aug 2009 Sr. Director Software Development Per-Se Technologies (formerly TechRx Inc, NDCHealth) July 2000  –  September 2006  (6 years 3 months) Sr. Director Software Development – High Volume Pharmacy Systems (10/04 – 09/06) \nSr. Director Software Development – Pharmacy Systems (2/04 – 10/04) \nDirector Software Development – EnterpriseRx (12/01 – 2/04) \nManager Software Engineering (9/01 – 12/01) \nSr. Software Engineer (7/00 – 9/01) Technical Team Lead / Software Engineer Descartes (formerly E-Transport and DXI Inc.) February 1999  –  July 2000  (1 year 6 months) Software Engineer Four Rivers Software Systems April 1998  –  February 1999  (11 months) Software Engineer Raytheon E-Systems June 1996  –  April 1998  (1 year 11 months) VP Operations medSage Technologies March 2007  –  December 2010  (3 years 10 months) VP Operations - Sep 2009 - Dec 2010 (company purchased by Philips Respironics Dec 2010) \nDirector Business Development - Mar 2007 - Aug 2009 VP Operations medSage Technologies March 2007  –  December 2010  (3 years 10 months) VP Operations - Sep 2009 - Dec 2010 (company purchased by Philips Respironics Dec 2010) \nDirector Business Development - Mar 2007 - Aug 2009 Sr. Director Software Development Per-Se Technologies (formerly TechRx Inc, NDCHealth) July 2000  –  September 2006  (6 years 3 months) Sr. Director Software Development – High Volume Pharmacy Systems (10/04 – 09/06) \nSr. Director Software Development – Pharmacy Systems (2/04 – 10/04) \nDirector Software Development – EnterpriseRx (12/01 – 2/04) \nManager Software Engineering (9/01 – 12/01) \nSr. Software Engineer (7/00 – 9/01) Sr. Director Software Development Per-Se Technologies (formerly TechRx Inc, NDCHealth) July 2000  –  September 2006  (6 years 3 months) Sr. Director Software Development – High Volume Pharmacy Systems (10/04 – 09/06) \nSr. Director Software Development – Pharmacy Systems (2/04 – 10/04) \nDirector Software Development – EnterpriseRx (12/01 – 2/04) \nManager Software Engineering (9/01 – 12/01) \nSr. Software Engineer (7/00 – 9/01) Technical Team Lead / Software Engineer Descartes (formerly E-Transport and DXI Inc.) February 1999  –  July 2000  (1 year 6 months) Technical Team Lead / Software Engineer Descartes (formerly E-Transport and DXI Inc.) February 1999  –  July 2000  (1 year 6 months) Software Engineer Four Rivers Software Systems April 1998  –  February 1999  (11 months) Software Engineer Four Rivers Software Systems April 1998  –  February 1999  (11 months) Software Engineer Raytheon E-Systems June 1996  –  April 1998  (1 year 11 months) Software Engineer Raytheon E-Systems June 1996  –  April 1998  (1 year 11 months) Education Robert Morris University M.B.A 2002  – 2006 Westminster College (PA) B.S. Computer Science 1993  – 1996 Pennsylvania State University Computer Engineering 1992  – 1993 Robert Morris University M.B.A 2002  – 2006 Robert Morris University M.B.A 2002  – 2006 Robert Morris University M.B.A 2002  – 2006 Westminster College (PA) B.S. Computer Science 1993  – 1996 Westminster College (PA) B.S. Computer Science 1993  – 1996 Westminster College (PA) B.S. Computer Science 1993  – 1996 Pennsylvania State University Computer Engineering 1992  – 1993 Pennsylvania State University Computer Engineering 1992  – 1993 Pennsylvania State University Computer Engineering 1992  – 1993 ", "Summary Helping others, building great teams and solving impossible problems. That's what I'm passionate about and that's what makes me happy. \n \nCyrus’ background in Information Technology starts in 2003 where he managed a systems integration and sales organization building servers, blades and enterprise hardware chassis. While working full-time he graduated Summa Cum Laude from UCLA in 2009, gaining his bachelors degree in International Development Studies. Cyrus later worked as an I.T. Consultant for BAE Systems and a Support Engineer for Verifi, an online payment processing gateway. \n \nHe and his wife Stephanie joined the Peace Corps in 2010 serving as Youth Development Volunteers in Bulgaria where Cyrus taught Information Technology, Life Skills and English at orphanages and schools. After becoming pregnant with their first son Kameron, in 2011 Stephanie and Cyrus returned to the U.S. where Cyrus became a Production Support Engineer for SDL Language Weaver, supporting their cloud based statistical machine translation platform. \n \nCyrus joined Experian Marketing Services in November 2012 as a member of Application Operations and Engineering. After his first year he was promoted to Manager of the team. Currently he serves as Senior Product Manager of Data Engineering and is responsible for massively scaling Experian's Marketing Suite of Products in terms of performance, reliability and quality. \n \nCyrus is passionate about his family and about volunteering. He has served as Co-Executive Director of Standup For Kids – A non-profit dedicated to helping homeless youth and also Director of Volunteers for Hands on International, an organization that helps the homeless and families in need.  \n \nSpecialties: Agile Product Development, Building and Supporting Distributed Production Systems, Web Based Services, Software Development, Professional Services, Data Analysis and Business Development Summary Helping others, building great teams and solving impossible problems. That's what I'm passionate about and that's what makes me happy. \n \nCyrus’ background in Information Technology starts in 2003 where he managed a systems integration and sales organization building servers, blades and enterprise hardware chassis. While working full-time he graduated Summa Cum Laude from UCLA in 2009, gaining his bachelors degree in International Development Studies. Cyrus later worked as an I.T. Consultant for BAE Systems and a Support Engineer for Verifi, an online payment processing gateway. \n \nHe and his wife Stephanie joined the Peace Corps in 2010 serving as Youth Development Volunteers in Bulgaria where Cyrus taught Information Technology, Life Skills and English at orphanages and schools. After becoming pregnant with their first son Kameron, in 2011 Stephanie and Cyrus returned to the U.S. where Cyrus became a Production Support Engineer for SDL Language Weaver, supporting their cloud based statistical machine translation platform. \n \nCyrus joined Experian Marketing Services in November 2012 as a member of Application Operations and Engineering. After his first year he was promoted to Manager of the team. Currently he serves as Senior Product Manager of Data Engineering and is responsible for massively scaling Experian's Marketing Suite of Products in terms of performance, reliability and quality. \n \nCyrus is passionate about his family and about volunteering. He has served as Co-Executive Director of Standup For Kids – A non-profit dedicated to helping homeless youth and also Director of Volunteers for Hands on International, an organization that helps the homeless and families in need.  \n \nSpecialties: Agile Product Development, Building and Supporting Distributed Production Systems, Web Based Services, Software Development, Professional Services, Data Analysis and Business Development Helping others, building great teams and solving impossible problems. That's what I'm passionate about and that's what makes me happy. \n \nCyrus’ background in Information Technology starts in 2003 where he managed a systems integration and sales organization building servers, blades and enterprise hardware chassis. While working full-time he graduated Summa Cum Laude from UCLA in 2009, gaining his bachelors degree in International Development Studies. Cyrus later worked as an I.T. Consultant for BAE Systems and a Support Engineer for Verifi, an online payment processing gateway. \n \nHe and his wife Stephanie joined the Peace Corps in 2010 serving as Youth Development Volunteers in Bulgaria where Cyrus taught Information Technology, Life Skills and English at orphanages and schools. After becoming pregnant with their first son Kameron, in 2011 Stephanie and Cyrus returned to the U.S. where Cyrus became a Production Support Engineer for SDL Language Weaver, supporting their cloud based statistical machine translation platform. \n \nCyrus joined Experian Marketing Services in November 2012 as a member of Application Operations and Engineering. After his first year he was promoted to Manager of the team. Currently he serves as Senior Product Manager of Data Engineering and is responsible for massively scaling Experian's Marketing Suite of Products in terms of performance, reliability and quality. \n \nCyrus is passionate about his family and about volunteering. He has served as Co-Executive Director of Standup For Kids – A non-profit dedicated to helping homeless youth and also Director of Volunteers for Hands on International, an organization that helps the homeless and families in need.  \n \nSpecialties: Agile Product Development, Building and Supporting Distributed Production Systems, Web Based Services, Software Development, Professional Services, Data Analysis and Business Development Helping others, building great teams and solving impossible problems. That's what I'm passionate about and that's what makes me happy. \n \nCyrus’ background in Information Technology starts in 2003 where he managed a systems integration and sales organization building servers, blades and enterprise hardware chassis. While working full-time he graduated Summa Cum Laude from UCLA in 2009, gaining his bachelors degree in International Development Studies. Cyrus later worked as an I.T. Consultant for BAE Systems and a Support Engineer for Verifi, an online payment processing gateway. \n \nHe and his wife Stephanie joined the Peace Corps in 2010 serving as Youth Development Volunteers in Bulgaria where Cyrus taught Information Technology, Life Skills and English at orphanages and schools. After becoming pregnant with their first son Kameron, in 2011 Stephanie and Cyrus returned to the U.S. where Cyrus became a Production Support Engineer for SDL Language Weaver, supporting their cloud based statistical machine translation platform. \n \nCyrus joined Experian Marketing Services in November 2012 as a member of Application Operations and Engineering. After his first year he was promoted to Manager of the team. Currently he serves as Senior Product Manager of Data Engineering and is responsible for massively scaling Experian's Marketing Suite of Products in terms of performance, reliability and quality. \n \nCyrus is passionate about his family and about volunteering. He has served as Co-Executive Director of Standup For Kids – A non-profit dedicated to helping homeless youth and also Director of Volunteers for Hands on International, an organization that helps the homeless and families in need.  \n \nSpecialties: Agile Product Development, Building and Supporting Distributed Production Systems, Web Based Services, Software Development, Professional Services, Data Analysis and Business Development Experience Senior Product Manager - Data Engineering Experian November 2012  – Present (2 years 10 months) Greater Los Angeles Area Senior Product Manager - Data Engineering Experian November 2012  – Present (2 years 10 months) Greater Los Angeles Area Senior Product Manager - Data Engineering Experian November 2012  – Present (2 years 10 months) Greater Los Angeles Area Languages English Native or bilingual proficiency Persian Full professional proficiency Bulgarian Professional working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Persian Full professional proficiency Bulgarian Professional working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Persian Full professional proficiency Bulgarian Professional working proficiency Spanish Elementary proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Elementary proficiency Skills Linux SaaS Java HTML SQL Web Applications Windows Server VMware Cloud Computing JIRA Software Development Software Engineering LAMP DevOps Systems Engineering Virtualization Web Services Security Databases Agile Methodologies Troubleshooting Disaster Recovery Software Documentation Apache Unix Servers Product Management Project Management E-commerce Leadership See 15+     See less Skills  Linux SaaS Java HTML SQL Web Applications Windows Server VMware Cloud Computing JIRA Software Development Software Engineering LAMP DevOps Systems Engineering Virtualization Web Services Security Databases Agile Methodologies Troubleshooting Disaster Recovery Software Documentation Apache Unix Servers Product Management Project Management E-commerce Leadership See 15+     See less Linux SaaS Java HTML SQL Web Applications Windows Server VMware Cloud Computing JIRA Software Development Software Engineering LAMP DevOps Systems Engineering Virtualization Web Services Security Databases Agile Methodologies Troubleshooting Disaster Recovery Software Documentation Apache Unix Servers Product Management Project Management E-commerce Leadership See 15+     See less Linux SaaS Java HTML SQL Web Applications Windows Server VMware Cloud Computing JIRA Software Development Software Engineering LAMP DevOps Systems Engineering Virtualization Web Services Security Databases Agile Methodologies Troubleshooting Disaster Recovery Software Documentation Apache Unix Servers Product Management Project Management E-commerce Leadership See 15+     See less Education University of California, Los Angeles B.A. Summa Cum Laude,  Development Economics and International Development 2007  – 2009 University of California, Los Angeles B.A. Summa Cum Laude,  Development Economics and International Development 2007  – 2009 University of California, Los Angeles B.A. Summa Cum Laude,  Development Economics and International Development 2007  – 2009 University of California, Los Angeles B.A. Summa Cum Laude,  Development Economics and International Development 2007  – 2009 Honors & Awards ", "Languages Chinese (Mandarin) Chinese (Cantonese) Chinese (Mandarin) Chinese (Cantonese) Chinese (Mandarin) Chinese (Cantonese) Skills Product Strategy Product Management Data Management Localization Internationalization Product Marketing Internet Product... HTML Photoshop Microstrategy CSPO SQL Agile Methodologies User Experience Monetization MicroStrategy Strategy Analytics See 3+     See less Skills  Product Strategy Product Management Data Management Localization Internationalization Product Marketing Internet Product... HTML Photoshop Microstrategy CSPO SQL Agile Methodologies User Experience Monetization MicroStrategy Strategy Analytics See 3+     See less Product Strategy Product Management Data Management Localization Internationalization Product Marketing Internet Product... HTML Photoshop Microstrategy CSPO SQL Agile Methodologies User Experience Monetization MicroStrategy Strategy Analytics See 3+     See less Product Strategy Product Management Data Management Localization Internationalization Product Marketing Internet Product... HTML Photoshop Microstrategy CSPO SQL Agile Methodologies User Experience Monetization MicroStrategy Strategy Analytics See 3+     See less Education Nanyang Technological University Bachelor of Business,  Marketing Nanyang Technological University Bachelor of Business,  Marketing Nanyang Technological University Bachelor of Business,  Marketing Nanyang Technological University Bachelor of Business,  Marketing Honors & Awards ", "Summary A result oriented professional with over 5+ years’ experience in the areas of Product Management, Pre-Sales and BID Management in Data Center and Cloud Computing Services. Summary A result oriented professional with over 5+ years’ experience in the areas of Product Management, Pre-Sales and BID Management in Data Center and Cloud Computing Services. A result oriented professional with over 5+ years’ experience in the areas of Product Management, Pre-Sales and BID Management in Data Center and Cloud Computing Services. A result oriented professional with over 5+ years’ experience in the areas of Product Management, Pre-Sales and BID Management in Data Center and Cloud Computing Services. Experience Asst General Manager - Data Center & Cloud Services Trimax IT Infrastructure & Services Ltd April 2012  – Present (3 years 5 months) Solution Consultant Nxtra Data Limited 2014  –  2015  (1 year) Solution Consultant Nxtra Data Limited 2014  –  2015  (1 year) Senior Product Manager - Data Center & Cloud Services Trimax Data Center Services Limited April 2010  –  April 2012  (2 years 1 month) Bangalore Product Manager - Data Center Hosting Services Trimax IT Infrastructure & Services Ltd April 2009  –  April 2010  (1 year 1 month) Bangalore Product Manager - Data Center Hosting Services Reliance Communications June 2007  –  April 2009  (1 year 11 months) Mumbai Area, India Asst General Manager - Data Center & Cloud Services Trimax IT Infrastructure & Services Ltd April 2012  – Present (3 years 5 months) Asst General Manager - Data Center & Cloud Services Trimax IT Infrastructure & Services Ltd April 2012  – Present (3 years 5 months) Solution Consultant Nxtra Data Limited 2014  –  2015  (1 year) Solution Consultant Nxtra Data Limited 2014  –  2015  (1 year) Solution Consultant Nxtra Data Limited 2014  –  2015  (1 year) Solution Consultant Nxtra Data Limited 2014  –  2015  (1 year) Senior Product Manager - Data Center & Cloud Services Trimax Data Center Services Limited April 2010  –  April 2012  (2 years 1 month) Bangalore Senior Product Manager - Data Center & Cloud Services Trimax Data Center Services Limited April 2010  –  April 2012  (2 years 1 month) Bangalore Product Manager - Data Center Hosting Services Trimax IT Infrastructure & Services Ltd April 2009  –  April 2010  (1 year 1 month) Bangalore Product Manager - Data Center Hosting Services Trimax IT Infrastructure & Services Ltd April 2009  –  April 2010  (1 year 1 month) Bangalore Product Manager - Data Center Hosting Services Reliance Communications June 2007  –  April 2009  (1 year 11 months) Mumbai Area, India Product Manager - Data Center Hosting Services Reliance Communications June 2007  –  April 2009  (1 year 11 months) Mumbai Area, India Languages English Hindi Telugu Tamil English Hindi Telugu Tamil English Hindi Telugu Tamil Skills Pre-sales Cloud Computing Managed Services Data Center Product Costing Product Management Vendor Management Solution Architecture Co-location Product Marketing Service Delivery Requirements Analysis Service Management Solution Selling Telecommunications Team Management Channel Partners IT Operations PMP IT Service Management Business Development SaaS VoIP ITIL Enterprise Software Virtualization Business Analysis See 12+     See less Skills  Pre-sales Cloud Computing Managed Services Data Center Product Costing Product Management Vendor Management Solution Architecture Co-location Product Marketing Service Delivery Requirements Analysis Service Management Solution Selling Telecommunications Team Management Channel Partners IT Operations PMP IT Service Management Business Development SaaS VoIP ITIL Enterprise Software Virtualization Business Analysis See 12+     See less Pre-sales Cloud Computing Managed Services Data Center Product Costing Product Management Vendor Management Solution Architecture Co-location Product Marketing Service Delivery Requirements Analysis Service Management Solution Selling Telecommunications Team Management Channel Partners IT Operations PMP IT Service Management Business Development SaaS VoIP ITIL Enterprise Software Virtualization Business Analysis See 12+     See less Pre-sales Cloud Computing Managed Services Data Center Product Costing Product Management Vendor Management Solution Architecture Co-location Product Marketing Service Delivery Requirements Analysis Service Management Solution Selling Telecommunications Team Management Channel Partners IT Operations PMP IT Service Management Business Development SaaS VoIP ITIL Enterprise Software Virtualization Business Analysis See 12+     See less Education Anna University M.E,  Communications Systems Vikas Residential School Anna University M.E,  Communications Systems Anna University M.E,  Communications Systems Anna University M.E,  Communications Systems Vikas Residential School Vikas Residential School Vikas Residential School ", "Summary “Everything that can be connected will be connected.” Summary “Everything that can be connected will be connected.” “Everything that can be connected will be connected.” “Everything that can be connected will be connected.” Experience Product Manager Data-Orchestration-as-a-Service T-Systems March 2015  – Present (6 months) Düsseldorf Area, Germany Product Manager for Data-Orchestration-as-a-Service (powered by Informatica Cloud) \nhttp://cloud.t-systems.com/solutions/enterprise-doaas Director Cloud Transformation T-Systems March 2014  – Present (1 year 6 months) Düsseldorf Area, Germany Solution Sales Manager T-Systems April 2013  –  February 2014  (11 months) Hosting Services Sales Consultant T-Systems Enterprise Services GmbH January 2009  –  March 2013  (4 years 3 months) Product Manager Data-Orchestration-as-a-Service T-Systems March 2015  – Present (6 months) Düsseldorf Area, Germany Product Manager for Data-Orchestration-as-a-Service (powered by Informatica Cloud) \nhttp://cloud.t-systems.com/solutions/enterprise-doaas Product Manager Data-Orchestration-as-a-Service T-Systems March 2015  – Present (6 months) Düsseldorf Area, Germany Product Manager for Data-Orchestration-as-a-Service (powered by Informatica Cloud) \nhttp://cloud.t-systems.com/solutions/enterprise-doaas Director Cloud Transformation T-Systems March 2014  – Present (1 year 6 months) Düsseldorf Area, Germany Director Cloud Transformation T-Systems March 2014  – Present (1 year 6 months) Düsseldorf Area, Germany Solution Sales Manager T-Systems April 2013  –  February 2014  (11 months) Hosting Services Solution Sales Manager T-Systems April 2013  –  February 2014  (11 months) Hosting Services Sales Consultant T-Systems Enterprise Services GmbH January 2009  –  March 2013  (4 years 3 months) Sales Consultant T-Systems Enterprise Services GmbH January 2009  –  March 2013  (4 years 3 months) Languages English German Polish English German Polish English German Polish Skills Account Management Cloud Computing VMware Telecommunications MPLS Hosting Services IT Solutions Cloud-Computing IT-Strategie Skills  Account Management Cloud Computing VMware Telecommunications MPLS Hosting Services IT Solutions Cloud-Computing IT-Strategie Account Management Cloud Computing VMware Telecommunications MPLS Hosting Services IT Solutions Cloud-Computing IT-Strategie Account Management Cloud Computing VMware Telecommunications MPLS Hosting Services IT Solutions Cloud-Computing IT-Strategie Education Fachhochschule für Oekonomie und Management Essen Bachelor of Arts (B.A.),  Business Administration and Management , General Fachhochschule für Oekonomie und Management Essen Bachelor of Arts (B.A.),  Business Administration and Management , General Fachhochschule für Oekonomie und Management Essen Bachelor of Arts (B.A.),  Business Administration and Management , General Fachhochschule für Oekonomie und Management Essen Bachelor of Arts (B.A.),  Business Administration and Management , General ", "Summary Inbound and outbound product management for products that help enterprises do things with data: Data and application integration, data preparation, data virtualization, Big Data, data warehousing, analytics, data discovery, and data quality products. Summary Inbound and outbound product management for products that help enterprises do things with data: Data and application integration, data preparation, data virtualization, Big Data, data warehousing, analytics, data discovery, and data quality products. Inbound and outbound product management for products that help enterprises do things with data: Data and application integration, data preparation, data virtualization, Big Data, data warehousing, analytics, data discovery, and data quality products. Inbound and outbound product management for products that help enterprises do things with data: Data and application integration, data preparation, data virtualization, Big Data, data warehousing, analytics, data discovery, and data quality products. Experience Senior Product Manager, Data Virtualization Business Unit Cisco December 2013  – Present (1 year 9 months) San Jose, CA In the Data Virtualization Business Unit (formerly Composite Software).  \n \nContributing to product roadmap for Cisco's data virtualization-related offerings growing out of the acquisition of Composite Software in 2013. Data preparation for analytics, data source support, and integration with NoSQL sources are some of what I work on. Senior Product Manager MuleSoft Inc November 2012  –  October 2013  (1 year) San Francisco, CA Contributor to Mule's connector development program and SDK; Customer on-ramp and documentation issues; benchmarking and performance efforts. Freelance product management/marketing consultant Methodicum March 2012  –  November 2012  (9 months) Providing product management and product marketing services to technology companies. Selected client list: EventGnosis (complex event processing), Calpont (columnar database for analytics). Data Integration Product Mktg Manager Talend May 2011  –  November 2011  (7 months) Los Altos, CA Outbound product marketing management activities including sales training, support on deals, public webcasts and collateral on data integration topics including Big Data and Cloud integration, preparing and presenting briefings for analysts, and working with product reviewers, press and PR agencies. Inbound activities included management of data integration product roadmap, competitive analysis around data integration (especially cloud integration and Big Data), and creation of requirements documents. Senior Product Manager, Data Integration Oracle Corporation May 2009  –  May 2011  (2 years 1 month) Senior product manager with PM responsibility for data integration products in middleware and database divisions, including Oracle Warehouse Builder (OWB), Oracle Data Integrator (ODI), and accompanying data quality offerings. Served as Voice of the Customer for OWB data warehousing customers. Working on product strategy, positioning, and messaging, sales training, assisting with complex sales, resolving support issues, presenting at conferences, and cultivating reference customers. Working with marketing to determine product roadmap and messaging for middleware and database data quality products. Senior Product Manager, Oracle Warehouse Builder Oracle Corporation April 2007  –  May 2009  (2 years 2 months) Product manager on Oracle Warehouse Builder, the leading ETL/data quality/data integration tool. for the Oracle database. Input on feature set, engineering functional specifications, doc, collateral and whitepapers.  \n \nRefining product messaging/positioning for 11.2.  \nCreating and delivering product demonstrations (including VM demo environments and demo scripts).  \n \nPresenting OWB to customers and at conferences (OpenWorld 2008 on DQ and MDM; ODTUG New Orleans on SOAP/WS Integration from OWB; Collaborate08 on data quality and scope and execution risk); BIWA SIG 2008 on Data Rules in OWB.  \n \nBackstopping support for particularly difficult technical issues; working to improve communications and raise product profile through blogging and discussion groups, and introduce other means of collaborating with current and future customers. \n \nWorking on long term ideas on product messaging. Principal Technical Writer/Tools Developer oracle October 2002  –  April 2007  (4 years 7 months) Developed new Web interface to upcoming database documentation library portal release, and automated documentation production processes based on Adobe Framemaker and Acrobat, to where >50K pages of documentation are rebuilt from source daily or weekly. Reduced documentation production costs, shortened typical production processing from days to hours, improved management visibility into the state of the documentation and reducing the risk due to manuals that are out of date with the current state of the product.  \n \nRedesigned the documentation library to take more advantage of Javascript, Dynamic HTML, and AJAX. Managed vendor evaluation for content management system, refining real techincal requirements and conferring with vendor representatives and internal decision makers. \n \nDeveloped and maintained documentation for database backup tool Recovery Manager (RMAN). Developed documentation on Oracle Secure Backup tape backup utility. Worked closely with developers and product management for direction and review. Editor, Popular Culture and Technology, and Web Developer Euromedia Group Ltd. 1998  –  2006  (8 years) Recruited and managed editorial team to cover film, interactive media and other popular culture. Defined house writing style. Managed and edited contributions of experienced professional journalists, academics and domain experts. \n \nManaged arts and entertainment content syndication and co-branding relationship with Compuserve.  \n \nBuilt custom content management systems for publishing magazine and event calendar, with search engine optimization, in-browser WYSIWIG editing, and content syndication. Integrated subscription management and third-party payment services (e.g. iBill, PayPal, Verisign). Web Designer/Database App Developer self May 1999  –  October 2002  (3 years 6 months) Provided Web site design and Web and database programming for varied clients including the Packard Foundation and the International Fund for Agricultural Development. Sites included online communities, group blogging sites, remote Unix web cache appliance administration, and assistance for other projects. technical writer General Magic October 1994  –  August 1996  (1 year 11 months) Wrote developer's guides, installation guides, application developer's cookbooks, and whitepapers on Telescript application server/intelligent agent programming language. Worked closely with development and product management staff on fast-evolving technologies. Senior Member of Technical Staff Xerox Corporation October 1989  –  July 1992  (2 years 10 months) Developer on CUSP/GV Agents cross-application scripting language/framework. Evaluated workflow technology from acquired company and planned incorporation of workflow engine into existing Viewpoint/GlobalView office automation suite. Research Assistant/Programmer Princeton University, Cognitive Science Laboratory May 1988  –  October 1989  (1 year 6 months) Research assistant/programmer working on intelligent tutoring systems, rule-based systems, and databases. Built search and indexing tools and browsing GUI for Wordnet lexical database (http://wordnet.princeton.edu). Software developer Princeton Telecom Corporation September 1987  –  August 1988  (1 year) Developer on personal finance and news and information access software. Developed portable code in C for DOS, Macintosh and Apple II. Created build and QA tools using AWK, sed and MKS Shell. Summer Research Assistant Bellcore 1985  –  1986  (1 year) Rapid application development and mainframe app UI prototyping using Smalltalk on PCs Senior Product Manager, Data Virtualization Business Unit Cisco December 2013  – Present (1 year 9 months) San Jose, CA In the Data Virtualization Business Unit (formerly Composite Software).  \n \nContributing to product roadmap for Cisco's data virtualization-related offerings growing out of the acquisition of Composite Software in 2013. Data preparation for analytics, data source support, and integration with NoSQL sources are some of what I work on. Senior Product Manager, Data Virtualization Business Unit Cisco December 2013  – Present (1 year 9 months) San Jose, CA In the Data Virtualization Business Unit (formerly Composite Software).  \n \nContributing to product roadmap for Cisco's data virtualization-related offerings growing out of the acquisition of Composite Software in 2013. Data preparation for analytics, data source support, and integration with NoSQL sources are some of what I work on. Senior Product Manager MuleSoft Inc November 2012  –  October 2013  (1 year) San Francisco, CA Contributor to Mule's connector development program and SDK; Customer on-ramp and documentation issues; benchmarking and performance efforts. Senior Product Manager MuleSoft Inc November 2012  –  October 2013  (1 year) San Francisco, CA Contributor to Mule's connector development program and SDK; Customer on-ramp and documentation issues; benchmarking and performance efforts. Freelance product management/marketing consultant Methodicum March 2012  –  November 2012  (9 months) Providing product management and product marketing services to technology companies. Selected client list: EventGnosis (complex event processing), Calpont (columnar database for analytics). Freelance product management/marketing consultant Methodicum March 2012  –  November 2012  (9 months) Providing product management and product marketing services to technology companies. Selected client list: EventGnosis (complex event processing), Calpont (columnar database for analytics). Data Integration Product Mktg Manager Talend May 2011  –  November 2011  (7 months) Los Altos, CA Outbound product marketing management activities including sales training, support on deals, public webcasts and collateral on data integration topics including Big Data and Cloud integration, preparing and presenting briefings for analysts, and working with product reviewers, press and PR agencies. Inbound activities included management of data integration product roadmap, competitive analysis around data integration (especially cloud integration and Big Data), and creation of requirements documents. Data Integration Product Mktg Manager Talend May 2011  –  November 2011  (7 months) Los Altos, CA Outbound product marketing management activities including sales training, support on deals, public webcasts and collateral on data integration topics including Big Data and Cloud integration, preparing and presenting briefings for analysts, and working with product reviewers, press and PR agencies. Inbound activities included management of data integration product roadmap, competitive analysis around data integration (especially cloud integration and Big Data), and creation of requirements documents. Senior Product Manager, Data Integration Oracle Corporation May 2009  –  May 2011  (2 years 1 month) Senior product manager with PM responsibility for data integration products in middleware and database divisions, including Oracle Warehouse Builder (OWB), Oracle Data Integrator (ODI), and accompanying data quality offerings. Served as Voice of the Customer for OWB data warehousing customers. Working on product strategy, positioning, and messaging, sales training, assisting with complex sales, resolving support issues, presenting at conferences, and cultivating reference customers. Working with marketing to determine product roadmap and messaging for middleware and database data quality products. Senior Product Manager, Data Integration Oracle Corporation May 2009  –  May 2011  (2 years 1 month) Senior product manager with PM responsibility for data integration products in middleware and database divisions, including Oracle Warehouse Builder (OWB), Oracle Data Integrator (ODI), and accompanying data quality offerings. Served as Voice of the Customer for OWB data warehousing customers. Working on product strategy, positioning, and messaging, sales training, assisting with complex sales, resolving support issues, presenting at conferences, and cultivating reference customers. Working with marketing to determine product roadmap and messaging for middleware and database data quality products. Senior Product Manager, Oracle Warehouse Builder Oracle Corporation April 2007  –  May 2009  (2 years 2 months) Product manager on Oracle Warehouse Builder, the leading ETL/data quality/data integration tool. for the Oracle database. Input on feature set, engineering functional specifications, doc, collateral and whitepapers.  \n \nRefining product messaging/positioning for 11.2.  \nCreating and delivering product demonstrations (including VM demo environments and demo scripts).  \n \nPresenting OWB to customers and at conferences (OpenWorld 2008 on DQ and MDM; ODTUG New Orleans on SOAP/WS Integration from OWB; Collaborate08 on data quality and scope and execution risk); BIWA SIG 2008 on Data Rules in OWB.  \n \nBackstopping support for particularly difficult technical issues; working to improve communications and raise product profile through blogging and discussion groups, and introduce other means of collaborating with current and future customers. \n \nWorking on long term ideas on product messaging. Senior Product Manager, Oracle Warehouse Builder Oracle Corporation April 2007  –  May 2009  (2 years 2 months) Product manager on Oracle Warehouse Builder, the leading ETL/data quality/data integration tool. for the Oracle database. Input on feature set, engineering functional specifications, doc, collateral and whitepapers.  \n \nRefining product messaging/positioning for 11.2.  \nCreating and delivering product demonstrations (including VM demo environments and demo scripts).  \n \nPresenting OWB to customers and at conferences (OpenWorld 2008 on DQ and MDM; ODTUG New Orleans on SOAP/WS Integration from OWB; Collaborate08 on data quality and scope and execution risk); BIWA SIG 2008 on Data Rules in OWB.  \n \nBackstopping support for particularly difficult technical issues; working to improve communications and raise product profile through blogging and discussion groups, and introduce other means of collaborating with current and future customers. \n \nWorking on long term ideas on product messaging. Principal Technical Writer/Tools Developer oracle October 2002  –  April 2007  (4 years 7 months) Developed new Web interface to upcoming database documentation library portal release, and automated documentation production processes based on Adobe Framemaker and Acrobat, to where >50K pages of documentation are rebuilt from source daily or weekly. Reduced documentation production costs, shortened typical production processing from days to hours, improved management visibility into the state of the documentation and reducing the risk due to manuals that are out of date with the current state of the product.  \n \nRedesigned the documentation library to take more advantage of Javascript, Dynamic HTML, and AJAX. Managed vendor evaluation for content management system, refining real techincal requirements and conferring with vendor representatives and internal decision makers. \n \nDeveloped and maintained documentation for database backup tool Recovery Manager (RMAN). Developed documentation on Oracle Secure Backup tape backup utility. Worked closely with developers and product management for direction and review. Principal Technical Writer/Tools Developer oracle October 2002  –  April 2007  (4 years 7 months) Developed new Web interface to upcoming database documentation library portal release, and automated documentation production processes based on Adobe Framemaker and Acrobat, to where >50K pages of documentation are rebuilt from source daily or weekly. Reduced documentation production costs, shortened typical production processing from days to hours, improved management visibility into the state of the documentation and reducing the risk due to manuals that are out of date with the current state of the product.  \n \nRedesigned the documentation library to take more advantage of Javascript, Dynamic HTML, and AJAX. Managed vendor evaluation for content management system, refining real techincal requirements and conferring with vendor representatives and internal decision makers. \n \nDeveloped and maintained documentation for database backup tool Recovery Manager (RMAN). Developed documentation on Oracle Secure Backup tape backup utility. Worked closely with developers and product management for direction and review. Editor, Popular Culture and Technology, and Web Developer Euromedia Group Ltd. 1998  –  2006  (8 years) Recruited and managed editorial team to cover film, interactive media and other popular culture. Defined house writing style. Managed and edited contributions of experienced professional journalists, academics and domain experts. \n \nManaged arts and entertainment content syndication and co-branding relationship with Compuserve.  \n \nBuilt custom content management systems for publishing magazine and event calendar, with search engine optimization, in-browser WYSIWIG editing, and content syndication. Integrated subscription management and third-party payment services (e.g. iBill, PayPal, Verisign). Editor, Popular Culture and Technology, and Web Developer Euromedia Group Ltd. 1998  –  2006  (8 years) Recruited and managed editorial team to cover film, interactive media and other popular culture. Defined house writing style. Managed and edited contributions of experienced professional journalists, academics and domain experts. \n \nManaged arts and entertainment content syndication and co-branding relationship with Compuserve.  \n \nBuilt custom content management systems for publishing magazine and event calendar, with search engine optimization, in-browser WYSIWIG editing, and content syndication. Integrated subscription management and third-party payment services (e.g. iBill, PayPal, Verisign). Web Designer/Database App Developer self May 1999  –  October 2002  (3 years 6 months) Provided Web site design and Web and database programming for varied clients including the Packard Foundation and the International Fund for Agricultural Development. Sites included online communities, group blogging sites, remote Unix web cache appliance administration, and assistance for other projects. Web Designer/Database App Developer self May 1999  –  October 2002  (3 years 6 months) Provided Web site design and Web and database programming for varied clients including the Packard Foundation and the International Fund for Agricultural Development. Sites included online communities, group blogging sites, remote Unix web cache appliance administration, and assistance for other projects. technical writer General Magic October 1994  –  August 1996  (1 year 11 months) Wrote developer's guides, installation guides, application developer's cookbooks, and whitepapers on Telescript application server/intelligent agent programming language. Worked closely with development and product management staff on fast-evolving technologies. technical writer General Magic October 1994  –  August 1996  (1 year 11 months) Wrote developer's guides, installation guides, application developer's cookbooks, and whitepapers on Telescript application server/intelligent agent programming language. Worked closely with development and product management staff on fast-evolving technologies. Senior Member of Technical Staff Xerox Corporation October 1989  –  July 1992  (2 years 10 months) Developer on CUSP/GV Agents cross-application scripting language/framework. Evaluated workflow technology from acquired company and planned incorporation of workflow engine into existing Viewpoint/GlobalView office automation suite. Senior Member of Technical Staff Xerox Corporation October 1989  –  July 1992  (2 years 10 months) Developer on CUSP/GV Agents cross-application scripting language/framework. Evaluated workflow technology from acquired company and planned incorporation of workflow engine into existing Viewpoint/GlobalView office automation suite. Research Assistant/Programmer Princeton University, Cognitive Science Laboratory May 1988  –  October 1989  (1 year 6 months) Research assistant/programmer working on intelligent tutoring systems, rule-based systems, and databases. Built search and indexing tools and browsing GUI for Wordnet lexical database (http://wordnet.princeton.edu). Research Assistant/Programmer Princeton University, Cognitive Science Laboratory May 1988  –  October 1989  (1 year 6 months) Research assistant/programmer working on intelligent tutoring systems, rule-based systems, and databases. Built search and indexing tools and browsing GUI for Wordnet lexical database (http://wordnet.princeton.edu). Software developer Princeton Telecom Corporation September 1987  –  August 1988  (1 year) Developer on personal finance and news and information access software. Developed portable code in C for DOS, Macintosh and Apple II. Created build and QA tools using AWK, sed and MKS Shell. Software developer Princeton Telecom Corporation September 1987  –  August 1988  (1 year) Developer on personal finance and news and information access software. Developed portable code in C for DOS, Macintosh and Apple II. Created build and QA tools using AWK, sed and MKS Shell. Summer Research Assistant Bellcore 1985  –  1986  (1 year) Rapid application development and mainframe app UI prototyping using Smalltalk on PCs Summer Research Assistant Bellcore 1985  –  1986  (1 year) Rapid application development and mainframe app UI prototyping using Smalltalk on PCs Languages French; some German; some Latin French; some German; some Latin French; some German; some Latin Skills Product Management Apache Spark Hadoop Data Preparation Big Data Business Intelligence Databases Data Integration Data Warehousing Oracle Integration ETL Enterprise Software Cloud Computing XML Master Data Management Unix Data Quality Virtualization HTML Software Development SaaS Strategy SQL Technical Writing Agile Methodologies PL/SQL Perl Agile Project Management Product Marketing Oracle Warehouse Builder Enterprise Architecture Competitive Analysis data management Java Talend Testing Public Speaking Writing Web Applications JavaScript SOA Mule ESB Analytics Strategic Partnerships See 30+     See less Skills  Product Management Apache Spark Hadoop Data Preparation Big Data Business Intelligence Databases Data Integration Data Warehousing Oracle Integration ETL Enterprise Software Cloud Computing XML Master Data Management Unix Data Quality Virtualization HTML Software Development SaaS Strategy SQL Technical Writing Agile Methodologies PL/SQL Perl Agile Project Management Product Marketing Oracle Warehouse Builder Enterprise Architecture Competitive Analysis data management Java Talend Testing Public Speaking Writing Web Applications JavaScript SOA Mule ESB Analytics Strategic Partnerships See 30+     See less Product Management Apache Spark Hadoop Data Preparation Big Data Business Intelligence Databases Data Integration Data Warehousing Oracle Integration ETL Enterprise Software Cloud Computing XML Master Data Management Unix Data Quality Virtualization HTML Software Development SaaS Strategy SQL Technical Writing Agile Methodologies PL/SQL Perl Agile Project Management Product Marketing Oracle Warehouse Builder Enterprise Architecture Competitive Analysis data management Java Talend Testing Public Speaking Writing Web Applications JavaScript SOA Mule ESB Analytics Strategic Partnerships See 30+     See less Product Management Apache Spark Hadoop Data Preparation Big Data Business Intelligence Databases Data Integration Data Warehousing Oracle Integration ETL Enterprise Software Cloud Computing XML Master Data Management Unix Data Quality Virtualization HTML Software Development SaaS Strategy SQL Technical Writing Agile Methodologies PL/SQL Perl Agile Project Management Product Marketing Oracle Warehouse Builder Enterprise Architecture Competitive Analysis data management Java Talend Testing Public Speaking Writing Web Applications JavaScript SOA Mule ESB Analytics Strategic Partnerships See 30+     See less Education Yale University M. Phil.,  Comparative Literature 1992  – 1998 Coursework included literature in French, English, German and Latin. Primary research areas included African literature in French and English. Taught for one year in English department. Princeton University BSE,  Electrical Engineering ,  Computer Science 1983  – 1987 Course work included compilers, independent project in AI/intelligent tutoring systems, algorithm theory, robotics. Member of Princeton Charter Club, Princeton Inn/Forbes College Collegiate School for Boys Cum Laude,  High School Graduate 1971  – 1983 Yale University M. Phil.,  Comparative Literature 1992  – 1998 Coursework included literature in French, English, German and Latin. Primary research areas included African literature in French and English. Taught for one year in English department. Yale University M. Phil.,  Comparative Literature 1992  – 1998 Coursework included literature in French, English, German and Latin. Primary research areas included African literature in French and English. Taught for one year in English department. Yale University M. Phil.,  Comparative Literature 1992  – 1998 Coursework included literature in French, English, German and Latin. Primary research areas included African literature in French and English. Taught for one year in English department. Princeton University BSE,  Electrical Engineering ,  Computer Science 1983  – 1987 Course work included compilers, independent project in AI/intelligent tutoring systems, algorithm theory, robotics. Member of Princeton Charter Club, Princeton Inn/Forbes College Princeton University BSE,  Electrical Engineering ,  Computer Science 1983  – 1987 Course work included compilers, independent project in AI/intelligent tutoring systems, algorithm theory, robotics. Member of Princeton Charter Club, Princeton Inn/Forbes College Princeton University BSE,  Electrical Engineering ,  Computer Science 1983  – 1987 Course work included compilers, independent project in AI/intelligent tutoring systems, algorithm theory, robotics. Member of Princeton Charter Club, Princeton Inn/Forbes College Collegiate School for Boys Cum Laude,  High School Graduate 1971  – 1983 Collegiate School for Boys Cum Laude,  High School Graduate 1971  – 1983 Collegiate School for Boys Cum Laude,  High School Graduate 1971  – 1983 Honors & Awards ", "Summary Seasoned technology professional with 14 years of experience in data & data related technologies.  \n \nExperienced Data (Platform) Product / Development Manager with primary focus on  \n1) building a data platform for easy to create self-serviceable data solution for deeper data insights  \n \n2) business analysis / product ownership, business process improvements  \n \n3) Master Data management, Data governance, Data Quality & Data Stewardship, in various roles including people management/leadership, project/product management, analysis, design & development, strategy formulation and solution architecture.  \n \nAvinash has strong analytical skills to identify and resolve problems and ability to effectively apply a broad range of professional concepts, practices and methods in moderately complex and diverse circumstances \n \nExpertise: \n \nBIG Data Plafform, Datawarehouse \n \nData Visualization, BI Analysis, Dashboard & Metadata Analysis \n \nMaster Data Management, Data Governance, Data Stewardship \n \nPeople / Program / Project / Delivery management \n[Project Management - PMP® - Project Management Professional - PMI (PMBoK) ] \n Summary Seasoned technology professional with 14 years of experience in data & data related technologies.  \n \nExperienced Data (Platform) Product / Development Manager with primary focus on  \n1) building a data platform for easy to create self-serviceable data solution for deeper data insights  \n \n2) business analysis / product ownership, business process improvements  \n \n3) Master Data management, Data governance, Data Quality & Data Stewardship, in various roles including people management/leadership, project/product management, analysis, design & development, strategy formulation and solution architecture.  \n \nAvinash has strong analytical skills to identify and resolve problems and ability to effectively apply a broad range of professional concepts, practices and methods in moderately complex and diverse circumstances \n \nExpertise: \n \nBIG Data Plafform, Datawarehouse \n \nData Visualization, BI Analysis, Dashboard & Metadata Analysis \n \nMaster Data Management, Data Governance, Data Stewardship \n \nPeople / Program / Project / Delivery management \n[Project Management - PMP® - Project Management Professional - PMI (PMBoK) ] \n Seasoned technology professional with 14 years of experience in data & data related technologies.  \n \nExperienced Data (Platform) Product / Development Manager with primary focus on  \n1) building a data platform for easy to create self-serviceable data solution for deeper data insights  \n \n2) business analysis / product ownership, business process improvements  \n \n3) Master Data management, Data governance, Data Quality & Data Stewardship, in various roles including people management/leadership, project/product management, analysis, design & development, strategy formulation and solution architecture.  \n \nAvinash has strong analytical skills to identify and resolve problems and ability to effectively apply a broad range of professional concepts, practices and methods in moderately complex and diverse circumstances \n \nExpertise: \n \nBIG Data Plafform, Datawarehouse \n \nData Visualization, BI Analysis, Dashboard & Metadata Analysis \n \nMaster Data Management, Data Governance, Data Stewardship \n \nPeople / Program / Project / Delivery management \n[Project Management - PMP® - Project Management Professional - PMI (PMBoK) ] \n Seasoned technology professional with 14 years of experience in data & data related technologies.  \n \nExperienced Data (Platform) Product / Development Manager with primary focus on  \n1) building a data platform for easy to create self-serviceable data solution for deeper data insights  \n \n2) business analysis / product ownership, business process improvements  \n \n3) Master Data management, Data governance, Data Quality & Data Stewardship, in various roles including people management/leadership, project/product management, analysis, design & development, strategy formulation and solution architecture.  \n \nAvinash has strong analytical skills to identify and resolve problems and ability to effectively apply a broad range of professional concepts, practices and methods in moderately complex and diverse circumstances \n \nExpertise: \n \nBIG Data Plafform, Datawarehouse \n \nData Visualization, BI Analysis, Dashboard & Metadata Analysis \n \nMaster Data Management, Data Governance, Data Stewardship \n \nPeople / Program / Project / Delivery management \n[Project Management - PMP® - Project Management Professional - PMI (PMBoK) ] \n Experience Sr Product Manager (Data), Platform Citrix February 2015  – Present (7 months) San Francisco Bay Area Focus Areas: \n1) Big Data Platform \n2) Master Data Management \n3) Data Governance, Data Quality, Data Stewardship \n4) Data Analytics & Visualization \n Product Manager, Data Group Citrix January 2010  – Present (5 years 8 months) San Francisco Bay Area > Product Owner - Data, Analytics \n> Reporting & Visualization - Practice Lead \n> Master Data Management - Practice Lead \n> Salesforce Assets - Practice Lead \n> SOX for Data - Practice Lead \n> Data SME  \n> Contract & Vendor Management Sr Product Manager (Data), Platform Citrix February 2015  – Present (7 months) San Francisco Bay Area Focus Areas: \n1) Big Data Platform \n2) Master Data Management \n3) Data Governance, Data Quality, Data Stewardship \n4) Data Analytics & Visualization \n Sr Product Manager (Data), Platform Citrix February 2015  – Present (7 months) San Francisco Bay Area Focus Areas: \n1) Big Data Platform \n2) Master Data Management \n3) Data Governance, Data Quality, Data Stewardship \n4) Data Analytics & Visualization \n Product Manager, Data Group Citrix January 2010  – Present (5 years 8 months) San Francisco Bay Area > Product Owner - Data, Analytics \n> Reporting & Visualization - Practice Lead \n> Master Data Management - Practice Lead \n> Salesforce Assets - Practice Lead \n> SOX for Data - Practice Lead \n> Data SME  \n> Contract & Vendor Management Product Manager, Data Group Citrix January 2010  – Present (5 years 8 months) San Francisco Bay Area > Product Owner - Data, Analytics \n> Reporting & Visualization - Practice Lead \n> Master Data Management - Practice Lead \n> Salesforce Assets - Practice Lead \n> SOX for Data - Practice Lead \n> Data SME  \n> Contract & Vendor Management Skills Program Management PMP Business Analysis Business Intelligence Software Project... Data Modeling Agile Project Management Business Objects Long-term Customer... Data Analysis Project Management Project Governance Scrum Requirements Gathering Business Process Oracle SOA Visio Solution Architecture Testing Data Warehousing ETL Databases See 8+     See less Skills  Program Management PMP Business Analysis Business Intelligence Software Project... Data Modeling Agile Project Management Business Objects Long-term Customer... Data Analysis Project Management Project Governance Scrum Requirements Gathering Business Process Oracle SOA Visio Solution Architecture Testing Data Warehousing ETL Databases See 8+     See less Program Management PMP Business Analysis Business Intelligence Software Project... Data Modeling Agile Project Management Business Objects Long-term Customer... Data Analysis Project Management Project Governance Scrum Requirements Gathering Business Process Oracle SOA Visio Solution Architecture Testing Data Warehousing ETL Databases See 8+     See less Program Management PMP Business Analysis Business Intelligence Software Project... Data Modeling Agile Project Management Business Objects Long-term Customer... Data Analysis Project Management Project Governance Scrum Requirements Gathering Business Process Oracle SOA Visio Solution Architecture Testing Data Warehousing ETL Databases See 8+     See less Education University of Westminster MSc,  Advanced Software Engineering 2001  – 2003 PSG College of Technology BE,  computer science 1996  – 2000 University of Westminster MSc,  Advanced Software Engineering 2001  – 2003 University of Westminster MSc,  Advanced Software Engineering 2001  – 2003 University of Westminster MSc,  Advanced Software Engineering 2001  – 2003 PSG College of Technology BE,  computer science 1996  – 2000 PSG College of Technology BE,  computer science 1996  – 2000 PSG College of Technology BE,  computer science 1996  – 2000 Honors & Awards Q1 2012 MVP Nominee Citrix Online March 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  Q2 2012 MVP Nominee Citrix Online July 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  VALUES Excellence Award - Q2 2012 Citrix Online July 2012 Citrix Online is proud to present this values award for Avinash Krishnaram's outstanding performance and exceptional commitment to the company's core values. Project Management - PMP® - Project Management Professional - PMI (PMBoK) PMI - Project Management Institute October 2010 Q1 2012 MVP Nominee Citrix Online March 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  Q1 2012 MVP Nominee Citrix Online March 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  Q1 2012 MVP Nominee Citrix Online March 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  Q2 2012 MVP Nominee Citrix Online July 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  Q2 2012 MVP Nominee Citrix Online July 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  Q2 2012 MVP Nominee Citrix Online July 2012 For exceptional performance Citrix Online recognized Avinash Krishnaram as an MVP Nominee  VALUES Excellence Award - Q2 2012 Citrix Online July 2012 Citrix Online is proud to present this values award for Avinash Krishnaram's outstanding performance and exceptional commitment to the company's core values. VALUES Excellence Award - Q2 2012 Citrix Online July 2012 Citrix Online is proud to present this values award for Avinash Krishnaram's outstanding performance and exceptional commitment to the company's core values. VALUES Excellence Award - Q2 2012 Citrix Online July 2012 Citrix Online is proud to present this values award for Avinash Krishnaram's outstanding performance and exceptional commitment to the company's core values. Project Management - PMP® - Project Management Professional - PMI (PMBoK) PMI - Project Management Institute October 2010 Project Management - PMP® - Project Management Professional - PMI (PMBoK) PMI - Project Management Institute October 2010 Project Management - PMP® - Project Management Professional - PMI (PMBoK) PMI - Project Management Institute October 2010 ", "Summary Katherine Hunt is a versatile professional with over a decade of experience in the IT channel, having served previously in various roles for VAR companies, channel vendors, media, and channel training organizations.  \nKate is a recognized thought leader, trainer, consultant and speaker in the IT channel and possesses numerous certifications and professional specializations. She has been selected for CRN Magazine’s Power 100 Women in the Channel list multiple years and remains dedicated to ongoing professional development. Summary Katherine Hunt is a versatile professional with over a decade of experience in the IT channel, having served previously in various roles for VAR companies, channel vendors, media, and channel training organizations.  \nKate is a recognized thought leader, trainer, consultant and speaker in the IT channel and possesses numerous certifications and professional specializations. She has been selected for CRN Magazine’s Power 100 Women in the Channel list multiple years and remains dedicated to ongoing professional development. Katherine Hunt is a versatile professional with over a decade of experience in the IT channel, having served previously in various roles for VAR companies, channel vendors, media, and channel training organizations.  \nKate is a recognized thought leader, trainer, consultant and speaker in the IT channel and possesses numerous certifications and professional specializations. She has been selected for CRN Magazine’s Power 100 Women in the Channel list multiple years and remains dedicated to ongoing professional development. Katherine Hunt is a versatile professional with over a decade of experience in the IT channel, having served previously in various roles for VAR companies, channel vendors, media, and channel training organizations.  \nKate is a recognized thought leader, trainer, consultant and speaker in the IT channel and possesses numerous certifications and professional specializations. She has been selected for CRN Magazine’s Power 100 Women in the Channel list multiple years and remains dedicated to ongoing professional development. Experience Product Manager, Data Centers Penton January 2015  – Present (8 months) Product Manager, Data Center Vertical iNET Interactive August 2014  – Present (1 year 1 month) Cincinnati Area Director, Member Communities CompTIA March 2012  –  April 2014  (2 years 2 months) cincinnati area VP, Community Development; Editor of www.LooksCloudy.com Own Web Now 2010  –  2012  (2 years) Educational Content Manager/Director of Education MSP University 2009  –  2010  (1 year) MSP University provides education, training, fulfillment and consulting services to Membership Organizations, Vendor Channels, Franchises and independent IT Service Organizations worldwide. We are the ultimate vendor-neutral resource for all IT Service Providers either preparing to transition to an Annuity-based Managed Services delivery model, or who are already delivering Managed Services, and wish to increase their knowledge of Managed Services Vendors, Services, Solutions and Business, Technical and Sales and Marketing Best Practices. President Grandview Strategy January 2007  –  2010  (3 years) Yesterday we built huge corporations to do tiny, incremental things. Today we must build small organizations that are capable of doing massively huge things. \nWe help small and medium sized businesses effectively leverage their technology investments to drive bottom-line profitability. \nTechnology is an investment in your business, not an expense. Remote Managed Services Novacoast 2007  –  2009  (2 years) Remote Managed Services for Novacoast, Inc. Product Manager PRO OnCall Technologies 2004  –  2007  (3 years) President of Board of Directors Renegade Garage Players 2004  –  2006  (2 years) Product Manager, Data Centers Penton January 2015  – Present (8 months) Product Manager, Data Centers Penton January 2015  – Present (8 months) Product Manager, Data Center Vertical iNET Interactive August 2014  – Present (1 year 1 month) Cincinnati Area Product Manager, Data Center Vertical iNET Interactive August 2014  – Present (1 year 1 month) Cincinnati Area Director, Member Communities CompTIA March 2012  –  April 2014  (2 years 2 months) cincinnati area Director, Member Communities CompTIA March 2012  –  April 2014  (2 years 2 months) cincinnati area VP, Community Development; Editor of www.LooksCloudy.com Own Web Now 2010  –  2012  (2 years) VP, Community Development; Editor of www.LooksCloudy.com Own Web Now 2010  –  2012  (2 years) Educational Content Manager/Director of Education MSP University 2009  –  2010  (1 year) MSP University provides education, training, fulfillment and consulting services to Membership Organizations, Vendor Channels, Franchises and independent IT Service Organizations worldwide. We are the ultimate vendor-neutral resource for all IT Service Providers either preparing to transition to an Annuity-based Managed Services delivery model, or who are already delivering Managed Services, and wish to increase their knowledge of Managed Services Vendors, Services, Solutions and Business, Technical and Sales and Marketing Best Practices. Educational Content Manager/Director of Education MSP University 2009  –  2010  (1 year) MSP University provides education, training, fulfillment and consulting services to Membership Organizations, Vendor Channels, Franchises and independent IT Service Organizations worldwide. We are the ultimate vendor-neutral resource for all IT Service Providers either preparing to transition to an Annuity-based Managed Services delivery model, or who are already delivering Managed Services, and wish to increase their knowledge of Managed Services Vendors, Services, Solutions and Business, Technical and Sales and Marketing Best Practices. President Grandview Strategy January 2007  –  2010  (3 years) Yesterday we built huge corporations to do tiny, incremental things. Today we must build small organizations that are capable of doing massively huge things. \nWe help small and medium sized businesses effectively leverage their technology investments to drive bottom-line profitability. \nTechnology is an investment in your business, not an expense. President Grandview Strategy January 2007  –  2010  (3 years) Yesterday we built huge corporations to do tiny, incremental things. Today we must build small organizations that are capable of doing massively huge things. \nWe help small and medium sized businesses effectively leverage their technology investments to drive bottom-line profitability. \nTechnology is an investment in your business, not an expense. Remote Managed Services Novacoast 2007  –  2009  (2 years) Remote Managed Services for Novacoast, Inc. Remote Managed Services Novacoast 2007  –  2009  (2 years) Remote Managed Services for Novacoast, Inc. Product Manager PRO OnCall Technologies 2004  –  2007  (3 years) Product Manager PRO OnCall Technologies 2004  –  2007  (3 years) President of Board of Directors Renegade Garage Players 2004  –  2006  (2 years) President of Board of Directors Renegade Garage Players 2004  –  2006  (2 years) Skills Solution Selling Product Development Guerrilla Marketing Cloud Computing Marketing Strategy Channel Marketing Virtualization Managed Services Unified Communications Program Management Training SaaS Security Sales Microsoft Technologies Public Speaking Account Management Data Center Channel Partners Disaster Recovery Enterprise Software Organizational... Professional Services Networking Strategic Partnerships Sales Management Project Management Lead Generation VoIP Network Security Storage See 17+     See less Skills  Solution Selling Product Development Guerrilla Marketing Cloud Computing Marketing Strategy Channel Marketing Virtualization Managed Services Unified Communications Program Management Training SaaS Security Sales Microsoft Technologies Public Speaking Account Management Data Center Channel Partners Disaster Recovery Enterprise Software Organizational... Professional Services Networking Strategic Partnerships Sales Management Project Management Lead Generation VoIP Network Security Storage See 17+     See less Solution Selling Product Development Guerrilla Marketing Cloud Computing Marketing Strategy Channel Marketing Virtualization Managed Services Unified Communications Program Management Training SaaS Security Sales Microsoft Technologies Public Speaking Account Management Data Center Channel Partners Disaster Recovery Enterprise Software Organizational... Professional Services Networking Strategic Partnerships Sales Management Project Management Lead Generation VoIP Network Security Storage See 17+     See less Solution Selling Product Development Guerrilla Marketing Cloud Computing Marketing Strategy Channel Marketing Virtualization Managed Services Unified Communications Program Management Training SaaS Security Sales Microsoft Technologies Public Speaking Account Management Data Center Channel Partners Disaster Recovery Enterprise Software Organizational... Professional Services Networking Strategic Partnerships Sales Management Project Management Lead Generation VoIP Network Security Storage See 17+     See less Education Kent State University BS,  Business Administration and Management , General Kent State University BS,  Business Administration and Management , General Kent State University BS,  Business Administration and Management , General Kent State University BS,  Business Administration and Management , General Honors & Awards Additional Honors & Awards CRN Power 100 Women in the Channel 2009 and 2010,  \nCertified Novell Salesperson 2008: Linux, Workgroup, ISM, SRM Additional Honors & Awards CRN Power 100 Women in the Channel 2009 and 2010,  \nCertified Novell Salesperson 2008: Linux, Workgroup, ISM, SRM Additional Honors & Awards CRN Power 100 Women in the Channel 2009 and 2010,  \nCertified Novell Salesperson 2008: Linux, Workgroup, ISM, SRM Additional Honors & Awards CRN Power 100 Women in the Channel 2009 and 2010,  \nCertified Novell Salesperson 2008: Linux, Workgroup, ISM, SRM ", "Summary Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Summary Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Experience Senior Technical Leader Electric Power Research Institute (EPRI) April 2015  – Present (5 months) Palo Alto, CA Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Project Manager Electric Power Research Institute August 2012  –  March 2015  (2 years 8 months) Palo Alto, CA Manage Projects in the Risk & Reliability Research Area as a member of the Nuclear Risk and Safety Management Group. Applications Engineer Electric Power Research Institute April 2006  –  August 2012  (6 years 5 months) As Applications Engineer I worked on all stages of the EPRI Risk & Reliability Suite of Software release. From the design of the features and specifications, to the testing phase, training and support. I was a key interface and connection between the development team and the users. Area D3 Governor Toastmasters International July 2011  –  July 2012  (1 year 1 month) San Francisco Bay Area Area Governor for 6 Toastmasters clubs located in San Francisco (Asian Express Toastmasters, SF Japanese-English Toastmasters (JETs), Everybody Speaks, Rainbow Toastmasters, Toastmodernists & Eloquent Elocutionists). \nWork closely with each club to support their educational and leadership development process, ensure they meet the Distinguished Club Program goals set by Toastmasters and organize 2 speaking contests per year. President San Francisco Toastmasters January 2011  –  June 2011  (6 months) President of the San Francisco Toastmasters Club as of January 2011. Club #1771 located in Downtown San Francisco. Product Manager Data Systems & Solutions February 2001  –  February 2006  (5 years 1 month) Product Manager, Trainer, Customer Support, Testing, Marketing EPRI Loan-in Project Manager Électricité de France September 1999  –  February 2001  (1 year 6 months) Loan-in Project Manager for EDF (Electricite De France) at EPRI. Fire Modeling Studies. Senior Technical Leader Electric Power Research Institute (EPRI) April 2015  – Present (5 months) Palo Alto, CA Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Senior Technical Leader Electric Power Research Institute (EPRI) April 2015  – Present (5 months) Palo Alto, CA Senior Technical Leader in the Nuclear Risk and Safety (RSM) program at the Electric Power Research Institute (EPRI). Research activities currently focus on developing Probabilistic Risk Assessment (PRA) Software. \n \nFirst joined EPRI in 1999 as a Resident Researcher from the French utility Electricité de France (EDF) working on the EDF Fire Modeling code MAGIC and its integration with EPRI’s PRA methodologies. In 2006 re-joined EPRI as an Applications Engineer where I supported the development, testing and user support for a wide range of EPRI software tools with a main emphasis on PRA codes. I assumed the position of Project Manager in 2012 and Senior Technical Leader in 2015. In this role, I manage the EPRI Risk and Reliability Users’ Group, the EPRI Phoenix Users' Group and all related research in PRA Software development. Functions include frequent on-site PRA software training at aerospace and nuclear users’ sites. \nAdditionally, I manage the development of guidelines for Internal Flooding Probabilistic Risk Assessment (IFPRA) and the associated pipe rupture frequencies estimate studies. \n \nPrior to joining EPRI, I was a Customer Support Manager and a Product Manager at Data Systems and Solutions (DS&S), LLC where I led the development and testing of DS&S and EPRI PRA software codes and managed the support and help desk for the suite of PRA software tools. In these roles I focused on the end-user experience with the software tools and the application of EPRI’s PRA software at users’ sites.  \n \nHold a Master’s degree in Mechanical Engineering and a post graduate diploma (D.E.A.) in Fluid Dynamics and Transfer with honors both from Ecole Centrale de Nantes. Project Manager Electric Power Research Institute August 2012  –  March 2015  (2 years 8 months) Palo Alto, CA Manage Projects in the Risk & Reliability Research Area as a member of the Nuclear Risk and Safety Management Group. Project Manager Electric Power Research Institute August 2012  –  March 2015  (2 years 8 months) Palo Alto, CA Manage Projects in the Risk & Reliability Research Area as a member of the Nuclear Risk and Safety Management Group. Applications Engineer Electric Power Research Institute April 2006  –  August 2012  (6 years 5 months) As Applications Engineer I worked on all stages of the EPRI Risk & Reliability Suite of Software release. From the design of the features and specifications, to the testing phase, training and support. I was a key interface and connection between the development team and the users. Applications Engineer Electric Power Research Institute April 2006  –  August 2012  (6 years 5 months) As Applications Engineer I worked on all stages of the EPRI Risk & Reliability Suite of Software release. From the design of the features and specifications, to the testing phase, training and support. I was a key interface and connection between the development team and the users. Area D3 Governor Toastmasters International July 2011  –  July 2012  (1 year 1 month) San Francisco Bay Area Area Governor for 6 Toastmasters clubs located in San Francisco (Asian Express Toastmasters, SF Japanese-English Toastmasters (JETs), Everybody Speaks, Rainbow Toastmasters, Toastmodernists & Eloquent Elocutionists). \nWork closely with each club to support their educational and leadership development process, ensure they meet the Distinguished Club Program goals set by Toastmasters and organize 2 speaking contests per year. Area D3 Governor Toastmasters International July 2011  –  July 2012  (1 year 1 month) San Francisco Bay Area Area Governor for 6 Toastmasters clubs located in San Francisco (Asian Express Toastmasters, SF Japanese-English Toastmasters (JETs), Everybody Speaks, Rainbow Toastmasters, Toastmodernists & Eloquent Elocutionists). \nWork closely with each club to support their educational and leadership development process, ensure they meet the Distinguished Club Program goals set by Toastmasters and organize 2 speaking contests per year. President San Francisco Toastmasters January 2011  –  June 2011  (6 months) President of the San Francisco Toastmasters Club as of January 2011. Club #1771 located in Downtown San Francisco. President San Francisco Toastmasters January 2011  –  June 2011  (6 months) President of the San Francisco Toastmasters Club as of January 2011. Club #1771 located in Downtown San Francisco. Product Manager Data Systems & Solutions February 2001  –  February 2006  (5 years 1 month) Product Manager, Trainer, Customer Support, Testing, Marketing Product Manager Data Systems & Solutions February 2001  –  February 2006  (5 years 1 month) Product Manager, Trainer, Customer Support, Testing, Marketing EPRI Loan-in Project Manager Électricité de France September 1999  –  February 2001  (1 year 6 months) Loan-in Project Manager for EDF (Electricite De France) at EPRI. Fire Modeling Studies. EPRI Loan-in Project Manager Électricité de France September 1999  –  February 2001  (1 year 6 months) Loan-in Project Manager for EDF (Electricite De France) at EPRI. Fire Modeling Studies. Languages French English French English French English Skills Public Speaking Strategic Planning Customer Relations Program Management Product Management Software... Software Project... Research Project... Probabilistic Models Risk Assessment Nuclear Safety Project Management Systems Engineering Training Customer Service Project Planning Nuclear Engineering Nuclear Leadership Energy Analysis Engineering Technical Writing Management Power Plants Integration Engineering Management Testing Electric Power Process Engineering Software Development Power Generation Smart Grid Mechanical Engineering Project Engineering Power Systems Renewable Energy Reliability Engineering Energy Management Energy Efficiency Solar Energy Simulations Factory Reliability See 29+     See less Skills  Public Speaking Strategic Planning Customer Relations Program Management Product Management Software... Software Project... Research Project... Probabilistic Models Risk Assessment Nuclear Safety Project Management Systems Engineering Training Customer Service Project Planning Nuclear Engineering Nuclear Leadership Energy Analysis Engineering Technical Writing Management Power Plants Integration Engineering Management Testing Electric Power Process Engineering Software Development Power Generation Smart Grid Mechanical Engineering Project Engineering Power Systems Renewable Energy Reliability Engineering Energy Management Energy Efficiency Solar Energy Simulations Factory Reliability See 29+     See less Public Speaking Strategic Planning Customer Relations Program Management Product Management Software... Software Project... Research Project... Probabilistic Models Risk Assessment Nuclear Safety Project Management Systems Engineering Training Customer Service Project Planning Nuclear Engineering Nuclear Leadership Energy Analysis Engineering Technical Writing Management Power Plants Integration Engineering Management Testing Electric Power Process Engineering Software Development Power Generation Smart Grid Mechanical Engineering Project Engineering Power Systems Renewable Energy Reliability Engineering Energy Management Energy Efficiency Solar Energy Simulations Factory Reliability See 29+     See less Public Speaking Strategic Planning Customer Relations Program Management Product Management Software... Software Project... Research Project... Probabilistic Models Risk Assessment Nuclear Safety Project Management Systems Engineering Training Customer Service Project Planning Nuclear Engineering Nuclear Leadership Energy Analysis Engineering Technical Writing Management Power Plants Integration Engineering Management Testing Electric Power Process Engineering Software Development Power Generation Smart Grid Mechanical Engineering Project Engineering Power Systems Renewable Energy Reliability Engineering Energy Management Energy Efficiency Solar Energy Simulations Factory Reliability See 29+     See less Education Ecole centrale de Nantes DEA - All But Dissertation,  Fluid Dynamics and Numerical Modeling 1998  – 1999 DEA = \"Diplôme D'études Avancées\" - Advanced Studies Diploma later replaced by Master of Research. Equivalent to a Post Graduate Degree taken before completing a PhD~ All But Dissertation. Ecole centrale de Nantes Master,  Mechanical Engineering 1996  – 1999 Lycee Blaise Pascal 1992  – 1997 Ecole centrale de Nantes DEA - All But Dissertation,  Fluid Dynamics and Numerical Modeling 1998  – 1999 DEA = \"Diplôme D'études Avancées\" - Advanced Studies Diploma later replaced by Master of Research. Equivalent to a Post Graduate Degree taken before completing a PhD~ All But Dissertation. Ecole centrale de Nantes DEA - All But Dissertation,  Fluid Dynamics and Numerical Modeling 1998  – 1999 DEA = \"Diplôme D'études Avancées\" - Advanced Studies Diploma later replaced by Master of Research. Equivalent to a Post Graduate Degree taken before completing a PhD~ All But Dissertation. Ecole centrale de Nantes DEA - All But Dissertation,  Fluid Dynamics and Numerical Modeling 1998  – 1999 DEA = \"Diplôme D'études Avancées\" - Advanced Studies Diploma later replaced by Master of Research. Equivalent to a Post Graduate Degree taken before completing a PhD~ All But Dissertation. Ecole centrale de Nantes Master,  Mechanical Engineering 1996  – 1999 Ecole centrale de Nantes Master,  Mechanical Engineering 1996  – 1999 Ecole centrale de Nantes Master,  Mechanical Engineering 1996  – 1999 Lycee Blaise Pascal 1992  – 1997 Lycee Blaise Pascal 1992  – 1997 Lycee Blaise Pascal 1992  – 1997 Honors & Awards Additional Honors & Awards Toastmasters Advanced Communicator Gold Award (2013) \nToastmasters Advanced Leader Bronze Award (2011) \nZentrale Mittelstufenprüfung (ZMP) - Goethe Institut (1999) Additional Honors & Awards Toastmasters Advanced Communicator Gold Award (2013) \nToastmasters Advanced Leader Bronze Award (2011) \nZentrale Mittelstufenprüfung (ZMP) - Goethe Institut (1999) Additional Honors & Awards Toastmasters Advanced Communicator Gold Award (2013) \nToastmasters Advanced Leader Bronze Award (2011) \nZentrale Mittelstufenprüfung (ZMP) - Goethe Institut (1999) Additional Honors & Awards Toastmasters Advanced Communicator Gold Award (2013) \nToastmasters Advanced Leader Bronze Award (2011) \nZentrale Mittelstufenprüfung (ZMP) - Goethe Institut (1999) ", "Summary •\tOver 27 years of rich experience in managing project operations with key focus on defining Service Level Agreements (SLA’s), Standard Operating Procedures (SOP’s) as well as interacting with prestigious clients, business partners, industry leaders, vendors & other key stakeholders \n•\tWorked on service strategy, business intelligence, cloud, e-commerce, transition, operations, process improvement, process management, team building, training, hiring and client relationship management \n•\tSpearheaded large-scale program management including agile, enterprise program governance, risk management, outsourcing/insourcing and offshore/onshore development models \n•\tDirected technology planning and direction, strategy development, leadership and implementation, business and operational transformation execution, business solution delivery, and business development \n•\tImplemented projects by steering innovative initiatives across areas of varied functionality resulting in cost savings and higher operational performance using a number of productivity tools \n•\tLed a large team of more than 300 people (in-house & outdoor) comprising of managers, technical professionals and functional specialists for the execution of large projects \n•\tConsistently recognized for delivering projects on time, building and mentoring software development teams and organizations \n•\tDefined and tailored the roles and responsibilities for each track of the Project Management and SDLC methodologies \n•\tPossess international exposure by managing multiple accounts involving diverse cultural & technological teams across geographies including US and UK \n•\tCoached & mentored a team of program managers to successfully deliver numerous complex, high-priority initiatives including a major transition to a new infrastructure which also involved migrating all customers and accounts to the new platform \n Summary •\tOver 27 years of rich experience in managing project operations with key focus on defining Service Level Agreements (SLA’s), Standard Operating Procedures (SOP’s) as well as interacting with prestigious clients, business partners, industry leaders, vendors & other key stakeholders \n•\tWorked on service strategy, business intelligence, cloud, e-commerce, transition, operations, process improvement, process management, team building, training, hiring and client relationship management \n•\tSpearheaded large-scale program management including agile, enterprise program governance, risk management, outsourcing/insourcing and offshore/onshore development models \n•\tDirected technology planning and direction, strategy development, leadership and implementation, business and operational transformation execution, business solution delivery, and business development \n•\tImplemented projects by steering innovative initiatives across areas of varied functionality resulting in cost savings and higher operational performance using a number of productivity tools \n•\tLed a large team of more than 300 people (in-house & outdoor) comprising of managers, technical professionals and functional specialists for the execution of large projects \n•\tConsistently recognized for delivering projects on time, building and mentoring software development teams and organizations \n•\tDefined and tailored the roles and responsibilities for each track of the Project Management and SDLC methodologies \n•\tPossess international exposure by managing multiple accounts involving diverse cultural & technological teams across geographies including US and UK \n•\tCoached & mentored a team of program managers to successfully deliver numerous complex, high-priority initiatives including a major transition to a new infrastructure which also involved migrating all customers and accounts to the new platform \n •\tOver 27 years of rich experience in managing project operations with key focus on defining Service Level Agreements (SLA’s), Standard Operating Procedures (SOP’s) as well as interacting with prestigious clients, business partners, industry leaders, vendors & other key stakeholders \n•\tWorked on service strategy, business intelligence, cloud, e-commerce, transition, operations, process improvement, process management, team building, training, hiring and client relationship management \n•\tSpearheaded large-scale program management including agile, enterprise program governance, risk management, outsourcing/insourcing and offshore/onshore development models \n•\tDirected technology planning and direction, strategy development, leadership and implementation, business and operational transformation execution, business solution delivery, and business development \n•\tImplemented projects by steering innovative initiatives across areas of varied functionality resulting in cost savings and higher operational performance using a number of productivity tools \n•\tLed a large team of more than 300 people (in-house & outdoor) comprising of managers, technical professionals and functional specialists for the execution of large projects \n•\tConsistently recognized for delivering projects on time, building and mentoring software development teams and organizations \n•\tDefined and tailored the roles and responsibilities for each track of the Project Management and SDLC methodologies \n•\tPossess international exposure by managing multiple accounts involving diverse cultural & technological teams across geographies including US and UK \n•\tCoached & mentored a team of program managers to successfully deliver numerous complex, high-priority initiatives including a major transition to a new infrastructure which also involved migrating all customers and accounts to the new platform \n •\tOver 27 years of rich experience in managing project operations with key focus on defining Service Level Agreements (SLA’s), Standard Operating Procedures (SOP’s) as well as interacting with prestigious clients, business partners, industry leaders, vendors & other key stakeholders \n•\tWorked on service strategy, business intelligence, cloud, e-commerce, transition, operations, process improvement, process management, team building, training, hiring and client relationship management \n•\tSpearheaded large-scale program management including agile, enterprise program governance, risk management, outsourcing/insourcing and offshore/onshore development models \n•\tDirected technology planning and direction, strategy development, leadership and implementation, business and operational transformation execution, business solution delivery, and business development \n•\tImplemented projects by steering innovative initiatives across areas of varied functionality resulting in cost savings and higher operational performance using a number of productivity tools \n•\tLed a large team of more than 300 people (in-house & outdoor) comprising of managers, technical professionals and functional specialists for the execution of large projects \n•\tConsistently recognized for delivering projects on time, building and mentoring software development teams and organizations \n•\tDefined and tailored the roles and responsibilities for each track of the Project Management and SDLC methodologies \n•\tPossess international exposure by managing multiple accounts involving diverse cultural & technological teams across geographies including US and UK \n•\tCoached & mentored a team of program managers to successfully deliver numerous complex, high-priority initiatives including a major transition to a new infrastructure which also involved migrating all customers and accounts to the new platform \n Experience Sr. Advisor UST Global September 2013  – Present (2 years) Bangalore • Providing Leadership and domain expertise across the Retail BU and other engagements \n• Handling deliveries and production support (offshore-onshore model) for the transportation portfolio of one of the largest retailers in the world as a Portfolio Leader \n• Managing a team of Program Managers & Project Managers to ensure on-time and quality deliveries in a highly demanding industry using Agile methodologies \n• Ensuring SLA adherence in support and maintenance of related applications \n• Having complete ownership of deliveries, budgets, vendors \n• Exploiting opportunities for business generation Head - Solutions & Technology Heritage Foods (Ind) Ltd March 2013  –  August 2013  (6 months) Hyderabad Heritage Foods (India) Limited, Hyderabad is a chain of retail stores in South India with operations in Hyderabad, Chennai and Bangalore with over 64 stores. KPIs include: \n \n• Spearheading various in house functions and initiatives. Formulating IT policies and procedures governing operations of the IT division, in line with the IT vision and mission statement \n• Managing the Networking and System Administration activities inclusive of Facility Management Service, File Server, Network Security System and Mail server Administration \n• Comparing and evaluating new software with the existing software and taking necessary measures for the implementation of new features in the existing software (SAP) \n• Managing Software Management services in-house, involving version control, change management and all licensing issues for purchased software applications \n• Interacting with senior level management as well as internal users for continuous improvement in business with new IT technologies and cost-effective solutions Program Manager Zensar Technologies Limited February 2006  –  October 2012  (6 years 9 months) Pune Area, India Have successfully handled IT Head and other senior IT assignments at Max Hypermarkets and Carrefour India including both pre launch and post launch activities. Successfully implemented POS and Store Solutions at clients end which include Spencer’s, Bilt, Spinach, VIP Bags and ITC among others.  \n \nClients have appreciated my no nonsense approach and solutions to tackle issues be it technical, administrative or personnel. Have successfully implemented innovative and practical solutions across various retail/non-retail functions to streamline processes and operations. These solutions have been very cost effective and time saving. Project Manager Extentia Information Technology October 2000  –  October 2005  (5 years 1 month) Pune Area, India An offshore software development and consulting organization based in Pune, India, serving clients in Germany and North America. Extentia is committed to delivering high quality, cost-effective information technology solutions specializing in web portals for B2B and B2C sales. \n \nRESPONSIBILITIES \n- Project planning and management. \n- System design and consultation with clients  \n- Client Relations. \n- Recruitment and training of personnel.  \n- Adhering to time schedules and commitments.  \n- Optimizing performance with available resources. \n- Managing development operations. \n- Strict compliance of time schedules, commitments and quality standards. \n- Coordinating with various cross-functional teams. \n- Testing & providing implementation support of the developed software. Regional Manager Operations KesTech August 1993  –  September 2000  (7 years 2 months) Pune Area, India RESPONSIBILITIES \n- Project planning and management. \n- Organizing people and team management. \n- Recruitment and training of personnel.  \n- Adhering to time schedules and commitments.  \n- Optimizing performance with available resources. \n- Overall supervision of finance, administration, marketing and development operations. \n- Ensured strict compliance of time schedules, commitments and quality standards. \n- System design and consultation with clients. \n- Coordinating with onsite teams. \n- Testing & implementation of the developed software. Product Manager Data System Services November 1987  –  July 1993  (5 years 9 months) Pune A computer consultancy organization developing software for Indian and foreign clients, data processing and the manufacture and sale of power stabilizing equipment. (Development in COBOL, UNIFY / ACCELL, ORACLE) \n- Conducted System Studies at some of the leading industrial houses in Pune. \n- Developed packages for a wide range of clients including Front Office Management and Billing for Hotels, Restaurants, Hospitals, Army Canteens, etc. after detailed discussions with the relevant user-groups at Client’s end. Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Sr. Advisor UST Global September 2013  – Present (2 years) Bangalore • Providing Leadership and domain expertise across the Retail BU and other engagements \n• Handling deliveries and production support (offshore-onshore model) for the transportation portfolio of one of the largest retailers in the world as a Portfolio Leader \n• Managing a team of Program Managers & Project Managers to ensure on-time and quality deliveries in a highly demanding industry using Agile methodologies \n• Ensuring SLA adherence in support and maintenance of related applications \n• Having complete ownership of deliveries, budgets, vendors \n• Exploiting opportunities for business generation Sr. Advisor UST Global September 2013  – Present (2 years) Bangalore • Providing Leadership and domain expertise across the Retail BU and other engagements \n• Handling deliveries and production support (offshore-onshore model) for the transportation portfolio of one of the largest retailers in the world as a Portfolio Leader \n• Managing a team of Program Managers & Project Managers to ensure on-time and quality deliveries in a highly demanding industry using Agile methodologies \n• Ensuring SLA adherence in support and maintenance of related applications \n• Having complete ownership of deliveries, budgets, vendors \n• Exploiting opportunities for business generation Head - Solutions & Technology Heritage Foods (Ind) Ltd March 2013  –  August 2013  (6 months) Hyderabad Heritage Foods (India) Limited, Hyderabad is a chain of retail stores in South India with operations in Hyderabad, Chennai and Bangalore with over 64 stores. KPIs include: \n \n• Spearheading various in house functions and initiatives. Formulating IT policies and procedures governing operations of the IT division, in line with the IT vision and mission statement \n• Managing the Networking and System Administration activities inclusive of Facility Management Service, File Server, Network Security System and Mail server Administration \n• Comparing and evaluating new software with the existing software and taking necessary measures for the implementation of new features in the existing software (SAP) \n• Managing Software Management services in-house, involving version control, change management and all licensing issues for purchased software applications \n• Interacting with senior level management as well as internal users for continuous improvement in business with new IT technologies and cost-effective solutions Head - Solutions & Technology Heritage Foods (Ind) Ltd March 2013  –  August 2013  (6 months) Hyderabad Heritage Foods (India) Limited, Hyderabad is a chain of retail stores in South India with operations in Hyderabad, Chennai and Bangalore with over 64 stores. KPIs include: \n \n• Spearheading various in house functions and initiatives. Formulating IT policies and procedures governing operations of the IT division, in line with the IT vision and mission statement \n• Managing the Networking and System Administration activities inclusive of Facility Management Service, File Server, Network Security System and Mail server Administration \n• Comparing and evaluating new software with the existing software and taking necessary measures for the implementation of new features in the existing software (SAP) \n• Managing Software Management services in-house, involving version control, change management and all licensing issues for purchased software applications \n• Interacting with senior level management as well as internal users for continuous improvement in business with new IT technologies and cost-effective solutions Program Manager Zensar Technologies Limited February 2006  –  October 2012  (6 years 9 months) Pune Area, India Have successfully handled IT Head and other senior IT assignments at Max Hypermarkets and Carrefour India including both pre launch and post launch activities. Successfully implemented POS and Store Solutions at clients end which include Spencer’s, Bilt, Spinach, VIP Bags and ITC among others.  \n \nClients have appreciated my no nonsense approach and solutions to tackle issues be it technical, administrative or personnel. Have successfully implemented innovative and practical solutions across various retail/non-retail functions to streamline processes and operations. These solutions have been very cost effective and time saving. Program Manager Zensar Technologies Limited February 2006  –  October 2012  (6 years 9 months) Pune Area, India Have successfully handled IT Head and other senior IT assignments at Max Hypermarkets and Carrefour India including both pre launch and post launch activities. Successfully implemented POS and Store Solutions at clients end which include Spencer’s, Bilt, Spinach, VIP Bags and ITC among others.  \n \nClients have appreciated my no nonsense approach and solutions to tackle issues be it technical, administrative or personnel. Have successfully implemented innovative and practical solutions across various retail/non-retail functions to streamline processes and operations. These solutions have been very cost effective and time saving. Project Manager Extentia Information Technology October 2000  –  October 2005  (5 years 1 month) Pune Area, India An offshore software development and consulting organization based in Pune, India, serving clients in Germany and North America. Extentia is committed to delivering high quality, cost-effective information technology solutions specializing in web portals for B2B and B2C sales. \n \nRESPONSIBILITIES \n- Project planning and management. \n- System design and consultation with clients  \n- Client Relations. \n- Recruitment and training of personnel.  \n- Adhering to time schedules and commitments.  \n- Optimizing performance with available resources. \n- Managing development operations. \n- Strict compliance of time schedules, commitments and quality standards. \n- Coordinating with various cross-functional teams. \n- Testing & providing implementation support of the developed software. Project Manager Extentia Information Technology October 2000  –  October 2005  (5 years 1 month) Pune Area, India An offshore software development and consulting organization based in Pune, India, serving clients in Germany and North America. Extentia is committed to delivering high quality, cost-effective information technology solutions specializing in web portals for B2B and B2C sales. \n \nRESPONSIBILITIES \n- Project planning and management. \n- System design and consultation with clients  \n- Client Relations. \n- Recruitment and training of personnel.  \n- Adhering to time schedules and commitments.  \n- Optimizing performance with available resources. \n- Managing development operations. \n- Strict compliance of time schedules, commitments and quality standards. \n- Coordinating with various cross-functional teams. \n- Testing & providing implementation support of the developed software. Regional Manager Operations KesTech August 1993  –  September 2000  (7 years 2 months) Pune Area, India RESPONSIBILITIES \n- Project planning and management. \n- Organizing people and team management. \n- Recruitment and training of personnel.  \n- Adhering to time schedules and commitments.  \n- Optimizing performance with available resources. \n- Overall supervision of finance, administration, marketing and development operations. \n- Ensured strict compliance of time schedules, commitments and quality standards. \n- System design and consultation with clients. \n- Coordinating with onsite teams. \n- Testing & implementation of the developed software. Regional Manager Operations KesTech August 1993  –  September 2000  (7 years 2 months) Pune Area, India RESPONSIBILITIES \n- Project planning and management. \n- Organizing people and team management. \n- Recruitment and training of personnel.  \n- Adhering to time schedules and commitments.  \n- Optimizing performance with available resources. \n- Overall supervision of finance, administration, marketing and development operations. \n- Ensured strict compliance of time schedules, commitments and quality standards. \n- System design and consultation with clients. \n- Coordinating with onsite teams. \n- Testing & implementation of the developed software. Product Manager Data System Services November 1987  –  July 1993  (5 years 9 months) Pune A computer consultancy organization developing software for Indian and foreign clients, data processing and the manufacture and sale of power stabilizing equipment. (Development in COBOL, UNIFY / ACCELL, ORACLE) \n- Conducted System Studies at some of the leading industrial houses in Pune. \n- Developed packages for a wide range of clients including Front Office Management and Billing for Hotels, Restaurants, Hospitals, Army Canteens, etc. after detailed discussions with the relevant user-groups at Client’s end. Product Manager Data System Services November 1987  –  July 1993  (5 years 9 months) Pune A computer consultancy organization developing software for Indian and foreign clients, data processing and the manufacture and sale of power stabilizing equipment. (Development in COBOL, UNIFY / ACCELL, ORACLE) \n- Conducted System Studies at some of the leading industrial houses in Pune. \n- Developed packages for a wide range of clients including Front Office Management and Billing for Hotels, Restaurants, Hospitals, Army Canteens, etc. after detailed discussions with the relevant user-groups at Client’s end. Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Product Manager Data System Services 1987  –  1992  (5 years) Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Marathi Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Marathi Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Marathi Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Software Project... Requirements Analysis SDLC Program Management Pre-sales Project Planning Solution Architecture Business Process Business Analysis Team Management .NET ERP Integration Service Delivery... Project Management Business Intelligence Training CRM Management IT Operations Management Infrastructure... Change Management Leadership Consulting Retail Consultancy Agile Methodologies Vendor Management IT Strategy Product Management Operations Management Outsourcing Strategy Business Strategy Enterprise Software Retail Business Development See 21+     See less Skills  Software Project... Requirements Analysis SDLC Program Management Pre-sales Project Planning Solution Architecture Business Process Business Analysis Team Management .NET ERP Integration Service Delivery... Project Management Business Intelligence Training CRM Management IT Operations Management Infrastructure... Change Management Leadership Consulting Retail Consultancy Agile Methodologies Vendor Management IT Strategy Product Management Operations Management Outsourcing Strategy Business Strategy Enterprise Software Retail Business Development See 21+     See less Software Project... Requirements Analysis SDLC Program Management Pre-sales Project Planning Solution Architecture Business Process Business Analysis Team Management .NET ERP Integration Service Delivery... Project Management Business Intelligence Training CRM Management IT Operations Management Infrastructure... Change Management Leadership Consulting Retail Consultancy Agile Methodologies Vendor Management IT Strategy Product Management Operations Management Outsourcing Strategy Business Strategy Enterprise Software Retail Business Development See 21+     See less Software Project... Requirements Analysis SDLC Program Management Pre-sales Project Planning Solution Architecture Business Process Business Analysis Team Management .NET ERP Integration Service Delivery... Project Management Business Intelligence Training CRM Management IT Operations Management Infrastructure... Change Management Leadership Consulting Retail Consultancy Agile Methodologies Vendor Management IT Strategy Product Management Operations Management Outsourcing Strategy Business Strategy Enterprise Software Retail Business Development See 21+     See less Education MMM D Colege Bachelor of Science (B.Sc.),  Physics 1971  – 1976 Was a NCC Cadet. Passed B & C certificates and attained the rank of Senior Under Officer. Participated in Rifle Shooting championships, Republic Day Parades, Guard of Honor and security deployments. Central School, Guwahati Higher Secondary 1972,  Physics ,  Chemistry ,  Mathematics 1968  – 1972 MMM D Colege Bachelor of Science (B.Sc.),  Physics 1971  – 1976 Was a NCC Cadet. Passed B & C certificates and attained the rank of Senior Under Officer. Participated in Rifle Shooting championships, Republic Day Parades, Guard of Honor and security deployments. MMM D Colege Bachelor of Science (B.Sc.),  Physics 1971  – 1976 Was a NCC Cadet. Passed B & C certificates and attained the rank of Senior Under Officer. Participated in Rifle Shooting championships, Republic Day Parades, Guard of Honor and security deployments. MMM D Colege Bachelor of Science (B.Sc.),  Physics 1971  – 1976 Was a NCC Cadet. Passed B & C certificates and attained the rank of Senior Under Officer. Participated in Rifle Shooting championships, Republic Day Parades, Guard of Honor and security deployments. Central School, Guwahati Higher Secondary 1972,  Physics ,  Chemistry ,  Mathematics 1968  – 1972 Central School, Guwahati Higher Secondary 1972,  Physics ,  Chemistry ,  Mathematics 1968  – 1972 Central School, Guwahati Higher Secondary 1972,  Physics ,  Chemistry ,  Mathematics 1968  – 1972 ", "Summary I'm currently working as a .NET developer for InfoPlanIT, LLC; a business intelligence company. \n \nI have nearly 7 years of experience as a Product Manager in the .NET component market. I started at Data Dynamics, Ltd. and moved to GrapeCity when they acquired the company in 2009. I continued with the company through the name change to ComponentOne after they bought that company mid-2012.  \n \nSeeking a change, I left ComponentOne to become a software developer in early 2013. Summary I'm currently working as a .NET developer for InfoPlanIT, LLC; a business intelligence company. \n \nI have nearly 7 years of experience as a Product Manager in the .NET component market. I started at Data Dynamics, Ltd. and moved to GrapeCity when they acquired the company in 2009. I continued with the company through the name change to ComponentOne after they bought that company mid-2012.  \n \nSeeking a change, I left ComponentOne to become a software developer in early 2013. I'm currently working as a .NET developer for InfoPlanIT, LLC; a business intelligence company. \n \nI have nearly 7 years of experience as a Product Manager in the .NET component market. I started at Data Dynamics, Ltd. and moved to GrapeCity when they acquired the company in 2009. I continued with the company through the name change to ComponentOne after they bought that company mid-2012.  \n \nSeeking a change, I left ComponentOne to become a software developer in early 2013. I'm currently working as a .NET developer for InfoPlanIT, LLC; a business intelligence company. \n \nI have nearly 7 years of experience as a Product Manager in the .NET component market. I started at Data Dynamics, Ltd. and moved to GrapeCity when they acquired the company in 2009. I continued with the company through the name change to ComponentOne after they bought that company mid-2012.  \n \nSeeking a change, I left ComponentOne to become a software developer in early 2013. Experience Senior Developer/Consultant InfoPlanIT, LLC February 2013  – Present (2 years 7 months) At InfoPlanIT, I have created several reporting applications that integrate into our flagship Visual Analyzer product to offer out of the box report. This set of Windows Forms, console, and .NET class libraries allows our clients to create ad-hoc reports as well as \"canned\" reports. \n \nI have created websites for clients using technologies such as:  \nASP.NET MVC, jQuery, jQuery UI, jQuery Mobile, Zurb Foundation, EmberJS, d3, nv-d3, HighCharts and HighStock. Product Manager ComponentOne July 2012  –  February 2013  (8 months) Continued my duties as Product Manager for ActiveReports 7 and Data Dynamics Reports. Product Manager GrapeCity, inc. (US) December 2008  –  June 2012  (3 years 7 months) Continued my duties as the Product Manager for Data Dynamics Reports, GrapeCity ActiveAnalysis, and ActiveReports Developer 7. Wrote scripts and did on-camera work for product videos. Product Manager Data Dynamics, Ltd. March 2006  –  December 2008  (2 years 10 months) Working as a Product Manager at Data Dynamics I was responsible for scheduling releases, deciding when features were added, as well as coming up with the requirements for the teams. I started on Data Dynamics Reports and later took over the same role for Data Dynamics Analysis. Support Engineer Data Dynamics, Ltd. January 2006  –  February 2006  (2 months) I joined Data Dynamics to support ActiveReports for .NET. Service Technician Ironman, Inc April 2005  –  December 2005  (9 months) Provided IT services to several businesses in the mid-Michigan area. Senior Developer/Consultant InfoPlanIT, LLC February 2013  – Present (2 years 7 months) At InfoPlanIT, I have created several reporting applications that integrate into our flagship Visual Analyzer product to offer out of the box report. This set of Windows Forms, console, and .NET class libraries allows our clients to create ad-hoc reports as well as \"canned\" reports. \n \nI have created websites for clients using technologies such as:  \nASP.NET MVC, jQuery, jQuery UI, jQuery Mobile, Zurb Foundation, EmberJS, d3, nv-d3, HighCharts and HighStock. Senior Developer/Consultant InfoPlanIT, LLC February 2013  – Present (2 years 7 months) At InfoPlanIT, I have created several reporting applications that integrate into our flagship Visual Analyzer product to offer out of the box report. This set of Windows Forms, console, and .NET class libraries allows our clients to create ad-hoc reports as well as \"canned\" reports. \n \nI have created websites for clients using technologies such as:  \nASP.NET MVC, jQuery, jQuery UI, jQuery Mobile, Zurb Foundation, EmberJS, d3, nv-d3, HighCharts and HighStock. Product Manager ComponentOne July 2012  –  February 2013  (8 months) Continued my duties as Product Manager for ActiveReports 7 and Data Dynamics Reports. Product Manager ComponentOne July 2012  –  February 2013  (8 months) Continued my duties as Product Manager for ActiveReports 7 and Data Dynamics Reports. Product Manager GrapeCity, inc. (US) December 2008  –  June 2012  (3 years 7 months) Continued my duties as the Product Manager for Data Dynamics Reports, GrapeCity ActiveAnalysis, and ActiveReports Developer 7. Wrote scripts and did on-camera work for product videos. Product Manager GrapeCity, inc. (US) December 2008  –  June 2012  (3 years 7 months) Continued my duties as the Product Manager for Data Dynamics Reports, GrapeCity ActiveAnalysis, and ActiveReports Developer 7. Wrote scripts and did on-camera work for product videos. Product Manager Data Dynamics, Ltd. March 2006  –  December 2008  (2 years 10 months) Working as a Product Manager at Data Dynamics I was responsible for scheduling releases, deciding when features were added, as well as coming up with the requirements for the teams. I started on Data Dynamics Reports and later took over the same role for Data Dynamics Analysis. Product Manager Data Dynamics, Ltd. March 2006  –  December 2008  (2 years 10 months) Working as a Product Manager at Data Dynamics I was responsible for scheduling releases, deciding when features were added, as well as coming up with the requirements for the teams. I started on Data Dynamics Reports and later took over the same role for Data Dynamics Analysis. Support Engineer Data Dynamics, Ltd. January 2006  –  February 2006  (2 months) I joined Data Dynamics to support ActiveReports for .NET. Support Engineer Data Dynamics, Ltd. January 2006  –  February 2006  (2 months) I joined Data Dynamics to support ActiveReports for .NET. Service Technician Ironman, Inc April 2005  –  December 2005  (9 months) Provided IT services to several businesses in the mid-Michigan area. Service Technician Ironman, Inc April 2005  –  December 2005  (9 months) Provided IT services to several businesses in the mid-Michigan area. Skills .NET Requirements Analysis Agile Scrum NUnit C# Product Demonstration Technical Writing Product Management Public Speaking Screencasting Software Development ASP.NET Agile Methodologies XML Visual Studio SQL VB.NET SDLC Silverlight Web Applications T-SQL EmberJS JavaScript jQuery jQuery Mobile WinForms ASP.NET MVC Integration Business Intelligence Web Services WPF See 17+     See less Skills  .NET Requirements Analysis Agile Scrum NUnit C# Product Demonstration Technical Writing Product Management Public Speaking Screencasting Software Development ASP.NET Agile Methodologies XML Visual Studio SQL VB.NET SDLC Silverlight Web Applications T-SQL EmberJS JavaScript jQuery jQuery Mobile WinForms ASP.NET MVC Integration Business Intelligence Web Services WPF See 17+     See less .NET Requirements Analysis Agile Scrum NUnit C# Product Demonstration Technical Writing Product Management Public Speaking Screencasting Software Development ASP.NET Agile Methodologies XML Visual Studio SQL VB.NET SDLC Silverlight Web Applications T-SQL EmberJS JavaScript jQuery jQuery Mobile WinForms ASP.NET MVC Integration Business Intelligence Web Services WPF See 17+     See less .NET Requirements Analysis Agile Scrum NUnit C# Product Demonstration Technical Writing Product Management Public Speaking Screencasting Software Development ASP.NET Agile Methodologies XML Visual Studio SQL VB.NET SDLC Silverlight Web Applications T-SQL EmberJS JavaScript jQuery jQuery Mobile WinForms ASP.NET MVC Integration Business Intelligence Web Services WPF See 17+     See less Education Michigan Technological University Computer Science 1999  – 2001 I attended Michigan Tech for 2 and a half years before dropping out. I was working toward a bachelor's degree in computer science. Michigan Technological University Computer Science 1999  – 2001 I attended Michigan Tech for 2 and a half years before dropping out. I was working toward a bachelor's degree in computer science. Michigan Technological University Computer Science 1999  – 2001 I attended Michigan Tech for 2 and a half years before dropping out. I was working toward a bachelor's degree in computer science. Michigan Technological University Computer Science 1999  – 2001 I attended Michigan Tech for 2 and a half years before dropping out. I was working toward a bachelor's degree in computer science. ", "Summary A senior level marketing professional with wide ranging experience as a product and competitive marketing manager combined with broad experience as an industry analyst and product manager. Primary area of focus is data storage networking and retention products, including backup and recovery, deduplication, virtualization, and storage management.  \n \n- Widespread market research entailing thought leadership, competitive intelligence & positioning, validation, and recommendations. \n \n- Extensive focus on customer offering based on marketing strategy, messaging, roadmap, technical analysis, pricing, go-to-market launch, promotion, and end-of-life. \n \n- Strong analytical skills for managing projects from planning to completion as well as communicating globally to a wide range of internal and external audiences including sales force, engineering, management, training, alliance partners, and customers. \n \n- Passionate about interpersonal skills for developing cohesive partner relationships with all levels of product stakeholders to deliver and support commerce-worthy business-to-business products and services. \n \n- Excellent written, presentation, and communications skills for developing and communicating all product and project related material to both internal and external audiences. \n \nSpecialties: Data storage hardware & software, data protection,virtualization, data deduplication, Summary A senior level marketing professional with wide ranging experience as a product and competitive marketing manager combined with broad experience as an industry analyst and product manager. Primary area of focus is data storage networking and retention products, including backup and recovery, deduplication, virtualization, and storage management.  \n \n- Widespread market research entailing thought leadership, competitive intelligence & positioning, validation, and recommendations. \n \n- Extensive focus on customer offering based on marketing strategy, messaging, roadmap, technical analysis, pricing, go-to-market launch, promotion, and end-of-life. \n \n- Strong analytical skills for managing projects from planning to completion as well as communicating globally to a wide range of internal and external audiences including sales force, engineering, management, training, alliance partners, and customers. \n \n- Passionate about interpersonal skills for developing cohesive partner relationships with all levels of product stakeholders to deliver and support commerce-worthy business-to-business products and services. \n \n- Excellent written, presentation, and communications skills for developing and communicating all product and project related material to both internal and external audiences. \n \nSpecialties: Data storage hardware & software, data protection,virtualization, data deduplication, A senior level marketing professional with wide ranging experience as a product and competitive marketing manager combined with broad experience as an industry analyst and product manager. Primary area of focus is data storage networking and retention products, including backup and recovery, deduplication, virtualization, and storage management.  \n \n- Widespread market research entailing thought leadership, competitive intelligence & positioning, validation, and recommendations. \n \n- Extensive focus on customer offering based on marketing strategy, messaging, roadmap, technical analysis, pricing, go-to-market launch, promotion, and end-of-life. \n \n- Strong analytical skills for managing projects from planning to completion as well as communicating globally to a wide range of internal and external audiences including sales force, engineering, management, training, alliance partners, and customers. \n \n- Passionate about interpersonal skills for developing cohesive partner relationships with all levels of product stakeholders to deliver and support commerce-worthy business-to-business products and services. \n \n- Excellent written, presentation, and communications skills for developing and communicating all product and project related material to both internal and external audiences. \n \nSpecialties: Data storage hardware & software, data protection,virtualization, data deduplication, A senior level marketing professional with wide ranging experience as a product and competitive marketing manager combined with broad experience as an industry analyst and product manager. Primary area of focus is data storage networking and retention products, including backup and recovery, deduplication, virtualization, and storage management.  \n \n- Widespread market research entailing thought leadership, competitive intelligence & positioning, validation, and recommendations. \n \n- Extensive focus on customer offering based on marketing strategy, messaging, roadmap, technical analysis, pricing, go-to-market launch, promotion, and end-of-life. \n \n- Strong analytical skills for managing projects from planning to completion as well as communicating globally to a wide range of internal and external audiences including sales force, engineering, management, training, alliance partners, and customers. \n \n- Passionate about interpersonal skills for developing cohesive partner relationships with all levels of product stakeholders to deliver and support commerce-worthy business-to-business products and services. \n \n- Excellent written, presentation, and communications skills for developing and communicating all product and project related material to both internal and external audiences. \n \nSpecialties: Data storage hardware & software, data protection,virtualization, data deduplication, Skills Skills     ", "Experience Senior Product Manager, Data Platforms Yahoo April 2015  – Present (5 months) Sunnyvale, CA Product Manager, Data Platforms Yahoo December 2013  –  April 2015  (1 year 5 months) Sunnyvale, CA Data Solutions Engineer, Sr Yahoo! January 2008  –  December 2013  (6 years) Sunnyvale, CA Software Quality Assurance Engineer Billhighway - www.billhighway.com October 2005  –  December 2007  (2 years 3 months) Troy, MI Senior Product Manager, Data Platforms Yahoo April 2015  – Present (5 months) Sunnyvale, CA Senior Product Manager, Data Platforms Yahoo April 2015  – Present (5 months) Sunnyvale, CA Product Manager, Data Platforms Yahoo December 2013  –  April 2015  (1 year 5 months) Sunnyvale, CA Product Manager, Data Platforms Yahoo December 2013  –  April 2015  (1 year 5 months) Sunnyvale, CA Data Solutions Engineer, Sr Yahoo! January 2008  –  December 2013  (6 years) Sunnyvale, CA Data Solutions Engineer, Sr Yahoo! January 2008  –  December 2013  (6 years) Sunnyvale, CA Software Quality Assurance Engineer Billhighway - www.billhighway.com October 2005  –  December 2007  (2 years 3 months) Troy, MI Software Quality Assurance Engineer Billhighway - www.billhighway.com October 2005  –  December 2007  (2 years 3 months) Troy, MI Languages   Skills Agile Methodologies Data Mining Unix Business Intelligence Databases Web Services Web Applications Web Development Data Warehousing Testing Cloud Computing HTML JavaScript PHP Apache Apache Pig Hive Hadoop SQL MySQL Oracle Analytics Web Analytics Instrumentation Experimentation See 10+     See less Skills  Agile Methodologies Data Mining Unix Business Intelligence Databases Web Services Web Applications Web Development Data Warehousing Testing Cloud Computing HTML JavaScript PHP Apache Apache Pig Hive Hadoop SQL MySQL Oracle Analytics Web Analytics Instrumentation Experimentation See 10+     See less Agile Methodologies Data Mining Unix Business Intelligence Databases Web Services Web Applications Web Development Data Warehousing Testing Cloud Computing HTML JavaScript PHP Apache Apache Pig Hive Hadoop SQL MySQL Oracle Analytics Web Analytics Instrumentation Experimentation See 10+     See less Agile Methodologies Data Mining Unix Business Intelligence Databases Web Services Web Applications Web Development Data Warehousing Testing Cloud Computing HTML JavaScript PHP Apache Apache Pig Hive Hadoop SQL MySQL Oracle Analytics Web Analytics Instrumentation Experimentation See 10+     See less Education Oakland University 2006  – 2007 Macomb Community College Associate of Applied Science 2001  – 2005 Oakland University 2006  – 2007 Oakland University 2006  – 2007 Oakland University 2006  – 2007 Macomb Community College Associate of Applied Science 2001  – 2005 Macomb Community College Associate of Applied Science 2001  – 2005 Macomb Community College Associate of Applied Science 2001  – 2005 Honors & Awards 2014 Excellence Award Yahoo! February 2015 Received 2014 Yahoo! Excellent Award \nAchieved for being in the top 10% of the company based on performance, issued to recognize top talent.  Yahoo! Super Star - Team Award Yahoo! 2013 Our team was recognized by Yahoo! for our work on building the new redesigned Yahoo! Home Page.  Yahoo! Super Star - Team Award Yahoo! 2012 Our team was recognized by Yahoo! for our work on launching the Yahoo! Social Bar product, it's expedited roll out, and it's significant impact to lift social referral traffic to the Yahoo! network.  Yahoo! You Rock - Team Award Yahoo! November 2011 Our team was recognized by the Yahoo! product organization in Q4 2011 for our work on launching the Yahoo! Social Bar product, which become one of the most popular Facebook integrated Yahoo! social experiences.  2014 Excellence Award Yahoo! February 2015 Received 2014 Yahoo! Excellent Award \nAchieved for being in the top 10% of the company based on performance, issued to recognize top talent.  2014 Excellence Award Yahoo! February 2015 Received 2014 Yahoo! Excellent Award \nAchieved for being in the top 10% of the company based on performance, issued to recognize top talent.  2014 Excellence Award Yahoo! February 2015 Received 2014 Yahoo! Excellent Award \nAchieved for being in the top 10% of the company based on performance, issued to recognize top talent.  Yahoo! Super Star - Team Award Yahoo! 2013 Our team was recognized by Yahoo! for our work on building the new redesigned Yahoo! Home Page.  Yahoo! Super Star - Team Award Yahoo! 2013 Our team was recognized by Yahoo! for our work on building the new redesigned Yahoo! Home Page.  Yahoo! Super Star - Team Award Yahoo! 2013 Our team was recognized by Yahoo! for our work on building the new redesigned Yahoo! Home Page.  Yahoo! Super Star - Team Award Yahoo! 2012 Our team was recognized by Yahoo! for our work on launching the Yahoo! Social Bar product, it's expedited roll out, and it's significant impact to lift social referral traffic to the Yahoo! network.  Yahoo! Super Star - Team Award Yahoo! 2012 Our team was recognized by Yahoo! for our work on launching the Yahoo! Social Bar product, it's expedited roll out, and it's significant impact to lift social referral traffic to the Yahoo! network.  Yahoo! Super Star - Team Award Yahoo! 2012 Our team was recognized by Yahoo! for our work on launching the Yahoo! Social Bar product, it's expedited roll out, and it's significant impact to lift social referral traffic to the Yahoo! network.  Yahoo! You Rock - Team Award Yahoo! November 2011 Our team was recognized by the Yahoo! product organization in Q4 2011 for our work on launching the Yahoo! Social Bar product, which become one of the most popular Facebook integrated Yahoo! social experiences.  Yahoo! You Rock - Team Award Yahoo! November 2011 Our team was recognized by the Yahoo! product organization in Q4 2011 for our work on launching the Yahoo! Social Bar product, which become one of the most popular Facebook integrated Yahoo! social experiences.  Yahoo! You Rock - Team Award Yahoo! November 2011 Our team was recognized by the Yahoo! product organization in Q4 2011 for our work on launching the Yahoo! Social Bar product, which become one of the most popular Facebook integrated Yahoo! social experiences.  ", "Summary Specialties: Product Strategy & Roadmap Definition, Route to Market, Brand Management \n \nPragmatic Marketing Certified in Product Management/Marketing Summary Specialties: Product Strategy & Roadmap Definition, Route to Market, Brand Management \n \nPragmatic Marketing Certified in Product Management/Marketing Specialties: Product Strategy & Roadmap Definition, Route to Market, Brand Management \n \nPragmatic Marketing Certified in Product Management/Marketing Specialties: Product Strategy & Roadmap Definition, Route to Market, Brand Management \n \nPragmatic Marketing Certified in Product Management/Marketing Experience Product Manager, Data Protection (Endpoint Security) Intel Security February 2014  – Present (1 year 7 months) Brighton, United Kingdom Gartner Magic Quadrant : http://www.mcafee.com/uk/independent-reports/gartner-mq-mobile-data-protection.aspx Product Manager, Data Protection (Endpoint Security) Intel Security December 2012  –  January 2014  (1 year 2 months) Bangalore Associate Product Manager, Data Protection (Endpoint Security) McAfee June 2011  –  November 2012  (1 year 6 months) Bangalore Summer Intern - Sales GlaxoSmithKline April 2010  –  June 2010  (3 months) Chennai, Southern Regional HQ Focus on the OTC product portfolio: Brands ENO, Iodex & Crocin  \n– Measured impact of POS, distribution drives and discounting initiatives on Sales  \n– Conceived an implementation plan for promotions, devised a more effective Sales force model Software Engineer Cisco Systems July 2007  –  May 2009  (1 year 11 months) Bangalore Design, Implemention of software for Firewall hardware modules Product Manager, Data Protection (Endpoint Security) Intel Security February 2014  – Present (1 year 7 months) Brighton, United Kingdom Gartner Magic Quadrant : http://www.mcafee.com/uk/independent-reports/gartner-mq-mobile-data-protection.aspx Product Manager, Data Protection (Endpoint Security) Intel Security February 2014  – Present (1 year 7 months) Brighton, United Kingdom Gartner Magic Quadrant : http://www.mcafee.com/uk/independent-reports/gartner-mq-mobile-data-protection.aspx Product Manager, Data Protection (Endpoint Security) Intel Security December 2012  –  January 2014  (1 year 2 months) Bangalore Product Manager, Data Protection (Endpoint Security) Intel Security December 2012  –  January 2014  (1 year 2 months) Bangalore Associate Product Manager, Data Protection (Endpoint Security) McAfee June 2011  –  November 2012  (1 year 6 months) Bangalore Associate Product Manager, Data Protection (Endpoint Security) McAfee June 2011  –  November 2012  (1 year 6 months) Bangalore Summer Intern - Sales GlaxoSmithKline April 2010  –  June 2010  (3 months) Chennai, Southern Regional HQ Focus on the OTC product portfolio: Brands ENO, Iodex & Crocin  \n– Measured impact of POS, distribution drives and discounting initiatives on Sales  \n– Conceived an implementation plan for promotions, devised a more effective Sales force model Summer Intern - Sales GlaxoSmithKline April 2010  –  June 2010  (3 months) Chennai, Southern Regional HQ Focus on the OTC product portfolio: Brands ENO, Iodex & Crocin  \n– Measured impact of POS, distribution drives and discounting initiatives on Sales  \n– Conceived an implementation plan for promotions, devised a more effective Sales force model Software Engineer Cisco Systems July 2007  –  May 2009  (1 year 11 months) Bangalore Design, Implemention of software for Firewall hardware modules Software Engineer Cisco Systems July 2007  –  May 2009  (1 year 11 months) Bangalore Design, Implemention of software for Firewall hardware modules Skills Marketing Brand Management Competitive Analysis Product Management Pre-sales Business Analytics Sales Web Services Go-to-market Strategy Product Marketing Analytics Business Strategy Salesforce.com Vendor Management Partner Management E-commerce Business Development Product Lifecycle... Program Management Cross-functional Team... Team Management Start-ups Web Analytics Enterprise Software Sales Operations Requirements Analysis Management Consulting Marketing Management Business Analysis Pricing Strategy Business Intelligence Strategy Market Research Market Analysis CRM Competitive Intelligence Agile Methodologies Management Cloud Computing Product Development SaaS Software Project... Product Launch Mobile Applications Segmentation Marketing Strategy Channel Partners Consulting Telecommunications Solution Selling See 35+     See less Skills  Marketing Brand Management Competitive Analysis Product Management Pre-sales Business Analytics Sales Web Services Go-to-market Strategy Product Marketing Analytics Business Strategy Salesforce.com Vendor Management Partner Management E-commerce Business Development Product Lifecycle... Program Management Cross-functional Team... Team Management Start-ups Web Analytics Enterprise Software Sales Operations Requirements Analysis Management Consulting Marketing Management Business Analysis Pricing Strategy Business Intelligence Strategy Market Research Market Analysis CRM Competitive Intelligence Agile Methodologies Management Cloud Computing Product Development SaaS Software Project... Product Launch Mobile Applications Segmentation Marketing Strategy Channel Partners Consulting Telecommunications Solution Selling See 35+     See less Marketing Brand Management Competitive Analysis Product Management Pre-sales Business Analytics Sales Web Services Go-to-market Strategy Product Marketing Analytics Business Strategy Salesforce.com Vendor Management Partner Management E-commerce Business Development Product Lifecycle... Program Management Cross-functional Team... Team Management Start-ups Web Analytics Enterprise Software Sales Operations Requirements Analysis Management Consulting Marketing Management Business Analysis Pricing Strategy Business Intelligence Strategy Market Research Market Analysis CRM Competitive Intelligence Agile Methodologies Management Cloud Computing Product Development SaaS Software Project... Product Launch Mobile Applications Segmentation Marketing Strategy Channel Partners Consulting Telecommunications Solution Selling See 35+     See less Marketing Brand Management Competitive Analysis Product Management Pre-sales Business Analytics Sales Web Services Go-to-market Strategy Product Marketing Analytics Business Strategy Salesforce.com Vendor Management Partner Management E-commerce Business Development Product Lifecycle... Program Management Cross-functional Team... Team Management Start-ups Web Analytics Enterprise Software Sales Operations Requirements Analysis Management Consulting Marketing Management Business Analysis Pricing Strategy Business Intelligence Strategy Market Research Market Analysis CRM Competitive Intelligence Agile Methodologies Management Cloud Computing Product Development SaaS Software Project... Product Launch Mobile Applications Segmentation Marketing Strategy Channel Partners Consulting Telecommunications Solution Selling See 35+     See less Education Indian Institute of Management, Bangalore Post Graduate Diploma in Management (PGDM),  Management 2009  – 2011 Activities and Societies:  Elected Member ,  Academic Council ,  ’10-’11 ; Treasurer & Senior Co-ordinator ,  SPIC MACAY Chapter ,  ’09-’11 ; Editor ,  IIMB Knowledge Portal ,  ’09-’10 ; IIMB Cricket Team R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Electronics & Communication Activities and Societies:  Cultural Activity Team Indian Institute of Management, Bangalore Post Graduate Diploma in Management (PGDM),  Management 2009  – 2011 Activities and Societies:  Elected Member ,  Academic Council ,  ’10-’11 ; Treasurer & Senior Co-ordinator ,  SPIC MACAY Chapter ,  ’09-’11 ; Editor ,  IIMB Knowledge Portal ,  ’09-’10 ; IIMB Cricket Team Indian Institute of Management, Bangalore Post Graduate Diploma in Management (PGDM),  Management 2009  – 2011 Activities and Societies:  Elected Member ,  Academic Council ,  ’10-’11 ; Treasurer & Senior Co-ordinator ,  SPIC MACAY Chapter ,  ’09-’11 ; Editor ,  IIMB Knowledge Portal ,  ’09-’10 ; IIMB Cricket Team Indian Institute of Management, Bangalore Post Graduate Diploma in Management (PGDM),  Management 2009  – 2011 Activities and Societies:  Elected Member ,  Academic Council ,  ’10-’11 ; Treasurer & Senior Co-ordinator ,  SPIC MACAY Chapter ,  ’09-’11 ; Editor ,  IIMB Knowledge Portal ,  ’09-’10 ; IIMB Cricket Team R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Electronics & Communication Activities and Societies:  Cultural Activity Team R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Electronics & Communication Activities and Societies:  Cultural Activity Team R. V. College of Engineering, Bangalore Bachelor of Engineering (B.E.),  Electronics & Communication Activities and Societies:  Cultural Activity Team ", "Skills Business Intelligence Integration CRM Business Intelligence... Databases Requirements Analysis Data Warehousing Business Process Solution Selling Business Analysis Analytics Oracle Professional Services Project Management Skills  Business Intelligence Integration CRM Business Intelligence... Databases Requirements Analysis Data Warehousing Business Process Solution Selling Business Analysis Analytics Oracle Professional Services Project Management Business Intelligence Integration CRM Business Intelligence... Databases Requirements Analysis Data Warehousing Business Process Solution Selling Business Analysis Analytics Oracle Professional Services Project Management Business Intelligence Integration CRM Business Intelligence... Databases Requirements Analysis Data Warehousing Business Process Solution Selling Business Analysis Analytics Oracle Professional Services Project Management ", "Summary I like helping people make well informed decisions based on data. In order to do that, I have specialized in systems that clean, transform, aggregate, mine, and visualize data. \n \nI'm also a semi-professional photographer, you can check out my work here: http://500px.com/JeffFerris Summary I like helping people make well informed decisions based on data. In order to do that, I have specialized in systems that clean, transform, aggregate, mine, and visualize data. \n \nI'm also a semi-professional photographer, you can check out my work here: http://500px.com/JeffFerris I like helping people make well informed decisions based on data. In order to do that, I have specialized in systems that clean, transform, aggregate, mine, and visualize data. \n \nI'm also a semi-professional photographer, you can check out my work here: http://500px.com/JeffFerris I like helping people make well informed decisions based on data. In order to do that, I have specialized in systems that clean, transform, aggregate, mine, and visualize data. \n \nI'm also a semi-professional photographer, you can check out my work here: http://500px.com/JeffFerris Skills Analytics Business Intelligence Business Analytics Data Analysis SQL Agile Methodologies Big Data Tableau Integration Web Analytics Mobile Applications ETL Data Modeling Data Mining Data Warehousing Enterprise Software Hive Hadoop Analysis Data Quality Data Migration Business Services E-commerce Databases Vertica See 10+     See less Skills  Analytics Business Intelligence Business Analytics Data Analysis SQL Agile Methodologies Big Data Tableau Integration Web Analytics Mobile Applications ETL Data Modeling Data Mining Data Warehousing Enterprise Software Hive Hadoop Analysis Data Quality Data Migration Business Services E-commerce Databases Vertica See 10+     See less Analytics Business Intelligence Business Analytics Data Analysis SQL Agile Methodologies Big Data Tableau Integration Web Analytics Mobile Applications ETL Data Modeling Data Mining Data Warehousing Enterprise Software Hive Hadoop Analysis Data Quality Data Migration Business Services E-commerce Databases Vertica See 10+     See less Analytics Business Intelligence Business Analytics Data Analysis SQL Agile Methodologies Big Data Tableau Integration Web Analytics Mobile Applications ETL Data Modeling Data Mining Data Warehousing Enterprise Software Hive Hadoop Analysis Data Quality Data Migration Business Services E-commerce Databases Vertica See 10+     See less ", "Languages Swedish English Swedish English Swedish English Skills Data Mining Analytics Segmentation SAS Statistics Predictive Analytics Customer Intelligence Business Analytics Predictive Modeling Data Analysis CRM Business Intelligence Database Marketing Pre-sales Data Warehousing Basel II Telecommunications Customer Analysis Statistical Modeling SAS programming Analysis Data Quality Time Series Analysis Strategy Business Analysis Business Development See 11+     See less Skills  Data Mining Analytics Segmentation SAS Statistics Predictive Analytics Customer Intelligence Business Analytics Predictive Modeling Data Analysis CRM Business Intelligence Database Marketing Pre-sales Data Warehousing Basel II Telecommunications Customer Analysis Statistical Modeling SAS programming Analysis Data Quality Time Series Analysis Strategy Business Analysis Business Development See 11+     See less Data Mining Analytics Segmentation SAS Statistics Predictive Analytics Customer Intelligence Business Analytics Predictive Modeling Data Analysis CRM Business Intelligence Database Marketing Pre-sales Data Warehousing Basel II Telecommunications Customer Analysis Statistical Modeling SAS programming Analysis Data Quality Time Series Analysis Strategy Business Analysis Business Development See 11+     See less Data Mining Analytics Segmentation SAS Statistics Predictive Analytics Customer Intelligence Business Analytics Predictive Modeling Data Analysis CRM Business Intelligence Database Marketing Pre-sales Data Warehousing Basel II Telecommunications Customer Analysis Statistical Modeling SAS programming Analysis Data Quality Time Series Analysis Strategy Business Analysis Business Development See 11+     See less ", "Experience Senior Product Manager - Data Warehouse cmERDC July 2010  – Present (5 years 2 months) St Paul, MN Product Visionary: Define product strategy and direction by continually assessing the needs of customers, market trends and competitive opportunities and threats. Define both long term strategy and short term plans to achieve the product vision and deliver business results. \n \nRoadmap Design and Development: Successful execution of product lifecycle processes from concept to launch through profitable ongoing implementation. Determine value-based prioritization of product development initiatives to ensure maximum return on investment (ROI), and market-driven alignment. Deliver innovation in features, usability and product performance insuring customer satisfaction. Internal and external authority and advocate for data warehouse solution. \n \nSales and Marketing: Successful design and execution of sales and marketing strategy for data warehouse software and associated professional services (technical, consulting and training). Product evangelist. Achieved ROI goals in less than half expected time frame. Leading continued customer growth making product one of the most successful and most profitable in history of company.  \n \nTraining: Authored curriculum content and delivered training including customized workshops. Product Manager - Data Warehouse cmERDC July 2006  –  June 2010  (4 years) Greater Minneapolis-St. Paul Area Product Visionary \n \nRoadmap Design and Development  \n \nSales and Marketing: Successful design and execution of sales and marketing strategy for data warehouse software and associated professional services (technical, consulting and training). Product evangelist. Achieved ROI goals in less than half expected time frame. Leading continued customer growth making product one of the most successful and most profitable in history of company.  \n \nTraining Project Manager - Data Warehouse cmERDC January 2005  –  April 2006  (1 year 4 months) Greater Minneapolis-St. Paul Area Project management, implementation management, sales and marketing, product design for data warehouse software solution. Senior Programmer/Business Analyst cmERDC July 2003  –  July 2004  (1 year 1 month) Greater Minneapolis-St. Paul Area Business requirements identifcation, program design and Mircosoft Analysis Services programming for data warehouse software solution. Coordinator - Student Information Systems and Technology Integrationsist Mounds View Public Schools September 1997  –  July 2003  (5 years 11 months) Arden Hills, MN Data analysis, design, programming and reporting across multiple database systems and applications to support all users - classroom teachers, specialists, nurses, counselors, deans, principals, legal counsel and superintendents. Senior System Analyst Securian Financial Group April 1987  –  September 1997  (10 years 6 months) Analysis, design and programming enterprise solutions for Payroll and Benefits Departments. Certified PeopleSoft consultant. Senior Product Manager - Data Warehouse cmERDC July 2010  – Present (5 years 2 months) St Paul, MN Product Visionary: Define product strategy and direction by continually assessing the needs of customers, market trends and competitive opportunities and threats. Define both long term strategy and short term plans to achieve the product vision and deliver business results. \n \nRoadmap Design and Development: Successful execution of product lifecycle processes from concept to launch through profitable ongoing implementation. Determine value-based prioritization of product development initiatives to ensure maximum return on investment (ROI), and market-driven alignment. Deliver innovation in features, usability and product performance insuring customer satisfaction. Internal and external authority and advocate for data warehouse solution. \n \nSales and Marketing: Successful design and execution of sales and marketing strategy for data warehouse software and associated professional services (technical, consulting and training). Product evangelist. Achieved ROI goals in less than half expected time frame. Leading continued customer growth making product one of the most successful and most profitable in history of company.  \n \nTraining: Authored curriculum content and delivered training including customized workshops. Senior Product Manager - Data Warehouse cmERDC July 2010  – Present (5 years 2 months) St Paul, MN Product Visionary: Define product strategy and direction by continually assessing the needs of customers, market trends and competitive opportunities and threats. Define both long term strategy and short term plans to achieve the product vision and deliver business results. \n \nRoadmap Design and Development: Successful execution of product lifecycle processes from concept to launch through profitable ongoing implementation. Determine value-based prioritization of product development initiatives to ensure maximum return on investment (ROI), and market-driven alignment. Deliver innovation in features, usability and product performance insuring customer satisfaction. Internal and external authority and advocate for data warehouse solution. \n \nSales and Marketing: Successful design and execution of sales and marketing strategy for data warehouse software and associated professional services (technical, consulting and training). Product evangelist. Achieved ROI goals in less than half expected time frame. Leading continued customer growth making product one of the most successful and most profitable in history of company.  \n \nTraining: Authored curriculum content and delivered training including customized workshops. Product Manager - Data Warehouse cmERDC July 2006  –  June 2010  (4 years) Greater Minneapolis-St. Paul Area Product Visionary \n \nRoadmap Design and Development  \n \nSales and Marketing: Successful design and execution of sales and marketing strategy for data warehouse software and associated professional services (technical, consulting and training). Product evangelist. Achieved ROI goals in less than half expected time frame. Leading continued customer growth making product one of the most successful and most profitable in history of company.  \n \nTraining Product Manager - Data Warehouse cmERDC July 2006  –  June 2010  (4 years) Greater Minneapolis-St. Paul Area Product Visionary \n \nRoadmap Design and Development  \n \nSales and Marketing: Successful design and execution of sales and marketing strategy for data warehouse software and associated professional services (technical, consulting and training). Product evangelist. Achieved ROI goals in less than half expected time frame. Leading continued customer growth making product one of the most successful and most profitable in history of company.  \n \nTraining Project Manager - Data Warehouse cmERDC January 2005  –  April 2006  (1 year 4 months) Greater Minneapolis-St. Paul Area Project management, implementation management, sales and marketing, product design for data warehouse software solution. Project Manager - Data Warehouse cmERDC January 2005  –  April 2006  (1 year 4 months) Greater Minneapolis-St. Paul Area Project management, implementation management, sales and marketing, product design for data warehouse software solution. Senior Programmer/Business Analyst cmERDC July 2003  –  July 2004  (1 year 1 month) Greater Minneapolis-St. Paul Area Business requirements identifcation, program design and Mircosoft Analysis Services programming for data warehouse software solution. Senior Programmer/Business Analyst cmERDC July 2003  –  July 2004  (1 year 1 month) Greater Minneapolis-St. Paul Area Business requirements identifcation, program design and Mircosoft Analysis Services programming for data warehouse software solution. Coordinator - Student Information Systems and Technology Integrationsist Mounds View Public Schools September 1997  –  July 2003  (5 years 11 months) Arden Hills, MN Data analysis, design, programming and reporting across multiple database systems and applications to support all users - classroom teachers, specialists, nurses, counselors, deans, principals, legal counsel and superintendents. Coordinator - Student Information Systems and Technology Integrationsist Mounds View Public Schools September 1997  –  July 2003  (5 years 11 months) Arden Hills, MN Data analysis, design, programming and reporting across multiple database systems and applications to support all users - classroom teachers, specialists, nurses, counselors, deans, principals, legal counsel and superintendents. Senior System Analyst Securian Financial Group April 1987  –  September 1997  (10 years 6 months) Analysis, design and programming enterprise solutions for Payroll and Benefits Departments. Certified PeopleSoft consultant. Senior System Analyst Securian Financial Group April 1987  –  September 1997  (10 years 6 months) Analysis, design and programming enterprise solutions for Payroll and Benefits Departments. Certified PeopleSoft consultant. Education St Mary's University - Twin Cities M.S.,  Research Analysis 2007  – 2009 GPA 4.0 of 4.0 University of Minnesota - Institute of Technology B.S.,  Computer Science 1985  – 1987 GPA 3.87 of 4.00 Activities and Societies:  Peer Tutor - Math ,  Sciences ,  Computer Science\nStudent Advisor - Computer Science\nFuturist Club St Mary's University - Twin Cities M.S.,  Research Analysis 2007  – 2009 GPA 4.0 of 4.0 St Mary's University - Twin Cities M.S.,  Research Analysis 2007  – 2009 GPA 4.0 of 4.0 St Mary's University - Twin Cities M.S.,  Research Analysis 2007  – 2009 GPA 4.0 of 4.0 University of Minnesota - Institute of Technology B.S.,  Computer Science 1985  – 1987 GPA 3.87 of 4.00 Activities and Societies:  Peer Tutor - Math ,  Sciences ,  Computer Science\nStudent Advisor - Computer Science\nFuturist Club University of Minnesota - Institute of Technology B.S.,  Computer Science 1985  – 1987 GPA 3.87 of 4.00 Activities and Societies:  Peer Tutor - Math ,  Sciences ,  Computer Science\nStudent Advisor - Computer Science\nFuturist Club University of Minnesota - Institute of Technology B.S.,  Computer Science 1985  – 1987 GPA 3.87 of 4.00 Activities and Societies:  Peer Tutor - Math ,  Sciences ,  Computer Science\nStudent Advisor - Computer Science\nFuturist Club ", "Summary A senior product manager with a proven record of accomplishment spanning over 14 years. Experienced in product management in the Telecommunications industry, delivered business growth in the Transportation and Electric Engineering industries with market leaders. Demonstrated the ability to manage virtual teams located in various countries, bringing successful products to market armed with passion, expertise and perseverance. Delivered excellent results in challenging contexts in a number of roles, developing and adapting strategies and staying focused on the end-goal. Communicate in various languages and across cultures, at ease with internal stakeholders as well as with customers and the Media. \n \nSpecialties: Product Strategy, Product Management, Product marketing, Consumer Insights, User Experience Summary A senior product manager with a proven record of accomplishment spanning over 14 years. Experienced in product management in the Telecommunications industry, delivered business growth in the Transportation and Electric Engineering industries with market leaders. Demonstrated the ability to manage virtual teams located in various countries, bringing successful products to market armed with passion, expertise and perseverance. Delivered excellent results in challenging contexts in a number of roles, developing and adapting strategies and staying focused on the end-goal. Communicate in various languages and across cultures, at ease with internal stakeholders as well as with customers and the Media. \n \nSpecialties: Product Strategy, Product Management, Product marketing, Consumer Insights, User Experience A senior product manager with a proven record of accomplishment spanning over 14 years. Experienced in product management in the Telecommunications industry, delivered business growth in the Transportation and Electric Engineering industries with market leaders. Demonstrated the ability to manage virtual teams located in various countries, bringing successful products to market armed with passion, expertise and perseverance. Delivered excellent results in challenging contexts in a number of roles, developing and adapting strategies and staying focused on the end-goal. Communicate in various languages and across cultures, at ease with internal stakeholders as well as with customers and the Media. \n \nSpecialties: Product Strategy, Product Management, Product marketing, Consumer Insights, User Experience A senior product manager with a proven record of accomplishment spanning over 14 years. Experienced in product management in the Telecommunications industry, delivered business growth in the Transportation and Electric Engineering industries with market leaders. Demonstrated the ability to manage virtual teams located in various countries, bringing successful products to market armed with passion, expertise and perseverance. Delivered excellent results in challenging contexts in a number of roles, developing and adapting strategies and staying focused on the end-goal. Communicate in various languages and across cultures, at ease with internal stakeholders as well as with customers and the Media. \n \nSpecialties: Product Strategy, Product Management, Product marketing, Consumer Insights, User Experience Languages French English German French English German French English German Skills Product Management Consumer Insights People Management Product Strategy Music Technology Audio Mobile Technology Mobile Devices Mobile Services Global Deployment Media Interviews B2B services Contract Negotiation Contract Management Strategic Consulting Consulting User Experience Product Marketing Mobile Communications Management Customer Insight B2B Sound Cross-functional Team... Telecommunications Virtual Teams Product Development Strategy Business Development Product Launch Go-to-market Strategy Managed Services Strategic Partnerships Leadership Mobile Applications Wireless Product Lifecycle... Competitive Analysis Software Development Mobile Internet SaaS Consumer Electronics Consumer Insight See 28+     See less Skills  Product Management Consumer Insights People Management Product Strategy Music Technology Audio Mobile Technology Mobile Devices Mobile Services Global Deployment Media Interviews B2B services Contract Negotiation Contract Management Strategic Consulting Consulting User Experience Product Marketing Mobile Communications Management Customer Insight B2B Sound Cross-functional Team... Telecommunications Virtual Teams Product Development Strategy Business Development Product Launch Go-to-market Strategy Managed Services Strategic Partnerships Leadership Mobile Applications Wireless Product Lifecycle... Competitive Analysis Software Development Mobile Internet SaaS Consumer Electronics Consumer Insight See 28+     See less Product Management Consumer Insights People Management Product Strategy Music Technology Audio Mobile Technology Mobile Devices Mobile Services Global Deployment Media Interviews B2B services Contract Negotiation Contract Management Strategic Consulting Consulting User Experience Product Marketing Mobile Communications Management Customer Insight B2B Sound Cross-functional Team... Telecommunications Virtual Teams Product Development Strategy Business Development Product Launch Go-to-market Strategy Managed Services Strategic Partnerships Leadership Mobile Applications Wireless Product Lifecycle... Competitive Analysis Software Development Mobile Internet SaaS Consumer Electronics Consumer Insight See 28+     See less Product Management Consumer Insights People Management Product Strategy Music Technology Audio Mobile Technology Mobile Devices Mobile Services Global Deployment Media Interviews B2B services Contract Negotiation Contract Management Strategic Consulting Consulting User Experience Product Marketing Mobile Communications Management Customer Insight B2B Sound Cross-functional Team... Telecommunications Virtual Teams Product Development Strategy Business Development Product Launch Go-to-market Strategy Managed Services Strategic Partnerships Leadership Mobile Applications Wireless Product Lifecycle... Competitive Analysis Software Development Mobile Internet SaaS Consumer Electronics Consumer Insight See 28+     See less Education IMD MBA,  IMD Lausanne, Switzerland 1998  – 1998 ENSEA MSc,  Electronics , Digital Signal Processing 1985  – 1989 IMD MBA,  IMD Lausanne, Switzerland 1998  – 1998 IMD MBA,  IMD Lausanne, Switzerland 1998  – 1998 IMD MBA,  IMD Lausanne, Switzerland 1998  – 1998 ENSEA MSc,  Electronics , Digital Signal Processing 1985  – 1989 ENSEA MSc,  Electronics , Digital Signal Processing 1985  – 1989 ENSEA MSc,  Electronics , Digital Signal Processing 1985  – 1989 Honors & Awards Product Award Nokia Mobile Phones, Live Category June 2006 Product Award Nokia Mobile Phones, Live Category June 2006 Product Award Nokia Mobile Phones, Live Category June 2006 Product Award Nokia Mobile Phones, Live Category June 2006 "]}