{"position": "Program Director", "company": "Google", "profiles": ["Languages Italian English Italian English Italian English Skills Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less Skills  Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less ", "Skills Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Skills  Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less ", "Summary Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Summary Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Experience Sr. Project/Program Manager - Yahoo Search Products Yahoo April 2015  – Present (5 months) Sunnyvale, California Currently project managing product portfolio and service delivery for the Yahoo Search organization. Project Manager Yahoo May 2013  –  March 2015  (1 year 11 months) Sunnyvale, California I am currently managing software implementation projects to improve efficiencies for Production Operation employees. Using Agile methodologies, I am partnering alongside Engineers & Developers to deploy a machine learning solution which manages alert volume with the goals of decreasing time to detect and resolving events at a faster rate. I am also driving a project to implement an enterprise application to track & measure business continuity planning tests and results. Program Manager - Help Desk Institute (HDI) HDI Silicon Valley September 2008  –  March 2014  (5 years 7 months) Silicon Valley HDI Silicon Valley is a non-profit chapter of the HDI national organization; an industry leader in the distribution of IT best practices. As the VP of Program Management, I work with key contacts to facilitate meetings & events for IT professionals to come together to discuss common industry challenges, share ideas and build a network of contacts. Through connecting with the HDI organization, IT professionals can be connected with a wide array of career advancing opportunities across the Silicon Valley area, resulting in measurable career development. Outside of monthly Chapter IT meetings, other events I organize within SVHDI consist of Job Fairs, Resume & Interview workshops, Student meetings and key initiatives that benefit the communities of Silicon Valley. Business Operations Manager - Production Operations Yahoo! February 2011  –  May 2013  (2 years 4 months) Sunnyvale, CA Led cross functional team efforts towards implementing industry standard best practices, with the goal of improving operational maturity levels from a reactive model to a place of optimal business partnership. Using SMART goal planning, I was tasked with moving company application & server monitoring alerts to a centralized team (Tier 1), while identifying automation & self healing opportunities to reduce repetitive incidents. Documenting service management lifecycle proposals, I coordinated with vendor selection committees to review ITSM solutions, which resulted in the removal of fragmented tools & processes. The program provided significant cost savings and gave ompany engineers increased capacity to spend time on innovating for the future. Service Delivery Manager Yahoo! February 2011  –  February 2012  (1 year 1 month) Santa Clara, CA In February 2011, I co-founded and successfully launched a Quality of Service team, which was based on ITIL v3 continual service improvement best practices. After outlining the team vision and methodology, I mentored a talented and diverse group of specialists across IT operations, who were focused on a wide array of globally focused initiatives. Through the implementation the Quality of Service team, we were able to centralize the management of process improvement initiatives across Employee Support, increasing capacity across support teams, introducing transparency and removing duplication of work. Using SMART goal planning, I trained the specialists how to incorporate proven industry standard best practices into the management of initiatives, which led to the successful completion of multiple outstanding projects. Business Operations Manager - IT Yahoo December 2009  –  February 2011  (1 year 3 months) Santa Clara, California Measured the return on investment for all projects managed across the employee support organization, presenting highlights, identifying obstacles and developing quarterly business strategies. Led an industry standard maturity assessment, which allowed for focused operational improvement plans to be devised and executed upon. Coordinated quarterly and annual OPEX and CAPEX financial planning, leading executive initiatives to identify headcount spend year over year, as well as reviewing software & hardware costs to eliminate unnecessary maintenance, professional service and licensing costs. Global IT Relations Lead Yahoo! October 2008  –  December 2009  (1 year 3 months) Santa Clara, CA Partnered with Regional IT Managers across business units in Europe, India and Asia to standardize operational procedures with the goal of offering consistent service delivery levels 24/7. Some efforts consisted of implementing Live Chat, allowing for bilingual support, introducing marketing campaigns to drive service requests from Tier 2 to Tier 1 and assisting with the M&A for Maktoob, which is the Middle East largest internet search company. Working closely with Managers, concentrated efforts centered around socializing and driving support requests to a Global Service Desk team, using streamlined processes, reducing operational costs and increasing the capacity of Tier 2 teams. Global Service Desk Supervisor Yahoo! April 2007  –  October 2008  (1 year 7 months) Manhattan, NY Managed Global Service Desk Support Technicians Onsite, Remotely and Internationally, delivering on aggressive goals to achieve 90% FCR, Largely focusing on continual and sustainable service improvement, I partnered with regional support supervisors and senior management to introduce industry best practices, mature processes and streamline workflow efficiencies.\tIncorporated India region into Service Desk, consolidating IT support under a single Global Service Desk and assisted in the introduction of targeted SLA's, which allowed for accurate performance baselines. Service Desk Technician Sony Music Entertainment July 2006  –  April 2007  (10 months) Manhattan, NY Provided quality and timely technical support to entertainment teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted in the introduction of industry standard operating best practices, implementing a knowledge database & documenting operational procedures, workflows and training material. Service Desk Technician Pfizer Pharmaceuticals April 2006  –  June 2006  (3 months) Parsippany, NJ Provided quality and timely technical support to pharmaceutical teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted with performing root cause analysis, providing workarounds and identifying long term solutions - often leading to incident reduction. Technical Account Supervisor C3i January 2003  –  October 2005  (2 years 10 months) Morristown, NY Supervised technical support teams based on SLA's with Johnson & Johnson (Vistakon), ensuring consistent service delivery, timely problem resolution, and quality customer satisfaction. I consistently performed trend/root cause analysis to identify common issues reported to the Service Desk, with the goals of reducing repetitive incidents and identifying accurate knowledge, for support teams. Partnered with training department to deliver industry standard customer service best practices and required technical operational & escalation procedures, which were measured through monthly assessments. Junior Business Analyst JDS Uniphase April 2000  –  June 2002  (2 years 3 months) Asbury, NJ Deployed Oracle Customer Relationship Management software throughout the the Sales Force. Partnering closely with Oracle consultants, I drove data conversion efforts - moving the Sales department from a flat file system, assisted consultants in the configuration of back-end applications and documented User Acceptance Testing requirements & results. I also performed post deployment validation, managed Tier 1 application support and provided reporting. Sr. Project/Program Manager - Yahoo Search Products Yahoo April 2015  – Present (5 months) Sunnyvale, California Currently project managing product portfolio and service delivery for the Yahoo Search organization. Sr. Project/Program Manager - Yahoo Search Products Yahoo April 2015  – Present (5 months) Sunnyvale, California Currently project managing product portfolio and service delivery for the Yahoo Search organization. Project Manager Yahoo May 2013  –  March 2015  (1 year 11 months) Sunnyvale, California I am currently managing software implementation projects to improve efficiencies for Production Operation employees. Using Agile methodologies, I am partnering alongside Engineers & Developers to deploy a machine learning solution which manages alert volume with the goals of decreasing time to detect and resolving events at a faster rate. I am also driving a project to implement an enterprise application to track & measure business continuity planning tests and results. Project Manager Yahoo May 2013  –  March 2015  (1 year 11 months) Sunnyvale, California I am currently managing software implementation projects to improve efficiencies for Production Operation employees. Using Agile methodologies, I am partnering alongside Engineers & Developers to deploy a machine learning solution which manages alert volume with the goals of decreasing time to detect and resolving events at a faster rate. I am also driving a project to implement an enterprise application to track & measure business continuity planning tests and results. Program Manager - Help Desk Institute (HDI) HDI Silicon Valley September 2008  –  March 2014  (5 years 7 months) Silicon Valley HDI Silicon Valley is a non-profit chapter of the HDI national organization; an industry leader in the distribution of IT best practices. As the VP of Program Management, I work with key contacts to facilitate meetings & events for IT professionals to come together to discuss common industry challenges, share ideas and build a network of contacts. Through connecting with the HDI organization, IT professionals can be connected with a wide array of career advancing opportunities across the Silicon Valley area, resulting in measurable career development. Outside of monthly Chapter IT meetings, other events I organize within SVHDI consist of Job Fairs, Resume & Interview workshops, Student meetings and key initiatives that benefit the communities of Silicon Valley. Program Manager - Help Desk Institute (HDI) HDI Silicon Valley September 2008  –  March 2014  (5 years 7 months) Silicon Valley HDI Silicon Valley is a non-profit chapter of the HDI national organization; an industry leader in the distribution of IT best practices. As the VP of Program Management, I work with key contacts to facilitate meetings & events for IT professionals to come together to discuss common industry challenges, share ideas and build a network of contacts. Through connecting with the HDI organization, IT professionals can be connected with a wide array of career advancing opportunities across the Silicon Valley area, resulting in measurable career development. Outside of monthly Chapter IT meetings, other events I organize within SVHDI consist of Job Fairs, Resume & Interview workshops, Student meetings and key initiatives that benefit the communities of Silicon Valley. Business Operations Manager - Production Operations Yahoo! February 2011  –  May 2013  (2 years 4 months) Sunnyvale, CA Led cross functional team efforts towards implementing industry standard best practices, with the goal of improving operational maturity levels from a reactive model to a place of optimal business partnership. Using SMART goal planning, I was tasked with moving company application & server monitoring alerts to a centralized team (Tier 1), while identifying automation & self healing opportunities to reduce repetitive incidents. Documenting service management lifecycle proposals, I coordinated with vendor selection committees to review ITSM solutions, which resulted in the removal of fragmented tools & processes. The program provided significant cost savings and gave ompany engineers increased capacity to spend time on innovating for the future. Business Operations Manager - Production Operations Yahoo! February 2011  –  May 2013  (2 years 4 months) Sunnyvale, CA Led cross functional team efforts towards implementing industry standard best practices, with the goal of improving operational maturity levels from a reactive model to a place of optimal business partnership. Using SMART goal planning, I was tasked with moving company application & server monitoring alerts to a centralized team (Tier 1), while identifying automation & self healing opportunities to reduce repetitive incidents. Documenting service management lifecycle proposals, I coordinated with vendor selection committees to review ITSM solutions, which resulted in the removal of fragmented tools & processes. The program provided significant cost savings and gave ompany engineers increased capacity to spend time on innovating for the future. Service Delivery Manager Yahoo! February 2011  –  February 2012  (1 year 1 month) Santa Clara, CA In February 2011, I co-founded and successfully launched a Quality of Service team, which was based on ITIL v3 continual service improvement best practices. After outlining the team vision and methodology, I mentored a talented and diverse group of specialists across IT operations, who were focused on a wide array of globally focused initiatives. Through the implementation the Quality of Service team, we were able to centralize the management of process improvement initiatives across Employee Support, increasing capacity across support teams, introducing transparency and removing duplication of work. Using SMART goal planning, I trained the specialists how to incorporate proven industry standard best practices into the management of initiatives, which led to the successful completion of multiple outstanding projects. Service Delivery Manager Yahoo! February 2011  –  February 2012  (1 year 1 month) Santa Clara, CA In February 2011, I co-founded and successfully launched a Quality of Service team, which was based on ITIL v3 continual service improvement best practices. After outlining the team vision and methodology, I mentored a talented and diverse group of specialists across IT operations, who were focused on a wide array of globally focused initiatives. Through the implementation the Quality of Service team, we were able to centralize the management of process improvement initiatives across Employee Support, increasing capacity across support teams, introducing transparency and removing duplication of work. Using SMART goal planning, I trained the specialists how to incorporate proven industry standard best practices into the management of initiatives, which led to the successful completion of multiple outstanding projects. Business Operations Manager - IT Yahoo December 2009  –  February 2011  (1 year 3 months) Santa Clara, California Measured the return on investment for all projects managed across the employee support organization, presenting highlights, identifying obstacles and developing quarterly business strategies. Led an industry standard maturity assessment, which allowed for focused operational improvement plans to be devised and executed upon. Coordinated quarterly and annual OPEX and CAPEX financial planning, leading executive initiatives to identify headcount spend year over year, as well as reviewing software & hardware costs to eliminate unnecessary maintenance, professional service and licensing costs. Business Operations Manager - IT Yahoo December 2009  –  February 2011  (1 year 3 months) Santa Clara, California Measured the return on investment for all projects managed across the employee support organization, presenting highlights, identifying obstacles and developing quarterly business strategies. Led an industry standard maturity assessment, which allowed for focused operational improvement plans to be devised and executed upon. Coordinated quarterly and annual OPEX and CAPEX financial planning, leading executive initiatives to identify headcount spend year over year, as well as reviewing software & hardware costs to eliminate unnecessary maintenance, professional service and licensing costs. Global IT Relations Lead Yahoo! October 2008  –  December 2009  (1 year 3 months) Santa Clara, CA Partnered with Regional IT Managers across business units in Europe, India and Asia to standardize operational procedures with the goal of offering consistent service delivery levels 24/7. Some efforts consisted of implementing Live Chat, allowing for bilingual support, introducing marketing campaigns to drive service requests from Tier 2 to Tier 1 and assisting with the M&A for Maktoob, which is the Middle East largest internet search company. Working closely with Managers, concentrated efforts centered around socializing and driving support requests to a Global Service Desk team, using streamlined processes, reducing operational costs and increasing the capacity of Tier 2 teams. Global IT Relations Lead Yahoo! October 2008  –  December 2009  (1 year 3 months) Santa Clara, CA Partnered with Regional IT Managers across business units in Europe, India and Asia to standardize operational procedures with the goal of offering consistent service delivery levels 24/7. Some efforts consisted of implementing Live Chat, allowing for bilingual support, introducing marketing campaigns to drive service requests from Tier 2 to Tier 1 and assisting with the M&A for Maktoob, which is the Middle East largest internet search company. Working closely with Managers, concentrated efforts centered around socializing and driving support requests to a Global Service Desk team, using streamlined processes, reducing operational costs and increasing the capacity of Tier 2 teams. Global Service Desk Supervisor Yahoo! April 2007  –  October 2008  (1 year 7 months) Manhattan, NY Managed Global Service Desk Support Technicians Onsite, Remotely and Internationally, delivering on aggressive goals to achieve 90% FCR, Largely focusing on continual and sustainable service improvement, I partnered with regional support supervisors and senior management to introduce industry best practices, mature processes and streamline workflow efficiencies.\tIncorporated India region into Service Desk, consolidating IT support under a single Global Service Desk and assisted in the introduction of targeted SLA's, which allowed for accurate performance baselines. Global Service Desk Supervisor Yahoo! April 2007  –  October 2008  (1 year 7 months) Manhattan, NY Managed Global Service Desk Support Technicians Onsite, Remotely and Internationally, delivering on aggressive goals to achieve 90% FCR, Largely focusing on continual and sustainable service improvement, I partnered with regional support supervisors and senior management to introduce industry best practices, mature processes and streamline workflow efficiencies.\tIncorporated India region into Service Desk, consolidating IT support under a single Global Service Desk and assisted in the introduction of targeted SLA's, which allowed for accurate performance baselines. Service Desk Technician Sony Music Entertainment July 2006  –  April 2007  (10 months) Manhattan, NY Provided quality and timely technical support to entertainment teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted in the introduction of industry standard operating best practices, implementing a knowledge database & documenting operational procedures, workflows and training material. Service Desk Technician Sony Music Entertainment July 2006  –  April 2007  (10 months) Manhattan, NY Provided quality and timely technical support to entertainment teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted in the introduction of industry standard operating best practices, implementing a knowledge database & documenting operational procedures, workflows and training material. Service Desk Technician Pfizer Pharmaceuticals April 2006  –  June 2006  (3 months) Parsippany, NJ Provided quality and timely technical support to pharmaceutical teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted with performing root cause analysis, providing workarounds and identifying long term solutions - often leading to incident reduction. Service Desk Technician Pfizer Pharmaceuticals April 2006  –  June 2006  (3 months) Parsippany, NJ Provided quality and timely technical support to pharmaceutical teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted with performing root cause analysis, providing workarounds and identifying long term solutions - often leading to incident reduction. Technical Account Supervisor C3i January 2003  –  October 2005  (2 years 10 months) Morristown, NY Supervised technical support teams based on SLA's with Johnson & Johnson (Vistakon), ensuring consistent service delivery, timely problem resolution, and quality customer satisfaction. I consistently performed trend/root cause analysis to identify common issues reported to the Service Desk, with the goals of reducing repetitive incidents and identifying accurate knowledge, for support teams. Partnered with training department to deliver industry standard customer service best practices and required technical operational & escalation procedures, which were measured through monthly assessments. Technical Account Supervisor C3i January 2003  –  October 2005  (2 years 10 months) Morristown, NY Supervised technical support teams based on SLA's with Johnson & Johnson (Vistakon), ensuring consistent service delivery, timely problem resolution, and quality customer satisfaction. I consistently performed trend/root cause analysis to identify common issues reported to the Service Desk, with the goals of reducing repetitive incidents and identifying accurate knowledge, for support teams. Partnered with training department to deliver industry standard customer service best practices and required technical operational & escalation procedures, which were measured through monthly assessments. Junior Business Analyst JDS Uniphase April 2000  –  June 2002  (2 years 3 months) Asbury, NJ Deployed Oracle Customer Relationship Management software throughout the the Sales Force. Partnering closely with Oracle consultants, I drove data conversion efforts - moving the Sales department from a flat file system, assisted consultants in the configuration of back-end applications and documented User Acceptance Testing requirements & results. I also performed post deployment validation, managed Tier 1 application support and provided reporting. Junior Business Analyst JDS Uniphase April 2000  –  June 2002  (2 years 3 months) Asbury, NJ Deployed Oracle Customer Relationship Management software throughout the the Sales Force. Partnering closely with Oracle consultants, I drove data conversion efforts - moving the Sales department from a flat file system, assisted consultants in the configuration of back-end applications and documented User Acceptance Testing requirements & results. I also performed post deployment validation, managed Tier 1 application support and provided reporting. Skills Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Skills  Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Education Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Honors & Awards Certified Scrum Master Cerification Scrum Alliance January 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) Certified Scrum Master Cerification Scrum Alliance January 2014 Certified Scrum Master Cerification Scrum Alliance January 2014 Certified Scrum Master Cerification Scrum Alliance January 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) ", "Languages English Native or bilingual proficiency Polish Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Cross-functional Team... Requirements Analysis Integration Project Management Software Development Program Management SDLC Project Planning Process Improvement Management ITIL Enterprise Software Data Center Testing Quality Assurance Enterprise Architecture See 1+     See less Skills  Cross-functional Team... Requirements Analysis Integration Project Management Software Development Program Management SDLC Project Planning Process Improvement Management ITIL Enterprise Software Data Center Testing Quality Assurance Enterprise Architecture See 1+     See less Cross-functional Team... Requirements Analysis Integration Project Management Software Development Program Management SDLC Project Planning Process Improvement Management ITIL Enterprise Software Data Center Testing Quality Assurance Enterprise Architecture See 1+     See less Cross-functional Team... Requirements Analysis Integration Project Management Software Development Program Management SDLC Project Planning Process Improvement Management ITIL Enterprise Software Data Center Testing Quality Assurance Enterprise Architecture See 1+     See less ", "Languages English English English Skills Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less Skills  Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less ", "Summary Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Summary Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Experience Sr. HR Program Manager, Global Talent Operations Yahoo March 2015  – Present (6 months) Sunnyvale, California •\tProgram Management: Lead the program; negotiate contracts and work with legal on policy, guide managers regarding on-boarding/off-boarding, partner with IT on the backend processes, and engage with leadership on the overall status and future direction of the program.  \n•\tLeadership: Provide day to day guidance and mentorship to team of supplied by vendor (Managed Services Provider); remove barriers, and ensure vendor is meeting expectations as specified in the agreement. \n Sr. HR Program Manager, Global Talent Operations Yahoo March 2015  – Present (6 months) Sunnyvale, California •\tProgram Management: Lead the program; negotiate contracts and work with legal on policy, guide managers regarding on-boarding/off-boarding, partner with IT on the backend processes, and engage with leadership on the overall status and future direction of the program.  \n•\tLeadership: Provide day to day guidance and mentorship to team of supplied by vendor (Managed Services Provider); remove barriers, and ensure vendor is meeting expectations as specified in the agreement. \n Sr. HR Program Manager, Global Talent Operations Yahoo March 2015  – Present (6 months) Sunnyvale, California •\tProgram Management: Lead the program; negotiate contracts and work with legal on policy, guide managers regarding on-boarding/off-boarding, partner with IT on the backend processes, and engage with leadership on the overall status and future direction of the program.  \n•\tLeadership: Provide day to day guidance and mentorship to team of supplied by vendor (Managed Services Provider); remove barriers, and ensure vendor is meeting expectations as specified in the agreement. \n Skills Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less Skills  Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less ", "Summary I'm an experience program manager over 15 years experiences across multiples technology industry including Banking, Datacenter, E-commerce and Media across International Market. I have strong abilities and solid experience to manage large size global programs/projects with budget management ensuring achieve company goals.  \n \nI had a strong track record in leading Service Engineering teams in Korea and PMO team in APAC. Well regarded for my leadership skills and demonstrates the ability to manage teams across multiple locations and cultures to ensure alignment to strategic objectives. \n \nSpecialties: PMP, Service Management, ITSM, ITIL, Continuous Service improvement, Datacenter operations, BCP - Business Continuity Management planning implementation and testing, Budget (Capex / Opex) management Summary I'm an experience program manager over 15 years experiences across multiples technology industry including Banking, Datacenter, E-commerce and Media across International Market. I have strong abilities and solid experience to manage large size global programs/projects with budget management ensuring achieve company goals.  \n \nI had a strong track record in leading Service Engineering teams in Korea and PMO team in APAC. Well regarded for my leadership skills and demonstrates the ability to manage teams across multiple locations and cultures to ensure alignment to strategic objectives. \n \nSpecialties: PMP, Service Management, ITSM, ITIL, Continuous Service improvement, Datacenter operations, BCP - Business Continuity Management planning implementation and testing, Budget (Capex / Opex) management I'm an experience program manager over 15 years experiences across multiples technology industry including Banking, Datacenter, E-commerce and Media across International Market. I have strong abilities and solid experience to manage large size global programs/projects with budget management ensuring achieve company goals.  \n \nI had a strong track record in leading Service Engineering teams in Korea and PMO team in APAC. Well regarded for my leadership skills and demonstrates the ability to manage teams across multiple locations and cultures to ensure alignment to strategic objectives. \n \nSpecialties: PMP, Service Management, ITSM, ITIL, Continuous Service improvement, Datacenter operations, BCP - Business Continuity Management planning implementation and testing, Budget (Capex / Opex) management I'm an experience program manager over 15 years experiences across multiples technology industry including Banking, Datacenter, E-commerce and Media across International Market. I have strong abilities and solid experience to manage large size global programs/projects with budget management ensuring achieve company goals.  \n \nI had a strong track record in leading Service Engineering teams in Korea and PMO team in APAC. Well regarded for my leadership skills and demonstrates the ability to manage teams across multiple locations and cultures to ensure alignment to strategic objectives. \n \nSpecialties: PMP, Service Management, ITSM, ITIL, Continuous Service improvement, Datacenter operations, BCP - Business Continuity Management planning implementation and testing, Budget (Capex / Opex) management Experience Senior Program Manager, Production Engineering Yahoo January 2013  – Present (2 years 8 months) * Drive and manage Programs across International to ensure alignment with corporate goals.  \n* Drive capacity planning, capex and quarterly tech review process. Manage multi-million dollar capex budget.  \n* Strategic Consulting, Portfolio Planning & Team strategy development. Program Manager, Service Engineering Yahoo November 2009  –  December 2012  (3 years 2 months) Hong Kong, Taiwan, Seoul Korea - Drive capacity planning, capex and quarterly tech review process. manage multi-million dollar capex budget in APAC  \n- Lead APAC PMO to drive programs across US and Asia counties  \n- Lead Asia Search Team in Seoul to support Search operations, incident and Site-up in Asia. \n- Manage Datacenter consolidation project in APAC to achieve simplification and cost effective. \n- Drive Vampire Program to EOL all legacy properties to make operations  \n- Build and site-up AppSearch smartphone product with Engineering team within 2 months. \n- Build Change Advisor Board (CAB) and chair the CAB to review daily release / change operations for Media and E-Commerce product in APAC. Regional Project Manager, IT APAC Yahoo July 2006  –  November 2009  (3 years 5 months) Facilitate the delivery of the strategy by optimizing resourcing, consolidating roadmaps,  \ncontrolling projects advancements and identifying issues and risks in Asia Pacific (19 offices  \nin 13 counties).  \n• Lead and operate PMO daily operations to ensure all projects the milestones/deliverables to  \nbe completed on time and met with the required quality standard.  \n• Define Service Management processes (Change, Incident and Problem) to provide best  \npractice of standardized methods and procedures are used for efficient and prompt handling  \nof all Changes, incident and problem.  \n• Acting as Change Manager role to lead Change Advisory Broad (CAB) reviewing daily  \nChange Management Request (CMR) to minimize the impact of Change related Incidents  \nupon service quality, and consequently to improve day-to-day operations of the organization.  \n• Establish policies and provide user guidance in using IT services.  \n• Coordinate the IT operations between regional team and local IT teams of Asia Pacific  \noffices.  \n• Contribute to the development of IT policy, internal/external process and best practice of IT  \noperations.  \n• Evaluate new IT product, including those relating to the backend system, user computing  \nenvironment and IT automation management.  \n• Lead IT Platform Service Virtual team to support all Corp IT infrastructure systems in APAC.  \n• Conduct analysis and provide management reporting on the operational metric. Service Engineer Yahoo May 2005  –  June 2006  (1 year 2 months) Mainly manage HK Service Resilience Project to improve the service resilience of critical  \nproperties by enhancing processes, procedures and technology to ensure high availability,  \nlow fault recurrence and fast time to resolve incidents. Moreover, it ensures that project are  \nclearly defined, consistent with Yahoo! business objectives and delivered to the required  \nquality.  \n• Work with International Engineering Project managers within the region to ensure the project  \nis run following a standard process, and schedules and relevant information is freely available  \nto all stakeholders as well as provide regular status updates on all service engineering  \nprojects to stakeholders.  \n• Setup and enforce deployment process, machine request process, support structure and  \ndocumentation for all yahoo properties in Hong Kong.  \n• Provide Tier II training to NOC staff for any regionalised elements of the property.  \n• Work with a cross-functional team including other regions Service Engineers, Engineers,  \nDesigners, and Product Managers to facilitate platform and feature releases for products in  \nregional markets.  \n• Ongoing management and planning for capacity, management recovery, monitoring, and  \nreporting for services.  \n• Provide database management solutions such as backup/restore solution, Disaster Recovery  \nprocedure, monitoring and tuning.  \n• Purpose, planning and implement database upgrading from Oracle 8i to 9i.  \n• Purpose, planning and implement High Availability solution Oracle 9i – Real Application  \nClustering (RAC) and Data Guard. Application Engineer iAdvantage Ltd July 2000  –  May 2005  (4 years 11 months) - Drive datacenter project for new move-in customer to complete datacenter setup including cabling, network infrastructure, cabinet and rise-floor. (Customers including: Google, OOCL, Yahoo..etc) \n- Developed Network Real time traffic application to measure usage for each customers, it allowed to bill customer in 95 percentile. \n- Migrate local finance system to Oracle finance system including Account Payable, Account Receivable and General. Analyst Programmer Wing Hang Bank (previous Chekiang First Bank) October 1999  –  May 2000  (8 months) - Develop software for disaster recovery application for 2000 year bug for Loans, Saving, time deposit and current. \n- Provided users-training to all bank employee for using disaster recovery application and manual procedure.  \n- Build an application for Swift transition process across international bank. Senior Program Manager, Production Engineering Yahoo January 2013  – Present (2 years 8 months) * Drive and manage Programs across International to ensure alignment with corporate goals.  \n* Drive capacity planning, capex and quarterly tech review process. Manage multi-million dollar capex budget.  \n* Strategic Consulting, Portfolio Planning & Team strategy development. Senior Program Manager, Production Engineering Yahoo January 2013  – Present (2 years 8 months) * Drive and manage Programs across International to ensure alignment with corporate goals.  \n* Drive capacity planning, capex and quarterly tech review process. Manage multi-million dollar capex budget.  \n* Strategic Consulting, Portfolio Planning & Team strategy development. Program Manager, Service Engineering Yahoo November 2009  –  December 2012  (3 years 2 months) Hong Kong, Taiwan, Seoul Korea - Drive capacity planning, capex and quarterly tech review process. manage multi-million dollar capex budget in APAC  \n- Lead APAC PMO to drive programs across US and Asia counties  \n- Lead Asia Search Team in Seoul to support Search operations, incident and Site-up in Asia. \n- Manage Datacenter consolidation project in APAC to achieve simplification and cost effective. \n- Drive Vampire Program to EOL all legacy properties to make operations  \n- Build and site-up AppSearch smartphone product with Engineering team within 2 months. \n- Build Change Advisor Board (CAB) and chair the CAB to review daily release / change operations for Media and E-Commerce product in APAC. Program Manager, Service Engineering Yahoo November 2009  –  December 2012  (3 years 2 months) Hong Kong, Taiwan, Seoul Korea - Drive capacity planning, capex and quarterly tech review process. manage multi-million dollar capex budget in APAC  \n- Lead APAC PMO to drive programs across US and Asia counties  \n- Lead Asia Search Team in Seoul to support Search operations, incident and Site-up in Asia. \n- Manage Datacenter consolidation project in APAC to achieve simplification and cost effective. \n- Drive Vampire Program to EOL all legacy properties to make operations  \n- Build and site-up AppSearch smartphone product with Engineering team within 2 months. \n- Build Change Advisor Board (CAB) and chair the CAB to review daily release / change operations for Media and E-Commerce product in APAC. Regional Project Manager, IT APAC Yahoo July 2006  –  November 2009  (3 years 5 months) Facilitate the delivery of the strategy by optimizing resourcing, consolidating roadmaps,  \ncontrolling projects advancements and identifying issues and risks in Asia Pacific (19 offices  \nin 13 counties).  \n• Lead and operate PMO daily operations to ensure all projects the milestones/deliverables to  \nbe completed on time and met with the required quality standard.  \n• Define Service Management processes (Change, Incident and Problem) to provide best  \npractice of standardized methods and procedures are used for efficient and prompt handling  \nof all Changes, incident and problem.  \n• Acting as Change Manager role to lead Change Advisory Broad (CAB) reviewing daily  \nChange Management Request (CMR) to minimize the impact of Change related Incidents  \nupon service quality, and consequently to improve day-to-day operations of the organization.  \n• Establish policies and provide user guidance in using IT services.  \n• Coordinate the IT operations between regional team and local IT teams of Asia Pacific  \noffices.  \n• Contribute to the development of IT policy, internal/external process and best practice of IT  \noperations.  \n• Evaluate new IT product, including those relating to the backend system, user computing  \nenvironment and IT automation management.  \n• Lead IT Platform Service Virtual team to support all Corp IT infrastructure systems in APAC.  \n• Conduct analysis and provide management reporting on the operational metric. Regional Project Manager, IT APAC Yahoo July 2006  –  November 2009  (3 years 5 months) Facilitate the delivery of the strategy by optimizing resourcing, consolidating roadmaps,  \ncontrolling projects advancements and identifying issues and risks in Asia Pacific (19 offices  \nin 13 counties).  \n• Lead and operate PMO daily operations to ensure all projects the milestones/deliverables to  \nbe completed on time and met with the required quality standard.  \n• Define Service Management processes (Change, Incident and Problem) to provide best  \npractice of standardized methods and procedures are used for efficient and prompt handling  \nof all Changes, incident and problem.  \n• Acting as Change Manager role to lead Change Advisory Broad (CAB) reviewing daily  \nChange Management Request (CMR) to minimize the impact of Change related Incidents  \nupon service quality, and consequently to improve day-to-day operations of the organization.  \n• Establish policies and provide user guidance in using IT services.  \n• Coordinate the IT operations between regional team and local IT teams of Asia Pacific  \noffices.  \n• Contribute to the development of IT policy, internal/external process and best practice of IT  \noperations.  \n• Evaluate new IT product, including those relating to the backend system, user computing  \nenvironment and IT automation management.  \n• Lead IT Platform Service Virtual team to support all Corp IT infrastructure systems in APAC.  \n• Conduct analysis and provide management reporting on the operational metric. Service Engineer Yahoo May 2005  –  June 2006  (1 year 2 months) Mainly manage HK Service Resilience Project to improve the service resilience of critical  \nproperties by enhancing processes, procedures and technology to ensure high availability,  \nlow fault recurrence and fast time to resolve incidents. Moreover, it ensures that project are  \nclearly defined, consistent with Yahoo! business objectives and delivered to the required  \nquality.  \n• Work with International Engineering Project managers within the region to ensure the project  \nis run following a standard process, and schedules and relevant information is freely available  \nto all stakeholders as well as provide regular status updates on all service engineering  \nprojects to stakeholders.  \n• Setup and enforce deployment process, machine request process, support structure and  \ndocumentation for all yahoo properties in Hong Kong.  \n• Provide Tier II training to NOC staff for any regionalised elements of the property.  \n• Work with a cross-functional team including other regions Service Engineers, Engineers,  \nDesigners, and Product Managers to facilitate platform and feature releases for products in  \nregional markets.  \n• Ongoing management and planning for capacity, management recovery, monitoring, and  \nreporting for services.  \n• Provide database management solutions such as backup/restore solution, Disaster Recovery  \nprocedure, monitoring and tuning.  \n• Purpose, planning and implement database upgrading from Oracle 8i to 9i.  \n• Purpose, planning and implement High Availability solution Oracle 9i – Real Application  \nClustering (RAC) and Data Guard. Service Engineer Yahoo May 2005  –  June 2006  (1 year 2 months) Mainly manage HK Service Resilience Project to improve the service resilience of critical  \nproperties by enhancing processes, procedures and technology to ensure high availability,  \nlow fault recurrence and fast time to resolve incidents. Moreover, it ensures that project are  \nclearly defined, consistent with Yahoo! business objectives and delivered to the required  \nquality.  \n• Work with International Engineering Project managers within the region to ensure the project  \nis run following a standard process, and schedules and relevant information is freely available  \nto all stakeholders as well as provide regular status updates on all service engineering  \nprojects to stakeholders.  \n• Setup and enforce deployment process, machine request process, support structure and  \ndocumentation for all yahoo properties in Hong Kong.  \n• Provide Tier II training to NOC staff for any regionalised elements of the property.  \n• Work with a cross-functional team including other regions Service Engineers, Engineers,  \nDesigners, and Product Managers to facilitate platform and feature releases for products in  \nregional markets.  \n• Ongoing management and planning for capacity, management recovery, monitoring, and  \nreporting for services.  \n• Provide database management solutions such as backup/restore solution, Disaster Recovery  \nprocedure, monitoring and tuning.  \n• Purpose, planning and implement database upgrading from Oracle 8i to 9i.  \n• Purpose, planning and implement High Availability solution Oracle 9i – Real Application  \nClustering (RAC) and Data Guard. Application Engineer iAdvantage Ltd July 2000  –  May 2005  (4 years 11 months) - Drive datacenter project for new move-in customer to complete datacenter setup including cabling, network infrastructure, cabinet and rise-floor. (Customers including: Google, OOCL, Yahoo..etc) \n- Developed Network Real time traffic application to measure usage for each customers, it allowed to bill customer in 95 percentile. \n- Migrate local finance system to Oracle finance system including Account Payable, Account Receivable and General. Application Engineer iAdvantage Ltd July 2000  –  May 2005  (4 years 11 months) - Drive datacenter project for new move-in customer to complete datacenter setup including cabling, network infrastructure, cabinet and rise-floor. (Customers including: Google, OOCL, Yahoo..etc) \n- Developed Network Real time traffic application to measure usage for each customers, it allowed to bill customer in 95 percentile. \n- Migrate local finance system to Oracle finance system including Account Payable, Account Receivable and General. Analyst Programmer Wing Hang Bank (previous Chekiang First Bank) October 1999  –  May 2000  (8 months) - Develop software for disaster recovery application for 2000 year bug for Loans, Saving, time deposit and current. \n- Provided users-training to all bank employee for using disaster recovery application and manual procedure.  \n- Build an application for Swift transition process across international bank. Analyst Programmer Wing Hang Bank (previous Chekiang First Bank) October 1999  –  May 2000  (8 months) - Develop software for disaster recovery application for 2000 year bug for Loans, Saving, time deposit and current. \n- Provided users-training to all bank employee for using disaster recovery application and manual procedure.  \n- Build an application for Swift transition process across international bank. Languages Chinese English Cantonese  Korean Chinese English Cantonese  Korean Chinese English Cantonese  Korean Skills ITIL PMP Data Center IT Service Management Program Management PMO Strategy IT Operations Service Management Project Planning SDLC Service Delivery System Deployment IT Management Team Management Search Deployment Software Project... Analytics Planning Project Portfolio... Budget Management See 7+     See less Skills  ITIL PMP Data Center IT Service Management Program Management PMO Strategy IT Operations Service Management Project Planning SDLC Service Delivery System Deployment IT Management Team Management Search Deployment Software Project... Analytics Planning Project Portfolio... Budget Management See 7+     See less ITIL PMP Data Center IT Service Management Program Management PMO Strategy IT Operations Service Management Project Planning SDLC Service Delivery System Deployment IT Management Team Management Search Deployment Software Project... Analytics Planning Project Portfolio... Budget Management See 7+     See less ITIL PMP Data Center IT Service Management Program Management PMO Strategy IT Operations Service Management Project Planning SDLC Service Delivery System Deployment IT Management Team Management Search Deployment Software Project... Analytics Planning Project Portfolio... Budget Management See 7+     See less Education City University of Hong Kong Master of Art Information System managment 2003  – 2005 Staffordshire University 1999  – 2001 City University of Hong Kong Master of Art Information System managment 2003  – 2005 City University of Hong Kong Master of Art Information System managment 2003  – 2005 City University of Hong Kong Master of Art Information System managment 2003  – 2005 Staffordshire University 1999  – 2001 Staffordshire University 1999  – 2001 Staffordshire University 1999  – 2001 Honors & Awards Additional Honors & Awards Yahoo! Odyssey Award 2006 - Service Resilience Program Additional Honors & Awards Yahoo! Odyssey Award 2006 - Service Resilience Program Additional Honors & Awards Yahoo! Odyssey Award 2006 - Service Resilience Program Additional Honors & Awards Yahoo! Odyssey Award 2006 - Service Resilience Program ", "Summary Career Summary:  \n \n15+ years of total work experience comprising a multitude of domains across Program Management, Project Management, IT Service Management, Customer Service Management, Vendor management and Business intelligence functions. \n \n8+ years of rich experience in leading and managing; small, medium & large-scale programs, projects in cross-functional & dynamic working environment  \n \n1. Acquired key skills include relationship building, coordination and collaboration in a cross-functional team comprised of diverse personalities, skills set and levels of experience \n2. Experienced in working with teams across multiple time zones and geographic locations \n3. Experienced in leading & guiding different programs simultaneously, building appropriate internal processes and internal tools \n4. Acquired strong knowledge of standard program and project management concepts, practices, and processes (planning, prioritization, execution, monitoring and controlling) \n5. Developed and initiated internal processes to improve program execution \n6. Established goals and milestones as per the desired results to be generated by the program \n7. Defined the resources required for completion of a program and allocated resources accordingly \n8. Managed teams working on different programs/projects and smoothed out any areas of possible conflict. \n9. Familiar with Agile project management methods and tools (Scrum, Rally, Sprint Manager) \n10. Familiar with Kanban scheduling method and tools in particular IT operations (Kanban whiteboard, Rally>Kanban board, Kanbanize) \n11. Proficient in MS Office applications: Excel, PowerPoint and Word \n \nCareer Objective:  \n \nTo provide leadership to plan, direct and co-ordinate management program activities, key projects to enable the program, projects to successfully complete their activities thus achieve the overall program and organizational objectives Summary Career Summary:  \n \n15+ years of total work experience comprising a multitude of domains across Program Management, Project Management, IT Service Management, Customer Service Management, Vendor management and Business intelligence functions. \n \n8+ years of rich experience in leading and managing; small, medium & large-scale programs, projects in cross-functional & dynamic working environment  \n \n1. Acquired key skills include relationship building, coordination and collaboration in a cross-functional team comprised of diverse personalities, skills set and levels of experience \n2. Experienced in working with teams across multiple time zones and geographic locations \n3. Experienced in leading & guiding different programs simultaneously, building appropriate internal processes and internal tools \n4. Acquired strong knowledge of standard program and project management concepts, practices, and processes (planning, prioritization, execution, monitoring and controlling) \n5. Developed and initiated internal processes to improve program execution \n6. Established goals and milestones as per the desired results to be generated by the program \n7. Defined the resources required for completion of a program and allocated resources accordingly \n8. Managed teams working on different programs/projects and smoothed out any areas of possible conflict. \n9. Familiar with Agile project management methods and tools (Scrum, Rally, Sprint Manager) \n10. Familiar with Kanban scheduling method and tools in particular IT operations (Kanban whiteboard, Rally>Kanban board, Kanbanize) \n11. Proficient in MS Office applications: Excel, PowerPoint and Word \n \nCareer Objective:  \n \nTo provide leadership to plan, direct and co-ordinate management program activities, key projects to enable the program, projects to successfully complete their activities thus achieve the overall program and organizational objectives Career Summary:  \n \n15+ years of total work experience comprising a multitude of domains across Program Management, Project Management, IT Service Management, Customer Service Management, Vendor management and Business intelligence functions. \n \n8+ years of rich experience in leading and managing; small, medium & large-scale programs, projects in cross-functional & dynamic working environment  \n \n1. Acquired key skills include relationship building, coordination and collaboration in a cross-functional team comprised of diverse personalities, skills set and levels of experience \n2. Experienced in working with teams across multiple time zones and geographic locations \n3. Experienced in leading & guiding different programs simultaneously, building appropriate internal processes and internal tools \n4. Acquired strong knowledge of standard program and project management concepts, practices, and processes (planning, prioritization, execution, monitoring and controlling) \n5. Developed and initiated internal processes to improve program execution \n6. Established goals and milestones as per the desired results to be generated by the program \n7. Defined the resources required for completion of a program and allocated resources accordingly \n8. Managed teams working on different programs/projects and smoothed out any areas of possible conflict. \n9. Familiar with Agile project management methods and tools (Scrum, Rally, Sprint Manager) \n10. Familiar with Kanban scheduling method and tools in particular IT operations (Kanban whiteboard, Rally>Kanban board, Kanbanize) \n11. Proficient in MS Office applications: Excel, PowerPoint and Word \n \nCareer Objective:  \n \nTo provide leadership to plan, direct and co-ordinate management program activities, key projects to enable the program, projects to successfully complete their activities thus achieve the overall program and organizational objectives Career Summary:  \n \n15+ years of total work experience comprising a multitude of domains across Program Management, Project Management, IT Service Management, Customer Service Management, Vendor management and Business intelligence functions. \n \n8+ years of rich experience in leading and managing; small, medium & large-scale programs, projects in cross-functional & dynamic working environment  \n \n1. Acquired key skills include relationship building, coordination and collaboration in a cross-functional team comprised of diverse personalities, skills set and levels of experience \n2. Experienced in working with teams across multiple time zones and geographic locations \n3. Experienced in leading & guiding different programs simultaneously, building appropriate internal processes and internal tools \n4. Acquired strong knowledge of standard program and project management concepts, practices, and processes (planning, prioritization, execution, monitoring and controlling) \n5. Developed and initiated internal processes to improve program execution \n6. Established goals and milestones as per the desired results to be generated by the program \n7. Defined the resources required for completion of a program and allocated resources accordingly \n8. Managed teams working on different programs/projects and smoothed out any areas of possible conflict. \n9. Familiar with Agile project management methods and tools (Scrum, Rally, Sprint Manager) \n10. Familiar with Kanban scheduling method and tools in particular IT operations (Kanban whiteboard, Rally>Kanban board, Kanbanize) \n11. Proficient in MS Office applications: Excel, PowerPoint and Word \n \nCareer Objective:  \n \nTo provide leadership to plan, direct and co-ordinate management program activities, key projects to enable the program, projects to successfully complete their activities thus achieve the overall program and organizational objectives Experience Program Manager - Information Security Engineering Yahoo August 2014  – Present (1 year 1 month) Sunnyvale, California Providing program, project management support for Yahoo! Information Security Engineering cross functional, horizontal initiatives in the field of Incident Response, Corporate, Network Security Engineering and Operations Program Manager, Advertising & Data - Production Engineering Yahoo August 2011  –  July 2014  (3 years) India Led various key programs/projects for Yahoo Media, Platforms & now for Yahoo Advertising, Data - production engineering organization \n \nProviding program management support: enabling production engineering teams to deliver on key projects and operational tasks in the following portfolios: Audience & Advertiser Data, Data systems, Database administration, Reporting tools and Automation development.  \n \nKey Areas of responsibilities: \n \n1.Ensuring that goals and objectives are aligned with the organization's overall strategy and vision. Thus ensuring projects / programs are aligning with the org objectives and meets business case consistently at different stages of the life cycle and driving them towards meaningful deadlines \n \n2.Establishing and gaining agreement on projects definition, scope with stake holders to facilitate planning and execution \n \n3.Technology procurement, capex management (capacity forecast, planning and procurement) by working closely with product and various ops teams \n \n4.Mitigating major risks, issues, & cross-team dependencies that can slow down key projects. This is achieved by working closely with the senior leadership team and project stake holders \n \n5.Driving horizontal initiatives to improve ops efficiency and productivity Program Lead, Yahoo Emerging Markets Service Engineering Yahoo December 2006  –  July 2011  (4 years 8 months) India Overall Responsibility: Driving Service Management processes & procedures implementation for Yahoo Emerging Markets (INDIA, LATAM, SEA) Service Engineering and Ops following Industry standard best practices (ITIL) \n \nKey Areas of responsibilities: \n \n1. Gathering requirements from the core Service Engineering teams for Service Management framework implementation \n \n2. Drive and track the implementation of key Service Management tools (example: configuration management, incident management, service desk & operations related tools) \n \n3. Performing change review and approvals as part of the CAB (Change Advisory Board) to ensure changes to the production systems meet all required standards \n \n4. Providing project management support for horizontal initiatives (example: performance instrumentation and measurement for emerging markets products) Team Lead, Content Extraction and QA for Yahoo! Travel Yahoo December 2004  –  December 2006  (2 years 1 month) India Overall responsibility: delivering high precision and quality content for Yahoo Travel, Local and Listing websites \n \nKey Areas of responsibility: \n1. Vendor management: working closely with external vendors to develop content crawlers and obtain relevant content for Yahoo websites \n \n2. Quality assurance: partner with quality assurance team to validate extracted content and communicate corrections required to the vendor teams \n \n3. Delivery: ensuring monthly content delivery to Yahoo travel and listing teams in the US is met consistently \n \n4. Automation: driving automation efforts to improve the efficiency of content extraction and quality assurance processes Senior Technical - Customer Support Executive Integrated SoftTech Solutions Privated Limited December 2003  –  November 2004  (1 year) Chennai Area, India Lead a team of customer support engineers for an innovative email client and anti spam product  \n \nCollaborated closely with software engineering and quality engineering teams to ensure the customer support team acquires in-depth understanding of the supported products  \n \nManaged escalations from customers and the feedback from end user into product development Executive - Senior Help Desk Sutherland Technologies July 2002  –  November 2003  (1 year 5 months) Chennai Area, India Supervised a team of 20 plus help desk engineers in the Dell, HP computer's and accessories program division \n \nManaged team roster preparation and publishing  \n \nManaged the escalation desk and feedback into lessons learned, product documentation \n \nUnderwent computer product trainings from HP and Dell  \n \nUnderwent training for neutral accent Senior Customer Support Primenet Global Limited December 2000  –  June 2002  (1 year 7 months) Cochin Area, India Managed on site support program for premium broadband customers \n \nManaged lab activities and learning into troubleshooting guides Executive - Customer Care DishnetDSL Limited November 1999  –  November 2000  (1 year 1 month) Chennai Area, India Joined as a Trainee from November 1999 and on successful completion of my training period I was absorbed on probation from 15th May 2000 as Executive - Customer  \n \nAttended to broadband and dial-up customer complaints  \n \nSupported billing department with broadband customers usage data  \n \nPerformed DSL and Dial-up modem testing to simulate conditions at the customers end to enhance troubleshooting guides and product documentations Program Manager - Information Security Engineering Yahoo August 2014  – Present (1 year 1 month) Sunnyvale, California Providing program, project management support for Yahoo! Information Security Engineering cross functional, horizontal initiatives in the field of Incident Response, Corporate, Network Security Engineering and Operations Program Manager - Information Security Engineering Yahoo August 2014  – Present (1 year 1 month) Sunnyvale, California Providing program, project management support for Yahoo! Information Security Engineering cross functional, horizontal initiatives in the field of Incident Response, Corporate, Network Security Engineering and Operations Program Manager, Advertising & Data - Production Engineering Yahoo August 2011  –  July 2014  (3 years) India Led various key programs/projects for Yahoo Media, Platforms & now for Yahoo Advertising, Data - production engineering organization \n \nProviding program management support: enabling production engineering teams to deliver on key projects and operational tasks in the following portfolios: Audience & Advertiser Data, Data systems, Database administration, Reporting tools and Automation development.  \n \nKey Areas of responsibilities: \n \n1.Ensuring that goals and objectives are aligned with the organization's overall strategy and vision. Thus ensuring projects / programs are aligning with the org objectives and meets business case consistently at different stages of the life cycle and driving them towards meaningful deadlines \n \n2.Establishing and gaining agreement on projects definition, scope with stake holders to facilitate planning and execution \n \n3.Technology procurement, capex management (capacity forecast, planning and procurement) by working closely with product and various ops teams \n \n4.Mitigating major risks, issues, & cross-team dependencies that can slow down key projects. This is achieved by working closely with the senior leadership team and project stake holders \n \n5.Driving horizontal initiatives to improve ops efficiency and productivity Program Manager, Advertising & Data - Production Engineering Yahoo August 2011  –  July 2014  (3 years) India Led various key programs/projects for Yahoo Media, Platforms & now for Yahoo Advertising, Data - production engineering organization \n \nProviding program management support: enabling production engineering teams to deliver on key projects and operational tasks in the following portfolios: Audience & Advertiser Data, Data systems, Database administration, Reporting tools and Automation development.  \n \nKey Areas of responsibilities: \n \n1.Ensuring that goals and objectives are aligned with the organization's overall strategy and vision. Thus ensuring projects / programs are aligning with the org objectives and meets business case consistently at different stages of the life cycle and driving them towards meaningful deadlines \n \n2.Establishing and gaining agreement on projects definition, scope with stake holders to facilitate planning and execution \n \n3.Technology procurement, capex management (capacity forecast, planning and procurement) by working closely with product and various ops teams \n \n4.Mitigating major risks, issues, & cross-team dependencies that can slow down key projects. This is achieved by working closely with the senior leadership team and project stake holders \n \n5.Driving horizontal initiatives to improve ops efficiency and productivity Program Lead, Yahoo Emerging Markets Service Engineering Yahoo December 2006  –  July 2011  (4 years 8 months) India Overall Responsibility: Driving Service Management processes & procedures implementation for Yahoo Emerging Markets (INDIA, LATAM, SEA) Service Engineering and Ops following Industry standard best practices (ITIL) \n \nKey Areas of responsibilities: \n \n1. Gathering requirements from the core Service Engineering teams for Service Management framework implementation \n \n2. Drive and track the implementation of key Service Management tools (example: configuration management, incident management, service desk & operations related tools) \n \n3. Performing change review and approvals as part of the CAB (Change Advisory Board) to ensure changes to the production systems meet all required standards \n \n4. Providing project management support for horizontal initiatives (example: performance instrumentation and measurement for emerging markets products) Program Lead, Yahoo Emerging Markets Service Engineering Yahoo December 2006  –  July 2011  (4 years 8 months) India Overall Responsibility: Driving Service Management processes & procedures implementation for Yahoo Emerging Markets (INDIA, LATAM, SEA) Service Engineering and Ops following Industry standard best practices (ITIL) \n \nKey Areas of responsibilities: \n \n1. Gathering requirements from the core Service Engineering teams for Service Management framework implementation \n \n2. Drive and track the implementation of key Service Management tools (example: configuration management, incident management, service desk & operations related tools) \n \n3. Performing change review and approvals as part of the CAB (Change Advisory Board) to ensure changes to the production systems meet all required standards \n \n4. Providing project management support for horizontal initiatives (example: performance instrumentation and measurement for emerging markets products) Team Lead, Content Extraction and QA for Yahoo! Travel Yahoo December 2004  –  December 2006  (2 years 1 month) India Overall responsibility: delivering high precision and quality content for Yahoo Travel, Local and Listing websites \n \nKey Areas of responsibility: \n1. Vendor management: working closely with external vendors to develop content crawlers and obtain relevant content for Yahoo websites \n \n2. Quality assurance: partner with quality assurance team to validate extracted content and communicate corrections required to the vendor teams \n \n3. Delivery: ensuring monthly content delivery to Yahoo travel and listing teams in the US is met consistently \n \n4. Automation: driving automation efforts to improve the efficiency of content extraction and quality assurance processes Team Lead, Content Extraction and QA for Yahoo! Travel Yahoo December 2004  –  December 2006  (2 years 1 month) India Overall responsibility: delivering high precision and quality content for Yahoo Travel, Local and Listing websites \n \nKey Areas of responsibility: \n1. Vendor management: working closely with external vendors to develop content crawlers and obtain relevant content for Yahoo websites \n \n2. Quality assurance: partner with quality assurance team to validate extracted content and communicate corrections required to the vendor teams \n \n3. Delivery: ensuring monthly content delivery to Yahoo travel and listing teams in the US is met consistently \n \n4. Automation: driving automation efforts to improve the efficiency of content extraction and quality assurance processes Senior Technical - Customer Support Executive Integrated SoftTech Solutions Privated Limited December 2003  –  November 2004  (1 year) Chennai Area, India Lead a team of customer support engineers for an innovative email client and anti spam product  \n \nCollaborated closely with software engineering and quality engineering teams to ensure the customer support team acquires in-depth understanding of the supported products  \n \nManaged escalations from customers and the feedback from end user into product development Senior Technical - Customer Support Executive Integrated SoftTech Solutions Privated Limited December 2003  –  November 2004  (1 year) Chennai Area, India Lead a team of customer support engineers for an innovative email client and anti spam product  \n \nCollaborated closely with software engineering and quality engineering teams to ensure the customer support team acquires in-depth understanding of the supported products  \n \nManaged escalations from customers and the feedback from end user into product development Executive - Senior Help Desk Sutherland Technologies July 2002  –  November 2003  (1 year 5 months) Chennai Area, India Supervised a team of 20 plus help desk engineers in the Dell, HP computer's and accessories program division \n \nManaged team roster preparation and publishing  \n \nManaged the escalation desk and feedback into lessons learned, product documentation \n \nUnderwent computer product trainings from HP and Dell  \n \nUnderwent training for neutral accent Executive - Senior Help Desk Sutherland Technologies July 2002  –  November 2003  (1 year 5 months) Chennai Area, India Supervised a team of 20 plus help desk engineers in the Dell, HP computer's and accessories program division \n \nManaged team roster preparation and publishing  \n \nManaged the escalation desk and feedback into lessons learned, product documentation \n \nUnderwent computer product trainings from HP and Dell  \n \nUnderwent training for neutral accent Senior Customer Support Primenet Global Limited December 2000  –  June 2002  (1 year 7 months) Cochin Area, India Managed on site support program for premium broadband customers \n \nManaged lab activities and learning into troubleshooting guides Senior Customer Support Primenet Global Limited December 2000  –  June 2002  (1 year 7 months) Cochin Area, India Managed on site support program for premium broadband customers \n \nManaged lab activities and learning into troubleshooting guides Executive - Customer Care DishnetDSL Limited November 1999  –  November 2000  (1 year 1 month) Chennai Area, India Joined as a Trainee from November 1999 and on successful completion of my training period I was absorbed on probation from 15th May 2000 as Executive - Customer  \n \nAttended to broadband and dial-up customer complaints  \n \nSupported billing department with broadband customers usage data  \n \nPerformed DSL and Dial-up modem testing to simulate conditions at the customers end to enhance troubleshooting guides and product documentations Executive - Customer Care DishnetDSL Limited November 1999  –  November 2000  (1 year 1 month) Chennai Area, India Joined as a Trainee from November 1999 and on successful completion of my training period I was absorbed on probation from 15th May 2000 as Executive - Customer  \n \nAttended to broadband and dial-up customer complaints  \n \nSupported billing department with broadband customers usage data  \n \nPerformed DSL and Dial-up modem testing to simulate conditions at the customers end to enhance troubleshooting guides and product documentations Languages Tamil Hindi Malayalam English Tamil Hindi Malayalam English Tamil Hindi Malayalam English Skills Program Management Project Management Reporting & Analysis Data Analysis Problem Solving Innovator ITIL IT Service Management Agile Methodologies Strategy PMP Management SDLC Scrum Change Management Vendor Management Cross-functional Team... Product Management Agile Project Management Leadership See 5+     See less Skills  Program Management Project Management Reporting & Analysis Data Analysis Problem Solving Innovator ITIL IT Service Management Agile Methodologies Strategy PMP Management SDLC Scrum Change Management Vendor Management Cross-functional Team... Product Management Agile Project Management Leadership See 5+     See less Program Management Project Management Reporting & Analysis Data Analysis Problem Solving Innovator ITIL IT Service Management Agile Methodologies Strategy PMP Management SDLC Scrum Change Management Vendor Management Cross-functional Team... Product Management Agile Project Management Leadership See 5+     See less Program Management Project Management Reporting & Analysis Data Analysis Problem Solving Innovator ITIL IT Service Management Agile Methodologies Strategy PMP Management SDLC Scrum Change Management Vendor Management Cross-functional Team... Product Management Agile Project Management Leadership See 5+     See less Education Ramakrishna Mission Vivekananda College Bachelor of Science,  Mathematics (Major) ,  Physics ,  Chemistry ,  Computer Science , 78 1996  – 1999 Activities and Societies:  Cricket ,  Table Tennis ,  Blood donation Janaki Ramachandra Kalalayam Matriculation Higher Secondary School Higher Secondary (12th Grade),  Mathematics ,  Physics ,  Chemistry and Computer Science , 85 1994  – 1996 Activities and Societies:  Athletics ,  Stage Drama ,  Drawing ,  Painting Ramakrishna Mission Vivekananda College Bachelor of Science,  Mathematics (Major) ,  Physics ,  Chemistry ,  Computer Science , 78 1996  – 1999 Activities and Societies:  Cricket ,  Table Tennis ,  Blood donation Ramakrishna Mission Vivekananda College Bachelor of Science,  Mathematics (Major) ,  Physics ,  Chemistry ,  Computer Science , 78 1996  – 1999 Activities and Societies:  Cricket ,  Table Tennis ,  Blood donation Ramakrishna Mission Vivekananda College Bachelor of Science,  Mathematics (Major) ,  Physics ,  Chemistry ,  Computer Science , 78 1996  – 1999 Activities and Societies:  Cricket ,  Table Tennis ,  Blood donation Janaki Ramachandra Kalalayam Matriculation Higher Secondary School Higher Secondary (12th Grade),  Mathematics ,  Physics ,  Chemistry and Computer Science , 85 1994  – 1996 Activities and Societies:  Athletics ,  Stage Drama ,  Drawing ,  Painting Janaki Ramachandra Kalalayam Matriculation Higher Secondary School Higher Secondary (12th Grade),  Mathematics ,  Physics ,  Chemistry and Computer Science , 85 1994  – 1996 Activities and Societies:  Athletics ,  Stage Drama ,  Drawing ,  Painting Janaki Ramachandra Kalalayam Matriculation Higher Secondary School Higher Secondary (12th Grade),  Mathematics ,  Physics ,  Chemistry and Computer Science , 85 1994  – 1996 Activities and Societies:  Athletics ,  Stage Drama ,  Drawing ,  Painting Honors & Awards Hackovation Award Yahoo July 2011 Won the Hack-ovation award for submitting, presenting an idea and successfully delivering the product that was developed from the idea which was to automate the operations review data gathering process and providing meaningful information from gathered data for periodic engineering and operations review. This program brought down several man hours. Approximately it brought down 7 days worth of effort to less than 30 min  Yahoo Odyssey Award Yahoo December 2009 Won the \"Yahoo Odyssey Award\" for leading a special project commissioned urgently to mitigate an anticipated crisis situation. Yahoo front page & media sites were expecting a 3X to 4X increase in due to a recent new product launch. Production engineering teams were responsible to provide additional capacity and infrastructure setup in span of 3-4 months to meet the traffic increase demand. This project was successfully delivered in 3 months time with out any major problems. Additional Honors & Awards Certified Yahoo! Buddy - 2006 Hackovation Award Yahoo July 2011 Won the Hack-ovation award for submitting, presenting an idea and successfully delivering the product that was developed from the idea which was to automate the operations review data gathering process and providing meaningful information from gathered data for periodic engineering and operations review. This program brought down several man hours. Approximately it brought down 7 days worth of effort to less than 30 min  Hackovation Award Yahoo July 2011 Won the Hack-ovation award for submitting, presenting an idea and successfully delivering the product that was developed from the idea which was to automate the operations review data gathering process and providing meaningful information from gathered data for periodic engineering and operations review. This program brought down several man hours. Approximately it brought down 7 days worth of effort to less than 30 min  Hackovation Award Yahoo July 2011 Won the Hack-ovation award for submitting, presenting an idea and successfully delivering the product that was developed from the idea which was to automate the operations review data gathering process and providing meaningful information from gathered data for periodic engineering and operations review. This program brought down several man hours. Approximately it brought down 7 days worth of effort to less than 30 min  Yahoo Odyssey Award Yahoo December 2009 Won the \"Yahoo Odyssey Award\" for leading a special project commissioned urgently to mitigate an anticipated crisis situation. Yahoo front page & media sites were expecting a 3X to 4X increase in due to a recent new product launch. Production engineering teams were responsible to provide additional capacity and infrastructure setup in span of 3-4 months to meet the traffic increase demand. This project was successfully delivered in 3 months time with out any major problems. Yahoo Odyssey Award Yahoo December 2009 Won the \"Yahoo Odyssey Award\" for leading a special project commissioned urgently to mitigate an anticipated crisis situation. Yahoo front page & media sites were expecting a 3X to 4X increase in due to a recent new product launch. Production engineering teams were responsible to provide additional capacity and infrastructure setup in span of 3-4 months to meet the traffic increase demand. This project was successfully delivered in 3 months time with out any major problems. Yahoo Odyssey Award Yahoo December 2009 Won the \"Yahoo Odyssey Award\" for leading a special project commissioned urgently to mitigate an anticipated crisis situation. Yahoo front page & media sites were expecting a 3X to 4X increase in due to a recent new product launch. Production engineering teams were responsible to provide additional capacity and infrastructure setup in span of 3-4 months to meet the traffic increase demand. This project was successfully delivered in 3 months time with out any major problems. Additional Honors & Awards Certified Yahoo! Buddy - 2006 Additional Honors & Awards Certified Yahoo! Buddy - 2006 Additional Honors & Awards Certified Yahoo! Buddy - 2006 ", "Summary During my career, I worked at leading companies in Internet and OEM software industries gaining valuable best practices and skills including Leadership, Project management and Communication with executives. Specialties:•\tAgile Product Development \n•\tProgram Management \n•\tSoftware solution delivery Summary During my career, I worked at leading companies in Internet and OEM software industries gaining valuable best practices and skills including Leadership, Project management and Communication with executives. Specialties:•\tAgile Product Development \n•\tProgram Management \n•\tSoftware solution delivery During my career, I worked at leading companies in Internet and OEM software industries gaining valuable best practices and skills including Leadership, Project management and Communication with executives. Specialties:•\tAgile Product Development \n•\tProgram Management \n•\tSoftware solution delivery During my career, I worked at leading companies in Internet and OEM software industries gaining valuable best practices and skills including Leadership, Project management and Communication with executives. Specialties:•\tAgile Product Development \n•\tProgram Management \n•\tSoftware solution delivery Experience APT Program Manager Yahoo! April 2013  – Present (2 years 5 months) Senior Program Manager, Media Buying Life Cycle POD Yahoo! June 2012  –  March 2013  (10 months) Senior Program Manager, Sales Tools Yahoo! May 2010  –  September 2012  (2 years 5 months) Santa Clara, CA Senior Project Manager, Customer Advocacy PMO Yahoo! April 2008  –  March 2010  (2 years) IT Project Manager Saba Software Inc September 2006  –  December 2007  (1 year 4 months) IT Project Manager BEA Systems Inc February 2006  –  September 2006  (8 months) Senior Manager IT Applications Business Objects May 2005  –  January 2006  (9 months) Business Systems Manager Business Objects May 2004  –  May 2005  (1 year 1 month) Senior Project Manager, IT Applications Business Objects May 2003  –  May 2004  (1 year 1 month) Sr. Analyst Siebel Systems July 2000  –  May 2003  (2 years 11 months) PeopleSoft BI Analyst State of Georgia May 1999  –  July 2000  (1 year 3 months) PeopleSoft Analyst Anthem September 1998  –  March 1999  (7 months) APT Program Manager Yahoo! April 2013  – Present (2 years 5 months) APT Program Manager Yahoo! April 2013  – Present (2 years 5 months) Senior Program Manager, Media Buying Life Cycle POD Yahoo! June 2012  –  March 2013  (10 months) Senior Program Manager, Media Buying Life Cycle POD Yahoo! June 2012  –  March 2013  (10 months) Senior Program Manager, Sales Tools Yahoo! May 2010  –  September 2012  (2 years 5 months) Santa Clara, CA Senior Program Manager, Sales Tools Yahoo! May 2010  –  September 2012  (2 years 5 months) Santa Clara, CA Senior Project Manager, Customer Advocacy PMO Yahoo! April 2008  –  March 2010  (2 years) Senior Project Manager, Customer Advocacy PMO Yahoo! April 2008  –  March 2010  (2 years) IT Project Manager Saba Software Inc September 2006  –  December 2007  (1 year 4 months) IT Project Manager Saba Software Inc September 2006  –  December 2007  (1 year 4 months) IT Project Manager BEA Systems Inc February 2006  –  September 2006  (8 months) IT Project Manager BEA Systems Inc February 2006  –  September 2006  (8 months) Senior Manager IT Applications Business Objects May 2005  –  January 2006  (9 months) Senior Manager IT Applications Business Objects May 2005  –  January 2006  (9 months) Business Systems Manager Business Objects May 2004  –  May 2005  (1 year 1 month) Business Systems Manager Business Objects May 2004  –  May 2005  (1 year 1 month) Senior Project Manager, IT Applications Business Objects May 2003  –  May 2004  (1 year 1 month) Senior Project Manager, IT Applications Business Objects May 2003  –  May 2004  (1 year 1 month) Sr. Analyst Siebel Systems July 2000  –  May 2003  (2 years 11 months) Sr. Analyst Siebel Systems July 2000  –  May 2003  (2 years 11 months) PeopleSoft BI Analyst State of Georgia May 1999  –  July 2000  (1 year 3 months) PeopleSoft BI Analyst State of Georgia May 1999  –  July 2000  (1 year 3 months) PeopleSoft Analyst Anthem September 1998  –  March 1999  (7 months) PeopleSoft Analyst Anthem September 1998  –  March 1999  (7 months) Skills PMO ERP Business Analysis SDLC Siebel Business Intelligence Agile Program Management Software Project... Salesforce.com Architecture Team Management Project Portfolio... Scrum Certified Scrum Master... Agile Methodologies CRM Cloud Computing Databases Strategy Requirements Analysis Management Enterprise Software Cross-functional Team... Business Process See 10+     See less Skills  PMO ERP Business Analysis SDLC Siebel Business Intelligence Agile Program Management Software Project... Salesforce.com Architecture Team Management Project Portfolio... Scrum Certified Scrum Master... Agile Methodologies CRM Cloud Computing Databases Strategy Requirements Analysis Management Enterprise Software Cross-functional Team... Business Process See 10+     See less PMO ERP Business Analysis SDLC Siebel Business Intelligence Agile Program Management Software Project... Salesforce.com Architecture Team Management Project Portfolio... Scrum Certified Scrum Master... Agile Methodologies CRM Cloud Computing Databases Strategy Requirements Analysis Management Enterprise Software Cross-functional Team... Business Process See 10+     See less PMO ERP Business Analysis SDLC Siebel Business Intelligence Agile Program Management Software Project... Salesforce.com Architecture Team Management Project Portfolio... Scrum Certified Scrum Master... Agile Methodologies CRM Cloud Computing Databases Strategy Requirements Analysis Management Enterprise Software Cross-functional Team... Business Process See 10+     See less Education National Institute of Technology Calicut Industrial Engineering 1991  – 1993 Nagarjuna University B. Tech 1987  – 1991 Georgia State University - J. Mack Robinson College of Business MBA 2000 National Institute of Technology Calicut Industrial Engineering 1991  – 1993 National Institute of Technology Calicut Industrial Engineering 1991  – 1993 National Institute of Technology Calicut Industrial Engineering 1991  – 1993 Nagarjuna University B. Tech 1987  – 1991 Nagarjuna University B. Tech 1987  – 1991 Nagarjuna University B. Tech 1987  – 1991 Georgia State University - J. Mack Robinson College of Business MBA 2000 Georgia State University - J. Mack Robinson College of Business MBA 2000 Georgia State University - J. Mack Robinson College of Business MBA 2000 ", "", "Skills Program Management Project Management PMP Online Advertising CMS Cross-functional Team... Agile Project Management Agile Methodologies Management Strategy MS Project Leadership Project Planning Product Marketing Integration User Experience Advertising See 2+     See less Skills  Program Management Project Management PMP Online Advertising CMS Cross-functional Team... Agile Project Management Agile Methodologies Management Strategy MS Project Leadership Project Planning Product Marketing Integration User Experience Advertising See 2+     See less Program Management Project Management PMP Online Advertising CMS Cross-functional Team... Agile Project Management Agile Methodologies Management Strategy MS Project Leadership Project Planning Product Marketing Integration User Experience Advertising See 2+     See less Program Management Project Management PMP Online Advertising CMS Cross-functional Team... Agile Project Management Agile Methodologies Management Strategy MS Project Leadership Project Planning Product Marketing Integration User Experience Advertising See 2+     See less ", "Summary Accomplished Project and Program Manager with 20 years experience in computer software, hardware and Internet industries. \n \nCUTTING EDGE: Key member of Apple’s Macintosh team in 1984 and iPod team in 2001; Yahoo’s Panama ad system team in 2006; and LinkedIn's new SF Engineering Office team in 2014. \nCREATOR: Design, implement, and continually refine innovative communication methods and cultural activities. \nCOMMUNICATOR: Consummate communicator across all management levels and mediums: printed, oral, and presentation. \nLEADER: Form, lead, coach, and mentor action-oriented teams and programs - I get it done. Summary Accomplished Project and Program Manager with 20 years experience in computer software, hardware and Internet industries. \n \nCUTTING EDGE: Key member of Apple’s Macintosh team in 1984 and iPod team in 2001; Yahoo’s Panama ad system team in 2006; and LinkedIn's new SF Engineering Office team in 2014. \nCREATOR: Design, implement, and continually refine innovative communication methods and cultural activities. \nCOMMUNICATOR: Consummate communicator across all management levels and mediums: printed, oral, and presentation. \nLEADER: Form, lead, coach, and mentor action-oriented teams and programs - I get it done. Accomplished Project and Program Manager with 20 years experience in computer software, hardware and Internet industries. \n \nCUTTING EDGE: Key member of Apple’s Macintosh team in 1984 and iPod team in 2001; Yahoo’s Panama ad system team in 2006; and LinkedIn's new SF Engineering Office team in 2014. \nCREATOR: Design, implement, and continually refine innovative communication methods and cultural activities. \nCOMMUNICATOR: Consummate communicator across all management levels and mediums: printed, oral, and presentation. \nLEADER: Form, lead, coach, and mentor action-oriented teams and programs - I get it done. Accomplished Project and Program Manager with 20 years experience in computer software, hardware and Internet industries. \n \nCUTTING EDGE: Key member of Apple’s Macintosh team in 1984 and iPod team in 2001; Yahoo’s Panama ad system team in 2006; and LinkedIn's new SF Engineering Office team in 2014. \nCREATOR: Design, implement, and continually refine innovative communication methods and cultural activities. \nCOMMUNICATOR: Consummate communicator across all management levels and mediums: printed, oral, and presentation. \nLEADER: Form, lead, coach, and mentor action-oriented teams and programs - I get it done. Experience Staff Technical Program Manager, Performance Tools LinkedIn August 2014  – Present (1 year 1 month) Mountain View, CA Staff Technical Program Manager, SF Engineering Office LinkedIn June 2014  –  August 2014  (3 months) Mountain View, CA Senior Technical Program Manager, Consumer Engineering LinkedIn 2011  –  May 2014  (3 years) Mountain View, CA Senior Program Manager, Mobile Yahoo! 2008  –  2011  (3 years) Sunnyvale, CA Senior Program Manager, Sponsored Search Yahoo! 2006  –  2008  (2 years) Sunnyvale, CA Senior Program Manager, iPod Division Apple Inc. 2004  –  2006  (2 years) Software Program Manager, iPod Engineering Apple 2001  –  2004  (3 years) Various roles Apple 1984  –  1997  (13 years) Cupertino, CA Staff Technical Program Manager, Performance Tools LinkedIn August 2014  – Present (1 year 1 month) Mountain View, CA Staff Technical Program Manager, Performance Tools LinkedIn August 2014  – Present (1 year 1 month) Mountain View, CA Staff Technical Program Manager, SF Engineering Office LinkedIn June 2014  –  August 2014  (3 months) Mountain View, CA Staff Technical Program Manager, SF Engineering Office LinkedIn June 2014  –  August 2014  (3 months) Mountain View, CA Senior Technical Program Manager, Consumer Engineering LinkedIn 2011  –  May 2014  (3 years) Mountain View, CA Senior Technical Program Manager, Consumer Engineering LinkedIn 2011  –  May 2014  (3 years) Mountain View, CA Senior Program Manager, Mobile Yahoo! 2008  –  2011  (3 years) Sunnyvale, CA Senior Program Manager, Mobile Yahoo! 2008  –  2011  (3 years) Sunnyvale, CA Senior Program Manager, Sponsored Search Yahoo! 2006  –  2008  (2 years) Sunnyvale, CA Senior Program Manager, Sponsored Search Yahoo! 2006  –  2008  (2 years) Sunnyvale, CA Senior Program Manager, iPod Division Apple Inc. 2004  –  2006  (2 years) Senior Program Manager, iPod Division Apple Inc. 2004  –  2006  (2 years) Software Program Manager, iPod Engineering Apple 2001  –  2004  (3 years) Software Program Manager, iPod Engineering Apple 2001  –  2004  (3 years) Various roles Apple 1984  –  1997  (13 years) Cupertino, CA Various roles Apple 1984  –  1997  (13 years) Cupertino, CA Languages   Skills Program Management Project Planning Product Development Project Coordination Cross-functional Team... Communication Process Improvement Team Building Coaching Product Management Software Project... Project Management Leadership Software Engineering User Experience Social Media See 1+     See less Skills  Program Management Project Planning Product Development Project Coordination Cross-functional Team... Communication Process Improvement Team Building Coaching Product Management Software Project... Project Management Leadership Software Engineering User Experience Social Media See 1+     See less Program Management Project Planning Product Development Project Coordination Cross-functional Team... Communication Process Improvement Team Building Coaching Product Management Software Project... Project Management Leadership Software Engineering User Experience Social Media See 1+     See less Program Management Project Planning Product Development Project Coordination Cross-functional Team... Communication Process Improvement Team Building Coaching Product Management Software Project... Project Management Leadership Software Engineering User Experience Social Media See 1+     See less Honors & Awards ", "Summary I am a highly motivated Program Manager, having successfully delivered many large-scale infrastructure and CIO programs throughout the Asia Pacific Region at Yahoo. Prior to joining Yahoo I worked at Oracle and HP in Business Development and Sales Operations roles. I am qualified in Agile and PMP and draw upon these methodologies to deliver, I am tenacious and business focused, have good communication/ interpersonal skills and strong stakeholder management skills.  \n \nSpecialties: Program/Project Management, Enterprise Program Portfolio Mangement, Stakeholder Management, IT Service Delivery, Service Matrix Management, Business Analysis/Planning, Service Contract Management, Sales Operations Summary I am a highly motivated Program Manager, having successfully delivered many large-scale infrastructure and CIO programs throughout the Asia Pacific Region at Yahoo. Prior to joining Yahoo I worked at Oracle and HP in Business Development and Sales Operations roles. I am qualified in Agile and PMP and draw upon these methodologies to deliver, I am tenacious and business focused, have good communication/ interpersonal skills and strong stakeholder management skills.  \n \nSpecialties: Program/Project Management, Enterprise Program Portfolio Mangement, Stakeholder Management, IT Service Delivery, Service Matrix Management, Business Analysis/Planning, Service Contract Management, Sales Operations I am a highly motivated Program Manager, having successfully delivered many large-scale infrastructure and CIO programs throughout the Asia Pacific Region at Yahoo. Prior to joining Yahoo I worked at Oracle and HP in Business Development and Sales Operations roles. I am qualified in Agile and PMP and draw upon these methodologies to deliver, I am tenacious and business focused, have good communication/ interpersonal skills and strong stakeholder management skills.  \n \nSpecialties: Program/Project Management, Enterprise Program Portfolio Mangement, Stakeholder Management, IT Service Delivery, Service Matrix Management, Business Analysis/Planning, Service Contract Management, Sales Operations I am a highly motivated Program Manager, having successfully delivered many large-scale infrastructure and CIO programs throughout the Asia Pacific Region at Yahoo. Prior to joining Yahoo I worked at Oracle and HP in Business Development and Sales Operations roles. I am qualified in Agile and PMP and draw upon these methodologies to deliver, I am tenacious and business focused, have good communication/ interpersonal skills and strong stakeholder management skills.  \n \nSpecialties: Program/Project Management, Enterprise Program Portfolio Mangement, Stakeholder Management, IT Service Delivery, Service Matrix Management, Business Analysis/Planning, Service Contract Management, Sales Operations Experience Program Manager - Strategic Operations, CIO & Infrastructure Yahoo! April 2013  – Present (2 years 5 months) Singapore - Y! Software Asset Management Program  \n- Technical Integration Management \n- Clockwork Program : successfully executed operational assessment program on Yahoo!’s Outsourced Development Centers(7 vendors globally) increasing their operational efficiencies by 35% Y-o-Y from 58% to 93%. \n- Capital Allocation Request Process roll out APAC Program Manager - Infrasturcture Rewire, Central Tech Yahoo! October 2010  –  March 2013  (2 years 6 months) singapore - Rewire Program : Lead the Infrastructure Rewire Program in Asia Pacific. The program involved the closure and migration of number of significant sized data centers throughout APAC between 2010 and 2013 and achieved U$17M savings in Asia Pacific. I managed all aspects of the program, i.e. planning, reporting, communication and delivery, working with numerous technical teams and senior managements throughout the region and in the US. APAC Service Delivery Manager, Operations Management, Central Tech Yahoo! April 2010  –  October 2010  (7 months) Managed operational service delivery to APAC major properties i.e. E-Commerce, Media, Connections thru interactions with Service Engineering Leaders in Taiwan and Hong Kong APAC Project Manager - Production Operations Yahoo! November 2008  –  March 2010  (1 year 5 months) - Managed Datacenter Operations Projects (DC Build / Expansion / Optimization, Tools & Processes, Infra Initiatives) \n- Liaised with infra strategy team for project initiation & planning  \n- Collaborated with international PM team to develop shared operational performance drivers and key metrics Business analyst - Business Development Oracle November 2006  –  October 2008  (2 years) - Created comprehensive business intelligence reports detailing performance, yearly trends and target comparisons for product/partner performance and quarterly outlook \n- Managed/ Organized for sales planning and performance reviews such as setting, QBR, strategic account planning, Go to Market Planning \n- Responsible for sales performance reporting to AP senior management  \n- Developed/ Executed sales training and promotion programs with AP HQ BD team \n- Coordinated/ Resolved international revenue transfer & related issues across LOB Consulting Contract Specialist - Finance Oracle March 2004  –  October 2006  (2 years 8 months) Sales Operations - Service Sales Hewlett-Packard December 2001  –  February 2004  (2 years 3 months) License Contract Specialist - F&A IBM January 2000  –  November 2001  (1 year 11 months) Program Manager - Strategic Operations, CIO & Infrastructure Yahoo! April 2013  – Present (2 years 5 months) Singapore - Y! Software Asset Management Program  \n- Technical Integration Management \n- Clockwork Program : successfully executed operational assessment program on Yahoo!’s Outsourced Development Centers(7 vendors globally) increasing their operational efficiencies by 35% Y-o-Y from 58% to 93%. \n- Capital Allocation Request Process roll out Program Manager - Strategic Operations, CIO & Infrastructure Yahoo! April 2013  – Present (2 years 5 months) Singapore - Y! Software Asset Management Program  \n- Technical Integration Management \n- Clockwork Program : successfully executed operational assessment program on Yahoo!’s Outsourced Development Centers(7 vendors globally) increasing their operational efficiencies by 35% Y-o-Y from 58% to 93%. \n- Capital Allocation Request Process roll out APAC Program Manager - Infrasturcture Rewire, Central Tech Yahoo! October 2010  –  March 2013  (2 years 6 months) singapore - Rewire Program : Lead the Infrastructure Rewire Program in Asia Pacific. The program involved the closure and migration of number of significant sized data centers throughout APAC between 2010 and 2013 and achieved U$17M savings in Asia Pacific. I managed all aspects of the program, i.e. planning, reporting, communication and delivery, working with numerous technical teams and senior managements throughout the region and in the US. APAC Program Manager - Infrasturcture Rewire, Central Tech Yahoo! October 2010  –  March 2013  (2 years 6 months) singapore - Rewire Program : Lead the Infrastructure Rewire Program in Asia Pacific. The program involved the closure and migration of number of significant sized data centers throughout APAC between 2010 and 2013 and achieved U$17M savings in Asia Pacific. I managed all aspects of the program, i.e. planning, reporting, communication and delivery, working with numerous technical teams and senior managements throughout the region and in the US. APAC Service Delivery Manager, Operations Management, Central Tech Yahoo! April 2010  –  October 2010  (7 months) Managed operational service delivery to APAC major properties i.e. E-Commerce, Media, Connections thru interactions with Service Engineering Leaders in Taiwan and Hong Kong APAC Service Delivery Manager, Operations Management, Central Tech Yahoo! April 2010  –  October 2010  (7 months) Managed operational service delivery to APAC major properties i.e. E-Commerce, Media, Connections thru interactions with Service Engineering Leaders in Taiwan and Hong Kong APAC Project Manager - Production Operations Yahoo! November 2008  –  March 2010  (1 year 5 months) - Managed Datacenter Operations Projects (DC Build / Expansion / Optimization, Tools & Processes, Infra Initiatives) \n- Liaised with infra strategy team for project initiation & planning  \n- Collaborated with international PM team to develop shared operational performance drivers and key metrics APAC Project Manager - Production Operations Yahoo! November 2008  –  March 2010  (1 year 5 months) - Managed Datacenter Operations Projects (DC Build / Expansion / Optimization, Tools & Processes, Infra Initiatives) \n- Liaised with infra strategy team for project initiation & planning  \n- Collaborated with international PM team to develop shared operational performance drivers and key metrics Business analyst - Business Development Oracle November 2006  –  October 2008  (2 years) - Created comprehensive business intelligence reports detailing performance, yearly trends and target comparisons for product/partner performance and quarterly outlook \n- Managed/ Organized for sales planning and performance reviews such as setting, QBR, strategic account planning, Go to Market Planning \n- Responsible for sales performance reporting to AP senior management  \n- Developed/ Executed sales training and promotion programs with AP HQ BD team \n- Coordinated/ Resolved international revenue transfer & related issues across LOB Business analyst - Business Development Oracle November 2006  –  October 2008  (2 years) - Created comprehensive business intelligence reports detailing performance, yearly trends and target comparisons for product/partner performance and quarterly outlook \n- Managed/ Organized for sales planning and performance reviews such as setting, QBR, strategic account planning, Go to Market Planning \n- Responsible for sales performance reporting to AP senior management  \n- Developed/ Executed sales training and promotion programs with AP HQ BD team \n- Coordinated/ Resolved international revenue transfer & related issues across LOB Consulting Contract Specialist - Finance Oracle March 2004  –  October 2006  (2 years 8 months) Consulting Contract Specialist - Finance Oracle March 2004  –  October 2006  (2 years 8 months) Sales Operations - Service Sales Hewlett-Packard December 2001  –  February 2004  (2 years 3 months) Sales Operations - Service Sales Hewlett-Packard December 2001  –  February 2004  (2 years 3 months) License Contract Specialist - F&A IBM January 2000  –  November 2001  (1 year 11 months) License Contract Specialist - F&A IBM January 2000  –  November 2001  (1 year 11 months) Languages Korean Native or bilingual proficiency English Full professional proficiency Korean Native or bilingual proficiency English Full professional proficiency Korean Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Program Management Project Management Project Planning Stakeholder Management Business Analysis IT Service Delivery Data Center PMP Enterprise Software Business Intelligence Outsourcing PMO Service Delivery Strategy Cloud Computing Consulting Go-to-market Strategy Integration Management See 4+     See less Skills  Program Management Project Management Project Planning Stakeholder Management Business Analysis IT Service Delivery Data Center PMP Enterprise Software Business Intelligence Outsourcing PMO Service Delivery Strategy Cloud Computing Consulting Go-to-market Strategy Integration Management See 4+     See less Program Management Project Management Project Planning Stakeholder Management Business Analysis IT Service Delivery Data Center PMP Enterprise Software Business Intelligence Outsourcing PMO Service Delivery Strategy Cloud Computing Consulting Go-to-market Strategy Integration Management See 4+     See less Program Management Project Management Project Planning Stakeholder Management Business Analysis IT Service Delivery Data Center PMP Enterprise Software Business Intelligence Outsourcing PMO Service Delivery Strategy Cloud Computing Consulting Go-to-market Strategy Integration Management See 4+     See less ", "Skills Mobile Marketing Online Advertising FMCG Interactive Marketing Video Advertising Digital Strategy Web Analytics Web Development Social Networking Digital Marketing Certified Scrum Master... Scrum Product Owner... Social Media Marketing Marketing Project Delivery Project Estimation Project Management Email Marketing Project Planning CRM User Interface Design Direct Marketing E-commerce User Experience See 10+     See less Skills  Mobile Marketing Online Advertising FMCG Interactive Marketing Video Advertising Digital Strategy Web Analytics Web Development Social Networking Digital Marketing Certified Scrum Master... Scrum Product Owner... Social Media Marketing Marketing Project Delivery Project Estimation Project Management Email Marketing Project Planning CRM User Interface Design Direct Marketing E-commerce User Experience See 10+     See less Mobile Marketing Online Advertising FMCG Interactive Marketing Video Advertising Digital Strategy Web Analytics Web Development Social Networking Digital Marketing Certified Scrum Master... Scrum Product Owner... Social Media Marketing Marketing Project Delivery Project Estimation Project Management Email Marketing Project Planning CRM User Interface Design Direct Marketing E-commerce User Experience See 10+     See less Mobile Marketing Online Advertising FMCG Interactive Marketing Video Advertising Digital Strategy Web Analytics Web Development Social Networking Digital Marketing Certified Scrum Master... Scrum Product Owner... Social Media Marketing Marketing Project Delivery Project Estimation Project Management Email Marketing Project Planning CRM User Interface Design Direct Marketing E-commerce User Experience See 10+     See less ", "Summary Results-driven technical manager with extensive experience in leading teams and delivering Cloud Platform solutions, Web applications, Mobile platform, and E-commerce systems. Passion for building innovative software with new technologies. Summary Results-driven technical manager with extensive experience in leading teams and delivering Cloud Platform solutions, Web applications, Mobile platform, and E-commerce systems. Passion for building innovative software with new technologies. Results-driven technical manager with extensive experience in leading teams and delivering Cloud Platform solutions, Web applications, Mobile platform, and E-commerce systems. Passion for building innovative software with new technologies. Results-driven technical manager with extensive experience in leading teams and delivering Cloud Platform solutions, Web applications, Mobile platform, and E-commerce systems. Passion for building innovative software with new technologies. Skills Skills     ", "Summary IT Project / Program Manager (PMP Certified) / Certified Scrum Master & Product Owner (CSM & CSPO) / Support Engineer (ITILv3 Certified) with experience driving initiatives across global organizations with the goal of process improvement and cost efficiency. \n \nProject Management Experience in fields including: IT Hardware Asset Management, Software Asset Management, Telephony Systems, Networking (WiFi and RSA), Knowledge Management, Reporting & Metrics, Onboarding & Offboarding \n \nHighly task-oriented with great time management and communication skills and a passion towards training and documentation \n \nSpecialties: - PMP, ITILv3 Foundation, CSPO, and CSM Summary IT Project / Program Manager (PMP Certified) / Certified Scrum Master & Product Owner (CSM & CSPO) / Support Engineer (ITILv3 Certified) with experience driving initiatives across global organizations with the goal of process improvement and cost efficiency. \n \nProject Management Experience in fields including: IT Hardware Asset Management, Software Asset Management, Telephony Systems, Networking (WiFi and RSA), Knowledge Management, Reporting & Metrics, Onboarding & Offboarding \n \nHighly task-oriented with great time management and communication skills and a passion towards training and documentation \n \nSpecialties: - PMP, ITILv3 Foundation, CSPO, and CSM IT Project / Program Manager (PMP Certified) / Certified Scrum Master & Product Owner (CSM & CSPO) / Support Engineer (ITILv3 Certified) with experience driving initiatives across global organizations with the goal of process improvement and cost efficiency. \n \nProject Management Experience in fields including: IT Hardware Asset Management, Software Asset Management, Telephony Systems, Networking (WiFi and RSA), Knowledge Management, Reporting & Metrics, Onboarding & Offboarding \n \nHighly task-oriented with great time management and communication skills and a passion towards training and documentation \n \nSpecialties: - PMP, ITILv3 Foundation, CSPO, and CSM IT Project / Program Manager (PMP Certified) / Certified Scrum Master & Product Owner (CSM & CSPO) / Support Engineer (ITILv3 Certified) with experience driving initiatives across global organizations with the goal of process improvement and cost efficiency. \n \nProject Management Experience in fields including: IT Hardware Asset Management, Software Asset Management, Telephony Systems, Networking (WiFi and RSA), Knowledge Management, Reporting & Metrics, Onboarding & Offboarding \n \nHighly task-oriented with great time management and communication skills and a passion towards training and documentation \n \nSpecialties: - PMP, ITILv3 Foundation, CSPO, and CSM Experience Technical Program Manager, Global Information Systems Yahoo May 2015  – Present (4 months) Sunnyvale, California • Oversee the planning, execution, and analysis of a project portfolio that consists of 270+ projects and 11 Global Information System teams, including: IT Networking, IT Infrastructure, Business Planning & Operations, Telecom, UNIX, Storage, System Engineering & Virtualization, Global IT Services, Collaborative Media Engineering, Enterprise Technology Engineering, and Client Engineering. Work with each team to track projects, manage cross-functional dependencies, and ensure resources are properly allocated and aligned to organizational priorities.  \n \n• Partnering with REW, Business Planning & Operations, Collaborative Media Engineering, Global IT Services, and System Engineering & Virtualization teams, manage the end-to-end program of rolling out Google Hangouts to up to 1,000 conference rooms globally. Increasing our video-enabled footprint from 18% to 90+% \n \n• Coordinate with internal ServiceNow Developers, Business Planning & Operations, Global IT Services, and Mobility Collaboration team to manage the migration of company-ordered smart phones from an internal intranet site to ServiceNow. The project will reduce (or eliminate) the cost to employee roaming charges, automate many operational tasks for support teams, and align teams around a globally-managed and centralized solution that reduces manual single points of failure Information Systems Project / Program Manager Yahoo April 2014  –  May 2015  (1 year 2 months) Sunnyvale, California • Work with Core Product teams to help define support models, training, documentation, communication plans, and provide project support to all stakeholders and peripherals teams in the the global implementation of Corp Mail (Yahoo Mail) and Google Calendar to all internal employees and M&A's \n \n• Implement a Paranoid (Security) project that aims to reduce company-wide exposure to malware, viruses, and other security threats by transitioning to a Mac and Linux-only environment. Oversee a budget of over $10MM for new hardware, peripherals, and software across all regions of the company. Provide requirements for development of a portal for employees to request their new hardware and oversee an end-to-end support (training, documentation, and communication) process, while prioritizing Windows exceptions request where required \n \n• Enable Global Collaboration of internal Yahoo employees by leading technical cross-functional teams (NetOps, SecOps, Paranoids, Central Technology, Corporate Applications, Telecom, Global Deskside, and Service Desk) through Operational Readiness and Site Migration tasks prepare Tier-1, 2 and 3 support teams to support new technologies including Vidyo and Cisco UC (Jabber Voice). Post-launch coordinate with all teams on Continual Service Improvements by enabling Asterisk decommissioning, removal of Desk Phones, and turning on VPN-less Jabber communication \n \n• Coordinate with the Networking, Security, and Information Security Operations teams to launch a new wireless network and integrate of RSA 8 globally to all offices. Manage support tasks by interfacing with Client Engineering, Central Technology, Global Deskside and Service Desk teams and plan for proper SSID decommissioning tasks to increase network bandwidth \n \n• Enable IT improvements through projects that require Legal, Finance, and Procurement negotiations with vendors that will improve or build on Remote Chat and Software Asset Management internally Global Service Desk Project Manager Yahoo! December 2011  –  March 2014  (2 years 4 months) sunnyvale, california • Manage execution of procurement, security, and legal review of a new remote collaboration support tool (Bomgar) and its integration within ServiceNow. Explore ways to automate Software Asset Management, License Management, and Audit Compliance by partnering with select vendors. Re-engineer processes that require updating due to ServiceNow roll out and provide Continual Service Improvements through activities that involve researching new vendor relationships for products to improve Tier-1 Employee Support  \n \n• Act as an IT business stakeholder for ServiceNow roll out to the entire IT organization, including such modules as: Service Request Fulfillment, Incident Management, Asset Management, Knowledge Management, Account Provisioning, and Configuration Management. Previously worked as the Scrum Product Owner for the Corporate Applications implementation and lead an agile development team through grooming and estimating activities and prioritizing requirements throughout IT \n \n• Mentor Global IT organization on basic project management skills through SMART goal setting, milestone planning and metric analysis. Coach team on how to measure goals effectively for success while removing roadblocks that come up during course of project and goal completion \n \n• Gather metrics, project updates, staffing plans, and other business operations to be presented in the IT Quarterly Business Review as well as prepare all other Global Service Desk presentations to enable IT management to make decisions regarding the business unit Global IT Operations - QoS, Q/A & Knowledge Management Yahoo! March 2011  –  December 2011  (10 months) Santa Clara, California • Manage projects that improve effectiveness of Employee Support by identifying and implementing \"efficiency opportunities\", with a goal of lowering cost and increasing capacity to allow reallocation of infrastructure tasks to lower cost centers \n \n• Increase Employee Support efficiencies through ticket monitoring process creation, a redesigned content management system (CMS), centralization of telecom account provisioning / termination processes, introduction of a global service catalog and publication of IT service level agreements (SLAs) \n \n• Globally standardize change management submission and execution process through consistent and centralized documentation and training, define and implement global internal transfer process through discussions with IT, REW, and HR teams, and lead communication efforts across Global IT Operations organization \n \n• Define project requirements, determine stakeholders, manage projects through definition, scoping, development, implementation, and production release phases \n \n• Create necessary technical documentation, conduct employee training, and communicate process changes to all teams Global Service Desk, Escalations & Training Technician (Tier-2) Yahoo! October 2009  –  March 2011  (1 year 6 months) Santa Clara, California •\tProvide support for all internal Yahoo! Employees on multiple platforms (Windows, Linux, and Mac), that cannot be resolved at the Tier-1 Level on a wide range of problems, including (but not limited to): Exchange administration, Linux support, Windows/Mac OS application troubleshooting, and user network (remote and local) configuration \n \n•\tOversee, Manage, and Execute on projects ranging from integrating deployment and configuration of new hire phone systems into Tier-1 job responsibilities to documenting new applications and processes for a global Windows 7 roll-out;  \n \n•\tAdminister internal knowledge base through creation of technical documentation, develop training programs and provide user training as needed and help improve customer service within the Global Service Desk \n \n•\tExpand experience in IIS, DNS, FTP, SMTP, POP3, HTTP, SCP, Exchange Administration, Group Policies, Security Groups, File Security, Organizational Units, and, VoIP Telecom Systems \n \n•\tManage incidents by tracking support requests until resolved and provide excellent customer service while maintaining an effective relationship with all users Global Service Desk Technician (Tier-1) Yahoo! September 2007  –  September 2009  (2 years 1 month) Sunnyvale / Santa Clara, California •\tProvide support for all internal Yahoo! Employees on multiple platforms (Windows, Linux, and Mac), with a variety of issues including the diagnosing and troubleshooting of HP desktop/laptop and network service issues \n \n•\tGain upon and learn skills related to mobile PC and laptop hardware/software support, Office 2003/2007/2008 Application Suites, TCP/IP, VPN, Windows AD Domain, File sharing, and, Printer mapping \n \n•\tManage incidents by tracking support requests until resolved and provide excellent customer service while maintaining an effective relationship with all users \n \n•\tSupport internal software applications, deploy software, conduct user training as necessary, and write specific technical documentation for internal knowledge base \n \n•\tUsage of standard IBM, HP, Dell, Linux, and Macintosh mobile, laptop, and desktop platforms with expanded knowledge of an enterprise-level ticketing system Tier II NOC Intern Yahoo! June 2007  –  August 2007  (3 months) Sunnyvale, California • Aid Network Operations Control team in determining failures in monitoring architecture that are due to misconfigurations \n \n• Audit production environment and compare with tools and other data sources to ensure that production environment are accurate \n \n• Write PERL scripts that solve various device misconfiguration problems to implement change in the authoritative operations database \n \n• Created internal web-based tool that checks for certain device issues and allows for analysis of data and resolution of problem  \n \n• Problem solve and troubleshoot MySQL database queries and PERL scripts \n \n• Track all device misconfiguration changes and keep an up-to-date documentation page Technical Program Manager, Global Information Systems Yahoo May 2015  – Present (4 months) Sunnyvale, California • Oversee the planning, execution, and analysis of a project portfolio that consists of 270+ projects and 11 Global Information System teams, including: IT Networking, IT Infrastructure, Business Planning & Operations, Telecom, UNIX, Storage, System Engineering & Virtualization, Global IT Services, Collaborative Media Engineering, Enterprise Technology Engineering, and Client Engineering. Work with each team to track projects, manage cross-functional dependencies, and ensure resources are properly allocated and aligned to organizational priorities.  \n \n• Partnering with REW, Business Planning & Operations, Collaborative Media Engineering, Global IT Services, and System Engineering & Virtualization teams, manage the end-to-end program of rolling out Google Hangouts to up to 1,000 conference rooms globally. Increasing our video-enabled footprint from 18% to 90+% \n \n• Coordinate with internal ServiceNow Developers, Business Planning & Operations, Global IT Services, and Mobility Collaboration team to manage the migration of company-ordered smart phones from an internal intranet site to ServiceNow. The project will reduce (or eliminate) the cost to employee roaming charges, automate many operational tasks for support teams, and align teams around a globally-managed and centralized solution that reduces manual single points of failure Technical Program Manager, Global Information Systems Yahoo May 2015  – Present (4 months) Sunnyvale, California • Oversee the planning, execution, and analysis of a project portfolio that consists of 270+ projects and 11 Global Information System teams, including: IT Networking, IT Infrastructure, Business Planning & Operations, Telecom, UNIX, Storage, System Engineering & Virtualization, Global IT Services, Collaborative Media Engineering, Enterprise Technology Engineering, and Client Engineering. Work with each team to track projects, manage cross-functional dependencies, and ensure resources are properly allocated and aligned to organizational priorities.  \n \n• Partnering with REW, Business Planning & Operations, Collaborative Media Engineering, Global IT Services, and System Engineering & Virtualization teams, manage the end-to-end program of rolling out Google Hangouts to up to 1,000 conference rooms globally. Increasing our video-enabled footprint from 18% to 90+% \n \n• Coordinate with internal ServiceNow Developers, Business Planning & Operations, Global IT Services, and Mobility Collaboration team to manage the migration of company-ordered smart phones from an internal intranet site to ServiceNow. The project will reduce (or eliminate) the cost to employee roaming charges, automate many operational tasks for support teams, and align teams around a globally-managed and centralized solution that reduces manual single points of failure Information Systems Project / Program Manager Yahoo April 2014  –  May 2015  (1 year 2 months) Sunnyvale, California • Work with Core Product teams to help define support models, training, documentation, communication plans, and provide project support to all stakeholders and peripherals teams in the the global implementation of Corp Mail (Yahoo Mail) and Google Calendar to all internal employees and M&A's \n \n• Implement a Paranoid (Security) project that aims to reduce company-wide exposure to malware, viruses, and other security threats by transitioning to a Mac and Linux-only environment. Oversee a budget of over $10MM for new hardware, peripherals, and software across all regions of the company. Provide requirements for development of a portal for employees to request their new hardware and oversee an end-to-end support (training, documentation, and communication) process, while prioritizing Windows exceptions request where required \n \n• Enable Global Collaboration of internal Yahoo employees by leading technical cross-functional teams (NetOps, SecOps, Paranoids, Central Technology, Corporate Applications, Telecom, Global Deskside, and Service Desk) through Operational Readiness and Site Migration tasks prepare Tier-1, 2 and 3 support teams to support new technologies including Vidyo and Cisco UC (Jabber Voice). Post-launch coordinate with all teams on Continual Service Improvements by enabling Asterisk decommissioning, removal of Desk Phones, and turning on VPN-less Jabber communication \n \n• Coordinate with the Networking, Security, and Information Security Operations teams to launch a new wireless network and integrate of RSA 8 globally to all offices. Manage support tasks by interfacing with Client Engineering, Central Technology, Global Deskside and Service Desk teams and plan for proper SSID decommissioning tasks to increase network bandwidth \n \n• Enable IT improvements through projects that require Legal, Finance, and Procurement negotiations with vendors that will improve or build on Remote Chat and Software Asset Management internally Information Systems Project / Program Manager Yahoo April 2014  –  May 2015  (1 year 2 months) Sunnyvale, California • Work with Core Product teams to help define support models, training, documentation, communication plans, and provide project support to all stakeholders and peripherals teams in the the global implementation of Corp Mail (Yahoo Mail) and Google Calendar to all internal employees and M&A's \n \n• Implement a Paranoid (Security) project that aims to reduce company-wide exposure to malware, viruses, and other security threats by transitioning to a Mac and Linux-only environment. Oversee a budget of over $10MM for new hardware, peripherals, and software across all regions of the company. Provide requirements for development of a portal for employees to request their new hardware and oversee an end-to-end support (training, documentation, and communication) process, while prioritizing Windows exceptions request where required \n \n• Enable Global Collaboration of internal Yahoo employees by leading technical cross-functional teams (NetOps, SecOps, Paranoids, Central Technology, Corporate Applications, Telecom, Global Deskside, and Service Desk) through Operational Readiness and Site Migration tasks prepare Tier-1, 2 and 3 support teams to support new technologies including Vidyo and Cisco UC (Jabber Voice). Post-launch coordinate with all teams on Continual Service Improvements by enabling Asterisk decommissioning, removal of Desk Phones, and turning on VPN-less Jabber communication \n \n• Coordinate with the Networking, Security, and Information Security Operations teams to launch a new wireless network and integrate of RSA 8 globally to all offices. Manage support tasks by interfacing with Client Engineering, Central Technology, Global Deskside and Service Desk teams and plan for proper SSID decommissioning tasks to increase network bandwidth \n \n• Enable IT improvements through projects that require Legal, Finance, and Procurement negotiations with vendors that will improve or build on Remote Chat and Software Asset Management internally Global Service Desk Project Manager Yahoo! December 2011  –  March 2014  (2 years 4 months) sunnyvale, california • Manage execution of procurement, security, and legal review of a new remote collaboration support tool (Bomgar) and its integration within ServiceNow. Explore ways to automate Software Asset Management, License Management, and Audit Compliance by partnering with select vendors. Re-engineer processes that require updating due to ServiceNow roll out and provide Continual Service Improvements through activities that involve researching new vendor relationships for products to improve Tier-1 Employee Support  \n \n• Act as an IT business stakeholder for ServiceNow roll out to the entire IT organization, including such modules as: Service Request Fulfillment, Incident Management, Asset Management, Knowledge Management, Account Provisioning, and Configuration Management. Previously worked as the Scrum Product Owner for the Corporate Applications implementation and lead an agile development team through grooming and estimating activities and prioritizing requirements throughout IT \n \n• Mentor Global IT organization on basic project management skills through SMART goal setting, milestone planning and metric analysis. Coach team on how to measure goals effectively for success while removing roadblocks that come up during course of project and goal completion \n \n• Gather metrics, project updates, staffing plans, and other business operations to be presented in the IT Quarterly Business Review as well as prepare all other Global Service Desk presentations to enable IT management to make decisions regarding the business unit Global Service Desk Project Manager Yahoo! December 2011  –  March 2014  (2 years 4 months) sunnyvale, california • Manage execution of procurement, security, and legal review of a new remote collaboration support tool (Bomgar) and its integration within ServiceNow. Explore ways to automate Software Asset Management, License Management, and Audit Compliance by partnering with select vendors. Re-engineer processes that require updating due to ServiceNow roll out and provide Continual Service Improvements through activities that involve researching new vendor relationships for products to improve Tier-1 Employee Support  \n \n• Act as an IT business stakeholder for ServiceNow roll out to the entire IT organization, including such modules as: Service Request Fulfillment, Incident Management, Asset Management, Knowledge Management, Account Provisioning, and Configuration Management. Previously worked as the Scrum Product Owner for the Corporate Applications implementation and lead an agile development team through grooming and estimating activities and prioritizing requirements throughout IT \n \n• Mentor Global IT organization on basic project management skills through SMART goal setting, milestone planning and metric analysis. Coach team on how to measure goals effectively for success while removing roadblocks that come up during course of project and goal completion \n \n• Gather metrics, project updates, staffing plans, and other business operations to be presented in the IT Quarterly Business Review as well as prepare all other Global Service Desk presentations to enable IT management to make decisions regarding the business unit Global IT Operations - QoS, Q/A & Knowledge Management Yahoo! March 2011  –  December 2011  (10 months) Santa Clara, California • Manage projects that improve effectiveness of Employee Support by identifying and implementing \"efficiency opportunities\", with a goal of lowering cost and increasing capacity to allow reallocation of infrastructure tasks to lower cost centers \n \n• Increase Employee Support efficiencies through ticket monitoring process creation, a redesigned content management system (CMS), centralization of telecom account provisioning / termination processes, introduction of a global service catalog and publication of IT service level agreements (SLAs) \n \n• Globally standardize change management submission and execution process through consistent and centralized documentation and training, define and implement global internal transfer process through discussions with IT, REW, and HR teams, and lead communication efforts across Global IT Operations organization \n \n• Define project requirements, determine stakeholders, manage projects through definition, scoping, development, implementation, and production release phases \n \n• Create necessary technical documentation, conduct employee training, and communicate process changes to all teams Global IT Operations - QoS, Q/A & Knowledge Management Yahoo! March 2011  –  December 2011  (10 months) Santa Clara, California • Manage projects that improve effectiveness of Employee Support by identifying and implementing \"efficiency opportunities\", with a goal of lowering cost and increasing capacity to allow reallocation of infrastructure tasks to lower cost centers \n \n• Increase Employee Support efficiencies through ticket monitoring process creation, a redesigned content management system (CMS), centralization of telecom account provisioning / termination processes, introduction of a global service catalog and publication of IT service level agreements (SLAs) \n \n• Globally standardize change management submission and execution process through consistent and centralized documentation and training, define and implement global internal transfer process through discussions with IT, REW, and HR teams, and lead communication efforts across Global IT Operations organization \n \n• Define project requirements, determine stakeholders, manage projects through definition, scoping, development, implementation, and production release phases \n \n• Create necessary technical documentation, conduct employee training, and communicate process changes to all teams Global Service Desk, Escalations & Training Technician (Tier-2) Yahoo! October 2009  –  March 2011  (1 year 6 months) Santa Clara, California •\tProvide support for all internal Yahoo! Employees on multiple platforms (Windows, Linux, and Mac), that cannot be resolved at the Tier-1 Level on a wide range of problems, including (but not limited to): Exchange administration, Linux support, Windows/Mac OS application troubleshooting, and user network (remote and local) configuration \n \n•\tOversee, Manage, and Execute on projects ranging from integrating deployment and configuration of new hire phone systems into Tier-1 job responsibilities to documenting new applications and processes for a global Windows 7 roll-out;  \n \n•\tAdminister internal knowledge base through creation of technical documentation, develop training programs and provide user training as needed and help improve customer service within the Global Service Desk \n \n•\tExpand experience in IIS, DNS, FTP, SMTP, POP3, HTTP, SCP, Exchange Administration, Group Policies, Security Groups, File Security, Organizational Units, and, VoIP Telecom Systems \n \n•\tManage incidents by tracking support requests until resolved and provide excellent customer service while maintaining an effective relationship with all users Global Service Desk, Escalations & Training Technician (Tier-2) Yahoo! October 2009  –  March 2011  (1 year 6 months) Santa Clara, California •\tProvide support for all internal Yahoo! Employees on multiple platforms (Windows, Linux, and Mac), that cannot be resolved at the Tier-1 Level on a wide range of problems, including (but not limited to): Exchange administration, Linux support, Windows/Mac OS application troubleshooting, and user network (remote and local) configuration \n \n•\tOversee, Manage, and Execute on projects ranging from integrating deployment and configuration of new hire phone systems into Tier-1 job responsibilities to documenting new applications and processes for a global Windows 7 roll-out;  \n \n•\tAdminister internal knowledge base through creation of technical documentation, develop training programs and provide user training as needed and help improve customer service within the Global Service Desk \n \n•\tExpand experience in IIS, DNS, FTP, SMTP, POP3, HTTP, SCP, Exchange Administration, Group Policies, Security Groups, File Security, Organizational Units, and, VoIP Telecom Systems \n \n•\tManage incidents by tracking support requests until resolved and provide excellent customer service while maintaining an effective relationship with all users Global Service Desk Technician (Tier-1) Yahoo! September 2007  –  September 2009  (2 years 1 month) Sunnyvale / Santa Clara, California •\tProvide support for all internal Yahoo! Employees on multiple platforms (Windows, Linux, and Mac), with a variety of issues including the diagnosing and troubleshooting of HP desktop/laptop and network service issues \n \n•\tGain upon and learn skills related to mobile PC and laptop hardware/software support, Office 2003/2007/2008 Application Suites, TCP/IP, VPN, Windows AD Domain, File sharing, and, Printer mapping \n \n•\tManage incidents by tracking support requests until resolved and provide excellent customer service while maintaining an effective relationship with all users \n \n•\tSupport internal software applications, deploy software, conduct user training as necessary, and write specific technical documentation for internal knowledge base \n \n•\tUsage of standard IBM, HP, Dell, Linux, and Macintosh mobile, laptop, and desktop platforms with expanded knowledge of an enterprise-level ticketing system Global Service Desk Technician (Tier-1) Yahoo! September 2007  –  September 2009  (2 years 1 month) Sunnyvale / Santa Clara, California •\tProvide support for all internal Yahoo! Employees on multiple platforms (Windows, Linux, and Mac), with a variety of issues including the diagnosing and troubleshooting of HP desktop/laptop and network service issues \n \n•\tGain upon and learn skills related to mobile PC and laptop hardware/software support, Office 2003/2007/2008 Application Suites, TCP/IP, VPN, Windows AD Domain, File sharing, and, Printer mapping \n \n•\tManage incidents by tracking support requests until resolved and provide excellent customer service while maintaining an effective relationship with all users \n \n•\tSupport internal software applications, deploy software, conduct user training as necessary, and write specific technical documentation for internal knowledge base \n \n•\tUsage of standard IBM, HP, Dell, Linux, and Macintosh mobile, laptop, and desktop platforms with expanded knowledge of an enterprise-level ticketing system Tier II NOC Intern Yahoo! June 2007  –  August 2007  (3 months) Sunnyvale, California • Aid Network Operations Control team in determining failures in monitoring architecture that are due to misconfigurations \n \n• Audit production environment and compare with tools and other data sources to ensure that production environment are accurate \n \n• Write PERL scripts that solve various device misconfiguration problems to implement change in the authoritative operations database \n \n• Created internal web-based tool that checks for certain device issues and allows for analysis of data and resolution of problem  \n \n• Problem solve and troubleshoot MySQL database queries and PERL scripts \n \n• Track all device misconfiguration changes and keep an up-to-date documentation page Tier II NOC Intern Yahoo! June 2007  –  August 2007  (3 months) Sunnyvale, California • Aid Network Operations Control team in determining failures in monitoring architecture that are due to misconfigurations \n \n• Audit production environment and compare with tools and other data sources to ensure that production environment are accurate \n \n• Write PERL scripts that solve various device misconfiguration problems to implement change in the authoritative operations database \n \n• Created internal web-based tool that checks for certain device issues and allows for analysis of data and resolution of problem  \n \n• Problem solve and troubleshoot MySQL database queries and PERL scripts \n \n• Track all device misconfiguration changes and keep an up-to-date documentation page Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Active Directory Asterisk Exchange 2010/2007/2003 DNS ITIL v3 Foundations... ITSM PMP Technical Documentation IT Service Management Microsoft Exchange ITIL Project Management Technical Support Software Documentation TCP/IP IT Management Linux Operating Systems Windows 7 Databases Networking VPN Scrum MySQL System Deployment Enterprise Software Perl Mobile Devices See 13+     See less Skills  Active Directory Asterisk Exchange 2010/2007/2003 DNS ITIL v3 Foundations... ITSM PMP Technical Documentation IT Service Management Microsoft Exchange ITIL Project Management Technical Support Software Documentation TCP/IP IT Management Linux Operating Systems Windows 7 Databases Networking VPN Scrum MySQL System Deployment Enterprise Software Perl Mobile Devices See 13+     See less Active Directory Asterisk Exchange 2010/2007/2003 DNS ITIL v3 Foundations... ITSM PMP Technical Documentation IT Service Management Microsoft Exchange ITIL Project Management Technical Support Software Documentation TCP/IP IT Management Linux Operating Systems Windows 7 Databases Networking VPN Scrum MySQL System Deployment Enterprise Software Perl Mobile Devices See 13+     See less Active Directory Asterisk Exchange 2010/2007/2003 DNS ITIL v3 Foundations... ITSM PMP Technical Documentation IT Service Management Microsoft Exchange ITIL Project Management Technical Support Software Documentation TCP/IP IT Management Linux Operating Systems Windows 7 Databases Networking VPN Scrum MySQL System Deployment Enterprise Software Perl Mobile Devices See 13+     See less Education San José State University Bachelor of Science,  Computer Science 2002  – 2008 Minor, Mathematics Activities and Societies:  Computer Science Newsletter Editor San José State University Bachelor of Science,  Computer Science 2002  – 2008 Minor, Mathematics Activities and Societies:  Computer Science Newsletter Editor San José State University Bachelor of Science,  Computer Science 2002  – 2008 Minor, Mathematics Activities and Societies:  Computer Science Newsletter Editor San José State University Bachelor of Science,  Computer Science 2002  – 2008 Minor, Mathematics Activities and Societies:  Computer Science Newsletter Editor Honors & Awards Certified Scrum Master (CSM) Scrum Alliance April 2013 Certified Scrum Product Owner (CSPO) Scrum Alliance March 2013 ITILv3 ITIL Foundation July 2012 Project Management Professional (PMP) Project Management Institute June 2012 Level 1 UNIX System Administrator San Jose State University February 2006 Certified Scrum Master (CSM) Scrum Alliance April 2013 Certified Scrum Master (CSM) Scrum Alliance April 2013 Certified Scrum Master (CSM) Scrum Alliance April 2013 Certified Scrum Product Owner (CSPO) Scrum Alliance March 2013 Certified Scrum Product Owner (CSPO) Scrum Alliance March 2013 Certified Scrum Product Owner (CSPO) Scrum Alliance March 2013 ITILv3 ITIL Foundation July 2012 ITILv3 ITIL Foundation July 2012 ITILv3 ITIL Foundation July 2012 Project Management Professional (PMP) Project Management Institute June 2012 Project Management Professional (PMP) Project Management Institute June 2012 Project Management Professional (PMP) Project Management Institute June 2012 Level 1 UNIX System Administrator San Jose State University February 2006 Level 1 UNIX System Administrator San Jose State University February 2006 Level 1 UNIX System Administrator San Jose State University February 2006 ", "Summary Senior Program Manager experienced in engineering program management, product management, software engineering and team leadership. Technical manager in the M&A Integration and Cloud focus areas building high performing teams, developing organizational and technical strategy and defining new programs to meet evolving business needs. \n \nSpecialties: Building teams, software engineering and product development management methodologies (waterfall, agile, lean). SCRUM product owner, strategic problem solving, project risk assessment, product strategy and resource planning. Functional expertise in M&A, sales, finance, operations, product and engineering in start-up, medium-sized and Fortune 500 companies. Summary Senior Program Manager experienced in engineering program management, product management, software engineering and team leadership. Technical manager in the M&A Integration and Cloud focus areas building high performing teams, developing organizational and technical strategy and defining new programs to meet evolving business needs. \n \nSpecialties: Building teams, software engineering and product development management methodologies (waterfall, agile, lean). SCRUM product owner, strategic problem solving, project risk assessment, product strategy and resource planning. Functional expertise in M&A, sales, finance, operations, product and engineering in start-up, medium-sized and Fortune 500 companies. Senior Program Manager experienced in engineering program management, product management, software engineering and team leadership. Technical manager in the M&A Integration and Cloud focus areas building high performing teams, developing organizational and technical strategy and defining new programs to meet evolving business needs. \n \nSpecialties: Building teams, software engineering and product development management methodologies (waterfall, agile, lean). SCRUM product owner, strategic problem solving, project risk assessment, product strategy and resource planning. Functional expertise in M&A, sales, finance, operations, product and engineering in start-up, medium-sized and Fortune 500 companies. Senior Program Manager experienced in engineering program management, product management, software engineering and team leadership. Technical manager in the M&A Integration and Cloud focus areas building high performing teams, developing organizational and technical strategy and defining new programs to meet evolving business needs. \n \nSpecialties: Building teams, software engineering and product development management methodologies (waterfall, agile, lean). SCRUM product owner, strategic problem solving, project risk assessment, product strategy and resource planning. Functional expertise in M&A, sales, finance, operations, product and engineering in start-up, medium-sized and Fortune 500 companies. Experience Senior Engineering Program Manager Google November 2014  – Present (10 months) Mountain View, CA Sr Manager/Engineering Lead, M&A Integration \n \nManager for ~20 person org (aligned into 4 teams) responsible for M&A integration at Google. \n• Integration PgM leads (responsible for overall integration projects) \n• Corporate Integration (employee/users, office, systems) \n• Product/Production Integration (integrating customer-facing products) \n• Vendor/Contract Integration \n \nOrganizational strategy and management oversight for end-to-end integration of Google acquired companies and products. Scope includes large portfolio of projects, process development/improvement and technical analysis/recommendation across multiple disciplines. \n Engineering Program Manager - M&A Eng Integration Google April 2013  –  November 2014  (1 year 8 months) Mountain View, CA Manager/Engineering Program Lead for the M&A Systems and Infrastructure Integration group \n \nManager for 6 technical program managers spanning two separate teams: \n• Corporate Integration \n• Production Integration / Prod X \n \nScope includes strategy and implementation for integration of all Google acquired companies and products. \n \nLeader of cross-functional M&A integration strategy group spanning program management, operations, SRE, networking, finance, security, cloud, launch engineering, etc. Program Manager - Geo Tools Strategy Google October 2011  –  April 2013  (1 year 7 months) Mountain View, CA Technical/business liaison and primary interface between operations, engineering and product teams. \n \n• Owner for overall tools strategy, optimizing product quality, local data quality and identifying performance trends. \n• Product Manager for Geo moderation system/application with user base of 1200 internal operators \n• Development of architecture and coordinating feature design \n• Release Manager for Geo operations product launches \n-- Prioritization, tracking and reporting of bugs/features requests \n-- Release process optimization, coordination of release milestones and schedules \n• Functional manager for 15 person regional Tools and Tech support team spanning four global sites to maintain high operations performance \n• Founder of Local-Triage team, responsible for critical impact, high visibility problems with local listings on Google Maps/G+ Local providing rapid resolution and cause analysis \n-- Expanded Local-Triage team from 1 person to a 20 person global team (over 3 quarters) supporting over 100 local-triage cases per month \n• Core operations technical representative for major G+ Local launch \n \nHighlights: \n• Increased tool uptime from ~80% to ~98% within first 2 quarters \n• Coordinated combined engineering and operations team through complete pipeline update in Q1 and primary backend system transition in Q2/Q3 Senior Program Manager Yahoo! April 2010  –  October 2011  (1 year 7 months) Senior Program Manager, Y! Products Org \n \nSenior PMO Manager leading a team of program managers driving global product development, ideation strategy and operational innovation for the Yahoo! Listings Portfolio (Y! Autos, Y! Real Estate, Y! Shopping, Y! Travel). \n \n• Direct manager for a team of program managers providing integrated roadmap, plan of record, product backlog, resource and sprint planning, and overall management of the Y! Listings Product portfolio. \n• Converted engineering teams from waterfall development approach to SCRUM/Agile methodology increasing release cycle time from once every 1‐2 months to every 2 weeks. \n• Experience identifying customer segments, market opportunities and building compelling user experiences across existing web‐based products and new external devices (smart phone, tablet). \n• Key decision maker for critical product prioritization decisions and strategic tradeoffs between core initiatives across product tracks (social media, SEO, content, customization and personalization) to strike the appropriate monetization and user experience balance for product portfolio. \n• Executed global platform consolidation and redesign to merge 14 disparate global code bases to a single internationalized, localized and regionally configurable technology infrastructure. Senior Program Manager Yahoo! April 2008  –  April 2010  (2 years 1 month) Senior Program Manager - G&A PMO \n \nProgram leadership for large cross-functional business initiatives impacting Yahoo!’s global systems, business operations and core platforms. \n \n•\tSenior Program Manager for Right Media, Inc. acquisition leading all aspects of business, operations and technology integration. Critical role leading resolution of system requests from global functional teams, defining and optimizing global business processes and evangelizing global platform adoption. \n•\tStrategy advisor to senior management on the Advertiser-Publisher Exchange business model generating sustained 10% gain quarter over quarter in advertising revenue and increased global campaign adoption. \n•\tProduct Manager representing the Yahoo! Advertising Network on the Right Media exchange. Developed prioritization framework and methodology for assessing critical system enhancements that doubled the development velocity for key enhancements while providing clear cross-functional roadmap visibility. \n•\tSpearheaded development of new Yahoo sales compensation platform producing 3x increase in concurrent processing and 80% reduction in post-processing adjustments. Project/Business Manager, Sales Operations Yahoo! August 2007  –  April 2008  (9 months) Project/Business Manager, Sales Operations. Managed corporate acquisitions and global business operations representing Yahoo! Sales organization. \n \n•\tBusiness Manager leading engineering and business teams for Blue Lithium, Inc. and Rivals.com acquisitions generating enhanced audience targeting and monetization for Yahoo advertising products. \n•\tGlobal operations/product manager for exchange-based Internet advertising activity, responsible for more than $25 million in monthly revenue. \n•\tDeveloped product roadmap, system-based request and prioritization process, and drove completion of all high and medium priority requests launching 1 month ahead of schedule and at 80% assessed budget. Consultant/Technical Manager TekSystems 2004  –  June 2005  (1 year) Business and technology consultant to Fannie Mae. Managing the full software development lifecycle driving development of system requirements, coordinating operational owners, and leading design, development, deployment, and optimization of software systems to support Fannie Mae’s corporate technology infrastructure. \n \n•\tCoordinated technical team and software design for an integrated cross-functional web services software system to support automated processing of single and multi-family loans. \n•\tDeveloped high visibility software application for generation of mortgage and investment documents, supporting on-the-fly document generation, revisions to previous document versions and access via a secure online portal for customer statements and portfolio management. \n•\tTechnical lead for 12 member software development team. Consultant Accenture January 2003  –  December 2003  (1 year) Responsible for client management, business analysis and corporate technology infrastructure redesign for Marriott Hotels. Scope included design of internal and external systems, business process redevelopment, and deployment of new Marriott.com Internet portal. \n \n•\tCoordinated Internet technology conversion from Microsoft .Net infrastructure to Java technology base providing 4x improvement in both performance and concurrent order processing for improved user experience and scalability. \n•\tCreated alignment within combined client/consultant team leading business process improvement and streamlining overall system implementation. \n•\tTeam leader for 5 engineers developing the top priority booking and reservation system for Marriott.com. Consultant/Senior Developer Proxicom, Inc. 2001  –  January 2003  (2 years) Provided software development, business and system analysis, operational application enhancements and integrated system management for client’s corporate systems. \n \nClient engagements included: \n•\tGeneral Motors – Development of GM’s corporate website providing online configuration and pricing of all GM vehicles. System interface construction of inventory look-up and tracking application unifying GM dealer inventory systems. \n•\tMazda – MazdaUSA.com site-up maintenance and 2002 model year update. \n•\tT. Rowe Price – System workflow design and implementation to support database technology upgrade resulting in 2x improvement in system performance. \n•\tPutnam Investments – Redesign of database, business layer, and display layer systems for new online portfolio management system. Senior Engineering Program Manager Google November 2014  – Present (10 months) Mountain View, CA Sr Manager/Engineering Lead, M&A Integration \n \nManager for ~20 person org (aligned into 4 teams) responsible for M&A integration at Google. \n• Integration PgM leads (responsible for overall integration projects) \n• Corporate Integration (employee/users, office, systems) \n• Product/Production Integration (integrating customer-facing products) \n• Vendor/Contract Integration \n \nOrganizational strategy and management oversight for end-to-end integration of Google acquired companies and products. Scope includes large portfolio of projects, process development/improvement and technical analysis/recommendation across multiple disciplines. \n Senior Engineering Program Manager Google November 2014  – Present (10 months) Mountain View, CA Sr Manager/Engineering Lead, M&A Integration \n \nManager for ~20 person org (aligned into 4 teams) responsible for M&A integration at Google. \n• Integration PgM leads (responsible for overall integration projects) \n• Corporate Integration (employee/users, office, systems) \n• Product/Production Integration (integrating customer-facing products) \n• Vendor/Contract Integration \n \nOrganizational strategy and management oversight for end-to-end integration of Google acquired companies and products. Scope includes large portfolio of projects, process development/improvement and technical analysis/recommendation across multiple disciplines. \n Engineering Program Manager - M&A Eng Integration Google April 2013  –  November 2014  (1 year 8 months) Mountain View, CA Manager/Engineering Program Lead for the M&A Systems and Infrastructure Integration group \n \nManager for 6 technical program managers spanning two separate teams: \n• Corporate Integration \n• Production Integration / Prod X \n \nScope includes strategy and implementation for integration of all Google acquired companies and products. \n \nLeader of cross-functional M&A integration strategy group spanning program management, operations, SRE, networking, finance, security, cloud, launch engineering, etc. Engineering Program Manager - M&A Eng Integration Google April 2013  –  November 2014  (1 year 8 months) Mountain View, CA Manager/Engineering Program Lead for the M&A Systems and Infrastructure Integration group \n \nManager for 6 technical program managers spanning two separate teams: \n• Corporate Integration \n• Production Integration / Prod X \n \nScope includes strategy and implementation for integration of all Google acquired companies and products. \n \nLeader of cross-functional M&A integration strategy group spanning program management, operations, SRE, networking, finance, security, cloud, launch engineering, etc. Program Manager - Geo Tools Strategy Google October 2011  –  April 2013  (1 year 7 months) Mountain View, CA Technical/business liaison and primary interface between operations, engineering and product teams. \n \n• Owner for overall tools strategy, optimizing product quality, local data quality and identifying performance trends. \n• Product Manager for Geo moderation system/application with user base of 1200 internal operators \n• Development of architecture and coordinating feature design \n• Release Manager for Geo operations product launches \n-- Prioritization, tracking and reporting of bugs/features requests \n-- Release process optimization, coordination of release milestones and schedules \n• Functional manager for 15 person regional Tools and Tech support team spanning four global sites to maintain high operations performance \n• Founder of Local-Triage team, responsible for critical impact, high visibility problems with local listings on Google Maps/G+ Local providing rapid resolution and cause analysis \n-- Expanded Local-Triage team from 1 person to a 20 person global team (over 3 quarters) supporting over 100 local-triage cases per month \n• Core operations technical representative for major G+ Local launch \n \nHighlights: \n• Increased tool uptime from ~80% to ~98% within first 2 quarters \n• Coordinated combined engineering and operations team through complete pipeline update in Q1 and primary backend system transition in Q2/Q3 Program Manager - Geo Tools Strategy Google October 2011  –  April 2013  (1 year 7 months) Mountain View, CA Technical/business liaison and primary interface between operations, engineering and product teams. \n \n• Owner for overall tools strategy, optimizing product quality, local data quality and identifying performance trends. \n• Product Manager for Geo moderation system/application with user base of 1200 internal operators \n• Development of architecture and coordinating feature design \n• Release Manager for Geo operations product launches \n-- Prioritization, tracking and reporting of bugs/features requests \n-- Release process optimization, coordination of release milestones and schedules \n• Functional manager for 15 person regional Tools and Tech support team spanning four global sites to maintain high operations performance \n• Founder of Local-Triage team, responsible for critical impact, high visibility problems with local listings on Google Maps/G+ Local providing rapid resolution and cause analysis \n-- Expanded Local-Triage team from 1 person to a 20 person global team (over 3 quarters) supporting over 100 local-triage cases per month \n• Core operations technical representative for major G+ Local launch \n \nHighlights: \n• Increased tool uptime from ~80% to ~98% within first 2 quarters \n• Coordinated combined engineering and operations team through complete pipeline update in Q1 and primary backend system transition in Q2/Q3 Senior Program Manager Yahoo! April 2010  –  October 2011  (1 year 7 months) Senior Program Manager, Y! Products Org \n \nSenior PMO Manager leading a team of program managers driving global product development, ideation strategy and operational innovation for the Yahoo! Listings Portfolio (Y! Autos, Y! Real Estate, Y! Shopping, Y! Travel). \n \n• Direct manager for a team of program managers providing integrated roadmap, plan of record, product backlog, resource and sprint planning, and overall management of the Y! Listings Product portfolio. \n• Converted engineering teams from waterfall development approach to SCRUM/Agile methodology increasing release cycle time from once every 1‐2 months to every 2 weeks. \n• Experience identifying customer segments, market opportunities and building compelling user experiences across existing web‐based products and new external devices (smart phone, tablet). \n• Key decision maker for critical product prioritization decisions and strategic tradeoffs between core initiatives across product tracks (social media, SEO, content, customization and personalization) to strike the appropriate monetization and user experience balance for product portfolio. \n• Executed global platform consolidation and redesign to merge 14 disparate global code bases to a single internationalized, localized and regionally configurable technology infrastructure. Senior Program Manager Yahoo! April 2010  –  October 2011  (1 year 7 months) Senior Program Manager, Y! Products Org \n \nSenior PMO Manager leading a team of program managers driving global product development, ideation strategy and operational innovation for the Yahoo! Listings Portfolio (Y! Autos, Y! Real Estate, Y! Shopping, Y! Travel). \n \n• Direct manager for a team of program managers providing integrated roadmap, plan of record, product backlog, resource and sprint planning, and overall management of the Y! Listings Product portfolio. \n• Converted engineering teams from waterfall development approach to SCRUM/Agile methodology increasing release cycle time from once every 1‐2 months to every 2 weeks. \n• Experience identifying customer segments, market opportunities and building compelling user experiences across existing web‐based products and new external devices (smart phone, tablet). \n• Key decision maker for critical product prioritization decisions and strategic tradeoffs between core initiatives across product tracks (social media, SEO, content, customization and personalization) to strike the appropriate monetization and user experience balance for product portfolio. \n• Executed global platform consolidation and redesign to merge 14 disparate global code bases to a single internationalized, localized and regionally configurable technology infrastructure. Senior Program Manager Yahoo! April 2008  –  April 2010  (2 years 1 month) Senior Program Manager - G&A PMO \n \nProgram leadership for large cross-functional business initiatives impacting Yahoo!’s global systems, business operations and core platforms. \n \n•\tSenior Program Manager for Right Media, Inc. acquisition leading all aspects of business, operations and technology integration. Critical role leading resolution of system requests from global functional teams, defining and optimizing global business processes and evangelizing global platform adoption. \n•\tStrategy advisor to senior management on the Advertiser-Publisher Exchange business model generating sustained 10% gain quarter over quarter in advertising revenue and increased global campaign adoption. \n•\tProduct Manager representing the Yahoo! Advertising Network on the Right Media exchange. Developed prioritization framework and methodology for assessing critical system enhancements that doubled the development velocity for key enhancements while providing clear cross-functional roadmap visibility. \n•\tSpearheaded development of new Yahoo sales compensation platform producing 3x increase in concurrent processing and 80% reduction in post-processing adjustments. Senior Program Manager Yahoo! April 2008  –  April 2010  (2 years 1 month) Senior Program Manager - G&A PMO \n \nProgram leadership for large cross-functional business initiatives impacting Yahoo!’s global systems, business operations and core platforms. \n \n•\tSenior Program Manager for Right Media, Inc. acquisition leading all aspects of business, operations and technology integration. Critical role leading resolution of system requests from global functional teams, defining and optimizing global business processes and evangelizing global platform adoption. \n•\tStrategy advisor to senior management on the Advertiser-Publisher Exchange business model generating sustained 10% gain quarter over quarter in advertising revenue and increased global campaign adoption. \n•\tProduct Manager representing the Yahoo! Advertising Network on the Right Media exchange. Developed prioritization framework and methodology for assessing critical system enhancements that doubled the development velocity for key enhancements while providing clear cross-functional roadmap visibility. \n•\tSpearheaded development of new Yahoo sales compensation platform producing 3x increase in concurrent processing and 80% reduction in post-processing adjustments. Project/Business Manager, Sales Operations Yahoo! August 2007  –  April 2008  (9 months) Project/Business Manager, Sales Operations. Managed corporate acquisitions and global business operations representing Yahoo! Sales organization. \n \n•\tBusiness Manager leading engineering and business teams for Blue Lithium, Inc. and Rivals.com acquisitions generating enhanced audience targeting and monetization for Yahoo advertising products. \n•\tGlobal operations/product manager for exchange-based Internet advertising activity, responsible for more than $25 million in monthly revenue. \n•\tDeveloped product roadmap, system-based request and prioritization process, and drove completion of all high and medium priority requests launching 1 month ahead of schedule and at 80% assessed budget. Project/Business Manager, Sales Operations Yahoo! August 2007  –  April 2008  (9 months) Project/Business Manager, Sales Operations. Managed corporate acquisitions and global business operations representing Yahoo! Sales organization. \n \n•\tBusiness Manager leading engineering and business teams for Blue Lithium, Inc. and Rivals.com acquisitions generating enhanced audience targeting and monetization for Yahoo advertising products. \n•\tGlobal operations/product manager for exchange-based Internet advertising activity, responsible for more than $25 million in monthly revenue. \n•\tDeveloped product roadmap, system-based request and prioritization process, and drove completion of all high and medium priority requests launching 1 month ahead of schedule and at 80% assessed budget. Consultant/Technical Manager TekSystems 2004  –  June 2005  (1 year) Business and technology consultant to Fannie Mae. Managing the full software development lifecycle driving development of system requirements, coordinating operational owners, and leading design, development, deployment, and optimization of software systems to support Fannie Mae’s corporate technology infrastructure. \n \n•\tCoordinated technical team and software design for an integrated cross-functional web services software system to support automated processing of single and multi-family loans. \n•\tDeveloped high visibility software application for generation of mortgage and investment documents, supporting on-the-fly document generation, revisions to previous document versions and access via a secure online portal for customer statements and portfolio management. \n•\tTechnical lead for 12 member software development team. Consultant/Technical Manager TekSystems 2004  –  June 2005  (1 year) Business and technology consultant to Fannie Mae. Managing the full software development lifecycle driving development of system requirements, coordinating operational owners, and leading design, development, deployment, and optimization of software systems to support Fannie Mae’s corporate technology infrastructure. \n \n•\tCoordinated technical team and software design for an integrated cross-functional web services software system to support automated processing of single and multi-family loans. \n•\tDeveloped high visibility software application for generation of mortgage and investment documents, supporting on-the-fly document generation, revisions to previous document versions and access via a secure online portal for customer statements and portfolio management. \n•\tTechnical lead for 12 member software development team. Consultant Accenture January 2003  –  December 2003  (1 year) Responsible for client management, business analysis and corporate technology infrastructure redesign for Marriott Hotels. Scope included design of internal and external systems, business process redevelopment, and deployment of new Marriott.com Internet portal. \n \n•\tCoordinated Internet technology conversion from Microsoft .Net infrastructure to Java technology base providing 4x improvement in both performance and concurrent order processing for improved user experience and scalability. \n•\tCreated alignment within combined client/consultant team leading business process improvement and streamlining overall system implementation. \n•\tTeam leader for 5 engineers developing the top priority booking and reservation system for Marriott.com. Consultant Accenture January 2003  –  December 2003  (1 year) Responsible for client management, business analysis and corporate technology infrastructure redesign for Marriott Hotels. Scope included design of internal and external systems, business process redevelopment, and deployment of new Marriott.com Internet portal. \n \n•\tCoordinated Internet technology conversion from Microsoft .Net infrastructure to Java technology base providing 4x improvement in both performance and concurrent order processing for improved user experience and scalability. \n•\tCreated alignment within combined client/consultant team leading business process improvement and streamlining overall system implementation. \n•\tTeam leader for 5 engineers developing the top priority booking and reservation system for Marriott.com. Consultant/Senior Developer Proxicom, Inc. 2001  –  January 2003  (2 years) Provided software development, business and system analysis, operational application enhancements and integrated system management for client’s corporate systems. \n \nClient engagements included: \n•\tGeneral Motors – Development of GM’s corporate website providing online configuration and pricing of all GM vehicles. System interface construction of inventory look-up and tracking application unifying GM dealer inventory systems. \n•\tMazda – MazdaUSA.com site-up maintenance and 2002 model year update. \n•\tT. Rowe Price – System workflow design and implementation to support database technology upgrade resulting in 2x improvement in system performance. \n•\tPutnam Investments – Redesign of database, business layer, and display layer systems for new online portfolio management system. Consultant/Senior Developer Proxicom, Inc. 2001  –  January 2003  (2 years) Provided software development, business and system analysis, operational application enhancements and integrated system management for client’s corporate systems. \n \nClient engagements included: \n•\tGeneral Motors – Development of GM’s corporate website providing online configuration and pricing of all GM vehicles. System interface construction of inventory look-up and tracking application unifying GM dealer inventory systems. \n•\tMazda – MazdaUSA.com site-up maintenance and 2002 model year update. \n•\tT. Rowe Price – System workflow design and implementation to support database technology upgrade resulting in 2x improvement in system performance. \n•\tPutnam Investments – Redesign of database, business layer, and display layer systems for new online portfolio management system. Skills Agile Methodologies Product Management Program Management SDLC Cross-functional Team... Scrum Business Analysis Project Management Software Development Integration Management Java CRM Start-ups Business Process... Business Process Cloud Computing Project Portfolio... See 3+     See less Skills  Agile Methodologies Product Management Program Management SDLC Cross-functional Team... Scrum Business Analysis Project Management Software Development Integration Management Java CRM Start-ups Business Process... Business Process Cloud Computing Project Portfolio... See 3+     See less Agile Methodologies Product Management Program Management SDLC Cross-functional Team... Scrum Business Analysis Project Management Software Development Integration Management Java CRM Start-ups Business Process... Business Process Cloud Computing Project Portfolio... See 3+     See less Agile Methodologies Product Management Program Management SDLC Cross-functional Team... Scrum Business Analysis Project Management Software Development Integration Management Java CRM Start-ups Business Process... Business Process Cloud Computing Project Portfolio... See 3+     See less Education University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2005  – 2007 Activities and Societies:  Kenan-Flagler Fellowship Recipient ,  MBA VP of Communications (2006) University of Virginia BS,  Computer Science 1995  – 2001 Activities and Societies:  President ,  Trigon Engineering Society University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2005  – 2007 Activities and Societies:  Kenan-Flagler Fellowship Recipient ,  MBA VP of Communications (2006) University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2005  – 2007 Activities and Societies:  Kenan-Flagler Fellowship Recipient ,  MBA VP of Communications (2006) University of North Carolina at Chapel Hill - Kenan-Flagler Business School MBA 2005  – 2007 Activities and Societies:  Kenan-Flagler Fellowship Recipient ,  MBA VP of Communications (2006) University of Virginia BS,  Computer Science 1995  – 2001 Activities and Societies:  President ,  Trigon Engineering Society University of Virginia BS,  Computer Science 1995  – 2001 Activities and Societies:  President ,  Trigon Engineering Society University of Virginia BS,  Computer Science 1995  – 2001 Activities and Societies:  President ,  Trigon Engineering Society Honors & Awards ", "Summary I am an experienced Agile Coach, Trainer, and Project Manager with 10 years experience mentoring and leading software organizations to high performance.  \n \nI have a unique pragmatic, facilitative style that aligns your organization's goals with your product development efforts. I can help your organization reduce the time from concept to cash for new product initiatives, while simultaneously improving quality and team satisfaction. I have experience mentoring executives, vice presidents, directors and development managers in leveraging Lean and Agile methods to deliver breakout products.  \n \nI have expertise with both agile and plan driven methodologies. I have lead large, complex Agile programs, using Lean methods to scale Scrum to 10+ teams. I have lead multiple $5+ MM programs successfully to deliver exceptional value to end users and stakeholders. \n \nI have broad experience coaching and mentoring software teams in a wide variety of best practices including agile estimation and planning, test driven development, refactoring and configuration management. \n \nI am the founder of the Agile Philanthropy: San Francisco Bay Area Chapter, and a member of the Bay Agile Project Leadership Network (APLN). \n \nSpecialties: Agile Coaching, Agile Training, Agile Tuning, Large Scale and distributed Scrum and XP, blending user experience with Agile, collaborative meeting facilitation; Agile Project Management; web development, ecommerce, mobile, enterprise software, web analytics, software engineering best practices, estimation, technical writing, identity management. Summary I am an experienced Agile Coach, Trainer, and Project Manager with 10 years experience mentoring and leading software organizations to high performance.  \n \nI have a unique pragmatic, facilitative style that aligns your organization's goals with your product development efforts. I can help your organization reduce the time from concept to cash for new product initiatives, while simultaneously improving quality and team satisfaction. I have experience mentoring executives, vice presidents, directors and development managers in leveraging Lean and Agile methods to deliver breakout products.  \n \nI have expertise with both agile and plan driven methodologies. I have lead large, complex Agile programs, using Lean methods to scale Scrum to 10+ teams. I have lead multiple $5+ MM programs successfully to deliver exceptional value to end users and stakeholders. \n \nI have broad experience coaching and mentoring software teams in a wide variety of best practices including agile estimation and planning, test driven development, refactoring and configuration management. \n \nI am the founder of the Agile Philanthropy: San Francisco Bay Area Chapter, and a member of the Bay Agile Project Leadership Network (APLN). \n \nSpecialties: Agile Coaching, Agile Training, Agile Tuning, Large Scale and distributed Scrum and XP, blending user experience with Agile, collaborative meeting facilitation; Agile Project Management; web development, ecommerce, mobile, enterprise software, web analytics, software engineering best practices, estimation, technical writing, identity management. I am an experienced Agile Coach, Trainer, and Project Manager with 10 years experience mentoring and leading software organizations to high performance.  \n \nI have a unique pragmatic, facilitative style that aligns your organization's goals with your product development efforts. I can help your organization reduce the time from concept to cash for new product initiatives, while simultaneously improving quality and team satisfaction. I have experience mentoring executives, vice presidents, directors and development managers in leveraging Lean and Agile methods to deliver breakout products.  \n \nI have expertise with both agile and plan driven methodologies. I have lead large, complex Agile programs, using Lean methods to scale Scrum to 10+ teams. I have lead multiple $5+ MM programs successfully to deliver exceptional value to end users and stakeholders. \n \nI have broad experience coaching and mentoring software teams in a wide variety of best practices including agile estimation and planning, test driven development, refactoring and configuration management. \n \nI am the founder of the Agile Philanthropy: San Francisco Bay Area Chapter, and a member of the Bay Agile Project Leadership Network (APLN). \n \nSpecialties: Agile Coaching, Agile Training, Agile Tuning, Large Scale and distributed Scrum and XP, blending user experience with Agile, collaborative meeting facilitation; Agile Project Management; web development, ecommerce, mobile, enterprise software, web analytics, software engineering best practices, estimation, technical writing, identity management. I am an experienced Agile Coach, Trainer, and Project Manager with 10 years experience mentoring and leading software organizations to high performance.  \n \nI have a unique pragmatic, facilitative style that aligns your organization's goals with your product development efforts. I can help your organization reduce the time from concept to cash for new product initiatives, while simultaneously improving quality and team satisfaction. I have experience mentoring executives, vice presidents, directors and development managers in leveraging Lean and Agile methods to deliver breakout products.  \n \nI have expertise with both agile and plan driven methodologies. I have lead large, complex Agile programs, using Lean methods to scale Scrum to 10+ teams. I have lead multiple $5+ MM programs successfully to deliver exceptional value to end users and stakeholders. \n \nI have broad experience coaching and mentoring software teams in a wide variety of best practices including agile estimation and planning, test driven development, refactoring and configuration management. \n \nI am the founder of the Agile Philanthropy: San Francisco Bay Area Chapter, and a member of the Bay Agile Project Leadership Network (APLN). \n \nSpecialties: Agile Coaching, Agile Training, Agile Tuning, Large Scale and distributed Scrum and XP, blending user experience with Agile, collaborative meeting facilitation; Agile Project Management; web development, ecommerce, mobile, enterprise software, web analytics, software engineering best practices, estimation, technical writing, identity management. Experience Technical Program Manager Yahoo December 2013  – Present (1 year 9 months) Sunnyvale, CA Lead strategic product development initiatives at Yahoo. \n Scrum Coach and Internal Consultant Yahoo! November 2011  –  December 2013  (2 years 2 months) Sunnyvale, CA Responsible for leading enterprise agile adoption across Yahoo, Inc improving both speed and quality. \nPartnered with Senior leaders, Business Units, Chief Architect and HR to advance adoption of Scrum from 150 to 350 teams improving engagement, productivity and customer satisfaction. \nDirectly assisted an 800 person business unit to a successful adoption of scrum and continuous delivery. \nWorked in partnership with SVP to adopt of Kanban for Production Engineering teams. \nPersonally trained 1000 students in Scrum, Agile, Kanban, Agile Management, and Product Ownership globally with over 45-50% net promoter scores. Consultant ThoughtWorks June 2009  –  November 2011  (2 years 6 months) San Francisco Bay Area Working with clients to help deliver value to their customers. \n- Delivery Principal for the successful delivery of cutting edge mobile apps for 4 teams across 3 platforms for a Leading Global Bank. \n- Lean process coaching for a lean transformation of a Global Clothing Retailer. \n- Consulted with the PMO of a leading computer manufacturer to assess and improve their Scrum implementation.  \n- Lead a 25 person development project for a hardware/software project for a multinational conglomerate. Agile Coach, CSP SolutionsIQ July 2008  –  May 2009  (11 months) Coaching software teams to high performance, facilitating organizational change, training cross-functional teams in Scrum. Team Lead, CSM SolutionsIQ March 2007  –  June 2008  (1 year 4 months) Agile coaching and training, agile project management, coordinated a multiple team scrum implementation. Program Manager M1 Data & Analytics November 2005  –  February 2007  (1 year 4 months) Web Project Management, ecommerce, SEO. Introduced XP and Scrum to the company. Program Manager Metro One Telecommunications February 2001  –  October 2005  (4 years 9 months) Coordinate software projects from inception to deployment. Data Acquisition Manager Enthusiasm Technologies February 2000  –  February 2001  (1 year 1 month) Lead a team of 5 web surfers who programmed robots to scrape the web of event content, collaborated on software development projects, company sold to Metro One. Technical Program Manager Yahoo December 2013  – Present (1 year 9 months) Sunnyvale, CA Lead strategic product development initiatives at Yahoo. \n Technical Program Manager Yahoo December 2013  – Present (1 year 9 months) Sunnyvale, CA Lead strategic product development initiatives at Yahoo. \n Scrum Coach and Internal Consultant Yahoo! November 2011  –  December 2013  (2 years 2 months) Sunnyvale, CA Responsible for leading enterprise agile adoption across Yahoo, Inc improving both speed and quality. \nPartnered with Senior leaders, Business Units, Chief Architect and HR to advance adoption of Scrum from 150 to 350 teams improving engagement, productivity and customer satisfaction. \nDirectly assisted an 800 person business unit to a successful adoption of scrum and continuous delivery. \nWorked in partnership with SVP to adopt of Kanban for Production Engineering teams. \nPersonally trained 1000 students in Scrum, Agile, Kanban, Agile Management, and Product Ownership globally with over 45-50% net promoter scores. Scrum Coach and Internal Consultant Yahoo! November 2011  –  December 2013  (2 years 2 months) Sunnyvale, CA Responsible for leading enterprise agile adoption across Yahoo, Inc improving both speed and quality. \nPartnered with Senior leaders, Business Units, Chief Architect and HR to advance adoption of Scrum from 150 to 350 teams improving engagement, productivity and customer satisfaction. \nDirectly assisted an 800 person business unit to a successful adoption of scrum and continuous delivery. \nWorked in partnership with SVP to adopt of Kanban for Production Engineering teams. \nPersonally trained 1000 students in Scrum, Agile, Kanban, Agile Management, and Product Ownership globally with over 45-50% net promoter scores. Consultant ThoughtWorks June 2009  –  November 2011  (2 years 6 months) San Francisco Bay Area Working with clients to help deliver value to their customers. \n- Delivery Principal for the successful delivery of cutting edge mobile apps for 4 teams across 3 platforms for a Leading Global Bank. \n- Lean process coaching for a lean transformation of a Global Clothing Retailer. \n- Consulted with the PMO of a leading computer manufacturer to assess and improve their Scrum implementation.  \n- Lead a 25 person development project for a hardware/software project for a multinational conglomerate. Consultant ThoughtWorks June 2009  –  November 2011  (2 years 6 months) San Francisco Bay Area Working with clients to help deliver value to their customers. \n- Delivery Principal for the successful delivery of cutting edge mobile apps for 4 teams across 3 platforms for a Leading Global Bank. \n- Lean process coaching for a lean transformation of a Global Clothing Retailer. \n- Consulted with the PMO of a leading computer manufacturer to assess and improve their Scrum implementation.  \n- Lead a 25 person development project for a hardware/software project for a multinational conglomerate. Agile Coach, CSP SolutionsIQ July 2008  –  May 2009  (11 months) Coaching software teams to high performance, facilitating organizational change, training cross-functional teams in Scrum. Agile Coach, CSP SolutionsIQ July 2008  –  May 2009  (11 months) Coaching software teams to high performance, facilitating organizational change, training cross-functional teams in Scrum. Team Lead, CSM SolutionsIQ March 2007  –  June 2008  (1 year 4 months) Agile coaching and training, agile project management, coordinated a multiple team scrum implementation. Team Lead, CSM SolutionsIQ March 2007  –  June 2008  (1 year 4 months) Agile coaching and training, agile project management, coordinated a multiple team scrum implementation. Program Manager M1 Data & Analytics November 2005  –  February 2007  (1 year 4 months) Web Project Management, ecommerce, SEO. Introduced XP and Scrum to the company. Program Manager M1 Data & Analytics November 2005  –  February 2007  (1 year 4 months) Web Project Management, ecommerce, SEO. Introduced XP and Scrum to the company. Program Manager Metro One Telecommunications February 2001  –  October 2005  (4 years 9 months) Coordinate software projects from inception to deployment. Program Manager Metro One Telecommunications February 2001  –  October 2005  (4 years 9 months) Coordinate software projects from inception to deployment. Data Acquisition Manager Enthusiasm Technologies February 2000  –  February 2001  (1 year 1 month) Lead a team of 5 web surfers who programmed robots to scrape the web of event content, collaborated on software development projects, company sold to Metro One. Data Acquisition Manager Enthusiasm Technologies February 2000  –  February 2001  (1 year 1 month) Lead a team of 5 web surfers who programmed robots to scrape the web of event content, collaborated on software development projects, company sold to Metro One. Skills Agile Project Management Agile Enterprise Software Identity Management Agile Methodologies Scrum Coaching Software Project... Software Development Requirements Analysis Lean Thinking Lean Transformation Team Building Management Product Development Project Management Start-ups Leadership Web Applications Test Driven Development SaaS Entrepreneurship Mobile Applications Continuous Integration Strategy Cross-functional Team... Web Services Integration Program Management Certified Scrum Master... User Experience See 16+     See less Skills  Agile Project Management Agile Enterprise Software Identity Management Agile Methodologies Scrum Coaching Software Project... Software Development Requirements Analysis Lean Thinking Lean Transformation Team Building Management Product Development Project Management Start-ups Leadership Web Applications Test Driven Development SaaS Entrepreneurship Mobile Applications Continuous Integration Strategy Cross-functional Team... Web Services Integration Program Management Certified Scrum Master... User Experience See 16+     See less Agile Project Management Agile Enterprise Software Identity Management Agile Methodologies Scrum Coaching Software Project... Software Development Requirements Analysis Lean Thinking Lean Transformation Team Building Management Product Development Project Management Start-ups Leadership Web Applications Test Driven Development SaaS Entrepreneurship Mobile Applications Continuous Integration Strategy Cross-functional Team... Web Services Integration Program Management Certified Scrum Master... User Experience See 16+     See less Agile Project Management Agile Enterprise Software Identity Management Agile Methodologies Scrum Coaching Software Project... Software Development Requirements Analysis Lean Thinking Lean Transformation Team Building Management Product Development Project Management Start-ups Leadership Web Applications Test Driven Development SaaS Entrepreneurship Mobile Applications Continuous Integration Strategy Cross-functional Team... Web Services Integration Program Management Certified Scrum Master... User Experience See 16+     See less Education Reed College BA 1995  – 1999 Reed College BA 1995  – 1999 Reed College BA 1995  – 1999 Reed College BA 1995  – 1999 ", "Summary Senior Product/Program Manager (Scrum/Agile/Lean/Waterfall), with over 15 years’ experience in helping businesses and teams adopt pragmatic agile techniques while getting value out the door. \n \nCertified Scrum Master (CSM) \nCertified Scrum Professional (CSP) \nStanford Certified Project Manager (SCPM) \n \nSpecialties: full product life cycle program management, product roadmaps and release planning, product owner, building collaborative cross functional teams, SAFe, iterative Sprint planning, velocity improvement, scalability, Certified Scrum Master, Certified Scrum Professional, Jira, information architecture, wireframes, UED, business development, customer relations, coffee, cookies, and motivation! Summary Senior Product/Program Manager (Scrum/Agile/Lean/Waterfall), with over 15 years’ experience in helping businesses and teams adopt pragmatic agile techniques while getting value out the door. \n \nCertified Scrum Master (CSM) \nCertified Scrum Professional (CSP) \nStanford Certified Project Manager (SCPM) \n \nSpecialties: full product life cycle program management, product roadmaps and release planning, product owner, building collaborative cross functional teams, SAFe, iterative Sprint planning, velocity improvement, scalability, Certified Scrum Master, Certified Scrum Professional, Jira, information architecture, wireframes, UED, business development, customer relations, coffee, cookies, and motivation! Senior Product/Program Manager (Scrum/Agile/Lean/Waterfall), with over 15 years’ experience in helping businesses and teams adopt pragmatic agile techniques while getting value out the door. \n \nCertified Scrum Master (CSM) \nCertified Scrum Professional (CSP) \nStanford Certified Project Manager (SCPM) \n \nSpecialties: full product life cycle program management, product roadmaps and release planning, product owner, building collaborative cross functional teams, SAFe, iterative Sprint planning, velocity improvement, scalability, Certified Scrum Master, Certified Scrum Professional, Jira, information architecture, wireframes, UED, business development, customer relations, coffee, cookies, and motivation! Senior Product/Program Manager (Scrum/Agile/Lean/Waterfall), with over 15 years’ experience in helping businesses and teams adopt pragmatic agile techniques while getting value out the door. \n \nCertified Scrum Master (CSM) \nCertified Scrum Professional (CSP) \nStanford Certified Project Manager (SCPM) \n \nSpecialties: full product life cycle program management, product roadmaps and release planning, product owner, building collaborative cross functional teams, SAFe, iterative Sprint planning, velocity improvement, scalability, Certified Scrum Master, Certified Scrum Professional, Jira, information architecture, wireframes, UED, business development, customer relations, coffee, cookies, and motivation! Experience Senior Technical Program Manager Kabam August 2014  – Present (1 year 1 month) San Francisco Bay Area Senior Technical Program Manager Amazon Music December 2013  –  May 2014  (6 months) San Francisco Bay Area Senior Technical Program Manager for Amazon's Digital Music Web Store, responsible for development of new Amazon Prime Music features, including Front-End User Experience and integration with core framework services. \n \nManagement of cross-functional teams to define requirements, confirm scoping, implement and deliver. \n \nCollaboration with external teams to confirm requirements and align dev commits to program milestones. \n \nPrioritization of Product Backlog and resource allocation.  \n \nLeadership and Program-level reporting of progress, issues, risks and mitigation approaches. Senior Program Manager, Yahoo! Finance Yahoo! May 2011  –  March 2013  (1 year 11 months) Sunnyvale, San Francisco Program Management of the modernization and development of Yahoo! Finance's online services and software, with teams in Sunnyvale and Bangalore. \n \nLed weekly Product meetings reviewing all in-flight projects. \n \nManagement of cross-functional teams (Product, Engineering, Business Development, UED, Web-development, QA, Service Engineering, Paranoids, SEO) \n \nDay-to-day management of teams alongside Technical Leads. \n \nHelped present \"Agile at Yahoo!\" to key Advertising partners. \n \nSprint Backlog management, Daily Stand-ups, Retrospectives, resolution of blockers and dependencies, focusing on improving value-driven processes, not overhead. \n \nPrioritization of Engineering and Product features with Stakeholders. \n \nLed workshops with teams to define feature specifications. \n \nProgram/Product Management of Windows 8 App development. Sitemaps, wireframes, 3rd party developer discussions. \n \nRoadmap definition and resource allocation planning, working with senior executives. \n \n•\tCertified Scrum Master (CSM)  \n•\tCertified Scrum Professional (CSP) \n•\tStanford Certified Project Manager (SCPM) \n \nI provide progress visibility, risk assessment, issue resolution, and cross-functional and inter-team alignment towards strategic goals. Senior Program Manager, Mobile Homepage Yahoo! November 2010  –  May 2011  (7 months) Lead Program Manager for the development of Yahoo!’s global Mobile Homepages, with teams in Sunnyvale and Singapore. Senior Program Manager, Yahoo! Frontpage Yahoo! Europe March 2007  –  November 2010  (3 years 9 months) London, United Kingdom Lead Program Manager for EU teams delivering services and features for the Yahoo! Frontpage using Scrum being built out of Sunnyvale and London. IT Project Manager Haymarket Consumer Media October 2003  –  March 2007  (3 years 6 months) London, United Kingdom Full Product Management of internet, digital publishing and commercial projects for Haymarket’s consumer magazine titles, including Stuff Magazine, WhatHiFi, and Gramophone. Additional Business Development of new titles and other market opportunities. \n \nStuff.tv: involved from inception in defining business, editorial, video, advertising, technical, budget and user requirements for a new gadget and technology website and a scalable content management system (CMS).  \n \nProject plans, budgets, information/data architecture, sitemaps, wire-framing, user journeys, commercial opportunities, sourcing and management of third-party agencies and developers; multi-team project management during Scoping, Development, and Launch phases (Prince2/Agile); hands-on development of SQL data layer processes, video publishing processes and meta-data management; legacy data migration; Business and Project Board progress reports. \n \nDeveloped new products and online strategies with stakeholders. \n \nDeveloped content management systems, and created new designs for Gramophone and WhatHiFi’s web sites. \n \nManaged internal and third-party development resources. Freelance Contractor BBC Five Live January 2003  –  July 2003  (7 months) London, United Kingdom Provided technical insight into brainstorm and innovation sessions for the development of new services, and site redesigns. \nDeveloped functionality and design prototypes, allowing team members to quickly engage with new offerings and add ideas. \nNegotiated with 3rd party developers, lowering costs. Director Ajabo plc January 2000  –  April 2002  (2 years 4 months) Innovative, multi-lingual B2B eMarketplace.\t \nCreated business plan for an innovative B2B eMarketplace. \nDeveloped content and brand prototypes for internet and mobile. \nLed funding presentations, raising £2.8 million. \nHeaded negotiations with IT service providers and channel partners, delivering £2 million in savings UK Interactive Services Manager Scoot plc October 1996  –  March 2000  (3 years 6 months) Led a team of designers and developers, producing business and cinema information services for Scoot and 35+ channel partners (including Yahoo!, MSN, NTL, Telewest, Empire, IMDB, The Sun). \n \nSuccessfully developed a culture change, promoting the ownership of project tasks and involvement of team members. \n \nSuccessfully delivered a product redesign as part of a Steering Committee tasked with changing Scoot’s business proposition.  \n \nKey liaison with all departments and European sister companies, developing strategies and best practices. Senior Technical Program Manager Kabam August 2014  – Present (1 year 1 month) San Francisco Bay Area Senior Technical Program Manager Kabam August 2014  – Present (1 year 1 month) San Francisco Bay Area Senior Technical Program Manager Amazon Music December 2013  –  May 2014  (6 months) San Francisco Bay Area Senior Technical Program Manager for Amazon's Digital Music Web Store, responsible for development of new Amazon Prime Music features, including Front-End User Experience and integration with core framework services. \n \nManagement of cross-functional teams to define requirements, confirm scoping, implement and deliver. \n \nCollaboration with external teams to confirm requirements and align dev commits to program milestones. \n \nPrioritization of Product Backlog and resource allocation.  \n \nLeadership and Program-level reporting of progress, issues, risks and mitigation approaches. Senior Technical Program Manager Amazon Music December 2013  –  May 2014  (6 months) San Francisco Bay Area Senior Technical Program Manager for Amazon's Digital Music Web Store, responsible for development of new Amazon Prime Music features, including Front-End User Experience and integration with core framework services. \n \nManagement of cross-functional teams to define requirements, confirm scoping, implement and deliver. \n \nCollaboration with external teams to confirm requirements and align dev commits to program milestones. \n \nPrioritization of Product Backlog and resource allocation.  \n \nLeadership and Program-level reporting of progress, issues, risks and mitigation approaches. Senior Program Manager, Yahoo! Finance Yahoo! May 2011  –  March 2013  (1 year 11 months) Sunnyvale, San Francisco Program Management of the modernization and development of Yahoo! Finance's online services and software, with teams in Sunnyvale and Bangalore. \n \nLed weekly Product meetings reviewing all in-flight projects. \n \nManagement of cross-functional teams (Product, Engineering, Business Development, UED, Web-development, QA, Service Engineering, Paranoids, SEO) \n \nDay-to-day management of teams alongside Technical Leads. \n \nHelped present \"Agile at Yahoo!\" to key Advertising partners. \n \nSprint Backlog management, Daily Stand-ups, Retrospectives, resolution of blockers and dependencies, focusing on improving value-driven processes, not overhead. \n \nPrioritization of Engineering and Product features with Stakeholders. \n \nLed workshops with teams to define feature specifications. \n \nProgram/Product Management of Windows 8 App development. Sitemaps, wireframes, 3rd party developer discussions. \n \nRoadmap definition and resource allocation planning, working with senior executives. \n \n•\tCertified Scrum Master (CSM)  \n•\tCertified Scrum Professional (CSP) \n•\tStanford Certified Project Manager (SCPM) \n \nI provide progress visibility, risk assessment, issue resolution, and cross-functional and inter-team alignment towards strategic goals. Senior Program Manager, Yahoo! Finance Yahoo! May 2011  –  March 2013  (1 year 11 months) Sunnyvale, San Francisco Program Management of the modernization and development of Yahoo! Finance's online services and software, with teams in Sunnyvale and Bangalore. \n \nLed weekly Product meetings reviewing all in-flight projects. \n \nManagement of cross-functional teams (Product, Engineering, Business Development, UED, Web-development, QA, Service Engineering, Paranoids, SEO) \n \nDay-to-day management of teams alongside Technical Leads. \n \nHelped present \"Agile at Yahoo!\" to key Advertising partners. \n \nSprint Backlog management, Daily Stand-ups, Retrospectives, resolution of blockers and dependencies, focusing on improving value-driven processes, not overhead. \n \nPrioritization of Engineering and Product features with Stakeholders. \n \nLed workshops with teams to define feature specifications. \n \nProgram/Product Management of Windows 8 App development. Sitemaps, wireframes, 3rd party developer discussions. \n \nRoadmap definition and resource allocation planning, working with senior executives. \n \n•\tCertified Scrum Master (CSM)  \n•\tCertified Scrum Professional (CSP) \n•\tStanford Certified Project Manager (SCPM) \n \nI provide progress visibility, risk assessment, issue resolution, and cross-functional and inter-team alignment towards strategic goals. Senior Program Manager, Mobile Homepage Yahoo! November 2010  –  May 2011  (7 months) Lead Program Manager for the development of Yahoo!’s global Mobile Homepages, with teams in Sunnyvale and Singapore. Senior Program Manager, Mobile Homepage Yahoo! November 2010  –  May 2011  (7 months) Lead Program Manager for the development of Yahoo!’s global Mobile Homepages, with teams in Sunnyvale and Singapore. Senior Program Manager, Yahoo! Frontpage Yahoo! Europe March 2007  –  November 2010  (3 years 9 months) London, United Kingdom Lead Program Manager for EU teams delivering services and features for the Yahoo! Frontpage using Scrum being built out of Sunnyvale and London. Senior Program Manager, Yahoo! Frontpage Yahoo! Europe March 2007  –  November 2010  (3 years 9 months) London, United Kingdom Lead Program Manager for EU teams delivering services and features for the Yahoo! Frontpage using Scrum being built out of Sunnyvale and London. IT Project Manager Haymarket Consumer Media October 2003  –  March 2007  (3 years 6 months) London, United Kingdom Full Product Management of internet, digital publishing and commercial projects for Haymarket’s consumer magazine titles, including Stuff Magazine, WhatHiFi, and Gramophone. Additional Business Development of new titles and other market opportunities. \n \nStuff.tv: involved from inception in defining business, editorial, video, advertising, technical, budget and user requirements for a new gadget and technology website and a scalable content management system (CMS).  \n \nProject plans, budgets, information/data architecture, sitemaps, wire-framing, user journeys, commercial opportunities, sourcing and management of third-party agencies and developers; multi-team project management during Scoping, Development, and Launch phases (Prince2/Agile); hands-on development of SQL data layer processes, video publishing processes and meta-data management; legacy data migration; Business and Project Board progress reports. \n \nDeveloped new products and online strategies with stakeholders. \n \nDeveloped content management systems, and created new designs for Gramophone and WhatHiFi’s web sites. \n \nManaged internal and third-party development resources. IT Project Manager Haymarket Consumer Media October 2003  –  March 2007  (3 years 6 months) London, United Kingdom Full Product Management of internet, digital publishing and commercial projects for Haymarket’s consumer magazine titles, including Stuff Magazine, WhatHiFi, and Gramophone. Additional Business Development of new titles and other market opportunities. \n \nStuff.tv: involved from inception in defining business, editorial, video, advertising, technical, budget and user requirements for a new gadget and technology website and a scalable content management system (CMS).  \n \nProject plans, budgets, information/data architecture, sitemaps, wire-framing, user journeys, commercial opportunities, sourcing and management of third-party agencies and developers; multi-team project management during Scoping, Development, and Launch phases (Prince2/Agile); hands-on development of SQL data layer processes, video publishing processes and meta-data management; legacy data migration; Business and Project Board progress reports. \n \nDeveloped new products and online strategies with stakeholders. \n \nDeveloped content management systems, and created new designs for Gramophone and WhatHiFi’s web sites. \n \nManaged internal and third-party development resources. Freelance Contractor BBC Five Live January 2003  –  July 2003  (7 months) London, United Kingdom Provided technical insight into brainstorm and innovation sessions for the development of new services, and site redesigns. \nDeveloped functionality and design prototypes, allowing team members to quickly engage with new offerings and add ideas. \nNegotiated with 3rd party developers, lowering costs. Freelance Contractor BBC Five Live January 2003  –  July 2003  (7 months) London, United Kingdom Provided technical insight into brainstorm and innovation sessions for the development of new services, and site redesigns. \nDeveloped functionality and design prototypes, allowing team members to quickly engage with new offerings and add ideas. \nNegotiated with 3rd party developers, lowering costs. Director Ajabo plc January 2000  –  April 2002  (2 years 4 months) Innovative, multi-lingual B2B eMarketplace.\t \nCreated business plan for an innovative B2B eMarketplace. \nDeveloped content and brand prototypes for internet and mobile. \nLed funding presentations, raising £2.8 million. \nHeaded negotiations with IT service providers and channel partners, delivering £2 million in savings Director Ajabo plc January 2000  –  April 2002  (2 years 4 months) Innovative, multi-lingual B2B eMarketplace.\t \nCreated business plan for an innovative B2B eMarketplace. \nDeveloped content and brand prototypes for internet and mobile. \nLed funding presentations, raising £2.8 million. \nHeaded negotiations with IT service providers and channel partners, delivering £2 million in savings UK Interactive Services Manager Scoot plc October 1996  –  March 2000  (3 years 6 months) Led a team of designers and developers, producing business and cinema information services for Scoot and 35+ channel partners (including Yahoo!, MSN, NTL, Telewest, Empire, IMDB, The Sun). \n \nSuccessfully developed a culture change, promoting the ownership of project tasks and involvement of team members. \n \nSuccessfully delivered a product redesign as part of a Steering Committee tasked with changing Scoot’s business proposition.  \n \nKey liaison with all departments and European sister companies, developing strategies and best practices. UK Interactive Services Manager Scoot plc October 1996  –  March 2000  (3 years 6 months) Led a team of designers and developers, producing business and cinema information services for Scoot and 35+ channel partners (including Yahoo!, MSN, NTL, Telewest, Empire, IMDB, The Sun). \n \nSuccessfully developed a culture change, promoting the ownership of project tasks and involvement of team members. \n \nSuccessfully delivered a product redesign as part of a Steering Committee tasked with changing Scoot’s business proposition.  \n \nKey liaison with all departments and European sister companies, developing strategies and best practices. Languages   Skills Agile Methodologies Scrum Program Management Product Management Information Architecture Agile Project Management Certified Scrum Master... Team Building Product Development E-commerce Agile Management Continuous Integration Negotiation Team Management Mobile Applications Project Planning User Experience SaaS Content Management Web Analytics Internet Strategy Copywriting Wireframes Business Development Web Applications Software Project... Scalability Software Engineering Content Strategy Stanford Certified... SDLC Software Development Distributed Systems Web Project Management Cloud Computing Release Management Project Portfolio... Mobile Internet User Interface Design Digital Strategy Certified Scrum... Mobile Devices Cross-functional Team... Internationalization Localization JIRA Sharepoint Visio Photoshop See 35+     See less Skills  Agile Methodologies Scrum Program Management Product Management Information Architecture Agile Project Management Certified Scrum Master... Team Building Product Development E-commerce Agile Management Continuous Integration Negotiation Team Management Mobile Applications Project Planning User Experience SaaS Content Management Web Analytics Internet Strategy Copywriting Wireframes Business Development Web Applications Software Project... Scalability Software Engineering Content Strategy Stanford Certified... SDLC Software Development Distributed Systems Web Project Management Cloud Computing Release Management Project Portfolio... Mobile Internet User Interface Design Digital Strategy Certified Scrum... Mobile Devices Cross-functional Team... Internationalization Localization JIRA Sharepoint Visio Photoshop See 35+     See less Agile Methodologies Scrum Program Management Product Management Information Architecture Agile Project Management Certified Scrum Master... Team Building Product Development E-commerce Agile Management Continuous Integration Negotiation Team Management Mobile Applications Project Planning User Experience SaaS Content Management Web Analytics Internet Strategy Copywriting Wireframes Business Development Web Applications Software Project... Scalability Software Engineering Content Strategy Stanford Certified... SDLC Software Development Distributed Systems Web Project Management Cloud Computing Release Management Project Portfolio... Mobile Internet User Interface Design Digital Strategy Certified Scrum... Mobile Devices Cross-functional Team... Internationalization Localization JIRA Sharepoint Visio Photoshop See 35+     See less Agile Methodologies Scrum Program Management Product Management Information Architecture Agile Project Management Certified Scrum Master... Team Building Product Development E-commerce Agile Management Continuous Integration Negotiation Team Management Mobile Applications Project Planning User Experience SaaS Content Management Web Analytics Internet Strategy Copywriting Wireframes Business Development Web Applications Software Project... Scalability Software Engineering Content Strategy Stanford Certified... SDLC Software Development Distributed Systems Web Project Management Cloud Computing Release Management Project Portfolio... Mobile Internet User Interface Design Digital Strategy Certified Scrum... Mobile Devices Cross-functional Team... Internationalization Localization JIRA Sharepoint Visio Photoshop See 35+     See less Honors & Awards ", "Summary I love to bring a difference and a pinch of innovation with whatever work I do. Being said that I am a person who would seek opportunities to explore and learn new things. Help drive efficiency by bringing a change of approach. Love to discuss and work on new ideas. While implementing the process monitor the changes and evaluate the improvements and fix the issue to ensure the success of any project handled. Expert in leading cross functional projects and working with diverse team/ workforce to meet overall project objectives. Summary I love to bring a difference and a pinch of innovation with whatever work I do. Being said that I am a person who would seek opportunities to explore and learn new things. Help drive efficiency by bringing a change of approach. Love to discuss and work on new ideas. While implementing the process monitor the changes and evaluate the improvements and fix the issue to ensure the success of any project handled. Expert in leading cross functional projects and working with diverse team/ workforce to meet overall project objectives. I love to bring a difference and a pinch of innovation with whatever work I do. Being said that I am a person who would seek opportunities to explore and learn new things. Help drive efficiency by bringing a change of approach. Love to discuss and work on new ideas. While implementing the process monitor the changes and evaluate the improvements and fix the issue to ensure the success of any project handled. Expert in leading cross functional projects and working with diverse team/ workforce to meet overall project objectives. I love to bring a difference and a pinch of innovation with whatever work I do. Being said that I am a person who would seek opportunities to explore and learn new things. Help drive efficiency by bringing a change of approach. Love to discuss and work on new ideas. While implementing the process monitor the changes and evaluate the improvements and fix the issue to ensure the success of any project handled. Expert in leading cross functional projects and working with diverse team/ workforce to meet overall project objectives. Experience Sr Program Manager Yahoo October 2014  – Present (11 months) Bengaluru Area, India Head Salesforce tool Globally for any enhancement and implementation by the Bizz Ops, Leadership, End users. Design Process workflow, Identify roles and responsibilities, Negotiate priorities, Manage backlog prioritization, Work with sales tools (Engineering) team to get the job done with implementation and Adoption. This profile also requires me to ensure various communication is sent with all the planning and development is sent across to various regional heads till end users. \n \nAlso I head another Internal Tool called Digital Tearsheet at a Global Scale across in Yahoo.  \nThis is a tool which was conceptualized, Developed and integrated for all the screenshot requirement for yahoo ensuring 80% efficiency gain for the Org. This tool also requires driving towards adoption which is also a key thing that I drive. Program Manager Yahoo October 2013  –  October 2014  (1 year 1 month) Bengaluru Area, India Program manager with over 3-year experience in managing Training, Quality and tool enhancement projects. My strength is getting involved in user requirements from a nascent stage and then to liaison with product, Training and engineering teams to help build solution that exceed user needs. \n \nExpert in design, development and delivery of cost-effective, high-performance solutions to meet challenging business demands. Extensive experience in all facets of a project, from initial requirement analysis to documentation, implementation, user training and enhancement. Excellent communicator with talent for problem solving and ability to handle multiple functions & activities in high pressure environment with tight deadlines. Training & Quality Specialist Yahoo! June 2011  –  October 2013  (2 years 5 months) bengaluru area, india Key responsibility is to handle the training and quality needs for Display Advertising Analysts and Campaign Managers team. This includes collaborating with the sales and development team in US to get the latest updates and cascading information tailor made to the audience in India team. The team consists of 25 and 30 respectively. Training Manager CONVERGYS India Services Ltd May 2007  –  June 2011  (4 years 2 months) Bengaluru Area, India Job responsibilities and Achievements: \n \nCurrently working as a Trainer for Microsoft Office 2010 Applications.  \nTrained people on Microsoft Windows 7 as part of launch. \nVirtually trained batches/trainers for a new product using the WebEx and Live meeting Tool. \nCurrently selected as a trainer for Pilot Training for MSN email support. \nTrained the agents on the Chat tools such as NGenera & Liveperson used for the Microsoft chat support. \nDevelop support documents and train technicians for the latest Microsoft updates. \nWorked on H1N1 Training Plan and content development with Microsoft and Trained for Microsoft Office. \nWorking on Six Sigma YB on MPI. \nReview/Develop the training material for Microsoft Office. \nTrain newly hired agents and bridge the knowledge gap in team members. \nServed as a Tech Lead in Operations. \nManage Chat Team on SL, Technical Queries, etc. \nWork with different teams on raising customer satisfaction levels. \nPrepare rosters for staff for all the internal queries during the training period. Projects Convergys May 2007  –  May 2011  (4 years 1 month) Working on a Technical Online Magazine with the Director of Microsoft Programs. This magazine, Tech Tattler, is aimed at having entire Convergys ready for any technical program in next 3 years. \nSix Sigma Yellow Belt Project on Reducing MPI (Minutes per Incident) - One of the client requirement for the program. \nCollege Project: \nExtraction and Spectroscopic Characterization of Natural Products, carried out in GE, India. Microsoft Certified Trainer Convergys May 2005  –  May 2011  (6 years 1 month) Tech Lead Convergys September 2010  –  January 2011  (5 months) Bengaluru Area, India I am responsible for managing an Microsoft Excel support team for their end to end technical support. I also am accountable for their Quality in terms of their support for the customers. I also Interact with the Partner Tech Leads, Developers with Microsoft Excel group so that we can attain the resolution and fix issues for our customers. Technical Support Officer CONVERGYS India Services Ltd July 2005  –  May 2007  (1 year 11 months) Job responsibilities and Achievements \n \nProvided technical support to the customers of Microsoft Office. \nHave been the floor topper for 6 months repeatedly in terms of AHT, QOS, etc. \nHave been the mentor of fellow members on the floor. \nPart of Training and content development for Office 2007 & Office 2010. Sr Program Manager Yahoo October 2014  – Present (11 months) Bengaluru Area, India Head Salesforce tool Globally for any enhancement and implementation by the Bizz Ops, Leadership, End users. Design Process workflow, Identify roles and responsibilities, Negotiate priorities, Manage backlog prioritization, Work with sales tools (Engineering) team to get the job done with implementation and Adoption. This profile also requires me to ensure various communication is sent with all the planning and development is sent across to various regional heads till end users. \n \nAlso I head another Internal Tool called Digital Tearsheet at a Global Scale across in Yahoo.  \nThis is a tool which was conceptualized, Developed and integrated for all the screenshot requirement for yahoo ensuring 80% efficiency gain for the Org. This tool also requires driving towards adoption which is also a key thing that I drive. Sr Program Manager Yahoo October 2014  – Present (11 months) Bengaluru Area, India Head Salesforce tool Globally for any enhancement and implementation by the Bizz Ops, Leadership, End users. Design Process workflow, Identify roles and responsibilities, Negotiate priorities, Manage backlog prioritization, Work with sales tools (Engineering) team to get the job done with implementation and Adoption. This profile also requires me to ensure various communication is sent with all the planning and development is sent across to various regional heads till end users. \n \nAlso I head another Internal Tool called Digital Tearsheet at a Global Scale across in Yahoo.  \nThis is a tool which was conceptualized, Developed and integrated for all the screenshot requirement for yahoo ensuring 80% efficiency gain for the Org. This tool also requires driving towards adoption which is also a key thing that I drive. Program Manager Yahoo October 2013  –  October 2014  (1 year 1 month) Bengaluru Area, India Program manager with over 3-year experience in managing Training, Quality and tool enhancement projects. My strength is getting involved in user requirements from a nascent stage and then to liaison with product, Training and engineering teams to help build solution that exceed user needs. \n \nExpert in design, development and delivery of cost-effective, high-performance solutions to meet challenging business demands. Extensive experience in all facets of a project, from initial requirement analysis to documentation, implementation, user training and enhancement. Excellent communicator with talent for problem solving and ability to handle multiple functions & activities in high pressure environment with tight deadlines. Program Manager Yahoo October 2013  –  October 2014  (1 year 1 month) Bengaluru Area, India Program manager with over 3-year experience in managing Training, Quality and tool enhancement projects. My strength is getting involved in user requirements from a nascent stage and then to liaison with product, Training and engineering teams to help build solution that exceed user needs. \n \nExpert in design, development and delivery of cost-effective, high-performance solutions to meet challenging business demands. Extensive experience in all facets of a project, from initial requirement analysis to documentation, implementation, user training and enhancement. Excellent communicator with talent for problem solving and ability to handle multiple functions & activities in high pressure environment with tight deadlines. Training & Quality Specialist Yahoo! June 2011  –  October 2013  (2 years 5 months) bengaluru area, india Key responsibility is to handle the training and quality needs for Display Advertising Analysts and Campaign Managers team. This includes collaborating with the sales and development team in US to get the latest updates and cascading information tailor made to the audience in India team. The team consists of 25 and 30 respectively. Training & Quality Specialist Yahoo! June 2011  –  October 2013  (2 years 5 months) bengaluru area, india Key responsibility is to handle the training and quality needs for Display Advertising Analysts and Campaign Managers team. This includes collaborating with the sales and development team in US to get the latest updates and cascading information tailor made to the audience in India team. The team consists of 25 and 30 respectively. Training Manager CONVERGYS India Services Ltd May 2007  –  June 2011  (4 years 2 months) Bengaluru Area, India Job responsibilities and Achievements: \n \nCurrently working as a Trainer for Microsoft Office 2010 Applications.  \nTrained people on Microsoft Windows 7 as part of launch. \nVirtually trained batches/trainers for a new product using the WebEx and Live meeting Tool. \nCurrently selected as a trainer for Pilot Training for MSN email support. \nTrained the agents on the Chat tools such as NGenera & Liveperson used for the Microsoft chat support. \nDevelop support documents and train technicians for the latest Microsoft updates. \nWorked on H1N1 Training Plan and content development with Microsoft and Trained for Microsoft Office. \nWorking on Six Sigma YB on MPI. \nReview/Develop the training material for Microsoft Office. \nTrain newly hired agents and bridge the knowledge gap in team members. \nServed as a Tech Lead in Operations. \nManage Chat Team on SL, Technical Queries, etc. \nWork with different teams on raising customer satisfaction levels. \nPrepare rosters for staff for all the internal queries during the training period. Training Manager CONVERGYS India Services Ltd May 2007  –  June 2011  (4 years 2 months) Bengaluru Area, India Job responsibilities and Achievements: \n \nCurrently working as a Trainer for Microsoft Office 2010 Applications.  \nTrained people on Microsoft Windows 7 as part of launch. \nVirtually trained batches/trainers for a new product using the WebEx and Live meeting Tool. \nCurrently selected as a trainer for Pilot Training for MSN email support. \nTrained the agents on the Chat tools such as NGenera & Liveperson used for the Microsoft chat support. \nDevelop support documents and train technicians for the latest Microsoft updates. \nWorked on H1N1 Training Plan and content development with Microsoft and Trained for Microsoft Office. \nWorking on Six Sigma YB on MPI. \nReview/Develop the training material for Microsoft Office. \nTrain newly hired agents and bridge the knowledge gap in team members. \nServed as a Tech Lead in Operations. \nManage Chat Team on SL, Technical Queries, etc. \nWork with different teams on raising customer satisfaction levels. \nPrepare rosters for staff for all the internal queries during the training period. Projects Convergys May 2007  –  May 2011  (4 years 1 month) Working on a Technical Online Magazine with the Director of Microsoft Programs. This magazine, Tech Tattler, is aimed at having entire Convergys ready for any technical program in next 3 years. \nSix Sigma Yellow Belt Project on Reducing MPI (Minutes per Incident) - One of the client requirement for the program. \nCollege Project: \nExtraction and Spectroscopic Characterization of Natural Products, carried out in GE, India. Projects Convergys May 2007  –  May 2011  (4 years 1 month) Working on a Technical Online Magazine with the Director of Microsoft Programs. This magazine, Tech Tattler, is aimed at having entire Convergys ready for any technical program in next 3 years. \nSix Sigma Yellow Belt Project on Reducing MPI (Minutes per Incident) - One of the client requirement for the program. \nCollege Project: \nExtraction and Spectroscopic Characterization of Natural Products, carried out in GE, India. Microsoft Certified Trainer Convergys May 2005  –  May 2011  (6 years 1 month) Microsoft Certified Trainer Convergys May 2005  –  May 2011  (6 years 1 month) Tech Lead Convergys September 2010  –  January 2011  (5 months) Bengaluru Area, India I am responsible for managing an Microsoft Excel support team for their end to end technical support. I also am accountable for their Quality in terms of their support for the customers. I also Interact with the Partner Tech Leads, Developers with Microsoft Excel group so that we can attain the resolution and fix issues for our customers. Tech Lead Convergys September 2010  –  January 2011  (5 months) Bengaluru Area, India I am responsible for managing an Microsoft Excel support team for their end to end technical support. I also am accountable for their Quality in terms of their support for the customers. I also Interact with the Partner Tech Leads, Developers with Microsoft Excel group so that we can attain the resolution and fix issues for our customers. Technical Support Officer CONVERGYS India Services Ltd July 2005  –  May 2007  (1 year 11 months) Job responsibilities and Achievements \n \nProvided technical support to the customers of Microsoft Office. \nHave been the floor topper for 6 months repeatedly in terms of AHT, QOS, etc. \nHave been the mentor of fellow members on the floor. \nPart of Training and content development for Office 2007 & Office 2010. Technical Support Officer CONVERGYS India Services Ltd July 2005  –  May 2007  (1 year 11 months) Job responsibilities and Achievements \n \nProvided technical support to the customers of Microsoft Office. \nHave been the floor topper for 6 months repeatedly in terms of AHT, QOS, etc. \nHave been the mentor of fellow members on the floor. \nPart of Training and content development for Office 2007 & Office 2010. Skills Team Management Training Operations Management Microsoft Office Management Training Delivery Customer Satisfaction Microsoft Excel Analytics Vendor Management Pre-sales BPO Content Development Business Development Outsourcing Online Advertising Service Delivery Coaching Six Sigma Technical Support Call Centers Transition Management Patents Marketing Social Media Marketing Project Management Program Management Time Study Influencer Marketing Intellectual Property Reporting & Analysis CRM Leadership Requirements Analysis Process Improvement Business Analysis Strategy Salesforce.com See 23+     See less Skills  Team Management Training Operations Management Microsoft Office Management Training Delivery Customer Satisfaction Microsoft Excel Analytics Vendor Management Pre-sales BPO Content Development Business Development Outsourcing Online Advertising Service Delivery Coaching Six Sigma Technical Support Call Centers Transition Management Patents Marketing Social Media Marketing Project Management Program Management Time Study Influencer Marketing Intellectual Property Reporting & Analysis CRM Leadership Requirements Analysis Process Improvement Business Analysis Strategy Salesforce.com See 23+     See less Team Management Training Operations Management Microsoft Office Management Training Delivery Customer Satisfaction Microsoft Excel Analytics Vendor Management Pre-sales BPO Content Development Business Development Outsourcing Online Advertising Service Delivery Coaching Six Sigma Technical Support Call Centers Transition Management Patents Marketing Social Media Marketing Project Management Program Management Time Study Influencer Marketing Intellectual Property Reporting & Analysis CRM Leadership Requirements Analysis Process Improvement Business Analysis Strategy Salesforce.com See 23+     See less Team Management Training Operations Management Microsoft Office Management Training Delivery Customer Satisfaction Microsoft Excel Analytics Vendor Management Pre-sales BPO Content Development Business Development Outsourcing Online Advertising Service Delivery Coaching Six Sigma Technical Support Call Centers Transition Management Patents Marketing Social Media Marketing Project Management Program Management Time Study Influencer Marketing Intellectual Property Reporting & Analysis CRM Leadership Requirements Analysis Process Improvement Business Analysis Strategy Salesforce.com See 23+     See less Education Alliance University MBA,  Marketing ,  Project Management 2011  – 2013 Christ College - Bangalore B.Sc,  Physics; Chemistry & Maths - 2005; Pre 2002  – 2005 Alliance University MBA,  Marketing ,  Project Management 2011  – 2013 Alliance University MBA,  Marketing ,  Project Management 2011  – 2013 Alliance University MBA,  Marketing ,  Project Management 2011  – 2013 Christ College - Bangalore B.Sc,  Physics; Chemistry & Maths - 2005; Pre 2002  – 2005 Christ College - Bangalore B.Sc,  Physics; Chemistry & Maths - 2005; Pre 2002  – 2005 Christ College - Bangalore B.Sc,  Physics; Chemistry & Maths - 2005; Pre 2002  – 2005 Honors & Awards IP Publication Yahoo September 2012 Influencer Vital Smarts July 2013 Certified as an \"Influencer\" after completing and demonstrating the course. Conflict Manager Ginosko Consultants February 2014 Completed Conflict management course and was awarded as a Conflict Manager Microsoft Certified Trainer Microsoft May 2008 Certified as a Microsoft Certified Trainer for all Microsoft General Trainings.  Additional Honors & Awards Microsoft Certification as a Trainer. IP Publication Yahoo September 2012 IP Publication Yahoo September 2012 IP Publication Yahoo September 2012 Influencer Vital Smarts July 2013 Certified as an \"Influencer\" after completing and demonstrating the course. Influencer Vital Smarts July 2013 Certified as an \"Influencer\" after completing and demonstrating the course. Influencer Vital Smarts July 2013 Certified as an \"Influencer\" after completing and demonstrating the course. Conflict Manager Ginosko Consultants February 2014 Completed Conflict management course and was awarded as a Conflict Manager Conflict Manager Ginosko Consultants February 2014 Completed Conflict management course and was awarded as a Conflict Manager Conflict Manager Ginosko Consultants February 2014 Completed Conflict management course and was awarded as a Conflict Manager Microsoft Certified Trainer Microsoft May 2008 Certified as a Microsoft Certified Trainer for all Microsoft General Trainings.  Microsoft Certified Trainer Microsoft May 2008 Certified as a Microsoft Certified Trainer for all Microsoft General Trainings.  Microsoft Certified Trainer Microsoft May 2008 Certified as a Microsoft Certified Trainer for all Microsoft General Trainings.  Additional Honors & Awards Microsoft Certification as a Trainer. Additional Honors & Awards Microsoft Certification as a Trainer. Additional Honors & Awards Microsoft Certification as a Trainer. ", "Summary I have twelve years of Operations experience working with many IT and large scale production engineering companies. \n \nIn this past twelve years, I have successfully initiated and completed high performance results within the Technical Support, Operations and Service Engineering field. \n \nSome of my strengths are: I have a strong will, high performance work ethics, motivation, positive energy and a smile on my face with the challenges and opportunities that I am faced with. I am always up for new opportunities and focus on building a better and scalable solution for my teams. \n \nWith Management Business Administration skills that I have gathered at work and school, I am looking forward to take over the Business side of the Corporation. \n \nI am not a geek but I love technical evaluations of projects and continue to enhance my technical knowledge of systems and troubleshooting to perform to my fullest capabilities. \n \nI cope with high pressure results and work on restoring site reliability for my company. \n \nI never leave any opportunity behind; I am a firm believer that Opportunities will only knock on your door once: Do or Die! So with this in mind, I welcome opportunities for my career with open arms! \n \nSpecialties: MBA, NOC, Change Management; Technical Support, Network Operations, Site Reliability Operations, Red Hat Certified Systems Administrator (RHCSA), MySQL, UNIX FreeBSD, Summary I have twelve years of Operations experience working with many IT and large scale production engineering companies. \n \nIn this past twelve years, I have successfully initiated and completed high performance results within the Technical Support, Operations and Service Engineering field. \n \nSome of my strengths are: I have a strong will, high performance work ethics, motivation, positive energy and a smile on my face with the challenges and opportunities that I am faced with. I am always up for new opportunities and focus on building a better and scalable solution for my teams. \n \nWith Management Business Administration skills that I have gathered at work and school, I am looking forward to take over the Business side of the Corporation. \n \nI am not a geek but I love technical evaluations of projects and continue to enhance my technical knowledge of systems and troubleshooting to perform to my fullest capabilities. \n \nI cope with high pressure results and work on restoring site reliability for my company. \n \nI never leave any opportunity behind; I am a firm believer that Opportunities will only knock on your door once: Do or Die! So with this in mind, I welcome opportunities for my career with open arms! \n \nSpecialties: MBA, NOC, Change Management; Technical Support, Network Operations, Site Reliability Operations, Red Hat Certified Systems Administrator (RHCSA), MySQL, UNIX FreeBSD, I have twelve years of Operations experience working with many IT and large scale production engineering companies. \n \nIn this past twelve years, I have successfully initiated and completed high performance results within the Technical Support, Operations and Service Engineering field. \n \nSome of my strengths are: I have a strong will, high performance work ethics, motivation, positive energy and a smile on my face with the challenges and opportunities that I am faced with. I am always up for new opportunities and focus on building a better and scalable solution for my teams. \n \nWith Management Business Administration skills that I have gathered at work and school, I am looking forward to take over the Business side of the Corporation. \n \nI am not a geek but I love technical evaluations of projects and continue to enhance my technical knowledge of systems and troubleshooting to perform to my fullest capabilities. \n \nI cope with high pressure results and work on restoring site reliability for my company. \n \nI never leave any opportunity behind; I am a firm believer that Opportunities will only knock on your door once: Do or Die! So with this in mind, I welcome opportunities for my career with open arms! \n \nSpecialties: MBA, NOC, Change Management; Technical Support, Network Operations, Site Reliability Operations, Red Hat Certified Systems Administrator (RHCSA), MySQL, UNIX FreeBSD, I have twelve years of Operations experience working with many IT and large scale production engineering companies. \n \nIn this past twelve years, I have successfully initiated and completed high performance results within the Technical Support, Operations and Service Engineering field. \n \nSome of my strengths are: I have a strong will, high performance work ethics, motivation, positive energy and a smile on my face with the challenges and opportunities that I am faced with. I am always up for new opportunities and focus on building a better and scalable solution for my teams. \n \nWith Management Business Administration skills that I have gathered at work and school, I am looking forward to take over the Business side of the Corporation. \n \nI am not a geek but I love technical evaluations of projects and continue to enhance my technical knowledge of systems and troubleshooting to perform to my fullest capabilities. \n \nI cope with high pressure results and work on restoring site reliability for my company. \n \nI never leave any opportunity behind; I am a firm believer that Opportunities will only knock on your door once: Do or Die! So with this in mind, I welcome opportunities for my career with open arms! \n \nSpecialties: MBA, NOC, Change Management; Technical Support, Network Operations, Site Reliability Operations, Red Hat Certified Systems Administrator (RHCSA), MySQL, UNIX FreeBSD, Experience Manager, Business Continuity Planning Yahoo April 2015  – Present (5 months) Sunnyvale, CA Business Continuity Planning Program Manager Yahoo November 2014  – Present (10 months) Sunnyvale, CA Technical Yahoo, Lead SRE - Mobile Emerging Products (MEP) Yahoo October 2013  –  November 2014  (1 year 2 months) Sunnyvale Manager, Search and Revenue Service (Site) Reliability Engineering Yahoo! September 2012  –  October 2013  (1 year 2 months) Sunnyvale, California Lead, Service Reliability Engineer (Media and Messenger) Yahoo! June 2011  –  September 2012  (1 year 4 months) Sunnyvale, ca Operations Center Engineer (Lead) Yahoo! April 2006  –  June 2011  (5 years 3 months) Sr. Network Operations Center Engineer Symantec December 2004  –  February 2006  (1 year 3 months) Netwrok Operations Center Engineer VERITAS Software December 2004  –  February 2006  (1 year 3 months) Computer Support Analyst - TSE PG&E June 2003  –  December 2004  (1 year 7 months) Internet Support Engineer Exodus Communications 1999  –  2001  (2 years) Support Technician PC Magazine April 1999  –  December 2000  (1 year 9 months) Support systems Engineer broad word Communication September 1999  –  October 2000  (1 year 2 months) Contractor - Technical Support Representative Pacific Bells November 1998  –  April 1999  (6 months) Manager, Business Continuity Planning Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manager, Business Continuity Planning Yahoo April 2015  – Present (5 months) Sunnyvale, CA Business Continuity Planning Program Manager Yahoo November 2014  – Present (10 months) Sunnyvale, CA Business Continuity Planning Program Manager Yahoo November 2014  – Present (10 months) Sunnyvale, CA Technical Yahoo, Lead SRE - Mobile Emerging Products (MEP) Yahoo October 2013  –  November 2014  (1 year 2 months) Sunnyvale Technical Yahoo, Lead SRE - Mobile Emerging Products (MEP) Yahoo October 2013  –  November 2014  (1 year 2 months) Sunnyvale Manager, Search and Revenue Service (Site) Reliability Engineering Yahoo! September 2012  –  October 2013  (1 year 2 months) Sunnyvale, California Manager, Search and Revenue Service (Site) Reliability Engineering Yahoo! September 2012  –  October 2013  (1 year 2 months) Sunnyvale, California Lead, Service Reliability Engineer (Media and Messenger) Yahoo! June 2011  –  September 2012  (1 year 4 months) Sunnyvale, ca Lead, Service Reliability Engineer (Media and Messenger) Yahoo! June 2011  –  September 2012  (1 year 4 months) Sunnyvale, ca Operations Center Engineer (Lead) Yahoo! April 2006  –  June 2011  (5 years 3 months) Operations Center Engineer (Lead) Yahoo! April 2006  –  June 2011  (5 years 3 months) Sr. Network Operations Center Engineer Symantec December 2004  –  February 2006  (1 year 3 months) Sr. Network Operations Center Engineer Symantec December 2004  –  February 2006  (1 year 3 months) Netwrok Operations Center Engineer VERITAS Software December 2004  –  February 2006  (1 year 3 months) Netwrok Operations Center Engineer VERITAS Software December 2004  –  February 2006  (1 year 3 months) Computer Support Analyst - TSE PG&E June 2003  –  December 2004  (1 year 7 months) Computer Support Analyst - TSE PG&E June 2003  –  December 2004  (1 year 7 months) Internet Support Engineer Exodus Communications 1999  –  2001  (2 years) Internet Support Engineer Exodus Communications 1999  –  2001  (2 years) Support Technician PC Magazine April 1999  –  December 2000  (1 year 9 months) Support Technician PC Magazine April 1999  –  December 2000  (1 year 9 months) Support systems Engineer broad word Communication September 1999  –  October 2000  (1 year 2 months) Support systems Engineer broad word Communication September 1999  –  October 2000  (1 year 2 months) Contractor - Technical Support Representative Pacific Bells November 1998  –  April 1999  (6 months) Contractor - Technical Support Representative Pacific Bells November 1998  –  April 1999  (6 months) Skills SDLC Subversion Unix Red Hat Linux MySQL Apache Project Management Change Management TCP/IP Linux Data Center Troubleshooting Nagios Agile Methodologies Computer Network... Bash Cisco Technologies Scrum FreeBSD Yahoo Search Program Management Network Administration Wireless Networking Microsoft Operating... Hardware Installation Networking RedHat Operating Systems Shell Scripting System Administration Unix Shell Scripting Software Installation High Availability Windows Server Technical Support Help Desk Support Netbackup Integration Databases Scalability Disaster Recovery SaaS Kanban Customer Service Servers Firewalls Active Directory See 32+     See less Skills  SDLC Subversion Unix Red Hat Linux MySQL Apache Project Management Change Management TCP/IP Linux Data Center Troubleshooting Nagios Agile Methodologies Computer Network... Bash Cisco Technologies Scrum FreeBSD Yahoo Search Program Management Network Administration Wireless Networking Microsoft Operating... Hardware Installation Networking RedHat Operating Systems Shell Scripting System Administration Unix Shell Scripting Software Installation High Availability Windows Server Technical Support Help Desk Support Netbackup Integration Databases Scalability Disaster Recovery SaaS Kanban Customer Service Servers Firewalls Active Directory See 32+     See less SDLC Subversion Unix Red Hat Linux MySQL Apache Project Management Change Management TCP/IP Linux Data Center Troubleshooting Nagios Agile Methodologies Computer Network... Bash Cisco Technologies Scrum FreeBSD Yahoo Search Program Management Network Administration Wireless Networking Microsoft Operating... Hardware Installation Networking RedHat Operating Systems Shell Scripting System Administration Unix Shell Scripting Software Installation High Availability Windows Server Technical Support Help Desk Support Netbackup Integration Databases Scalability Disaster Recovery SaaS Kanban Customer Service Servers Firewalls Active Directory See 32+     See less SDLC Subversion Unix Red Hat Linux MySQL Apache Project Management Change Management TCP/IP Linux Data Center Troubleshooting Nagios Agile Methodologies Computer Network... Bash Cisco Technologies Scrum FreeBSD Yahoo Search Program Management Network Administration Wireless Networking Microsoft Operating... Hardware Installation Networking RedHat Operating Systems Shell Scripting System Administration Unix Shell Scripting Software Installation High Availability Windows Server Technical Support Help Desk Support Netbackup Integration Databases Scalability Disaster Recovery SaaS Kanban Customer Service Servers Firewalls Active Directory See 32+     See less Education Notre Dame de Namur University Master of Business Administration 2011  – 2013 University of Phoenix Bachelors of Science in Information Technology 2008  – 2010 Computer Learning Center Associate of Arts 1996  – 1998 Heald College Diploma 1999 Chabot College 2009  – 2010 Misson College 2009 Notre Dame de Namur University Master of Business Administration 2011  – 2013 Notre Dame de Namur University Master of Business Administration 2011  – 2013 Notre Dame de Namur University Master of Business Administration 2011  – 2013 University of Phoenix Bachelors of Science in Information Technology 2008  – 2010 University of Phoenix Bachelors of Science in Information Technology 2008  – 2010 University of Phoenix Bachelors of Science in Information Technology 2008  – 2010 Computer Learning Center Associate of Arts 1996  – 1998 Computer Learning Center Associate of Arts 1996  – 1998 Computer Learning Center Associate of Arts 1996  – 1998 Heald College Diploma 1999 Heald College Diploma 1999 Heald College Diploma 1999 Chabot College 2009  – 2010 Chabot College 2009  – 2010 Chabot College 2009  – 2010 Misson College 2009 Misson College 2009 Misson College 2009 ", "Summary • Experience includes a unique blend of working in the non-profit sector and the online media industry \n• Actively involved in Strategic Planning, Fundraising, and Fiscal Review while serving as a Board member at Bayshore Christian Ministries and the Yahoo! Employee Foundation \n• Established on-site volunteer activities for Yahoo! employees while partnering with local organizations \n• Strong aptitude for communicating with internal and external customers \n• Proven track record of successfully managing projects. Experience working with cross-functional teams and across various levels of management. Summary • Experience includes a unique blend of working in the non-profit sector and the online media industry \n• Actively involved in Strategic Planning, Fundraising, and Fiscal Review while serving as a Board member at Bayshore Christian Ministries and the Yahoo! Employee Foundation \n• Established on-site volunteer activities for Yahoo! employees while partnering with local organizations \n• Strong aptitude for communicating with internal and external customers \n• Proven track record of successfully managing projects. Experience working with cross-functional teams and across various levels of management. • Experience includes a unique blend of working in the non-profit sector and the online media industry \n• Actively involved in Strategic Planning, Fundraising, and Fiscal Review while serving as a Board member at Bayshore Christian Ministries and the Yahoo! Employee Foundation \n• Established on-site volunteer activities for Yahoo! employees while partnering with local organizations \n• Strong aptitude for communicating with internal and external customers \n• Proven track record of successfully managing projects. Experience working with cross-functional teams and across various levels of management. • Experience includes a unique blend of working in the non-profit sector and the online media industry \n• Actively involved in Strategic Planning, Fundraising, and Fiscal Review while serving as a Board member at Bayshore Christian Ministries and the Yahoo! Employee Foundation \n• Established on-site volunteer activities for Yahoo! employees while partnering with local organizations \n• Strong aptitude for communicating with internal and external customers \n• Proven track record of successfully managing projects. Experience working with cross-functional teams and across various levels of management. Experience Senior Program Manager Yahoo August 2013  – Present (2 years 1 month) • Employee Giving lead for Yahoo for Good. Established program guidelines and administered matching gifts payments.  \n• Launched employee giving and volunteer tool. Responsible for managing project deadline and coordinating with cross-functional team members to ensure successful implementation.  \n• Increased employee engagement by organizing large onsite quarterly volunteer events. Client Services Manager, Yahoo! September 2009  – Present (6 years) Sunnyvale, CA • Led technical support team of ten direct reports responsible for working with key external partners. Streamlined processes to increase effectiveness of triage process which resulted in 45% first time resolution rate. \n• Managed Crystal reporting project to develop reports that track key metrics that give management visibility into the engineering backlog and current workload.  \n• Participated in APT User Acceptance Testing. Provided feedback to the Product team while testing features and functionality prior to each release. \n• Collaborated with Legal, Engineering and Product Management to prepare APT platform release and incident communication. \n• Managed ticket escalation process. Partnered with Account Management and Engineering to prioritize platform issues based on revenue impact and customer relationship.  \n• Developed onboarding boot camp for new hires in addition to providing career coaching and direct feedback through consistent one-on-one sessions. Account Manager Yahoo! 2007  –  2009  (2 years) • Responsible for onboarding Affiliate partners, Wal-Mart and the Newspaper Consortium. Worked closely with Pricing and Yield Management, Legal, Finance and Channel Sales Managers to develop booking and billing processes. \n• Supervised day-to-day tasks of Media Delivery Coordinators. \n• Recipient of Elite Performer Award for the Newspaper Consortium Affiliate Team. Media Delivery Coordinator Yahoo! 2005  –  2007  (2 years) •Managed execution of media campaigns to ensure correct implementation and timely launch. \n•Optimized media campaigns by partnering with the internal Sales team to monitor delivery and creative changes. Business Manager Bayshore Christian Ministries 2002  –  2005  (3 years) East Palo Alto, CA • Managed the disbursement of BCM’s grant funds, ensuring that all funds were spent in a manner compliant with the guidelines set by the foundation. \n• Responsible for all accounts payable and receivable, audit preparation and supervision of front desk personnel. \n• Assisted with event programming including Annual Open House, Donor “Thank You” Campaign and Summer Adventures in Learning Banquet. \n• Collaborated with Executive Director and Director of Development to prepare grant proposals and final reports. Research Analyst MACRO Consulting, Inc. 2000  –  2002  (2 years) Palo Alto, CA • Executed customized product and market research.  \n• Managed instruction, progress of data field houses, and analysis of statistical data. Senior Program Manager Yahoo August 2013  – Present (2 years 1 month) • Employee Giving lead for Yahoo for Good. Established program guidelines and administered matching gifts payments.  \n• Launched employee giving and volunteer tool. Responsible for managing project deadline and coordinating with cross-functional team members to ensure successful implementation.  \n• Increased employee engagement by organizing large onsite quarterly volunteer events. Senior Program Manager Yahoo August 2013  – Present (2 years 1 month) • Employee Giving lead for Yahoo for Good. Established program guidelines and administered matching gifts payments.  \n• Launched employee giving and volunteer tool. Responsible for managing project deadline and coordinating with cross-functional team members to ensure successful implementation.  \n• Increased employee engagement by organizing large onsite quarterly volunteer events. Client Services Manager, Yahoo! September 2009  – Present (6 years) Sunnyvale, CA • Led technical support team of ten direct reports responsible for working with key external partners. Streamlined processes to increase effectiveness of triage process which resulted in 45% first time resolution rate. \n• Managed Crystal reporting project to develop reports that track key metrics that give management visibility into the engineering backlog and current workload.  \n• Participated in APT User Acceptance Testing. Provided feedback to the Product team while testing features and functionality prior to each release. \n• Collaborated with Legal, Engineering and Product Management to prepare APT platform release and incident communication. \n• Managed ticket escalation process. Partnered with Account Management and Engineering to prioritize platform issues based on revenue impact and customer relationship.  \n• Developed onboarding boot camp for new hires in addition to providing career coaching and direct feedback through consistent one-on-one sessions. Client Services Manager, Yahoo! September 2009  – Present (6 years) Sunnyvale, CA • Led technical support team of ten direct reports responsible for working with key external partners. Streamlined processes to increase effectiveness of triage process which resulted in 45% first time resolution rate. \n• Managed Crystal reporting project to develop reports that track key metrics that give management visibility into the engineering backlog and current workload.  \n• Participated in APT User Acceptance Testing. Provided feedback to the Product team while testing features and functionality prior to each release. \n• Collaborated with Legal, Engineering and Product Management to prepare APT platform release and incident communication. \n• Managed ticket escalation process. Partnered with Account Management and Engineering to prioritize platform issues based on revenue impact and customer relationship.  \n• Developed onboarding boot camp for new hires in addition to providing career coaching and direct feedback through consistent one-on-one sessions. Account Manager Yahoo! 2007  –  2009  (2 years) • Responsible for onboarding Affiliate partners, Wal-Mart and the Newspaper Consortium. Worked closely with Pricing and Yield Management, Legal, Finance and Channel Sales Managers to develop booking and billing processes. \n• Supervised day-to-day tasks of Media Delivery Coordinators. \n• Recipient of Elite Performer Award for the Newspaper Consortium Affiliate Team. Account Manager Yahoo! 2007  –  2009  (2 years) • Responsible for onboarding Affiliate partners, Wal-Mart and the Newspaper Consortium. Worked closely with Pricing and Yield Management, Legal, Finance and Channel Sales Managers to develop booking and billing processes. \n• Supervised day-to-day tasks of Media Delivery Coordinators. \n• Recipient of Elite Performer Award for the Newspaper Consortium Affiliate Team. Media Delivery Coordinator Yahoo! 2005  –  2007  (2 years) •Managed execution of media campaigns to ensure correct implementation and timely launch. \n•Optimized media campaigns by partnering with the internal Sales team to monitor delivery and creative changes. Media Delivery Coordinator Yahoo! 2005  –  2007  (2 years) •Managed execution of media campaigns to ensure correct implementation and timely launch. \n•Optimized media campaigns by partnering with the internal Sales team to monitor delivery and creative changes. Business Manager Bayshore Christian Ministries 2002  –  2005  (3 years) East Palo Alto, CA • Managed the disbursement of BCM’s grant funds, ensuring that all funds were spent in a manner compliant with the guidelines set by the foundation. \n• Responsible for all accounts payable and receivable, audit preparation and supervision of front desk personnel. \n• Assisted with event programming including Annual Open House, Donor “Thank You” Campaign and Summer Adventures in Learning Banquet. \n• Collaborated with Executive Director and Director of Development to prepare grant proposals and final reports. Business Manager Bayshore Christian Ministries 2002  –  2005  (3 years) East Palo Alto, CA • Managed the disbursement of BCM’s grant funds, ensuring that all funds were spent in a manner compliant with the guidelines set by the foundation. \n• Responsible for all accounts payable and receivable, audit preparation and supervision of front desk personnel. \n• Assisted with event programming including Annual Open House, Donor “Thank You” Campaign and Summer Adventures in Learning Banquet. \n• Collaborated with Executive Director and Director of Development to prepare grant proposals and final reports. Research Analyst MACRO Consulting, Inc. 2000  –  2002  (2 years) Palo Alto, CA • Executed customized product and market research.  \n• Managed instruction, progress of data field houses, and analysis of statistical data. Research Analyst MACRO Consulting, Inc. 2000  –  2002  (2 years) Palo Alto, CA • Executed customized product and market research.  \n• Managed instruction, progress of data field houses, and analysis of statistical data. Skills Product Management CRM Project Management Cross-functional Team... Display Advertising Ad Serving Management Skills  Product Management CRM Project Management Cross-functional Team... Display Advertising Ad Serving Management Product Management CRM Project Management Cross-functional Team... Display Advertising Ad Serving Management Product Management CRM Project Management Cross-functional Team... Display Advertising Ad Serving Management Education Santa Clara University Master of Business Administration (MBA) 2006  – 2009 University of California, San Diego B.S.,  Management Science Santa Clara University Master of Business Administration (MBA) 2006  – 2009 Santa Clara University Master of Business Administration (MBA) 2006  – 2009 Santa Clara University Master of Business Administration (MBA) 2006  – 2009 University of California, San Diego B.S.,  Management Science University of California, San Diego B.S.,  Management Science University of California, San Diego B.S.,  Management Science "]}