{"position": "Project Manager - Contractor", "company": "Google", "profiles": ["Summary Eric Tee is an internet veteran with over 15 years experience in digital advertising, retail, content marketing and editorial projects. Occupying varied roles as an entrepreneur, designer, developer, product and project manager. \n \nEric is currently a Media Development Project Manager for Yahoo Southeast Asia, responsible for launching sponsored content projects in Singapore, Malaysia, Philippines, Indonesia, Vietnam and Indonesia. \n \nHaving worked in various roles throughout his career, he has a solid understanding of what makes digital initiatives work for users from a product, marketing and monetisation point-of-view. \n \nThroughout his carreer, he is known for being a collaborator and a strong team player with both colleagues and external partners. He is also an early adapter of new platforms and technologies and is sought after within teams he has been a part of for consultations and opinions. \n \nEric is also passionate about corporate volunteerism and understanding the ability of an individual to give back to society using his/ her skill and talent. He leads CSR programmes in his company. \n \nSpecialties: editorial project management, Agile scrum methodology, design, user experience, content layouts, HTML/ CSS, photoshop, wireframing, prototyping, display ads, direct marketing, online content strategies, partnership relations Summary Eric Tee is an internet veteran with over 15 years experience in digital advertising, retail, content marketing and editorial projects. Occupying varied roles as an entrepreneur, designer, developer, product and project manager. \n \nEric is currently a Media Development Project Manager for Yahoo Southeast Asia, responsible for launching sponsored content projects in Singapore, Malaysia, Philippines, Indonesia, Vietnam and Indonesia. \n \nHaving worked in various roles throughout his career, he has a solid understanding of what makes digital initiatives work for users from a product, marketing and monetisation point-of-view. \n \nThroughout his carreer, he is known for being a collaborator and a strong team player with both colleagues and external partners. He is also an early adapter of new platforms and technologies and is sought after within teams he has been a part of for consultations and opinions. \n \nEric is also passionate about corporate volunteerism and understanding the ability of an individual to give back to society using his/ her skill and talent. He leads CSR programmes in his company. \n \nSpecialties: editorial project management, Agile scrum methodology, design, user experience, content layouts, HTML/ CSS, photoshop, wireframing, prototyping, display ads, direct marketing, online content strategies, partnership relations Eric Tee is an internet veteran with over 15 years experience in digital advertising, retail, content marketing and editorial projects. Occupying varied roles as an entrepreneur, designer, developer, product and project manager. \n \nEric is currently a Media Development Project Manager for Yahoo Southeast Asia, responsible for launching sponsored content projects in Singapore, Malaysia, Philippines, Indonesia, Vietnam and Indonesia. \n \nHaving worked in various roles throughout his career, he has a solid understanding of what makes digital initiatives work for users from a product, marketing and monetisation point-of-view. \n \nThroughout his carreer, he is known for being a collaborator and a strong team player with both colleagues and external partners. He is also an early adapter of new platforms and technologies and is sought after within teams he has been a part of for consultations and opinions. \n \nEric is also passionate about corporate volunteerism and understanding the ability of an individual to give back to society using his/ her skill and talent. He leads CSR programmes in his company. \n \nSpecialties: editorial project management, Agile scrum methodology, design, user experience, content layouts, HTML/ CSS, photoshop, wireframing, prototyping, display ads, direct marketing, online content strategies, partnership relations Eric Tee is an internet veteran with over 15 years experience in digital advertising, retail, content marketing and editorial projects. Occupying varied roles as an entrepreneur, designer, developer, product and project manager. \n \nEric is currently a Media Development Project Manager for Yahoo Southeast Asia, responsible for launching sponsored content projects in Singapore, Malaysia, Philippines, Indonesia, Vietnam and Indonesia. \n \nHaving worked in various roles throughout his career, he has a solid understanding of what makes digital initiatives work for users from a product, marketing and monetisation point-of-view. \n \nThroughout his carreer, he is known for being a collaborator and a strong team player with both colleagues and external partners. He is also an early adapter of new platforms and technologies and is sought after within teams he has been a part of for consultations and opinions. \n \nEric is also passionate about corporate volunteerism and understanding the ability of an individual to give back to society using his/ her skill and talent. He leads CSR programmes in his company. \n \nSpecialties: editorial project management, Agile scrum methodology, design, user experience, content layouts, HTML/ CSS, photoshop, wireframing, prototyping, display ads, direct marketing, online content strategies, partnership relations Experience Media Development Project Manager Yahoo! Southeast Asia July 2011  – Present (4 years 2 months) Singapore Lead the development and delivery of sponsored editorial projects for the Southeast Asia region. Worked closely with sales teams, editorial producers, content providers to craft innovative and effective solutions to clients. Project Manager, Custom Branded Experiences Yahoo! Southeast Asia August 2008  –  July 2011  (3 years) In charge of scoping for specifications, innovation and delivery of custom branded experiences for sponsors on Yahoo Southeast Asia properties. Webmonkey/ Pixel Pusher Thinking Loud 2004  –  2008  (4 years) Proprietor of an online marketing and design business. Responsible for creative production, and account servicing of clients for their online campaigns. Online Marketing Producer Yahoo! Singapore 2002  –  2004  (2 years) Produced, developed and managed online campaigns to promote products and services. Responsible for launching new ad formats. Senior Media Designer Silkroute Ventures 1998  –  2002  (4 years) Interactive designer for one of Singapore's earliest digital agencies Media Development Project Manager Yahoo! Southeast Asia July 2011  – Present (4 years 2 months) Singapore Lead the development and delivery of sponsored editorial projects for the Southeast Asia region. Worked closely with sales teams, editorial producers, content providers to craft innovative and effective solutions to clients. Media Development Project Manager Yahoo! Southeast Asia July 2011  – Present (4 years 2 months) Singapore Lead the development and delivery of sponsored editorial projects for the Southeast Asia region. Worked closely with sales teams, editorial producers, content providers to craft innovative and effective solutions to clients. Project Manager, Custom Branded Experiences Yahoo! Southeast Asia August 2008  –  July 2011  (3 years) In charge of scoping for specifications, innovation and delivery of custom branded experiences for sponsors on Yahoo Southeast Asia properties. Project Manager, Custom Branded Experiences Yahoo! Southeast Asia August 2008  –  July 2011  (3 years) In charge of scoping for specifications, innovation and delivery of custom branded experiences for sponsors on Yahoo Southeast Asia properties. Webmonkey/ Pixel Pusher Thinking Loud 2004  –  2008  (4 years) Proprietor of an online marketing and design business. Responsible for creative production, and account servicing of clients for their online campaigns. Webmonkey/ Pixel Pusher Thinking Loud 2004  –  2008  (4 years) Proprietor of an online marketing and design business. Responsible for creative production, and account servicing of clients for their online campaigns. Online Marketing Producer Yahoo! Singapore 2002  –  2004  (2 years) Produced, developed and managed online campaigns to promote products and services. Responsible for launching new ad formats. Online Marketing Producer Yahoo! Singapore 2002  –  2004  (2 years) Produced, developed and managed online campaigns to promote products and services. Responsible for launching new ad formats. Senior Media Designer Silkroute Ventures 1998  –  2002  (4 years) Interactive designer for one of Singapore's earliest digital agencies Senior Media Designer Silkroute Ventures 1998  –  2002  (4 years) Interactive designer for one of Singapore's earliest digital agencies Skills Digital Media Online Advertising Content Strategy User Experience Digital Marketing Online Marketing Web Analytics E-commerce Digital Strategy Social Media Marketing Social Media PPC Content Management Mobile Marketing Mobile Devices SEM Integrated Marketing Information Architecture Mobile Applications SEO New Media See 6+     See less Skills  Digital Media Online Advertising Content Strategy User Experience Digital Marketing Online Marketing Web Analytics E-commerce Digital Strategy Social Media Marketing Social Media PPC Content Management Mobile Marketing Mobile Devices SEM Integrated Marketing Information Architecture Mobile Applications SEO New Media See 6+     See less Digital Media Online Advertising Content Strategy User Experience Digital Marketing Online Marketing Web Analytics E-commerce Digital Strategy Social Media Marketing Social Media PPC Content Management Mobile Marketing Mobile Devices SEM Integrated Marketing Information Architecture Mobile Applications SEO New Media See 6+     See less Digital Media Online Advertising Content Strategy User Experience Digital Marketing Online Marketing Web Analytics E-commerce Digital Strategy Social Media Marketing Social Media PPC Content Management Mobile Marketing Mobile Devices SEM Integrated Marketing Information Architecture Mobile Applications SEO New Media See 6+     See less Education University of the Philippines CFA,  Major in Visual Communications University of the Philippines CFA,  Major in Visual Communications University of the Philippines CFA,  Major in Visual Communications University of the Philippines CFA,  Major in Visual Communications Honors & Awards Best Marketing Idea, HACK Singapore Yahoo Southeast Asia Pte Ltd December 2008 Bronze Award for Tigerbeer.com Creative Circle Awards 1999 Finalist for Sony Planet MG Online Campaign Creative Circle Awards 2000 Best Marketing Idea, HACK Singapore Yahoo Southeast Asia Pte Ltd December 2008 Best Marketing Idea, HACK Singapore Yahoo Southeast Asia Pte Ltd December 2008 Best Marketing Idea, HACK Singapore Yahoo Southeast Asia Pte Ltd December 2008 Bronze Award for Tigerbeer.com Creative Circle Awards 1999 Bronze Award for Tigerbeer.com Creative Circle Awards 1999 Bronze Award for Tigerbeer.com Creative Circle Awards 1999 Finalist for Sony Planet MG Online Campaign Creative Circle Awards 2000 Finalist for Sony Planet MG Online Campaign Creative Circle Awards 2000 Finalist for Sony Planet MG Online Campaign Creative Circle Awards 2000 ", "Summary Highly experienced and capable software project manager with a decade of experience on complex software projects for multinational clients many of whom are household names.  \nI’m a natural communicator and one of my key strengths is the ability to quickly forge lasting business relationships with my clients. Summary Highly experienced and capable software project manager with a decade of experience on complex software projects for multinational clients many of whom are household names.  \nI’m a natural communicator and one of my key strengths is the ability to quickly forge lasting business relationships with my clients. Highly experienced and capable software project manager with a decade of experience on complex software projects for multinational clients many of whom are household names.  \nI’m a natural communicator and one of my key strengths is the ability to quickly forge lasting business relationships with my clients. Highly experienced and capable software project manager with a decade of experience on complex software projects for multinational clients many of whom are household names.  \nI’m a natural communicator and one of my key strengths is the ability to quickly forge lasting business relationships with my clients. Experience Project Manager (Contract), Lionbridge at Microsoft Lionbridge April 2012  – Present (3 years 5 months) Dublin I am responsible for the localisation of Microsoft’s commercial packaging (Windows and Office) for EMEA and APOC regions. I work within Microsoft’s Global Art team delivering key milestones to the MS Programme Manager on budget and on schedule. My responsibilities include:  \n \n-\tWorking closely with the product launch service team and the MS Program Manager to manage the master Parts List. This is a constant process to define, refine and maintain the list of master products and the many thousands of correct component SKUs for all markets.  \n-\tDeveloping excellent reciprocal relationships with subsidiaries and vendors I can really count on to deliver. \n-\tFinancial management throughout the project lifecycle. Requesting quotation from vendors, submitting POs, regular cost reviews, reporting and closeout at the end of the project. \n-\tI personally carried out a pre-print QA on the final localised product. \n-\tStatus reporting calls to Microsoft US core development team. Project Manager Cipherion Translations May 2010  –  August 2011  (1 year 4 months) Dublin I was a Project Manager for key clients of Cipherion Traslation. I was responsible for project setup, training Junior Project Managers, status reporting to clients and COO and vendor management. Localisation Project Manager, Contracted to Microsoft (contract) Cpl Jobs Ireland May 2008  –  September 2008  (5 months) Dublin I was responsible for the Central Vendor Solutions (CVS) team as a project manager for Microsoft CRM and Business Contact Management team for 5 months contract. My responsibilities include CVS team timesheet management, localisation project management for CRM and BCM projects, reporting to Microsoft team and localisation vendor management. Project Manager Eurotext Translations October 2006  –  April 2008  (1 year 7 months) I was a localisation project manager for Eurotext’s major clients(GE, Dept of Justice, Dept of Foreign Affairs). I was responsible for project set up, status reporting to client and CEO, managing the budget for each project and also vendor management. Project Manager (contract) DV4 January 2006  –  October 2006  (10 months) Dublin Ireland As Project Manager at DV4 I managed the Vodafone and iTunes projects. My responsibilities were liaison with Vodafone Europe and Apple US, requirements analysis and management of content providers (Sony Music, EMI, Warner Music etc), cost management and status reporting to both the client and CEO. LQS Project Manager (contract) Lionbridge 2005  –  2005  (less than a year) I was the project manager for LQS (Language Quality Service) department at Lionbridge Dublin for 3 months contract. My responsibilities were project management and coordination of language reviewers for Motorola. Yahoo! Sports Producer Yahoo! JAPAN December 2002  –  November 2004  (2 years) I was a producer for Yahoo! Japan Sports division for the Media Business Group. My responsibilities were to create and produce the content for Yahoo! Japan Sports, negotiate with contents providers and ensure that tough visitorship KPIs were met. As part of this, I lead the team that created Yahoo! Japan Sports Paralympics 2005 site which won the Media Award Winners – Best Written Online award from International Paralympic Committee.  \n \nhttp://www.paralympic.org/TheIPC/HWA/TheParalympicMediaAwards Website Project Manager Dialonet K.K. February 2002  –  October 2002  (9 months) Tokyo, Japan I was responsible for the Toyota International Formula One team web site, creating new ideas to keep the site current and captivate the online audience. I worked directly with Toyota’s international marketing group to achieve a site that became a tremendous success in Toyota’s debut year in Formula One. Website Project Manager Spike April 2000  –  January 2002  (1 year 10 months) Tokyo, Japan I was a Website Project Manager for several large international companies. I worked on Smart Car launch Official Website for Japan. I also worked on Toyota F1 Official Website launch and content management. As a project manager, my responsibility was client management, budget management, client business requirement gathering and presentation of projects plans based on requirements. Project Manager SDL plc October 1996  –  March 2000  (3 years 6 months) Tokyo, Japan I was a localisation project manager for major software companies’ projects. I was responsible for client review management, schedule and budget management, also internal communication with other Project Managers based in UK. Project Manager (Contract), Lionbridge at Microsoft Lionbridge April 2012  – Present (3 years 5 months) Dublin I am responsible for the localisation of Microsoft’s commercial packaging (Windows and Office) for EMEA and APOC regions. I work within Microsoft’s Global Art team delivering key milestones to the MS Programme Manager on budget and on schedule. My responsibilities include:  \n \n-\tWorking closely with the product launch service team and the MS Program Manager to manage the master Parts List. This is a constant process to define, refine and maintain the list of master products and the many thousands of correct component SKUs for all markets.  \n-\tDeveloping excellent reciprocal relationships with subsidiaries and vendors I can really count on to deliver. \n-\tFinancial management throughout the project lifecycle. Requesting quotation from vendors, submitting POs, regular cost reviews, reporting and closeout at the end of the project. \n-\tI personally carried out a pre-print QA on the final localised product. \n-\tStatus reporting calls to Microsoft US core development team. Project Manager (Contract), Lionbridge at Microsoft Lionbridge April 2012  – Present (3 years 5 months) Dublin I am responsible for the localisation of Microsoft’s commercial packaging (Windows and Office) for EMEA and APOC regions. I work within Microsoft’s Global Art team delivering key milestones to the MS Programme Manager on budget and on schedule. My responsibilities include:  \n \n-\tWorking closely with the product launch service team and the MS Program Manager to manage the master Parts List. This is a constant process to define, refine and maintain the list of master products and the many thousands of correct component SKUs for all markets.  \n-\tDeveloping excellent reciprocal relationships with subsidiaries and vendors I can really count on to deliver. \n-\tFinancial management throughout the project lifecycle. Requesting quotation from vendors, submitting POs, regular cost reviews, reporting and closeout at the end of the project. \n-\tI personally carried out a pre-print QA on the final localised product. \n-\tStatus reporting calls to Microsoft US core development team. Project Manager Cipherion Translations May 2010  –  August 2011  (1 year 4 months) Dublin I was a Project Manager for key clients of Cipherion Traslation. I was responsible for project setup, training Junior Project Managers, status reporting to clients and COO and vendor management. Project Manager Cipherion Translations May 2010  –  August 2011  (1 year 4 months) Dublin I was a Project Manager for key clients of Cipherion Traslation. I was responsible for project setup, training Junior Project Managers, status reporting to clients and COO and vendor management. Localisation Project Manager, Contracted to Microsoft (contract) Cpl Jobs Ireland May 2008  –  September 2008  (5 months) Dublin I was responsible for the Central Vendor Solutions (CVS) team as a project manager for Microsoft CRM and Business Contact Management team for 5 months contract. My responsibilities include CVS team timesheet management, localisation project management for CRM and BCM projects, reporting to Microsoft team and localisation vendor management. Localisation Project Manager, Contracted to Microsoft (contract) Cpl Jobs Ireland May 2008  –  September 2008  (5 months) Dublin I was responsible for the Central Vendor Solutions (CVS) team as a project manager for Microsoft CRM and Business Contact Management team for 5 months contract. My responsibilities include CVS team timesheet management, localisation project management for CRM and BCM projects, reporting to Microsoft team and localisation vendor management. Project Manager Eurotext Translations October 2006  –  April 2008  (1 year 7 months) I was a localisation project manager for Eurotext’s major clients(GE, Dept of Justice, Dept of Foreign Affairs). I was responsible for project set up, status reporting to client and CEO, managing the budget for each project and also vendor management. Project Manager Eurotext Translations October 2006  –  April 2008  (1 year 7 months) I was a localisation project manager for Eurotext’s major clients(GE, Dept of Justice, Dept of Foreign Affairs). I was responsible for project set up, status reporting to client and CEO, managing the budget for each project and also vendor management. Project Manager (contract) DV4 January 2006  –  October 2006  (10 months) Dublin Ireland As Project Manager at DV4 I managed the Vodafone and iTunes projects. My responsibilities were liaison with Vodafone Europe and Apple US, requirements analysis and management of content providers (Sony Music, EMI, Warner Music etc), cost management and status reporting to both the client and CEO. Project Manager (contract) DV4 January 2006  –  October 2006  (10 months) Dublin Ireland As Project Manager at DV4 I managed the Vodafone and iTunes projects. My responsibilities were liaison with Vodafone Europe and Apple US, requirements analysis and management of content providers (Sony Music, EMI, Warner Music etc), cost management and status reporting to both the client and CEO. LQS Project Manager (contract) Lionbridge 2005  –  2005  (less than a year) I was the project manager for LQS (Language Quality Service) department at Lionbridge Dublin for 3 months contract. My responsibilities were project management and coordination of language reviewers for Motorola. LQS Project Manager (contract) Lionbridge 2005  –  2005  (less than a year) I was the project manager for LQS (Language Quality Service) department at Lionbridge Dublin for 3 months contract. My responsibilities were project management and coordination of language reviewers for Motorola. Yahoo! Sports Producer Yahoo! JAPAN December 2002  –  November 2004  (2 years) I was a producer for Yahoo! Japan Sports division for the Media Business Group. My responsibilities were to create and produce the content for Yahoo! Japan Sports, negotiate with contents providers and ensure that tough visitorship KPIs were met. As part of this, I lead the team that created Yahoo! Japan Sports Paralympics 2005 site which won the Media Award Winners – Best Written Online award from International Paralympic Committee.  \n \nhttp://www.paralympic.org/TheIPC/HWA/TheParalympicMediaAwards Yahoo! Sports Producer Yahoo! JAPAN December 2002  –  November 2004  (2 years) I was a producer for Yahoo! Japan Sports division for the Media Business Group. My responsibilities were to create and produce the content for Yahoo! Japan Sports, negotiate with contents providers and ensure that tough visitorship KPIs were met. As part of this, I lead the team that created Yahoo! Japan Sports Paralympics 2005 site which won the Media Award Winners – Best Written Online award from International Paralympic Committee.  \n \nhttp://www.paralympic.org/TheIPC/HWA/TheParalympicMediaAwards Website Project Manager Dialonet K.K. February 2002  –  October 2002  (9 months) Tokyo, Japan I was responsible for the Toyota International Formula One team web site, creating new ideas to keep the site current and captivate the online audience. I worked directly with Toyota’s international marketing group to achieve a site that became a tremendous success in Toyota’s debut year in Formula One. Website Project Manager Dialonet K.K. February 2002  –  October 2002  (9 months) Tokyo, Japan I was responsible for the Toyota International Formula One team web site, creating new ideas to keep the site current and captivate the online audience. I worked directly with Toyota’s international marketing group to achieve a site that became a tremendous success in Toyota’s debut year in Formula One. Website Project Manager Spike April 2000  –  January 2002  (1 year 10 months) Tokyo, Japan I was a Website Project Manager for several large international companies. I worked on Smart Car launch Official Website for Japan. I also worked on Toyota F1 Official Website launch and content management. As a project manager, my responsibility was client management, budget management, client business requirement gathering and presentation of projects plans based on requirements. Website Project Manager Spike April 2000  –  January 2002  (1 year 10 months) Tokyo, Japan I was a Website Project Manager for several large international companies. I worked on Smart Car launch Official Website for Japan. I also worked on Toyota F1 Official Website launch and content management. As a project manager, my responsibility was client management, budget management, client business requirement gathering and presentation of projects plans based on requirements. Project Manager SDL plc October 1996  –  March 2000  (3 years 6 months) Tokyo, Japan I was a localisation project manager for major software companies’ projects. I was responsible for client review management, schedule and budget management, also internal communication with other Project Managers based in UK. Project Manager SDL plc October 1996  –  March 2000  (3 years 6 months) Tokyo, Japan I was a localisation project manager for major software companies’ projects. I was responsible for client review management, schedule and budget management, also internal communication with other Project Managers based in UK. Languages Japanese Native or bilingual proficiency English Full professional proficiency Japanese Native or bilingual proficiency English Full professional proficiency Japanese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency ", "Summary • Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. \n \n• Resource Capacity Planning Management, Large scale Project Portfolio Management, Project initiation, planning and requirements, work breakdown, task definition, scheduling, project control, uncertainty management, software processes and lifecycle expertise.  \n \n• Certified Project Manager PMP.  \n \n• Technology: \nMVDC, DWDM (ONS-15454-MSTP), VMware ESX,, UCS, Unified Communication, MPLS, BGP, EIGRP, NMS/SNMP, Juniper Firewalls, Cisco ASR-1K, N7K, ASA-5585 Firewalls, DNS, IPv4/IPv6, SharePoint, UNIX, Collaboration Services (WebEx), QoS, Prog Languages C, C++, Java, HTML, Perl, Windows SDK/MFC, Oracle Database, Siebel CRM Software, Clarity and Vantive. \n \nSpecialties: IT Project Management and Software Engineering in Fortune 500 and startup companies like Cisco, Yahoo!, SanDisk, Apple, KLA-Tencor and others. Developed go-to market commercial software, managed high-value talent, and integrated infrastructure global systems, teams and product lines. \n \n• MANAGEMENT AND LEADERSHIP. \n \n• PROJECT AND PROGRAM MANAGEMENT. \n \n• TECHNOLOGY SUPPORT / IMPLEMENTATION. \n \n• PROCESS IMPLEMENTATION. \n \n• VENDOR MANAGEMENT AND NEGOTIATION Summary • Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. \n \n• Resource Capacity Planning Management, Large scale Project Portfolio Management, Project initiation, planning and requirements, work breakdown, task definition, scheduling, project control, uncertainty management, software processes and lifecycle expertise.  \n \n• Certified Project Manager PMP.  \n \n• Technology: \nMVDC, DWDM (ONS-15454-MSTP), VMware ESX,, UCS, Unified Communication, MPLS, BGP, EIGRP, NMS/SNMP, Juniper Firewalls, Cisco ASR-1K, N7K, ASA-5585 Firewalls, DNS, IPv4/IPv6, SharePoint, UNIX, Collaboration Services (WebEx), QoS, Prog Languages C, C++, Java, HTML, Perl, Windows SDK/MFC, Oracle Database, Siebel CRM Software, Clarity and Vantive. \n \nSpecialties: IT Project Management and Software Engineering in Fortune 500 and startup companies like Cisco, Yahoo!, SanDisk, Apple, KLA-Tencor and others. Developed go-to market commercial software, managed high-value talent, and integrated infrastructure global systems, teams and product lines. \n \n• MANAGEMENT AND LEADERSHIP. \n \n• PROJECT AND PROGRAM MANAGEMENT. \n \n• TECHNOLOGY SUPPORT / IMPLEMENTATION. \n \n• PROCESS IMPLEMENTATION. \n \n• VENDOR MANAGEMENT AND NEGOTIATION • Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. \n \n• Resource Capacity Planning Management, Large scale Project Portfolio Management, Project initiation, planning and requirements, work breakdown, task definition, scheduling, project control, uncertainty management, software processes and lifecycle expertise.  \n \n• Certified Project Manager PMP.  \n \n• Technology: \nMVDC, DWDM (ONS-15454-MSTP), VMware ESX,, UCS, Unified Communication, MPLS, BGP, EIGRP, NMS/SNMP, Juniper Firewalls, Cisco ASR-1K, N7K, ASA-5585 Firewalls, DNS, IPv4/IPv6, SharePoint, UNIX, Collaboration Services (WebEx), QoS, Prog Languages C, C++, Java, HTML, Perl, Windows SDK/MFC, Oracle Database, Siebel CRM Software, Clarity and Vantive. \n \nSpecialties: IT Project Management and Software Engineering in Fortune 500 and startup companies like Cisco, Yahoo!, SanDisk, Apple, KLA-Tencor and others. Developed go-to market commercial software, managed high-value talent, and integrated infrastructure global systems, teams and product lines. \n \n• MANAGEMENT AND LEADERSHIP. \n \n• PROJECT AND PROGRAM MANAGEMENT. \n \n• TECHNOLOGY SUPPORT / IMPLEMENTATION. \n \n• PROCESS IMPLEMENTATION. \n \n• VENDOR MANAGEMENT AND NEGOTIATION • Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. \n \n• Resource Capacity Planning Management, Large scale Project Portfolio Management, Project initiation, planning and requirements, work breakdown, task definition, scheduling, project control, uncertainty management, software processes and lifecycle expertise.  \n \n• Certified Project Manager PMP.  \n \n• Technology: \nMVDC, DWDM (ONS-15454-MSTP), VMware ESX,, UCS, Unified Communication, MPLS, BGP, EIGRP, NMS/SNMP, Juniper Firewalls, Cisco ASR-1K, N7K, ASA-5585 Firewalls, DNS, IPv4/IPv6, SharePoint, UNIX, Collaboration Services (WebEx), QoS, Prog Languages C, C++, Java, HTML, Perl, Windows SDK/MFC, Oracle Database, Siebel CRM Software, Clarity and Vantive. \n \nSpecialties: IT Project Management and Software Engineering in Fortune 500 and startup companies like Cisco, Yahoo!, SanDisk, Apple, KLA-Tencor and others. Developed go-to market commercial software, managed high-value talent, and integrated infrastructure global systems, teams and product lines. \n \n• MANAGEMENT AND LEADERSHIP. \n \n• PROJECT AND PROGRAM MANAGEMENT. \n \n• TECHNOLOGY SUPPORT / IMPLEMENTATION. \n \n• PROCESS IMPLEMENTATION. \n \n• VENDOR MANAGEMENT AND NEGOTIATION Experience IT Infrastructure Project Manager Cisco Systems January 2010  – Present (5 years 8 months) San Jose, CA Global Data Center Program - Project Manager Working under Cisco PMO for GDCP/NDCS organizations. Projects include Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. Including Project management to accomplish connectivity: \n \n• Build-outs for Allen TX, Amsterdam NL Metro Virtual Data Center(s) and Decommission Carrolton, TX for cost optimization – this includes working with carriers (AT&T, Verizon, Level(3), Eurofiber, C&W) With comprehensive Network Infrastructure (CAPNet WAN, iPOP/DMZ, RWAN/FSO Self-managed and Carrier-managed DWDM Metro Access Rings) for core backbone connectivity – Active/Active configuration, resilient, load-balanced, fault-tolerant, the state-of-art, energy efficient green initiatives in compliance to Cisco’s architectural specification and Industry best practices, utilizing Cisco ONS-15454-MSTP (DWDM), N7K, ASR-1K, 6500, 4900(s), ASA-5585 (FW).  \n \nTour the Allen Data Center - http://www.youtube.com/watch?v=r1Nt1z5uM44 \n \n• EMEA WAN Triangle Collateral Build-out (Brussels-Amsterdam-London) – CAPNet Backbone Infrastructure to support Triple-Play Services (WebEx, TelePresence, Unified Communication, Cisco.com, etc) \n• Integrate San Jose Carrier-neutral Facility (CNF) onto Metro Access Ring in compliance to Cisco DC Strategy to re-home ISP/SIP trunking Service and achieve cost savings initiatives for Wave Service. Program Manager and Business Development R3 Networks March 2009  –  December 2009  (10 months) San Jose, CA Project Manager leading Business Development effort in South America for startup company specializing in Infrastructure, Automation of performance, scalability, functional testing of network devices, QoS and Resource Capacity Planning . IT Program Manager / Shared Resource Manager (Contract) Cisco Systems June 2008  –  December 2008  (7 months) San Jose, CA Program manager for the IT Demand Clearing team laying the foundation for the successful management of current and future IT initiatives in Cisco by creating a process for matching the supply and demand for IT shared resources. Responsibilities include: \n• Responsible for liaising with Clients, Estimation Office, Supply and Demand teams resulting in an effective implementation of new companywide processes for Cisco. \n• Managed provisioning and Resource Capacity of over 100 projects for Manufacturing, Engineering and Quality (GSCQ) for FY09 resulting in Provisioning Servers, Storage, VMs, and Resources for over 30 projects. \n• Implemented Project Portfolio Management system (PPM) resulting in a centralized data for project and programs streamlining business processes for CISCO. IT Project Manager (Contract) Yahoo! October 2007  –  June 2008  (9 months) Sunnyvale, CA Project Manager for Datahighway Operations. Resource Capacity Planning Management, Infrastructure hardware upgrades, Colo Expansions and decommissioning; managing large worldwide installations in Asia, Europe, Latin America and USA. Including installation of new Data Centers, moves and closures. Experience in: \n• Managed provisioning and Resource Capacity Planning for DH operations for ~9000 PowerEdge DELL Rack servers Quad Core / Dual Core including implementation of Data Collectors, Receivers and Data Clusters for Yahoo Colos in Singapore, Taiwan, and Washington State. \n• Resource Capacity Planning for DH operations for Japan Data Highway Colos. \n• 25TB Upgrade using HBA Cards / Storage for Japan Data Warehouse to accommodate weblogs collection. IT Project Manager (Contract) Apple May 2007  –  August 2007  (4 months) Cupertino, CA Project Manager for Apple Retail Stores Infrastructure - 200+ with next generation networking equipment providing additional security, reliability, failover and bandwidth through bundled T1s and DS3s to all stores. Work included managing vendors AT&T for DS3 connectivity and ORANGE/Equant for installations and room readiness. \n• Managed provisioning, Resource Capacity Planning, configurations, installations as well as vendors AT&T, Orange Services and internal shipping. \n• 40% stores equipment installed and connectivity proof of concept installed in Flagship stores in San Francisco, Chicago, New York and Atlanta. \n• Equipment included Cisco switches, Juniper Firewalls and Avocent console servers for remote access. IT Project Manager (Contract) SanDisk October 2006  –  June 2007  (9 months) San Jose, CA IT Project Manager for Global MPLS WAN upgrade and deployment. Responsibilities include organizing, planning, and deployment for SanDisk and M-Systems network infrastructure supporting locations in Europe, Japan, China, Israel and the US as well as Vendor Management working with Level 3 and Global Crossings for Circuit installation. \n• Managed project to install IP Control appliances resulting in automated processes for IP addresses \n• Managed Data Center upgrade of secure remote management IT infrastructure projects; resulting in improved uptime and increased customer satisfaction.  \n• Work includes supervising worldwide Resource Capacity Planning, procurement, configuration, shipments, and installation of best of breed equipment. IT Project Manager (Contract) Cisco Systems May 2005  –  July 2006  (1 year 3 months) San Jose, CA IT Project Manager for IP Telephony (VoIP). Managed worldwide Tactical Development of Automation for Call Manager Provisioning and Voice Mail for Cisco Systems. Footprint covering Asia Pacific, Australia, Americas, Europe, Africa, and Middle East. Development teams Managed geographically distributed in the continental USA and Bangalore India. \n• Member of PM team implementing cost reduction of $7,000,000 per year for voicemail services; completing Cisco Unity program and replacing AVAYA worldwide.  \n• Managed Implementation Manager for IP Redirector using Windows OS with Projected Business Value of $349,980/yr resulting in user time costs reduction; $40,000/yr operational support cost reduction \n• Successfully Managed four IP Telephony Global deployments with Cisco footprint in AMERICAS, APAC, EMEA, SJ \n• Enabled and Managed IP Telephony India team from inception to maturity Sr. Project Manager Cayena Consulting January 2003  –  May 2005  (2 years 5 months) Saratoga, CA Project and Program Management Consulting. Saratoga, CA \nConsultant – Sr. Project Manager 2003 – 2005 Clients: \n• K-Bridge – Business Intelligence Integration  \n• Child Heath Foundation International (CFHI) – Volunteer \n• America Software - Anti-money laundering and regulatory compliance software. Director Cayena Consulting January 2003  –  April 2005  (2 years 4 months) San Jose, CA Project and Program Management Consulting. San Jose, CA \nProject Management Services and Project turn-around for projects in trouble; as well as IT Program Management Consulting to large and small Businesses delivering projects on-time and on-budget. \nClients: Cisco Systems, Yahoo!, SanDisk, Apple Inc, KLA-Tencor Director Network Technology Services CNET Networks/mySimon June 2000  –  February 2003  (2 years 9 months) San Francisco, CA Program Management of Internet European business units and domestic infrastructure tools. Senior Project Manager GRIC June 1999  –  June 2000  (1 year 1 month) San Jose, CA Project Management for VoIP Internet. Senior Project Manager / Senior Consultant Cambridge Technology Partners June 1998  –  June 1999  (1 year 1 month) Project Manager for Contact / Call Centers and Customer Relationship Services (CRM) to provide technology-consulting services to Latin American customers. Sr. Software Development Manager KLA-Tencor July 1995  –  June 1998  (3 years) Project Manager for the software implementation of the KLA-Tencor Viper 24xx series product line. The system enables capture of macro defects such as hot spots and others. Software Development Lead Molecular Dynamics October 1989  –  July 1995  (5 years 10 months) Lead Software Engineer responsible for design and implementation of image analysis software designed to assist life science researchers using Densitometer™, Phosphorimager™, and Fluorimager™ product lines. IT Infrastructure Project Manager Cisco Systems January 2010  – Present (5 years 8 months) San Jose, CA Global Data Center Program - Project Manager Working under Cisco PMO for GDCP/NDCS organizations. Projects include Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. Including Project management to accomplish connectivity: \n \n• Build-outs for Allen TX, Amsterdam NL Metro Virtual Data Center(s) and Decommission Carrolton, TX for cost optimization – this includes working with carriers (AT&T, Verizon, Level(3), Eurofiber, C&W) With comprehensive Network Infrastructure (CAPNet WAN, iPOP/DMZ, RWAN/FSO Self-managed and Carrier-managed DWDM Metro Access Rings) for core backbone connectivity – Active/Active configuration, resilient, load-balanced, fault-tolerant, the state-of-art, energy efficient green initiatives in compliance to Cisco’s architectural specification and Industry best practices, utilizing Cisco ONS-15454-MSTP (DWDM), N7K, ASR-1K, 6500, 4900(s), ASA-5585 (FW).  \n \nTour the Allen Data Center - http://www.youtube.com/watch?v=r1Nt1z5uM44 \n \n• EMEA WAN Triangle Collateral Build-out (Brussels-Amsterdam-London) – CAPNet Backbone Infrastructure to support Triple-Play Services (WebEx, TelePresence, Unified Communication, Cisco.com, etc) \n• Integrate San Jose Carrier-neutral Facility (CNF) onto Metro Access Ring in compliance to Cisco DC Strategy to re-home ISP/SIP trunking Service and achieve cost savings initiatives for Wave Service. IT Infrastructure Project Manager Cisco Systems January 2010  – Present (5 years 8 months) San Jose, CA Global Data Center Program - Project Manager Working under Cisco PMO for GDCP/NDCS organizations. Projects include Metro Virtualized Data Center(s) (MVDC) construction/builds and network connectivity for USA (Texas region) and Europe (London, Brussels, Amsterdam Metropolitan areas). Including long haul circuits and metro area networks in collaboration with Cisco International, Verizon, AT&T, Level(3) and European Carriers for UVN access and Dark Fiber ring expansion projects. Including Project management to accomplish connectivity: \n \n• Build-outs for Allen TX, Amsterdam NL Metro Virtual Data Center(s) and Decommission Carrolton, TX for cost optimization – this includes working with carriers (AT&T, Verizon, Level(3), Eurofiber, C&W) With comprehensive Network Infrastructure (CAPNet WAN, iPOP/DMZ, RWAN/FSO Self-managed and Carrier-managed DWDM Metro Access Rings) for core backbone connectivity – Active/Active configuration, resilient, load-balanced, fault-tolerant, the state-of-art, energy efficient green initiatives in compliance to Cisco’s architectural specification and Industry best practices, utilizing Cisco ONS-15454-MSTP (DWDM), N7K, ASR-1K, 6500, 4900(s), ASA-5585 (FW).  \n \nTour the Allen Data Center - http://www.youtube.com/watch?v=r1Nt1z5uM44 \n \n• EMEA WAN Triangle Collateral Build-out (Brussels-Amsterdam-London) – CAPNet Backbone Infrastructure to support Triple-Play Services (WebEx, TelePresence, Unified Communication, Cisco.com, etc) \n• Integrate San Jose Carrier-neutral Facility (CNF) onto Metro Access Ring in compliance to Cisco DC Strategy to re-home ISP/SIP trunking Service and achieve cost savings initiatives for Wave Service. Program Manager and Business Development R3 Networks March 2009  –  December 2009  (10 months) San Jose, CA Project Manager leading Business Development effort in South America for startup company specializing in Infrastructure, Automation of performance, scalability, functional testing of network devices, QoS and Resource Capacity Planning . Program Manager and Business Development R3 Networks March 2009  –  December 2009  (10 months) San Jose, CA Project Manager leading Business Development effort in South America for startup company specializing in Infrastructure, Automation of performance, scalability, functional testing of network devices, QoS and Resource Capacity Planning . IT Program Manager / Shared Resource Manager (Contract) Cisco Systems June 2008  –  December 2008  (7 months) San Jose, CA Program manager for the IT Demand Clearing team laying the foundation for the successful management of current and future IT initiatives in Cisco by creating a process for matching the supply and demand for IT shared resources. Responsibilities include: \n• Responsible for liaising with Clients, Estimation Office, Supply and Demand teams resulting in an effective implementation of new companywide processes for Cisco. \n• Managed provisioning and Resource Capacity of over 100 projects for Manufacturing, Engineering and Quality (GSCQ) for FY09 resulting in Provisioning Servers, Storage, VMs, and Resources for over 30 projects. \n• Implemented Project Portfolio Management system (PPM) resulting in a centralized data for project and programs streamlining business processes for CISCO. IT Program Manager / Shared Resource Manager (Contract) Cisco Systems June 2008  –  December 2008  (7 months) San Jose, CA Program manager for the IT Demand Clearing team laying the foundation for the successful management of current and future IT initiatives in Cisco by creating a process for matching the supply and demand for IT shared resources. Responsibilities include: \n• Responsible for liaising with Clients, Estimation Office, Supply and Demand teams resulting in an effective implementation of new companywide processes for Cisco. \n• Managed provisioning and Resource Capacity of over 100 projects for Manufacturing, Engineering and Quality (GSCQ) for FY09 resulting in Provisioning Servers, Storage, VMs, and Resources for over 30 projects. \n• Implemented Project Portfolio Management system (PPM) resulting in a centralized data for project and programs streamlining business processes for CISCO. IT Project Manager (Contract) Yahoo! October 2007  –  June 2008  (9 months) Sunnyvale, CA Project Manager for Datahighway Operations. Resource Capacity Planning Management, Infrastructure hardware upgrades, Colo Expansions and decommissioning; managing large worldwide installations in Asia, Europe, Latin America and USA. Including installation of new Data Centers, moves and closures. Experience in: \n• Managed provisioning and Resource Capacity Planning for DH operations for ~9000 PowerEdge DELL Rack servers Quad Core / Dual Core including implementation of Data Collectors, Receivers and Data Clusters for Yahoo Colos in Singapore, Taiwan, and Washington State. \n• Resource Capacity Planning for DH operations for Japan Data Highway Colos. \n• 25TB Upgrade using HBA Cards / Storage for Japan Data Warehouse to accommodate weblogs collection. IT Project Manager (Contract) Yahoo! October 2007  –  June 2008  (9 months) Sunnyvale, CA Project Manager for Datahighway Operations. Resource Capacity Planning Management, Infrastructure hardware upgrades, Colo Expansions and decommissioning; managing large worldwide installations in Asia, Europe, Latin America and USA. Including installation of new Data Centers, moves and closures. Experience in: \n• Managed provisioning and Resource Capacity Planning for DH operations for ~9000 PowerEdge DELL Rack servers Quad Core / Dual Core including implementation of Data Collectors, Receivers and Data Clusters for Yahoo Colos in Singapore, Taiwan, and Washington State. \n• Resource Capacity Planning for DH operations for Japan Data Highway Colos. \n• 25TB Upgrade using HBA Cards / Storage for Japan Data Warehouse to accommodate weblogs collection. IT Project Manager (Contract) Apple May 2007  –  August 2007  (4 months) Cupertino, CA Project Manager for Apple Retail Stores Infrastructure - 200+ with next generation networking equipment providing additional security, reliability, failover and bandwidth through bundled T1s and DS3s to all stores. Work included managing vendors AT&T for DS3 connectivity and ORANGE/Equant for installations and room readiness. \n• Managed provisioning, Resource Capacity Planning, configurations, installations as well as vendors AT&T, Orange Services and internal shipping. \n• 40% stores equipment installed and connectivity proof of concept installed in Flagship stores in San Francisco, Chicago, New York and Atlanta. \n• Equipment included Cisco switches, Juniper Firewalls and Avocent console servers for remote access. IT Project Manager (Contract) Apple May 2007  –  August 2007  (4 months) Cupertino, CA Project Manager for Apple Retail Stores Infrastructure - 200+ with next generation networking equipment providing additional security, reliability, failover and bandwidth through bundled T1s and DS3s to all stores. Work included managing vendors AT&T for DS3 connectivity and ORANGE/Equant for installations and room readiness. \n• Managed provisioning, Resource Capacity Planning, configurations, installations as well as vendors AT&T, Orange Services and internal shipping. \n• 40% stores equipment installed and connectivity proof of concept installed in Flagship stores in San Francisco, Chicago, New York and Atlanta. \n• Equipment included Cisco switches, Juniper Firewalls and Avocent console servers for remote access. IT Project Manager (Contract) SanDisk October 2006  –  June 2007  (9 months) San Jose, CA IT Project Manager for Global MPLS WAN upgrade and deployment. Responsibilities include organizing, planning, and deployment for SanDisk and M-Systems network infrastructure supporting locations in Europe, Japan, China, Israel and the US as well as Vendor Management working with Level 3 and Global Crossings for Circuit installation. \n• Managed project to install IP Control appliances resulting in automated processes for IP addresses \n• Managed Data Center upgrade of secure remote management IT infrastructure projects; resulting in improved uptime and increased customer satisfaction.  \n• Work includes supervising worldwide Resource Capacity Planning, procurement, configuration, shipments, and installation of best of breed equipment. IT Project Manager (Contract) SanDisk October 2006  –  June 2007  (9 months) San Jose, CA IT Project Manager for Global MPLS WAN upgrade and deployment. Responsibilities include organizing, planning, and deployment for SanDisk and M-Systems network infrastructure supporting locations in Europe, Japan, China, Israel and the US as well as Vendor Management working with Level 3 and Global Crossings for Circuit installation. \n• Managed project to install IP Control appliances resulting in automated processes for IP addresses \n• Managed Data Center upgrade of secure remote management IT infrastructure projects; resulting in improved uptime and increased customer satisfaction.  \n• Work includes supervising worldwide Resource Capacity Planning, procurement, configuration, shipments, and installation of best of breed equipment. IT Project Manager (Contract) Cisco Systems May 2005  –  July 2006  (1 year 3 months) San Jose, CA IT Project Manager for IP Telephony (VoIP). Managed worldwide Tactical Development of Automation for Call Manager Provisioning and Voice Mail for Cisco Systems. Footprint covering Asia Pacific, Australia, Americas, Europe, Africa, and Middle East. Development teams Managed geographically distributed in the continental USA and Bangalore India. \n• Member of PM team implementing cost reduction of $7,000,000 per year for voicemail services; completing Cisco Unity program and replacing AVAYA worldwide.  \n• Managed Implementation Manager for IP Redirector using Windows OS with Projected Business Value of $349,980/yr resulting in user time costs reduction; $40,000/yr operational support cost reduction \n• Successfully Managed four IP Telephony Global deployments with Cisco footprint in AMERICAS, APAC, EMEA, SJ \n• Enabled and Managed IP Telephony India team from inception to maturity IT Project Manager (Contract) Cisco Systems May 2005  –  July 2006  (1 year 3 months) San Jose, CA IT Project Manager for IP Telephony (VoIP). Managed worldwide Tactical Development of Automation for Call Manager Provisioning and Voice Mail for Cisco Systems. Footprint covering Asia Pacific, Australia, Americas, Europe, Africa, and Middle East. Development teams Managed geographically distributed in the continental USA and Bangalore India. \n• Member of PM team implementing cost reduction of $7,000,000 per year for voicemail services; completing Cisco Unity program and replacing AVAYA worldwide.  \n• Managed Implementation Manager for IP Redirector using Windows OS with Projected Business Value of $349,980/yr resulting in user time costs reduction; $40,000/yr operational support cost reduction \n• Successfully Managed four IP Telephony Global deployments with Cisco footprint in AMERICAS, APAC, EMEA, SJ \n• Enabled and Managed IP Telephony India team from inception to maturity Sr. Project Manager Cayena Consulting January 2003  –  May 2005  (2 years 5 months) Saratoga, CA Project and Program Management Consulting. Saratoga, CA \nConsultant – Sr. Project Manager 2003 – 2005 Clients: \n• K-Bridge – Business Intelligence Integration  \n• Child Heath Foundation International (CFHI) – Volunteer \n• America Software - Anti-money laundering and regulatory compliance software. Sr. Project Manager Cayena Consulting January 2003  –  May 2005  (2 years 5 months) Saratoga, CA Project and Program Management Consulting. Saratoga, CA \nConsultant – Sr. Project Manager 2003 – 2005 Clients: \n• K-Bridge – Business Intelligence Integration  \n• Child Heath Foundation International (CFHI) – Volunteer \n• America Software - Anti-money laundering and regulatory compliance software. Director Cayena Consulting January 2003  –  April 2005  (2 years 4 months) San Jose, CA Project and Program Management Consulting. San Jose, CA \nProject Management Services and Project turn-around for projects in trouble; as well as IT Program Management Consulting to large and small Businesses delivering projects on-time and on-budget. \nClients: Cisco Systems, Yahoo!, SanDisk, Apple Inc, KLA-Tencor Director Cayena Consulting January 2003  –  April 2005  (2 years 4 months) San Jose, CA Project and Program Management Consulting. San Jose, CA \nProject Management Services and Project turn-around for projects in trouble; as well as IT Program Management Consulting to large and small Businesses delivering projects on-time and on-budget. \nClients: Cisco Systems, Yahoo!, SanDisk, Apple Inc, KLA-Tencor Director Network Technology Services CNET Networks/mySimon June 2000  –  February 2003  (2 years 9 months) San Francisco, CA Program Management of Internet European business units and domestic infrastructure tools. Director Network Technology Services CNET Networks/mySimon June 2000  –  February 2003  (2 years 9 months) San Francisco, CA Program Management of Internet European business units and domestic infrastructure tools. Senior Project Manager GRIC June 1999  –  June 2000  (1 year 1 month) San Jose, CA Project Management for VoIP Internet. Senior Project Manager GRIC June 1999  –  June 2000  (1 year 1 month) San Jose, CA Project Management for VoIP Internet. Senior Project Manager / Senior Consultant Cambridge Technology Partners June 1998  –  June 1999  (1 year 1 month) Project Manager for Contact / Call Centers and Customer Relationship Services (CRM) to provide technology-consulting services to Latin American customers. Senior Project Manager / Senior Consultant Cambridge Technology Partners June 1998  –  June 1999  (1 year 1 month) Project Manager for Contact / Call Centers and Customer Relationship Services (CRM) to provide technology-consulting services to Latin American customers. Sr. Software Development Manager KLA-Tencor July 1995  –  June 1998  (3 years) Project Manager for the software implementation of the KLA-Tencor Viper 24xx series product line. The system enables capture of macro defects such as hot spots and others. Sr. Software Development Manager KLA-Tencor July 1995  –  June 1998  (3 years) Project Manager for the software implementation of the KLA-Tencor Viper 24xx series product line. The system enables capture of macro defects such as hot spots and others. Software Development Lead Molecular Dynamics October 1989  –  July 1995  (5 years 10 months) Lead Software Engineer responsible for design and implementation of image analysis software designed to assist life science researchers using Densitometer™, Phosphorimager™, and Fluorimager™ product lines. Software Development Lead Molecular Dynamics October 1989  –  July 1995  (5 years 10 months) Lead Software Engineer responsible for design and implementation of image analysis software designed to assist life science researchers using Densitometer™, Phosphorimager™, and Fluorimager™ product lines. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Vendor Management Program Management Project Management Infrastructure Cisco Technologies PMP PMO Project Portfolio... Data Center Cloud Computing Integration Product Management Software Project... VoIP Agile Project Management IT Operations Resource Management Telecommunications IT Management IT Strategy Cross-functional Team... Management Visio SDLC Security CRM ITIL Business Intelligence Software Development Software Documentation Business Process SharePoint Unix System Deployment WAN Strategy IP Servers Storage Start-ups Firewalls Enterprise Software DNS IT Service Management See 29+     See less Skills  Vendor Management Program Management Project Management Infrastructure Cisco Technologies PMP PMO Project Portfolio... Data Center Cloud Computing Integration Product Management Software Project... VoIP Agile Project Management IT Operations Resource Management Telecommunications IT Management IT Strategy Cross-functional Team... Management Visio SDLC Security CRM ITIL Business Intelligence Software Development Software Documentation Business Process SharePoint Unix System Deployment WAN Strategy IP Servers Storage Start-ups Firewalls Enterprise Software DNS IT Service Management See 29+     See less Vendor Management Program Management Project Management Infrastructure Cisco Technologies PMP PMO Project Portfolio... Data Center Cloud Computing Integration Product Management Software Project... VoIP Agile Project Management IT Operations Resource Management Telecommunications IT Management IT Strategy Cross-functional Team... Management Visio SDLC Security CRM ITIL Business Intelligence Software Development Software Documentation Business Process SharePoint Unix System Deployment WAN Strategy IP Servers Storage Start-ups Firewalls Enterprise Software DNS IT Service Management See 29+     See less Vendor Management Program Management Project Management Infrastructure Cisco Technologies PMP PMO Project Portfolio... Data Center Cloud Computing Integration Product Management Software Project... VoIP Agile Project Management IT Operations Resource Management Telecommunications IT Management IT Strategy Cross-functional Team... Management Visio SDLC Security CRM ITIL Business Intelligence Software Development Software Documentation Business Process SharePoint Unix System Deployment WAN Strategy IP Servers Storage Start-ups Firewalls Enterprise Software DNS IT Service Management See 29+     See less Education University of California, Santa Cruz Certificate,  Project and Program Management 2003  – 2004 PMI / PMP Certification University of Florida MS,  Electrical Engineering 1981  – 1983 Florida International University BS,  Electronic Engineering Technology 1979  – 1981 Universidad Nacional Experimental Simón Bolívar Electronic Engineering 1975  – 1978 University of California, Santa Cruz Certificate,  Project and Program Management 2003  – 2004 PMI / PMP Certification University of California, Santa Cruz Certificate,  Project and Program Management 2003  – 2004 PMI / PMP Certification University of California, Santa Cruz Certificate,  Project and Program Management 2003  – 2004 PMI / PMP Certification University of Florida MS,  Electrical Engineering 1981  – 1983 University of Florida MS,  Electrical Engineering 1981  – 1983 University of Florida MS,  Electrical Engineering 1981  – 1983 Florida International University BS,  Electronic Engineering Technology 1979  – 1981 Florida International University BS,  Electronic Engineering Technology 1979  – 1981 Florida International University BS,  Electronic Engineering Technology 1979  – 1981 Universidad Nacional Experimental Simón Bolívar Electronic Engineering 1975  – 1978 Universidad Nacional Experimental Simón Bolívar Electronic Engineering 1975  – 1978 Universidad Nacional Experimental Simón Bolívar Electronic Engineering 1975  – 1978 ", "Languages Italian English Italian English Italian English Skills Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less Skills  Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less Online Marketing Search Advertising PPC SEM Yahoo Search Marketing Campaign Account Management Analytics Optimization Online Advertising Digital Marketing Upselling Yahoo Search Marketing Search Advertising E-commerce Campaigns Strategy Display Advertising Lead Generation Training Mobile Marketing Mobile Advertising Conversion Optimization Web Analytics Ad Networks Behavioral Targeting MSN AdCenter Google Adwords Digital Strategy See 16+     See less ", "Summary Please see my CV at www.berriman.com.au for more information. \n \nI’m an experienced Digital/Agile Project Manager - I’ve attained PRINCE2 Practitioner accreditation, ScrumMaster (Scrum/Agile) certification and completed the Project Management Professional (PMP) training course based on PMBOK offered by the Project Management Institute, (PMI); I am also a competent Business Analyst (au fait with BABOK) and Senior Producer.  \n \nThroughout my career I have developed a wealth of experience, knowledge and skills across many facets of project management (end-to-end), both in the business and technical streams working for large corporate organisations (Yahoo!7, Microsoft, Woolworths, Optus, Telstra, Sensis) and digital agencies (HotHouse Interactive, Visual Jazz/Isobar, C4 Communication, DT, Ingena). \n \nI have an extensive and varied breadth and depth of experience working on projects in the following areas: \n \nSpecialties: Retail, Telecommunications, Digital Agencies, Automotive, Health, Defence, Software, Hardware | working on complex platforms/infrastructures, Web development (Internet/Intranet), Responsive Web Design (RWD), Adaptive Web Design (AWD), AngularJS, Mobile development (Native/Web/Hybrid apps on Apple iOS - iPad/iPhone, Android, tablets, mobile devices), Application development (HTML, CSS, XML, Javascript, AIR, Flash, Java, .NET, Objective C, Ruby on Rails, Perl, My SQL, Sybase), Games development (Flash, ActionScript), e-commerce (ePages, Blue Martini/RedPrairie, payment gateways, Datacash's 3rd Man/GateKeeper fraud prevention), CMS (Umbraco, Alfresco, Vignette, Sitecore), SMS-based apps, touch screen kiosks and menu boards, directory services and search engines (Sensis). Summary Please see my CV at www.berriman.com.au for more information. \n \nI’m an experienced Digital/Agile Project Manager - I’ve attained PRINCE2 Practitioner accreditation, ScrumMaster (Scrum/Agile) certification and completed the Project Management Professional (PMP) training course based on PMBOK offered by the Project Management Institute, (PMI); I am also a competent Business Analyst (au fait with BABOK) and Senior Producer.  \n \nThroughout my career I have developed a wealth of experience, knowledge and skills across many facets of project management (end-to-end), both in the business and technical streams working for large corporate organisations (Yahoo!7, Microsoft, Woolworths, Optus, Telstra, Sensis) and digital agencies (HotHouse Interactive, Visual Jazz/Isobar, C4 Communication, DT, Ingena). \n \nI have an extensive and varied breadth and depth of experience working on projects in the following areas: \n \nSpecialties: Retail, Telecommunications, Digital Agencies, Automotive, Health, Defence, Software, Hardware | working on complex platforms/infrastructures, Web development (Internet/Intranet), Responsive Web Design (RWD), Adaptive Web Design (AWD), AngularJS, Mobile development (Native/Web/Hybrid apps on Apple iOS - iPad/iPhone, Android, tablets, mobile devices), Application development (HTML, CSS, XML, Javascript, AIR, Flash, Java, .NET, Objective C, Ruby on Rails, Perl, My SQL, Sybase), Games development (Flash, ActionScript), e-commerce (ePages, Blue Martini/RedPrairie, payment gateways, Datacash's 3rd Man/GateKeeper fraud prevention), CMS (Umbraco, Alfresco, Vignette, Sitecore), SMS-based apps, touch screen kiosks and menu boards, directory services and search engines (Sensis). Please see my CV at www.berriman.com.au for more information. \n \nI’m an experienced Digital/Agile Project Manager - I’ve attained PRINCE2 Practitioner accreditation, ScrumMaster (Scrum/Agile) certification and completed the Project Management Professional (PMP) training course based on PMBOK offered by the Project Management Institute, (PMI); I am also a competent Business Analyst (au fait with BABOK) and Senior Producer.  \n \nThroughout my career I have developed a wealth of experience, knowledge and skills across many facets of project management (end-to-end), both in the business and technical streams working for large corporate organisations (Yahoo!7, Microsoft, Woolworths, Optus, Telstra, Sensis) and digital agencies (HotHouse Interactive, Visual Jazz/Isobar, C4 Communication, DT, Ingena). \n \nI have an extensive and varied breadth and depth of experience working on projects in the following areas: \n \nSpecialties: Retail, Telecommunications, Digital Agencies, Automotive, Health, Defence, Software, Hardware | working on complex platforms/infrastructures, Web development (Internet/Intranet), Responsive Web Design (RWD), Adaptive Web Design (AWD), AngularJS, Mobile development (Native/Web/Hybrid apps on Apple iOS - iPad/iPhone, Android, tablets, mobile devices), Application development (HTML, CSS, XML, Javascript, AIR, Flash, Java, .NET, Objective C, Ruby on Rails, Perl, My SQL, Sybase), Games development (Flash, ActionScript), e-commerce (ePages, Blue Martini/RedPrairie, payment gateways, Datacash's 3rd Man/GateKeeper fraud prevention), CMS (Umbraco, Alfresco, Vignette, Sitecore), SMS-based apps, touch screen kiosks and menu boards, directory services and search engines (Sensis). Please see my CV at www.berriman.com.au for more information. \n \nI’m an experienced Digital/Agile Project Manager - I’ve attained PRINCE2 Practitioner accreditation, ScrumMaster (Scrum/Agile) certification and completed the Project Management Professional (PMP) training course based on PMBOK offered by the Project Management Institute, (PMI); I am also a competent Business Analyst (au fait with BABOK) and Senior Producer.  \n \nThroughout my career I have developed a wealth of experience, knowledge and skills across many facets of project management (end-to-end), both in the business and technical streams working for large corporate organisations (Yahoo!7, Microsoft, Woolworths, Optus, Telstra, Sensis) and digital agencies (HotHouse Interactive, Visual Jazz/Isobar, C4 Communication, DT, Ingena). \n \nI have an extensive and varied breadth and depth of experience working on projects in the following areas: \n \nSpecialties: Retail, Telecommunications, Digital Agencies, Automotive, Health, Defence, Software, Hardware | working on complex platforms/infrastructures, Web development (Internet/Intranet), Responsive Web Design (RWD), Adaptive Web Design (AWD), AngularJS, Mobile development (Native/Web/Hybrid apps on Apple iOS - iPad/iPhone, Android, tablets, mobile devices), Application development (HTML, CSS, XML, Javascript, AIR, Flash, Java, .NET, Objective C, Ruby on Rails, Perl, My SQL, Sybase), Games development (Flash, ActionScript), e-commerce (ePages, Blue Martini/RedPrairie, payment gateways, Datacash's 3rd Man/GateKeeper fraud prevention), CMS (Umbraco, Alfresco, Vignette, Sitecore), SMS-based apps, touch screen kiosks and menu boards, directory services and search engines (Sensis). Experience Digital/Agile Project Manager | ScrumMaster | IM (Contractor) Berriman Internet Consulting Pty Limited September 1998  – Present (17 years) Sydney Area, Australia FUNCTIONAL & CROSS-FUNCTIONAL AREAS \n \nMy Project Management approach integrates many facets of project management, stakeholder management & teamwork with the following functional and cross-functional areas: Business Analysis, Business Case development, Strategy, Account Mgt/Client Services, Sales, Marketing, Product Management, Brand, CRM, User Experience (UX), Usability Testing, Creative, Visual Design, Animation, Technical Solution Design, Security, Networking, Ops, Analytics, Reporting, Development, Production, Content Management, Copy Writing, SEO/SEM, QA, Testing, Vendor Management, Legal, Regulatory, Training, Finance & Procurement. \n \nPROJECT DELIVERABLES \n \nI have proficiency with the following project deliverables as needed: Project Management Plans (Scope, Time, Cost, Resource, Quality, Risk, Stakeholder, Communications, Procurement & Change Management), Project Registers (RAID), Business Cases, Proposals, SOWs, Forecasting, Cost Estimates, Project Budgets, Agile/Scrum artifacts, Business Requirements Documents (Functional/Non-Functional), Requirements Traceability Matrix, RACI, Facilitation of Scope/Req. Workshops, High Level Scope Documents, High Level Timelines, Project Schedules/Gantt Charts, Comparison Matrixes, Project Status Reports, Project Admin, Project Org Charts/Stakeholder Mapping, Risk Management, Project Meetings, Minutes, Functional Specs, High Level Solution Diagrams, Content Plans, Site Maps, Wireframes (static & dynamic), User Stories, Use Cases, Sequence Diagrams, Flow Charts, Activity Diagrams, Process Charts, Training, Product Demos, Test Plans, Test Cases & Deployment Plans. \n \nSOFTWARE \n \nSoftware platforms, systems & apps that I am au fait with include: SAP-based Proj. Mgt. Infon. Systems, Basecamp, BCC AdSystems, JIRA, GreenHopper, Rally, TFS, Yammer, Mercury Quality Centre, Project, Project Svr, Visio, Word, Excel, PowerPoint, Google Docs, Enterprise Architect, Axure, Photoshop, Dropbox, Evernote, Homesite & a variety of utilities. Project Manager The Wine Quarter - Woolworths Limited January 2015  – Present (8 months) Please see my CV at www.berriman.com.au Senior Project Manager / ScrumMaster Yahoo April 2014  –  September 2014  (6 months) Yahoo!7 \nPlease see my CV at www.berriman.com.au Senior Project Manager - Macquarie Bank projects DT January 2014  –  March 2014  (3 months) DTDigital - Ogilvy & Mather \nPlease see my CV at www.berriman.com.au Lead Project Manager - Toyota projects HotHouse September 2013  –  November 2013  (3 months) Please see my CV at www.berriman.com.au Senior Project Manager Woolworths Limited January 2013  –  August 2013  (8 months) Please see my CV at www.berriman.com.au Senior Project Manager - Toyota projects HotHouse April 2012  –  December 2012  (9 months) Please see my CV at www.berriman.com.au Business Program Manager Optus May 2011  –  April 2012  (1 year) Please see my CV at www.berriman.com.au Snr Project Manager / Snr Business Analyst Inspire November 2010  –  May 2011  (7 months) Please see my CV at www.berriman.com.au Project Manager / Senior Producer Optus August 2009  –  October 2010  (1 year 3 months) Please see my CV at www.berriman.com.au Project Manager - Telstra projects C4 Communication 2009  –  2009  (less than a year) Please see my CV at www.berriman.com.au Project Manager Telstra 2008  –  2008  (less than a year) Please see my CV at www.berriman.com.au Project Manager / Business Analyst Sensis 2006  –  2008  (2 years) Please see my CV at www.berriman.com.au Project Manager - Defence projects Visual Jazz 2007  –  2007  (less than a year) Please see my CV at www.berriman.com.au Account Manager / Project Manager - Telstra projects Ingena 2005  –  2006  (1 year) Please see my CV at www.berriman.com.au Technical Project Manager eCorner (ePages GmbH) 2003  –  2005  (2 years) Please see my CV at www.berriman.com.au Product Development Manager Optus 2000  –  2003  (3 years) Please see my CV at www.berriman.com.au Senior Producer Microsoft 1989  –  1999  (10 years) Please see my CV at www.berriman.com.au Digital/Agile Project Manager | ScrumMaster | IM (Contractor) Berriman Internet Consulting Pty Limited September 1998  – Present (17 years) Sydney Area, Australia FUNCTIONAL & CROSS-FUNCTIONAL AREAS \n \nMy Project Management approach integrates many facets of project management, stakeholder management & teamwork with the following functional and cross-functional areas: Business Analysis, Business Case development, Strategy, Account Mgt/Client Services, Sales, Marketing, Product Management, Brand, CRM, User Experience (UX), Usability Testing, Creative, Visual Design, Animation, Technical Solution Design, Security, Networking, Ops, Analytics, Reporting, Development, Production, Content Management, Copy Writing, SEO/SEM, QA, Testing, Vendor Management, Legal, Regulatory, Training, Finance & Procurement. \n \nPROJECT DELIVERABLES \n \nI have proficiency with the following project deliverables as needed: Project Management Plans (Scope, Time, Cost, Resource, Quality, Risk, Stakeholder, Communications, Procurement & Change Management), Project Registers (RAID), Business Cases, Proposals, SOWs, Forecasting, Cost Estimates, Project Budgets, Agile/Scrum artifacts, Business Requirements Documents (Functional/Non-Functional), Requirements Traceability Matrix, RACI, Facilitation of Scope/Req. Workshops, High Level Scope Documents, High Level Timelines, Project Schedules/Gantt Charts, Comparison Matrixes, Project Status Reports, Project Admin, Project Org Charts/Stakeholder Mapping, Risk Management, Project Meetings, Minutes, Functional Specs, High Level Solution Diagrams, Content Plans, Site Maps, Wireframes (static & dynamic), User Stories, Use Cases, Sequence Diagrams, Flow Charts, Activity Diagrams, Process Charts, Training, Product Demos, Test Plans, Test Cases & Deployment Plans. \n \nSOFTWARE \n \nSoftware platforms, systems & apps that I am au fait with include: SAP-based Proj. Mgt. Infon. Systems, Basecamp, BCC AdSystems, JIRA, GreenHopper, Rally, TFS, Yammer, Mercury Quality Centre, Project, Project Svr, Visio, Word, Excel, PowerPoint, Google Docs, Enterprise Architect, Axure, Photoshop, Dropbox, Evernote, Homesite & a variety of utilities. Digital/Agile Project Manager | ScrumMaster | IM (Contractor) Berriman Internet Consulting Pty Limited September 1998  – Present (17 years) Sydney Area, Australia FUNCTIONAL & CROSS-FUNCTIONAL AREAS \n \nMy Project Management approach integrates many facets of project management, stakeholder management & teamwork with the following functional and cross-functional areas: Business Analysis, Business Case development, Strategy, Account Mgt/Client Services, Sales, Marketing, Product Management, Brand, CRM, User Experience (UX), Usability Testing, Creative, Visual Design, Animation, Technical Solution Design, Security, Networking, Ops, Analytics, Reporting, Development, Production, Content Management, Copy Writing, SEO/SEM, QA, Testing, Vendor Management, Legal, Regulatory, Training, Finance & Procurement. \n \nPROJECT DELIVERABLES \n \nI have proficiency with the following project deliverables as needed: Project Management Plans (Scope, Time, Cost, Resource, Quality, Risk, Stakeholder, Communications, Procurement & Change Management), Project Registers (RAID), Business Cases, Proposals, SOWs, Forecasting, Cost Estimates, Project Budgets, Agile/Scrum artifacts, Business Requirements Documents (Functional/Non-Functional), Requirements Traceability Matrix, RACI, Facilitation of Scope/Req. Workshops, High Level Scope Documents, High Level Timelines, Project Schedules/Gantt Charts, Comparison Matrixes, Project Status Reports, Project Admin, Project Org Charts/Stakeholder Mapping, Risk Management, Project Meetings, Minutes, Functional Specs, High Level Solution Diagrams, Content Plans, Site Maps, Wireframes (static & dynamic), User Stories, Use Cases, Sequence Diagrams, Flow Charts, Activity Diagrams, Process Charts, Training, Product Demos, Test Plans, Test Cases & Deployment Plans. \n \nSOFTWARE \n \nSoftware platforms, systems & apps that I am au fait with include: SAP-based Proj. Mgt. Infon. Systems, Basecamp, BCC AdSystems, JIRA, GreenHopper, Rally, TFS, Yammer, Mercury Quality Centre, Project, Project Svr, Visio, Word, Excel, PowerPoint, Google Docs, Enterprise Architect, Axure, Photoshop, Dropbox, Evernote, Homesite & a variety of utilities. Project Manager The Wine Quarter - Woolworths Limited January 2015  – Present (8 months) Please see my CV at www.berriman.com.au Project Manager The Wine Quarter - Woolworths Limited January 2015  – Present (8 months) Please see my CV at www.berriman.com.au Senior Project Manager / ScrumMaster Yahoo April 2014  –  September 2014  (6 months) Yahoo!7 \nPlease see my CV at www.berriman.com.au Senior Project Manager / ScrumMaster Yahoo April 2014  –  September 2014  (6 months) Yahoo!7 \nPlease see my CV at www.berriman.com.au Senior Project Manager - Macquarie Bank projects DT January 2014  –  March 2014  (3 months) DTDigital - Ogilvy & Mather \nPlease see my CV at www.berriman.com.au Senior Project Manager - Macquarie Bank projects DT January 2014  –  March 2014  (3 months) DTDigital - Ogilvy & Mather \nPlease see my CV at www.berriman.com.au Lead Project Manager - Toyota projects HotHouse September 2013  –  November 2013  (3 months) Please see my CV at www.berriman.com.au Lead Project Manager - Toyota projects HotHouse September 2013  –  November 2013  (3 months) Please see my CV at www.berriman.com.au Senior Project Manager Woolworths Limited January 2013  –  August 2013  (8 months) Please see my CV at www.berriman.com.au Senior Project Manager Woolworths Limited January 2013  –  August 2013  (8 months) Please see my CV at www.berriman.com.au Senior Project Manager - Toyota projects HotHouse April 2012  –  December 2012  (9 months) Please see my CV at www.berriman.com.au Senior Project Manager - Toyota projects HotHouse April 2012  –  December 2012  (9 months) Please see my CV at www.berriman.com.au Business Program Manager Optus May 2011  –  April 2012  (1 year) Please see my CV at www.berriman.com.au Business Program Manager Optus May 2011  –  April 2012  (1 year) Please see my CV at www.berriman.com.au Snr Project Manager / Snr Business Analyst Inspire November 2010  –  May 2011  (7 months) Please see my CV at www.berriman.com.au Snr Project Manager / Snr Business Analyst Inspire November 2010  –  May 2011  (7 months) Please see my CV at www.berriman.com.au Project Manager / Senior Producer Optus August 2009  –  October 2010  (1 year 3 months) Please see my CV at www.berriman.com.au Project Manager / Senior Producer Optus August 2009  –  October 2010  (1 year 3 months) Please see my CV at www.berriman.com.au Project Manager - Telstra projects C4 Communication 2009  –  2009  (less than a year) Please see my CV at www.berriman.com.au Project Manager - Telstra projects C4 Communication 2009  –  2009  (less than a year) Please see my CV at www.berriman.com.au Project Manager Telstra 2008  –  2008  (less than a year) Please see my CV at www.berriman.com.au Project Manager Telstra 2008  –  2008  (less than a year) Please see my CV at www.berriman.com.au Project Manager / Business Analyst Sensis 2006  –  2008  (2 years) Please see my CV at www.berriman.com.au Project Manager / Business Analyst Sensis 2006  –  2008  (2 years) Please see my CV at www.berriman.com.au Project Manager - Defence projects Visual Jazz 2007  –  2007  (less than a year) Please see my CV at www.berriman.com.au Project Manager - Defence projects Visual Jazz 2007  –  2007  (less than a year) Please see my CV at www.berriman.com.au Account Manager / Project Manager - Telstra projects Ingena 2005  –  2006  (1 year) Please see my CV at www.berriman.com.au Account Manager / Project Manager - Telstra projects Ingena 2005  –  2006  (1 year) Please see my CV at www.berriman.com.au Technical Project Manager eCorner (ePages GmbH) 2003  –  2005  (2 years) Please see my CV at www.berriman.com.au Technical Project Manager eCorner (ePages GmbH) 2003  –  2005  (2 years) Please see my CV at www.berriman.com.au Product Development Manager Optus 2000  –  2003  (3 years) Please see my CV at www.berriman.com.au Product Development Manager Optus 2000  –  2003  (3 years) Please see my CV at www.berriman.com.au Senior Producer Microsoft 1989  –  1999  (10 years) Please see my CV at www.berriman.com.au Senior Producer Microsoft 1989  –  1999  (10 years) Please see my CV at www.berriman.com.au Skills Project Management Project Delivery Requirements Analysis Stakeholder Management Web Services Software Development... Business Analysis Skills  Project Management Project Delivery Requirements Analysis Stakeholder Management Web Services Software Development... Business Analysis Project Management Project Delivery Requirements Analysis Stakeholder Management Web Services Software Development... Business Analysis Project Management Project Delivery Requirements Analysis Stakeholder Management Web Services Software Development... Business Analysis Education Mosman High School Higher School Certificate University of Technology, Sydney Bachelor of Business,  Double Major in Marketing & Management Mosman High School Higher School Certificate Mosman High School Higher School Certificate Mosman High School Higher School Certificate University of Technology, Sydney Bachelor of Business,  Double Major in Marketing & Management University of Technology, Sydney Bachelor of Business,  Double Major in Marketing & Management University of Technology, Sydney Bachelor of Business,  Double Major in Marketing & Management ", "Skills Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Skills  Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less ", "Skills Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less Skills  Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less ", "Summary [サマリ] \n●合計15年のウェブマーケティング経験（１９９９年１２月から） \n●カタログ通販事業者での管理会計経験約5年、マーケティング業務経験約1年、ウェブマーケティング、イーコマース業務経験約6年 \n●ヤフーでのウェブマーケティング経験８年目 \n●管理会計的観点と広告出稿主観点、広告媒体主的視点、イーコマース、通信販売事業者の観点を同時に備えている \n→　カタログ通販通販会社の管理会計、広告宣伝業務、マーケティング業務経験 \n→　新客獲得、顧客育成、ロイヤルカスタマー化のシナリオの実務の理解、管理会計的観点からの理解をベースとしている \n→　1999年のイーコマース事業参入からサイト構築ディレクション、ユーザビリティテスト、顧客データーベースの活用、メルマガ配信、コピーライティングなど基本的なインターネット広告業務の経験を持つ \n→　直近のヤフーショッピングでのインターネット広告業務経験からアドネットワークやリターゲ×レコメンド広告など費用対効果の良いインターネット広告への出稿実績が豊富 \n \n→　ヤフーでの広告出稿主業務と広告媒体主業務を同時に経験したことでの双方の視点を備える \n \n［直近詳細］ \n●ヤフーショッピング外部有料集客チーム統括（2014年9月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース））、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングeコマース革命に貢献した \n \n●イーコマース業界、インターネット広告業界に精通 \n●大規模広告費用予算を計画数値に対して高い精度で運用する体制を代理店とともに構築 \n \n \n●事業へのへの貢献を優先する \n●費用対効果と取扱高インパクトに対する追及 \n●部下の教育育成に対する視点を常時持つ \n \n \n \n[直近詳細] \n●ヤフーショッピング外部有料集客チームチーム統括（２０１４年９月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース）、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングイーコマース革命に貢献 \n \n \n \n■人物面 \n・新しい技術への関心と、ネット業界の動向に注意深い \n・プロジェクトを成功に繋ぐまでの努力を怠らない性格を持つ \n・チーム全体への配慮と個性に合わせた個別対応が得意 \n \n \n \nTeam Leader of Online Marketing Plannning & Controll at  \nYahoo! E-commerce (Shopping and Auction) \n \n:Affiliate Marketing,  \n:E-mail Marketing , \n:SEM(Paid listing, SEO), :Retargetting Banner AD(Criteo) \n:Tag management \n:Display ad /Adnetwork/RTB \n \n \n★集客責任者 \nヤフー！ショッピング \n \n★Listing広告出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★Affiliate出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★リターゲ広告統括:(クリテオ&サイジニア) \nヤフー！ショッピング、ヤフー！オークション \n \n★タグマネジメント(ブライトタグ、エコタグ) \nヤフー！ショッピング、ヤフー！オークション Summary [サマリ] \n●合計15年のウェブマーケティング経験（１９９９年１２月から） \n●カタログ通販事業者での管理会計経験約5年、マーケティング業務経験約1年、ウェブマーケティング、イーコマース業務経験約6年 \n●ヤフーでのウェブマーケティング経験８年目 \n●管理会計的観点と広告出稿主観点、広告媒体主的視点、イーコマース、通信販売事業者の観点を同時に備えている \n→　カタログ通販通販会社の管理会計、広告宣伝業務、マーケティング業務経験 \n→　新客獲得、顧客育成、ロイヤルカスタマー化のシナリオの実務の理解、管理会計的観点からの理解をベースとしている \n→　1999年のイーコマース事業参入からサイト構築ディレクション、ユーザビリティテスト、顧客データーベースの活用、メルマガ配信、コピーライティングなど基本的なインターネット広告業務の経験を持つ \n→　直近のヤフーショッピングでのインターネット広告業務経験からアドネットワークやリターゲ×レコメンド広告など費用対効果の良いインターネット広告への出稿実績が豊富 \n \n→　ヤフーでの広告出稿主業務と広告媒体主業務を同時に経験したことでの双方の視点を備える \n \n［直近詳細］ \n●ヤフーショッピング外部有料集客チーム統括（2014年9月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース））、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングeコマース革命に貢献した \n \n●イーコマース業界、インターネット広告業界に精通 \n●大規模広告費用予算を計画数値に対して高い精度で運用する体制を代理店とともに構築 \n \n \n●事業へのへの貢献を優先する \n●費用対効果と取扱高インパクトに対する追及 \n●部下の教育育成に対する視点を常時持つ \n \n \n \n[直近詳細] \n●ヤフーショッピング外部有料集客チームチーム統括（２０１４年９月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース）、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングイーコマース革命に貢献 \n \n \n \n■人物面 \n・新しい技術への関心と、ネット業界の動向に注意深い \n・プロジェクトを成功に繋ぐまでの努力を怠らない性格を持つ \n・チーム全体への配慮と個性に合わせた個別対応が得意 \n \n \n \nTeam Leader of Online Marketing Plannning & Controll at  \nYahoo! E-commerce (Shopping and Auction) \n \n:Affiliate Marketing,  \n:E-mail Marketing , \n:SEM(Paid listing, SEO), :Retargetting Banner AD(Criteo) \n:Tag management \n:Display ad /Adnetwork/RTB \n \n \n★集客責任者 \nヤフー！ショッピング \n \n★Listing広告出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★Affiliate出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★リターゲ広告統括:(クリテオ&サイジニア) \nヤフー！ショッピング、ヤフー！オークション \n \n★タグマネジメント(ブライトタグ、エコタグ) \nヤフー！ショッピング、ヤフー！オークション [サマリ] \n●合計15年のウェブマーケティング経験（１９９９年１２月から） \n●カタログ通販事業者での管理会計経験約5年、マーケティング業務経験約1年、ウェブマーケティング、イーコマース業務経験約6年 \n●ヤフーでのウェブマーケティング経験８年目 \n●管理会計的観点と広告出稿主観点、広告媒体主的視点、イーコマース、通信販売事業者の観点を同時に備えている \n→　カタログ通販通販会社の管理会計、広告宣伝業務、マーケティング業務経験 \n→　新客獲得、顧客育成、ロイヤルカスタマー化のシナリオの実務の理解、管理会計的観点からの理解をベースとしている \n→　1999年のイーコマース事業参入からサイト構築ディレクション、ユーザビリティテスト、顧客データーベースの活用、メルマガ配信、コピーライティングなど基本的なインターネット広告業務の経験を持つ \n→　直近のヤフーショッピングでのインターネット広告業務経験からアドネットワークやリターゲ×レコメンド広告など費用対効果の良いインターネット広告への出稿実績が豊富 \n \n→　ヤフーでの広告出稿主業務と広告媒体主業務を同時に経験したことでの双方の視点を備える \n \n［直近詳細］ \n●ヤフーショッピング外部有料集客チーム統括（2014年9月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース））、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングeコマース革命に貢献した \n \n●イーコマース業界、インターネット広告業界に精通 \n●大規模広告費用予算を計画数値に対して高い精度で運用する体制を代理店とともに構築 \n \n \n●事業へのへの貢献を優先する \n●費用対効果と取扱高インパクトに対する追及 \n●部下の教育育成に対する視点を常時持つ \n \n \n \n[直近詳細] \n●ヤフーショッピング外部有料集客チームチーム統括（２０１４年９月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース）、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングイーコマース革命に貢献 \n \n \n \n■人物面 \n・新しい技術への関心と、ネット業界の動向に注意深い \n・プロジェクトを成功に繋ぐまでの努力を怠らない性格を持つ \n・チーム全体への配慮と個性に合わせた個別対応が得意 \n \n \n \nTeam Leader of Online Marketing Plannning & Controll at  \nYahoo! E-commerce (Shopping and Auction) \n \n:Affiliate Marketing,  \n:E-mail Marketing , \n:SEM(Paid listing, SEO), :Retargetting Banner AD(Criteo) \n:Tag management \n:Display ad /Adnetwork/RTB \n \n \n★集客責任者 \nヤフー！ショッピング \n \n★Listing広告出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★Affiliate出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★リターゲ広告統括:(クリテオ&サイジニア) \nヤフー！ショッピング、ヤフー！オークション \n \n★タグマネジメント(ブライトタグ、エコタグ) \nヤフー！ショッピング、ヤフー！オークション [サマリ] \n●合計15年のウェブマーケティング経験（１９９９年１２月から） \n●カタログ通販事業者での管理会計経験約5年、マーケティング業務経験約1年、ウェブマーケティング、イーコマース業務経験約6年 \n●ヤフーでのウェブマーケティング経験８年目 \n●管理会計的観点と広告出稿主観点、広告媒体主的視点、イーコマース、通信販売事業者の観点を同時に備えている \n→　カタログ通販通販会社の管理会計、広告宣伝業務、マーケティング業務経験 \n→　新客獲得、顧客育成、ロイヤルカスタマー化のシナリオの実務の理解、管理会計的観点からの理解をベースとしている \n→　1999年のイーコマース事業参入からサイト構築ディレクション、ユーザビリティテスト、顧客データーベースの活用、メルマガ配信、コピーライティングなど基本的なインターネット広告業務の経験を持つ \n→　直近のヤフーショッピングでのインターネット広告業務経験からアドネットワークやリターゲ×レコメンド広告など費用対効果の良いインターネット広告への出稿実績が豊富 \n \n→　ヤフーでの広告出稿主業務と広告媒体主業務を同時に経験したことでの双方の視点を備える \n \n［直近詳細］ \n●ヤフーショッピング外部有料集客チーム統括（2014年9月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース））、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングeコマース革命に貢献した \n \n●イーコマース業界、インターネット広告業界に精通 \n●大規模広告費用予算を計画数値に対して高い精度で運用する体制を代理店とともに構築 \n \n \n●事業へのへの貢献を優先する \n●費用対効果と取扱高インパクトに対する追及 \n●部下の教育育成に対する視点を常時持つ \n \n \n \n[直近詳細] \n●ヤフーショッピング外部有料集客チームチーム統括（２０１４年９月末） \n●インターネット広告全般（スポンサードサーチ、アドワーズ 、PLA、クリテオ、デクワス、GDR、 アフィリエイト（バリューコマース）、アクセス解析（サイトカタリスト）、代理店コントロール、代理店開発、代理店コンペ、社内での予算獲得交渉、稟議起案、施策コントロール \n●総計年間数十億円規模の広告出稿コントロールを高い精度で実施しヤフーショッピングイーコマース革命に貢献 \n \n \n \n■人物面 \n・新しい技術への関心と、ネット業界の動向に注意深い \n・プロジェクトを成功に繋ぐまでの努力を怠らない性格を持つ \n・チーム全体への配慮と個性に合わせた個別対応が得意 \n \n \n \nTeam Leader of Online Marketing Plannning & Controll at  \nYahoo! E-commerce (Shopping and Auction) \n \n:Affiliate Marketing,  \n:E-mail Marketing , \n:SEM(Paid listing, SEO), :Retargetting Banner AD(Criteo) \n:Tag management \n:Display ad /Adnetwork/RTB \n \n \n★集客責任者 \nヤフー！ショッピング \n \n★Listing広告出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★Affiliate出稿統括 \nヤフー！ショッピング、ヤフー！オークション \n \n★リターゲ広告統括:(クリテオ&サイジニア) \nヤフー！ショッピング、ヤフー！オークション \n \n★タグマネジメント(ブライトタグ、エコタグ) \nヤフー！ショッピング、ヤフー！オークション Experience Project Manager & Team Reader Yahoo! JAPAN April 2013  – Present (2 years 5 months) Tokyo Online Marketing Project Manager Yahoo! JAPAN January 2013  –  February 2013  (2 months) Member service-div, New customer Acqisition Manager team leader Yahoo! Japan December 2007  –  December 2012  (5 years 1 month) Online Marketing Director/Manager at Yahoo! Shopping Marketing Manager G plan February 2006  –  April 2007  (1 year 3 months) Online Marketing & New Customer Acquisition Director MANAGER OTTO April 1994  –  January 2006  (11 years 10 months) E-commerce Director / Manager \nOnline Marketing Director / Manager Project Manager & Team Reader Yahoo! JAPAN April 2013  – Present (2 years 5 months) Tokyo Online Marketing Project Manager & Team Reader Yahoo! JAPAN April 2013  – Present (2 years 5 months) Tokyo Online Marketing Project Manager Yahoo! JAPAN January 2013  –  February 2013  (2 months) Member service-div, New customer Acqisition Manager Project Manager Yahoo! JAPAN January 2013  –  February 2013  (2 months) Member service-div, New customer Acqisition Manager team leader Yahoo! Japan December 2007  –  December 2012  (5 years 1 month) Online Marketing Director/Manager at Yahoo! Shopping team leader Yahoo! Japan December 2007  –  December 2012  (5 years 1 month) Online Marketing Director/Manager at Yahoo! Shopping Marketing Manager G plan February 2006  –  April 2007  (1 year 3 months) Online Marketing & New Customer Acquisition Director Marketing Manager G plan February 2006  –  April 2007  (1 year 3 months) Online Marketing & New Customer Acquisition Director MANAGER OTTO April 1994  –  January 2006  (11 years 10 months) E-commerce Director / Manager \nOnline Marketing Director / Manager MANAGER OTTO April 1994  –  January 2006  (11 years 10 months) E-commerce Director / Manager \nOnline Marketing Director / Manager Languages ENGLISH 日本語 Native or bilingual proficiency ENGLISH 日本語 Native or bilingual proficiency ENGLISH 日本語 Native or bilingual proficiency Native or bilingual proficiency Skills E-commerce Web Analytics PPC Analytics Online Marketing SEM Affiliate Marketing Mobile Commerce Google Adwords Mobile Email Marketing Affiliate Management Conversion Optimization Customer Acquisition Online Advertising Advertising Management Marketing Start-ups See 4+     See less Skills  E-commerce Web Analytics PPC Analytics Online Marketing SEM Affiliate Marketing Mobile Commerce Google Adwords Mobile Email Marketing Affiliate Management Conversion Optimization Customer Acquisition Online Advertising Advertising Management Marketing Start-ups See 4+     See less E-commerce Web Analytics PPC Analytics Online Marketing SEM Affiliate Marketing Mobile Commerce Google Adwords Mobile Email Marketing Affiliate Management Conversion Optimization Customer Acquisition Online Advertising Advertising Management Marketing Start-ups See 4+     See less E-commerce Web Analytics PPC Analytics Online Marketing SEM Affiliate Marketing Mobile Commerce Google Adwords Mobile Email Marketing Affiliate Management Conversion Optimization Customer Acquisition Online Advertising Advertising Management Marketing Start-ups See 4+     See less ", "Languages   Skills Account Management Sales Insurance Marketing Social Media Entrepreneurship Marketing Strategy New Business Development Lead Generation Email Marketing CRM Salesforce.com Sales Management Project Management Business Development Online Advertising Customer Service See 2+     See less Skills  Account Management Sales Insurance Marketing Social Media Entrepreneurship Marketing Strategy New Business Development Lead Generation Email Marketing CRM Salesforce.com Sales Management Project Management Business Development Online Advertising Customer Service See 2+     See less Account Management Sales Insurance Marketing Social Media Entrepreneurship Marketing Strategy New Business Development Lead Generation Email Marketing CRM Salesforce.com Sales Management Project Management Business Development Online Advertising Customer Service See 2+     See less Account Management Sales Insurance Marketing Social Media Entrepreneurship Marketing Strategy New Business Development Lead Generation Email Marketing CRM Salesforce.com Sales Management Project Management Business Development Online Advertising Customer Service See 2+     See less Honors & Awards ", "Experience Senior Manager / Senior Project Manager, Display Operations Council Yahoo!, Inc. August 2013  – Present (2 years 1 month) Sunnyvale, CA Senior Execution Project Manager, Display Account Management Operations Yahoo March 2012  –  July 2013  (1 year 5 months) Sunnyvale, CA Senior Strategic Project Manager, Display Account Management Operations Yahoo January 2010  –  February 2012  (2 years 2 months) Sunnyvale, CA Account Manager, Display Account Management Yahoo January 2006  –  December 2009  (4 years) Sunnyvale, CA Sales Planner, Yahoo! Client Services Yahoo January 2004  –  December 2005  (2 years) Sunnyvale, CA Media Delivery Specialist, Yahoo! Client Services Yahoo December 2002  –  December 2003  (1 year 1 month) Sunnyvale, CA Advertising Account Representative, Yahoo! Client Services Yahoo June 2000  –  November 2002  (2 years 6 months) Sunnyvale, CA Senior Manager / Senior Project Manager, Display Operations Council Yahoo!, Inc. August 2013  – Present (2 years 1 month) Sunnyvale, CA Senior Manager / Senior Project Manager, Display Operations Council Yahoo!, Inc. August 2013  – Present (2 years 1 month) Sunnyvale, CA Senior Execution Project Manager, Display Account Management Operations Yahoo March 2012  –  July 2013  (1 year 5 months) Sunnyvale, CA Senior Execution Project Manager, Display Account Management Operations Yahoo March 2012  –  July 2013  (1 year 5 months) Sunnyvale, CA Senior Strategic Project Manager, Display Account Management Operations Yahoo January 2010  –  February 2012  (2 years 2 months) Sunnyvale, CA Senior Strategic Project Manager, Display Account Management Operations Yahoo January 2010  –  February 2012  (2 years 2 months) Sunnyvale, CA Account Manager, Display Account Management Yahoo January 2006  –  December 2009  (4 years) Sunnyvale, CA Account Manager, Display Account Management Yahoo January 2006  –  December 2009  (4 years) Sunnyvale, CA Sales Planner, Yahoo! Client Services Yahoo January 2004  –  December 2005  (2 years) Sunnyvale, CA Sales Planner, Yahoo! Client Services Yahoo January 2004  –  December 2005  (2 years) Sunnyvale, CA Media Delivery Specialist, Yahoo! Client Services Yahoo December 2002  –  December 2003  (1 year 1 month) Sunnyvale, CA Media Delivery Specialist, Yahoo! Client Services Yahoo December 2002  –  December 2003  (1 year 1 month) Sunnyvale, CA Advertising Account Representative, Yahoo! Client Services Yahoo June 2000  –  November 2002  (2 years 6 months) Sunnyvale, CA Advertising Account Representative, Yahoo! Client Services Yahoo June 2000  –  November 2002  (2 years 6 months) Sunnyvale, CA Education California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 Saint Mary's College of California 1996  – 1997 California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 Saint Mary's College of California 1996  – 1997 Saint Mary's College of California 1996  – 1997 Saint Mary's College of California 1996  – 1997 ", "Experience Senior Project Manager, Display Account Management Operations Yahoo! January 2011  – Present (4 years 8 months) Senior Project Manager, Account Management Operations Yahoo! November 2008  –  January 2011  (2 years 3 months) Manager, Creative Management Yahoo January 2008  –  November 2008  (11 months) Research Manager Getty Images June 2005  –  December 2007  (2 years 7 months) Chicago, Il •\tOversaw a team of 10 photo researchers in the delivery of creative services to end clients  \n•\tResponsible for promoting a team environment while coaching individuals to maximize their full potential \n•\tManaged large projects for key clients including major ad campaigns that required fast turn around times; corporate library builds that required understanding the client’s vision and brand; and book publishing requests for multiple books that required organization and excellent time management  \n•\tCollaborated with departments outside of sales to help achieve company goals, such as providing content & trend insight to creative research, feedback and suggestions on Getty’s Web site to technology, contributions to marketing materials, as well as involvement with search strategy & search innovation teams \n•\tWorked closely with all levels of the sales organizations, both regionally and globally, to help drive revenue  \n•\tTrained new employees on research offering and systems \n•\tImplemented new client service standards to be able to quantify the value of research in terms of revenue and ensure that our services are prioritized relative to revenue opportunities. \n•\tDevised career paths for researchers, including creation of a creative liaison role \n•\tWork closely with sales to help drive revenue.  \n Photo Researcher Getty Images February 2001  –  June 2005  (4 years 5 months) Chicago, Il •\tProvided consultative image research to customers  \n•\tConsistently top performer leading the team in number of requests and key accounts \n•\tBuilt relationships with a base of assigned accounts, including Apple, DDB Chicago and Harcourt Publishing \n•\tCreated and implemented workflow/training for creative teams around supporting editorial business \n•\tTraveled to clients to conduct Web site demonstrations on content and company offerings.  \n•\tServed as a creative liaison between customers, sales and Getty Images creative teams  \n•\tEmployee of the quarter Q4 2001  Senior Project Manager, Display Account Management Operations Yahoo! January 2011  – Present (4 years 8 months) Senior Project Manager, Display Account Management Operations Yahoo! January 2011  – Present (4 years 8 months) Senior Project Manager, Account Management Operations Yahoo! November 2008  –  January 2011  (2 years 3 months) Senior Project Manager, Account Management Operations Yahoo! November 2008  –  January 2011  (2 years 3 months) Manager, Creative Management Yahoo January 2008  –  November 2008  (11 months) Manager, Creative Management Yahoo January 2008  –  November 2008  (11 months) Research Manager Getty Images June 2005  –  December 2007  (2 years 7 months) Chicago, Il •\tOversaw a team of 10 photo researchers in the delivery of creative services to end clients  \n•\tResponsible for promoting a team environment while coaching individuals to maximize their full potential \n•\tManaged large projects for key clients including major ad campaigns that required fast turn around times; corporate library builds that required understanding the client’s vision and brand; and book publishing requests for multiple books that required organization and excellent time management  \n•\tCollaborated with departments outside of sales to help achieve company goals, such as providing content & trend insight to creative research, feedback and suggestions on Getty’s Web site to technology, contributions to marketing materials, as well as involvement with search strategy & search innovation teams \n•\tWorked closely with all levels of the sales organizations, both regionally and globally, to help drive revenue  \n•\tTrained new employees on research offering and systems \n•\tImplemented new client service standards to be able to quantify the value of research in terms of revenue and ensure that our services are prioritized relative to revenue opportunities. \n•\tDevised career paths for researchers, including creation of a creative liaison role \n•\tWork closely with sales to help drive revenue.  \n Research Manager Getty Images June 2005  –  December 2007  (2 years 7 months) Chicago, Il •\tOversaw a team of 10 photo researchers in the delivery of creative services to end clients  \n•\tResponsible for promoting a team environment while coaching individuals to maximize their full potential \n•\tManaged large projects for key clients including major ad campaigns that required fast turn around times; corporate library builds that required understanding the client’s vision and brand; and book publishing requests for multiple books that required organization and excellent time management  \n•\tCollaborated with departments outside of sales to help achieve company goals, such as providing content & trend insight to creative research, feedback and suggestions on Getty’s Web site to technology, contributions to marketing materials, as well as involvement with search strategy & search innovation teams \n•\tWorked closely with all levels of the sales organizations, both regionally and globally, to help drive revenue  \n•\tTrained new employees on research offering and systems \n•\tImplemented new client service standards to be able to quantify the value of research in terms of revenue and ensure that our services are prioritized relative to revenue opportunities. \n•\tDevised career paths for researchers, including creation of a creative liaison role \n•\tWork closely with sales to help drive revenue.  \n Photo Researcher Getty Images February 2001  –  June 2005  (4 years 5 months) Chicago, Il •\tProvided consultative image research to customers  \n•\tConsistently top performer leading the team in number of requests and key accounts \n•\tBuilt relationships with a base of assigned accounts, including Apple, DDB Chicago and Harcourt Publishing \n•\tCreated and implemented workflow/training for creative teams around supporting editorial business \n•\tTraveled to clients to conduct Web site demonstrations on content and company offerings.  \n•\tServed as a creative liaison between customers, sales and Getty Images creative teams  \n•\tEmployee of the quarter Q4 2001  Photo Researcher Getty Images February 2001  –  June 2005  (4 years 5 months) Chicago, Il •\tProvided consultative image research to customers  \n•\tConsistently top performer leading the team in number of requests and key accounts \n•\tBuilt relationships with a base of assigned accounts, including Apple, DDB Chicago and Harcourt Publishing \n•\tCreated and implemented workflow/training for creative teams around supporting editorial business \n•\tTraveled to clients to conduct Web site demonstrations on content and company offerings.  \n•\tServed as a creative liaison between customers, sales and Getty Images creative teams  \n•\tEmployee of the quarter Q4 2001  Skills Digital Media Photography Display Advertising Advertising Digital Marketing Project Management Sales Operations Skills  Digital Media Photography Display Advertising Advertising Digital Marketing Project Management Sales Operations Digital Media Photography Display Advertising Advertising Digital Marketing Project Management Sales Operations Digital Media Photography Display Advertising Advertising Digital Marketing Project Management Sales Operations Education Columbia College Chicago Bachelor of Arts (B.A.),  Photography 1996  – 2000 Columbia College Chicago Bachelor of Arts (B.A.),  Photography 1996  – 2000 Columbia College Chicago Bachelor of Arts (B.A.),  Photography 1996  – 2000 Columbia College Chicago Bachelor of Arts (B.A.),  Photography 1996  – 2000 ", "Summary Rye is currently Sr. Associate Interactive Project Manager at Sapient Nitro. \n \n \nAs a leader with a proven track record of creating value add initiatives that positively contribute to organizational growth. Possess strong business development and communication skills that provide successful leadership in a rapidly changing environment: \n \n* 16 years of management and leadership experience within an advertising agency environment, working with suppliers and internal teams. \n* Over 7 years of Interactive project management experience, directed and launched \nweb-production online campaigns. Budget range $1000 - $100,000 CDN \n* Over 9 years of print project management advertising experience working with Fortune 500 companies. \n* Orchestrated a fundraising event for the Canadian Cancer Society (June’s Gala 2008), raising over $25,000 net. Produced, managed and art directed the event and website. \n* Volunteer Grief Counselor for Bereaved Families of Ontario Summary Rye is currently Sr. Associate Interactive Project Manager at Sapient Nitro. \n \n \nAs a leader with a proven track record of creating value add initiatives that positively contribute to organizational growth. Possess strong business development and communication skills that provide successful leadership in a rapidly changing environment: \n \n* 16 years of management and leadership experience within an advertising agency environment, working with suppliers and internal teams. \n* Over 7 years of Interactive project management experience, directed and launched \nweb-production online campaigns. Budget range $1000 - $100,000 CDN \n* Over 9 years of print project management advertising experience working with Fortune 500 companies. \n* Orchestrated a fundraising event for the Canadian Cancer Society (June’s Gala 2008), raising over $25,000 net. Produced, managed and art directed the event and website. \n* Volunteer Grief Counselor for Bereaved Families of Ontario Rye is currently Sr. Associate Interactive Project Manager at Sapient Nitro. \n \n \nAs a leader with a proven track record of creating value add initiatives that positively contribute to organizational growth. Possess strong business development and communication skills that provide successful leadership in a rapidly changing environment: \n \n* 16 years of management and leadership experience within an advertising agency environment, working with suppliers and internal teams. \n* Over 7 years of Interactive project management experience, directed and launched \nweb-production online campaigns. Budget range $1000 - $100,000 CDN \n* Over 9 years of print project management advertising experience working with Fortune 500 companies. \n* Orchestrated a fundraising event for the Canadian Cancer Society (June’s Gala 2008), raising over $25,000 net. Produced, managed and art directed the event and website. \n* Volunteer Grief Counselor for Bereaved Families of Ontario Rye is currently Sr. Associate Interactive Project Manager at Sapient Nitro. \n \n \nAs a leader with a proven track record of creating value add initiatives that positively contribute to organizational growth. Possess strong business development and communication skills that provide successful leadership in a rapidly changing environment: \n \n* 16 years of management and leadership experience within an advertising agency environment, working with suppliers and internal teams. \n* Over 7 years of Interactive project management experience, directed and launched \nweb-production online campaigns. Budget range $1000 - $100,000 CDN \n* Over 9 years of print project management advertising experience working with Fortune 500 companies. \n* Orchestrated a fundraising event for the Canadian Cancer Society (June’s Gala 2008), raising over $25,000 net. Produced, managed and art directed the event and website. \n* Volunteer Grief Counselor for Bereaved Families of Ontario Experience Sr. Associate Interactive Project Manager - Contract SapientNitro December 2014  – Present (9 months) Toronto, Canada Area Sr. Associate Interactive Project Manager Freelance Senior Print/Digital Project Manager asurorye (at) yahoo.ca November 2014  – Present (10 months) Creative Services Director Devon Island Group January 2014  –  December 2014  (1 year) Senior Digital Producer - Contract Grey Canada September 2013  –  January 2014  (5 months) toronto, canada area Sr. Interactive & Print Project Manager - Contract Squareknot Agency February 2013  –  September 2013  (8 months) toronto, canada area Project managed the e-production of online campaigns \nProject managed and deployment of email campaigns \nClients included AMEX, Airmiles, Shell \nAssisted Account Manager and Senior Project Manager with administration and production duties Creative Studio Manager Momentum Digital Solutions November 2011  –  October 2012  (1 year) Thornhill, ON, Canada *\tStudio Manager for the e-production of online campaigns, web site design and online  \nexperience. Clients included Chrysler Canada, Jeep, RAM, Fiat, American Express,  \nMazda, Insurance Hunter. \n*\tSupervised creative resources team and freelancers \n*\tAssisted Account Manager and Senior Project Manager with administration and  \nproduction duties \n*\tOrganized schedules, resource allocation, budget control and time sheet administration \n*\tPerformed all HR duties with creative team: employee reviews and \nhiring recommendations Interactive Project Manager OSL Marketing Communications September 2009  –  October 2011  (2 years 2 months) •\tProject managed the e-production of online campaigns \n•\tProject managed and deployment of email campaigns \nClients included Egg.ca, GE Monogram, AIM health, Purity Life, Herbon \n•\tAssisted Account Manager and Senior Project Manager with administration and production duties Interactive Project Manager - Contract DraftFCB March 2007  –  June 2007  (4 months) Assisted in organizing schedules, resource allocation, budget control and time sheet administration for Motorola, Pollution Probe, and Eli Lilly online campaigns. Preformed QA control. Created SOW, and Contact Reports. Assisted Account Manager and Senior Project Manager with administration duties. Pollution Probe project managed one Developer, one Graphic Designer and client. Coordinated with freelancers in Windsor and Vancouver.  \nhttp://www.pollutionprobe.org/2007CAC/ \nSoftware knowledge: MS Project, MS Office,  \nPhotoshop CS, Illustrator CS, Indesign CS Print Studio Project Manager DraftFCB January 2001  –  March 2007  (6 years 3 months) Six years experience of directing and coordinating the activities for a staff of twelve. Over six year period supervised one to two Proofreaders, ten Mac Designers, one Mock-up Artist, one Digital Retoucher, three Junior Mac Interns, and one Junior Project Manager. Managed project work flow for all clients on a day to day and hour to hour basis. Maintained staff efficiency by allocating and relocating resource and project work flow. Performed project manager duties i.e. job and cost-tracking, estimates, employee reviews and interviews. Assisted in final proofing. Assisted as a Mac designer. Assistant to the Director of Studio Operations. Project managed the production of printed material for clients such as, Coke, TD Canada Trust, Ontario Tourism, Kraft, and Coors Light.  \nBudget range $1000 CDN - $100,000 CDN Production Director/Senior Partner Creation House Inc. January 1998  –  November 2000  (2 years 11 months) Created studio specializing in trade show design. Designed and produced graphics for leading companies such as Piller's, Indian Motorcycle, Suzuki, High Liner and Titleist. Project managed the production and design of booths for large trade shows i.e. Food and Beverage Show. Supervised freelance production teams up to twelve members, Stage painters, carpenters, industrial designers and artists. Performed administrative duties, including accounting and sourcing of labour and supplies. \nBudget range $500 CDN - $85,000 CDN \nRecipient of Mississauga’s Young Entrepreneur of the Year Award 1999 \n \nhttp://www.canadaone.com/ezine/may00/tradeshows.html Sr. Associate Interactive Project Manager - Contract SapientNitro December 2014  – Present (9 months) Toronto, Canada Area Sr. Associate Interactive Project Manager Sr. Associate Interactive Project Manager - Contract SapientNitro December 2014  – Present (9 months) Toronto, Canada Area Sr. Associate Interactive Project Manager Freelance Senior Print/Digital Project Manager asurorye (at) yahoo.ca November 2014  – Present (10 months) Freelance Senior Print/Digital Project Manager asurorye (at) yahoo.ca November 2014  – Present (10 months) Creative Services Director Devon Island Group January 2014  –  December 2014  (1 year) Creative Services Director Devon Island Group January 2014  –  December 2014  (1 year) Senior Digital Producer - Contract Grey Canada September 2013  –  January 2014  (5 months) toronto, canada area Senior Digital Producer - Contract Grey Canada September 2013  –  January 2014  (5 months) toronto, canada area Sr. Interactive & Print Project Manager - Contract Squareknot Agency February 2013  –  September 2013  (8 months) toronto, canada area Project managed the e-production of online campaigns \nProject managed and deployment of email campaigns \nClients included AMEX, Airmiles, Shell \nAssisted Account Manager and Senior Project Manager with administration and production duties Sr. Interactive & Print Project Manager - Contract Squareknot Agency February 2013  –  September 2013  (8 months) toronto, canada area Project managed the e-production of online campaigns \nProject managed and deployment of email campaigns \nClients included AMEX, Airmiles, Shell \nAssisted Account Manager and Senior Project Manager with administration and production duties Creative Studio Manager Momentum Digital Solutions November 2011  –  October 2012  (1 year) Thornhill, ON, Canada *\tStudio Manager for the e-production of online campaigns, web site design and online  \nexperience. Clients included Chrysler Canada, Jeep, RAM, Fiat, American Express,  \nMazda, Insurance Hunter. \n*\tSupervised creative resources team and freelancers \n*\tAssisted Account Manager and Senior Project Manager with administration and  \nproduction duties \n*\tOrganized schedules, resource allocation, budget control and time sheet administration \n*\tPerformed all HR duties with creative team: employee reviews and \nhiring recommendations Creative Studio Manager Momentum Digital Solutions November 2011  –  October 2012  (1 year) Thornhill, ON, Canada *\tStudio Manager for the e-production of online campaigns, web site design and online  \nexperience. Clients included Chrysler Canada, Jeep, RAM, Fiat, American Express,  \nMazda, Insurance Hunter. \n*\tSupervised creative resources team and freelancers \n*\tAssisted Account Manager and Senior Project Manager with administration and  \nproduction duties \n*\tOrganized schedules, resource allocation, budget control and time sheet administration \n*\tPerformed all HR duties with creative team: employee reviews and \nhiring recommendations Interactive Project Manager OSL Marketing Communications September 2009  –  October 2011  (2 years 2 months) •\tProject managed the e-production of online campaigns \n•\tProject managed and deployment of email campaigns \nClients included Egg.ca, GE Monogram, AIM health, Purity Life, Herbon \n•\tAssisted Account Manager and Senior Project Manager with administration and production duties Interactive Project Manager OSL Marketing Communications September 2009  –  October 2011  (2 years 2 months) •\tProject managed the e-production of online campaigns \n•\tProject managed and deployment of email campaigns \nClients included Egg.ca, GE Monogram, AIM health, Purity Life, Herbon \n•\tAssisted Account Manager and Senior Project Manager with administration and production duties Interactive Project Manager - Contract DraftFCB March 2007  –  June 2007  (4 months) Assisted in organizing schedules, resource allocation, budget control and time sheet administration for Motorola, Pollution Probe, and Eli Lilly online campaigns. Preformed QA control. Created SOW, and Contact Reports. Assisted Account Manager and Senior Project Manager with administration duties. Pollution Probe project managed one Developer, one Graphic Designer and client. Coordinated with freelancers in Windsor and Vancouver.  \nhttp://www.pollutionprobe.org/2007CAC/ \nSoftware knowledge: MS Project, MS Office,  \nPhotoshop CS, Illustrator CS, Indesign CS Interactive Project Manager - Contract DraftFCB March 2007  –  June 2007  (4 months) Assisted in organizing schedules, resource allocation, budget control and time sheet administration for Motorola, Pollution Probe, and Eli Lilly online campaigns. Preformed QA control. Created SOW, and Contact Reports. Assisted Account Manager and Senior Project Manager with administration duties. Pollution Probe project managed one Developer, one Graphic Designer and client. Coordinated with freelancers in Windsor and Vancouver.  \nhttp://www.pollutionprobe.org/2007CAC/ \nSoftware knowledge: MS Project, MS Office,  \nPhotoshop CS, Illustrator CS, Indesign CS Print Studio Project Manager DraftFCB January 2001  –  March 2007  (6 years 3 months) Six years experience of directing and coordinating the activities for a staff of twelve. Over six year period supervised one to two Proofreaders, ten Mac Designers, one Mock-up Artist, one Digital Retoucher, three Junior Mac Interns, and one Junior Project Manager. Managed project work flow for all clients on a day to day and hour to hour basis. Maintained staff efficiency by allocating and relocating resource and project work flow. Performed project manager duties i.e. job and cost-tracking, estimates, employee reviews and interviews. Assisted in final proofing. Assisted as a Mac designer. Assistant to the Director of Studio Operations. Project managed the production of printed material for clients such as, Coke, TD Canada Trust, Ontario Tourism, Kraft, and Coors Light.  \nBudget range $1000 CDN - $100,000 CDN Print Studio Project Manager DraftFCB January 2001  –  March 2007  (6 years 3 months) Six years experience of directing and coordinating the activities for a staff of twelve. Over six year period supervised one to two Proofreaders, ten Mac Designers, one Mock-up Artist, one Digital Retoucher, three Junior Mac Interns, and one Junior Project Manager. Managed project work flow for all clients on a day to day and hour to hour basis. Maintained staff efficiency by allocating and relocating resource and project work flow. Performed project manager duties i.e. job and cost-tracking, estimates, employee reviews and interviews. Assisted in final proofing. Assisted as a Mac designer. Assistant to the Director of Studio Operations. Project managed the production of printed material for clients such as, Coke, TD Canada Trust, Ontario Tourism, Kraft, and Coors Light.  \nBudget range $1000 CDN - $100,000 CDN Production Director/Senior Partner Creation House Inc. January 1998  –  November 2000  (2 years 11 months) Created studio specializing in trade show design. Designed and produced graphics for leading companies such as Piller's, Indian Motorcycle, Suzuki, High Liner and Titleist. Project managed the production and design of booths for large trade shows i.e. Food and Beverage Show. Supervised freelance production teams up to twelve members, Stage painters, carpenters, industrial designers and artists. Performed administrative duties, including accounting and sourcing of labour and supplies. \nBudget range $500 CDN - $85,000 CDN \nRecipient of Mississauga’s Young Entrepreneur of the Year Award 1999 \n \nhttp://www.canadaone.com/ezine/may00/tradeshows.html Production Director/Senior Partner Creation House Inc. January 1998  –  November 2000  (2 years 11 months) Created studio specializing in trade show design. Designed and produced graphics for leading companies such as Piller's, Indian Motorcycle, Suzuki, High Liner and Titleist. Project managed the production and design of booths for large trade shows i.e. Food and Beverage Show. Supervised freelance production teams up to twelve members, Stage painters, carpenters, industrial designers and artists. Performed administrative duties, including accounting and sourcing of labour and supplies. \nBudget range $500 CDN - $85,000 CDN \nRecipient of Mississauga’s Young Entrepreneur of the Year Award 1999 \n \nhttp://www.canadaone.com/ezine/may00/tradeshows.html Skills Skills     ", "Experience Customer Experience, Global Project Manager Yahoo January 2013  – Present (2 years 8 months) I am responsible for overseeing projects related to Product Support Management, Global Processes, Business Systems and Customer Experience driven initiatives. Local Account Manager/Project Manager Yahoo! June 2008  –  January 2013  (4 years 8 months) Client Advocate Yahoo! June 2006  –  November 2008  (2 years 6 months) Customer Experience, Global Project Manager Yahoo January 2013  – Present (2 years 8 months) I am responsible for overseeing projects related to Product Support Management, Global Processes, Business Systems and Customer Experience driven initiatives. Customer Experience, Global Project Manager Yahoo January 2013  – Present (2 years 8 months) I am responsible for overseeing projects related to Product Support Management, Global Processes, Business Systems and Customer Experience driven initiatives. Local Account Manager/Project Manager Yahoo! June 2008  –  January 2013  (4 years 8 months) Local Account Manager/Project Manager Yahoo! June 2008  –  January 2013  (4 years 8 months) Client Advocate Yahoo! June 2006  –  November 2008  (2 years 6 months) Client Advocate Yahoo! June 2006  –  November 2008  (2 years 6 months) Skills PPC SEM Cross-functional Team... Online Advertising Business Development Web Analytics Digital Media Social Networking SEO Advertising Project Management Project Planning Program Management Client Services Search Engine... Organizational... Third Party Vendor... Vendor Management Bug Tracking Microsoft Project Project Delivery Technical Project... End-to-End Project... Project Tracking Project Risk Web-based Project... See 11+     See less Skills  PPC SEM Cross-functional Team... Online Advertising Business Development Web Analytics Digital Media Social Networking SEO Advertising Project Management Project Planning Program Management Client Services Search Engine... Organizational... Third Party Vendor... Vendor Management Bug Tracking Microsoft Project Project Delivery Technical Project... End-to-End Project... Project Tracking Project Risk Web-based Project... See 11+     See less PPC SEM Cross-functional Team... Online Advertising Business Development Web Analytics Digital Media Social Networking SEO Advertising Project Management Project Planning Program Management Client Services Search Engine... Organizational... Third Party Vendor... Vendor Management Bug Tracking Microsoft Project Project Delivery Technical Project... End-to-End Project... Project Tracking Project Risk Web-based Project... See 11+     See less PPC SEM Cross-functional Team... Online Advertising Business Development Web Analytics Digital Media Social Networking SEO Advertising Project Management Project Planning Program Management Client Services Search Engine... Organizational... Third Party Vendor... Vendor Management Bug Tracking Microsoft Project Project Delivery Technical Project... End-to-End Project... Project Tracking Project Risk Web-based Project... See 11+     See less Education CSUN Bachelor of Arts (B.A.) Los Angeles Valley College Associate of Arts (AA) CSUN Bachelor of Arts (B.A.) CSUN Bachelor of Arts (B.A.) CSUN Bachelor of Arts (B.A.) Los Angeles Valley College Associate of Arts (AA) Los Angeles Valley College Associate of Arts (AA) Los Angeles Valley College Associate of Arts (AA) ", "Summary Person of ethics, old fashion values and believe in a customer centric focus. Unique Relationship/Partnership and negotiator skills. Unmatched in Business Intelligence and requirement retrieval. \n \nI solve problems by identifying pain points, creating solutions that meet needs, defining an implementation plan which is measurable and sustainable and executing on it. \n......................● PMP - Project Manager -Program Manager●............. \n☛ Relationship & Alliance Guru \n☛ Always exceed financial and business goals \n☛ Strategic visionary, out-of-the-box thinker \n☛ Identifies game-changing business solutions & executes \n☛ High End Infrastructure - Technology Base \n \n☛ SUCCESSFUL Lead/Individual Contributor \n● 100% On-Time & On-Budget Track Record ● Exceed Quality expectations \n...................................● Proficiency ● .............................. \n☛\tCertified in Advanced Facilitation  \n☛\tBusiness Case Development \n☛\tSourcing Strategies - SCM \n☛\tNegotiator: Licence Agreements, SoW's, etc.  \n☛\tProcess Engineering - Work Flow Optimization \n...............................● Methodologies ● .............................. \n•PMI •STEP •LEAN\t•Six Sigma •Kaizen •Agile \n•Waterfall •ICE  \n...............................● Author / Writer ● .............................. \nGREEN, BPO, Business/Test/Execution Plans, Manuals, White Papers, Contracts, RFP's, Proposals, Licenses, etc. \n.................................... ● Military Service ● ............................... \nU.S. Army Intelligence - Foreign Language Interrogator, Top Secret Clearance Specialties:Highly Technical Full life-cycle IT/IS PM and Business Process Consultant: Unique mix of Project Management, Ops and Technical skills. Design & Documentation Expert. Strategy, Business Transformation, Communications, Technical Leadership, BD, BPO, Change Management; Manufacturing, Risk, Datacenter & Network Hardware & Software, SaaS, PLM, SDLC and Process Engineering, etc. Summary Person of ethics, old fashion values and believe in a customer centric focus. Unique Relationship/Partnership and negotiator skills. Unmatched in Business Intelligence and requirement retrieval. \n \nI solve problems by identifying pain points, creating solutions that meet needs, defining an implementation plan which is measurable and sustainable and executing on it. \n......................● PMP - Project Manager -Program Manager●............. \n☛ Relationship & Alliance Guru \n☛ Always exceed financial and business goals \n☛ Strategic visionary, out-of-the-box thinker \n☛ Identifies game-changing business solutions & executes \n☛ High End Infrastructure - Technology Base \n \n☛ SUCCESSFUL Lead/Individual Contributor \n● 100% On-Time & On-Budget Track Record ● Exceed Quality expectations \n...................................● Proficiency ● .............................. \n☛\tCertified in Advanced Facilitation  \n☛\tBusiness Case Development \n☛\tSourcing Strategies - SCM \n☛\tNegotiator: Licence Agreements, SoW's, etc.  \n☛\tProcess Engineering - Work Flow Optimization \n...............................● Methodologies ● .............................. \n•PMI •STEP •LEAN\t•Six Sigma •Kaizen •Agile \n•Waterfall •ICE  \n...............................● Author / Writer ● .............................. \nGREEN, BPO, Business/Test/Execution Plans, Manuals, White Papers, Contracts, RFP's, Proposals, Licenses, etc. \n.................................... ● Military Service ● ............................... \nU.S. Army Intelligence - Foreign Language Interrogator, Top Secret Clearance Specialties:Highly Technical Full life-cycle IT/IS PM and Business Process Consultant: Unique mix of Project Management, Ops and Technical skills. Design & Documentation Expert. Strategy, Business Transformation, Communications, Technical Leadership, BD, BPO, Change Management; Manufacturing, Risk, Datacenter & Network Hardware & Software, SaaS, PLM, SDLC and Process Engineering, etc. Person of ethics, old fashion values and believe in a customer centric focus. Unique Relationship/Partnership and negotiator skills. Unmatched in Business Intelligence and requirement retrieval. \n \nI solve problems by identifying pain points, creating solutions that meet needs, defining an implementation plan which is measurable and sustainable and executing on it. \n......................● PMP - Project Manager -Program Manager●............. \n☛ Relationship & Alliance Guru \n☛ Always exceed financial and business goals \n☛ Strategic visionary, out-of-the-box thinker \n☛ Identifies game-changing business solutions & executes \n☛ High End Infrastructure - Technology Base \n \n☛ SUCCESSFUL Lead/Individual Contributor \n● 100% On-Time & On-Budget Track Record ● Exceed Quality expectations \n...................................● Proficiency ● .............................. \n☛\tCertified in Advanced Facilitation  \n☛\tBusiness Case Development \n☛\tSourcing Strategies - SCM \n☛\tNegotiator: Licence Agreements, SoW's, etc.  \n☛\tProcess Engineering - Work Flow Optimization \n...............................● Methodologies ● .............................. \n•PMI •STEP •LEAN\t•Six Sigma •Kaizen •Agile \n•Waterfall •ICE  \n...............................● Author / Writer ● .............................. \nGREEN, BPO, Business/Test/Execution Plans, Manuals, White Papers, Contracts, RFP's, Proposals, Licenses, etc. \n.................................... ● Military Service ● ............................... \nU.S. Army Intelligence - Foreign Language Interrogator, Top Secret Clearance Specialties:Highly Technical Full life-cycle IT/IS PM and Business Process Consultant: Unique mix of Project Management, Ops and Technical skills. Design & Documentation Expert. Strategy, Business Transformation, Communications, Technical Leadership, BD, BPO, Change Management; Manufacturing, Risk, Datacenter & Network Hardware & Software, SaaS, PLM, SDLC and Process Engineering, etc. Person of ethics, old fashion values and believe in a customer centric focus. Unique Relationship/Partnership and negotiator skills. Unmatched in Business Intelligence and requirement retrieval. \n \nI solve problems by identifying pain points, creating solutions that meet needs, defining an implementation plan which is measurable and sustainable and executing on it. \n......................● PMP - Project Manager -Program Manager●............. \n☛ Relationship & Alliance Guru \n☛ Always exceed financial and business goals \n☛ Strategic visionary, out-of-the-box thinker \n☛ Identifies game-changing business solutions & executes \n☛ High End Infrastructure - Technology Base \n \n☛ SUCCESSFUL Lead/Individual Contributor \n● 100% On-Time & On-Budget Track Record ● Exceed Quality expectations \n...................................● Proficiency ● .............................. \n☛\tCertified in Advanced Facilitation  \n☛\tBusiness Case Development \n☛\tSourcing Strategies - SCM \n☛\tNegotiator: Licence Agreements, SoW's, etc.  \n☛\tProcess Engineering - Work Flow Optimization \n...............................● Methodologies ● .............................. \n•PMI •STEP •LEAN\t•Six Sigma •Kaizen •Agile \n•Waterfall •ICE  \n...............................● Author / Writer ● .............................. \nGREEN, BPO, Business/Test/Execution Plans, Manuals, White Papers, Contracts, RFP's, Proposals, Licenses, etc. \n.................................... ● Military Service ● ............................... \nU.S. Army Intelligence - Foreign Language Interrogator, Top Secret Clearance Specialties:Highly Technical Full life-cycle IT/IS PM and Business Process Consultant: Unique mix of Project Management, Ops and Technical skills. Design & Documentation Expert. Strategy, Business Transformation, Communications, Technical Leadership, BD, BPO, Change Management; Manufacturing, Risk, Datacenter & Network Hardware & Software, SaaS, PLM, SDLC and Process Engineering, etc. Experience Assistant Vice President: Service Delivery COnsultant Bank of America May 2015  – Present (4 months) Jacksonville, Florida Area Sr. Project Manager Insight Global December 2013  – Present (1 year 9 months) E. Hartford, CT Author Yahoo, ecomii, Boston Examiner February 2008  – Present (7 years 7 months) North East PMO Lead Insight April 2012  –  October 2013  (1 year 7 months) Greater Boston Area Sr. Project MAnager Insight April 2012  –  July 2012  (4 months) Eastern USA Sr. IT Global Project Manager SABIC Innovative Plastics October 2011  –  March 2012  (6 months) Greater Boston Area Senior Project Manager iGATE Patni May 2011  –  August 2011  (4 months) Novartis Cambridge, MA IT Technical Waukesha Bearings Corporation March 2011  –  May 2011  (3 months) BPO/Cash-Flow Consultant Transworld Systems October 2010  –  March 2011  (6 months) Consultant: HP SQA/BPO CheckPoint June 2010  –  January 2011  (8 months) VP Global Services: Program Managemnt GrossProfit 1993  –  2011  (18 years) VP/Dir. Business Development Medical Staffing Group, Inc August 2007  –  July 2008  (1 year) Dir. Business Dev. & Global Diversity Mgr ICI, Inc. February 2003  –  June 2007  (4 years 5 months) Hd Corporate Business PreOwned Electronics 2001  –  2003  (2 years) Corporate Division Blue Raven Technology 2001  –  2002  (1 year) Senior Trader NECX 2000  –  2001  (1 year) Sr. Global Account Manager - Commodities Trader - Team Lead Converge 1997  –  2001  (4 years) Sr.Trader Real World 1997  –  2001  (4 years) DISTRIBUTION SALES Admiral Metals 1997  –  1999  (2 years) Consultant SMC Pneumatics 1995  –  1999  (4 years) Project Manager: Tax Auditor/Consultant Intel 1994  –  1995  (1 year) Project Manager: Auditor/Tax Shiva Communication June 1994  –  October 1994  (5 months) Project Manager: MERGERS & ACQUISITIONS Addison Wesley Publishing 1993  –  1994  (1 year) Tax Analyst: Collections Internal Revenue ServiceW 1991  –  1993  (2 years) Regional Sales Manager Steel Art Company 1984  –  1990  (6 years) MAJOR ACCOUNT MANAGER US Telecommunication 1983  –  1984  (1 year) Assistant Vice President: Service Delivery COnsultant Bank of America May 2015  – Present (4 months) Jacksonville, Florida Area Assistant Vice President: Service Delivery COnsultant Bank of America May 2015  – Present (4 months) Jacksonville, Florida Area Sr. Project Manager Insight Global December 2013  – Present (1 year 9 months) E. Hartford, CT Sr. Project Manager Insight Global December 2013  – Present (1 year 9 months) E. Hartford, CT Author Yahoo, ecomii, Boston Examiner February 2008  – Present (7 years 7 months) Author Yahoo, ecomii, Boston Examiner February 2008  – Present (7 years 7 months) North East PMO Lead Insight April 2012  –  October 2013  (1 year 7 months) Greater Boston Area North East PMO Lead Insight April 2012  –  October 2013  (1 year 7 months) Greater Boston Area Sr. Project MAnager Insight April 2012  –  July 2012  (4 months) Eastern USA Sr. Project MAnager Insight April 2012  –  July 2012  (4 months) Eastern USA Sr. IT Global Project Manager SABIC Innovative Plastics October 2011  –  March 2012  (6 months) Greater Boston Area Sr. IT Global Project Manager SABIC Innovative Plastics October 2011  –  March 2012  (6 months) Greater Boston Area Senior Project Manager iGATE Patni May 2011  –  August 2011  (4 months) Novartis Cambridge, MA Senior Project Manager iGATE Patni May 2011  –  August 2011  (4 months) Novartis Cambridge, MA IT Technical Waukesha Bearings Corporation March 2011  –  May 2011  (3 months) IT Technical Waukesha Bearings Corporation March 2011  –  May 2011  (3 months) BPO/Cash-Flow Consultant Transworld Systems October 2010  –  March 2011  (6 months) BPO/Cash-Flow Consultant Transworld Systems October 2010  –  March 2011  (6 months) Consultant: HP SQA/BPO CheckPoint June 2010  –  January 2011  (8 months) Consultant: HP SQA/BPO CheckPoint June 2010  –  January 2011  (8 months) VP Global Services: Program Managemnt GrossProfit 1993  –  2011  (18 years) VP Global Services: Program Managemnt GrossProfit 1993  –  2011  (18 years) VP/Dir. Business Development Medical Staffing Group, Inc August 2007  –  July 2008  (1 year) VP/Dir. Business Development Medical Staffing Group, Inc August 2007  –  July 2008  (1 year) Dir. Business Dev. & Global Diversity Mgr ICI, Inc. February 2003  –  June 2007  (4 years 5 months) Dir. Business Dev. & Global Diversity Mgr ICI, Inc. February 2003  –  June 2007  (4 years 5 months) Hd Corporate Business PreOwned Electronics 2001  –  2003  (2 years) Hd Corporate Business PreOwned Electronics 2001  –  2003  (2 years) Corporate Division Blue Raven Technology 2001  –  2002  (1 year) Corporate Division Blue Raven Technology 2001  –  2002  (1 year) Senior Trader NECX 2000  –  2001  (1 year) Senior Trader NECX 2000  –  2001  (1 year) Sr. Global Account Manager - Commodities Trader - Team Lead Converge 1997  –  2001  (4 years) Sr. Global Account Manager - Commodities Trader - Team Lead Converge 1997  –  2001  (4 years) Sr.Trader Real World 1997  –  2001  (4 years) Sr.Trader Real World 1997  –  2001  (4 years) DISTRIBUTION SALES Admiral Metals 1997  –  1999  (2 years) DISTRIBUTION SALES Admiral Metals 1997  –  1999  (2 years) Consultant SMC Pneumatics 1995  –  1999  (4 years) Consultant SMC Pneumatics 1995  –  1999  (4 years) Project Manager: Tax Auditor/Consultant Intel 1994  –  1995  (1 year) Project Manager: Tax Auditor/Consultant Intel 1994  –  1995  (1 year) Project Manager: Auditor/Tax Shiva Communication June 1994  –  October 1994  (5 months) Project Manager: Auditor/Tax Shiva Communication June 1994  –  October 1994  (5 months) Project Manager: MERGERS & ACQUISITIONS Addison Wesley Publishing 1993  –  1994  (1 year) Project Manager: MERGERS & ACQUISITIONS Addison Wesley Publishing 1993  –  1994  (1 year) Tax Analyst: Collections Internal Revenue ServiceW 1991  –  1993  (2 years) Tax Analyst: Collections Internal Revenue ServiceW 1991  –  1993  (2 years) Regional Sales Manager Steel Art Company 1984  –  1990  (6 years) Regional Sales Manager Steel Art Company 1984  –  1990  (6 years) MAJOR ACCOUNT MANAGER US Telecommunication 1983  –  1984  (1 year) MAJOR ACCOUNT MANAGER US Telecommunication 1983  –  1984  (1 year) Languages Polish Polish Polish Skills MS Project Program Management Software Project... Strategic Communications New Business Development Business Analysis Business Strategy Negotiation Planning Project Execution Marketing Strategy Project Management Project Planning SaaS Change Management Training PMP Integration Business Development Business Process Agile Methodologies Strategy IT Management Management SharePoint Business Intelligence Mobile Devices Leadership Telecommunications CRM PMO Testing IT Service Management Pre-sales See 19+     See less Skills  MS Project Program Management Software Project... Strategic Communications New Business Development Business Analysis Business Strategy Negotiation Planning Project Execution Marketing Strategy Project Management Project Planning SaaS Change Management Training PMP Integration Business Development Business Process Agile Methodologies Strategy IT Management Management SharePoint Business Intelligence Mobile Devices Leadership Telecommunications CRM PMO Testing IT Service Management Pre-sales See 19+     See less MS Project Program Management Software Project... Strategic Communications New Business Development Business Analysis Business Strategy Negotiation Planning Project Execution Marketing Strategy Project Management Project Planning SaaS Change Management Training PMP Integration Business Development Business Process Agile Methodologies Strategy IT Management Management SharePoint Business Intelligence Mobile Devices Leadership Telecommunications CRM PMO Testing IT Service Management Pre-sales See 19+     See less MS Project Program Management Software Project... Strategic Communications New Business Development Business Analysis Business Strategy Negotiation Planning Project Execution Marketing Strategy Project Management Project Planning SaaS Change Management Training PMP Integration Business Development Business Process Agile Methodologies Strategy IT Management Management SharePoint Business Intelligence Mobile Devices Leadership Telecommunications CRM PMO Testing IT Service Management Pre-sales See 19+     See less Education Mindleaders Mastery in Project Management 2011  – 2011 The Learning Tree Certified Advanced Facilator 2011  – 2011 Massachusetts Institute of Technology 2010  – 2010 ISCEA-Int'l Supply Chain Ed. Alliance CSCA 2009  – 2009 University of Massachusetts Boston BS 1979  – 1982 Kents Hill 1978  – 1980 Ninth House Network Situational Leadership Training Salem State University Mindleaders Mastery in Project Management 2011  – 2011 Mindleaders Mastery in Project Management 2011  – 2011 Mindleaders Mastery in Project Management 2011  – 2011 The Learning Tree Certified Advanced Facilator 2011  – 2011 The Learning Tree Certified Advanced Facilator 2011  – 2011 The Learning Tree Certified Advanced Facilator 2011  – 2011 Massachusetts Institute of Technology 2010  – 2010 Massachusetts Institute of Technology 2010  – 2010 Massachusetts Institute of Technology 2010  – 2010 ISCEA-Int'l Supply Chain Ed. Alliance CSCA 2009  – 2009 ISCEA-Int'l Supply Chain Ed. Alliance CSCA 2009  – 2009 ISCEA-Int'l Supply Chain Ed. Alliance CSCA 2009  – 2009 University of Massachusetts Boston BS 1979  – 1982 University of Massachusetts Boston BS 1979  – 1982 University of Massachusetts Boston BS 1979  – 1982 Kents Hill 1978  – 1980 Kents Hill 1978  – 1980 Kents Hill 1978  – 1980 Ninth House Network Situational Leadership Training Ninth House Network Situational Leadership Training Ninth House Network Situational Leadership Training Salem State University Salem State University Salem State University Honors & Awards Additional Honors & Awards Top Secret Clearance ¤ Presidents Club  \nHighest Margin Producer -3 years \nTeam Building Award, Converge  \nLeadership Award, U.S. Telecommunications \nRecord Top Producer, Blue Raven \nTop lead generations, US Telecommunications Additional Honors & Awards Top Secret Clearance ¤ Presidents Club  \nHighest Margin Producer -3 years \nTeam Building Award, Converge  \nLeadership Award, U.S. Telecommunications \nRecord Top Producer, Blue Raven \nTop lead generations, US Telecommunications Additional Honors & Awards Top Secret Clearance ¤ Presidents Club  \nHighest Margin Producer -3 years \nTeam Building Award, Converge  \nLeadership Award, U.S. Telecommunications \nRecord Top Producer, Blue Raven \nTop lead generations, US Telecommunications Additional Honors & Awards Top Secret Clearance ¤ Presidents Club  \nHighest Margin Producer -3 years \nTeam Building Award, Converge  \nLeadership Award, U.S. Telecommunications \nRecord Top Producer, Blue Raven \nTop lead generations, US Telecommunications ", "Languages English Native or bilingual proficiency Afrikaans Native or bilingual proficiency English Native or bilingual proficiency Afrikaans Native or bilingual proficiency English Native or bilingual proficiency Afrikaans Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management Qualified Chartered... Strategic Planning Outsourcing Change Management Process Improvement System Design System Implementations Financial Modeling Financial Reporting Auditing Business Intelligence Accounting US GAAP Unix Operating Systems Mac OS X OLAP Problem Solving Programming Afrikaans Operating Systems Forecasting Analysis Management Analytics Essbase Strategy See 12+     See less Skills  Project Management Qualified Chartered... Strategic Planning Outsourcing Change Management Process Improvement System Design System Implementations Financial Modeling Financial Reporting Auditing Business Intelligence Accounting US GAAP Unix Operating Systems Mac OS X OLAP Problem Solving Programming Afrikaans Operating Systems Forecasting Analysis Management Analytics Essbase Strategy See 12+     See less Project Management Qualified Chartered... Strategic Planning Outsourcing Change Management Process Improvement System Design System Implementations Financial Modeling Financial Reporting Auditing Business Intelligence Accounting US GAAP Unix Operating Systems Mac OS X OLAP Problem Solving Programming Afrikaans Operating Systems Forecasting Analysis Management Analytics Essbase Strategy See 12+     See less Project Management Qualified Chartered... Strategic Planning Outsourcing Change Management Process Improvement System Design System Implementations Financial Modeling Financial Reporting Auditing Business Intelligence Accounting US GAAP Unix Operating Systems Mac OS X OLAP Problem Solving Programming Afrikaans Operating Systems Forecasting Analysis Management Analytics Essbase Strategy See 12+     See less ", "Skills Project Management CMS Rich Media Agile Methodologies E-commerce Web Analytics Web Application Design Magento Management Marketing Communications Project Delivery IT Strategy Skills  Project Management CMS Rich Media Agile Methodologies E-commerce Web Analytics Web Application Design Magento Management Marketing Communications Project Delivery IT Strategy Project Management CMS Rich Media Agile Methodologies E-commerce Web Analytics Web Application Design Magento Management Marketing Communications Project Delivery IT Strategy Project Management CMS Rich Media Agile Methodologies E-commerce Web Analytics Web Application Design Magento Management Marketing Communications Project Delivery IT Strategy ", "Experience Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Skills Mobile Devices GIS Perl Skills  Mobile Devices GIS Perl Mobile Devices GIS Perl Mobile Devices GIS Perl Education Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 ", "Experience Sr. Project Manager Yahoo October 2013  – Present (1 year 11 months) Taiwan Leading a team to deliver sales projects and achieve target revenue. Sr. Project Manager Yahoo October 2013  – Present (1 year 11 months) Taiwan Leading a team to deliver sales projects and achieve target revenue. Sr. Project Manager Yahoo October 2013  – Present (1 year 11 months) Taiwan Leading a team to deliver sales projects and achieve target revenue. Languages Chinese English Chinese English Chinese English Skills Web Project Management Internet Strategy Online Advertising Product Management Digital Marketing Mobile Marketing Digital Media Online Marketing Digital Strategy Mobile Applications User Experience Information Architecture Mobile Devices Management Project Management Product Marketing See 1+     See less Skills  Web Project Management Internet Strategy Online Advertising Product Management Digital Marketing Mobile Marketing Digital Media Online Marketing Digital Strategy Mobile Applications User Experience Information Architecture Mobile Devices Management Project Management Product Marketing See 1+     See less Web Project Management Internet Strategy Online Advertising Product Management Digital Marketing Mobile Marketing Digital Media Online Marketing Digital Strategy Mobile Applications User Experience Information Architecture Mobile Devices Management Project Management Product Marketing See 1+     See less Web Project Management Internet Strategy Online Advertising Product Management Digital Marketing Mobile Marketing Digital Media Online Marketing Digital Strategy Mobile Applications User Experience Information Architecture Mobile Devices Management Project Management Product Marketing See 1+     See less ", "Summary Project Manager with a strong Product background, experienced in Media, Financial Services, Wholesale and Education Sectors. \n \nCertifications: \nCSM, CSPO \n \nSpecialties: Program/Project Management, Agile, SCRUM, Product Development, New Initiatives Development from Inception to Production Summary Project Manager with a strong Product background, experienced in Media, Financial Services, Wholesale and Education Sectors. \n \nCertifications: \nCSM, CSPO \n \nSpecialties: Program/Project Management, Agile, SCRUM, Product Development, New Initiatives Development from Inception to Production Project Manager with a strong Product background, experienced in Media, Financial Services, Wholesale and Education Sectors. \n \nCertifications: \nCSM, CSPO \n \nSpecialties: Program/Project Management, Agile, SCRUM, Product Development, New Initiatives Development from Inception to Production Project Manager with a strong Product background, experienced in Media, Financial Services, Wholesale and Education Sectors. \n \nCertifications: \nCSM, CSPO \n \nSpecialties: Program/Project Management, Agile, SCRUM, Product Development, New Initiatives Development from Inception to Production Experience Senior Agile Project Manager Yahoo April 2014  – Present (1 year 5 months) Sydney Area, Australia Project Manager Yahoo! August 2012  –  March 2014  (1 year 8 months) Sydney Area, Australia Project Management Director City Interactive March 2012  –  July 2012  (5 months) Warsaw Area, Poland PMO Manager City Interactive September 2011  –  March 2012  (7 months) Warsaw Area, Poland Sabatical Leave Sabatical January 2011  –  August 2011  (8 months) Business Systems Manager James Bennett (a Baker & Taylor company) June 2010  –  December 2010  (7 months) Project Manager James Bennett (a Baker & Taylor company) April 2006  –  June 2010  (4 years 3 months) Technical Business Analyst CommSec September 2005  –  March 2006  (7 months) Business Systems Analyst Investec July 2005  –  August 2005  (2 months) Business Analyst ValeGro Pty Ltd March 2004  –  July 2005  (1 year 5 months) Senior Agile Project Manager Yahoo April 2014  – Present (1 year 5 months) Sydney Area, Australia Senior Agile Project Manager Yahoo April 2014  – Present (1 year 5 months) Sydney Area, Australia Project Manager Yahoo! August 2012  –  March 2014  (1 year 8 months) Sydney Area, Australia Project Manager Yahoo! August 2012  –  March 2014  (1 year 8 months) Sydney Area, Australia Project Management Director City Interactive March 2012  –  July 2012  (5 months) Warsaw Area, Poland Project Management Director City Interactive March 2012  –  July 2012  (5 months) Warsaw Area, Poland PMO Manager City Interactive September 2011  –  March 2012  (7 months) Warsaw Area, Poland PMO Manager City Interactive September 2011  –  March 2012  (7 months) Warsaw Area, Poland Sabatical Leave Sabatical January 2011  –  August 2011  (8 months) Sabatical Leave Sabatical January 2011  –  August 2011  (8 months) Business Systems Manager James Bennett (a Baker & Taylor company) June 2010  –  December 2010  (7 months) Business Systems Manager James Bennett (a Baker & Taylor company) June 2010  –  December 2010  (7 months) Project Manager James Bennett (a Baker & Taylor company) April 2006  –  June 2010  (4 years 3 months) Project Manager James Bennett (a Baker & Taylor company) April 2006  –  June 2010  (4 years 3 months) Technical Business Analyst CommSec September 2005  –  March 2006  (7 months) Technical Business Analyst CommSec September 2005  –  March 2006  (7 months) Business Systems Analyst Investec July 2005  –  August 2005  (2 months) Business Systems Analyst Investec July 2005  –  August 2005  (2 months) Business Analyst ValeGro Pty Ltd March 2004  –  July 2005  (1 year 5 months) Business Analyst ValeGro Pty Ltd March 2004  –  July 2005  (1 year 5 months) Languages   Skills Skills     Education University of South Australia MIS,  Information Systems Management 2003  – 2005 Full paper at Informing Science + IT Education, Rockhampton, Australia \n(http://informingscience.org/proceedings/InSITE2004/039micha.pdf) BA,  Business Administration 1999  – 2002 University of South Australia MIS,  Information Systems Management 2003  – 2005 Full paper at Informing Science + IT Education, Rockhampton, Australia \n(http://informingscience.org/proceedings/InSITE2004/039micha.pdf) University of South Australia MIS,  Information Systems Management 2003  – 2005 Full paper at Informing Science + IT Education, Rockhampton, Australia \n(http://informingscience.org/proceedings/InSITE2004/039micha.pdf) University of South Australia MIS,  Information Systems Management 2003  – 2005 Full paper at Informing Science + IT Education, Rockhampton, Australia \n(http://informingscience.org/proceedings/InSITE2004/039micha.pdf) BA,  Business Administration 1999  – 2002 BA,  Business Administration 1999  – 2002 BA,  Business Administration 1999  – 2002 ", "Summary My objective is to continue as a Technical Project Manager/Consultant. As a consultant, I have been fortunate to work for some of the Bay Area's largest companies including Visa, Wells Fargo, Bank of the West, Charles Schwab, and Williams-Sonoma. While my project management background is quite diverse, I still enjoy learning new environments, finding new efficiencies, and simply getting the job done. Key strengths include my ability to quickly assess a new situation, identify the stakeholders, and ask questions that give me the information I need to hit the ground running when working with internal and external resources. I have good communication skills and enjoy interacting with clients. Summary My objective is to continue as a Technical Project Manager/Consultant. As a consultant, I have been fortunate to work for some of the Bay Area's largest companies including Visa, Wells Fargo, Bank of the West, Charles Schwab, and Williams-Sonoma. While my project management background is quite diverse, I still enjoy learning new environments, finding new efficiencies, and simply getting the job done. Key strengths include my ability to quickly assess a new situation, identify the stakeholders, and ask questions that give me the information I need to hit the ground running when working with internal and external resources. I have good communication skills and enjoy interacting with clients. My objective is to continue as a Technical Project Manager/Consultant. As a consultant, I have been fortunate to work for some of the Bay Area's largest companies including Visa, Wells Fargo, Bank of the West, Charles Schwab, and Williams-Sonoma. While my project management background is quite diverse, I still enjoy learning new environments, finding new efficiencies, and simply getting the job done. Key strengths include my ability to quickly assess a new situation, identify the stakeholders, and ask questions that give me the information I need to hit the ground running when working with internal and external resources. I have good communication skills and enjoy interacting with clients. My objective is to continue as a Technical Project Manager/Consultant. As a consultant, I have been fortunate to work for some of the Bay Area's largest companies including Visa, Wells Fargo, Bank of the West, Charles Schwab, and Williams-Sonoma. While my project management background is quite diverse, I still enjoy learning new environments, finding new efficiencies, and simply getting the job done. Key strengths include my ability to quickly assess a new situation, identify the stakeholders, and ask questions that give me the information I need to hit the ground running when working with internal and external resources. I have good communication skills and enjoy interacting with clients. Experience Project Manager AAA NCNU November 2012  – Present (2 years 10 months) Manage tasks across multiple technical and non-technical teams on IT infrastructure focused projects. Coordinate business validation efforts for the systems supporting insurance related policies. Manage various projects as they relate to the transition from legacy to cloud-based technology. Responsible for managing and facilitating User Acceptance Testing (UAT) for the new cloud base Point-of-Sale (POS) application, including developing and deploying test plans, compiling test scripts, and scheduling testing resources. Assist in supporting the PAS (Policy Administration System) application (50% technical/50% business). Project Manager - Loyalty Platform Visa January 2011  –  June 2012  (1 year 6 months) Managed the implementation and on-going monitoring of loyalty promotions and programs supported by the Visa Loyalty Platform Services (VLPS). Provided support to the internal and external groups utilizing VLPS. This included providing partnership and business/technical advisory support and serving as an escalation point for programs and operationally related issues. \n \nDeveloped UAT tet scripts and supported UAT testing of new enhancements and regression testing. Documented new development processes in support of business programs in the VLPS. Responsible for analyzing requirements, procedures, and problems to improve existing processes and procedures, workflow, service levels,a nd program performance. \n \nProduced weekly reports (MicroStrategy, aka, MSTR) provided in support of loyalty promotions and programs. Worked with SQL queries to support promotion reporting and file requirements. Facilitated and participated in operational meetings with cross-functional support teams. \n \nInvolved with the Proof-of-Concept (POC) for a Transaction Trigger-Based Flight Insurance Program and performed business case validation testing. \n \n Managed the file delivery process between Issuer and external vendor. \n Worked with key decision-makers on program design and development. \n Validated the integrity of the files. \n Developed process documentation. \n Assisted with operational issues. Technical Project Manager Bank of the West September 2010  –  December 2010  (4 months) Data Warehousing \"Host Upgrade\" Project: \n \n Managed the integration of vendor tasks and contractual commitments. \n Facilitated project meetings to ensure project met specifications and deadlines. \n Reviewed the integrity of the source data with the ETL Development Team. \n Coordinated and facilitated weekly meetings with BOTW Business Area Partners and external vendors to review data discrepancies. \n Tracked and managed action items and the resulting resolutions. \n \nCisco Scheduler \"Proof-of-Concept\" Project: \n \n Gathered requirements to support the POC. \n Managed the POC implementation and validation processes. \n Held working sessions with BOTW business internal groups to identify sample application jobs. \n Tracked and managed action items and resulting resolutions. \n Successfully implemented the POC using the Cisco Scheduler to automate application jobs. Project Manager - Loyalty Platform PMO Visa September 2009  –  September 2010  (1 year 1 month) Data Migration Project: \n \nWorked with the Program Manager for the transitioning of the Visa Extras Program to a new vendor. Managed each vendor's project plan and consoliated these into one master plan. Prepared weekly presentations and assisted in facilitating weekly meetings with key stakeholders, including Visa internal and external vendor resources to provide updated information on the progress of the project. Tracked and managed risks, action items, and the resulting resolutions. \n \nLead the development of the Command Center: \n Worked with management to assign resources to work the Command Center during depolyment. \n Defined the Escalation Process to be following for resoloving issues. \n Prepared a work schedule and assigned resources based on the deployment timeline. \n Coordinated the use of dedicated phone lines. \n Arrangd logistics (building access, food, water, etc.). Technical/Infrastructure Project Manager Wells Fargo February 2009  –  August 2009  (7 months) Managed large, complex projects in the Production Support Environment specifically relating to the merger of Wells Fargo Bank and Wachovia Bank. Responsible for developing and executing infrastructure related project plans and facilitating the implementation and installation of hardware related patches, fixes and enhancements. Managed the installation of new servers and SAN storage in the data centers; as well as relocation of existing servers within data centers. Managed required resources, communicated, and administered project plans, and created associated reports. Project Manager - Loyalty Platform Services Visa June 2008  –  January 2009  (8 months) Managed several TAQC programs for large Visa client banks, including the development of project plans, creative materials, mail lists, reports, websites, and customer service documentation. Acted as a liaison with various internal and external groups to ensure programs were delivered on time and within budget. Provided general support for other departmental programs/projects as needed. \n \nAccomplishments: \n \n\tServed as the main point of contact for operational aspects relating to all Chase Bank’s Promotional Programs and managed related communications and weekly status meetings \n\tSuccessfully managed marketing campaigns for Chase Bank including Internet enrollment, customer service, and client interface for the Loyalty Platform \n\tParticipated in the definition of the business requirements for the Visa Extras Travel Reward program \n\tManaged and facilitated weekly status meetings with key stakeholders from Visa and client banks \n\tAnalyzed and compiled weekly statistical reports for each program, including enrollment statistics, participation levels, and custom reports as needed \n\tRefined and redesigned the enrollment process document for Visa Loyalty Platform clients \n\tManaged the development and implementation of the product website \n\tParticipated in the early stages of defining the business requirements for Visa Canada including high level discussions on the use of Visa’s products and services Project Manager - UAT Yahoo! January 2008  –  June 2008  (6 months) Clarity Release Manager/Project Manager Charles Schwab February 2007  –  November 2007  (10 months) e-Commerce Senior Project Manager Williams-Sonoma, Inc. November 2005  –  January 2007  (1 year 3 months) E-Business Systems Consultant/Technology Manager/Project Manager Wells Fargo October 2000  –  November 2005  (5 years 2 months) Project Manager Charles Schwab January 2000  –  October 2000  (10 months) Project Manager Visa June 1998  –  December 1999  (1 year 7 months) Consulted with the Visa International Treasury department, served as lead contact for the Alliance Partner Members to permanently change FedWire process from Chase Manhattan to Bank of America as the primary Visa settlement financial institution. Coordinated communication to all Alliance Partner Member Banks to document and verify settlement data and destination. Assisted with problem resolution for pre-existing issues effecting the project and Visa.  \nManaged Year 2000 projects between Visa USA and its alliance partners and International Development and served as a member of the project team for the Year 2000 Event Management Center. Supported Alliance Management Department (Visa USA) with their internal readiness for Year 2000. \n \nAccomplishments: \n \n\tDevised a testing plan using existing Year 2000 Proxy test transactions files (TC57 and TC59) saved in the system, resulting in saving Visa over $80,000 to create a testing database \n\tServed as a liaison between alliance partners and Visa to manage all Year 2000 efforts, communicate options, and issues \n\tAssigned to be the project manager for clearing and settlement Year 2000 testing  \n\tProvided assistance to the direct connect merchants and clients of Vital Processing Services Project Manager AAA NCNU November 2012  – Present (2 years 10 months) Manage tasks across multiple technical and non-technical teams on IT infrastructure focused projects. Coordinate business validation efforts for the systems supporting insurance related policies. Manage various projects as they relate to the transition from legacy to cloud-based technology. Responsible for managing and facilitating User Acceptance Testing (UAT) for the new cloud base Point-of-Sale (POS) application, including developing and deploying test plans, compiling test scripts, and scheduling testing resources. Assist in supporting the PAS (Policy Administration System) application (50% technical/50% business). Project Manager AAA NCNU November 2012  – Present (2 years 10 months) Manage tasks across multiple technical and non-technical teams on IT infrastructure focused projects. Coordinate business validation efforts for the systems supporting insurance related policies. Manage various projects as they relate to the transition from legacy to cloud-based technology. Responsible for managing and facilitating User Acceptance Testing (UAT) for the new cloud base Point-of-Sale (POS) application, including developing and deploying test plans, compiling test scripts, and scheduling testing resources. Assist in supporting the PAS (Policy Administration System) application (50% technical/50% business). Project Manager - Loyalty Platform Visa January 2011  –  June 2012  (1 year 6 months) Managed the implementation and on-going monitoring of loyalty promotions and programs supported by the Visa Loyalty Platform Services (VLPS). Provided support to the internal and external groups utilizing VLPS. This included providing partnership and business/technical advisory support and serving as an escalation point for programs and operationally related issues. \n \nDeveloped UAT tet scripts and supported UAT testing of new enhancements and regression testing. Documented new development processes in support of business programs in the VLPS. Responsible for analyzing requirements, procedures, and problems to improve existing processes and procedures, workflow, service levels,a nd program performance. \n \nProduced weekly reports (MicroStrategy, aka, MSTR) provided in support of loyalty promotions and programs. Worked with SQL queries to support promotion reporting and file requirements. Facilitated and participated in operational meetings with cross-functional support teams. \n \nInvolved with the Proof-of-Concept (POC) for a Transaction Trigger-Based Flight Insurance Program and performed business case validation testing. \n \n Managed the file delivery process between Issuer and external vendor. \n Worked with key decision-makers on program design and development. \n Validated the integrity of the files. \n Developed process documentation. \n Assisted with operational issues. Project Manager - Loyalty Platform Visa January 2011  –  June 2012  (1 year 6 months) Managed the implementation and on-going monitoring of loyalty promotions and programs supported by the Visa Loyalty Platform Services (VLPS). Provided support to the internal and external groups utilizing VLPS. This included providing partnership and business/technical advisory support and serving as an escalation point for programs and operationally related issues. \n \nDeveloped UAT tet scripts and supported UAT testing of new enhancements and regression testing. Documented new development processes in support of business programs in the VLPS. Responsible for analyzing requirements, procedures, and problems to improve existing processes and procedures, workflow, service levels,a nd program performance. \n \nProduced weekly reports (MicroStrategy, aka, MSTR) provided in support of loyalty promotions and programs. Worked with SQL queries to support promotion reporting and file requirements. Facilitated and participated in operational meetings with cross-functional support teams. \n \nInvolved with the Proof-of-Concept (POC) for a Transaction Trigger-Based Flight Insurance Program and performed business case validation testing. \n \n Managed the file delivery process between Issuer and external vendor. \n Worked with key decision-makers on program design and development. \n Validated the integrity of the files. \n Developed process documentation. \n Assisted with operational issues. Technical Project Manager Bank of the West September 2010  –  December 2010  (4 months) Data Warehousing \"Host Upgrade\" Project: \n \n Managed the integration of vendor tasks and contractual commitments. \n Facilitated project meetings to ensure project met specifications and deadlines. \n Reviewed the integrity of the source data with the ETL Development Team. \n Coordinated and facilitated weekly meetings with BOTW Business Area Partners and external vendors to review data discrepancies. \n Tracked and managed action items and the resulting resolutions. \n \nCisco Scheduler \"Proof-of-Concept\" Project: \n \n Gathered requirements to support the POC. \n Managed the POC implementation and validation processes. \n Held working sessions with BOTW business internal groups to identify sample application jobs. \n Tracked and managed action items and resulting resolutions. \n Successfully implemented the POC using the Cisco Scheduler to automate application jobs. Technical Project Manager Bank of the West September 2010  –  December 2010  (4 months) Data Warehousing \"Host Upgrade\" Project: \n \n Managed the integration of vendor tasks and contractual commitments. \n Facilitated project meetings to ensure project met specifications and deadlines. \n Reviewed the integrity of the source data with the ETL Development Team. \n Coordinated and facilitated weekly meetings with BOTW Business Area Partners and external vendors to review data discrepancies. \n Tracked and managed action items and the resulting resolutions. \n \nCisco Scheduler \"Proof-of-Concept\" Project: \n \n Gathered requirements to support the POC. \n Managed the POC implementation and validation processes. \n Held working sessions with BOTW business internal groups to identify sample application jobs. \n Tracked and managed action items and resulting resolutions. \n Successfully implemented the POC using the Cisco Scheduler to automate application jobs. Project Manager - Loyalty Platform PMO Visa September 2009  –  September 2010  (1 year 1 month) Data Migration Project: \n \nWorked with the Program Manager for the transitioning of the Visa Extras Program to a new vendor. Managed each vendor's project plan and consoliated these into one master plan. Prepared weekly presentations and assisted in facilitating weekly meetings with key stakeholders, including Visa internal and external vendor resources to provide updated information on the progress of the project. Tracked and managed risks, action items, and the resulting resolutions. \n \nLead the development of the Command Center: \n Worked with management to assign resources to work the Command Center during depolyment. \n Defined the Escalation Process to be following for resoloving issues. \n Prepared a work schedule and assigned resources based on the deployment timeline. \n Coordinated the use of dedicated phone lines. \n Arrangd logistics (building access, food, water, etc.). Project Manager - Loyalty Platform PMO Visa September 2009  –  September 2010  (1 year 1 month) Data Migration Project: \n \nWorked with the Program Manager for the transitioning of the Visa Extras Program to a new vendor. Managed each vendor's project plan and consoliated these into one master plan. Prepared weekly presentations and assisted in facilitating weekly meetings with key stakeholders, including Visa internal and external vendor resources to provide updated information on the progress of the project. Tracked and managed risks, action items, and the resulting resolutions. \n \nLead the development of the Command Center: \n Worked with management to assign resources to work the Command Center during depolyment. \n Defined the Escalation Process to be following for resoloving issues. \n Prepared a work schedule and assigned resources based on the deployment timeline. \n Coordinated the use of dedicated phone lines. \n Arrangd logistics (building access, food, water, etc.). Technical/Infrastructure Project Manager Wells Fargo February 2009  –  August 2009  (7 months) Managed large, complex projects in the Production Support Environment specifically relating to the merger of Wells Fargo Bank and Wachovia Bank. Responsible for developing and executing infrastructure related project plans and facilitating the implementation and installation of hardware related patches, fixes and enhancements. Managed the installation of new servers and SAN storage in the data centers; as well as relocation of existing servers within data centers. Managed required resources, communicated, and administered project plans, and created associated reports. Technical/Infrastructure Project Manager Wells Fargo February 2009  –  August 2009  (7 months) Managed large, complex projects in the Production Support Environment specifically relating to the merger of Wells Fargo Bank and Wachovia Bank. Responsible for developing and executing infrastructure related project plans and facilitating the implementation and installation of hardware related patches, fixes and enhancements. Managed the installation of new servers and SAN storage in the data centers; as well as relocation of existing servers within data centers. Managed required resources, communicated, and administered project plans, and created associated reports. Project Manager - Loyalty Platform Services Visa June 2008  –  January 2009  (8 months) Managed several TAQC programs for large Visa client banks, including the development of project plans, creative materials, mail lists, reports, websites, and customer service documentation. Acted as a liaison with various internal and external groups to ensure programs were delivered on time and within budget. Provided general support for other departmental programs/projects as needed. \n \nAccomplishments: \n \n\tServed as the main point of contact for operational aspects relating to all Chase Bank’s Promotional Programs and managed related communications and weekly status meetings \n\tSuccessfully managed marketing campaigns for Chase Bank including Internet enrollment, customer service, and client interface for the Loyalty Platform \n\tParticipated in the definition of the business requirements for the Visa Extras Travel Reward program \n\tManaged and facilitated weekly status meetings with key stakeholders from Visa and client banks \n\tAnalyzed and compiled weekly statistical reports for each program, including enrollment statistics, participation levels, and custom reports as needed \n\tRefined and redesigned the enrollment process document for Visa Loyalty Platform clients \n\tManaged the development and implementation of the product website \n\tParticipated in the early stages of defining the business requirements for Visa Canada including high level discussions on the use of Visa’s products and services Project Manager - Loyalty Platform Services Visa June 2008  –  January 2009  (8 months) Managed several TAQC programs for large Visa client banks, including the development of project plans, creative materials, mail lists, reports, websites, and customer service documentation. Acted as a liaison with various internal and external groups to ensure programs were delivered on time and within budget. Provided general support for other departmental programs/projects as needed. \n \nAccomplishments: \n \n\tServed as the main point of contact for operational aspects relating to all Chase Bank’s Promotional Programs and managed related communications and weekly status meetings \n\tSuccessfully managed marketing campaigns for Chase Bank including Internet enrollment, customer service, and client interface for the Loyalty Platform \n\tParticipated in the definition of the business requirements for the Visa Extras Travel Reward program \n\tManaged and facilitated weekly status meetings with key stakeholders from Visa and client banks \n\tAnalyzed and compiled weekly statistical reports for each program, including enrollment statistics, participation levels, and custom reports as needed \n\tRefined and redesigned the enrollment process document for Visa Loyalty Platform clients \n\tManaged the development and implementation of the product website \n\tParticipated in the early stages of defining the business requirements for Visa Canada including high level discussions on the use of Visa’s products and services Project Manager - UAT Yahoo! January 2008  –  June 2008  (6 months) Project Manager - UAT Yahoo! January 2008  –  June 2008  (6 months) Clarity Release Manager/Project Manager Charles Schwab February 2007  –  November 2007  (10 months) Clarity Release Manager/Project Manager Charles Schwab February 2007  –  November 2007  (10 months) e-Commerce Senior Project Manager Williams-Sonoma, Inc. November 2005  –  January 2007  (1 year 3 months) e-Commerce Senior Project Manager Williams-Sonoma, Inc. November 2005  –  January 2007  (1 year 3 months) E-Business Systems Consultant/Technology Manager/Project Manager Wells Fargo October 2000  –  November 2005  (5 years 2 months) E-Business Systems Consultant/Technology Manager/Project Manager Wells Fargo October 2000  –  November 2005  (5 years 2 months) Project Manager Charles Schwab January 2000  –  October 2000  (10 months) Project Manager Charles Schwab January 2000  –  October 2000  (10 months) Project Manager Visa June 1998  –  December 1999  (1 year 7 months) Consulted with the Visa International Treasury department, served as lead contact for the Alliance Partner Members to permanently change FedWire process from Chase Manhattan to Bank of America as the primary Visa settlement financial institution. Coordinated communication to all Alliance Partner Member Banks to document and verify settlement data and destination. Assisted with problem resolution for pre-existing issues effecting the project and Visa.  \nManaged Year 2000 projects between Visa USA and its alliance partners and International Development and served as a member of the project team for the Year 2000 Event Management Center. Supported Alliance Management Department (Visa USA) with their internal readiness for Year 2000. \n \nAccomplishments: \n \n\tDevised a testing plan using existing Year 2000 Proxy test transactions files (TC57 and TC59) saved in the system, resulting in saving Visa over $80,000 to create a testing database \n\tServed as a liaison between alliance partners and Visa to manage all Year 2000 efforts, communicate options, and issues \n\tAssigned to be the project manager for clearing and settlement Year 2000 testing  \n\tProvided assistance to the direct connect merchants and clients of Vital Processing Services Project Manager Visa June 1998  –  December 1999  (1 year 7 months) Consulted with the Visa International Treasury department, served as lead contact for the Alliance Partner Members to permanently change FedWire process from Chase Manhattan to Bank of America as the primary Visa settlement financial institution. Coordinated communication to all Alliance Partner Member Banks to document and verify settlement data and destination. Assisted with problem resolution for pre-existing issues effecting the project and Visa.  \nManaged Year 2000 projects between Visa USA and its alliance partners and International Development and served as a member of the project team for the Year 2000 Event Management Center. Supported Alliance Management Department (Visa USA) with their internal readiness for Year 2000. \n \nAccomplishments: \n \n\tDevised a testing plan using existing Year 2000 Proxy test transactions files (TC57 and TC59) saved in the system, resulting in saving Visa over $80,000 to create a testing database \n\tServed as a liaison between alliance partners and Visa to manage all Year 2000 efforts, communicate options, and issues \n\tAssigned to be the project manager for clearing and settlement Year 2000 testing  \n\tProvided assistance to the direct connect merchants and clients of Vital Processing Services Skills Testing Vendor Management E-commerce Change Management Microstrategy Loyalty Programs Infrastructure Software Documentation PMO Infrastructure Projects SOX Compliancy MicroStrategy Reporting User Acceptance Testing Skills  Testing Vendor Management E-commerce Change Management Microstrategy Loyalty Programs Infrastructure Software Documentation PMO Infrastructure Projects SOX Compliancy MicroStrategy Reporting User Acceptance Testing Testing Vendor Management E-commerce Change Management Microstrategy Loyalty Programs Infrastructure Software Documentation PMO Infrastructure Projects SOX Compliancy MicroStrategy Reporting User Acceptance Testing Testing Vendor Management E-commerce Change Management Microstrategy Loyalty Programs Infrastructure Software Documentation PMO Infrastructure Projects SOX Compliancy MicroStrategy Reporting User Acceptance Testing Education Project Management Medical Project Management Medical Project Management Medical Project Management Medical ", "Experience Senior Regional Project Manager, Display Advertising Yahoo 2014  – Present (1 year) Regional Project Manager, Sales Operations Yahoo 2008  –  2013  (5 years) Business Manager, Cylinder Linde HKO (a member of The Linde Group) 2006  –  2008  (2 years) Product Development Manager Linde HKO (a member of The Linde Group) 2005  –  2006  (1 year) Senior Regional Project Manager, Display Advertising Yahoo 2014  – Present (1 year) Senior Regional Project Manager, Display Advertising Yahoo 2014  – Present (1 year) Regional Project Manager, Sales Operations Yahoo 2008  –  2013  (5 years) Regional Project Manager, Sales Operations Yahoo 2008  –  2013  (5 years) Business Manager, Cylinder Linde HKO (a member of The Linde Group) 2006  –  2008  (2 years) Business Manager, Cylinder Linde HKO (a member of The Linde Group) 2006  –  2008  (2 years) Product Development Manager Linde HKO (a member of The Linde Group) 2005  –  2006  (1 year) Product Development Manager Linde HKO (a member of The Linde Group) 2005  –  2006  (1 year) Skills Cross-functional Team... Product Marketing Analytics Mobile Advertising Web Analytics Product Management New Business Development Management Digital Marketing Product Development Mobile Devices Online Advertising E-commerce Start-ups Strategic Partnerships Strategy Project Management See 2+     See less Skills  Cross-functional Team... Product Marketing Analytics Mobile Advertising Web Analytics Product Management New Business Development Management Digital Marketing Product Development Mobile Devices Online Advertising E-commerce Start-ups Strategic Partnerships Strategy Project Management See 2+     See less Cross-functional Team... Product Marketing Analytics Mobile Advertising Web Analytics Product Management New Business Development Management Digital Marketing Product Development Mobile Devices Online Advertising E-commerce Start-ups Strategic Partnerships Strategy Project Management See 2+     See less Cross-functional Team... Product Marketing Analytics Mobile Advertising Web Analytics Product Management New Business Development Management Digital Marketing Product Development Mobile Devices Online Advertising E-commerce Start-ups Strategic Partnerships Strategy Project Management See 2+     See less Education Diocesan Girls' School University of Auckland Master of Engineering (MEng) University of Auckland Bachelor of Engineering (BE),  Electrical & Electronics Diocesan Girls' School Diocesan Girls' School Diocesan Girls' School University of Auckland Master of Engineering (MEng) University of Auckland Master of Engineering (MEng) University of Auckland Master of Engineering (MEng) University of Auckland Bachelor of Engineering (BE),  Electrical & Electronics University of Auckland Bachelor of Engineering (BE),  Electrical & Electronics University of Auckland Bachelor of Engineering (BE),  Electrical & Electronics ", "Experience Snr Project Manager Nationwide Building Society February 2011  – Present (4 years 7 months) MI Data Warehouse (Tactical) Delivery Snr Project Manager Pelicam February 2011  – Present (4 years 7 months) Project Manager / Solution Architect HP October 2010  –  February 2011  (5 months) Project Manager / Solution Architect Sainsburys Supermarkets Ltd October 2010  –  February 2011  (5 months) Technical Project Manager EA Games June 2010  –  September 2010  (4 months) Helping deliver greenfield warehouse/mart/BI build \"in the cloud\" leveraging Hadoop / Vertica / MicroStrategy Technical Project Manager HP October 2007  –  May 2010  (2 years 8 months) Tech Dev Mgr - EDW Migration Sainsburys 2007  –  May 2010  (3 years) EDW Development Manager (Neo-Sainsbury's) Hewlett-Packard 2007  –  May 2010  (3 years) Project Manager - AbInitio Dev Orange September 2007  –  November 2007  (3 months) Project Manager T-Mobile (UK) April 2007  –  September 2007  (6 months) Project Manager - (NDA applies) PDM, Statistics Yahoo! April 2006  –  October 2006  (7 months) Product Development Manager (Program/Project Mgmt) for redesign and redelivery of statistics gathering / presentation system for Yahoo Marketplace (shopping comparison aka Kelkoo) Technical Project Manager Yahoo December 2005  –  April 2006  (5 months) Project Manager during stabilisation of statistics presentation product subsequent to Kelkoo acquisition by Yahoo Partner Services Manager Kognitio July 2003  –  November 2005  (2 years 5 months) Project, Service Delivery & Account management - database technology, services and support Production Manager WhiteCross Systems ltd 1996  –  2003  (7 years) Production Mangerment of hardware builds of a complex custom datawarehousing product and subsequent deployment / logistics / maintenance projects globally. Production Manager WhiteCross Systems (merged with Kognitio) 1996  –  2003  (7 years) Production Manager WhiteCross 1996  –  2003  (7 years) Production Engineer White Cross Systems 1988  –  1996  (8 years) Enclosure engineering for completely custom rack mounted datawarehouse product. Snr Project Manager Nationwide Building Society February 2011  – Present (4 years 7 months) MI Data Warehouse (Tactical) Delivery Snr Project Manager Nationwide Building Society February 2011  – Present (4 years 7 months) MI Data Warehouse (Tactical) Delivery Snr Project Manager Pelicam February 2011  – Present (4 years 7 months) Snr Project Manager Pelicam February 2011  – Present (4 years 7 months) Project Manager / Solution Architect HP October 2010  –  February 2011  (5 months) Project Manager / Solution Architect HP October 2010  –  February 2011  (5 months) Project Manager / Solution Architect Sainsburys Supermarkets Ltd October 2010  –  February 2011  (5 months) Project Manager / Solution Architect Sainsburys Supermarkets Ltd October 2010  –  February 2011  (5 months) Technical Project Manager EA Games June 2010  –  September 2010  (4 months) Helping deliver greenfield warehouse/mart/BI build \"in the cloud\" leveraging Hadoop / Vertica / MicroStrategy Technical Project Manager EA Games June 2010  –  September 2010  (4 months) Helping deliver greenfield warehouse/mart/BI build \"in the cloud\" leveraging Hadoop / Vertica / MicroStrategy Technical Project Manager HP October 2007  –  May 2010  (2 years 8 months) Technical Project Manager HP October 2007  –  May 2010  (2 years 8 months) Tech Dev Mgr - EDW Migration Sainsburys 2007  –  May 2010  (3 years) Tech Dev Mgr - EDW Migration Sainsburys 2007  –  May 2010  (3 years) EDW Development Manager (Neo-Sainsbury's) Hewlett-Packard 2007  –  May 2010  (3 years) EDW Development Manager (Neo-Sainsbury's) Hewlett-Packard 2007  –  May 2010  (3 years) Project Manager - AbInitio Dev Orange September 2007  –  November 2007  (3 months) Project Manager - AbInitio Dev Orange September 2007  –  November 2007  (3 months) Project Manager T-Mobile (UK) April 2007  –  September 2007  (6 months) Project Manager - (NDA applies) Project Manager T-Mobile (UK) April 2007  –  September 2007  (6 months) Project Manager - (NDA applies) PDM, Statistics Yahoo! April 2006  –  October 2006  (7 months) Product Development Manager (Program/Project Mgmt) for redesign and redelivery of statistics gathering / presentation system for Yahoo Marketplace (shopping comparison aka Kelkoo) PDM, Statistics Yahoo! April 2006  –  October 2006  (7 months) Product Development Manager (Program/Project Mgmt) for redesign and redelivery of statistics gathering / presentation system for Yahoo Marketplace (shopping comparison aka Kelkoo) Technical Project Manager Yahoo December 2005  –  April 2006  (5 months) Project Manager during stabilisation of statistics presentation product subsequent to Kelkoo acquisition by Yahoo Technical Project Manager Yahoo December 2005  –  April 2006  (5 months) Project Manager during stabilisation of statistics presentation product subsequent to Kelkoo acquisition by Yahoo Partner Services Manager Kognitio July 2003  –  November 2005  (2 years 5 months) Project, Service Delivery & Account management - database technology, services and support Partner Services Manager Kognitio July 2003  –  November 2005  (2 years 5 months) Project, Service Delivery & Account management - database technology, services and support Production Manager WhiteCross Systems ltd 1996  –  2003  (7 years) Production Mangerment of hardware builds of a complex custom datawarehousing product and subsequent deployment / logistics / maintenance projects globally. Production Manager WhiteCross Systems ltd 1996  –  2003  (7 years) Production Mangerment of hardware builds of a complex custom datawarehousing product and subsequent deployment / logistics / maintenance projects globally. Production Manager WhiteCross Systems (merged with Kognitio) 1996  –  2003  (7 years) Production Manager WhiteCross Systems (merged with Kognitio) 1996  –  2003  (7 years) Production Manager WhiteCross 1996  –  2003  (7 years) Production Manager WhiteCross 1996  –  2003  (7 years) Production Engineer White Cross Systems 1988  –  1996  (8 years) Enclosure engineering for completely custom rack mounted datawarehouse product. Production Engineer White Cross Systems 1988  –  1996  (8 years) Enclosure engineering for completely custom rack mounted datawarehouse product. Skills Business Intelligence Data Warehouse... Data Modeling Microstrategy Data Warehousing Project Delivery Databases Data Migration Requirements Gathering ETL Cloud Computing Management Requirements Analysis Business Analysis PRINCE2 Service Delivery Program Management Solution Architecture Project Management Data Analysis Software Project... Hadoop SDLC Enterprise Architecture Business Requirements See 10+     See less Skills  Business Intelligence Data Warehouse... Data Modeling Microstrategy Data Warehousing Project Delivery Databases Data Migration Requirements Gathering ETL Cloud Computing Management Requirements Analysis Business Analysis PRINCE2 Service Delivery Program Management Solution Architecture Project Management Data Analysis Software Project... Hadoop SDLC Enterprise Architecture Business Requirements See 10+     See less Business Intelligence Data Warehouse... Data Modeling Microstrategy Data Warehousing Project Delivery Databases Data Migration Requirements Gathering ETL Cloud Computing Management Requirements Analysis Business Analysis PRINCE2 Service Delivery Program Management Solution Architecture Project Management Data Analysis Software Project... Hadoop SDLC Enterprise Architecture Business Requirements See 10+     See less Business Intelligence Data Warehouse... Data Modeling Microstrategy Data Warehousing Project Delivery Databases Data Migration Requirements Gathering ETL Cloud Computing Management Requirements Analysis Business Analysis PRINCE2 Service Delivery Program Management Solution Architecture Project Management Data Analysis Software Project... Hadoop SDLC Enterprise Architecture Business Requirements See 10+     See less Education University of Southbank 1990  – 1992 University of Southbank 1990  – 1992 University of Southbank 1990  – 1992 University of Southbank 1990  – 1992 ", "Summary Head of Data Solution at Yahoo! JAPAN. Extensive knowledge in how to generate value from data, experience in building Data Platform, Metrics Analysis, NLP, and developing search products based on Data Mining. E.g. Related Search Word, Search Word Ranking, Direct Display on Search Result Page, and so on. \n \nMy goal is \nShort-term: To understand user's intent by analyzing their behavior, and to improve web services. \nLong-term: To contribute people's quality of life through web technology. Specialties:- Extensive experience of running cross-functional team. \n- Generating value from huge data stream. \n- Product insight and strong engineering background in telecommunication, computer science, statistics and natural language processing. Summary Head of Data Solution at Yahoo! JAPAN. Extensive knowledge in how to generate value from data, experience in building Data Platform, Metrics Analysis, NLP, and developing search products based on Data Mining. E.g. Related Search Word, Search Word Ranking, Direct Display on Search Result Page, and so on. \n \nMy goal is \nShort-term: To understand user's intent by analyzing their behavior, and to improve web services. \nLong-term: To contribute people's quality of life through web technology. Specialties:- Extensive experience of running cross-functional team. \n- Generating value from huge data stream. \n- Product insight and strong engineering background in telecommunication, computer science, statistics and natural language processing. Head of Data Solution at Yahoo! JAPAN. Extensive knowledge in how to generate value from data, experience in building Data Platform, Metrics Analysis, NLP, and developing search products based on Data Mining. E.g. Related Search Word, Search Word Ranking, Direct Display on Search Result Page, and so on. \n \nMy goal is \nShort-term: To understand user's intent by analyzing their behavior, and to improve web services. \nLong-term: To contribute people's quality of life through web technology. Specialties:- Extensive experience of running cross-functional team. \n- Generating value from huge data stream. \n- Product insight and strong engineering background in telecommunication, computer science, statistics and natural language processing. Head of Data Solution at Yahoo! JAPAN. Extensive knowledge in how to generate value from data, experience in building Data Platform, Metrics Analysis, NLP, and developing search products based on Data Mining. E.g. Related Search Word, Search Word Ranking, Direct Display on Search Result Page, and so on. \n \nMy goal is \nShort-term: To understand user's intent by analyzing their behavior, and to improve web services. \nLong-term: To contribute people's quality of life through web technology. Specialties:- Extensive experience of running cross-functional team. \n- Generating value from huge data stream. \n- Product insight and strong engineering background in telecommunication, computer science, statistics and natural language processing. Experience Vice President, Data Solutions Yahoo! JAPAN October 2012  – Present (2 years 11 months) General Manager, Data Solutions Yahoo! JAPAN October 2011  –  September 2012  (1 year) Senior Product Manager, Search Yahoo! JAPAN October 2010  –  September 2011  (1 year) Engineering Manager, Data Solution, Search Yahoo! JAPAN July 2006  –  December 2010  (4 years 6 months) Senior Product Manager, Data Solution, Search Yahoo! JAPAN April 2009  –  June 2010  (1 year 3 months) Researcher Kyoto University April 2008  –  March 2010  (2 years) Part-time Teacher Tokyo Institute of Technology April 2008  –  March 2009  (1 year) Product Manager, Data Solution, Search Yahoo! JAPAN July 2007  –  March 2009  (1 year 9 months) Part-time Teacher Waseda University April 2006  –  March 2009  (3 years) Project Manager, Data Solution, Search Yahoo! JAPAN July 2006  –  June 2007  (1 year) Researcher, Data Solution, Search Yahoo! JAPAN April 2004  –  June 2006  (2 years 3 months) Engineer Yahoo! JAPAN April 2002  –  March 2004  (2 years) Vice President, Data Solutions Yahoo! JAPAN October 2012  – Present (2 years 11 months) Vice President, Data Solutions Yahoo! JAPAN October 2012  – Present (2 years 11 months) General Manager, Data Solutions Yahoo! JAPAN October 2011  –  September 2012  (1 year) General Manager, Data Solutions Yahoo! JAPAN October 2011  –  September 2012  (1 year) Senior Product Manager, Search Yahoo! JAPAN October 2010  –  September 2011  (1 year) Senior Product Manager, Search Yahoo! JAPAN October 2010  –  September 2011  (1 year) Engineering Manager, Data Solution, Search Yahoo! JAPAN July 2006  –  December 2010  (4 years 6 months) Engineering Manager, Data Solution, Search Yahoo! JAPAN July 2006  –  December 2010  (4 years 6 months) Senior Product Manager, Data Solution, Search Yahoo! JAPAN April 2009  –  June 2010  (1 year 3 months) Senior Product Manager, Data Solution, Search Yahoo! JAPAN April 2009  –  June 2010  (1 year 3 months) Researcher Kyoto University April 2008  –  March 2010  (2 years) Researcher Kyoto University April 2008  –  March 2010  (2 years) Part-time Teacher Tokyo Institute of Technology April 2008  –  March 2009  (1 year) Part-time Teacher Tokyo Institute of Technology April 2008  –  March 2009  (1 year) Product Manager, Data Solution, Search Yahoo! JAPAN July 2007  –  March 2009  (1 year 9 months) Product Manager, Data Solution, Search Yahoo! JAPAN July 2007  –  March 2009  (1 year 9 months) Part-time Teacher Waseda University April 2006  –  March 2009  (3 years) Part-time Teacher Waseda University April 2006  –  March 2009  (3 years) Project Manager, Data Solution, Search Yahoo! JAPAN July 2006  –  June 2007  (1 year) Project Manager, Data Solution, Search Yahoo! JAPAN July 2006  –  June 2007  (1 year) Researcher, Data Solution, Search Yahoo! JAPAN April 2004  –  June 2006  (2 years 3 months) Researcher, Data Solution, Search Yahoo! JAPAN April 2004  –  June 2006  (2 years 3 months) Engineer Yahoo! JAPAN April 2002  –  March 2004  (2 years) Engineer Yahoo! JAPAN April 2002  –  March 2004  (2 years) Education Waseda University BS,  Information Science 1998  – 2002 Waseda University BS,  Information Science 1998  – 2002 Waseda University BS,  Information Science 1998  – 2002 Waseda University BS,  Information Science 1998  – 2002 ", "Summary Experienced web and television project manager with a proven background in product development. Consistently leads teams to a successful completion of all projects and incentives. Goal-oriented multi-tasker who strives in an ambitious, driven environment with diverse team members. Effortlessly manages multiple projects, teams and clients without losing focus or integrity of intention. Dedicated professional, who is skilled in problem solving and troubleshooting and continually delivers projects at levels exceeding all expectations. Specialties:Scrum, MS Project Summary Experienced web and television project manager with a proven background in product development. Consistently leads teams to a successful completion of all projects and incentives. Goal-oriented multi-tasker who strives in an ambitious, driven environment with diverse team members. Effortlessly manages multiple projects, teams and clients without losing focus or integrity of intention. Dedicated professional, who is skilled in problem solving and troubleshooting and continually delivers projects at levels exceeding all expectations. Specialties:Scrum, MS Project Experienced web and television project manager with a proven background in product development. Consistently leads teams to a successful completion of all projects and incentives. Goal-oriented multi-tasker who strives in an ambitious, driven environment with diverse team members. Effortlessly manages multiple projects, teams and clients without losing focus or integrity of intention. Dedicated professional, who is skilled in problem solving and troubleshooting and continually delivers projects at levels exceeding all expectations. Specialties:Scrum, MS Project Experienced web and television project manager with a proven background in product development. Consistently leads teams to a successful completion of all projects and incentives. Goal-oriented multi-tasker who strives in an ambitious, driven environment with diverse team members. Effortlessly manages multiple projects, teams and clients without losing focus or integrity of intention. Dedicated professional, who is skilled in problem solving and troubleshooting and continually delivers projects at levels exceeding all expectations. Specialties:Scrum, MS Project Experience Project Manager Fandango January 2013  – Present (2 years 8 months) Santa Monica, Ca Project Manager Cornerstone OnDemand January 2013  – Present (2 years 8 months) Santa Monica, CA Sr. Technical Project Manager AXS.com /AEG Digital January 2012  –  May 2012  (5 months) Sr. Technical Project Manager AT&T Interactive November 2009  –  January 2012  (2 years 3 months) Los Angeles, Ca Sr. Interactive Project Manager Los Angeles Times February 2007  –  October 2009  (2 years 9 months) Sr. Project Manager Tribune Interactive February 2007  –  October 2009  (2 years 9 months) Product Manager Citysearch June 2005  –  July 2006  (1 year 2 months) Project Manager The Tuesday Group, Inc March 2004  –  June 2005  (1 year 4 months) Project Manager Yahoo! Music March 2002  –  February 2004  (2 years) Project Manager Clear Channel Interactive August 2000  –  February 2002  (1 year 7 months) Associate Producer VH1 - Behind the Music May 1998  –  August 2000  (2 years 4 months) Associate Producer MTV Networks 1997  –  1999  (2 years) Researcher Sony Online Entertainment May 1997  –  May 1998  (1 year 1 month) researcher MTV 1995  –  1998  (3 years) Project Manager Fandango January 2013  – Present (2 years 8 months) Santa Monica, Ca Project Manager Fandango January 2013  – Present (2 years 8 months) Santa Monica, Ca Project Manager Cornerstone OnDemand January 2013  – Present (2 years 8 months) Santa Monica, CA Project Manager Cornerstone OnDemand January 2013  – Present (2 years 8 months) Santa Monica, CA Sr. Technical Project Manager AXS.com /AEG Digital January 2012  –  May 2012  (5 months) Sr. Technical Project Manager AXS.com /AEG Digital January 2012  –  May 2012  (5 months) Sr. Technical Project Manager AT&T Interactive November 2009  –  January 2012  (2 years 3 months) Los Angeles, Ca Sr. Technical Project Manager AT&T Interactive November 2009  –  January 2012  (2 years 3 months) Los Angeles, Ca Sr. Interactive Project Manager Los Angeles Times February 2007  –  October 2009  (2 years 9 months) Sr. Interactive Project Manager Los Angeles Times February 2007  –  October 2009  (2 years 9 months) Sr. Project Manager Tribune Interactive February 2007  –  October 2009  (2 years 9 months) Sr. Project Manager Tribune Interactive February 2007  –  October 2009  (2 years 9 months) Product Manager Citysearch June 2005  –  July 2006  (1 year 2 months) Product Manager Citysearch June 2005  –  July 2006  (1 year 2 months) Project Manager The Tuesday Group, Inc March 2004  –  June 2005  (1 year 4 months) Project Manager The Tuesday Group, Inc March 2004  –  June 2005  (1 year 4 months) Project Manager Yahoo! Music March 2002  –  February 2004  (2 years) Project Manager Yahoo! Music March 2002  –  February 2004  (2 years) Project Manager Clear Channel Interactive August 2000  –  February 2002  (1 year 7 months) Project Manager Clear Channel Interactive August 2000  –  February 2002  (1 year 7 months) Associate Producer VH1 - Behind the Music May 1998  –  August 2000  (2 years 4 months) Associate Producer VH1 - Behind the Music May 1998  –  August 2000  (2 years 4 months) Associate Producer MTV Networks 1997  –  1999  (2 years) Associate Producer MTV Networks 1997  –  1999  (2 years) Researcher Sony Online Entertainment May 1997  –  May 1998  (1 year 1 month) Researcher Sony Online Entertainment May 1997  –  May 1998  (1 year 1 month) researcher MTV 1995  –  1998  (3 years) researcher MTV 1995  –  1998  (3 years) Skills Scrum Microsoft Excel Atlassian JIRA Confluence Redmine Basecamp Rally Web Content Management Web Development Mobile Applications Mobile Platforms Marketing Management Microsoft Office MS Project Bugzilla Bug Tracking RT API OmniPlan Omniture Visio Google Docs Cross-functional Team... APIs Program Management Strategy Creative Direction Digital Marketing Advertising New Media Project Management Web Analytics See 17+     See less Skills  Scrum Microsoft Excel Atlassian JIRA Confluence Redmine Basecamp Rally Web Content Management Web Development Mobile Applications Mobile Platforms Marketing Management Microsoft Office MS Project Bugzilla Bug Tracking RT API OmniPlan Omniture Visio Google Docs Cross-functional Team... APIs Program Management Strategy Creative Direction Digital Marketing Advertising New Media Project Management Web Analytics See 17+     See less Scrum Microsoft Excel Atlassian JIRA Confluence Redmine Basecamp Rally Web Content Management Web Development Mobile Applications Mobile Platforms Marketing Management Microsoft Office MS Project Bugzilla Bug Tracking RT API OmniPlan Omniture Visio Google Docs Cross-functional Team... APIs Program Management Strategy Creative Direction Digital Marketing Advertising New Media Project Management Web Analytics See 17+     See less Scrum Microsoft Excel Atlassian JIRA Confluence Redmine Basecamp Rally Web Content Management Web Development Mobile Applications Mobile Platforms Marketing Management Microsoft Office MS Project Bugzilla Bug Tracking RT API OmniPlan Omniture Visio Google Docs Cross-functional Team... APIs Program Management Strategy Creative Direction Digital Marketing Advertising New Media Project Management Web Analytics See 17+     See less Education University of Southern California Bachelor of Arts (BA),  Communication , General University of Southern California Bachelor of Arts (BA),  Communication , General University of Southern California Bachelor of Arts (BA),  Communication , General University of Southern California Bachelor of Arts (BA),  Communication , General Honors & Awards Additional Honors & Awards WEB MARKETING ASSOCIATION  \n2004 WEBAWARD  \nFOR OUTSTANDING ACHIEVEMENT IN WEBSITE DEVELOPMENT \nhttp://www.webaward.org/winner.asp?eid=1514 Additional Honors & Awards WEB MARKETING ASSOCIATION  \n2004 WEBAWARD  \nFOR OUTSTANDING ACHIEVEMENT IN WEBSITE DEVELOPMENT \nhttp://www.webaward.org/winner.asp?eid=1514 Additional Honors & Awards WEB MARKETING ASSOCIATION  \n2004 WEBAWARD  \nFOR OUTSTANDING ACHIEVEMENT IN WEBSITE DEVELOPMENT \nhttp://www.webaward.org/winner.asp?eid=1514 Additional Honors & Awards WEB MARKETING ASSOCIATION  \n2004 WEBAWARD  \nFOR OUTSTANDING ACHIEVEMENT IN WEBSITE DEVELOPMENT \nhttp://www.webaward.org/winner.asp?eid=1514 "]}