{"position": "QA Analyst - Hourly Contractor", "company": "Google", "profiles": ["Experience Senior Director of User Research Salesforce June 2015  – Present (3 months) San Francisco Bay Area Associate Professor IT University of Copenhagen January 2011  – Present (4 years 8 months) Senior Design Research Manager Microsoft July 2013  –  May 2015  (1 year 11 months) Greater Seattle Area Assistant Professor University of Twente October 2008  –  September 2010  (2 years) Consulting Researcher Microsoft Research July 2010  –  August 2010  (2 months) Lead User Researcher Sun Microsystems, Inc 2004  –  2009  (5 years) Lecturer, Department of Sociology UC Berkeley August 2007  –  December 2007  (5 months) User Experience Researcher Productopia January 1999  –  July 2000  (1 year 7 months) Online Consultant Stand for Children January 1996  –  June 1998  (2 years 6 months) Registration Coordinator NGO Forum on Women '95, Beijing June 1994  –  December 1995  (1 year 7 months) Conference Organizer Amnesty International USA January 1994  –  June 1995  (1 year 6 months) Senior Director of User Research Salesforce June 2015  – Present (3 months) San Francisco Bay Area Senior Director of User Research Salesforce June 2015  – Present (3 months) San Francisco Bay Area Associate Professor IT University of Copenhagen January 2011  – Present (4 years 8 months) Associate Professor IT University of Copenhagen January 2011  – Present (4 years 8 months) Senior Design Research Manager Microsoft July 2013  –  May 2015  (1 year 11 months) Greater Seattle Area Senior Design Research Manager Microsoft July 2013  –  May 2015  (1 year 11 months) Greater Seattle Area Assistant Professor University of Twente October 2008  –  September 2010  (2 years) Assistant Professor University of Twente October 2008  –  September 2010  (2 years) Consulting Researcher Microsoft Research July 2010  –  August 2010  (2 months) Consulting Researcher Microsoft Research July 2010  –  August 2010  (2 months) Lead User Researcher Sun Microsystems, Inc 2004  –  2009  (5 years) Lead User Researcher Sun Microsystems, Inc 2004  –  2009  (5 years) Lecturer, Department of Sociology UC Berkeley August 2007  –  December 2007  (5 months) Lecturer, Department of Sociology UC Berkeley August 2007  –  December 2007  (5 months) User Experience Researcher Productopia January 1999  –  July 2000  (1 year 7 months) User Experience Researcher Productopia January 1999  –  July 2000  (1 year 7 months) Online Consultant Stand for Children January 1996  –  June 1998  (2 years 6 months) Online Consultant Stand for Children January 1996  –  June 1998  (2 years 6 months) Registration Coordinator NGO Forum on Women '95, Beijing June 1994  –  December 1995  (1 year 7 months) Registration Coordinator NGO Forum on Women '95, Beijing June 1994  –  December 1995  (1 year 7 months) Conference Organizer Amnesty International USA January 1994  –  June 1995  (1 year 6 months) Conference Organizer Amnesty International USA January 1994  –  June 1995  (1 year 6 months) Languages Dutch Dutch Dutch Skills Ethnography Qualitative Research Human Computer... Research Design User-centered Design Usability Testing Research Statistics SPSS Focus Groups Teaching User Experience Higher Education University Teaching Quantitative Research User Research Survey Research Sociology See 3+     See less Skills  Ethnography Qualitative Research Human Computer... Research Design User-centered Design Usability Testing Research Statistics SPSS Focus Groups Teaching User Experience Higher Education University Teaching Quantitative Research User Research Survey Research Sociology See 3+     See less Ethnography Qualitative Research Human Computer... Research Design User-centered Design Usability Testing Research Statistics SPSS Focus Groups Teaching User Experience Higher Education University Teaching Quantitative Research User Research Survey Research Sociology See 3+     See less Ethnography Qualitative Research Human Computer... Research Design User-centered Design Usability Testing Research Statistics SPSS Focus Groups Teaching User Experience Higher Education University Teaching Quantitative Research User Research Survey Research Sociology See 3+     See less Education University of California, Berkeley Ph.D.,  Sociology 1996  – 2007 Dissertation: Living Like Me: Lifestyle, Social Stratification and Technology Harvard University B.A.,  Social Studies , Women's Studies 1988  – 1992 Academy of the Sacred Heart 1984  – 1988 University of California, Berkeley Ph.D.,  Sociology 1996  – 2007 Dissertation: Living Like Me: Lifestyle, Social Stratification and Technology University of California, Berkeley Ph.D.,  Sociology 1996  – 2007 Dissertation: Living Like Me: Lifestyle, Social Stratification and Technology University of California, Berkeley Ph.D.,  Sociology 1996  – 2007 Dissertation: Living Like Me: Lifestyle, Social Stratification and Technology Harvard University B.A.,  Social Studies , Women's Studies 1988  – 1992 Harvard University B.A.,  Social Studies , Women's Studies 1988  – 1992 Harvard University B.A.,  Social Studies , Women's Studies 1988  – 1992 Academy of the Sacred Heart 1984  – 1988 Academy of the Sacred Heart 1984  – 1988 Academy of the Sacred Heart 1984  – 1988 ", "Skills Human Factors Human Computer... Usability Testing Xbox 360 Management Video Games Statistics User Interface Research User Interface Design Heuristic Evaluation Paper Prototyping Interactive... User Experience User Research Mobile Devices Card Sorting Agile Methodologies Data Analysis User-centered Design Leadership Usability Engineering Task Analysis Persona User Scenarios Cross-platform... Xbox Contextual Inquiry See 13+     See less Skills  Human Factors Human Computer... Usability Testing Xbox 360 Management Video Games Statistics User Interface Research User Interface Design Heuristic Evaluation Paper Prototyping Interactive... User Experience User Research Mobile Devices Card Sorting Agile Methodologies Data Analysis User-centered Design Leadership Usability Engineering Task Analysis Persona User Scenarios Cross-platform... Xbox Contextual Inquiry See 13+     See less Human Factors Human Computer... Usability Testing Xbox 360 Management Video Games Statistics User Interface Research User Interface Design Heuristic Evaluation Paper Prototyping Interactive... User Experience User Research Mobile Devices Card Sorting Agile Methodologies Data Analysis User-centered Design Leadership Usability Engineering Task Analysis Persona User Scenarios Cross-platform... Xbox Contextual Inquiry See 13+     See less Human Factors Human Computer... Usability Testing Xbox 360 Management Video Games Statistics User Interface Research User Interface Design Heuristic Evaluation Paper Prototyping Interactive... User Experience User Research Mobile Devices Card Sorting Agile Methodologies Data Analysis User-centered Design Leadership Usability Engineering Task Analysis Persona User Scenarios Cross-platform... Xbox Contextual Inquiry See 13+     See less Honors & Awards ", "Summary User-centered design advocate, mentor, and passionate leader with a mixed background in design, web development, research, and testing.  \n \nExperience partnering with multidisciplinary teams through the user-centered design process to identify customer needs throughout all stages of product development from needs finding, ideation and concept evaluation, through iterative design, testing, and evaluation post launch.  Summary User-centered design advocate, mentor, and passionate leader with a mixed background in design, web development, research, and testing.  \n \nExperience partnering with multidisciplinary teams through the user-centered design process to identify customer needs throughout all stages of product development from needs finding, ideation and concept evaluation, through iterative design, testing, and evaluation post launch.  User-centered design advocate, mentor, and passionate leader with a mixed background in design, web development, research, and testing.  \n \nExperience partnering with multidisciplinary teams through the user-centered design process to identify customer needs throughout all stages of product development from needs finding, ideation and concept evaluation, through iterative design, testing, and evaluation post launch.  User-centered design advocate, mentor, and passionate leader with a mixed background in design, web development, research, and testing.  \n \nExperience partnering with multidisciplinary teams through the user-centered design process to identify customer needs throughout all stages of product development from needs finding, ideation and concept evaluation, through iterative design, testing, and evaluation post launch.  Experience Director of User Research Anthro-Tech, Inc. April 2014  – Present (1 year 5 months) Greater Seattle Area At Anthro-Tech I work with a brilliant team of designers, researchers, and consultants to build user-centered design solutions that make our clients successful and their customers happy.  \n \n• Mentor and support research team, with a focus on career growth and skill building \n• Collaborate with clients to ensure that designs reflect both business and user needs \n• Lead strategy, planning, and specifics for various forms of design research and usability efforts \n• Support product initiatives from the discovery phase through mockups and implementation \n• Facilitate workshops in Design Thinking, Writing for the Web, and UX Intensive \n Affiliate Faculty University of Washington, Department of Human Centered Design and Engineering January 2012  – Present (3 years 8 months) Greater Seattle Area Design coursework, prepare lectures, facilitate workshops, and mentor graduate students in topics of user-centered design. Past courses have included User Centered Design, Usability Testing, User Centered Design for the Web, Interaction Design, and pilot of the Graduate Capstone. Sr. UX Researcher Nordstrom Direct September 2011  –  April 2014  (2 years 8 months) Greater Seattle Area • Work with inter-disciplinary teams across the product cycle from user needs and concept evaluation, through iterative design and validation testing.  \n \n• Perform heuristic evaluations and cognitive walk-throughs to ensure site health and identify new opportunities for user experience improvements.  \n \n• Identify research methodology best suited for addressing test objectives (in lab, guerilla, remote, paper-prototype testing, participatory design). \n \n• Design and conduct cross-platform usability testing for eCommerce websites, mobile applications, and mobile Internet sites.  \n \n• Analyze both qualitative and quantitative data to illuminate underlying usability problems and deliver recommendations to stakeholders. Sr. Web Developer and Usability Consultant Group Health Cooperative December 2005  –  September 2011  (5 years 10 months) • Apply user-centered design principles to design and develop Intranet solutions that improve task efficiency and satisfaction. Lead user requirements and consult on usability improvements for web-based learning classes, and digital applications.  \n \n• Apply user research methods (focus groups, field studies, paper-prototyping, card sorting, heuristic evaluations, task analysis, surveys, etc.) to obtain both quantitative and qualitative data used to discover user requirements and best practices.  \n \n• Consult with stakeholders to define web requirements, usability needs, and solutions for their digital needs.  \n \n• Mentor web developers by assisting in troubleshooting programming problems; consult for technical solutions and adherence to industry usability standards, and assist in skill development.  \n \n• Continually evaluate web processes to provide recommendations for improvement focused on the user experience. Web Designer/Graphic Artist Freelance 2002  –  September 2011  (9 years) Clients: Ptarmigan Willow, Honeysuckle Rose Cottages, HauteFoodie, Doe Bay Resort & Retreat, Three Dollar Bill Cinema, What Not to Read, Orcas Events, Cirrus Acupuncture, Feng Shui Design Seattle Web Developer Group Health Cooperative March 2004  –  December 2005  (1 year 10 months) • Develop department/division internal websites. \n \n• Assist clients in defining Web requirements and solutions for Web-based projects. \n \n• Consult with content providers to ensure appropriate and updated content, translates print products to Web, links functioning properly, removes out-of-date material, provides easy to navigate Web pages and create new applications Director of User Research Anthro-Tech, Inc. April 2014  – Present (1 year 5 months) Greater Seattle Area At Anthro-Tech I work with a brilliant team of designers, researchers, and consultants to build user-centered design solutions that make our clients successful and their customers happy.  \n \n• Mentor and support research team, with a focus on career growth and skill building \n• Collaborate with clients to ensure that designs reflect both business and user needs \n• Lead strategy, planning, and specifics for various forms of design research and usability efforts \n• Support product initiatives from the discovery phase through mockups and implementation \n• Facilitate workshops in Design Thinking, Writing for the Web, and UX Intensive \n Director of User Research Anthro-Tech, Inc. April 2014  – Present (1 year 5 months) Greater Seattle Area At Anthro-Tech I work with a brilliant team of designers, researchers, and consultants to build user-centered design solutions that make our clients successful and their customers happy.  \n \n• Mentor and support research team, with a focus on career growth and skill building \n• Collaborate with clients to ensure that designs reflect both business and user needs \n• Lead strategy, planning, and specifics for various forms of design research and usability efforts \n• Support product initiatives from the discovery phase through mockups and implementation \n• Facilitate workshops in Design Thinking, Writing for the Web, and UX Intensive \n Affiliate Faculty University of Washington, Department of Human Centered Design and Engineering January 2012  – Present (3 years 8 months) Greater Seattle Area Design coursework, prepare lectures, facilitate workshops, and mentor graduate students in topics of user-centered design. Past courses have included User Centered Design, Usability Testing, User Centered Design for the Web, Interaction Design, and pilot of the Graduate Capstone. Affiliate Faculty University of Washington, Department of Human Centered Design and Engineering January 2012  – Present (3 years 8 months) Greater Seattle Area Design coursework, prepare lectures, facilitate workshops, and mentor graduate students in topics of user-centered design. Past courses have included User Centered Design, Usability Testing, User Centered Design for the Web, Interaction Design, and pilot of the Graduate Capstone. Sr. UX Researcher Nordstrom Direct September 2011  –  April 2014  (2 years 8 months) Greater Seattle Area • Work with inter-disciplinary teams across the product cycle from user needs and concept evaluation, through iterative design and validation testing.  \n \n• Perform heuristic evaluations and cognitive walk-throughs to ensure site health and identify new opportunities for user experience improvements.  \n \n• Identify research methodology best suited for addressing test objectives (in lab, guerilla, remote, paper-prototype testing, participatory design). \n \n• Design and conduct cross-platform usability testing for eCommerce websites, mobile applications, and mobile Internet sites.  \n \n• Analyze both qualitative and quantitative data to illuminate underlying usability problems and deliver recommendations to stakeholders. Sr. UX Researcher Nordstrom Direct September 2011  –  April 2014  (2 years 8 months) Greater Seattle Area • Work with inter-disciplinary teams across the product cycle from user needs and concept evaluation, through iterative design and validation testing.  \n \n• Perform heuristic evaluations and cognitive walk-throughs to ensure site health and identify new opportunities for user experience improvements.  \n \n• Identify research methodology best suited for addressing test objectives (in lab, guerilla, remote, paper-prototype testing, participatory design). \n \n• Design and conduct cross-platform usability testing for eCommerce websites, mobile applications, and mobile Internet sites.  \n \n• Analyze both qualitative and quantitative data to illuminate underlying usability problems and deliver recommendations to stakeholders. Sr. Web Developer and Usability Consultant Group Health Cooperative December 2005  –  September 2011  (5 years 10 months) • Apply user-centered design principles to design and develop Intranet solutions that improve task efficiency and satisfaction. Lead user requirements and consult on usability improvements for web-based learning classes, and digital applications.  \n \n• Apply user research methods (focus groups, field studies, paper-prototyping, card sorting, heuristic evaluations, task analysis, surveys, etc.) to obtain both quantitative and qualitative data used to discover user requirements and best practices.  \n \n• Consult with stakeholders to define web requirements, usability needs, and solutions for their digital needs.  \n \n• Mentor web developers by assisting in troubleshooting programming problems; consult for technical solutions and adherence to industry usability standards, and assist in skill development.  \n \n• Continually evaluate web processes to provide recommendations for improvement focused on the user experience. Sr. Web Developer and Usability Consultant Group Health Cooperative December 2005  –  September 2011  (5 years 10 months) • Apply user-centered design principles to design and develop Intranet solutions that improve task efficiency and satisfaction. Lead user requirements and consult on usability improvements for web-based learning classes, and digital applications.  \n \n• Apply user research methods (focus groups, field studies, paper-prototyping, card sorting, heuristic evaluations, task analysis, surveys, etc.) to obtain both quantitative and qualitative data used to discover user requirements and best practices.  \n \n• Consult with stakeholders to define web requirements, usability needs, and solutions for their digital needs.  \n \n• Mentor web developers by assisting in troubleshooting programming problems; consult for technical solutions and adherence to industry usability standards, and assist in skill development.  \n \n• Continually evaluate web processes to provide recommendations for improvement focused on the user experience. Web Designer/Graphic Artist Freelance 2002  –  September 2011  (9 years) Clients: Ptarmigan Willow, Honeysuckle Rose Cottages, HauteFoodie, Doe Bay Resort & Retreat, Three Dollar Bill Cinema, What Not to Read, Orcas Events, Cirrus Acupuncture, Feng Shui Design Seattle Web Designer/Graphic Artist Freelance 2002  –  September 2011  (9 years) Clients: Ptarmigan Willow, Honeysuckle Rose Cottages, HauteFoodie, Doe Bay Resort & Retreat, Three Dollar Bill Cinema, What Not to Read, Orcas Events, Cirrus Acupuncture, Feng Shui Design Seattle Web Developer Group Health Cooperative March 2004  –  December 2005  (1 year 10 months) • Develop department/division internal websites. \n \n• Assist clients in defining Web requirements and solutions for Web-based projects. \n \n• Consult with content providers to ensure appropriate and updated content, translates print products to Web, links functioning properly, removes out-of-date material, provides easy to navigate Web pages and create new applications Web Developer Group Health Cooperative March 2004  –  December 2005  (1 year 10 months) • Develop department/division internal websites. \n \n• Assist clients in defining Web requirements and solutions for Web-based projects. \n \n• Consult with content providers to ensure appropriate and updated content, translates print products to Web, links functioning properly, removes out-of-date material, provides easy to navigate Web pages and create new applications Skills User-centered Design User Experience Usability Testing Usability User Research Heuristic Evaluation Axure Dreamweaver HTML JavaScript Wireframes Information Design Task Analysis Information Architecture Card Sorting Persona Interaction Design Contextual Inquiry Wire Framing Web Design E-commerce User Scenarios User Interface Design Mobile Applications User Interface Focus Groups User Experience Design Participatory Design Paper Prototyping Human Computer... Usability Engineering Web Applications Mobile Design Iterative Design Ethnography Survey Design Rapid Prototyping Accessibility Visual Design Experience Design Data Visualization Taxonomy Human Factors Content Strategy Persona Creation Storyboarding Design Thinking Axure RP See 33+     See less Skills  User-centered Design User Experience Usability Testing Usability User Research Heuristic Evaluation Axure Dreamweaver HTML JavaScript Wireframes Information Design Task Analysis Information Architecture Card Sorting Persona Interaction Design Contextual Inquiry Wire Framing Web Design E-commerce User Scenarios User Interface Design Mobile Applications User Interface Focus Groups User Experience Design Participatory Design Paper Prototyping Human Computer... Usability Engineering Web Applications Mobile Design Iterative Design Ethnography Survey Design Rapid Prototyping Accessibility Visual Design Experience Design Data Visualization Taxonomy Human Factors Content Strategy Persona Creation Storyboarding Design Thinking Axure RP See 33+     See less User-centered Design User Experience Usability Testing Usability User Research Heuristic Evaluation Axure Dreamweaver HTML JavaScript Wireframes Information Design Task Analysis Information Architecture Card Sorting Persona Interaction Design Contextual Inquiry Wire Framing Web Design E-commerce User Scenarios User Interface Design Mobile Applications User Interface Focus Groups User Experience Design Participatory Design Paper Prototyping Human Computer... Usability Engineering Web Applications Mobile Design Iterative Design Ethnography Survey Design Rapid Prototyping Accessibility Visual Design Experience Design Data Visualization Taxonomy Human Factors Content Strategy Persona Creation Storyboarding Design Thinking Axure RP See 33+     See less User-centered Design User Experience Usability Testing Usability User Research Heuristic Evaluation Axure Dreamweaver HTML JavaScript Wireframes Information Design Task Analysis Information Architecture Card Sorting Persona Interaction Design Contextual Inquiry Wire Framing Web Design E-commerce User Scenarios User Interface Design Mobile Applications User Interface Focus Groups User Experience Design Participatory Design Paper Prototyping Human Computer... Usability Engineering Web Applications Mobile Design Iterative Design Ethnography Survey Design Rapid Prototyping Accessibility Visual Design Experience Design Data Visualization Taxonomy Human Factors Content Strategy Persona Creation Storyboarding Design Thinking Axure RP See 33+     See less Education University of Washington M.S,  Human Centered Design & Engineering 2010  – 2011 Completed course work in user-centered design, usability testing, communications, international localization, empirical traditions in human centered design, information design, theory, experimental research methods, and user-centered web design. University of Washington Master Certification,  User-Centered Design 2010  – 2011 University of Washington Bachelor of Art,  Interdisciplinary Visual Arts ,  Printmaking 2006  – 2008 Completed coursework in design, printmaking, and art history. University of Washington M.S,  Human Centered Design & Engineering 2010  – 2011 Completed course work in user-centered design, usability testing, communications, international localization, empirical traditions in human centered design, information design, theory, experimental research methods, and user-centered web design. University of Washington M.S,  Human Centered Design & Engineering 2010  – 2011 Completed course work in user-centered design, usability testing, communications, international localization, empirical traditions in human centered design, information design, theory, experimental research methods, and user-centered web design. University of Washington M.S,  Human Centered Design & Engineering 2010  – 2011 Completed course work in user-centered design, usability testing, communications, international localization, empirical traditions in human centered design, information design, theory, experimental research methods, and user-centered web design. University of Washington Master Certification,  User-Centered Design 2010  – 2011 University of Washington Master Certification,  User-Centered Design 2010  – 2011 University of Washington Master Certification,  User-Centered Design 2010  – 2011 University of Washington Bachelor of Art,  Interdisciplinary Visual Arts ,  Printmaking 2006  – 2008 Completed coursework in design, printmaking, and art history. University of Washington Bachelor of Art,  Interdisciplinary Visual Arts ,  Printmaking 2006  – 2008 Completed coursework in design, printmaking, and art history. University of Washington Bachelor of Art,  Interdisciplinary Visual Arts ,  Printmaking 2006  – 2008 Completed coursework in design, printmaking, and art history. Honors & Awards Best Process Nordstrom's Innovation Bootcamp 2013 Our team won Best Process at Nordstrom's Innovation Bootcamp - a 2-day Design Thinking intensive. Q2 2012 Spotlight Award Nordstrom Direct January 2012 Received for exemplary service. Best Process Nordstrom's Innovation Bootcamp 2013 Our team won Best Process at Nordstrom's Innovation Bootcamp - a 2-day Design Thinking intensive. Best Process Nordstrom's Innovation Bootcamp 2013 Our team won Best Process at Nordstrom's Innovation Bootcamp - a 2-day Design Thinking intensive. Best Process Nordstrom's Innovation Bootcamp 2013 Our team won Best Process at Nordstrom's Innovation Bootcamp - a 2-day Design Thinking intensive. Q2 2012 Spotlight Award Nordstrom Direct January 2012 Received for exemplary service. Q2 2012 Spotlight Award Nordstrom Direct January 2012 Received for exemplary service. Q2 2012 Spotlight Award Nordstrom Direct January 2012 Received for exemplary service. ", "Summary International expert on the mechanisms of human interaction with the visual world.  \n \nI have accumulated 15+ years of experience from top notch academic centers around the world before taking the challenge of understanding how users will approach the future of computing: augmented reality.  \n \nMy current goal is to shift the paradigm for user research by blending the robustness of the scientific methods with the agility of the product development in the high tech industry in order to achieve unprecedented quality of data driven business decision.  \n \nMy skills cover the entire pipeline of research, from the understanding of the product need -business, hardware & software-, to the design and implementation of the test, data analysis, visualization and dissemination of the results in the form of direct guidelines to the relevant teams. Summary International expert on the mechanisms of human interaction with the visual world.  \n \nI have accumulated 15+ years of experience from top notch academic centers around the world before taking the challenge of understanding how users will approach the future of computing: augmented reality.  \n \nMy current goal is to shift the paradigm for user research by blending the robustness of the scientific methods with the agility of the product development in the high tech industry in order to achieve unprecedented quality of data driven business decision.  \n \nMy skills cover the entire pipeline of research, from the understanding of the product need -business, hardware & software-, to the design and implementation of the test, data analysis, visualization and dissemination of the results in the form of direct guidelines to the relevant teams. International expert on the mechanisms of human interaction with the visual world.  \n \nI have accumulated 15+ years of experience from top notch academic centers around the world before taking the challenge of understanding how users will approach the future of computing: augmented reality.  \n \nMy current goal is to shift the paradigm for user research by blending the robustness of the scientific methods with the agility of the product development in the high tech industry in order to achieve unprecedented quality of data driven business decision.  \n \nMy skills cover the entire pipeline of research, from the understanding of the product need -business, hardware & software-, to the design and implementation of the test, data analysis, visualization and dissemination of the results in the form of direct guidelines to the relevant teams. International expert on the mechanisms of human interaction with the visual world.  \n \nI have accumulated 15+ years of experience from top notch academic centers around the world before taking the challenge of understanding how users will approach the future of computing: augmented reality.  \n \nMy current goal is to shift the paradigm for user research by blending the robustness of the scientific methods with the agility of the product development in the high tech industry in order to achieve unprecedented quality of data driven business decision.  \n \nMy skills cover the entire pipeline of research, from the understanding of the product need -business, hardware & software-, to the design and implementation of the test, data analysis, visualization and dissemination of the results in the form of direct guidelines to the relevant teams. Experience Director of User Research Meta Co. May 2015  – Present (4 months) Portola Valley, California Meta (www.getameta.com) is a Y Combinator startup changing the future of how we interact with each other, the world around us and computers. The Meta Glasses are the world leading Augmented Reality, gesture controlled platform.  \n \nAt Meta, I solve the complex and subtle problems to ensure users perform at top levels and have a rich and satisfying experience with our technology.  \nBy relying on my deep knowledge of the neuroscience and on robust investigation techniques, I devise new user tests to make sure that user perceptions and interactions are synced up with our wide array of sensors, the 3D display and the computer vision algorithms. At this stage I execute quick iterations of tests in close conjunction with our hardware and software team.  \nWhen the product is deliverable to users, I connect with marketing and business development to make sure that we deliver a great experience to our target users, by ideating new benchmarks suited for our industry space along with consolidated customer metrics.  \nAs data flow in multiple directions in the company and outside, I make sure that they are based on standardized units so that all the departments communicate seamlessly and make robust data-driven decisions. Head of Perceptual Interactions and User Research Meta Co. September 2014  –  May 2015  (9 months) Portola Valley, California At Meta, I solve the complex and subtle problems to ensure users perform at top levels and have a rich and satisfying experience with our technology. I do it by devising new user tests and by syncing up the user perceptions and interactions with our wide array of sensors, the 3D display and the computer vision algorithms. My goal is to make the whole experience with the Meta Glasses and its applications seamless and intuitive. Visual Perception Science advisor Meta Co. March 2014  –  September 2014  (7 months) Portola Valley, California Visiting professor Stanford University June 2011  –  September 2014  (3 years 4 months) Stanford Vision and NeuroDevelopment Laboratory •\tModels and tests of human decision making in cluttered and noisy visual scenes \n•\tDevelop and test of face detection models using psychophysics and EEG \n•\tStatistical analysis and modeling of big volumes of EEG data Assistant Professor Università degli Studi di Firenze November 2001  –  September 2014  (12 years 11 months) Florence Area, Italy CURRENTLY ON LEAVE  \n \n•\tDirector of the Visual Perception and Attention Laboratory \n•\tResearch focus on perceptual and motor decision making, visual search, attention, integration of information from multiple visual objects, visual motion, vision in Autism and visual attention in sport  \n•\tExtensive use of Eye Tracking, EEG, psychophysical and behavioral techniques \n•\tConsiderable experience in computer programming in Matlab, C, C++, Python and R for visual stimulus generation, image processing and data analysis \n•\tTaught both graduate and undergraduate courses in Cognition, Sensory Systems, Perception, Visual Attention and Psych Lab \n•\tSupervise several master's and doctorate thesis projects \n•\tRanked 2nd of 38 faculty members in the department for productivity in 2011 Adjunct Professor New York University 2004  –  May 2011  (7 years) Florence Area, Italy Taught undergraduate Cognition to NYU students in the study abroad system PostDoctoral Researcher The Smith Kettlewell Eye Research Institute September 2000  –  January 2003  (2 years 5 months) San Francisco Bay Area Development and testing of Signal Detection Theory models of human visual search Research Assistant University College London October 1996  –  September 1997  (1 year) •\tStudy of the integration of image features in visual search \n•\tStudy of biases in visual orientation processing Volleyball coach Volley Laurentina & Italian National Volleyball Federation September 1987  –  June 1995  (7 years 10 months) Rome Area, Italy •\tCoach of youth & adult women teams while attending college.  \n•\tStaff member in the pool regional coaches selecting and training youth top players. Here I trained players who continued their career at national and international levels. Director of User Research Meta Co. May 2015  – Present (4 months) Portola Valley, California Meta (www.getameta.com) is a Y Combinator startup changing the future of how we interact with each other, the world around us and computers. The Meta Glasses are the world leading Augmented Reality, gesture controlled platform.  \n \nAt Meta, I solve the complex and subtle problems to ensure users perform at top levels and have a rich and satisfying experience with our technology.  \nBy relying on my deep knowledge of the neuroscience and on robust investigation techniques, I devise new user tests to make sure that user perceptions and interactions are synced up with our wide array of sensors, the 3D display and the computer vision algorithms. At this stage I execute quick iterations of tests in close conjunction with our hardware and software team.  \nWhen the product is deliverable to users, I connect with marketing and business development to make sure that we deliver a great experience to our target users, by ideating new benchmarks suited for our industry space along with consolidated customer metrics.  \nAs data flow in multiple directions in the company and outside, I make sure that they are based on standardized units so that all the departments communicate seamlessly and make robust data-driven decisions. Director of User Research Meta Co. May 2015  – Present (4 months) Portola Valley, California Meta (www.getameta.com) is a Y Combinator startup changing the future of how we interact with each other, the world around us and computers. The Meta Glasses are the world leading Augmented Reality, gesture controlled platform.  \n \nAt Meta, I solve the complex and subtle problems to ensure users perform at top levels and have a rich and satisfying experience with our technology.  \nBy relying on my deep knowledge of the neuroscience and on robust investigation techniques, I devise new user tests to make sure that user perceptions and interactions are synced up with our wide array of sensors, the 3D display and the computer vision algorithms. At this stage I execute quick iterations of tests in close conjunction with our hardware and software team.  \nWhen the product is deliverable to users, I connect with marketing and business development to make sure that we deliver a great experience to our target users, by ideating new benchmarks suited for our industry space along with consolidated customer metrics.  \nAs data flow in multiple directions in the company and outside, I make sure that they are based on standardized units so that all the departments communicate seamlessly and make robust data-driven decisions. Head of Perceptual Interactions and User Research Meta Co. September 2014  –  May 2015  (9 months) Portola Valley, California At Meta, I solve the complex and subtle problems to ensure users perform at top levels and have a rich and satisfying experience with our technology. I do it by devising new user tests and by syncing up the user perceptions and interactions with our wide array of sensors, the 3D display and the computer vision algorithms. My goal is to make the whole experience with the Meta Glasses and its applications seamless and intuitive. Head of Perceptual Interactions and User Research Meta Co. September 2014  –  May 2015  (9 months) Portola Valley, California At Meta, I solve the complex and subtle problems to ensure users perform at top levels and have a rich and satisfying experience with our technology. I do it by devising new user tests and by syncing up the user perceptions and interactions with our wide array of sensors, the 3D display and the computer vision algorithms. My goal is to make the whole experience with the Meta Glasses and its applications seamless and intuitive. Visual Perception Science advisor Meta Co. March 2014  –  September 2014  (7 months) Portola Valley, California Visual Perception Science advisor Meta Co. March 2014  –  September 2014  (7 months) Portola Valley, California Visiting professor Stanford University June 2011  –  September 2014  (3 years 4 months) Stanford Vision and NeuroDevelopment Laboratory •\tModels and tests of human decision making in cluttered and noisy visual scenes \n•\tDevelop and test of face detection models using psychophysics and EEG \n•\tStatistical analysis and modeling of big volumes of EEG data Visiting professor Stanford University June 2011  –  September 2014  (3 years 4 months) Stanford Vision and NeuroDevelopment Laboratory •\tModels and tests of human decision making in cluttered and noisy visual scenes \n•\tDevelop and test of face detection models using psychophysics and EEG \n•\tStatistical analysis and modeling of big volumes of EEG data Assistant Professor Università degli Studi di Firenze November 2001  –  September 2014  (12 years 11 months) Florence Area, Italy CURRENTLY ON LEAVE  \n \n•\tDirector of the Visual Perception and Attention Laboratory \n•\tResearch focus on perceptual and motor decision making, visual search, attention, integration of information from multiple visual objects, visual motion, vision in Autism and visual attention in sport  \n•\tExtensive use of Eye Tracking, EEG, psychophysical and behavioral techniques \n•\tConsiderable experience in computer programming in Matlab, C, C++, Python and R for visual stimulus generation, image processing and data analysis \n•\tTaught both graduate and undergraduate courses in Cognition, Sensory Systems, Perception, Visual Attention and Psych Lab \n•\tSupervise several master's and doctorate thesis projects \n•\tRanked 2nd of 38 faculty members in the department for productivity in 2011 Assistant Professor Università degli Studi di Firenze November 2001  –  September 2014  (12 years 11 months) Florence Area, Italy CURRENTLY ON LEAVE  \n \n•\tDirector of the Visual Perception and Attention Laboratory \n•\tResearch focus on perceptual and motor decision making, visual search, attention, integration of information from multiple visual objects, visual motion, vision in Autism and visual attention in sport  \n•\tExtensive use of Eye Tracking, EEG, psychophysical and behavioral techniques \n•\tConsiderable experience in computer programming in Matlab, C, C++, Python and R for visual stimulus generation, image processing and data analysis \n•\tTaught both graduate and undergraduate courses in Cognition, Sensory Systems, Perception, Visual Attention and Psych Lab \n•\tSupervise several master's and doctorate thesis projects \n•\tRanked 2nd of 38 faculty members in the department for productivity in 2011 Adjunct Professor New York University 2004  –  May 2011  (7 years) Florence Area, Italy Taught undergraduate Cognition to NYU students in the study abroad system Adjunct Professor New York University 2004  –  May 2011  (7 years) Florence Area, Italy Taught undergraduate Cognition to NYU students in the study abroad system PostDoctoral Researcher The Smith Kettlewell Eye Research Institute September 2000  –  January 2003  (2 years 5 months) San Francisco Bay Area Development and testing of Signal Detection Theory models of human visual search PostDoctoral Researcher The Smith Kettlewell Eye Research Institute September 2000  –  January 2003  (2 years 5 months) San Francisco Bay Area Development and testing of Signal Detection Theory models of human visual search Research Assistant University College London October 1996  –  September 1997  (1 year) •\tStudy of the integration of image features in visual search \n•\tStudy of biases in visual orientation processing Research Assistant University College London October 1996  –  September 1997  (1 year) •\tStudy of the integration of image features in visual search \n•\tStudy of biases in visual orientation processing Volleyball coach Volley Laurentina & Italian National Volleyball Federation September 1987  –  June 1995  (7 years 10 months) Rome Area, Italy •\tCoach of youth & adult women teams while attending college.  \n•\tStaff member in the pool regional coaches selecting and training youth top players. Here I trained players who continued their career at national and international levels. Volleyball coach Volley Laurentina & Italian National Volleyball Federation September 1987  –  June 1995  (7 years 10 months) Rome Area, Italy •\tCoach of youth & adult women teams while attending college.  \n•\tStaff member in the pool regional coaches selecting and training youth top players. Here I trained players who continued their career at national and international levels. Languages English Full professional proficiency Italian Native or bilingual proficiency French Elementary proficiency Spanish Elementary proficiency English Full professional proficiency Italian Native or bilingual proficiency French Elementary proficiency Spanish Elementary proficiency English Full professional proficiency Italian Native or bilingual proficiency French Elementary proficiency Spanish Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Statistics Eye Tracking Psychophysics Experimentation Neuroscience Data Analysis Science Machine Learning R Psychology EEG Cognitive Science Image Processing Cognition Research Design Human Computer... Matlab Perception Scientific Writing Experimental Design University Teaching Cognitive Neuroscience Quantitative Research Vision Science Cognitive Psychology Python Data Science Qualitative Research Data Visualization Decision making Augmented Reality Human Factors Immersive Environments User Interface... Agile Project Management User-centered Design Matlab Programming Research Teaching User Research Usability Testing Wearables Start-ups See 28+     See less Skills  Statistics Eye Tracking Psychophysics Experimentation Neuroscience Data Analysis Science Machine Learning R Psychology EEG Cognitive Science Image Processing Cognition Research Design Human Computer... Matlab Perception Scientific Writing Experimental Design University Teaching Cognitive Neuroscience Quantitative Research Vision Science Cognitive Psychology Python Data Science Qualitative Research Data Visualization Decision making Augmented Reality Human Factors Immersive Environments User Interface... Agile Project Management User-centered Design Matlab Programming Research Teaching User Research Usability Testing Wearables Start-ups See 28+     See less Statistics Eye Tracking Psychophysics Experimentation Neuroscience Data Analysis Science Machine Learning R Psychology EEG Cognitive Science Image Processing Cognition Research Design Human Computer... Matlab Perception Scientific Writing Experimental Design University Teaching Cognitive Neuroscience Quantitative Research Vision Science Cognitive Psychology Python Data Science Qualitative Research Data Visualization Decision making Augmented Reality Human Factors Immersive Environments User Interface... Agile Project Management User-centered Design Matlab Programming Research Teaching User Research Usability Testing Wearables Start-ups See 28+     See less Statistics Eye Tracking Psychophysics Experimentation Neuroscience Data Analysis Science Machine Learning R Psychology EEG Cognitive Science Image Processing Cognition Research Design Human Computer... Matlab Perception Scientific Writing Experimental Design University Teaching Cognitive Neuroscience Quantitative Research Vision Science Cognitive Psychology Python Data Science Qualitative Research Data Visualization Decision making Augmented Reality Human Factors Immersive Environments User Interface... Agile Project Management User-centered Design Matlab Programming Research Teaching User Research Usability Testing Wearables Start-ups See 28+     See less Education University of Rome \"La Sapienza\" PhD,  Perception 1998  – 2001 Study of the perceptual, cognitive and decisional factors of visual search tasks University of Rome \"La Sapienza\" Master of Science,  Experimental Psychology , Summa cum Laude 1988  – 1995 Experimental study of visual suppression during saccadic eye movements University of Rome \"La Sapienza\" PhD,  Perception 1998  – 2001 Study of the perceptual, cognitive and decisional factors of visual search tasks University of Rome \"La Sapienza\" PhD,  Perception 1998  – 2001 Study of the perceptual, cognitive and decisional factors of visual search tasks University of Rome \"La Sapienza\" PhD,  Perception 1998  – 2001 Study of the perceptual, cognitive and decisional factors of visual search tasks University of Rome \"La Sapienza\" Master of Science,  Experimental Psychology , Summa cum Laude 1988  – 1995 Experimental study of visual suppression during saccadic eye movements University of Rome \"La Sapienza\" Master of Science,  Experimental Psychology , Summa cum Laude 1988  – 1995 Experimental study of visual suppression during saccadic eye movements University of Rome \"La Sapienza\" Master of Science,  Experimental Psychology , Summa cum Laude 1988  – 1995 Experimental study of visual suppression during saccadic eye movements Honors & Awards ", "Summary * User experience researcher and manager with deep expertise in conducting quantitative and ethnographic research. Experience in B2C, B2B and mobile research. Extensive experience in conducting research in developing world.  \n \n*Specialization is understanding user needs through ethnography, leading large scale surveys, and bringing disparate data sources from analytics to qualitative data to shed light and create empathy for users. Summary * User experience researcher and manager with deep expertise in conducting quantitative and ethnographic research. Experience in B2C, B2B and mobile research. Extensive experience in conducting research in developing world.  \n \n*Specialization is understanding user needs through ethnography, leading large scale surveys, and bringing disparate data sources from analytics to qualitative data to shed light and create empathy for users. * User experience researcher and manager with deep expertise in conducting quantitative and ethnographic research. Experience in B2C, B2B and mobile research. Extensive experience in conducting research in developing world.  \n \n*Specialization is understanding user needs through ethnography, leading large scale surveys, and bringing disparate data sources from analytics to qualitative data to shed light and create empathy for users. * User experience researcher and manager with deep expertise in conducting quantitative and ethnographic research. Experience in B2C, B2B and mobile research. Extensive experience in conducting research in developing world.  \n \n*Specialization is understanding user needs through ethnography, leading large scale surveys, and bringing disparate data sources from analytics to qualitative data to shed light and create empathy for users. Experience Director of User Research/Principal Researcher SuccessFactors 2013  – Present (2 years) San Francisco Bay Area Lead team that conducts user research across all of SuccessFactors' product suite. My team conducts exploratory research, surveys and usability testing to improve user experience, create empathy for users, understand user needs and pain-points to build and improve products.  \nWe experiment with Lean UX techniques to test new ideas and concepts; and RITE to deliver results fast for an agile work environment.  \nHCM modules experience: recruiting, onboarding, employee directory, workforce analytics, talent, performance, mobile. Director of User Research/Principal Researcher SuccessFactors 2013  – Present (2 years) San Francisco Bay Area Lead team that conducts user research across all of SuccessFactors' product suite. My team conducts exploratory research, surveys and usability testing to improve user experience, create empathy for users, understand user needs and pain-points to build and improve products.  \nWe experiment with Lean UX techniques to test new ideas and concepts; and RITE to deliver results fast for an agile work environment.  \nHCM modules experience: recruiting, onboarding, employee directory, workforce analytics, talent, performance, mobile. Director of User Research/Principal Researcher SuccessFactors 2013  – Present (2 years) San Francisco Bay Area Lead team that conducts user research across all of SuccessFactors' product suite. My team conducts exploratory research, surveys and usability testing to improve user experience, create empathy for users, understand user needs and pain-points to build and improve products.  \nWe experiment with Lean UX techniques to test new ideas and concepts; and RITE to deliver results fast for an agile work environment.  \nHCM modules experience: recruiting, onboarding, employee directory, workforce analytics, talent, performance, mobile. Languages English Hindi English Hindi English Hindi Skills User Experience Ethnography Analytics Quantitative Research Program Evaluation User Research Survey Design Usability Testing Product Management Mobile Strategy Foresight Survey Research Concept Development Strategy Web Analytics Trend Following Emerging Markets SPSS Trend Tracking Brazil India Morae Lean UX Futures Thinking HCM Mobile Devices Management Qualitative Research Research Consulting Market Research Social Media See 17+     See less Skills  User Experience Ethnography Analytics Quantitative Research Program Evaluation User Research Survey Design Usability Testing Product Management Mobile Strategy Foresight Survey Research Concept Development Strategy Web Analytics Trend Following Emerging Markets SPSS Trend Tracking Brazil India Morae Lean UX Futures Thinking HCM Mobile Devices Management Qualitative Research Research Consulting Market Research Social Media See 17+     See less User Experience Ethnography Analytics Quantitative Research Program Evaluation User Research Survey Design Usability Testing Product Management Mobile Strategy Foresight Survey Research Concept Development Strategy Web Analytics Trend Following Emerging Markets SPSS Trend Tracking Brazil India Morae Lean UX Futures Thinking HCM Mobile Devices Management Qualitative Research Research Consulting Market Research Social Media See 17+     See less User Experience Ethnography Analytics Quantitative Research Program Evaluation User Research Survey Design Usability Testing Product Management Mobile Strategy Foresight Survey Research Concept Development Strategy Web Analytics Trend Following Emerging Markets SPSS Trend Tracking Brazil India Morae Lean UX Futures Thinking HCM Mobile Devices Management Qualitative Research Research Consulting Market Research Social Media See 17+     See less ", "Summary I am an Engineer with over 10 years of industry and academic product research and development experience spanning Industrial Automation, Healthcare, and Retail. \n \nMy latest challenge is working with a technical team at a Financial Services startup to develop best-in-class customer experiences, content marketing platforms, and CRM portals for mortgage and consumer credit markets. \n \nI have Masters and Bachelors of Systems Design Engineering from University of Waterloo, and a PhD in Information Systems from U Maryland Baltimore County. \n \nSpecialties: Product management and development, data models, business processes, functional requirements, time and motion analysis, interface design, information visualization, usability tests, user centred design principles, use cases, user flows, user interactions, rapid prototyping, mind mapping; Visio, Trello, Sparx Enterprise Architect, BPMN, CAD, Relational Databases, MySQL, Javascript \n \nApplications: Retail digital experiences, RFID / BT LE / Internet of Things (IOT/IOE), kiosks, healthcare information systems, health informatics, telehealth, human computer interaction, industrial automation, HMI, MMI, real-time collaboration, groupware Summary I am an Engineer with over 10 years of industry and academic product research and development experience spanning Industrial Automation, Healthcare, and Retail. \n \nMy latest challenge is working with a technical team at a Financial Services startup to develop best-in-class customer experiences, content marketing platforms, and CRM portals for mortgage and consumer credit markets. \n \nI have Masters and Bachelors of Systems Design Engineering from University of Waterloo, and a PhD in Information Systems from U Maryland Baltimore County. \n \nSpecialties: Product management and development, data models, business processes, functional requirements, time and motion analysis, interface design, information visualization, usability tests, user centred design principles, use cases, user flows, user interactions, rapid prototyping, mind mapping; Visio, Trello, Sparx Enterprise Architect, BPMN, CAD, Relational Databases, MySQL, Javascript \n \nApplications: Retail digital experiences, RFID / BT LE / Internet of Things (IOT/IOE), kiosks, healthcare information systems, health informatics, telehealth, human computer interaction, industrial automation, HMI, MMI, real-time collaboration, groupware I am an Engineer with over 10 years of industry and academic product research and development experience spanning Industrial Automation, Healthcare, and Retail. \n \nMy latest challenge is working with a technical team at a Financial Services startup to develop best-in-class customer experiences, content marketing platforms, and CRM portals for mortgage and consumer credit markets. \n \nI have Masters and Bachelors of Systems Design Engineering from University of Waterloo, and a PhD in Information Systems from U Maryland Baltimore County. \n \nSpecialties: Product management and development, data models, business processes, functional requirements, time and motion analysis, interface design, information visualization, usability tests, user centred design principles, use cases, user flows, user interactions, rapid prototyping, mind mapping; Visio, Trello, Sparx Enterprise Architect, BPMN, CAD, Relational Databases, MySQL, Javascript \n \nApplications: Retail digital experiences, RFID / BT LE / Internet of Things (IOT/IOE), kiosks, healthcare information systems, health informatics, telehealth, human computer interaction, industrial automation, HMI, MMI, real-time collaboration, groupware I am an Engineer with over 10 years of industry and academic product research and development experience spanning Industrial Automation, Healthcare, and Retail. \n \nMy latest challenge is working with a technical team at a Financial Services startup to develop best-in-class customer experiences, content marketing platforms, and CRM portals for mortgage and consumer credit markets. \n \nI have Masters and Bachelors of Systems Design Engineering from University of Waterloo, and a PhD in Information Systems from U Maryland Baltimore County. \n \nSpecialties: Product management and development, data models, business processes, functional requirements, time and motion analysis, interface design, information visualization, usability tests, user centred design principles, use cases, user flows, user interactions, rapid prototyping, mind mapping; Visio, Trello, Sparx Enterprise Architect, BPMN, CAD, Relational Databases, MySQL, Javascript \n \nApplications: Retail digital experiences, RFID / BT LE / Internet of Things (IOT/IOE), kiosks, healthcare information systems, health informatics, telehealth, human computer interaction, industrial automation, HMI, MMI, real-time collaboration, groupware Experience Director of Engineering Veracity North May 2015  – Present (4 months) Kitchener, Canada Area Veracity North is a home grown financial services startup located in the heart of Kitchener's Innovation District, Waterloo Region, Canada. Partner Spirellis Inc. January 2010  – Present (5 years 8 months) Canada Whether you are facing challenges in data-driven core product development or business intelligence reporting, we will listen to your needs and constraints to help you develop strategies and algorithms to reach your goal!  \n \nWe specialize in: \n✔ Data Visualization and Reporting  \n✔ Data Analysis and Predictive Modeling  \n✔ Data Pipeline Automation and Optimization  \n✔ Data Product Development Adjunct Assistant Professor, School of Pharmacy University of Waterloo February 2010  – Present (5 years 7 months) Kitchener, Canada Area I employ a multidisciplinary approach to empowering pharmacy professionals with computer and technology literacy so they are better equipped to identify and address challenges in pharmacy and healthcare information systems adoption. \n \nI developed and delivered course materials spanning pharmacy automation, inventory management and forecasting, computing, networking, database theory and design, hospital and retail pharmacy information systems, decision support systems, electronic medical records and ordering systems, telehealth and telepharmacy, and analysis and reporting in Microsoft Excel. Solutions Architect, CT Innovations Canadian Tire May 2013  –  May 2015  (2 years 1 month) Kitchener, Canada Area Located in Kitchener's Innovation District, CT Innovations explores the latest in digital and retail technology to enhance the customer experience across all corporate brands. I supported the agile scrum innovation team in product management, process design, data modelling, and rapid prototyping. \n \nProjects led include: \n✔ Paperless mail package tracking system to eliminate delivery inefficiencies at corporate head office, integrating package serialization, product image capture, and signature delivery in a single experience. Strong internal adoption led to deployment across other major business units. \n✔ Proof of concept mobile app and accounts portal for company discount program at national supplier of company uniforms and apparel. Digital implementation improves eligibility administration by employers, creates targeted marketing channel for app users, and potential savings of $1.3 mil per year for printed program cards. \n✔ Fully functional prototype of app-connected sporting good equipment, providing shot speed, user statistics, and relevant skills coaching tips for school-aged winter sports market. Developed using Arduino, Bluetooth Low Energy, and RFID hardware platform. \n✔ RFID-enabled proof of concepts for Product Innovation team's ideation phase for next-generation festive lighting product line. Director, User Research and Experience Design MedAvail Technologies Inc. June 2012  –  March 2013  (10 months) Mississauga, Ontario MedAvail develops an automated remote dispensing system that automatically picks, packs, and labels prescription medications for patients with direct video conference to pharmacy personnel. \n \nAs part of the Pharmacy Services group, I led User Experience design of the patient-pharmacist experience and dispense workflow. Key responsibilities included designing patient and pharmacist workflows, developing user stories and validating user requirements with solution architects and interface designers, and conducting user studies to validate user and system interaction requirements. Director, User Research and Experience Design PharmaTrust Corp. October 2010  –  June 2012  (1 year 9 months) Mississauga, Ontario PCAS Patient Care Automated Services Inc. is the original developer of the PharmaTrust MedCenter, an automated remote dispensing system that automatically picks, packs, and labels prescription medications for patients with direct video conference to pharmacy personnel. \n \nKey responsibilities included managing a technical documentation team, use case modelling, business process modelling, user research and product design studies, product requirements gathering and documentation, patent search and application, feature requests development, and business case development for product roadmap. \n \nI also managed process and organizational knowledge documentation during the company's critical acquisition phase. Interface Design Consultant & Developer Solutions Outside The Box Inc. 2004  –  2006  (2 years) Toronto, Canada Area ✔ Operator control room UI redesign for clients in oil and alumina refinery \n✔ Gathered user requirements from on-site operators to develop new interface designs \n✔ Created dynamic interface elements in MS Visio to support front-end development Program Assistant Shad Valley Waterloo June 2003  –  July 2003  (2 months) Waterloo, Canada Area ✔ Conducted a workshop on user interface design \n✔ Mentored high school students from across Canada \n✔ Assisted with program logistics \n✔ Accompanied students on field trips and enrichment activities Program Manager, MSTV Prototyping Microsoft May 2001  –  August 2001  (4 months) Redmond, Washington ✔ Prototyped interactive advertising features for MSTV set-top box using HTML & Javascript User Interface Analyst, User Experience 724 Solutions September 2000  –  December 2000  (4 months) Toronto, Canada Area ✔ Designed and documented e-commerce banking interface storyboards \n✔ Developed interactive, GUI-based Wireless Markup Language generator to reduce prototyping time Industrial Controls Integrator RM Systems Integrators January 2000  –  April 2000  (4 months) Toronto, Canada Area ✔ Designed and implemented interfaces for industrial evaporators in VB Industrial Controls Integrator RM Systems Integrators May 1999  –  August 1999  (4 months) Toronto, Canada Area ✔ Designed and implemented interfaces for industrial evaporators in VB Director of Engineering Veracity North May 2015  – Present (4 months) Kitchener, Canada Area Veracity North is a home grown financial services startup located in the heart of Kitchener's Innovation District, Waterloo Region, Canada. Director of Engineering Veracity North May 2015  – Present (4 months) Kitchener, Canada Area Veracity North is a home grown financial services startup located in the heart of Kitchener's Innovation District, Waterloo Region, Canada. Partner Spirellis Inc. January 2010  – Present (5 years 8 months) Canada Whether you are facing challenges in data-driven core product development or business intelligence reporting, we will listen to your needs and constraints to help you develop strategies and algorithms to reach your goal!  \n \nWe specialize in: \n✔ Data Visualization and Reporting  \n✔ Data Analysis and Predictive Modeling  \n✔ Data Pipeline Automation and Optimization  \n✔ Data Product Development Partner Spirellis Inc. January 2010  – Present (5 years 8 months) Canada Whether you are facing challenges in data-driven core product development or business intelligence reporting, we will listen to your needs and constraints to help you develop strategies and algorithms to reach your goal!  \n \nWe specialize in: \n✔ Data Visualization and Reporting  \n✔ Data Analysis and Predictive Modeling  \n✔ Data Pipeline Automation and Optimization  \n✔ Data Product Development Adjunct Assistant Professor, School of Pharmacy University of Waterloo February 2010  – Present (5 years 7 months) Kitchener, Canada Area I employ a multidisciplinary approach to empowering pharmacy professionals with computer and technology literacy so they are better equipped to identify and address challenges in pharmacy and healthcare information systems adoption. \n \nI developed and delivered course materials spanning pharmacy automation, inventory management and forecasting, computing, networking, database theory and design, hospital and retail pharmacy information systems, decision support systems, electronic medical records and ordering systems, telehealth and telepharmacy, and analysis and reporting in Microsoft Excel. Adjunct Assistant Professor, School of Pharmacy University of Waterloo February 2010  – Present (5 years 7 months) Kitchener, Canada Area I employ a multidisciplinary approach to empowering pharmacy professionals with computer and technology literacy so they are better equipped to identify and address challenges in pharmacy and healthcare information systems adoption. \n \nI developed and delivered course materials spanning pharmacy automation, inventory management and forecasting, computing, networking, database theory and design, hospital and retail pharmacy information systems, decision support systems, electronic medical records and ordering systems, telehealth and telepharmacy, and analysis and reporting in Microsoft Excel. Solutions Architect, CT Innovations Canadian Tire May 2013  –  May 2015  (2 years 1 month) Kitchener, Canada Area Located in Kitchener's Innovation District, CT Innovations explores the latest in digital and retail technology to enhance the customer experience across all corporate brands. I supported the agile scrum innovation team in product management, process design, data modelling, and rapid prototyping. \n \nProjects led include: \n✔ Paperless mail package tracking system to eliminate delivery inefficiencies at corporate head office, integrating package serialization, product image capture, and signature delivery in a single experience. Strong internal adoption led to deployment across other major business units. \n✔ Proof of concept mobile app and accounts portal for company discount program at national supplier of company uniforms and apparel. Digital implementation improves eligibility administration by employers, creates targeted marketing channel for app users, and potential savings of $1.3 mil per year for printed program cards. \n✔ Fully functional prototype of app-connected sporting good equipment, providing shot speed, user statistics, and relevant skills coaching tips for school-aged winter sports market. Developed using Arduino, Bluetooth Low Energy, and RFID hardware platform. \n✔ RFID-enabled proof of concepts for Product Innovation team's ideation phase for next-generation festive lighting product line. Solutions Architect, CT Innovations Canadian Tire May 2013  –  May 2015  (2 years 1 month) Kitchener, Canada Area Located in Kitchener's Innovation District, CT Innovations explores the latest in digital and retail technology to enhance the customer experience across all corporate brands. I supported the agile scrum innovation team in product management, process design, data modelling, and rapid prototyping. \n \nProjects led include: \n✔ Paperless mail package tracking system to eliminate delivery inefficiencies at corporate head office, integrating package serialization, product image capture, and signature delivery in a single experience. Strong internal adoption led to deployment across other major business units. \n✔ Proof of concept mobile app and accounts portal for company discount program at national supplier of company uniforms and apparel. Digital implementation improves eligibility administration by employers, creates targeted marketing channel for app users, and potential savings of $1.3 mil per year for printed program cards. \n✔ Fully functional prototype of app-connected sporting good equipment, providing shot speed, user statistics, and relevant skills coaching tips for school-aged winter sports market. Developed using Arduino, Bluetooth Low Energy, and RFID hardware platform. \n✔ RFID-enabled proof of concepts for Product Innovation team's ideation phase for next-generation festive lighting product line. Director, User Research and Experience Design MedAvail Technologies Inc. June 2012  –  March 2013  (10 months) Mississauga, Ontario MedAvail develops an automated remote dispensing system that automatically picks, packs, and labels prescription medications for patients with direct video conference to pharmacy personnel. \n \nAs part of the Pharmacy Services group, I led User Experience design of the patient-pharmacist experience and dispense workflow. Key responsibilities included designing patient and pharmacist workflows, developing user stories and validating user requirements with solution architects and interface designers, and conducting user studies to validate user and system interaction requirements. Director, User Research and Experience Design MedAvail Technologies Inc. June 2012  –  March 2013  (10 months) Mississauga, Ontario MedAvail develops an automated remote dispensing system that automatically picks, packs, and labels prescription medications for patients with direct video conference to pharmacy personnel. \n \nAs part of the Pharmacy Services group, I led User Experience design of the patient-pharmacist experience and dispense workflow. Key responsibilities included designing patient and pharmacist workflows, developing user stories and validating user requirements with solution architects and interface designers, and conducting user studies to validate user and system interaction requirements. Director, User Research and Experience Design PharmaTrust Corp. October 2010  –  June 2012  (1 year 9 months) Mississauga, Ontario PCAS Patient Care Automated Services Inc. is the original developer of the PharmaTrust MedCenter, an automated remote dispensing system that automatically picks, packs, and labels prescription medications for patients with direct video conference to pharmacy personnel. \n \nKey responsibilities included managing a technical documentation team, use case modelling, business process modelling, user research and product design studies, product requirements gathering and documentation, patent search and application, feature requests development, and business case development for product roadmap. \n \nI also managed process and organizational knowledge documentation during the company's critical acquisition phase. Director, User Research and Experience Design PharmaTrust Corp. October 2010  –  June 2012  (1 year 9 months) Mississauga, Ontario PCAS Patient Care Automated Services Inc. is the original developer of the PharmaTrust MedCenter, an automated remote dispensing system that automatically picks, packs, and labels prescription medications for patients with direct video conference to pharmacy personnel. \n \nKey responsibilities included managing a technical documentation team, use case modelling, business process modelling, user research and product design studies, product requirements gathering and documentation, patent search and application, feature requests development, and business case development for product roadmap. \n \nI also managed process and organizational knowledge documentation during the company's critical acquisition phase. Interface Design Consultant & Developer Solutions Outside The Box Inc. 2004  –  2006  (2 years) Toronto, Canada Area ✔ Operator control room UI redesign for clients in oil and alumina refinery \n✔ Gathered user requirements from on-site operators to develop new interface designs \n✔ Created dynamic interface elements in MS Visio to support front-end development Interface Design Consultant & Developer Solutions Outside The Box Inc. 2004  –  2006  (2 years) Toronto, Canada Area ✔ Operator control room UI redesign for clients in oil and alumina refinery \n✔ Gathered user requirements from on-site operators to develop new interface designs \n✔ Created dynamic interface elements in MS Visio to support front-end development Program Assistant Shad Valley Waterloo June 2003  –  July 2003  (2 months) Waterloo, Canada Area ✔ Conducted a workshop on user interface design \n✔ Mentored high school students from across Canada \n✔ Assisted with program logistics \n✔ Accompanied students on field trips and enrichment activities Program Assistant Shad Valley Waterloo June 2003  –  July 2003  (2 months) Waterloo, Canada Area ✔ Conducted a workshop on user interface design \n✔ Mentored high school students from across Canada \n✔ Assisted with program logistics \n✔ Accompanied students on field trips and enrichment activities Program Manager, MSTV Prototyping Microsoft May 2001  –  August 2001  (4 months) Redmond, Washington ✔ Prototyped interactive advertising features for MSTV set-top box using HTML & Javascript Program Manager, MSTV Prototyping Microsoft May 2001  –  August 2001  (4 months) Redmond, Washington ✔ Prototyped interactive advertising features for MSTV set-top box using HTML & Javascript User Interface Analyst, User Experience 724 Solutions September 2000  –  December 2000  (4 months) Toronto, Canada Area ✔ Designed and documented e-commerce banking interface storyboards \n✔ Developed interactive, GUI-based Wireless Markup Language generator to reduce prototyping time User Interface Analyst, User Experience 724 Solutions September 2000  –  December 2000  (4 months) Toronto, Canada Area ✔ Designed and documented e-commerce banking interface storyboards \n✔ Developed interactive, GUI-based Wireless Markup Language generator to reduce prototyping time Industrial Controls Integrator RM Systems Integrators January 2000  –  April 2000  (4 months) Toronto, Canada Area ✔ Designed and implemented interfaces for industrial evaporators in VB Industrial Controls Integrator RM Systems Integrators January 2000  –  April 2000  (4 months) Toronto, Canada Area ✔ Designed and implemented interfaces for industrial evaporators in VB Industrial Controls Integrator RM Systems Integrators May 1999  –  August 1999  (4 months) Toronto, Canada Area ✔ Designed and implemented interfaces for industrial evaporators in VB Industrial Controls Integrator RM Systems Integrators May 1999  –  August 1999  (4 months) Toronto, Canada Area ✔ Designed and implemented interfaces for industrial evaporators in VB Languages   Skills Usability Testing Human Computer... User-centered Design User Experience User Interface Design User Interface Product Development User Research Databases Usability Engineering User Experience Design Informatics Human Factors Software Documentation Database Design Requirements Analysis Testing JavaScript HTML Task Analysis Rapid Prototyping Heuristic Evaluation Experience Design Healthcare Information... Requirements Gathering Product Design Usability Healthcare IT Qualitative Research Visio Visual Basic MySQL Use Case Analysis Data Visualization Sparx Enterprise... Telehealth Use Case Diagrams Information Architecture User Acceptance Testing See 24+     See less Skills  Usability Testing Human Computer... User-centered Design User Experience User Interface Design User Interface Product Development User Research Databases Usability Engineering User Experience Design Informatics Human Factors Software Documentation Database Design Requirements Analysis Testing JavaScript HTML Task Analysis Rapid Prototyping Heuristic Evaluation Experience Design Healthcare Information... Requirements Gathering Product Design Usability Healthcare IT Qualitative Research Visio Visual Basic MySQL Use Case Analysis Data Visualization Sparx Enterprise... Telehealth Use Case Diagrams Information Architecture User Acceptance Testing See 24+     See less Usability Testing Human Computer... User-centered Design User Experience User Interface Design User Interface Product Development User Research Databases Usability Engineering User Experience Design Informatics Human Factors Software Documentation Database Design Requirements Analysis Testing JavaScript HTML Task Analysis Rapid Prototyping Heuristic Evaluation Experience Design Healthcare Information... Requirements Gathering Product Design Usability Healthcare IT Qualitative Research Visio Visual Basic MySQL Use Case Analysis Data Visualization Sparx Enterprise... Telehealth Use Case Diagrams Information Architecture User Acceptance Testing See 24+     See less Usability Testing Human Computer... User-centered Design User Experience User Interface Design User Interface Product Development User Research Databases Usability Engineering User Experience Design Informatics Human Factors Software Documentation Database Design Requirements Analysis Testing JavaScript HTML Task Analysis Rapid Prototyping Heuristic Evaluation Experience Design Healthcare Information... Requirements Gathering Product Design Usability Healthcare IT Qualitative Research Visio Visual Basic MySQL Use Case Analysis Data Visualization Sparx Enterprise... Telehealth Use Case Diagrams Information Architecture User Acceptance Testing See 24+     See less Education University of Maryland Baltimore County PhD,  Information Systems , 4.0 2006  – 2011 My doctoral dissertation proposed and demonstrated an information sharing model used to quantify group collaboration behavior and individual information needs under varying time pressure and task difficulty. Findings are directly applicable to the design and development of computerized collaboration and information sharing systems. \n \nDissertation Title: \nTowards a Framework for Collaborative Information Exchange: Exploring Effects of Time Pressure and Task Complexity on Cognition Behaviors of Group Information Exchange and Implications for Computer Supported Collaboration in Healthcare \n \nCoursework (GPA 4.0 out of 4.0): Healthcare Informatics I & II, Database Design, Advanced Database Projects, Data Communication & Networks, Advanced Field Research Methods, Advanced Experimental Design Methods, Human Computer Interaction University of Maryland School of Medicine Graduate Research Assistant,  Human Factors and Technology Research, Patient Safety Program 2005  – 2008 ✔ Developed and constructed “Rounding Partner” observation platform for observing medical rounds and improving information transfer in Pediatrics ICU \n✔ Conducted audio-video recording and coding of medical rounds activity \n✔ Evaluated GE Propaq event logging PDA for helicopter trauma transfers \n✔ Developed sign-in/out prototype for Outpatient Surgery, video review utility for counting personnel activity, paper artifact scanner to assist digitized information retrieval in medical rounds, Flash-based keystroke logging instructional video for NASA intubation study, MySQL/PHP publications repository and activity calendar for the research group \n✔ Assisted deployment of CCTV video network between field and command center for Baltimore Washington Int’l airport mass casualty exercise \n✔ Conducted survey evaluation of Polycom teleconference for orthopedic case studies University of Maryland School of Medicine Research Analyst,  Human Factors and Technology Research Program 2004  – 2005 ✔ Conducted time-motion/cost savings study of robotic medications delivery (Aethon TUG robot) from Shock Trauma Center satellite pharmacy to nursing stations \n✔ Evaluated usage of paper-based Trauma residents handbook \n✔ Processed data and publications preparation for vital signs algorithm for displaying operating room activity on VideoBoard System in Shock Trauma Center to reduce room turnover times (data powered by BedMaster) University of Waterloo MASc,  Systems Design Engineering , Human Systems specialization 2002  – 2004 I applied Work Domain Analysis to model the aircraft collision domain, developed traffic detection interfaces using Ecological Interface Design (EID) principles, and quantified efficacy of EID-enhanced displays for pilot trust in the TCAS II system. Research findings are directly applicable to design of large data dashboards and operator control displays. \n \nDissertation Title: \nImproving Pilot Trust in Automated Collision Detection and Avoidance With Ecological Interface Design \n \nKeywords: TCAS, collision detection and avoidance, pilot trust, Ecological Interface Design (EID), Work Domain Analysis (WDA) Activities and Societies:  Advanced Interface Design Laboratory University of Waterloo BASc, Honours,  Systems Design Engineering 1997  – 2002 Graduated with Management Sciences Option \nSpecialized in Human Factors and Interface Design Activities and Societies:  Canadian Undergraduate Technology Conference ,  Logistics Director University of Maryland Baltimore County PhD,  Information Systems , 4.0 2006  – 2011 My doctoral dissertation proposed and demonstrated an information sharing model used to quantify group collaboration behavior and individual information needs under varying time pressure and task difficulty. Findings are directly applicable to the design and development of computerized collaboration and information sharing systems. \n \nDissertation Title: \nTowards a Framework for Collaborative Information Exchange: Exploring Effects of Time Pressure and Task Complexity on Cognition Behaviors of Group Information Exchange and Implications for Computer Supported Collaboration in Healthcare \n \nCoursework (GPA 4.0 out of 4.0): Healthcare Informatics I & II, Database Design, Advanced Database Projects, Data Communication & Networks, Advanced Field Research Methods, Advanced Experimental Design Methods, Human Computer Interaction University of Maryland Baltimore County PhD,  Information Systems , 4.0 2006  – 2011 My doctoral dissertation proposed and demonstrated an information sharing model used to quantify group collaboration behavior and individual information needs under varying time pressure and task difficulty. Findings are directly applicable to the design and development of computerized collaboration and information sharing systems. \n \nDissertation Title: \nTowards a Framework for Collaborative Information Exchange: Exploring Effects of Time Pressure and Task Complexity on Cognition Behaviors of Group Information Exchange and Implications for Computer Supported Collaboration in Healthcare \n \nCoursework (GPA 4.0 out of 4.0): Healthcare Informatics I & II, Database Design, Advanced Database Projects, Data Communication & Networks, Advanced Field Research Methods, Advanced Experimental Design Methods, Human Computer Interaction University of Maryland Baltimore County PhD,  Information Systems , 4.0 2006  – 2011 My doctoral dissertation proposed and demonstrated an information sharing model used to quantify group collaboration behavior and individual information needs under varying time pressure and task difficulty. Findings are directly applicable to the design and development of computerized collaboration and information sharing systems. \n \nDissertation Title: \nTowards a Framework for Collaborative Information Exchange: Exploring Effects of Time Pressure and Task Complexity on Cognition Behaviors of Group Information Exchange and Implications for Computer Supported Collaboration in Healthcare \n \nCoursework (GPA 4.0 out of 4.0): Healthcare Informatics I & II, Database Design, Advanced Database Projects, Data Communication & Networks, Advanced Field Research Methods, Advanced Experimental Design Methods, Human Computer Interaction University of Maryland School of Medicine Graduate Research Assistant,  Human Factors and Technology Research, Patient Safety Program 2005  – 2008 ✔ Developed and constructed “Rounding Partner” observation platform for observing medical rounds and improving information transfer in Pediatrics ICU \n✔ Conducted audio-video recording and coding of medical rounds activity \n✔ Evaluated GE Propaq event logging PDA for helicopter trauma transfers \n✔ Developed sign-in/out prototype for Outpatient Surgery, video review utility for counting personnel activity, paper artifact scanner to assist digitized information retrieval in medical rounds, Flash-based keystroke logging instructional video for NASA intubation study, MySQL/PHP publications repository and activity calendar for the research group \n✔ Assisted deployment of CCTV video network between field and command center for Baltimore Washington Int’l airport mass casualty exercise \n✔ Conducted survey evaluation of Polycom teleconference for orthopedic case studies University of Maryland School of Medicine Graduate Research Assistant,  Human Factors and Technology Research, Patient Safety Program 2005  – 2008 ✔ Developed and constructed “Rounding Partner” observation platform for observing medical rounds and improving information transfer in Pediatrics ICU \n✔ Conducted audio-video recording and coding of medical rounds activity \n✔ Evaluated GE Propaq event logging PDA for helicopter trauma transfers \n✔ Developed sign-in/out prototype for Outpatient Surgery, video review utility for counting personnel activity, paper artifact scanner to assist digitized information retrieval in medical rounds, Flash-based keystroke logging instructional video for NASA intubation study, MySQL/PHP publications repository and activity calendar for the research group \n✔ Assisted deployment of CCTV video network between field and command center for Baltimore Washington Int’l airport mass casualty exercise \n✔ Conducted survey evaluation of Polycom teleconference for orthopedic case studies University of Maryland School of Medicine Graduate Research Assistant,  Human Factors and Technology Research, Patient Safety Program 2005  – 2008 ✔ Developed and constructed “Rounding Partner” observation platform for observing medical rounds and improving information transfer in Pediatrics ICU \n✔ Conducted audio-video recording and coding of medical rounds activity \n✔ Evaluated GE Propaq event logging PDA for helicopter trauma transfers \n✔ Developed sign-in/out prototype for Outpatient Surgery, video review utility for counting personnel activity, paper artifact scanner to assist digitized information retrieval in medical rounds, Flash-based keystroke logging instructional video for NASA intubation study, MySQL/PHP publications repository and activity calendar for the research group \n✔ Assisted deployment of CCTV video network between field and command center for Baltimore Washington Int’l airport mass casualty exercise \n✔ Conducted survey evaluation of Polycom teleconference for orthopedic case studies University of Maryland School of Medicine Research Analyst,  Human Factors and Technology Research Program 2004  – 2005 ✔ Conducted time-motion/cost savings study of robotic medications delivery (Aethon TUG robot) from Shock Trauma Center satellite pharmacy to nursing stations \n✔ Evaluated usage of paper-based Trauma residents handbook \n✔ Processed data and publications preparation for vital signs algorithm for displaying operating room activity on VideoBoard System in Shock Trauma Center to reduce room turnover times (data powered by BedMaster) University of Maryland School of Medicine Research Analyst,  Human Factors and Technology Research Program 2004  – 2005 ✔ Conducted time-motion/cost savings study of robotic medications delivery (Aethon TUG robot) from Shock Trauma Center satellite pharmacy to nursing stations \n✔ Evaluated usage of paper-based Trauma residents handbook \n✔ Processed data and publications preparation for vital signs algorithm for displaying operating room activity on VideoBoard System in Shock Trauma Center to reduce room turnover times (data powered by BedMaster) University of Maryland School of Medicine Research Analyst,  Human Factors and Technology Research Program 2004  – 2005 ✔ Conducted time-motion/cost savings study of robotic medications delivery (Aethon TUG robot) from Shock Trauma Center satellite pharmacy to nursing stations \n✔ Evaluated usage of paper-based Trauma residents handbook \n✔ Processed data and publications preparation for vital signs algorithm for displaying operating room activity on VideoBoard System in Shock Trauma Center to reduce room turnover times (data powered by BedMaster) University of Waterloo MASc,  Systems Design Engineering , Human Systems specialization 2002  – 2004 I applied Work Domain Analysis to model the aircraft collision domain, developed traffic detection interfaces using Ecological Interface Design (EID) principles, and quantified efficacy of EID-enhanced displays for pilot trust in the TCAS II system. Research findings are directly applicable to design of large data dashboards and operator control displays. \n \nDissertation Title: \nImproving Pilot Trust in Automated Collision Detection and Avoidance With Ecological Interface Design \n \nKeywords: TCAS, collision detection and avoidance, pilot trust, Ecological Interface Design (EID), Work Domain Analysis (WDA) Activities and Societies:  Advanced Interface Design Laboratory University of Waterloo MASc,  Systems Design Engineering , Human Systems specialization 2002  – 2004 I applied Work Domain Analysis to model the aircraft collision domain, developed traffic detection interfaces using Ecological Interface Design (EID) principles, and quantified efficacy of EID-enhanced displays for pilot trust in the TCAS II system. Research findings are directly applicable to design of large data dashboards and operator control displays. \n \nDissertation Title: \nImproving Pilot Trust in Automated Collision Detection and Avoidance With Ecological Interface Design \n \nKeywords: TCAS, collision detection and avoidance, pilot trust, Ecological Interface Design (EID), Work Domain Analysis (WDA) Activities and Societies:  Advanced Interface Design Laboratory University of Waterloo MASc,  Systems Design Engineering , Human Systems specialization 2002  – 2004 I applied Work Domain Analysis to model the aircraft collision domain, developed traffic detection interfaces using Ecological Interface Design (EID) principles, and quantified efficacy of EID-enhanced displays for pilot trust in the TCAS II system. Research findings are directly applicable to design of large data dashboards and operator control displays. \n \nDissertation Title: \nImproving Pilot Trust in Automated Collision Detection and Avoidance With Ecological Interface Design \n \nKeywords: TCAS, collision detection and avoidance, pilot trust, Ecological Interface Design (EID), Work Domain Analysis (WDA) Activities and Societies:  Advanced Interface Design Laboratory University of Waterloo BASc, Honours,  Systems Design Engineering 1997  – 2002 Graduated with Management Sciences Option \nSpecialized in Human Factors and Interface Design Activities and Societies:  Canadian Undergraduate Technology Conference ,  Logistics Director University of Waterloo BASc, Honours,  Systems Design Engineering 1997  – 2002 Graduated with Management Sciences Option \nSpecialized in Human Factors and Interface Design Activities and Societies:  Canadian Undergraduate Technology Conference ,  Logistics Director University of Waterloo BASc, Honours,  Systems Design Engineering 1997  – 2002 Graduated with Management Sciences Option \nSpecialized in Human Factors and Interface Design Activities and Societies:  Canadian Undergraduate Technology Conference ,  Logistics Director Honors & Awards Mitacs Elevate Industrial Fellowship, $70,000 value Mitacs September 2010 Selected for industry-matched award, valued at $70,000 for advanced mobile healthcare applications research Student Editorial Board Member, JAMIA Journal of American Medical Informatics Association 2006 Awarded tenure on Student Editorial Board to involve in journal article peer-review process, JAMIA, 2006-2009 Doctoral Dissertation Fellowship UMBC, Baltimore, Maryland September 2009 Awarded dissertation fellowship, used to help finance completion of PhD dissertation. Successfully defended PhD on November 17, 2010. Mitacs Elevate Industrial Fellowship, $70,000 value Mitacs September 2010 Selected for industry-matched award, valued at $70,000 for advanced mobile healthcare applications research Mitacs Elevate Industrial Fellowship, $70,000 value Mitacs September 2010 Selected for industry-matched award, valued at $70,000 for advanced mobile healthcare applications research Mitacs Elevate Industrial Fellowship, $70,000 value Mitacs September 2010 Selected for industry-matched award, valued at $70,000 for advanced mobile healthcare applications research Student Editorial Board Member, JAMIA Journal of American Medical Informatics Association 2006 Awarded tenure on Student Editorial Board to involve in journal article peer-review process, JAMIA, 2006-2009 Student Editorial Board Member, JAMIA Journal of American Medical Informatics Association 2006 Awarded tenure on Student Editorial Board to involve in journal article peer-review process, JAMIA, 2006-2009 Student Editorial Board Member, JAMIA Journal of American Medical Informatics Association 2006 Awarded tenure on Student Editorial Board to involve in journal article peer-review process, JAMIA, 2006-2009 Doctoral Dissertation Fellowship UMBC, Baltimore, Maryland September 2009 Awarded dissertation fellowship, used to help finance completion of PhD dissertation. Successfully defended PhD on November 17, 2010. Doctoral Dissertation Fellowship UMBC, Baltimore, Maryland September 2009 Awarded dissertation fellowship, used to help finance completion of PhD dissertation. Successfully defended PhD on November 17, 2010. Doctoral Dissertation Fellowship UMBC, Baltimore, Maryland September 2009 Awarded dissertation fellowship, used to help finance completion of PhD dissertation. Successfully defended PhD on November 17, 2010. ", "Skills Research Design User Experience Machine Learning User Interface Design Statistics Ethnography Human Computer... User Research Heuristic Evaluation User-centered Design Human Factors Skills  Research Design User Experience Machine Learning User Interface Design Statistics Ethnography Human Computer... User Research Heuristic Evaluation User-centered Design Human Factors Research Design User Experience Machine Learning User Interface Design Statistics Ethnography Human Computer... User Research Heuristic Evaluation User-centered Design Human Factors Research Design User Experience Machine Learning User Interface Design Statistics Ethnography Human Computer... User Research Heuristic Evaluation User-centered Design Human Factors ", "Experience Director of User Research GrubHub Inc. January 2014  – Present (1 year 8 months) Chicago, IL User Experience Researcher GrubHub.com 2011  –  January 2014  (3 years) Instructor DePaul University November 2008  –  January 2011  (2 years 3 months) Sr. Interaction Designer Motorola July 2007  –  October 2010  (3 years 4 months) Instructor Carnegie Mellon University January 2007  –  May 2007  (5 months) Multimedia Intern Motorola June 2006  –  September 2006  (4 months) Project Manager | Multimedia Designer Rockwell Automation May 2003  –  August 2005  (2 years 4 months) Instructor Milwaukee Institute of Art & Design January 2005  –  May 2005  (5 months) Director of User Research GrubHub Inc. January 2014  – Present (1 year 8 months) Chicago, IL Director of User Research GrubHub Inc. January 2014  – Present (1 year 8 months) Chicago, IL User Experience Researcher GrubHub.com 2011  –  January 2014  (3 years) User Experience Researcher GrubHub.com 2011  –  January 2014  (3 years) Instructor DePaul University November 2008  –  January 2011  (2 years 3 months) Instructor DePaul University November 2008  –  January 2011  (2 years 3 months) Sr. Interaction Designer Motorola July 2007  –  October 2010  (3 years 4 months) Sr. Interaction Designer Motorola July 2007  –  October 2010  (3 years 4 months) Instructor Carnegie Mellon University January 2007  –  May 2007  (5 months) Instructor Carnegie Mellon University January 2007  –  May 2007  (5 months) Multimedia Intern Motorola June 2006  –  September 2006  (4 months) Multimedia Intern Motorola June 2006  –  September 2006  (4 months) Project Manager | Multimedia Designer Rockwell Automation May 2003  –  August 2005  (2 years 4 months) Project Manager | Multimedia Designer Rockwell Automation May 2003  –  August 2005  (2 years 4 months) Instructor Milwaukee Institute of Art & Design January 2005  –  May 2005  (5 months) Instructor Milwaukee Institute of Art & Design January 2005  –  May 2005  (5 months) Skills User Experience Interaction Design User-centered Design Usability Testing User Research Information Architecture User Interface Design Experience Design Heuristic Evaluation Design Strategy Contextual Inquiry Human Computer... User Interface User Experience Design Information Design Rapid Prototyping Paper Prototyping Usability User Scenarios Usability Engineering Persona Ethnography Wire Framing Human Factors Information... Research Design Design Management Card Sorting OmniGraffle Concept Design Mobile Design Iterative Design Product Design Storyboarding Task Analysis Axure Mobile Devices Concept Development Service Design Data Visualization Participatory Design Industrial Design Mockups Design Thinking Mobile Applications Wireframes Concept Generation See 32+     See less Skills  User Experience Interaction Design User-centered Design Usability Testing User Research Information Architecture User Interface Design Experience Design Heuristic Evaluation Design Strategy Contextual Inquiry Human Computer... User Interface User Experience Design Information Design Rapid Prototyping Paper Prototyping Usability User Scenarios Usability Engineering Persona Ethnography Wire Framing Human Factors Information... Research Design Design Management Card Sorting OmniGraffle Concept Design Mobile Design Iterative Design Product Design Storyboarding Task Analysis Axure Mobile Devices Concept Development Service Design Data Visualization Participatory Design Industrial Design Mockups Design Thinking Mobile Applications Wireframes Concept Generation See 32+     See less User Experience Interaction Design User-centered Design Usability Testing User Research Information Architecture User Interface Design Experience Design Heuristic Evaluation Design Strategy Contextual Inquiry Human Computer... User Interface User Experience Design Information Design Rapid Prototyping Paper Prototyping Usability User Scenarios Usability Engineering Persona Ethnography Wire Framing Human Factors Information... Research Design Design Management Card Sorting OmniGraffle Concept Design Mobile Design Iterative Design Product Design Storyboarding Task Analysis Axure Mobile Devices Concept Development Service Design Data Visualization Participatory Design Industrial Design Mockups Design Thinking Mobile Applications Wireframes Concept Generation See 32+     See less User Experience Interaction Design User-centered Design Usability Testing User Research Information Architecture User Interface Design Experience Design Heuristic Evaluation Design Strategy Contextual Inquiry Human Computer... User Interface User Experience Design Information Design Rapid Prototyping Paper Prototyping Usability User Scenarios Usability Engineering Persona Ethnography Wire Framing Human Factors Information... Research Design Design Management Card Sorting OmniGraffle Concept Design Mobile Design Iterative Design Product Design Storyboarding Task Analysis Axure Mobile Devices Concept Development Service Design Data Visualization Participatory Design Industrial Design Mockups Design Thinking Mobile Applications Wireframes Concept Generation See 32+     See less Education Carnegie Mellon University MDes 2005  – 2007 Milwaukee Institute of Art & Design BFA 2000  – 2003 Savannah College of Art and Design 1998  – 2000 Carnegie Mellon University MDes 2005  – 2007 Carnegie Mellon University MDes 2005  – 2007 Carnegie Mellon University MDes 2005  – 2007 Milwaukee Institute of Art & Design BFA 2000  – 2003 Milwaukee Institute of Art & Design BFA 2000  – 2003 Milwaukee Institute of Art & Design BFA 2000  – 2003 Savannah College of Art and Design 1998  – 2000 Savannah College of Art and Design 1998  – 2000 Savannah College of Art and Design 1998  – 2000 ", "Languages French Spanish French Spanish French Spanish Skills User Experience User Experience Testing Usability Testing User Research A/B testing Market Research Card Sorting Contextual Interviews User Interface Design Multivariate Testing Contextual Inquiry Remote User Testing User-centered Design Requirements Gathering Web Analytics Usability Digital Strategy Product Management Business Analysis Cross-functional Team... SEO SDLC Strategy Management Analysis See 10+     See less Skills  User Experience User Experience Testing Usability Testing User Research A/B testing Market Research Card Sorting Contextual Interviews User Interface Design Multivariate Testing Contextual Inquiry Remote User Testing User-centered Design Requirements Gathering Web Analytics Usability Digital Strategy Product Management Business Analysis Cross-functional Team... SEO SDLC Strategy Management Analysis See 10+     See less User Experience User Experience Testing Usability Testing User Research A/B testing Market Research Card Sorting Contextual Interviews User Interface Design Multivariate Testing Contextual Inquiry Remote User Testing User-centered Design Requirements Gathering Web Analytics Usability Digital Strategy Product Management Business Analysis Cross-functional Team... SEO SDLC Strategy Management Analysis See 10+     See less User Experience User Experience Testing Usability Testing User Research A/B testing Market Research Card Sorting Contextual Interviews User Interface Design Multivariate Testing Contextual Inquiry Remote User Testing User-centered Design Requirements Gathering Web Analytics Usability Digital Strategy Product Management Business Analysis Cross-functional Team... SEO SDLC Strategy Management Analysis See 10+     See less ", "Experience Director of User Research, ISUX Tencent January 2015  – Present (8 months) Shenzhen - Initiate, manage & execute research projects for major Tencent products including QQ, Qzone, QQ Music, QQ VIP services, QCloud, etc. Besides research projects that are reactive to product cycle like usability testing & churn analysis, I drive a lot of proactive research projects to understand user needs and map these needs to the current UX we are delivering in order to spot new opportunities for design and product teams. \n \n- Present research findings to upper management and discuss with them to make them aware of new trends and opportunities.  \n- Lead and host brainstorming workshops for designers to facilitate their generation of solution ideas in respond to our research findings. \n- Follow through detailed findings with product owners to make sure design solutions are implemented in the upcoming releases. \n \n- Built from scratch and manage a user research team of 18 people, including researchers based in Shenzhen, Shanghai and Beijing. Coach both user researchers and designers on research methodology, project management and other soft skills as well. \n \n- Launched internal tools to boost research productivity -  \n(1) a CRM tool for managing our relationships with our testing participants recruited from QQ tips, WeChat official accounts and recruiting agencies;  \n(2) a click through rate visualization tools for mobile apps;  \n(3) a brainstorming tool to let project teams to read about real user stories we have collected over years and contribute solution ideas. \n \n- Board member of User Research discipline in the Professional Development Board of Tencent.  User Research Manager, ISUX Tencent May 2011  – Present (4 years 4 months) Shenzhen Interaction Designer Yahoo! June 2006  –  April 2011  (4 years 11 months) Hong Kong - Designed UX for Yahoo! HK websites including Music, Video, Search & Dictionary.  \n- Conducted usability testing, user interviews & online surveys to inform design & product strategies. \n \n- Successfully localized US-designed Yahoo! Search user interface for Hong Kong, Taiwan & Korea markets without harming user experience & search ad revenue. \n \n- Researched & designed Yahoo! KPost for both HK & Korea markets, which was an user-governed sharing platform connecting people who search the same keyword. http://www.ysearchblog.com/2010/11/30/introducing-yahoo-kpost-in-korea-and-hong-kong/ Lecturer University of Macau February 2008  –  May 2009  (1 year 4 months) Gave lectures on Advertising Psychology. Designed course structure & supervised course projects. Market Analyst KOTRA November 2005  –  June 2006  (8 months) Hong Kong Conducted market research to aid Korean businesses to increase market share in HK, as well as macro-economic research focusing on Asian economies including China, Korea & Japan. User Experience Planner e-Crusade Marketing Ltd. January 2005  –  July 2005  (7 months) Hong Kong Designed interaction of Coca-cola official site in HK http://icoke.hk Assistant User Experience Designer Protel Communications Ltd. August 2004  –  January 2005  (6 months) Director of User Research, ISUX Tencent January 2015  – Present (8 months) Shenzhen - Initiate, manage & execute research projects for major Tencent products including QQ, Qzone, QQ Music, QQ VIP services, QCloud, etc. Besides research projects that are reactive to product cycle like usability testing & churn analysis, I drive a lot of proactive research projects to understand user needs and map these needs to the current UX we are delivering in order to spot new opportunities for design and product teams. \n \n- Present research findings to upper management and discuss with them to make them aware of new trends and opportunities.  \n- Lead and host brainstorming workshops for designers to facilitate their generation of solution ideas in respond to our research findings. \n- Follow through detailed findings with product owners to make sure design solutions are implemented in the upcoming releases. \n \n- Built from scratch and manage a user research team of 18 people, including researchers based in Shenzhen, Shanghai and Beijing. Coach both user researchers and designers on research methodology, project management and other soft skills as well. \n \n- Launched internal tools to boost research productivity -  \n(1) a CRM tool for managing our relationships with our testing participants recruited from QQ tips, WeChat official accounts and recruiting agencies;  \n(2) a click through rate visualization tools for mobile apps;  \n(3) a brainstorming tool to let project teams to read about real user stories we have collected over years and contribute solution ideas. \n \n- Board member of User Research discipline in the Professional Development Board of Tencent.  Director of User Research, ISUX Tencent January 2015  – Present (8 months) Shenzhen - Initiate, manage & execute research projects for major Tencent products including QQ, Qzone, QQ Music, QQ VIP services, QCloud, etc. Besides research projects that are reactive to product cycle like usability testing & churn analysis, I drive a lot of proactive research projects to understand user needs and map these needs to the current UX we are delivering in order to spot new opportunities for design and product teams. \n \n- Present research findings to upper management and discuss with them to make them aware of new trends and opportunities.  \n- Lead and host brainstorming workshops for designers to facilitate their generation of solution ideas in respond to our research findings. \n- Follow through detailed findings with product owners to make sure design solutions are implemented in the upcoming releases. \n \n- Built from scratch and manage a user research team of 18 people, including researchers based in Shenzhen, Shanghai and Beijing. Coach both user researchers and designers on research methodology, project management and other soft skills as well. \n \n- Launched internal tools to boost research productivity -  \n(1) a CRM tool for managing our relationships with our testing participants recruited from QQ tips, WeChat official accounts and recruiting agencies;  \n(2) a click through rate visualization tools for mobile apps;  \n(3) a brainstorming tool to let project teams to read about real user stories we have collected over years and contribute solution ideas. \n \n- Board member of User Research discipline in the Professional Development Board of Tencent.  User Research Manager, ISUX Tencent May 2011  – Present (4 years 4 months) Shenzhen User Research Manager, ISUX Tencent May 2011  – Present (4 years 4 months) Shenzhen Interaction Designer Yahoo! June 2006  –  April 2011  (4 years 11 months) Hong Kong - Designed UX for Yahoo! HK websites including Music, Video, Search & Dictionary.  \n- Conducted usability testing, user interviews & online surveys to inform design & product strategies. \n \n- Successfully localized US-designed Yahoo! Search user interface for Hong Kong, Taiwan & Korea markets without harming user experience & search ad revenue. \n \n- Researched & designed Yahoo! KPost for both HK & Korea markets, which was an user-governed sharing platform connecting people who search the same keyword. http://www.ysearchblog.com/2010/11/30/introducing-yahoo-kpost-in-korea-and-hong-kong/ Interaction Designer Yahoo! June 2006  –  April 2011  (4 years 11 months) Hong Kong - Designed UX for Yahoo! HK websites including Music, Video, Search & Dictionary.  \n- Conducted usability testing, user interviews & online surveys to inform design & product strategies. \n \n- Successfully localized US-designed Yahoo! Search user interface for Hong Kong, Taiwan & Korea markets without harming user experience & search ad revenue. \n \n- Researched & designed Yahoo! KPost for both HK & Korea markets, which was an user-governed sharing platform connecting people who search the same keyword. http://www.ysearchblog.com/2010/11/30/introducing-yahoo-kpost-in-korea-and-hong-kong/ Lecturer University of Macau February 2008  –  May 2009  (1 year 4 months) Gave lectures on Advertising Psychology. Designed course structure & supervised course projects. Lecturer University of Macau February 2008  –  May 2009  (1 year 4 months) Gave lectures on Advertising Psychology. Designed course structure & supervised course projects. Market Analyst KOTRA November 2005  –  June 2006  (8 months) Hong Kong Conducted market research to aid Korean businesses to increase market share in HK, as well as macro-economic research focusing on Asian economies including China, Korea & Japan. Market Analyst KOTRA November 2005  –  June 2006  (8 months) Hong Kong Conducted market research to aid Korean businesses to increase market share in HK, as well as macro-economic research focusing on Asian economies including China, Korea & Japan. User Experience Planner e-Crusade Marketing Ltd. January 2005  –  July 2005  (7 months) Hong Kong Designed interaction of Coca-cola official site in HK http://icoke.hk User Experience Planner e-Crusade Marketing Ltd. January 2005  –  July 2005  (7 months) Hong Kong Designed interaction of Coca-cola official site in HK http://icoke.hk Assistant User Experience Designer Protel Communications Ltd. August 2004  –  January 2005  (6 months) Assistant User Experience Designer Protel Communications Ltd. August 2004  –  January 2005  (6 months) Languages English Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Full professional proficiency English Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Full professional proficiency English Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills Usability Testing User Experience User Research User-centered Design Interaction Design Skills  Usability Testing User Experience User Research User-centered Design Interaction Design Usability Testing User Experience User Research User-centered Design Interaction Design Usability Testing User Experience User Research User-centered Design Interaction Design Education The Chinese University of Hong Kong MPhil,  Psychology 2002  – 2004 The Chinese University of Hong Kong BSSc,  Psychology 1999  – 2002 The Chinese University of Hong Kong MPhil,  Psychology 2002  – 2004 The Chinese University of Hong Kong MPhil,  Psychology 2002  – 2004 The Chinese University of Hong Kong MPhil,  Psychology 2002  – 2004 The Chinese University of Hong Kong BSSc,  Psychology 1999  – 2002 The Chinese University of Hong Kong BSSc,  Psychology 1999  – 2002 The Chinese University of Hong Kong BSSc,  Psychology 1999  – 2002 ", "Summary Experienced research leader with global expertise, passionate about building great user experiences, comfortable working in both digital and physical product spaces. Capable of organizing and executing all aspects of the research process, from study design and data collection (in the field or in the lab) to quant/qual analysis and presentation of findings and actionable recommendations. Dedicated team lead with a progressive management style, emphasizing openness, collaboration, and autonomy. Author of a book and 25 UX-related articles and book contributions, and a frequent conference speaker. Summary Experienced research leader with global expertise, passionate about building great user experiences, comfortable working in both digital and physical product spaces. Capable of organizing and executing all aspects of the research process, from study design and data collection (in the field or in the lab) to quant/qual analysis and presentation of findings and actionable recommendations. Dedicated team lead with a progressive management style, emphasizing openness, collaboration, and autonomy. Author of a book and 25 UX-related articles and book contributions, and a frequent conference speaker. Experienced research leader with global expertise, passionate about building great user experiences, comfortable working in both digital and physical product spaces. Capable of organizing and executing all aspects of the research process, from study design and data collection (in the field or in the lab) to quant/qual analysis and presentation of findings and actionable recommendations. Dedicated team lead with a progressive management style, emphasizing openness, collaboration, and autonomy. Author of a book and 25 UX-related articles and book contributions, and a frequent conference speaker. Experienced research leader with global expertise, passionate about building great user experiences, comfortable working in both digital and physical product spaces. Capable of organizing and executing all aspects of the research process, from study design and data collection (in the field or in the lab) to quant/qual analysis and presentation of findings and actionable recommendations. Dedicated team lead with a progressive management style, emphasizing openness, collaboration, and autonomy. Author of a book and 25 UX-related articles and book contributions, and a frequent conference speaker. Experience Director of User Research Indiegogo August 2014  – Present (1 year 1 month) San Francisco Director of User Research Indiegogo August 2014  – Present (1 year 1 month) San Francisco Director of User Research Indiegogo August 2014  – Present (1 year 1 month) San Francisco Languages English Polish German English Polish German English Polish German Skills User Experience Usability Testing User Research Eye Tracking Heuristic Evaluation Human Factors Statistics Human Computer... Usability Usability Engineering Ethnography Contextual Inquiry Task Analysis Focus Groups Card Sorting Survey Design See 1+     See less Skills  User Experience Usability Testing User Research Eye Tracking Heuristic Evaluation Human Factors Statistics Human Computer... Usability Usability Engineering Ethnography Contextual Inquiry Task Analysis Focus Groups Card Sorting Survey Design See 1+     See less User Experience Usability Testing User Research Eye Tracking Heuristic Evaluation Human Factors Statistics Human Computer... Usability Usability Engineering Ethnography Contextual Inquiry Task Analysis Focus Groups Card Sorting Survey Design See 1+     See less User Experience Usability Testing User Research Eye Tracking Heuristic Evaluation Human Factors Statistics Human Computer... Usability Usability Engineering Ethnography Contextual Inquiry Task Analysis Focus Groups Card Sorting Survey Design See 1+     See less Education University of Illinois at Urbana-Champaign MS 2000  – 2002 DePaul University MS 2002  – 2004 University of North Carolina at Charlotte BS 1998  – 2000 University of Illinois at Urbana-Champaign MS 2000  – 2002 University of Illinois at Urbana-Champaign MS 2000  – 2002 University of Illinois at Urbana-Champaign MS 2000  – 2002 DePaul University MS 2002  – 2004 DePaul University MS 2002  – 2004 DePaul University MS 2002  – 2004 University of North Carolina at Charlotte BS 1998  – 2000 University of North Carolina at Charlotte BS 1998  – 2000 University of North Carolina at Charlotte BS 1998  – 2000 Honors & Awards ", "Summary Specialties:UX Strategy, Building In-House UX Teams, Information Architecture Design, Managing Off-Shore UX Teams, User Research, Usability Testing, Usability Expert Reviews, Cognitive Task Analyis (Expert Systems), Operator Workload, Workplace Ergonomics Summary Specialties:UX Strategy, Building In-House UX Teams, Information Architecture Design, Managing Off-Shore UX Teams, User Research, Usability Testing, Usability Expert Reviews, Cognitive Task Analyis (Expert Systems), Operator Workload, Workplace Ergonomics Specialties:UX Strategy, Building In-House UX Teams, Information Architecture Design, Managing Off-Shore UX Teams, User Research, Usability Testing, Usability Expert Reviews, Cognitive Task Analyis (Expert Systems), Operator Workload, Workplace Ergonomics Specialties:UX Strategy, Building In-House UX Teams, Information Architecture Design, Managing Off-Shore UX Teams, User Research, Usability Testing, Usability Expert Reviews, Cognitive Task Analyis (Expert Systems), Operator Workload, Workplace Ergonomics Experience User Experience Researcher The Creative Group June 2013  –  June 2014  (1 year 1 month) Audible.com Consulted at Audible.com and established a user experience research discipline within the design department in the support of major lines of business. Activities included usability testing of current and planned service enhancements as well as early design concepts. User behavioral research was also undertaken to better understand consumers' behavioral tendencies as related to the use of devices such as a mobile smartphones. All efforts were focused on the discovery of user's expectations (mindset) when interacting with e-commerce sites in the context of discretionary spending by consumers. Principal Engagement Leader TandemSeven March 2011  –  April 2012  (1 year 2 months) Greater New York City Area Served as project manager in support of Internet based software solutions as well as iPad solutions for large financial institutions as well as for financial product vendors across different financial sectors.  \n \nDelivered solutions exceeded clients’ as well as users’ expectations. \n \nResponsibilities included developing and managing project plans, identifying user and business requirements, managing budget adherence, instituting risk management practices, performing quality assurance for the delivered solution as well as formulating and delivering project related client communications, e.g., conducting weekly client project status meetings and producing weekly project status reports. VP Manager/Technical Specialist of Usability & User Interface Standards Citi 1998  –  March 2011  (13 years) Serving as technical lead and manager in support of Internet based corporate banking applications for cash management that are marketed as CitiDirect Online Banking and CitiDirectBE for Citi Global Transaction Services. Responsibilities have included developing and institutionalizing user interface style guide standards across a suite of services, developing and implementing a process to ensure usability assessments are conducted throughout the system development life cycle and providing direct support to the regional business units with respect to customer usability issues. Responsibilities have also included managing offshore resources in researching & defining user interface style guide standards. \n \nGlobal Finance has awarded CitiDirect Online Banking best global corporate Internet banking platform for 10 consecutive years (2010 - 2002). Greenwich Associates named CitiDirect Online Banking the top global corporate Internet banking platform for 5 consecutive years (2010 - 2006). \n \nFinancial-i awarded CitiDirectBE in 2009 the innovation of the year in corporate cash management. Celent named CitiDirectBE in 2010 the model online bank for corporate cash management. User Experience Researcher The Creative Group June 2013  –  June 2014  (1 year 1 month) Audible.com Consulted at Audible.com and established a user experience research discipline within the design department in the support of major lines of business. Activities included usability testing of current and planned service enhancements as well as early design concepts. User behavioral research was also undertaken to better understand consumers' behavioral tendencies as related to the use of devices such as a mobile smartphones. All efforts were focused on the discovery of user's expectations (mindset) when interacting with e-commerce sites in the context of discretionary spending by consumers. User Experience Researcher The Creative Group June 2013  –  June 2014  (1 year 1 month) Audible.com Consulted at Audible.com and established a user experience research discipline within the design department in the support of major lines of business. Activities included usability testing of current and planned service enhancements as well as early design concepts. User behavioral research was also undertaken to better understand consumers' behavioral tendencies as related to the use of devices such as a mobile smartphones. All efforts were focused on the discovery of user's expectations (mindset) when interacting with e-commerce sites in the context of discretionary spending by consumers. Principal Engagement Leader TandemSeven March 2011  –  April 2012  (1 year 2 months) Greater New York City Area Served as project manager in support of Internet based software solutions as well as iPad solutions for large financial institutions as well as for financial product vendors across different financial sectors.  \n \nDelivered solutions exceeded clients’ as well as users’ expectations. \n \nResponsibilities included developing and managing project plans, identifying user and business requirements, managing budget adherence, instituting risk management practices, performing quality assurance for the delivered solution as well as formulating and delivering project related client communications, e.g., conducting weekly client project status meetings and producing weekly project status reports. Principal Engagement Leader TandemSeven March 2011  –  April 2012  (1 year 2 months) Greater New York City Area Served as project manager in support of Internet based software solutions as well as iPad solutions for large financial institutions as well as for financial product vendors across different financial sectors.  \n \nDelivered solutions exceeded clients’ as well as users’ expectations. \n \nResponsibilities included developing and managing project plans, identifying user and business requirements, managing budget adherence, instituting risk management practices, performing quality assurance for the delivered solution as well as formulating and delivering project related client communications, e.g., conducting weekly client project status meetings and producing weekly project status reports. VP Manager/Technical Specialist of Usability & User Interface Standards Citi 1998  –  March 2011  (13 years) Serving as technical lead and manager in support of Internet based corporate banking applications for cash management that are marketed as CitiDirect Online Banking and CitiDirectBE for Citi Global Transaction Services. Responsibilities have included developing and institutionalizing user interface style guide standards across a suite of services, developing and implementing a process to ensure usability assessments are conducted throughout the system development life cycle and providing direct support to the regional business units with respect to customer usability issues. Responsibilities have also included managing offshore resources in researching & defining user interface style guide standards. \n \nGlobal Finance has awarded CitiDirect Online Banking best global corporate Internet banking platform for 10 consecutive years (2010 - 2002). Greenwich Associates named CitiDirect Online Banking the top global corporate Internet banking platform for 5 consecutive years (2010 - 2006). \n \nFinancial-i awarded CitiDirectBE in 2009 the innovation of the year in corporate cash management. Celent named CitiDirectBE in 2010 the model online bank for corporate cash management. VP Manager/Technical Specialist of Usability & User Interface Standards Citi 1998  –  March 2011  (13 years) Serving as technical lead and manager in support of Internet based corporate banking applications for cash management that are marketed as CitiDirect Online Banking and CitiDirectBE for Citi Global Transaction Services. Responsibilities have included developing and institutionalizing user interface style guide standards across a suite of services, developing and implementing a process to ensure usability assessments are conducted throughout the system development life cycle and providing direct support to the regional business units with respect to customer usability issues. Responsibilities have also included managing offshore resources in researching & defining user interface style guide standards. \n \nGlobal Finance has awarded CitiDirect Online Banking best global corporate Internet banking platform for 10 consecutive years (2010 - 2002). Greenwich Associates named CitiDirect Online Banking the top global corporate Internet banking platform for 5 consecutive years (2010 - 2006). \n \nFinancial-i awarded CitiDirectBE in 2009 the innovation of the year in corporate cash management. Celent named CitiDirectBE in 2010 the model online bank for corporate cash management. Skills Usability Testing User Research User Experience Design Information Architecture User Experience Usability Business Analysis SDLC Project Management User Interface User Acceptance Testing Skills  Usability Testing User Research User Experience Design Information Architecture User Experience Usability Business Analysis SDLC Project Management User Interface User Acceptance Testing Usability Testing User Research User Experience Design Information Architecture User Experience Usability Business Analysis SDLC Project Management User Interface User Acceptance Testing Usability Testing User Research User Experience Design Information Architecture User Experience Usability Business Analysis SDLC Project Management User Interface User Acceptance Testing Education The George Washington University - School of Business Master's Certificate,  Project Management in Information Technology University of Cincinnati PhD,  Cognitive Psychology University of Cincinnati M.A.,  Experimental Psychology University of Virginia B.A. with Honors,  Psychology & Biology The George Washington University - School of Business Master's Certificate,  Project Management in Information Technology The George Washington University - School of Business Master's Certificate,  Project Management in Information Technology The George Washington University - School of Business Master's Certificate,  Project Management in Information Technology University of Cincinnati PhD,  Cognitive Psychology University of Cincinnati PhD,  Cognitive Psychology University of Cincinnati PhD,  Cognitive Psychology University of Cincinnati M.A.,  Experimental Psychology University of Cincinnati M.A.,  Experimental Psychology University of Cincinnati M.A.,  Experimental Psychology University of Virginia B.A. with Honors,  Psychology & Biology University of Virginia B.A. with Honors,  Psychology & Biology University of Virginia B.A. with Honors,  Psychology & Biology Honors & Awards Additional Honors & Awards Cooper-Hewitt National Design Museum – Smithsonian Institution \nOct 4, 1994 – Feb 19, 1995, “Good Offices and Beyond: The Evolution of the Workplace” \nCo-designed screen-based telephone with ECCO Design Group (Eric Chang) & Robert Springer (NYNEX Science & Technology, Inc.) Additional Honors & Awards Cooper-Hewitt National Design Museum – Smithsonian Institution \nOct 4, 1994 – Feb 19, 1995, “Good Offices and Beyond: The Evolution of the Workplace” \nCo-designed screen-based telephone with ECCO Design Group (Eric Chang) & Robert Springer (NYNEX Science & Technology, Inc.) Additional Honors & Awards Cooper-Hewitt National Design Museum – Smithsonian Institution \nOct 4, 1994 – Feb 19, 1995, “Good Offices and Beyond: The Evolution of the Workplace” \nCo-designed screen-based telephone with ECCO Design Group (Eric Chang) & Robert Springer (NYNEX Science & Technology, Inc.) Additional Honors & Awards Cooper-Hewitt National Design Museum – Smithsonian Institution \nOct 4, 1994 – Feb 19, 1995, “Good Offices and Beyond: The Evolution of the Workplace” \nCo-designed screen-based telephone with ECCO Design Group (Eric Chang) & Robert Springer (NYNEX Science & Technology, Inc.) ", "Skills Research facilitator E-learning Usability Testing Contextual Inquiry User Experience Requirements Gathering E-commerce User-centered Design Information Design Technical Communication E-Learning Usability Mobile Applications Training Human Computer... Persona Information Architecture Web Applications Content Management Technical Writing Teaching Visio Leadership User Interface Design User Research Distance Learning Qualitative Research Instructional Design Task Analysis Interaction Design Higher Education Wireframes Research Design Human Factors Card Sorting Heuristic Evaluation Ethnography Usability Engineering Mobile Devices See 25+     See less Skills  Research facilitator E-learning Usability Testing Contextual Inquiry User Experience Requirements Gathering E-commerce User-centered Design Information Design Technical Communication E-Learning Usability Mobile Applications Training Human Computer... Persona Information Architecture Web Applications Content Management Technical Writing Teaching Visio Leadership User Interface Design User Research Distance Learning Qualitative Research Instructional Design Task Analysis Interaction Design Higher Education Wireframes Research Design Human Factors Card Sorting Heuristic Evaluation Ethnography Usability Engineering Mobile Devices See 25+     See less Research facilitator E-learning Usability Testing Contextual Inquiry User Experience Requirements Gathering E-commerce User-centered Design Information Design Technical Communication E-Learning Usability Mobile Applications Training Human Computer... Persona Information Architecture Web Applications Content Management Technical Writing Teaching Visio Leadership User Interface Design User Research Distance Learning Qualitative Research Instructional Design Task Analysis Interaction Design Higher Education Wireframes Research Design Human Factors Card Sorting Heuristic Evaluation Ethnography Usability Engineering Mobile Devices See 25+     See less Research facilitator E-learning Usability Testing Contextual Inquiry User Experience Requirements Gathering E-commerce User-centered Design Information Design Technical Communication E-Learning Usability Mobile Applications Training Human Computer... Persona Information Architecture Web Applications Content Management Technical Writing Teaching Visio Leadership User Interface Design User Research Distance Learning Qualitative Research Instructional Design Task Analysis Interaction Design Higher Education Wireframes Research Design Human Factors Card Sorting Heuristic Evaluation Ethnography Usability Engineering Mobile Devices See 25+     See less Honors & Awards ", "Experience Director of User Research Pearson 2005  – Present (10 years) Sr. Human Factors Engineer intel 1998  –  2005  (7 years) Director of User Research Pearson 2005  – Present (10 years) Director of User Research Pearson 2005  – Present (10 years) Sr. Human Factors Engineer intel 1998  –  2005  (7 years) Sr. Human Factors Engineer intel 1998  –  2005  (7 years) Education The University of South Dakota Ph.D.,  Human Factors 1996  – 2002 Buena Vista University BA,  Psychology / Computer Science 1986  – 1992 The University of South Dakota Ph.D.,  Human Factors 1996  – 2002 The University of South Dakota Ph.D.,  Human Factors 1996  – 2002 The University of South Dakota Ph.D.,  Human Factors 1996  – 2002 Buena Vista University BA,  Psychology / Computer Science 1986  – 1992 Buena Vista University BA,  Psychology / Computer Science 1986  – 1992 Buena Vista University BA,  Psychology / Computer Science 1986  – 1992 ", "Experience Director - User Research Solutions UserZoom November 2014  – Present (10 months) San Francisco Bay Area Leading our Healthcare, Insurance, Telco/Communications and Consumer Internet groups.  \n \nUserZoom is the #1 Platform for Agile Usability Testing & User Experience Analytics for Healthcare organizations. Our incredibly robust and secure solution offers a quantitative and qualitative research platform to help UX/CX, Product Managers and Marketing professionals test and measure all aspects of the user experience across all devices and channels.  Director, UX Solutions YouEye May 2014  –  November 2014  (7 months) San Francisco Bay Area YouEye is an emerging platform for providing rapid insights for agile business. Our experience analytics platform is used by leading companies to rapidly gather information about how their applications, ecommerce sites, customer service, brand or product marketing are/are not working, and how to fix it. \n Director, Healthcare Research Solutions Fuze Box June 2012  –  May 2014  (2 years) San Francisco Bay Area Lead the Healthcare Solutions group. Strategizing with partners to leverage the power of video to drive remote insight solutions for consumer insights, market research and ux research teams.  \n Director of Enterprise Sales - EMEA Qualvu May 2010  –  April 2012  (2 years) Denver, CO Qualvu is the future of qualitative research, inspiring business decisions guided by the voice and face of the consumer. Through streamlined video-based technologies, we collect better human intelligence and deliver superior insights that drive decision making. The Qualvu proprietary platform enables multi-language, global research that drives online reports supported by actionable analysis and video highlights. Capturing behavioral and attitudinal feedback from home, work, in-store, and even in-vehicle, Qualvu delivers new levels of human access.  \n \nIn 2011, Qualvu more than tripled revenues – with over 1,400 projects in 30 countries.  \n \nIn conjunction with its 10th anniversary, the American Business Awards selected Qualvu as a finalist in its “Fastest Growing Tech Company of the Year” category, which recognizes companies for outstanding revenue growth. Business Development Executive Rx Pro Health June 2008  –  June 2010  (2 years 1 month) Rx Pro Health professional consulting and pharmacy staffing services provide temporary and permanent pharmacy jobs and recruitment services for positions in a wide variety of pharmacy settings. Rx Pro Health is part of AMN Healthcare, the nation’s largest healthcare staffing company. AMN and Rx Pro Health are proud to offer our pharmacy clients some of the most powerful and far-reaching recruitment resources available in the pharmacist hire and placement industry. We match the right candidates to each position, benefiting both the employers and pharmacy professionals we serve. Director - User Research Solutions UserZoom November 2014  – Present (10 months) San Francisco Bay Area Leading our Healthcare, Insurance, Telco/Communications and Consumer Internet groups.  \n \nUserZoom is the #1 Platform for Agile Usability Testing & User Experience Analytics for Healthcare organizations. Our incredibly robust and secure solution offers a quantitative and qualitative research platform to help UX/CX, Product Managers and Marketing professionals test and measure all aspects of the user experience across all devices and channels.  Director - User Research Solutions UserZoom November 2014  – Present (10 months) San Francisco Bay Area Leading our Healthcare, Insurance, Telco/Communications and Consumer Internet groups.  \n \nUserZoom is the #1 Platform for Agile Usability Testing & User Experience Analytics for Healthcare organizations. Our incredibly robust and secure solution offers a quantitative and qualitative research platform to help UX/CX, Product Managers and Marketing professionals test and measure all aspects of the user experience across all devices and channels.  Director, UX Solutions YouEye May 2014  –  November 2014  (7 months) San Francisco Bay Area YouEye is an emerging platform for providing rapid insights for agile business. Our experience analytics platform is used by leading companies to rapidly gather information about how their applications, ecommerce sites, customer service, brand or product marketing are/are not working, and how to fix it. \n Director, UX Solutions YouEye May 2014  –  November 2014  (7 months) San Francisco Bay Area YouEye is an emerging platform for providing rapid insights for agile business. Our experience analytics platform is used by leading companies to rapidly gather information about how their applications, ecommerce sites, customer service, brand or product marketing are/are not working, and how to fix it. \n Director, Healthcare Research Solutions Fuze Box June 2012  –  May 2014  (2 years) San Francisco Bay Area Lead the Healthcare Solutions group. Strategizing with partners to leverage the power of video to drive remote insight solutions for consumer insights, market research and ux research teams.  \n Director, Healthcare Research Solutions Fuze Box June 2012  –  May 2014  (2 years) San Francisco Bay Area Lead the Healthcare Solutions group. Strategizing with partners to leverage the power of video to drive remote insight solutions for consumer insights, market research and ux research teams.  \n Director of Enterprise Sales - EMEA Qualvu May 2010  –  April 2012  (2 years) Denver, CO Qualvu is the future of qualitative research, inspiring business decisions guided by the voice and face of the consumer. Through streamlined video-based technologies, we collect better human intelligence and deliver superior insights that drive decision making. The Qualvu proprietary platform enables multi-language, global research that drives online reports supported by actionable analysis and video highlights. Capturing behavioral and attitudinal feedback from home, work, in-store, and even in-vehicle, Qualvu delivers new levels of human access.  \n \nIn 2011, Qualvu more than tripled revenues – with over 1,400 projects in 30 countries.  \n \nIn conjunction with its 10th anniversary, the American Business Awards selected Qualvu as a finalist in its “Fastest Growing Tech Company of the Year” category, which recognizes companies for outstanding revenue growth. Director of Enterprise Sales - EMEA Qualvu May 2010  –  April 2012  (2 years) Denver, CO Qualvu is the future of qualitative research, inspiring business decisions guided by the voice and face of the consumer. Through streamlined video-based technologies, we collect better human intelligence and deliver superior insights that drive decision making. The Qualvu proprietary platform enables multi-language, global research that drives online reports supported by actionable analysis and video highlights. Capturing behavioral and attitudinal feedback from home, work, in-store, and even in-vehicle, Qualvu delivers new levels of human access.  \n \nIn 2011, Qualvu more than tripled revenues – with over 1,400 projects in 30 countries.  \n \nIn conjunction with its 10th anniversary, the American Business Awards selected Qualvu as a finalist in its “Fastest Growing Tech Company of the Year” category, which recognizes companies for outstanding revenue growth. Business Development Executive Rx Pro Health June 2008  –  June 2010  (2 years 1 month) Rx Pro Health professional consulting and pharmacy staffing services provide temporary and permanent pharmacy jobs and recruitment services for positions in a wide variety of pharmacy settings. Rx Pro Health is part of AMN Healthcare, the nation’s largest healthcare staffing company. AMN and Rx Pro Health are proud to offer our pharmacy clients some of the most powerful and far-reaching recruitment resources available in the pharmacist hire and placement industry. We match the right candidates to each position, benefiting both the employers and pharmacy professionals we serve. Business Development Executive Rx Pro Health June 2008  –  June 2010  (2 years 1 month) Rx Pro Health professional consulting and pharmacy staffing services provide temporary and permanent pharmacy jobs and recruitment services for positions in a wide variety of pharmacy settings. Rx Pro Health is part of AMN Healthcare, the nation’s largest healthcare staffing company. AMN and Rx Pro Health are proud to offer our pharmacy clients some of the most powerful and far-reaching recruitment resources available in the pharmacist hire and placement industry. We match the right candidates to each position, benefiting both the employers and pharmacy professionals we serve. Skills Leadership Customer Insight Market Research Consumer Behaviour Marketing Research Qualitative Research B2B Business Development CRM Marketing Strategy Account Management New Business Development Strategy Management SaaS Sales Operations Sales Management Lead Generation Sales Cold Calling Enterprise Software Marketing Mobile Devices Recruiting Salesforce.com Sales Process Strategic Partnerships Networking Product Marketing Start-ups Analytics Direct Sales Online Marketing Segmentation Online Advertising Digital Marketing Email Marketing Product Management SEM See 24+     See less Skills  Leadership Customer Insight Market Research Consumer Behaviour Marketing Research Qualitative Research B2B Business Development CRM Marketing Strategy Account Management New Business Development Strategy Management SaaS Sales Operations Sales Management Lead Generation Sales Cold Calling Enterprise Software Marketing Mobile Devices Recruiting Salesforce.com Sales Process Strategic Partnerships Networking Product Marketing Start-ups Analytics Direct Sales Online Marketing Segmentation Online Advertising Digital Marketing Email Marketing Product Management SEM See 24+     See less Leadership Customer Insight Market Research Consumer Behaviour Marketing Research Qualitative Research B2B Business Development CRM Marketing Strategy Account Management New Business Development Strategy Management SaaS Sales Operations Sales Management Lead Generation Sales Cold Calling Enterprise Software Marketing Mobile Devices Recruiting Salesforce.com Sales Process Strategic Partnerships Networking Product Marketing Start-ups Analytics Direct Sales Online Marketing Segmentation Online Advertising Digital Marketing Email Marketing Product Management SEM See 24+     See less Leadership Customer Insight Market Research Consumer Behaviour Marketing Research Qualitative Research B2B Business Development CRM Marketing Strategy Account Management New Business Development Strategy Management SaaS Sales Operations Sales Management Lead Generation Sales Cold Calling Enterprise Software Marketing Mobile Devices Recruiting Salesforce.com Sales Process Strategic Partnerships Networking Product Marketing Start-ups Analytics Direct Sales Online Marketing Segmentation Online Advertising Digital Marketing Email Marketing Product Management SEM See 24+     See less Education Regis University BS,  Marketing and Communication 2001  – 2005 Need to attain 9 credits in order to finish degree at Regis Activities and Societies:  Baseball Fort Scott Community College 2004 Odessa Junior College 2004 Eaglecrest High School Regis University BS,  Marketing and Communication 2001  – 2005 Need to attain 9 credits in order to finish degree at Regis Activities and Societies:  Baseball Regis University BS,  Marketing and Communication 2001  – 2005 Need to attain 9 credits in order to finish degree at Regis Activities and Societies:  Baseball Regis University BS,  Marketing and Communication 2001  – 2005 Need to attain 9 credits in order to finish degree at Regis Activities and Societies:  Baseball Fort Scott Community College 2004 Fort Scott Community College 2004 Fort Scott Community College 2004 Odessa Junior College 2004 Odessa Junior College 2004 Odessa Junior College 2004 Eaglecrest High School Eaglecrest High School Eaglecrest High School ", "Experience Director, User Research Twitter August 2014  – Present (1 year 1 month) I lead the user research team supporting Twitter's advertiser, publisher, and developer products and consumer expression experiences. We work closely with designers, product managers, and engineers to champion a user-centered design process that incorporates our user's needs and feedback throughout the development process.  \n \nIf this sounds cool to you, I'm actively hiring Researchers at all levels of experience so please reach out directly if interested. Director, User Research Twitter August 2014  – Present (1 year 1 month) I lead the user research team supporting Twitter's advertiser, publisher, and developer products and consumer expression experiences. We work closely with designers, product managers, and engineers to champion a user-centered design process that incorporates our user's needs and feedback throughout the development process.  \n \nIf this sounds cool to you, I'm actively hiring Researchers at all levels of experience so please reach out directly if interested. Director, User Research Twitter August 2014  – Present (1 year 1 month) I lead the user research team supporting Twitter's advertiser, publisher, and developer products and consumer expression experiences. We work closely with designers, product managers, and engineers to champion a user-centered design process that incorporates our user's needs and feedback throughout the development process.  \n \nIf this sounds cool to you, I'm actively hiring Researchers at all levels of experience so please reach out directly if interested. Skills Persona Ethnography Contextual Inquiry Participatory Design User Experience Usability Testing User Experience Design Card Sorting Product Management Market Research User Research User-centered Design Information Architecture Interaction Design Usability Engineering Human Computer... Experience Design User Interface Design Usability Heuristic Evaluation Wireframes Wire Framing Service Design Information Design Human Factors Mobile Devices User Interface See 12+     See less Skills  Persona Ethnography Contextual Inquiry Participatory Design User Experience Usability Testing User Experience Design Card Sorting Product Management Market Research User Research User-centered Design Information Architecture Interaction Design Usability Engineering Human Computer... Experience Design User Interface Design Usability Heuristic Evaluation Wireframes Wire Framing Service Design Information Design Human Factors Mobile Devices User Interface See 12+     See less Persona Ethnography Contextual Inquiry Participatory Design User Experience Usability Testing User Experience Design Card Sorting Product Management Market Research User Research User-centered Design Information Architecture Interaction Design Usability Engineering Human Computer... Experience Design User Interface Design Usability Heuristic Evaluation Wireframes Wire Framing Service Design Information Design Human Factors Mobile Devices User Interface See 12+     See less Persona Ethnography Contextual Inquiry Participatory Design User Experience Usability Testing User Experience Design Card Sorting Product Management Market Research User Research User-centered Design Information Architecture Interaction Design Usability Engineering Human Computer... Experience Design User Interface Design Usability Heuristic Evaluation Wireframes Wire Framing Service Design Information Design Human Factors Mobile Devices User Interface See 12+     See less ", "Summary Read client testimonials here: http://www.eurekainsights.com/clients \n \nCurrent status:  \n- Owner of Eureka! Insights LLC  \n- Specialize in user research and usability consulting services \nweb: http://www.eurekainsights.com  \nemail: eurekainsights@icloud.com \n \nPast positions:  \n- Lead User Experience Researcher, eBay, San Jose \n- Director of User Research at Scient, San Francisco  \n- Usability Strategist at Siegel & Gale, New York \n- Senior Writer and Information Analyst at Siegel & Gale, New York \n \nSpecialties: ethnographic field research, in-lab usability testing, online surveys, card sorting, focus group planning, user research planning and management, vendor management, information design, interaction design, information architecture, heuristic evaluations, expert usability reviews, and cognitive walkthroughs. Summary Read client testimonials here: http://www.eurekainsights.com/clients \n \nCurrent status:  \n- Owner of Eureka! Insights LLC  \n- Specialize in user research and usability consulting services \nweb: http://www.eurekainsights.com  \nemail: eurekainsights@icloud.com \n \nPast positions:  \n- Lead User Experience Researcher, eBay, San Jose \n- Director of User Research at Scient, San Francisco  \n- Usability Strategist at Siegel & Gale, New York \n- Senior Writer and Information Analyst at Siegel & Gale, New York \n \nSpecialties: ethnographic field research, in-lab usability testing, online surveys, card sorting, focus group planning, user research planning and management, vendor management, information design, interaction design, information architecture, heuristic evaluations, expert usability reviews, and cognitive walkthroughs. Read client testimonials here: http://www.eurekainsights.com/clients \n \nCurrent status:  \n- Owner of Eureka! Insights LLC  \n- Specialize in user research and usability consulting services \nweb: http://www.eurekainsights.com  \nemail: eurekainsights@icloud.com \n \nPast positions:  \n- Lead User Experience Researcher, eBay, San Jose \n- Director of User Research at Scient, San Francisco  \n- Usability Strategist at Siegel & Gale, New York \n- Senior Writer and Information Analyst at Siegel & Gale, New York \n \nSpecialties: ethnographic field research, in-lab usability testing, online surveys, card sorting, focus group planning, user research planning and management, vendor management, information design, interaction design, information architecture, heuristic evaluations, expert usability reviews, and cognitive walkthroughs. Read client testimonials here: http://www.eurekainsights.com/clients \n \nCurrent status:  \n- Owner of Eureka! Insights LLC  \n- Specialize in user research and usability consulting services \nweb: http://www.eurekainsights.com  \nemail: eurekainsights@icloud.com \n \nPast positions:  \n- Lead User Experience Researcher, eBay, San Jose \n- Director of User Research at Scient, San Francisco  \n- Usability Strategist at Siegel & Gale, New York \n- Senior Writer and Information Analyst at Siegel & Gale, New York \n \nSpecialties: ethnographic field research, in-lab usability testing, online surveys, card sorting, focus group planning, user research planning and management, vendor management, information design, interaction design, information architecture, heuristic evaluations, expert usability reviews, and cognitive walkthroughs. Experience Founder and Principal Researcher Eureka! Insights LLC September 2005  – Present (10 years) San Francisco Bay Area SUMMARY: \n17 years experience \nConducted 1500+ in depth interviews  \nWorked on 150+ projects \nWith 45+ clients \nIn 17+ industries \n \nOUR FOCUS: At Eureka! Insights we observe and study how people interact with and experience products, in order to make them more useful, easy to use, and desirable. We help clients understand how real people use and experience their products, the types of people who use their products, and opportunities for product improvement. The types of products we evaluate are usually mobile device apps and websites (on the iPad, iPhone, and/or Android), or computer software and web sites. Occasionally we also evaluate printed communications, kiosks, or various other hand-held devices. \n \nRESEARCH METHODS: We use a variety of qualitative user research methods, depending on the questions being addressed and the stage of the product developent life cycle. Methods we use most frequently include traditional lab-based usability testing, concept testing, and ethnographic field research. We are also experienced in conducting participatory design sessions, focus groups, heuristic evaluations, card sort exercises, eye tracking studies, and competitive benchmark testing. \n \nCLIENT LIST AND TESTIMONIALS: \nhttp://www.eurekainsights.com/clients Lead User Experience Researcher eBay, Inc. January 2003  –  September 2005  (2 years 9 months) Beth has significant experience conducting ethnographic field research as well as in-lab usability studies. She also has experience with online usability studies, contextual inquiries, online surveys, card sorting exercises, and cognitive walkthroughs. Currently, Beth leads the Visits Program and strategy for eBay Europe, New Zealand, and Australia. She helped launch the Visits program in the Bay area last year. Prior to that, Beth conducted numerous in-lab usability studies and online surveys. Director User Research Scient 1999  –  2001  (2 years) Beth was Director of User Research at Scient, San Francisco, and helped grow and manage the company’s user research program  \nworldwide in many ways. She hired researchers, defined and managed the group’s processes, designed and ensured a smooth build-out of the company’s first usability labs worldwide, and evangelized the importance of both strategic ethnographic research as well as iterative usability testing throughout the design process. And in her \"spare time\" she of course worked as an individual contributor, consulting on numerous projects simultaneously. Information Analyst & Usability Strategist Siegel & Gale 1997  –  1999  (2 years) Information Analyst & Usability Strategist Siegel & Gale 1997  –  1999  (2 years) Info Architect Terry Swack Design Associates 1996  –  1996  (less than a year) Founder and Principal Researcher Eureka! Insights LLC September 2005  – Present (10 years) San Francisco Bay Area SUMMARY: \n17 years experience \nConducted 1500+ in depth interviews  \nWorked on 150+ projects \nWith 45+ clients \nIn 17+ industries \n \nOUR FOCUS: At Eureka! Insights we observe and study how people interact with and experience products, in order to make them more useful, easy to use, and desirable. We help clients understand how real people use and experience their products, the types of people who use their products, and opportunities for product improvement. The types of products we evaluate are usually mobile device apps and websites (on the iPad, iPhone, and/or Android), or computer software and web sites. Occasionally we also evaluate printed communications, kiosks, or various other hand-held devices. \n \nRESEARCH METHODS: We use a variety of qualitative user research methods, depending on the questions being addressed and the stage of the product developent life cycle. Methods we use most frequently include traditional lab-based usability testing, concept testing, and ethnographic field research. We are also experienced in conducting participatory design sessions, focus groups, heuristic evaluations, card sort exercises, eye tracking studies, and competitive benchmark testing. \n \nCLIENT LIST AND TESTIMONIALS: \nhttp://www.eurekainsights.com/clients Founder and Principal Researcher Eureka! Insights LLC September 2005  – Present (10 years) San Francisco Bay Area SUMMARY: \n17 years experience \nConducted 1500+ in depth interviews  \nWorked on 150+ projects \nWith 45+ clients \nIn 17+ industries \n \nOUR FOCUS: At Eureka! Insights we observe and study how people interact with and experience products, in order to make them more useful, easy to use, and desirable. We help clients understand how real people use and experience their products, the types of people who use their products, and opportunities for product improvement. The types of products we evaluate are usually mobile device apps and websites (on the iPad, iPhone, and/or Android), or computer software and web sites. Occasionally we also evaluate printed communications, kiosks, or various other hand-held devices. \n \nRESEARCH METHODS: We use a variety of qualitative user research methods, depending on the questions being addressed and the stage of the product developent life cycle. Methods we use most frequently include traditional lab-based usability testing, concept testing, and ethnographic field research. We are also experienced in conducting participatory design sessions, focus groups, heuristic evaluations, card sort exercises, eye tracking studies, and competitive benchmark testing. \n \nCLIENT LIST AND TESTIMONIALS: \nhttp://www.eurekainsights.com/clients Lead User Experience Researcher eBay, Inc. January 2003  –  September 2005  (2 years 9 months) Beth has significant experience conducting ethnographic field research as well as in-lab usability studies. She also has experience with online usability studies, contextual inquiries, online surveys, card sorting exercises, and cognitive walkthroughs. Currently, Beth leads the Visits Program and strategy for eBay Europe, New Zealand, and Australia. She helped launch the Visits program in the Bay area last year. Prior to that, Beth conducted numerous in-lab usability studies and online surveys. Lead User Experience Researcher eBay, Inc. January 2003  –  September 2005  (2 years 9 months) Beth has significant experience conducting ethnographic field research as well as in-lab usability studies. She also has experience with online usability studies, contextual inquiries, online surveys, card sorting exercises, and cognitive walkthroughs. Currently, Beth leads the Visits Program and strategy for eBay Europe, New Zealand, and Australia. She helped launch the Visits program in the Bay area last year. Prior to that, Beth conducted numerous in-lab usability studies and online surveys. Director User Research Scient 1999  –  2001  (2 years) Beth was Director of User Research at Scient, San Francisco, and helped grow and manage the company’s user research program  \nworldwide in many ways. She hired researchers, defined and managed the group’s processes, designed and ensured a smooth build-out of the company’s first usability labs worldwide, and evangelized the importance of both strategic ethnographic research as well as iterative usability testing throughout the design process. And in her \"spare time\" she of course worked as an individual contributor, consulting on numerous projects simultaneously. Director User Research Scient 1999  –  2001  (2 years) Beth was Director of User Research at Scient, San Francisco, and helped grow and manage the company’s user research program  \nworldwide in many ways. She hired researchers, defined and managed the group’s processes, designed and ensured a smooth build-out of the company’s first usability labs worldwide, and evangelized the importance of both strategic ethnographic research as well as iterative usability testing throughout the design process. And in her \"spare time\" she of course worked as an individual contributor, consulting on numerous projects simultaneously. Information Analyst & Usability Strategist Siegel & Gale 1997  –  1999  (2 years) Information Analyst & Usability Strategist Siegel & Gale 1997  –  1999  (2 years) Information Analyst & Usability Strategist Siegel & Gale 1997  –  1999  (2 years) Information Analyst & Usability Strategist Siegel & Gale 1997  –  1999  (2 years) Info Architect Terry Swack Design Associates 1996  –  1996  (less than a year) Info Architect Terry Swack Design Associates 1996  –  1996  (less than a year) Languages Some spanish (not fluent) Some spanish (not fluent) Some spanish (not fluent) Skills mobile research -... mobile research -... mobile research - iPad... usability lab research... focus group research... ethnographic field... participatory design... mobile research - iPad... Ethnography Participant Observation Contextual Inquiry Field Studies Observational Research Moderating Usability Testing Heuristic Analysis Conceptual Modeling Website Testing Mobile Devices Smartphones Mobile Applications User Experience User-centered Design User Studies Eye Tracking Card Sorting User Scenarios Customer Interactions Usability Engineering Paper Prototyping Questionnaires Focus Groups Heuristic Evaluation Information Architecture Qualitative Research Human Computer... Participatory Design Wire Framing Observational Studies Information Design Web Testing Usability Experience Design Online Moderation Survey Design User Research User Experience Design Interaction Design Content Strategy User Interface Design See 35+     See less Skills  mobile research -... mobile research -... mobile research - iPad... usability lab research... focus group research... ethnographic field... participatory design... mobile research - iPad... Ethnography Participant Observation Contextual Inquiry Field Studies Observational Research Moderating Usability Testing Heuristic Analysis Conceptual Modeling Website Testing Mobile Devices Smartphones Mobile Applications User Experience User-centered Design User Studies Eye Tracking Card Sorting User Scenarios Customer Interactions Usability Engineering Paper Prototyping Questionnaires Focus Groups Heuristic Evaluation Information Architecture Qualitative Research Human Computer... Participatory Design Wire Framing Observational Studies Information Design Web Testing Usability Experience Design Online Moderation Survey Design User Research User Experience Design Interaction Design Content Strategy User Interface Design See 35+     See less mobile research -... mobile research -... mobile research - iPad... usability lab research... focus group research... ethnographic field... participatory design... mobile research - iPad... Ethnography Participant Observation Contextual Inquiry Field Studies Observational Research Moderating Usability Testing Heuristic Analysis Conceptual Modeling Website Testing Mobile Devices Smartphones Mobile Applications User Experience User-centered Design User Studies Eye Tracking Card Sorting User Scenarios Customer Interactions Usability Engineering Paper Prototyping Questionnaires Focus Groups Heuristic Evaluation Information Architecture Qualitative Research Human Computer... Participatory Design Wire Framing Observational Studies Information Design Web Testing Usability Experience Design Online Moderation Survey Design User Research User Experience Design Interaction Design Content Strategy User Interface Design See 35+     See less mobile research -... mobile research -... mobile research - iPad... usability lab research... focus group research... ethnographic field... participatory design... mobile research - iPad... Ethnography Participant Observation Contextual Inquiry Field Studies Observational Research Moderating Usability Testing Heuristic Analysis Conceptual Modeling Website Testing Mobile Devices Smartphones Mobile Applications User Experience User-centered Design User Studies Eye Tracking Card Sorting User Scenarios Customer Interactions Usability Engineering Paper Prototyping Questionnaires Focus Groups Heuristic Evaluation Information Architecture Qualitative Research Human Computer... Participatory Design Wire Framing Observational Studies Information Design Web Testing Usability Experience Design Online Moderation Survey Design User Research User Experience Design Interaction Design Content Strategy User Interface Design See 35+     See less Education Carnegie Mellon University Mdes, MPM,  Communication Planning & Design; Public Management 1995  – 1997 Carnegie Mellon University Bachelor of Applied Science (B.A.Sc.),  Policy and Management (with 2nd major in Applied History) Carnegie Mellon University Mdes, MPM,  Communication Planning & Design; Public Management 1995  – 1997 Carnegie Mellon University Mdes, MPM,  Communication Planning & Design; Public Management 1995  – 1997 Carnegie Mellon University Mdes, MPM,  Communication Planning & Design; Public Management 1995  – 1997 Carnegie Mellon University Bachelor of Applied Science (B.A.Sc.),  Policy and Management (with 2nd major in Applied History) Carnegie Mellon University Bachelor of Applied Science (B.A.Sc.),  Policy and Management (with 2nd major in Applied History) Carnegie Mellon University Bachelor of Applied Science (B.A.Sc.),  Policy and Management (with 2nd major in Applied History) ", "Summary Over 15 years of experience in user experience (UX) research, with a focus on institutionalizing UX practices within large organizations: \n \n- MBA in Marketing and MIS, Certified Usability Analyst (CUA), Certified Experience Analyst (CXA) \n \n- 10 years managing an award-winning, global UX research team as VP, User Experience Advocate, at JPMorgan Chase \n \n- 6+ years conducting user research as a senior consultant within financial services, insurance pharmaceutical, energy, business services and other domains \n \n- Teacher: courses on 'The Art and Science of Website and Application Design', 'Practical Usability Testing', and 'The Institutionalization of User Experience in Large Organizations' \n \nSpecialties: user research methodologies, Web analytics, marketing, accessibility, and survey research and statistical analysis Summary Over 15 years of experience in user experience (UX) research, with a focus on institutionalizing UX practices within large organizations: \n \n- MBA in Marketing and MIS, Certified Usability Analyst (CUA), Certified Experience Analyst (CXA) \n \n- 10 years managing an award-winning, global UX research team as VP, User Experience Advocate, at JPMorgan Chase \n \n- 6+ years conducting user research as a senior consultant within financial services, insurance pharmaceutical, energy, business services and other domains \n \n- Teacher: courses on 'The Art and Science of Website and Application Design', 'Practical Usability Testing', and 'The Institutionalization of User Experience in Large Organizations' \n \nSpecialties: user research methodologies, Web analytics, marketing, accessibility, and survey research and statistical analysis Over 15 years of experience in user experience (UX) research, with a focus on institutionalizing UX practices within large organizations: \n \n- MBA in Marketing and MIS, Certified Usability Analyst (CUA), Certified Experience Analyst (CXA) \n \n- 10 years managing an award-winning, global UX research team as VP, User Experience Advocate, at JPMorgan Chase \n \n- 6+ years conducting user research as a senior consultant within financial services, insurance pharmaceutical, energy, business services and other domains \n \n- Teacher: courses on 'The Art and Science of Website and Application Design', 'Practical Usability Testing', and 'The Institutionalization of User Experience in Large Organizations' \n \nSpecialties: user research methodologies, Web analytics, marketing, accessibility, and survey research and statistical analysis Over 15 years of experience in user experience (UX) research, with a focus on institutionalizing UX practices within large organizations: \n \n- MBA in Marketing and MIS, Certified Usability Analyst (CUA), Certified Experience Analyst (CXA) \n \n- 10 years managing an award-winning, global UX research team as VP, User Experience Advocate, at JPMorgan Chase \n \n- 6+ years conducting user research as a senior consultant within financial services, insurance pharmaceutical, energy, business services and other domains \n \n- Teacher: courses on 'The Art and Science of Website and Application Design', 'Practical Usability Testing', and 'The Institutionalization of User Experience in Large Organizations' \n \nSpecialties: user research methodologies, Web analytics, marketing, accessibility, and survey research and statistical analysis Experience Director, User Research Fidelity Investments July 2014  – Present (1 year 2 months) Jersey City, NJ User Experience Strategist Human Factors International July 2010  –  May 2014  (3 years 11 months) New York, NY Senior Consultant, User Experience Logical Design Solutions April 2009  –  June 2010  (1 year 3 months) Morristown, NJ Senior Experience Design Consultant Molecular June 2008  –  April 2009  (11 months) New York, NY User Experience Strategist MISI Company January 2008  –  June 2008  (6 months) New York, NY Vice President, User Experience JPMorgan Chase August 1997  –  November 2007  (10 years 4 months) New York, NY Manager Poppe Tyson Advertising August 1995  –  August 1997  (2 years 1 month) Director, User Research Fidelity Investments July 2014  – Present (1 year 2 months) Jersey City, NJ Director, User Research Fidelity Investments July 2014  – Present (1 year 2 months) Jersey City, NJ User Experience Strategist Human Factors International July 2010  –  May 2014  (3 years 11 months) New York, NY User Experience Strategist Human Factors International July 2010  –  May 2014  (3 years 11 months) New York, NY Senior Consultant, User Experience Logical Design Solutions April 2009  –  June 2010  (1 year 3 months) Morristown, NJ Senior Consultant, User Experience Logical Design Solutions April 2009  –  June 2010  (1 year 3 months) Morristown, NJ Senior Experience Design Consultant Molecular June 2008  –  April 2009  (11 months) New York, NY Senior Experience Design Consultant Molecular June 2008  –  April 2009  (11 months) New York, NY User Experience Strategist MISI Company January 2008  –  June 2008  (6 months) New York, NY User Experience Strategist MISI Company January 2008  –  June 2008  (6 months) New York, NY Vice President, User Experience JPMorgan Chase August 1997  –  November 2007  (10 years 4 months) New York, NY Vice President, User Experience JPMorgan Chase August 1997  –  November 2007  (10 years 4 months) New York, NY Manager Poppe Tyson Advertising August 1995  –  August 1997  (2 years 1 month) Manager Poppe Tyson Advertising August 1995  –  August 1997  (2 years 1 month) Skills Usability Testing Accessibility Web Design User-centered Design Information Architecture User Experience Usability Design Experience Design Usability Engineering User Research Usability Interaction Design Strategic Communications Wireframes Contextual Inquiry User Interface Design User Experience Design Persona Digital Strategy Heuristic Evaluation Human Computer... User Interface User Scenarios Strategy Card Sorting Team Building Task Analysis Wire Framing Creative Direction See 14+     See less Skills  Usability Testing Accessibility Web Design User-centered Design Information Architecture User Experience Usability Design Experience Design Usability Engineering User Research Usability Interaction Design Strategic Communications Wireframes Contextual Inquiry User Interface Design User Experience Design Persona Digital Strategy Heuristic Evaluation Human Computer... User Interface User Scenarios Strategy Card Sorting Team Building Task Analysis Wire Framing Creative Direction See 14+     See less Usability Testing Accessibility Web Design User-centered Design Information Architecture User Experience Usability Design Experience Design Usability Engineering User Research Usability Interaction Design Strategic Communications Wireframes Contextual Inquiry User Interface Design User Experience Design Persona Digital Strategy Heuristic Evaluation Human Computer... User Interface User Scenarios Strategy Card Sorting Team Building Task Analysis Wire Framing Creative Direction See 14+     See less Usability Testing Accessibility Web Design User-centered Design Information Architecture User Experience Usability Design Experience Design Usability Engineering User Research Usability Interaction Design Strategic Communications Wireframes Contextual Inquiry User Interface Design User Experience Design Persona Digital Strategy Heuristic Evaluation Human Computer... User Interface User Scenarios Strategy Card Sorting Team Building Task Analysis Wire Framing Creative Direction See 14+     See less Education New York University - Leonard N. Stern School of Business MBA 2000  – 2003 The George Washington University MPS 1987  – 1988 Michigan State University BA 1982  – 1986 New York University - Leonard N. Stern School of Business MBA 2000  – 2003 New York University - Leonard N. Stern School of Business MBA 2000  – 2003 New York University - Leonard N. Stern School of Business MBA 2000  – 2003 The George Washington University MPS 1987  – 1988 The George Washington University MPS 1987  – 1988 The George Washington University MPS 1987  – 1988 Michigan State University BA 1982  – 1986 Michigan State University BA 1982  – 1986 Michigan State University BA 1982  – 1986 Honors & Awards Additional Honors & Awards JPMorgan Chase - Neilsen Norman Group's 'Top Ten Intranets of 2007' Additional Honors & Awards JPMorgan Chase - Neilsen Norman Group's 'Top Ten Intranets of 2007' Additional Honors & Awards JPMorgan Chase - Neilsen Norman Group's 'Top Ten Intranets of 2007' Additional Honors & Awards JPMorgan Chase - Neilsen Norman Group's 'Top Ten Intranets of 2007' ", "Summary Passionate and experienced researcher who translates customer data to focus and inspire product teams. Proven track record of developing effective user research processes and delivering research that transforms products. Worked on diverse projects encompassing mobile devices, web, business, consumer and system management software. Rich background in online collaboration, search and all aspects of mobile device usage.  \n \nSkills overview  \n \nResearch: qualitative and quantitative. hardware and software. ethnography, contextual interviews, focus groups, longitudinal research, usability, desirability, and survey development.  \n \nStrategy: UX planning, scenario building and persona development. Defining research methods, processes and deliverables as part of larger business strategy.  \n \nManagement: Hiring and managing small User Research and Design teams including mentoring team members on all aspects of user research and product development. Managing contractors and vendors for large scale projects. Summary Passionate and experienced researcher who translates customer data to focus and inspire product teams. Proven track record of developing effective user research processes and delivering research that transforms products. Worked on diverse projects encompassing mobile devices, web, business, consumer and system management software. Rich background in online collaboration, search and all aspects of mobile device usage.  \n \nSkills overview  \n \nResearch: qualitative and quantitative. hardware and software. ethnography, contextual interviews, focus groups, longitudinal research, usability, desirability, and survey development.  \n \nStrategy: UX planning, scenario building and persona development. Defining research methods, processes and deliverables as part of larger business strategy.  \n \nManagement: Hiring and managing small User Research and Design teams including mentoring team members on all aspects of user research and product development. Managing contractors and vendors for large scale projects. Passionate and experienced researcher who translates customer data to focus and inspire product teams. Proven track record of developing effective user research processes and delivering research that transforms products. Worked on diverse projects encompassing mobile devices, web, business, consumer and system management software. Rich background in online collaboration, search and all aspects of mobile device usage.  \n \nSkills overview  \n \nResearch: qualitative and quantitative. hardware and software. ethnography, contextual interviews, focus groups, longitudinal research, usability, desirability, and survey development.  \n \nStrategy: UX planning, scenario building and persona development. Defining research methods, processes and deliverables as part of larger business strategy.  \n \nManagement: Hiring and managing small User Research and Design teams including mentoring team members on all aspects of user research and product development. Managing contractors and vendors for large scale projects. Passionate and experienced researcher who translates customer data to focus and inspire product teams. Proven track record of developing effective user research processes and delivering research that transforms products. Worked on diverse projects encompassing mobile devices, web, business, consumer and system management software. Rich background in online collaboration, search and all aspects of mobile device usage.  \n \nSkills overview  \n \nResearch: qualitative and quantitative. hardware and software. ethnography, contextual interviews, focus groups, longitudinal research, usability, desirability, and survey development.  \n \nStrategy: UX planning, scenario building and persona development. Defining research methods, processes and deliverables as part of larger business strategy.  \n \nManagement: Hiring and managing small User Research and Design teams including mentoring team members on all aspects of user research and product development. Managing contractors and vendors for large scale projects. Experience User Experience Researcher CompuCom December 2013  – Present (1 year 9 months) Microsoft Office Director of User Research Analytic Design Group Inc. March 2011  –  May 2013  (2 years 3 months) Greater Seattle Area User Research Microsoft August 2009  –  February 2011  (1 year 7 months) User Research Lead Zune July 2006  –  February 2011  (4 years 8 months) User Research Lead Microsoft Unified Communications Services July 2003  –  July 2007  (4 years 1 month) Greater Seattle Area Office InfoPath CSCW research April 2001  –  July 2003  (2 years 4 months) user interface designer Lexis Nexis July 1990  –  July 1998  (8 years 1 month) Dayton, Ohio Area Human Factors Engineer AT&T Corp September 1986  –  June 1990  (3 years 10 months) Cincinnati Area User Experience Researcher CompuCom December 2013  – Present (1 year 9 months) Microsoft Office User Experience Researcher CompuCom December 2013  – Present (1 year 9 months) Microsoft Office Director of User Research Analytic Design Group Inc. March 2011  –  May 2013  (2 years 3 months) Greater Seattle Area Director of User Research Analytic Design Group Inc. March 2011  –  May 2013  (2 years 3 months) Greater Seattle Area User Research Microsoft August 2009  –  February 2011  (1 year 7 months) User Research Microsoft August 2009  –  February 2011  (1 year 7 months) User Research Lead Zune July 2006  –  February 2011  (4 years 8 months) User Research Lead Zune July 2006  –  February 2011  (4 years 8 months) User Research Lead Microsoft Unified Communications Services July 2003  –  July 2007  (4 years 1 month) Greater Seattle Area User Research Lead Microsoft Unified Communications Services July 2003  –  July 2007  (4 years 1 month) Greater Seattle Area Office InfoPath CSCW research April 2001  –  July 2003  (2 years 4 months) Office InfoPath CSCW research April 2001  –  July 2003  (2 years 4 months) user interface designer Lexis Nexis July 1990  –  July 1998  (8 years 1 month) Dayton, Ohio Area user interface designer Lexis Nexis July 1990  –  July 1998  (8 years 1 month) Dayton, Ohio Area Human Factors Engineer AT&T Corp September 1986  –  June 1990  (3 years 10 months) Cincinnati Area Human Factors Engineer AT&T Corp September 1986  –  June 1990  (3 years 10 months) Cincinnati Area Skills Ethnography User Experience Focus Groups Qualitative Research Research Contextual Inquiry Heuristic Evaluation Usability Testing Participatory Design Personas Persona User-centered Design User Experience Design Usability User Scenarios User Research Human Computer... Mobile Devices User Interface Mobile Applications Visual Design Task Analysis Usability Engineering Paper Prototyping Interaction Design Design Thinking Information Architecture Experience Design Card Sorting Human Factors Wireframes Wire Framing User Interface Design Service Design Mobile Design OmniGraffle Design Strategy Rapid Prototyping Management Agile Methodologies See 25+     See less Skills  Ethnography User Experience Focus Groups Qualitative Research Research Contextual Inquiry Heuristic Evaluation Usability Testing Participatory Design Personas Persona User-centered Design User Experience Design Usability User Scenarios User Research Human Computer... Mobile Devices User Interface Mobile Applications Visual Design Task Analysis Usability Engineering Paper Prototyping Interaction Design Design Thinking Information Architecture Experience Design Card Sorting Human Factors Wireframes Wire Framing User Interface Design Service Design Mobile Design OmniGraffle Design Strategy Rapid Prototyping Management Agile Methodologies See 25+     See less Ethnography User Experience Focus Groups Qualitative Research Research Contextual Inquiry Heuristic Evaluation Usability Testing Participatory Design Personas Persona User-centered Design User Experience Design Usability User Scenarios User Research Human Computer... Mobile Devices User Interface Mobile Applications Visual Design Task Analysis Usability Engineering Paper Prototyping Interaction Design Design Thinking Information Architecture Experience Design Card Sorting Human Factors Wireframes Wire Framing User Interface Design Service Design Mobile Design OmniGraffle Design Strategy Rapid Prototyping Management Agile Methodologies See 25+     See less Ethnography User Experience Focus Groups Qualitative Research Research Contextual Inquiry Heuristic Evaluation Usability Testing Participatory Design Personas Persona User-centered Design User Experience Design Usability User Scenarios User Research Human Computer... Mobile Devices User Interface Mobile Applications Visual Design Task Analysis Usability Engineering Paper Prototyping Interaction Design Design Thinking Information Architecture Experience Design Card Sorting Human Factors Wireframes Wire Framing User Interface Design Service Design Mobile Design OmniGraffle Design Strategy Rapid Prototyping Management Agile Methodologies See 25+     See less ", "Summary As a human factors engineer and user experience architect, I am passionate about increasing safety and usability as well as improving customer satisfaction through user research and user-centered design. My experience in user interface design has exposed me to a variety of domains where product success hinges on quality design including medical devices, healthcare information technology, military aviation, mining operations, office and professional imaging, large corporate websites, web applications, and consumer electronics. I enjoy all stages of product development and commercialization. My publications and patents related to user interface design demonstrate my commitment to research and innovation. Recently, my work has focused on usability testing to help medical device manufacturers ensure safe and effective products that meet the requirements of the FDA and European governing bodies. I currently lead interaction design, human factors engineering, contextual inquiry, and usability testing at Bresslergroup. Summary As a human factors engineer and user experience architect, I am passionate about increasing safety and usability as well as improving customer satisfaction through user research and user-centered design. My experience in user interface design has exposed me to a variety of domains where product success hinges on quality design including medical devices, healthcare information technology, military aviation, mining operations, office and professional imaging, large corporate websites, web applications, and consumer electronics. I enjoy all stages of product development and commercialization. My publications and patents related to user interface design demonstrate my commitment to research and innovation. Recently, my work has focused on usability testing to help medical device manufacturers ensure safe and effective products that meet the requirements of the FDA and European governing bodies. I currently lead interaction design, human factors engineering, contextual inquiry, and usability testing at Bresslergroup. As a human factors engineer and user experience architect, I am passionate about increasing safety and usability as well as improving customer satisfaction through user research and user-centered design. My experience in user interface design has exposed me to a variety of domains where product success hinges on quality design including medical devices, healthcare information technology, military aviation, mining operations, office and professional imaging, large corporate websites, web applications, and consumer electronics. I enjoy all stages of product development and commercialization. My publications and patents related to user interface design demonstrate my commitment to research and innovation. Recently, my work has focused on usability testing to help medical device manufacturers ensure safe and effective products that meet the requirements of the FDA and European governing bodies. I currently lead interaction design, human factors engineering, contextual inquiry, and usability testing at Bresslergroup. As a human factors engineer and user experience architect, I am passionate about increasing safety and usability as well as improving customer satisfaction through user research and user-centered design. My experience in user interface design has exposed me to a variety of domains where product success hinges on quality design including medical devices, healthcare information technology, military aviation, mining operations, office and professional imaging, large corporate websites, web applications, and consumer electronics. I enjoy all stages of product development and commercialization. My publications and patents related to user interface design demonstrate my commitment to research and innovation. Recently, my work has focused on usability testing to help medical device manufacturers ensure safe and effective products that meet the requirements of the FDA and European governing bodies. I currently lead interaction design, human factors engineering, contextual inquiry, and usability testing at Bresslergroup. Experience Director of User Research & Human Factors Bresslergroup August 2014  – Present (1 year 1 month) Greater Philadelphia Area At Bresslergroup, I lead the user research and human factors team. We work closely with the interaction design, industrial design and mechanical and electrical engineering professionals in product innovation and design execution.We help our clients to ensure successful user interfaces and intuitive product experiences. As part of the management team, my responsibilities include staff development, project management, sales, and project scoping. Director of User Research & Human Factors Bresslergroup August 2014  – Present (1 year 1 month) Greater Philadelphia Area At Bresslergroup, I lead the user research and human factors team. We work closely with the interaction design, industrial design and mechanical and electrical engineering professionals in product innovation and design execution.We help our clients to ensure successful user interfaces and intuitive product experiences. As part of the management team, my responsibilities include staff development, project management, sales, and project scoping. Director of User Research & Human Factors Bresslergroup August 2014  – Present (1 year 1 month) Greater Philadelphia Area At Bresslergroup, I lead the user research and human factors team. We work closely with the interaction design, industrial design and mechanical and electrical engineering professionals in product innovation and design execution.We help our clients to ensure successful user interfaces and intuitive product experiences. As part of the management team, my responsibilities include staff development, project management, sales, and project scoping. Skills Usability Testing Photography Eye Tracking Medical Systems Human Factors Human-computer... Usability Engineering User Experience Ergonomics Product Design User-centered Design Task Analysis Ethnography Research Design Interaction Design User Interface Design Heuristic Evaluation Prototyping Information Architecture Focus Groups User Interface Personas Cognition Contextual Inquiry Card Sorting Information Design Statistics Research User Scenarios Analysis Qualitative Research Requirements Analysis Paper Prototyping Cognitive Psychology Web Design Storyboarding Experience Design Engineering Teaching Design Strategy Iterative Design User Profiling Prototype Human Computer... User Research Wireframes User Experience Design Wire Framing Visual Design Persona See 35+     See less Skills  Usability Testing Photography Eye Tracking Medical Systems Human Factors Human-computer... Usability Engineering User Experience Ergonomics Product Design User-centered Design Task Analysis Ethnography Research Design Interaction Design User Interface Design Heuristic Evaluation Prototyping Information Architecture Focus Groups User Interface Personas Cognition Contextual Inquiry Card Sorting Information Design Statistics Research User Scenarios Analysis Qualitative Research Requirements Analysis Paper Prototyping Cognitive Psychology Web Design Storyboarding Experience Design Engineering Teaching Design Strategy Iterative Design User Profiling Prototype Human Computer... User Research Wireframes User Experience Design Wire Framing Visual Design Persona See 35+     See less Usability Testing Photography Eye Tracking Medical Systems Human Factors Human-computer... Usability Engineering User Experience Ergonomics Product Design User-centered Design Task Analysis Ethnography Research Design Interaction Design User Interface Design Heuristic Evaluation Prototyping Information Architecture Focus Groups User Interface Personas Cognition Contextual Inquiry Card Sorting Information Design Statistics Research User Scenarios Analysis Qualitative Research Requirements Analysis Paper Prototyping Cognitive Psychology Web Design Storyboarding Experience Design Engineering Teaching Design Strategy Iterative Design User Profiling Prototype Human Computer... User Research Wireframes User Experience Design Wire Framing Visual Design Persona See 35+     See less Usability Testing Photography Eye Tracking Medical Systems Human Factors Human-computer... Usability Engineering User Experience Ergonomics Product Design User-centered Design Task Analysis Ethnography Research Design Interaction Design User Interface Design Heuristic Evaluation Prototyping Information Architecture Focus Groups User Interface Personas Cognition Contextual Inquiry Card Sorting Information Design Statistics Research User Scenarios Analysis Qualitative Research Requirements Analysis Paper Prototyping Cognitive Psychology Web Design Storyboarding Experience Design Engineering Teaching Design Strategy Iterative Design User Profiling Prototype Human Computer... User Research Wireframes User Experience Design Wire Framing Visual Design Persona See 35+     See less Education University of Rochester Ph.D.,  Psychology 1989  – 1995 North Carolina State University M.S.I.E.,  Ergonomics Program , Department of Industrial Engineering 1983  – 1984 Penn State University B.S.,  Industrial and Management Systems Engineering 1975  – 1980 University of Rochester Ph.D.,  Psychology 1989  – 1995 University of Rochester Ph.D.,  Psychology 1989  – 1995 University of Rochester Ph.D.,  Psychology 1989  – 1995 North Carolina State University M.S.I.E.,  Ergonomics Program , Department of Industrial Engineering 1983  – 1984 North Carolina State University M.S.I.E.,  Ergonomics Program , Department of Industrial Engineering 1983  – 1984 North Carolina State University M.S.I.E.,  Ergonomics Program , Department of Industrial Engineering 1983  – 1984 Penn State University B.S.,  Industrial and Management Systems Engineering 1975  – 1980 Penn State University B.S.,  Industrial and Management Systems Engineering 1975  – 1980 Penn State University B.S.,  Industrial and Management Systems Engineering 1975  – 1980 ", "Skills User Experience User Research Usability Usability Engineering User-centered Design Usability Testing Eye Tracking E-commerce Mobile Devices Field Studies Web Design User Interface Information Architecture Wireframes Omniture Google Analytics User Interface Design Experience Design Mobile Design User Experience Design Interaction Design Web Analytics Heuristic Evaluation Mobile Applications Content Strategy Information Design Persona Web Project Management Contextual Inquiry A/B testing Digital Strategy Web Strategy OmniGraffle Rapid Prototyping Card Sorting Web 2.0 User Scenarios Mobile Internet Task Analysis Wire Framing Human Computer... Conversion Optimization Ethnography Content Management Interactive Marketing CMS Axure E-business Design Strategy Paper Prototyping See 35+     See less Skills  User Experience User Research Usability Usability Engineering User-centered Design Usability Testing Eye Tracking E-commerce Mobile Devices Field Studies Web Design User Interface Information Architecture Wireframes Omniture Google Analytics User Interface Design Experience Design Mobile Design User Experience Design Interaction Design Web Analytics Heuristic Evaluation Mobile Applications Content Strategy Information Design Persona Web Project Management Contextual Inquiry A/B testing Digital Strategy Web Strategy OmniGraffle Rapid Prototyping Card Sorting Web 2.0 User Scenarios Mobile Internet Task Analysis Wire Framing Human Computer... Conversion Optimization Ethnography Content Management Interactive Marketing CMS Axure E-business Design Strategy Paper Prototyping See 35+     See less User Experience User Research Usability Usability Engineering User-centered Design Usability Testing Eye Tracking E-commerce Mobile Devices Field Studies Web Design User Interface Information Architecture Wireframes Omniture Google Analytics User Interface Design Experience Design Mobile Design User Experience Design Interaction Design Web Analytics Heuristic Evaluation Mobile Applications Content Strategy Information Design Persona Web Project Management Contextual Inquiry A/B testing Digital Strategy Web Strategy OmniGraffle Rapid Prototyping Card Sorting Web 2.0 User Scenarios Mobile Internet Task Analysis Wire Framing Human Computer... Conversion Optimization Ethnography Content Management Interactive Marketing CMS Axure E-business Design Strategy Paper Prototyping See 35+     See less User Experience User Research Usability Usability Engineering User-centered Design Usability Testing Eye Tracking E-commerce Mobile Devices Field Studies Web Design User Interface Information Architecture Wireframes Omniture Google Analytics User Interface Design Experience Design Mobile Design User Experience Design Interaction Design Web Analytics Heuristic Evaluation Mobile Applications Content Strategy Information Design Persona Web Project Management Contextual Inquiry A/B testing Digital Strategy Web Strategy OmniGraffle Rapid Prototyping Card Sorting Web 2.0 User Scenarios Mobile Internet Task Analysis Wire Framing Human Computer... Conversion Optimization Ethnography Content Management Interactive Marketing CMS Axure E-business Design Strategy Paper Prototyping See 35+     See less ", "Experience Director, User Research Group TiVo December 2002  – Present (12 years 9 months) Human Factors Engineer Tandem July 1997  –  December 2002  (5 years 6 months) Interface Designer Delphi Internet Service June 1994  –  May 1997  (3 years) Designed concepts for a web-based online service, and some of the first commercial new-media websites (Rolling Stones, X-Files, Speed, Power Rangers, Die Hard 2, etc). Interaction Designer delphi internet 1994  –  1996  (2 years) Director, User Research Group TiVo December 2002  – Present (12 years 9 months) Director, User Research Group TiVo December 2002  – Present (12 years 9 months) Human Factors Engineer Tandem July 1997  –  December 2002  (5 years 6 months) Human Factors Engineer Tandem July 1997  –  December 2002  (5 years 6 months) Interface Designer Delphi Internet Service June 1994  –  May 1997  (3 years) Designed concepts for a web-based online service, and some of the first commercial new-media websites (Rolling Stones, X-Files, Speed, Power Rangers, Die Hard 2, etc). Interface Designer Delphi Internet Service June 1994  –  May 1997  (3 years) Designed concepts for a web-based online service, and some of the first commercial new-media websites (Rolling Stones, X-Files, Speed, Power Rangers, Die Hard 2, etc). Interaction Designer delphi internet 1994  –  1996  (2 years) Interaction Designer delphi internet 1994  –  1996  (2 years) Skills User Research User-centered Design User Experience Human Computer... Usability Testing Interaction Design Creative Direction User Interface Design User Interface Heuristic Evaluation User Scenarios Cross-functional Team... Skills  User Research User-centered Design User Experience Human Computer... Usability Testing Interaction Design Creative Direction User Interface Design User Interface Heuristic Evaluation User Scenarios Cross-functional Team... User Research User-centered Design User Experience Human Computer... Usability Testing Interaction Design Creative Direction User Interface Design User Interface Heuristic Evaluation User Scenarios Cross-functional Team... User Research User-centered Design User Experience Human Computer... Usability Testing Interaction Design Creative Direction User Interface Design User Interface Heuristic Evaluation User Scenarios Cross-functional Team... Education Tufts University Human Factors Engineering,  Psychology ,  Mechanical Engineering ,  UI Design ,  Engineering Management 1990  – 1994 Tufts University Human Factors Engineering,  Psychology ,  Mechanical Engineering ,  UI Design ,  Engineering Management 1990  – 1994 Tufts University Human Factors Engineering,  Psychology ,  Mechanical Engineering ,  UI Design ,  Engineering Management 1990  – 1994 Tufts University Human Factors Engineering,  Psychology ,  Mechanical Engineering ,  UI Design ,  Engineering Management 1990  – 1994 ", "Skills Customer Insights Qualitative Research Ethnography Quantitative Research Global Strategy Product Development Customer Insight Consumer Behaviour Focus Groups Brand Architecture Marketing Research Advertising Research Market Research Skills  Customer Insights Qualitative Research Ethnography Quantitative Research Global Strategy Product Development Customer Insight Consumer Behaviour Focus Groups Brand Architecture Marketing Research Advertising Research Market Research Customer Insights Qualitative Research Ethnography Quantitative Research Global Strategy Product Development Customer Insight Consumer Behaviour Focus Groups Brand Architecture Marketing Research Advertising Research Market Research Customer Insights Qualitative Research Ethnography Quantitative Research Global Strategy Product Development Customer Insight Consumer Behaviour Focus Groups Brand Architecture Marketing Research Advertising Research Market Research ", "Summary - 18 years experience defining, guiding, teaching, and advocating UX practice and research \n- Focused on utilizing user experience methods to create value for both users and businesses \n- Leading research strategy and conducting a variety of approaches including usability testing, A/B testing, card sort studies, tree testing, gathering and analyzing digital analytics and using qualitative and quantitative data to make sound functionalityand design decisions Summary - 18 years experience defining, guiding, teaching, and advocating UX practice and research \n- Focused on utilizing user experience methods to create value for both users and businesses \n- Leading research strategy and conducting a variety of approaches including usability testing, A/B testing, card sort studies, tree testing, gathering and analyzing digital analytics and using qualitative and quantitative data to make sound functionalityand design decisions - 18 years experience defining, guiding, teaching, and advocating UX practice and research \n- Focused on utilizing user experience methods to create value for both users and businesses \n- Leading research strategy and conducting a variety of approaches including usability testing, A/B testing, card sort studies, tree testing, gathering and analyzing digital analytics and using qualitative and quantitative data to make sound functionalityand design decisions - 18 years experience defining, guiding, teaching, and advocating UX practice and research \n- Focused on utilizing user experience methods to create value for both users and businesses \n- Leading research strategy and conducting a variety of approaches including usability testing, A/B testing, card sort studies, tree testing, gathering and analyzing digital analytics and using qualitative and quantitative data to make sound functionalityand design decisions Experience Director of User Research athenahealth September 2014  – Present (1 year) Watertown, MA - Inform user experience improvements that drive business results and help transform the healthcare industry  \n- Deploy resources across the corporate portfolio to align with strategic priority and with program need \n- Represent User Research, UX, and R&D processes in high-stakes sales and client situations, leveraging knowledge of human cognition, human behavior, and familiarity with target customer needs \n- Encourage utilization of user research cross-functionally to improve R&D processes and address gaps  \n- Represent athenahealth’s thought leadership in healthcare \n- Simplify high levels of complexity into actionable items Director/User Experience Specialist Nielsen Norman Group May 2008  –  September 2014  (6 years 5 months) Greater Boston Area - Conduct independent and client-sponsored UX/Usability research.  \n- Initiate, coordinate and participate in various internal projects including a website overhaul, metrics adoption, and product strategy. \n- Create, maintain and teach full-day courses taught worldwide at Nielsen Norman Group's Usability Week conferences: \n- Analytics and User Experience: www.nngroup.com/courses/analytics-and-user-experience/ \n- Credibility and Persuasive Web Design: http://www.nngroup.com/courses/credibility-and-persuasive-web-design/ \n- Information Architecture: Day 1 (structure): http://www.nngroup.com/courses/ia-1/ \n- Information Architecture: Day 2 (navigation): http://www.nngroup.com/courses/ia-2/ \n- Social Features for your Site (2009-2013) Principal Site Diagnosis, LLC October 2006  –  May 2008  (1 year 8 months) Greater Boston Area - Provided website strategy, expert site reviews, competitive analysis, user testing, functional descriptions and wireframes for various clients. Director, WebExcellence (acquired from Watchfire) Keynote November 2005  –  September 2006  (11 months) Greater Boston Area - Defined and collected usability criteria for all Financial Services Scorecards (Banking, Credit Cards, Mortgage Lending, Insurance, Full-service and Discount Brokerage). \n- Managed and conducted consulting engagements including heuristic website reviews and custom competitive benchmarking. \n- Writer and editor of user experience research briefs for Scorecard subscription service. \n- Provided pre-sales and marketing support. Vice President, Customer Experience Services (acquired from Gomez) Watchfire February 2004  –  November 2005  (1 year 10 months) Greater Boston Area - Same responsibilities as at Keynote Systems plus... \n- Redefined Scorecard framework (to make it task-based)  \n- Re-architected web-based scorecard and research presentation platform. Vice President, Customer Experience Services Gomez June 1998  –  February 2004  (5 years 9 months) - Created the Customer Experience Analysis expert website review service. \n- Managed and conducted consulting engagements including heuristic website reviews and custom competitive benchmarking. \n- Authored user experience/ease of use-focused research briefs for Scorecard subscription service. \n- Provided pre-sales and marketing support. \n- Also held roles as Director of Marketing, Design Director, and Product Manager. Director, Design Planning TSDesign March 1996  –  June 1998  (2 years 4 months) - Managed website design and analysis engagements including project management, design strategy, information architecture and interaction design. \n- Codified design, analysis and client management processes. Director of User Research athenahealth September 2014  – Present (1 year) Watertown, MA - Inform user experience improvements that drive business results and help transform the healthcare industry  \n- Deploy resources across the corporate portfolio to align with strategic priority and with program need \n- Represent User Research, UX, and R&D processes in high-stakes sales and client situations, leveraging knowledge of human cognition, human behavior, and familiarity with target customer needs \n- Encourage utilization of user research cross-functionally to improve R&D processes and address gaps  \n- Represent athenahealth’s thought leadership in healthcare \n- Simplify high levels of complexity into actionable items Director of User Research athenahealth September 2014  – Present (1 year) Watertown, MA - Inform user experience improvements that drive business results and help transform the healthcare industry  \n- Deploy resources across the corporate portfolio to align with strategic priority and with program need \n- Represent User Research, UX, and R&D processes in high-stakes sales and client situations, leveraging knowledge of human cognition, human behavior, and familiarity with target customer needs \n- Encourage utilization of user research cross-functionally to improve R&D processes and address gaps  \n- Represent athenahealth’s thought leadership in healthcare \n- Simplify high levels of complexity into actionable items Director/User Experience Specialist Nielsen Norman Group May 2008  –  September 2014  (6 years 5 months) Greater Boston Area - Conduct independent and client-sponsored UX/Usability research.  \n- Initiate, coordinate and participate in various internal projects including a website overhaul, metrics adoption, and product strategy. \n- Create, maintain and teach full-day courses taught worldwide at Nielsen Norman Group's Usability Week conferences: \n- Analytics and User Experience: www.nngroup.com/courses/analytics-and-user-experience/ \n- Credibility and Persuasive Web Design: http://www.nngroup.com/courses/credibility-and-persuasive-web-design/ \n- Information Architecture: Day 1 (structure): http://www.nngroup.com/courses/ia-1/ \n- Information Architecture: Day 2 (navigation): http://www.nngroup.com/courses/ia-2/ \n- Social Features for your Site (2009-2013) Director/User Experience Specialist Nielsen Norman Group May 2008  –  September 2014  (6 years 5 months) Greater Boston Area - Conduct independent and client-sponsored UX/Usability research.  \n- Initiate, coordinate and participate in various internal projects including a website overhaul, metrics adoption, and product strategy. \n- Create, maintain and teach full-day courses taught worldwide at Nielsen Norman Group's Usability Week conferences: \n- Analytics and User Experience: www.nngroup.com/courses/analytics-and-user-experience/ \n- Credibility and Persuasive Web Design: http://www.nngroup.com/courses/credibility-and-persuasive-web-design/ \n- Information Architecture: Day 1 (structure): http://www.nngroup.com/courses/ia-1/ \n- Information Architecture: Day 2 (navigation): http://www.nngroup.com/courses/ia-2/ \n- Social Features for your Site (2009-2013) Principal Site Diagnosis, LLC October 2006  –  May 2008  (1 year 8 months) Greater Boston Area - Provided website strategy, expert site reviews, competitive analysis, user testing, functional descriptions and wireframes for various clients. Principal Site Diagnosis, LLC October 2006  –  May 2008  (1 year 8 months) Greater Boston Area - Provided website strategy, expert site reviews, competitive analysis, user testing, functional descriptions and wireframes for various clients. Director, WebExcellence (acquired from Watchfire) Keynote November 2005  –  September 2006  (11 months) Greater Boston Area - Defined and collected usability criteria for all Financial Services Scorecards (Banking, Credit Cards, Mortgage Lending, Insurance, Full-service and Discount Brokerage). \n- Managed and conducted consulting engagements including heuristic website reviews and custom competitive benchmarking. \n- Writer and editor of user experience research briefs for Scorecard subscription service. \n- Provided pre-sales and marketing support. Director, WebExcellence (acquired from Watchfire) Keynote November 2005  –  September 2006  (11 months) Greater Boston Area - Defined and collected usability criteria for all Financial Services Scorecards (Banking, Credit Cards, Mortgage Lending, Insurance, Full-service and Discount Brokerage). \n- Managed and conducted consulting engagements including heuristic website reviews and custom competitive benchmarking. \n- Writer and editor of user experience research briefs for Scorecard subscription service. \n- Provided pre-sales and marketing support. Vice President, Customer Experience Services (acquired from Gomez) Watchfire February 2004  –  November 2005  (1 year 10 months) Greater Boston Area - Same responsibilities as at Keynote Systems plus... \n- Redefined Scorecard framework (to make it task-based)  \n- Re-architected web-based scorecard and research presentation platform. Vice President, Customer Experience Services (acquired from Gomez) Watchfire February 2004  –  November 2005  (1 year 10 months) Greater Boston Area - Same responsibilities as at Keynote Systems plus... \n- Redefined Scorecard framework (to make it task-based)  \n- Re-architected web-based scorecard and research presentation platform. Vice President, Customer Experience Services Gomez June 1998  –  February 2004  (5 years 9 months) - Created the Customer Experience Analysis expert website review service. \n- Managed and conducted consulting engagements including heuristic website reviews and custom competitive benchmarking. \n- Authored user experience/ease of use-focused research briefs for Scorecard subscription service. \n- Provided pre-sales and marketing support. \n- Also held roles as Director of Marketing, Design Director, and Product Manager. Vice President, Customer Experience Services Gomez June 1998  –  February 2004  (5 years 9 months) - Created the Customer Experience Analysis expert website review service. \n- Managed and conducted consulting engagements including heuristic website reviews and custom competitive benchmarking. \n- Authored user experience/ease of use-focused research briefs for Scorecard subscription service. \n- Provided pre-sales and marketing support. \n- Also held roles as Director of Marketing, Design Director, and Product Manager. Director, Design Planning TSDesign March 1996  –  June 1998  (2 years 4 months) - Managed website design and analysis engagements including project management, design strategy, information architecture and interaction design. \n- Codified design, analysis and client management processes. Director, Design Planning TSDesign March 1996  –  June 1998  (2 years 4 months) - Managed website design and analysis engagements including project management, design strategy, information architecture and interaction design. \n- Codified design, analysis and client management processes. Skills User Experience Usability Testing Information Architecture User-centered Design User Research Interaction Design Heuristic Evaluation User Experience Design Usability Engineering User Scenarios Human Computer... Card Sorting Focus Groups Task Analysis Digital Strategy Web Analytics Google Analytics Remote User Testing Tree Testing Product Requirement... Benchmarking Quantitative Research Usability Wireframes Contextual Inquiry Persona Paper Prototyping Heuristic Analysis Experience Design Site Maps Design Strategy Wire Framing Web Strategy Analytics Iterative Design Eye Tracking Rapid Prototyping E-commerce See 23+     See less Skills  User Experience Usability Testing Information Architecture User-centered Design User Research Interaction Design Heuristic Evaluation User Experience Design Usability Engineering User Scenarios Human Computer... Card Sorting Focus Groups Task Analysis Digital Strategy Web Analytics Google Analytics Remote User Testing Tree Testing Product Requirement... Benchmarking Quantitative Research Usability Wireframes Contextual Inquiry Persona Paper Prototyping Heuristic Analysis Experience Design Site Maps Design Strategy Wire Framing Web Strategy Analytics Iterative Design Eye Tracking Rapid Prototyping E-commerce See 23+     See less User Experience Usability Testing Information Architecture User-centered Design User Research Interaction Design Heuristic Evaluation User Experience Design Usability Engineering User Scenarios Human Computer... Card Sorting Focus Groups Task Analysis Digital Strategy Web Analytics Google Analytics Remote User Testing Tree Testing Product Requirement... Benchmarking Quantitative Research Usability Wireframes Contextual Inquiry Persona Paper Prototyping Heuristic Analysis Experience Design Site Maps Design Strategy Wire Framing Web Strategy Analytics Iterative Design Eye Tracking Rapid Prototyping E-commerce See 23+     See less User Experience Usability Testing Information Architecture User-centered Design User Research Interaction Design Heuristic Evaluation User Experience Design Usability Engineering User Scenarios Human Computer... Card Sorting Focus Groups Task Analysis Digital Strategy Web Analytics Google Analytics Remote User Testing Tree Testing Product Requirement... Benchmarking Quantitative Research Usability Wireframes Contextual Inquiry Persona Paper Prototyping Heuristic Analysis Experience Design Site Maps Design Strategy Wire Framing Web Strategy Analytics Iterative Design Eye Tracking Rapid Prototyping E-commerce See 23+     See less Education Massachusetts College of Art and Design Bachelor of Fine Arts (B.F.A.) 1991  – 1994 University of Massachusetts, Amherst 1988  – 1990 Massachusetts College of Art and Design Bachelor of Fine Arts (B.F.A.) 1991  – 1994 Massachusetts College of Art and Design Bachelor of Fine Arts (B.F.A.) 1991  – 1994 Massachusetts College of Art and Design Bachelor of Fine Arts (B.F.A.) 1991  – 1994 University of Massachusetts, Amherst 1988  – 1990 University of Massachusetts, Amherst 1988  – 1990 University of Massachusetts, Amherst 1988  – 1990 "]}