{"position": "Senior Editor", "company": "Google", "profiles": ["Summary I'm a life-long journalist who is striking out in a whole new direction. I love working with people, but even more importantly I love helping others realize their dreams. I have a passion for all things real estate and look forward to using that passion along with my attention to detail and strong work ethic to guide clients through the process of making some of the biggest investment decisions of their life. Summary I'm a life-long journalist who is striking out in a whole new direction. I love working with people, but even more importantly I love helping others realize their dreams. I have a passion for all things real estate and look forward to using that passion along with my attention to detail and strong work ethic to guide clients through the process of making some of the biggest investment decisions of their life. I'm a life-long journalist who is striking out in a whole new direction. I love working with people, but even more importantly I love helping others realize their dreams. I have a passion for all things real estate and look forward to using that passion along with my attention to detail and strong work ethic to guide clients through the process of making some of the biggest investment decisions of their life. I'm a life-long journalist who is striking out in a whole new direction. I love working with people, but even more importantly I love helping others realize their dreams. I have a passion for all things real estate and look forward to using that passion along with my attention to detail and strong work ethic to guide clients through the process of making some of the biggest investment decisions of their life. Experience Realtor Snyder Strategy Realty, Inc. February 2015  – Present (7 months) Indianapolis, Indiana Area I am licensed in the purchasing and selling of real estate. I specialize in residential sales in metro Indianapolis. Real estate agent CENTURY 21 Scheetz December 2014  –  February 2015  (3 months) Indianapolis, Indiana Area I specialized in buying and selling residential real estate. Senior Editor Yahoo Sports October 2005  –  December 2013  (8 years 3 months) I helped establish Yahoo Sports as the No. 1 sports Web site in the United States. As Senior Editor, I was the experienced voice of reason on a growing staff that valued being first and being best. Among my duties: \n-- Web page updates focusing on the front page of the site. I was responsible for breaking news, live game updates, article and photo selection, copy editing and headline writing \n-- Article engagement with emphasis on related story links, video and slideshows \n-- Social media with a focus on growing traffic through lively and timely entries on Twitter and Facebook \n-- Staff training \n-- Reporter, covering the Indianapolis 500 on four occasions Sports Editor/Content Manager Indianapolis Star December 1983  –  October 2005  (21 years 11 months) I rose through the ranks to play key print and online leadership roles, displaying valuable skills in a wide variety of endeavors: \n-- Sports copy desk chief and page designer \n-- News desk chief and page designer including a lead role in the Star's Pan Am Games coverage \n-- Sports Editor for Indiana's best sports section (as recognized by the Hoosier State Press Association), enhancing coverage of high school, college and professional sports while growing and diversifying a staff of more than 20 journalists \n-- As Content Manager for the award-winning IndyStar.com, I was responsible for developing and implementing a coverage strategy that encompassed sports, business and news. I also took a leading role in creating and producing the popular niche sites Indiana’s Game and SpeedNet Sports Editor Fort Wayne Journal-Gazette June 1976  –  December 1983  (7 years 7 months) Fort Wayne, Indiana I led the sports staff for Northeast Indiana's premier newspaper, recognized as one of the state's best by the Hoosier State Press Association. During my tenure the sports section grew in size and stature, with enhanced high school and college coverage and hard-hitting investigative journalism. Realtor Snyder Strategy Realty, Inc. February 2015  – Present (7 months) Indianapolis, Indiana Area I am licensed in the purchasing and selling of real estate. I specialize in residential sales in metro Indianapolis. Realtor Snyder Strategy Realty, Inc. February 2015  – Present (7 months) Indianapolis, Indiana Area I am licensed in the purchasing and selling of real estate. I specialize in residential sales in metro Indianapolis. Real estate agent CENTURY 21 Scheetz December 2014  –  February 2015  (3 months) Indianapolis, Indiana Area I specialized in buying and selling residential real estate. Real estate agent CENTURY 21 Scheetz December 2014  –  February 2015  (3 months) Indianapolis, Indiana Area I specialized in buying and selling residential real estate. Senior Editor Yahoo Sports October 2005  –  December 2013  (8 years 3 months) I helped establish Yahoo Sports as the No. 1 sports Web site in the United States. As Senior Editor, I was the experienced voice of reason on a growing staff that valued being first and being best. Among my duties: \n-- Web page updates focusing on the front page of the site. I was responsible for breaking news, live game updates, article and photo selection, copy editing and headline writing \n-- Article engagement with emphasis on related story links, video and slideshows \n-- Social media with a focus on growing traffic through lively and timely entries on Twitter and Facebook \n-- Staff training \n-- Reporter, covering the Indianapolis 500 on four occasions Senior Editor Yahoo Sports October 2005  –  December 2013  (8 years 3 months) I helped establish Yahoo Sports as the No. 1 sports Web site in the United States. As Senior Editor, I was the experienced voice of reason on a growing staff that valued being first and being best. Among my duties: \n-- Web page updates focusing on the front page of the site. I was responsible for breaking news, live game updates, article and photo selection, copy editing and headline writing \n-- Article engagement with emphasis on related story links, video and slideshows \n-- Social media with a focus on growing traffic through lively and timely entries on Twitter and Facebook \n-- Staff training \n-- Reporter, covering the Indianapolis 500 on four occasions Sports Editor/Content Manager Indianapolis Star December 1983  –  October 2005  (21 years 11 months) I rose through the ranks to play key print and online leadership roles, displaying valuable skills in a wide variety of endeavors: \n-- Sports copy desk chief and page designer \n-- News desk chief and page designer including a lead role in the Star's Pan Am Games coverage \n-- Sports Editor for Indiana's best sports section (as recognized by the Hoosier State Press Association), enhancing coverage of high school, college and professional sports while growing and diversifying a staff of more than 20 journalists \n-- As Content Manager for the award-winning IndyStar.com, I was responsible for developing and implementing a coverage strategy that encompassed sports, business and news. I also took a leading role in creating and producing the popular niche sites Indiana’s Game and SpeedNet Sports Editor/Content Manager Indianapolis Star December 1983  –  October 2005  (21 years 11 months) I rose through the ranks to play key print and online leadership roles, displaying valuable skills in a wide variety of endeavors: \n-- Sports copy desk chief and page designer \n-- News desk chief and page designer including a lead role in the Star's Pan Am Games coverage \n-- Sports Editor for Indiana's best sports section (as recognized by the Hoosier State Press Association), enhancing coverage of high school, college and professional sports while growing and diversifying a staff of more than 20 journalists \n-- As Content Manager for the award-winning IndyStar.com, I was responsible for developing and implementing a coverage strategy that encompassed sports, business and news. I also took a leading role in creating and producing the popular niche sites Indiana’s Game and SpeedNet Sports Editor Fort Wayne Journal-Gazette June 1976  –  December 1983  (7 years 7 months) Fort Wayne, Indiana I led the sports staff for Northeast Indiana's premier newspaper, recognized as one of the state's best by the Hoosier State Press Association. During my tenure the sports section grew in size and stature, with enhanced high school and college coverage and hard-hitting investigative journalism. Sports Editor Fort Wayne Journal-Gazette June 1976  –  December 1983  (7 years 7 months) Fort Wayne, Indiana I led the sports staff for Northeast Indiana's premier newspaper, recognized as one of the state's best by the Hoosier State Press Association. During my tenure the sports section grew in size and stature, with enhanced high school and college coverage and hard-hitting investigative journalism. Skills Real estate Editing Sports Journalism AP Style Online Journalism Photoshop HTML English Writing Public Speaking Copywriting Microsoft Word Customer Service Teaching Budgets Sports, business and... Microsoft Office Windows Outlook Feature Articles Copy Editing Strategic Planning Newspapers News Writing Press Releases Facebook Blogging Social Media See 14+     See less Skills  Real estate Editing Sports Journalism AP Style Online Journalism Photoshop HTML English Writing Public Speaking Copywriting Microsoft Word Customer Service Teaching Budgets Sports, business and... Microsoft Office Windows Outlook Feature Articles Copy Editing Strategic Planning Newspapers News Writing Press Releases Facebook Blogging Social Media See 14+     See less Real estate Editing Sports Journalism AP Style Online Journalism Photoshop HTML English Writing Public Speaking Copywriting Microsoft Word Customer Service Teaching Budgets Sports, business and... Microsoft Office Windows Outlook Feature Articles Copy Editing Strategic Planning Newspapers News Writing Press Releases Facebook Blogging Social Media See 14+     See less Real estate Editing Sports Journalism AP Style Online Journalism Photoshop HTML English Writing Public Speaking Copywriting Microsoft Word Customer Service Teaching Budgets Sports, business and... Microsoft Office Windows Outlook Feature Articles Copy Editing Strategic Planning Newspapers News Writing Press Releases Facebook Blogging Social Media See 14+     See less Education Grace College and Seminary Bachelor's Degree,  Bible/Biblical Studies with minor in journalism 1972  – 1974 Dr. White grounded me in the tenets of journalism, which have served me well during my successful career. One of the highlights was graduating in the old Billy Sunday Tabernacle. Activities and Societies:  I was the first Grace College student to test out of a course. Cedarville University Bible/Biblical Studies 1970  – 1972 Cedarville was my first college experience. I transferred to pursue a career in journalism but I will always fondly remember the experiences and friendships from those early days. Activities and Societies:  Student newspaper editor Grace College and Seminary Bachelor's Degree,  Bible/Biblical Studies with minor in journalism 1972  – 1974 Dr. White grounded me in the tenets of journalism, which have served me well during my successful career. One of the highlights was graduating in the old Billy Sunday Tabernacle. Activities and Societies:  I was the first Grace College student to test out of a course. Grace College and Seminary Bachelor's Degree,  Bible/Biblical Studies with minor in journalism 1972  – 1974 Dr. White grounded me in the tenets of journalism, which have served me well during my successful career. One of the highlights was graduating in the old Billy Sunday Tabernacle. Activities and Societies:  I was the first Grace College student to test out of a course. Grace College and Seminary Bachelor's Degree,  Bible/Biblical Studies with minor in journalism 1972  – 1974 Dr. White grounded me in the tenets of journalism, which have served me well during my successful career. One of the highlights was graduating in the old Billy Sunday Tabernacle. Activities and Societies:  I was the first Grace College student to test out of a course. Cedarville University Bible/Biblical Studies 1970  – 1972 Cedarville was my first college experience. I transferred to pursue a career in journalism but I will always fondly remember the experiences and friendships from those early days. Activities and Societies:  Student newspaper editor Cedarville University Bible/Biblical Studies 1970  – 1972 Cedarville was my first college experience. I transferred to pursue a career in journalism but I will always fondly remember the experiences and friendships from those early days. Activities and Societies:  Student newspaper editor Cedarville University Bible/Biblical Studies 1970  – 1972 Cedarville was my first college experience. I transferred to pursue a career in journalism but I will always fondly remember the experiences and friendships from those early days. Activities and Societies:  Student newspaper editor ", "Summary I drive traffic to Yahoo Sports, which has resulted in billions of pageviews and millions of dollars in revenue for our business. Summary I drive traffic to Yahoo Sports, which has resulted in billions of pageviews and millions of dollars in revenue for our business. I drive traffic to Yahoo Sports, which has resulted in billions of pageviews and millions of dollars in revenue for our business. I drive traffic to Yahoo Sports, which has resulted in billions of pageviews and millions of dollars in revenue for our business. Experience Senior Editor Yahoo! Sports August 2012  – Present (3 years 1 month) Santa Monica, California -- Created the \"trending\" team, targeting big-traffic subjects in real time in order to maximize traffic to the site.  \n \nResults: 10 million \"quality\" pageviews/weekly \n \n-- Editorial lead for \"Tentpole\" events (Olympics, World Cup, etc) \nManage team of writers/bloggers and video producers, generating upwards of 2 billion pageviews and 20-plus million video streams per event \n \n-- Manage multi-million dollar sponsor relationships: Under my watch, we have hit every sponsor goal in two Olympic Games and the 2014 World Cup \n \n-- Write columns, features, blog posts Editor Yahoo! Sports 2007  – Present (8 years) Wrote, edited, assigned and programmed content The Morning Call Tribune Company 2004  –  2007  (3 years) Sports reporter/columnist Davis Enterprise Davis Enterprise 2000  –  2003  (3 years) Sports reporter Senior Editor Yahoo! Sports August 2012  – Present (3 years 1 month) Santa Monica, California -- Created the \"trending\" team, targeting big-traffic subjects in real time in order to maximize traffic to the site.  \n \nResults: 10 million \"quality\" pageviews/weekly \n \n-- Editorial lead for \"Tentpole\" events (Olympics, World Cup, etc) \nManage team of writers/bloggers and video producers, generating upwards of 2 billion pageviews and 20-plus million video streams per event \n \n-- Manage multi-million dollar sponsor relationships: Under my watch, we have hit every sponsor goal in two Olympic Games and the 2014 World Cup \n \n-- Write columns, features, blog posts Senior Editor Yahoo! Sports August 2012  – Present (3 years 1 month) Santa Monica, California -- Created the \"trending\" team, targeting big-traffic subjects in real time in order to maximize traffic to the site.  \n \nResults: 10 million \"quality\" pageviews/weekly \n \n-- Editorial lead for \"Tentpole\" events (Olympics, World Cup, etc) \nManage team of writers/bloggers and video producers, generating upwards of 2 billion pageviews and 20-plus million video streams per event \n \n-- Manage multi-million dollar sponsor relationships: Under my watch, we have hit every sponsor goal in two Olympic Games and the 2014 World Cup \n \n-- Write columns, features, blog posts Editor Yahoo! Sports 2007  – Present (8 years) Wrote, edited, assigned and programmed content Editor Yahoo! Sports 2007  – Present (8 years) Wrote, edited, assigned and programmed content The Morning Call Tribune Company 2004  –  2007  (3 years) Sports reporter/columnist The Morning Call Tribune Company 2004  –  2007  (3 years) Sports reporter/columnist Davis Enterprise Davis Enterprise 2000  –  2003  (3 years) Sports reporter Davis Enterprise Davis Enterprise 2000  –  2003  (3 years) Sports reporter Skills Online Journalism News Writing copy editing Online site strategy HTML Content Strategy Blogging Storytelling Editing Digital Media Journalism New Media Social Media Writing Editorial Web Content See 1+     See less Skills  Online Journalism News Writing copy editing Online site strategy HTML Content Strategy Blogging Storytelling Editing Digital Media Journalism New Media Social Media Writing Editorial Web Content See 1+     See less Online Journalism News Writing copy editing Online site strategy HTML Content Strategy Blogging Storytelling Editing Digital Media Journalism New Media Social Media Writing Editorial Web Content See 1+     See less Online Journalism News Writing copy editing Online site strategy HTML Content Strategy Blogging Storytelling Editing Digital Media Journalism New Media Social Media Writing Editorial Web Content See 1+     See less Education Columbia University - Graduate School of Journalism Master's degree,  Journalism 2003  – 2004 Masters in Journalism Activities and Societies:  Masters in Journalism Northwestern University Bachelor of Arts (BA),  Political Science and Government 1992  – 1996 Learned how to think Activities and Societies:  Learned how to think Columbia University - Graduate School of Journalism Master's degree,  Journalism 2003  – 2004 Masters in Journalism Activities and Societies:  Masters in Journalism Columbia University - Graduate School of Journalism Master's degree,  Journalism 2003  – 2004 Masters in Journalism Activities and Societies:  Masters in Journalism Columbia University - Graduate School of Journalism Master's degree,  Journalism 2003  – 2004 Masters in Journalism Activities and Societies:  Masters in Journalism Northwestern University Bachelor of Arts (BA),  Political Science and Government 1992  – 1996 Learned how to think Activities and Societies:  Learned how to think Northwestern University Bachelor of Arts (BA),  Political Science and Government 1992  – 1996 Learned how to think Activities and Societies:  Learned how to think Northwestern University Bachelor of Arts (BA),  Political Science and Government 1992  – 1996 Learned how to think Activities and Societies:  Learned how to think ", "Summary Media executive specializing in digital content development and product strategy. Summary Media executive specializing in digital content development and product strategy. Media executive specializing in digital content development and product strategy. Media executive specializing in digital content development and product strategy. Experience Senior Vice President, Content Production FOX Sports Digital July 2015  – Present (2 months) Playa Vista, CA Oversee all aspects of editorial production, programming and distribution at FoxSports.com and its affiliated properties, including social media, creative development and audience development. \n Vice President, Digital Strategy USA Today Sports Media Group December 2013  –  July 2015  (1 year 8 months) McLean, VA • Lead 42-person team focused on creating innovative digital products and experiences, primarily for mobile and social audiences. \n \n• Conceived, won broad support for and launched Gannett’s first social news site, For The Win, in May ’13, which won Digiday’s award for Best Mobile Content Site in May ‘14.  \n \n• Grew FTW’s unique user base to 14.7 million in eight months through aggressive focus on social sharing. As a result, FTW is one of the fastest-growing sports properties in history. \n \n• Educated sales executives on FTW’s market differentiation, leading to a lucrative launch sponsorship. \n \n* In August 2014, launched the first daily fantasy game (FantasyScore) developed by a mainstream sports site. \n \n* Lead all stages of development for FantasyScore: Identified opportunity, drove consensus across SMG and broader Gannett Co., formed strategic external partnerships to support the product and oversaw all creative aspects from design to branding to PR/marketing. \n \n• Lead creative development of our new mobile app (Sept. ‘14 release). The app will drive the conversation around the must-see, in-progress sports moments everyone will be talking about. \n \n• Won broad support for the app by pitching key Gannett executives on the concept. \n \n• Organized USA TODAY Sports’ first-ever panel at SXSW Interactive – “Innovation in Big-Time College Football,” a conversation with Texas Tech football coach Kliff Kingsbury – and our first Super Bowl party, a social-themed FTW event in New York City. Vice President, Content USA Today Sports Media Group November 2011  –  December 2013  (2 years 2 months) McLean, VA • Partnered with division president on sweeping newsroom reorganization to transform a print-based workforce into a digital-first, 24/7 news operation. \n \n• Oversaw content creation, production and distribution of all of Gannett’s sports assets, including print, digital and video. Built company’s first dedicated social news and video production teams. \n \n• Coordinated coverage of all major sporting events across Gannett, including Super Bowls, the London Olympics and the World Cup. \n \n• Influenced strategy around our league partnerships (NFL, NFLPA, MLB, PGA and NASCAR), media partnerships and our events business to create profitable sponsor-driven properties like AdMeter, Fan Index and the forthcoming Social Media Awards. \n \n• Orchestrated content/programming strategy that lead SMG from being off comScore radar into Top 5 following the strategic acquisition of Big Lead Sports network and the launch of FTW. Managing Editor, Blogs Yahoo! Sports April 2009  –  December 2011  (2 years 9 months) •\tDirected a staff of 35 writers who produced 15 blogs read by ~50 million unique users per month. Average monthly blog traffic was about 300 million page views. \n•\tSupervised all aspects of personnel including payroll, contract negotiations, talent acquisition and partner relations. \n•\tActed as primary conduit between writing staff and the world's most web popular portal – the Yahoo! front page – to cultivate stories on trending \"water cooler\" moments.  \n•\tManaged all Yahoo! Sports' social media outlets, including our official Twitter and Facebook pages. \n•\tResults-oriented leader with a proven track record of engaging a large, general audience: \no\tIncreased page views 415% by emphasizing broad-interest content that engages casual fans. \no\tIncreased total time spent 450% by identifying underserved areas of reader interest and building content communities around them to attract and retain new users. \no\tIncreased time spent per user 96% by expanding use of photo galleries and embedded, in-network video to more deeply engage our existing users. \no\tDoubled revenue through strategic partnerships with major sports leagues and corporations. \no\tTripled social media referrals by creating and promoting Facebook pages for all 15 blogs, and maintaining Yahoo! Sports' Twitter feed. \no\tTripled daily users on Facebook in Q1 2011 with aggressive marketing/editorial campaigns.  \no\tRaised Yahoo! Sports' profile: Ranked comScore's No. 1 sports site every month of my term. \n•\tConceived and executed content for major events including the World Cup and Olympics. Hired editorial teams to cover both and directed Olympics coverage from the ground in Vancouver. \no\tAchieved No. 1 comScore ranking for Olympics with 32m uniques by creating a competitive analysis plan that undermined NBC's strengths and highlighted our dexterity. \no\tDefeated World Cup competitors in all key metrics by focusing on quirky stories to attract the general user, balanced with credible analysis by the world's best bloggers. Assistant Managing Editor Yahoo! Sports October 2007  –  March 2009  (1 year 6 months) • Oversaw the programming of all original and partner content for Yahoo! Sports, which I led past ESPN into No. 1 for the first time and held that ranking over the final 12 months of my term. \n \n• Ensured that all pages were programmed in a relevant, timely and compelling manner that matched Y! Sports' editorial voice and business objectives. \n \n• Managed copy desk staff of 11 editors. Day-to-day responsibilities included staff scheduling, training and career development; hiring; working with writers to create stories to match the Yahoo! voice; editing key content pieces and determining resource allocation. \n \n• Assisted executive editor in identification and prioritization of original content enterprises. Selected and recruited key talent to lead strategic initiatives and ensure achievement of goals. \n \n• Directed coverage of all major events, including the Olympics from the ground in Beijing, where I led a team of 30 writers and producers to a No. 1 finish ahead of NBC Sports (32m uniques to 23m). Senior Editor Yahoo! Sports October 2005  –  October 2007  (2 years 1 month) • Major League Baseball editor: Managed three reporters and numerous partners who contributed exclusive baseball analysis. Generated story ideas and special packages, ensured timeliness and relevance of news and opinion, and oversaw all aspects of the site's presentation and functionality. \n \n• Executive editor, Turin Olympics: Hired and lead a team of 20 editors, writers, analysts, producers and designers. Directed all aspects of editorial coverage, from site functionality to story ideas to copy editing to packaging choices. Won Yahoo's highest company award for producing comprehensive, engaging news coverage that drew significantly more users than NBC Olympics (10m uniques vs. 7m). Sports Editor latimes.com/Los Angeles Times 1999  –  2005  (6 years) • Designed dynamic packages for a variety of major sporting events. Selected and edited multimedia elements (photos, audio and video) and packaged them with paper's text to shape holistic narratives. \n \n• Was lead editorial producer on four NBA Finals, three Olympics and the 2002 FIFA World Cup. \n \n• Trained and managed a staff of seven editors who contributed to production of sports site. \n \n• Liaison to print staff. Coordinated coverage with top print editors and writers, dictated story play for daily edition and breaking news, rewrote wire stories and edited raw staff copy. Associate Editor The Sporting News/sportingnews.com February 1999  –  September 1999  (8 months) • News desk editor in charge of updating home page and sport section front pages with breaking news. \n \n• Wrote weekly college football and major league baseball columns and regularly contributed analysis of all sports. Expanded beyond game coverage with features that told athletes’ personal stories. Intern Chicago Tribune 1998  –  1999  (1 year) • Posted breaking news and packaged daily edition stories with related photos and audio. \n \n• Beat writer for the minor league Kane County Cougars. Wrote game stories, features and columns. Senior Vice President, Content Production FOX Sports Digital July 2015  – Present (2 months) Playa Vista, CA Oversee all aspects of editorial production, programming and distribution at FoxSports.com and its affiliated properties, including social media, creative development and audience development. \n Senior Vice President, Content Production FOX Sports Digital July 2015  – Present (2 months) Playa Vista, CA Oversee all aspects of editorial production, programming and distribution at FoxSports.com and its affiliated properties, including social media, creative development and audience development. \n Vice President, Digital Strategy USA Today Sports Media Group December 2013  –  July 2015  (1 year 8 months) McLean, VA • Lead 42-person team focused on creating innovative digital products and experiences, primarily for mobile and social audiences. \n \n• Conceived, won broad support for and launched Gannett’s first social news site, For The Win, in May ’13, which won Digiday’s award for Best Mobile Content Site in May ‘14.  \n \n• Grew FTW’s unique user base to 14.7 million in eight months through aggressive focus on social sharing. As a result, FTW is one of the fastest-growing sports properties in history. \n \n• Educated sales executives on FTW’s market differentiation, leading to a lucrative launch sponsorship. \n \n* In August 2014, launched the first daily fantasy game (FantasyScore) developed by a mainstream sports site. \n \n* Lead all stages of development for FantasyScore: Identified opportunity, drove consensus across SMG and broader Gannett Co., formed strategic external partnerships to support the product and oversaw all creative aspects from design to branding to PR/marketing. \n \n• Lead creative development of our new mobile app (Sept. ‘14 release). The app will drive the conversation around the must-see, in-progress sports moments everyone will be talking about. \n \n• Won broad support for the app by pitching key Gannett executives on the concept. \n \n• Organized USA TODAY Sports’ first-ever panel at SXSW Interactive – “Innovation in Big-Time College Football,” a conversation with Texas Tech football coach Kliff Kingsbury – and our first Super Bowl party, a social-themed FTW event in New York City. Vice President, Digital Strategy USA Today Sports Media Group December 2013  –  July 2015  (1 year 8 months) McLean, VA • Lead 42-person team focused on creating innovative digital products and experiences, primarily for mobile and social audiences. \n \n• Conceived, won broad support for and launched Gannett’s first social news site, For The Win, in May ’13, which won Digiday’s award for Best Mobile Content Site in May ‘14.  \n \n• Grew FTW’s unique user base to 14.7 million in eight months through aggressive focus on social sharing. As a result, FTW is one of the fastest-growing sports properties in history. \n \n• Educated sales executives on FTW’s market differentiation, leading to a lucrative launch sponsorship. \n \n* In August 2014, launched the first daily fantasy game (FantasyScore) developed by a mainstream sports site. \n \n* Lead all stages of development for FantasyScore: Identified opportunity, drove consensus across SMG and broader Gannett Co., formed strategic external partnerships to support the product and oversaw all creative aspects from design to branding to PR/marketing. \n \n• Lead creative development of our new mobile app (Sept. ‘14 release). The app will drive the conversation around the must-see, in-progress sports moments everyone will be talking about. \n \n• Won broad support for the app by pitching key Gannett executives on the concept. \n \n• Organized USA TODAY Sports’ first-ever panel at SXSW Interactive – “Innovation in Big-Time College Football,” a conversation with Texas Tech football coach Kliff Kingsbury – and our first Super Bowl party, a social-themed FTW event in New York City. Vice President, Content USA Today Sports Media Group November 2011  –  December 2013  (2 years 2 months) McLean, VA • Partnered with division president on sweeping newsroom reorganization to transform a print-based workforce into a digital-first, 24/7 news operation. \n \n• Oversaw content creation, production and distribution of all of Gannett’s sports assets, including print, digital and video. Built company’s first dedicated social news and video production teams. \n \n• Coordinated coverage of all major sporting events across Gannett, including Super Bowls, the London Olympics and the World Cup. \n \n• Influenced strategy around our league partnerships (NFL, NFLPA, MLB, PGA and NASCAR), media partnerships and our events business to create profitable sponsor-driven properties like AdMeter, Fan Index and the forthcoming Social Media Awards. \n \n• Orchestrated content/programming strategy that lead SMG from being off comScore radar into Top 5 following the strategic acquisition of Big Lead Sports network and the launch of FTW. Vice President, Content USA Today Sports Media Group November 2011  –  December 2013  (2 years 2 months) McLean, VA • Partnered with division president on sweeping newsroom reorganization to transform a print-based workforce into a digital-first, 24/7 news operation. \n \n• Oversaw content creation, production and distribution of all of Gannett’s sports assets, including print, digital and video. Built company’s first dedicated social news and video production teams. \n \n• Coordinated coverage of all major sporting events across Gannett, including Super Bowls, the London Olympics and the World Cup. \n \n• Influenced strategy around our league partnerships (NFL, NFLPA, MLB, PGA and NASCAR), media partnerships and our events business to create profitable sponsor-driven properties like AdMeter, Fan Index and the forthcoming Social Media Awards. \n \n• Orchestrated content/programming strategy that lead SMG from being off comScore radar into Top 5 following the strategic acquisition of Big Lead Sports network and the launch of FTW. Managing Editor, Blogs Yahoo! Sports April 2009  –  December 2011  (2 years 9 months) •\tDirected a staff of 35 writers who produced 15 blogs read by ~50 million unique users per month. Average monthly blog traffic was about 300 million page views. \n•\tSupervised all aspects of personnel including payroll, contract negotiations, talent acquisition and partner relations. \n•\tActed as primary conduit between writing staff and the world's most web popular portal – the Yahoo! front page – to cultivate stories on trending \"water cooler\" moments.  \n•\tManaged all Yahoo! Sports' social media outlets, including our official Twitter and Facebook pages. \n•\tResults-oriented leader with a proven track record of engaging a large, general audience: \no\tIncreased page views 415% by emphasizing broad-interest content that engages casual fans. \no\tIncreased total time spent 450% by identifying underserved areas of reader interest and building content communities around them to attract and retain new users. \no\tIncreased time spent per user 96% by expanding use of photo galleries and embedded, in-network video to more deeply engage our existing users. \no\tDoubled revenue through strategic partnerships with major sports leagues and corporations. \no\tTripled social media referrals by creating and promoting Facebook pages for all 15 blogs, and maintaining Yahoo! Sports' Twitter feed. \no\tTripled daily users on Facebook in Q1 2011 with aggressive marketing/editorial campaigns.  \no\tRaised Yahoo! Sports' profile: Ranked comScore's No. 1 sports site every month of my term. \n•\tConceived and executed content for major events including the World Cup and Olympics. Hired editorial teams to cover both and directed Olympics coverage from the ground in Vancouver. \no\tAchieved No. 1 comScore ranking for Olympics with 32m uniques by creating a competitive analysis plan that undermined NBC's strengths and highlighted our dexterity. \no\tDefeated World Cup competitors in all key metrics by focusing on quirky stories to attract the general user, balanced with credible analysis by the world's best bloggers. Managing Editor, Blogs Yahoo! Sports April 2009  –  December 2011  (2 years 9 months) •\tDirected a staff of 35 writers who produced 15 blogs read by ~50 million unique users per month. Average monthly blog traffic was about 300 million page views. \n•\tSupervised all aspects of personnel including payroll, contract negotiations, talent acquisition and partner relations. \n•\tActed as primary conduit between writing staff and the world's most web popular portal – the Yahoo! front page – to cultivate stories on trending \"water cooler\" moments.  \n•\tManaged all Yahoo! Sports' social media outlets, including our official Twitter and Facebook pages. \n•\tResults-oriented leader with a proven track record of engaging a large, general audience: \no\tIncreased page views 415% by emphasizing broad-interest content that engages casual fans. \no\tIncreased total time spent 450% by identifying underserved areas of reader interest and building content communities around them to attract and retain new users. \no\tIncreased time spent per user 96% by expanding use of photo galleries and embedded, in-network video to more deeply engage our existing users. \no\tDoubled revenue through strategic partnerships with major sports leagues and corporations. \no\tTripled social media referrals by creating and promoting Facebook pages for all 15 blogs, and maintaining Yahoo! Sports' Twitter feed. \no\tTripled daily users on Facebook in Q1 2011 with aggressive marketing/editorial campaigns.  \no\tRaised Yahoo! Sports' profile: Ranked comScore's No. 1 sports site every month of my term. \n•\tConceived and executed content for major events including the World Cup and Olympics. Hired editorial teams to cover both and directed Olympics coverage from the ground in Vancouver. \no\tAchieved No. 1 comScore ranking for Olympics with 32m uniques by creating a competitive analysis plan that undermined NBC's strengths and highlighted our dexterity. \no\tDefeated World Cup competitors in all key metrics by focusing on quirky stories to attract the general user, balanced with credible analysis by the world's best bloggers. Assistant Managing Editor Yahoo! Sports October 2007  –  March 2009  (1 year 6 months) • Oversaw the programming of all original and partner content for Yahoo! Sports, which I led past ESPN into No. 1 for the first time and held that ranking over the final 12 months of my term. \n \n• Ensured that all pages were programmed in a relevant, timely and compelling manner that matched Y! Sports' editorial voice and business objectives. \n \n• Managed copy desk staff of 11 editors. Day-to-day responsibilities included staff scheduling, training and career development; hiring; working with writers to create stories to match the Yahoo! voice; editing key content pieces and determining resource allocation. \n \n• Assisted executive editor in identification and prioritization of original content enterprises. Selected and recruited key talent to lead strategic initiatives and ensure achievement of goals. \n \n• Directed coverage of all major events, including the Olympics from the ground in Beijing, where I led a team of 30 writers and producers to a No. 1 finish ahead of NBC Sports (32m uniques to 23m). Assistant Managing Editor Yahoo! Sports October 2007  –  March 2009  (1 year 6 months) • Oversaw the programming of all original and partner content for Yahoo! Sports, which I led past ESPN into No. 1 for the first time and held that ranking over the final 12 months of my term. \n \n• Ensured that all pages were programmed in a relevant, timely and compelling manner that matched Y! Sports' editorial voice and business objectives. \n \n• Managed copy desk staff of 11 editors. Day-to-day responsibilities included staff scheduling, training and career development; hiring; working with writers to create stories to match the Yahoo! voice; editing key content pieces and determining resource allocation. \n \n• Assisted executive editor in identification and prioritization of original content enterprises. Selected and recruited key talent to lead strategic initiatives and ensure achievement of goals. \n \n• Directed coverage of all major events, including the Olympics from the ground in Beijing, where I led a team of 30 writers and producers to a No. 1 finish ahead of NBC Sports (32m uniques to 23m). Senior Editor Yahoo! Sports October 2005  –  October 2007  (2 years 1 month) • Major League Baseball editor: Managed three reporters and numerous partners who contributed exclusive baseball analysis. Generated story ideas and special packages, ensured timeliness and relevance of news and opinion, and oversaw all aspects of the site's presentation and functionality. \n \n• Executive editor, Turin Olympics: Hired and lead a team of 20 editors, writers, analysts, producers and designers. Directed all aspects of editorial coverage, from site functionality to story ideas to copy editing to packaging choices. Won Yahoo's highest company award for producing comprehensive, engaging news coverage that drew significantly more users than NBC Olympics (10m uniques vs. 7m). Senior Editor Yahoo! Sports October 2005  –  October 2007  (2 years 1 month) • Major League Baseball editor: Managed three reporters and numerous partners who contributed exclusive baseball analysis. Generated story ideas and special packages, ensured timeliness and relevance of news and opinion, and oversaw all aspects of the site's presentation and functionality. \n \n• Executive editor, Turin Olympics: Hired and lead a team of 20 editors, writers, analysts, producers and designers. Directed all aspects of editorial coverage, from site functionality to story ideas to copy editing to packaging choices. Won Yahoo's highest company award for producing comprehensive, engaging news coverage that drew significantly more users than NBC Olympics (10m uniques vs. 7m). Sports Editor latimes.com/Los Angeles Times 1999  –  2005  (6 years) • Designed dynamic packages for a variety of major sporting events. Selected and edited multimedia elements (photos, audio and video) and packaged them with paper's text to shape holistic narratives. \n \n• Was lead editorial producer on four NBA Finals, three Olympics and the 2002 FIFA World Cup. \n \n• Trained and managed a staff of seven editors who contributed to production of sports site. \n \n• Liaison to print staff. Coordinated coverage with top print editors and writers, dictated story play for daily edition and breaking news, rewrote wire stories and edited raw staff copy. Sports Editor latimes.com/Los Angeles Times 1999  –  2005  (6 years) • Designed dynamic packages for a variety of major sporting events. Selected and edited multimedia elements (photos, audio and video) and packaged them with paper's text to shape holistic narratives. \n \n• Was lead editorial producer on four NBA Finals, three Olympics and the 2002 FIFA World Cup. \n \n• Trained and managed a staff of seven editors who contributed to production of sports site. \n \n• Liaison to print staff. Coordinated coverage with top print editors and writers, dictated story play for daily edition and breaking news, rewrote wire stories and edited raw staff copy. Associate Editor The Sporting News/sportingnews.com February 1999  –  September 1999  (8 months) • News desk editor in charge of updating home page and sport section front pages with breaking news. \n \n• Wrote weekly college football and major league baseball columns and regularly contributed analysis of all sports. Expanded beyond game coverage with features that told athletes’ personal stories. Associate Editor The Sporting News/sportingnews.com February 1999  –  September 1999  (8 months) • News desk editor in charge of updating home page and sport section front pages with breaking news. \n \n• Wrote weekly college football and major league baseball columns and regularly contributed analysis of all sports. Expanded beyond game coverage with features that told athletes’ personal stories. Intern Chicago Tribune 1998  –  1999  (1 year) • Posted breaking news and packaged daily edition stories with related photos and audio. \n \n• Beat writer for the minor league Kane County Cougars. Wrote game stories, features and columns. Intern Chicago Tribune 1998  –  1999  (1 year) • Posted breaking news and packaged daily edition stories with related photos and audio. \n \n• Beat writer for the minor league Kane County Cougars. Wrote game stories, features and columns. Skills HTML Blogging Stories Sports Editing Editorial Writing Content Development Video Breaking News AP Style Web Content News Writing Copy Editing Journalism Newspaper Online Journalism Facebook Content Management Online Publishing Social Media Digital Media Wordpress Proofreading Web Content Management Publishing Multimedia New Media Web Production Photoshop Multimedia Journalism See 16+     See less Skills  HTML Blogging Stories Sports Editing Editorial Writing Content Development Video Breaking News AP Style Web Content News Writing Copy Editing Journalism Newspaper Online Journalism Facebook Content Management Online Publishing Social Media Digital Media Wordpress Proofreading Web Content Management Publishing Multimedia New Media Web Production Photoshop Multimedia Journalism See 16+     See less HTML Blogging Stories Sports Editing Editorial Writing Content Development Video Breaking News AP Style Web Content News Writing Copy Editing Journalism Newspaper Online Journalism Facebook Content Management Online Publishing Social Media Digital Media Wordpress Proofreading Web Content Management Publishing Multimedia New Media Web Production Photoshop Multimedia Journalism See 16+     See less HTML Blogging Stories Sports Editing Editorial Writing Content Development Video Breaking News AP Style Web Content News Writing Copy Editing Journalism Newspaper Online Journalism Facebook Content Management Online Publishing Social Media Digital Media Wordpress Proofreading Web Content Management Publishing Multimedia New Media Web Production Photoshop Multimedia Journalism See 16+     See less Education Miami University Bachelor of Arts 1994  – 1998 Marmion Academy 1990  – 1994 Miami University Bachelor of Arts 1994  – 1998 Miami University Bachelor of Arts 1994  – 1998 Miami University Bachelor of Arts 1994  – 1998 Marmion Academy 1990  – 1994 Marmion Academy 1990  – 1994 Marmion Academy 1990  – 1994 ", "Summary Online editor with 9+ years of digital journalism experience and award-winning track record. Proven in both national and local coverage, specializing in features and trends with plenty of background in beat reporting, video production, social and digital media and seamless proficiency in multiple media platforms. Summary Online editor with 9+ years of digital journalism experience and award-winning track record. Proven in both national and local coverage, specializing in features and trends with plenty of background in beat reporting, video production, social and digital media and seamless proficiency in multiple media platforms. Online editor with 9+ years of digital journalism experience and award-winning track record. Proven in both national and local coverage, specializing in features and trends with plenty of background in beat reporting, video production, social and digital media and seamless proficiency in multiple media platforms. Online editor with 9+ years of digital journalism experience and award-winning track record. Proven in both national and local coverage, specializing in features and trends with plenty of background in beat reporting, video production, social and digital media and seamless proficiency in multiple media platforms. Experience East Coast Content Curator for Yahoo Sports Yahoo August 2013  – Present (2 years 1 month) new york I bring Yahoo Sports content to life on the screen, then spend the rest of my time as Yahoo Sports' editorial grease man. I produce and write scripts for daily digital video offerings, oversee our social media platforms, make editorial judgments and forecasts based on our analytics, edit and produce copy, and serve as a liaison in our partnership with NBCSN. Sports Editor, Front Page Yahoo July 2012  –  April 2014  (1 year 10 months) new york, new york Coordinate content between Yahoo! Sports team and Yahoo.com home page. Assign and edit the best combination of buzzy, investigative and long form stories that our team has to offer. Senior Editor Yahoo! Sports' ThePostGame.com January 2011  –  July 2012  (1 year 7 months) Write and edit features, blog posts and social media. Sports Editor Austin American-Statesman April 2007  –  October 2011  (4 years 7 months) Lake Travis View Edit all aspects including reporting, photography, editing, online and layout. Write columns, features and blogs, and produce special sections for the Lake Travis View, Austin Community Newspapers and American-Statesman. Media Relations Round Rock Express March 2008  –  October 2009  (1 year 8 months) Produced game notes, publications, assisted media outlets and contributed to blogs. Kept track of statistics, transactions and other player data and assisted with travel. Freelance for ESPN Magazine ESPN November 2006  –  November 2007  (1 year 1 month) Wrote short features for Page 2/Jump section. News Editor KVUE-TV August 2006  –  April 2007  (9 months) Austin, TX Edited video for newscast, copy-edited script, adapted for web and assisted production booth. TV News Intern KMBC TV May 2006  –  August 2006  (4 months) Kansas City, Missouri Area Sportswriter Lake Sun Leader August 2001  –  December 2002  (1 year 5 months) Camdenton, MO High school football coverage, recaps, features and photos. East Coast Content Curator for Yahoo Sports Yahoo August 2013  – Present (2 years 1 month) new york I bring Yahoo Sports content to life on the screen, then spend the rest of my time as Yahoo Sports' editorial grease man. I produce and write scripts for daily digital video offerings, oversee our social media platforms, make editorial judgments and forecasts based on our analytics, edit and produce copy, and serve as a liaison in our partnership with NBCSN. East Coast Content Curator for Yahoo Sports Yahoo August 2013  – Present (2 years 1 month) new york I bring Yahoo Sports content to life on the screen, then spend the rest of my time as Yahoo Sports' editorial grease man. I produce and write scripts for daily digital video offerings, oversee our social media platforms, make editorial judgments and forecasts based on our analytics, edit and produce copy, and serve as a liaison in our partnership with NBCSN. Sports Editor, Front Page Yahoo July 2012  –  April 2014  (1 year 10 months) new york, new york Coordinate content between Yahoo! Sports team and Yahoo.com home page. Assign and edit the best combination of buzzy, investigative and long form stories that our team has to offer. Sports Editor, Front Page Yahoo July 2012  –  April 2014  (1 year 10 months) new york, new york Coordinate content between Yahoo! Sports team and Yahoo.com home page. Assign and edit the best combination of buzzy, investigative and long form stories that our team has to offer. Senior Editor Yahoo! Sports' ThePostGame.com January 2011  –  July 2012  (1 year 7 months) Write and edit features, blog posts and social media. Senior Editor Yahoo! Sports' ThePostGame.com January 2011  –  July 2012  (1 year 7 months) Write and edit features, blog posts and social media. Sports Editor Austin American-Statesman April 2007  –  October 2011  (4 years 7 months) Lake Travis View Edit all aspects including reporting, photography, editing, online and layout. Write columns, features and blogs, and produce special sections for the Lake Travis View, Austin Community Newspapers and American-Statesman. Sports Editor Austin American-Statesman April 2007  –  October 2011  (4 years 7 months) Lake Travis View Edit all aspects including reporting, photography, editing, online and layout. Write columns, features and blogs, and produce special sections for the Lake Travis View, Austin Community Newspapers and American-Statesman. Media Relations Round Rock Express March 2008  –  October 2009  (1 year 8 months) Produced game notes, publications, assisted media outlets and contributed to blogs. Kept track of statistics, transactions and other player data and assisted with travel. Media Relations Round Rock Express March 2008  –  October 2009  (1 year 8 months) Produced game notes, publications, assisted media outlets and contributed to blogs. Kept track of statistics, transactions and other player data and assisted with travel. Freelance for ESPN Magazine ESPN November 2006  –  November 2007  (1 year 1 month) Wrote short features for Page 2/Jump section. Freelance for ESPN Magazine ESPN November 2006  –  November 2007  (1 year 1 month) Wrote short features for Page 2/Jump section. News Editor KVUE-TV August 2006  –  April 2007  (9 months) Austin, TX Edited video for newscast, copy-edited script, adapted for web and assisted production booth. News Editor KVUE-TV August 2006  –  April 2007  (9 months) Austin, TX Edited video for newscast, copy-edited script, adapted for web and assisted production booth. TV News Intern KMBC TV May 2006  –  August 2006  (4 months) Kansas City, Missouri Area TV News Intern KMBC TV May 2006  –  August 2006  (4 months) Kansas City, Missouri Area Sportswriter Lake Sun Leader August 2001  –  December 2002  (1 year 5 months) Camdenton, MO High school football coverage, recaps, features and photos. Sportswriter Lake Sun Leader August 2001  –  December 2002  (1 year 5 months) Camdenton, MO High school football coverage, recaps, features and photos. Skills Microsoft Office Non-linear Editing Linear Editing Final Cut Pro Adobe Creative Suite Photography Film Production Webcasting Podcasting Blogging New Media Social Media HTML Live Broadcast Radio Broadcasting Columns Features Beat Reporting See 3+     See less Skills  Microsoft Office Non-linear Editing Linear Editing Final Cut Pro Adobe Creative Suite Photography Film Production Webcasting Podcasting Blogging New Media Social Media HTML Live Broadcast Radio Broadcasting Columns Features Beat Reporting See 3+     See less Microsoft Office Non-linear Editing Linear Editing Final Cut Pro Adobe Creative Suite Photography Film Production Webcasting Podcasting Blogging New Media Social Media HTML Live Broadcast Radio Broadcasting Columns Features Beat Reporting See 3+     See less Microsoft Office Non-linear Editing Linear Editing Final Cut Pro Adobe Creative Suite Photography Film Production Webcasting Podcasting Blogging New Media Social Media HTML Live Broadcast Radio Broadcasting Columns Features Beat Reporting See 3+     See less Education Avila University Bachelor of Arts,  Communication ,  Film and Digital Media 2003  – 2006 Avila University Bachelor of Arts,  Communication ,  Film and Digital Media 2003  – 2006 Avila University Bachelor of Arts,  Communication ,  Film and Digital Media 2003  – 2006 Avila University Bachelor of Arts,  Communication ,  Film and Digital Media 2003  – 2006 Honors & Awards Additional Honors & Awards Winner of four Texas Press Association awards (including first place for overall excellence), four Gulf Coast Press Association awards and five South Texas Press Association awards. ThePostGame won an APSE award in first year of existence, as well. Additional Honors & Awards Winner of four Texas Press Association awards (including first place for overall excellence), four Gulf Coast Press Association awards and five South Texas Press Association awards. ThePostGame won an APSE award in first year of existence, as well. Additional Honors & Awards Winner of four Texas Press Association awards (including first place for overall excellence), four Gulf Coast Press Association awards and five South Texas Press Association awards. ThePostGame won an APSE award in first year of existence, as well. Additional Honors & Awards Winner of four Texas Press Association awards (including first place for overall excellence), four Gulf Coast Press Association awards and five South Texas Press Association awards. ThePostGame won an APSE award in first year of existence, as well. ", "Summary Editor, writer and blogger with seven-plus years experience with Yahoo! Sports, the most trafficked source for sports stories, analysis and breaking news. \n \nPassion for news and creating compelling story packages using multiple content sources (original stories, wire copy, blogs, video, photo galleries). \n \nPerfectionist's eye for clean copy and engaging visual presentation that draws in the reader. Summary Editor, writer and blogger with seven-plus years experience with Yahoo! Sports, the most trafficked source for sports stories, analysis and breaking news. \n \nPassion for news and creating compelling story packages using multiple content sources (original stories, wire copy, blogs, video, photo galleries). \n \nPerfectionist's eye for clean copy and engaging visual presentation that draws in the reader. Editor, writer and blogger with seven-plus years experience with Yahoo! Sports, the most trafficked source for sports stories, analysis and breaking news. \n \nPassion for news and creating compelling story packages using multiple content sources (original stories, wire copy, blogs, video, photo galleries). \n \nPerfectionist's eye for clean copy and engaging visual presentation that draws in the reader. Editor, writer and blogger with seven-plus years experience with Yahoo! Sports, the most trafficked source for sports stories, analysis and breaking news. \n \nPassion for news and creating compelling story packages using multiple content sources (original stories, wire copy, blogs, video, photo galleries). \n \nPerfectionist's eye for clean copy and engaging visual presentation that draws in the reader. Experience Senior Editor Yahoo! Sports May 1999  –  November 2013  (14 years 7 months) • As Major League Baseball editor, planned and executed Yahoo! Sports' award-winning MLB coverage. \n \n• Managed day-to-day programming of MLB index page, incorporating original content, blogs, video, real-time game updates and more into an easy-to-digest snapshot of the day in baseball. \n \n• Planned and programmed coverage for special events such as spring training (season previews), opening day, the trade deadline, pennant races and the playoffs and World Series. \n \n• Lead editor and content programmer for special events including the Winter and Summer Olympics, Super Bowl, NCAA championship games, World Series, Stanley Cup and NBA Finals, draft coverage and more. \n \n* As a writer/reporter, published on-site original content from Stanley Cup Finals, NCAA basketball tournament regionals and Final Four, NBA draft and U.S. Open golf tournament. \n \n* Lead analyst for Yahoo! Sports' fantasy hockey game named to the Hockey News' 100 people of power and influence in hockey. \n \n* Contributed to Devil Ball Golf, Puck Daddy (hockey) and Roto Arcade (fantasy) blogs. \n \n* Updated Yahoo! Sports and Yahoo! Sports MLB Twitter and Facebook feeds. Customer Care Yahoo! 1999  –  2004  (5 years) • Led team providing customer support for Yahoo! Sports' extensive suite of fantasy games. \n \n• Created and updated online help FAQs to reduce customer inquiries and address ongoing customer concerns. \n \n• Improved customer satisfaction by working closely with production and engineering to add new features and address areas of customer concern. Sports Producer Interactive Network January 1991  –  January 1994  (3 years 1 month) Produced real-time updates and commentary for prediction-based interactive television game. Senior Editor Yahoo! Sports May 1999  –  November 2013  (14 years 7 months) • As Major League Baseball editor, planned and executed Yahoo! Sports' award-winning MLB coverage. \n \n• Managed day-to-day programming of MLB index page, incorporating original content, blogs, video, real-time game updates and more into an easy-to-digest snapshot of the day in baseball. \n \n• Planned and programmed coverage for special events such as spring training (season previews), opening day, the trade deadline, pennant races and the playoffs and World Series. \n \n• Lead editor and content programmer for special events including the Winter and Summer Olympics, Super Bowl, NCAA championship games, World Series, Stanley Cup and NBA Finals, draft coverage and more. \n \n* As a writer/reporter, published on-site original content from Stanley Cup Finals, NCAA basketball tournament regionals and Final Four, NBA draft and U.S. Open golf tournament. \n \n* Lead analyst for Yahoo! Sports' fantasy hockey game named to the Hockey News' 100 people of power and influence in hockey. \n \n* Contributed to Devil Ball Golf, Puck Daddy (hockey) and Roto Arcade (fantasy) blogs. \n \n* Updated Yahoo! Sports and Yahoo! Sports MLB Twitter and Facebook feeds. Senior Editor Yahoo! Sports May 1999  –  November 2013  (14 years 7 months) • As Major League Baseball editor, planned and executed Yahoo! Sports' award-winning MLB coverage. \n \n• Managed day-to-day programming of MLB index page, incorporating original content, blogs, video, real-time game updates and more into an easy-to-digest snapshot of the day in baseball. \n \n• Planned and programmed coverage for special events such as spring training (season previews), opening day, the trade deadline, pennant races and the playoffs and World Series. \n \n• Lead editor and content programmer for special events including the Winter and Summer Olympics, Super Bowl, NCAA championship games, World Series, Stanley Cup and NBA Finals, draft coverage and more. \n \n* As a writer/reporter, published on-site original content from Stanley Cup Finals, NCAA basketball tournament regionals and Final Four, NBA draft and U.S. Open golf tournament. \n \n* Lead analyst for Yahoo! Sports' fantasy hockey game named to the Hockey News' 100 people of power and influence in hockey. \n \n* Contributed to Devil Ball Golf, Puck Daddy (hockey) and Roto Arcade (fantasy) blogs. \n \n* Updated Yahoo! Sports and Yahoo! Sports MLB Twitter and Facebook feeds. Customer Care Yahoo! 1999  –  2004  (5 years) • Led team providing customer support for Yahoo! Sports' extensive suite of fantasy games. \n \n• Created and updated online help FAQs to reduce customer inquiries and address ongoing customer concerns. \n \n• Improved customer satisfaction by working closely with production and engineering to add new features and address areas of customer concern. Customer Care Yahoo! 1999  –  2004  (5 years) • Led team providing customer support for Yahoo! Sports' extensive suite of fantasy games. \n \n• Created and updated online help FAQs to reduce customer inquiries and address ongoing customer concerns. \n \n• Improved customer satisfaction by working closely with production and engineering to add new features and address areas of customer concern. Sports Producer Interactive Network January 1991  –  January 1994  (3 years 1 month) Produced real-time updates and commentary for prediction-based interactive television game. Sports Producer Interactive Network January 1991  –  January 1994  (3 years 1 month) Produced real-time updates and commentary for prediction-based interactive television game. Skills Digital Media Content Strategy Content Management Blogging Social Media Copy Editing Editorial Content Development Editing New Media SEO Feature Articles Video Newspapers Publishing Storytelling Breaking News Community Management Web Analytics Journalism Sports Digital Strategy User Experience Online Journalism Web Content Online Publishing Web Content Management News Writing See 13+     See less Skills  Digital Media Content Strategy Content Management Blogging Social Media Copy Editing Editorial Content Development Editing New Media SEO Feature Articles Video Newspapers Publishing Storytelling Breaking News Community Management Web Analytics Journalism Sports Digital Strategy User Experience Online Journalism Web Content Online Publishing Web Content Management News Writing See 13+     See less Digital Media Content Strategy Content Management Blogging Social Media Copy Editing Editorial Content Development Editing New Media SEO Feature Articles Video Newspapers Publishing Storytelling Breaking News Community Management Web Analytics Journalism Sports Digital Strategy User Experience Online Journalism Web Content Online Publishing Web Content Management News Writing See 13+     See less Digital Media Content Strategy Content Management Blogging Social Media Copy Editing Editorial Content Development Editing New Media SEO Feature Articles Video Newspapers Publishing Storytelling Breaking News Community Management Web Analytics Journalism Sports Digital Strategy User Experience Online Journalism Web Content Online Publishing Web Content Management News Writing See 13+     See less Education San Jose State University Journalism,  Political Science 1989  – 1998 Activities and Societies:  Men's basketball (1989-1991) ,  Spartan Daily (staff writer ,  editor) ,  Sports Information intern San Jose State University Journalism,  Political Science 1989  – 1998 Activities and Societies:  Men's basketball (1989-1991) ,  Spartan Daily (staff writer ,  editor) ,  Sports Information intern San Jose State University Journalism,  Political Science 1989  – 1998 Activities and Societies:  Men's basketball (1989-1991) ,  Spartan Daily (staff writer ,  editor) ,  Sports Information intern San Jose State University Journalism,  Political Science 1989  – 1998 Activities and Societies:  Men's basketball (1989-1991) ,  Spartan Daily (staff writer ,  editor) ,  Sports Information intern ", "Experience Sports Manager, Features Editor, Yahoo Spain & LATAM Yahoo February 2015  – Present (7 months) London, United Kingdom Sports Manager - Yahoo Spain Yahoo October 2013  –  February 2015  (1 year 5 months) Madrid Area, Spain Sports Manager for Yahoo Sports in Spain, in partnership with Eurosport. Senior Editor - Yahoo! Sports Yahoo! 2008  –  October 2013  (5 years) Madrid Area, Spain Senior Editor of Yahoo! Sports for Spain, currently in partnership with Eurosport. Product Manager Yahoo! October 2007  –  June 2009  (1 year 9 months) Product Manager of Yahoo! Travel and Yahoo! Cars. Product Manager Yahoo! E-Commerce -Kelkoo October 2006  –  October 2007  (1 year 1 month) In charge of Yahoo! Shopping/Kelkoo, Yahoo! Travel and Yahoo! Cars Intern / Content Producer Yahoo! E-Commerce - Kelkoo September 2005  –  September 2006  (1 year 1 month) Content management for Yahoo! Shopping/Kelkoo, Yahoo! Travel and Yahoo! Cars Intern - International Relations Office Universidad Autonoma de Madrid October 1999  –  September 2002  (3 years) In charge of Erasmus scolarships, meeting the students and help them during their stays in the University or abroad. Sports Manager, Features Editor, Yahoo Spain & LATAM Yahoo February 2015  – Present (7 months) London, United Kingdom Sports Manager, Features Editor, Yahoo Spain & LATAM Yahoo February 2015  – Present (7 months) London, United Kingdom Sports Manager - Yahoo Spain Yahoo October 2013  –  February 2015  (1 year 5 months) Madrid Area, Spain Sports Manager for Yahoo Sports in Spain, in partnership with Eurosport. Sports Manager - Yahoo Spain Yahoo October 2013  –  February 2015  (1 year 5 months) Madrid Area, Spain Sports Manager for Yahoo Sports in Spain, in partnership with Eurosport. Senior Editor - Yahoo! Sports Yahoo! 2008  –  October 2013  (5 years) Madrid Area, Spain Senior Editor of Yahoo! Sports for Spain, currently in partnership with Eurosport. Senior Editor - Yahoo! Sports Yahoo! 2008  –  October 2013  (5 years) Madrid Area, Spain Senior Editor of Yahoo! Sports for Spain, currently in partnership with Eurosport. Product Manager Yahoo! October 2007  –  June 2009  (1 year 9 months) Product Manager of Yahoo! Travel and Yahoo! Cars. Product Manager Yahoo! October 2007  –  June 2009  (1 year 9 months) Product Manager of Yahoo! Travel and Yahoo! Cars. Product Manager Yahoo! E-Commerce -Kelkoo October 2006  –  October 2007  (1 year 1 month) In charge of Yahoo! Shopping/Kelkoo, Yahoo! Travel and Yahoo! Cars Product Manager Yahoo! E-Commerce -Kelkoo October 2006  –  October 2007  (1 year 1 month) In charge of Yahoo! Shopping/Kelkoo, Yahoo! Travel and Yahoo! Cars Intern / Content Producer Yahoo! E-Commerce - Kelkoo September 2005  –  September 2006  (1 year 1 month) Content management for Yahoo! Shopping/Kelkoo, Yahoo! Travel and Yahoo! Cars Intern / Content Producer Yahoo! E-Commerce - Kelkoo September 2005  –  September 2006  (1 year 1 month) Content management for Yahoo! Shopping/Kelkoo, Yahoo! Travel and Yahoo! Cars Intern - International Relations Office Universidad Autonoma de Madrid October 1999  –  September 2002  (3 years) In charge of Erasmus scolarships, meeting the students and help them during their stays in the University or abroad. Intern - International Relations Office Universidad Autonoma de Madrid October 1999  –  September 2002  (3 years) In charge of Erasmus scolarships, meeting the students and help them during their stays in the University or abroad. Languages Inglés Native or bilingual proficiency Francés Limited working proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Francés Limited working proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Francés Limited working proficiency Español Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Web Analytics E-commerce Digital Media SEO Product Management Content Strategy User Experience Content Management Experiencia del usuario Análisis web Marketing en Internet Web 2.0 Mobile Devices Medios digitales Optimización en... Gestión de contenidos Marketing móvil Gestión de productos Redes sociales Comercio electrónico See 5+     See less Skills  Web Analytics E-commerce Digital Media SEO Product Management Content Strategy User Experience Content Management Experiencia del usuario Análisis web Marketing en Internet Web 2.0 Mobile Devices Medios digitales Optimización en... Gestión de contenidos Marketing móvil Gestión de productos Redes sociales Comercio electrónico See 5+     See less Web Analytics E-commerce Digital Media SEO Product Management Content Strategy User Experience Content Management Experiencia del usuario Análisis web Marketing en Internet Web 2.0 Mobile Devices Medios digitales Optimización en... Gestión de contenidos Marketing móvil Gestión de productos Redes sociales Comercio electrónico See 5+     See less Web Analytics E-commerce Digital Media SEO Product Management Content Strategy User Experience Content Management Experiencia del usuario Análisis web Marketing en Internet Web 2.0 Mobile Devices Medios digitales Optimización en... Gestión de contenidos Marketing móvil Gestión de productos Redes sociales Comercio electrónico See 5+     See less Education Universidad Autónoma de Madrid Computer Science 1996  – 2006 Universidad Autónoma de Madrid Computer Science 1996  – 2006 Universidad Autónoma de Madrid Computer Science 1996  – 2006 Universidad Autónoma de Madrid Computer Science 1996  – 2006 ", "Summary Veteran online editor and sports journalist highly skilled at both short- and long-term planning whose abilities go well beyond working with words and writers. I not only attended some of the biggest sporting events (12 Super Bowls, 13 NFL Drafts, 3 Pro Bowls, Final Four) and coordinated coverage of some of the biggest stories (Michael Vick dog-fighting scandal, Peyton Manning's free agency, etc.) during the past 16 years, I played an influential role in Yahoo Sports for years being the most trafficked sports website. \n \nThrough the years, I've honed my skills as a coordinator and communicator, improved my technical skills and established myself as a vital hardworking and reliable asset. Summary Veteran online editor and sports journalist highly skilled at both short- and long-term planning whose abilities go well beyond working with words and writers. I not only attended some of the biggest sporting events (12 Super Bowls, 13 NFL Drafts, 3 Pro Bowls, Final Four) and coordinated coverage of some of the biggest stories (Michael Vick dog-fighting scandal, Peyton Manning's free agency, etc.) during the past 16 years, I played an influential role in Yahoo Sports for years being the most trafficked sports website. \n \nThrough the years, I've honed my skills as a coordinator and communicator, improved my technical skills and established myself as a vital hardworking and reliable asset. Veteran online editor and sports journalist highly skilled at both short- and long-term planning whose abilities go well beyond working with words and writers. I not only attended some of the biggest sporting events (12 Super Bowls, 13 NFL Drafts, 3 Pro Bowls, Final Four) and coordinated coverage of some of the biggest stories (Michael Vick dog-fighting scandal, Peyton Manning's free agency, etc.) during the past 16 years, I played an influential role in Yahoo Sports for years being the most trafficked sports website. \n \nThrough the years, I've honed my skills as a coordinator and communicator, improved my technical skills and established myself as a vital hardworking and reliable asset. Veteran online editor and sports journalist highly skilled at both short- and long-term planning whose abilities go well beyond working with words and writers. I not only attended some of the biggest sporting events (12 Super Bowls, 13 NFL Drafts, 3 Pro Bowls, Final Four) and coordinated coverage of some of the biggest stories (Michael Vick dog-fighting scandal, Peyton Manning's free agency, etc.) during the past 16 years, I played an influential role in Yahoo Sports for years being the most trafficked sports website. \n \nThrough the years, I've honed my skills as a coordinator and communicator, improved my technical skills and established myself as a vital hardworking and reliable asset. Experience Senior Editor Yahoo! Sports 2013  – Present (2 years) Departmental wild-card, helping editors and writers during major events (Super Bowl, NFL/NBA Drafts, NCAA Tournament, World Cup) while also management relationships with partners (In Depth with Graham Bensinger, Comcast Sports regional websites). NFL Editor Yahoo! August 2006  –  July 2013  (7 years) Managed a team of writers and fellow editors; coordinated short- and long-term coverage including breaking news and major events (Super Bowl, NFL Draft, Pro Bowl); updated NFL section of website; edited copy; managed relationships with partners (National Football Post, Pro Football Weekly, NFL). Editor ESPN.com July 1998  –  July 2006  (8 years 1 month) Had multiple roles in eight-year tenure: Associate Editor for NFL.com; NFL Team Pages Editor; NFL Editor II. Throughout the whole period, I edited team pages; edited writers' copy; maintained NFL index; covered events; and planned coverage. High school sports reporter The Virginian-Pilot 1996  –  1998  (2 years) * Co-wrote dissenting views column with fellow sportswriter Paul White entitled “Black and White.”  \n \n* Covered Norfolk State, Old Dominion, CIAA athletics in addition to prep sports.  \n \n* Coordinated sports coverage for the Suffolk Sun community tabloid. Senior Editor Yahoo! Sports 2013  – Present (2 years) Departmental wild-card, helping editors and writers during major events (Super Bowl, NFL/NBA Drafts, NCAA Tournament, World Cup) while also management relationships with partners (In Depth with Graham Bensinger, Comcast Sports regional websites). Senior Editor Yahoo! Sports 2013  – Present (2 years) Departmental wild-card, helping editors and writers during major events (Super Bowl, NFL/NBA Drafts, NCAA Tournament, World Cup) while also management relationships with partners (In Depth with Graham Bensinger, Comcast Sports regional websites). NFL Editor Yahoo! August 2006  –  July 2013  (7 years) Managed a team of writers and fellow editors; coordinated short- and long-term coverage including breaking news and major events (Super Bowl, NFL Draft, Pro Bowl); updated NFL section of website; edited copy; managed relationships with partners (National Football Post, Pro Football Weekly, NFL). NFL Editor Yahoo! August 2006  –  July 2013  (7 years) Managed a team of writers and fellow editors; coordinated short- and long-term coverage including breaking news and major events (Super Bowl, NFL Draft, Pro Bowl); updated NFL section of website; edited copy; managed relationships with partners (National Football Post, Pro Football Weekly, NFL). Editor ESPN.com July 1998  –  July 2006  (8 years 1 month) Had multiple roles in eight-year tenure: Associate Editor for NFL.com; NFL Team Pages Editor; NFL Editor II. Throughout the whole period, I edited team pages; edited writers' copy; maintained NFL index; covered events; and planned coverage. Editor ESPN.com July 1998  –  July 2006  (8 years 1 month) Had multiple roles in eight-year tenure: Associate Editor for NFL.com; NFL Team Pages Editor; NFL Editor II. Throughout the whole period, I edited team pages; edited writers' copy; maintained NFL index; covered events; and planned coverage. High school sports reporter The Virginian-Pilot 1996  –  1998  (2 years) * Co-wrote dissenting views column with fellow sportswriter Paul White entitled “Black and White.”  \n \n* Covered Norfolk State, Old Dominion, CIAA athletics in addition to prep sports.  \n \n* Coordinated sports coverage for the Suffolk Sun community tabloid. High school sports reporter The Virginian-Pilot 1996  –  1998  (2 years) * Co-wrote dissenting views column with fellow sportswriter Paul White entitled “Black and White.”  \n \n* Covered Norfolk State, Old Dominion, CIAA athletics in addition to prep sports.  \n \n* Coordinated sports coverage for the Suffolk Sun community tabloid. Skills Editing NFL Journalism Copy Editing Editorial New Media AP Style Online Journalism Digital Media Blogging Storytelling Content Strategy Web Content News Writing Feature Articles Newspapers Broadcast Breaking News See 3+     See less Skills  Editing NFL Journalism Copy Editing Editorial New Media AP Style Online Journalism Digital Media Blogging Storytelling Content Strategy Web Content News Writing Feature Articles Newspapers Broadcast Breaking News See 3+     See less Editing NFL Journalism Copy Editing Editorial New Media AP Style Online Journalism Digital Media Blogging Storytelling Content Strategy Web Content News Writing Feature Articles Newspapers Broadcast Breaking News See 3+     See less Editing NFL Journalism Copy Editing Editorial New Media AP Style Online Journalism Digital Media Blogging Storytelling Content Strategy Web Content News Writing Feature Articles Newspapers Broadcast Breaking News See 3+     See less Education San Francisco State University Bachelor of Arts (B.A.),  Journalism 1991  – 1993 Covered sports for the school newspaper (Golden Gator). Activities and Societies:  Worked on student newspaper (Golden Gator) ,  covering SF State's men's basketball team and other sports. San Diego State University-California State University Journalism 1990  – 1991 Merritt College 1988  – 1990 San Francisco State University Bachelor of Arts (B.A.),  Journalism 1991  – 1993 Covered sports for the school newspaper (Golden Gator). Activities and Societies:  Worked on student newspaper (Golden Gator) ,  covering SF State's men's basketball team and other sports. San Francisco State University Bachelor of Arts (B.A.),  Journalism 1991  – 1993 Covered sports for the school newspaper (Golden Gator). Activities and Societies:  Worked on student newspaper (Golden Gator) ,  covering SF State's men's basketball team and other sports. San Francisco State University Bachelor of Arts (B.A.),  Journalism 1991  – 1993 Covered sports for the school newspaper (Golden Gator). Activities and Societies:  Worked on student newspaper (Golden Gator) ,  covering SF State's men's basketball team and other sports. San Diego State University-California State University Journalism 1990  – 1991 San Diego State University-California State University Journalism 1990  – 1991 San Diego State University-California State University Journalism 1990  – 1991 Merritt College 1988  – 1990 Merritt College 1988  – 1990 Merritt College 1988  – 1990 "]}