{"position": "Senior Manager, Service Management", "company": "Google", "profiles": ["Summary 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects Summary 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects Experience Director FP&A Yahoo EMEA Yahoo April 2015  – Present (5 months) Senior Manager - FP&A Yahoo EMEA Yahoo 2014  – Present (1 year) Head of EMEA FP&A for Revenue and Cost. This includes the Sales Commission process. Senior Manager, EMEA Accounting and Reporting Yahoo 2013  –  2014  (1 year) Responsible for the full end to end EMEA Revenue Accounting process. Senior Manager, EMEA Accounting and Reporting Yahoo 2012  –  2013  (1 year) Responsible for the full end to end EMEA General Accounting function together with the Global Intercompany Process Senior Manager, EMEA Accounting and Reporting Yahoo 2011  –  2012  (1 year) Dublin Responsible for the full end to end EMEA General Accounting function. Financial Operations Manager, IBM Global Business Services, Teleco Division IBM September 1997  –  April 2010  (12 years 8 months) Ireland Project Accounting Manager - Accounting COE - Software Group IBM March 2007  –  November 2007  (9 months) Ireland Business Operations and Foreign Trade Manager - Intergrated Supply Chain IBM January 2004  –  August 2006  (2 years 8 months) Ireland Finance and Business Operations Manager - Site Operations IBM October 2000  –  January 2004  (3 years 4 months) Ireland Finance and Planning Analyst Lead - Global Services IBM September 1997  –  September 2000  (3 years 1 month) Ireland Project Accountant - Shares Dividends Department Bank Of Ireland 1996  –  1997  (1 year) Trainee Chartered Accountant John P Greely & Co, Chartered Accountants 1992  –  1996  (4 years) Director FP&A Yahoo EMEA Yahoo April 2015  – Present (5 months) Director FP&A Yahoo EMEA Yahoo April 2015  – Present (5 months) Senior Manager - FP&A Yahoo EMEA Yahoo 2014  – Present (1 year) Head of EMEA FP&A for Revenue and Cost. This includes the Sales Commission process. Senior Manager - FP&A Yahoo EMEA Yahoo 2014  – Present (1 year) Head of EMEA FP&A for Revenue and Cost. This includes the Sales Commission process. Senior Manager, EMEA Accounting and Reporting Yahoo 2013  –  2014  (1 year) Responsible for the full end to end EMEA Revenue Accounting process. Senior Manager, EMEA Accounting and Reporting Yahoo 2013  –  2014  (1 year) Responsible for the full end to end EMEA Revenue Accounting process. Senior Manager, EMEA Accounting and Reporting Yahoo 2012  –  2013  (1 year) Responsible for the full end to end EMEA General Accounting function together with the Global Intercompany Process Senior Manager, EMEA Accounting and Reporting Yahoo 2012  –  2013  (1 year) Responsible for the full end to end EMEA General Accounting function together with the Global Intercompany Process Senior Manager, EMEA Accounting and Reporting Yahoo 2011  –  2012  (1 year) Dublin Responsible for the full end to end EMEA General Accounting function. Senior Manager, EMEA Accounting and Reporting Yahoo 2011  –  2012  (1 year) Dublin Responsible for the full end to end EMEA General Accounting function. Financial Operations Manager, IBM Global Business Services, Teleco Division IBM September 1997  –  April 2010  (12 years 8 months) Ireland Financial Operations Manager, IBM Global Business Services, Teleco Division IBM September 1997  –  April 2010  (12 years 8 months) Ireland Project Accounting Manager - Accounting COE - Software Group IBM March 2007  –  November 2007  (9 months) Ireland Project Accounting Manager - Accounting COE - Software Group IBM March 2007  –  November 2007  (9 months) Ireland Business Operations and Foreign Trade Manager - Intergrated Supply Chain IBM January 2004  –  August 2006  (2 years 8 months) Ireland Business Operations and Foreign Trade Manager - Intergrated Supply Chain IBM January 2004  –  August 2006  (2 years 8 months) Ireland Finance and Business Operations Manager - Site Operations IBM October 2000  –  January 2004  (3 years 4 months) Ireland Finance and Business Operations Manager - Site Operations IBM October 2000  –  January 2004  (3 years 4 months) Ireland Finance and Planning Analyst Lead - Global Services IBM September 1997  –  September 2000  (3 years 1 month) Ireland Finance and Planning Analyst Lead - Global Services IBM September 1997  –  September 2000  (3 years 1 month) Ireland Project Accountant - Shares Dividends Department Bank Of Ireland 1996  –  1997  (1 year) Project Accountant - Shares Dividends Department Bank Of Ireland 1996  –  1997  (1 year) Trainee Chartered Accountant John P Greely & Co, Chartered Accountants 1992  –  1996  (4 years) Trainee Chartered Accountant John P Greely & Co, Chartered Accountants 1992  –  1996  (4 years) Skills Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Skills  Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Education Institute of Chartered Accountants in Ire 1993  – 1997 Dublin Business School 1991  – 1992 Institute of Chartered Accountants in Ire 1993  – 1997 Institute of Chartered Accountants in Ire 1993  – 1997 Institute of Chartered Accountants in Ire 1993  – 1997 Dublin Business School 1991  – 1992 Dublin Business School 1991  – 1992 Dublin Business School 1991  – 1992 ", "Summary A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. Summary A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. Experience Senior Manager, Engineering Services (Quality Engineering Tools and Best Practices) Yahoo April 2014  – Present (1 year 5 months) United States Building up the mobile (apps) quality team and capabilities at Yahoo! Manager, Quality Engineering Tools and Best Practices Yahoo! January 2013  –  March 2014  (1 year 3 months) United States In charge of test strategy and test tools for Mobile and Emerging Products organization.  \nSet up a team of top notch mobile test engineers to support various mobile app teams.  \nTeam supported launch of Weather, Yahoo and Flickr mobile apps. \nIn charge of Mobile Web Standards for company.  \nMember of Quality Council. \nSet up mobile device testing strategy for entire mobile organization. \nDefined roles and expectations for various levels of SET for mobile organization. \nSet up interview pipeline for hiring SETs for mobile organization. QA Manager - Media Experiences Mobile Yahoo! August 2011  –  December 2012  (1 year 5 months) Sunnyvale, CA Define Mobile Testing Strategy for Mobile Web and Native apps across Media Experiences team \nDevelop training plans and material on mobile testing for QA/testers in Media Experiences team. \nManage/Coach/Mentor team of 6 mobile test engineers in US/TW. QA Manager – Global Mobile Frontdoors Yahoo! November 2010  –  August 2011  (10 months) Singapore •\tIn charge of QA team of 5 QA engineers globally in 3 locations: Singapore, London, Delhi \n•\tIn charge of QA of mobile web frontpage, iPhone app QA Manager (Mobile ICE) APAC/EU Yahoo! December 2009  –  November 2010  (1 year) •\tManage team of 5 QA engineers and testers from 3 locations: Singapore, London, Delhi. \n•\tWinner of ICE Hack day – conceived the idea for winning app and led the dev, design and test teams to build and deploy the app.  \n•\tConceived, designed and built test framework using TestNG and HTMLUnit for easy test automation setup. \n•\tImproved QA project process by setting up framework for team to manage various QA aspects of projects. Regional QA Manager / Ad-Syndication Engineering Lead Yahoo! January 2008  –  December 2009  (2 years) •\tManage team of 6 QA engineers and testers. \n•\tProject manage daily bug prioritization for APAC/LATAM/EU mobile projects for bi-weekly sprints – this involved coordination between peer teams based in US and London. Set up coordination framework to facilitate communication and sharing of information and resources.  \n•\tOperationalized testing across APAC, LATAM, EU for oneSearch, new mobile frontpage \n•\tEngineering and QA support for integration of ad syndication platform with Maxis, Idea, Hutch (AU) \n•\tSet up automated testing for US team in support of AT&T oneSearch launch \n•\tConceived and built automated test process for Y! Mobile Widgets for APAC using Selenium framework. \n•\tResponsible for demo handset set up for CommunicAsia 2008 and 2009 for Y! Mobile \n•\tYahoo! Superstar Nominee (2008, 2009) Regional QA Manager Yahoo! January 2007  –  December 2008  (2 years) •\tSet up QA organization within Yahoo! Connected Life APAC team. This was a regional team for localization testing.  \n•\tResponsible for QA for Yahoo! mobile products across Singapore, Malaysia, Vietnam, Thailand, Indonesia, , India, Korea, Taiwan, Australia, New Zealand, Hong Kong. Products launched - Yahoo! Go, oneSearch, mobile websites, WAP Mail/Messenger, SMS oneSearch. \n•\tSet up test automation framework using Perl WWW::Mechanize for all APAC frontpages, oneSearch localization and subscription services.  \n•\tSet up outsourced in-market testing framework for carrier testing Yahoo! mobile apps across Asia.  \n•\tQA responsibilities include supporting 20+ carrier partners in APAC. Presentations made to Globe, Sensis (AU), TNZ among others. \n•\tResponsible for demo handset set up for GSMA Asia Mobile Congress in Macau for Y! Mobile \n•\tYahoo! Connected Life \"Go Big\" team award Lead Mobile Engineer Yahoo! South East Asia August 2005  –  January 2007  (1 year 6 months) •\tSingle Mobile Engineer managing SMS, WAP and BI platforms across South East Asia – Singapore, Malaysia, Philippines, Thailand, Vietnam, Indonesia. This involved ensuring all services were working well with minimal downtime due to carrier issues.  \n•\tEngineering lead for launching SMS services in Vietnam. This required deep involvement in setting up connectivity between SMS aggregator, technical evaluation of aggregator and working with SMS Messenger team to complete the integration.  \n•\tManaged the transition of Mobile operations to team in Bangalore and lead for Business Continuity project.  \n•\tManaged 2 data center migrations for mobile properties.  \n•\tSet up better monitoring and escalations – this led to improved SMS connectivity with carriers thus leading to doubling of mobile revenue. \n•\tYahoo! Odessey Award winner - for leadership in SEA Mobile \n•\tYahoo! Superstar Nominee. Consultant , Customer Support, Developer, Account Manager Flying Broom Pte Ltd (Tech startup) September 2000  –  August 2005  (5 years) •\tPioneer member of start-up. Participated in the growth of company from angel funding phase to conceptualizing and deploying own solution to paying customer.  \n•\tInvolved in conceptualization and writing of formal project proposals to customers.  \n•\tEditor of software manuals for company.  \n•\tInvolved in various aspects of solution delivery process from requirements gathering to deployment of system to providing 24x7 operations support for end-users.  \n•\tConceptualized, built and deployed GUI for distributed real-time system incorporating workflow management of real-time, mobile content delivery system.  \n•\tConceptualized and built business intelligence system handling millions of records each day. Research Assistant National University of Singapore July 1996  –  September 2000  (4 years 3 months) 1. Project managed 2 government funded research projects: \na. port vessel assignment project \nb. bus/subway commuter routing project \nsee http://citeseer.ist.psu.edu/281757.html \n2. Assisted professor in running research lab - Resource Allocation and Scheduling Lab (NUS) Senior Manager, Engineering Services (Quality Engineering Tools and Best Practices) Yahoo April 2014  – Present (1 year 5 months) United States Building up the mobile (apps) quality team and capabilities at Yahoo! Senior Manager, Engineering Services (Quality Engineering Tools and Best Practices) Yahoo April 2014  – Present (1 year 5 months) United States Building up the mobile (apps) quality team and capabilities at Yahoo! Manager, Quality Engineering Tools and Best Practices Yahoo! January 2013  –  March 2014  (1 year 3 months) United States In charge of test strategy and test tools for Mobile and Emerging Products organization.  \nSet up a team of top notch mobile test engineers to support various mobile app teams.  \nTeam supported launch of Weather, Yahoo and Flickr mobile apps. \nIn charge of Mobile Web Standards for company.  \nMember of Quality Council. \nSet up mobile device testing strategy for entire mobile organization. \nDefined roles and expectations for various levels of SET for mobile organization. \nSet up interview pipeline for hiring SETs for mobile organization. Manager, Quality Engineering Tools and Best Practices Yahoo! January 2013  –  March 2014  (1 year 3 months) United States In charge of test strategy and test tools for Mobile and Emerging Products organization.  \nSet up a team of top notch mobile test engineers to support various mobile app teams.  \nTeam supported launch of Weather, Yahoo and Flickr mobile apps. \nIn charge of Mobile Web Standards for company.  \nMember of Quality Council. \nSet up mobile device testing strategy for entire mobile organization. \nDefined roles and expectations for various levels of SET for mobile organization. \nSet up interview pipeline for hiring SETs for mobile organization. QA Manager - Media Experiences Mobile Yahoo! August 2011  –  December 2012  (1 year 5 months) Sunnyvale, CA Define Mobile Testing Strategy for Mobile Web and Native apps across Media Experiences team \nDevelop training plans and material on mobile testing for QA/testers in Media Experiences team. \nManage/Coach/Mentor team of 6 mobile test engineers in US/TW. QA Manager - Media Experiences Mobile Yahoo! August 2011  –  December 2012  (1 year 5 months) Sunnyvale, CA Define Mobile Testing Strategy for Mobile Web and Native apps across Media Experiences team \nDevelop training plans and material on mobile testing for QA/testers in Media Experiences team. \nManage/Coach/Mentor team of 6 mobile test engineers in US/TW. QA Manager – Global Mobile Frontdoors Yahoo! November 2010  –  August 2011  (10 months) Singapore •\tIn charge of QA team of 5 QA engineers globally in 3 locations: Singapore, London, Delhi \n•\tIn charge of QA of mobile web frontpage, iPhone app QA Manager – Global Mobile Frontdoors Yahoo! November 2010  –  August 2011  (10 months) Singapore •\tIn charge of QA team of 5 QA engineers globally in 3 locations: Singapore, London, Delhi \n•\tIn charge of QA of mobile web frontpage, iPhone app QA Manager (Mobile ICE) APAC/EU Yahoo! December 2009  –  November 2010  (1 year) •\tManage team of 5 QA engineers and testers from 3 locations: Singapore, London, Delhi. \n•\tWinner of ICE Hack day – conceived the idea for winning app and led the dev, design and test teams to build and deploy the app.  \n•\tConceived, designed and built test framework using TestNG and HTMLUnit for easy test automation setup. \n•\tImproved QA project process by setting up framework for team to manage various QA aspects of projects. QA Manager (Mobile ICE) APAC/EU Yahoo! December 2009  –  November 2010  (1 year) •\tManage team of 5 QA engineers and testers from 3 locations: Singapore, London, Delhi. \n•\tWinner of ICE Hack day – conceived the idea for winning app and led the dev, design and test teams to build and deploy the app.  \n•\tConceived, designed and built test framework using TestNG and HTMLUnit for easy test automation setup. \n•\tImproved QA project process by setting up framework for team to manage various QA aspects of projects. Regional QA Manager / Ad-Syndication Engineering Lead Yahoo! January 2008  –  December 2009  (2 years) •\tManage team of 6 QA engineers and testers. \n•\tProject manage daily bug prioritization for APAC/LATAM/EU mobile projects for bi-weekly sprints – this involved coordination between peer teams based in US and London. Set up coordination framework to facilitate communication and sharing of information and resources.  \n•\tOperationalized testing across APAC, LATAM, EU for oneSearch, new mobile frontpage \n•\tEngineering and QA support for integration of ad syndication platform with Maxis, Idea, Hutch (AU) \n•\tSet up automated testing for US team in support of AT&T oneSearch launch \n•\tConceived and built automated test process for Y! Mobile Widgets for APAC using Selenium framework. \n•\tResponsible for demo handset set up for CommunicAsia 2008 and 2009 for Y! Mobile \n•\tYahoo! Superstar Nominee (2008, 2009) Regional QA Manager / Ad-Syndication Engineering Lead Yahoo! January 2008  –  December 2009  (2 years) •\tManage team of 6 QA engineers and testers. \n•\tProject manage daily bug prioritization for APAC/LATAM/EU mobile projects for bi-weekly sprints – this involved coordination between peer teams based in US and London. Set up coordination framework to facilitate communication and sharing of information and resources.  \n•\tOperationalized testing across APAC, LATAM, EU for oneSearch, new mobile frontpage \n•\tEngineering and QA support for integration of ad syndication platform with Maxis, Idea, Hutch (AU) \n•\tSet up automated testing for US team in support of AT&T oneSearch launch \n•\tConceived and built automated test process for Y! Mobile Widgets for APAC using Selenium framework. \n•\tResponsible for demo handset set up for CommunicAsia 2008 and 2009 for Y! Mobile \n•\tYahoo! Superstar Nominee (2008, 2009) Regional QA Manager Yahoo! January 2007  –  December 2008  (2 years) •\tSet up QA organization within Yahoo! Connected Life APAC team. This was a regional team for localization testing.  \n•\tResponsible for QA for Yahoo! mobile products across Singapore, Malaysia, Vietnam, Thailand, Indonesia, , India, Korea, Taiwan, Australia, New Zealand, Hong Kong. Products launched - Yahoo! Go, oneSearch, mobile websites, WAP Mail/Messenger, SMS oneSearch. \n•\tSet up test automation framework using Perl WWW::Mechanize for all APAC frontpages, oneSearch localization and subscription services.  \n•\tSet up outsourced in-market testing framework for carrier testing Yahoo! mobile apps across Asia.  \n•\tQA responsibilities include supporting 20+ carrier partners in APAC. Presentations made to Globe, Sensis (AU), TNZ among others. \n•\tResponsible for demo handset set up for GSMA Asia Mobile Congress in Macau for Y! Mobile \n•\tYahoo! Connected Life \"Go Big\" team award Regional QA Manager Yahoo! January 2007  –  December 2008  (2 years) •\tSet up QA organization within Yahoo! Connected Life APAC team. This was a regional team for localization testing.  \n•\tResponsible for QA for Yahoo! mobile products across Singapore, Malaysia, Vietnam, Thailand, Indonesia, , India, Korea, Taiwan, Australia, New Zealand, Hong Kong. Products launched - Yahoo! Go, oneSearch, mobile websites, WAP Mail/Messenger, SMS oneSearch. \n•\tSet up test automation framework using Perl WWW::Mechanize for all APAC frontpages, oneSearch localization and subscription services.  \n•\tSet up outsourced in-market testing framework for carrier testing Yahoo! mobile apps across Asia.  \n•\tQA responsibilities include supporting 20+ carrier partners in APAC. Presentations made to Globe, Sensis (AU), TNZ among others. \n•\tResponsible for demo handset set up for GSMA Asia Mobile Congress in Macau for Y! Mobile \n•\tYahoo! Connected Life \"Go Big\" team award Lead Mobile Engineer Yahoo! South East Asia August 2005  –  January 2007  (1 year 6 months) •\tSingle Mobile Engineer managing SMS, WAP and BI platforms across South East Asia – Singapore, Malaysia, Philippines, Thailand, Vietnam, Indonesia. This involved ensuring all services were working well with minimal downtime due to carrier issues.  \n•\tEngineering lead for launching SMS services in Vietnam. This required deep involvement in setting up connectivity between SMS aggregator, technical evaluation of aggregator and working with SMS Messenger team to complete the integration.  \n•\tManaged the transition of Mobile operations to team in Bangalore and lead for Business Continuity project.  \n•\tManaged 2 data center migrations for mobile properties.  \n•\tSet up better monitoring and escalations – this led to improved SMS connectivity with carriers thus leading to doubling of mobile revenue. \n•\tYahoo! Odessey Award winner - for leadership in SEA Mobile \n•\tYahoo! Superstar Nominee. Lead Mobile Engineer Yahoo! South East Asia August 2005  –  January 2007  (1 year 6 months) •\tSingle Mobile Engineer managing SMS, WAP and BI platforms across South East Asia – Singapore, Malaysia, Philippines, Thailand, Vietnam, Indonesia. This involved ensuring all services were working well with minimal downtime due to carrier issues.  \n•\tEngineering lead for launching SMS services in Vietnam. This required deep involvement in setting up connectivity between SMS aggregator, technical evaluation of aggregator and working with SMS Messenger team to complete the integration.  \n•\tManaged the transition of Mobile operations to team in Bangalore and lead for Business Continuity project.  \n•\tManaged 2 data center migrations for mobile properties.  \n•\tSet up better monitoring and escalations – this led to improved SMS connectivity with carriers thus leading to doubling of mobile revenue. \n•\tYahoo! Odessey Award winner - for leadership in SEA Mobile \n•\tYahoo! Superstar Nominee. Consultant , Customer Support, Developer, Account Manager Flying Broom Pte Ltd (Tech startup) September 2000  –  August 2005  (5 years) •\tPioneer member of start-up. Participated in the growth of company from angel funding phase to conceptualizing and deploying own solution to paying customer.  \n•\tInvolved in conceptualization and writing of formal project proposals to customers.  \n•\tEditor of software manuals for company.  \n•\tInvolved in various aspects of solution delivery process from requirements gathering to deployment of system to providing 24x7 operations support for end-users.  \n•\tConceptualized, built and deployed GUI for distributed real-time system incorporating workflow management of real-time, mobile content delivery system.  \n•\tConceptualized and built business intelligence system handling millions of records each day. Consultant , Customer Support, Developer, Account Manager Flying Broom Pte Ltd (Tech startup) September 2000  –  August 2005  (5 years) •\tPioneer member of start-up. Participated in the growth of company from angel funding phase to conceptualizing and deploying own solution to paying customer.  \n•\tInvolved in conceptualization and writing of formal project proposals to customers.  \n•\tEditor of software manuals for company.  \n•\tInvolved in various aspects of solution delivery process from requirements gathering to deployment of system to providing 24x7 operations support for end-users.  \n•\tConceptualized, built and deployed GUI for distributed real-time system incorporating workflow management of real-time, mobile content delivery system.  \n•\tConceptualized and built business intelligence system handling millions of records each day. Research Assistant National University of Singapore July 1996  –  September 2000  (4 years 3 months) 1. Project managed 2 government funded research projects: \na. port vessel assignment project \nb. bus/subway commuter routing project \nsee http://citeseer.ist.psu.edu/281757.html \n2. Assisted professor in running research lab - Resource Allocation and Scheduling Lab (NUS) Research Assistant National University of Singapore July 1996  –  September 2000  (4 years 3 months) 1. Project managed 2 government funded research projects: \na. port vessel assignment project \nb. bus/subway commuter routing project \nsee http://citeseer.ist.psu.edu/281757.html \n2. Assisted professor in running research lab - Resource Allocation and Scheduling Lab (NUS) Languages English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Skills  Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Education National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore BSc.,  Computer Science 1992  – 1996 St. Joseph's Institution Stanford University Stanford University National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore BSc.,  Computer Science 1992  – 1996 National University of Singapore BSc.,  Computer Science 1992  – 1996 National University of Singapore BSc.,  Computer Science 1992  – 1996 St. Joseph's Institution St. Joseph's Institution St. Joseph's Institution Stanford University Stanford University Stanford University Stanford University Stanford University Stanford University Honors & Awards Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling Skills  Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling Consumer Internet Business Development Strategic Partnerships Partnerships Mobile Devices Business Strategy Strategy Monetization Advertising Product Management Online Advertising Financial Modeling ", "Summary Always find it interesting to connect engineer to user, feature to experience, product to market and effort to result in digital world. Experienced in managing product, project and people (stakeholders) to drive changes and get things sleekly done. Summary Always find it interesting to connect engineer to user, feature to experience, product to market and effort to result in digital world. Experienced in managing product, project and people (stakeholders) to drive changes and get things sleekly done. Always find it interesting to connect engineer to user, feature to experience, product to market and effort to result in digital world. Experienced in managing product, project and people (stakeholders) to drive changes and get things sleekly done. Always find it interesting to connect engineer to user, feature to experience, product to market and effort to result in digital world. Experienced in managing product, project and people (stakeholders) to drive changes and get things sleekly done. Experience Senior Manager, Business Strategy Yahoo February 2015  – Present (7 months) Hong Kong Develop and drive cross-team solutions to optimize monetization of products and extend Yahoo HK's dominance to Mobile  Senior Manager, Product Management and Operation Yahoo October 2014  –  January 2015  (4 months) Hong Kong Led the product development of Yahoo Hong Kong and drive the platform crossover from PC to Mobile across user experience, metrics, go-to-market as well as monetization Manager, Media Planning & Development Yahoo September 2013  –  September 2014  (1 year 1 month) Hong Kong Spearheaded user experience and business metrics by developing media product strategy and deploying new product offerings to Hong Kong (Mobile & PC) Manager, Editorial & Content Partnership Management Yahoo June 2012  –  August 2013  (1 year 3 months) Hong Kong Led business operation and product development of Yahoo Frontpage; Developed editorial strategy, sourced content partners and managed day-to-day operation of 5 Yahoo media properties (Finance, Entertainment, Style, Travel and Video) Manager, Product Marketing Yahoo January 2010  –  June 2012  (2 years 6 months) Hong Kong Defined product strategy and managed product portfolio of media properties (PC) Marketing Analyst FedEx Express July 2008  –  December 2009  (1 year 6 months) Hong Kong Responsible for both project and product management in APAC division from product conceptualization, product development, service launch to product life cycle management Head of Product Marketing Hong Kong Broadband Network Limited September 2006  –  July 2008  (1 year 11 months) Hong Kong Led the Product Marketing Team to drive technical and business development of core product and value-added services Senior Marketing Officer Hong Kong Broadband Network Limited April 2006  –  August 2006  (5 months) Hong Kong Marketing Officer Hong Kong Broadband Network Limited November 2004  –  March 2006  (1 year 5 months) Hong Kong Management Trainee Hong Kong Broadband Network Limited July 2003  –  October 2004  (1 year 4 months) Hong Kong Senior Manager, Business Strategy Yahoo February 2015  – Present (7 months) Hong Kong Develop and drive cross-team solutions to optimize monetization of products and extend Yahoo HK's dominance to Mobile  Senior Manager, Business Strategy Yahoo February 2015  – Present (7 months) Hong Kong Develop and drive cross-team solutions to optimize monetization of products and extend Yahoo HK's dominance to Mobile  Senior Manager, Product Management and Operation Yahoo October 2014  –  January 2015  (4 months) Hong Kong Led the product development of Yahoo Hong Kong and drive the platform crossover from PC to Mobile across user experience, metrics, go-to-market as well as monetization Senior Manager, Product Management and Operation Yahoo October 2014  –  January 2015  (4 months) Hong Kong Led the product development of Yahoo Hong Kong and drive the platform crossover from PC to Mobile across user experience, metrics, go-to-market as well as monetization Manager, Media Planning & Development Yahoo September 2013  –  September 2014  (1 year 1 month) Hong Kong Spearheaded user experience and business metrics by developing media product strategy and deploying new product offerings to Hong Kong (Mobile & PC) Manager, Media Planning & Development Yahoo September 2013  –  September 2014  (1 year 1 month) Hong Kong Spearheaded user experience and business metrics by developing media product strategy and deploying new product offerings to Hong Kong (Mobile & PC) Manager, Editorial & Content Partnership Management Yahoo June 2012  –  August 2013  (1 year 3 months) Hong Kong Led business operation and product development of Yahoo Frontpage; Developed editorial strategy, sourced content partners and managed day-to-day operation of 5 Yahoo media properties (Finance, Entertainment, Style, Travel and Video) Manager, Editorial & Content Partnership Management Yahoo June 2012  –  August 2013  (1 year 3 months) Hong Kong Led business operation and product development of Yahoo Frontpage; Developed editorial strategy, sourced content partners and managed day-to-day operation of 5 Yahoo media properties (Finance, Entertainment, Style, Travel and Video) Manager, Product Marketing Yahoo January 2010  –  June 2012  (2 years 6 months) Hong Kong Defined product strategy and managed product portfolio of media properties (PC) Manager, Product Marketing Yahoo January 2010  –  June 2012  (2 years 6 months) Hong Kong Defined product strategy and managed product portfolio of media properties (PC) Marketing Analyst FedEx Express July 2008  –  December 2009  (1 year 6 months) Hong Kong Responsible for both project and product management in APAC division from product conceptualization, product development, service launch to product life cycle management Marketing Analyst FedEx Express July 2008  –  December 2009  (1 year 6 months) Hong Kong Responsible for both project and product management in APAC division from product conceptualization, product development, service launch to product life cycle management Head of Product Marketing Hong Kong Broadband Network Limited September 2006  –  July 2008  (1 year 11 months) Hong Kong Led the Product Marketing Team to drive technical and business development of core product and value-added services Head of Product Marketing Hong Kong Broadband Network Limited September 2006  –  July 2008  (1 year 11 months) Hong Kong Led the Product Marketing Team to drive technical and business development of core product and value-added services Senior Marketing Officer Hong Kong Broadband Network Limited April 2006  –  August 2006  (5 months) Hong Kong Senior Marketing Officer Hong Kong Broadband Network Limited April 2006  –  August 2006  (5 months) Hong Kong Marketing Officer Hong Kong Broadband Network Limited November 2004  –  March 2006  (1 year 5 months) Hong Kong Marketing Officer Hong Kong Broadband Network Limited November 2004  –  March 2006  (1 year 5 months) Hong Kong Management Trainee Hong Kong Broadband Network Limited July 2003  –  October 2004  (1 year 4 months) Hong Kong Management Trainee Hong Kong Broadband Network Limited July 2003  –  October 2004  (1 year 4 months) Hong Kong Skills Digital Marketing Online Advertising Web Analytics SEM Product Marketing Product Management Business Development Business Strategy User Experience Marketing Online Marketing Management Marketing Strategy Mobile Devices Skills  Digital Marketing Online Advertising Web Analytics SEM Product Marketing Product Management Business Development Business Strategy User Experience Marketing Online Marketing Management Marketing Strategy Mobile Devices Digital Marketing Online Advertising Web Analytics SEM Product Marketing Product Management Business Development Business Strategy User Experience Marketing Online Marketing Management Marketing Strategy Mobile Devices Digital Marketing Online Advertising Web Analytics SEM Product Marketing Product Management Business Development Business Strategy User Experience Marketing Online Marketing Management Marketing Strategy Mobile Devices Education The Chinese University of Hong Kong Master of Business Administration (M.B.A.),  Marketing , Dean's List (2010) 2008  – 2010 The Hong Kong University of Science and Technology Bachelor's Degree,  Management of Organization and Operations Management (Double Major) The Chinese University of Hong Kong Master of Business Administration (M.B.A.),  Marketing , Dean's List (2010) 2008  – 2010 The Chinese University of Hong Kong Master of Business Administration (M.B.A.),  Marketing , Dean's List (2010) 2008  – 2010 The Chinese University of Hong Kong Master of Business Administration (M.B.A.),  Marketing , Dean's List (2010) 2008  – 2010 The Hong Kong University of Science and Technology Bachelor's Degree,  Management of Organization and Operations Management (Double Major) The Hong Kong University of Science and Technology Bachelor's Degree,  Management of Organization and Operations Management (Double Major) The Hong Kong University of Science and Technology Bachelor's Degree,  Management of Organization and Operations Management (Double Major) Honors & Awards Yahoo! Editorial Award 2012 Yahoo! April 2013 For best entertainment content in Asia Pacific Yahoo! Editorial Award 2012 Yahoo! April 2013 For best entertainment content in Asia Pacific Yahoo! Editorial Award 2012 Yahoo! April 2013 For best entertainment content in Asia Pacific Yahoo! Editorial Award 2012 Yahoo! April 2013 For best entertainment content in Asia Pacific ", "Experience Sr. Manager, Global Partnerships - Business Development Yahoo! June 2014  – Present (1 year 3 months) San Francisco Bay Area Sr. Manager, Global Partnerships - Business Development Yahoo! June 2014  – Present (1 year 3 months) San Francisco Bay Area Sr. Manager, Global Partnerships - Business Development Yahoo! June 2014  – Present (1 year 3 months) San Francisco Bay Area Skills Digital Media Online Advertising Behavioral Targeting Digital Strategy Rich Media Mobile Marketing Skills  Digital Media Online Advertising Behavioral Targeting Digital Strategy Rich Media Mobile Marketing Digital Media Online Advertising Behavioral Targeting Digital Strategy Rich Media Mobile Marketing Digital Media Online Advertising Behavioral Targeting Digital Strategy Rich Media Mobile Marketing Honors & Awards ", "Experience Senior Manager, Marketplace Development Yahoo June 2013  – Present (2 years 3 months) Boston, MA I'm currently focused on supply within our Audience Marketplace. We have incredible Audience opportunities and I'm working to connect the dots between the Supply and Demand sides through education and evangelizing. I also manage our knowledge base and have run numerous Supply Summits to promote our offerings and capabilities. Sr. Manager, Optimization Strategy Yahoo! January 2010  –  June 2013  (3 years 6 months) Greater Boston Area Manage a team of Optimization Strategists in Boston, New York, Atlanta, Detroit and Dallas. We focus on the NetPlus business, Yahoo's Premiere Digital Network, managing everything from data analysis to optimization opportunities to customer relationships. Manager, Ad Operations Microsoft July 2008  –  December 2009  (1 year 6 months) Managed national team of Ad Ops Managers supporting the Microsoft Media Network  \nAOMs input, revise, and optimize campaigns in MMN. MMN is Microsoft's performance Network, focusing heavily on CPM, CPC, and CPA campaigns. AOMs are responsible for ensuring accurate, effective and profitable use of impressions to reach target audience and exceed advertisers' expectations.  \nResponsible for the C2T Project: An organizational transition of creative responsibilities from the AOM team to the TAM (Technical Account Manager) team. Transition was seamless for advertisers and streamlined efforts of sales and operations teams.  \nInitiated Global Optimization Round Tables: Due to inconsistent skill and experience levels throughout the Global NMO Team, began holding international meetings between the Seattle, New York and London offices to troubleshoot buys, discuss optimization strategies and brainstorm new ways of hitting and increasing budgets. \nResponsible for finding, mentoring and developing new hires as well as aligning them with sales territories for even work distribution. Associate Regional Operations Manager Yahoo August 2007  –  July 2008  (1 year) Manage a team of Media Delivery Coordinators to facilitate the region's productivity, efficiency and effectiveness in supporting the Inside Sales Operation's team. \nResponsible for finding, mentoring and developing new hires within the team.  \nAssign sales reps and accounts to MDCs and facilitate coordination, execution, and campaign management for accounts in region.  \nPull various reports to assist in proactively finding and fixing possible revenue loss: Under-Delivery Report, Future Campaign Line Report, Revenue Recognition Report. \nAssist in resolving escalated questions and issues for both customers and sales within Yahoo and Right Media systems.  \nPersonally responsible for teaching Right Media system to Inside Sales Operations department as well as Bangalore team in India to commit and revise campaigns, as well as schedule creative. Contributed to unrolling Right Media within Yahoo on a global scale to Latin America, Brazil, India and Argentina.  \nLearned and trained Blue Lithium's AdRevolver system to ISO MDC team so as to alleviate work from various offices. \nWinner of prestigious Elite Performer Award. Nominated by peers as an employee who goes the extra mile. Media Delivery Coordinator Yahoo June 2006  –  August 2007  (1 year 3 months) Partnered with sales representative to implement and run successful and profitable online ad campaigns \nRight Media Subject Matter Expert - Given the opportunity to learn and teach the Right Media system to Media Delivery Coordinators as well as off shoring team in India. Main point of contact for all Right Media campaigns.  \nMail Vertical Specialist- work with property producers to monitor special events (roadblocks) as well as communicate page changes to all MDCs on a national level. \nPod Leader to a team of 5 MDCs - first line of escalation to assist with questions, coverage, advice on handling various situations Account Specialist Comcast Spotlight September 2004  –  May 2006  (1 year 9 months) Worked directly with sales team and agencies to deliver successful television campaigns. Regional Sales Coordinator Comcast Spotlight January 2004  –  May 2006  (2 years 5 months) Assist Account Executives and sales Management by developing sales materials, providing background information regarding client product, compiling client presentations as well as competitive research analysis \nInteract with external clients as well as partnering departments to maintain excellent relationships \nComplete make-goods, preempt reports, and manual verification for exceptions to achieve 99% run percentages Senior Manager, Marketplace Development Yahoo June 2013  – Present (2 years 3 months) Boston, MA I'm currently focused on supply within our Audience Marketplace. We have incredible Audience opportunities and I'm working to connect the dots between the Supply and Demand sides through education and evangelizing. I also manage our knowledge base and have run numerous Supply Summits to promote our offerings and capabilities. Senior Manager, Marketplace Development Yahoo June 2013  – Present (2 years 3 months) Boston, MA I'm currently focused on supply within our Audience Marketplace. We have incredible Audience opportunities and I'm working to connect the dots between the Supply and Demand sides through education and evangelizing. I also manage our knowledge base and have run numerous Supply Summits to promote our offerings and capabilities. Sr. Manager, Optimization Strategy Yahoo! January 2010  –  June 2013  (3 years 6 months) Greater Boston Area Manage a team of Optimization Strategists in Boston, New York, Atlanta, Detroit and Dallas. We focus on the NetPlus business, Yahoo's Premiere Digital Network, managing everything from data analysis to optimization opportunities to customer relationships. Sr. Manager, Optimization Strategy Yahoo! January 2010  –  June 2013  (3 years 6 months) Greater Boston Area Manage a team of Optimization Strategists in Boston, New York, Atlanta, Detroit and Dallas. We focus on the NetPlus business, Yahoo's Premiere Digital Network, managing everything from data analysis to optimization opportunities to customer relationships. Manager, Ad Operations Microsoft July 2008  –  December 2009  (1 year 6 months) Managed national team of Ad Ops Managers supporting the Microsoft Media Network  \nAOMs input, revise, and optimize campaigns in MMN. MMN is Microsoft's performance Network, focusing heavily on CPM, CPC, and CPA campaigns. AOMs are responsible for ensuring accurate, effective and profitable use of impressions to reach target audience and exceed advertisers' expectations.  \nResponsible for the C2T Project: An organizational transition of creative responsibilities from the AOM team to the TAM (Technical Account Manager) team. Transition was seamless for advertisers and streamlined efforts of sales and operations teams.  \nInitiated Global Optimization Round Tables: Due to inconsistent skill and experience levels throughout the Global NMO Team, began holding international meetings between the Seattle, New York and London offices to troubleshoot buys, discuss optimization strategies and brainstorm new ways of hitting and increasing budgets. \nResponsible for finding, mentoring and developing new hires as well as aligning them with sales territories for even work distribution. Manager, Ad Operations Microsoft July 2008  –  December 2009  (1 year 6 months) Managed national team of Ad Ops Managers supporting the Microsoft Media Network  \nAOMs input, revise, and optimize campaigns in MMN. MMN is Microsoft's performance Network, focusing heavily on CPM, CPC, and CPA campaigns. AOMs are responsible for ensuring accurate, effective and profitable use of impressions to reach target audience and exceed advertisers' expectations.  \nResponsible for the C2T Project: An organizational transition of creative responsibilities from the AOM team to the TAM (Technical Account Manager) team. Transition was seamless for advertisers and streamlined efforts of sales and operations teams.  \nInitiated Global Optimization Round Tables: Due to inconsistent skill and experience levels throughout the Global NMO Team, began holding international meetings between the Seattle, New York and London offices to troubleshoot buys, discuss optimization strategies and brainstorm new ways of hitting and increasing budgets. \nResponsible for finding, mentoring and developing new hires as well as aligning them with sales territories for even work distribution. Associate Regional Operations Manager Yahoo August 2007  –  July 2008  (1 year) Manage a team of Media Delivery Coordinators to facilitate the region's productivity, efficiency and effectiveness in supporting the Inside Sales Operation's team. \nResponsible for finding, mentoring and developing new hires within the team.  \nAssign sales reps and accounts to MDCs and facilitate coordination, execution, and campaign management for accounts in region.  \nPull various reports to assist in proactively finding and fixing possible revenue loss: Under-Delivery Report, Future Campaign Line Report, Revenue Recognition Report. \nAssist in resolving escalated questions and issues for both customers and sales within Yahoo and Right Media systems.  \nPersonally responsible for teaching Right Media system to Inside Sales Operations department as well as Bangalore team in India to commit and revise campaigns, as well as schedule creative. Contributed to unrolling Right Media within Yahoo on a global scale to Latin America, Brazil, India and Argentina.  \nLearned and trained Blue Lithium's AdRevolver system to ISO MDC team so as to alleviate work from various offices. \nWinner of prestigious Elite Performer Award. Nominated by peers as an employee who goes the extra mile. Associate Regional Operations Manager Yahoo August 2007  –  July 2008  (1 year) Manage a team of Media Delivery Coordinators to facilitate the region's productivity, efficiency and effectiveness in supporting the Inside Sales Operation's team. \nResponsible for finding, mentoring and developing new hires within the team.  \nAssign sales reps and accounts to MDCs and facilitate coordination, execution, and campaign management for accounts in region.  \nPull various reports to assist in proactively finding and fixing possible revenue loss: Under-Delivery Report, Future Campaign Line Report, Revenue Recognition Report. \nAssist in resolving escalated questions and issues for both customers and sales within Yahoo and Right Media systems.  \nPersonally responsible for teaching Right Media system to Inside Sales Operations department as well as Bangalore team in India to commit and revise campaigns, as well as schedule creative. Contributed to unrolling Right Media within Yahoo on a global scale to Latin America, Brazil, India and Argentina.  \nLearned and trained Blue Lithium's AdRevolver system to ISO MDC team so as to alleviate work from various offices. \nWinner of prestigious Elite Performer Award. Nominated by peers as an employee who goes the extra mile. Media Delivery Coordinator Yahoo June 2006  –  August 2007  (1 year 3 months) Partnered with sales representative to implement and run successful and profitable online ad campaigns \nRight Media Subject Matter Expert - Given the opportunity to learn and teach the Right Media system to Media Delivery Coordinators as well as off shoring team in India. Main point of contact for all Right Media campaigns.  \nMail Vertical Specialist- work with property producers to monitor special events (roadblocks) as well as communicate page changes to all MDCs on a national level. \nPod Leader to a team of 5 MDCs - first line of escalation to assist with questions, coverage, advice on handling various situations Media Delivery Coordinator Yahoo June 2006  –  August 2007  (1 year 3 months) Partnered with sales representative to implement and run successful and profitable online ad campaigns \nRight Media Subject Matter Expert - Given the opportunity to learn and teach the Right Media system to Media Delivery Coordinators as well as off shoring team in India. Main point of contact for all Right Media campaigns.  \nMail Vertical Specialist- work with property producers to monitor special events (roadblocks) as well as communicate page changes to all MDCs on a national level. \nPod Leader to a team of 5 MDCs - first line of escalation to assist with questions, coverage, advice on handling various situations Account Specialist Comcast Spotlight September 2004  –  May 2006  (1 year 9 months) Worked directly with sales team and agencies to deliver successful television campaigns. Account Specialist Comcast Spotlight September 2004  –  May 2006  (1 year 9 months) Worked directly with sales team and agencies to deliver successful television campaigns. Regional Sales Coordinator Comcast Spotlight January 2004  –  May 2006  (2 years 5 months) Assist Account Executives and sales Management by developing sales materials, providing background information regarding client product, compiling client presentations as well as competitive research analysis \nInteract with external clients as well as partnering departments to maintain excellent relationships \nComplete make-goods, preempt reports, and manual verification for exceptions to achieve 99% run percentages Regional Sales Coordinator Comcast Spotlight January 2004  –  May 2006  (2 years 5 months) Assist Account Executives and sales Management by developing sales materials, providing background information regarding client product, compiling client presentations as well as competitive research analysis \nInteract with external clients as well as partnering departments to maintain excellent relationships \nComplete make-goods, preempt reports, and manual verification for exceptions to achieve 99% run percentages Skills Online Advertising CRM Strategy Competitive Analysis Advertising PPC Management Leadership Sales Operations Sales Team Leadership Team Management Event Management Sales Management Data Analysis Budgets Campaign Management Troubleshooting Digital Media Digital Marketing See 5+     See less Skills  Online Advertising CRM Strategy Competitive Analysis Advertising PPC Management Leadership Sales Operations Sales Team Leadership Team Management Event Management Sales Management Data Analysis Budgets Campaign Management Troubleshooting Digital Media Digital Marketing See 5+     See less Online Advertising CRM Strategy Competitive Analysis Advertising PPC Management Leadership Sales Operations Sales Team Leadership Team Management Event Management Sales Management Data Analysis Budgets Campaign Management Troubleshooting Digital Media Digital Marketing See 5+     See less Online Advertising CRM Strategy Competitive Analysis Advertising PPC Management Leadership Sales Operations Sales Team Leadership Team Management Event Management Sales Management Data Analysis Budgets Campaign Management Troubleshooting Digital Media Digital Marketing See 5+     See less Education Bucknell University Bachelor of Science Degree; BSBA,  Business Administration; Management 1999  – 2003 Bucknell University Bachelor of Science Degree; BSBA,  Business Administration; Management 1999  – 2003 Bucknell University Bachelor of Science Degree; BSBA,  Business Administration; Management 1999  – 2003 Bucknell University Bachelor of Science Degree; BSBA,  Business Administration; Management 1999  – 2003 ", "Summary Bringing ideas and techniques to support the overall business strategies and vision of the company. Proficiencies include strong analytical and problem solving skills with the ability to quickly master new ideas and concepts, power computer user, team player with strong interpersonal and verbal/written communication skills, the ability to manage, train and mentor assigned personnel. Ability to effectively engage clients by fully understanding their target audience, building a story, and tailoring programs to link objectives to site audience and fulfilling campaign goals. Summary Bringing ideas and techniques to support the overall business strategies and vision of the company. Proficiencies include strong analytical and problem solving skills with the ability to quickly master new ideas and concepts, power computer user, team player with strong interpersonal and verbal/written communication skills, the ability to manage, train and mentor assigned personnel. Ability to effectively engage clients by fully understanding their target audience, building a story, and tailoring programs to link objectives to site audience and fulfilling campaign goals. Bringing ideas and techniques to support the overall business strategies and vision of the company. Proficiencies include strong analytical and problem solving skills with the ability to quickly master new ideas and concepts, power computer user, team player with strong interpersonal and verbal/written communication skills, the ability to manage, train and mentor assigned personnel. Ability to effectively engage clients by fully understanding their target audience, building a story, and tailoring programs to link objectives to site audience and fulfilling campaign goals. Bringing ideas and techniques to support the overall business strategies and vision of the company. Proficiencies include strong analytical and problem solving skills with the ability to quickly master new ideas and concepts, power computer user, team player with strong interpersonal and verbal/written communication skills, the ability to manage, train and mentor assigned personnel. Ability to effectively engage clients by fully understanding their target audience, building a story, and tailoring programs to link objectives to site audience and fulfilling campaign goals. Experience Senior Manager, Strategic Research & Insights Yahoo July 2015  – Present (2 months) London, United Kingdom Senior Manager, Strategic Research & Insights Yahoo March 2015  –  June 2015  (4 months) Greater Los Angeles Area Manager, Strategic Research & Insights Yahoo January 2012  –  February 2015  (3 years 2 months) Greater Los Angeles Area Responsible for: \n• Creating and delivering data-driven audience insights to demonstrate the power of Yahoo!’s advertising platform to support $100+MM in sales per year – client categories include: Finance, Insurance, Retail, Technology, Telecommunications, Entertainment, Automotive, Travel, and Quick Serve Restaurants \n• Working with sales teams on key accounts to deliver relevant and compelling audience insights to help advertisers understand consumer behavior online \n• Engage clients at in-person presentations – effectively communicate campaign measurement insights and custom audience decks \n• Providing competitive analysis and in-depth audience insights that explore user behavior and propensities \n• Leveraging a range of available data sources, including internal, primary and syndicated tools, to build compelling narratives and strategic angles that address business needs and make actionable recommendations \n• Managing quantitative and qualitative studies that are run both internally and with third-party audience research companies Manager, Media Research & Insights Warner Bros. Entertainment Group of Companies August 2010  –  December 2011  (1 year 5 months) Responsible for: Managed day-to-day research for Digital Ad Sales team and internal Telepictures executives: \n• Created and delivered data-driven audience insights to support $20+MM in sales per year \n• Generated audience insights for digital sales while effectively marketing to a range of targets; represent Warner Bros. Digital Sites (TMZ.com, TooFab.com, ExtraTV.com, EllenTV.com, AndersonCooper.com, MomLogic.com) for Online and Mobile on all marketing campaigns and sales pitches involving research \n• Built research presentations to use on prospective sales meetings using third-party and internal research tools that included comScore, Nielsen NetRatings, Simmons, Kantar-TNS, and Omniture \n• Implemented and managed third-party research studies, including ad effectiveness studies with Dynamic Logic \n• Managed all digital relations and site updates/changes with third-party research vendors – comScore, Nielsen NetRatings, and Simmons \n• Served as a mentor and liaison between the CWTV Digital group and the Media Research & Insights team \n• Co-managed Sr. Analyst with VP of Digital Media Research & Insights \n• Trained and managed summer interns Senior Analyst, Market Research The Walt Disney Company March 2008  –  July 2010  (2 years 5 months) Greater Los Angeles Area Responsible for: Managing day-to-day research for online ad sales team: \n• Created and delivered data-driven audience insights to support $70+MM in sales per year \n• Strategized with advertisers and agencies to create the best means of generating insights while effectively marketing to Moms and Kids, both online and cross-media; represent Disney Online and the Family/Kaboose sites on all marketing campaigns and sales pitches involving research \n• Built and presented research presentations to use on prospective sales meetings using third-party and internal research tools that include comScore, Nielsen NetRatings, Simmons, Kantar-TNS, Hitwise, and Omniture \n• Implemented and managed primary and third-party research studies, including ad effectiveness and brand/custom studies with Dynamic Logic, Insight Express, comScore, OTX, Compete, and Iconoculture \n• Provided orientation and trained new members of the sales team; educate sales on best practices when using data to competitively position Disney Online and the Family/Kaboose sites in the market; present the latest research findings and statistics at sales meetings; provide sales marketing with most current data used in pitches and sales materials \n• Trained and managed summer interns Client Service Manager comScore, Inc. June 2007  –  February 2008  (9 months) San Francisco Bay Area Responsible for: \n• Understanding the business needs of clients and how our services will meet their objectives \n• Being knowledgeable on all measurement products and custom analysis to answer client questions and needs – providing first line of support for clients \n• Orchestrated collaborative effort with Account Managers to implement marketing plans and proactive contacts to aid sales in up sell and contract renewals \n• Trained clients on measurement products \n• Analyzed data to answer client data investigation requests \n• Handled review of client press releases Research Analyst Dynamic Logic June 2006  –  June 2007  (1 year 1 month) Greater New York City Area Responsible for: Managing online marketing research campaigns from concept to completion, by: \n• Initiating needs assessment, customization of research methodology, designing/developing online surveys, analyzing data, and interpreting results \n• Orchestrated collaborative effort with Account Managers, Information Systems Group and Sales Team in creation and maintenance of client interface sites \n• Composed detailed reports that provided actionable recommendations to increase revenue and profitability Senior Manager, Strategic Research & Insights Yahoo July 2015  – Present (2 months) London, United Kingdom Senior Manager, Strategic Research & Insights Yahoo July 2015  – Present (2 months) London, United Kingdom Senior Manager, Strategic Research & Insights Yahoo March 2015  –  June 2015  (4 months) Greater Los Angeles Area Senior Manager, Strategic Research & Insights Yahoo March 2015  –  June 2015  (4 months) Greater Los Angeles Area Manager, Strategic Research & Insights Yahoo January 2012  –  February 2015  (3 years 2 months) Greater Los Angeles Area Responsible for: \n• Creating and delivering data-driven audience insights to demonstrate the power of Yahoo!’s advertising platform to support $100+MM in sales per year – client categories include: Finance, Insurance, Retail, Technology, Telecommunications, Entertainment, Automotive, Travel, and Quick Serve Restaurants \n• Working with sales teams on key accounts to deliver relevant and compelling audience insights to help advertisers understand consumer behavior online \n• Engage clients at in-person presentations – effectively communicate campaign measurement insights and custom audience decks \n• Providing competitive analysis and in-depth audience insights that explore user behavior and propensities \n• Leveraging a range of available data sources, including internal, primary and syndicated tools, to build compelling narratives and strategic angles that address business needs and make actionable recommendations \n• Managing quantitative and qualitative studies that are run both internally and with third-party audience research companies Manager, Strategic Research & Insights Yahoo January 2012  –  February 2015  (3 years 2 months) Greater Los Angeles Area Responsible for: \n• Creating and delivering data-driven audience insights to demonstrate the power of Yahoo!’s advertising platform to support $100+MM in sales per year – client categories include: Finance, Insurance, Retail, Technology, Telecommunications, Entertainment, Automotive, Travel, and Quick Serve Restaurants \n• Working with sales teams on key accounts to deliver relevant and compelling audience insights to help advertisers understand consumer behavior online \n• Engage clients at in-person presentations – effectively communicate campaign measurement insights and custom audience decks \n• Providing competitive analysis and in-depth audience insights that explore user behavior and propensities \n• Leveraging a range of available data sources, including internal, primary and syndicated tools, to build compelling narratives and strategic angles that address business needs and make actionable recommendations \n• Managing quantitative and qualitative studies that are run both internally and with third-party audience research companies Manager, Media Research & Insights Warner Bros. Entertainment Group of Companies August 2010  –  December 2011  (1 year 5 months) Responsible for: Managed day-to-day research for Digital Ad Sales team and internal Telepictures executives: \n• Created and delivered data-driven audience insights to support $20+MM in sales per year \n• Generated audience insights for digital sales while effectively marketing to a range of targets; represent Warner Bros. Digital Sites (TMZ.com, TooFab.com, ExtraTV.com, EllenTV.com, AndersonCooper.com, MomLogic.com) for Online and Mobile on all marketing campaigns and sales pitches involving research \n• Built research presentations to use on prospective sales meetings using third-party and internal research tools that included comScore, Nielsen NetRatings, Simmons, Kantar-TNS, and Omniture \n• Implemented and managed third-party research studies, including ad effectiveness studies with Dynamic Logic \n• Managed all digital relations and site updates/changes with third-party research vendors – comScore, Nielsen NetRatings, and Simmons \n• Served as a mentor and liaison between the CWTV Digital group and the Media Research & Insights team \n• Co-managed Sr. Analyst with VP of Digital Media Research & Insights \n• Trained and managed summer interns Manager, Media Research & Insights Warner Bros. Entertainment Group of Companies August 2010  –  December 2011  (1 year 5 months) Responsible for: Managed day-to-day research for Digital Ad Sales team and internal Telepictures executives: \n• Created and delivered data-driven audience insights to support $20+MM in sales per year \n• Generated audience insights for digital sales while effectively marketing to a range of targets; represent Warner Bros. Digital Sites (TMZ.com, TooFab.com, ExtraTV.com, EllenTV.com, AndersonCooper.com, MomLogic.com) for Online and Mobile on all marketing campaigns and sales pitches involving research \n• Built research presentations to use on prospective sales meetings using third-party and internal research tools that included comScore, Nielsen NetRatings, Simmons, Kantar-TNS, and Omniture \n• Implemented and managed third-party research studies, including ad effectiveness studies with Dynamic Logic \n• Managed all digital relations and site updates/changes with third-party research vendors – comScore, Nielsen NetRatings, and Simmons \n• Served as a mentor and liaison between the CWTV Digital group and the Media Research & Insights team \n• Co-managed Sr. Analyst with VP of Digital Media Research & Insights \n• Trained and managed summer interns Senior Analyst, Market Research The Walt Disney Company March 2008  –  July 2010  (2 years 5 months) Greater Los Angeles Area Responsible for: Managing day-to-day research for online ad sales team: \n• Created and delivered data-driven audience insights to support $70+MM in sales per year \n• Strategized with advertisers and agencies to create the best means of generating insights while effectively marketing to Moms and Kids, both online and cross-media; represent Disney Online and the Family/Kaboose sites on all marketing campaigns and sales pitches involving research \n• Built and presented research presentations to use on prospective sales meetings using third-party and internal research tools that include comScore, Nielsen NetRatings, Simmons, Kantar-TNS, Hitwise, and Omniture \n• Implemented and managed primary and third-party research studies, including ad effectiveness and brand/custom studies with Dynamic Logic, Insight Express, comScore, OTX, Compete, and Iconoculture \n• Provided orientation and trained new members of the sales team; educate sales on best practices when using data to competitively position Disney Online and the Family/Kaboose sites in the market; present the latest research findings and statistics at sales meetings; provide sales marketing with most current data used in pitches and sales materials \n• Trained and managed summer interns Senior Analyst, Market Research The Walt Disney Company March 2008  –  July 2010  (2 years 5 months) Greater Los Angeles Area Responsible for: Managing day-to-day research for online ad sales team: \n• Created and delivered data-driven audience insights to support $70+MM in sales per year \n• Strategized with advertisers and agencies to create the best means of generating insights while effectively marketing to Moms and Kids, both online and cross-media; represent Disney Online and the Family/Kaboose sites on all marketing campaigns and sales pitches involving research \n• Built and presented research presentations to use on prospective sales meetings using third-party and internal research tools that include comScore, Nielsen NetRatings, Simmons, Kantar-TNS, Hitwise, and Omniture \n• Implemented and managed primary and third-party research studies, including ad effectiveness and brand/custom studies with Dynamic Logic, Insight Express, comScore, OTX, Compete, and Iconoculture \n• Provided orientation and trained new members of the sales team; educate sales on best practices when using data to competitively position Disney Online and the Family/Kaboose sites in the market; present the latest research findings and statistics at sales meetings; provide sales marketing with most current data used in pitches and sales materials \n• Trained and managed summer interns Client Service Manager comScore, Inc. June 2007  –  February 2008  (9 months) San Francisco Bay Area Responsible for: \n• Understanding the business needs of clients and how our services will meet their objectives \n• Being knowledgeable on all measurement products and custom analysis to answer client questions and needs – providing first line of support for clients \n• Orchestrated collaborative effort with Account Managers to implement marketing plans and proactive contacts to aid sales in up sell and contract renewals \n• Trained clients on measurement products \n• Analyzed data to answer client data investigation requests \n• Handled review of client press releases Client Service Manager comScore, Inc. June 2007  –  February 2008  (9 months) San Francisco Bay Area Responsible for: \n• Understanding the business needs of clients and how our services will meet their objectives \n• Being knowledgeable on all measurement products and custom analysis to answer client questions and needs – providing first line of support for clients \n• Orchestrated collaborative effort with Account Managers to implement marketing plans and proactive contacts to aid sales in up sell and contract renewals \n• Trained clients on measurement products \n• Analyzed data to answer client data investigation requests \n• Handled review of client press releases Research Analyst Dynamic Logic June 2006  –  June 2007  (1 year 1 month) Greater New York City Area Responsible for: Managing online marketing research campaigns from concept to completion, by: \n• Initiating needs assessment, customization of research methodology, designing/developing online surveys, analyzing data, and interpreting results \n• Orchestrated collaborative effort with Account Managers, Information Systems Group and Sales Team in creation and maintenance of client interface sites \n• Composed detailed reports that provided actionable recommendations to increase revenue and profitability Research Analyst Dynamic Logic June 2006  –  June 2007  (1 year 1 month) Greater New York City Area Responsible for: Managing online marketing research campaigns from concept to completion, by: \n• Initiating needs assessment, customization of research methodology, designing/developing online surveys, analyzing data, and interpreting results \n• Orchestrated collaborative effort with Account Managers, Information Systems Group and Sales Team in creation and maintenance of client interface sites \n• Composed detailed reports that provided actionable recommendations to increase revenue and profitability Languages Kannada Professional working proficiency Kannada Professional working proficiency Kannada Professional working proficiency Professional working proficiency Skills Market Research Digital Media Online Advertising Digital Marketing Digital Strategy Web Analytics Social Media Consumer Insight Sales Media Research Skills  Market Research Digital Media Online Advertising Digital Marketing Digital Strategy Web Analytics Social Media Consumer Insight Sales Media Research Market Research Digital Media Online Advertising Digital Marketing Digital Strategy Web Analytics Social Media Consumer Insight Sales Media Research Market Research Digital Media Online Advertising Digital Marketing Digital Strategy Web Analytics Social Media Consumer Insight Sales Media Research Education Pace University Bachelor's Degree,  Marketing-Management ,  Finance & Economics 2002  – 2006 Double Bachelors of Business Administration: \nMajors: Marketing-Management & Finance \nMinor: Economics Activities and Societies:  Pforzheimer Honors College ,  Phi Chi Theta Pace University Bachelor's Degree,  Marketing-Management ,  Finance & Economics 2002  – 2006 Double Bachelors of Business Administration: \nMajors: Marketing-Management & Finance \nMinor: Economics Activities and Societies:  Pforzheimer Honors College ,  Phi Chi Theta Pace University Bachelor's Degree,  Marketing-Management ,  Finance & Economics 2002  – 2006 Double Bachelors of Business Administration: \nMajors: Marketing-Management & Finance \nMinor: Economics Activities and Societies:  Pforzheimer Honors College ,  Phi Chi Theta Pace University Bachelor's Degree,  Marketing-Management ,  Finance & Economics 2002  – 2006 Double Bachelors of Business Administration: \nMajors: Marketing-Management & Finance \nMinor: Economics Activities and Societies:  Pforzheimer Honors College ,  Phi Chi Theta ", "Skills User Experience Content Management Web Analytics Digital Media Content Strategy SEO Online Advertising SEM Web Content Management E-commerce CMS Analytics Information Architecture Mobile Devices Skills  User Experience Content Management Web Analytics Digital Media Content Strategy SEO Online Advertising SEM Web Content Management E-commerce CMS Analytics Information Architecture Mobile Devices User Experience Content Management Web Analytics Digital Media Content Strategy SEO Online Advertising SEM Web Content Management E-commerce CMS Analytics Information Architecture Mobile Devices User Experience Content Management Web Analytics Digital Media Content Strategy SEO Online Advertising SEM Web Content Management E-commerce CMS Analytics Information Architecture Mobile Devices ", "Skills FreeBSD C PHP Linux Security Apache Skills  FreeBSD C PHP Linux Security Apache FreeBSD C PHP Linux Security Apache FreeBSD C PHP Linux Security Apache ", "Skills Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less Skills  Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less ", "Summary Responsible for strategies and planning of all Operations infrastructure(network, storage and server) and services including data centers. \n \n専門分野: - large scale data center operations \n- IP network design and operations \n-- WAN(Transit, Peering, dark-fiber) \n-- LAN(GSLB, L4-7 load blancing, L3 switching and L2 network) \n-- CDN, DNS \n- storage operations and strategy. \n- manage several tens of thousands of servers \n- manage operating system, virtualization \n- monitoring all infrastructure system \n- security(PCIDSS, ISMS) \n- Openstack Summary Responsible for strategies and planning of all Operations infrastructure(network, storage and server) and services including data centers. \n \n専門分野: - large scale data center operations \n- IP network design and operations \n-- WAN(Transit, Peering, dark-fiber) \n-- LAN(GSLB, L4-7 load blancing, L3 switching and L2 network) \n-- CDN, DNS \n- storage operations and strategy. \n- manage several tens of thousands of servers \n- manage operating system, virtualization \n- monitoring all infrastructure system \n- security(PCIDSS, ISMS) \n- Openstack Responsible for strategies and planning of all Operations infrastructure(network, storage and server) and services including data centers. \n \n専門分野: - large scale data center operations \n- IP network design and operations \n-- WAN(Transit, Peering, dark-fiber) \n-- LAN(GSLB, L4-7 load blancing, L3 switching and L2 network) \n-- CDN, DNS \n- storage operations and strategy. \n- manage several tens of thousands of servers \n- manage operating system, virtualization \n- monitoring all infrastructure system \n- security(PCIDSS, ISMS) \n- Openstack Responsible for strategies and planning of all Operations infrastructure(network, storage and server) and services including data centers. \n \n専門分野: - large scale data center operations \n- IP network design and operations \n-- WAN(Transit, Peering, dark-fiber) \n-- LAN(GSLB, L4-7 load blancing, L3 switching and L2 network) \n-- CDN, DNS \n- storage operations and strategy. \n- manage several tens of thousands of servers \n- manage operating system, virtualization \n- monitoring all infrastructure system \n- security(PCIDSS, ISMS) \n- Openstack Experience Member of the Board of Directors, EVP, VP of Cloud infrastructure engineering Division YJ America, Inc. 2014  – Present (1 year) Washington state Blackbelt in Datacenter Yahoo! JAPAN October 2014  – Present (11 months) Vice President and Technical Director , Infrastructure engineering Division Yahoo! JAPAN April 2014  –  September 2014  (6 months) Tokyo サイトオペレーション本部　本部長 Senior Manager, Infrastructure engineering Department Yahoo! JAPAN July 2011  –  September 2014  (3 years 3 months) Tokyo インフラ技術1部　部長 Steering Committee Japan Data Center Council January 2009  –  May 2014  (5 years 5 months) Japan Technical Director of Development Division Yahoo! JAPAN April 2013  –  March 2014  (1 year) Manager, IT Strategy Yahoo! JAPAN July 2010  –  September 2013  (3 years 3 months) Japan Blackbelt in network Yahoo! JAPAN July 2012  –  June 2013  (1 year) Tokyo Senior Manager of Infrastructure technology department Yahoo! JAPAN July 2011  –  March 2013  (1 year 9 months) Manager, System Administrations Yahoo! JAPAN January 2010  –  March 2012  (2 years 3 months) Japan Security Committee Yahoo! JAPAN July 2008  –  March 2012  (3 years 9 months) Japan Senior manager of Site Operations Yahoo! JAPAN April 2008  –  June 2011  (3 years 3 months) Manage Datacenter, Networking, Strorage, System Administration. Board member BBIX, Inc June 2009  –  June 2010  (1 year 1 month) Manager, Datacenter Operations Yahoo! JAPAN July 2008  –  December 2008  (6 months) Japan Manager, Network Operations Yahoo! JAPAN April 2007  –  March 2008  (1 year) Network Engineer Yahoo! JAPAN October 2000  –  March 2007  (6 years 6 months) Member of the Board of Directors, EVP, VP of Cloud infrastructure engineering Division YJ America, Inc. 2014  – Present (1 year) Washington state Member of the Board of Directors, EVP, VP of Cloud infrastructure engineering Division YJ America, Inc. 2014  – Present (1 year) Washington state Blackbelt in Datacenter Yahoo! JAPAN October 2014  – Present (11 months) Blackbelt in Datacenter Yahoo! JAPAN October 2014  – Present (11 months) Vice President and Technical Director , Infrastructure engineering Division Yahoo! JAPAN April 2014  –  September 2014  (6 months) Tokyo サイトオペレーション本部　本部長 Vice President and Technical Director , Infrastructure engineering Division Yahoo! JAPAN April 2014  –  September 2014  (6 months) Tokyo サイトオペレーション本部　本部長 Senior Manager, Infrastructure engineering Department Yahoo! JAPAN July 2011  –  September 2014  (3 years 3 months) Tokyo インフラ技術1部　部長 Senior Manager, Infrastructure engineering Department Yahoo! JAPAN July 2011  –  September 2014  (3 years 3 months) Tokyo インフラ技術1部　部長 Steering Committee Japan Data Center Council January 2009  –  May 2014  (5 years 5 months) Japan Steering Committee Japan Data Center Council January 2009  –  May 2014  (5 years 5 months) Japan Technical Director of Development Division Yahoo! JAPAN April 2013  –  March 2014  (1 year) Technical Director of Development Division Yahoo! JAPAN April 2013  –  March 2014  (1 year) Manager, IT Strategy Yahoo! JAPAN July 2010  –  September 2013  (3 years 3 months) Japan Manager, IT Strategy Yahoo! JAPAN July 2010  –  September 2013  (3 years 3 months) Japan Blackbelt in network Yahoo! JAPAN July 2012  –  June 2013  (1 year) Tokyo Blackbelt in network Yahoo! JAPAN July 2012  –  June 2013  (1 year) Tokyo Senior Manager of Infrastructure technology department Yahoo! JAPAN July 2011  –  March 2013  (1 year 9 months) Senior Manager of Infrastructure technology department Yahoo! JAPAN July 2011  –  March 2013  (1 year 9 months) Manager, System Administrations Yahoo! JAPAN January 2010  –  March 2012  (2 years 3 months) Japan Manager, System Administrations Yahoo! JAPAN January 2010  –  March 2012  (2 years 3 months) Japan Security Committee Yahoo! JAPAN July 2008  –  March 2012  (3 years 9 months) Japan Security Committee Yahoo! JAPAN July 2008  –  March 2012  (3 years 9 months) Japan Senior manager of Site Operations Yahoo! JAPAN April 2008  –  June 2011  (3 years 3 months) Manage Datacenter, Networking, Strorage, System Administration. Senior manager of Site Operations Yahoo! JAPAN April 2008  –  June 2011  (3 years 3 months) Manage Datacenter, Networking, Strorage, System Administration. Board member BBIX, Inc June 2009  –  June 2010  (1 year 1 month) Board member BBIX, Inc June 2009  –  June 2010  (1 year 1 month) Manager, Datacenter Operations Yahoo! JAPAN July 2008  –  December 2008  (6 months) Japan Manager, Datacenter Operations Yahoo! JAPAN July 2008  –  December 2008  (6 months) Japan Manager, Network Operations Yahoo! JAPAN April 2007  –  March 2008  (1 year) Manager, Network Operations Yahoo! JAPAN April 2007  –  March 2008  (1 year) Network Engineer Yahoo! JAPAN October 2000  –  March 2007  (6 years 6 months) Network Engineer Yahoo! JAPAN October 2000  –  March 2007  (6 years 6 months) Skills Data Center Virtualization Network Design High Availability Cisco IOS IP IT Operations Ethernet Routing IP Networking LAN Switching Routing Protocols JUNOS OTN Ethernet/IP Internet Routing Peering Dark Fiber IP Transit Colocation VPLS RSVP-TE DiffServ Cisco Catalyst Switches CatOS VRF GRE VRRP HSRP RSTP PPPoE 802.1q Spanning Tree Netflow RRDTool Autoconf Firewire Xen QEMU OpenSSH OpenSSL FreeRADIUS Green IT Network Operations RHEL CentOS Kickstart LVM OpenLDAP Openstack See 35+     See less Skills  Data Center Virtualization Network Design High Availability Cisco IOS IP IT Operations Ethernet Routing IP Networking LAN Switching Routing Protocols JUNOS OTN Ethernet/IP Internet Routing Peering Dark Fiber IP Transit Colocation VPLS RSVP-TE DiffServ Cisco Catalyst Switches CatOS VRF GRE VRRP HSRP RSTP PPPoE 802.1q Spanning Tree Netflow RRDTool Autoconf Firewire Xen QEMU OpenSSH OpenSSL FreeRADIUS Green IT Network Operations RHEL CentOS Kickstart LVM OpenLDAP Openstack See 35+     See less Data Center Virtualization Network Design High Availability Cisco IOS IP IT Operations Ethernet Routing IP Networking LAN Switching Routing Protocols JUNOS OTN Ethernet/IP Internet Routing Peering Dark Fiber IP Transit Colocation VPLS RSVP-TE DiffServ Cisco Catalyst Switches CatOS VRF GRE VRRP HSRP RSTP PPPoE 802.1q Spanning Tree Netflow RRDTool Autoconf Firewire Xen QEMU OpenSSH OpenSSL FreeRADIUS Green IT Network Operations RHEL CentOS Kickstart LVM OpenLDAP Openstack See 35+     See less Data Center Virtualization Network Design High Availability Cisco IOS IP IT Operations Ethernet Routing IP Networking LAN Switching Routing Protocols JUNOS OTN Ethernet/IP Internet Routing Peering Dark Fiber IP Transit Colocation VPLS RSVP-TE DiffServ Cisco Catalyst Switches CatOS VRF GRE VRRP HSRP RSTP PPPoE 802.1q Spanning Tree Netflow RRDTool Autoconf Firewire Xen QEMU OpenSSH OpenSSL FreeRADIUS Green IT Network Operations RHEL CentOS Kickstart LVM OpenLDAP Openstack See 35+     See less ", "Experience Senior Manager of Engineering Yahoo October 2014  – Present (11 months) Sunnyvale, California, US Search Ads Optimization Senior Manager of Engineering Yahoo June 2010  –  October 2014  (4 years 5 months) Beijing City, China 1. Search Ads Optimization \n2. Personalization Platform (Recommendation) \n3. Traffic Protection (Anti-spam) \n4. Publisher Quality (Anti-spam) \n5. S4 - map-reduce-like stream processing platform @ Apache \nhttp://incubator.apache.org/s4/ SDE Microsoft July 2007  –  June 2010  (3 years) Beijing City, China Senior Manager of Engineering Yahoo October 2014  – Present (11 months) Sunnyvale, California, US Search Ads Optimization Senior Manager of Engineering Yahoo October 2014  – Present (11 months) Sunnyvale, California, US Search Ads Optimization Senior Manager of Engineering Yahoo June 2010  –  October 2014  (4 years 5 months) Beijing City, China 1. Search Ads Optimization \n2. Personalization Platform (Recommendation) \n3. Traffic Protection (Anti-spam) \n4. Publisher Quality (Anti-spam) \n5. S4 - map-reduce-like stream processing platform @ Apache \nhttp://incubator.apache.org/s4/ Senior Manager of Engineering Yahoo June 2010  –  October 2014  (4 years 5 months) Beijing City, China 1. Search Ads Optimization \n2. Personalization Platform (Recommendation) \n3. Traffic Protection (Anti-spam) \n4. Publisher Quality (Anti-spam) \n5. S4 - map-reduce-like stream processing platform @ Apache \nhttp://incubator.apache.org/s4/ SDE Microsoft July 2007  –  June 2010  (3 years) Beijing City, China SDE Microsoft July 2007  –  June 2010  (3 years) Beijing City, China Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Distributed Systems Cloud Computing Hadoop Scrum Python Java C# Multithreading Perl Agile Web Services MapReduce Stream Processing Recommender Systems Personalization Linux Software Engineering Agile Methodologies Software Design Algorithms Scalability Shell Scripting Object Oriented Design Machine Learning Big Data Ruby Software Development Design Patterns Data Mining See 14+     See less Skills  Distributed Systems Cloud Computing Hadoop Scrum Python Java C# Multithreading Perl Agile Web Services MapReduce Stream Processing Recommender Systems Personalization Linux Software Engineering Agile Methodologies Software Design Algorithms Scalability Shell Scripting Object Oriented Design Machine Learning Big Data Ruby Software Development Design Patterns Data Mining See 14+     See less Distributed Systems Cloud Computing Hadoop Scrum Python Java C# Multithreading Perl Agile Web Services MapReduce Stream Processing Recommender Systems Personalization Linux Software Engineering Agile Methodologies Software Design Algorithms Scalability Shell Scripting Object Oriented Design Machine Learning Big Data Ruby Software Development Design Patterns Data Mining See 14+     See less Distributed Systems Cloud Computing Hadoop Scrum Python Java C# Multithreading Perl Agile Web Services MapReduce Stream Processing Recommender Systems Personalization Linux Software Engineering Agile Methodologies Software Design Algorithms Scalability Shell Scripting Object Oriented Design Machine Learning Big Data Ruby Software Development Design Patterns Data Mining See 14+     See less Education Chinese Academy Of Sciences Master,  Computer Software and Theory 2004  – 2007 Wuhan University Bachelor of Engineering (B.Eng.),  Computer Science 2000  – 2004 Chinese Academy Of Sciences Master,  Computer Software and Theory 2004  – 2007 Chinese Academy Of Sciences Master,  Computer Software and Theory 2004  – 2007 Chinese Academy Of Sciences Master,  Computer Software and Theory 2004  – 2007 Wuhan University Bachelor of Engineering (B.Eng.),  Computer Science 2000  – 2004 Wuhan University Bachelor of Engineering (B.Eng.),  Computer Science 2000  – 2004 Wuhan University Bachelor of Engineering (B.Eng.),  Computer Science 2000  – 2004 ", "Experience Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Vice President, Information Systems Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, System Management Group Yahoo! JAPAN October 2014  – Present (11 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Technical Director, Map Innovation Center Yahoo! JAPAN April 2013  –  September 2014  (1 year 6 months) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Technical Director Offiice, Map Innovation Center Yahoo! JAPAN April 2013  –  March 2014  (1 year) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN October 2012  –  March 2013  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Geographic Platform Unit Yahoo! JAPAN April 2012  –  September 2012  (6 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Manager, Location Platform Service Yahoo! JAPAN April 2012  –  June 2012  (3 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Osaka Engineering, Frontend Division Yahoo! JAPAN January 2012  –  June 2012  (6 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Technical Director, Map Engineering, Platform Division Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Location Platform Yahoo! JAPAN July 2011  –  March 2012  (9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Local Platform Yahoo! JAPAN July 2010  –  March 2012  (1 year 9 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Project Manager, Map Platform Yahoo! JAPAN April 2008  –  September 2011  (3 years 6 months) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Platform Division Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) Senior Manager, Map Engineering, Local Business Unit Yahoo! JAPAN April 2008  –  March 2009  (1 year) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) General Manager, Engineering ALPS Mapping K.K. July 2006  –  March 2008  (1 year 9 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Co-Founder, Managing Director and COO E-Solution Service Inc. February 2001  –  June 2006  (5 years 5 months) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Director and CIO Digital Factory Japan January 2000  –  December 2000  (1 year) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Engineer, Information Systems ALPS Mapping K.K. April 1998  –  December 1999  (1 year 9 months) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Programer, Information Systems ALPS Mapping, K.K. March 1993  –  March 1998  (5 years 1 month) Skills Mobile Devices GIS Perl Skills  Mobile Devices GIS Perl Mobile Devices GIS Perl Mobile Devices GIS Perl Education Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 Nagoya Institute of Technology Bachelor of Engineering,  Electrical Engineering and Computer Science 1993  – 1998 ", "Experience EMEA Search Operations Senior Manager Yahoo April 2015  – Present (5 months) Dublin EMEA Search Operations Manager Yahoo! January 2013  – Present (2 years 8 months) Dublin •\tLead responsibility for the day-to-day running of the Search Operations team, managing and maintaining a superior level of service whilst owning and reporting on team and individual KPI’s \n•\tLead team in Sales, Technical and Escalation support for all Search sales team in EMEA \n•\tWork with Search leaders across EMEA to set and promote the vision and goals for the Search Operations team as a whole and execute strategy \n•\tCollaborate with peer group across Regions to ensure a consistent approach in all operational aspects \n•\tMain decision maker on all operations process and policy approvals \n•\tEnsure continuous performance management and development within the teams \n•\tDrive relevant Yahoo! projects considering all operational aspects and communicating preferred process across the group \n•\tLiaise with Microsoft regarding the Search Alliance partnership and tiering of Customers.  \n•\tIncrease operational performance Q on Q and overall effectiveness of the Team; develop and implement solutions and define strategies and the roadmap to get there \n•\tMaintain an up to date understanding of market/industry trends EU SMB Search Marketing Manager Yahoo! January 2012  –  January 2013  (1 year 1 month) Ireland Manage EU Markets for small to medium business. \nDirectly manage a staff of 11 account managers and Creative’s \nConstantly innovate and develop sales strategies across several markets for blue chip companies. \nEnsures that quarterly and annual new booking goals are met by assigned team; supports individual rep's booking goals by providing the training, support, and tools necessary to maximize growth \nTrack and analyse all sales related activities including call activity levels, account management, new account development, sales and prospect reporting processes. \nProvide direction regarding sales behaviours, appropriate coaching and guidance for sales reps to improve performance. Addresses performance issues and provides on-going and corrective feedback in a timely and constructive manner. SMB Search Acquisition Manager Yahoo! November 2010  –  January 2012  (1 year 3 months) Dublin - Directly manage a growing team of Account Executives focused on acquiring new business in PPC. \n- Provide sales mentorship and elevate the team’s abilities to manage and close revenue \n- Constantly innovate ways to balance sales opportunities, client management, and new customer online needs \n- Manage an experienced group of Account executives working on Agency development to grow business and encourage best practices in Yahoo Search Senior Account Manager Yahoo! April 2010  –  November 2010  (8 months) Built up a brand new sales team, from developing processes to interviewing and hiring staff and setting, benchmarking targets. \nCoaching the new sales team in outbound cold calling \nDeveloping and maintaining a sales pipeline. \nPPC account manager for new Business with serious growth potential, recommending best practices and influencing clients marketing strategies and Budget. Account Manager Yahoo! November 2008  –  April 2010  (1 year 6 months) Portfolio of 160+ UK/IRE based clients \nBusiness Relationship Development of current and dormant client accounts. \nClient and Marketing event visits around the UK and Ireland. \nProviding ongoing sales support to client base for online campaigns in all sectors: Gambling, Adult, Retail, Financial, travel and Entertainment.  \nProviding Strategic advice & help with resolve of financial issues Direct Sales Rep Magnet Networks 2006  –  2007  (1 year) While working for Magnet, My sales role involved inbound and outbound sales calls and following up on potential leads. The main area of sales was broadband to residential homes but also involved telephone and TV services. Sales Consultant Carole Nash Insurance 2005  –  2006  (1 year) Worked both on the Sales team and the Renewal team in my time with Carole Nash. This enabled myself to experience all factors of the sales process. Outbound and inbound calling selling motorbike insurance, Customer retention, handling and overcoming objections from consumers. EMEA Search Operations Senior Manager Yahoo April 2015  – Present (5 months) Dublin EMEA Search Operations Senior Manager Yahoo April 2015  – Present (5 months) Dublin EMEA Search Operations Manager Yahoo! January 2013  – Present (2 years 8 months) Dublin •\tLead responsibility for the day-to-day running of the Search Operations team, managing and maintaining a superior level of service whilst owning and reporting on team and individual KPI’s \n•\tLead team in Sales, Technical and Escalation support for all Search sales team in EMEA \n•\tWork with Search leaders across EMEA to set and promote the vision and goals for the Search Operations team as a whole and execute strategy \n•\tCollaborate with peer group across Regions to ensure a consistent approach in all operational aspects \n•\tMain decision maker on all operations process and policy approvals \n•\tEnsure continuous performance management and development within the teams \n•\tDrive relevant Yahoo! projects considering all operational aspects and communicating preferred process across the group \n•\tLiaise with Microsoft regarding the Search Alliance partnership and tiering of Customers.  \n•\tIncrease operational performance Q on Q and overall effectiveness of the Team; develop and implement solutions and define strategies and the roadmap to get there \n•\tMaintain an up to date understanding of market/industry trends EMEA Search Operations Manager Yahoo! January 2013  – Present (2 years 8 months) Dublin •\tLead responsibility for the day-to-day running of the Search Operations team, managing and maintaining a superior level of service whilst owning and reporting on team and individual KPI’s \n•\tLead team in Sales, Technical and Escalation support for all Search sales team in EMEA \n•\tWork with Search leaders across EMEA to set and promote the vision and goals for the Search Operations team as a whole and execute strategy \n•\tCollaborate with peer group across Regions to ensure a consistent approach in all operational aspects \n•\tMain decision maker on all operations process and policy approvals \n•\tEnsure continuous performance management and development within the teams \n•\tDrive relevant Yahoo! projects considering all operational aspects and communicating preferred process across the group \n•\tLiaise with Microsoft regarding the Search Alliance partnership and tiering of Customers.  \n•\tIncrease operational performance Q on Q and overall effectiveness of the Team; develop and implement solutions and define strategies and the roadmap to get there \n•\tMaintain an up to date understanding of market/industry trends EU SMB Search Marketing Manager Yahoo! January 2012  –  January 2013  (1 year 1 month) Ireland Manage EU Markets for small to medium business. \nDirectly manage a staff of 11 account managers and Creative’s \nConstantly innovate and develop sales strategies across several markets for blue chip companies. \nEnsures that quarterly and annual new booking goals are met by assigned team; supports individual rep's booking goals by providing the training, support, and tools necessary to maximize growth \nTrack and analyse all sales related activities including call activity levels, account management, new account development, sales and prospect reporting processes. \nProvide direction regarding sales behaviours, appropriate coaching and guidance for sales reps to improve performance. Addresses performance issues and provides on-going and corrective feedback in a timely and constructive manner. EU SMB Search Marketing Manager Yahoo! January 2012  –  January 2013  (1 year 1 month) Ireland Manage EU Markets for small to medium business. \nDirectly manage a staff of 11 account managers and Creative’s \nConstantly innovate and develop sales strategies across several markets for blue chip companies. \nEnsures that quarterly and annual new booking goals are met by assigned team; supports individual rep's booking goals by providing the training, support, and tools necessary to maximize growth \nTrack and analyse all sales related activities including call activity levels, account management, new account development, sales and prospect reporting processes. \nProvide direction regarding sales behaviours, appropriate coaching and guidance for sales reps to improve performance. Addresses performance issues and provides on-going and corrective feedback in a timely and constructive manner. SMB Search Acquisition Manager Yahoo! November 2010  –  January 2012  (1 year 3 months) Dublin - Directly manage a growing team of Account Executives focused on acquiring new business in PPC. \n- Provide sales mentorship and elevate the team’s abilities to manage and close revenue \n- Constantly innovate ways to balance sales opportunities, client management, and new customer online needs \n- Manage an experienced group of Account executives working on Agency development to grow business and encourage best practices in Yahoo Search SMB Search Acquisition Manager Yahoo! November 2010  –  January 2012  (1 year 3 months) Dublin - Directly manage a growing team of Account Executives focused on acquiring new business in PPC. \n- Provide sales mentorship and elevate the team’s abilities to manage and close revenue \n- Constantly innovate ways to balance sales opportunities, client management, and new customer online needs \n- Manage an experienced group of Account executives working on Agency development to grow business and encourage best practices in Yahoo Search Senior Account Manager Yahoo! April 2010  –  November 2010  (8 months) Built up a brand new sales team, from developing processes to interviewing and hiring staff and setting, benchmarking targets. \nCoaching the new sales team in outbound cold calling \nDeveloping and maintaining a sales pipeline. \nPPC account manager for new Business with serious growth potential, recommending best practices and influencing clients marketing strategies and Budget. Senior Account Manager Yahoo! April 2010  –  November 2010  (8 months) Built up a brand new sales team, from developing processes to interviewing and hiring staff and setting, benchmarking targets. \nCoaching the new sales team in outbound cold calling \nDeveloping and maintaining a sales pipeline. \nPPC account manager for new Business with serious growth potential, recommending best practices and influencing clients marketing strategies and Budget. Account Manager Yahoo! November 2008  –  April 2010  (1 year 6 months) Portfolio of 160+ UK/IRE based clients \nBusiness Relationship Development of current and dormant client accounts. \nClient and Marketing event visits around the UK and Ireland. \nProviding ongoing sales support to client base for online campaigns in all sectors: Gambling, Adult, Retail, Financial, travel and Entertainment.  \nProviding Strategic advice & help with resolve of financial issues Account Manager Yahoo! November 2008  –  April 2010  (1 year 6 months) Portfolio of 160+ UK/IRE based clients \nBusiness Relationship Development of current and dormant client accounts. \nClient and Marketing event visits around the UK and Ireland. \nProviding ongoing sales support to client base for online campaigns in all sectors: Gambling, Adult, Retail, Financial, travel and Entertainment.  \nProviding Strategic advice & help with resolve of financial issues Direct Sales Rep Magnet Networks 2006  –  2007  (1 year) While working for Magnet, My sales role involved inbound and outbound sales calls and following up on potential leads. The main area of sales was broadband to residential homes but also involved telephone and TV services. Direct Sales Rep Magnet Networks 2006  –  2007  (1 year) While working for Magnet, My sales role involved inbound and outbound sales calls and following up on potential leads. The main area of sales was broadband to residential homes but also involved telephone and TV services. Sales Consultant Carole Nash Insurance 2005  –  2006  (1 year) Worked both on the Sales team and the Renewal team in my time with Carole Nash. This enabled myself to experience all factors of the sales process. Outbound and inbound calling selling motorbike insurance, Customer retention, handling and overcoming objections from consumers. Sales Consultant Carole Nash Insurance 2005  –  2006  (1 year) Worked both on the Sales team and the Renewal team in my time with Carole Nash. This enabled myself to experience all factors of the sales process. Outbound and inbound calling selling motorbike insurance, Customer retention, handling and overcoming objections from consumers. Skills Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Skills  Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Education Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 ", "Skills Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less Skills  Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less ", "Experience Senior Product Marketing Manager Yahoo November 2014  – Present (10 months) Greater New York City Area As the product marketing manager for Yahoo News and Yahoo Tech, I partner closely with Yahoo sales, editorial and business leaders, as well as partner marketing teams (Insights, PR, Creative, CRM, Social, etc.), to develop marketing campaigns that support revenue and engagement goals and are critical to Yahoo’s success. I balance the needs and goals of the programs launched in the Americas region with the needs and goals of our product development partners and marketers in Yahoo’s other global regions, supporting international rollouts of launches as necessary. Board Member, Yahoo Employee Foundation (YEF) Yahoo February 2014  – Present (1 year 7 months) Founded by Yahoo employees in 1999 with leadership from David Filo and Jerry Yang, the Yahoo Employee Foundation is a grassroots, philanthropic organization that gives Yahoo employees easy and accessible ways to give back to their communities. \n \nYEF provides Yahoos opportunities to donate time, talent, and money to benefit local non-profit organizations and charities. This occurs in two main ways: 1) throughout the year YEF organizes volunteer events and seasonal donation drives (school backpacks, holiday gifts, etc.); and 2) YEF grants money to nonprofit organizations with programs that address issues of concern to Yahoos.  \n \nYEF is 100% employee run by Yahoos who volunteer their time to serve on various committees. The US-based YEF Advisory Board is currently comprised of 17 Yahoos who run the day-to-day operations of YEF and contribute to a wide array of viewpoints to the the direction of the Foundation. Additionally, YEF has committees and chapters in the US, EMEA, India and APAC. News Lead - Senior Manager, Media Solutions Yahoo November 2013  –  November 2014  (1 year 1 month) New York I was responsible for monetization, packaging and sales strategy for Yahoo News - the #1 news network online - inclusive of Yahoo News and Yahoo Tech. Senior Manager, Media Solutions - Y! News Yahoo! February 2012  –  November 2013  (1 year 10 months) Greater New York City Area In this role, I was an online marketing expert responsible for implementing strategic direction to increase monetization of Yahoo News. I cultivated strong relationships across internal business units and with our ABC News partners to develop and implement the go-to-market framework for our video franchises, which included: ongoing review of packaging, pricing, sales collateral, editorial concept development, troubleshooting ad delivery issues and overall process implementation.  \n \nThis role leveraged strong marketing expertise, creativity and strategic vision to drive revenue by creating compelling value propositions and communicating persuasive stories to the Yahoo sales force and our marketer clients through engaging sales materials. \n \nMy primary role is was as the business owner for Yahoo! News: Video includes owning the Yahoo & ABC News partnership – which consists of co-produced original video programs and as-needed support for Good Morning America on Yahoo - and Yahoo Original Video programming. In this position, I developed and grew the Yahoo News Video franchise by executing strategic and tactical sales support initiatives, product positioning, ad program development and driving revenue. Additionally, I worked closely with internal and external partners to manage pipelines and market demand/feedback, editorial teams on program development and ideation, and worked with reporting and ad operations to ensure successful program and process management. Senior Manager, Strategic Development: Y! Content Solutions Yahoo! October 2011  –  February 2012  (5 months) Greater New York City Area In this role I was dedicated to creating powerful ideas, creative solutions and unique brand-defining opportunities for Yahoo’s advertising partners across a breadth of categories around tentpoles, anchors and events. These include but are not limited to, Olympics, Super Bowl, Elections, Awards Shows, and more.  \n \nI partnered closely with key stakeholders across the company including but not limited to, editorial, property leads, creative services, social marketing, video and product teams to create memorable, customized, best in class consumer and advertiser experiences. \n \nMy role was to help set strategy and leadership to promote Yahoo! as THE place to be for big events. Promotions Manager Disney Interactive Media Group April 2011  –  October 2011  (7 months) Greater New York City Area My role was responsible for assisting in the creation of new marketing opportunities and promotional ad products that enabled the ad sales team to sell progressive digital advertising solutions (both to external advertisers and Disney affiliated advertisers). I worked closely with the sales team to drive promotions and sales strategies and tactics for all Disney Interactive Media Group properties including: Disney.com, Disneychannel.com, DisneyXD.com and the Family Network of Sites as well as mobile and social gaming . Additionally, I worked with the Disney Media Sales & Marketing cross-platform campaign development team - which included TV, Radio and Print teams - for creation and execution of cross platform programs. \n \nMy daily responsibilities included ideating and developing digital marketing/promotion concepts, aiding in organization of team communications both internally amongst the Marketing & Promotions team as well as to the NY sales team and working closely with editorial teams, legal and ad opps teams as needed. Additionally, I was the marketing 'Kids' expert and was the go-to person for kid targeted campaigns, stayed up-to-date on the rules and regulations around advertising to kids and provided my team with regular competitive analysis to ensure we were competitive in the Kids marketplace. Associate Promotions Manager Disney Interactive Media Group October 2009  –  April 2011  (1 year 7 months) Greater New York City Area Associate Marketing Manager FamilyFun Magazine Disney Publishing Worldwide February 2008  –  October 2009  (1 year 9 months) Greater New York City Area Marketing Coordinator - FamilyFun Magazine The Walt Disney Company March 2007  –  February 2008  (1 year) Greater New York City Area Undergraduate Associate Disney Consumer Products August 2006  –  March 2007  (8 months) Greater Los Angeles Area Senior Product Marketing Manager Yahoo November 2014  – Present (10 months) Greater New York City Area As the product marketing manager for Yahoo News and Yahoo Tech, I partner closely with Yahoo sales, editorial and business leaders, as well as partner marketing teams (Insights, PR, Creative, CRM, Social, etc.), to develop marketing campaigns that support revenue and engagement goals and are critical to Yahoo’s success. I balance the needs and goals of the programs launched in the Americas region with the needs and goals of our product development partners and marketers in Yahoo’s other global regions, supporting international rollouts of launches as necessary. Senior Product Marketing Manager Yahoo November 2014  – Present (10 months) Greater New York City Area As the product marketing manager for Yahoo News and Yahoo Tech, I partner closely with Yahoo sales, editorial and business leaders, as well as partner marketing teams (Insights, PR, Creative, CRM, Social, etc.), to develop marketing campaigns that support revenue and engagement goals and are critical to Yahoo’s success. I balance the needs and goals of the programs launched in the Americas region with the needs and goals of our product development partners and marketers in Yahoo’s other global regions, supporting international rollouts of launches as necessary. Board Member, Yahoo Employee Foundation (YEF) Yahoo February 2014  – Present (1 year 7 months) Founded by Yahoo employees in 1999 with leadership from David Filo and Jerry Yang, the Yahoo Employee Foundation is a grassroots, philanthropic organization that gives Yahoo employees easy and accessible ways to give back to their communities. \n \nYEF provides Yahoos opportunities to donate time, talent, and money to benefit local non-profit organizations and charities. This occurs in two main ways: 1) throughout the year YEF organizes volunteer events and seasonal donation drives (school backpacks, holiday gifts, etc.); and 2) YEF grants money to nonprofit organizations with programs that address issues of concern to Yahoos.  \n \nYEF is 100% employee run by Yahoos who volunteer their time to serve on various committees. The US-based YEF Advisory Board is currently comprised of 17 Yahoos who run the day-to-day operations of YEF and contribute to a wide array of viewpoints to the the direction of the Foundation. Additionally, YEF has committees and chapters in the US, EMEA, India and APAC. Board Member, Yahoo Employee Foundation (YEF) Yahoo February 2014  – Present (1 year 7 months) Founded by Yahoo employees in 1999 with leadership from David Filo and Jerry Yang, the Yahoo Employee Foundation is a grassroots, philanthropic organization that gives Yahoo employees easy and accessible ways to give back to their communities. \n \nYEF provides Yahoos opportunities to donate time, talent, and money to benefit local non-profit organizations and charities. This occurs in two main ways: 1) throughout the year YEF organizes volunteer events and seasonal donation drives (school backpacks, holiday gifts, etc.); and 2) YEF grants money to nonprofit organizations with programs that address issues of concern to Yahoos.  \n \nYEF is 100% employee run by Yahoos who volunteer their time to serve on various committees. The US-based YEF Advisory Board is currently comprised of 17 Yahoos who run the day-to-day operations of YEF and contribute to a wide array of viewpoints to the the direction of the Foundation. Additionally, YEF has committees and chapters in the US, EMEA, India and APAC. News Lead - Senior Manager, Media Solutions Yahoo November 2013  –  November 2014  (1 year 1 month) New York I was responsible for monetization, packaging and sales strategy for Yahoo News - the #1 news network online - inclusive of Yahoo News and Yahoo Tech. News Lead - Senior Manager, Media Solutions Yahoo November 2013  –  November 2014  (1 year 1 month) New York I was responsible for monetization, packaging and sales strategy for Yahoo News - the #1 news network online - inclusive of Yahoo News and Yahoo Tech. Senior Manager, Media Solutions - Y! News Yahoo! February 2012  –  November 2013  (1 year 10 months) Greater New York City Area In this role, I was an online marketing expert responsible for implementing strategic direction to increase monetization of Yahoo News. I cultivated strong relationships across internal business units and with our ABC News partners to develop and implement the go-to-market framework for our video franchises, which included: ongoing review of packaging, pricing, sales collateral, editorial concept development, troubleshooting ad delivery issues and overall process implementation.  \n \nThis role leveraged strong marketing expertise, creativity and strategic vision to drive revenue by creating compelling value propositions and communicating persuasive stories to the Yahoo sales force and our marketer clients through engaging sales materials. \n \nMy primary role is was as the business owner for Yahoo! News: Video includes owning the Yahoo & ABC News partnership – which consists of co-produced original video programs and as-needed support for Good Morning America on Yahoo - and Yahoo Original Video programming. In this position, I developed and grew the Yahoo News Video franchise by executing strategic and tactical sales support initiatives, product positioning, ad program development and driving revenue. Additionally, I worked closely with internal and external partners to manage pipelines and market demand/feedback, editorial teams on program development and ideation, and worked with reporting and ad operations to ensure successful program and process management. Senior Manager, Media Solutions - Y! News Yahoo! February 2012  –  November 2013  (1 year 10 months) Greater New York City Area In this role, I was an online marketing expert responsible for implementing strategic direction to increase monetization of Yahoo News. I cultivated strong relationships across internal business units and with our ABC News partners to develop and implement the go-to-market framework for our video franchises, which included: ongoing review of packaging, pricing, sales collateral, editorial concept development, troubleshooting ad delivery issues and overall process implementation.  \n \nThis role leveraged strong marketing expertise, creativity and strategic vision to drive revenue by creating compelling value propositions and communicating persuasive stories to the Yahoo sales force and our marketer clients through engaging sales materials. \n \nMy primary role is was as the business owner for Yahoo! News: Video includes owning the Yahoo & ABC News partnership – which consists of co-produced original video programs and as-needed support for Good Morning America on Yahoo - and Yahoo Original Video programming. In this position, I developed and grew the Yahoo News Video franchise by executing strategic and tactical sales support initiatives, product positioning, ad program development and driving revenue. Additionally, I worked closely with internal and external partners to manage pipelines and market demand/feedback, editorial teams on program development and ideation, and worked with reporting and ad operations to ensure successful program and process management. Senior Manager, Strategic Development: Y! Content Solutions Yahoo! October 2011  –  February 2012  (5 months) Greater New York City Area In this role I was dedicated to creating powerful ideas, creative solutions and unique brand-defining opportunities for Yahoo’s advertising partners across a breadth of categories around tentpoles, anchors and events. These include but are not limited to, Olympics, Super Bowl, Elections, Awards Shows, and more.  \n \nI partnered closely with key stakeholders across the company including but not limited to, editorial, property leads, creative services, social marketing, video and product teams to create memorable, customized, best in class consumer and advertiser experiences. \n \nMy role was to help set strategy and leadership to promote Yahoo! as THE place to be for big events. Senior Manager, Strategic Development: Y! Content Solutions Yahoo! October 2011  –  February 2012  (5 months) Greater New York City Area In this role I was dedicated to creating powerful ideas, creative solutions and unique brand-defining opportunities for Yahoo’s advertising partners across a breadth of categories around tentpoles, anchors and events. These include but are not limited to, Olympics, Super Bowl, Elections, Awards Shows, and more.  \n \nI partnered closely with key stakeholders across the company including but not limited to, editorial, property leads, creative services, social marketing, video and product teams to create memorable, customized, best in class consumer and advertiser experiences. \n \nMy role was to help set strategy and leadership to promote Yahoo! as THE place to be for big events. Promotions Manager Disney Interactive Media Group April 2011  –  October 2011  (7 months) Greater New York City Area My role was responsible for assisting in the creation of new marketing opportunities and promotional ad products that enabled the ad sales team to sell progressive digital advertising solutions (both to external advertisers and Disney affiliated advertisers). I worked closely with the sales team to drive promotions and sales strategies and tactics for all Disney Interactive Media Group properties including: Disney.com, Disneychannel.com, DisneyXD.com and the Family Network of Sites as well as mobile and social gaming . Additionally, I worked with the Disney Media Sales & Marketing cross-platform campaign development team - which included TV, Radio and Print teams - for creation and execution of cross platform programs. \n \nMy daily responsibilities included ideating and developing digital marketing/promotion concepts, aiding in organization of team communications both internally amongst the Marketing & Promotions team as well as to the NY sales team and working closely with editorial teams, legal and ad opps teams as needed. Additionally, I was the marketing 'Kids' expert and was the go-to person for kid targeted campaigns, stayed up-to-date on the rules and regulations around advertising to kids and provided my team with regular competitive analysis to ensure we were competitive in the Kids marketplace. Promotions Manager Disney Interactive Media Group April 2011  –  October 2011  (7 months) Greater New York City Area My role was responsible for assisting in the creation of new marketing opportunities and promotional ad products that enabled the ad sales team to sell progressive digital advertising solutions (both to external advertisers and Disney affiliated advertisers). I worked closely with the sales team to drive promotions and sales strategies and tactics for all Disney Interactive Media Group properties including: Disney.com, Disneychannel.com, DisneyXD.com and the Family Network of Sites as well as mobile and social gaming . Additionally, I worked with the Disney Media Sales & Marketing cross-platform campaign development team - which included TV, Radio and Print teams - for creation and execution of cross platform programs. \n \nMy daily responsibilities included ideating and developing digital marketing/promotion concepts, aiding in organization of team communications both internally amongst the Marketing & Promotions team as well as to the NY sales team and working closely with editorial teams, legal and ad opps teams as needed. Additionally, I was the marketing 'Kids' expert and was the go-to person for kid targeted campaigns, stayed up-to-date on the rules and regulations around advertising to kids and provided my team with regular competitive analysis to ensure we were competitive in the Kids marketplace. Associate Promotions Manager Disney Interactive Media Group October 2009  –  April 2011  (1 year 7 months) Greater New York City Area Associate Promotions Manager Disney Interactive Media Group October 2009  –  April 2011  (1 year 7 months) Greater New York City Area Associate Marketing Manager FamilyFun Magazine Disney Publishing Worldwide February 2008  –  October 2009  (1 year 9 months) Greater New York City Area Associate Marketing Manager FamilyFun Magazine Disney Publishing Worldwide February 2008  –  October 2009  (1 year 9 months) Greater New York City Area Marketing Coordinator - FamilyFun Magazine The Walt Disney Company March 2007  –  February 2008  (1 year) Greater New York City Area Marketing Coordinator - FamilyFun Magazine The Walt Disney Company March 2007  –  February 2008  (1 year) Greater New York City Area Undergraduate Associate Disney Consumer Products August 2006  –  March 2007  (8 months) Greater Los Angeles Area Undergraduate Associate Disney Consumer Products August 2006  –  March 2007  (8 months) Greater Los Angeles Area Skills Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Skills  Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Education Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters ", "Experience VP, Planning and Operations, Search Services Yahoo! JAPAN April 2014  – Present (1 year 5 months) VP, Engineering, Search Services Yahoo! JAPAN October 2013  –  March 2014  (6 months) VP, Engineering, Media Services Yahoo! JAPAN July 2012  –  October 2013  (1 year 4 months) Senior Manager, Engineering, Local Media Services Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Senior Manager, Engineering, Business Listing Services Yahoo! Japan April 2009  –  March 2011  (2 years) Senior Manager, System Operations, Business Listing Services Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Engineering, Local Media Services Yahoo! JAPAN April 2007  –  March 2009  (2 years) Senior Manager, Engineering, Search Services Yahoo! JAPAN April 2006  –  March 2007  (1 year) Senior Manager, Engineering, Business Listing Services Yahoo! JAPAN April 2005  –  March 2006  (1 year) Manager, Engineering, Business Listing Services Yahoo! JAPAN July 2000  –  March 2005  (4 years 9 months) VP, Planning and Operations, Search Services Yahoo! JAPAN April 2014  – Present (1 year 5 months) VP, Planning and Operations, Search Services Yahoo! JAPAN April 2014  – Present (1 year 5 months) VP, Engineering, Search Services Yahoo! JAPAN October 2013  –  March 2014  (6 months) VP, Engineering, Search Services Yahoo! JAPAN October 2013  –  March 2014  (6 months) VP, Engineering, Media Services Yahoo! JAPAN July 2012  –  October 2013  (1 year 4 months) VP, Engineering, Media Services Yahoo! JAPAN July 2012  –  October 2013  (1 year 4 months) Senior Manager, Engineering, Local Media Services Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Senior Manager, Engineering, Local Media Services Yahoo! JAPAN April 2011  –  June 2012  (1 year 3 months) Senior Manager, Engineering, Business Listing Services Yahoo! Japan April 2009  –  March 2011  (2 years) Senior Manager, Engineering, Business Listing Services Yahoo! Japan April 2009  –  March 2011  (2 years) Senior Manager, System Operations, Business Listing Services Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, System Operations, Business Listing Services Yahoo! JAPAN April 2009  –  March 2011  (2 years) Senior Manager, Engineering, Local Media Services Yahoo! JAPAN April 2007  –  March 2009  (2 years) Senior Manager, Engineering, Local Media Services Yahoo! JAPAN April 2007  –  March 2009  (2 years) Senior Manager, Engineering, Search Services Yahoo! JAPAN April 2006  –  March 2007  (1 year) Senior Manager, Engineering, Search Services Yahoo! JAPAN April 2006  –  March 2007  (1 year) Senior Manager, Engineering, Business Listing Services Yahoo! JAPAN April 2005  –  March 2006  (1 year) Senior Manager, Engineering, Business Listing Services Yahoo! JAPAN April 2005  –  March 2006  (1 year) Manager, Engineering, Business Listing Services Yahoo! JAPAN July 2000  –  March 2005  (4 years 9 months) Manager, Engineering, Business Listing Services Yahoo! JAPAN July 2000  –  March 2005  (4 years 9 months) Education Nagaoka National College of Technology 1979  – 1984 Nagaoka National College of Technology 1979  – 1984 Nagaoka National College of Technology 1979  – 1984 Nagaoka National College of Technology 1979  – 1984 ", "Summary I serve as the architect and manager for Yahoo's next generation streaming and batch processing systems. Problems I've dealt with focus on increasing scale, reducing latency, improving operability, focusing on customer satisfaction, while driving quality in data and engineering best practices. Systems I've worked on span from streaming to monthly data intervals. The current scale is 100 billion events/40 TB compressed input data per day. Summary I serve as the architect and manager for Yahoo's next generation streaming and batch processing systems. Problems I've dealt with focus on increasing scale, reducing latency, improving operability, focusing on customer satisfaction, while driving quality in data and engineering best practices. Systems I've worked on span from streaming to monthly data intervals. The current scale is 100 billion events/40 TB compressed input data per day. I serve as the architect and manager for Yahoo's next generation streaming and batch processing systems. Problems I've dealt with focus on increasing scale, reducing latency, improving operability, focusing on customer satisfaction, while driving quality in data and engineering best practices. Systems I've worked on span from streaming to monthly data intervals. The current scale is 100 billion events/40 TB compressed input data per day. I serve as the architect and manager for Yahoo's next generation streaming and batch processing systems. Problems I've dealt with focus on increasing scale, reducing latency, improving operability, focusing on customer satisfaction, while driving quality in data and engineering best practices. Systems I've worked on span from streaming to monthly data intervals. The current scale is 100 billion events/40 TB compressed input data per day. Experience Senior Manager/Principal Engineer Yahoo! January 2014  – Present (1 year 8 months) - Chosen to lead both the next generation streaming and batch processing teams \n- Prototyped batch processing with Spark \n- Merged many fragmented data feeds into a single unified feed \n- Designed the sessionization, join, and partitioning framework \n- Created single transformation library to be used by streaming and batch system \n- Created SQL-like DSL (select ... where ...) for creating Kafka Topics in Storm \n- Handled planning and managed quarterly expectations for each team \n- Was an author on four team submissions accepted for Tech Pulse (Yahoo's internal, annual technical conference) \n- Defensive publication on smart partitioning  \n- Patent filed for sessionization methodology \n- Received 2014 Yahoo! Excellent Award for being in the top 10% of the company based on performance Principal Software Engineer Yahoo! March 2012  –  January 2014  (1 year 11 months) - Prototyped processing to publish aggregates for various dimensions to Nielsen \n- Handle training on how to use the team's data feeds and tools \n- Lots of data generation redesign \n- Lead cross team group to come up with and implement new event model \n- Leveraged HBase for large dimensional data look-ups for fact data \n- Most importantly, I was our department's NCAA pool winner in 2012! Senior Software Engineer Yahoo! March 2008  –  March 2012  (4 years 1 month) - Migrated the entire legacy processing stack from in-house mapreduce processing to hadoop mapreduce. Procured an 800 node hadoop cluster. Still maintain backward compatibility by publishing into an off grid filer based warehouse. \n- Handle customer and product support \n- Handle hardware procurement and capacity planning \n- Lots of various distributed data processing (PIG, Hadoop, Yahoo developed systems) \n- Participate in college recruiting \n- 2011 Q4 \"You Rock\" team award \n- 2011 college recruitment award Software Engineer Yahoo! March 2007  –  March 2008  (1 year 1 month) - Created Yahoo's first hourly audience data pipeline, which processed all of Yahoo's user traffic. \n- Created a dependency management tool to help with scheduling of various scripts, mapreduce style jobs, and unix commands. Associate Software Engineer Yahoo! January 2006  –  March 2007  (1 year 3 months) - Migrated Yahoo data processing stack from legacy daily data collection to an in-house near real time system (think Flume/Scribe). \n- Reduced the runtimes of daily processing jobs (10 billion events, 2 TB of data) by several hours. Intern Yahoo! May 2005  –  August 2005  (4 months) - Using Perl and Java, created a daily job that sampled Yahoo's apache logs to analyze the user traffic in order to discover new os and browsers from user-agent strings.  \n- Evaluated third party os and browser classification tools. Intern Yahoo! June 2004  –  August 2004  (3 months) Using PHP and MySQL, created a web based OLAP tool to analyze Yahoo's data warehouse metadata. Senior Manager/Principal Engineer Yahoo! January 2014  – Present (1 year 8 months) - Chosen to lead both the next generation streaming and batch processing teams \n- Prototyped batch processing with Spark \n- Merged many fragmented data feeds into a single unified feed \n- Designed the sessionization, join, and partitioning framework \n- Created single transformation library to be used by streaming and batch system \n- Created SQL-like DSL (select ... where ...) for creating Kafka Topics in Storm \n- Handled planning and managed quarterly expectations for each team \n- Was an author on four team submissions accepted for Tech Pulse (Yahoo's internal, annual technical conference) \n- Defensive publication on smart partitioning  \n- Patent filed for sessionization methodology \n- Received 2014 Yahoo! Excellent Award for being in the top 10% of the company based on performance Senior Manager/Principal Engineer Yahoo! January 2014  – Present (1 year 8 months) - Chosen to lead both the next generation streaming and batch processing teams \n- Prototyped batch processing with Spark \n- Merged many fragmented data feeds into a single unified feed \n- Designed the sessionization, join, and partitioning framework \n- Created single transformation library to be used by streaming and batch system \n- Created SQL-like DSL (select ... where ...) for creating Kafka Topics in Storm \n- Handled planning and managed quarterly expectations for each team \n- Was an author on four team submissions accepted for Tech Pulse (Yahoo's internal, annual technical conference) \n- Defensive publication on smart partitioning  \n- Patent filed for sessionization methodology \n- Received 2014 Yahoo! Excellent Award for being in the top 10% of the company based on performance Principal Software Engineer Yahoo! March 2012  –  January 2014  (1 year 11 months) - Prototyped processing to publish aggregates for various dimensions to Nielsen \n- Handle training on how to use the team's data feeds and tools \n- Lots of data generation redesign \n- Lead cross team group to come up with and implement new event model \n- Leveraged HBase for large dimensional data look-ups for fact data \n- Most importantly, I was our department's NCAA pool winner in 2012! Principal Software Engineer Yahoo! March 2012  –  January 2014  (1 year 11 months) - Prototyped processing to publish aggregates for various dimensions to Nielsen \n- Handle training on how to use the team's data feeds and tools \n- Lots of data generation redesign \n- Lead cross team group to come up with and implement new event model \n- Leveraged HBase for large dimensional data look-ups for fact data \n- Most importantly, I was our department's NCAA pool winner in 2012! Senior Software Engineer Yahoo! March 2008  –  March 2012  (4 years 1 month) - Migrated the entire legacy processing stack from in-house mapreduce processing to hadoop mapreduce. Procured an 800 node hadoop cluster. Still maintain backward compatibility by publishing into an off grid filer based warehouse. \n- Handle customer and product support \n- Handle hardware procurement and capacity planning \n- Lots of various distributed data processing (PIG, Hadoop, Yahoo developed systems) \n- Participate in college recruiting \n- 2011 Q4 \"You Rock\" team award \n- 2011 college recruitment award Senior Software Engineer Yahoo! March 2008  –  March 2012  (4 years 1 month) - Migrated the entire legacy processing stack from in-house mapreduce processing to hadoop mapreduce. Procured an 800 node hadoop cluster. Still maintain backward compatibility by publishing into an off grid filer based warehouse. \n- Handle customer and product support \n- Handle hardware procurement and capacity planning \n- Lots of various distributed data processing (PIG, Hadoop, Yahoo developed systems) \n- Participate in college recruiting \n- 2011 Q4 \"You Rock\" team award \n- 2011 college recruitment award Software Engineer Yahoo! March 2007  –  March 2008  (1 year 1 month) - Created Yahoo's first hourly audience data pipeline, which processed all of Yahoo's user traffic. \n- Created a dependency management tool to help with scheduling of various scripts, mapreduce style jobs, and unix commands. Software Engineer Yahoo! March 2007  –  March 2008  (1 year 1 month) - Created Yahoo's first hourly audience data pipeline, which processed all of Yahoo's user traffic. \n- Created a dependency management tool to help with scheduling of various scripts, mapreduce style jobs, and unix commands. Associate Software Engineer Yahoo! January 2006  –  March 2007  (1 year 3 months) - Migrated Yahoo data processing stack from legacy daily data collection to an in-house near real time system (think Flume/Scribe). \n- Reduced the runtimes of daily processing jobs (10 billion events, 2 TB of data) by several hours. Associate Software Engineer Yahoo! January 2006  –  March 2007  (1 year 3 months) - Migrated Yahoo data processing stack from legacy daily data collection to an in-house near real time system (think Flume/Scribe). \n- Reduced the runtimes of daily processing jobs (10 billion events, 2 TB of data) by several hours. Intern Yahoo! May 2005  –  August 2005  (4 months) - Using Perl and Java, created a daily job that sampled Yahoo's apache logs to analyze the user traffic in order to discover new os and browsers from user-agent strings.  \n- Evaluated third party os and browser classification tools. Intern Yahoo! May 2005  –  August 2005  (4 months) - Using Perl and Java, created a daily job that sampled Yahoo's apache logs to analyze the user traffic in order to discover new os and browsers from user-agent strings.  \n- Evaluated third party os and browser classification tools. Intern Yahoo! June 2004  –  August 2004  (3 months) Using PHP and MySQL, created a web based OLAP tool to analyze Yahoo's data warehouse metadata. Intern Yahoo! June 2004  –  August 2004  (3 months) Using PHP and MySQL, created a web based OLAP tool to analyze Yahoo's data warehouse metadata. Languages English Native or bilingual proficiency Russian Native or bilingual proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Hadoop Distributed Systems Perl MapReduce Unix MySQL Java Web Analytics Apache Pig Shell Scripting Scalability HBase Grid Computing Agile Methodologies Data Management Apache Storm Apache Kafka Hive See 3+     See less Skills  Hadoop Distributed Systems Perl MapReduce Unix MySQL Java Web Analytics Apache Pig Shell Scripting Scalability HBase Grid Computing Agile Methodologies Data Management Apache Storm Apache Kafka Hive See 3+     See less Hadoop Distributed Systems Perl MapReduce Unix MySQL Java Web Analytics Apache Pig Shell Scripting Scalability HBase Grid Computing Agile Methodologies Data Management Apache Storm Apache Kafka Hive See 3+     See less Hadoop Distributed Systems Perl MapReduce Unix MySQL Java Web Analytics Apache Pig Shell Scripting Scalability HBase Grid Computing Agile Methodologies Data Management Apache Storm Apache Kafka Hive See 3+     See less Education Stanford University NDO,  Statistics ,  Computer Science ,  Management Science and Engineering , 4.075 2009  – 2012 Non Degree Option, 12 credits Georgia Institute of Technology BS,  Computer Science ,  Economics (minor) , Graduated Highest Honors (Summa Cum Laude) 2001  – 2005 Campbell High School High School,  International Baccalaureate , Graduated Salutatorian 1997  – 2001 1530 SAT Stanford University NDO,  Statistics ,  Computer Science ,  Management Science and Engineering , 4.075 2009  – 2012 Non Degree Option, 12 credits Stanford University NDO,  Statistics ,  Computer Science ,  Management Science and Engineering , 4.075 2009  – 2012 Non Degree Option, 12 credits Stanford University NDO,  Statistics ,  Computer Science ,  Management Science and Engineering , 4.075 2009  – 2012 Non Degree Option, 12 credits Georgia Institute of Technology BS,  Computer Science ,  Economics (minor) , Graduated Highest Honors (Summa Cum Laude) 2001  – 2005 Georgia Institute of Technology BS,  Computer Science ,  Economics (minor) , Graduated Highest Honors (Summa Cum Laude) 2001  – 2005 Georgia Institute of Technology BS,  Computer Science ,  Economics (minor) , Graduated Highest Honors (Summa Cum Laude) 2001  – 2005 Campbell High School High School,  International Baccalaureate , Graduated Salutatorian 1997  – 2001 1530 SAT Campbell High School High School,  International Baccalaureate , Graduated Salutatorian 1997  – 2001 1530 SAT Campbell High School High School,  International Baccalaureate , Graduated Salutatorian 1997  – 2001 1530 SAT ", "Skills Talent Acquisition Applicant Tracking... Technical Recruiting Onboarding Management Background Checks Search Program Management Team Management Temporary Placement Extending Offers Employee Referral... College Recruiting Professional Services Skills  Talent Acquisition Applicant Tracking... Technical Recruiting Onboarding Management Background Checks Search Program Management Team Management Temporary Placement Extending Offers Employee Referral... College Recruiting Professional Services Talent Acquisition Applicant Tracking... Technical Recruiting Onboarding Management Background Checks Search Program Management Team Management Temporary Placement Extending Offers Employee Referral... College Recruiting Professional Services Talent Acquisition Applicant Tracking... Technical Recruiting Onboarding Management Background Checks Search Program Management Team Management Temporary Placement Extending Offers Employee Referral... College Recruiting Professional Services ", "Experience Senior Manager, Global Partnerships, Publisher Services Yahoo! March 2014  – Present (1 year 6 months) Senior Manager, Channel Sales Yahoo November 2011  –  March 2014  (2 years 5 months) Director Strategic Accounts WebMD November 2010  –  November 2011  (1 year 1 month) Sr. Account Executive Yahoo! April 2008  –  November 2010  (2 years 8 months) Sales Rep Le Chef June 2005  –  April 2008  (2 years 11 months) Senior Manager, Global Partnerships, Publisher Services Yahoo! March 2014  – Present (1 year 6 months) Senior Manager, Global Partnerships, Publisher Services Yahoo! March 2014  – Present (1 year 6 months) Senior Manager, Channel Sales Yahoo November 2011  –  March 2014  (2 years 5 months) Senior Manager, Channel Sales Yahoo November 2011  –  March 2014  (2 years 5 months) Director Strategic Accounts WebMD November 2010  –  November 2011  (1 year 1 month) Director Strategic Accounts WebMD November 2010  –  November 2011  (1 year 1 month) Sr. Account Executive Yahoo! April 2008  –  November 2010  (2 years 8 months) Sr. Account Executive Yahoo! April 2008  –  November 2010  (2 years 8 months) Sales Rep Le Chef June 2005  –  April 2008  (2 years 11 months) Sales Rep Le Chef June 2005  –  April 2008  (2 years 11 months) Skills Sales Strategic Partnerships Salesforce.com Lead Generation Online Advertising Business Development Display Advertising Display Campaigns Direct Sales Sales Presentations Training Miller Heiman Sales... Sales Rep Training Selling Behavioral Targeting Account Management Recruiting Marketing Advertising Sales Sales Management Contract Negotiation Management Sales Operations Strategy Digital Strategy Advertising Mobile Devices CRM See 13+     See less Skills  Sales Strategic Partnerships Salesforce.com Lead Generation Online Advertising Business Development Display Advertising Display Campaigns Direct Sales Sales Presentations Training Miller Heiman Sales... Sales Rep Training Selling Behavioral Targeting Account Management Recruiting Marketing Advertising Sales Sales Management Contract Negotiation Management Sales Operations Strategy Digital Strategy Advertising Mobile Devices CRM See 13+     See less Sales Strategic Partnerships Salesforce.com Lead Generation Online Advertising Business Development Display Advertising Display Campaigns Direct Sales Sales Presentations Training Miller Heiman Sales... Sales Rep Training Selling Behavioral Targeting Account Management Recruiting Marketing Advertising Sales Sales Management Contract Negotiation Management Sales Operations Strategy Digital Strategy Advertising Mobile Devices CRM See 13+     See less Sales Strategic Partnerships Salesforce.com Lead Generation Online Advertising Business Development Display Advertising Display Campaigns Direct Sales Sales Presentations Training Miller Heiman Sales... Sales Rep Training Selling Behavioral Targeting Account Management Recruiting Marketing Advertising Sales Sales Management Contract Negotiation Management Sales Operations Strategy Digital Strategy Advertising Mobile Devices CRM See 13+     See less Education University of California, Los Angeles BA,  Psychology University of California, Los Angeles University of California, Los Angeles BA,  Psychology University of California, Los Angeles BA,  Psychology University of California, Los Angeles BA,  Psychology University of California, Los Angeles University of California, Los Angeles University of California, Los Angeles ", "Summary Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Summary Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Experience Senior Manager, Service Engineering, Yahoo Communications Yahoo May 2015  – Present (4 months) Responsible for Mail Anti-spam/Delivery, Mail Metadata (VX/Force), Mail Search (Vespa/Force), and Mail BE Services (Homefarm/JEDI services). \n \nManage multiple service engineering teams, managing 30k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo April 2014  –  May 2015  (1 year 2 months) Responsible for Mail anti-spam/delivery, Mail Release Engineering, and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Mail Anti-spam/Delivery & Messenger Yahoo! June 2012  –  March 2014  (1 year 10 months) Sunnyvale, CA Responsible for Mail anti-spam/delivery and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Messenger Yahoo! March 2010  –  June 2012  (2 years 4 months) Sunnyvale, CA Manage a team of senior service engineers, managing thousands of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Manager, Systems Operations Kodak Gallery March 2008  –  March 2010  (2 years 1 month) Emeryville, CA Manage a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Team Lead, Systems Operations Kodak Gallery April 2007  –  March 2008  (1 year) Emeryville, CA Lead a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. UNIX Systems Administrator, Systems Operations Kodak Gallery September 2005  –  April 2007  (1 year 8 months) Emeryville, CA Support an online e-commerce site, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Windows Systems Administrator, Corporate IT Kodak Gallery August 2003  –  September 2005  (2 years 2 months) Emeryville, CA IS Engineer Incyte Genomics July 2002  –  November 2002  (5 months) Palo Alto, CA Systems Administrator Coradiant October 2000  –  April 2002  (1 year 7 months) Senior Manager, Service Engineering, Yahoo Communications Yahoo May 2015  – Present (4 months) Responsible for Mail Anti-spam/Delivery, Mail Metadata (VX/Force), Mail Search (Vespa/Force), and Mail BE Services (Homefarm/JEDI services). \n \nManage multiple service engineering teams, managing 30k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo May 2015  – Present (4 months) Responsible for Mail Anti-spam/Delivery, Mail Metadata (VX/Force), Mail Search (Vespa/Force), and Mail BE Services (Homefarm/JEDI services). \n \nManage multiple service engineering teams, managing 30k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo April 2014  –  May 2015  (1 year 2 months) Responsible for Mail anti-spam/delivery, Mail Release Engineering, and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo April 2014  –  May 2015  (1 year 2 months) Responsible for Mail anti-spam/delivery, Mail Release Engineering, and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Mail Anti-spam/Delivery & Messenger Yahoo! June 2012  –  March 2014  (1 year 10 months) Sunnyvale, CA Responsible for Mail anti-spam/delivery and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Mail Anti-spam/Delivery & Messenger Yahoo! June 2012  –  March 2014  (1 year 10 months) Sunnyvale, CA Responsible for Mail anti-spam/delivery and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Messenger Yahoo! March 2010  –  June 2012  (2 years 4 months) Sunnyvale, CA Manage a team of senior service engineers, managing thousands of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Messenger Yahoo! March 2010  –  June 2012  (2 years 4 months) Sunnyvale, CA Manage a team of senior service engineers, managing thousands of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Manager, Systems Operations Kodak Gallery March 2008  –  March 2010  (2 years 1 month) Emeryville, CA Manage a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Manager, Systems Operations Kodak Gallery March 2008  –  March 2010  (2 years 1 month) Emeryville, CA Manage a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Team Lead, Systems Operations Kodak Gallery April 2007  –  March 2008  (1 year) Emeryville, CA Lead a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Team Lead, Systems Operations Kodak Gallery April 2007  –  March 2008  (1 year) Emeryville, CA Lead a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. UNIX Systems Administrator, Systems Operations Kodak Gallery September 2005  –  April 2007  (1 year 8 months) Emeryville, CA Support an online e-commerce site, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. UNIX Systems Administrator, Systems Operations Kodak Gallery September 2005  –  April 2007  (1 year 8 months) Emeryville, CA Support an online e-commerce site, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Windows Systems Administrator, Corporate IT Kodak Gallery August 2003  –  September 2005  (2 years 2 months) Emeryville, CA Windows Systems Administrator, Corporate IT Kodak Gallery August 2003  –  September 2005  (2 years 2 months) Emeryville, CA IS Engineer Incyte Genomics July 2002  –  November 2002  (5 months) Palo Alto, CA IS Engineer Incyte Genomics July 2002  –  November 2002  (5 months) Palo Alto, CA Systems Administrator Coradiant October 2000  –  April 2002  (1 year 7 months) Systems Administrator Coradiant October 2000  –  April 2002  (1 year 7 months) Skills RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less Skills  RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less Education University of California, Berkeley Certificate 2004  – 2006 University of California, Los Angeles 1992  – 1997 University of California, Berkeley Certificate 2004  – 2006 University of California, Berkeley Certificate 2004  – 2006 University of California, Berkeley Certificate 2004  – 2006 University of California, Los Angeles 1992  – 1997 University of California, Los Angeles 1992  – 1997 University of California, Los Angeles 1992  – 1997 Honors & Awards 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner ", "Summary Accomplished advertising professional with diverse knowledge and strategic expertise in online marketing seeking an opportunity to shape competitive strategy and deliver results in a leadership position. Summary Accomplished advertising professional with diverse knowledge and strategic expertise in online marketing seeking an opportunity to shape competitive strategy and deliver results in a leadership position. Accomplished advertising professional with diverse knowledge and strategic expertise in online marketing seeking an opportunity to shape competitive strategy and deliver results in a leadership position. Accomplished advertising professional with diverse knowledge and strategic expertise in online marketing seeking an opportunity to shape competitive strategy and deliver results in a leadership position. Experience Sr. Manager, Business Planning & Operations Yahoo May 2014  – Present (1 year 4 months) Senior Manager of Business Development Infolinks, Inc. July 2012  –  May 2014  (1 year 11 months) Palo Alto, CA Direct Response Marketplace Manager, EMEA Yahoo! January 2010  –  June 2012  (2 years 6 months) Senior Analyst, Optimization Solutions Yahoo! September 2008  –  January 2010  (1 year 5 months) Senior Online Advertising Analyst Yahoo! July 2007  –  September 2008  (1 year 3 months) Online Advertising Analyst Blue Lithium 2007  –  2007  (less than a year) Sr. Manager, Business Planning & Operations Yahoo May 2014  – Present (1 year 4 months) Sr. Manager, Business Planning & Operations Yahoo May 2014  – Present (1 year 4 months) Senior Manager of Business Development Infolinks, Inc. July 2012  –  May 2014  (1 year 11 months) Palo Alto, CA Senior Manager of Business Development Infolinks, Inc. July 2012  –  May 2014  (1 year 11 months) Palo Alto, CA Direct Response Marketplace Manager, EMEA Yahoo! January 2010  –  June 2012  (2 years 6 months) Direct Response Marketplace Manager, EMEA Yahoo! January 2010  –  June 2012  (2 years 6 months) Senior Analyst, Optimization Solutions Yahoo! September 2008  –  January 2010  (1 year 5 months) Senior Analyst, Optimization Solutions Yahoo! September 2008  –  January 2010  (1 year 5 months) Senior Online Advertising Analyst Yahoo! July 2007  –  September 2008  (1 year 3 months) Senior Online Advertising Analyst Yahoo! July 2007  –  September 2008  (1 year 3 months) Online Advertising Analyst Blue Lithium 2007  –  2007  (less than a year) Online Advertising Analyst Blue Lithium 2007  –  2007  (less than a year) Skills Online Advertising Optimization Ad Exchanges Monetization Behavioral Targeting Ad Networks Audience Segmentation Ad Serving Product Management Digital Strategy Campaign Management Online Marketing Digital Marketing Business Development Strategic Partnerships Project Management Product Strategy Product Development Campaign Optimization CPM CPA CPC-A Web Marketing Display Advertising Start-ups Web Analytics Strategy Advertising See 13+     See less Skills  Online Advertising Optimization Ad Exchanges Monetization Behavioral Targeting Ad Networks Audience Segmentation Ad Serving Product Management Digital Strategy Campaign Management Online Marketing Digital Marketing Business Development Strategic Partnerships Project Management Product Strategy Product Development Campaign Optimization CPM CPA CPC-A Web Marketing Display Advertising Start-ups Web Analytics Strategy Advertising See 13+     See less Online Advertising Optimization Ad Exchanges Monetization Behavioral Targeting Ad Networks Audience Segmentation Ad Serving Product Management Digital Strategy Campaign Management Online Marketing Digital Marketing Business Development Strategic Partnerships Project Management Product Strategy Product Development Campaign Optimization CPM CPA CPC-A Web Marketing Display Advertising Start-ups Web Analytics Strategy Advertising See 13+     See less Online Advertising Optimization Ad Exchanges Monetization Behavioral Targeting Ad Networks Audience Segmentation Ad Serving Product Management Digital Strategy Campaign Management Online Marketing Digital Marketing Business Development Strategic Partnerships Project Management Product Strategy Product Development Campaign Optimization CPM CPA CPC-A Web Marketing Display Advertising Start-ups Web Analytics Strategy Advertising See 13+     See less Education Stanford University BA,  International Relations with a focus on Economics 2003  – 2007 Episcopal High School Stanford University BA,  International Relations with a focus on Economics 2003  – 2007 Stanford University BA,  International Relations with a focus on Economics 2003  – 2007 Stanford University BA,  International Relations with a focus on Economics 2003  – 2007 Episcopal High School Episcopal High School Episcopal High School ", "Summary A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. Summary A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. Experience Senior Project Manager Yahoo! December 2007  –  May 2014  (6 years 6 months) Dublin Senior Manager Consulting Deloitte September 2005  –  November 2007  (2 years 3 months) Dublin, Ireland Senior Business Applications Consultant Fujitsu Services March 1999  –  August 2005  (6 years 6 months) Dublin, Ireland Senior Applications Consultant Infor October 1996  –  March 1999  (2 years 6 months) Dublin, Irelabd Financial Planning Manager Unilever August 1990  –  September 1996  (6 years 2 months) Dublin, Ireland Cost Accounting Manager Henkel CEE February 1985  –  August 1990  (5 years 7 months) Dublin, Ireland Senior Project Manager Yahoo! December 2007  –  May 2014  (6 years 6 months) Dublin Senior Project Manager Yahoo! December 2007  –  May 2014  (6 years 6 months) Dublin Senior Manager Consulting Deloitte September 2005  –  November 2007  (2 years 3 months) Dublin, Ireland Senior Manager Consulting Deloitte September 2005  –  November 2007  (2 years 3 months) Dublin, Ireland Senior Business Applications Consultant Fujitsu Services March 1999  –  August 2005  (6 years 6 months) Dublin, Ireland Senior Business Applications Consultant Fujitsu Services March 1999  –  August 2005  (6 years 6 months) Dublin, Ireland Senior Applications Consultant Infor October 1996  –  March 1999  (2 years 6 months) Dublin, Irelabd Senior Applications Consultant Infor October 1996  –  March 1999  (2 years 6 months) Dublin, Irelabd Financial Planning Manager Unilever August 1990  –  September 1996  (6 years 2 months) Dublin, Ireland Financial Planning Manager Unilever August 1990  –  September 1996  (6 years 2 months) Dublin, Ireland Cost Accounting Manager Henkel CEE February 1985  –  August 1990  (5 years 7 months) Dublin, Ireland Cost Accounting Manager Henkel CEE February 1985  –  August 1990  (5 years 7 months) Dublin, Ireland Skills PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less Skills  PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less Education Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Dublin Business School ACMA,  Accounting 1986  – 1989 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Dublin Business School ACMA,  Accounting 1986  – 1989 Dublin Business School ACMA,  Accounting 1986  – 1989 Dublin Business School ACMA,  Accounting 1986  – 1989 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society ", "Skills Analytics Ad Exchanges Online Advertising Web Analytics Display Advertising Strategic Partnerships Strategy Competitive Analysis Management Digital Strategy Skills  Analytics Ad Exchanges Online Advertising Web Analytics Display Advertising Strategic Partnerships Strategy Competitive Analysis Management Digital Strategy Analytics Ad Exchanges Online Advertising Web Analytics Display Advertising Strategic Partnerships Strategy Competitive Analysis Management Digital Strategy Analytics Ad Exchanges Online Advertising Web Analytics Display Advertising Strategic Partnerships Strategy Competitive Analysis Management Digital Strategy "]}