{"position": "Senior Creative Strategist", "company": "Google", "profiles": ["Experience Senior Manager, Search & Native Strategy Yahoo October 2014  – Present (11 months) Burbank, CA Manager, Search Account Management (Financial Services) Yahoo! January 2013  –  October 2014  (1 year 10 months) Burbank, CA I lead a national team of search account managers who focus on our strategic financial services and insurance advertisers, driving advertiser value and investment in the Yahoo! Bing Network. Team Lead (Agency Services) Yahoo! January 2012  –  January 2013  (1 year 1 month) Burbank Manager of a team of agency services account managers who supported Yahoo!/Bing search agency partnerships like iCrossing, iProspect, The Search Agency and Resolution Media.in the Western and Central U.S. Account Lead (Agency Services) Yahoo October 2011  –  February 2012  (5 months) Burbank, CA Managed a portfolio of clients for west coast search agencies based in Los Angeles, Chicago and San Francisco. Senior Account Manager (Agency Services) Yahoo! Search Marketing January 2009  –  October 2011  (2 years 10 months) Senior Account Manager - Agency Services Senior Creative Strategist (Agency Services) Yahoo! Search Marketing June 2007  –  January 2009  (1 year 8 months) Listing Editor Yahoo! Search Marketing March 2006  –  June 2007  (1 year 4 months) Editor Walk Thru the Bible 2003  –  2006  (3 years) Senior Manager, Search & Native Strategy Yahoo October 2014  – Present (11 months) Burbank, CA Senior Manager, Search & Native Strategy Yahoo October 2014  – Present (11 months) Burbank, CA Manager, Search Account Management (Financial Services) Yahoo! January 2013  –  October 2014  (1 year 10 months) Burbank, CA I lead a national team of search account managers who focus on our strategic financial services and insurance advertisers, driving advertiser value and investment in the Yahoo! Bing Network. Manager, Search Account Management (Financial Services) Yahoo! January 2013  –  October 2014  (1 year 10 months) Burbank, CA I lead a national team of search account managers who focus on our strategic financial services and insurance advertisers, driving advertiser value and investment in the Yahoo! Bing Network. Team Lead (Agency Services) Yahoo! January 2012  –  January 2013  (1 year 1 month) Burbank Manager of a team of agency services account managers who supported Yahoo!/Bing search agency partnerships like iCrossing, iProspect, The Search Agency and Resolution Media.in the Western and Central U.S. Team Lead (Agency Services) Yahoo! January 2012  –  January 2013  (1 year 1 month) Burbank Manager of a team of agency services account managers who supported Yahoo!/Bing search agency partnerships like iCrossing, iProspect, The Search Agency and Resolution Media.in the Western and Central U.S. Account Lead (Agency Services) Yahoo October 2011  –  February 2012  (5 months) Burbank, CA Managed a portfolio of clients for west coast search agencies based in Los Angeles, Chicago and San Francisco. Account Lead (Agency Services) Yahoo October 2011  –  February 2012  (5 months) Burbank, CA Managed a portfolio of clients for west coast search agencies based in Los Angeles, Chicago and San Francisco. Senior Account Manager (Agency Services) Yahoo! Search Marketing January 2009  –  October 2011  (2 years 10 months) Senior Account Manager - Agency Services Senior Account Manager (Agency Services) Yahoo! Search Marketing January 2009  –  October 2011  (2 years 10 months) Senior Account Manager - Agency Services Senior Creative Strategist (Agency Services) Yahoo! Search Marketing June 2007  –  January 2009  (1 year 8 months) Senior Creative Strategist (Agency Services) Yahoo! Search Marketing June 2007  –  January 2009  (1 year 8 months) Listing Editor Yahoo! Search Marketing March 2006  –  June 2007  (1 year 4 months) Listing Editor Yahoo! Search Marketing March 2006  –  June 2007  (1 year 4 months) Editor Walk Thru the Bible 2003  –  2006  (3 years) Editor Walk Thru the Bible 2003  –  2006  (3 years) Skills SEM Online Advertising Online Marketing Advertising Writing Account Management Digital Media Search Mobile Marketing SEO PPC Digital Marketing Search Advertising Digital Strategy Strategy Google Analytics Google Adwords MSN AdCenter Management Web Analytics Social Media Marketing See 6+     See less Skills  SEM Online Advertising Online Marketing Advertising Writing Account Management Digital Media Search Mobile Marketing SEO PPC Digital Marketing Search Advertising Digital Strategy Strategy Google Analytics Google Adwords MSN AdCenter Management Web Analytics Social Media Marketing See 6+     See less SEM Online Advertising Online Marketing Advertising Writing Account Management Digital Media Search Mobile Marketing SEO PPC Digital Marketing Search Advertising Digital Strategy Strategy Google Analytics Google Adwords MSN AdCenter Management Web Analytics Social Media Marketing See 6+     See less SEM Online Advertising Online Marketing Advertising Writing Account Management Digital Media Search Mobile Marketing SEO PPC Digital Marketing Search Advertising Digital Strategy Strategy Google Analytics Google Adwords MSN AdCenter Management Web Analytics Social Media Marketing See 6+     See less Education Antioch University - Los Angeles MFA,  Creative Writing 2008  – 2010 Kennesaw State University B.A.,  English 1998  – 2003 Antioch University - Los Angeles MFA,  Creative Writing 2008  – 2010 Antioch University - Los Angeles MFA,  Creative Writing 2008  – 2010 Antioch University - Los Angeles MFA,  Creative Writing 2008  – 2010 Kennesaw State University B.A.,  English 1998  – 2003 Kennesaw State University B.A.,  English 1998  – 2003 Kennesaw State University B.A.,  English 1998  – 2003 ", "Summary Lead Account Manager for Native and Search Marketing in the entertainment vertical at Yahoo for film, television and streaming advertisers. Masters degree in Screenwriting from The American Film Institute, with a business certificate from UCLA Extension for Entertainment Business & Management. Summary Lead Account Manager for Native and Search Marketing in the entertainment vertical at Yahoo for film, television and streaming advertisers. Masters degree in Screenwriting from The American Film Institute, with a business certificate from UCLA Extension for Entertainment Business & Management. Lead Account Manager for Native and Search Marketing in the entertainment vertical at Yahoo for film, television and streaming advertisers. Masters degree in Screenwriting from The American Film Institute, with a business certificate from UCLA Extension for Entertainment Business & Management. Lead Account Manager for Native and Search Marketing in the entertainment vertical at Yahoo for film, television and streaming advertisers. Masters degree in Screenwriting from The American Film Institute, with a business certificate from UCLA Extension for Entertainment Business & Management. Experience Account Lead Yahoo December 2013  – Present (1 year 9 months) Burbank, CA Seek ways to solve problems both inside the company and with our exterior partners to garner better ROI for advertisers and better results for the company, by identifying issues and finding creative ways to rectify or circumvent them. \n \nTirelessly pursue entertainment advertisers to adopt new search and native advertising strategies, when many traditional clients are reluctant to try new ad units, by finding new ways to position the benefits and by discovering tactics that entertainment clients can use to their best advantage. \n \nAssumed leadership role amongst peers, when there had not previously been a lead role in entertainment, by providing reporting across the sales org on entertainment’s progress and finding new ways to motivate colleagues to achieve their goals. \n \nTook on more clients than is custom in the Yahoo field organization in order to provide sub-category expertise and more focused attention to movie, television and streaming advertisers. Senior Account Manager, Search Yahoo! August 2012  –  December 2013  (1 year 5 months) Burbank, CA Greatly over-achieved entertainment vertical sales goals when most verticals were merely hitting the goals, using a framework that focused on the needs and opportunities of the advertiser. \n \nNamed one of top 6 search account managers, out of over 70 AMs, by applying my entertainment experience and my creativity to search marketing & native accounts. \n \nAccelerated the success of entertainment advertisers, when the upside potential in the vertical was in question, as a result of bringing innovative thinking and new structure to making these unique clients successful in digital marketing. Senior Creative Strategist Yahoo! March 2011  –  August 2012  (1 year 6 months) Burbank, CA Proved that high engagement drives advertiser adoption, in a time of growing SLAs, by reducing response times and increasing proactive thinking for agency search clients. \n \nHonored as one of the top creative strategists of over 30 CSs, by showing my ability to thrive under pressure and by finding new ways to deliver results during critical times. Creative Strategist Yahoo! June 2008  –  March 2011  (2 years 10 months) Burbank, CA Quarterbacked an onshore/offshore team to migrate over 2,000 accounts from Yahoo SEM to Bing (the second highest number in the company) by involving, motivating and empowering my team members in an extremely stressful time. \n \nIdentified the need for new client-facing account analysis presentation templates in the new Yahoo/Bing partnership, when others were consumed by the migration, and assembled a group of peers across offices to build new PowerPoint templates which redefined how the company presented campaign reviews. Search Enhancement Associate Yahoo! November 2006  –  June 2008  (1 year 8 months) Burbank, CA Engineered AutoHotKey program to work on top of new tools that were designed for function and not for usability, and saw a 50% increase in team productivity. \n \nAdapted and thrived in the then new Yahoo Panama environment, amongst weekly changes in processes and tools, and proved that flexibility brings success to the team. Account Lead Yahoo December 2013  – Present (1 year 9 months) Burbank, CA Seek ways to solve problems both inside the company and with our exterior partners to garner better ROI for advertisers and better results for the company, by identifying issues and finding creative ways to rectify or circumvent them. \n \nTirelessly pursue entertainment advertisers to adopt new search and native advertising strategies, when many traditional clients are reluctant to try new ad units, by finding new ways to position the benefits and by discovering tactics that entertainment clients can use to their best advantage. \n \nAssumed leadership role amongst peers, when there had not previously been a lead role in entertainment, by providing reporting across the sales org on entertainment’s progress and finding new ways to motivate colleagues to achieve their goals. \n \nTook on more clients than is custom in the Yahoo field organization in order to provide sub-category expertise and more focused attention to movie, television and streaming advertisers. Account Lead Yahoo December 2013  – Present (1 year 9 months) Burbank, CA Seek ways to solve problems both inside the company and with our exterior partners to garner better ROI for advertisers and better results for the company, by identifying issues and finding creative ways to rectify or circumvent them. \n \nTirelessly pursue entertainment advertisers to adopt new search and native advertising strategies, when many traditional clients are reluctant to try new ad units, by finding new ways to position the benefits and by discovering tactics that entertainment clients can use to their best advantage. \n \nAssumed leadership role amongst peers, when there had not previously been a lead role in entertainment, by providing reporting across the sales org on entertainment’s progress and finding new ways to motivate colleagues to achieve their goals. \n \nTook on more clients than is custom in the Yahoo field organization in order to provide sub-category expertise and more focused attention to movie, television and streaming advertisers. Senior Account Manager, Search Yahoo! August 2012  –  December 2013  (1 year 5 months) Burbank, CA Greatly over-achieved entertainment vertical sales goals when most verticals were merely hitting the goals, using a framework that focused on the needs and opportunities of the advertiser. \n \nNamed one of top 6 search account managers, out of over 70 AMs, by applying my entertainment experience and my creativity to search marketing & native accounts. \n \nAccelerated the success of entertainment advertisers, when the upside potential in the vertical was in question, as a result of bringing innovative thinking and new structure to making these unique clients successful in digital marketing. Senior Account Manager, Search Yahoo! August 2012  –  December 2013  (1 year 5 months) Burbank, CA Greatly over-achieved entertainment vertical sales goals when most verticals were merely hitting the goals, using a framework that focused on the needs and opportunities of the advertiser. \n \nNamed one of top 6 search account managers, out of over 70 AMs, by applying my entertainment experience and my creativity to search marketing & native accounts. \n \nAccelerated the success of entertainment advertisers, when the upside potential in the vertical was in question, as a result of bringing innovative thinking and new structure to making these unique clients successful in digital marketing. Senior Creative Strategist Yahoo! March 2011  –  August 2012  (1 year 6 months) Burbank, CA Proved that high engagement drives advertiser adoption, in a time of growing SLAs, by reducing response times and increasing proactive thinking for agency search clients. \n \nHonored as one of the top creative strategists of over 30 CSs, by showing my ability to thrive under pressure and by finding new ways to deliver results during critical times. Senior Creative Strategist Yahoo! March 2011  –  August 2012  (1 year 6 months) Burbank, CA Proved that high engagement drives advertiser adoption, in a time of growing SLAs, by reducing response times and increasing proactive thinking for agency search clients. \n \nHonored as one of the top creative strategists of over 30 CSs, by showing my ability to thrive under pressure and by finding new ways to deliver results during critical times. Creative Strategist Yahoo! June 2008  –  March 2011  (2 years 10 months) Burbank, CA Quarterbacked an onshore/offshore team to migrate over 2,000 accounts from Yahoo SEM to Bing (the second highest number in the company) by involving, motivating and empowering my team members in an extremely stressful time. \n \nIdentified the need for new client-facing account analysis presentation templates in the new Yahoo/Bing partnership, when others were consumed by the migration, and assembled a group of peers across offices to build new PowerPoint templates which redefined how the company presented campaign reviews. Creative Strategist Yahoo! June 2008  –  March 2011  (2 years 10 months) Burbank, CA Quarterbacked an onshore/offshore team to migrate over 2,000 accounts from Yahoo SEM to Bing (the second highest number in the company) by involving, motivating and empowering my team members in an extremely stressful time. \n \nIdentified the need for new client-facing account analysis presentation templates in the new Yahoo/Bing partnership, when others were consumed by the migration, and assembled a group of peers across offices to build new PowerPoint templates which redefined how the company presented campaign reviews. Search Enhancement Associate Yahoo! November 2006  –  June 2008  (1 year 8 months) Burbank, CA Engineered AutoHotKey program to work on top of new tools that were designed for function and not for usability, and saw a 50% increase in team productivity. \n \nAdapted and thrived in the then new Yahoo Panama environment, amongst weekly changes in processes and tools, and proved that flexibility brings success to the team. Search Enhancement Associate Yahoo! November 2006  –  June 2008  (1 year 8 months) Burbank, CA Engineered AutoHotKey program to work on top of new tools that were designed for function and not for usability, and saw a 50% increase in team productivity. \n \nAdapted and thrived in the then new Yahoo Panama environment, amongst weekly changes in processes and tools, and proved that flexibility brings success to the team. Languages   Skills SEM PPC Creative Development Online Advertising Mobile Marketing Editing Digital Marketing Online Marketing Social Media Marketing Lead Generation Yahoo Search Marketing MSN AdCenter Search Advertising Strategy Digital Strategy Advertising Marketing Digital Media See 3+     See less Skills  SEM PPC Creative Development Online Advertising Mobile Marketing Editing Digital Marketing Online Marketing Social Media Marketing Lead Generation Yahoo Search Marketing MSN AdCenter Search Advertising Strategy Digital Strategy Advertising Marketing Digital Media See 3+     See less SEM PPC Creative Development Online Advertising Mobile Marketing Editing Digital Marketing Online Marketing Social Media Marketing Lead Generation Yahoo Search Marketing MSN AdCenter Search Advertising Strategy Digital Strategy Advertising Marketing Digital Media See 3+     See less SEM PPC Creative Development Online Advertising Mobile Marketing Editing Digital Marketing Online Marketing Social Media Marketing Lead Generation Yahoo Search Marketing MSN AdCenter Search Advertising Strategy Digital Strategy Advertising Marketing Digital Media See 3+     See less Education The American Film Institute Conservatory MFA,  Screenwriting 1992  – 1994 UCLA Extension Certificate,  Entertainment Business & Management 2002  – 2003 UCLA Extension Program with Specialization in Marketing The College of Wooster BA,  Communication/Theater 1987  – 1991 The American Film Institute Conservatory MFA,  Screenwriting 1992  – 1994 The American Film Institute Conservatory MFA,  Screenwriting 1992  – 1994 The American Film Institute Conservatory MFA,  Screenwriting 1992  – 1994 UCLA Extension Certificate,  Entertainment Business & Management 2002  – 2003 UCLA Extension Program with Specialization in Marketing UCLA Extension Certificate,  Entertainment Business & Management 2002  – 2003 UCLA Extension Program with Specialization in Marketing UCLA Extension Certificate,  Entertainment Business & Management 2002  – 2003 UCLA Extension Program with Specialization in Marketing The College of Wooster BA,  Communication/Theater 1987  – 1991 The College of Wooster BA,  Communication/Theater 1987  – 1991 The College of Wooster BA,  Communication/Theater 1987  – 1991 Honors & Awards Screenwriter/Filmmaker Finalist in prestigious Sundance and Disney screenwriting contests, being in the top 9 out of 1,500 submissions, and used the experiences to drive networking opportunities. \n \nScripts were shopped around by well-known producers, with a few high profile opportunities, but even when nothing came of it, it inspired further writing/filmmaking. Theatre Major First play performed at Maryland One-Act Festival. \n \nDirecting Intern at Kalamazoo Civic Players. Screenwriter/Filmmaker Finalist in prestigious Sundance and Disney screenwriting contests, being in the top 9 out of 1,500 submissions, and used the experiences to drive networking opportunities. \n \nScripts were shopped around by well-known producers, with a few high profile opportunities, but even when nothing came of it, it inspired further writing/filmmaking. Screenwriter/Filmmaker Finalist in prestigious Sundance and Disney screenwriting contests, being in the top 9 out of 1,500 submissions, and used the experiences to drive networking opportunities. \n \nScripts were shopped around by well-known producers, with a few high profile opportunities, but even when nothing came of it, it inspired further writing/filmmaking. Screenwriter/Filmmaker Finalist in prestigious Sundance and Disney screenwriting contests, being in the top 9 out of 1,500 submissions, and used the experiences to drive networking opportunities. \n \nScripts were shopped around by well-known producers, with a few high profile opportunities, but even when nothing came of it, it inspired further writing/filmmaking. Theatre Major First play performed at Maryland One-Act Festival. \n \nDirecting Intern at Kalamazoo Civic Players. Theatre Major First play performed at Maryland One-Act Festival. \n \nDirecting Intern at Kalamazoo Civic Players. Theatre Major First play performed at Maryland One-Act Festival. \n \nDirecting Intern at Kalamazoo Civic Players. ", "Experience Manager, Account Management Yahoo October 2014  – Present (11 months) Account Lead Yahoo! October 2011  –  October 2014  (3 years 1 month) •\tExceeded revenue targets and delivered consistent double-digit growth year-over-year \n•\tLed internal vertical-focused calls to track trends and share best practices \n•\tForecasted and reported seasonal revenue trends to sales partners and management \n•\tActed as subject matter expert on internal tools and processes for project managers and engineers \n•\tMentored new account managers and analysts \n•\tPerformed all responsibilities of a Senior Account Manager Senior Account Manager Yahoo! January 2008  –  October 2011  (3 years 10 months) •\tProvided consultative digital marketing solutions for large direct advertisers and agencies by leveraging a diverse suite of products \n•\tPartnered with clients, account executives and extended account team to design strategy to reach marketing goals \n•\tPitched and sold through new products and features \n•\tAssisted clients with product implementation through familiarity with third-party ad management tools, such as DoubleClick, Marin and Kenshoo \n•\tAnalyzed market trends using third-party tools, including Hitwise and comScore \n•\tDesigned optimization strategies based on market trends and ad performance data \n•\tPresented strategic findings to clients on status calls and quarterly in-person meetings \n•\tTrained clients on new products and features \n•\tServed as client advocate with internal engineering, product, finance and editorial groups Senior Creative Strategist Yahoo! May 2007  –  January 2008  (9 months) •\tProvided analytical and tactical support for account managers on large advertisers and agencies \n•\tAnalyzed account performance and identified opportunities to improve key metrics \n•\tPresented opportunities in status calls and quarterly in-person meetings Senior Content Specialist Yahoo! 2007  –  2008  (1 year) •\tProvided analytical and tactical support for account managers on small business clients \n•\tAnalyzed account performance and presented opportunities to account managers \n•\tManaged projects and internal relationships with sales, customer service and marketing \n•\tLed internal cross-sell partnerships with other Yahoo! properties \n•\tRepresented Yahoo! at search marketing industry conferences \n•\tCreated documentation and delivered training on new tools, processes and best practices Content Specialist Yahoo! 2006  –  2007  (1 year) •\tCreated new search marketing campaigns for small business clients \n•\tPiloted and developed best practices for new tools and processes Line Listings Editor Yahoo! July 2005  –  2006  (1 year) •\tReviewed advertiser submissions for editorial policy compliance \n•\tCross-trained in customer service to work directly with self-service advertisers Interim Marketing Services Coordinator Palomar College April 2005  –  July 2005  (4 months) Staff Assistant \n•\tCoordinated facility rentals at over 100 locations \n•\tServed as the liaison between administrative offices and students, faculty and community groups \n•\tProvided administrative support for college directors \n \nInterim Marketing Services Coordinator \n•\tWrote press releases & ad copy \n•\tConducted market research \n•\tRepresented the college at outreach events Au Pair Family in Oberkochen, Germany 2004  –  2005  (1 year) •\tTaught English and provided live-in care for two girls, ages 9 and 11 English Teacher European Language Institute, Prague 2003  –  2004  (1 year) •\tTaught intermediate and advanced-level English classes for adults Manager, Account Management Yahoo October 2014  – Present (11 months) Manager, Account Management Yahoo October 2014  – Present (11 months) Account Lead Yahoo! October 2011  –  October 2014  (3 years 1 month) •\tExceeded revenue targets and delivered consistent double-digit growth year-over-year \n•\tLed internal vertical-focused calls to track trends and share best practices \n•\tForecasted and reported seasonal revenue trends to sales partners and management \n•\tActed as subject matter expert on internal tools and processes for project managers and engineers \n•\tMentored new account managers and analysts \n•\tPerformed all responsibilities of a Senior Account Manager Account Lead Yahoo! October 2011  –  October 2014  (3 years 1 month) •\tExceeded revenue targets and delivered consistent double-digit growth year-over-year \n•\tLed internal vertical-focused calls to track trends and share best practices \n•\tForecasted and reported seasonal revenue trends to sales partners and management \n•\tActed as subject matter expert on internal tools and processes for project managers and engineers \n•\tMentored new account managers and analysts \n•\tPerformed all responsibilities of a Senior Account Manager Senior Account Manager Yahoo! January 2008  –  October 2011  (3 years 10 months) •\tProvided consultative digital marketing solutions for large direct advertisers and agencies by leveraging a diverse suite of products \n•\tPartnered with clients, account executives and extended account team to design strategy to reach marketing goals \n•\tPitched and sold through new products and features \n•\tAssisted clients with product implementation through familiarity with third-party ad management tools, such as DoubleClick, Marin and Kenshoo \n•\tAnalyzed market trends using third-party tools, including Hitwise and comScore \n•\tDesigned optimization strategies based on market trends and ad performance data \n•\tPresented strategic findings to clients on status calls and quarterly in-person meetings \n•\tTrained clients on new products and features \n•\tServed as client advocate with internal engineering, product, finance and editorial groups Senior Account Manager Yahoo! January 2008  –  October 2011  (3 years 10 months) •\tProvided consultative digital marketing solutions for large direct advertisers and agencies by leveraging a diverse suite of products \n•\tPartnered with clients, account executives and extended account team to design strategy to reach marketing goals \n•\tPitched and sold through new products and features \n•\tAssisted clients with product implementation through familiarity with third-party ad management tools, such as DoubleClick, Marin and Kenshoo \n•\tAnalyzed market trends using third-party tools, including Hitwise and comScore \n•\tDesigned optimization strategies based on market trends and ad performance data \n•\tPresented strategic findings to clients on status calls and quarterly in-person meetings \n•\tTrained clients on new products and features \n•\tServed as client advocate with internal engineering, product, finance and editorial groups Senior Creative Strategist Yahoo! May 2007  –  January 2008  (9 months) •\tProvided analytical and tactical support for account managers on large advertisers and agencies \n•\tAnalyzed account performance and identified opportunities to improve key metrics \n•\tPresented opportunities in status calls and quarterly in-person meetings Senior Creative Strategist Yahoo! May 2007  –  January 2008  (9 months) •\tProvided analytical and tactical support for account managers on large advertisers and agencies \n•\tAnalyzed account performance and identified opportunities to improve key metrics \n•\tPresented opportunities in status calls and quarterly in-person meetings Senior Content Specialist Yahoo! 2007  –  2008  (1 year) •\tProvided analytical and tactical support for account managers on small business clients \n•\tAnalyzed account performance and presented opportunities to account managers \n•\tManaged projects and internal relationships with sales, customer service and marketing \n•\tLed internal cross-sell partnerships with other Yahoo! properties \n•\tRepresented Yahoo! at search marketing industry conferences \n•\tCreated documentation and delivered training on new tools, processes and best practices Senior Content Specialist Yahoo! 2007  –  2008  (1 year) •\tProvided analytical and tactical support for account managers on small business clients \n•\tAnalyzed account performance and presented opportunities to account managers \n•\tManaged projects and internal relationships with sales, customer service and marketing \n•\tLed internal cross-sell partnerships with other Yahoo! properties \n•\tRepresented Yahoo! at search marketing industry conferences \n•\tCreated documentation and delivered training on new tools, processes and best practices Content Specialist Yahoo! 2006  –  2007  (1 year) •\tCreated new search marketing campaigns for small business clients \n•\tPiloted and developed best practices for new tools and processes Content Specialist Yahoo! 2006  –  2007  (1 year) •\tCreated new search marketing campaigns for small business clients \n•\tPiloted and developed best practices for new tools and processes Line Listings Editor Yahoo! July 2005  –  2006  (1 year) •\tReviewed advertiser submissions for editorial policy compliance \n•\tCross-trained in customer service to work directly with self-service advertisers Line Listings Editor Yahoo! July 2005  –  2006  (1 year) •\tReviewed advertiser submissions for editorial policy compliance \n•\tCross-trained in customer service to work directly with self-service advertisers Interim Marketing Services Coordinator Palomar College April 2005  –  July 2005  (4 months) Staff Assistant \n•\tCoordinated facility rentals at over 100 locations \n•\tServed as the liaison between administrative offices and students, faculty and community groups \n•\tProvided administrative support for college directors \n \nInterim Marketing Services Coordinator \n•\tWrote press releases & ad copy \n•\tConducted market research \n•\tRepresented the college at outreach events Interim Marketing Services Coordinator Palomar College April 2005  –  July 2005  (4 months) Staff Assistant \n•\tCoordinated facility rentals at over 100 locations \n•\tServed as the liaison between administrative offices and students, faculty and community groups \n•\tProvided administrative support for college directors \n \nInterim Marketing Services Coordinator \n•\tWrote press releases & ad copy \n•\tConducted market research \n•\tRepresented the college at outreach events Au Pair Family in Oberkochen, Germany 2004  –  2005  (1 year) •\tTaught English and provided live-in care for two girls, ages 9 and 11 Au Pair Family in Oberkochen, Germany 2004  –  2005  (1 year) •\tTaught English and provided live-in care for two girls, ages 9 and 11 English Teacher European Language Institute, Prague 2003  –  2004  (1 year) •\tTaught intermediate and advanced-level English classes for adults English Teacher European Language Institute, Prague 2003  –  2004  (1 year) •\tTaught intermediate and advanced-level English classes for adults Languages German German German Skills Sales MSN AdCenter Search Advertising PPC SEM Online Advertising Digital Media Advertising Copywriting Marketing DoubleClick Market Research Mobile Marketing Strategy Digital Strategy Digital Marketing See 1+     See less Skills  Sales MSN AdCenter Search Advertising PPC SEM Online Advertising Digital Media Advertising Copywriting Marketing DoubleClick Market Research Mobile Marketing Strategy Digital Strategy Digital Marketing See 1+     See less Sales MSN AdCenter Search Advertising PPC SEM Online Advertising Digital Media Advertising Copywriting Marketing DoubleClick Market Research Mobile Marketing Strategy Digital Strategy Digital Marketing See 1+     See less Sales MSN AdCenter Search Advertising PPC SEM Online Advertising Digital Media Advertising Copywriting Marketing DoubleClick Market Research Mobile Marketing Strategy Digital Strategy Digital Marketing See 1+     See less Education ITC International TEFL Certificate TEFL Certificate,  English Language Education 2003  – 2003 University of California, Santa Barbara BA,  Literature 1999  – 2003 Activities and Societies:  The Daily Nexus ,  Education Abroad Program ,  College of Creative Studies Queen Mary University of London None,  Literature 2001  – 2002 Education Abroad Program Student ITC International TEFL Certificate TEFL Certificate,  English Language Education 2003  – 2003 ITC International TEFL Certificate TEFL Certificate,  English Language Education 2003  – 2003 ITC International TEFL Certificate TEFL Certificate,  English Language Education 2003  – 2003 University of California, Santa Barbara BA,  Literature 1999  – 2003 Activities and Societies:  The Daily Nexus ,  Education Abroad Program ,  College of Creative Studies University of California, Santa Barbara BA,  Literature 1999  – 2003 Activities and Societies:  The Daily Nexus ,  Education Abroad Program ,  College of Creative Studies University of California, Santa Barbara BA,  Literature 1999  – 2003 Activities and Societies:  The Daily Nexus ,  Education Abroad Program ,  College of Creative Studies Queen Mary University of London None,  Literature 2001  – 2002 Education Abroad Program Student Queen Mary University of London None,  Literature 2001  – 2002 Education Abroad Program Student Queen Mary University of London None,  Literature 2001  – 2002 Education Abroad Program Student Honors & Awards Additional Honors & Awards UCSB Regents Scholar \nNational Society of Collegiate Scholars member \nGolden Key Honor Society member \nBrancart Fiction Prize (Runner-up) \nUCSB College of Creative Studies Pocket Money Prize in Fiction \nUCSB College of Creative Studies Young Scholar \nNational Council of Teachers of English Excellence in Writing Award Additional Honors & Awards UCSB Regents Scholar \nNational Society of Collegiate Scholars member \nGolden Key Honor Society member \nBrancart Fiction Prize (Runner-up) \nUCSB College of Creative Studies Pocket Money Prize in Fiction \nUCSB College of Creative Studies Young Scholar \nNational Council of Teachers of English Excellence in Writing Award Additional Honors & Awards UCSB Regents Scholar \nNational Society of Collegiate Scholars member \nGolden Key Honor Society member \nBrancart Fiction Prize (Runner-up) \nUCSB College of Creative Studies Pocket Money Prize in Fiction \nUCSB College of Creative Studies Young Scholar \nNational Council of Teachers of English Excellence in Writing Award Additional Honors & Awards UCSB Regents Scholar \nNational Society of Collegiate Scholars member \nGolden Key Honor Society member \nBrancart Fiction Prize (Runner-up) \nUCSB College of Creative Studies Pocket Money Prize in Fiction \nUCSB College of Creative Studies Young Scholar \nNational Council of Teachers of English Excellence in Writing Award ", "Experience Sales Operations and Strategy Yahoo May 2015  – Present (4 months) Dublin Senior Creative Strategist Yahoo! 2009  – Present (6 years) Search Marketing Consultant Yahoo! Search Marketing May 2005  –  January 2009  (3 years 9 months) Multimedia Producer Contemporary Music Centre January 2005  –  May 2005  (5 months) Editor Folens Publishers March 2004  –  May 2005  (1 year 3 months) Instructional Designer Interactive Services April 2002  –  September 2002  (6 months) Sales Operations and Strategy Yahoo May 2015  – Present (4 months) Dublin Sales Operations and Strategy Yahoo May 2015  – Present (4 months) Dublin Senior Creative Strategist Yahoo! 2009  – Present (6 years) Senior Creative Strategist Yahoo! 2009  – Present (6 years) Search Marketing Consultant Yahoo! Search Marketing May 2005  –  January 2009  (3 years 9 months) Search Marketing Consultant Yahoo! Search Marketing May 2005  –  January 2009  (3 years 9 months) Multimedia Producer Contemporary Music Centre January 2005  –  May 2005  (5 months) Multimedia Producer Contemporary Music Centre January 2005  –  May 2005  (5 months) Editor Folens Publishers March 2004  –  May 2005  (1 year 3 months) Editor Folens Publishers March 2004  –  May 2005  (1 year 3 months) Instructional Designer Interactive Services April 2002  –  September 2002  (6 months) Instructional Designer Interactive Services April 2002  –  September 2002  (6 months) Languages Irish Italian French Spanish German Irish Italian French Spanish German Irish Italian French Spanish German Skills PPC Keyword Research Usability Design Multimedia SEM Marketing Communications Content Development Technical Writing Copy Editing Video Production Audio Post Production Music Production Google Adwords SEO Advertising MSN AdCenter Display Advertising See 2+     See less Skills  PPC Keyword Research Usability Design Multimedia SEM Marketing Communications Content Development Technical Writing Copy Editing Video Production Audio Post Production Music Production Google Adwords SEO Advertising MSN AdCenter Display Advertising See 2+     See less PPC Keyword Research Usability Design Multimedia SEM Marketing Communications Content Development Technical Writing Copy Editing Video Production Audio Post Production Music Production Google Adwords SEO Advertising MSN AdCenter Display Advertising See 2+     See less PPC Keyword Research Usability Design Multimedia SEM Marketing Communications Content Development Technical Writing Copy Editing Video Production Audio Post Production Music Production Google Adwords SEO Advertising MSN AdCenter Display Advertising See 2+     See less Education Trinity College Dublin MSc. Multimedia Systems 2001  – 2002 Dublin City University Communications Studies 1994  – 1997 Trinity College Dublin MSc. Multimedia Systems 2001  – 2002 Trinity College Dublin MSc. Multimedia Systems 2001  – 2002 Trinity College Dublin MSc. Multimedia Systems 2001  – 2002 Dublin City University Communications Studies 1994  – 1997 Dublin City University Communications Studies 1994  – 1997 Dublin City University Communications Studies 1994  – 1997 ", "Experience Sr Account Manager Yahoo July 2013  – Present (2 years 2 months) Lead Creative Strategist Yahoo! June 2010  –  July 2013  (3 years 2 months) Supervisor, Search Enhancement Yahoo! July 2008  –  June 2010  (2 years) Sr. Content Specialist Yahoo! June 2007  –  July 2008  (1 year 2 months) Content Specialist Yahoo! March 2006  –  June 2007  (1 year 4 months) Lead Listing Editor Yahoo! March 2005  –  March 2006  (1 year 1 month) Listing Editor Yahoo! March 2004  –  March 2005  (1 year 1 month) Sr Account Manager Yahoo July 2013  – Present (2 years 2 months) Sr Account Manager Yahoo July 2013  – Present (2 years 2 months) Lead Creative Strategist Yahoo! June 2010  –  July 2013  (3 years 2 months) Lead Creative Strategist Yahoo! June 2010  –  July 2013  (3 years 2 months) Supervisor, Search Enhancement Yahoo! July 2008  –  June 2010  (2 years) Supervisor, Search Enhancement Yahoo! July 2008  –  June 2010  (2 years) Sr. Content Specialist Yahoo! June 2007  –  July 2008  (1 year 2 months) Sr. Content Specialist Yahoo! June 2007  –  July 2008  (1 year 2 months) Content Specialist Yahoo! March 2006  –  June 2007  (1 year 4 months) Content Specialist Yahoo! March 2006  –  June 2007  (1 year 4 months) Lead Listing Editor Yahoo! March 2005  –  March 2006  (1 year 1 month) Lead Listing Editor Yahoo! March 2005  –  March 2006  (1 year 1 month) Listing Editor Yahoo! March 2004  –  March 2005  (1 year 1 month) Listing Editor Yahoo! March 2004  –  March 2005  (1 year 1 month) Skills SEM PPC Creative Development Online Advertising Digital Marketing Editing Yahoo Search Marketing Mobile Marketing Online Marketing Social Media Marketing MSN AdCenter Sponsored Search Search Advertising Web Analytics Display Advertising Digital Strategy Creative Direction SEO See 3+     See less Skills  SEM PPC Creative Development Online Advertising Digital Marketing Editing Yahoo Search Marketing Mobile Marketing Online Marketing Social Media Marketing MSN AdCenter Sponsored Search Search Advertising Web Analytics Display Advertising Digital Strategy Creative Direction SEO See 3+     See less SEM PPC Creative Development Online Advertising Digital Marketing Editing Yahoo Search Marketing Mobile Marketing Online Marketing Social Media Marketing MSN AdCenter Sponsored Search Search Advertising Web Analytics Display Advertising Digital Strategy Creative Direction SEO See 3+     See less SEM PPC Creative Development Online Advertising Digital Marketing Editing Yahoo Search Marketing Mobile Marketing Online Marketing Social Media Marketing MSN AdCenter Sponsored Search Search Advertising Web Analytics Display Advertising Digital Strategy Creative Direction SEO See 3+     See less ", "Summary Cada compañía es un mundo distinto. Llenarse con la cultura que cada una de ellas aporta y poder reconocer la diversidad existente de las mismas me ha dado la capacidad de ver un poco más allá. Observar a la empresa, sus empleados y todos sus públicos como un todo, me ha permitido comprender de manera objetiva sus fortalezas, debilidades, amenazas, ventajas, y por sobre todo las oportunidades, que eventualmente tomaré y desarrollaré en el rol que desempeñe. Summary Cada compañía es un mundo distinto. Llenarse con la cultura que cada una de ellas aporta y poder reconocer la diversidad existente de las mismas me ha dado la capacidad de ver un poco más allá. Observar a la empresa, sus empleados y todos sus públicos como un todo, me ha permitido comprender de manera objetiva sus fortalezas, debilidades, amenazas, ventajas, y por sobre todo las oportunidades, que eventualmente tomaré y desarrollaré en el rol que desempeñe. Cada compañía es un mundo distinto. Llenarse con la cultura que cada una de ellas aporta y poder reconocer la diversidad existente de las mismas me ha dado la capacidad de ver un poco más allá. Observar a la empresa, sus empleados y todos sus públicos como un todo, me ha permitido comprender de manera objetiva sus fortalezas, debilidades, amenazas, ventajas, y por sobre todo las oportunidades, que eventualmente tomaré y desarrollaré en el rol que desempeñe. Cada compañía es un mundo distinto. Llenarse con la cultura que cada una de ellas aporta y poder reconocer la diversidad existente de las mismas me ha dado la capacidad de ver un poco más allá. Observar a la empresa, sus empleados y todos sus públicos como un todo, me ha permitido comprender de manera objetiva sus fortalezas, debilidades, amenazas, ventajas, y por sobre todo las oportunidades, que eventualmente tomaré y desarrollaré en el rol que desempeñe. Experience Search Regional Manager LATAM Yahoo March 2014  – Present (1 year 6 months) Argentina • Lograr el crecimiento del revenue en los mercados latinoamricanos. \n \n• Incrementar las ganancias asegurando que los empleados trabajen como equipo y entiendan la mision de la organizacion. \n \n• Diseñar e implementar la estrategia de mercado. \n \n• Dirigir y optimizar un equipo cross-country de Account Managers, Operations and Search Specialists \n \n• Entregar soluciones de marketing innovadoras y escalables. \n \n• Establecer diferentes politicas y lineamientos de acuerdo a cada pais teniendo en cuenta una variedad de factores unicos a cada lugar para minimizar las fallas y cumplir los objetivos. \n \n• Cultivar y mantener las relaciones con las agencias en todo LATAM. Senior Lead Account Manager Yahoo! May 2012  – Present (3 years 4 months) Argentina • Operar como punto de contacto para todos los asuntos relacionados con Search Marketing. \n \n• Gestión de cuentas locales y regionales cuya invercion anual supera los USD 5 M a nivel local y USD 9.6 M a nivel internacional. \n \n• Análisis y presentación de informes trimestrales (QBR)a clientes que permiten identificar todas las oportunidades de crecimiento en cada cuenta. \n \n• Analizar y perseguir y cumplir con los goals de ROI/CPA de cada cliente. \n \n• Guiar a cada cuenta al éxito cumpliendo sus objetivos de marketing. \n \n• Comunicar de manera eficiente y clara el progreso de la evolución de las cuentas a las partes interesadas tanto internas como externas. \n \n• Crear recomendaciones estratégicas e implementar soluciones de búsqueda para cada cliente. \n \n• Construir y mantener relaciones profundas con cada cliente. \n \n• Trabajo en equipor con el ejecutivo de cuentas para impulsar nuevas iniciativas de marketing en buscadores y ayudar con up-selling a clientes existentes. \n \n• Responsable de proyectos especiales: \n \nCoordinación e implementación de migración de la plataforma online y offline de resultados patrocinados. \n \nCoordinación e implementación de la migración de la plataforma CRM de administración de clientes. Search Creative Strategist Lead Yahoo! October 2011  –  May 2012  (8 months) Argentina •\t\"Poseedor \" de un conjunto de cuentas de anunciantes de gran valor, proporcionar servicio necesario y pro-activo a la identificación de oportunidades de mejora a través de la aplicación práctica recomendada, análisis de cuentas, o experiencia de categoría. \n•\tExperto en todo desarrollo creativo relevante y en el uso de las herramientas de gestión para elegir la más eficaz para el trabajo sin la necesidad de procesos o reglas explícitas. \n•\tExperto en YSM y Search marketing best practices. Capacidad de comunicación a todos los niveles organizacionales de los anunciantes. \n•\tMiembro activo del equipo de soporte de la cuenta que incluye ejecutivos de cuenta, gerentes de cuentas y expertos en categorías ayudando al equipo a identificar las oportunidades y resolver los problemas de los anunciantes. \n•\tContribución al éxito continuo del equipo.  \n•\tParticipación en proyectos especiales, flexibilidad y actividades extra-curriculares. OLS Manager Yahoo! October 2010  –  October 2011  (1 year 1 month) Argentina - Mantención, adquisición y optimización de cuentas on-line. \n- Producción mensual de Newsletter para clientes. \n- Producción trimestral de campañas de MKT para LATAM (Chile, Venezuela, Perú, Colombia, México y Argentina). \n- Coordinación y organización de eventos. \n- Prevención de fraude con tarjetas de crédito para LATAM. \n- Diseño e implementación de nuevas estrategias comerciales. \n- Diseño e implementación de estrategias comunicacionales. Supervisor Cablevisión - Fibertel November 2003  –  November 2009  (6 years 1 month) - Diseño e implementación de estrategias comerciales. \n- Cursos y capacitaciones de dicción y trato con los clientes. \n- Seleccion y capacitacion coordinador Fibertel 2003  –  2009  (6 years) - Implementacion de campañas promocionales. \n- Calidad de atencion a clientes. \n-Seleccion y capacitacion. Search Regional Manager LATAM Yahoo March 2014  – Present (1 year 6 months) Argentina • Lograr el crecimiento del revenue en los mercados latinoamricanos. \n \n• Incrementar las ganancias asegurando que los empleados trabajen como equipo y entiendan la mision de la organizacion. \n \n• Diseñar e implementar la estrategia de mercado. \n \n• Dirigir y optimizar un equipo cross-country de Account Managers, Operations and Search Specialists \n \n• Entregar soluciones de marketing innovadoras y escalables. \n \n• Establecer diferentes politicas y lineamientos de acuerdo a cada pais teniendo en cuenta una variedad de factores unicos a cada lugar para minimizar las fallas y cumplir los objetivos. \n \n• Cultivar y mantener las relaciones con las agencias en todo LATAM. Search Regional Manager LATAM Yahoo March 2014  – Present (1 year 6 months) Argentina • Lograr el crecimiento del revenue en los mercados latinoamricanos. \n \n• Incrementar las ganancias asegurando que los empleados trabajen como equipo y entiendan la mision de la organizacion. \n \n• Diseñar e implementar la estrategia de mercado. \n \n• Dirigir y optimizar un equipo cross-country de Account Managers, Operations and Search Specialists \n \n• Entregar soluciones de marketing innovadoras y escalables. \n \n• Establecer diferentes politicas y lineamientos de acuerdo a cada pais teniendo en cuenta una variedad de factores unicos a cada lugar para minimizar las fallas y cumplir los objetivos. \n \n• Cultivar y mantener las relaciones con las agencias en todo LATAM. Senior Lead Account Manager Yahoo! May 2012  – Present (3 years 4 months) Argentina • Operar como punto de contacto para todos los asuntos relacionados con Search Marketing. \n \n• Gestión de cuentas locales y regionales cuya invercion anual supera los USD 5 M a nivel local y USD 9.6 M a nivel internacional. \n \n• Análisis y presentación de informes trimestrales (QBR)a clientes que permiten identificar todas las oportunidades de crecimiento en cada cuenta. \n \n• Analizar y perseguir y cumplir con los goals de ROI/CPA de cada cliente. \n \n• Guiar a cada cuenta al éxito cumpliendo sus objetivos de marketing. \n \n• Comunicar de manera eficiente y clara el progreso de la evolución de las cuentas a las partes interesadas tanto internas como externas. \n \n• Crear recomendaciones estratégicas e implementar soluciones de búsqueda para cada cliente. \n \n• Construir y mantener relaciones profundas con cada cliente. \n \n• Trabajo en equipor con el ejecutivo de cuentas para impulsar nuevas iniciativas de marketing en buscadores y ayudar con up-selling a clientes existentes. \n \n• Responsable de proyectos especiales: \n \nCoordinación e implementación de migración de la plataforma online y offline de resultados patrocinados. \n \nCoordinación e implementación de la migración de la plataforma CRM de administración de clientes. Senior Lead Account Manager Yahoo! May 2012  – Present (3 years 4 months) Argentina • Operar como punto de contacto para todos los asuntos relacionados con Search Marketing. \n \n• Gestión de cuentas locales y regionales cuya invercion anual supera los USD 5 M a nivel local y USD 9.6 M a nivel internacional. \n \n• Análisis y presentación de informes trimestrales (QBR)a clientes que permiten identificar todas las oportunidades de crecimiento en cada cuenta. \n \n• Analizar y perseguir y cumplir con los goals de ROI/CPA de cada cliente. \n \n• Guiar a cada cuenta al éxito cumpliendo sus objetivos de marketing. \n \n• Comunicar de manera eficiente y clara el progreso de la evolución de las cuentas a las partes interesadas tanto internas como externas. \n \n• Crear recomendaciones estratégicas e implementar soluciones de búsqueda para cada cliente. \n \n• Construir y mantener relaciones profundas con cada cliente. \n \n• Trabajo en equipor con el ejecutivo de cuentas para impulsar nuevas iniciativas de marketing en buscadores y ayudar con up-selling a clientes existentes. \n \n• Responsable de proyectos especiales: \n \nCoordinación e implementación de migración de la plataforma online y offline de resultados patrocinados. \n \nCoordinación e implementación de la migración de la plataforma CRM de administración de clientes. Search Creative Strategist Lead Yahoo! October 2011  –  May 2012  (8 months) Argentina •\t\"Poseedor \" de un conjunto de cuentas de anunciantes de gran valor, proporcionar servicio necesario y pro-activo a la identificación de oportunidades de mejora a través de la aplicación práctica recomendada, análisis de cuentas, o experiencia de categoría. \n•\tExperto en todo desarrollo creativo relevante y en el uso de las herramientas de gestión para elegir la más eficaz para el trabajo sin la necesidad de procesos o reglas explícitas. \n•\tExperto en YSM y Search marketing best practices. Capacidad de comunicación a todos los niveles organizacionales de los anunciantes. \n•\tMiembro activo del equipo de soporte de la cuenta que incluye ejecutivos de cuenta, gerentes de cuentas y expertos en categorías ayudando al equipo a identificar las oportunidades y resolver los problemas de los anunciantes. \n•\tContribución al éxito continuo del equipo.  \n•\tParticipación en proyectos especiales, flexibilidad y actividades extra-curriculares. Search Creative Strategist Lead Yahoo! October 2011  –  May 2012  (8 months) Argentina •\t\"Poseedor \" de un conjunto de cuentas de anunciantes de gran valor, proporcionar servicio necesario y pro-activo a la identificación de oportunidades de mejora a través de la aplicación práctica recomendada, análisis de cuentas, o experiencia de categoría. \n•\tExperto en todo desarrollo creativo relevante y en el uso de las herramientas de gestión para elegir la más eficaz para el trabajo sin la necesidad de procesos o reglas explícitas. \n•\tExperto en YSM y Search marketing best practices. Capacidad de comunicación a todos los niveles organizacionales de los anunciantes. \n•\tMiembro activo del equipo de soporte de la cuenta que incluye ejecutivos de cuenta, gerentes de cuentas y expertos en categorías ayudando al equipo a identificar las oportunidades y resolver los problemas de los anunciantes. \n•\tContribución al éxito continuo del equipo.  \n•\tParticipación en proyectos especiales, flexibilidad y actividades extra-curriculares. OLS Manager Yahoo! October 2010  –  October 2011  (1 year 1 month) Argentina - Mantención, adquisición y optimización de cuentas on-line. \n- Producción mensual de Newsletter para clientes. \n- Producción trimestral de campañas de MKT para LATAM (Chile, Venezuela, Perú, Colombia, México y Argentina). \n- Coordinación y organización de eventos. \n- Prevención de fraude con tarjetas de crédito para LATAM. \n- Diseño e implementación de nuevas estrategias comerciales. \n- Diseño e implementación de estrategias comunicacionales. OLS Manager Yahoo! October 2010  –  October 2011  (1 year 1 month) Argentina - Mantención, adquisición y optimización de cuentas on-line. \n- Producción mensual de Newsletter para clientes. \n- Producción trimestral de campañas de MKT para LATAM (Chile, Venezuela, Perú, Colombia, México y Argentina). \n- Coordinación y organización de eventos. \n- Prevención de fraude con tarjetas de crédito para LATAM. \n- Diseño e implementación de nuevas estrategias comerciales. \n- Diseño e implementación de estrategias comunicacionales. Supervisor Cablevisión - Fibertel November 2003  –  November 2009  (6 years 1 month) - Diseño e implementación de estrategias comerciales. \n- Cursos y capacitaciones de dicción y trato con los clientes. \n- Seleccion y capacitacion Supervisor Cablevisión - Fibertel November 2003  –  November 2009  (6 years 1 month) - Diseño e implementación de estrategias comerciales. \n- Cursos y capacitaciones de dicción y trato con los clientes. \n- Seleccion y capacitacion coordinador Fibertel 2003  –  2009  (6 years) - Implementacion de campañas promocionales. \n- Calidad de atencion a clientes. \n-Seleccion y capacitacion. coordinador Fibertel 2003  –  2009  (6 years) - Implementacion de campañas promocionales. \n- Calidad de atencion a clientes. \n-Seleccion y capacitacion. Languages Inglés Native or bilingual proficiency Chino Limited working proficiency Inglés Native or bilingual proficiency Chino Limited working proficiency Inglés Native or bilingual proficiency Chino Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Public Relations Communication Coordinating Events SEO SEM Corporate Branding Performing Search Advertising Yahoo Search Marketing Google Adwords Google Analytics Online Marketing Digital Strategy Web Marketing Digital Marketing Strategic Communications Mobile Marketing PPC E-commerce Media Planning Digital Media Web Analytics Online Advertising Marketing Communications Facebook Marketing digital Publicidad en Internet Marketing en motores de... Marketing en Internet Marketing móvil Estrategia digital Análisis web Comercio electrónico Medios digitales Optimización en... See 20+     See less Skills  Public Relations Communication Coordinating Events SEO SEM Corporate Branding Performing Search Advertising Yahoo Search Marketing Google Adwords Google Analytics Online Marketing Digital Strategy Web Marketing Digital Marketing Strategic Communications Mobile Marketing PPC E-commerce Media Planning Digital Media Web Analytics Online Advertising Marketing Communications Facebook Marketing digital Publicidad en Internet Marketing en motores de... Marketing en Internet Marketing móvil Estrategia digital Análisis web Comercio electrónico Medios digitales Optimización en... See 20+     See less Public Relations Communication Coordinating Events SEO SEM Corporate Branding Performing Search Advertising Yahoo Search Marketing Google Adwords Google Analytics Online Marketing Digital Strategy Web Marketing Digital Marketing Strategic Communications Mobile Marketing PPC E-commerce Media Planning Digital Media Web Analytics Online Advertising Marketing Communications Facebook Marketing digital Publicidad en Internet Marketing en motores de... Marketing en Internet Marketing móvil Estrategia digital Análisis web Comercio electrónico Medios digitales Optimización en... See 20+     See less Public Relations Communication Coordinating Events SEO SEM Corporate Branding Performing Search Advertising Yahoo Search Marketing Google Adwords Google Analytics Online Marketing Digital Strategy Web Marketing Digital Marketing Strategic Communications Mobile Marketing PPC E-commerce Media Planning Digital Media Web Analytics Online Advertising Marketing Communications Facebook Marketing digital Publicidad en Internet Marketing en motores de... Marketing en Internet Marketing móvil Estrategia digital Análisis web Comercio electrónico Medios digitales Optimización en... See 20+     See less Education Universidad de la Marina Mercante Lic. Relaciones Públicas,  Estudios sobre comunicación y medios 2008  – 2012 Universidad de la Marina Mercante Lic. Relaciones Públicas,  Estudios sobre comunicación y medios 2008  – 2012 Universidad de la Marina Mercante Lic. Relaciones Públicas,  Estudios sobre comunicación y medios 2008  – 2012 Universidad de la Marina Mercante Lic. Relaciones Públicas,  Estudios sobre comunicación y medios 2008  – 2012 Honors & Awards Olimpíadas nacionales de Relaciones Públicas 2012 Agentinean Public Relations Professional Bureau October 2012 Obtención de la medalla de oro producto del desempeño realizado frente a una situación critica empresarial en el cual participaron más de 150 estudiantes de Relaciones Públicas de todo el país. Olimpíadas nacionales de Relaciones Públicas 2012 Agentinean Public Relations Professional Bureau October 2012 Obtención de la medalla de oro producto del desempeño realizado frente a una situación critica empresarial en el cual participaron más de 150 estudiantes de Relaciones Públicas de todo el país. Olimpíadas nacionales de Relaciones Públicas 2012 Agentinean Public Relations Professional Bureau October 2012 Obtención de la medalla de oro producto del desempeño realizado frente a una situación critica empresarial en el cual participaron más de 150 estudiantes de Relaciones Públicas de todo el país. Olimpíadas nacionales de Relaciones Públicas 2012 Agentinean Public Relations Professional Bureau October 2012 Obtención de la medalla de oro producto del desempeño realizado frente a una situación critica empresarial en el cual participaron más de 150 estudiantes de Relaciones Públicas de todo el país. ", "Experience Search Group Head Yahoo May 2014  – Present (1 year 4 months) London, United Kingdom Senior Account Manager Yahoo August 2013  – Present (2 years 1 month) London, United Kingdom Senior Search Creative Strategist Yahoo! October 2008  –  August 2013  (4 years 11 months) Copywriter Media Contacts April 2008  –  October 2008  (7 months) Senior UK Editor Yahoo! November 2005  –  April 2008  (2 years 6 months) Uk Editor Yahoo! Search Marketing 2004  –  2007  (3 years) Uk Editor Yahoo! Search Marketing 2003  –  2007  (4 years) Uk Editor Yahoo! Search Marketing January 2003  –  November 2005  (2 years 11 months) media analyst business and finance 2000  –  2002  (2 years) Search Group Head Yahoo May 2014  – Present (1 year 4 months) London, United Kingdom Search Group Head Yahoo May 2014  – Present (1 year 4 months) London, United Kingdom Senior Account Manager Yahoo August 2013  – Present (2 years 1 month) London, United Kingdom Senior Account Manager Yahoo August 2013  – Present (2 years 1 month) London, United Kingdom Senior Search Creative Strategist Yahoo! October 2008  –  August 2013  (4 years 11 months) Senior Search Creative Strategist Yahoo! October 2008  –  August 2013  (4 years 11 months) Copywriter Media Contacts April 2008  –  October 2008  (7 months) Copywriter Media Contacts April 2008  –  October 2008  (7 months) Senior UK Editor Yahoo! November 2005  –  April 2008  (2 years 6 months) Senior UK Editor Yahoo! November 2005  –  April 2008  (2 years 6 months) Uk Editor Yahoo! Search Marketing 2004  –  2007  (3 years) Uk Editor Yahoo! Search Marketing 2004  –  2007  (3 years) Uk Editor Yahoo! Search Marketing 2003  –  2007  (4 years) Uk Editor Yahoo! Search Marketing 2003  –  2007  (4 years) Uk Editor Yahoo! Search Marketing January 2003  –  November 2005  (2 years 11 months) Uk Editor Yahoo! Search Marketing January 2003  –  November 2005  (2 years 11 months) media analyst business and finance 2000  –  2002  (2 years) media analyst business and finance 2000  –  2002  (2 years) Skills PPC SEM Digital Media Search Advertising Digital Strategy Display Advertising Online Advertising Web Analytics Yahoo Search Marketing Digital Marketing Mobile Marketing Mobile Advertising Skills  PPC SEM Digital Media Search Advertising Digital Strategy Display Advertising Online Advertising Web Analytics Yahoo Search Marketing Digital Marketing Mobile Marketing Mobile Advertising PPC SEM Digital Media Search Advertising Digital Strategy Display Advertising Online Advertising Web Analytics Yahoo Search Marketing Digital Marketing Mobile Marketing Mobile Advertising PPC SEM Digital Media Search Advertising Digital Strategy Display Advertising Online Advertising Web Analytics Yahoo Search Marketing Digital Marketing Mobile Marketing Mobile Advertising ", "Summary Field Account Lead -Search/Native Advertising  \nSeasoned in Search Account Management and passionate about Digital Marketing.  \nBuilding solid,long term partnerships with advertisers has been my focus for the last 6 years  \nAs an Account Lead, I coach and mentor new account managers and provide them with field expertise. Consistently looking for areas of growth and opportunity.  Summary Field Account Lead -Search/Native Advertising  \nSeasoned in Search Account Management and passionate about Digital Marketing.  \nBuilding solid,long term partnerships with advertisers has been my focus for the last 6 years  \nAs an Account Lead, I coach and mentor new account managers and provide them with field expertise. Consistently looking for areas of growth and opportunity.  Field Account Lead -Search/Native Advertising  \nSeasoned in Search Account Management and passionate about Digital Marketing.  \nBuilding solid,long term partnerships with advertisers has been my focus for the last 6 years  \nAs an Account Lead, I coach and mentor new account managers and provide them with field expertise. Consistently looking for areas of growth and opportunity.  Field Account Lead -Search/Native Advertising  \nSeasoned in Search Account Management and passionate about Digital Marketing.  \nBuilding solid,long term partnerships with advertisers has been my focus for the last 6 years  \nAs an Account Lead, I coach and mentor new account managers and provide them with field expertise. Consistently looking for areas of growth and opportunity.  Experience Account Lead Yahoo July 2013  – Present (2 years 2 months) Burbank, California Senior Account Manager Yahoo! February 2012  – Present (3 years 7 months) Burbank, CA Search Account Manager Creative Strategist Yahoo! April 2010  –  February 2012  (1 year 11 months) Burbank Client Solutions Rep -APT Display Platform Yahoo! September 2008  –  April 2010  (1 year 8 months) Burbank Project Manager Megasys Inc May 2001  –  June 2006  (5 years 2 months) Account Lead Yahoo July 2013  – Present (2 years 2 months) Burbank, California Account Lead Yahoo July 2013  – Present (2 years 2 months) Burbank, California Senior Account Manager Yahoo! February 2012  – Present (3 years 7 months) Burbank, CA Search Account Manager Senior Account Manager Yahoo! February 2012  – Present (3 years 7 months) Burbank, CA Search Account Manager Creative Strategist Yahoo! April 2010  –  February 2012  (1 year 11 months) Burbank Creative Strategist Yahoo! April 2010  –  February 2012  (1 year 11 months) Burbank Client Solutions Rep -APT Display Platform Yahoo! September 2008  –  April 2010  (1 year 8 months) Burbank Client Solutions Rep -APT Display Platform Yahoo! September 2008  –  April 2010  (1 year 8 months) Burbank Project Manager Megasys Inc May 2001  –  June 2006  (5 years 2 months) Project Manager Megasys Inc May 2001  –  June 2006  (5 years 2 months) Skills SEM Online Advertising Digital Marketing PPC Mobile Marketing Web Analytics Display Advertising Search Advertising Google Adwords Skills  SEM Online Advertising Digital Marketing PPC Mobile Marketing Web Analytics Display Advertising Search Advertising Google Adwords SEM Online Advertising Digital Marketing PPC Mobile Marketing Web Analytics Display Advertising Search Advertising Google Adwords SEM Online Advertising Digital Marketing PPC Mobile Marketing Web Analytics Display Advertising Search Advertising Google Adwords Education California State University-Long Beach Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General California State University-Long Beach Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General California State University-Long Beach Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General California State University-Long Beach Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General ", "Summary Passionné par Internet depuis toujours, je me suis intéressé aux langages de programmation. Actuellement chez Yahoo, j'ai d'abord réalisé de nombreux sites web via mon école (l'Institut de l'Internet et du Multimédia : IIM) et mon auto-entreprise. \n \nDurant mes études, je me suis vite aperçu qu'il y avait une réelle demande pour le référencement que ce soit en SEO ou SEA. Je me suis donc intéressé au e-business et plus particulièrement au SEA à travers mes stages et mon auto-entreprise. Summary Passionné par Internet depuis toujours, je me suis intéressé aux langages de programmation. Actuellement chez Yahoo, j'ai d'abord réalisé de nombreux sites web via mon école (l'Institut de l'Internet et du Multimédia : IIM) et mon auto-entreprise. \n \nDurant mes études, je me suis vite aperçu qu'il y avait une réelle demande pour le référencement que ce soit en SEO ou SEA. Je me suis donc intéressé au e-business et plus particulièrement au SEA à travers mes stages et mon auto-entreprise. Passionné par Internet depuis toujours, je me suis intéressé aux langages de programmation. Actuellement chez Yahoo, j'ai d'abord réalisé de nombreux sites web via mon école (l'Institut de l'Internet et du Multimédia : IIM) et mon auto-entreprise. \n \nDurant mes études, je me suis vite aperçu qu'il y avait une réelle demande pour le référencement que ce soit en SEO ou SEA. Je me suis donc intéressé au e-business et plus particulièrement au SEA à travers mes stages et mon auto-entreprise. Passionné par Internet depuis toujours, je me suis intéressé aux langages de programmation. Actuellement chez Yahoo, j'ai d'abord réalisé de nombreux sites web via mon école (l'Institut de l'Internet et du Multimédia : IIM) et mon auto-entreprise. \n \nDurant mes études, je me suis vite aperçu qu'il y avait une réelle demande pour le référencement que ce soit en SEO ou SEA. Je me suis donc intéressé au e-business et plus particulièrement au SEA à travers mes stages et mon auto-entreprise. Experience Search Creative Strategist (Analyste de compte Search - SEA) Yahoo September 2014  – Present (1 year) Paris 75017 Mon travail à plusieurs aspects : \n- La compréhension des besoins des clients pour optimiser leurs comptes en fonction de leurs objectifs : coûts d’acquisitions, taux de clics ou ROI (Retour sur Investissements) \n- Proposer des solutions \n- Gestion opérationnelle : proposition de mots-clés, estimation potentiel de trafic, rédaction d’annonces publicitaires, recommandation d’enchères \n- Analyses éditoriales : bilan de campagnes, études concurrentielles, recommandations stratégiques \n- Contacts clients : rendez-vous agences et annonceurs \n- Expertise sectorielle sur plusieurs univers : Auto, Finance, Telco, Techno et Entertainment \n \nSME (Subject Matter Expertise) : \n- UET (Universal Event Tracking - tag Microsoft) - Point de contact Europe pour partager l'implémentation des tags au niveau technique avec les équipes Yahoo en Europe \n- DOT (Yahoo tag) - Point de contact Europe pour partager l'implémentation des tags au niveau technique avec les équipes Yahoo en Europe \n- Tag manager \n Loïc PAGNY - www.loic-pagny.com Auto-entrepreneur : Référencement et développement de sites January 2011  –  April 2015  (4 years 4 months) Auto-entrepreneur, je développe des sites internet en permettant à mes clients d'être visible sur internet via différents leviers marketing comme par exemple le référencement SEO et SEA (Référencement naturel et Adwords) \n Stagiaire Search Creative Strategist SEA Yahoo February 2014  –  July 2014  (6 months) Paris Mon stage de 6 mois s’est déroulé en trois étapes : \n- La première étape consiste à appréhender les différents outils nécessaires pour analyser les comptes de référencement des clients. J’ai commencé à travailler en tant que « support » pour les autres personnes de mon équipe. \n- La seconde étape (2ème mois), j’ai commencé à travailler directement pour des clients du secteur Automobile qui m’ont été confiés personnellement. \n- La 3ème étape (après 3 mois et demi de stage), j’ai eu la responsabilité de m’occuper en plus des clients du secteur Automobile, de clients des Télécoms, des Technologies et des Divertissements. \n Consultant en Liens Sponsorisés - SEA Netbooster July 2012  –  January 2013  (7 months) - Assister les consultants SEM dans la gestion de leurs portefeuilles clients \n- Mettre en ligne des campagnes de Liens Sponsorisés en France et à l’étranger \n- Comprendre et intégrer les objectifs des clients en termes de stratégie de communication & marketing \n- Réaliser des audits marketing, et recommandations \n- Optimisations des campagnes \n- Réaliser des bilans de campagnes et analyser les indicateurs de performances (ROI, CPA…) Search Creative Strategist (Analyste de compte Search - SEA) Yahoo September 2014  – Present (1 year) Paris 75017 Mon travail à plusieurs aspects : \n- La compréhension des besoins des clients pour optimiser leurs comptes en fonction de leurs objectifs : coûts d’acquisitions, taux de clics ou ROI (Retour sur Investissements) \n- Proposer des solutions \n- Gestion opérationnelle : proposition de mots-clés, estimation potentiel de trafic, rédaction d’annonces publicitaires, recommandation d’enchères \n- Analyses éditoriales : bilan de campagnes, études concurrentielles, recommandations stratégiques \n- Contacts clients : rendez-vous agences et annonceurs \n- Expertise sectorielle sur plusieurs univers : Auto, Finance, Telco, Techno et Entertainment \n \nSME (Subject Matter Expertise) : \n- UET (Universal Event Tracking - tag Microsoft) - Point de contact Europe pour partager l'implémentation des tags au niveau technique avec les équipes Yahoo en Europe \n- DOT (Yahoo tag) - Point de contact Europe pour partager l'implémentation des tags au niveau technique avec les équipes Yahoo en Europe \n- Tag manager \n Search Creative Strategist (Analyste de compte Search - SEA) Yahoo September 2014  – Present (1 year) Paris 75017 Mon travail à plusieurs aspects : \n- La compréhension des besoins des clients pour optimiser leurs comptes en fonction de leurs objectifs : coûts d’acquisitions, taux de clics ou ROI (Retour sur Investissements) \n- Proposer des solutions \n- Gestion opérationnelle : proposition de mots-clés, estimation potentiel de trafic, rédaction d’annonces publicitaires, recommandation d’enchères \n- Analyses éditoriales : bilan de campagnes, études concurrentielles, recommandations stratégiques \n- Contacts clients : rendez-vous agences et annonceurs \n- Expertise sectorielle sur plusieurs univers : Auto, Finance, Telco, Techno et Entertainment \n \nSME (Subject Matter Expertise) : \n- UET (Universal Event Tracking - tag Microsoft) - Point de contact Europe pour partager l'implémentation des tags au niveau technique avec les équipes Yahoo en Europe \n- DOT (Yahoo tag) - Point de contact Europe pour partager l'implémentation des tags au niveau technique avec les équipes Yahoo en Europe \n- Tag manager \n Loïc PAGNY - www.loic-pagny.com Auto-entrepreneur : Référencement et développement de sites January 2011  –  April 2015  (4 years 4 months) Auto-entrepreneur, je développe des sites internet en permettant à mes clients d'être visible sur internet via différents leviers marketing comme par exemple le référencement SEO et SEA (Référencement naturel et Adwords) \n Loïc PAGNY - www.loic-pagny.com Auto-entrepreneur : Référencement et développement de sites January 2011  –  April 2015  (4 years 4 months) Auto-entrepreneur, je développe des sites internet en permettant à mes clients d'être visible sur internet via différents leviers marketing comme par exemple le référencement SEO et SEA (Référencement naturel et Adwords) \n Stagiaire Search Creative Strategist SEA Yahoo February 2014  –  July 2014  (6 months) Paris Mon stage de 6 mois s’est déroulé en trois étapes : \n- La première étape consiste à appréhender les différents outils nécessaires pour analyser les comptes de référencement des clients. J’ai commencé à travailler en tant que « support » pour les autres personnes de mon équipe. \n- La seconde étape (2ème mois), j’ai commencé à travailler directement pour des clients du secteur Automobile qui m’ont été confiés personnellement. \n- La 3ème étape (après 3 mois et demi de stage), j’ai eu la responsabilité de m’occuper en plus des clients du secteur Automobile, de clients des Télécoms, des Technologies et des Divertissements. \n Stagiaire Search Creative Strategist SEA Yahoo February 2014  –  July 2014  (6 months) Paris Mon stage de 6 mois s’est déroulé en trois étapes : \n- La première étape consiste à appréhender les différents outils nécessaires pour analyser les comptes de référencement des clients. J’ai commencé à travailler en tant que « support » pour les autres personnes de mon équipe. \n- La seconde étape (2ème mois), j’ai commencé à travailler directement pour des clients du secteur Automobile qui m’ont été confiés personnellement. \n- La 3ème étape (après 3 mois et demi de stage), j’ai eu la responsabilité de m’occuper en plus des clients du secteur Automobile, de clients des Télécoms, des Technologies et des Divertissements. \n Consultant en Liens Sponsorisés - SEA Netbooster July 2012  –  January 2013  (7 months) - Assister les consultants SEM dans la gestion de leurs portefeuilles clients \n- Mettre en ligne des campagnes de Liens Sponsorisés en France et à l’étranger \n- Comprendre et intégrer les objectifs des clients en termes de stratégie de communication & marketing \n- Réaliser des audits marketing, et recommandations \n- Optimisations des campagnes \n- Réaliser des bilans de campagnes et analyser les indicateurs de performances (ROI, CPA…) Consultant en Liens Sponsorisés - SEA Netbooster July 2012  –  January 2013  (7 months) - Assister les consultants SEM dans la gestion de leurs portefeuilles clients \n- Mettre en ligne des campagnes de Liens Sponsorisés en France et à l’étranger \n- Comprendre et intégrer les objectifs des clients en termes de stratégie de communication & marketing \n- Réaliser des audits marketing, et recommandations \n- Optimisations des campagnes \n- Réaliser des bilans de campagnes et analyser les indicateurs de performances (ROI, CPA…) Languages Français Native or bilingual proficiency Anglais Professional working proficiency Français Native or bilingual proficiency Anglais Professional working proficiency Français Native or bilingual proficiency Anglais Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills SEO HTML Photoshop CSS SEA Google Adwords Tracking UET (Universal Event... DOT (Smart pixel -... PHP Expérience utilisateur User Experience Skills  SEO HTML Photoshop CSS SEA Google Adwords Tracking UET (Universal Event... DOT (Smart pixel -... PHP Expérience utilisateur User Experience SEO HTML Photoshop CSS SEA Google Adwords Tracking UET (Universal Event... DOT (Smart pixel -... PHP Expérience utilisateur User Experience SEO HTML Photoshop CSS SEA Google Adwords Tracking UET (Universal Event... DOT (Smart pixel -... PHP Expérience utilisateur User Experience Education Institut Internet et Multimédia - Pôle Léonard de Vinci Manager de la communication numérique,  Web & E-business 2009  – 2014 Content learned in the Web & E-business option: \n \n> From the preparatory year for 3 years: \n- Development Front-off: HTML / CSS - Javascript \n- Back-off development: PhpMySQL Action Script - Ruby on Rails - Symfony2 \n- Development Mobile: iOS (Objective-C for iPhone - iPad ...) and Android (Java) \n- CMS: WordPress, Drupal, Prestashop \n- Technical Hacking and server security \n- User Experience, ergonomics \n- Webdesign: Photoshop, Lightroom \n- Management of Digital Project: classic, agile method (Scrum), pert, glove ... \n- Management: production team management \n \n> From Year 4 Year 5: \n- E-marketing (Digital Strategy - Viral Marketing - Community Management, Development trafficking, relational device loyalty, CRM, cross-channel strategy ...) \n- E-Business: Service Development, Entrepreneurship \n- Human resources \n- Finance: Business plan, fundraising \n- Law and Taxation: Contractor Tax, Trademark Law \n Lycée Lakanal Baccalauréat S,  Physique 2005  – 2009 Institut Internet et Multimédia - Pôle Léonard de Vinci Manager de la communication numérique,  Web & E-business 2009  – 2014 Content learned in the Web & E-business option: \n \n> From the preparatory year for 3 years: \n- Development Front-off: HTML / CSS - Javascript \n- Back-off development: PhpMySQL Action Script - Ruby on Rails - Symfony2 \n- Development Mobile: iOS (Objective-C for iPhone - iPad ...) and Android (Java) \n- CMS: WordPress, Drupal, Prestashop \n- Technical Hacking and server security \n- User Experience, ergonomics \n- Webdesign: Photoshop, Lightroom \n- Management of Digital Project: classic, agile method (Scrum), pert, glove ... \n- Management: production team management \n \n> From Year 4 Year 5: \n- E-marketing (Digital Strategy - Viral Marketing - Community Management, Development trafficking, relational device loyalty, CRM, cross-channel strategy ...) \n- E-Business: Service Development, Entrepreneurship \n- Human resources \n- Finance: Business plan, fundraising \n- Law and Taxation: Contractor Tax, Trademark Law \n Institut Internet et Multimédia - Pôle Léonard de Vinci Manager de la communication numérique,  Web & E-business 2009  – 2014 Content learned in the Web & E-business option: \n \n> From the preparatory year for 3 years: \n- Development Front-off: HTML / CSS - Javascript \n- Back-off development: PhpMySQL Action Script - Ruby on Rails - Symfony2 \n- Development Mobile: iOS (Objective-C for iPhone - iPad ...) and Android (Java) \n- CMS: WordPress, Drupal, Prestashop \n- Technical Hacking and server security \n- User Experience, ergonomics \n- Webdesign: Photoshop, Lightroom \n- Management of Digital Project: classic, agile method (Scrum), pert, glove ... \n- Management: production team management \n \n> From Year 4 Year 5: \n- E-marketing (Digital Strategy - Viral Marketing - Community Management, Development trafficking, relational device loyalty, CRM, cross-channel strategy ...) \n- E-Business: Service Development, Entrepreneurship \n- Human resources \n- Finance: Business plan, fundraising \n- Law and Taxation: Contractor Tax, Trademark Law \n Institut Internet et Multimédia - Pôle Léonard de Vinci Manager de la communication numérique,  Web & E-business 2009  – 2014 Content learned in the Web & E-business option: \n \n> From the preparatory year for 3 years: \n- Development Front-off: HTML / CSS - Javascript \n- Back-off development: PhpMySQL Action Script - Ruby on Rails - Symfony2 \n- Development Mobile: iOS (Objective-C for iPhone - iPad ...) and Android (Java) \n- CMS: WordPress, Drupal, Prestashop \n- Technical Hacking and server security \n- User Experience, ergonomics \n- Webdesign: Photoshop, Lightroom \n- Management of Digital Project: classic, agile method (Scrum), pert, glove ... \n- Management: production team management \n \n> From Year 4 Year 5: \n- E-marketing (Digital Strategy - Viral Marketing - Community Management, Development trafficking, relational device loyalty, CRM, cross-channel strategy ...) \n- E-Business: Service Development, Entrepreneurship \n- Human resources \n- Finance: Business plan, fundraising \n- Law and Taxation: Contractor Tax, Trademark Law \n Lycée Lakanal Baccalauréat S,  Physique 2005  – 2009 Lycée Lakanal Baccalauréat S,  Physique 2005  – 2009 Lycée Lakanal Baccalauréat S,  Physique 2005  – 2009 Honors & Awards ", "Experience Creative Lead Yahoo April 2015  – Present (5 months) Greater Omaha Area -Consistently meet advertisers Search and Native needs and goals through strategic optimizations for their paid per click campaigns on the Yahoo Bing Network and Yahoo Gemini. \n-Work extensively with product teams which results in numerous improvements within the tools, bug fixes, enhancements to internal and client facing user interface.  \n-Mentor new hires and existing team members to help them discover new best practices and innovate on existing tools and methodologies. \n Senior Creative Strategist Yahoo! March 2013  –  April 2015  (2 years 2 months) Greater Omaha Area -Partnered directly with advertisers at all levels of the organization; identified opportunities and promoted behavior that encouraged spend with the Yahoo Bing Network. \n-Acted as a dynamic leader and coach to my internal team members and external clients, including the Retail specific vertical and Comparison Shopping Engines. \n Creative Strategist Yahoo! August 2011  –  March 2013  (1 year 8 months) -Optimized relevant keywords, created effective ad copy and restructured paid search advertisers accounts to maximize on ad spend. \n-Partnered with Search Account Managers and Associate Account Managers to strategically build search marketing campaigns to reflect retail specific insights.  \n-Demonstrated expertise with respect to editorial guidelines and search marketing best practices. Associate Account Manager Yahoo! December 2009  –  August 2011  (1 year 9 months) -Supported Sponsored Search Account Managers in the Retail Vertical by providing assistance with Reporting, Campaign Optimization, Cross-sells, Up-sells, New Business set-up and Finance related issues.  \n-Partnered with Search Marketing Advertisers to help maximize ROI, analyze performance data and proactively seek out implementation opportunities while maintaining a professional relationship. \n-Highly involved Search Matters Expert for Yahoo! Finance team, Training team, The Source and lead trainer for temporary employees during Search Alliance Transition. Refined processes by identifying more effective techniques for internal teams to implement.  \n-Assisted current management with the hire of Associate Account Managers in Mid-Market and Field sales. Sales Assistant Radio Engineering Industries March 2009  –  December 2009  (10 months) -Provided administrative support to the engineering, sales and marketing teams. Assist with preparation for bid presentations using Microsoft Word and Microsoft Power Point.  \n-Developed and maintained business relationships with internal and external vendors. Negotiated and managed trade show and convention proposals. Marketing Specialist University of Nebraska-Lincoln October 2008  –  March 2009  (6 months) -Planned, coordinated and organized special events, monthly/holiday promotions, prepared copywrite for department website and university-wide electronic mail-out.  \n-Worked closely with management to implement marketing plans as an end result to create awareness and increase profits. Market Research Analyst FirstComp Insurance June 2007  –  June 2008  (1 year 1 month) -Liaised between Sales Manager and Underwriter to ensure accuracy, determined pricing inefficiencies, and maintained client accounts for states of Maryland and Pennsylvania. \n-Received FirstComp award for generating $238,000 in insurance revenues while collaborating with newly appointed agents in the state of Florida in December 2007. Creative Lead Yahoo April 2015  – Present (5 months) Greater Omaha Area -Consistently meet advertisers Search and Native needs and goals through strategic optimizations for their paid per click campaigns on the Yahoo Bing Network and Yahoo Gemini. \n-Work extensively with product teams which results in numerous improvements within the tools, bug fixes, enhancements to internal and client facing user interface.  \n-Mentor new hires and existing team members to help them discover new best practices and innovate on existing tools and methodologies. \n Creative Lead Yahoo April 2015  – Present (5 months) Greater Omaha Area -Consistently meet advertisers Search and Native needs and goals through strategic optimizations for their paid per click campaigns on the Yahoo Bing Network and Yahoo Gemini. \n-Work extensively with product teams which results in numerous improvements within the tools, bug fixes, enhancements to internal and client facing user interface.  \n-Mentor new hires and existing team members to help them discover new best practices and innovate on existing tools and methodologies. \n Senior Creative Strategist Yahoo! March 2013  –  April 2015  (2 years 2 months) Greater Omaha Area -Partnered directly with advertisers at all levels of the organization; identified opportunities and promoted behavior that encouraged spend with the Yahoo Bing Network. \n-Acted as a dynamic leader and coach to my internal team members and external clients, including the Retail specific vertical and Comparison Shopping Engines. \n Senior Creative Strategist Yahoo! March 2013  –  April 2015  (2 years 2 months) Greater Omaha Area -Partnered directly with advertisers at all levels of the organization; identified opportunities and promoted behavior that encouraged spend with the Yahoo Bing Network. \n-Acted as a dynamic leader and coach to my internal team members and external clients, including the Retail specific vertical and Comparison Shopping Engines. \n Creative Strategist Yahoo! August 2011  –  March 2013  (1 year 8 months) -Optimized relevant keywords, created effective ad copy and restructured paid search advertisers accounts to maximize on ad spend. \n-Partnered with Search Account Managers and Associate Account Managers to strategically build search marketing campaigns to reflect retail specific insights.  \n-Demonstrated expertise with respect to editorial guidelines and search marketing best practices. Creative Strategist Yahoo! August 2011  –  March 2013  (1 year 8 months) -Optimized relevant keywords, created effective ad copy and restructured paid search advertisers accounts to maximize on ad spend. \n-Partnered with Search Account Managers and Associate Account Managers to strategically build search marketing campaigns to reflect retail specific insights.  \n-Demonstrated expertise with respect to editorial guidelines and search marketing best practices. Associate Account Manager Yahoo! December 2009  –  August 2011  (1 year 9 months) -Supported Sponsored Search Account Managers in the Retail Vertical by providing assistance with Reporting, Campaign Optimization, Cross-sells, Up-sells, New Business set-up and Finance related issues.  \n-Partnered with Search Marketing Advertisers to help maximize ROI, analyze performance data and proactively seek out implementation opportunities while maintaining a professional relationship. \n-Highly involved Search Matters Expert for Yahoo! Finance team, Training team, The Source and lead trainer for temporary employees during Search Alliance Transition. Refined processes by identifying more effective techniques for internal teams to implement.  \n-Assisted current management with the hire of Associate Account Managers in Mid-Market and Field sales. Associate Account Manager Yahoo! December 2009  –  August 2011  (1 year 9 months) -Supported Sponsored Search Account Managers in the Retail Vertical by providing assistance with Reporting, Campaign Optimization, Cross-sells, Up-sells, New Business set-up and Finance related issues.  \n-Partnered with Search Marketing Advertisers to help maximize ROI, analyze performance data and proactively seek out implementation opportunities while maintaining a professional relationship. \n-Highly involved Search Matters Expert for Yahoo! Finance team, Training team, The Source and lead trainer for temporary employees during Search Alliance Transition. Refined processes by identifying more effective techniques for internal teams to implement.  \n-Assisted current management with the hire of Associate Account Managers in Mid-Market and Field sales. Sales Assistant Radio Engineering Industries March 2009  –  December 2009  (10 months) -Provided administrative support to the engineering, sales and marketing teams. Assist with preparation for bid presentations using Microsoft Word and Microsoft Power Point.  \n-Developed and maintained business relationships with internal and external vendors. Negotiated and managed trade show and convention proposals. Sales Assistant Radio Engineering Industries March 2009  –  December 2009  (10 months) -Provided administrative support to the engineering, sales and marketing teams. Assist with preparation for bid presentations using Microsoft Word and Microsoft Power Point.  \n-Developed and maintained business relationships with internal and external vendors. Negotiated and managed trade show and convention proposals. Marketing Specialist University of Nebraska-Lincoln October 2008  –  March 2009  (6 months) -Planned, coordinated and organized special events, monthly/holiday promotions, prepared copywrite for department website and university-wide electronic mail-out.  \n-Worked closely with management to implement marketing plans as an end result to create awareness and increase profits. Marketing Specialist University of Nebraska-Lincoln October 2008  –  March 2009  (6 months) -Planned, coordinated and organized special events, monthly/holiday promotions, prepared copywrite for department website and university-wide electronic mail-out.  \n-Worked closely with management to implement marketing plans as an end result to create awareness and increase profits. Market Research Analyst FirstComp Insurance June 2007  –  June 2008  (1 year 1 month) -Liaised between Sales Manager and Underwriter to ensure accuracy, determined pricing inefficiencies, and maintained client accounts for states of Maryland and Pennsylvania. \n-Received FirstComp award for generating $238,000 in insurance revenues while collaborating with newly appointed agents in the state of Florida in December 2007. Market Research Analyst FirstComp Insurance June 2007  –  June 2008  (1 year 1 month) -Liaised between Sales Manager and Underwriter to ensure accuracy, determined pricing inefficiencies, and maintained client accounts for states of Maryland and Pennsylvania. \n-Received FirstComp award for generating $238,000 in insurance revenues while collaborating with newly appointed agents in the state of Florida in December 2007. Skills SEM Search Advertising Online Advertising CRM MSN AdCenter Yahoo Search Marketing Yahoo Search Microsoft Office PPC Skills  SEM Search Advertising Online Advertising CRM MSN AdCenter Yahoo Search Marketing Yahoo Search Microsoft Office PPC SEM Search Advertising Online Advertising CRM MSN AdCenter Yahoo Search Marketing Yahoo Search Microsoft Office PPC SEM Search Advertising Online Advertising CRM MSN AdCenter Yahoo Search Marketing Yahoo Search Microsoft Office PPC Education Doane College Master of Arts (M.A.),  Business Administration , Management and Operations , 4.0 2013  – 2015 University of Nebraska-Lincoln Bachelor,  Marketing 2002  – 2007 Activities and Societies:  American Marketing Association-UNL Chapter\nAmerican Cancer Society-UNL Chapter Doane College Master of Arts (M.A.),  Business Administration , Management and Operations , 4.0 2013  – 2015 Doane College Master of Arts (M.A.),  Business Administration , Management and Operations , 4.0 2013  – 2015 Doane College Master of Arts (M.A.),  Business Administration , Management and Operations , 4.0 2013  – 2015 University of Nebraska-Lincoln Bachelor,  Marketing 2002  – 2007 Activities and Societies:  American Marketing Association-UNL Chapter\nAmerican Cancer Society-UNL Chapter University of Nebraska-Lincoln Bachelor,  Marketing 2002  – 2007 Activities and Societies:  American Marketing Association-UNL Chapter\nAmerican Cancer Society-UNL Chapter University of Nebraska-Lincoln Bachelor,  Marketing 2002  – 2007 Activities and Societies:  American Marketing Association-UNL Chapter\nAmerican Cancer Society-UNL Chapter ", "Experience Senior Creative Strategist Yahoo April 2014  – Present (1 year 5 months) Creative Strategist Yahoo! May 2012  – Present (3 years 4 months) Senior Creative Strategist Yahoo April 2014  – Present (1 year 5 months) Senior Creative Strategist Yahoo April 2014  – Present (1 year 5 months) Creative Strategist Yahoo! May 2012  – Present (3 years 4 months) Creative Strategist Yahoo! May 2012  – Present (3 years 4 months) Skills Skills     Honors & Awards ", "Experience Senior Account Manager Yahoo January 2014  – Present (1 year 8 months) Search Marketing Account Manager supporting Yahoo!s premium advertisers in the Pharma vertical. Senior Creative Strategist Yahoo! March 2013  –  January 2014  (11 months) •\tWork with our top Pharma and CPG clients to identify, prioritize and provide necessary service and pro-active advice for improvement of assigned accounts either through best practice implementation, account analysis, and/or category expertise. \n•\tIdentify opportunities and promote behavior that grows spends with Yahoo! but also ensures long-term client success. \n•\tCommunicate Yahoo! guidelines and search marketing best practices to all levels of our advertisers organizations. Creative Strategist Yahoo! September 2011  –  January 2014  (2 years 5 months) Omaha •\tWork with our top premium Agencies to identify, prioritize and provide necessary service and pro-active advice for improvement of assigned accounts either through best practice implementation, account analysis, and/or category expertise. \n•\tIdentify opportunities and promote behavior that grows spends with Yahoo! but also ensures long-term client success. \n•\tCommunicate Yahoo! guidelines and search marketing best practices to all levels of our advertisers organizations. Associate Account Manager Yahoo! November 2009  –  September 2011  (1 year 11 months) I work with the Agency Services team at Yahoo! helping Account Managers optimize clients sponsored search advertising with Yahoo! \nI am responsible for playing a key role in supporting our Sales force by managing the day-to-day processes involved in launching, maintaining and optimizing advertising campaigns. \n \nResponsibilities include: \n-Working directly with Account Managers, Account Executives and clients directly to provide support with client needs. \n-Key client contact on billing related issues (Insertion Orders, Invoicing, etc) \n-Running reports on advertiser performance \n-Delegating tasks to internal operations teams and overseeing process through to completion \n-Deliver ad specs to clients and providing screenshots of live placements as requested \n-Processing and responding to RFPs for designated Sales Personnel \n-Utilizing Y! proprietary tools/systems for creating proposals \n-Obtaining research and case studies for sales presentations when needed \n-Communicating with vendors regarding upcoming campaigns \n-Supporting team in day-to-day tasks and special ad hoc projects \n-Providing coverage for Account Managers while out of the office \n-Work with programs such as MS Suite with focus on Excel, Power Point and Word \n-Proven ability to use and navigate internet search engines as well as competency in navigating internet explorer or similar engines \n-Experience in a cross-sales environment and proven negotiation and influencing skills Student Assistant University Relations October 2005  –  June 2009  (3 years 9 months) Provide office assistance to the office of University Relations by answering phones, taking messages, assist callers with questions, type correspondence, make photocopies, run errands, dispose of office recycling, distribute items, send faxes, file; cut, paste and file newspaper articles, and other duties. Also assist in writing and sending out press releases to student’s hometowns to notify papers of student recognition on campus. Social Networking Intern Northwest Missouri State University September 2008  –  December 2008  (4 months) Help establish University’s presence on social networking sites; Facebook, Myspace, Youtube, Twitter and Linkedin by connecting alumni, current students and future students together to build relationships and increase awareness about the University. Senior Account Manager Yahoo January 2014  – Present (1 year 8 months) Search Marketing Account Manager supporting Yahoo!s premium advertisers in the Pharma vertical. Senior Account Manager Yahoo January 2014  – Present (1 year 8 months) Search Marketing Account Manager supporting Yahoo!s premium advertisers in the Pharma vertical. Senior Creative Strategist Yahoo! March 2013  –  January 2014  (11 months) •\tWork with our top Pharma and CPG clients to identify, prioritize and provide necessary service and pro-active advice for improvement of assigned accounts either through best practice implementation, account analysis, and/or category expertise. \n•\tIdentify opportunities and promote behavior that grows spends with Yahoo! but also ensures long-term client success. \n•\tCommunicate Yahoo! guidelines and search marketing best practices to all levels of our advertisers organizations. Senior Creative Strategist Yahoo! March 2013  –  January 2014  (11 months) •\tWork with our top Pharma and CPG clients to identify, prioritize and provide necessary service and pro-active advice for improvement of assigned accounts either through best practice implementation, account analysis, and/or category expertise. \n•\tIdentify opportunities and promote behavior that grows spends with Yahoo! but also ensures long-term client success. \n•\tCommunicate Yahoo! guidelines and search marketing best practices to all levels of our advertisers organizations. Creative Strategist Yahoo! September 2011  –  January 2014  (2 years 5 months) Omaha •\tWork with our top premium Agencies to identify, prioritize and provide necessary service and pro-active advice for improvement of assigned accounts either through best practice implementation, account analysis, and/or category expertise. \n•\tIdentify opportunities and promote behavior that grows spends with Yahoo! but also ensures long-term client success. \n•\tCommunicate Yahoo! guidelines and search marketing best practices to all levels of our advertisers organizations. Creative Strategist Yahoo! September 2011  –  January 2014  (2 years 5 months) Omaha •\tWork with our top premium Agencies to identify, prioritize and provide necessary service and pro-active advice for improvement of assigned accounts either through best practice implementation, account analysis, and/or category expertise. \n•\tIdentify opportunities and promote behavior that grows spends with Yahoo! but also ensures long-term client success. \n•\tCommunicate Yahoo! guidelines and search marketing best practices to all levels of our advertisers organizations. Associate Account Manager Yahoo! November 2009  –  September 2011  (1 year 11 months) I work with the Agency Services team at Yahoo! helping Account Managers optimize clients sponsored search advertising with Yahoo! \nI am responsible for playing a key role in supporting our Sales force by managing the day-to-day processes involved in launching, maintaining and optimizing advertising campaigns. \n \nResponsibilities include: \n-Working directly with Account Managers, Account Executives and clients directly to provide support with client needs. \n-Key client contact on billing related issues (Insertion Orders, Invoicing, etc) \n-Running reports on advertiser performance \n-Delegating tasks to internal operations teams and overseeing process through to completion \n-Deliver ad specs to clients and providing screenshots of live placements as requested \n-Processing and responding to RFPs for designated Sales Personnel \n-Utilizing Y! proprietary tools/systems for creating proposals \n-Obtaining research and case studies for sales presentations when needed \n-Communicating with vendors regarding upcoming campaigns \n-Supporting team in day-to-day tasks and special ad hoc projects \n-Providing coverage for Account Managers while out of the office \n-Work with programs such as MS Suite with focus on Excel, Power Point and Word \n-Proven ability to use and navigate internet search engines as well as competency in navigating internet explorer or similar engines \n-Experience in a cross-sales environment and proven negotiation and influencing skills Associate Account Manager Yahoo! November 2009  –  September 2011  (1 year 11 months) I work with the Agency Services team at Yahoo! helping Account Managers optimize clients sponsored search advertising with Yahoo! \nI am responsible for playing a key role in supporting our Sales force by managing the day-to-day processes involved in launching, maintaining and optimizing advertising campaigns. \n \nResponsibilities include: \n-Working directly with Account Managers, Account Executives and clients directly to provide support with client needs. \n-Key client contact on billing related issues (Insertion Orders, Invoicing, etc) \n-Running reports on advertiser performance \n-Delegating tasks to internal operations teams and overseeing process through to completion \n-Deliver ad specs to clients and providing screenshots of live placements as requested \n-Processing and responding to RFPs for designated Sales Personnel \n-Utilizing Y! proprietary tools/systems for creating proposals \n-Obtaining research and case studies for sales presentations when needed \n-Communicating with vendors regarding upcoming campaigns \n-Supporting team in day-to-day tasks and special ad hoc projects \n-Providing coverage for Account Managers while out of the office \n-Work with programs such as MS Suite with focus on Excel, Power Point and Word \n-Proven ability to use and navigate internet search engines as well as competency in navigating internet explorer or similar engines \n-Experience in a cross-sales environment and proven negotiation and influencing skills Student Assistant University Relations October 2005  –  June 2009  (3 years 9 months) Provide office assistance to the office of University Relations by answering phones, taking messages, assist callers with questions, type correspondence, make photocopies, run errands, dispose of office recycling, distribute items, send faxes, file; cut, paste and file newspaper articles, and other duties. Also assist in writing and sending out press releases to student’s hometowns to notify papers of student recognition on campus. Student Assistant University Relations October 2005  –  June 2009  (3 years 9 months) Provide office assistance to the office of University Relations by answering phones, taking messages, assist callers with questions, type correspondence, make photocopies, run errands, dispose of office recycling, distribute items, send faxes, file; cut, paste and file newspaper articles, and other duties. Also assist in writing and sending out press releases to student’s hometowns to notify papers of student recognition on campus. Social Networking Intern Northwest Missouri State University September 2008  –  December 2008  (4 months) Help establish University’s presence on social networking sites; Facebook, Myspace, Youtube, Twitter and Linkedin by connecting alumni, current students and future students together to build relationships and increase awareness about the University. Social Networking Intern Northwest Missouri State University September 2008  –  December 2008  (4 months) Help establish University’s presence on social networking sites; Facebook, Myspace, Youtube, Twitter and Linkedin by connecting alumni, current students and future students together to build relationships and increase awareness about the University. Skills Microsoft Excel Search Advertising MSN AdCenter Yahoo Search Marketing Online Advertising SEM PPC Advertising Landing Page... Ad Networks Search Skills  Microsoft Excel Search Advertising MSN AdCenter Yahoo Search Marketing Online Advertising SEM PPC Advertising Landing Page... Ad Networks Search Microsoft Excel Search Advertising MSN AdCenter Yahoo Search Marketing Online Advertising SEM PPC Advertising Landing Page... Ad Networks Search Microsoft Excel Search Advertising MSN AdCenter Yahoo Search Marketing Online Advertising SEM PPC Advertising Landing Page... Ad Networks Search Education Northwest Missouri State University B.S.,  Advertising 2005  – 2009 Activities and Societies:  Gamma Alpha Lambda\nAmerican Marketing Association Northwest Missouri State University B.S.,  Advertising 2005  – 2009 Activities and Societies:  Gamma Alpha Lambda\nAmerican Marketing Association Northwest Missouri State University B.S.,  Advertising 2005  – 2009 Activities and Societies:  Gamma Alpha Lambda\nAmerican Marketing Association Northwest Missouri State University B.S.,  Advertising 2005  – 2009 Activities and Societies:  Gamma Alpha Lambda\nAmerican Marketing Association Honors & Awards 2H 2010 All Star Yahoo Global Knowledge Share May 2012 2H 2010 All Star 2H 2010 All Star 2H 2010 All Star Yahoo Global Knowledge Share May 2012 Yahoo Global Knowledge Share May 2012 Yahoo Global Knowledge Share May 2012 ", "Summary I manage a team of Creative Strategists that focus on search and native for travel, education, online services, cross-marketplace, India and Southeast Asia. \n \nThe Creative Strategy team is part of Yahoo! Sales and acts as a key strategic resource for Yahoo's most valuable advertisers in planning and implementing their search and native marketing efforts. \n \nCreative Strategists are specialists in search and native marketing. Specifically, they develop advertising campaigns, identify relevant keywords, create and test effective ad copy, structure advertisers accounts to maximize their return on investment and push the limits of how the medium can be used to achieve marketing success. Summary I manage a team of Creative Strategists that focus on search and native for travel, education, online services, cross-marketplace, India and Southeast Asia. \n \nThe Creative Strategy team is part of Yahoo! Sales and acts as a key strategic resource for Yahoo's most valuable advertisers in planning and implementing their search and native marketing efforts. \n \nCreative Strategists are specialists in search and native marketing. Specifically, they develop advertising campaigns, identify relevant keywords, create and test effective ad copy, structure advertisers accounts to maximize their return on investment and push the limits of how the medium can be used to achieve marketing success. I manage a team of Creative Strategists that focus on search and native for travel, education, online services, cross-marketplace, India and Southeast Asia. \n \nThe Creative Strategy team is part of Yahoo! Sales and acts as a key strategic resource for Yahoo's most valuable advertisers in planning and implementing their search and native marketing efforts. \n \nCreative Strategists are specialists in search and native marketing. Specifically, they develop advertising campaigns, identify relevant keywords, create and test effective ad copy, structure advertisers accounts to maximize their return on investment and push the limits of how the medium can be used to achieve marketing success. I manage a team of Creative Strategists that focus on search and native for travel, education, online services, cross-marketplace, India and Southeast Asia. \n \nThe Creative Strategy team is part of Yahoo! Sales and acts as a key strategic resource for Yahoo's most valuable advertisers in planning and implementing their search and native marketing efforts. \n \nCreative Strategists are specialists in search and native marketing. Specifically, they develop advertising campaigns, identify relevant keywords, create and test effective ad copy, structure advertisers accounts to maximize their return on investment and push the limits of how the medium can be used to achieve marketing success. Experience Senior Manager - Global Creative Strategy Yahoo April 2014  – Present (1 year 5 months) Burbank, CA Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search and native marketing Creative Strategists focused on travel, education, online services, cross-marketplace, India and Southeast Asia. Manager - Field Creative Strategy Yahoo October 2011  –  April 2014  (2 years 7 months) Greater Los Angeles Area Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search and native marketing Creative \nStrategists focused on travel, education and the Canada and global marketplaces. \n• Featured presenter and panelist at SMX Advanced - presented platform best practices. Senior Supervisor - Field Creative Strategy Yahoo! 2010  –  2011  (1 year) Greater Los Angeles Area Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search marketing Creative \nStrategists focused on west and central regions. Senior Creative Strategist - Mid-market Yahoo! 2008  –  2010  (2 years) Greater Los Angeles Area Responsible for optimization, analysis and growth of advertiser's search marketing campaigns \non Yahoo! \n• Super Star Award for 1H, 2009 - given to top 5% of company. \n• Programming and designed toolset that helped scale a revenue program that grew spend 3.5 \nmillion YoY. \n• Evaluated, helped design and implemented toolsets and system improvements for Microsoft \nSearch Alliance. \n• Programmed multiple excel macros for team that assisted with scaling revenue opportunities \nand sales reporting. \n• Presented an advertising agency road show through Los Angeles, Toronto and New York that \nshowcased the Yahoo/Bing network. \n• Led a Search Alliance webinar for advertisers that received 90%+ satisfaction ratings. \n• Featured presenter and panelist at SMX NY - presented platform best practices. Creative Strategist - Mid-market Yahoo! 2007  –  2008  (1 year) Greater Los Angeles Area Responsible for optimization, analysis and growth of advertiser's search marketing campaigns \non Yahoo! \n• Designed and programmed tools used by internal employees which reduced processes and \ntime spent. \n• Programs were distributed nationally and across European markets. \n• Created analytical Excel sheets to gain insights into account performance. \n• Became the training subject matter expert and periodically trained and mentored new \nemployees. \n• Contributed articles and designed department newsletter to help drive engagement. Listing Editor Yahoo! 2006  –  2007  (1 year) Greater Los Angeles Area Responsible for ensuring quality advertising network on Yahoo properties and search engine \nresults page. \n• Awarded 2006 Q2 Team Player of the quarter. \n• Designed and programmed an automated editorial system which reduced processes and \ntime spent by 3x. \n• Achieved review productivity of 300% while maintaining a 98% quality rating. Internet Recruiter Ajilon 2006  –  2006  (less than a year) Greater Los Angeles Area Staff Writer and Section Editor The Daily 2001  –  2003  (2 years) Greater Seattle Area Senior Manager - Global Creative Strategy Yahoo April 2014  – Present (1 year 5 months) Burbank, CA Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search and native marketing Creative Strategists focused on travel, education, online services, cross-marketplace, India and Southeast Asia. Senior Manager - Global Creative Strategy Yahoo April 2014  – Present (1 year 5 months) Burbank, CA Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search and native marketing Creative Strategists focused on travel, education, online services, cross-marketplace, India and Southeast Asia. Manager - Field Creative Strategy Yahoo October 2011  –  April 2014  (2 years 7 months) Greater Los Angeles Area Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search and native marketing Creative \nStrategists focused on travel, education and the Canada and global marketplaces. \n• Featured presenter and panelist at SMX Advanced - presented platform best practices. Manager - Field Creative Strategy Yahoo October 2011  –  April 2014  (2 years 7 months) Greater Los Angeles Area Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search and native marketing Creative \nStrategists focused on travel, education and the Canada and global marketplaces. \n• Featured presenter and panelist at SMX Advanced - presented platform best practices. Senior Supervisor - Field Creative Strategy Yahoo! 2010  –  2011  (1 year) Greater Los Angeles Area Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search marketing Creative \nStrategists focused on west and central regions. Senior Supervisor - Field Creative Strategy Yahoo! 2010  –  2011  (1 year) Greater Los Angeles Area Responsible for achieving focus, alignment and goal achievement through operational and sales planning, hiring, recruiting, training, coaching and managing a team of search marketing Creative \nStrategists focused on west and central regions. Senior Creative Strategist - Mid-market Yahoo! 2008  –  2010  (2 years) Greater Los Angeles Area Responsible for optimization, analysis and growth of advertiser's search marketing campaigns \non Yahoo! \n• Super Star Award for 1H, 2009 - given to top 5% of company. \n• Programming and designed toolset that helped scale a revenue program that grew spend 3.5 \nmillion YoY. \n• Evaluated, helped design and implemented toolsets and system improvements for Microsoft \nSearch Alliance. \n• Programmed multiple excel macros for team that assisted with scaling revenue opportunities \nand sales reporting. \n• Presented an advertising agency road show through Los Angeles, Toronto and New York that \nshowcased the Yahoo/Bing network. \n• Led a Search Alliance webinar for advertisers that received 90%+ satisfaction ratings. \n• Featured presenter and panelist at SMX NY - presented platform best practices. Senior Creative Strategist - Mid-market Yahoo! 2008  –  2010  (2 years) Greater Los Angeles Area Responsible for optimization, analysis and growth of advertiser's search marketing campaigns \non Yahoo! \n• Super Star Award for 1H, 2009 - given to top 5% of company. \n• Programming and designed toolset that helped scale a revenue program that grew spend 3.5 \nmillion YoY. \n• Evaluated, helped design and implemented toolsets and system improvements for Microsoft \nSearch Alliance. \n• Programmed multiple excel macros for team that assisted with scaling revenue opportunities \nand sales reporting. \n• Presented an advertising agency road show through Los Angeles, Toronto and New York that \nshowcased the Yahoo/Bing network. \n• Led a Search Alliance webinar for advertisers that received 90%+ satisfaction ratings. \n• Featured presenter and panelist at SMX NY - presented platform best practices. Creative Strategist - Mid-market Yahoo! 2007  –  2008  (1 year) Greater Los Angeles Area Responsible for optimization, analysis and growth of advertiser's search marketing campaigns \non Yahoo! \n• Designed and programmed tools used by internal employees which reduced processes and \ntime spent. \n• Programs were distributed nationally and across European markets. \n• Created analytical Excel sheets to gain insights into account performance. \n• Became the training subject matter expert and periodically trained and mentored new \nemployees. \n• Contributed articles and designed department newsletter to help drive engagement. Creative Strategist - Mid-market Yahoo! 2007  –  2008  (1 year) Greater Los Angeles Area Responsible for optimization, analysis and growth of advertiser's search marketing campaigns \non Yahoo! \n• Designed and programmed tools used by internal employees which reduced processes and \ntime spent. \n• Programs were distributed nationally and across European markets. \n• Created analytical Excel sheets to gain insights into account performance. \n• Became the training subject matter expert and periodically trained and mentored new \nemployees. \n• Contributed articles and designed department newsletter to help drive engagement. Listing Editor Yahoo! 2006  –  2007  (1 year) Greater Los Angeles Area Responsible for ensuring quality advertising network on Yahoo properties and search engine \nresults page. \n• Awarded 2006 Q2 Team Player of the quarter. \n• Designed and programmed an automated editorial system which reduced processes and \ntime spent by 3x. \n• Achieved review productivity of 300% while maintaining a 98% quality rating. Listing Editor Yahoo! 2006  –  2007  (1 year) Greater Los Angeles Area Responsible for ensuring quality advertising network on Yahoo properties and search engine \nresults page. \n• Awarded 2006 Q2 Team Player of the quarter. \n• Designed and programmed an automated editorial system which reduced processes and \ntime spent by 3x. \n• Achieved review productivity of 300% while maintaining a 98% quality rating. Internet Recruiter Ajilon 2006  –  2006  (less than a year) Greater Los Angeles Area Internet Recruiter Ajilon 2006  –  2006  (less than a year) Greater Los Angeles Area Staff Writer and Section Editor The Daily 2001  –  2003  (2 years) Greater Seattle Area Staff Writer and Section Editor The Daily 2001  –  2003  (2 years) Greater Seattle Area Skills Online Advertising SEM PPC Digital Media Content Development Visual Basic Excel PowerPoint Search Advertising Microsoft Excel Online Marketing Microsoft Word Mobile Marketing Digital Strategy Management People Development Building Relationships Relationship Management Copywriting Digital Copywriting Data Analysis Analysis Lead Generation Search Display Advertising Marketing See 11+     See less Skills  Online Advertising SEM PPC Digital Media Content Development Visual Basic Excel PowerPoint Search Advertising Microsoft Excel Online Marketing Microsoft Word Mobile Marketing Digital Strategy Management People Development Building Relationships Relationship Management Copywriting Digital Copywriting Data Analysis Analysis Lead Generation Search Display Advertising Marketing See 11+     See less Online Advertising SEM PPC Digital Media Content Development Visual Basic Excel PowerPoint Search Advertising Microsoft Excel Online Marketing Microsoft Word Mobile Marketing Digital Strategy Management People Development Building Relationships Relationship Management Copywriting Digital Copywriting Data Analysis Analysis Lead Generation Search Display Advertising Marketing See 11+     See less Online Advertising SEM PPC Digital Media Content Development Visual Basic Excel PowerPoint Search Advertising Microsoft Excel Online Marketing Microsoft Word Mobile Marketing Digital Strategy Management People Development Building Relationships Relationship Management Copywriting Digital Copywriting Data Analysis Analysis Lead Generation Search Display Advertising Marketing See 11+     See less Education University of Washington BA,  English with Creative Writing and Latin Language 2000  – 2004 Entered University of Washington as a Washington Scholar. Consulted with UW sponsored quarterly fiction publication. Completed a comprehensive study of Latin and its grammar. Activities and Societies:  Phi Kappa Psi ,  Daily staff writer University of Washington BA,  English with Creative Writing and Latin Language 2000  – 2004 Entered University of Washington as a Washington Scholar. Consulted with UW sponsored quarterly fiction publication. Completed a comprehensive study of Latin and its grammar. Activities and Societies:  Phi Kappa Psi ,  Daily staff writer University of Washington BA,  English with Creative Writing and Latin Language 2000  – 2004 Entered University of Washington as a Washington Scholar. Consulted with UW sponsored quarterly fiction publication. Completed a comprehensive study of Latin and its grammar. Activities and Societies:  Phi Kappa Psi ,  Daily staff writer University of Washington BA,  English with Creative Writing and Latin Language 2000  – 2004 Entered University of Washington as a Washington Scholar. Consulted with UW sponsored quarterly fiction publication. Completed a comprehensive study of Latin and its grammar. Activities and Societies:  Phi Kappa Psi ,  Daily staff writer Honors & Awards Purple Circle Yahoo January 2015 Awarded to the top revenue drivers in the company. Super Star Award Yahoo 2009 Award given to the top performers (5%) of the company. Team Player Of The Quarter Yahoo 2006 Washington Scholar June 2000 Purple Circle Yahoo January 2015 Awarded to the top revenue drivers in the company. Purple Circle Yahoo January 2015 Awarded to the top revenue drivers in the company. Purple Circle Yahoo January 2015 Awarded to the top revenue drivers in the company. Super Star Award Yahoo 2009 Award given to the top performers (5%) of the company. Super Star Award Yahoo 2009 Award given to the top performers (5%) of the company. Super Star Award Yahoo 2009 Award given to the top performers (5%) of the company. Team Player Of The Quarter Yahoo 2006 Team Player Of The Quarter Yahoo 2006 Team Player Of The Quarter Yahoo 2006 Washington Scholar June 2000 Washington Scholar June 2000 Washington Scholar June 2000 ", "Summary Online Advertising leader with strong expertise in Digital Marketing and Media Summary Online Advertising leader with strong expertise in Digital Marketing and Media Online Advertising leader with strong expertise in Digital Marketing and Media Online Advertising leader with strong expertise in Digital Marketing and Media Experience Sr. Manager, Creative Strategy Yahoo! March 2013  – Present (2 years 6 months) Portland, Oregon Area Manager, Creative Services Yahoo! February 2011  –  March 2013  (2 years 2 months) Portland, Oregon Area Senior Creative Strategist Yahoo! January 2010  –  January 2011  (1 year 1 month) Burbank, CA Creative Strategist Yahoo! October 2008  –  April 2010  (1 year 7 months) Burbank, CA Associate Account Manager Yahoo! July 2006  –  October 2008  (2 years 4 months) Burbank, CA Executive Assistant Capitol Records 2004  –  2006  (2 years) Hollywood, CA Marketing Associate Capitol Records June 2001  –  April 2004  (2 years 11 months) Hollywood, CA and Detroit, MI Sr. Manager, Creative Strategy Yahoo! March 2013  – Present (2 years 6 months) Portland, Oregon Area Sr. Manager, Creative Strategy Yahoo! March 2013  – Present (2 years 6 months) Portland, Oregon Area Manager, Creative Services Yahoo! February 2011  –  March 2013  (2 years 2 months) Portland, Oregon Area Manager, Creative Services Yahoo! February 2011  –  March 2013  (2 years 2 months) Portland, Oregon Area Senior Creative Strategist Yahoo! January 2010  –  January 2011  (1 year 1 month) Burbank, CA Senior Creative Strategist Yahoo! January 2010  –  January 2011  (1 year 1 month) Burbank, CA Creative Strategist Yahoo! October 2008  –  April 2010  (1 year 7 months) Burbank, CA Creative Strategist Yahoo! October 2008  –  April 2010  (1 year 7 months) Burbank, CA Associate Account Manager Yahoo! July 2006  –  October 2008  (2 years 4 months) Burbank, CA Associate Account Manager Yahoo! July 2006  –  October 2008  (2 years 4 months) Burbank, CA Executive Assistant Capitol Records 2004  –  2006  (2 years) Hollywood, CA Executive Assistant Capitol Records 2004  –  2006  (2 years) Hollywood, CA Marketing Associate Capitol Records June 2001  –  April 2004  (2 years 11 months) Hollywood, CA and Detroit, MI Marketing Associate Capitol Records June 2001  –  April 2004  (2 years 11 months) Hollywood, CA and Detroit, MI Skills Online Advertising MSN AdCenter SEM Search Advertising Marketing PPC Google Adwords Web Analytics Digital Strategy Yahoo Search Marketing Online Marketing Digital Marketing SEO Search Mobile Marketing Management Team Management Change Management Mobile Advertising Digital Media Copywriting Display Advertising E-commerce Advertising Web Marketing Conversion Optimization Google Webmaster Tools Landing Page... Affiliate Marketing Google Analytics Keyword Research Ad Networks Interactive Marketing Organic Search Campaign Management Behavioral Targeting Omniture Social Media Marketing Analytics See 24+     See less Skills  Online Advertising MSN AdCenter SEM Search Advertising Marketing PPC Google Adwords Web Analytics Digital Strategy Yahoo Search Marketing Online Marketing Digital Marketing SEO Search Mobile Marketing Management Team Management Change Management Mobile Advertising Digital Media Copywriting Display Advertising E-commerce Advertising Web Marketing Conversion Optimization Google Webmaster Tools Landing Page... Affiliate Marketing Google Analytics Keyword Research Ad Networks Interactive Marketing Organic Search Campaign Management Behavioral Targeting Omniture Social Media Marketing Analytics See 24+     See less Online Advertising MSN AdCenter SEM Search Advertising Marketing PPC Google Adwords Web Analytics Digital Strategy Yahoo Search Marketing Online Marketing Digital Marketing SEO Search Mobile Marketing Management Team Management Change Management Mobile Advertising Digital Media Copywriting Display Advertising E-commerce Advertising Web Marketing Conversion Optimization Google Webmaster Tools Landing Page... Affiliate Marketing Google Analytics Keyword Research Ad Networks Interactive Marketing Organic Search Campaign Management Behavioral Targeting Omniture Social Media Marketing Analytics See 24+     See less Online Advertising MSN AdCenter SEM Search Advertising Marketing PPC Google Adwords Web Analytics Digital Strategy Yahoo Search Marketing Online Marketing Digital Marketing SEO Search Mobile Marketing Management Team Management Change Management Mobile Advertising Digital Media Copywriting Display Advertising E-commerce Advertising Web Marketing Conversion Optimization Google Webmaster Tools Landing Page... Affiliate Marketing Google Analytics Keyword Research Ad Networks Interactive Marketing Organic Search Campaign Management Behavioral Targeting Omniture Social Media Marketing Analytics See 24+     See less Education Central Michigan University BS,  Business Administration 1999  – 2003 Activities and Societies:  Advertising Club Central Michigan University BS,  Business Administration 1999  – 2003 Activities and Societies:  Advertising Club Central Michigan University BS,  Business Administration 1999  – 2003 Activities and Societies:  Advertising Club Central Michigan University BS,  Business Administration 1999  – 2003 Activities and Societies:  Advertising Club ", "Summary Digital marketing strategist with a strong background in communications and integrated marketing. Directly manage accounts with clients and agencies to analyze performance and grow revenue for Fortune 500 companies. \n \nPassionate about educating clients and mentoring colleagues in digital marketing best practices. Focused on growing revenue and ROI while improving workflows, processes, and efficiency.  \n \nSpecialties: \n- Search Engine Marketing \n- Native Advertising \n- Client Services \n- Project Management \n- Social Media Marketing \n- Public Relations Summary Digital marketing strategist with a strong background in communications and integrated marketing. Directly manage accounts with clients and agencies to analyze performance and grow revenue for Fortune 500 companies. \n \nPassionate about educating clients and mentoring colleagues in digital marketing best practices. Focused on growing revenue and ROI while improving workflows, processes, and efficiency.  \n \nSpecialties: \n- Search Engine Marketing \n- Native Advertising \n- Client Services \n- Project Management \n- Social Media Marketing \n- Public Relations Digital marketing strategist with a strong background in communications and integrated marketing. Directly manage accounts with clients and agencies to analyze performance and grow revenue for Fortune 500 companies. \n \nPassionate about educating clients and mentoring colleagues in digital marketing best practices. Focused on growing revenue and ROI while improving workflows, processes, and efficiency.  \n \nSpecialties: \n- Search Engine Marketing \n- Native Advertising \n- Client Services \n- Project Management \n- Social Media Marketing \n- Public Relations Digital marketing strategist with a strong background in communications and integrated marketing. Directly manage accounts with clients and agencies to analyze performance and grow revenue for Fortune 500 companies. \n \nPassionate about educating clients and mentoring colleagues in digital marketing best practices. Focused on growing revenue and ROI while improving workflows, processes, and efficiency.  \n \nSpecialties: \n- Search Engine Marketing \n- Native Advertising \n- Client Services \n- Project Management \n- Social Media Marketing \n- Public Relations Experience Account Lead Yahoo January 2014  – Present (1 year 8 months) Greater Omaha Area Creative Lead Yahoo! April 2013  –  December 2013  (9 months) Greater Omaha Area Senior Creative Strategist Yahoo! January 2011  –  March 2013  (2 years 3 months) Greater Omaha Area Creative Specialist Yahoo! November 2009  –  January 2011  (1 year 3 months) Greater Omaha Area Teaching Assistant Ithaca College January 2009  –  May 2009  (5 months) Ithaca, New York Area Promotions Director WICB 91.7 FM April 2006  –  May 2009  (3 years 2 months) Ithaca, New York Area Intern U.S. House of Representatives February 2009  –  April 2009  (3 months) Ithaca, New York Area Intern Center for American Progress June 2008  –  August 2008  (3 months) Washington D.C. Metro Area Intern New Line Cinema January 2008  –  May 2008  (5 months) Greater Los Angeles Area Intern 5W Public Relations January 2008  –  May 2008  (5 months) Greater Los Angeles Area Account Lead Yahoo January 2014  – Present (1 year 8 months) Greater Omaha Area Account Lead Yahoo January 2014  – Present (1 year 8 months) Greater Omaha Area Creative Lead Yahoo! April 2013  –  December 2013  (9 months) Greater Omaha Area Creative Lead Yahoo! April 2013  –  December 2013  (9 months) Greater Omaha Area Senior Creative Strategist Yahoo! January 2011  –  March 2013  (2 years 3 months) Greater Omaha Area Senior Creative Strategist Yahoo! January 2011  –  March 2013  (2 years 3 months) Greater Omaha Area Creative Specialist Yahoo! November 2009  –  January 2011  (1 year 3 months) Greater Omaha Area Creative Specialist Yahoo! November 2009  –  January 2011  (1 year 3 months) Greater Omaha Area Teaching Assistant Ithaca College January 2009  –  May 2009  (5 months) Ithaca, New York Area Teaching Assistant Ithaca College January 2009  –  May 2009  (5 months) Ithaca, New York Area Promotions Director WICB 91.7 FM April 2006  –  May 2009  (3 years 2 months) Ithaca, New York Area Promotions Director WICB 91.7 FM April 2006  –  May 2009  (3 years 2 months) Ithaca, New York Area Intern U.S. House of Representatives February 2009  –  April 2009  (3 months) Ithaca, New York Area Intern U.S. House of Representatives February 2009  –  April 2009  (3 months) Ithaca, New York Area Intern Center for American Progress June 2008  –  August 2008  (3 months) Washington D.C. Metro Area Intern Center for American Progress June 2008  –  August 2008  (3 months) Washington D.C. Metro Area Intern New Line Cinema January 2008  –  May 2008  (5 months) Greater Los Angeles Area Intern New Line Cinema January 2008  –  May 2008  (5 months) Greater Los Angeles Area Intern 5W Public Relations January 2008  –  May 2008  (5 months) Greater Los Angeles Area Intern 5W Public Relations January 2008  –  May 2008  (5 months) Greater Los Angeles Area Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills SEM PPC Native Advertising Social Media Marketing Integrated Marketing Advertising Account Management Digital Media SEO Web Analytics Project Management Blogging Public Relations Marketing Marketing Strategy Public Speaking B2B Marketing Microsoft Excel Sales Presentations Social Media See 5+     See less Skills  SEM PPC Native Advertising Social Media Marketing Integrated Marketing Advertising Account Management Digital Media SEO Web Analytics Project Management Blogging Public Relations Marketing Marketing Strategy Public Speaking B2B Marketing Microsoft Excel Sales Presentations Social Media See 5+     See less SEM PPC Native Advertising Social Media Marketing Integrated Marketing Advertising Account Management Digital Media SEO Web Analytics Project Management Blogging Public Relations Marketing Marketing Strategy Public Speaking B2B Marketing Microsoft Excel Sales Presentations Social Media See 5+     See less SEM PPC Native Advertising Social Media Marketing Integrated Marketing Advertising Account Management Digital Media SEO Web Analytics Project Management Blogging Public Relations Marketing Marketing Strategy Public Speaking B2B Marketing Microsoft Excel Sales Presentations Social Media See 5+     See less Education Ithaca College B.S.,  Integrated Marketing Communications ,  Politics 2005  – 2009 Magna Cum Laude, GPA 3.89 \n \nStudy Abroad Programs: Rome, Fall 2007; Los Angeles, Spring 2008. Activities and Societies:  Lambda Pi Eta ,  Phi Kappa Phi ,  Oracle Society ,  President's Host Committee ,  Senior Class Cabinet ,  Progressive Alliance ,  STAND ,  WICB-FM ,  Megaphone Ithaca College B.S.,  Integrated Marketing Communications ,  Politics 2005  – 2009 Magna Cum Laude, GPA 3.89 \n \nStudy Abroad Programs: Rome, Fall 2007; Los Angeles, Spring 2008. Activities and Societies:  Lambda Pi Eta ,  Phi Kappa Phi ,  Oracle Society ,  President's Host Committee ,  Senior Class Cabinet ,  Progressive Alliance ,  STAND ,  WICB-FM ,  Megaphone Ithaca College B.S.,  Integrated Marketing Communications ,  Politics 2005  – 2009 Magna Cum Laude, GPA 3.89 \n \nStudy Abroad Programs: Rome, Fall 2007; Los Angeles, Spring 2008. Activities and Societies:  Lambda Pi Eta ,  Phi Kappa Phi ,  Oracle Society ,  President's Host Committee ,  Senior Class Cabinet ,  Progressive Alliance ,  STAND ,  WICB-FM ,  Megaphone Ithaca College B.S.,  Integrated Marketing Communications ,  Politics 2005  – 2009 Magna Cum Laude, GPA 3.89 \n \nStudy Abroad Programs: Rome, Fall 2007; Los Angeles, Spring 2008. Activities and Societies:  Lambda Pi Eta ,  Phi Kappa Phi ,  Oracle Society ,  President's Host Committee ,  Senior Class Cabinet ,  Progressive Alliance ,  STAND ,  WICB-FM ,  Megaphone Honors & Awards Yahoo! All Star Yahoo! SVP Sales & Revenue Development June 2010 Awarded to top 5% of employees in Sales and Revenue Development for growing revenue and pioneering process improvements that helped others grow revenue impact on our business. Park Scholar Ithaca College, Park School of Communications August 2005 Full-ride, 4-year merit scholarship (tuition, room & board, stipend) awarded to 20 incoming students for academics, service, and leadership. Yahoo! All Star Yahoo! SVP Sales & Revenue Development June 2010 Awarded to top 5% of employees in Sales and Revenue Development for growing revenue and pioneering process improvements that helped others grow revenue impact on our business. Yahoo! All Star Yahoo! SVP Sales & Revenue Development June 2010 Awarded to top 5% of employees in Sales and Revenue Development for growing revenue and pioneering process improvements that helped others grow revenue impact on our business. Yahoo! All Star Yahoo! SVP Sales & Revenue Development June 2010 Awarded to top 5% of employees in Sales and Revenue Development for growing revenue and pioneering process improvements that helped others grow revenue impact on our business. Park Scholar Ithaca College, Park School of Communications August 2005 Full-ride, 4-year merit scholarship (tuition, room & board, stipend) awarded to 20 incoming students for academics, service, and leadership. Park Scholar Ithaca College, Park School of Communications August 2005 Full-ride, 4-year merit scholarship (tuition, room & board, stipend) awarded to 20 incoming students for academics, service, and leadership. Park Scholar Ithaca College, Park School of Communications August 2005 Full-ride, 4-year merit scholarship (tuition, room & board, stipend) awarded to 20 incoming students for academics, service, and leadership. ", "Summary PPC analyst, interested in SEM, social media, digital research & analytics. Summary PPC analyst, interested in SEM, social media, digital research & analytics. PPC analyst, interested in SEM, social media, digital research & analytics. PPC analyst, interested in SEM, social media, digital research & analytics. Experience Creative Strategist Yahoo April 2015  – Present (5 months) Bengaluru Area, India - Manage PPC Accounts on the Yahoo-Bing network for Yahoo South East Asia Clients \n- Launch, analyse and optimise PPC campaigns for accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients \n- Manage Native Advertising on Yahoo for Yahoo South East Asia Clients \n- Communicate with clients with respect to the implementation of their SEM & Native campaigns Senior Creative Analyst Yahoo April 2014  –  March 2015  (1 year) Bengaluru Area, India - Manage PPC Accounts on the Yahoo-Bing network for Yahoo South East Asia Clients \n- Launch, analyse and optimise PPC campaigns for accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients \n- Manage Native Advertising on Yahoo for Yahoo South East Asia Clients Creative Analyst Yahoo! August 2011  –  March 2014  (2 years 8 months) Bengaluru Area, India - Create PPC campaigns for Yahoo! – South East Asia clients  \n- Source keywords, develop and optimize ad copies, and structure accounts  \n- Analyse the performance of PPC accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients Research Analyst Trainee Raj Abhyanker, LLP November 2010  –  November 2010  (1 month) - Identified companies for clients to invest in (using Capital IQ) \n- Carried out patent analysis of potential companies using IP analysis tools (Delphion, Thomson \nInnovation) Intern Asha Advertising Agency, Muscat - an affiliate of EURO RSCG(Middle East) June 2009  –  June 2009  (1 month) - Interned in the Creative Department \n- Put together an extensive market research on the banking and credit card segment in Oman \n- Worked on the advertising and marketing plan of a library, ‘Black and White’ Business Development Executive Ventures Unlimited December 2007  –  June 2008  (7 months) - Helped to carry out research on potential business areas \n- Worked on the corporate identity development for the company \n- Was involved in preparing client presentations Programmer Analyst Cognizant Technology Solutions Pvt. Ltd October 2006  –  October 2007  (1 year 1 month) - Worked in the Performance Testing team for clients Schneider Logistics and ACNielsen \n- Member of the Silk Performer Innovation Team for developing innovative techniques \n- Member of Xcel Celebration Team, responsible for bringing the team together for training and team building activities. Creative Strategist Yahoo April 2015  – Present (5 months) Bengaluru Area, India - Manage PPC Accounts on the Yahoo-Bing network for Yahoo South East Asia Clients \n- Launch, analyse and optimise PPC campaigns for accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients \n- Manage Native Advertising on Yahoo for Yahoo South East Asia Clients \n- Communicate with clients with respect to the implementation of their SEM & Native campaigns Creative Strategist Yahoo April 2015  – Present (5 months) Bengaluru Area, India - Manage PPC Accounts on the Yahoo-Bing network for Yahoo South East Asia Clients \n- Launch, analyse and optimise PPC campaigns for accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients \n- Manage Native Advertising on Yahoo for Yahoo South East Asia Clients \n- Communicate with clients with respect to the implementation of their SEM & Native campaigns Senior Creative Analyst Yahoo April 2014  –  March 2015  (1 year) Bengaluru Area, India - Manage PPC Accounts on the Yahoo-Bing network for Yahoo South East Asia Clients \n- Launch, analyse and optimise PPC campaigns for accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients \n- Manage Native Advertising on Yahoo for Yahoo South East Asia Clients Senior Creative Analyst Yahoo April 2014  –  March 2015  (1 year) Bengaluru Area, India - Manage PPC Accounts on the Yahoo-Bing network for Yahoo South East Asia Clients \n- Launch, analyse and optimise PPC campaigns for accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients \n- Manage Native Advertising on Yahoo for Yahoo South East Asia Clients Creative Analyst Yahoo! August 2011  –  March 2014  (2 years 8 months) Bengaluru Area, India - Create PPC campaigns for Yahoo! – South East Asia clients  \n- Source keywords, develop and optimize ad copies, and structure accounts  \n- Analyse the performance of PPC accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients Creative Analyst Yahoo! August 2011  –  March 2014  (2 years 8 months) Bengaluru Area, India - Create PPC campaigns for Yahoo! – South East Asia clients  \n- Source keywords, develop and optimize ad copies, and structure accounts  \n- Analyse the performance of PPC accounts across verticals \n- Assist in the creation of strategic recommendations & implementation of solutions for various clients Research Analyst Trainee Raj Abhyanker, LLP November 2010  –  November 2010  (1 month) - Identified companies for clients to invest in (using Capital IQ) \n- Carried out patent analysis of potential companies using IP analysis tools (Delphion, Thomson \nInnovation) Research Analyst Trainee Raj Abhyanker, LLP November 2010  –  November 2010  (1 month) - Identified companies for clients to invest in (using Capital IQ) \n- Carried out patent analysis of potential companies using IP analysis tools (Delphion, Thomson \nInnovation) Intern Asha Advertising Agency, Muscat - an affiliate of EURO RSCG(Middle East) June 2009  –  June 2009  (1 month) - Interned in the Creative Department \n- Put together an extensive market research on the banking and credit card segment in Oman \n- Worked on the advertising and marketing plan of a library, ‘Black and White’ Intern Asha Advertising Agency, Muscat - an affiliate of EURO RSCG(Middle East) June 2009  –  June 2009  (1 month) - Interned in the Creative Department \n- Put together an extensive market research on the banking and credit card segment in Oman \n- Worked on the advertising and marketing plan of a library, ‘Black and White’ Business Development Executive Ventures Unlimited December 2007  –  June 2008  (7 months) - Helped to carry out research on potential business areas \n- Worked on the corporate identity development for the company \n- Was involved in preparing client presentations Business Development Executive Ventures Unlimited December 2007  –  June 2008  (7 months) - Helped to carry out research on potential business areas \n- Worked on the corporate identity development for the company \n- Was involved in preparing client presentations Programmer Analyst Cognizant Technology Solutions Pvt. Ltd October 2006  –  October 2007  (1 year 1 month) - Worked in the Performance Testing team for clients Schneider Logistics and ACNielsen \n- Member of the Silk Performer Innovation Team for developing innovative techniques \n- Member of Xcel Celebration Team, responsible for bringing the team together for training and team building activities. Programmer Analyst Cognizant Technology Solutions Pvt. Ltd October 2006  –  October 2007  (1 year 1 month) - Worked in the Performance Testing team for clients Schneider Logistics and ACNielsen \n- Member of the Silk Performer Innovation Team for developing innovative techniques \n- Member of Xcel Celebration Team, responsible for bringing the team together for training and team building activities. Languages English Malayalam English Malayalam English Malayalam Skills SEM Yahoo Search Marketing Online Advertising Google Adwords PPC Google Analytics Training Digital Media Strategy Online Marketing Social Media Marketing Skills  SEM Yahoo Search Marketing Online Advertising Google Adwords PPC Google Analytics Training Digital Media Strategy Online Marketing Social Media Marketing SEM Yahoo Search Marketing Online Advertising Google Adwords PPC Google Analytics Training Digital Media Strategy Online Marketing Social Media Marketing SEM Yahoo Search Marketing Online Advertising Google Adwords PPC Google Analytics Training Digital Media Strategy Online Marketing Social Media Marketing Education Manipal Institute of Communication Master of Science,  Communication 2008  – 2010 • Thesis work on “Code-switched Print Advertisements: An Experiment on Preference, Recall and Recognition” \n \n• 32 minute documentary, ‘Transitions’ on the subject of transsexuality as part of course-work for Documentary Film Making \nPromo: http://www.youtube.com/watch?v=1do9qJ77uds \n \n• 3 minute short film, ‘A void’ as part of coursework for the subject Introduction to AV Media \nhttp://www.youtube.com/watch?v=KGiuOBSig3U Activities and Societies:  • Worked in the Content ,  Concept and Design Team ,  for GCA Satellite Symposium ,  Manipal ,  2009\n• Worked as editor and reporter for A.m. plus (a fortnightly tabloid brought out by Manipal Institute of Communication) ,  vol. XI ,  Issue 19 and Issue 15 respectively ,  Manipal ,  2009\n• Student Volunteer for Manipal Film Study Center which aims to popularize and promote film culture in Manipal ,  2009-2010 College of Engineering, Trivandrum B Tech,  Civil 2002  – 2006 Activities and Societies:  • Committee Member of Inter Semester Arts Festival SARGAM 2005.\n• Sub Committee Member of Inter Collegiate Technical Festival DRISHTI 2005 & Inter Collegiate Arts Festival DHWANI 2004. Holy Angels' ISC School ISC,  Science 2000  – 2002 Manipal Institute of Communication Master of Science,  Communication 2008  – 2010 • Thesis work on “Code-switched Print Advertisements: An Experiment on Preference, Recall and Recognition” \n \n• 32 minute documentary, ‘Transitions’ on the subject of transsexuality as part of course-work for Documentary Film Making \nPromo: http://www.youtube.com/watch?v=1do9qJ77uds \n \n• 3 minute short film, ‘A void’ as part of coursework for the subject Introduction to AV Media \nhttp://www.youtube.com/watch?v=KGiuOBSig3U Activities and Societies:  • Worked in the Content ,  Concept and Design Team ,  for GCA Satellite Symposium ,  Manipal ,  2009\n• Worked as editor and reporter for A.m. plus (a fortnightly tabloid brought out by Manipal Institute of Communication) ,  vol. XI ,  Issue 19 and Issue 15 respectively ,  Manipal ,  2009\n• Student Volunteer for Manipal Film Study Center which aims to popularize and promote film culture in Manipal ,  2009-2010 Manipal Institute of Communication Master of Science,  Communication 2008  – 2010 • Thesis work on “Code-switched Print Advertisements: An Experiment on Preference, Recall and Recognition” \n \n• 32 minute documentary, ‘Transitions’ on the subject of transsexuality as part of course-work for Documentary Film Making \nPromo: http://www.youtube.com/watch?v=1do9qJ77uds \n \n• 3 minute short film, ‘A void’ as part of coursework for the subject Introduction to AV Media \nhttp://www.youtube.com/watch?v=KGiuOBSig3U Activities and Societies:  • Worked in the Content ,  Concept and Design Team ,  for GCA Satellite Symposium ,  Manipal ,  2009\n• Worked as editor and reporter for A.m. plus (a fortnightly tabloid brought out by Manipal Institute of Communication) ,  vol. XI ,  Issue 19 and Issue 15 respectively ,  Manipal ,  2009\n• Student Volunteer for Manipal Film Study Center which aims to popularize and promote film culture in Manipal ,  2009-2010 Manipal Institute of Communication Master of Science,  Communication 2008  – 2010 • Thesis work on “Code-switched Print Advertisements: An Experiment on Preference, Recall and Recognition” \n \n• 32 minute documentary, ‘Transitions’ on the subject of transsexuality as part of course-work for Documentary Film Making \nPromo: http://www.youtube.com/watch?v=1do9qJ77uds \n \n• 3 minute short film, ‘A void’ as part of coursework for the subject Introduction to AV Media \nhttp://www.youtube.com/watch?v=KGiuOBSig3U Activities and Societies:  • Worked in the Content ,  Concept and Design Team ,  for GCA Satellite Symposium ,  Manipal ,  2009\n• Worked as editor and reporter for A.m. plus (a fortnightly tabloid brought out by Manipal Institute of Communication) ,  vol. XI ,  Issue 19 and Issue 15 respectively ,  Manipal ,  2009\n• Student Volunteer for Manipal Film Study Center which aims to popularize and promote film culture in Manipal ,  2009-2010 College of Engineering, Trivandrum B Tech,  Civil 2002  – 2006 Activities and Societies:  • Committee Member of Inter Semester Arts Festival SARGAM 2005.\n• Sub Committee Member of Inter Collegiate Technical Festival DRISHTI 2005 & Inter Collegiate Arts Festival DHWANI 2004. College of Engineering, Trivandrum B Tech,  Civil 2002  – 2006 Activities and Societies:  • Committee Member of Inter Semester Arts Festival SARGAM 2005.\n• Sub Committee Member of Inter Collegiate Technical Festival DRISHTI 2005 & Inter Collegiate Arts Festival DHWANI 2004. College of Engineering, Trivandrum B Tech,  Civil 2002  – 2006 Activities and Societies:  • Committee Member of Inter Semester Arts Festival SARGAM 2005.\n• Sub Committee Member of Inter Collegiate Technical Festival DRISHTI 2005 & Inter Collegiate Arts Festival DHWANI 2004. Holy Angels' ISC School ISC,  Science 2000  – 2002 Holy Angels' ISC School ISC,  Science 2000  – 2002 Holy Angels' ISC School ISC,  Science 2000  – 2002 Honors & Awards Best Performer of the Month Yahoo! March 2012 Best Performer of the Quarter : Jul - Sept, 2012 Yahoo! September 2012 Best Performer of the Month Yahoo! March 2013 Best Innovation Award Q2 2015 Yahoo! August 2015 Best Performer of the Month Yahoo! March 2012 Best Performer of the Month Yahoo! March 2012 Best Performer of the Month Yahoo! March 2012 Best Performer of the Quarter : Jul - Sept, 2012 Yahoo! September 2012 Best Performer of the Quarter : Jul - Sept, 2012 Yahoo! September 2012 Best Performer of the Quarter : Jul - Sept, 2012 Yahoo! September 2012 Best Performer of the Month Yahoo! March 2013 Best Performer of the Month Yahoo! March 2013 Best Performer of the Month Yahoo! March 2013 Best Innovation Award Q2 2015 Yahoo! August 2015 Best Innovation Award Q2 2015 Yahoo! August 2015 Best Innovation Award Q2 2015 Yahoo! August 2015 ", "Experience Senior Creative Strategist Yahoo April 2014  – Present (1 year 5 months) Greater Omaha Area Creative Strategist Yahoo! February 2011  – Present (4 years 7 months) Greater Omaha Area Creative Specialist Yahoo! September 2010  –  February 2011  (6 months) Omaha Associate Account Manager Yahoo! September 2009  –  September 2010  (1 year 1 month) Greater Omaha Area Senior Creative Strategist Yahoo April 2014  – Present (1 year 5 months) Greater Omaha Area Senior Creative Strategist Yahoo April 2014  – Present (1 year 5 months) Greater Omaha Area Creative Strategist Yahoo! February 2011  – Present (4 years 7 months) Greater Omaha Area Creative Strategist Yahoo! February 2011  – Present (4 years 7 months) Greater Omaha Area Creative Specialist Yahoo! September 2010  –  February 2011  (6 months) Omaha Creative Specialist Yahoo! September 2010  –  February 2011  (6 months) Omaha Associate Account Manager Yahoo! September 2009  –  September 2010  (1 year 1 month) Greater Omaha Area Associate Account Manager Yahoo! September 2009  –  September 2010  (1 year 1 month) Greater Omaha Area Skills Digital Marketing Web Analytics Online Advertising SEM Digital Strategy PPC Account Management Digital Media Mobile Marketing Mobile Advertising Online Marketing Display Advertising Search Advertising Yahoo Search Marketing MSN AdCenter Skills  Digital Marketing Web Analytics Online Advertising SEM Digital Strategy PPC Account Management Digital Media Mobile Marketing Mobile Advertising Online Marketing Display Advertising Search Advertising Yahoo Search Marketing MSN AdCenter Digital Marketing Web Analytics Online Advertising SEM Digital Strategy PPC Account Management Digital Media Mobile Marketing Mobile Advertising Online Marketing Display Advertising Search Advertising Yahoo Search Marketing MSN AdCenter Digital Marketing Web Analytics Online Advertising SEM Digital Strategy PPC Account Management Digital Media Mobile Marketing Mobile Advertising Online Marketing Display Advertising Search Advertising Yahoo Search Marketing MSN AdCenter Education University of Nebraska-Lincoln BSBA,  Marketing 2003  – 2008 Minor in Psychology Activities and Societies:  Lambda Chi Alpha ,  UNL Chapter Millard North High School Activities and Societies:  President of DECA ,  Millard North chapter ,  Fall 2002 to Spring 2003 University of Nebraska-Lincoln BSBA,  Marketing 2003  – 2008 Minor in Psychology Activities and Societies:  Lambda Chi Alpha ,  UNL Chapter University of Nebraska-Lincoln BSBA,  Marketing 2003  – 2008 Minor in Psychology Activities and Societies:  Lambda Chi Alpha ,  UNL Chapter University of Nebraska-Lincoln BSBA,  Marketing 2003  – 2008 Minor in Psychology Activities and Societies:  Lambda Chi Alpha ,  UNL Chapter Millard North High School Activities and Societies:  President of DECA ,  Millard North chapter ,  Fall 2002 to Spring 2003 Millard North High School Activities and Societies:  President of DECA ,  Millard North chapter ,  Fall 2002 to Spring 2003 Millard North High School Activities and Societies:  President of DECA ,  Millard North chapter ,  Fall 2002 to Spring 2003 ", "Experience Manager, Account Management Yahoo May 2015  – Present (4 months) Chicago, IL Account Lead, Search Yahoo! June 2013  – Present (2 years 3 months) Chicago, IL Senior Account Manager, Search Yahoo! July 2012  –  June 2013  (1 year) Chicago, IL Senior Creative Strategist, Search Yahoo! February 2012  –  June 2012  (5 months) Creative Strategist, Search Yahoo! January 2011  –  June 2012  (1 year 6 months) Creative Specialist, Search Yahoo! November 2009  –  January 2011  (1 year 3 months) Manager, Account Management Yahoo May 2015  – Present (4 months) Chicago, IL Manager, Account Management Yahoo May 2015  – Present (4 months) Chicago, IL Account Lead, Search Yahoo! June 2013  – Present (2 years 3 months) Chicago, IL Account Lead, Search Yahoo! June 2013  – Present (2 years 3 months) Chicago, IL Senior Account Manager, Search Yahoo! July 2012  –  June 2013  (1 year) Chicago, IL Senior Account Manager, Search Yahoo! July 2012  –  June 2013  (1 year) Chicago, IL Senior Creative Strategist, Search Yahoo! February 2012  –  June 2012  (5 months) Senior Creative Strategist, Search Yahoo! February 2012  –  June 2012  (5 months) Creative Strategist, Search Yahoo! January 2011  –  June 2012  (1 year 6 months) Creative Strategist, Search Yahoo! January 2011  –  June 2012  (1 year 6 months) Creative Specialist, Search Yahoo! November 2009  –  January 2011  (1 year 3 months) Creative Specialist, Search Yahoo! November 2009  –  January 2011  (1 year 3 months) Skills Microsoft Excel Microsoft Office Microsoft PowerPoint Microsoft adCenter... Adobe Photoshop Adobe In-Design Adobe Illustrator Public Relations Editing Photoshop InDesign PowerPoint Online Advertising Social Media SEM Marketing See 1+     See less Skills  Microsoft Excel Microsoft Office Microsoft PowerPoint Microsoft adCenter... Adobe Photoshop Adobe In-Design Adobe Illustrator Public Relations Editing Photoshop InDesign PowerPoint Online Advertising Social Media SEM Marketing See 1+     See less Microsoft Excel Microsoft Office Microsoft PowerPoint Microsoft adCenter... Adobe Photoshop Adobe In-Design Adobe Illustrator Public Relations Editing Photoshop InDesign PowerPoint Online Advertising Social Media SEM Marketing See 1+     See less Microsoft Excel Microsoft Office Microsoft PowerPoint Microsoft adCenter... Adobe Photoshop Adobe In-Design Adobe Illustrator Public Relations Editing Photoshop InDesign PowerPoint Online Advertising Social Media SEM Marketing See 1+     See less Education Creighton University BA,  Journalism and Mass Communication ,  Advertising/Public Relations 2003  – 2008 •Member of the Public Relations Student Society  \n•Completed 8 Certified Writing Courses  \n•Contributed as a freelance writer for the Creightonian newspaper and online magazine. \n•Relevant Coursework: Advertising, Media Research, Marketing, Public Relations Graphic Design, Print Design, Law of Mass Communication, Philosophy, Rhetoric and Composition, Editing, Ethics, Psychology Creighton University BA,  Journalism and Mass Communication ,  Advertising/Public Relations 2003  – 2008 •Member of the Public Relations Student Society  \n•Completed 8 Certified Writing Courses  \n•Contributed as a freelance writer for the Creightonian newspaper and online magazine. \n•Relevant Coursework: Advertising, Media Research, Marketing, Public Relations Graphic Design, Print Design, Law of Mass Communication, Philosophy, Rhetoric and Composition, Editing, Ethics, Psychology Creighton University BA,  Journalism and Mass Communication ,  Advertising/Public Relations 2003  – 2008 •Member of the Public Relations Student Society  \n•Completed 8 Certified Writing Courses  \n•Contributed as a freelance writer for the Creightonian newspaper and online magazine. \n•Relevant Coursework: Advertising, Media Research, Marketing, Public Relations Graphic Design, Print Design, Law of Mass Communication, Philosophy, Rhetoric and Composition, Editing, Ethics, Psychology Creighton University BA,  Journalism and Mass Communication ,  Advertising/Public Relations 2003  – 2008 •Member of the Public Relations Student Society  \n•Completed 8 Certified Writing Courses  \n•Contributed as a freelance writer for the Creightonian newspaper and online magazine. \n•Relevant Coursework: Advertising, Media Research, Marketing, Public Relations Graphic Design, Print Design, Law of Mass Communication, Philosophy, Rhetoric and Composition, Editing, Ethics, Psychology Honors & Awards Additional Honors & Awards 2011 Y!-MSFT Search Alliance, Outstanding Advertiser Transition Award Additional Honors & Awards 2011 Y!-MSFT Search Alliance, Outstanding Advertiser Transition Award Additional Honors & Awards 2011 Y!-MSFT Search Alliance, Outstanding Advertiser Transition Award Additional Honors & Awards 2011 Y!-MSFT Search Alliance, Outstanding Advertiser Transition Award ", "Experience Senior Creative Strategist, Search Yahoo October 2014  – Present (11 months) Omaha, NE Creative Strategist, Search Yahoo! May 2012  – Present (3 years 4 months) Omaha, Nebraska Associate Account Manager, Search Yahoo! May 2011  –  May 2012  (1 year 1 month) Omaha, NE Direct Marketing Database Analyst Caesars Entertainment Corporation February 2010  –  December 2011  (1 year 11 months) Marketing Intern Marketing Werks August 2009  –  December 2009  (5 months) Marketing Intern Nebraska Lottery May 2008  –  October 2008  (6 months) Marketing Intern Anheuser-Busch March 2008  –  August 2008  (6 months) Senior Creative Strategist, Search Yahoo October 2014  – Present (11 months) Omaha, NE Senior Creative Strategist, Search Yahoo October 2014  – Present (11 months) Omaha, NE Creative Strategist, Search Yahoo! May 2012  – Present (3 years 4 months) Omaha, Nebraska Creative Strategist, Search Yahoo! May 2012  – Present (3 years 4 months) Omaha, Nebraska Associate Account Manager, Search Yahoo! May 2011  –  May 2012  (1 year 1 month) Omaha, NE Associate Account Manager, Search Yahoo! May 2011  –  May 2012  (1 year 1 month) Omaha, NE Direct Marketing Database Analyst Caesars Entertainment Corporation February 2010  –  December 2011  (1 year 11 months) Direct Marketing Database Analyst Caesars Entertainment Corporation February 2010  –  December 2011  (1 year 11 months) Marketing Intern Marketing Werks August 2009  –  December 2009  (5 months) Marketing Intern Marketing Werks August 2009  –  December 2009  (5 months) Marketing Intern Nebraska Lottery May 2008  –  October 2008  (6 months) Marketing Intern Nebraska Lottery May 2008  –  October 2008  (6 months) Marketing Intern Anheuser-Busch March 2008  –  August 2008  (6 months) Marketing Intern Anheuser-Busch March 2008  –  August 2008  (6 months) Skills SEM Online Advertising Product Marketing PPC Marketing Web Analytics Search Digital Marketing Direct Marketing Strategic Planning Customer Service Search Advertising Advertising Sales Skills  SEM Online Advertising Product Marketing PPC Marketing Web Analytics Search Digital Marketing Direct Marketing Strategic Planning Customer Service Search Advertising Advertising Sales SEM Online Advertising Product Marketing PPC Marketing Web Analytics Search Digital Marketing Direct Marketing Strategic Planning Customer Service Search Advertising Advertising Sales SEM Online Advertising Product Marketing PPC Marketing Web Analytics Search Digital Marketing Direct Marketing Strategic Planning Customer Service Search Advertising Advertising Sales Education University of Nebraska-Lincoln Marketing,  Sociology 2005  – 2010 Activities and Societies:  Kappa Alpha Theta University of Nebraska-Lincoln Marketing,  Sociology 2005  – 2010 Activities and Societies:  Kappa Alpha Theta University of Nebraska-Lincoln Marketing,  Sociology 2005  – 2010 Activities and Societies:  Kappa Alpha Theta University of Nebraska-Lincoln Marketing,  Sociology 2005  – 2010 Activities and Societies:  Kappa Alpha Theta ", "Languages   Skills Skills     ", "Experience Senior Manager, Creative Strategy Yahoo April 2013  – Present (2 years 5 months) Greater Omaha Area Manager - Search Creative Development Yahoo! April 2011  –  March 2013  (2 years) Greater Omaha Area Senior Supervisor, Search Creative Development Yahoo January 2010  –  March 2011  (1 year 3 months) Greater Omaha Area Senior Creative Strategist Yahoo March 2009  –  December 2010  (1 year 10 months) Burbank, CA Search Creative Strategist Yahoo April 2008  –  March 2009  (1 year) Burbank, CA Mobile Search Creative Strategist Yahoo September 2007  –  March 2008  (7 months) Burbank, CA Search Listing Editor Yahoo April 2007  –  August 2007  (5 months) Burbank, CA Senior Manager, Creative Strategy Yahoo April 2013  – Present (2 years 5 months) Greater Omaha Area Senior Manager, Creative Strategy Yahoo April 2013  – Present (2 years 5 months) Greater Omaha Area Manager - Search Creative Development Yahoo! April 2011  –  March 2013  (2 years) Greater Omaha Area Manager - Search Creative Development Yahoo! April 2011  –  March 2013  (2 years) Greater Omaha Area Senior Supervisor, Search Creative Development Yahoo January 2010  –  March 2011  (1 year 3 months) Greater Omaha Area Senior Supervisor, Search Creative Development Yahoo January 2010  –  March 2011  (1 year 3 months) Greater Omaha Area Senior Creative Strategist Yahoo March 2009  –  December 2010  (1 year 10 months) Burbank, CA Senior Creative Strategist Yahoo March 2009  –  December 2010  (1 year 10 months) Burbank, CA Search Creative Strategist Yahoo April 2008  –  March 2009  (1 year) Burbank, CA Search Creative Strategist Yahoo April 2008  –  March 2009  (1 year) Burbank, CA Mobile Search Creative Strategist Yahoo September 2007  –  March 2008  (7 months) Burbank, CA Mobile Search Creative Strategist Yahoo September 2007  –  March 2008  (7 months) Burbank, CA Search Listing Editor Yahoo April 2007  –  August 2007  (5 months) Burbank, CA Search Listing Editor Yahoo April 2007  –  August 2007  (5 months) Burbank, CA Skills SEM PPC Skills  SEM PPC SEM PPC SEM PPC Education City University of New York-Hunter College Bachelor's Degree,  Media Studies 2002  – 2006 City University of New York-Hunter College Bachelor's Degree,  Media Studies 2002  – 2006 City University of New York-Hunter College Bachelor's Degree,  Media Studies 2002  – 2006 City University of New York-Hunter College Bachelor's Degree,  Media Studies 2002  – 2006 "]}