{"position": "Senior Manager, Analytics", "company": "Google", "profiles": ["Summary Results-driven customer marketer. Excellent analytical and project management skills with proven success in identifying opportunities for process improvement and reducing execution complexity. Recognized as a motivational manager with the ability to lead cross-functional teams and drive successful, profitable campaigns for both acquisition and retention efforts.  \n \nCross Channel Marketing: Synegrate customer marketing strategy across email, social, and ecommerce. Lead direct response campaigns for mail, TV print, online, and telemarketing. Develop creative materials and scripts. Integrate marketing efforts across all channels and segment customers based on behavior to drive future acquisition efforts and improve customer lifetime value.  \n \nMarketing Strategy: Identify opportunities to generate revenue and cut costs. Develop strategic plans to support the vision and growth of organizations. Analyze available competitive intelligence to improve marketing plans. Improve operational efficiencies through process evaluation and data standardization \n \nMarketing Analytics: Build marketing tactics and strategy through analytics. Ensure the utilization of data and intelligence to create sound marketing strategies, anticipate trends and articulate future marketing needs. Develop strategic plans, forecasts and budgets to support cross-channel efforts. \n \nEmail Marketing: Develop and execute email streams that drive revenue growth through retention, cross-sells, and up-sells. Design and launch tests that support key hypotheses and deliver actionable learning. Utilize customer insights to produce effective customer segmentation and highly persuasive offers. \n \nCustomer Retention and Loyalty: Drive alignment of customer-impacting initiatives throughout marketing strategy. Map customer lifecycle identifying key trigger points in behavior. Develop innovative programs to create loyalty. Identify and measure key retention indicators. Specialties:Customer Marketing, Retention Marketing, Renewal Marketing, Customer Service, Credit & Billing, Direct Response Marketing, Loyalty Marketing, CRM, Acquisition Marketing, Marketing Analytics, Business Development, Consumer Research, Consumer Focus Groups Summary Results-driven customer marketer. Excellent analytical and project management skills with proven success in identifying opportunities for process improvement and reducing execution complexity. Recognized as a motivational manager with the ability to lead cross-functional teams and drive successful, profitable campaigns for both acquisition and retention efforts.  \n \nCross Channel Marketing: Synegrate customer marketing strategy across email, social, and ecommerce. Lead direct response campaigns for mail, TV print, online, and telemarketing. Develop creative materials and scripts. Integrate marketing efforts across all channels and segment customers based on behavior to drive future acquisition efforts and improve customer lifetime value.  \n \nMarketing Strategy: Identify opportunities to generate revenue and cut costs. Develop strategic plans to support the vision and growth of organizations. Analyze available competitive intelligence to improve marketing plans. Improve operational efficiencies through process evaluation and data standardization \n \nMarketing Analytics: Build marketing tactics and strategy through analytics. Ensure the utilization of data and intelligence to create sound marketing strategies, anticipate trends and articulate future marketing needs. Develop strategic plans, forecasts and budgets to support cross-channel efforts. \n \nEmail Marketing: Develop and execute email streams that drive revenue growth through retention, cross-sells, and up-sells. Design and launch tests that support key hypotheses and deliver actionable learning. Utilize customer insights to produce effective customer segmentation and highly persuasive offers. \n \nCustomer Retention and Loyalty: Drive alignment of customer-impacting initiatives throughout marketing strategy. Map customer lifecycle identifying key trigger points in behavior. Develop innovative programs to create loyalty. Identify and measure key retention indicators. Specialties:Customer Marketing, Retention Marketing, Renewal Marketing, Customer Service, Credit & Billing, Direct Response Marketing, Loyalty Marketing, CRM, Acquisition Marketing, Marketing Analytics, Business Development, Consumer Research, Consumer Focus Groups Results-driven customer marketer. Excellent analytical and project management skills with proven success in identifying opportunities for process improvement and reducing execution complexity. Recognized as a motivational manager with the ability to lead cross-functional teams and drive successful, profitable campaigns for both acquisition and retention efforts.  \n \nCross Channel Marketing: Synegrate customer marketing strategy across email, social, and ecommerce. Lead direct response campaigns for mail, TV print, online, and telemarketing. Develop creative materials and scripts. Integrate marketing efforts across all channels and segment customers based on behavior to drive future acquisition efforts and improve customer lifetime value.  \n \nMarketing Strategy: Identify opportunities to generate revenue and cut costs. Develop strategic plans to support the vision and growth of organizations. Analyze available competitive intelligence to improve marketing plans. Improve operational efficiencies through process evaluation and data standardization \n \nMarketing Analytics: Build marketing tactics and strategy through analytics. Ensure the utilization of data and intelligence to create sound marketing strategies, anticipate trends and articulate future marketing needs. Develop strategic plans, forecasts and budgets to support cross-channel efforts. \n \nEmail Marketing: Develop and execute email streams that drive revenue growth through retention, cross-sells, and up-sells. Design and launch tests that support key hypotheses and deliver actionable learning. Utilize customer insights to produce effective customer segmentation and highly persuasive offers. \n \nCustomer Retention and Loyalty: Drive alignment of customer-impacting initiatives throughout marketing strategy. Map customer lifecycle identifying key trigger points in behavior. Develop innovative programs to create loyalty. Identify and measure key retention indicators. Specialties:Customer Marketing, Retention Marketing, Renewal Marketing, Customer Service, Credit & Billing, Direct Response Marketing, Loyalty Marketing, CRM, Acquisition Marketing, Marketing Analytics, Business Development, Consumer Research, Consumer Focus Groups Results-driven customer marketer. Excellent analytical and project management skills with proven success in identifying opportunities for process improvement and reducing execution complexity. Recognized as a motivational manager with the ability to lead cross-functional teams and drive successful, profitable campaigns for both acquisition and retention efforts.  \n \nCross Channel Marketing: Synegrate customer marketing strategy across email, social, and ecommerce. Lead direct response campaigns for mail, TV print, online, and telemarketing. Develop creative materials and scripts. Integrate marketing efforts across all channels and segment customers based on behavior to drive future acquisition efforts and improve customer lifetime value.  \n \nMarketing Strategy: Identify opportunities to generate revenue and cut costs. Develop strategic plans to support the vision and growth of organizations. Analyze available competitive intelligence to improve marketing plans. Improve operational efficiencies through process evaluation and data standardization \n \nMarketing Analytics: Build marketing tactics and strategy through analytics. Ensure the utilization of data and intelligence to create sound marketing strategies, anticipate trends and articulate future marketing needs. Develop strategic plans, forecasts and budgets to support cross-channel efforts. \n \nEmail Marketing: Develop and execute email streams that drive revenue growth through retention, cross-sells, and up-sells. Design and launch tests that support key hypotheses and deliver actionable learning. Utilize customer insights to produce effective customer segmentation and highly persuasive offers. \n \nCustomer Retention and Loyalty: Drive alignment of customer-impacting initiatives throughout marketing strategy. Map customer lifecycle identifying key trigger points in behavior. Develop innovative programs to create loyalty. Identify and measure key retention indicators. Specialties:Customer Marketing, Retention Marketing, Renewal Marketing, Customer Service, Credit & Billing, Direct Response Marketing, Loyalty Marketing, CRM, Acquisition Marketing, Marketing Analytics, Business Development, Consumer Research, Consumer Focus Groups Skills Loyalty Marketing Marketing Analytics Direct Response Marketing CRM Business Development Customer Marketing Direct Marketing Direct Mail Multi-channel Marketing Database Marketing Email Marketing Marketing Strategy Digital Marketing E-commerce Customer Retention Segmentation Loyalty Programs Online Marketing Web Analytics Product Development Competitive Analysis Marketing Research Strategy Customer Acquisition Customer Insight Cross-functional Team... Thought Leadership See 13+     See less Skills  Loyalty Marketing Marketing Analytics Direct Response Marketing CRM Business Development Customer Marketing Direct Marketing Direct Mail Multi-channel Marketing Database Marketing Email Marketing Marketing Strategy Digital Marketing E-commerce Customer Retention Segmentation Loyalty Programs Online Marketing Web Analytics Product Development Competitive Analysis Marketing Research Strategy Customer Acquisition Customer Insight Cross-functional Team... Thought Leadership See 13+     See less Loyalty Marketing Marketing Analytics Direct Response Marketing CRM Business Development Customer Marketing Direct Marketing Direct Mail Multi-channel Marketing Database Marketing Email Marketing Marketing Strategy Digital Marketing E-commerce Customer Retention Segmentation Loyalty Programs Online Marketing Web Analytics Product Development Competitive Analysis Marketing Research Strategy Customer Acquisition Customer Insight Cross-functional Team... Thought Leadership See 13+     See less Loyalty Marketing Marketing Analytics Direct Response Marketing CRM Business Development Customer Marketing Direct Marketing Direct Mail Multi-channel Marketing Database Marketing Email Marketing Marketing Strategy Digital Marketing E-commerce Customer Retention Segmentation Loyalty Programs Online Marketing Web Analytics Product Development Competitive Analysis Marketing Research Strategy Customer Acquisition Customer Insight Cross-functional Team... Thought Leadership See 13+     See less ", "Summary •\tOver 15 years experience of online/digital work experience, both on the agency and client side, including financial, telecom, retail and media sites \n•\tExtensive web analytics and market research experience using both qualitative and quantitative methodologies. Advanced Adobe Site Catalyst, Discover and Data Warehouse user with implementation experience. Also experienced HBX and WebTrends users. \n•\t3+ year employee management experience \n•\tExperienced in video, audio, mobile and social measurement (crimson hexagon, Radian 6) \n•\tHolder of 2 Master’s degrees (Information Studies, Politics) \n•\tRecognized Web Analytics thought-leader in the Canadian measurement community: member of the comScore Research Advisory Council, has advised the Canadian Media Fund on how to measure digital media, frequent speaker at eMetrics, member of this year’s Advisory Board. Summary •\tOver 15 years experience of online/digital work experience, both on the agency and client side, including financial, telecom, retail and media sites \n•\tExtensive web analytics and market research experience using both qualitative and quantitative methodologies. Advanced Adobe Site Catalyst, Discover and Data Warehouse user with implementation experience. Also experienced HBX and WebTrends users. \n•\t3+ year employee management experience \n•\tExperienced in video, audio, mobile and social measurement (crimson hexagon, Radian 6) \n•\tHolder of 2 Master’s degrees (Information Studies, Politics) \n•\tRecognized Web Analytics thought-leader in the Canadian measurement community: member of the comScore Research Advisory Council, has advised the Canadian Media Fund on how to measure digital media, frequent speaker at eMetrics, member of this year’s Advisory Board. •\tOver 15 years experience of online/digital work experience, both on the agency and client side, including financial, telecom, retail and media sites \n•\tExtensive web analytics and market research experience using both qualitative and quantitative methodologies. Advanced Adobe Site Catalyst, Discover and Data Warehouse user with implementation experience. Also experienced HBX and WebTrends users. \n•\t3+ year employee management experience \n•\tExperienced in video, audio, mobile and social measurement (crimson hexagon, Radian 6) \n•\tHolder of 2 Master’s degrees (Information Studies, Politics) \n•\tRecognized Web Analytics thought-leader in the Canadian measurement community: member of the comScore Research Advisory Council, has advised the Canadian Media Fund on how to measure digital media, frequent speaker at eMetrics, member of this year’s Advisory Board. •\tOver 15 years experience of online/digital work experience, both on the agency and client side, including financial, telecom, retail and media sites \n•\tExtensive web analytics and market research experience using both qualitative and quantitative methodologies. Advanced Adobe Site Catalyst, Discover and Data Warehouse user with implementation experience. Also experienced HBX and WebTrends users. \n•\t3+ year employee management experience \n•\tExperienced in video, audio, mobile and social measurement (crimson hexagon, Radian 6) \n•\tHolder of 2 Master’s degrees (Information Studies, Politics) \n•\tRecognized Web Analytics thought-leader in the Canadian measurement community: member of the comScore Research Advisory Council, has advised the Canadian Media Fund on how to measure digital media, frequent speaker at eMetrics, member of this year’s Advisory Board. Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Web Analytics Qualitative Research Omniture Online Marketing SEO Analytics Google Analytics SEM Online Advertising Digital Media Product Management Market Research Marketing Research New Media Digital Marketing Data Analysis Customer Insight Digital Strategy Segmentation Strategy Mobile Devices Competitive Analysis E-commerce Management Competitive Intelligence Social Media Measurement User Experience CRM Content Strategy Mobile Marketing WebTrends Analytics Information Architecture Integrated Marketing Web Strategy See 19+     See less Skills  Web Analytics Qualitative Research Omniture Online Marketing SEO Analytics Google Analytics SEM Online Advertising Digital Media Product Management Market Research Marketing Research New Media Digital Marketing Data Analysis Customer Insight Digital Strategy Segmentation Strategy Mobile Devices Competitive Analysis E-commerce Management Competitive Intelligence Social Media Measurement User Experience CRM Content Strategy Mobile Marketing WebTrends Analytics Information Architecture Integrated Marketing Web Strategy See 19+     See less Web Analytics Qualitative Research Omniture Online Marketing SEO Analytics Google Analytics SEM Online Advertising Digital Media Product Management Market Research Marketing Research New Media Digital Marketing Data Analysis Customer Insight Digital Strategy Segmentation Strategy Mobile Devices Competitive Analysis E-commerce Management Competitive Intelligence Social Media Measurement User Experience CRM Content Strategy Mobile Marketing WebTrends Analytics Information Architecture Integrated Marketing Web Strategy See 19+     See less Web Analytics Qualitative Research Omniture Online Marketing SEO Analytics Google Analytics SEM Online Advertising Digital Media Product Management Market Research Marketing Research New Media Digital Marketing Data Analysis Customer Insight Digital Strategy Segmentation Strategy Mobile Devices Competitive Analysis E-commerce Management Competitive Intelligence Social Media Measurement User Experience CRM Content Strategy Mobile Marketing WebTrends Analytics Information Architecture Integrated Marketing Web Strategy See 19+     See less ", "Skills Customer Service Management Leadership Retail Sales Strategic Planning Public Speaking Business Analysis Forecasting Time Management Digital Analytics Marketing Analytics Marketing Attribution Skills  Customer Service Management Leadership Retail Sales Strategic Planning Public Speaking Business Analysis Forecasting Time Management Digital Analytics Marketing Analytics Marketing Attribution Customer Service Management Leadership Retail Sales Strategic Planning Public Speaking Business Analysis Forecasting Time Management Digital Analytics Marketing Analytics Marketing Attribution Customer Service Management Leadership Retail Sales Strategic Planning Public Speaking Business Analysis Forecasting Time Management Digital Analytics Marketing Analytics Marketing Attribution ", "Experience Senior Manager, Digital Analytics Best Buy February 2010  – Present (5 years 7 months) Lead team digital analysts focused on site optimization and visitor behavior research. Director, Digital Media American Public Media February 2009  –  February 2010  (1 year 1 month) New Media Manager, Channel Distribution & Marketing Minnesota Public Radio and American Public Media April 2004  –  January 2009  (4 years 10 months) Manager, Interactive Development The Nancekivell Groupp September 2001  –  April 2004  (2 years 8 months) Senior Manager, Digital Analytics Best Buy February 2010  – Present (5 years 7 months) Lead team digital analysts focused on site optimization and visitor behavior research. Senior Manager, Digital Analytics Best Buy February 2010  – Present (5 years 7 months) Lead team digital analysts focused on site optimization and visitor behavior research. Director, Digital Media American Public Media February 2009  –  February 2010  (1 year 1 month) Director, Digital Media American Public Media February 2009  –  February 2010  (1 year 1 month) New Media Manager, Channel Distribution & Marketing Minnesota Public Radio and American Public Media April 2004  –  January 2009  (4 years 10 months) New Media Manager, Channel Distribution & Marketing Minnesota Public Radio and American Public Media April 2004  –  January 2009  (4 years 10 months) Manager, Interactive Development The Nancekivell Groupp September 2001  –  April 2004  (2 years 8 months) Manager, Interactive Development The Nancekivell Groupp September 2001  –  April 2004  (2 years 8 months) Skills Omniture Web Analytics Digital Strategy Content Strategy Analytics Digital Media Content Management Web Development Team Leadership Email Marketing Online Advertising Leadership Interactive Marketing Google Analytics Marketing E-commerce Digital Marketing SEO Information Architecture See 4+     See less Skills  Omniture Web Analytics Digital Strategy Content Strategy Analytics Digital Media Content Management Web Development Team Leadership Email Marketing Online Advertising Leadership Interactive Marketing Google Analytics Marketing E-commerce Digital Marketing SEO Information Architecture See 4+     See less Omniture Web Analytics Digital Strategy Content Strategy Analytics Digital Media Content Management Web Development Team Leadership Email Marketing Online Advertising Leadership Interactive Marketing Google Analytics Marketing E-commerce Digital Marketing SEO Information Architecture See 4+     See less Omniture Web Analytics Digital Strategy Content Strategy Analytics Digital Media Content Management Web Development Team Leadership Email Marketing Online Advertising Leadership Interactive Marketing Google Analytics Marketing E-commerce Digital Marketing SEO Information Architecture See 4+     See less Education University of Minnesota - Carlson School of Management MBA,  Marketing 2005  – 2009 Wellesley College BA,  Music 1988  – 2002 University of Minnesota - Carlson School of Management MBA,  Marketing 2005  – 2009 University of Minnesota - Carlson School of Management MBA,  Marketing 2005  – 2009 University of Minnesota - Carlson School of Management MBA,  Marketing 2005  – 2009 Wellesley College BA,  Music 1988  – 2002 Wellesley College BA,  Music 1988  – 2002 Wellesley College BA,  Music 1988  – 2002 ", "Summary Highly experienced in many aspects of Information Management and Integration. With over 20 years working in BI, Data Warehousing, CRM, MDM he has developed broad and deep knowledge of how to deliver enterprise solutions that deliver business benefit and platforms for growth. He has more specialist technical knowledge around the Oracle BI & Data Warehousing technologies including Engineered Systems.  \n \nExcellent understanding of the UK grocery retail market and broad understanding or Retail and CPG in general. Strong ability to engage with people effectively at all levels of an organisation on a personal level as well as being comfortable presenting to larger groups.  \n \nHome is in the Yorkshire Dales where you will find him walking, cycling, or more likely running kids to and from their sporting events. Summary Highly experienced in many aspects of Information Management and Integration. With over 20 years working in BI, Data Warehousing, CRM, MDM he has developed broad and deep knowledge of how to deliver enterprise solutions that deliver business benefit and platforms for growth. He has more specialist technical knowledge around the Oracle BI & Data Warehousing technologies including Engineered Systems.  \n \nExcellent understanding of the UK grocery retail market and broad understanding or Retail and CPG in general. Strong ability to engage with people effectively at all levels of an organisation on a personal level as well as being comfortable presenting to larger groups.  \n \nHome is in the Yorkshire Dales where you will find him walking, cycling, or more likely running kids to and from their sporting events. Highly experienced in many aspects of Information Management and Integration. With over 20 years working in BI, Data Warehousing, CRM, MDM he has developed broad and deep knowledge of how to deliver enterprise solutions that deliver business benefit and platforms for growth. He has more specialist technical knowledge around the Oracle BI & Data Warehousing technologies including Engineered Systems.  \n \nExcellent understanding of the UK grocery retail market and broad understanding or Retail and CPG in general. Strong ability to engage with people effectively at all levels of an organisation on a personal level as well as being comfortable presenting to larger groups.  \n \nHome is in the Yorkshire Dales where you will find him walking, cycling, or more likely running kids to and from their sporting events. Highly experienced in many aspects of Information Management and Integration. With over 20 years working in BI, Data Warehousing, CRM, MDM he has developed broad and deep knowledge of how to deliver enterprise solutions that deliver business benefit and platforms for growth. He has more specialist technical knowledge around the Oracle BI & Data Warehousing technologies including Engineered Systems.  \n \nExcellent understanding of the UK grocery retail market and broad understanding or Retail and CPG in general. Strong ability to engage with people effectively at all levels of an organisation on a personal level as well as being comfortable presenting to larger groups.  \n \nHome is in the Yorkshire Dales where you will find him walking, cycling, or more likely running kids to and from their sporting events. Experience Senior Manager Digital & Analytics Accenture September 2014  – Present (1 year) Manchester, United Kingdom Fresh new start in the Digital practice at Accenture. I will be using my background in Data, Integration, Analytics, Oracle and Retail to deliver projects across UK and Ireland. I am very excited to be getting the opportunity to work on a wide range of projects in different organisations using Analytics and BI. The Analytics team within Accenture digital is growing rapidly as we respond to the increasing business demand for new innovative solutions exploiting the latest techniques in Big Data, Analytics, Visualisation, etc. Head of MIS Wm Morrison Supermarkets Plc October 2007  –  September 2014  (7 years) Bradford, United Kingdom Created the first MIS team in Morrisons from scratch to a permanent onshore team of 12 BI/DW professionals split 50:50 between Architecture and run.  \nEstablished near-shore support service with 3rd party for all BI services. \nEstablished 24x7 remote BI Platform support for Oracle Exadata with Oracle AM&R service. \nWorked with on-shore and off shore delivery teams from multiple vendors to build all elements of the EDW & BI Platform. \n \nImplemented a number of elements coming together to make up a strategic data warehouse and BI platform for Morrisons:-  \nNear Real-time Retail ODS, Oracle BI Apps for Finance (GL, AP, AR Procure & Spend), BI Apps for Manufacturing, Oracle Retail Data Model for core retail functions plus bespoke extensions where required.  \nSelected and implemented integration using GoldenGate and Oracle Data Integrator. Also used Informatica where it is embedded in the BI apps integration. Information Systems Manager Waitrose November 1995  –  October 2007  (12 years) Held various roles across John Lewis Partnership, principally within Waitrose. Most of these roles were in the area of Business Intelligence, CPM, Data Integration, etc. Spent the final few years running the Information Systems team. This involved developing the data warehouse and BI infrastructure using DB2, DataStage and Business Objects. Various John Lewis 1992  –  October 2007  (15 years) Information Systems Manager (Waitrose) John Lewis Partnership 2004  –  2007  (3 years) Data Warehouse developer Coopers & Lybrand June 1989  –  October 1995  (6 years 5 months) Various roles including Data Warehouse development, Data Modelling, Data Administration and Data Architecture. Senior Manager Digital & Analytics Accenture September 2014  – Present (1 year) Manchester, United Kingdom Fresh new start in the Digital practice at Accenture. I will be using my background in Data, Integration, Analytics, Oracle and Retail to deliver projects across UK and Ireland. I am very excited to be getting the opportunity to work on a wide range of projects in different organisations using Analytics and BI. The Analytics team within Accenture digital is growing rapidly as we respond to the increasing business demand for new innovative solutions exploiting the latest techniques in Big Data, Analytics, Visualisation, etc. Senior Manager Digital & Analytics Accenture September 2014  – Present (1 year) Manchester, United Kingdom Fresh new start in the Digital practice at Accenture. I will be using my background in Data, Integration, Analytics, Oracle and Retail to deliver projects across UK and Ireland. I am very excited to be getting the opportunity to work on a wide range of projects in different organisations using Analytics and BI. The Analytics team within Accenture digital is growing rapidly as we respond to the increasing business demand for new innovative solutions exploiting the latest techniques in Big Data, Analytics, Visualisation, etc. Head of MIS Wm Morrison Supermarkets Plc October 2007  –  September 2014  (7 years) Bradford, United Kingdom Created the first MIS team in Morrisons from scratch to a permanent onshore team of 12 BI/DW professionals split 50:50 between Architecture and run.  \nEstablished near-shore support service with 3rd party for all BI services. \nEstablished 24x7 remote BI Platform support for Oracle Exadata with Oracle AM&R service. \nWorked with on-shore and off shore delivery teams from multiple vendors to build all elements of the EDW & BI Platform. \n \nImplemented a number of elements coming together to make up a strategic data warehouse and BI platform for Morrisons:-  \nNear Real-time Retail ODS, Oracle BI Apps for Finance (GL, AP, AR Procure & Spend), BI Apps for Manufacturing, Oracle Retail Data Model for core retail functions plus bespoke extensions where required.  \nSelected and implemented integration using GoldenGate and Oracle Data Integrator. Also used Informatica where it is embedded in the BI apps integration. Head of MIS Wm Morrison Supermarkets Plc October 2007  –  September 2014  (7 years) Bradford, United Kingdom Created the first MIS team in Morrisons from scratch to a permanent onshore team of 12 BI/DW professionals split 50:50 between Architecture and run.  \nEstablished near-shore support service with 3rd party for all BI services. \nEstablished 24x7 remote BI Platform support for Oracle Exadata with Oracle AM&R service. \nWorked with on-shore and off shore delivery teams from multiple vendors to build all elements of the EDW & BI Platform. \n \nImplemented a number of elements coming together to make up a strategic data warehouse and BI platform for Morrisons:-  \nNear Real-time Retail ODS, Oracle BI Apps for Finance (GL, AP, AR Procure & Spend), BI Apps for Manufacturing, Oracle Retail Data Model for core retail functions plus bespoke extensions where required.  \nSelected and implemented integration using GoldenGate and Oracle Data Integrator. Also used Informatica where it is embedded in the BI apps integration. Information Systems Manager Waitrose November 1995  –  October 2007  (12 years) Held various roles across John Lewis Partnership, principally within Waitrose. Most of these roles were in the area of Business Intelligence, CPM, Data Integration, etc. Spent the final few years running the Information Systems team. This involved developing the data warehouse and BI infrastructure using DB2, DataStage and Business Objects. Information Systems Manager Waitrose November 1995  –  October 2007  (12 years) Held various roles across John Lewis Partnership, principally within Waitrose. Most of these roles were in the area of Business Intelligence, CPM, Data Integration, etc. Spent the final few years running the Information Systems team. This involved developing the data warehouse and BI infrastructure using DB2, DataStage and Business Objects. Various John Lewis 1992  –  October 2007  (15 years) Various John Lewis 1992  –  October 2007  (15 years) Information Systems Manager (Waitrose) John Lewis Partnership 2004  –  2007  (3 years) Information Systems Manager (Waitrose) John Lewis Partnership 2004  –  2007  (3 years) Data Warehouse developer Coopers & Lybrand June 1989  –  October 1995  (6 years 5 months) Various roles including Data Warehouse development, Data Modelling, Data Administration and Data Architecture. Data Warehouse developer Coopers & Lybrand June 1989  –  October 1995  (6 years 5 months) Various roles including Data Warehouse development, Data Modelling, Data Administration and Data Architecture. Skills Business Intelligence Data Warehousing IT Solutions IT Management IT Strategy Information Management Retail Project Delivery Databases Business Process Stakeholder Management Business Analysis Project Management Requirements Analysis Integration Data Modeling Oracle Data Integration OBIEE Management Solution Architecture See 6+     See less Skills  Business Intelligence Data Warehousing IT Solutions IT Management IT Strategy Information Management Retail Project Delivery Databases Business Process Stakeholder Management Business Analysis Project Management Requirements Analysis Integration Data Modeling Oracle Data Integration OBIEE Management Solution Architecture See 6+     See less Business Intelligence Data Warehousing IT Solutions IT Management IT Strategy Information Management Retail Project Delivery Databases Business Process Stakeholder Management Business Analysis Project Management Requirements Analysis Integration Data Modeling Oracle Data Integration OBIEE Management Solution Architecture See 6+     See less Business Intelligence Data Warehousing IT Solutions IT Management IT Strategy Information Management Retail Project Delivery Databases Business Process Stakeholder Management Business Analysis Project Management Requirements Analysis Integration Data Modeling Oracle Data Integration OBIEE Management Solution Architecture See 6+     See less Education University of Plymouth BSc,  Environmental Science 1982  – 1985 University of Plymouth BSc,  Environmental Science 1982  – 1985 University of Plymouth BSc,  Environmental Science 1982  – 1985 University of Plymouth BSc,  Environmental Science 1982  – 1985 ", "Summary I currently work as a Digital Analyst in PBS Interactive. Specialties:Digital (Web) Analytics, Online Content Management, Web Project Management, Video Journalism, Online Video Summary I currently work as a Digital Analyst in PBS Interactive. Specialties:Digital (Web) Analytics, Online Content Management, Web Project Management, Video Journalism, Online Video I currently work as a Digital Analyst in PBS Interactive. Specialties:Digital (Web) Analytics, Online Content Management, Web Project Management, Video Journalism, Online Video I currently work as a Digital Analyst in PBS Interactive. Specialties:Digital (Web) Analytics, Online Content Management, Web Project Management, Video Journalism, Online Video Experience Senior Manager, Digital Analytics Public Broadcasting Service November 2013  – Present (1 year 10 months) Arlington, VA As Senior Manager for Digital Analytics I am responsible for managing the product lifecycle of our digital analytics implementations. I also work with our developers and designers to create and manage the testing of all our top tier online presences (PBS.org, PBS Video, mobile apps, OTT apps). I continue to conduct analysis and research that shapes the decisions PBS makes online. Manager, Digital Analytics Public Broadcasting Service September 2012  – Present (3 years) As a Digital Analyst for PBS Interactive I conduct analysis that directly affects decisions PBS makes online and provide analytics support to our internal teams, stations and producers. Program Manager Public Broadcasting Service November 2010  –  September 2012  (1 year 11 months) I managed a portfolio of large national producers ensuring that their online strategies aligned with those of PBS Interactive and ensuring that they met all our policies and guidelines for producing online content. I also acted as the main liaison between all national producers and our Product Developers. I conducted product marketing and stakeholder management for our enterprise video distribution system and custom website CMS with this group of influential programs Associate Program Manager Public Broadcasting Service May 2010  –  November 2010  (7 months) I managed a portfolio of national producers and online tools. Digital Video Producer/Video Content Manager Public Broadcasting Service May 2008  –  May 2010  (2 years 1 month) I was the video producer for the PBS Vote 2008 website. Web Video Journalist/Photojournalist/Satellite Truck Operator LIN Television January 2004  –  May 2008  (4 years 5 months) I started as a general assignment photojournalist at WPRI and then added duties as a satellite truck operator. I was then entrusted to become the company's first Web Video Journalist where I operated as a solo journalist creating original content for the station's websites. Photojournalist Clear Channel Broadcasting April 2002  –  December 2004  (2 years 9 months) I was a general assignment photojournalist for KCOY/KKFX in Santa Maria California. I served in the Santa Barbara bureau for the first year and at the main station in Santa Maria the second year. Senior Manager, Digital Analytics Public Broadcasting Service November 2013  – Present (1 year 10 months) Arlington, VA As Senior Manager for Digital Analytics I am responsible for managing the product lifecycle of our digital analytics implementations. I also work with our developers and designers to create and manage the testing of all our top tier online presences (PBS.org, PBS Video, mobile apps, OTT apps). I continue to conduct analysis and research that shapes the decisions PBS makes online. Senior Manager, Digital Analytics Public Broadcasting Service November 2013  – Present (1 year 10 months) Arlington, VA As Senior Manager for Digital Analytics I am responsible for managing the product lifecycle of our digital analytics implementations. I also work with our developers and designers to create and manage the testing of all our top tier online presences (PBS.org, PBS Video, mobile apps, OTT apps). I continue to conduct analysis and research that shapes the decisions PBS makes online. Manager, Digital Analytics Public Broadcasting Service September 2012  – Present (3 years) As a Digital Analyst for PBS Interactive I conduct analysis that directly affects decisions PBS makes online and provide analytics support to our internal teams, stations and producers. Manager, Digital Analytics Public Broadcasting Service September 2012  – Present (3 years) As a Digital Analyst for PBS Interactive I conduct analysis that directly affects decisions PBS makes online and provide analytics support to our internal teams, stations and producers. Program Manager Public Broadcasting Service November 2010  –  September 2012  (1 year 11 months) I managed a portfolio of large national producers ensuring that their online strategies aligned with those of PBS Interactive and ensuring that they met all our policies and guidelines for producing online content. I also acted as the main liaison between all national producers and our Product Developers. I conducted product marketing and stakeholder management for our enterprise video distribution system and custom website CMS with this group of influential programs Program Manager Public Broadcasting Service November 2010  –  September 2012  (1 year 11 months) I managed a portfolio of large national producers ensuring that their online strategies aligned with those of PBS Interactive and ensuring that they met all our policies and guidelines for producing online content. I also acted as the main liaison between all national producers and our Product Developers. I conducted product marketing and stakeholder management for our enterprise video distribution system and custom website CMS with this group of influential programs Associate Program Manager Public Broadcasting Service May 2010  –  November 2010  (7 months) I managed a portfolio of national producers and online tools. Associate Program Manager Public Broadcasting Service May 2010  –  November 2010  (7 months) I managed a portfolio of national producers and online tools. Digital Video Producer/Video Content Manager Public Broadcasting Service May 2008  –  May 2010  (2 years 1 month) I was the video producer for the PBS Vote 2008 website. Digital Video Producer/Video Content Manager Public Broadcasting Service May 2008  –  May 2010  (2 years 1 month) I was the video producer for the PBS Vote 2008 website. Web Video Journalist/Photojournalist/Satellite Truck Operator LIN Television January 2004  –  May 2008  (4 years 5 months) I started as a general assignment photojournalist at WPRI and then added duties as a satellite truck operator. I was then entrusted to become the company's first Web Video Journalist where I operated as a solo journalist creating original content for the station's websites. Web Video Journalist/Photojournalist/Satellite Truck Operator LIN Television January 2004  –  May 2008  (4 years 5 months) I started as a general assignment photojournalist at WPRI and then added duties as a satellite truck operator. I was then entrusted to become the company's first Web Video Journalist where I operated as a solo journalist creating original content for the station's websites. Photojournalist Clear Channel Broadcasting April 2002  –  December 2004  (2 years 9 months) I was a general assignment photojournalist for KCOY/KKFX in Santa Maria California. I served in the Santa Barbara bureau for the first year and at the main station in Santa Maria the second year. Photojournalist Clear Channel Broadcasting April 2002  –  December 2004  (2 years 9 months) I was a general assignment photojournalist for KCOY/KKFX in Santa Maria California. I served in the Santa Barbara bureau for the first year and at the main station in Santa Maria the second year. Skills Web Video Content Management Video Journalism New Media Digital Media Content Strategy Video Production Content Development Digital Strategy Editing Broadcast Blogging Web Analytics Skills  Web Video Content Management Video Journalism New Media Digital Media Content Strategy Video Production Content Development Digital Strategy Editing Broadcast Blogging Web Analytics Web Video Content Management Video Journalism New Media Digital Media Content Strategy Video Production Content Development Digital Strategy Editing Broadcast Blogging Web Analytics Web Video Content Management Video Journalism New Media Digital Media Content Strategy Video Production Content Development Digital Strategy Editing Broadcast Blogging Web Analytics Education Missouri State University Bachelor of Science,  Media Production 1997  – 2002 Missouri State University Bachelor of Science,  Media Production 1997  – 2002 Missouri State University Bachelor of Science,  Media Production 1997  – 2002 Missouri State University Bachelor of Science,  Media Production 1997  – 2002 Honors & Awards Additional Honors & Awards Golden Mic, Local Emmy Nomination Additional Honors & Awards Golden Mic, Local Emmy Nomination Additional Honors & Awards Golden Mic, Local Emmy Nomination Additional Honors & Awards Golden Mic, Local Emmy Nomination ", "Languages   Skills Content Management Archives Video CMS Social Media Editing Research Digital Asset Management Metadata Google Analytics Digital Media HTML XML Television Information Architecture Library Content Strategy Digitization Blogging Digital Libraries WordPress Social Networking Creative Direction Multimedia User Experience CSS Digital Archiving Digital Curation XHTML Online Content Creation Web Content Creation Web Content Management Storytelling Digital Strategy Archival Processing Information Science Library Research Library Science XML Schema TV Everywhere Omniture Web Analytics Rentrak OnDemand... Brightcove CMS Nielsen Borealis New Media comScore See 32+     See less Skills  Content Management Archives Video CMS Social Media Editing Research Digital Asset Management Metadata Google Analytics Digital Media HTML XML Television Information Architecture Library Content Strategy Digitization Blogging Digital Libraries WordPress Social Networking Creative Direction Multimedia User Experience CSS Digital Archiving Digital Curation XHTML Online Content Creation Web Content Creation Web Content Management Storytelling Digital Strategy Archival Processing Information Science Library Research Library Science XML Schema TV Everywhere Omniture Web Analytics Rentrak OnDemand... Brightcove CMS Nielsen Borealis New Media comScore See 32+     See less Content Management Archives Video CMS Social Media Editing Research Digital Asset Management Metadata Google Analytics Digital Media HTML XML Television Information Architecture Library Content Strategy Digitization Blogging Digital Libraries WordPress Social Networking Creative Direction Multimedia User Experience CSS Digital Archiving Digital Curation XHTML Online Content Creation Web Content Creation Web Content Management Storytelling Digital Strategy Archival Processing Information Science Library Research Library Science XML Schema TV Everywhere Omniture Web Analytics Rentrak OnDemand... Brightcove CMS Nielsen Borealis New Media comScore See 32+     See less Content Management Archives Video CMS Social Media Editing Research Digital Asset Management Metadata Google Analytics Digital Media HTML XML Television Information Architecture Library Content Strategy Digitization Blogging Digital Libraries WordPress Social Networking Creative Direction Multimedia User Experience CSS Digital Archiving Digital Curation XHTML Online Content Creation Web Content Creation Web Content Management Storytelling Digital Strategy Archival Processing Information Science Library Research Library Science XML Schema TV Everywhere Omniture Web Analytics Rentrak OnDemand... Brightcove CMS Nielsen Borealis New Media comScore See 32+     See less Education Long Island University, C.W. Post Campus Master of Science 2009  – 2011 Susquehanna University Bachelor of Arts 1997  – 2001 Long Island University, C.W. Post Campus Master of Science 2009  – 2011 Long Island University, C.W. Post Campus Master of Science 2009  – 2011 Long Island University, C.W. Post Campus Master of Science 2009  – 2011 Susquehanna University Bachelor of Arts 1997  – 2001 Susquehanna University Bachelor of Arts 1997  – 2001 Susquehanna University Bachelor of Arts 1997  – 2001 Honors & Awards Additional Honors & Awards IMLS Internship-Grant Award, 2010 \nBeta Phi Mu Library and Information Studies Honor Society, 2011 inductee Additional Honors & Awards IMLS Internship-Grant Award, 2010 \nBeta Phi Mu Library and Information Studies Honor Society, 2011 inductee Additional Honors & Awards IMLS Internship-Grant Award, 2010 \nBeta Phi Mu Library and Information Studies Honor Society, 2011 inductee Additional Honors & Awards IMLS Internship-Grant Award, 2010 \nBeta Phi Mu Library and Information Studies Honor Society, 2011 inductee ", "Summary Ameriprise Financial is currently hiring a Diigital Analytics Manager. Please follow the link for details, or contact me for more information: http://bit.ly/1JU17Fm Summary Ameriprise Financial is currently hiring a Diigital Analytics Manager. Please follow the link for details, or contact me for more information: http://bit.ly/1JU17Fm Ameriprise Financial is currently hiring a Diigital Analytics Manager. Please follow the link for details, or contact me for more information: http://bit.ly/1JU17Fm Ameriprise Financial is currently hiring a Diigital Analytics Manager. Please follow the link for details, or contact me for more information: http://bit.ly/1JU17Fm Experience Senior Manager, Digital Analytics Ameriprise Financial Services, Inc. January 2015  – Present (8 months) Greater Minneapolis-St. Paul Area Consumer Insights Associate General Mills June 2013  –  January 2015  (1 year 8 months) I help marketers understand consumer behavior data and how to leverage it to make better decisions. Senior Marketing Consultant Evantage Consulting October 2007  –  May 2013  (5 years 8 months) Minneapolis -Performs analysis and crafts marketing strategies rooted in data for numerous clients in healthcare, ecommerce, consumer packaged goods, and manufacturing industries. \n-Designed lead generation plan to identify and track leads for a manufacturing client that resulted in 25% of site visitors self-identifying (results presented at eMetrics San Francisco 2012). \n-Performed analysis that led ecommerce client to 100% increase in conversion rates. \n-Wrote Year 1 digital marketing plan for multibillion dollar retailer launching an ecommerce division. eCommerce Manager Caldrea September 2005  –  September 2007  (2 years 1 month) -Managed overhaul and re-launch of caldrea.com and mrsmeyers.com in Fall 2005, making functional changes that resulted in 50% higher conversion rates \n-Increased division revenues and profits 260% in one year, when rest of company increased 40% \n-Managed all content and functional website development, adhering to brand standards while meeting business needs  \n-Monitor Web Analytics, identifying areas for improvement and opportunities for increasing conversion rate and order size \n-Manage and implement all online marketing efforts, including marketing strategy and plan development, specifically: Paid Search Specialist iProspect October 2003  –  August 2005  (1 year 11 months) -Manage and develop Paid Inclusion product offerings, including Yahoo! Search Submit Pro, Yahoo! Shopping, Froogle, Google Base, and others \n-Quadrupled program revenues in six months \n-Increased number of managed client web pages from 17,000 to 800,000 including multiple Fortune 500 companies \n-Work with technical team to design, develop, and implement program management tools Media Planner Campbell Mithun 2000  –  2002  (2 years) -Researched, planned, negotiated, and executed multi-million dollar media plans for General Mills brands, including HoneyNut Chex, Boxtops for Education, and Nature Valley Granola Bars \n-Initiated efficiency analyses, including developing a spreadsheet application that eliminated repetitive paperwork and saved 1000+ work-hours \n-Implemented new software system, becoming department expert and acting as liaison to the client, receiving multiple commendations from client for outstanding customer service  \n-Trained and managed 2-3 media analysts in media planning \n-Negotiated and purchased radio time in multiple markets Senior Manager, Digital Analytics Ameriprise Financial Services, Inc. January 2015  – Present (8 months) Greater Minneapolis-St. Paul Area Senior Manager, Digital Analytics Ameriprise Financial Services, Inc. January 2015  – Present (8 months) Greater Minneapolis-St. Paul Area Consumer Insights Associate General Mills June 2013  –  January 2015  (1 year 8 months) I help marketers understand consumer behavior data and how to leverage it to make better decisions. Consumer Insights Associate General Mills June 2013  –  January 2015  (1 year 8 months) I help marketers understand consumer behavior data and how to leverage it to make better decisions. Senior Marketing Consultant Evantage Consulting October 2007  –  May 2013  (5 years 8 months) Minneapolis -Performs analysis and crafts marketing strategies rooted in data for numerous clients in healthcare, ecommerce, consumer packaged goods, and manufacturing industries. \n-Designed lead generation plan to identify and track leads for a manufacturing client that resulted in 25% of site visitors self-identifying (results presented at eMetrics San Francisco 2012). \n-Performed analysis that led ecommerce client to 100% increase in conversion rates. \n-Wrote Year 1 digital marketing plan for multibillion dollar retailer launching an ecommerce division. Senior Marketing Consultant Evantage Consulting October 2007  –  May 2013  (5 years 8 months) Minneapolis -Performs analysis and crafts marketing strategies rooted in data for numerous clients in healthcare, ecommerce, consumer packaged goods, and manufacturing industries. \n-Designed lead generation plan to identify and track leads for a manufacturing client that resulted in 25% of site visitors self-identifying (results presented at eMetrics San Francisco 2012). \n-Performed analysis that led ecommerce client to 100% increase in conversion rates. \n-Wrote Year 1 digital marketing plan for multibillion dollar retailer launching an ecommerce division. eCommerce Manager Caldrea September 2005  –  September 2007  (2 years 1 month) -Managed overhaul and re-launch of caldrea.com and mrsmeyers.com in Fall 2005, making functional changes that resulted in 50% higher conversion rates \n-Increased division revenues and profits 260% in one year, when rest of company increased 40% \n-Managed all content and functional website development, adhering to brand standards while meeting business needs  \n-Monitor Web Analytics, identifying areas for improvement and opportunities for increasing conversion rate and order size \n-Manage and implement all online marketing efforts, including marketing strategy and plan development, specifically: eCommerce Manager Caldrea September 2005  –  September 2007  (2 years 1 month) -Managed overhaul and re-launch of caldrea.com and mrsmeyers.com in Fall 2005, making functional changes that resulted in 50% higher conversion rates \n-Increased division revenues and profits 260% in one year, when rest of company increased 40% \n-Managed all content and functional website development, adhering to brand standards while meeting business needs  \n-Monitor Web Analytics, identifying areas for improvement and opportunities for increasing conversion rate and order size \n-Manage and implement all online marketing efforts, including marketing strategy and plan development, specifically: Paid Search Specialist iProspect October 2003  –  August 2005  (1 year 11 months) -Manage and develop Paid Inclusion product offerings, including Yahoo! Search Submit Pro, Yahoo! Shopping, Froogle, Google Base, and others \n-Quadrupled program revenues in six months \n-Increased number of managed client web pages from 17,000 to 800,000 including multiple Fortune 500 companies \n-Work with technical team to design, develop, and implement program management tools Paid Search Specialist iProspect October 2003  –  August 2005  (1 year 11 months) -Manage and develop Paid Inclusion product offerings, including Yahoo! Search Submit Pro, Yahoo! Shopping, Froogle, Google Base, and others \n-Quadrupled program revenues in six months \n-Increased number of managed client web pages from 17,000 to 800,000 including multiple Fortune 500 companies \n-Work with technical team to design, develop, and implement program management tools Media Planner Campbell Mithun 2000  –  2002  (2 years) -Researched, planned, negotiated, and executed multi-million dollar media plans for General Mills brands, including HoneyNut Chex, Boxtops for Education, and Nature Valley Granola Bars \n-Initiated efficiency analyses, including developing a spreadsheet application that eliminated repetitive paperwork and saved 1000+ work-hours \n-Implemented new software system, becoming department expert and acting as liaison to the client, receiving multiple commendations from client for outstanding customer service  \n-Trained and managed 2-3 media analysts in media planning \n-Negotiated and purchased radio time in multiple markets Media Planner Campbell Mithun 2000  –  2002  (2 years) -Researched, planned, negotiated, and executed multi-million dollar media plans for General Mills brands, including HoneyNut Chex, Boxtops for Education, and Nature Valley Granola Bars \n-Initiated efficiency analyses, including developing a spreadsheet application that eliminated repetitive paperwork and saved 1000+ work-hours \n-Implemented new software system, becoming department expert and acting as liaison to the client, receiving multiple commendations from client for outstanding customer service  \n-Trained and managed 2-3 media analysts in media planning \n-Negotiated and purchased radio time in multiple markets Skills Analytics Web Analytics Marketing Strategy Online Marketing Digital Marketing Digital Strategy Google Analytics Omniture Marketing Management Integrated Marketing Media Planning Online Advertising SEM Social Media Marketing Landing Page... SEO PPC Email Marketing Marketing Lead Generation E-commerce Interactive Marketing Google Adwords Management Strategy See 10+     See less Skills  Analytics Web Analytics Marketing Strategy Online Marketing Digital Marketing Digital Strategy Google Analytics Omniture Marketing Management Integrated Marketing Media Planning Online Advertising SEM Social Media Marketing Landing Page... SEO PPC Email Marketing Marketing Lead Generation E-commerce Interactive Marketing Google Adwords Management Strategy See 10+     See less Analytics Web Analytics Marketing Strategy Online Marketing Digital Marketing Digital Strategy Google Analytics Omniture Marketing Management Integrated Marketing Media Planning Online Advertising SEM Social Media Marketing Landing Page... SEO PPC Email Marketing Marketing Lead Generation E-commerce Interactive Marketing Google Adwords Management Strategy See 10+     See less Analytics Web Analytics Marketing Strategy Online Marketing Digital Marketing Digital Strategy Google Analytics Omniture Marketing Management Integrated Marketing Media Planning Online Advertising SEM Social Media Marketing Landing Page... SEO PPC Email Marketing Marketing Lead Generation E-commerce Interactive Marketing Google Adwords Management Strategy See 10+     See less Education University of St. Thomas MBA,  Business 2005  – 2008 Boston University Business September 2004  – May 2005 Carleton College BA,  Psychology September 1995  – June 1999 University of St. Thomas MBA,  Business 2005  – 2008 University of St. Thomas MBA,  Business 2005  – 2008 University of St. Thomas MBA,  Business 2005  – 2008 Boston University Business September 2004  – May 2005 Boston University Business September 2004  – May 2005 Boston University Business September 2004  – May 2005 Carleton College BA,  Psychology September 1995  – June 1999 Carleton College BA,  Psychology September 1995  – June 1999 Carleton College BA,  Psychology September 1995  – June 1999 ", "Summary Driven Analytics Leader / Data Visualization guru with a curious analyst's mind and ability to unlock the toughest challenges an organization can face. Over 15 years in driving successes at every level.  \n \nKey skills include extremely fast learning, delivering actionable insights, effective communication, leading large cross functional teams, making big data actionable, data visualization, process re-definition and measurement, business analysis, and being able to tackle the toughest problems available. Summary Driven Analytics Leader / Data Visualization guru with a curious analyst's mind and ability to unlock the toughest challenges an organization can face. Over 15 years in driving successes at every level.  \n \nKey skills include extremely fast learning, delivering actionable insights, effective communication, leading large cross functional teams, making big data actionable, data visualization, process re-definition and measurement, business analysis, and being able to tackle the toughest problems available. Driven Analytics Leader / Data Visualization guru with a curious analyst's mind and ability to unlock the toughest challenges an organization can face. Over 15 years in driving successes at every level.  \n \nKey skills include extremely fast learning, delivering actionable insights, effective communication, leading large cross functional teams, making big data actionable, data visualization, process re-definition and measurement, business analysis, and being able to tackle the toughest problems available. Driven Analytics Leader / Data Visualization guru with a curious analyst's mind and ability to unlock the toughest challenges an organization can face. Over 15 years in driving successes at every level.  \n \nKey skills include extremely fast learning, delivering actionable insights, effective communication, leading large cross functional teams, making big data actionable, data visualization, process re-definition and measurement, business analysis, and being able to tackle the toughest problems available. Experience Senior Manager, Digital Analytics QVC August 2014  – Present (1 year 1 month) Greater Philadelphia Area Senior Manager, Business Intelligence / Business Analysis QVC May 2013  –  August 2014  (1 year 4 months) Greater Philadelphia Area Project Manager: Analytics, Business Process, and Technology projects QVC May 2011  –  May 2013  (2 years 1 month) Greater Philadelphia Area Analytics Solutions Manager / Program Manager Eastport Analytics June 2009  –  May 2011  (2 years) Washington D.C. Metro Area Headed a program at the IRS applying advanced analytics capabilities to deliver increased collections to identify uncollected revenue, score results, and deliver actionable intelligence to facilitate recovery. \n \nOversaw a team of data engineers and analysts in rapidly developing solutions to access disparate data sources, organize it, analyze it, and provide insights to client management. Team leveraged a variety of analytical techniques and tools that yielded millions in revenue, including ETL, data mining, data visualization, web harvesting, entity resolution, and visual search. \n \nArchitected targeted interactive visualizations to analyze and share insights, of large data sets, with Analysts and Senior Management leveraging Tableau Desktop and Server. \n \nProvided program management and business analysis skills expertise for multiple simultaneous agile analytics projects including, project guidance, requirements analysis, customer relationship management, project planning, solution design, and risk management. \n \nGenerated new work for Eastport Analytics based on the incredible results delivered by teams I directed. Sr Associate / Engagement Management KPMG April 2008  –  June 2009  (1 year 3 months) Washington D.C. Metro Area Facilitated the development of standard financial management business processes with senior management across multiple organizations. Able to negotiate positive outcomes when participants had disagreements and provide cost/benefit breakdowns for known issues. \n \nIdentified additional opportunities for KPMG to provide business process improvement work and technology concept designs with the customer. Senior Consultant / Project Management CGI Federal August 2000  –  April 2008  (7 years 9 months) Washington D.C. Metro Area Managed a functional delivery team responsible for implementing a large-scale ERP financial and procurement system for the Federal Government that included several simultaneous projects occurring at any given time. Projects were delivered on time and on budget exceeding expectations of the customer. \n \nAnalyzed customer requirements to engineer and deliver a variety of solutions across multiple clients that involved business intelligence, analytics, system interface design, ERP customizations, and system upgrades.  \n \nAcknowledged by customers for excellent communication skills and coordination across large teams working with architects, developers, analysts, and other managers to keep projects on time and on budget while maintaining high value for the customer. Able to translate between client senior management, client partners, and developers to focus on creating valuable results that everyone understands. Senior Manager, Digital Analytics QVC August 2014  – Present (1 year 1 month) Greater Philadelphia Area Senior Manager, Digital Analytics QVC August 2014  – Present (1 year 1 month) Greater Philadelphia Area Senior Manager, Business Intelligence / Business Analysis QVC May 2013  –  August 2014  (1 year 4 months) Greater Philadelphia Area Senior Manager, Business Intelligence / Business Analysis QVC May 2013  –  August 2014  (1 year 4 months) Greater Philadelphia Area Project Manager: Analytics, Business Process, and Technology projects QVC May 2011  –  May 2013  (2 years 1 month) Greater Philadelphia Area Project Manager: Analytics, Business Process, and Technology projects QVC May 2011  –  May 2013  (2 years 1 month) Greater Philadelphia Area Analytics Solutions Manager / Program Manager Eastport Analytics June 2009  –  May 2011  (2 years) Washington D.C. Metro Area Headed a program at the IRS applying advanced analytics capabilities to deliver increased collections to identify uncollected revenue, score results, and deliver actionable intelligence to facilitate recovery. \n \nOversaw a team of data engineers and analysts in rapidly developing solutions to access disparate data sources, organize it, analyze it, and provide insights to client management. Team leveraged a variety of analytical techniques and tools that yielded millions in revenue, including ETL, data mining, data visualization, web harvesting, entity resolution, and visual search. \n \nArchitected targeted interactive visualizations to analyze and share insights, of large data sets, with Analysts and Senior Management leveraging Tableau Desktop and Server. \n \nProvided program management and business analysis skills expertise for multiple simultaneous agile analytics projects including, project guidance, requirements analysis, customer relationship management, project planning, solution design, and risk management. \n \nGenerated new work for Eastport Analytics based on the incredible results delivered by teams I directed. Analytics Solutions Manager / Program Manager Eastport Analytics June 2009  –  May 2011  (2 years) Washington D.C. Metro Area Headed a program at the IRS applying advanced analytics capabilities to deliver increased collections to identify uncollected revenue, score results, and deliver actionable intelligence to facilitate recovery. \n \nOversaw a team of data engineers and analysts in rapidly developing solutions to access disparate data sources, organize it, analyze it, and provide insights to client management. Team leveraged a variety of analytical techniques and tools that yielded millions in revenue, including ETL, data mining, data visualization, web harvesting, entity resolution, and visual search. \n \nArchitected targeted interactive visualizations to analyze and share insights, of large data sets, with Analysts and Senior Management leveraging Tableau Desktop and Server. \n \nProvided program management and business analysis skills expertise for multiple simultaneous agile analytics projects including, project guidance, requirements analysis, customer relationship management, project planning, solution design, and risk management. \n \nGenerated new work for Eastport Analytics based on the incredible results delivered by teams I directed. Sr Associate / Engagement Management KPMG April 2008  –  June 2009  (1 year 3 months) Washington D.C. Metro Area Facilitated the development of standard financial management business processes with senior management across multiple organizations. Able to negotiate positive outcomes when participants had disagreements and provide cost/benefit breakdowns for known issues. \n \nIdentified additional opportunities for KPMG to provide business process improvement work and technology concept designs with the customer. Sr Associate / Engagement Management KPMG April 2008  –  June 2009  (1 year 3 months) Washington D.C. Metro Area Facilitated the development of standard financial management business processes with senior management across multiple organizations. Able to negotiate positive outcomes when participants had disagreements and provide cost/benefit breakdowns for known issues. \n \nIdentified additional opportunities for KPMG to provide business process improvement work and technology concept designs with the customer. Senior Consultant / Project Management CGI Federal August 2000  –  April 2008  (7 years 9 months) Washington D.C. Metro Area Managed a functional delivery team responsible for implementing a large-scale ERP financial and procurement system for the Federal Government that included several simultaneous projects occurring at any given time. Projects were delivered on time and on budget exceeding expectations of the customer. \n \nAnalyzed customer requirements to engineer and deliver a variety of solutions across multiple clients that involved business intelligence, analytics, system interface design, ERP customizations, and system upgrades.  \n \nAcknowledged by customers for excellent communication skills and coordination across large teams working with architects, developers, analysts, and other managers to keep projects on time and on budget while maintaining high value for the customer. Able to translate between client senior management, client partners, and developers to focus on creating valuable results that everyone understands. Senior Consultant / Project Management CGI Federal August 2000  –  April 2008  (7 years 9 months) Washington D.C. Metro Area Managed a functional delivery team responsible for implementing a large-scale ERP financial and procurement system for the Federal Government that included several simultaneous projects occurring at any given time. Projects were delivered on time and on budget exceeding expectations of the customer. \n \nAnalyzed customer requirements to engineer and deliver a variety of solutions across multiple clients that involved business intelligence, analytics, system interface design, ERP customizations, and system upgrades.  \n \nAcknowledged by customers for excellent communication skills and coordination across large teams working with architects, developers, analysts, and other managers to keep projects on time and on budget while maintaining high value for the customer. Able to translate between client senior management, client partners, and developers to focus on creating valuable results that everyone understands. Skills Business Intelligence Business Process Business Analysis Analytics Requirements Analysis Project Management Agile Methodologies Business Process... ERP Management SDLC Data Visualization Requirements Gathering Team Leadership Tableau Process Improvement Spotfire Program Management IT Strategy CRM Enterprise Architecture Project Portfolio... IT Management Solution Architecture Data Warehousing SharePoint Leadership Data Modeling MicroStrategy SAS Enterprise Guide Analysis Consulting See 17+     See less Skills  Business Intelligence Business Process Business Analysis Analytics Requirements Analysis Project Management Agile Methodologies Business Process... ERP Management SDLC Data Visualization Requirements Gathering Team Leadership Tableau Process Improvement Spotfire Program Management IT Strategy CRM Enterprise Architecture Project Portfolio... IT Management Solution Architecture Data Warehousing SharePoint Leadership Data Modeling MicroStrategy SAS Enterprise Guide Analysis Consulting See 17+     See less Business Intelligence Business Process Business Analysis Analytics Requirements Analysis Project Management Agile Methodologies Business Process... ERP Management SDLC Data Visualization Requirements Gathering Team Leadership Tableau Process Improvement Spotfire Program Management IT Strategy CRM Enterprise Architecture Project Portfolio... IT Management Solution Architecture Data Warehousing SharePoint Leadership Data Modeling MicroStrategy SAS Enterprise Guide Analysis Consulting See 17+     See less Business Intelligence Business Process Business Analysis Analytics Requirements Analysis Project Management Agile Methodologies Business Process... ERP Management SDLC Data Visualization Requirements Gathering Team Leadership Tableau Process Improvement Spotfire Program Management IT Strategy CRM Enterprise Architecture Project Portfolio... IT Management Solution Architecture Data Warehousing SharePoint Leadership Data Modeling MicroStrategy SAS Enterprise Guide Analysis Consulting See 17+     See less Education University of Maryland - Robert H. Smith School of Business MBA,  Business 2004  – 2007 University of Maryland College Park MBA,  Business Management ,  Entrepreneurship ,  and Marketing 2004  – 2007 Rensselaer Polytechnic Institute M.S.,  Management 1996  – 2000 Activities and Societies:  Football ,  Zeta Psi Shenendehowa 1992  – 1996 University of Maryland - Robert H. Smith School of Business MBA,  Business 2004  – 2007 University of Maryland - Robert H. Smith School of Business MBA,  Business 2004  – 2007 University of Maryland - Robert H. Smith School of Business MBA,  Business 2004  – 2007 University of Maryland College Park MBA,  Business Management ,  Entrepreneurship ,  and Marketing 2004  – 2007 University of Maryland College Park MBA,  Business Management ,  Entrepreneurship ,  and Marketing 2004  – 2007 University of Maryland College Park MBA,  Business Management ,  Entrepreneurship ,  and Marketing 2004  – 2007 Rensselaer Polytechnic Institute M.S.,  Management 1996  – 2000 Activities and Societies:  Football ,  Zeta Psi Rensselaer Polytechnic Institute M.S.,  Management 1996  – 2000 Activities and Societies:  Football ,  Zeta Psi Rensselaer Polytechnic Institute M.S.,  Management 1996  – 2000 Activities and Societies:  Football ,  Zeta Psi Shenendehowa 1992  – 1996 Shenendehowa 1992  – 1996 Shenendehowa 1992  – 1996 Honors & Awards QVC President's Award (Cornerstone) QVC CEO June 2012 QVC President's Award (Cornerstone) QVC CEO June 2012 QVC President's Award (Cornerstone) QVC CEO June 2012 QVC President's Award (Cornerstone) QVC CEO June 2012 ", "Experience Senior Manager, Digital Analytics Hewlett-Packard November 2009  – Present (5 years 10 months) Responsible for global analytic best practices and reporting for paid and organic acquisition search and HP.com internal search. Managing search tools, integrations and data feeds to ensure data integrity and consistency of KPIs across the enterprise. Part of the team responsible for managing HP's relationship with Adobe Digital Marketing (formerly Omniture) and the data warehouse that houses our SiteCatalyst data feed. Chief Data Strategist Friends of Jason Chaffetz 2014  – Present (1 year) Vice Chairman Utah County Republican Party May 2013  –  June 2014  (1 year 2 months) Cedar Hills, Utah Built the first permanent County Republican Party Headquarters in Utah with private donations from prominent business leaders. Created a comprehensive data strategy for the party housing 250k voters with enterprise CRM capabilities similar to those used by the Obama campaign in 2012. Created the party's first internship program and leveraged relationships with local College Republicans in conjunction with volunteers to contact thousands of voters prior to the 2014 Republican Primary. Senior Best Practices Consultant Omniture 2002  –  November 2009  (7 years) Developed and evangelized web-analytic best practices for industry leaders in technology and retail. Served as dedicated web analyst for clients such as eBay, Sears and Electronic Arts. As the founding member of Omniture's consulting services team, I set an example for future analysts by giving straight answers to complex problems and working closely with Omniture Engineering to develop unique solutions that could benefit future customers, including the Excel Client, Fallout-reporting and the Unified Sources DB Vista Rule (later Channel manager). \n \nQA lead for several products in the Omniture suite including Excel Client and Discover. Helped drive quality as an important component of Omniture's engineering and product teams. Manager, Business Analytics Network Solutions 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Senior Business Analyst Verisign 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Senior Business Analyst ImageCafe/Network Solutions/Verisign 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Sales Manager ImageCafe 1999  –  2000  (1 year) Responsible for recruiting and strategic partners and building alliances for a small template web development start-up in Maryland which would soon be acquired by Network Solutions. Worked with our development team to craft an offer that was compelling to potential partners and still profitable for the company. My most impactfull accomplishment was the development of a channel reporting infrastructure that would lead to my being named Senior Business Analyst for the entire Value Added Services division of Network Solutions. Business Development (Co-founder) Cubus Corporation 1998  –  1999  (1 year) Recruited enterprise beta clients for our online CAD collaboration platform and created documentation for our products. Production Manager Skunk New Media 1996  –  1998  (2 years) Lead Developer of the product responsible for the bulk of Skunk New Media's revenue - a CD-Rom project for the National Science Foundation called 'SETQuest'. Business Development Skunk Technologies 1996  –  1998  (2 years) Recruited enterprise beta clients for our JAVA platform and products. Successfully recruited Internet Service Providers willing to evangelize our technology. Also served as product manager for Skunk Technology's premier product, Entao Visual Chat. Corporate Sales Personal Support Computers 1994  –  1996  (2 years) Senior Sales representative at what was at the time the world's largest Apple Authorized retail store. Our location on the edge of Beverly Hills made us the go-to retailer for many Hollywood studios and celebrities. Clients included Disney, MGM, and Warner Music. Senior Manager, Digital Analytics Hewlett-Packard November 2009  – Present (5 years 10 months) Responsible for global analytic best practices and reporting for paid and organic acquisition search and HP.com internal search. Managing search tools, integrations and data feeds to ensure data integrity and consistency of KPIs across the enterprise. Part of the team responsible for managing HP's relationship with Adobe Digital Marketing (formerly Omniture) and the data warehouse that houses our SiteCatalyst data feed. Senior Manager, Digital Analytics Hewlett-Packard November 2009  – Present (5 years 10 months) Responsible for global analytic best practices and reporting for paid and organic acquisition search and HP.com internal search. Managing search tools, integrations and data feeds to ensure data integrity and consistency of KPIs across the enterprise. Part of the team responsible for managing HP's relationship with Adobe Digital Marketing (formerly Omniture) and the data warehouse that houses our SiteCatalyst data feed. Chief Data Strategist Friends of Jason Chaffetz 2014  – Present (1 year) Chief Data Strategist Friends of Jason Chaffetz 2014  – Present (1 year) Vice Chairman Utah County Republican Party May 2013  –  June 2014  (1 year 2 months) Cedar Hills, Utah Built the first permanent County Republican Party Headquarters in Utah with private donations from prominent business leaders. Created a comprehensive data strategy for the party housing 250k voters with enterprise CRM capabilities similar to those used by the Obama campaign in 2012. Created the party's first internship program and leveraged relationships with local College Republicans in conjunction with volunteers to contact thousands of voters prior to the 2014 Republican Primary. Vice Chairman Utah County Republican Party May 2013  –  June 2014  (1 year 2 months) Cedar Hills, Utah Built the first permanent County Republican Party Headquarters in Utah with private donations from prominent business leaders. Created a comprehensive data strategy for the party housing 250k voters with enterprise CRM capabilities similar to those used by the Obama campaign in 2012. Created the party's first internship program and leveraged relationships with local College Republicans in conjunction with volunteers to contact thousands of voters prior to the 2014 Republican Primary. Senior Best Practices Consultant Omniture 2002  –  November 2009  (7 years) Developed and evangelized web-analytic best practices for industry leaders in technology and retail. Served as dedicated web analyst for clients such as eBay, Sears and Electronic Arts. As the founding member of Omniture's consulting services team, I set an example for future analysts by giving straight answers to complex problems and working closely with Omniture Engineering to develop unique solutions that could benefit future customers, including the Excel Client, Fallout-reporting and the Unified Sources DB Vista Rule (later Channel manager). \n \nQA lead for several products in the Omniture suite including Excel Client and Discover. Helped drive quality as an important component of Omniture's engineering and product teams. Senior Best Practices Consultant Omniture 2002  –  November 2009  (7 years) Developed and evangelized web-analytic best practices for industry leaders in technology and retail. Served as dedicated web analyst for clients such as eBay, Sears and Electronic Arts. As the founding member of Omniture's consulting services team, I set an example for future analysts by giving straight answers to complex problems and working closely with Omniture Engineering to develop unique solutions that could benefit future customers, including the Excel Client, Fallout-reporting and the Unified Sources DB Vista Rule (later Channel manager). \n \nQA lead for several products in the Omniture suite including Excel Client and Discover. Helped drive quality as an important component of Omniture's engineering and product teams. Manager, Business Analytics Network Solutions 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Manager, Business Analytics Network Solutions 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Senior Business Analyst Verisign 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Senior Business Analyst Verisign 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Senior Business Analyst ImageCafe/Network Solutions/Verisign 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Senior Business Analyst ImageCafe/Network Solutions/Verisign 1999  –  2002  (3 years) Responsible business intelligence and reporting for the Value Added Services division of the largest domain registrar in the world at the height of the Dot-Com boom. Created an analytic infrastructure which provided actionable intelligence and accurate forecasting of sales, revenue, marketing ROI, and customer behavior across the enterprise. primary champion of advanced web analytic tools for reporting including My Computer (which would become Omniture, my future employer). Sales Manager ImageCafe 1999  –  2000  (1 year) Responsible for recruiting and strategic partners and building alliances for a small template web development start-up in Maryland which would soon be acquired by Network Solutions. Worked with our development team to craft an offer that was compelling to potential partners and still profitable for the company. My most impactfull accomplishment was the development of a channel reporting infrastructure that would lead to my being named Senior Business Analyst for the entire Value Added Services division of Network Solutions. Sales Manager ImageCafe 1999  –  2000  (1 year) Responsible for recruiting and strategic partners and building alliances for a small template web development start-up in Maryland which would soon be acquired by Network Solutions. Worked with our development team to craft an offer that was compelling to potential partners and still profitable for the company. My most impactfull accomplishment was the development of a channel reporting infrastructure that would lead to my being named Senior Business Analyst for the entire Value Added Services division of Network Solutions. Business Development (Co-founder) Cubus Corporation 1998  –  1999  (1 year) Recruited enterprise beta clients for our online CAD collaboration platform and created documentation for our products. Business Development (Co-founder) Cubus Corporation 1998  –  1999  (1 year) Recruited enterprise beta clients for our online CAD collaboration platform and created documentation for our products. Production Manager Skunk New Media 1996  –  1998  (2 years) Lead Developer of the product responsible for the bulk of Skunk New Media's revenue - a CD-Rom project for the National Science Foundation called 'SETQuest'. Production Manager Skunk New Media 1996  –  1998  (2 years) Lead Developer of the product responsible for the bulk of Skunk New Media's revenue - a CD-Rom project for the National Science Foundation called 'SETQuest'. Business Development Skunk Technologies 1996  –  1998  (2 years) Recruited enterprise beta clients for our JAVA platform and products. Successfully recruited Internet Service Providers willing to evangelize our technology. Also served as product manager for Skunk Technology's premier product, Entao Visual Chat. Business Development Skunk Technologies 1996  –  1998  (2 years) Recruited enterprise beta clients for our JAVA platform and products. Successfully recruited Internet Service Providers willing to evangelize our technology. Also served as product manager for Skunk Technology's premier product, Entao Visual Chat. Corporate Sales Personal Support Computers 1994  –  1996  (2 years) Senior Sales representative at what was at the time the world's largest Apple Authorized retail store. Our location on the edge of Beverly Hills made us the go-to retailer for many Hollywood studios and celebrities. Clients included Disney, MGM, and Warner Music. Corporate Sales Personal Support Computers 1994  –  1996  (2 years) Senior Sales representative at what was at the time the world's largest Apple Authorized retail store. Our location on the edge of Beverly Hills made us the go-to retailer for many Hollywood studios and celebrities. Clients included Disney, MGM, and Warner Music. Skills Analytics Web Analytics Omniture Strategic Partnerships E-commerce Digital Strategy Start-ups Enterprise Software Consulting Digital Marketing Business Development SaaS Management SEO Web Development Strategy Leadership Mobile Devices CRM SEM Product Management Business Intelligence Integration Salesforce.com PPC Data Warehousing PHP MySQL Vertica Adobe Analytics Political Strategy Public Speaking See 17+     See less Skills  Analytics Web Analytics Omniture Strategic Partnerships E-commerce Digital Strategy Start-ups Enterprise Software Consulting Digital Marketing Business Development SaaS Management SEO Web Development Strategy Leadership Mobile Devices CRM SEM Product Management Business Intelligence Integration Salesforce.com PPC Data Warehousing PHP MySQL Vertica Adobe Analytics Political Strategy Public Speaking See 17+     See less Analytics Web Analytics Omniture Strategic Partnerships E-commerce Digital Strategy Start-ups Enterprise Software Consulting Digital Marketing Business Development SaaS Management SEO Web Development Strategy Leadership Mobile Devices CRM SEM Product Management Business Intelligence Integration Salesforce.com PPC Data Warehousing PHP MySQL Vertica Adobe Analytics Political Strategy Public Speaking See 17+     See less Analytics Web Analytics Omniture Strategic Partnerships E-commerce Digital Strategy Start-ups Enterprise Software Consulting Digital Marketing Business Development SaaS Management SEO Web Development Strategy Leadership Mobile Devices CRM SEM Product Management Business Intelligence Integration Salesforce.com PPC Data Warehousing PHP MySQL Vertica Adobe Analytics Political Strategy Public Speaking See 17+     See less ", "Summary Analytics leader with 20 years of experience delivering business solutions. Effective team builder and mentor. Possesses outstanding problem solving, communication, and decision making skills. Capable and bold leader in a complex and ambiguous environment. Summary Analytics leader with 20 years of experience delivering business solutions. Effective team builder and mentor. Possesses outstanding problem solving, communication, and decision making skills. Capable and bold leader in a complex and ambiguous environment. Analytics leader with 20 years of experience delivering business solutions. Effective team builder and mentor. Possesses outstanding problem solving, communication, and decision making skills. Capable and bold leader in a complex and ambiguous environment. Analytics leader with 20 years of experience delivering business solutions. Effective team builder and mentor. Possesses outstanding problem solving, communication, and decision making skills. Capable and bold leader in a complex and ambiguous environment. Experience Senior Manager, Digital Analytics Starbucks May 2013  – Present (2 years 4 months) Greater Seattle Area Develop strategic and operational plans for the work group, manage execution, and measure results. Empirically identify/validate business opportunities, establish business telemetry to monitor and measure operational performance. Partner with business owners in the digital space to provide decision support through the application of statistical methods. Lead the design and execution of analytic studies including product assortment optimization, customer segmentation/insights, and promotion modeling. \n \nDevelop business intelligence capabilities as product owner employing an agile scrum software development methodology. Modernize our analytical environment, eliminate redundant processes, scale using offshore resources, and automate foundational reporting. Change the focus of the Digital Analytics organization away from data management and centralized reporting to insight generation and business analysis. Senior Manager, CPG & Food Service Market Analytics Starbucks November 2011  –  May 2013  (1 year 7 months) Greater Seattle Area Drove consolidated reporting and market analytics across the Starbucks Channel Development organization (CPG, Food Service, and Licensed Stores). Created standards for measuring and reporting business results that enabled best in class decision making. Served as the liaison and contract owner with multiple third party data sources. Led the ongoing training of syndicated data power users across the enterprise. Delivered reporting assets based on syndicated data (Symphony IRI, AC Nielsen, NPD, SPINS) to the enterprise using a co-sourced solution delivery model. Manager, Application Development Starbucks August 2005  –  November 2011  (6 years 4 months) Greater Seattle Area Accountable for leading the Business Engagement and Enterprise Data Warehouse teams during an era of change. Established partnerships with business leaders to achieve quantifiable benefits through fact based decision making. Delivered analytic capabilities with a focus on collaboration, iterative development, and alignment with corporate business strategies. \n \nProvide direct engagement with business resources to deliver solutions. Understand and refine business requirements and priority. Deliver capabilities. Prototype in collaboration with business customers. Drive release management. Seek executive management support. Establish business measurements. Ensure alignment with corporate business strategies. \n \nFoster the transition along the business intelligence software development life cycle. Transition project work to software development. Support user adoption activities. Measure identified returns on investment. Was awarded Oracle Data Warehouse Architect of the Year in 2009. Principal consultant Oracle Corporation February 1999  –  August 2005  (6 years 7 months) Executed an array of business intelligence, custom software engineering, system architecture, and database design functions at numerous client sites. Implemented a data warehouse design for an aerospace transonic wind tunnel. The intelligence application was used to improve flight performance of airplane designs. Created a highly available database environment to support the primary sales channel for a large e-commerce company. Designed and built a VLDB data warehouse for a large e-commerce company. Migrated a data warehouse to support forward deploying spare part inventory on consignment and provide the means to use statistical models to predict reorder points thus ensuring contract compliance. Was awarded West Region Consultant of the Year award. Senior consultant Andersen Consulting February 1994  –  January 1999  (5 years) Led a team of custom software engineers in a shared service solution center environment. Manage and deliver software assets and perform software configuration management. Maintain Oracle databases and shared application objects for a utility vertical. Senior Manager, Digital Analytics Starbucks May 2013  – Present (2 years 4 months) Greater Seattle Area Develop strategic and operational plans for the work group, manage execution, and measure results. Empirically identify/validate business opportunities, establish business telemetry to monitor and measure operational performance. Partner with business owners in the digital space to provide decision support through the application of statistical methods. Lead the design and execution of analytic studies including product assortment optimization, customer segmentation/insights, and promotion modeling. \n \nDevelop business intelligence capabilities as product owner employing an agile scrum software development methodology. Modernize our analytical environment, eliminate redundant processes, scale using offshore resources, and automate foundational reporting. Change the focus of the Digital Analytics organization away from data management and centralized reporting to insight generation and business analysis. Senior Manager, Digital Analytics Starbucks May 2013  – Present (2 years 4 months) Greater Seattle Area Develop strategic and operational plans for the work group, manage execution, and measure results. Empirically identify/validate business opportunities, establish business telemetry to monitor and measure operational performance. Partner with business owners in the digital space to provide decision support through the application of statistical methods. Lead the design and execution of analytic studies including product assortment optimization, customer segmentation/insights, and promotion modeling. \n \nDevelop business intelligence capabilities as product owner employing an agile scrum software development methodology. Modernize our analytical environment, eliminate redundant processes, scale using offshore resources, and automate foundational reporting. Change the focus of the Digital Analytics organization away from data management and centralized reporting to insight generation and business analysis. Senior Manager, CPG & Food Service Market Analytics Starbucks November 2011  –  May 2013  (1 year 7 months) Greater Seattle Area Drove consolidated reporting and market analytics across the Starbucks Channel Development organization (CPG, Food Service, and Licensed Stores). Created standards for measuring and reporting business results that enabled best in class decision making. Served as the liaison and contract owner with multiple third party data sources. Led the ongoing training of syndicated data power users across the enterprise. Delivered reporting assets based on syndicated data (Symphony IRI, AC Nielsen, NPD, SPINS) to the enterprise using a co-sourced solution delivery model. Senior Manager, CPG & Food Service Market Analytics Starbucks November 2011  –  May 2013  (1 year 7 months) Greater Seattle Area Drove consolidated reporting and market analytics across the Starbucks Channel Development organization (CPG, Food Service, and Licensed Stores). Created standards for measuring and reporting business results that enabled best in class decision making. Served as the liaison and contract owner with multiple third party data sources. Led the ongoing training of syndicated data power users across the enterprise. Delivered reporting assets based on syndicated data (Symphony IRI, AC Nielsen, NPD, SPINS) to the enterprise using a co-sourced solution delivery model. Manager, Application Development Starbucks August 2005  –  November 2011  (6 years 4 months) Greater Seattle Area Accountable for leading the Business Engagement and Enterprise Data Warehouse teams during an era of change. Established partnerships with business leaders to achieve quantifiable benefits through fact based decision making. Delivered analytic capabilities with a focus on collaboration, iterative development, and alignment with corporate business strategies. \n \nProvide direct engagement with business resources to deliver solutions. Understand and refine business requirements and priority. Deliver capabilities. Prototype in collaboration with business customers. Drive release management. Seek executive management support. Establish business measurements. Ensure alignment with corporate business strategies. \n \nFoster the transition along the business intelligence software development life cycle. Transition project work to software development. Support user adoption activities. Measure identified returns on investment. Was awarded Oracle Data Warehouse Architect of the Year in 2009. Manager, Application Development Starbucks August 2005  –  November 2011  (6 years 4 months) Greater Seattle Area Accountable for leading the Business Engagement and Enterprise Data Warehouse teams during an era of change. Established partnerships with business leaders to achieve quantifiable benefits through fact based decision making. Delivered analytic capabilities with a focus on collaboration, iterative development, and alignment with corporate business strategies. \n \nProvide direct engagement with business resources to deliver solutions. Understand and refine business requirements and priority. Deliver capabilities. Prototype in collaboration with business customers. Drive release management. Seek executive management support. Establish business measurements. Ensure alignment with corporate business strategies. \n \nFoster the transition along the business intelligence software development life cycle. Transition project work to software development. Support user adoption activities. Measure identified returns on investment. Was awarded Oracle Data Warehouse Architect of the Year in 2009. Principal consultant Oracle Corporation February 1999  –  August 2005  (6 years 7 months) Executed an array of business intelligence, custom software engineering, system architecture, and database design functions at numerous client sites. Implemented a data warehouse design for an aerospace transonic wind tunnel. The intelligence application was used to improve flight performance of airplane designs. Created a highly available database environment to support the primary sales channel for a large e-commerce company. Designed and built a VLDB data warehouse for a large e-commerce company. Migrated a data warehouse to support forward deploying spare part inventory on consignment and provide the means to use statistical models to predict reorder points thus ensuring contract compliance. Was awarded West Region Consultant of the Year award. Principal consultant Oracle Corporation February 1999  –  August 2005  (6 years 7 months) Executed an array of business intelligence, custom software engineering, system architecture, and database design functions at numerous client sites. Implemented a data warehouse design for an aerospace transonic wind tunnel. The intelligence application was used to improve flight performance of airplane designs. Created a highly available database environment to support the primary sales channel for a large e-commerce company. Designed and built a VLDB data warehouse for a large e-commerce company. Migrated a data warehouse to support forward deploying spare part inventory on consignment and provide the means to use statistical models to predict reorder points thus ensuring contract compliance. Was awarded West Region Consultant of the Year award. Senior consultant Andersen Consulting February 1994  –  January 1999  (5 years) Led a team of custom software engineers in a shared service solution center environment. Manage and deliver software assets and perform software configuration management. Maintain Oracle databases and shared application objects for a utility vertical. Senior consultant Andersen Consulting February 1994  –  January 1999  (5 years) Led a team of custom software engineers in a shared service solution center environment. Manage and deliver software assets and perform software configuration management. Maintain Oracle databases and shared application objects for a utility vertical. Skills Business Intelligence Analytics Business Analysis Oracle E-Business Suite Reporting & Analysis IRI Syndicated Data Analysis SQL OBIEE PL/SQL SharePoint Excel Technology... Microstrategy Offshoring People Management Management Market Analysis PowerPivot Team Leadership Tableau GIS ESRI Oracle RAC Exadata Database Design Database Administration Data Warehousing Data Warehouse... Data Warehouse... Data Integration ETL Data Modeling Pivot Tables Microsoft Excel Master Data Management Software Project... Data Analysis SDLC Oracle Applications Enterprise Software Databases Leadership Software Development Project Management Business Requirements Requirements Gathering Business Objects Visio Performance Tuning See 35+     See less Skills  Business Intelligence Analytics Business Analysis Oracle E-Business Suite Reporting & Analysis IRI Syndicated Data Analysis SQL OBIEE PL/SQL SharePoint Excel Technology... Microstrategy Offshoring People Management Management Market Analysis PowerPivot Team Leadership Tableau GIS ESRI Oracle RAC Exadata Database Design Database Administration Data Warehousing Data Warehouse... Data Warehouse... Data Integration ETL Data Modeling Pivot Tables Microsoft Excel Master Data Management Software Project... Data Analysis SDLC Oracle Applications Enterprise Software Databases Leadership Software Development Project Management Business Requirements Requirements Gathering Business Objects Visio Performance Tuning See 35+     See less Business Intelligence Analytics Business Analysis Oracle E-Business Suite Reporting & Analysis IRI Syndicated Data Analysis SQL OBIEE PL/SQL SharePoint Excel Technology... Microstrategy Offshoring People Management Management Market Analysis PowerPivot Team Leadership Tableau GIS ESRI Oracle RAC Exadata Database Design Database Administration Data Warehousing Data Warehouse... Data Warehouse... Data Integration ETL Data Modeling Pivot Tables Microsoft Excel Master Data Management Software Project... Data Analysis SDLC Oracle Applications Enterprise Software Databases Leadership Software Development Project Management Business Requirements Requirements Gathering Business Objects Visio Performance Tuning See 35+     See less Business Intelligence Analytics Business Analysis Oracle E-Business Suite Reporting & Analysis IRI Syndicated Data Analysis SQL OBIEE PL/SQL SharePoint Excel Technology... Microstrategy Offshoring People Management Management Market Analysis PowerPivot Team Leadership Tableau GIS ESRI Oracle RAC Exadata Database Design Database Administration Data Warehousing Data Warehouse... Data Warehouse... Data Integration ETL Data Modeling Pivot Tables Microsoft Excel Master Data Management Software Project... Data Analysis SDLC Oracle Applications Enterprise Software Databases Leadership Software Development Project Management Business Requirements Requirements Gathering Business Objects Visio Performance Tuning See 35+     See less Honors & Awards Data Warehouse Architect of the Year Oracle Corporation October 2009 West Region Consultant of the Year Oracle Corporation July 2000 Data Warehouse Architect of the Year Oracle Corporation October 2009 Data Warehouse Architect of the Year Oracle Corporation October 2009 Data Warehouse Architect of the Year Oracle Corporation October 2009 West Region Consultant of the Year Oracle Corporation July 2000 West Region Consultant of the Year Oracle Corporation July 2000 West Region Consultant of the Year Oracle Corporation July 2000 ", "Skills DevOps Scrum Agile Methodologies Team Leadership Servant Leadership Hiring Team Building Apache PHP Object Oriented Design OOP Perforce jQuery LAMP Linux Web Development Design Patterns MySQL Software Engineering SOA C# Zend Framework SOAP REST Agile Project Management Drupal Web Services Databases Git JIRA Zend Studio Memcached Agile Certified Scrum Master... Joomla vBulletin Software Development Social Networking Windows 7 Unit Testing Object Oriented Modeling Scalability SQL JSON Certified Product Owner... Management Leadership See 32+     See less Skills  DevOps Scrum Agile Methodologies Team Leadership Servant Leadership Hiring Team Building Apache PHP Object Oriented Design OOP Perforce jQuery LAMP Linux Web Development Design Patterns MySQL Software Engineering SOA C# Zend Framework SOAP REST Agile Project Management Drupal Web Services Databases Git JIRA Zend Studio Memcached Agile Certified Scrum Master... Joomla vBulletin Software Development Social Networking Windows 7 Unit Testing Object Oriented Modeling Scalability SQL JSON Certified Product Owner... Management Leadership See 32+     See less DevOps Scrum Agile Methodologies Team Leadership Servant Leadership Hiring Team Building Apache PHP Object Oriented Design OOP Perforce jQuery LAMP Linux Web Development Design Patterns MySQL Software Engineering SOA C# Zend Framework SOAP REST Agile Project Management Drupal Web Services Databases Git JIRA Zend Studio Memcached Agile Certified Scrum Master... Joomla vBulletin Software Development Social Networking Windows 7 Unit Testing Object Oriented Modeling Scalability SQL JSON Certified Product Owner... Management Leadership See 32+     See less DevOps Scrum Agile Methodologies Team Leadership Servant Leadership Hiring Team Building Apache PHP Object Oriented Design OOP Perforce jQuery LAMP Linux Web Development Design Patterns MySQL Software Engineering SOA C# Zend Framework SOAP REST Agile Project Management Drupal Web Services Databases Git JIRA Zend Studio Memcached Agile Certified Scrum Master... Joomla vBulletin Software Development Social Networking Windows 7 Unit Testing Object Oriented Modeling Scalability SQL JSON Certified Product Owner... Management Leadership See 32+     See less ", "Summary Digital Analyst with extensive experience providing in-depth analysis and actionable insights in Paid, Owned, Earned, and Social media for clients in Healthcare, CPG, Auto, Travel, and Wine&Spirits. \n \nExpertise: Media Analysis (Offline + Online), Web Analytics, Measurement and Reporting, Digital Media Analysis, Social Media Measurement and Analytics, Social Media Listening, Issues Monitoring, Influencer Analysis, Marketing Measurement, Mobile and Tablet Apps Analytics, Email Campaign Analysis, SEO and SEM, Website Tagging and Tracking, Creative Analysis, CRM \n \nTechnical Skills: \nAd-serving: DART/DoubleClick, ATLAS Solutions \nWeb Analytics: Google Analytics, Omniture Site Catalyst, IBM CoreMetrics \nSocial Listening: Radian6, BrandWatch, Sysomos \nSocial: Facebook Insights, TweetReach, Twitter, YouTube Analytics, LinkedIn \nBrand Studies: Insight Express, ComScore, Nielsen OBE Vizu \nBusiness Intelligence: Tableau \nTV: Nielsen \nCRM: Marketo Summary Digital Analyst with extensive experience providing in-depth analysis and actionable insights in Paid, Owned, Earned, and Social media for clients in Healthcare, CPG, Auto, Travel, and Wine&Spirits. \n \nExpertise: Media Analysis (Offline + Online), Web Analytics, Measurement and Reporting, Digital Media Analysis, Social Media Measurement and Analytics, Social Media Listening, Issues Monitoring, Influencer Analysis, Marketing Measurement, Mobile and Tablet Apps Analytics, Email Campaign Analysis, SEO and SEM, Website Tagging and Tracking, Creative Analysis, CRM \n \nTechnical Skills: \nAd-serving: DART/DoubleClick, ATLAS Solutions \nWeb Analytics: Google Analytics, Omniture Site Catalyst, IBM CoreMetrics \nSocial Listening: Radian6, BrandWatch, Sysomos \nSocial: Facebook Insights, TweetReach, Twitter, YouTube Analytics, LinkedIn \nBrand Studies: Insight Express, ComScore, Nielsen OBE Vizu \nBusiness Intelligence: Tableau \nTV: Nielsen \nCRM: Marketo Digital Analyst with extensive experience providing in-depth analysis and actionable insights in Paid, Owned, Earned, and Social media for clients in Healthcare, CPG, Auto, Travel, and Wine&Spirits. \n \nExpertise: Media Analysis (Offline + Online), Web Analytics, Measurement and Reporting, Digital Media Analysis, Social Media Measurement and Analytics, Social Media Listening, Issues Monitoring, Influencer Analysis, Marketing Measurement, Mobile and Tablet Apps Analytics, Email Campaign Analysis, SEO and SEM, Website Tagging and Tracking, Creative Analysis, CRM \n \nTechnical Skills: \nAd-serving: DART/DoubleClick, ATLAS Solutions \nWeb Analytics: Google Analytics, Omniture Site Catalyst, IBM CoreMetrics \nSocial Listening: Radian6, BrandWatch, Sysomos \nSocial: Facebook Insights, TweetReach, Twitter, YouTube Analytics, LinkedIn \nBrand Studies: Insight Express, ComScore, Nielsen OBE Vizu \nBusiness Intelligence: Tableau \nTV: Nielsen \nCRM: Marketo Digital Analyst with extensive experience providing in-depth analysis and actionable insights in Paid, Owned, Earned, and Social media for clients in Healthcare, CPG, Auto, Travel, and Wine&Spirits. \n \nExpertise: Media Analysis (Offline + Online), Web Analytics, Measurement and Reporting, Digital Media Analysis, Social Media Measurement and Analytics, Social Media Listening, Issues Monitoring, Influencer Analysis, Marketing Measurement, Mobile and Tablet Apps Analytics, Email Campaign Analysis, SEO and SEM, Website Tagging and Tracking, Creative Analysis, CRM \n \nTechnical Skills: \nAd-serving: DART/DoubleClick, ATLAS Solutions \nWeb Analytics: Google Analytics, Omniture Site Catalyst, IBM CoreMetrics \nSocial Listening: Radian6, BrandWatch, Sysomos \nSocial: Facebook Insights, TweetReach, Twitter, YouTube Analytics, LinkedIn \nBrand Studies: Insight Express, ComScore, Nielsen OBE Vizu \nBusiness Intelligence: Tableau \nTV: Nielsen \nCRM: Marketo Experience Director, Analytics Dentsu Aegis Network May 2015  – Present (4 months) New York Lead analytics and reporting for Microsoft account Associate Director, Strategy&Analytics Digitas August 2013  –  April 2015  (1 year 9 months) Senior Manager, Digital Analytics WCG January 2012  –  August 2013  (1 year 8 months) New York In-depth social media listening, issues monitoring, influencer identification and analysis, and measurement for healthcare clients \nWeb Analytics Lead - measurement, reporting and analytics \n \nTools used: Radian6, Sysomos, Crimson Hexagon, Google Analytics, Sprinklr, Omniture, Compete.com, comScore.com Senior Manager, Digital Analytics Story Worldwide June 2010  –  February 2012  (1 year 9 months) Senior Manager for the Marketing Intelligence group focused on delivering actionable insights for clients on their digital marketing campaigns. This involves defining reporting specifications and assessing tracking requirements, development of measurement plans, managing all data analysis and web analytics for clients' digital products (websites, social media campaigns, email, online campaigns, mobile and tablet apps, and mobile sites), and producing and presenting reports for clients and internal teams. Strategic Planner MRM Worldwide May 2007  –  January 2010  (2 years 9 months) Senior Strategic Planner on the Verizon Telecom account \nDedicated strategic resource for Verizon Telecom in support of its customer acquisition and retention marketing campaigns. This involved working with account teams through all stages of campaign planning. Responsibilities included strategy and planning, researching and developing consumer insights, segmenting target audiences and creating compelling messaging strategies, and analyzing campaign results. \n \nStrategic Planner on the U.S. Army account \nDedicated strategic resource for the United States Army in support of its recruitment and brand objectives. This involved helping in digital strategy and planning, funnel and CRM strategy, and marketing analysis. Responsibilities included researching and developing consumer insights, producing POV reports, performing marketing research, creating customized engagement plans, and interfacing regularly with clients. Marketing and Sales Manager Healthcare Investment Network - www.onemedplace.com February 2006  –  March 2007  (1 year 2 months) Director, Analytics Dentsu Aegis Network May 2015  – Present (4 months) New York Lead analytics and reporting for Microsoft account Director, Analytics Dentsu Aegis Network May 2015  – Present (4 months) New York Lead analytics and reporting for Microsoft account Associate Director, Strategy&Analytics Digitas August 2013  –  April 2015  (1 year 9 months) Associate Director, Strategy&Analytics Digitas August 2013  –  April 2015  (1 year 9 months) Senior Manager, Digital Analytics WCG January 2012  –  August 2013  (1 year 8 months) New York In-depth social media listening, issues monitoring, influencer identification and analysis, and measurement for healthcare clients \nWeb Analytics Lead - measurement, reporting and analytics \n \nTools used: Radian6, Sysomos, Crimson Hexagon, Google Analytics, Sprinklr, Omniture, Compete.com, comScore.com Senior Manager, Digital Analytics WCG January 2012  –  August 2013  (1 year 8 months) New York In-depth social media listening, issues monitoring, influencer identification and analysis, and measurement for healthcare clients \nWeb Analytics Lead - measurement, reporting and analytics \n \nTools used: Radian6, Sysomos, Crimson Hexagon, Google Analytics, Sprinklr, Omniture, Compete.com, comScore.com Senior Manager, Digital Analytics Story Worldwide June 2010  –  February 2012  (1 year 9 months) Senior Manager for the Marketing Intelligence group focused on delivering actionable insights for clients on their digital marketing campaigns. This involves defining reporting specifications and assessing tracking requirements, development of measurement plans, managing all data analysis and web analytics for clients' digital products (websites, social media campaigns, email, online campaigns, mobile and tablet apps, and mobile sites), and producing and presenting reports for clients and internal teams. Senior Manager, Digital Analytics Story Worldwide June 2010  –  February 2012  (1 year 9 months) Senior Manager for the Marketing Intelligence group focused on delivering actionable insights for clients on their digital marketing campaigns. This involves defining reporting specifications and assessing tracking requirements, development of measurement plans, managing all data analysis and web analytics for clients' digital products (websites, social media campaigns, email, online campaigns, mobile and tablet apps, and mobile sites), and producing and presenting reports for clients and internal teams. Strategic Planner MRM Worldwide May 2007  –  January 2010  (2 years 9 months) Senior Strategic Planner on the Verizon Telecom account \nDedicated strategic resource for Verizon Telecom in support of its customer acquisition and retention marketing campaigns. This involved working with account teams through all stages of campaign planning. Responsibilities included strategy and planning, researching and developing consumer insights, segmenting target audiences and creating compelling messaging strategies, and analyzing campaign results. \n \nStrategic Planner on the U.S. Army account \nDedicated strategic resource for the United States Army in support of its recruitment and brand objectives. This involved helping in digital strategy and planning, funnel and CRM strategy, and marketing analysis. Responsibilities included researching and developing consumer insights, producing POV reports, performing marketing research, creating customized engagement plans, and interfacing regularly with clients. Strategic Planner MRM Worldwide May 2007  –  January 2010  (2 years 9 months) Senior Strategic Planner on the Verizon Telecom account \nDedicated strategic resource for Verizon Telecom in support of its customer acquisition and retention marketing campaigns. This involved working with account teams through all stages of campaign planning. Responsibilities included strategy and planning, researching and developing consumer insights, segmenting target audiences and creating compelling messaging strategies, and analyzing campaign results. \n \nStrategic Planner on the U.S. Army account \nDedicated strategic resource for the United States Army in support of its recruitment and brand objectives. This involved helping in digital strategy and planning, funnel and CRM strategy, and marketing analysis. Responsibilities included researching and developing consumer insights, producing POV reports, performing marketing research, creating customized engagement plans, and interfacing regularly with clients. Marketing and Sales Manager Healthcare Investment Network - www.onemedplace.com February 2006  –  March 2007  (1 year 2 months) Marketing and Sales Manager Healthcare Investment Network - www.onemedplace.com February 2006  –  March 2007  (1 year 2 months) Skills Omniture Site Catalyst Google Analytics Unica Facebook Insights Dream Mail Excel comScore Forrester Online Marketing Web Analytics Marketing Analytics Marketing ROI Digital Marketing Social Media Marketing Facebook Online Advertising Omniture Microsoft Excel Analytics ROMI Digital Strategy Digital Media Customer Insight See 8+     See less Skills  Omniture Site Catalyst Google Analytics Unica Facebook Insights Dream Mail Excel comScore Forrester Online Marketing Web Analytics Marketing Analytics Marketing ROI Digital Marketing Social Media Marketing Facebook Online Advertising Omniture Microsoft Excel Analytics ROMI Digital Strategy Digital Media Customer Insight See 8+     See less Omniture Site Catalyst Google Analytics Unica Facebook Insights Dream Mail Excel comScore Forrester Online Marketing Web Analytics Marketing Analytics Marketing ROI Digital Marketing Social Media Marketing Facebook Online Advertising Omniture Microsoft Excel Analytics ROMI Digital Strategy Digital Media Customer Insight See 8+     See less Omniture Site Catalyst Google Analytics Unica Facebook Insights Dream Mail Excel comScore Forrester Online Marketing Web Analytics Marketing Analytics Marketing ROI Digital Marketing Social Media Marketing Facebook Online Advertising Omniture Microsoft Excel Analytics ROMI Digital Strategy Digital Media Customer Insight See 8+     See less Honors & Awards ", "Skills Web Analytics Social Media Online Marketing Music Martial Arts Digital Media Marketing Optimization Digital Marketing Interactive Marketing Marketing Online Advertising Omniture Sales Analytics Public Speaking Training Leadership SEM Digital Strategy Social Networking PPC Marketing Strategy Direct Marketing Integrated Marketing Advertising Product Development CRM E-commerce Business Intelligence Creative Direction Google Analytics Competitive Analysis Mobile Marketing Email Marketing Strategic Partnerships SEO Product Marketing Lead Generation See 23+     See less Skills  Web Analytics Social Media Online Marketing Music Martial Arts Digital Media Marketing Optimization Digital Marketing Interactive Marketing Marketing Online Advertising Omniture Sales Analytics Public Speaking Training Leadership SEM Digital Strategy Social Networking PPC Marketing Strategy Direct Marketing Integrated Marketing Advertising Product Development CRM E-commerce Business Intelligence Creative Direction Google Analytics Competitive Analysis Mobile Marketing Email Marketing Strategic Partnerships SEO Product Marketing Lead Generation See 23+     See less Web Analytics Social Media Online Marketing Music Martial Arts Digital Media Marketing Optimization Digital Marketing Interactive Marketing Marketing Online Advertising Omniture Sales Analytics Public Speaking Training Leadership SEM Digital Strategy Social Networking PPC Marketing Strategy Direct Marketing Integrated Marketing Advertising Product Development CRM E-commerce Business Intelligence Creative Direction Google Analytics Competitive Analysis Mobile Marketing Email Marketing Strategic Partnerships SEO Product Marketing Lead Generation See 23+     See less Web Analytics Social Media Online Marketing Music Martial Arts Digital Media Marketing Optimization Digital Marketing Interactive Marketing Marketing Online Advertising Omniture Sales Analytics Public Speaking Training Leadership SEM Digital Strategy Social Networking PPC Marketing Strategy Direct Marketing Integrated Marketing Advertising Product Development CRM E-commerce Business Intelligence Creative Direction Google Analytics Competitive Analysis Mobile Marketing Email Marketing Strategic Partnerships SEO Product Marketing Lead Generation See 23+     See less Honors & Awards ", "Summary Results-focused digital analytics manager with experience measuring, testing and optimizing websites in e-commerce, media, and content platforms.  \n \n \nExperienced analyst with strong technical and analytical skills looking for a challenging opportunity leveraging my experience in online marketing, site optimization and product management. Extensive experience in reporting tools such as Google Analytics, Site Catalyst, Visual Science, and Business Objects, as well as directly in database environments using MS SQL, PostgreSQL, and MySQL. Able to apply analytical findings to create strategic recommendations for business improvement. Adept at transforming data into insight and presenting recommendations to various levels of the organization. \nAnalyzed user behavior in large data sets comprised of clickstream and page view data from websites with monthly unique visitation of over 30 million users. Solid experience in business planning, team-based account management, forecasting and sales analysis for retail and wholesale sales organizations. Experienced in measuring online success in e-commerce, media and news organizations. Summary Results-focused digital analytics manager with experience measuring, testing and optimizing websites in e-commerce, media, and content platforms.  \n \n \nExperienced analyst with strong technical and analytical skills looking for a challenging opportunity leveraging my experience in online marketing, site optimization and product management. Extensive experience in reporting tools such as Google Analytics, Site Catalyst, Visual Science, and Business Objects, as well as directly in database environments using MS SQL, PostgreSQL, and MySQL. Able to apply analytical findings to create strategic recommendations for business improvement. Adept at transforming data into insight and presenting recommendations to various levels of the organization. \nAnalyzed user behavior in large data sets comprised of clickstream and page view data from websites with monthly unique visitation of over 30 million users. Solid experience in business planning, team-based account management, forecasting and sales analysis for retail and wholesale sales organizations. Experienced in measuring online success in e-commerce, media and news organizations. Results-focused digital analytics manager with experience measuring, testing and optimizing websites in e-commerce, media, and content platforms.  \n \n \nExperienced analyst with strong technical and analytical skills looking for a challenging opportunity leveraging my experience in online marketing, site optimization and product management. Extensive experience in reporting tools such as Google Analytics, Site Catalyst, Visual Science, and Business Objects, as well as directly in database environments using MS SQL, PostgreSQL, and MySQL. Able to apply analytical findings to create strategic recommendations for business improvement. Adept at transforming data into insight and presenting recommendations to various levels of the organization. \nAnalyzed user behavior in large data sets comprised of clickstream and page view data from websites with monthly unique visitation of over 30 million users. Solid experience in business planning, team-based account management, forecasting and sales analysis for retail and wholesale sales organizations. Experienced in measuring online success in e-commerce, media and news organizations. Results-focused digital analytics manager with experience measuring, testing and optimizing websites in e-commerce, media, and content platforms.  \n \n \nExperienced analyst with strong technical and analytical skills looking for a challenging opportunity leveraging my experience in online marketing, site optimization and product management. Extensive experience in reporting tools such as Google Analytics, Site Catalyst, Visual Science, and Business Objects, as well as directly in database environments using MS SQL, PostgreSQL, and MySQL. Able to apply analytical findings to create strategic recommendations for business improvement. Adept at transforming data into insight and presenting recommendations to various levels of the organization. \nAnalyzed user behavior in large data sets comprised of clickstream and page view data from websites with monthly unique visitation of over 30 million users. Solid experience in business planning, team-based account management, forecasting and sales analysis for retail and wholesale sales organizations. Experienced in measuring online success in e-commerce, media and news organizations. Experience Senior Manager, Digital Analytics NPR August 2011  – Present (4 years 1 month) Greater Boston Area Delivered station focused support for website analytics and optimization. \n•\tDefined, launched and actively promote Analytics Service to 270 NPR member stations with the goal of 100% station adoption. \n•\tAgile/SCRUM product management to build custom Tag Management and Dashboard system leading a team to implement tests, and tracking improvements and product evolution.  \n•\tConsult with NPR member stations to provide support on implementation, customization, and reporting in Google Analytics. \n•\tDesign and implement A/B testing to define best practice recommendations for member stations and to drive improvement to Digital Services products.  \n•\tProvide training in Digital Strategy, Goal Setting and Measurement to various levels ranging from New Room Staff to General Managers. \n•\tCreate and deliver regular webinars on metrics, insights, best practice and training. \n•\tSynthesize data from Chartbeat, Triton Webcast Metrics and internal systems to drive internal improvements and advice to station management teams. \n•\tLaunched Tag Management, Reporting and Dashboard system to 270 member stations. Lead Analyst, Marketing Analytics Vistaprint June 2010  –  March 2011  (10 months) Web Business Analyst, Vacation Rentals TripAdvisor November 2009  –  June 2010  (8 months) Sales Analyst, Key Accounts TripAdvisor May 2008  –  November 2009  (1 year 7 months) Web Analyst Bose Corporation February 2005  –  May 2008  (3 years 4 months) Sales Information Analyst II Bose Corporation October 2003  –  February 2005  (1 year 5 months) Senior Manager, Digital Analytics NPR August 2011  – Present (4 years 1 month) Greater Boston Area Delivered station focused support for website analytics and optimization. \n•\tDefined, launched and actively promote Analytics Service to 270 NPR member stations with the goal of 100% station adoption. \n•\tAgile/SCRUM product management to build custom Tag Management and Dashboard system leading a team to implement tests, and tracking improvements and product evolution.  \n•\tConsult with NPR member stations to provide support on implementation, customization, and reporting in Google Analytics. \n•\tDesign and implement A/B testing to define best practice recommendations for member stations and to drive improvement to Digital Services products.  \n•\tProvide training in Digital Strategy, Goal Setting and Measurement to various levels ranging from New Room Staff to General Managers. \n•\tCreate and deliver regular webinars on metrics, insights, best practice and training. \n•\tSynthesize data from Chartbeat, Triton Webcast Metrics and internal systems to drive internal improvements and advice to station management teams. \n•\tLaunched Tag Management, Reporting and Dashboard system to 270 member stations. Senior Manager, Digital Analytics NPR August 2011  – Present (4 years 1 month) Greater Boston Area Delivered station focused support for website analytics and optimization. \n•\tDefined, launched and actively promote Analytics Service to 270 NPR member stations with the goal of 100% station adoption. \n•\tAgile/SCRUM product management to build custom Tag Management and Dashboard system leading a team to implement tests, and tracking improvements and product evolution.  \n•\tConsult with NPR member stations to provide support on implementation, customization, and reporting in Google Analytics. \n•\tDesign and implement A/B testing to define best practice recommendations for member stations and to drive improvement to Digital Services products.  \n•\tProvide training in Digital Strategy, Goal Setting and Measurement to various levels ranging from New Room Staff to General Managers. \n•\tCreate and deliver regular webinars on metrics, insights, best practice and training. \n•\tSynthesize data from Chartbeat, Triton Webcast Metrics and internal systems to drive internal improvements and advice to station management teams. \n•\tLaunched Tag Management, Reporting and Dashboard system to 270 member stations. Lead Analyst, Marketing Analytics Vistaprint June 2010  –  March 2011  (10 months) Lead Analyst, Marketing Analytics Vistaprint June 2010  –  March 2011  (10 months) Web Business Analyst, Vacation Rentals TripAdvisor November 2009  –  June 2010  (8 months) Web Business Analyst, Vacation Rentals TripAdvisor November 2009  –  June 2010  (8 months) Sales Analyst, Key Accounts TripAdvisor May 2008  –  November 2009  (1 year 7 months) Sales Analyst, Key Accounts TripAdvisor May 2008  –  November 2009  (1 year 7 months) Web Analyst Bose Corporation February 2005  –  May 2008  (3 years 4 months) Web Analyst Bose Corporation February 2005  –  May 2008  (3 years 4 months) Sales Information Analyst II Bose Corporation October 2003  –  February 2005  (1 year 5 months) Sales Information Analyst II Bose Corporation October 2003  –  February 2005  (1 year 5 months) Skills Google Analytics Web Analytics Omniture Analytics A/B testing SEM E-commerce Digital Strategy SEO Email Marketing Digital Marketing Web Content Management Digital Media User Experience Conversion Optimization Social Media Competitive Analysis Content Strategy Product Management Social Media Marketing Agile Project Management Web 2.0 Web Marketing Content Management Online Marketing Strategy See 11+     See less Skills  Google Analytics Web Analytics Omniture Analytics A/B testing SEM E-commerce Digital Strategy SEO Email Marketing Digital Marketing Web Content Management Digital Media User Experience Conversion Optimization Social Media Competitive Analysis Content Strategy Product Management Social Media Marketing Agile Project Management Web 2.0 Web Marketing Content Management Online Marketing Strategy See 11+     See less Google Analytics Web Analytics Omniture Analytics A/B testing SEM E-commerce Digital Strategy SEO Email Marketing Digital Marketing Web Content Management Digital Media User Experience Conversion Optimization Social Media Competitive Analysis Content Strategy Product Management Social Media Marketing Agile Project Management Web 2.0 Web Marketing Content Management Online Marketing Strategy See 11+     See less Google Analytics Web Analytics Omniture Analytics A/B testing SEM E-commerce Digital Strategy SEO Email Marketing Digital Marketing Web Content Management Digital Media User Experience Conversion Optimization Social Media Competitive Analysis Content Strategy Product Management Social Media Marketing Agile Project Management Web 2.0 Web Marketing Content Management Online Marketing Strategy See 11+     See less Education Brandeis University BA September 1992  – May 1996 Brandeis University BA September 1992  – May 1996 Brandeis University BA September 1992  – May 1996 Brandeis University BA September 1992  – May 1996 ", "Summary Fundamentally curious, with a passion for problem-solving and evangelizing how analytics is best used in overall digital strategy. Experience crunching data and providing recommendations across a variety of verticals within the BtoB, BtoC, Government and Non-Profit sectors. \n \nI've also been fortunate to gain deep knowledge across a variety of tools. That experience coupled with working with a diverse group of businesses has allowed me to come up with creative solutions for figuring out how to capture and analyze data while driving business decisions. \n \n>Digital Analytics Platform Experience< \nGoogle Analytics \nIBM Analytics (Coremetrics) \nAdobe Analytics \n \n>Tag Management Platform Experience< \nGoogle Tag Manager \nTealium \nAdobe Dynamic Tag Manager \n \n>Site Optimization Tools< \nOptimizely \nCrazyEgg \nMonetate \nMouseflow Summary Fundamentally curious, with a passion for problem-solving and evangelizing how analytics is best used in overall digital strategy. Experience crunching data and providing recommendations across a variety of verticals within the BtoB, BtoC, Government and Non-Profit sectors. \n \nI've also been fortunate to gain deep knowledge across a variety of tools. That experience coupled with working with a diverse group of businesses has allowed me to come up with creative solutions for figuring out how to capture and analyze data while driving business decisions. \n \n>Digital Analytics Platform Experience< \nGoogle Analytics \nIBM Analytics (Coremetrics) \nAdobe Analytics \n \n>Tag Management Platform Experience< \nGoogle Tag Manager \nTealium \nAdobe Dynamic Tag Manager \n \n>Site Optimization Tools< \nOptimizely \nCrazyEgg \nMonetate \nMouseflow Fundamentally curious, with a passion for problem-solving and evangelizing how analytics is best used in overall digital strategy. Experience crunching data and providing recommendations across a variety of verticals within the BtoB, BtoC, Government and Non-Profit sectors. \n \nI've also been fortunate to gain deep knowledge across a variety of tools. That experience coupled with working with a diverse group of businesses has allowed me to come up with creative solutions for figuring out how to capture and analyze data while driving business decisions. \n \n>Digital Analytics Platform Experience< \nGoogle Analytics \nIBM Analytics (Coremetrics) \nAdobe Analytics \n \n>Tag Management Platform Experience< \nGoogle Tag Manager \nTealium \nAdobe Dynamic Tag Manager \n \n>Site Optimization Tools< \nOptimizely \nCrazyEgg \nMonetate \nMouseflow Fundamentally curious, with a passion for problem-solving and evangelizing how analytics is best used in overall digital strategy. Experience crunching data and providing recommendations across a variety of verticals within the BtoB, BtoC, Government and Non-Profit sectors. \n \nI've also been fortunate to gain deep knowledge across a variety of tools. That experience coupled with working with a diverse group of businesses has allowed me to come up with creative solutions for figuring out how to capture and analyze data while driving business decisions. \n \n>Digital Analytics Platform Experience< \nGoogle Analytics \nIBM Analytics (Coremetrics) \nAdobe Analytics \n \n>Tag Management Platform Experience< \nGoogle Tag Manager \nTealium \nAdobe Dynamic Tag Manager \n \n>Site Optimization Tools< \nOptimizely \nCrazyEgg \nMonetate \nMouseflow Experience Senior Manager, Digital Analytics Strategy CrossView Inc. August 2013  – Present (2 years 1 month) Manager, Digital Analytics CrossView Inc. July 2011  –  July 2013  (2 years 1 month) • Serve as analytics 'trusted advisor' for client teams to help them identify opportunities for improvement and risks for growth through regularly published dashboards and presentations \no Areas of optimization include onsite search, SEO, SEM, merchandising, A/B testing, and user experience  \n• Design complex digital analytics solutions, both technical and strategic, aimed at providing high-value insights for a variety of eCommerce clients  \n• Deliver detailed strategic assessment documentation after thorough review of client analytics strategy to provide a complex assessment of current weaknesses and opportunities for improvement \n• Pursue sales opportunities for CrossView Strategic Services team, engaging with potential clients on Define and Design requirements, pricing models, and proposal writing Web Analyst CrossView Inc. June 2010  –  July 2011  (1 year 2 months) • Work directly with clients to define business goals, and translate these into a measurement strategy and subsequent reporting structure that outlines how clients can achieve their goals \n• Train and assist users in web analytics, with a particular emphasis on creating a data-driven decision culture  \n• Write requirements and technical documentation for new digital analytics implementations \n• Ensure all requirements of implementations are met and delivered on time by working closely with development resources through tag audits and QA of site tagging Web Metrics Analyst/Marketing Strategist, www.Army.mil L-3 Communications April 2009  –  June 2010  (1 year 3 months) •\tManagerial oversight over the Omniture implementation, development and operations of web metrics measurement, analysis capabilities for Army.mil \n•\tTranslated metrics data and analytical insights into strategies, operation goals, and actionable tasks that support improvements in mission fulfillment \n•\tInstructed members of the U.S. Army public affairs community in best practices for content generation, messaging and measurement \n•\tCreate and distribute weekly reports, monthly dashboards and ad hoc analysis on all aspects of the U.S. Army public affairs presence \n•\tRegularly brief and present analysis to senior Officers and Soldiers in the U.S. Army Public Affairs division eCommerce Web Analyst (B-to-B) Staples July 2007  –  April 2009  (1 year 10 months) •\tManaged web analytics and site search strategy for Stapleslink.com \n•\tProvided expert guidance and support to internal business partners who rely on web analytics to manage their respective business units \n•\tCreated KPI dashboards to measure specific Staples Contract business goals and provided ad hoc reporting for more complex initiatives to help key stakeholders identify business opportunities \n•\tWorked with members from cross-functional groups to identify strategic objectives for site search to drive sales, margin, customer satisfaction, and to exploit the role of site search in managing the online product assortment \n•\tManaged site search engine and web analytics tool functionality enhancements and bug fixes, defined and wrote business requirements for IT developers, and lead development projects through test cycles until product deployment eCommerce Marketing Coodinator/Analyst WGBH Educational Foundation 2003  –  2007  (4 years) •\tResponsible for integrating web analytics, SEM, and email marketing campaigns for the B-to-C website, shop.wgbh.org \n•\tCreated optimization strategies for email and web marketing that allowed WGBH to exceed their annual goals by 20% \n•\tRefined these marketing strategies by creating and analyzing monthly sales reports and web analytics data to further test strategies \n•\tUpdated site content weekly based on sales trends and customer navigation analysis \n•\tCoordinated all online and print promotions for the website User Experience Modeler Sapient (originally part of e-Lab) June 2000  –  May 2001  (1 year) •\tQualitative user experience research and brand positioning for consumer brands and website designs Senior Manager, Digital Analytics Strategy CrossView Inc. August 2013  – Present (2 years 1 month) Senior Manager, Digital Analytics Strategy CrossView Inc. August 2013  – Present (2 years 1 month) Manager, Digital Analytics CrossView Inc. July 2011  –  July 2013  (2 years 1 month) • Serve as analytics 'trusted advisor' for client teams to help them identify opportunities for improvement and risks for growth through regularly published dashboards and presentations \no Areas of optimization include onsite search, SEO, SEM, merchandising, A/B testing, and user experience  \n• Design complex digital analytics solutions, both technical and strategic, aimed at providing high-value insights for a variety of eCommerce clients  \n• Deliver detailed strategic assessment documentation after thorough review of client analytics strategy to provide a complex assessment of current weaknesses and opportunities for improvement \n• Pursue sales opportunities for CrossView Strategic Services team, engaging with potential clients on Define and Design requirements, pricing models, and proposal writing Manager, Digital Analytics CrossView Inc. July 2011  –  July 2013  (2 years 1 month) • Serve as analytics 'trusted advisor' for client teams to help them identify opportunities for improvement and risks for growth through regularly published dashboards and presentations \no Areas of optimization include onsite search, SEO, SEM, merchandising, A/B testing, and user experience  \n• Design complex digital analytics solutions, both technical and strategic, aimed at providing high-value insights for a variety of eCommerce clients  \n• Deliver detailed strategic assessment documentation after thorough review of client analytics strategy to provide a complex assessment of current weaknesses and opportunities for improvement \n• Pursue sales opportunities for CrossView Strategic Services team, engaging with potential clients on Define and Design requirements, pricing models, and proposal writing Web Analyst CrossView Inc. June 2010  –  July 2011  (1 year 2 months) • Work directly with clients to define business goals, and translate these into a measurement strategy and subsequent reporting structure that outlines how clients can achieve their goals \n• Train and assist users in web analytics, with a particular emphasis on creating a data-driven decision culture  \n• Write requirements and technical documentation for new digital analytics implementations \n• Ensure all requirements of implementations are met and delivered on time by working closely with development resources through tag audits and QA of site tagging Web Analyst CrossView Inc. June 2010  –  July 2011  (1 year 2 months) • Work directly with clients to define business goals, and translate these into a measurement strategy and subsequent reporting structure that outlines how clients can achieve their goals \n• Train and assist users in web analytics, with a particular emphasis on creating a data-driven decision culture  \n• Write requirements and technical documentation for new digital analytics implementations \n• Ensure all requirements of implementations are met and delivered on time by working closely with development resources through tag audits and QA of site tagging Web Metrics Analyst/Marketing Strategist, www.Army.mil L-3 Communications April 2009  –  June 2010  (1 year 3 months) •\tManagerial oversight over the Omniture implementation, development and operations of web metrics measurement, analysis capabilities for Army.mil \n•\tTranslated metrics data and analytical insights into strategies, operation goals, and actionable tasks that support improvements in mission fulfillment \n•\tInstructed members of the U.S. Army public affairs community in best practices for content generation, messaging and measurement \n•\tCreate and distribute weekly reports, monthly dashboards and ad hoc analysis on all aspects of the U.S. Army public affairs presence \n•\tRegularly brief and present analysis to senior Officers and Soldiers in the U.S. Army Public Affairs division Web Metrics Analyst/Marketing Strategist, www.Army.mil L-3 Communications April 2009  –  June 2010  (1 year 3 months) •\tManagerial oversight over the Omniture implementation, development and operations of web metrics measurement, analysis capabilities for Army.mil \n•\tTranslated metrics data and analytical insights into strategies, operation goals, and actionable tasks that support improvements in mission fulfillment \n•\tInstructed members of the U.S. Army public affairs community in best practices for content generation, messaging and measurement \n•\tCreate and distribute weekly reports, monthly dashboards and ad hoc analysis on all aspects of the U.S. Army public affairs presence \n•\tRegularly brief and present analysis to senior Officers and Soldiers in the U.S. Army Public Affairs division eCommerce Web Analyst (B-to-B) Staples July 2007  –  April 2009  (1 year 10 months) •\tManaged web analytics and site search strategy for Stapleslink.com \n•\tProvided expert guidance and support to internal business partners who rely on web analytics to manage their respective business units \n•\tCreated KPI dashboards to measure specific Staples Contract business goals and provided ad hoc reporting for more complex initiatives to help key stakeholders identify business opportunities \n•\tWorked with members from cross-functional groups to identify strategic objectives for site search to drive sales, margin, customer satisfaction, and to exploit the role of site search in managing the online product assortment \n•\tManaged site search engine and web analytics tool functionality enhancements and bug fixes, defined and wrote business requirements for IT developers, and lead development projects through test cycles until product deployment eCommerce Web Analyst (B-to-B) Staples July 2007  –  April 2009  (1 year 10 months) •\tManaged web analytics and site search strategy for Stapleslink.com \n•\tProvided expert guidance and support to internal business partners who rely on web analytics to manage their respective business units \n•\tCreated KPI dashboards to measure specific Staples Contract business goals and provided ad hoc reporting for more complex initiatives to help key stakeholders identify business opportunities \n•\tWorked with members from cross-functional groups to identify strategic objectives for site search to drive sales, margin, customer satisfaction, and to exploit the role of site search in managing the online product assortment \n•\tManaged site search engine and web analytics tool functionality enhancements and bug fixes, defined and wrote business requirements for IT developers, and lead development projects through test cycles until product deployment eCommerce Marketing Coodinator/Analyst WGBH Educational Foundation 2003  –  2007  (4 years) •\tResponsible for integrating web analytics, SEM, and email marketing campaigns for the B-to-C website, shop.wgbh.org \n•\tCreated optimization strategies for email and web marketing that allowed WGBH to exceed their annual goals by 20% \n•\tRefined these marketing strategies by creating and analyzing monthly sales reports and web analytics data to further test strategies \n•\tUpdated site content weekly based on sales trends and customer navigation analysis \n•\tCoordinated all online and print promotions for the website eCommerce Marketing Coodinator/Analyst WGBH Educational Foundation 2003  –  2007  (4 years) •\tResponsible for integrating web analytics, SEM, and email marketing campaigns for the B-to-C website, shop.wgbh.org \n•\tCreated optimization strategies for email and web marketing that allowed WGBH to exceed their annual goals by 20% \n•\tRefined these marketing strategies by creating and analyzing monthly sales reports and web analytics data to further test strategies \n•\tUpdated site content weekly based on sales trends and customer navigation analysis \n•\tCoordinated all online and print promotions for the website User Experience Modeler Sapient (originally part of e-Lab) June 2000  –  May 2001  (1 year) •\tQualitative user experience research and brand positioning for consumer brands and website designs User Experience Modeler Sapient (originally part of e-Lab) June 2000  –  May 2001  (1 year) •\tQualitative user experience research and brand positioning for consumer brands and website designs Skills IBM Websphere Commerce SEO Analytics SEM Web Analytics Google Analytics Web Project Management E-commerce Omniture Coremetrics Analytics Microsoft Excel Project Coordination Project Delivery analytics tagging A/B testing custom variables Segmentation Conversion Optimization digital analytics Cross-Domain Tracking KPI Dashboards Digital Strategy Team Management PowerPoint Microsoft Word Contract Negotiation Email Marketing Tags User Experience Online Marketing Marketing Strategy Management Digital Marketing Tracking Cross-functional Team... Variables Strategic Planning B2B PPC Web Marketing Strategy Interactive Marketing Multi-channel Marketing Analysis Cross-functional Team... Affiliate Marketing Project Management Google Webmaster Tools A/B Testing Multivariate Testing See 35+     See less Skills  IBM Websphere Commerce SEO Analytics SEM Web Analytics Google Analytics Web Project Management E-commerce Omniture Coremetrics Analytics Microsoft Excel Project Coordination Project Delivery analytics tagging A/B testing custom variables Segmentation Conversion Optimization digital analytics Cross-Domain Tracking KPI Dashboards Digital Strategy Team Management PowerPoint Microsoft Word Contract Negotiation Email Marketing Tags User Experience Online Marketing Marketing Strategy Management Digital Marketing Tracking Cross-functional Team... Variables Strategic Planning B2B PPC Web Marketing Strategy Interactive Marketing Multi-channel Marketing Analysis Cross-functional Team... Affiliate Marketing Project Management Google Webmaster Tools A/B Testing Multivariate Testing See 35+     See less IBM Websphere Commerce SEO Analytics SEM Web Analytics Google Analytics Web Project Management E-commerce Omniture Coremetrics Analytics Microsoft Excel Project Coordination Project Delivery analytics tagging A/B testing custom variables Segmentation Conversion Optimization digital analytics Cross-Domain Tracking KPI Dashboards Digital Strategy Team Management PowerPoint Microsoft Word Contract Negotiation Email Marketing Tags User Experience Online Marketing Marketing Strategy Management Digital Marketing Tracking Cross-functional Team... Variables Strategic Planning B2B PPC Web Marketing Strategy Interactive Marketing Multi-channel Marketing Analysis Cross-functional Team... Affiliate Marketing Project Management Google Webmaster Tools A/B Testing Multivariate Testing See 35+     See less IBM Websphere Commerce SEO Analytics SEM Web Analytics Google Analytics Web Project Management E-commerce Omniture Coremetrics Analytics Microsoft Excel Project Coordination Project Delivery analytics tagging A/B testing custom variables Segmentation Conversion Optimization digital analytics Cross-Domain Tracking KPI Dashboards Digital Strategy Team Management PowerPoint Microsoft Word Contract Negotiation Email Marketing Tags User Experience Online Marketing Marketing Strategy Management Digital Marketing Tracking Cross-functional Team... Variables Strategic Planning B2B PPC Web Marketing Strategy Interactive Marketing Multi-channel Marketing Analysis Cross-functional Team... Affiliate Marketing Project Management Google Webmaster Tools A/B Testing Multivariate Testing See 35+     See less Education Bucknell University B.A.,  Cultural Anthropology 1996  – 2000 My primary interest was in Material Culture and Mass Consumption i.e. why we buy what we do and how we make meaning out of mass produced goods and services. Although Bucknell didn't have a concentration in this, I remained interested in the subject after returning from studying this at University College London during my semester abroad. UCL Archaeology , Cultural Anthropology 1999  – 1999 I attended UCL in the spring semester of 1999 Bucknell University B.A.,  Cultural Anthropology 1996  – 2000 My primary interest was in Material Culture and Mass Consumption i.e. why we buy what we do and how we make meaning out of mass produced goods and services. Although Bucknell didn't have a concentration in this, I remained interested in the subject after returning from studying this at University College London during my semester abroad. Bucknell University B.A.,  Cultural Anthropology 1996  – 2000 My primary interest was in Material Culture and Mass Consumption i.e. why we buy what we do and how we make meaning out of mass produced goods and services. Although Bucknell didn't have a concentration in this, I remained interested in the subject after returning from studying this at University College London during my semester abroad. Bucknell University B.A.,  Cultural Anthropology 1996  – 2000 My primary interest was in Material Culture and Mass Consumption i.e. why we buy what we do and how we make meaning out of mass produced goods and services. Although Bucknell didn't have a concentration in this, I remained interested in the subject after returning from studying this at University College London during my semester abroad. UCL Archaeology , Cultural Anthropology 1999  – 1999 I attended UCL in the spring semester of 1999 UCL Archaeology , Cultural Anthropology 1999  – 1999 I attended UCL in the spring semester of 1999 UCL Archaeology , Cultural Anthropology 1999  – 1999 I attended UCL in the spring semester of 1999 Honors & Awards Additional Honors & Awards Coremetrics Technical Mastery Certification \nGoogle Analytics Individual Qualification Additional Honors & Awards Coremetrics Technical Mastery Certification \nGoogle Analytics Individual Qualification Additional Honors & Awards Coremetrics Technical Mastery Certification \nGoogle Analytics Individual Qualification Additional Honors & Awards Coremetrics Technical Mastery Certification \nGoogle Analytics Individual Qualification ", "Summary \tOver 11 years of total work experience, which includes working in the US and India - in spheres such as Web Analytics, Digital Marketing, Targeting & Optimization, Business Intelligence Analysis, Product Management, Training & Development.  \n Have predominantly worked in Web-based/eCommerce, Consumer Internet, BFSI & B2B sectors. \n\tExperience in leading a large group, providing thought leadership, setting up processes and building an effective organization from scratch. \n\tStrategist and a leader with very strong analytical and engagement skills to deal with circumstances and people. \n\tExperience working with global teams and deliver with the same effectiveness as a local contributor. \n\tSubject Matter Expert on Micro strategy Web, Micro strategy desktop, Business Objects Web Intelligence, Web Analytics & Ad Serving tools such as Omniture - Site Catalyst, Test & Target, Interaction Advisor and Tealeaf. \n\tDeveloped & Delivered Technical, Sales, Soft skills and Behavioral Training. Delivered multiple Advertising & Audience Concepts & Data Product Training, Tool Training on MicroStrategy Web and Business Objects Web. \n\tHigh degree of proactiveness in identifying opportunities to drive meaningful change for the business. \n\tBusiness savvy and have a very good understanding of the market, products & processes, systems & its implication. Summary \tOver 11 years of total work experience, which includes working in the US and India - in spheres such as Web Analytics, Digital Marketing, Targeting & Optimization, Business Intelligence Analysis, Product Management, Training & Development.  \n Have predominantly worked in Web-based/eCommerce, Consumer Internet, BFSI & B2B sectors. \n\tExperience in leading a large group, providing thought leadership, setting up processes and building an effective organization from scratch. \n\tStrategist and a leader with very strong analytical and engagement skills to deal with circumstances and people. \n\tExperience working with global teams and deliver with the same effectiveness as a local contributor. \n\tSubject Matter Expert on Micro strategy Web, Micro strategy desktop, Business Objects Web Intelligence, Web Analytics & Ad Serving tools such as Omniture - Site Catalyst, Test & Target, Interaction Advisor and Tealeaf. \n\tDeveloped & Delivered Technical, Sales, Soft skills and Behavioral Training. Delivered multiple Advertising & Audience Concepts & Data Product Training, Tool Training on MicroStrategy Web and Business Objects Web. \n\tHigh degree of proactiveness in identifying opportunities to drive meaningful change for the business. \n\tBusiness savvy and have a very good understanding of the market, products & processes, systems & its implication. \tOver 11 years of total work experience, which includes working in the US and India - in spheres such as Web Analytics, Digital Marketing, Targeting & Optimization, Business Intelligence Analysis, Product Management, Training & Development.  \n Have predominantly worked in Web-based/eCommerce, Consumer Internet, BFSI & B2B sectors. \n\tExperience in leading a large group, providing thought leadership, setting up processes and building an effective organization from scratch. \n\tStrategist and a leader with very strong analytical and engagement skills to deal with circumstances and people. \n\tExperience working with global teams and deliver with the same effectiveness as a local contributor. \n\tSubject Matter Expert on Micro strategy Web, Micro strategy desktop, Business Objects Web Intelligence, Web Analytics & Ad Serving tools such as Omniture - Site Catalyst, Test & Target, Interaction Advisor and Tealeaf. \n\tDeveloped & Delivered Technical, Sales, Soft skills and Behavioral Training. Delivered multiple Advertising & Audience Concepts & Data Product Training, Tool Training on MicroStrategy Web and Business Objects Web. \n\tHigh degree of proactiveness in identifying opportunities to drive meaningful change for the business. \n\tBusiness savvy and have a very good understanding of the market, products & processes, systems & its implication. \tOver 11 years of total work experience, which includes working in the US and India - in spheres such as Web Analytics, Digital Marketing, Targeting & Optimization, Business Intelligence Analysis, Product Management, Training & Development.  \n Have predominantly worked in Web-based/eCommerce, Consumer Internet, BFSI & B2B sectors. \n\tExperience in leading a large group, providing thought leadership, setting up processes and building an effective organization from scratch. \n\tStrategist and a leader with very strong analytical and engagement skills to deal with circumstances and people. \n\tExperience working with global teams and deliver with the same effectiveness as a local contributor. \n\tSubject Matter Expert on Micro strategy Web, Micro strategy desktop, Business Objects Web Intelligence, Web Analytics & Ad Serving tools such as Omniture - Site Catalyst, Test & Target, Interaction Advisor and Tealeaf. \n\tDeveloped & Delivered Technical, Sales, Soft skills and Behavioral Training. Delivered multiple Advertising & Audience Concepts & Data Product Training, Tool Training on MicroStrategy Web and Business Objects Web. \n\tHigh degree of proactiveness in identifying opportunities to drive meaningful change for the business. \n\tBusiness savvy and have a very good understanding of the market, products & processes, systems & its implication. Experience Senior Manager - Digital Analytics & Optimization [24]7 Innovation Labs - Product Group of 247 July 2014  – Present (1 year 2 months) Bengaluru Area, India * Lead the Digital Analytics & Optimization team of Managers and Analysts for Fortune 500 $50M plus NA BFSI accounts (Traditional & Online Banking products) for chat & IVR product and platform. Matrix managed data scientists for delivering model driven analytics for client specific optimization. \n* Built the analytics team from scratch, involved in hiring, training and coaching of the new team members and in building a BFSI analytics team. \n* Develop strategies based on customer journeys, lifecycle and customer behavior, target the right audience through rules and modeling. \n* Drive the client engagement management spectrum, responsible for end-to-end customer engagement including digital marketing analysis and optimization, business solution architecture, managing scope, schedule and delivery. \n* Acted as a Product Manager for the client specific needs, actively involved in customizing product and the analytical spectrum. \n* Provide directional guidance on the best practices on predictive modeling for propensity and other statistical models that help drive business goals. \n* Lead the team to successfully achieve the client specific KPI goals on website containment, revenue growth, conversion and customer experience. \n* Conduct DOE on hypotheses, measure outcomes and apply learning back into business. \n* Manage P&L and delivery of multiple programs to completion \nKey Accomplishments: Stepped up when the organization was in dire need, lead the new team to accomplish organizational goals soon after takeover. Optimized the funnels and doubled the volume of chats for a few LOB's in just a couple of months. \n \n Product Management, BI Analysis & Training Yahoo! February 2011  –  October 2012  (1 year 9 months) San Francisco Bay Area * Product Trainer & Product Manager for MicroStrategy Adhoc environment on Advertising data product. \n* Designed, developed and delivered several Instructor Led Training and Self Learning Modules using Captivate. \n* Trained and On boarded more than 1000 internal customers successfully. Developed a multi-tier support process which reduces the turnaround time.  \n* Solutioned advertising data product from scratch to gate Principal Analyst - Inbound Channel Marketing Targeting & Optimization - eData Experts Wells Fargo August 2010  –  February 2011  (7 months) San Francisco Bay Area •\tWorked on strategic audience & marketing analytics such as Interstitial Analysis, Placement Analysis and Campaign Analysis for different BU’s (Mortgage, HEQ, Online Statements, Bill Pay, Mobile, Wealth & Retirement Products and Traditional BU’s – Checking & Savings) from an inbound channel perspective. \n•\tManaged and improved the performance of targeted online marketing assets on wellsfargo.com and online banking.  \n•\tWorked closely with the Line of Business & Marketing Managers to help drive product sales, increase revenue, and increase activation and retention rates among Wells Fargo Online customers by devising effective targeting methodologies.  \n•\tResponsible for inbound channel ad serving performance, providing strategic marketing input for performance enhancement at a campaign/product level.  \n•\tAnalyze marketing channel effectiveness of inbound ad-serving technologies (Omniture’s Test & Target & Infor’s Interaction Advisor)  \n•\tRunning Omniture T&T reports and MicroStrategy reports to analyze individual campaign performance and effectiveness, and make strategic campaign improvement recommendations.  \n•\tExecuting campaign management rules using ad-serving management interface or working directly with client support team  \n•\tManage channel-related projects with Marketing Managers including modeling variable inputs and configuration updates to ad serving technologies. \n•\tKey Accomplishments: Provided some very interesting findings based on Splash analysis and other targeting related analytics which improved KPI’s for the Inbound Marketing Channel within Wells Fargo Internet Services Group Sr. Web Analytics Analyst - eData Experts Symantec September 2009  –  August 2010  (1 year) San Francisco Bay Area •\tDeveloped and Analyzed KPI’s and evaluate trends. \n•\tConduct regular and ad-hoc analyses for tactical daily operations, as well as for key marketing initiatives and strategies. \n•\tIdentifying and understanding key issues analyze and draw conclusions provide feedback based on the analysis to the ecommerce Executive team. \n•\tIdentify and report gaps needed to fully evaluate site performance, develop key and standard reports. \n•\tAssessing current trends on the ecommerce storefront, identifying areas for improvement, and devising and implementing strategies to improve key metrics for the site.  \n•\tCollaborate with other operations groups to assess overall effectiveness of promotions, campaigns, etc. designed to drive store performance. \n•\tSupport business drivers on strategies pertaining to sales volume, market share and price levels.  \n•\tPerform forecasting of future site performance, and compare to revenue goals and other key metrics.  \n•\tDesign & Develop Standard reports & Dashboards to support online sales, marketing & product teams. \n•\tPerform Quarterly Business Review activities for the online store. \n•\tTrained users and power users on Online Sales Data on Business Objects Web, worked with the knowledge management team in developed training materials and help guides.  \n•\tKey Accomplishments: Was awarded for my contributions in Analytics during my tenure as a consultant in one of the strategic and confidential projects for Symantec eCommerce store. Lead Business Analyst e-Data Experts, Inc October 2008  –  August 2009  (11 months) •\tRoles and Responsibilities: Elicit, analyze, document, communicate & validate requirements.  \n•\tConduct impact analysis of business requirement, provide documentation on how the application will support business requirement.  \n•\tWork with business/PM to gather product requirements. Closely work with the Engg team to interpret these requirements into design specifications. Assist PM throughout the PDLC. Instructional Designer and Independent Trainer Indepedent Freelancer January 2007  –  October 2008  (1 year 10 months) Manager Training & OD SODEXO (former SODEXHO) 2006  –  January 2007  (1 year) Training Manager VISIONAIRE TECHNOLOGY GROUP February 2006  –  September 2006  (8 months) Corporate Training manager JUSTDIAL December 2003  –  February 2006  (2 years 3 months) •\tIdentifying the business objectives & performance requirements (current standing) of each job profile in the Organization. \n•\tTraining imparted on Product/ Service/ Concept Selling Skills, Tele – marketing, Customer Service, Communication Skills & Presentation skills, Business etiquettes, Business Ethics, Leadership programs, Voice & Accent, Interpersonal & Intrapersonal skills, Team building, proprietary search tool training. \n•\tEffectively managed a large team of trainers and also managed the new recruits. \n•\tDesigned & developed Customized Training modules based on the requirements \n•\tDevelop training aids, including presentation, audio visual aids, handouts, web based curriculum etc \n•\tDesigned & delivered Train the Trainer programs.  \n•\tEvaluating the Training by taking constant feedback at regular intervals. \n•\tWorked alongside the Project Managers, Operations Managers and the Human Resources Managers to ensure that adequate training of employees was in place to meet production commitments and that the needs of employees were met through further transference of knowledge. \n•\tFacilitate and motivate employees to map learning agendas to achieve individual and organizational objectives. \n•\tPerformed HR activities very effectively which includes conducting interviews, hiring, compensation & benefits, retention and a lot more facets in the HR domain.  \n•\tKey accomplishments: Instrumental in creating a L&D chapter for Just Dial, started training operations for South India, contributed immensely towards sales and service goals through customized trainings, reduced attrition, was instrumental in creating a very healthy work culture among managers and individual contributors. Soft skills, Behavioral & Technical Trainer Freelance Trainer September 2003  –  December 2003  (4 months) Business Development Manager Jetking Infotrain Limited August 2002  –  December 2003  (1 year 5 months) •Responsible for generating revenue by marketing the concept and service managing the Marketing team to derive the desired result. Senior Manager - Digital Analytics & Optimization [24]7 Innovation Labs - Product Group of 247 July 2014  – Present (1 year 2 months) Bengaluru Area, India * Lead the Digital Analytics & Optimization team of Managers and Analysts for Fortune 500 $50M plus NA BFSI accounts (Traditional & Online Banking products) for chat & IVR product and platform. Matrix managed data scientists for delivering model driven analytics for client specific optimization. \n* Built the analytics team from scratch, involved in hiring, training and coaching of the new team members and in building a BFSI analytics team. \n* Develop strategies based on customer journeys, lifecycle and customer behavior, target the right audience through rules and modeling. \n* Drive the client engagement management spectrum, responsible for end-to-end customer engagement including digital marketing analysis and optimization, business solution architecture, managing scope, schedule and delivery. \n* Acted as a Product Manager for the client specific needs, actively involved in customizing product and the analytical spectrum. \n* Provide directional guidance on the best practices on predictive modeling for propensity and other statistical models that help drive business goals. \n* Lead the team to successfully achieve the client specific KPI goals on website containment, revenue growth, conversion and customer experience. \n* Conduct DOE on hypotheses, measure outcomes and apply learning back into business. \n* Manage P&L and delivery of multiple programs to completion \nKey Accomplishments: Stepped up when the organization was in dire need, lead the new team to accomplish organizational goals soon after takeover. Optimized the funnels and doubled the volume of chats for a few LOB's in just a couple of months. \n \n Senior Manager - Digital Analytics & Optimization [24]7 Innovation Labs - Product Group of 247 July 2014  – Present (1 year 2 months) Bengaluru Area, India * Lead the Digital Analytics & Optimization team of Managers and Analysts for Fortune 500 $50M plus NA BFSI accounts (Traditional & Online Banking products) for chat & IVR product and platform. Matrix managed data scientists for delivering model driven analytics for client specific optimization. \n* Built the analytics team from scratch, involved in hiring, training and coaching of the new team members and in building a BFSI analytics team. \n* Develop strategies based on customer journeys, lifecycle and customer behavior, target the right audience through rules and modeling. \n* Drive the client engagement management spectrum, responsible for end-to-end customer engagement including digital marketing analysis and optimization, business solution architecture, managing scope, schedule and delivery. \n* Acted as a Product Manager for the client specific needs, actively involved in customizing product and the analytical spectrum. \n* Provide directional guidance on the best practices on predictive modeling for propensity and other statistical models that help drive business goals. \n* Lead the team to successfully achieve the client specific KPI goals on website containment, revenue growth, conversion and customer experience. \n* Conduct DOE on hypotheses, measure outcomes and apply learning back into business. \n* Manage P&L and delivery of multiple programs to completion \nKey Accomplishments: Stepped up when the organization was in dire need, lead the new team to accomplish organizational goals soon after takeover. Optimized the funnels and doubled the volume of chats for a few LOB's in just a couple of months. \n \n Product Management, BI Analysis & Training Yahoo! February 2011  –  October 2012  (1 year 9 months) San Francisco Bay Area * Product Trainer & Product Manager for MicroStrategy Adhoc environment on Advertising data product. \n* Designed, developed and delivered several Instructor Led Training and Self Learning Modules using Captivate. \n* Trained and On boarded more than 1000 internal customers successfully. Developed a multi-tier support process which reduces the turnaround time.  \n* Solutioned advertising data product from scratch to gate Product Management, BI Analysis & Training Yahoo! February 2011  –  October 2012  (1 year 9 months) San Francisco Bay Area * Product Trainer & Product Manager for MicroStrategy Adhoc environment on Advertising data product. \n* Designed, developed and delivered several Instructor Led Training and Self Learning Modules using Captivate. \n* Trained and On boarded more than 1000 internal customers successfully. Developed a multi-tier support process which reduces the turnaround time.  \n* Solutioned advertising data product from scratch to gate Principal Analyst - Inbound Channel Marketing Targeting & Optimization - eData Experts Wells Fargo August 2010  –  February 2011  (7 months) San Francisco Bay Area •\tWorked on strategic audience & marketing analytics such as Interstitial Analysis, Placement Analysis and Campaign Analysis for different BU’s (Mortgage, HEQ, Online Statements, Bill Pay, Mobile, Wealth & Retirement Products and Traditional BU’s – Checking & Savings) from an inbound channel perspective. \n•\tManaged and improved the performance of targeted online marketing assets on wellsfargo.com and online banking.  \n•\tWorked closely with the Line of Business & Marketing Managers to help drive product sales, increase revenue, and increase activation and retention rates among Wells Fargo Online customers by devising effective targeting methodologies.  \n•\tResponsible for inbound channel ad serving performance, providing strategic marketing input for performance enhancement at a campaign/product level.  \n•\tAnalyze marketing channel effectiveness of inbound ad-serving technologies (Omniture’s Test & Target & Infor’s Interaction Advisor)  \n•\tRunning Omniture T&T reports and MicroStrategy reports to analyze individual campaign performance and effectiveness, and make strategic campaign improvement recommendations.  \n•\tExecuting campaign management rules using ad-serving management interface or working directly with client support team  \n•\tManage channel-related projects with Marketing Managers including modeling variable inputs and configuration updates to ad serving technologies. \n•\tKey Accomplishments: Provided some very interesting findings based on Splash analysis and other targeting related analytics which improved KPI’s for the Inbound Marketing Channel within Wells Fargo Internet Services Group Principal Analyst - Inbound Channel Marketing Targeting & Optimization - eData Experts Wells Fargo August 2010  –  February 2011  (7 months) San Francisco Bay Area •\tWorked on strategic audience & marketing analytics such as Interstitial Analysis, Placement Analysis and Campaign Analysis for different BU’s (Mortgage, HEQ, Online Statements, Bill Pay, Mobile, Wealth & Retirement Products and Traditional BU’s – Checking & Savings) from an inbound channel perspective. \n•\tManaged and improved the performance of targeted online marketing assets on wellsfargo.com and online banking.  \n•\tWorked closely with the Line of Business & Marketing Managers to help drive product sales, increase revenue, and increase activation and retention rates among Wells Fargo Online customers by devising effective targeting methodologies.  \n•\tResponsible for inbound channel ad serving performance, providing strategic marketing input for performance enhancement at a campaign/product level.  \n•\tAnalyze marketing channel effectiveness of inbound ad-serving technologies (Omniture’s Test & Target & Infor’s Interaction Advisor)  \n•\tRunning Omniture T&T reports and MicroStrategy reports to analyze individual campaign performance and effectiveness, and make strategic campaign improvement recommendations.  \n•\tExecuting campaign management rules using ad-serving management interface or working directly with client support team  \n•\tManage channel-related projects with Marketing Managers including modeling variable inputs and configuration updates to ad serving technologies. \n•\tKey Accomplishments: Provided some very interesting findings based on Splash analysis and other targeting related analytics which improved KPI’s for the Inbound Marketing Channel within Wells Fargo Internet Services Group Sr. Web Analytics Analyst - eData Experts Symantec September 2009  –  August 2010  (1 year) San Francisco Bay Area •\tDeveloped and Analyzed KPI’s and evaluate trends. \n•\tConduct regular and ad-hoc analyses for tactical daily operations, as well as for key marketing initiatives and strategies. \n•\tIdentifying and understanding key issues analyze and draw conclusions provide feedback based on the analysis to the ecommerce Executive team. \n•\tIdentify and report gaps needed to fully evaluate site performance, develop key and standard reports. \n•\tAssessing current trends on the ecommerce storefront, identifying areas for improvement, and devising and implementing strategies to improve key metrics for the site.  \n•\tCollaborate with other operations groups to assess overall effectiveness of promotions, campaigns, etc. designed to drive store performance. \n•\tSupport business drivers on strategies pertaining to sales volume, market share and price levels.  \n•\tPerform forecasting of future site performance, and compare to revenue goals and other key metrics.  \n•\tDesign & Develop Standard reports & Dashboards to support online sales, marketing & product teams. \n•\tPerform Quarterly Business Review activities for the online store. \n•\tTrained users and power users on Online Sales Data on Business Objects Web, worked with the knowledge management team in developed training materials and help guides.  \n•\tKey Accomplishments: Was awarded for my contributions in Analytics during my tenure as a consultant in one of the strategic and confidential projects for Symantec eCommerce store. Sr. Web Analytics Analyst - eData Experts Symantec September 2009  –  August 2010  (1 year) San Francisco Bay Area •\tDeveloped and Analyzed KPI’s and evaluate trends. \n•\tConduct regular and ad-hoc analyses for tactical daily operations, as well as for key marketing initiatives and strategies. \n•\tIdentifying and understanding key issues analyze and draw conclusions provide feedback based on the analysis to the ecommerce Executive team. \n•\tIdentify and report gaps needed to fully evaluate site performance, develop key and standard reports. \n•\tAssessing current trends on the ecommerce storefront, identifying areas for improvement, and devising and implementing strategies to improve key metrics for the site.  \n•\tCollaborate with other operations groups to assess overall effectiveness of promotions, campaigns, etc. designed to drive store performance. \n•\tSupport business drivers on strategies pertaining to sales volume, market share and price levels.  \n•\tPerform forecasting of future site performance, and compare to revenue goals and other key metrics.  \n•\tDesign & Develop Standard reports & Dashboards to support online sales, marketing & product teams. \n•\tPerform Quarterly Business Review activities for the online store. \n•\tTrained users and power users on Online Sales Data on Business Objects Web, worked with the knowledge management team in developed training materials and help guides.  \n•\tKey Accomplishments: Was awarded for my contributions in Analytics during my tenure as a consultant in one of the strategic and confidential projects for Symantec eCommerce store. Lead Business Analyst e-Data Experts, Inc October 2008  –  August 2009  (11 months) •\tRoles and Responsibilities: Elicit, analyze, document, communicate & validate requirements.  \n•\tConduct impact analysis of business requirement, provide documentation on how the application will support business requirement.  \n•\tWork with business/PM to gather product requirements. Closely work with the Engg team to interpret these requirements into design specifications. Assist PM throughout the PDLC. Lead Business Analyst e-Data Experts, Inc October 2008  –  August 2009  (11 months) •\tRoles and Responsibilities: Elicit, analyze, document, communicate & validate requirements.  \n•\tConduct impact analysis of business requirement, provide documentation on how the application will support business requirement.  \n•\tWork with business/PM to gather product requirements. Closely work with the Engg team to interpret these requirements into design specifications. Assist PM throughout the PDLC. Instructional Designer and Independent Trainer Indepedent Freelancer January 2007  –  October 2008  (1 year 10 months) Instructional Designer and Independent Trainer Indepedent Freelancer January 2007  –  October 2008  (1 year 10 months) Manager Training & OD SODEXO (former SODEXHO) 2006  –  January 2007  (1 year) Manager Training & OD SODEXO (former SODEXHO) 2006  –  January 2007  (1 year) Training Manager VISIONAIRE TECHNOLOGY GROUP February 2006  –  September 2006  (8 months) Training Manager VISIONAIRE TECHNOLOGY GROUP February 2006  –  September 2006  (8 months) Corporate Training manager JUSTDIAL December 2003  –  February 2006  (2 years 3 months) •\tIdentifying the business objectives & performance requirements (current standing) of each job profile in the Organization. \n•\tTraining imparted on Product/ Service/ Concept Selling Skills, Tele – marketing, Customer Service, Communication Skills & Presentation skills, Business etiquettes, Business Ethics, Leadership programs, Voice & Accent, Interpersonal & Intrapersonal skills, Team building, proprietary search tool training. \n•\tEffectively managed a large team of trainers and also managed the new recruits. \n•\tDesigned & developed Customized Training modules based on the requirements \n•\tDevelop training aids, including presentation, audio visual aids, handouts, web based curriculum etc \n•\tDesigned & delivered Train the Trainer programs.  \n•\tEvaluating the Training by taking constant feedback at regular intervals. \n•\tWorked alongside the Project Managers, Operations Managers and the Human Resources Managers to ensure that adequate training of employees was in place to meet production commitments and that the needs of employees were met through further transference of knowledge. \n•\tFacilitate and motivate employees to map learning agendas to achieve individual and organizational objectives. \n•\tPerformed HR activities very effectively which includes conducting interviews, hiring, compensation & benefits, retention and a lot more facets in the HR domain.  \n•\tKey accomplishments: Instrumental in creating a L&D chapter for Just Dial, started training operations for South India, contributed immensely towards sales and service goals through customized trainings, reduced attrition, was instrumental in creating a very healthy work culture among managers and individual contributors. Corporate Training manager JUSTDIAL December 2003  –  February 2006  (2 years 3 months) •\tIdentifying the business objectives & performance requirements (current standing) of each job profile in the Organization. \n•\tTraining imparted on Product/ Service/ Concept Selling Skills, Tele – marketing, Customer Service, Communication Skills & Presentation skills, Business etiquettes, Business Ethics, Leadership programs, Voice & Accent, Interpersonal & Intrapersonal skills, Team building, proprietary search tool training. \n•\tEffectively managed a large team of trainers and also managed the new recruits. \n•\tDesigned & developed Customized Training modules based on the requirements \n•\tDevelop training aids, including presentation, audio visual aids, handouts, web based curriculum etc \n•\tDesigned & delivered Train the Trainer programs.  \n•\tEvaluating the Training by taking constant feedback at regular intervals. \n•\tWorked alongside the Project Managers, Operations Managers and the Human Resources Managers to ensure that adequate training of employees was in place to meet production commitments and that the needs of employees were met through further transference of knowledge. \n•\tFacilitate and motivate employees to map learning agendas to achieve individual and organizational objectives. \n•\tPerformed HR activities very effectively which includes conducting interviews, hiring, compensation & benefits, retention and a lot more facets in the HR domain.  \n•\tKey accomplishments: Instrumental in creating a L&D chapter for Just Dial, started training operations for South India, contributed immensely towards sales and service goals through customized trainings, reduced attrition, was instrumental in creating a very healthy work culture among managers and individual contributors. Soft skills, Behavioral & Technical Trainer Freelance Trainer September 2003  –  December 2003  (4 months) Soft skills, Behavioral & Technical Trainer Freelance Trainer September 2003  –  December 2003  (4 months) Business Development Manager Jetking Infotrain Limited August 2002  –  December 2003  (1 year 5 months) •Responsible for generating revenue by marketing the concept and service managing the Marketing team to derive the desired result. Business Development Manager Jetking Infotrain Limited August 2002  –  December 2003  (1 year 5 months) •Responsible for generating revenue by marketing the concept and service managing the Marketing team to derive the desired result. Skills Business Intelligence Management E-commerce Analytics Leadership Soft Skills Online Marketing Product Management Training Web Analytics Organizational... Performance Management Business Analysis Team Management Microstrategy Big Data Technical Recruiting Omniture Business Development Technical Training Data Analysis People Management Market Analysis Project Management Adobe Captivate Omniture Test & Target Google Analytics Omniture Site Catalyst Business Objects Consumer Insights Customer Insight Business Analytics Tableau Yahoo Web Analytics ecommerce Strategy Consulting See 22+     See less Skills  Business Intelligence Management E-commerce Analytics Leadership Soft Skills Online Marketing Product Management Training Web Analytics Organizational... Performance Management Business Analysis Team Management Microstrategy Big Data Technical Recruiting Omniture Business Development Technical Training Data Analysis People Management Market Analysis Project Management Adobe Captivate Omniture Test & Target Google Analytics Omniture Site Catalyst Business Objects Consumer Insights Customer Insight Business Analytics Tableau Yahoo Web Analytics ecommerce Strategy Consulting See 22+     See less Business Intelligence Management E-commerce Analytics Leadership Soft Skills Online Marketing Product Management Training Web Analytics Organizational... Performance Management Business Analysis Team Management Microstrategy Big Data Technical Recruiting Omniture Business Development Technical Training Data Analysis People Management Market Analysis Project Management Adobe Captivate Omniture Test & Target Google Analytics Omniture Site Catalyst Business Objects Consumer Insights Customer Insight Business Analytics Tableau Yahoo Web Analytics ecommerce Strategy Consulting See 22+     See less Business Intelligence Management E-commerce Analytics Leadership Soft Skills Online Marketing Product Management Training Web Analytics Organizational... Performance Management Business Analysis Team Management Microstrategy Big Data Technical Recruiting Omniture Business Development Technical Training Data Analysis People Management Market Analysis Project Management Adobe Captivate Omniture Test & Target Google Analytics Omniture Site Catalyst Business Objects Consumer Insights Customer Insight Business Analytics Tableau Yahoo Web Analytics ecommerce Strategy Consulting See 22+     See less Education Symbiosis International University PGDBA,  Business Management 2004  – 2006 Bangalore University BBM,  Management 1999  – 2002 Specialization - Marketing from Bangalore University Bangalore University PU,  Commerce ,  Accounts ,  Management & Mathematics 1997  – 1999 Symbiosis International University PGDBA,  Business Management 2004  – 2006 Symbiosis International University PGDBA,  Business Management 2004  – 2006 Symbiosis International University PGDBA,  Business Management 2004  – 2006 Bangalore University BBM,  Management 1999  – 2002 Specialization - Marketing from Bangalore University Bangalore University BBM,  Management 1999  – 2002 Specialization - Marketing from Bangalore University Bangalore University BBM,  Management 1999  – 2002 Specialization - Marketing from Bangalore University Bangalore University PU,  Commerce ,  Accounts ,  Management & Mathematics 1997  – 1999 Bangalore University PU,  Commerce ,  Accounts ,  Management & Mathematics 1997  – 1999 Bangalore University PU,  Commerce ,  Accounts ,  Management & Mathematics 1997  – 1999 ", "Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills IT Strategy Business Intelligence Business Transformation Business Process Business Process Design SAP R/3 Management Consulting SAP ERP ERP PMO Business Process... SAP Netweaver Skills  IT Strategy Business Intelligence Business Transformation Business Process Business Process Design SAP R/3 Management Consulting SAP ERP ERP PMO Business Process... SAP Netweaver IT Strategy Business Intelligence Business Transformation Business Process Business Process Design SAP R/3 Management Consulting SAP ERP ERP PMO Business Process... SAP Netweaver IT Strategy Business Intelligence Business Transformation Business Process Business Process Design SAP R/3 Management Consulting SAP ERP ERP PMO Business Process... SAP Netweaver ", "Summary Digital strategist with expertise in digital marketing and analytics with a track record of building and managing successful digital practices and businesses. 14 years experience working with IBM, AOL (world's largest digital advertising platform), Infosys Finacle, startup digital companies and developing an in-house analytics tool. A Right brained marketer with the proven ability to torture data and translate actionable insights into business results Summary Digital strategist with expertise in digital marketing and analytics with a track record of building and managing successful digital practices and businesses. 14 years experience working with IBM, AOL (world's largest digital advertising platform), Infosys Finacle, startup digital companies and developing an in-house analytics tool. A Right brained marketer with the proven ability to torture data and translate actionable insights into business results Digital strategist with expertise in digital marketing and analytics with a track record of building and managing successful digital practices and businesses. 14 years experience working with IBM, AOL (world's largest digital advertising platform), Infosys Finacle, startup digital companies and developing an in-house analytics tool. A Right brained marketer with the proven ability to torture data and translate actionable insights into business results Digital strategist with expertise in digital marketing and analytics with a track record of building and managing successful digital practices and businesses. 14 years experience working with IBM, AOL (world's largest digital advertising platform), Infosys Finacle, startup digital companies and developing an in-house analytics tool. A Right brained marketer with the proven ability to torture data and translate actionable insights into business results Experience Senior Manager - Digital Analytics Cognizant June 2015  – Present (3 months) Bengaluru Area, India Delivering digital analytics solutions to global clients Manager – Digital Analytics and Strategy IBM February 2009  –  June 2015  (6 years 5 months) Bangalore Lead IBM’s digital analytics and business intelligence team of ten senior analysts to deliver reporting and actionable insights to global marketing leadership. Responsible for people management, stakeholder relationships and to conceptualize and deliver performance dashboards, actionable insights and implement next actions.  \n \n• Transformed IBM GBS digital to the best performing business unit and delivered $60M win revenue and $100M digital pipeline in 2013-14. Built the first mobile (responsive) website for IBM.  \n• Achieved the highest organic search traffic compared to other properties with 30% growth YTY. \n• Delivered 300K cost savings with increased digital operational efficiency \n• Developed “Analytics Business Culture” in the marketing discipline and created POE strategy \n• Recognition from VP, GBS Marketing in Q3 2014, Managers Choice awards in Q2 and Q3 2014 Manager – Digital Analytics IBM United Kingdom Ltd June 2011  –  October 2013  (2 years 5 months) London Responsible for IBM's GBS global (business consulting) digital strategy and marketing. Delivered $25M revenue and $50M digital pipeline and built an Analytics Business Culture in the marketing function. Associate Manager - Digital Analytics and Business Intelligence AOL Time Warner January 2007  –  February 2009  (2 years 2 months) Bangalore Conceptualized and delivered enterprise MIS for AOL’s senior leadership in Europe. Lead and empowered a team of BI professionals to deliver reporting, KPI’s and actionable insights. Managed stakeholder relationships, project and people management and administered Omniture and Comscore.  \n \n• Led the project to develop a data warehouse with Oracle database and Business Objects reporting, the first initiative in AOL to build an enterprise MIS to deliver business KPI’s on a single platform  \n• Digital Marketing, Omniture Administration, Comscore administration \n• Collaborated with a multi discipline team to deliver an international entry strategy for the AOL leadership  \n• Received “Star Performer” award for Q1 08, Received “Star Performing Team” award for Q2 08 Senior Analyst - Digital Analytics Nabler April 2006  –  January 2007  (10 months) Bangalore Managed Infosys Finacle account at Nabler, one of the early digital analytics companies in India. Lead the project to create an in-house analytics tool and responsible for deploying and delivering business results for the client.  \n \n• Developed, deployed and managed an in-house web analytics tool  \n• KPI’s, Reporting and Insights using WebTrends \n• Relationship management, business development and people management Manager – Digital Marketing Flatworld Solutions May 2003  –  April 2006  (3 years) Bangalore Flatworldsolutions.com, a division of Stylusinc.com, is an online company and a pioneer in BPO, KPO, Data and Engineering services and a wide range of other services. Managed online sales, operations, business development, marketing and P&L for a 3D, design and document services division.  \n \n•\tBusiness Development and Relationship Management  \n•\tInternational Online Sales  \n•\tTechnical Transition, Operations, Project and People Management \n•\tDelivery and Quality Control \n•\tInvoicing and Receivables Management \n•\tResource allocation, Delivery, and Quality Control \n•\tDelivered 40+ projects and two 10 FTE projects Manager – Digital Marketing and Business Development Chillibreeze September 2005  –  March 2006  (7 months) Shillong Area, India Set up and managed Chillibreeze.com, one of the earliest crowd sourcing and the first IT Company in Shillong NE India. Managed business development,international sales, relationship management, digital marketing, analytics, company setup, people management, regulatory compliance and systems setup and administration. Manager – Digital Strategy and Marketing Stylus July 2001  –  May 2003  (1 year 11 months) Bangalore Stylusinc.com is an online company specializing in custom software and web development. Responsible for web marketing, operations, people management, accounts and finance, IT support, HR and regulatory compliance.  \n \n•\tDeveloped and implemented web strategy including SEO and analytics \n•\tArchitected and implemented the network, servers and workstations, windows and linux servers and managed administration \n•\tDesigned and implemented facilities and accounting processes. Responsible for MIS ,FIS and statutory compliances like STPI \n•\tRecruitment, people management and designing performance management systems like 360 degree evaluation, CIP (Competency Improvement Program) and HR Scorecards \n•\tCEO’s award for successfully relocating the company in record time with zero downtime in 2002 \n•\tCEO’s award for successful server setup and systems management in 2001 Senior Manager - Digital Analytics Cognizant June 2015  – Present (3 months) Bengaluru Area, India Delivering digital analytics solutions to global clients Senior Manager - Digital Analytics Cognizant June 2015  – Present (3 months) Bengaluru Area, India Delivering digital analytics solutions to global clients Manager – Digital Analytics and Strategy IBM February 2009  –  June 2015  (6 years 5 months) Bangalore Lead IBM’s digital analytics and business intelligence team of ten senior analysts to deliver reporting and actionable insights to global marketing leadership. Responsible for people management, stakeholder relationships and to conceptualize and deliver performance dashboards, actionable insights and implement next actions.  \n \n• Transformed IBM GBS digital to the best performing business unit and delivered $60M win revenue and $100M digital pipeline in 2013-14. Built the first mobile (responsive) website for IBM.  \n• Achieved the highest organic search traffic compared to other properties with 30% growth YTY. \n• Delivered 300K cost savings with increased digital operational efficiency \n• Developed “Analytics Business Culture” in the marketing discipline and created POE strategy \n• Recognition from VP, GBS Marketing in Q3 2014, Managers Choice awards in Q2 and Q3 2014 Manager – Digital Analytics and Strategy IBM February 2009  –  June 2015  (6 years 5 months) Bangalore Lead IBM’s digital analytics and business intelligence team of ten senior analysts to deliver reporting and actionable insights to global marketing leadership. Responsible for people management, stakeholder relationships and to conceptualize and deliver performance dashboards, actionable insights and implement next actions.  \n \n• Transformed IBM GBS digital to the best performing business unit and delivered $60M win revenue and $100M digital pipeline in 2013-14. Built the first mobile (responsive) website for IBM.  \n• Achieved the highest organic search traffic compared to other properties with 30% growth YTY. \n• Delivered 300K cost savings with increased digital operational efficiency \n• Developed “Analytics Business Culture” in the marketing discipline and created POE strategy \n• Recognition from VP, GBS Marketing in Q3 2014, Managers Choice awards in Q2 and Q3 2014 Manager – Digital Analytics IBM United Kingdom Ltd June 2011  –  October 2013  (2 years 5 months) London Responsible for IBM's GBS global (business consulting) digital strategy and marketing. Delivered $25M revenue and $50M digital pipeline and built an Analytics Business Culture in the marketing function. Manager – Digital Analytics IBM United Kingdom Ltd June 2011  –  October 2013  (2 years 5 months) London Responsible for IBM's GBS global (business consulting) digital strategy and marketing. Delivered $25M revenue and $50M digital pipeline and built an Analytics Business Culture in the marketing function. Associate Manager - Digital Analytics and Business Intelligence AOL Time Warner January 2007  –  February 2009  (2 years 2 months) Bangalore Conceptualized and delivered enterprise MIS for AOL’s senior leadership in Europe. Lead and empowered a team of BI professionals to deliver reporting, KPI’s and actionable insights. Managed stakeholder relationships, project and people management and administered Omniture and Comscore.  \n \n• Led the project to develop a data warehouse with Oracle database and Business Objects reporting, the first initiative in AOL to build an enterprise MIS to deliver business KPI’s on a single platform  \n• Digital Marketing, Omniture Administration, Comscore administration \n• Collaborated with a multi discipline team to deliver an international entry strategy for the AOL leadership  \n• Received “Star Performer” award for Q1 08, Received “Star Performing Team” award for Q2 08 Associate Manager - Digital Analytics and Business Intelligence AOL Time Warner January 2007  –  February 2009  (2 years 2 months) Bangalore Conceptualized and delivered enterprise MIS for AOL’s senior leadership in Europe. Lead and empowered a team of BI professionals to deliver reporting, KPI’s and actionable insights. Managed stakeholder relationships, project and people management and administered Omniture and Comscore.  \n \n• Led the project to develop a data warehouse with Oracle database and Business Objects reporting, the first initiative in AOL to build an enterprise MIS to deliver business KPI’s on a single platform  \n• Digital Marketing, Omniture Administration, Comscore administration \n• Collaborated with a multi discipline team to deliver an international entry strategy for the AOL leadership  \n• Received “Star Performer” award for Q1 08, Received “Star Performing Team” award for Q2 08 Senior Analyst - Digital Analytics Nabler April 2006  –  January 2007  (10 months) Bangalore Managed Infosys Finacle account at Nabler, one of the early digital analytics companies in India. Lead the project to create an in-house analytics tool and responsible for deploying and delivering business results for the client.  \n \n• Developed, deployed and managed an in-house web analytics tool  \n• KPI’s, Reporting and Insights using WebTrends \n• Relationship management, business development and people management Senior Analyst - Digital Analytics Nabler April 2006  –  January 2007  (10 months) Bangalore Managed Infosys Finacle account at Nabler, one of the early digital analytics companies in India. Lead the project to create an in-house analytics tool and responsible for deploying and delivering business results for the client.  \n \n• Developed, deployed and managed an in-house web analytics tool  \n• KPI’s, Reporting and Insights using WebTrends \n• Relationship management, business development and people management Manager – Digital Marketing Flatworld Solutions May 2003  –  April 2006  (3 years) Bangalore Flatworldsolutions.com, a division of Stylusinc.com, is an online company and a pioneer in BPO, KPO, Data and Engineering services and a wide range of other services. Managed online sales, operations, business development, marketing and P&L for a 3D, design and document services division.  \n \n•\tBusiness Development and Relationship Management  \n•\tInternational Online Sales  \n•\tTechnical Transition, Operations, Project and People Management \n•\tDelivery and Quality Control \n•\tInvoicing and Receivables Management \n•\tResource allocation, Delivery, and Quality Control \n•\tDelivered 40+ projects and two 10 FTE projects Manager – Digital Marketing Flatworld Solutions May 2003  –  April 2006  (3 years) Bangalore Flatworldsolutions.com, a division of Stylusinc.com, is an online company and a pioneer in BPO, KPO, Data and Engineering services and a wide range of other services. Managed online sales, operations, business development, marketing and P&L for a 3D, design and document services division.  \n \n•\tBusiness Development and Relationship Management  \n•\tInternational Online Sales  \n•\tTechnical Transition, Operations, Project and People Management \n•\tDelivery and Quality Control \n•\tInvoicing and Receivables Management \n•\tResource allocation, Delivery, and Quality Control \n•\tDelivered 40+ projects and two 10 FTE projects Manager – Digital Marketing and Business Development Chillibreeze September 2005  –  March 2006  (7 months) Shillong Area, India Set up and managed Chillibreeze.com, one of the earliest crowd sourcing and the first IT Company in Shillong NE India. Managed business development,international sales, relationship management, digital marketing, analytics, company setup, people management, regulatory compliance and systems setup and administration. Manager – Digital Marketing and Business Development Chillibreeze September 2005  –  March 2006  (7 months) Shillong Area, India Set up and managed Chillibreeze.com, one of the earliest crowd sourcing and the first IT Company in Shillong NE India. Managed business development,international sales, relationship management, digital marketing, analytics, company setup, people management, regulatory compliance and systems setup and administration. Manager – Digital Strategy and Marketing Stylus July 2001  –  May 2003  (1 year 11 months) Bangalore Stylusinc.com is an online company specializing in custom software and web development. Responsible for web marketing, operations, people management, accounts and finance, IT support, HR and regulatory compliance.  \n \n•\tDeveloped and implemented web strategy including SEO and analytics \n•\tArchitected and implemented the network, servers and workstations, windows and linux servers and managed administration \n•\tDesigned and implemented facilities and accounting processes. Responsible for MIS ,FIS and statutory compliances like STPI \n•\tRecruitment, people management and designing performance management systems like 360 degree evaluation, CIP (Competency Improvement Program) and HR Scorecards \n•\tCEO’s award for successfully relocating the company in record time with zero downtime in 2002 \n•\tCEO’s award for successful server setup and systems management in 2001 Manager – Digital Strategy and Marketing Stylus July 2001  –  May 2003  (1 year 11 months) Bangalore Stylusinc.com is an online company specializing in custom software and web development. Responsible for web marketing, operations, people management, accounts and finance, IT support, HR and regulatory compliance.  \n \n•\tDeveloped and implemented web strategy including SEO and analytics \n•\tArchitected and implemented the network, servers and workstations, windows and linux servers and managed administration \n•\tDesigned and implemented facilities and accounting processes. Responsible for MIS ,FIS and statutory compliances like STPI \n•\tRecruitment, people management and designing performance management systems like 360 degree evaluation, CIP (Competency Improvement Program) and HR Scorecards \n•\tCEO’s award for successfully relocating the company in record time with zero downtime in 2002 \n•\tCEO’s award for successful server setup and systems management in 2001 Languages Hindi Malayalam Hindi Malayalam Hindi Malayalam Skills Omniture Business Intelligence Data Warehousing Analytics Competitive Analysis Lead Generation E-commerce Web Analytics Business Objects Business Development Business Analytics Marketing Strategy Digital Marketing Consulting Team Management Management CRM See 3+     See less Skills  Omniture Business Intelligence Data Warehousing Analytics Competitive Analysis Lead Generation E-commerce Web Analytics Business Objects Business Development Business Analytics Marketing Strategy Digital Marketing Consulting Team Management Management CRM See 3+     See less Omniture Business Intelligence Data Warehousing Analytics Competitive Analysis Lead Generation E-commerce Web Analytics Business Objects Business Development Business Analytics Marketing Strategy Digital Marketing Consulting Team Management Management CRM See 3+     See less Omniture Business Intelligence Data Warehousing Analytics Competitive Analysis Lead Generation E-commerce Web Analytics Business Objects Business Development Business Analytics Marketing Strategy Digital Marketing Consulting Team Management Management CRM See 3+     See less Education Symbiosis International University PGDBA,  Human Resources Management/Personnel Administration , General 2002  – 2004 Symbiosis International University PGDBA,  Human Resources Management/Personnel Administration , General 2002  – 2004 Symbiosis International University PGDBA,  Human Resources Management/Personnel Administration , General 2002  – 2004 Symbiosis International University PGDBA,  Human Resources Management/Personnel Administration , General 2002  – 2004 ", "Summary To help my clients ensure quality web experiences for their customers: \n- MBA from Loyola University of Chicago \n- Web performance strategist and solutions engineer \n- Technical expertise with passive and synthetic Web site monitoring solutions \n- Web analytics strategy and technology expertise: Omniture, WebTrends, and Google Analytics. \n- Develop key performance indicators for Internet, Intranet and Extranet sites. \n- Maximize paid and non-paid search engine initiatives.  \n- Demonstrated success managing Web analytics initiatives while applying SDLC methodologies and standards. \n- Accomplished systems analyst with business savvy and technical expertise within a diverse range of solutions. Specialties:Web site performance and optimization, Web Analytics, vendor relationships, Project Management Summary To help my clients ensure quality web experiences for their customers: \n- MBA from Loyola University of Chicago \n- Web performance strategist and solutions engineer \n- Technical expertise with passive and synthetic Web site monitoring solutions \n- Web analytics strategy and technology expertise: Omniture, WebTrends, and Google Analytics. \n- Develop key performance indicators for Internet, Intranet and Extranet sites. \n- Maximize paid and non-paid search engine initiatives.  \n- Demonstrated success managing Web analytics initiatives while applying SDLC methodologies and standards. \n- Accomplished systems analyst with business savvy and technical expertise within a diverse range of solutions. Specialties:Web site performance and optimization, Web Analytics, vendor relationships, Project Management To help my clients ensure quality web experiences for their customers: \n- MBA from Loyola University of Chicago \n- Web performance strategist and solutions engineer \n- Technical expertise with passive and synthetic Web site monitoring solutions \n- Web analytics strategy and technology expertise: Omniture, WebTrends, and Google Analytics. \n- Develop key performance indicators for Internet, Intranet and Extranet sites. \n- Maximize paid and non-paid search engine initiatives.  \n- Demonstrated success managing Web analytics initiatives while applying SDLC methodologies and standards. \n- Accomplished systems analyst with business savvy and technical expertise within a diverse range of solutions. Specialties:Web site performance and optimization, Web Analytics, vendor relationships, Project Management To help my clients ensure quality web experiences for their customers: \n- MBA from Loyola University of Chicago \n- Web performance strategist and solutions engineer \n- Technical expertise with passive and synthetic Web site monitoring solutions \n- Web analytics strategy and technology expertise: Omniture, WebTrends, and Google Analytics. \n- Develop key performance indicators for Internet, Intranet and Extranet sites. \n- Maximize paid and non-paid search engine initiatives.  \n- Demonstrated success managing Web analytics initiatives while applying SDLC methodologies and standards. \n- Accomplished systems analyst with business savvy and technical expertise within a diverse range of solutions. Specialties:Web site performance and optimization, Web Analytics, vendor relationships, Project Management Experience Senior Manager Digital Analytics Accenture January 2014  – Present (1 year 8 months) Chicago, IL Sr Analyst, Business Analytics Sears Holdings Corporation October 2011  –  January 2014  (2 years 4 months) Hoffman Estates, IL I managed the implementation strategy of digital analytic solutions that empower the business to create integrated retail user experiences that drive multi-channel sales. Digital Marketing Intelligence Systems Analyst Kellogg Company March 2010  –  October 2011  (1 year 8 months) Implement solutions that enable marketing and brand management to build relationships with their segmented consumers. Web Analytics Consultant Technology Leaders January 2009  –  January 2010  (1 year 1 month) Lead implementation of web analytics and performance solutions for major clients: Coca-Cola, 3M, Daiichi Sankyo, Michelin Tire, Thomas Publishing. Sales Engineer Gomez, Inc. January 2008  –  December 2008  (1 year) Demonstrate to perspective clients how the Gomez platform ensures quality web experiences for their customers. Identify the value-added solutions that that will solve my clients unique business problems that hinder the end-user experience.  \nGomez provides on-demand services to measure and manage website and web application performance and the customer web experience from design and development, through deployment to production. All of our services are integrated into the Gomez ExperienceFirst™ Platform and can be accessed via an easy-to-use Web interface. Senior Web Analytics Analyst Critical Mass July 2007  –  December 2007  (6 months) Led the Web analytics efforts for clients such as Rolex, LVCVA and Moen for the Insight & Planning team. Web Metrics Analyst Deloitte Touche March 2005  –  June 2007  (2 years 4 months) Systems Project Leader Kraft Foods September 2000  –  March 2005  (4 years 7 months) Managed Web analytics efforts and related projects for various company Web entities. Telecommunication Sales Comdisco November 1993  –  December 1999  (6 years 2 months) Sold telecommuncations equipment to fortune 1000 companies. Account Executive SkyTel 1991  –  1992  (1 year) Senior Manager Digital Analytics Accenture January 2014  – Present (1 year 8 months) Chicago, IL Senior Manager Digital Analytics Accenture January 2014  – Present (1 year 8 months) Chicago, IL Sr Analyst, Business Analytics Sears Holdings Corporation October 2011  –  January 2014  (2 years 4 months) Hoffman Estates, IL I managed the implementation strategy of digital analytic solutions that empower the business to create integrated retail user experiences that drive multi-channel sales. Sr Analyst, Business Analytics Sears Holdings Corporation October 2011  –  January 2014  (2 years 4 months) Hoffman Estates, IL I managed the implementation strategy of digital analytic solutions that empower the business to create integrated retail user experiences that drive multi-channel sales. Digital Marketing Intelligence Systems Analyst Kellogg Company March 2010  –  October 2011  (1 year 8 months) Implement solutions that enable marketing and brand management to build relationships with their segmented consumers. Digital Marketing Intelligence Systems Analyst Kellogg Company March 2010  –  October 2011  (1 year 8 months) Implement solutions that enable marketing and brand management to build relationships with their segmented consumers. Web Analytics Consultant Technology Leaders January 2009  –  January 2010  (1 year 1 month) Lead implementation of web analytics and performance solutions for major clients: Coca-Cola, 3M, Daiichi Sankyo, Michelin Tire, Thomas Publishing. Web Analytics Consultant Technology Leaders January 2009  –  January 2010  (1 year 1 month) Lead implementation of web analytics and performance solutions for major clients: Coca-Cola, 3M, Daiichi Sankyo, Michelin Tire, Thomas Publishing. Sales Engineer Gomez, Inc. January 2008  –  December 2008  (1 year) Demonstrate to perspective clients how the Gomez platform ensures quality web experiences for their customers. Identify the value-added solutions that that will solve my clients unique business problems that hinder the end-user experience.  \nGomez provides on-demand services to measure and manage website and web application performance and the customer web experience from design and development, through deployment to production. All of our services are integrated into the Gomez ExperienceFirst™ Platform and can be accessed via an easy-to-use Web interface. Sales Engineer Gomez, Inc. January 2008  –  December 2008  (1 year) Demonstrate to perspective clients how the Gomez platform ensures quality web experiences for their customers. Identify the value-added solutions that that will solve my clients unique business problems that hinder the end-user experience.  \nGomez provides on-demand services to measure and manage website and web application performance and the customer web experience from design and development, through deployment to production. All of our services are integrated into the Gomez ExperienceFirst™ Platform and can be accessed via an easy-to-use Web interface. Senior Web Analytics Analyst Critical Mass July 2007  –  December 2007  (6 months) Led the Web analytics efforts for clients such as Rolex, LVCVA and Moen for the Insight & Planning team. Senior Web Analytics Analyst Critical Mass July 2007  –  December 2007  (6 months) Led the Web analytics efforts for clients such as Rolex, LVCVA and Moen for the Insight & Planning team. Web Metrics Analyst Deloitte Touche March 2005  –  June 2007  (2 years 4 months) Web Metrics Analyst Deloitte Touche March 2005  –  June 2007  (2 years 4 months) Systems Project Leader Kraft Foods September 2000  –  March 2005  (4 years 7 months) Managed Web analytics efforts and related projects for various company Web entities. Systems Project Leader Kraft Foods September 2000  –  March 2005  (4 years 7 months) Managed Web analytics efforts and related projects for various company Web entities. Telecommunication Sales Comdisco November 1993  –  December 1999  (6 years 2 months) Sold telecommuncations equipment to fortune 1000 companies. Telecommunication Sales Comdisco November 1993  –  December 1999  (6 years 2 months) Sold telecommuncations equipment to fortune 1000 companies. Account Executive SkyTel 1991  –  1992  (1 year) Account Executive SkyTel 1991  –  1992  (1 year) Languages Spanish Spanish Spanish Skills Web Analytics Optimization SEM Google Analytics Email Marketing Online Marketing Omniture Vendor Relations Digital Marketing Analytics WebTrends E-commerce Digital Strategy Integrated Marketing Mobile Marketing WebTrends Analytics CRM Multi-channel Marketing Management SEO SDLC Leadership Marketing Strategy Project Management Competitive Analysis Database Marketing Segmentation Business Analytics PPC Brand Management Customer Insight A/B testing Lead Generation Google Adwords Customer Analysis Interactive Marketing Predictive Analytics Conversion Optimization Customer Acquisition Online Advertising Social Media Measurement Direct Marketing Marketing Research Landing Page... Market Research Salesforce.com See 32+     See less Skills  Web Analytics Optimization SEM Google Analytics Email Marketing Online Marketing Omniture Vendor Relations Digital Marketing Analytics WebTrends E-commerce Digital Strategy Integrated Marketing Mobile Marketing WebTrends Analytics CRM Multi-channel Marketing Management SEO SDLC Leadership Marketing Strategy Project Management Competitive Analysis Database Marketing Segmentation Business Analytics PPC Brand Management Customer Insight A/B testing Lead Generation Google Adwords Customer Analysis Interactive Marketing Predictive Analytics Conversion Optimization Customer Acquisition Online Advertising Social Media Measurement Direct Marketing Marketing Research Landing Page... Market Research Salesforce.com See 32+     See less Web Analytics Optimization SEM Google Analytics Email Marketing Online Marketing Omniture Vendor Relations Digital Marketing Analytics WebTrends E-commerce Digital Strategy Integrated Marketing Mobile Marketing WebTrends Analytics CRM Multi-channel Marketing Management SEO SDLC Leadership Marketing Strategy Project Management Competitive Analysis Database Marketing Segmentation Business Analytics PPC Brand Management Customer Insight A/B testing Lead Generation Google Adwords Customer Analysis Interactive Marketing Predictive Analytics Conversion Optimization Customer Acquisition Online Advertising Social Media Measurement Direct Marketing Marketing Research Landing Page... Market Research Salesforce.com See 32+     See less Web Analytics Optimization SEM Google Analytics Email Marketing Online Marketing Omniture Vendor Relations Digital Marketing Analytics WebTrends E-commerce Digital Strategy Integrated Marketing Mobile Marketing WebTrends Analytics CRM Multi-channel Marketing Management SEO SDLC Leadership Marketing Strategy Project Management Competitive Analysis Database Marketing Segmentation Business Analytics PPC Brand Management Customer Insight A/B testing Lead Generation Google Adwords Customer Analysis Interactive Marketing Predictive Analytics Conversion Optimization Customer Acquisition Online Advertising Social Media Measurement Direct Marketing Marketing Research Landing Page... Market Research Salesforce.com See 32+     See less Education Loyola University Chicago MBA,  MIS & Marketing 1996  – 1999 Syracuse University BA,  Political Science ,  Psychology 1987  – 1991 Activities and Societies:  Sigma Alpha Mu Romona, New Trier Loyola University Chicago MBA,  MIS & Marketing 1996  – 1999 Loyola University Chicago MBA,  MIS & Marketing 1996  – 1999 Loyola University Chicago MBA,  MIS & Marketing 1996  – 1999 Syracuse University BA,  Political Science ,  Psychology 1987  – 1991 Activities and Societies:  Sigma Alpha Mu Syracuse University BA,  Political Science ,  Psychology 1987  – 1991 Activities and Societies:  Sigma Alpha Mu Syracuse University BA,  Political Science ,  Psychology 1987  – 1991 Activities and Societies:  Sigma Alpha Mu Romona, New Trier Romona, New Trier Romona, New Trier ", "Summary Programming tools: \nExtensive knowledge of SAS, SPSS, Excel \nBasic knowledge of SQL, R, Python \n \nAnalysis tools:  \nTableau, Adobe Marketing Cloud (Ad Hoc, Target, SiteCatalyst) \n \nRelevant coursework in: \nExperiment design, sampling, estimation, regression, ANOVA Summary Programming tools: \nExtensive knowledge of SAS, SPSS, Excel \nBasic knowledge of SQL, R, Python \n \nAnalysis tools:  \nTableau, Adobe Marketing Cloud (Ad Hoc, Target, SiteCatalyst) \n \nRelevant coursework in: \nExperiment design, sampling, estimation, regression, ANOVA Programming tools: \nExtensive knowledge of SAS, SPSS, Excel \nBasic knowledge of SQL, R, Python \n \nAnalysis tools:  \nTableau, Adobe Marketing Cloud (Ad Hoc, Target, SiteCatalyst) \n \nRelevant coursework in: \nExperiment design, sampling, estimation, regression, ANOVA Programming tools: \nExtensive knowledge of SAS, SPSS, Excel \nBasic knowledge of SQL, R, Python \n \nAnalysis tools:  \nTableau, Adobe Marketing Cloud (Ad Hoc, Target, SiteCatalyst) \n \nRelevant coursework in: \nExperiment design, sampling, estimation, regression, ANOVA Experience Senior Manager, Digital Analytics Marriott International April 2013  – Present (2 years 5 months) Bethesda, MD Senior Manager - Merchandising and Booking (April, 2015 - present) \n•\tDevelop weekly Tableau driven dashboards and reports for digital product line owners. \n•\tIdentify opportunities for improving merchandising, conversion rates, and customer engagement through statistical analysis. \n \nManager - Digital Experimentation (April, 2013 - April, 2015) \n•\tIncreased bookings and Marriott Rewards enrollments by providing experiment design assistance and analyzing test results for all A/B and multivariate tests on Marriott.com. \n•\tResearched and introduced an Alpha Spending Model to understand when tests should be ended early due to strong negative (or positive) performance. \n•\tProgrammed a VBA-driven test traffic calculator so that product lines may determine test traffic needs dependent on a series of constraints. \n•\tCreated Tableau dashboards and monthly release reports to pre/post measure large impacts of release changes to Marriott.com. \n•\tDeveloped a SAS-based time series model to monitor daily room nights over time thereby measuring potential negative impacts of untested changes to Marriott.com. Analytics Senior Consultant Deloitte May 2011  –  April 2013  (2 years) Washington, DC Accounting, Valuation, & Analytics (AVA) Senior Consultant \n•\tManaged and reviewed the work of five junior staff on overlapping client engagements. \n•\tLed status and budget meetings keeping everyone on task and under budget. \n•\tTaught a number of statistical concepts (for example, sampling and estimation methodology, Risk Intelligent Modeling, coding standards and regression basics) \n•\tAdministered technical interviews on potential Deloitte new hires to streamline the hiring process. \n \nAVA Consultant \n•\tPerformed regression analytics on a regular basis as a high level check for revenue estimates. \n•\tSampled data and extrapolated results for auditing purposes (including SOX and IPERA work). \n•\tOther analyses included data reconciliation, frame and sample comparisons, and sampling methodology reviews. Mathematical Statistician US Census Bureau October 2008  –  May 2011  (2 years 8 months) Government Division - Statistical Research and Methodology Area - Program Research Branch \n•\tRedesigned cut-off based samples for the Annual Survey of Public Employment and Payroll and the Annual Survey of State and Local Government Finance in order to reduce overall sample size. \n•\tImplemented decision-based estimation for cut-off sampling that improved precision of estimates. \n•\tSupervised Joint Program in Survey Methodology fellow in the production of estimates for Louisiana’s 2006 Public Employment Survey. Statistics Graduate Research Assistant University of Vermont January 2006  –  September 2008  (2 years 9 months) Senior Manager, Digital Analytics Marriott International April 2013  – Present (2 years 5 months) Bethesda, MD Senior Manager - Merchandising and Booking (April, 2015 - present) \n•\tDevelop weekly Tableau driven dashboards and reports for digital product line owners. \n•\tIdentify opportunities for improving merchandising, conversion rates, and customer engagement through statistical analysis. \n \nManager - Digital Experimentation (April, 2013 - April, 2015) \n•\tIncreased bookings and Marriott Rewards enrollments by providing experiment design assistance and analyzing test results for all A/B and multivariate tests on Marriott.com. \n•\tResearched and introduced an Alpha Spending Model to understand when tests should be ended early due to strong negative (or positive) performance. \n•\tProgrammed a VBA-driven test traffic calculator so that product lines may determine test traffic needs dependent on a series of constraints. \n•\tCreated Tableau dashboards and monthly release reports to pre/post measure large impacts of release changes to Marriott.com. \n•\tDeveloped a SAS-based time series model to monitor daily room nights over time thereby measuring potential negative impacts of untested changes to Marriott.com. Senior Manager, Digital Analytics Marriott International April 2013  – Present (2 years 5 months) Bethesda, MD Senior Manager - Merchandising and Booking (April, 2015 - present) \n•\tDevelop weekly Tableau driven dashboards and reports for digital product line owners. \n•\tIdentify opportunities for improving merchandising, conversion rates, and customer engagement through statistical analysis. \n \nManager - Digital Experimentation (April, 2013 - April, 2015) \n•\tIncreased bookings and Marriott Rewards enrollments by providing experiment design assistance and analyzing test results for all A/B and multivariate tests on Marriott.com. \n•\tResearched and introduced an Alpha Spending Model to understand when tests should be ended early due to strong negative (or positive) performance. \n•\tProgrammed a VBA-driven test traffic calculator so that product lines may determine test traffic needs dependent on a series of constraints. \n•\tCreated Tableau dashboards and monthly release reports to pre/post measure large impacts of release changes to Marriott.com. \n•\tDeveloped a SAS-based time series model to monitor daily room nights over time thereby measuring potential negative impacts of untested changes to Marriott.com. Analytics Senior Consultant Deloitte May 2011  –  April 2013  (2 years) Washington, DC Accounting, Valuation, & Analytics (AVA) Senior Consultant \n•\tManaged and reviewed the work of five junior staff on overlapping client engagements. \n•\tLed status and budget meetings keeping everyone on task and under budget. \n•\tTaught a number of statistical concepts (for example, sampling and estimation methodology, Risk Intelligent Modeling, coding standards and regression basics) \n•\tAdministered technical interviews on potential Deloitte new hires to streamline the hiring process. \n \nAVA Consultant \n•\tPerformed regression analytics on a regular basis as a high level check for revenue estimates. \n•\tSampled data and extrapolated results for auditing purposes (including SOX and IPERA work). \n•\tOther analyses included data reconciliation, frame and sample comparisons, and sampling methodology reviews. Analytics Senior Consultant Deloitte May 2011  –  April 2013  (2 years) Washington, DC Accounting, Valuation, & Analytics (AVA) Senior Consultant \n•\tManaged and reviewed the work of five junior staff on overlapping client engagements. \n•\tLed status and budget meetings keeping everyone on task and under budget. \n•\tTaught a number of statistical concepts (for example, sampling and estimation methodology, Risk Intelligent Modeling, coding standards and regression basics) \n•\tAdministered technical interviews on potential Deloitte new hires to streamline the hiring process. \n \nAVA Consultant \n•\tPerformed regression analytics on a regular basis as a high level check for revenue estimates. \n•\tSampled data and extrapolated results for auditing purposes (including SOX and IPERA work). \n•\tOther analyses included data reconciliation, frame and sample comparisons, and sampling methodology reviews. Mathematical Statistician US Census Bureau October 2008  –  May 2011  (2 years 8 months) Government Division - Statistical Research and Methodology Area - Program Research Branch \n•\tRedesigned cut-off based samples for the Annual Survey of Public Employment and Payroll and the Annual Survey of State and Local Government Finance in order to reduce overall sample size. \n•\tImplemented decision-based estimation for cut-off sampling that improved precision of estimates. \n•\tSupervised Joint Program in Survey Methodology fellow in the production of estimates for Louisiana’s 2006 Public Employment Survey. Mathematical Statistician US Census Bureau October 2008  –  May 2011  (2 years 8 months) Government Division - Statistical Research and Methodology Area - Program Research Branch \n•\tRedesigned cut-off based samples for the Annual Survey of Public Employment and Payroll and the Annual Survey of State and Local Government Finance in order to reduce overall sample size. \n•\tImplemented decision-based estimation for cut-off sampling that improved precision of estimates. \n•\tSupervised Joint Program in Survey Methodology fellow in the production of estimates for Louisiana’s 2006 Public Employment Survey. Statistics Graduate Research Assistant University of Vermont January 2006  –  September 2008  (2 years 9 months) Statistics Graduate Research Assistant University of Vermont January 2006  –  September 2008  (2 years 9 months) Skills SAS R SPSS Excel Minitab LaTeX PowerPoint Word Mathematica ACL Microsoft Excel Data Management Statistical Modeling Research Statistics Analytics SQL Data Analysis Project Management Analysis Leadership See 6+     See less Skills  SAS R SPSS Excel Minitab LaTeX PowerPoint Word Mathematica ACL Microsoft Excel Data Management Statistical Modeling Research Statistics Analytics SQL Data Analysis Project Management Analysis Leadership See 6+     See less SAS R SPSS Excel Minitab LaTeX PowerPoint Word Mathematica ACL Microsoft Excel Data Management Statistical Modeling Research Statistics Analytics SQL Data Analysis Project Management Analysis Leadership See 6+     See less SAS R SPSS Excel Minitab LaTeX PowerPoint Word Mathematica ACL Microsoft Excel Data Management Statistical Modeling Research Statistics Analytics SQL Data Analysis Project Management Analysis Leadership See 6+     See less Education University of Vermont M.Sc.,  Statistics 2006  – 2008 University of Vermont B.S.,  Mathematics 2002  – 2006 University of Vermont M.Sc.,  Statistics 2006  – 2008 University of Vermont M.Sc.,  Statistics 2006  – 2008 University of Vermont M.Sc.,  Statistics 2006  – 2008 University of Vermont B.S.,  Mathematics 2002  – 2006 University of Vermont B.S.,  Mathematics 2002  – 2006 University of Vermont B.S.,  Mathematics 2002  – 2006 Honors & Awards ", "Summary * More than 20 years of marketing &sales analytics experience including 12 years of experience in web/digital analytics.  \n* More than 3 years of experience managing an analytics team. \n* MBA in International Business. \n* Work experience in both B2C & B2B companies spanning various vertical markets such as telemarketing, financial services, telecommunications, software, insurance and promotional products. \n* Delivered revenue-enhancing insights ranging from $2-$10 million by combining technology, analytics, management and strategic thinking talent with ROI mindset. \n* Experience in onsite/client/internal consulting. \n* Beyond click-stream thinking & comfortable working with other data types like big data, transactional, demographics, surveys & more.  \n* Experience using all major enterprise level web analytics tools.  \n* Expert in establishing tracking, reporting, analysis and testing/optimization frameworks/best practices. \n* MIT certified Big Data professional. \n* Stanford certified Machine Learning expert. Summary * More than 20 years of marketing &sales analytics experience including 12 years of experience in web/digital analytics.  \n* More than 3 years of experience managing an analytics team. \n* MBA in International Business. \n* Work experience in both B2C & B2B companies spanning various vertical markets such as telemarketing, financial services, telecommunications, software, insurance and promotional products. \n* Delivered revenue-enhancing insights ranging from $2-$10 million by combining technology, analytics, management and strategic thinking talent with ROI mindset. \n* Experience in onsite/client/internal consulting. \n* Beyond click-stream thinking & comfortable working with other data types like big data, transactional, demographics, surveys & more.  \n* Experience using all major enterprise level web analytics tools.  \n* Expert in establishing tracking, reporting, analysis and testing/optimization frameworks/best practices. \n* MIT certified Big Data professional. \n* Stanford certified Machine Learning expert. * More than 20 years of marketing &sales analytics experience including 12 years of experience in web/digital analytics.  \n* More than 3 years of experience managing an analytics team. \n* MBA in International Business. \n* Work experience in both B2C & B2B companies spanning various vertical markets such as telemarketing, financial services, telecommunications, software, insurance and promotional products. \n* Delivered revenue-enhancing insights ranging from $2-$10 million by combining technology, analytics, management and strategic thinking talent with ROI mindset. \n* Experience in onsite/client/internal consulting. \n* Beyond click-stream thinking & comfortable working with other data types like big data, transactional, demographics, surveys & more.  \n* Experience using all major enterprise level web analytics tools.  \n* Expert in establishing tracking, reporting, analysis and testing/optimization frameworks/best practices. \n* MIT certified Big Data professional. \n* Stanford certified Machine Learning expert. * More than 20 years of marketing &sales analytics experience including 12 years of experience in web/digital analytics.  \n* More than 3 years of experience managing an analytics team. \n* MBA in International Business. \n* Work experience in both B2C & B2B companies spanning various vertical markets such as telemarketing, financial services, telecommunications, software, insurance and promotional products. \n* Delivered revenue-enhancing insights ranging from $2-$10 million by combining technology, analytics, management and strategic thinking talent with ROI mindset. \n* Experience in onsite/client/internal consulting. \n* Beyond click-stream thinking & comfortable working with other data types like big data, transactional, demographics, surveys & more.  \n* Experience using all major enterprise level web analytics tools.  \n* Expert in establishing tracking, reporting, analysis and testing/optimization frameworks/best practices. \n* MIT certified Big Data professional. \n* Stanford certified Machine Learning expert. Experience Senior Manager (Digital Analytics) JPMorgan Chase December 2011  – Present (3 years 9 months) wilmington, Delaware Managed digital analytics for Ultimate Rewards. Web Analytics Consultant 21st Century Insurance April 2011  –  September 2011  (6 months) Wilmington, Delaware Managed the web analytics continuous improvement process including Tracking, Reporting, Analyzing and Optimizing of company’s web channel. Global Web Analytics Manager Myron Manufacturing May 2010  –  March 2011  (11 months) Managed Web Analytics globally including US, Canada, UK and Germany. Web Analytics Manager Saveology.com ™ April 2009  –  April 2010  (1 year 1 month) Managed the whole online continuous process improvement of tracking, reporting , analyzing and testing for more than 30 websites. Web Analytics Manager BitDefender October 2006  –  March 2009  (2 years 6 months) Managed Web Analytics globally including US, Canada, UK and Germany. Senior Manager (Digital Analytics) JPMorgan Chase December 2011  – Present (3 years 9 months) wilmington, Delaware Managed digital analytics for Ultimate Rewards. Senior Manager (Digital Analytics) JPMorgan Chase December 2011  – Present (3 years 9 months) wilmington, Delaware Managed digital analytics for Ultimate Rewards. Web Analytics Consultant 21st Century Insurance April 2011  –  September 2011  (6 months) Wilmington, Delaware Managed the web analytics continuous improvement process including Tracking, Reporting, Analyzing and Optimizing of company’s web channel. Web Analytics Consultant 21st Century Insurance April 2011  –  September 2011  (6 months) Wilmington, Delaware Managed the web analytics continuous improvement process including Tracking, Reporting, Analyzing and Optimizing of company’s web channel. Global Web Analytics Manager Myron Manufacturing May 2010  –  March 2011  (11 months) Managed Web Analytics globally including US, Canada, UK and Germany. Global Web Analytics Manager Myron Manufacturing May 2010  –  March 2011  (11 months) Managed Web Analytics globally including US, Canada, UK and Germany. Web Analytics Manager Saveology.com ™ April 2009  –  April 2010  (1 year 1 month) Managed the whole online continuous process improvement of tracking, reporting , analyzing and testing for more than 30 websites. Web Analytics Manager Saveology.com ™ April 2009  –  April 2010  (1 year 1 month) Managed the whole online continuous process improvement of tracking, reporting , analyzing and testing for more than 30 websites. Web Analytics Manager BitDefender October 2006  –  March 2009  (2 years 6 months) Managed Web Analytics globally including US, Canada, UK and Germany. Web Analytics Manager BitDefender October 2006  –  March 2009  (2 years 6 months) Managed Web Analytics globally including US, Canada, UK and Germany. Languages Tamil Tamil Tamil Skills Web Analytics Online Optimization ecommerce Big Data CRM Analytics Digital Analytics Marketing Analytics Skills  Web Analytics Online Optimization ecommerce Big Data CRM Analytics Digital Analytics Marketing Analytics Web Analytics Online Optimization ecommerce Big Data CRM Analytics Digital Analytics Marketing Analytics Web Analytics Online Optimization ecommerce Big Data CRM Analytics Digital Analytics Marketing Analytics Education Florida Atlantic University MBA,  International Business 2008  – 2010 St. Mary's University M.S.,  Industrial Engineering 1992  – 1994 Anna University Production Engineering 1988  – 1992 Florida Atlantic University MBA,  International Business 2008  – 2010 Florida Atlantic University MBA,  International Business 2008  – 2010 Florida Atlantic University MBA,  International Business 2008  – 2010 St. Mary's University M.S.,  Industrial Engineering 1992  – 1994 St. Mary's University M.S.,  Industrial Engineering 1992  – 1994 St. Mary's University M.S.,  Industrial Engineering 1992  – 1994 Anna University Production Engineering 1988  – 1992 Anna University Production Engineering 1988  – 1992 Anna University Production Engineering 1988  – 1992 "]}