{"position": "Senior Producer", "company": "Google", "profiles": ["Experience Senior Producer msnbc November 2012  – Present (2 years 10 months) New York, NY Producing for \"Your Business\" Line/Field Producer msnbc March 2008  –  November 2012  (4 years 9 months) New York, NY Producing for \"Your Business\" Segment Producer msnbc March 2003  –  March 2008  (5 years 1 month) New York, NY Produced for various dayside and primetime programs Writer/Producer Fox News March 2004  –  July 2004  (5 months) New York. NY Produced for Fox News Edge Anchor/Reporter/Producer WBOY-TV September 1999  –  October 2002  (3 years 2 months) Clarksburg, WV Anchor/Reporter/Producer KOMU-TV March 1998  –  September 1999  (1 year 7 months) Columbia, MO Senior Producer msnbc November 2012  – Present (2 years 10 months) New York, NY Producing for \"Your Business\" Senior Producer msnbc November 2012  – Present (2 years 10 months) New York, NY Producing for \"Your Business\" Line/Field Producer msnbc March 2008  –  November 2012  (4 years 9 months) New York, NY Producing for \"Your Business\" Line/Field Producer msnbc March 2008  –  November 2012  (4 years 9 months) New York, NY Producing for \"Your Business\" Segment Producer msnbc March 2003  –  March 2008  (5 years 1 month) New York, NY Produced for various dayside and primetime programs Segment Producer msnbc March 2003  –  March 2008  (5 years 1 month) New York, NY Produced for various dayside and primetime programs Writer/Producer Fox News March 2004  –  July 2004  (5 months) New York. NY Produced for Fox News Edge Writer/Producer Fox News March 2004  –  July 2004  (5 months) New York. NY Produced for Fox News Edge Anchor/Reporter/Producer WBOY-TV September 1999  –  October 2002  (3 years 2 months) Clarksburg, WV Anchor/Reporter/Producer WBOY-TV September 1999  –  October 2002  (3 years 2 months) Clarksburg, WV Anchor/Reporter/Producer KOMU-TV March 1998  –  September 1999  (1 year 7 months) Columbia, MO Anchor/Reporter/Producer KOMU-TV March 1998  –  September 1999  (1 year 7 months) Columbia, MO Skills Breaking News Producing Skills  Breaking News Producing Breaking News Producing Breaking News Producing Education University of Missouri-Columbia 1995  – 1999 Pelham Memorial High School 1991  – 1995 University of Missouri-Columbia 1995  – 1999 University of Missouri-Columbia 1995  – 1999 University of Missouri-Columbia 1995  – 1999 Pelham Memorial High School 1991  – 1995 Pelham Memorial High School 1991  – 1995 Pelham Memorial High School 1991  – 1995 ", "Experience Line Producer and Field Producer for MSNBC Live with Thomas Roberts MSNBC February 2015  – Present (7 months) New York, NY Currently Line Producer, Field Producer, and Package Producer for MSNBC Live with Thomas Roberts. In this role, produced live coverage of the Baltimore Riots and the Charleston. Producer and Field Producer for Ronan Farrow Daily MSNBC January 2014  –  February 2015  (1 year 2 months) New York, NY Producer, writer, and control room producer for Ronan Farrow Daily. Produced live breaking coverage in the field of the Ebola outbreak in Dallas. Also produced Ronan Farrow's exclusive interview with Nobel Peace Prize winner Malala Yousefzai. Producer of Presumed Guilty Series MSNBC June 2013  –  February 2014  (9 months) Greater New York City Area Producer of the Presumed Guilty Series with Ari Melber. This series took a deep dive into the racial inequities in the American justice system. The series culminated in an exclusive sit down interview with then Attorney General Eric Holder. Line Producer for MSNBC Live MSNBC December 2011  –  January 2014  (2 years 2 months) Greater New York City Area Line Producer and Segment Producer for MSNBC Live. In the control room helping to lead breaking coverage of the 2014 Supreme Court decisions on the Affordable Care Act, DOMA, and Prop 8. Produced Richard Lui's sit down interview with Former President Jimmy Carter. Executive Producer WFSB TV November 2006  –  November 2011  (5 years 1 month) Hartford, Connecticut Area Executive Producer across all day parts for WFSB TV. Oversaw morning, noon, evening, and late shows, in addition to weekends. Managed a staff of 20 producers, associate producers and writers. Producer WFSB TV November 2004  –  November 2006  (2 years 1 month) Hartford, Connecticut Area 6am and then 5pm producer for WFSB. Lead special coverage of the Senate Race in 2006 during Lieberman’s Independent run for office. Producer WBOC-TV October 2002  –  October 2004  (2 years 1 month) Salisbury, MD Producer for WBOC-TV's 6pm Newscast. Line Producer and Field Producer for MSNBC Live with Thomas Roberts MSNBC February 2015  – Present (7 months) New York, NY Currently Line Producer, Field Producer, and Package Producer for MSNBC Live with Thomas Roberts. In this role, produced live coverage of the Baltimore Riots and the Charleston. Line Producer and Field Producer for MSNBC Live with Thomas Roberts MSNBC February 2015  – Present (7 months) New York, NY Currently Line Producer, Field Producer, and Package Producer for MSNBC Live with Thomas Roberts. In this role, produced live coverage of the Baltimore Riots and the Charleston. Producer and Field Producer for Ronan Farrow Daily MSNBC January 2014  –  February 2015  (1 year 2 months) New York, NY Producer, writer, and control room producer for Ronan Farrow Daily. Produced live breaking coverage in the field of the Ebola outbreak in Dallas. Also produced Ronan Farrow's exclusive interview with Nobel Peace Prize winner Malala Yousefzai. Producer and Field Producer for Ronan Farrow Daily MSNBC January 2014  –  February 2015  (1 year 2 months) New York, NY Producer, writer, and control room producer for Ronan Farrow Daily. Produced live breaking coverage in the field of the Ebola outbreak in Dallas. Also produced Ronan Farrow's exclusive interview with Nobel Peace Prize winner Malala Yousefzai. Producer of Presumed Guilty Series MSNBC June 2013  –  February 2014  (9 months) Greater New York City Area Producer of the Presumed Guilty Series with Ari Melber. This series took a deep dive into the racial inequities in the American justice system. The series culminated in an exclusive sit down interview with then Attorney General Eric Holder. Producer of Presumed Guilty Series MSNBC June 2013  –  February 2014  (9 months) Greater New York City Area Producer of the Presumed Guilty Series with Ari Melber. This series took a deep dive into the racial inequities in the American justice system. The series culminated in an exclusive sit down interview with then Attorney General Eric Holder. Line Producer for MSNBC Live MSNBC December 2011  –  January 2014  (2 years 2 months) Greater New York City Area Line Producer and Segment Producer for MSNBC Live. In the control room helping to lead breaking coverage of the 2014 Supreme Court decisions on the Affordable Care Act, DOMA, and Prop 8. Produced Richard Lui's sit down interview with Former President Jimmy Carter. Line Producer for MSNBC Live MSNBC December 2011  –  January 2014  (2 years 2 months) Greater New York City Area Line Producer and Segment Producer for MSNBC Live. In the control room helping to lead breaking coverage of the 2014 Supreme Court decisions on the Affordable Care Act, DOMA, and Prop 8. Produced Richard Lui's sit down interview with Former President Jimmy Carter. Executive Producer WFSB TV November 2006  –  November 2011  (5 years 1 month) Hartford, Connecticut Area Executive Producer across all day parts for WFSB TV. Oversaw morning, noon, evening, and late shows, in addition to weekends. Managed a staff of 20 producers, associate producers and writers. Executive Producer WFSB TV November 2006  –  November 2011  (5 years 1 month) Hartford, Connecticut Area Executive Producer across all day parts for WFSB TV. Oversaw morning, noon, evening, and late shows, in addition to weekends. Managed a staff of 20 producers, associate producers and writers. Producer WFSB TV November 2004  –  November 2006  (2 years 1 month) Hartford, Connecticut Area 6am and then 5pm producer for WFSB. Lead special coverage of the Senate Race in 2006 during Lieberman’s Independent run for office. Producer WFSB TV November 2004  –  November 2006  (2 years 1 month) Hartford, Connecticut Area 6am and then 5pm producer for WFSB. Lead special coverage of the Senate Race in 2006 during Lieberman’s Independent run for office. Producer WBOC-TV October 2002  –  October 2004  (2 years 1 month) Salisbury, MD Producer for WBOC-TV's 6pm Newscast. Producer WBOC-TV October 2002  –  October 2004  (2 years 1 month) Salisbury, MD Producer for WBOC-TV's 6pm Newscast. Skills Television Field Production Writing Video Production Broadcast Video Post Production Video Editing Media Production Live TV Production Crisis Management Skills  Television Field Production Writing Video Production Broadcast Video Post Production Video Editing Media Production Live TV Production Crisis Management Television Field Production Writing Video Production Broadcast Video Post Production Video Editing Media Production Live TV Production Crisis Management Television Field Production Writing Video Production Broadcast Video Post Production Video Editing Media Production Live TV Production Crisis Management Education James Madison University Bachelor of Arts (B.A.),  Media Arts and Design 1998  – 2002 British Institute of Florence, Italy 1997 James Madison University Bachelor of Arts (B.A.),  Media Arts and Design 1998  – 2002 James Madison University Bachelor of Arts (B.A.),  Media Arts and Design 1998  – 2002 James Madison University Bachelor of Arts (B.A.),  Media Arts and Design 1998  – 2002 British Institute of Florence, Italy 1997 British Institute of Florence, Italy 1997 British Institute of Florence, Italy 1997 ", "Experience Senior Producer MSNBC August 2014  – Present (1 year 1 month) Line Producer MSNBC June 2013  –  August 2014  (1 year 3 months) 30 ROck Segment Producer - MSNBC MSNBC March 2011  –  June 2013  (2 years 4 months) 30 Rockefeller Center Segment Producer for NOW with Alex Wagner Associate Producer NBC News January 2009  –  October 2011  (2 years 10 months) AP for The Early Today Show Production Assistant MSNBC May 2008  –  December 2008  (8 months) PA for Race for the White House Page NBC September 2007  –  May 2008  (9 months) 30 Rockefeller Plaza NBC Page Program Radio Producer United Nations May 2006  –  August 2006  (4 months) New York, NY Produce stories for the U.N. Radio News Service Senior Producer MSNBC August 2014  – Present (1 year 1 month) Senior Producer MSNBC August 2014  – Present (1 year 1 month) Line Producer MSNBC June 2013  –  August 2014  (1 year 3 months) 30 ROck Line Producer MSNBC June 2013  –  August 2014  (1 year 3 months) 30 ROck Segment Producer - MSNBC MSNBC March 2011  –  June 2013  (2 years 4 months) 30 Rockefeller Center Segment Producer for NOW with Alex Wagner Segment Producer - MSNBC MSNBC March 2011  –  June 2013  (2 years 4 months) 30 Rockefeller Center Segment Producer for NOW with Alex Wagner Associate Producer NBC News January 2009  –  October 2011  (2 years 10 months) AP for The Early Today Show Associate Producer NBC News January 2009  –  October 2011  (2 years 10 months) AP for The Early Today Show Production Assistant MSNBC May 2008  –  December 2008  (8 months) PA for Race for the White House Production Assistant MSNBC May 2008  –  December 2008  (8 months) PA for Race for the White House Page NBC September 2007  –  May 2008  (9 months) 30 Rockefeller Plaza NBC Page Program Page NBC September 2007  –  May 2008  (9 months) 30 Rockefeller Plaza NBC Page Program Radio Producer United Nations May 2006  –  August 2006  (4 months) New York, NY Produce stories for the U.N. Radio News Service Radio Producer United Nations May 2006  –  August 2006  (4 months) New York, NY Produce stories for the U.N. Radio News Service Skills Video Production Journalism Avid Television Final Cut Pro Breaking News Digital Media Storytelling Skills  Video Production Journalism Avid Television Final Cut Pro Breaking News Digital Media Storytelling Video Production Journalism Avid Television Final Cut Pro Breaking News Digital Media Storytelling Video Production Journalism Avid Television Final Cut Pro Breaking News Digital Media Storytelling Education The Johns Hopkins University BA,  Writing 2003  – 2007 The Johns Hopkins University BA,  Writing 2003  – 2007 The Johns Hopkins University BA,  Writing 2003  – 2007 The Johns Hopkins University BA,  Writing 2003  – 2007 ", "Summary Feature film Director and experienced television and new media Producer Suzanne's work has been seen on both the big screen and small. From broadcast networks, first tier cable channels and the web, Suzanne's passion for creating compelling factual programs and documentaries has won her multiple awards including two Emmy's, several Gracies, an Omni-Media award and Cine Golden Eagle. Tapping her talent as a broadcast producer, Suzanne has also been crafting compelling shorts for the web that are directly tied to branded entertainment. \n \nSpecialties: Negotiate production rates with talent, crews and technicians throughout the U.S. - Live studio production experience. Create, oversee and maintain multi-million dollar production budgets. Connected with a wide range of DP's, LD's, editors, post facilities, graphic artists, writers, producers and production personnel. Summary Feature film Director and experienced television and new media Producer Suzanne's work has been seen on both the big screen and small. From broadcast networks, first tier cable channels and the web, Suzanne's passion for creating compelling factual programs and documentaries has won her multiple awards including two Emmy's, several Gracies, an Omni-Media award and Cine Golden Eagle. Tapping her talent as a broadcast producer, Suzanne has also been crafting compelling shorts for the web that are directly tied to branded entertainment. \n \nSpecialties: Negotiate production rates with talent, crews and technicians throughout the U.S. - Live studio production experience. Create, oversee and maintain multi-million dollar production budgets. Connected with a wide range of DP's, LD's, editors, post facilities, graphic artists, writers, producers and production personnel. Feature film Director and experienced television and new media Producer Suzanne's work has been seen on both the big screen and small. From broadcast networks, first tier cable channels and the web, Suzanne's passion for creating compelling factual programs and documentaries has won her multiple awards including two Emmy's, several Gracies, an Omni-Media award and Cine Golden Eagle. Tapping her talent as a broadcast producer, Suzanne has also been crafting compelling shorts for the web that are directly tied to branded entertainment. \n \nSpecialties: Negotiate production rates with talent, crews and technicians throughout the U.S. - Live studio production experience. Create, oversee and maintain multi-million dollar production budgets. Connected with a wide range of DP's, LD's, editors, post facilities, graphic artists, writers, producers and production personnel. Feature film Director and experienced television and new media Producer Suzanne's work has been seen on both the big screen and small. From broadcast networks, first tier cable channels and the web, Suzanne's passion for creating compelling factual programs and documentaries has won her multiple awards including two Emmy's, several Gracies, an Omni-Media award and Cine Golden Eagle. Tapping her talent as a broadcast producer, Suzanne has also been crafting compelling shorts for the web that are directly tied to branded entertainment. \n \nSpecialties: Negotiate production rates with talent, crews and technicians throughout the U.S. - Live studio production experience. Create, oversee and maintain multi-million dollar production budgets. Connected with a wide range of DP's, LD's, editors, post facilities, graphic artists, writers, producers and production personnel. Experience Director Running Wild: The Life of Dayton O. Hyde 2013  – Present (2 years) New York, NY Directed and produced this feature length documentary that ran in theaters nationwide about the life of an award-winning writer, conservationist, and cowboy. Film won several awards including audience favorite at Sarasota Film Festival and Best Documentary and received critical acclaim from The New York Times, LA Times, and the Village Voice. Producer/Director Hearst 2012  – Present (3 years) Created a YouTube web series expanding brand's reach beyond traditional print subscriptions. Worked with Car & Drive, Popular Mechanics, Road and Track to produce educational videos for consumers and professionals in the auto industry. Creating Instagram and hosted web videos for Hearst Digital Media and the clients they service. Work closely with Hearst marketing executives and ad sales clients to conceive and execute original concepts that help drive sales of consumer products. Owner, Producer Full Motion Pictures, Inc. March 2007  – Present (8 years 6 months) Independent producer creating compelling programs for broadcast networks, cable and the web. Project Archivist Forest City Ratner Companies January 2014  –  September 2014  (9 months) Brooklyn, NY Created a media archive, which includes key interviews, pertaining to the creation of the Barclays Center and The Atlantic Yards project. Barclays Center is a premiere sports and entertainment arena located in the heart of Brooklyn, New York. Supervising Producer, “Indian Motorcycles Heritage & Reveal” The History Channel 2013  –  2013  (less than a year) Researched, developed, wrote scripts, and acquired archival footage pertaining to the history of Indian Motorcycle for a 3 part branded series sponsored by Indian Motorcyle for History’s series America Pickers. Producer Cabin Creek Films / Barbara Kopple 2011  –  2013  (2 years) Successfully documented high profile international and national news stories as they unfolded without interfering with the reporter process or compromising journalistic integrity. Created unprecedented levels of trust with journalists that resulted in additional documentary partnerships. \n(“Hot Type: 150 Years if The Nation”)  \n \nNavigated production difficulties in environments experiencing instability due to war and natural disasters to tell the story of humanitarian efforts in Southern Sudan. (“A Force of Nature”) Producer, “50th Anniversary of the Freedom Riders” The Oprah Winfrey Show 2010  –  2011  (1 year) Produced anniversary special that celebrating the people involved in the Freedom Rides and the historic significance of this event that kick-started the civil rights movement of the 1960’s. Interviewed and visited both civil rights leaders and reconstructed locals from Montgomery, Anniston and Birmingham, Alabama. Examined how race relations in the South changed since 1961. Supervising Producer, “Decoded Porsche Mini-Docs” The History Channel 2010  –  2010  (less than a year) For Red Thread Productions, supervised the production and post production budget, schedule, crew, travel and interviews for 5-episode mini-documentary series sponsored by Porsche for History’s series Decoded. Executive in Charge, Undeletable Productions A&E Television 2010  –  2010  (less than a year) Shot A&E pilot on location in Miami as lead-up to a new docu-series which explores the world of tennis. Live Conference Producer, \"SAP Sapphire NOW\" SAP 2010  –  2010  (less than a year) Created on the spot technology news programming that was a mix of traditional television, social media, keynote speakers, panel discussions and technology, all simulcast to Germany and cities throughout the US and on the web from the conference center in Orlando, Florida. Production included writing scripts, interviewing corporate clients and creating content for products first introduced at the conference. Promotions Producer, \"Damages\" and \"Lights Out\" FX Networks 2008  –  2010  (2 years) Directed segments to support second season of award winning “Damages.” Worked with Glenn Close and William Hurt and entire cast while creating segments for promotional release. Supervising Producer, \"Woodstock Now & Then\" VH1 2009  –  2009  (less than a year) Produced 2 hour documentary celebrating Woodstock 1969, capturing interviews with classic and current musical artists who helped define an era. Won Cine Golden Eagle and was nominated for an Emmy. Supervising Producer, \"BOA Mini-Docs Series\" Bank of America 2009  –  2009  (less than a year) Supervised the production and post production budget, schedule, crew, travel and interviews for a 12- episode mini-documentary series sponsored by Bank of America for History’s epic series America The Story of Us. Webisodes Producer, \"Rescue Me - Season 5\" Sony Pictures Entertainment 2008  –  2009  (1 year) Directed segments to support season five for both Sony’s DVD release and “Rescue Me” web. Producer The Oprah Winfrey Show 1996  –  2009  (13 years) Recruited to Chicago to create programming and segments for The Oprah Winfrey Show. From 1997 through 2009 continued to work as a NY based producer for the talk show. Producer, Peacock Productions, \"I Married A...\" NBC News 2008  –  2008  (less than a year) Produced one-hour Lifetime TV pilot depictng the life of a woman married to a serial killer. Gained exclusive access to wife of Green River Killer. Show Runner, \"The Hugh Thompson Show\" AT&T 2006  –  2008  (2 years) Created compelling content to promote AT&T’s security products and corporate brand. Developed, booked and produced webisodes for this ground breaking high-tech, variety-talk show shot before a live audience and introduced on http://techchannel.att.com. Supervised series dedicated to science and technology news and entertainment destined for AT&T’s three screens: wireless, pc, ipTV. Managed production budgets for multi-level platform advertising model. Oversaw 60+ hours of content. Studio Producer, “The Big Idea” and \"On The Money” CNBC 2006  –  2008  (2 years) Produced live to tape shows for Donny Deutsch and Carmen Wong Ulrich of CNBC. Created undercover, business and celebrity programming for The Big Idea and consumer finance support and help for \"On The Money.\" Producer The Oprah Winfrey Show OPRAH.COM 2006  –  2006  (less than a year) Directed segments for Oprah.com style section. Worked with a major department store, style experts and models to demonstrate the do’s and don’ts of basic female and male wardrobes. Creator/Director/Producer Public Broadcasting Service 2002  –  2006  (4 years) Developed and produced 6 award winning cinema vérité documentaries: \n“Grab Hold of the Reins” (women fighting breast & ovarian cancer) – Gracie Allen Award  \n“Proud To Be A Girl” (girls and self-esteem) – Emmy Award  \n“Choices Over A Lifetime” (women’s life choices)  \n“Phenomenal Voyage” (women and technology)  \n“Pure Magic” The Mother / Daughter Bond” – Gracie Allen Award  \n“The Power of Integrity” (women who rise to the top in the corporate world) Executive Producer, \"Fatal Fathers\" A&E Television 2005  –  2005  (less than a year) Produced one-hour documentary hosted by Bill Curtis exploring the little known fact that murder is the number one cause of death among pregnant women. Show Runner, \"Fashion Police\" / Field Producer, \"Isaac\" E! Networks 2005  –  2005  (less than a year) Supervised and managed a staff of producers and field producers for a weekly \"Fashion Police\" series featured on the Style Network. Field produced \"Issac,\" hosted by Isaac Mizrahi featuring man-on-the-street interviews, \"Sketches and Answers\" and celebrity interviews. Post-Producer, Ellen Warner Bros. Entertainment Group of Companies 2005  –  2005  (less than a year) Worked with entire production staff of “The Ellen Degeneres Show” to create and maintain post production schedule for a series of location shows that were shot in NYC. Content Originator/Producer, \"New Morning\" and Producer, \"The Way Home: Stories of Forgiveness\" Hallmark Channel 2004  –  2005  (1 year) Produced daily morning show hosted by Naomi Judd. This program introduced audiences to people who practice spirituality throughout their everyday lives. \n \nProduced a powerful documentary narrated by Glenn Close, which follows a town split in two, a father and son, a murderer and his victim's wife, as they all learn to forgive. Omni Intermedia Award Producer, \"The Belzer Connection SciFi NonFi 2003  –  2003  (less than a year) Produced program dissecting the conspiracy theory surrounding Princess Diana's death, hosted by Richard Belzer. Producer, “I Married Sammy Hagar” VH-1 2003  –  2003  (less than a year) Produced documentary where Kari and Sammy Hagar invite viewes into their lives in beautiful Cabo San Lucas, Mexico. Producer, \"The Hamptons,\" Cabin Creek Films/Barbara Kopple ABC Television 2001  –  2001  (less than a year) Produced cinema vérité 4-hour special documenting the people and places of The Hamptons. Producer, \"Intimate Portrait\" Lifetime Television 2001  –  2001  (less than a year) One-hour biography of actress Barbara Eden. Producer, \"HomePage\" & \"Day Side News' MSNBC 2000  –  2001  (1 year) New York Produced segments for groundbreaking female hosted, daily, live, three-hour, news program with Ashleigh Banfield, Mika Brzezinski and Gina Gaston. Created parenting, lifestyle, home Improvement studio and field segments for daily live news show. Produced live studio and remote segments for daily network news. Supervising Producer, \"G-String Divas\" HBO 1999  –  2000  (1 year) Produced 13-episodic documentary series exploring the lives of strippers working and living in Pennsylvania and Puerto Rico, and presenting viewers with a rare look inside the exotic entertainment industry. Created and managed multi-million dollar budget. Producer, \"B. Smith with Style\" Hearst Magazines 1999  –  1999  (less than a year) Directed segments on gardening, home, cooking and crafts for a syndicated home show. Producer, “Biography of the Millennium” A&E Television 1998  –  1999  (1 year) Produced 4-hour documentary profiling 100 of the most influential people of the last 1000 years. Interviewed prestigious individuals from both the entertainment and political arena while combining eyewitness accounts with archival footage. Producer, “20th Century Project” ABC News 1997  –  1998  (1 year) 12 X 1 network documentary series that looks back at the 20th Century. Interviews included: Nuclear Physicist & Nobel Prize in Physics, Hans Bethe - Apple Co-founders, Steve Jobs & Steve Wozniak - Father of the Internet Vinton Cerf.- Time Magazine Man of the Year, Dr. David Ho. Producer, “President’s Summit for America’s Future” Cabin Creek Film, Barbara Kopple 1996  –  1997  (1 year) Directed short documentaries highlighting the accomplishments of a select group of volunteers throughout the U.S. and presented to Presidents Clinton, Bush, Ford and Carter. Producer, “New Passages” ABC Television 1996  –  1997  (1 year) Produced 2-hour network documentary special based on Gail Sheehy’s bestselling book “Passages”. Director, “Two Hot Tamales Mexican Food Documentary” Food Network UK 1996  –  1997  (1 year) Conceptualized and directed 2 one-hour documentary specials showcasing authentic Mexican cuisine. Shot on location in remote locations: Merida and Oaxaca, Mexico. Producer King World 1996  –  1997  (1 year) Produced segments for syndicated talk show \"Rolonda\" Supervising Producer, “Catalog 1 Partners” and Producer, \"People Magazine 20th Anniversary Special\" Time Warner Inc. 1993  –  1996  (3 years) For \"Catalog 1\" managed a staff of producers, associate producers, production assistants for a series of life style programs. Created for the first fully interactive cable network. \n \nFor \"People Magazine, wrote and directed segments for CBS/ABC television entertainment specials. Field Producer/Producer Investigative News Group 1989  –  1992  (3 years) Produced for \"Geraldo\" syndicated talk show. Director Running Wild: The Life of Dayton O. Hyde 2013  – Present (2 years) New York, NY Directed and produced this feature length documentary that ran in theaters nationwide about the life of an award-winning writer, conservationist, and cowboy. Film won several awards including audience favorite at Sarasota Film Festival and Best Documentary and received critical acclaim from The New York Times, LA Times, and the Village Voice. Director Running Wild: The Life of Dayton O. Hyde 2013  – Present (2 years) New York, NY Directed and produced this feature length documentary that ran in theaters nationwide about the life of an award-winning writer, conservationist, and cowboy. Film won several awards including audience favorite at Sarasota Film Festival and Best Documentary and received critical acclaim from The New York Times, LA Times, and the Village Voice. Producer/Director Hearst 2012  – Present (3 years) Created a YouTube web series expanding brand's reach beyond traditional print subscriptions. Worked with Car & Drive, Popular Mechanics, Road and Track to produce educational videos for consumers and professionals in the auto industry. Creating Instagram and hosted web videos for Hearst Digital Media and the clients they service. Work closely with Hearst marketing executives and ad sales clients to conceive and execute original concepts that help drive sales of consumer products. Producer/Director Hearst 2012  – Present (3 years) Created a YouTube web series expanding brand's reach beyond traditional print subscriptions. Worked with Car & Drive, Popular Mechanics, Road and Track to produce educational videos for consumers and professionals in the auto industry. Creating Instagram and hosted web videos for Hearst Digital Media and the clients they service. Work closely with Hearst marketing executives and ad sales clients to conceive and execute original concepts that help drive sales of consumer products. Owner, Producer Full Motion Pictures, Inc. March 2007  – Present (8 years 6 months) Independent producer creating compelling programs for broadcast networks, cable and the web. Owner, Producer Full Motion Pictures, Inc. March 2007  – Present (8 years 6 months) Independent producer creating compelling programs for broadcast networks, cable and the web. Project Archivist Forest City Ratner Companies January 2014  –  September 2014  (9 months) Brooklyn, NY Created a media archive, which includes key interviews, pertaining to the creation of the Barclays Center and The Atlantic Yards project. Barclays Center is a premiere sports and entertainment arena located in the heart of Brooklyn, New York. Project Archivist Forest City Ratner Companies January 2014  –  September 2014  (9 months) Brooklyn, NY Created a media archive, which includes key interviews, pertaining to the creation of the Barclays Center and The Atlantic Yards project. Barclays Center is a premiere sports and entertainment arena located in the heart of Brooklyn, New York. Supervising Producer, “Indian Motorcycles Heritage & Reveal” The History Channel 2013  –  2013  (less than a year) Researched, developed, wrote scripts, and acquired archival footage pertaining to the history of Indian Motorcycle for a 3 part branded series sponsored by Indian Motorcyle for History’s series America Pickers. Supervising Producer, “Indian Motorcycles Heritage & Reveal” The History Channel 2013  –  2013  (less than a year) Researched, developed, wrote scripts, and acquired archival footage pertaining to the history of Indian Motorcycle for a 3 part branded series sponsored by Indian Motorcyle for History’s series America Pickers. Producer Cabin Creek Films / Barbara Kopple 2011  –  2013  (2 years) Successfully documented high profile international and national news stories as they unfolded without interfering with the reporter process or compromising journalistic integrity. Created unprecedented levels of trust with journalists that resulted in additional documentary partnerships. \n(“Hot Type: 150 Years if The Nation”)  \n \nNavigated production difficulties in environments experiencing instability due to war and natural disasters to tell the story of humanitarian efforts in Southern Sudan. (“A Force of Nature”) Producer Cabin Creek Films / Barbara Kopple 2011  –  2013  (2 years) Successfully documented high profile international and national news stories as they unfolded without interfering with the reporter process or compromising journalistic integrity. Created unprecedented levels of trust with journalists that resulted in additional documentary partnerships. \n(“Hot Type: 150 Years if The Nation”)  \n \nNavigated production difficulties in environments experiencing instability due to war and natural disasters to tell the story of humanitarian efforts in Southern Sudan. (“A Force of Nature”) Producer, “50th Anniversary of the Freedom Riders” The Oprah Winfrey Show 2010  –  2011  (1 year) Produced anniversary special that celebrating the people involved in the Freedom Rides and the historic significance of this event that kick-started the civil rights movement of the 1960’s. Interviewed and visited both civil rights leaders and reconstructed locals from Montgomery, Anniston and Birmingham, Alabama. Examined how race relations in the South changed since 1961. Producer, “50th Anniversary of the Freedom Riders” The Oprah Winfrey Show 2010  –  2011  (1 year) Produced anniversary special that celebrating the people involved in the Freedom Rides and the historic significance of this event that kick-started the civil rights movement of the 1960’s. Interviewed and visited both civil rights leaders and reconstructed locals from Montgomery, Anniston and Birmingham, Alabama. Examined how race relations in the South changed since 1961. Supervising Producer, “Decoded Porsche Mini-Docs” The History Channel 2010  –  2010  (less than a year) For Red Thread Productions, supervised the production and post production budget, schedule, crew, travel and interviews for 5-episode mini-documentary series sponsored by Porsche for History’s series Decoded. Supervising Producer, “Decoded Porsche Mini-Docs” The History Channel 2010  –  2010  (less than a year) For Red Thread Productions, supervised the production and post production budget, schedule, crew, travel and interviews for 5-episode mini-documentary series sponsored by Porsche for History’s series Decoded. Executive in Charge, Undeletable Productions A&E Television 2010  –  2010  (less than a year) Shot A&E pilot on location in Miami as lead-up to a new docu-series which explores the world of tennis. Executive in Charge, Undeletable Productions A&E Television 2010  –  2010  (less than a year) Shot A&E pilot on location in Miami as lead-up to a new docu-series which explores the world of tennis. Live Conference Producer, \"SAP Sapphire NOW\" SAP 2010  –  2010  (less than a year) Created on the spot technology news programming that was a mix of traditional television, social media, keynote speakers, panel discussions and technology, all simulcast to Germany and cities throughout the US and on the web from the conference center in Orlando, Florida. Production included writing scripts, interviewing corporate clients and creating content for products first introduced at the conference. Live Conference Producer, \"SAP Sapphire NOW\" SAP 2010  –  2010  (less than a year) Created on the spot technology news programming that was a mix of traditional television, social media, keynote speakers, panel discussions and technology, all simulcast to Germany and cities throughout the US and on the web from the conference center in Orlando, Florida. Production included writing scripts, interviewing corporate clients and creating content for products first introduced at the conference. Promotions Producer, \"Damages\" and \"Lights Out\" FX Networks 2008  –  2010  (2 years) Directed segments to support second season of award winning “Damages.” Worked with Glenn Close and William Hurt and entire cast while creating segments for promotional release. Promotions Producer, \"Damages\" and \"Lights Out\" FX Networks 2008  –  2010  (2 years) Directed segments to support second season of award winning “Damages.” Worked with Glenn Close and William Hurt and entire cast while creating segments for promotional release. Supervising Producer, \"Woodstock Now & Then\" VH1 2009  –  2009  (less than a year) Produced 2 hour documentary celebrating Woodstock 1969, capturing interviews with classic and current musical artists who helped define an era. Won Cine Golden Eagle and was nominated for an Emmy. Supervising Producer, \"Woodstock Now & Then\" VH1 2009  –  2009  (less than a year) Produced 2 hour documentary celebrating Woodstock 1969, capturing interviews with classic and current musical artists who helped define an era. Won Cine Golden Eagle and was nominated for an Emmy. Supervising Producer, \"BOA Mini-Docs Series\" Bank of America 2009  –  2009  (less than a year) Supervised the production and post production budget, schedule, crew, travel and interviews for a 12- episode mini-documentary series sponsored by Bank of America for History’s epic series America The Story of Us. Supervising Producer, \"BOA Mini-Docs Series\" Bank of America 2009  –  2009  (less than a year) Supervised the production and post production budget, schedule, crew, travel and interviews for a 12- episode mini-documentary series sponsored by Bank of America for History’s epic series America The Story of Us. Webisodes Producer, \"Rescue Me - Season 5\" Sony Pictures Entertainment 2008  –  2009  (1 year) Directed segments to support season five for both Sony’s DVD release and “Rescue Me” web. Webisodes Producer, \"Rescue Me - Season 5\" Sony Pictures Entertainment 2008  –  2009  (1 year) Directed segments to support season five for both Sony’s DVD release and “Rescue Me” web. Producer The Oprah Winfrey Show 1996  –  2009  (13 years) Recruited to Chicago to create programming and segments for The Oprah Winfrey Show. From 1997 through 2009 continued to work as a NY based producer for the talk show. Producer The Oprah Winfrey Show 1996  –  2009  (13 years) Recruited to Chicago to create programming and segments for The Oprah Winfrey Show. From 1997 through 2009 continued to work as a NY based producer for the talk show. Producer, Peacock Productions, \"I Married A...\" NBC News 2008  –  2008  (less than a year) Produced one-hour Lifetime TV pilot depictng the life of a woman married to a serial killer. Gained exclusive access to wife of Green River Killer. Producer, Peacock Productions, \"I Married A...\" NBC News 2008  –  2008  (less than a year) Produced one-hour Lifetime TV pilot depictng the life of a woman married to a serial killer. Gained exclusive access to wife of Green River Killer. Show Runner, \"The Hugh Thompson Show\" AT&T 2006  –  2008  (2 years) Created compelling content to promote AT&T’s security products and corporate brand. Developed, booked and produced webisodes for this ground breaking high-tech, variety-talk show shot before a live audience and introduced on http://techchannel.att.com. Supervised series dedicated to science and technology news and entertainment destined for AT&T’s three screens: wireless, pc, ipTV. Managed production budgets for multi-level platform advertising model. Oversaw 60+ hours of content. Show Runner, \"The Hugh Thompson Show\" AT&T 2006  –  2008  (2 years) Created compelling content to promote AT&T’s security products and corporate brand. Developed, booked and produced webisodes for this ground breaking high-tech, variety-talk show shot before a live audience and introduced on http://techchannel.att.com. Supervised series dedicated to science and technology news and entertainment destined for AT&T’s three screens: wireless, pc, ipTV. Managed production budgets for multi-level platform advertising model. Oversaw 60+ hours of content. Studio Producer, “The Big Idea” and \"On The Money” CNBC 2006  –  2008  (2 years) Produced live to tape shows for Donny Deutsch and Carmen Wong Ulrich of CNBC. Created undercover, business and celebrity programming for The Big Idea and consumer finance support and help for \"On The Money.\" Studio Producer, “The Big Idea” and \"On The Money” CNBC 2006  –  2008  (2 years) Produced live to tape shows for Donny Deutsch and Carmen Wong Ulrich of CNBC. Created undercover, business and celebrity programming for The Big Idea and consumer finance support and help for \"On The Money.\" Producer The Oprah Winfrey Show OPRAH.COM 2006  –  2006  (less than a year) Directed segments for Oprah.com style section. Worked with a major department store, style experts and models to demonstrate the do’s and don’ts of basic female and male wardrobes. Producer The Oprah Winfrey Show OPRAH.COM 2006  –  2006  (less than a year) Directed segments for Oprah.com style section. Worked with a major department store, style experts and models to demonstrate the do’s and don’ts of basic female and male wardrobes. Creator/Director/Producer Public Broadcasting Service 2002  –  2006  (4 years) Developed and produced 6 award winning cinema vérité documentaries: \n“Grab Hold of the Reins” (women fighting breast & ovarian cancer) – Gracie Allen Award  \n“Proud To Be A Girl” (girls and self-esteem) – Emmy Award  \n“Choices Over A Lifetime” (women’s life choices)  \n“Phenomenal Voyage” (women and technology)  \n“Pure Magic” The Mother / Daughter Bond” – Gracie Allen Award  \n“The Power of Integrity” (women who rise to the top in the corporate world) Creator/Director/Producer Public Broadcasting Service 2002  –  2006  (4 years) Developed and produced 6 award winning cinema vérité documentaries: \n“Grab Hold of the Reins” (women fighting breast & ovarian cancer) – Gracie Allen Award  \n“Proud To Be A Girl” (girls and self-esteem) – Emmy Award  \n“Choices Over A Lifetime” (women’s life choices)  \n“Phenomenal Voyage” (women and technology)  \n“Pure Magic” The Mother / Daughter Bond” – Gracie Allen Award  \n“The Power of Integrity” (women who rise to the top in the corporate world) Executive Producer, \"Fatal Fathers\" A&E Television 2005  –  2005  (less than a year) Produced one-hour documentary hosted by Bill Curtis exploring the little known fact that murder is the number one cause of death among pregnant women. Executive Producer, \"Fatal Fathers\" A&E Television 2005  –  2005  (less than a year) Produced one-hour documentary hosted by Bill Curtis exploring the little known fact that murder is the number one cause of death among pregnant women. Show Runner, \"Fashion Police\" / Field Producer, \"Isaac\" E! Networks 2005  –  2005  (less than a year) Supervised and managed a staff of producers and field producers for a weekly \"Fashion Police\" series featured on the Style Network. Field produced \"Issac,\" hosted by Isaac Mizrahi featuring man-on-the-street interviews, \"Sketches and Answers\" and celebrity interviews. Show Runner, \"Fashion Police\" / Field Producer, \"Isaac\" E! Networks 2005  –  2005  (less than a year) Supervised and managed a staff of producers and field producers for a weekly \"Fashion Police\" series featured on the Style Network. Field produced \"Issac,\" hosted by Isaac Mizrahi featuring man-on-the-street interviews, \"Sketches and Answers\" and celebrity interviews. Post-Producer, Ellen Warner Bros. Entertainment Group of Companies 2005  –  2005  (less than a year) Worked with entire production staff of “The Ellen Degeneres Show” to create and maintain post production schedule for a series of location shows that were shot in NYC. Post-Producer, Ellen Warner Bros. Entertainment Group of Companies 2005  –  2005  (less than a year) Worked with entire production staff of “The Ellen Degeneres Show” to create and maintain post production schedule for a series of location shows that were shot in NYC. Content Originator/Producer, \"New Morning\" and Producer, \"The Way Home: Stories of Forgiveness\" Hallmark Channel 2004  –  2005  (1 year) Produced daily morning show hosted by Naomi Judd. This program introduced audiences to people who practice spirituality throughout their everyday lives. \n \nProduced a powerful documentary narrated by Glenn Close, which follows a town split in two, a father and son, a murderer and his victim's wife, as they all learn to forgive. Omni Intermedia Award Content Originator/Producer, \"New Morning\" and Producer, \"The Way Home: Stories of Forgiveness\" Hallmark Channel 2004  –  2005  (1 year) Produced daily morning show hosted by Naomi Judd. This program introduced audiences to people who practice spirituality throughout their everyday lives. \n \nProduced a powerful documentary narrated by Glenn Close, which follows a town split in two, a father and son, a murderer and his victim's wife, as they all learn to forgive. Omni Intermedia Award Producer, \"The Belzer Connection SciFi NonFi 2003  –  2003  (less than a year) Produced program dissecting the conspiracy theory surrounding Princess Diana's death, hosted by Richard Belzer. Producer, \"The Belzer Connection SciFi NonFi 2003  –  2003  (less than a year) Produced program dissecting the conspiracy theory surrounding Princess Diana's death, hosted by Richard Belzer. Producer, “I Married Sammy Hagar” VH-1 2003  –  2003  (less than a year) Produced documentary where Kari and Sammy Hagar invite viewes into their lives in beautiful Cabo San Lucas, Mexico. Producer, “I Married Sammy Hagar” VH-1 2003  –  2003  (less than a year) Produced documentary where Kari and Sammy Hagar invite viewes into their lives in beautiful Cabo San Lucas, Mexico. Producer, \"The Hamptons,\" Cabin Creek Films/Barbara Kopple ABC Television 2001  –  2001  (less than a year) Produced cinema vérité 4-hour special documenting the people and places of The Hamptons. Producer, \"The Hamptons,\" Cabin Creek Films/Barbara Kopple ABC Television 2001  –  2001  (less than a year) Produced cinema vérité 4-hour special documenting the people and places of The Hamptons. Producer, \"Intimate Portrait\" Lifetime Television 2001  –  2001  (less than a year) One-hour biography of actress Barbara Eden. Producer, \"Intimate Portrait\" Lifetime Television 2001  –  2001  (less than a year) One-hour biography of actress Barbara Eden. Producer, \"HomePage\" & \"Day Side News' MSNBC 2000  –  2001  (1 year) New York Produced segments for groundbreaking female hosted, daily, live, three-hour, news program with Ashleigh Banfield, Mika Brzezinski and Gina Gaston. Created parenting, lifestyle, home Improvement studio and field segments for daily live news show. Produced live studio and remote segments for daily network news. Producer, \"HomePage\" & \"Day Side News' MSNBC 2000  –  2001  (1 year) New York Produced segments for groundbreaking female hosted, daily, live, three-hour, news program with Ashleigh Banfield, Mika Brzezinski and Gina Gaston. Created parenting, lifestyle, home Improvement studio and field segments for daily live news show. Produced live studio and remote segments for daily network news. Supervising Producer, \"G-String Divas\" HBO 1999  –  2000  (1 year) Produced 13-episodic documentary series exploring the lives of strippers working and living in Pennsylvania and Puerto Rico, and presenting viewers with a rare look inside the exotic entertainment industry. Created and managed multi-million dollar budget. Supervising Producer, \"G-String Divas\" HBO 1999  –  2000  (1 year) Produced 13-episodic documentary series exploring the lives of strippers working and living in Pennsylvania and Puerto Rico, and presenting viewers with a rare look inside the exotic entertainment industry. Created and managed multi-million dollar budget. Producer, \"B. Smith with Style\" Hearst Magazines 1999  –  1999  (less than a year) Directed segments on gardening, home, cooking and crafts for a syndicated home show. Producer, \"B. Smith with Style\" Hearst Magazines 1999  –  1999  (less than a year) Directed segments on gardening, home, cooking and crafts for a syndicated home show. Producer, “Biography of the Millennium” A&E Television 1998  –  1999  (1 year) Produced 4-hour documentary profiling 100 of the most influential people of the last 1000 years. Interviewed prestigious individuals from both the entertainment and political arena while combining eyewitness accounts with archival footage. Producer, “Biography of the Millennium” A&E Television 1998  –  1999  (1 year) Produced 4-hour documentary profiling 100 of the most influential people of the last 1000 years. Interviewed prestigious individuals from both the entertainment and political arena while combining eyewitness accounts with archival footage. Producer, “20th Century Project” ABC News 1997  –  1998  (1 year) 12 X 1 network documentary series that looks back at the 20th Century. Interviews included: Nuclear Physicist & Nobel Prize in Physics, Hans Bethe - Apple Co-founders, Steve Jobs & Steve Wozniak - Father of the Internet Vinton Cerf.- Time Magazine Man of the Year, Dr. David Ho. Producer, “20th Century Project” ABC News 1997  –  1998  (1 year) 12 X 1 network documentary series that looks back at the 20th Century. Interviews included: Nuclear Physicist & Nobel Prize in Physics, Hans Bethe - Apple Co-founders, Steve Jobs & Steve Wozniak - Father of the Internet Vinton Cerf.- Time Magazine Man of the Year, Dr. David Ho. Producer, “President’s Summit for America’s Future” Cabin Creek Film, Barbara Kopple 1996  –  1997  (1 year) Directed short documentaries highlighting the accomplishments of a select group of volunteers throughout the U.S. and presented to Presidents Clinton, Bush, Ford and Carter. Producer, “President’s Summit for America’s Future” Cabin Creek Film, Barbara Kopple 1996  –  1997  (1 year) Directed short documentaries highlighting the accomplishments of a select group of volunteers throughout the U.S. and presented to Presidents Clinton, Bush, Ford and Carter. Producer, “New Passages” ABC Television 1996  –  1997  (1 year) Produced 2-hour network documentary special based on Gail Sheehy’s bestselling book “Passages”. Producer, “New Passages” ABC Television 1996  –  1997  (1 year) Produced 2-hour network documentary special based on Gail Sheehy’s bestselling book “Passages”. Director, “Two Hot Tamales Mexican Food Documentary” Food Network UK 1996  –  1997  (1 year) Conceptualized and directed 2 one-hour documentary specials showcasing authentic Mexican cuisine. Shot on location in remote locations: Merida and Oaxaca, Mexico. Director, “Two Hot Tamales Mexican Food Documentary” Food Network UK 1996  –  1997  (1 year) Conceptualized and directed 2 one-hour documentary specials showcasing authentic Mexican cuisine. Shot on location in remote locations: Merida and Oaxaca, Mexico. Producer King World 1996  –  1997  (1 year) Produced segments for syndicated talk show \"Rolonda\" Producer King World 1996  –  1997  (1 year) Produced segments for syndicated talk show \"Rolonda\" Supervising Producer, “Catalog 1 Partners” and Producer, \"People Magazine 20th Anniversary Special\" Time Warner Inc. 1993  –  1996  (3 years) For \"Catalog 1\" managed a staff of producers, associate producers, production assistants for a series of life style programs. Created for the first fully interactive cable network. \n \nFor \"People Magazine, wrote and directed segments for CBS/ABC television entertainment specials. Supervising Producer, “Catalog 1 Partners” and Producer, \"People Magazine 20th Anniversary Special\" Time Warner Inc. 1993  –  1996  (3 years) For \"Catalog 1\" managed a staff of producers, associate producers, production assistants for a series of life style programs. Created for the first fully interactive cable network. \n \nFor \"People Magazine, wrote and directed segments for CBS/ABC television entertainment specials. Field Producer/Producer Investigative News Group 1989  –  1992  (3 years) Produced for \"Geraldo\" syndicated talk show. Field Producer/Producer Investigative News Group 1989  –  1992  (3 years) Produced for \"Geraldo\" syndicated talk show. Skills Television Broadcast Documentaries Storytelling Video Production Short Films Film Production New Media Producing Post Production Video Final Cut Pro Text Editing Advertising Feature Films Writers Digital Media Photography Film High-Profile Interviews Historical Research Budget Management Talent Coaching Social Media Live Programming Docudrama Reality Programming Comedy Video Editing Broadcast Television Screenwriting HD Video Videography Reality Media Production Talent Management Budgets See 22+     See less Skills  Television Broadcast Documentaries Storytelling Video Production Short Films Film Production New Media Producing Post Production Video Final Cut Pro Text Editing Advertising Feature Films Writers Digital Media Photography Film High-Profile Interviews Historical Research Budget Management Talent Coaching Social Media Live Programming Docudrama Reality Programming Comedy Video Editing Broadcast Television Screenwriting HD Video Videography Reality Media Production Talent Management Budgets See 22+     See less Television Broadcast Documentaries Storytelling Video Production Short Films Film Production New Media Producing Post Production Video Final Cut Pro Text Editing Advertising Feature Films Writers Digital Media Photography Film High-Profile Interviews Historical Research Budget Management Talent Coaching Social Media Live Programming Docudrama Reality Programming Comedy Video Editing Broadcast Television Screenwriting HD Video Videography Reality Media Production Talent Management Budgets See 22+     See less Television Broadcast Documentaries Storytelling Video Production Short Films Film Production New Media Producing Post Production Video Final Cut Pro Text Editing Advertising Feature Films Writers Digital Media Photography Film High-Profile Interviews Historical Research Budget Management Talent Coaching Social Media Live Programming Docudrama Reality Programming Comedy Video Editing Broadcast Television Screenwriting HD Video Videography Reality Media Production Talent Management Budgets See 22+     See less Education New York Institute of Technology-Old Westbury Bachelor of Fine Arts (B.F.A.),  Communication and Media Studies 1980  – 1984 Television Arts and Science Activities and Societies:  On-Air Radio News Reporter\nStart-up team and reporter for LI News Tonight New York Institute of Technology-Old Westbury Bachelor of Fine Arts (B.F.A.),  Communication and Media Studies 1980  – 1984 Television Arts and Science Activities and Societies:  On-Air Radio News Reporter\nStart-up team and reporter for LI News Tonight New York Institute of Technology-Old Westbury Bachelor of Fine Arts (B.F.A.),  Communication and Media Studies 1980  – 1984 Television Arts and Science Activities and Societies:  On-Air Radio News Reporter\nStart-up team and reporter for LI News Tonight New York Institute of Technology-Old Westbury Bachelor of Fine Arts (B.F.A.),  Communication and Media Studies 1980  – 1984 Television Arts and Science Activities and Societies:  On-Air Radio News Reporter\nStart-up team and reporter for LI News Tonight Honors & Awards Additional Honors & Awards 2 Emmys Awards \n2 Gracie Awards \n1 Omni Media Award Additional Honors & Awards 2 Emmys Awards \n2 Gracie Awards \n1 Omni Media Award Additional Honors & Awards 2 Emmys Awards \n2 Gracie Awards \n1 Omni Media Award Additional Honors & Awards 2 Emmys Awards \n2 Gracie Awards \n1 Omni Media Award ", "Summary Grazia Caroselli is a writer/producer with several years of experience putting together non-fiction series (behind-the-scenes, documentary-style and reality formats) for all the major Networks and Cable clients. \n \nAs a hybrid writer/producer she is adept at conceiving, developing and executing projects. She knows what it takes to grow an idea/story angle into a realized script with great characters, and how turn that idea into a workable shoot and edit.  \n \nComfortable with paper edits as well as paperless rough editing on Avid, Final Cut Pro, and can hand off or work with editors. Enjoys the entire post-production process, from working with editors in off-line as well as on-line. Has supervised VO sessions, audio sweetening, color correcting, as well as shaping cuts.  \n \nAs a team player, she enjoys keeping everyone happy by planning and making things run smoothly. She strives to anticipate clients' needs to keep all agendas on track.  \n \nStrengths include strong research skills, creativity, organization and being a team player. Well-trained at molding strong story angles and making shoots successful, her shows end up solid and on budget, no matter what the subject. She continues to produce television programming that is at once exciting, educational and entertaining. \n \nShe's been a member of the PGA, Producer's Guild for several years. \n \nSpecialties: Research, writing, coordinating, segment/field/story producing in non-fiction TV production. Summary Grazia Caroselli is a writer/producer with several years of experience putting together non-fiction series (behind-the-scenes, documentary-style and reality formats) for all the major Networks and Cable clients. \n \nAs a hybrid writer/producer she is adept at conceiving, developing and executing projects. She knows what it takes to grow an idea/story angle into a realized script with great characters, and how turn that idea into a workable shoot and edit.  \n \nComfortable with paper edits as well as paperless rough editing on Avid, Final Cut Pro, and can hand off or work with editors. Enjoys the entire post-production process, from working with editors in off-line as well as on-line. Has supervised VO sessions, audio sweetening, color correcting, as well as shaping cuts.  \n \nAs a team player, she enjoys keeping everyone happy by planning and making things run smoothly. She strives to anticipate clients' needs to keep all agendas on track.  \n \nStrengths include strong research skills, creativity, organization and being a team player. Well-trained at molding strong story angles and making shoots successful, her shows end up solid and on budget, no matter what the subject. She continues to produce television programming that is at once exciting, educational and entertaining. \n \nShe's been a member of the PGA, Producer's Guild for several years. \n \nSpecialties: Research, writing, coordinating, segment/field/story producing in non-fiction TV production. Grazia Caroselli is a writer/producer with several years of experience putting together non-fiction series (behind-the-scenes, documentary-style and reality formats) for all the major Networks and Cable clients. \n \nAs a hybrid writer/producer she is adept at conceiving, developing and executing projects. She knows what it takes to grow an idea/story angle into a realized script with great characters, and how turn that idea into a workable shoot and edit.  \n \nComfortable with paper edits as well as paperless rough editing on Avid, Final Cut Pro, and can hand off or work with editors. Enjoys the entire post-production process, from working with editors in off-line as well as on-line. Has supervised VO sessions, audio sweetening, color correcting, as well as shaping cuts.  \n \nAs a team player, she enjoys keeping everyone happy by planning and making things run smoothly. She strives to anticipate clients' needs to keep all agendas on track.  \n \nStrengths include strong research skills, creativity, organization and being a team player. Well-trained at molding strong story angles and making shoots successful, her shows end up solid and on budget, no matter what the subject. She continues to produce television programming that is at once exciting, educational and entertaining. \n \nShe's been a member of the PGA, Producer's Guild for several years. \n \nSpecialties: Research, writing, coordinating, segment/field/story producing in non-fiction TV production. Grazia Caroselli is a writer/producer with several years of experience putting together non-fiction series (behind-the-scenes, documentary-style and reality formats) for all the major Networks and Cable clients. \n \nAs a hybrid writer/producer she is adept at conceiving, developing and executing projects. She knows what it takes to grow an idea/story angle into a realized script with great characters, and how turn that idea into a workable shoot and edit.  \n \nComfortable with paper edits as well as paperless rough editing on Avid, Final Cut Pro, and can hand off or work with editors. Enjoys the entire post-production process, from working with editors in off-line as well as on-line. Has supervised VO sessions, audio sweetening, color correcting, as well as shaping cuts.  \n \nAs a team player, she enjoys keeping everyone happy by planning and making things run smoothly. She strives to anticipate clients' needs to keep all agendas on track.  \n \nStrengths include strong research skills, creativity, organization and being a team player. Well-trained at molding strong story angles and making shoots successful, her shows end up solid and on budget, no matter what the subject. She continues to produce television programming that is at once exciting, educational and entertaining. \n \nShe's been a member of the PGA, Producer's Guild for several years. \n \nSpecialties: Research, writing, coordinating, segment/field/story producing in non-fiction TV production. Experience Story Producer World of Wonder August 2013  – Present (2 years 1 month) Hollywood, CA. Story Producer, Family Under Construction, DIY Channel/HGTV, Premiering Fall 2014, 8 1/2hour episodes, makeover docureality series. Story Producer World of Wonder August 2013  – Present (2 years 1 month) Hollyweird, California Story Producer, Girlfriend Intervention, Lifetime TV Reality Series, Premiered Fall, 2014; 8 hour-long episodes, makeover/comedy. Story Producer Relativity Television April 2013  – Present (2 years 5 months) Hollywood History Channel TV Series, American Jungle; 8 1/2hour episodes, makeover docureality series. \nStory Producer, Relativity Television. Premiered Winter, 2014. Survivalist reality series. Several rival clans living off the land vie for hunting territories. 8 1hr episodes. Producer Lewin Productions 2012  – Present (3 years) Greater Los Angeles Area Corporate Videos; Educational; PSAs & Webisodes; California History, Save Mt. Diablo; Disaster Preparedness Training Videos Segment and Field Producer Upper Ground Enterprises May 2011  –  February 2013  (1 year 10 months) Producer, LA Unit ITV Studios May 2011  –  January 2012  (9 months) Los Angeles Researched, developed lead and lifestyle segments for a TV & Web News Magazine series, America Now, hosted by leeza Gibbons and Bill Rancic; 220 episodes; with financial & lifestyle experts: including food, beauty, travel and consumer safety. Producer Film Garden Entertainment November 2010  –  April 2011  (6 months) Produced 10 1hr. episodes for Discovery Channel TV Series, \"Hogs Gone Wild\", following 3 sets of trappers and biologists as they help people in need. Dealt with the current overpopulation of feral hogs in the U.S. Segments shot in California, Hawaii, Florida, Texas, Oklahoma, Alabama and Texas. Don't Forget The Lyrics! Jeff Apploff/RDF Media May 2010  –  August 2010  (4 months) FOX/VH1 TV Series hosted by Mark McGrath: Contestant producer, 50 contestants, 160 episodes; research, created profiles, pre-production and production on set, coached them to learn the game show so they were well-prepared to go in front of the crowd and TV audience. Winners won as much as $50,00 per performance. Ladies of Demolition Derby Film Garden Entertainment February 2010  –  April 2010  (3 months) TLC, learning Channel TV Series: Field and Story produced one of six contestants who were racing demolition cars. Reality/Competition TV series. producer Wounded Vet fundraising event 2010  –  2010  (less than a year) TV Writer/Producer, \"Renovation Nation\" Planet Green/Discovery Channel 2008  –  2009  (1 year) Story Producer, 40 1hr episodes, Mike Mathis Productions. Amazing Green home makeovers. Lots of green science/tech. Trading Spouses FOX TV 2008  –  2009  (1 year) Writer/Story Producer on the Fox docu-soap TV series, “Trading Spouses”, for Rocket Science Labs. Wrote and produced the teases. Field/story Producer Discovery Health Channel 2008  –  2008  (less than a year) \"National Body Challenge\", where people from all walks of life (i.e. night nurses, firemen, teachers, wrestlers) dropped weight and did all sorts of challenges over a three month period. Story Producer Original Productions 2007  –  2008  (1 year) Wrote 2 of a 6 part one-hour docu-soap/reality series, “Twister Sisters”, for the WE Channel, Two female meteorologists give weather safaris for various guests for the ride of a lifetime. Food Paradise Travel Channel 2007  –  2007  (less than a year) Writer, 10 episodes, Prometheus Entertainment Webisode writer msnbc.com 2007  –  2007  (less than a year) Wrote/produced “Search for the Chivas Regal Life Ambassadors”. This was a competition, lifestyle format. Writer, Travel Channel TV series Termite Art Productions 2007  –  2007  (less than a year) John Ratzenberger’s “Made In America” Story Producer NBC 2006  –  2007  (1 year) NBC’s Emmy award winning series, “Starting Over”, exploring women’s problems with life-altering therapy techniques. Life coaches help a house full of women with their personal \"baggage\", and give them a second chance at new beginnings. Six women are given psychological and game challenges for personal growth. Producer Film Garden Entertainment 2006  –  2006  (less than a year) “Taste Of America”, Travel Channel Story Producer/Writer, HGTV LMNO Productions 2006  –  2006  (less than a year) \"What's With That House?\", a funny and irreverent look at strange and wonderful houses and the equally eccentric people who live in them. Producer Champion of Courage Awards 2005  –  2005  (less than a year) Fundraising films include the Motion Picture Fund’s “Wake-Up Call” with Sean Connery and the Fulfillment Fund Champion of Courage biographies with Billy Blanks and CAA. Field Producer/Director RDF Media 2005  –  2005  (less than a year) “Operation Junkyard”, NBC & Discovery Channel \nTwo teams of math and science wiz kids build motorized robots and compete against each other. Field/Story Producer A&E Television Networks 2003  –  2004  (1 year) House Beautiful, Home makeover series Field/Story Producer The History Channel 2002  –  2002  (less than a year) History Channel's recent \"Full Throttle\" pitted two very different teams of would-be mechanics against each other to rebuild classic cars, and drag race to win the cars in the finish. Producer Style Network 2000  –  2001  (1 year) Wrote, directed and edited TV series, \"Style Star\" for the Style Network, a sister TV Channel to E! Field Producer/Director Lifetime Television 2000  –  2000  (less than a year) “I Married A Princess”, Lifetime TV’s first reality series. It followed the celebrity lifestyle of a real-life Princess, actress Katherine Oxenburg (Dynasty & star of the Princess Diana MOWs) and her husband, actor Casper Van Dien (Starship Troopers) raising their five children from three marriages. Producer NBC 1998  –  1998  (less than a year) Unsolved Mysteries Producer TLC, The Learning Channel 1997  –  1997  (less than a year) “How’d They Do That?”(TLC, Time Warner/Telepictures World of Wonder Discovery Communications 1995  –  1996  (1 year) World of Wonder, science series, latest-cutting edge technologies. Co-producer, TV Movie Lifetime Television 1995  –  1995  (less than a year) The abortion rights Lifetime TV Movie, “Better Off Dead”, starring Mare Winningham, ACE award, Gloria Steinem, executive producer. Story Producer World of Wonder August 2013  – Present (2 years 1 month) Hollywood, CA. Story Producer, Family Under Construction, DIY Channel/HGTV, Premiering Fall 2014, 8 1/2hour episodes, makeover docureality series. Story Producer World of Wonder August 2013  – Present (2 years 1 month) Hollywood, CA. Story Producer, Family Under Construction, DIY Channel/HGTV, Premiering Fall 2014, 8 1/2hour episodes, makeover docureality series. Story Producer World of Wonder August 2013  – Present (2 years 1 month) Hollyweird, California Story Producer, Girlfriend Intervention, Lifetime TV Reality Series, Premiered Fall, 2014; 8 hour-long episodes, makeover/comedy. Story Producer World of Wonder August 2013  – Present (2 years 1 month) Hollyweird, California Story Producer, Girlfriend Intervention, Lifetime TV Reality Series, Premiered Fall, 2014; 8 hour-long episodes, makeover/comedy. Story Producer Relativity Television April 2013  – Present (2 years 5 months) Hollywood History Channel TV Series, American Jungle; 8 1/2hour episodes, makeover docureality series. \nStory Producer, Relativity Television. Premiered Winter, 2014. Survivalist reality series. Several rival clans living off the land vie for hunting territories. 8 1hr episodes. Story Producer Relativity Television April 2013  – Present (2 years 5 months) Hollywood History Channel TV Series, American Jungle; 8 1/2hour episodes, makeover docureality series. \nStory Producer, Relativity Television. Premiered Winter, 2014. Survivalist reality series. Several rival clans living off the land vie for hunting territories. 8 1hr episodes. Producer Lewin Productions 2012  – Present (3 years) Greater Los Angeles Area Corporate Videos; Educational; PSAs & Webisodes; California History, Save Mt. Diablo; Disaster Preparedness Training Videos Producer Lewin Productions 2012  – Present (3 years) Greater Los Angeles Area Corporate Videos; Educational; PSAs & Webisodes; California History, Save Mt. Diablo; Disaster Preparedness Training Videos Segment and Field Producer Upper Ground Enterprises May 2011  –  February 2013  (1 year 10 months) Segment and Field Producer Upper Ground Enterprises May 2011  –  February 2013  (1 year 10 months) Producer, LA Unit ITV Studios May 2011  –  January 2012  (9 months) Los Angeles Researched, developed lead and lifestyle segments for a TV & Web News Magazine series, America Now, hosted by leeza Gibbons and Bill Rancic; 220 episodes; with financial & lifestyle experts: including food, beauty, travel and consumer safety. Producer, LA Unit ITV Studios May 2011  –  January 2012  (9 months) Los Angeles Researched, developed lead and lifestyle segments for a TV & Web News Magazine series, America Now, hosted by leeza Gibbons and Bill Rancic; 220 episodes; with financial & lifestyle experts: including food, beauty, travel and consumer safety. Producer Film Garden Entertainment November 2010  –  April 2011  (6 months) Produced 10 1hr. episodes for Discovery Channel TV Series, \"Hogs Gone Wild\", following 3 sets of trappers and biologists as they help people in need. Dealt with the current overpopulation of feral hogs in the U.S. Segments shot in California, Hawaii, Florida, Texas, Oklahoma, Alabama and Texas. Producer Film Garden Entertainment November 2010  –  April 2011  (6 months) Produced 10 1hr. episodes for Discovery Channel TV Series, \"Hogs Gone Wild\", following 3 sets of trappers and biologists as they help people in need. Dealt with the current overpopulation of feral hogs in the U.S. Segments shot in California, Hawaii, Florida, Texas, Oklahoma, Alabama and Texas. Don't Forget The Lyrics! Jeff Apploff/RDF Media May 2010  –  August 2010  (4 months) FOX/VH1 TV Series hosted by Mark McGrath: Contestant producer, 50 contestants, 160 episodes; research, created profiles, pre-production and production on set, coached them to learn the game show so they were well-prepared to go in front of the crowd and TV audience. Winners won as much as $50,00 per performance. Don't Forget The Lyrics! Jeff Apploff/RDF Media May 2010  –  August 2010  (4 months) FOX/VH1 TV Series hosted by Mark McGrath: Contestant producer, 50 contestants, 160 episodes; research, created profiles, pre-production and production on set, coached them to learn the game show so they were well-prepared to go in front of the crowd and TV audience. Winners won as much as $50,00 per performance. Ladies of Demolition Derby Film Garden Entertainment February 2010  –  April 2010  (3 months) TLC, learning Channel TV Series: Field and Story produced one of six contestants who were racing demolition cars. Reality/Competition TV series. Ladies of Demolition Derby Film Garden Entertainment February 2010  –  April 2010  (3 months) TLC, learning Channel TV Series: Field and Story produced one of six contestants who were racing demolition cars. Reality/Competition TV series. producer Wounded Vet fundraising event 2010  –  2010  (less than a year) producer Wounded Vet fundraising event 2010  –  2010  (less than a year) TV Writer/Producer, \"Renovation Nation\" Planet Green/Discovery Channel 2008  –  2009  (1 year) Story Producer, 40 1hr episodes, Mike Mathis Productions. Amazing Green home makeovers. Lots of green science/tech. TV Writer/Producer, \"Renovation Nation\" Planet Green/Discovery Channel 2008  –  2009  (1 year) Story Producer, 40 1hr episodes, Mike Mathis Productions. Amazing Green home makeovers. Lots of green science/tech. Trading Spouses FOX TV 2008  –  2009  (1 year) Writer/Story Producer on the Fox docu-soap TV series, “Trading Spouses”, for Rocket Science Labs. Wrote and produced the teases. Trading Spouses FOX TV 2008  –  2009  (1 year) Writer/Story Producer on the Fox docu-soap TV series, “Trading Spouses”, for Rocket Science Labs. Wrote and produced the teases. Field/story Producer Discovery Health Channel 2008  –  2008  (less than a year) \"National Body Challenge\", where people from all walks of life (i.e. night nurses, firemen, teachers, wrestlers) dropped weight and did all sorts of challenges over a three month period. Field/story Producer Discovery Health Channel 2008  –  2008  (less than a year) \"National Body Challenge\", where people from all walks of life (i.e. night nurses, firemen, teachers, wrestlers) dropped weight and did all sorts of challenges over a three month period. Story Producer Original Productions 2007  –  2008  (1 year) Wrote 2 of a 6 part one-hour docu-soap/reality series, “Twister Sisters”, for the WE Channel, Two female meteorologists give weather safaris for various guests for the ride of a lifetime. Story Producer Original Productions 2007  –  2008  (1 year) Wrote 2 of a 6 part one-hour docu-soap/reality series, “Twister Sisters”, for the WE Channel, Two female meteorologists give weather safaris for various guests for the ride of a lifetime. Food Paradise Travel Channel 2007  –  2007  (less than a year) Writer, 10 episodes, Prometheus Entertainment Food Paradise Travel Channel 2007  –  2007  (less than a year) Writer, 10 episodes, Prometheus Entertainment Webisode writer msnbc.com 2007  –  2007  (less than a year) Wrote/produced “Search for the Chivas Regal Life Ambassadors”. This was a competition, lifestyle format. Webisode writer msnbc.com 2007  –  2007  (less than a year) Wrote/produced “Search for the Chivas Regal Life Ambassadors”. This was a competition, lifestyle format. Writer, Travel Channel TV series Termite Art Productions 2007  –  2007  (less than a year) John Ratzenberger’s “Made In America” Writer, Travel Channel TV series Termite Art Productions 2007  –  2007  (less than a year) John Ratzenberger’s “Made In America” Story Producer NBC 2006  –  2007  (1 year) NBC’s Emmy award winning series, “Starting Over”, exploring women’s problems with life-altering therapy techniques. Life coaches help a house full of women with their personal \"baggage\", and give them a second chance at new beginnings. Six women are given psychological and game challenges for personal growth. Story Producer NBC 2006  –  2007  (1 year) NBC’s Emmy award winning series, “Starting Over”, exploring women’s problems with life-altering therapy techniques. Life coaches help a house full of women with their personal \"baggage\", and give them a second chance at new beginnings. Six women are given psychological and game challenges for personal growth. Producer Film Garden Entertainment 2006  –  2006  (less than a year) “Taste Of America”, Travel Channel Producer Film Garden Entertainment 2006  –  2006  (less than a year) “Taste Of America”, Travel Channel Story Producer/Writer, HGTV LMNO Productions 2006  –  2006  (less than a year) \"What's With That House?\", a funny and irreverent look at strange and wonderful houses and the equally eccentric people who live in them. Story Producer/Writer, HGTV LMNO Productions 2006  –  2006  (less than a year) \"What's With That House?\", a funny and irreverent look at strange and wonderful houses and the equally eccentric people who live in them. Producer Champion of Courage Awards 2005  –  2005  (less than a year) Fundraising films include the Motion Picture Fund’s “Wake-Up Call” with Sean Connery and the Fulfillment Fund Champion of Courage biographies with Billy Blanks and CAA. Producer Champion of Courage Awards 2005  –  2005  (less than a year) Fundraising films include the Motion Picture Fund’s “Wake-Up Call” with Sean Connery and the Fulfillment Fund Champion of Courage biographies with Billy Blanks and CAA. Field Producer/Director RDF Media 2005  –  2005  (less than a year) “Operation Junkyard”, NBC & Discovery Channel \nTwo teams of math and science wiz kids build motorized robots and compete against each other. Field Producer/Director RDF Media 2005  –  2005  (less than a year) “Operation Junkyard”, NBC & Discovery Channel \nTwo teams of math and science wiz kids build motorized robots and compete against each other. Field/Story Producer A&E Television Networks 2003  –  2004  (1 year) House Beautiful, Home makeover series Field/Story Producer A&E Television Networks 2003  –  2004  (1 year) House Beautiful, Home makeover series Field/Story Producer The History Channel 2002  –  2002  (less than a year) History Channel's recent \"Full Throttle\" pitted two very different teams of would-be mechanics against each other to rebuild classic cars, and drag race to win the cars in the finish. Field/Story Producer The History Channel 2002  –  2002  (less than a year) History Channel's recent \"Full Throttle\" pitted two very different teams of would-be mechanics against each other to rebuild classic cars, and drag race to win the cars in the finish. Producer Style Network 2000  –  2001  (1 year) Wrote, directed and edited TV series, \"Style Star\" for the Style Network, a sister TV Channel to E! Producer Style Network 2000  –  2001  (1 year) Wrote, directed and edited TV series, \"Style Star\" for the Style Network, a sister TV Channel to E! Field Producer/Director Lifetime Television 2000  –  2000  (less than a year) “I Married A Princess”, Lifetime TV’s first reality series. It followed the celebrity lifestyle of a real-life Princess, actress Katherine Oxenburg (Dynasty & star of the Princess Diana MOWs) and her husband, actor Casper Van Dien (Starship Troopers) raising their five children from three marriages. Field Producer/Director Lifetime Television 2000  –  2000  (less than a year) “I Married A Princess”, Lifetime TV’s first reality series. It followed the celebrity lifestyle of a real-life Princess, actress Katherine Oxenburg (Dynasty & star of the Princess Diana MOWs) and her husband, actor Casper Van Dien (Starship Troopers) raising their five children from three marriages. Producer NBC 1998  –  1998  (less than a year) Unsolved Mysteries Producer NBC 1998  –  1998  (less than a year) Unsolved Mysteries Producer TLC, The Learning Channel 1997  –  1997  (less than a year) “How’d They Do That?”(TLC, Time Warner/Telepictures Producer TLC, The Learning Channel 1997  –  1997  (less than a year) “How’d They Do That?”(TLC, Time Warner/Telepictures World of Wonder Discovery Communications 1995  –  1996  (1 year) World of Wonder, science series, latest-cutting edge technologies. World of Wonder Discovery Communications 1995  –  1996  (1 year) World of Wonder, science series, latest-cutting edge technologies. Co-producer, TV Movie Lifetime Television 1995  –  1995  (less than a year) The abortion rights Lifetime TV Movie, “Better Off Dead”, starring Mare Winningham, ACE award, Gloria Steinem, executive producer. Co-producer, TV Movie Lifetime Television 1995  –  1995  (less than a year) The abortion rights Lifetime TV Movie, “Better Off Dead”, starring Mare Winningham, ACE award, Gloria Steinem, executive producer. Languages Italian Italian Italian Skills Television Coordination Video Production Documentaries Producing Research Entertainment New Media Storytelling Video Film Avid Reality Post Production Reality TV Editing Pre-production Film Production Broadcast See 4+     See less Skills  Television Coordination Video Production Documentaries Producing Research Entertainment New Media Storytelling Video Film Avid Reality Post Production Reality TV Editing Pre-production Film Production Broadcast See 4+     See less Television Coordination Video Production Documentaries Producing Research Entertainment New Media Storytelling Video Film Avid Reality Post Production Reality TV Editing Pre-production Film Production Broadcast See 4+     See less Television Coordination Video Production Documentaries Producing Research Entertainment New Media Storytelling Video Film Avid Reality Post Production Reality TV Editing Pre-production Film Production Broadcast See 4+     See less Education New York University BFA,  Film & TV Production Activities and Societies:  Co-promoter ,  NYU Concerts New York University BFA,  Film & TV Production Activities and Societies:  Co-promoter ,  NYU Concerts New York University BFA,  Film & TV Production Activities and Societies:  Co-promoter ,  NYU Concerts New York University BFA,  Film & TV Production Activities and Societies:  Co-promoter ,  NYU Concerts ", "Experience Editorial Producer CNN Reliable Sources April 2014  – Present (1 year 5 months) New York -Find and pitch story ideas.  \n-Coordinate logistics for taped interviews and live remote interviews. \n-Collaborate with 6 person team to generate original concepts and ideas. \n-Conduct pre-interviews. \n-Develop and maintain relationships with high profile guests in the political, entertainment, and academic worlds. \n-Strategize with team members on various guest bookings and long-term projects. \n-Attend regular networking events to further connections with potential guests. \n Up Late with Alec Baldwin, Booking Producer MSNBC September 2013  – Present (2 years) New York, NY - Helped create and launch a national, weekly news and entertainment program. \n-Book wide variety of national and international newsmakers, experts, and guests from various fields including politics, foreign relations, entertainment, business/economy, etc. \n- Research and pre-interview guests. \n- Maintain long term relationships with publicists and communications directors. \n- Pitch story ideas and provide guest suggestions. Up with Steve Kornacki, Booking Producer MSNBC April 2013  –  September 2013  (6 months) New York, NY -Book wide variety of national and international newsmakers, experts, and guests from various fields including politics, foreign relations, entertainment, business/economy, etc. \n- Research and pre-interview guests. \n- Maintain long term relationships with publicists and communications directors. \n- Pitch story ideas and provide guest suggestions. Viewpoint with Eliot Spitzer Current TV March 2012  –  April 2013  (1 year 2 months) Booking Producer Countdown with Keith Olbermann - CurrentTV May 2011  –  March 2012  (11 months) Booking Producer - The Rachel Maddow Show NBCUniversal, Inc. February 2009  –  May 2011  (2 years 4 months) Booking Producer Air America Radio March 2006  –  February 2009  (3 years) Editorial Producer CNN Reliable Sources April 2014  – Present (1 year 5 months) New York -Find and pitch story ideas.  \n-Coordinate logistics for taped interviews and live remote interviews. \n-Collaborate with 6 person team to generate original concepts and ideas. \n-Conduct pre-interviews. \n-Develop and maintain relationships with high profile guests in the political, entertainment, and academic worlds. \n-Strategize with team members on various guest bookings and long-term projects. \n-Attend regular networking events to further connections with potential guests. \n Editorial Producer CNN Reliable Sources April 2014  – Present (1 year 5 months) New York -Find and pitch story ideas.  \n-Coordinate logistics for taped interviews and live remote interviews. \n-Collaborate with 6 person team to generate original concepts and ideas. \n-Conduct pre-interviews. \n-Develop and maintain relationships with high profile guests in the political, entertainment, and academic worlds. \n-Strategize with team members on various guest bookings and long-term projects. \n-Attend regular networking events to further connections with potential guests. \n Up Late with Alec Baldwin, Booking Producer MSNBC September 2013  – Present (2 years) New York, NY - Helped create and launch a national, weekly news and entertainment program. \n-Book wide variety of national and international newsmakers, experts, and guests from various fields including politics, foreign relations, entertainment, business/economy, etc. \n- Research and pre-interview guests. \n- Maintain long term relationships with publicists and communications directors. \n- Pitch story ideas and provide guest suggestions. Up Late with Alec Baldwin, Booking Producer MSNBC September 2013  – Present (2 years) New York, NY - Helped create and launch a national, weekly news and entertainment program. \n-Book wide variety of national and international newsmakers, experts, and guests from various fields including politics, foreign relations, entertainment, business/economy, etc. \n- Research and pre-interview guests. \n- Maintain long term relationships with publicists and communications directors. \n- Pitch story ideas and provide guest suggestions. Up with Steve Kornacki, Booking Producer MSNBC April 2013  –  September 2013  (6 months) New York, NY -Book wide variety of national and international newsmakers, experts, and guests from various fields including politics, foreign relations, entertainment, business/economy, etc. \n- Research and pre-interview guests. \n- Maintain long term relationships with publicists and communications directors. \n- Pitch story ideas and provide guest suggestions. Up with Steve Kornacki, Booking Producer MSNBC April 2013  –  September 2013  (6 months) New York, NY -Book wide variety of national and international newsmakers, experts, and guests from various fields including politics, foreign relations, entertainment, business/economy, etc. \n- Research and pre-interview guests. \n- Maintain long term relationships with publicists and communications directors. \n- Pitch story ideas and provide guest suggestions. Viewpoint with Eliot Spitzer Current TV March 2012  –  April 2013  (1 year 2 months) Viewpoint with Eliot Spitzer Current TV March 2012  –  April 2013  (1 year 2 months) Booking Producer Countdown with Keith Olbermann - CurrentTV May 2011  –  March 2012  (11 months) Booking Producer Countdown with Keith Olbermann - CurrentTV May 2011  –  March 2012  (11 months) Booking Producer - The Rachel Maddow Show NBCUniversal, Inc. February 2009  –  May 2011  (2 years 4 months) Booking Producer - The Rachel Maddow Show NBCUniversal, Inc. February 2009  –  May 2011  (2 years 4 months) Booking Producer Air America Radio March 2006  –  February 2009  (3 years) Booking Producer Air America Radio March 2006  –  February 2009  (3 years) Skills Broadcast Editing Entertainment New Media Digital Media Journalism Skills  Broadcast Editing Entertainment New Media Digital Media Journalism Broadcast Editing Entertainment New Media Digital Media Journalism Broadcast Editing Entertainment New Media Digital Media Journalism Education Stony Brook University Stony Brook University Stony Brook University Stony Brook University ", "Summary -Award winning Producer with a successful track record of creating, supervising, producing, directing and writing projects for all media platforms.  \n \n-Skilled in overseeing top performing teams to produce successful content and product for live events, broadcast and cable television. \n \n-Seasoned Producer of documentaries, network news, specials and reality TV. \n \n-Producer of many projects with television journalist Maria Shriver - including those in news, entertainment and her annual Women's Conference of 20,000 attendees. \n \n-Producer of multiple documentaries with filmmaker Arnold Shapiro, including The Teen Files series which received two Primetime Emmys – as well as the “Governors Award”: the highest honor bestowed by the National Academy of Television Arts and Sciences. \n \n-Specialties: strong story, writing and production skills. Expert leader, communicator and collaborator who can oversee all aspects of a project from inception to delivery - and all while making it a successful and enjoyable experience for everyone involved. Summary -Award winning Producer with a successful track record of creating, supervising, producing, directing and writing projects for all media platforms.  \n \n-Skilled in overseeing top performing teams to produce successful content and product for live events, broadcast and cable television. \n \n-Seasoned Producer of documentaries, network news, specials and reality TV. \n \n-Producer of many projects with television journalist Maria Shriver - including those in news, entertainment and her annual Women's Conference of 20,000 attendees. \n \n-Producer of multiple documentaries with filmmaker Arnold Shapiro, including The Teen Files series which received two Primetime Emmys – as well as the “Governors Award”: the highest honor bestowed by the National Academy of Television Arts and Sciences. \n \n-Specialties: strong story, writing and production skills. Expert leader, communicator and collaborator who can oversee all aspects of a project from inception to delivery - and all while making it a successful and enjoyable experience for everyone involved. -Award winning Producer with a successful track record of creating, supervising, producing, directing and writing projects for all media platforms.  \n \n-Skilled in overseeing top performing teams to produce successful content and product for live events, broadcast and cable television. \n \n-Seasoned Producer of documentaries, network news, specials and reality TV. \n \n-Producer of many projects with television journalist Maria Shriver - including those in news, entertainment and her annual Women's Conference of 20,000 attendees. \n \n-Producer of multiple documentaries with filmmaker Arnold Shapiro, including The Teen Files series which received two Primetime Emmys – as well as the “Governors Award”: the highest honor bestowed by the National Academy of Television Arts and Sciences. \n \n-Specialties: strong story, writing and production skills. Expert leader, communicator and collaborator who can oversee all aspects of a project from inception to delivery - and all while making it a successful and enjoyable experience for everyone involved. -Award winning Producer with a successful track record of creating, supervising, producing, directing and writing projects for all media platforms.  \n \n-Skilled in overseeing top performing teams to produce successful content and product for live events, broadcast and cable television. \n \n-Seasoned Producer of documentaries, network news, specials and reality TV. \n \n-Producer of many projects with television journalist Maria Shriver - including those in news, entertainment and her annual Women's Conference of 20,000 attendees. \n \n-Producer of multiple documentaries with filmmaker Arnold Shapiro, including The Teen Files series which received two Primetime Emmys – as well as the “Governors Award”: the highest honor bestowed by the National Academy of Television Arts and Sciences. \n \n-Specialties: strong story, writing and production skills. Expert leader, communicator and collaborator who can oversee all aspects of a project from inception to delivery - and all while making it a successful and enjoyable experience for everyone involved. Experience Supervising Producer BRAVO / Monkey Television, LLC. April 2014  – Present (1 year 5 months) Greater Los Angeles Area BRAVO's \"Newlyweds: The First Year (Season 3) is a docu-reality series following the lives of four couples during their first year of marriage. Writer / Professional Storyteller ProStorytellers May 2011  – Present (4 years 4 months) Greater Los Angeles Area Co-Founder and Co-Owner of ProStorytellers, a social media marketing company working with clients to promote a person, product, idea, service or cause. Producer / Field Producer / Story Producer GRB Entertainment November 2012  –  May 2013  (7 months) WE TV's \"Pregnant & Dating\" is an eight hour, docu-reality series exploring the lives of 5 single, professional women who discover they are pregnant and will go about it solo. Writer / Producer / Field Producer / Story Producer The History Channel April 2012  –  October 2012  (7 months) Greater Los Angeles Area History Channel's \"Beyond 2012?\" is a six hour, non-fiction series exploring doomsday prophecies. Producer / Field Producer Discovery Communications February 2012  –  February 2012  (1 month) Burbank Discovery Channel's \"U.S. Marshal's: Alaska\" is a one-hour documentary following federal agents as they apprehend dangerous fugitives who are hiding out in Alaska. Field Producer Karga Seven Pictures September 2011  –  September 2011  (1 month) Greater Los Angeles Area An untitled/unspecified development \"sizzle\" reel. Field Producer Karga Seven Pictures August 2011  –  September 2011  (2 months) Los Angeles Travel Channel's \"Bizarre Collections\" is a one hour documentary profiling collectors of the bizarre. Field Producer / Field Director Discovery Communications August 2011  –  August 2011  (1 month) Greater Los Angeles Area An untitled/unspecified \"sizzle reel\" for Animal Planet. Producer / Camera / Writer / Editor The Women's Conference June 2010  –  November 2010  (6 months) Oversaw production of various live events at Maria Shriver's Women's Conference. Showrunner / Executive Producer / Co-Creator NBCUniversal, Inc. March 2009  –  December 2009  (10 months) Oxygen's \"The Naughty Kitchen with Chef Blythe Beck\" is an 8-hour docu-series following a Dallas-based chef on her quest for Total World Culinary Domination. Show Producer Scripps Networks Interactive September 2005  –  March 2008  (2 years 7 months) HGTV's \"National Open House\" is a half-hour docu-series profiling homeowners in great cities. Producer MSNBC July 2005  –  August 2005  (2 months) MSNBC's \"City in Fear,\" is a one-hour documentary profiling the Beltway Sniper attacks that plagued the DC Metro area in October 2002. Producer / Director / Writer Office of the First Lady of California October 2004  –  December 2004  (3 months) The \"Minerva Awards,\" honors women who have greatly contributed to the State of California. Field Producer CBS Television Studios October 2004  –  October 2004  (1 month) CBS News \"60 Minutes\" profile of Gov. Arnold Schwarzenegger's first year in office. Producer NBCUniversal, Inc. May 2004  –  September 2004  (5 months) NBC Universal's \"Siegfried & Roy: The Miracle with Maria Shriver\" is a one-hour documentary profiling Siegfried & Roy a year after an on-stage tiger attack nearly took Roy Horn's life. Producer NBCUniversal, Inc. February 2004  –  April 2004  (3 months) NBC Universal's \"Behind the Scenes Casting of 'The Apprentice'\". Field Coordinator Discovery Communications August 2003  –  January 2004  (6 months) Discovery Channel's \"C.I.: Coroner Investigator\" is a half-hour docu-series following an LA Country Coroner. Senior Writer UCLA February 2003  –  June 2003  (5 months) Senior Writer for UCLA's Chancellor. Producer CBS Television Distribution September 2000  –  November 2002  (2 years 3 months) CBS' \"DNA: Guilty or Innocent?\" is 2 one-hour documentaries examining the cases of convicted criminals who claim that DNA testing could prove their innocence. Associate Producer Fox Television 1993  –  1995  (2 years) FOX's \"Front Page\" national newsmagazine. Supervising Producer BRAVO / Monkey Television, LLC. April 2014  – Present (1 year 5 months) Greater Los Angeles Area BRAVO's \"Newlyweds: The First Year (Season 3) is a docu-reality series following the lives of four couples during their first year of marriage. Supervising Producer BRAVO / Monkey Television, LLC. April 2014  – Present (1 year 5 months) Greater Los Angeles Area BRAVO's \"Newlyweds: The First Year (Season 3) is a docu-reality series following the lives of four couples during their first year of marriage. Writer / Professional Storyteller ProStorytellers May 2011  – Present (4 years 4 months) Greater Los Angeles Area Co-Founder and Co-Owner of ProStorytellers, a social media marketing company working with clients to promote a person, product, idea, service or cause. Writer / Professional Storyteller ProStorytellers May 2011  – Present (4 years 4 months) Greater Los Angeles Area Co-Founder and Co-Owner of ProStorytellers, a social media marketing company working with clients to promote a person, product, idea, service or cause. Producer / Field Producer / Story Producer GRB Entertainment November 2012  –  May 2013  (7 months) WE TV's \"Pregnant & Dating\" is an eight hour, docu-reality series exploring the lives of 5 single, professional women who discover they are pregnant and will go about it solo. Producer / Field Producer / Story Producer GRB Entertainment November 2012  –  May 2013  (7 months) WE TV's \"Pregnant & Dating\" is an eight hour, docu-reality series exploring the lives of 5 single, professional women who discover they are pregnant and will go about it solo. Writer / Producer / Field Producer / Story Producer The History Channel April 2012  –  October 2012  (7 months) Greater Los Angeles Area History Channel's \"Beyond 2012?\" is a six hour, non-fiction series exploring doomsday prophecies. Writer / Producer / Field Producer / Story Producer The History Channel April 2012  –  October 2012  (7 months) Greater Los Angeles Area History Channel's \"Beyond 2012?\" is a six hour, non-fiction series exploring doomsday prophecies. Producer / Field Producer Discovery Communications February 2012  –  February 2012  (1 month) Burbank Discovery Channel's \"U.S. Marshal's: Alaska\" is a one-hour documentary following federal agents as they apprehend dangerous fugitives who are hiding out in Alaska. Producer / Field Producer Discovery Communications February 2012  –  February 2012  (1 month) Burbank Discovery Channel's \"U.S. Marshal's: Alaska\" is a one-hour documentary following federal agents as they apprehend dangerous fugitives who are hiding out in Alaska. Field Producer Karga Seven Pictures September 2011  –  September 2011  (1 month) Greater Los Angeles Area An untitled/unspecified development \"sizzle\" reel. Field Producer Karga Seven Pictures September 2011  –  September 2011  (1 month) Greater Los Angeles Area An untitled/unspecified development \"sizzle\" reel. Field Producer Karga Seven Pictures August 2011  –  September 2011  (2 months) Los Angeles Travel Channel's \"Bizarre Collections\" is a one hour documentary profiling collectors of the bizarre. Field Producer Karga Seven Pictures August 2011  –  September 2011  (2 months) Los Angeles Travel Channel's \"Bizarre Collections\" is a one hour documentary profiling collectors of the bizarre. Field Producer / Field Director Discovery Communications August 2011  –  August 2011  (1 month) Greater Los Angeles Area An untitled/unspecified \"sizzle reel\" for Animal Planet. Field Producer / Field Director Discovery Communications August 2011  –  August 2011  (1 month) Greater Los Angeles Area An untitled/unspecified \"sizzle reel\" for Animal Planet. Producer / Camera / Writer / Editor The Women's Conference June 2010  –  November 2010  (6 months) Oversaw production of various live events at Maria Shriver's Women's Conference. Producer / Camera / Writer / Editor The Women's Conference June 2010  –  November 2010  (6 months) Oversaw production of various live events at Maria Shriver's Women's Conference. Showrunner / Executive Producer / Co-Creator NBCUniversal, Inc. March 2009  –  December 2009  (10 months) Oxygen's \"The Naughty Kitchen with Chef Blythe Beck\" is an 8-hour docu-series following a Dallas-based chef on her quest for Total World Culinary Domination. Showrunner / Executive Producer / Co-Creator NBCUniversal, Inc. March 2009  –  December 2009  (10 months) Oxygen's \"The Naughty Kitchen with Chef Blythe Beck\" is an 8-hour docu-series following a Dallas-based chef on her quest for Total World Culinary Domination. Show Producer Scripps Networks Interactive September 2005  –  March 2008  (2 years 7 months) HGTV's \"National Open House\" is a half-hour docu-series profiling homeowners in great cities. Show Producer Scripps Networks Interactive September 2005  –  March 2008  (2 years 7 months) HGTV's \"National Open House\" is a half-hour docu-series profiling homeowners in great cities. Producer MSNBC July 2005  –  August 2005  (2 months) MSNBC's \"City in Fear,\" is a one-hour documentary profiling the Beltway Sniper attacks that plagued the DC Metro area in October 2002. Producer MSNBC July 2005  –  August 2005  (2 months) MSNBC's \"City in Fear,\" is a one-hour documentary profiling the Beltway Sniper attacks that plagued the DC Metro area in October 2002. Producer / Director / Writer Office of the First Lady of California October 2004  –  December 2004  (3 months) The \"Minerva Awards,\" honors women who have greatly contributed to the State of California. Producer / Director / Writer Office of the First Lady of California October 2004  –  December 2004  (3 months) The \"Minerva Awards,\" honors women who have greatly contributed to the State of California. Field Producer CBS Television Studios October 2004  –  October 2004  (1 month) CBS News \"60 Minutes\" profile of Gov. Arnold Schwarzenegger's first year in office. Field Producer CBS Television Studios October 2004  –  October 2004  (1 month) CBS News \"60 Minutes\" profile of Gov. Arnold Schwarzenegger's first year in office. Producer NBCUniversal, Inc. May 2004  –  September 2004  (5 months) NBC Universal's \"Siegfried & Roy: The Miracle with Maria Shriver\" is a one-hour documentary profiling Siegfried & Roy a year after an on-stage tiger attack nearly took Roy Horn's life. Producer NBCUniversal, Inc. May 2004  –  September 2004  (5 months) NBC Universal's \"Siegfried & Roy: The Miracle with Maria Shriver\" is a one-hour documentary profiling Siegfried & Roy a year after an on-stage tiger attack nearly took Roy Horn's life. Producer NBCUniversal, Inc. February 2004  –  April 2004  (3 months) NBC Universal's \"Behind the Scenes Casting of 'The Apprentice'\". Producer NBCUniversal, Inc. February 2004  –  April 2004  (3 months) NBC Universal's \"Behind the Scenes Casting of 'The Apprentice'\". Field Coordinator Discovery Communications August 2003  –  January 2004  (6 months) Discovery Channel's \"C.I.: Coroner Investigator\" is a half-hour docu-series following an LA Country Coroner. Field Coordinator Discovery Communications August 2003  –  January 2004  (6 months) Discovery Channel's \"C.I.: Coroner Investigator\" is a half-hour docu-series following an LA Country Coroner. Senior Writer UCLA February 2003  –  June 2003  (5 months) Senior Writer for UCLA's Chancellor. Senior Writer UCLA February 2003  –  June 2003  (5 months) Senior Writer for UCLA's Chancellor. Producer CBS Television Distribution September 2000  –  November 2002  (2 years 3 months) CBS' \"DNA: Guilty or Innocent?\" is 2 one-hour documentaries examining the cases of convicted criminals who claim that DNA testing could prove their innocence. Producer CBS Television Distribution September 2000  –  November 2002  (2 years 3 months) CBS' \"DNA: Guilty or Innocent?\" is 2 one-hour documentaries examining the cases of convicted criminals who claim that DNA testing could prove their innocence. Associate Producer Fox Television 1993  –  1995  (2 years) FOX's \"Front Page\" national newsmagazine. Associate Producer Fox Television 1993  –  1995  (2 years) FOX's \"Front Page\" national newsmagazine. Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Effective Communicator Strong Storyteller Highly Organized Public Relations Marketing Video Production Television Entertainment Producing Documentaries Broadcast Reality Film Casting Post Production Avid Film Production Final Cut Pro Storytelling Editing Directing Media Production See 7+     See less Skills  Effective Communicator Strong Storyteller Highly Organized Public Relations Marketing Video Production Television Entertainment Producing Documentaries Broadcast Reality Film Casting Post Production Avid Film Production Final Cut Pro Storytelling Editing Directing Media Production See 7+     See less Effective Communicator Strong Storyteller Highly Organized Public Relations Marketing Video Production Television Entertainment Producing Documentaries Broadcast Reality Film Casting Post Production Avid Film Production Final Cut Pro Storytelling Editing Directing Media Production See 7+     See less Effective Communicator Strong Storyteller Highly Organized Public Relations Marketing Video Production Television Entertainment Producing Documentaries Broadcast Reality Film Casting Post Production Avid Film Production Final Cut Pro Storytelling Editing Directing Media Production See 7+     See less Education Emerson College BS,  Mass Communication: Television Production 1990  – 1992 Activities and Societies:  EIV ,  EIIC: Maastricht Program ,  IRTS Summer Fellow 1992 European Institute for International Communication Political Presentational Styles of European Leaders 1991  – 1991 While receiving extensive study in EIIC's specialized program, I was also credentialed as a student journalist to report on the signing of the \"Maastricht Treaty\" forming the EU (European Union). De Anza College AA,  Speech/Communication 1987  – 1990 Emerson College BS,  Mass Communication: Television Production 1990  – 1992 Activities and Societies:  EIV ,  EIIC: Maastricht Program ,  IRTS Summer Fellow 1992 Emerson College BS,  Mass Communication: Television Production 1990  – 1992 Activities and Societies:  EIV ,  EIIC: Maastricht Program ,  IRTS Summer Fellow 1992 Emerson College BS,  Mass Communication: Television Production 1990  – 1992 Activities and Societies:  EIV ,  EIIC: Maastricht Program ,  IRTS Summer Fellow 1992 European Institute for International Communication Political Presentational Styles of European Leaders 1991  – 1991 While receiving extensive study in EIIC's specialized program, I was also credentialed as a student journalist to report on the signing of the \"Maastricht Treaty\" forming the EU (European Union). European Institute for International Communication Political Presentational Styles of European Leaders 1991  – 1991 While receiving extensive study in EIIC's specialized program, I was also credentialed as a student journalist to report on the signing of the \"Maastricht Treaty\" forming the EU (European Union). European Institute for International Communication Political Presentational Styles of European Leaders 1991  – 1991 While receiving extensive study in EIIC's specialized program, I was also credentialed as a student journalist to report on the signing of the \"Maastricht Treaty\" forming the EU (European Union). De Anza College AA,  Speech/Communication 1987  – 1990 De Anza College AA,  Speech/Communication 1987  – 1990 De Anza College AA,  Speech/Communication 1987  – 1990 Honors & Awards Additional Honors & Awards ACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: Surviving High School”\t \n(2000 – 2001)\t \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nGovernors Award\t \n“The Teen Files” 7-part series\t \n(2000) \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: The Truth About Drinking” \n(2000 – 2001)\t \n \nTHE MEDIA PROJECT\t \nSHINE AWARDS \nOutstanding Youth Program\t \n“The Teen Files: The Truth About Sex” \n(2000) \n \nINTERNATIONAL RADIO & TELEVISION SOCIETY\t \nSUMMER FELLOWSHIP \nSummer Fellow (NYC)\t \n(1992) Additional Honors & Awards ACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: Surviving High School”\t \n(2000 – 2001)\t \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nGovernors Award\t \n“The Teen Files” 7-part series\t \n(2000) \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: The Truth About Drinking” \n(2000 – 2001)\t \n \nTHE MEDIA PROJECT\t \nSHINE AWARDS \nOutstanding Youth Program\t \n“The Teen Files: The Truth About Sex” \n(2000) \n \nINTERNATIONAL RADIO & TELEVISION SOCIETY\t \nSUMMER FELLOWSHIP \nSummer Fellow (NYC)\t \n(1992) Additional Honors & Awards ACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: Surviving High School”\t \n(2000 – 2001)\t \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nGovernors Award\t \n“The Teen Files” 7-part series\t \n(2000) \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: The Truth About Drinking” \n(2000 – 2001)\t \n \nTHE MEDIA PROJECT\t \nSHINE AWARDS \nOutstanding Youth Program\t \n“The Teen Files: The Truth About Sex” \n(2000) \n \nINTERNATIONAL RADIO & TELEVISION SOCIETY\t \nSUMMER FELLOWSHIP \nSummer Fellow (NYC)\t \n(1992) Additional Honors & Awards ACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: Surviving High School”\t \n(2000 – 2001)\t \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nGovernors Award\t \n“The Teen Files” 7-part series\t \n(2000) \n \nACADEMY OF TELEVISION ARTS & SCIENCES\t \nPRIMETIME EMMY AWARDS\t \nOutstanding Children’s Program (Team Recognition)\t \n“The Teen Files: The Truth About Drinking” \n(2000 – 2001)\t \n \nTHE MEDIA PROJECT\t \nSHINE AWARDS \nOutstanding Youth Program\t \n“The Teen Files: The Truth About Sex” \n(2000) \n \nINTERNATIONAL RADIO & TELEVISION SOCIETY\t \nSUMMER FELLOWSHIP \nSummer Fellow (NYC)\t \n(1992) ", "Experience Senior Planning Producer, The Rachel Maddow Show MSNBC December 2014  – Present (9 months) I scour the news for stories to cover on the show. I'm also the creator/producer/writer/booker/talent wrangler/prize mailer/reluctant on-camera promoter of our Friday Night News Dump franchise. Producer, The Rachel Maddow Show MSNBC December 2009  –  December 2014  (5 years 1 month) I do show planning and segment producing for The Rachel Maddow Show on MSNBC. We won an Emmy in 2011 for Outstanding News Discussion and Analysis. Set Writer, Weekend Today NBC News October 2008  –  January 2010  (1 year 4 months) Producer CNBC July 2008  –  October 2008  (4 months) Producer of several episodes of special series about collaboration in business under auspices of primetime development VP. Editor National Public Radio September 2007  –  July 2008  (11 months) I was the editor of a 2-hour daily news-talk show for NPR News. I edited every segment and every script, along with providing guest booking advice and production advice to the writers and producers. I worked with the senior producer to identify newsworthy stories and futures and to figure out unique ways to cover them. I also reported stories on air regularly, wrote blog posts and appeared on video in tease segments for the next day's show. On an as needed basis I booked and produced interview segments and wrote news stories. Line Producer/Segment Producer MSNBC May 2002  –  September 2007  (5 years 5 months) Associate Producer Dan Aykroyd's Out There 2002  –  2002  (less than a year) Segment Producer/Researcher, \"The View\" ABC Television 2000  –  2001  (1 year) Producer The People's Court 1997  –  2000  (3 years) Literary Manager/Dramaturg George Street Playhouse 1994  –  1997  (3 years) Senior Planning Producer, The Rachel Maddow Show MSNBC December 2014  – Present (9 months) I scour the news for stories to cover on the show. I'm also the creator/producer/writer/booker/talent wrangler/prize mailer/reluctant on-camera promoter of our Friday Night News Dump franchise. Senior Planning Producer, The Rachel Maddow Show MSNBC December 2014  – Present (9 months) I scour the news for stories to cover on the show. I'm also the creator/producer/writer/booker/talent wrangler/prize mailer/reluctant on-camera promoter of our Friday Night News Dump franchise. Producer, The Rachel Maddow Show MSNBC December 2009  –  December 2014  (5 years 1 month) I do show planning and segment producing for The Rachel Maddow Show on MSNBC. We won an Emmy in 2011 for Outstanding News Discussion and Analysis. Producer, The Rachel Maddow Show MSNBC December 2009  –  December 2014  (5 years 1 month) I do show planning and segment producing for The Rachel Maddow Show on MSNBC. We won an Emmy in 2011 for Outstanding News Discussion and Analysis. Set Writer, Weekend Today NBC News October 2008  –  January 2010  (1 year 4 months) Set Writer, Weekend Today NBC News October 2008  –  January 2010  (1 year 4 months) Producer CNBC July 2008  –  October 2008  (4 months) Producer of several episodes of special series about collaboration in business under auspices of primetime development VP. Producer CNBC July 2008  –  October 2008  (4 months) Producer of several episodes of special series about collaboration in business under auspices of primetime development VP. Editor National Public Radio September 2007  –  July 2008  (11 months) I was the editor of a 2-hour daily news-talk show for NPR News. I edited every segment and every script, along with providing guest booking advice and production advice to the writers and producers. I worked with the senior producer to identify newsworthy stories and futures and to figure out unique ways to cover them. I also reported stories on air regularly, wrote blog posts and appeared on video in tease segments for the next day's show. On an as needed basis I booked and produced interview segments and wrote news stories. Editor National Public Radio September 2007  –  July 2008  (11 months) I was the editor of a 2-hour daily news-talk show for NPR News. I edited every segment and every script, along with providing guest booking advice and production advice to the writers and producers. I worked with the senior producer to identify newsworthy stories and futures and to figure out unique ways to cover them. I also reported stories on air regularly, wrote blog posts and appeared on video in tease segments for the next day's show. On an as needed basis I booked and produced interview segments and wrote news stories. Line Producer/Segment Producer MSNBC May 2002  –  September 2007  (5 years 5 months) Line Producer/Segment Producer MSNBC May 2002  –  September 2007  (5 years 5 months) Associate Producer Dan Aykroyd's Out There 2002  –  2002  (less than a year) Associate Producer Dan Aykroyd's Out There 2002  –  2002  (less than a year) Segment Producer/Researcher, \"The View\" ABC Television 2000  –  2001  (1 year) Segment Producer/Researcher, \"The View\" ABC Television 2000  –  2001  (1 year) Producer The People's Court 1997  –  2000  (3 years) Producer The People's Court 1997  –  2000  (3 years) Literary Manager/Dramaturg George Street Playhouse 1994  –  1997  (3 years) Literary Manager/Dramaturg George Street Playhouse 1994  –  1997  (3 years) Education University of California, San Diego MFA 1991  – 1994 Delaware Valley Central School Diploma Smith College BA University of California, San Diego MFA 1991  – 1994 University of California, San Diego MFA 1991  – 1994 University of California, San Diego MFA 1991  – 1994 Delaware Valley Central School Diploma Delaware Valley Central School Diploma Delaware Valley Central School Diploma Smith College BA Smith College BA Smith College BA Honors & Awards Additional Honors & Awards 3-time \"Jeopardy!\" champion Additional Honors & Awards 3-time \"Jeopardy!\" champion Additional Honors & Awards 3-time \"Jeopardy!\" champion Additional Honors & Awards 3-time \"Jeopardy!\" champion ", "Summary Stephen J. Lewis \nE-Mail: stephenjospehlewis@gmail.com \n \n \nSteve Lewis has held executive positions in television news, radio and entertainment programming for 30 years – from the start-up of “ABC News Nightline” to the launch of the cable news channel, MSNBC.Lewis is currently a television production and public relations consultant. \n \nPreviously, Lewis was a TV news Executive Producer and Adjunct Professor of Journalism at The George Washington University. In addition, Lewis worked in radio, consulting WNYC in New York on new programming ventures and XM Satellite Radio on a new women’s lifestyle channel. \n \nLewis has been the recipient of the most distinguished awards in television, including five Emmy Awards, the Alfred I. DuPont-Columbia University Award and the George Foster Peabody Award. He currently serves as a judge for the Robert F. Kennedy Journalism Awards. Summary Stephen J. Lewis \nE-Mail: stephenjospehlewis@gmail.com \n \n \nSteve Lewis has held executive positions in television news, radio and entertainment programming for 30 years – from the start-up of “ABC News Nightline” to the launch of the cable news channel, MSNBC.Lewis is currently a television production and public relations consultant. \n \nPreviously, Lewis was a TV news Executive Producer and Adjunct Professor of Journalism at The George Washington University. In addition, Lewis worked in radio, consulting WNYC in New York on new programming ventures and XM Satellite Radio on a new women’s lifestyle channel. \n \nLewis has been the recipient of the most distinguished awards in television, including five Emmy Awards, the Alfred I. DuPont-Columbia University Award and the George Foster Peabody Award. He currently serves as a judge for the Robert F. Kennedy Journalism Awards. Stephen J. Lewis \nE-Mail: stephenjospehlewis@gmail.com \n \n \nSteve Lewis has held executive positions in television news, radio and entertainment programming for 30 years – from the start-up of “ABC News Nightline” to the launch of the cable news channel, MSNBC.Lewis is currently a television production and public relations consultant. \n \nPreviously, Lewis was a TV news Executive Producer and Adjunct Professor of Journalism at The George Washington University. In addition, Lewis worked in radio, consulting WNYC in New York on new programming ventures and XM Satellite Radio on a new women’s lifestyle channel. \n \nLewis has been the recipient of the most distinguished awards in television, including five Emmy Awards, the Alfred I. DuPont-Columbia University Award and the George Foster Peabody Award. He currently serves as a judge for the Robert F. Kennedy Journalism Awards. Stephen J. Lewis \nE-Mail: stephenjospehlewis@gmail.com \n \n \nSteve Lewis has held executive positions in television news, radio and entertainment programming for 30 years – from the start-up of “ABC News Nightline” to the launch of the cable news channel, MSNBC.Lewis is currently a television production and public relations consultant. \n \nPreviously, Lewis was a TV news Executive Producer and Adjunct Professor of Journalism at The George Washington University. In addition, Lewis worked in radio, consulting WNYC in New York on new programming ventures and XM Satellite Radio on a new women’s lifestyle channel. \n \nLewis has been the recipient of the most distinguished awards in television, including five Emmy Awards, the Alfred I. DuPont-Columbia University Award and the George Foster Peabody Award. He currently serves as a judge for the Robert F. Kennedy Journalism Awards. Experience Producer, THE LAST WORD WITH LAWRENCE O'DONNELL MSNBC September 2010  – Present (5 years) Independent TV Producer & Public Relations Consultant Lewis Communications January 2009  –  August 2010  (1 year 8 months) Worked on series for HISTORY and DISCOVERY. For HISTORY, served as a producer on AMERICA: THE STORY OF US, a 13-part series covering Jamestown to the election of Barack Obama. For DISCOVERY, served as a producer on THE CURIOSITY PROJECT and on a 9/11 documentary Senior Producer Retirement Living TV November 2006  –  February 2009  (2 years 4 months) Consultant WNYC Radio 2006  –  2007  (1 year) Served as consultant on the morning program, THE TAKEAWAY. Identified talent for the program Adjunct Professor of Journalism George Washington University September 2006  –  December 2006  (4 months) Taught introduction to Broadcast Journalism. Executive Producer Sirius XM Radio Inc. 2005  –  2006  (1 year) Consulted on start-up of XM Channel 155, \"Take Five,\" a channel directed toward programming of interest to women. Executive Producer CNBC 2002  –  2004  (2 years) Executive Producer MSNBC January 2001  –  July 2002  (1 year 7 months) Served as Ombudsman for the 24-hour cable news network and principal liaison between MSNBC-TV and MSNBC.com Executive Producer, EQUAL TIME WITH OLIVER NORTH & PAUL BEGALA MSNBC 1999  –  2000  (1 year) Produced EQUAL TIME with Oliver North & Paul Begala. Senior Producer, \"EQUAL TIME WITH BAY BUCHANAN & LAWRENCE O'DONNELL\" & \"CHARLES GRODIN\" MSNBC September 1998  –  February 1999  (6 months) Produced EQUAL TIME with Bay Buchanan and Lawrence O'Donnell. Producer THE CHARLES GRODIN SHOW. Senior Producer MSNBC April 1996  –  September 1998  (2 years 6 months) One of the top executives who launched the 24-hour NBC News cable news network. Supervised all live booking for dayside programming. Managed a staff of 30. Consultant Lifetime Television 1995  –  1996  (1 year) Produced two non-fiction programs, LATE DATE and TALK IT OVER. Producer MCA-TV 1995  –  1996  (1 year) Producer on late-night talk show developed by Brandon Tarticoff. Consultant Disney ABC Television Group 1995  –  1995  (less than a year) Produced video presentation for Walt Disney Annual Meeting Senior Producer, GOOD MORNING AMERICA ABC Television October 1992  –  August 1994  (1 year 11 months) Supervised a staff about 125 employees. Project producer for broadcasts from Saudi Arabia and Hong Kong as well as various domestic remote locations. Line Producer, GOOD MORNING AMERICA ABC Television October 1988  –  October 1992  (4 years 1 month) Editorial Producer, GOOD MORNING AMERICA ABC Television February 1986  –  October 1988  (2 years 9 months) Producer, ABC NEWS NIGHTLINE ABC News April 1984  –  February 1986  (1 year 11 months) Associate Producer, ABC NEWS NIGHTLINE ABC News January 1982  –  March 1984  (2 years 3 months) Booked guests for the late-night news program anchored by Ted Koppel. Press Representative, ABC NEWS NIGHTLINE ABC Television March 1980  –  December 1981  (1 year 10 months) Public Relations Assistant ABC Television March 1978  –  February 1980  (2 years) Producer, THE LAST WORD WITH LAWRENCE O'DONNELL MSNBC September 2010  – Present (5 years) Producer, THE LAST WORD WITH LAWRENCE O'DONNELL MSNBC September 2010  – Present (5 years) Independent TV Producer & Public Relations Consultant Lewis Communications January 2009  –  August 2010  (1 year 8 months) Worked on series for HISTORY and DISCOVERY. For HISTORY, served as a producer on AMERICA: THE STORY OF US, a 13-part series covering Jamestown to the election of Barack Obama. For DISCOVERY, served as a producer on THE CURIOSITY PROJECT and on a 9/11 documentary Independent TV Producer & Public Relations Consultant Lewis Communications January 2009  –  August 2010  (1 year 8 months) Worked on series for HISTORY and DISCOVERY. For HISTORY, served as a producer on AMERICA: THE STORY OF US, a 13-part series covering Jamestown to the election of Barack Obama. For DISCOVERY, served as a producer on THE CURIOSITY PROJECT and on a 9/11 documentary Senior Producer Retirement Living TV November 2006  –  February 2009  (2 years 4 months) Senior Producer Retirement Living TV November 2006  –  February 2009  (2 years 4 months) Consultant WNYC Radio 2006  –  2007  (1 year) Served as consultant on the morning program, THE TAKEAWAY. Identified talent for the program Consultant WNYC Radio 2006  –  2007  (1 year) Served as consultant on the morning program, THE TAKEAWAY. Identified talent for the program Adjunct Professor of Journalism George Washington University September 2006  –  December 2006  (4 months) Taught introduction to Broadcast Journalism. Adjunct Professor of Journalism George Washington University September 2006  –  December 2006  (4 months) Taught introduction to Broadcast Journalism. Executive Producer Sirius XM Radio Inc. 2005  –  2006  (1 year) Consulted on start-up of XM Channel 155, \"Take Five,\" a channel directed toward programming of interest to women. Executive Producer Sirius XM Radio Inc. 2005  –  2006  (1 year) Consulted on start-up of XM Channel 155, \"Take Five,\" a channel directed toward programming of interest to women. Executive Producer CNBC 2002  –  2004  (2 years) Executive Producer CNBC 2002  –  2004  (2 years) Executive Producer MSNBC January 2001  –  July 2002  (1 year 7 months) Served as Ombudsman for the 24-hour cable news network and principal liaison between MSNBC-TV and MSNBC.com Executive Producer MSNBC January 2001  –  July 2002  (1 year 7 months) Served as Ombudsman for the 24-hour cable news network and principal liaison between MSNBC-TV and MSNBC.com Executive Producer, EQUAL TIME WITH OLIVER NORTH & PAUL BEGALA MSNBC 1999  –  2000  (1 year) Produced EQUAL TIME with Oliver North & Paul Begala. Executive Producer, EQUAL TIME WITH OLIVER NORTH & PAUL BEGALA MSNBC 1999  –  2000  (1 year) Produced EQUAL TIME with Oliver North & Paul Begala. Senior Producer, \"EQUAL TIME WITH BAY BUCHANAN & LAWRENCE O'DONNELL\" & \"CHARLES GRODIN\" MSNBC September 1998  –  February 1999  (6 months) Produced EQUAL TIME with Bay Buchanan and Lawrence O'Donnell. Producer THE CHARLES GRODIN SHOW. Senior Producer, \"EQUAL TIME WITH BAY BUCHANAN & LAWRENCE O'DONNELL\" & \"CHARLES GRODIN\" MSNBC September 1998  –  February 1999  (6 months) Produced EQUAL TIME with Bay Buchanan and Lawrence O'Donnell. Producer THE CHARLES GRODIN SHOW. Senior Producer MSNBC April 1996  –  September 1998  (2 years 6 months) One of the top executives who launched the 24-hour NBC News cable news network. Supervised all live booking for dayside programming. Managed a staff of 30. Senior Producer MSNBC April 1996  –  September 1998  (2 years 6 months) One of the top executives who launched the 24-hour NBC News cable news network. Supervised all live booking for dayside programming. Managed a staff of 30. Consultant Lifetime Television 1995  –  1996  (1 year) Produced two non-fiction programs, LATE DATE and TALK IT OVER. Consultant Lifetime Television 1995  –  1996  (1 year) Produced two non-fiction programs, LATE DATE and TALK IT OVER. Producer MCA-TV 1995  –  1996  (1 year) Producer on late-night talk show developed by Brandon Tarticoff. Producer MCA-TV 1995  –  1996  (1 year) Producer on late-night talk show developed by Brandon Tarticoff. Consultant Disney ABC Television Group 1995  –  1995  (less than a year) Produced video presentation for Walt Disney Annual Meeting Consultant Disney ABC Television Group 1995  –  1995  (less than a year) Produced video presentation for Walt Disney Annual Meeting Senior Producer, GOOD MORNING AMERICA ABC Television October 1992  –  August 1994  (1 year 11 months) Supervised a staff about 125 employees. Project producer for broadcasts from Saudi Arabia and Hong Kong as well as various domestic remote locations. Senior Producer, GOOD MORNING AMERICA ABC Television October 1992  –  August 1994  (1 year 11 months) Supervised a staff about 125 employees. Project producer for broadcasts from Saudi Arabia and Hong Kong as well as various domestic remote locations. Line Producer, GOOD MORNING AMERICA ABC Television October 1988  –  October 1992  (4 years 1 month) Line Producer, GOOD MORNING AMERICA ABC Television October 1988  –  October 1992  (4 years 1 month) Editorial Producer, GOOD MORNING AMERICA ABC Television February 1986  –  October 1988  (2 years 9 months) Editorial Producer, GOOD MORNING AMERICA ABC Television February 1986  –  October 1988  (2 years 9 months) Producer, ABC NEWS NIGHTLINE ABC News April 1984  –  February 1986  (1 year 11 months) Producer, ABC NEWS NIGHTLINE ABC News April 1984  –  February 1986  (1 year 11 months) Associate Producer, ABC NEWS NIGHTLINE ABC News January 1982  –  March 1984  (2 years 3 months) Booked guests for the late-night news program anchored by Ted Koppel. Associate Producer, ABC NEWS NIGHTLINE ABC News January 1982  –  March 1984  (2 years 3 months) Booked guests for the late-night news program anchored by Ted Koppel. Press Representative, ABC NEWS NIGHTLINE ABC Television March 1980  –  December 1981  (1 year 10 months) Press Representative, ABC NEWS NIGHTLINE ABC Television March 1980  –  December 1981  (1 year 10 months) Public Relations Assistant ABC Television March 1978  –  February 1980  (2 years) Public Relations Assistant ABC Television March 1978  –  February 1980  (2 years) Skills PowerPoint Microsoft Excel Video Production Microsoft Office Public Relations Customer Service Television Journalism Broadcast Microsoft Word Skills  PowerPoint Microsoft Excel Video Production Microsoft Office Public Relations Customer Service Television Journalism Broadcast Microsoft Word PowerPoint Microsoft Excel Video Production Microsoft Office Public Relations Customer Service Television Journalism Broadcast Microsoft Word PowerPoint Microsoft Excel Video Production Microsoft Office Public Relations Customer Service Television Journalism Broadcast Microsoft Word Education The George Washington University Bachelor of Business Administration (BBA),  Business/Marketing 1971  – 1975 The George Washington University Bachelor of Business Administration (BBA),  Business/Marketing 1971  – 1975 The George Washington University Bachelor of Business Administration (BBA),  Business/Marketing 1971  – 1975 The George Washington University Bachelor of Business Administration (BBA),  Business/Marketing 1971  – 1975 ", "Experience Executive Producer Gasol Foundation 2015  – Present (less than a year) Producer/Director, \"Dr. Phil\" CBS Television Studios August 2013  – Present (2 years 1 month) Director's Guild of America \n \n Producer, \"MSNBC: Your Business\" MSNBC 2012  – Present (3 years) Freelance Producer/Writer, \"Fashion Police; Joan River's 80th Birthday\" Specials E! Networks July 2013  –  July 2013  (1 month) Commercial Writer(Marshalls/USA Network, Hautelook) Stun Creative January 2013  –  March 2013  (3 months) Freelance Show Producer, \"Popped: Rihanna\" Fuse TV March 2012  –  June 2012  (4 months) Greater Los Angeles Area Executive Producer, \"Little Black Dress Vodka:Celebrating Life's Flavors\" KIN Community January 2012  –  February 2012  (2 months) Produced 6 episodes of \"Little Black Dress Vodka: Celebrating Life's Flavors\"​ for LBD's digital/social media campaign with Brown Forman and DECA/Kin Community. \n Senior Show Producer, \"Scouted to Stardom\" Special E! Networks September 2011  –  December 2011  (4 months) Los Angeles, CA Executive Producer, \"Her Say\" with Soleil Moon Frye for MSN, Kraft and Deca Digitas Classic March 2011  –  September 2011  (7 months) Santa Monica, CA -Produced \"Her Say,\" a daily, KRAFT branded talk-show series for MSN. - \n-Brands included Oreo, Capri Sun, Kraft Singles and Philadelphia Cream Cheese. Senior Producer, \"Miss America Behind the Curtain\" TLC/Comcast Studios November 2009  –  February 2010  (4 months) Los Angeles, CA Producer in Charge of West Coast Production, \"MSNBC: Entertainment Hot List\" MSNBC September 2004  –  January 2006  (1 year 5 months) Los Angeles, CA -Developed, launched and oversaw the West Coast production of a weekly, hour-long show that featured the best of the best in music, fashion, beauty, design, television and travel. \n-Produced in-depth coverage of every major award show including the Grammys, Oscars, Gold Globes and SAG Awards. Producer in Charge of West Coast Production, \"MSNBC: At the Movies\" MSNBC September 2004  –  January 2006  (1 year 5 months) Supervising Producer, \"Style: Live at the Oscars\"​ and \"Style: Live at the Golden Globes Style Network October 2003  –  April 2004  (7 months) Los Angeles, CA Supervising Producer, \"The Look for Less\" style./E! September 2002  –  September 2003  (1 year 1 month) Entertainment News, Live Events Producer CNN May 2003  –  August 2003  (4 months) Series/Live Events/Development Producer E!/Style Networks January 2001  –  June 2002  (1 year 6 months) Los Angeles, CA -Produced the pilot and first season of \"Style Star\"​ \n-Produced the pilot and first season of \"Style Essentials 101\"​ \n-Produced style. network specials including \"Kevyn Aucoin: A Style Tribute\"​ \n-Produced episodes of \"Shabby Chic with Rachel Ashwell,\"​ \"Area\"​ and \"The Look for Less\" \n-Produced live fashion week coverage Entertainment News Producer, Associate Producer CNN June 1996  –  January 2001  (4 years 8 months) Hollywood, CA \"Showbiz Today\" Executive Producer Gasol Foundation 2015  – Present (less than a year) Executive Producer Gasol Foundation 2015  – Present (less than a year) Producer/Director, \"Dr. Phil\" CBS Television Studios August 2013  – Present (2 years 1 month) Director's Guild of America \n \n Producer/Director, \"Dr. Phil\" CBS Television Studios August 2013  – Present (2 years 1 month) Director's Guild of America \n \n Producer, \"MSNBC: Your Business\" MSNBC 2012  – Present (3 years) Freelance Producer, \"MSNBC: Your Business\" MSNBC 2012  – Present (3 years) Freelance Producer/Writer, \"Fashion Police; Joan River's 80th Birthday\" Specials E! Networks July 2013  –  July 2013  (1 month) Producer/Writer, \"Fashion Police; Joan River's 80th Birthday\" Specials E! Networks July 2013  –  July 2013  (1 month) Commercial Writer(Marshalls/USA Network, Hautelook) Stun Creative January 2013  –  March 2013  (3 months) Freelance Commercial Writer(Marshalls/USA Network, Hautelook) Stun Creative January 2013  –  March 2013  (3 months) Freelance Show Producer, \"Popped: Rihanna\" Fuse TV March 2012  –  June 2012  (4 months) Greater Los Angeles Area Show Producer, \"Popped: Rihanna\" Fuse TV March 2012  –  June 2012  (4 months) Greater Los Angeles Area Executive Producer, \"Little Black Dress Vodka:Celebrating Life's Flavors\" KIN Community January 2012  –  February 2012  (2 months) Produced 6 episodes of \"Little Black Dress Vodka: Celebrating Life's Flavors\"​ for LBD's digital/social media campaign with Brown Forman and DECA/Kin Community. \n Executive Producer, \"Little Black Dress Vodka:Celebrating Life's Flavors\" KIN Community January 2012  –  February 2012  (2 months) Produced 6 episodes of \"Little Black Dress Vodka: Celebrating Life's Flavors\"​ for LBD's digital/social media campaign with Brown Forman and DECA/Kin Community. \n Senior Show Producer, \"Scouted to Stardom\" Special E! Networks September 2011  –  December 2011  (4 months) Los Angeles, CA Senior Show Producer, \"Scouted to Stardom\" Special E! Networks September 2011  –  December 2011  (4 months) Los Angeles, CA Executive Producer, \"Her Say\" with Soleil Moon Frye for MSN, Kraft and Deca Digitas Classic March 2011  –  September 2011  (7 months) Santa Monica, CA -Produced \"Her Say,\" a daily, KRAFT branded talk-show series for MSN. - \n-Brands included Oreo, Capri Sun, Kraft Singles and Philadelphia Cream Cheese. Executive Producer, \"Her Say\" with Soleil Moon Frye for MSN, Kraft and Deca Digitas Classic March 2011  –  September 2011  (7 months) Santa Monica, CA -Produced \"Her Say,\" a daily, KRAFT branded talk-show series for MSN. - \n-Brands included Oreo, Capri Sun, Kraft Singles and Philadelphia Cream Cheese. Senior Producer, \"Miss America Behind the Curtain\" TLC/Comcast Studios November 2009  –  February 2010  (4 months) Los Angeles, CA Senior Producer, \"Miss America Behind the Curtain\" TLC/Comcast Studios November 2009  –  February 2010  (4 months) Los Angeles, CA Producer in Charge of West Coast Production, \"MSNBC: Entertainment Hot List\" MSNBC September 2004  –  January 2006  (1 year 5 months) Los Angeles, CA -Developed, launched and oversaw the West Coast production of a weekly, hour-long show that featured the best of the best in music, fashion, beauty, design, television and travel. \n-Produced in-depth coverage of every major award show including the Grammys, Oscars, Gold Globes and SAG Awards. Producer in Charge of West Coast Production, \"MSNBC: Entertainment Hot List\" MSNBC September 2004  –  January 2006  (1 year 5 months) Los Angeles, CA -Developed, launched and oversaw the West Coast production of a weekly, hour-long show that featured the best of the best in music, fashion, beauty, design, television and travel. \n-Produced in-depth coverage of every major award show including the Grammys, Oscars, Gold Globes and SAG Awards. Producer in Charge of West Coast Production, \"MSNBC: At the Movies\" MSNBC September 2004  –  January 2006  (1 year 5 months) Producer in Charge of West Coast Production, \"MSNBC: At the Movies\" MSNBC September 2004  –  January 2006  (1 year 5 months) Supervising Producer, \"Style: Live at the Oscars\"​ and \"Style: Live at the Golden Globes Style Network October 2003  –  April 2004  (7 months) Los Angeles, CA Supervising Producer, \"Style: Live at the Oscars\"​ and \"Style: Live at the Golden Globes Style Network October 2003  –  April 2004  (7 months) Los Angeles, CA Supervising Producer, \"The Look for Less\" style./E! September 2002  –  September 2003  (1 year 1 month) Supervising Producer, \"The Look for Less\" style./E! September 2002  –  September 2003  (1 year 1 month) Entertainment News, Live Events Producer CNN May 2003  –  August 2003  (4 months) Entertainment News, Live Events Producer CNN May 2003  –  August 2003  (4 months) Series/Live Events/Development Producer E!/Style Networks January 2001  –  June 2002  (1 year 6 months) Los Angeles, CA -Produced the pilot and first season of \"Style Star\"​ \n-Produced the pilot and first season of \"Style Essentials 101\"​ \n-Produced style. network specials including \"Kevyn Aucoin: A Style Tribute\"​ \n-Produced episodes of \"Shabby Chic with Rachel Ashwell,\"​ \"Area\"​ and \"The Look for Less\" \n-Produced live fashion week coverage Series/Live Events/Development Producer E!/Style Networks January 2001  –  June 2002  (1 year 6 months) Los Angeles, CA -Produced the pilot and first season of \"Style Star\"​ \n-Produced the pilot and first season of \"Style Essentials 101\"​ \n-Produced style. network specials including \"Kevyn Aucoin: A Style Tribute\"​ \n-Produced episodes of \"Shabby Chic with Rachel Ashwell,\"​ \"Area\"​ and \"The Look for Less\" \n-Produced live fashion week coverage Entertainment News Producer, Associate Producer CNN June 1996  –  January 2001  (4 years 8 months) Hollywood, CA \"Showbiz Today\" Entertainment News Producer, Associate Producer CNN June 1996  –  January 2001  (4 years 8 months) Hollywood, CA \"Showbiz Today\" Languages English English English Skills Film Final Cut Pro, Avid Video Production Television Integrated Marketing Producing Broadcast Skills  Film Final Cut Pro, Avid Video Production Television Integrated Marketing Producing Broadcast Film Final Cut Pro, Avid Video Production Television Integrated Marketing Producing Broadcast Film Final Cut Pro, Avid Video Production Television Integrated Marketing Producing Broadcast Honors & Awards ", "Summary SUMMARY OF QUALIFICATIONS \n \nSenior level TV and multi-platform news producer and writer with expertise in managing production teams in a deadline-driven live environment. Depth of experience includes a variety of senior roles and expertise in domestic, international and business news at broadcast, cable news networks and multimedia services. Summary SUMMARY OF QUALIFICATIONS \n \nSenior level TV and multi-platform news producer and writer with expertise in managing production teams in a deadline-driven live environment. Depth of experience includes a variety of senior roles and expertise in domestic, international and business news at broadcast, cable news networks and multimedia services. SUMMARY OF QUALIFICATIONS \n \nSenior level TV and multi-platform news producer and writer with expertise in managing production teams in a deadline-driven live environment. Depth of experience includes a variety of senior roles and expertise in domestic, international and business news at broadcast, cable news networks and multimedia services. SUMMARY OF QUALIFICATIONS \n \nSenior level TV and multi-platform news producer and writer with expertise in managing production teams in a deadline-driven live environment. Depth of experience includes a variety of senior roles and expertise in domestic, international and business news at broadcast, cable news networks and multimedia services. Experience Segment Producer MSNBC February 2013  – Present (2 years 7 months) New York, New York Research, write and produce segments for MSNBC's weekend afternoon political news programs. Freelance Producer/Writer Independent Productions June 2012  –  February 2013  (9 months) New York Produce and write segments for msnbc's weekend political news broadcasts. \n \nProduce and write segments for CNN-HLN’s Jane Velez Mitchell show. Responsibilities include research, writing, and preparation of visual elements for guest segments. Producer/Writer/Copy Editor Bloomberg September 2010  –  March 2012  (1 year 7 months) New York, New York •\tProduced and wrote “Taking Stock” – a live afternoon program featuring interviews with CEO’s, leading money managers and political economists focusing on global events and how they shape the decisions of successful investors \n•\tMentored writers and producers to improve the style and accuracy of their writing, and to better use dynamic visual elements to make stories clear and compelling \n•\tTrained reporters to improve their on-air presentation Writer/Producer CNN October 2006  –  October 2010  (4 years 1 month) Reported, wrote and produced stories on government regulation, foreign policy, and domestic security issues for Lou Dobbs Tonight, a live evening news and opinion program Senior Producer CNBC August 2005  –  August 2006  (1 year 1 month) Created and produced new program for CNBC's weekend primetime programming Senior Executive Producer CNN FINANCIAL NEWS January 2000  –  January 2005  (5 years 1 month) •\tExecutive Producer of CNN’s weekend business news programs: Moneyline Weekend, Pinnacle and Business Unusual \n•\tExecutive Producer for CNNfn, CNN’s financial news network; produced 5 hours of programming daily, including Market Call, the network’s market open show and Your Money, a personal finance show that offered different levels of advice in an interactive format with viewer calls and email  \n•\tMentored and trained and supervised more than 20 staff members Producer MSNBC TELEVISION January 1996  –  January 1999  (3 years 1 month) •\tCo-created and produced daily segments for MSNBC using the Internet as a reporting tool; these segments were among the first to use Internet content in TV news segments \n•\tProduced consumer technology segments \n•\tEnhanced the network’s reporting on domestic and international events through the use of use of the World Wide Web as a news gathering source Multimedia News & Features Manager THE PRODIGY SERVICE January 1992  –  January 1996  (4 years 1 month) Manager Multimedia, News and Features \nManaged a unit of writers, editors and producers responsible for online news and entertainment sections; developed web sites for Prodigy's internet-based service \nAs a consultant, developed consumer applications for the Prodigy Service; redesigned existing applications; edited and wrote news copy; edited computer and feature columns Executive Producer HILL AND KNOWLTON PUBLIC RELATIONS January 1990  –  January 1993  (3 years 1 month) Produced and directed television, video and film programs for Hill and Knowlton clients such as Chrysler and Kodak INDEPENDENT PRODUCER Independent January 1987  –  January 1990  (3 years 1 month) Bureau Chief, Producer CBS News January 1971  –  January 1987  (16 years 1 month) Produced news coverage in the United States, Europe, the Middle East and Latin America for CBS News \nAmong positions held: Tel Aviv Bureau Chief, Latin America producer, Morning News producer \nAs Tel Aviv Bureau Chief, responsible for CBS News coverage in much of the Middle East, running a bureau with a $3.5 million yearly budget and 30 employees Segment Producer MSNBC February 2013  – Present (2 years 7 months) New York, New York Research, write and produce segments for MSNBC's weekend afternoon political news programs. Segment Producer MSNBC February 2013  – Present (2 years 7 months) New York, New York Research, write and produce segments for MSNBC's weekend afternoon political news programs. Freelance Producer/Writer Independent Productions June 2012  –  February 2013  (9 months) New York Produce and write segments for msnbc's weekend political news broadcasts. \n \nProduce and write segments for CNN-HLN’s Jane Velez Mitchell show. Responsibilities include research, writing, and preparation of visual elements for guest segments. Freelance Producer/Writer Independent Productions June 2012  –  February 2013  (9 months) New York Produce and write segments for msnbc's weekend political news broadcasts. \n \nProduce and write segments for CNN-HLN’s Jane Velez Mitchell show. Responsibilities include research, writing, and preparation of visual elements for guest segments. Producer/Writer/Copy Editor Bloomberg September 2010  –  March 2012  (1 year 7 months) New York, New York •\tProduced and wrote “Taking Stock” – a live afternoon program featuring interviews with CEO’s, leading money managers and political economists focusing on global events and how they shape the decisions of successful investors \n•\tMentored writers and producers to improve the style and accuracy of their writing, and to better use dynamic visual elements to make stories clear and compelling \n•\tTrained reporters to improve their on-air presentation Producer/Writer/Copy Editor Bloomberg September 2010  –  March 2012  (1 year 7 months) New York, New York •\tProduced and wrote “Taking Stock” – a live afternoon program featuring interviews with CEO’s, leading money managers and political economists focusing on global events and how they shape the decisions of successful investors \n•\tMentored writers and producers to improve the style and accuracy of their writing, and to better use dynamic visual elements to make stories clear and compelling \n•\tTrained reporters to improve their on-air presentation Writer/Producer CNN October 2006  –  October 2010  (4 years 1 month) Reported, wrote and produced stories on government regulation, foreign policy, and domestic security issues for Lou Dobbs Tonight, a live evening news and opinion program Writer/Producer CNN October 2006  –  October 2010  (4 years 1 month) Reported, wrote and produced stories on government regulation, foreign policy, and domestic security issues for Lou Dobbs Tonight, a live evening news and opinion program Senior Producer CNBC August 2005  –  August 2006  (1 year 1 month) Created and produced new program for CNBC's weekend primetime programming Senior Producer CNBC August 2005  –  August 2006  (1 year 1 month) Created and produced new program for CNBC's weekend primetime programming Senior Executive Producer CNN FINANCIAL NEWS January 2000  –  January 2005  (5 years 1 month) •\tExecutive Producer of CNN’s weekend business news programs: Moneyline Weekend, Pinnacle and Business Unusual \n•\tExecutive Producer for CNNfn, CNN’s financial news network; produced 5 hours of programming daily, including Market Call, the network’s market open show and Your Money, a personal finance show that offered different levels of advice in an interactive format with viewer calls and email  \n•\tMentored and trained and supervised more than 20 staff members Senior Executive Producer CNN FINANCIAL NEWS January 2000  –  January 2005  (5 years 1 month) •\tExecutive Producer of CNN’s weekend business news programs: Moneyline Weekend, Pinnacle and Business Unusual \n•\tExecutive Producer for CNNfn, CNN’s financial news network; produced 5 hours of programming daily, including Market Call, the network’s market open show and Your Money, a personal finance show that offered different levels of advice in an interactive format with viewer calls and email  \n•\tMentored and trained and supervised more than 20 staff members Producer MSNBC TELEVISION January 1996  –  January 1999  (3 years 1 month) •\tCo-created and produced daily segments for MSNBC using the Internet as a reporting tool; these segments were among the first to use Internet content in TV news segments \n•\tProduced consumer technology segments \n•\tEnhanced the network’s reporting on domestic and international events through the use of use of the World Wide Web as a news gathering source Producer MSNBC TELEVISION January 1996  –  January 1999  (3 years 1 month) •\tCo-created and produced daily segments for MSNBC using the Internet as a reporting tool; these segments were among the first to use Internet content in TV news segments \n•\tProduced consumer technology segments \n•\tEnhanced the network’s reporting on domestic and international events through the use of use of the World Wide Web as a news gathering source Multimedia News & Features Manager THE PRODIGY SERVICE January 1992  –  January 1996  (4 years 1 month) Manager Multimedia, News and Features \nManaged a unit of writers, editors and producers responsible for online news and entertainment sections; developed web sites for Prodigy's internet-based service \nAs a consultant, developed consumer applications for the Prodigy Service; redesigned existing applications; edited and wrote news copy; edited computer and feature columns Multimedia News & Features Manager THE PRODIGY SERVICE January 1992  –  January 1996  (4 years 1 month) Manager Multimedia, News and Features \nManaged a unit of writers, editors and producers responsible for online news and entertainment sections; developed web sites for Prodigy's internet-based service \nAs a consultant, developed consumer applications for the Prodigy Service; redesigned existing applications; edited and wrote news copy; edited computer and feature columns Executive Producer HILL AND KNOWLTON PUBLIC RELATIONS January 1990  –  January 1993  (3 years 1 month) Produced and directed television, video and film programs for Hill and Knowlton clients such as Chrysler and Kodak Executive Producer HILL AND KNOWLTON PUBLIC RELATIONS January 1990  –  January 1993  (3 years 1 month) Produced and directed television, video and film programs for Hill and Knowlton clients such as Chrysler and Kodak INDEPENDENT PRODUCER Independent January 1987  –  January 1990  (3 years 1 month) INDEPENDENT PRODUCER Independent January 1987  –  January 1990  (3 years 1 month) Bureau Chief, Producer CBS News January 1971  –  January 1987  (16 years 1 month) Produced news coverage in the United States, Europe, the Middle East and Latin America for CBS News \nAmong positions held: Tel Aviv Bureau Chief, Latin America producer, Morning News producer \nAs Tel Aviv Bureau Chief, responsible for CBS News coverage in much of the Middle East, running a bureau with a $3.5 million yearly budget and 30 employees Bureau Chief, Producer CBS News January 1971  –  January 1987  (16 years 1 month) Produced news coverage in the United States, Europe, the Middle East and Latin America for CBS News \nAmong positions held: Tel Aviv Bureau Chief, Latin America producer, Morning News producer \nAs Tel Aviv Bureau Chief, responsible for CBS News coverage in much of the Middle East, running a bureau with a $3.5 million yearly budget and 30 employees Education New York Institute of Technology Bachelor of Fine Arts,  Communication Arts 1968  – 1971 New York Institute of Technology Bachelor of Fine Arts,  Communication Arts 1968  – 1971 New York Institute of Technology Bachelor of Fine Arts,  Communication Arts 1968  – 1971 New York Institute of Technology Bachelor of Fine Arts,  Communication Arts 1968  – 1971 ", "Experience Senior Producer MSNBC 2011  – Present (4 years) Executive Producer MSNBC.com June 2014  –  July 2015  (1 year 2 months) Greater New York City Area Co-created, launched and produced the first weekly livestream program on Shift by msnbc.com \"Krystal Clear\" hosted by msnbc anchor Krystal Ball.  Election Coverage NBC News 2011  –  2012  (1 year) Line Producer MSNBC 2010  –  2011  (1 year) Segment Producer MSNBC 2009  –  2010  (1 year) Line Producer NBC News, Channel One News 2007  –  2009  (2 years) Greater New York City Area Producer Channel One News 2005  –  2007  (2 years) Washington D.C. Metro Area, Los Angeles, CA Senior Producer MSNBC 2011  – Present (4 years) Senior Producer MSNBC 2011  – Present (4 years) Executive Producer MSNBC.com June 2014  –  July 2015  (1 year 2 months) Greater New York City Area Co-created, launched and produced the first weekly livestream program on Shift by msnbc.com \"Krystal Clear\" hosted by msnbc anchor Krystal Ball.  Executive Producer MSNBC.com June 2014  –  July 2015  (1 year 2 months) Greater New York City Area Co-created, launched and produced the first weekly livestream program on Shift by msnbc.com \"Krystal Clear\" hosted by msnbc anchor Krystal Ball.  Election Coverage NBC News 2011  –  2012  (1 year) Election Coverage NBC News 2011  –  2012  (1 year) Line Producer MSNBC 2010  –  2011  (1 year) Line Producer MSNBC 2010  –  2011  (1 year) Segment Producer MSNBC 2009  –  2010  (1 year) Segment Producer MSNBC 2009  –  2010  (1 year) Line Producer NBC News, Channel One News 2007  –  2009  (2 years) Greater New York City Area Line Producer NBC News, Channel One News 2007  –  2009  (2 years) Greater New York City Area Producer Channel One News 2005  –  2007  (2 years) Washington D.C. Metro Area, Los Angeles, CA Producer Channel One News 2005  –  2007  (2 years) Washington D.C. Metro Area, Los Angeles, CA Skills Broadcast Television Video Production Broadcast Journalism Broadcast Television Field Producing Breaking News Producing Post Production Video Media Production Skills  Broadcast Television Video Production Broadcast Journalism Broadcast Television Field Producing Breaking News Producing Post Production Video Media Production Broadcast Television Video Production Broadcast Journalism Broadcast Television Field Producing Breaking News Producing Post Production Video Media Production Broadcast Television Video Production Broadcast Journalism Broadcast Television Field Producing Breaking News Producing Post Production Video Media Production Education NYU Stern School of Business Master of Business Administration (MBA),  Dual: Arts , Entertainment, and Media Management,  Entrepreneurship & Innovation 2010  – 2013 The College of William and Mary Bachelor of Arts (B.A.),  Major: Literary & Cultural Studies; Minor: Business Marketing 1999  – 2003 NYU Stern School of Business Master of Business Administration (MBA),  Dual: Arts , Entertainment, and Media Management,  Entrepreneurship & Innovation 2010  – 2013 NYU Stern School of Business Master of Business Administration (MBA),  Dual: Arts , Entertainment, and Media Management,  Entrepreneurship & Innovation 2010  – 2013 NYU Stern School of Business Master of Business Administration (MBA),  Dual: Arts , Entertainment, and Media Management,  Entrepreneurship & Innovation 2010  – 2013 The College of William and Mary Bachelor of Arts (B.A.),  Major: Literary & Cultural Studies; Minor: Business Marketing 1999  – 2003 The College of William and Mary Bachelor of Arts (B.A.),  Major: Literary & Cultural Studies; Minor: Business Marketing 1999  – 2003 The College of William and Mary Bachelor of Arts (B.A.),  Major: Literary & Cultural Studies; Minor: Business Marketing 1999  – 2003 ", "Experience Field Producer/Story Producer Deal or No Deal/Endemol January 2007  –  April 2007  (4 months) Field Director LIFE 2/PBS/Minneapolis February 2007  –  February 2007  (1 month) Senior Producer Megan Mullally Show/NBC Productions June 2006  –  January 2007  (8 months) Consultant NBC Universal 2007  –  2007  (less than a year) Promo Field Director \"Two of Us\"/Women's Entertainment November 2005  –  December 2006  (1 year 2 months) Executive Producer My Place/Hamlox Productions August 2005  –  August 2006  (1 year 1 month) Field Producer The Oprah Winfrey Show/Harpo Productions January 1992  –  May 2006  (14 years 5 months) Supervising Producer Make My Dinner/True Entertainment April 2005  –  September 2005  (6 months) Field Director The Martha Stewart Show 2005  –  2005  (less than a year) Producer The Biggest Little Things of 2004/Bravestreet Productions November 2004  –  December 2004  (2 months) Senior Producer Living It Up/ Kingworld January 2004  –  May 2004  (5 months) Field Producer Jane Pauley Show/NBC Productions August 2003  –  January 2004  (6 months) Sr. Producer Living it up with Ali and Jack - Kingworld 2004  –  2004  (less than a year) Supervising Field Producer \"Living It Up! With Ali & Jack\" (CBS/Kingworld) 2004  –  2004  (less than a year) Field Producer Jane Pauley Show 2003  –  2004  (1 year) Producer Countdown with Keith Olberman/MSNBC April 2003  –  December 2003  (9 months) Senior Producer The Phil Donahue Show/MSNBC June 2002  –  March 2003  (10 months) Sr. Producer MSNBC 2002  –  2003  (1 year) Producer Dan Aykroyd's Out There/Sci-fi Channel August 2002  –  September 2002  (2 months) Supervising Producer Sylvia Browne/Hay House Corp May 2002  –  August 2002  (4 months) Director/Photographer Bartle Bogle Hegarty July 2001  –  August 2001  (2 months) Co-Producer Noon Blue Apple/Dodi Films June 2001  –  August 2001  (3 months) Co-Producer Noon Blue Apple/Dodi Films June 2001  –  August 2001  (3 months) Consultant The Montel Williams Show July 2001  –  July 2001  (1 month) Producer The John Stossel Project/Buena Vista/ABC June 2000  –  August 2000  (3 months) Producer Weiss Stagliano and Partners May 2000  –  June 2000  (2 months) Writer/Producer Fox News Channel/News Corp. January 1998  –  September 1999  (1 year 9 months) Field Producer 1998 Television Hall Of Fame/Smith-Hemion June 1998  –  July 1998  (2 months) Producer The Rosie O'Donnell Show/Telepictures September 1997  –  December 1997  (4 months) Field Producer 1997 Presidential Inaugural Gala/Smith-Hemion January 1997  –  January 1997  (1 month) Producer 1996 Democratic National Convention/Smith-Hemion May 1996  –  August 1996  (4 months) Field Prod/writer At Time of Diagnosis/Time-Life Medical September 1995  –  August 1996  (1 year) Field Producer/Coordinator ABC News, Sports & ESPN/Chicago August 1991  –  May 1995  (3 years 10 months) Producer/Field Producer/Writer Medical News Network/Whittle Communications January 1993  –  April 1994  (1 year 4 months) Associate Producer The Oprah Winfrey Show/Harpo Productions January 1988  –  May 1991  (3 years 5 months) Weekend Assignment Editor/News & Sports Field Producer/Writer WLS CH. 07-Eyewitness News/Capital Cities August 1984  –  May 1988  (3 years 10 months) ABCNEWS ABC Television 1984  –  1988  (4 years) Field Producer/Story Producer Deal or No Deal/Endemol January 2007  –  April 2007  (4 months) Field Producer/Story Producer Deal or No Deal/Endemol January 2007  –  April 2007  (4 months) Field Director LIFE 2/PBS/Minneapolis February 2007  –  February 2007  (1 month) Field Director LIFE 2/PBS/Minneapolis February 2007  –  February 2007  (1 month) Senior Producer Megan Mullally Show/NBC Productions June 2006  –  January 2007  (8 months) Senior Producer Megan Mullally Show/NBC Productions June 2006  –  January 2007  (8 months) Consultant NBC Universal 2007  –  2007  (less than a year) Consultant NBC Universal 2007  –  2007  (less than a year) Promo Field Director \"Two of Us\"/Women's Entertainment November 2005  –  December 2006  (1 year 2 months) Promo Field Director \"Two of Us\"/Women's Entertainment November 2005  –  December 2006  (1 year 2 months) Executive Producer My Place/Hamlox Productions August 2005  –  August 2006  (1 year 1 month) Executive Producer My Place/Hamlox Productions August 2005  –  August 2006  (1 year 1 month) Field Producer The Oprah Winfrey Show/Harpo Productions January 1992  –  May 2006  (14 years 5 months) Field Producer The Oprah Winfrey Show/Harpo Productions January 1992  –  May 2006  (14 years 5 months) Supervising Producer Make My Dinner/True Entertainment April 2005  –  September 2005  (6 months) Supervising Producer Make My Dinner/True Entertainment April 2005  –  September 2005  (6 months) Field Director The Martha Stewart Show 2005  –  2005  (less than a year) Field Director The Martha Stewart Show 2005  –  2005  (less than a year) Producer The Biggest Little Things of 2004/Bravestreet Productions November 2004  –  December 2004  (2 months) Producer The Biggest Little Things of 2004/Bravestreet Productions November 2004  –  December 2004  (2 months) Senior Producer Living It Up/ Kingworld January 2004  –  May 2004  (5 months) Senior Producer Living It Up/ Kingworld January 2004  –  May 2004  (5 months) Field Producer Jane Pauley Show/NBC Productions August 2003  –  January 2004  (6 months) Field Producer Jane Pauley Show/NBC Productions August 2003  –  January 2004  (6 months) Sr. Producer Living it up with Ali and Jack - Kingworld 2004  –  2004  (less than a year) Sr. Producer Living it up with Ali and Jack - Kingworld 2004  –  2004  (less than a year) Supervising Field Producer \"Living It Up! With Ali & Jack\" (CBS/Kingworld) 2004  –  2004  (less than a year) Supervising Field Producer \"Living It Up! With Ali & Jack\" (CBS/Kingworld) 2004  –  2004  (less than a year) Field Producer Jane Pauley Show 2003  –  2004  (1 year) Field Producer Jane Pauley Show 2003  –  2004  (1 year) Producer Countdown with Keith Olberman/MSNBC April 2003  –  December 2003  (9 months) Producer Countdown with Keith Olberman/MSNBC April 2003  –  December 2003  (9 months) Senior Producer The Phil Donahue Show/MSNBC June 2002  –  March 2003  (10 months) Senior Producer The Phil Donahue Show/MSNBC June 2002  –  March 2003  (10 months) Sr. Producer MSNBC 2002  –  2003  (1 year) Sr. Producer MSNBC 2002  –  2003  (1 year) Producer Dan Aykroyd's Out There/Sci-fi Channel August 2002  –  September 2002  (2 months) Producer Dan Aykroyd's Out There/Sci-fi Channel August 2002  –  September 2002  (2 months) Supervising Producer Sylvia Browne/Hay House Corp May 2002  –  August 2002  (4 months) Supervising Producer Sylvia Browne/Hay House Corp May 2002  –  August 2002  (4 months) Director/Photographer Bartle Bogle Hegarty July 2001  –  August 2001  (2 months) Director/Photographer Bartle Bogle Hegarty July 2001  –  August 2001  (2 months) Co-Producer Noon Blue Apple/Dodi Films June 2001  –  August 2001  (3 months) Co-Producer Noon Blue Apple/Dodi Films June 2001  –  August 2001  (3 months) Co-Producer Noon Blue Apple/Dodi Films June 2001  –  August 2001  (3 months) Co-Producer Noon Blue Apple/Dodi Films June 2001  –  August 2001  (3 months) Consultant The Montel Williams Show July 2001  –  July 2001  (1 month) Consultant The Montel Williams Show July 2001  –  July 2001  (1 month) Producer The John Stossel Project/Buena Vista/ABC June 2000  –  August 2000  (3 months) Producer The John Stossel Project/Buena Vista/ABC June 2000  –  August 2000  (3 months) Producer Weiss Stagliano and Partners May 2000  –  June 2000  (2 months) Producer Weiss Stagliano and Partners May 2000  –  June 2000  (2 months) Writer/Producer Fox News Channel/News Corp. January 1998  –  September 1999  (1 year 9 months) Writer/Producer Fox News Channel/News Corp. January 1998  –  September 1999  (1 year 9 months) Field Producer 1998 Television Hall Of Fame/Smith-Hemion June 1998  –  July 1998  (2 months) Field Producer 1998 Television Hall Of Fame/Smith-Hemion June 1998  –  July 1998  (2 months) Producer The Rosie O'Donnell Show/Telepictures September 1997  –  December 1997  (4 months) Producer The Rosie O'Donnell Show/Telepictures September 1997  –  December 1997  (4 months) Field Producer 1997 Presidential Inaugural Gala/Smith-Hemion January 1997  –  January 1997  (1 month) Field Producer 1997 Presidential Inaugural Gala/Smith-Hemion January 1997  –  January 1997  (1 month) Producer 1996 Democratic National Convention/Smith-Hemion May 1996  –  August 1996  (4 months) Producer 1996 Democratic National Convention/Smith-Hemion May 1996  –  August 1996  (4 months) Field Prod/writer At Time of Diagnosis/Time-Life Medical September 1995  –  August 1996  (1 year) Field Prod/writer At Time of Diagnosis/Time-Life Medical September 1995  –  August 1996  (1 year) Field Producer/Coordinator ABC News, Sports & ESPN/Chicago August 1991  –  May 1995  (3 years 10 months) Field Producer/Coordinator ABC News, Sports & ESPN/Chicago August 1991  –  May 1995  (3 years 10 months) Producer/Field Producer/Writer Medical News Network/Whittle Communications January 1993  –  April 1994  (1 year 4 months) Producer/Field Producer/Writer Medical News Network/Whittle Communications January 1993  –  April 1994  (1 year 4 months) Associate Producer The Oprah Winfrey Show/Harpo Productions January 1988  –  May 1991  (3 years 5 months) Associate Producer The Oprah Winfrey Show/Harpo Productions January 1988  –  May 1991  (3 years 5 months) Weekend Assignment Editor/News & Sports Field Producer/Writer WLS CH. 07-Eyewitness News/Capital Cities August 1984  –  May 1988  (3 years 10 months) Weekend Assignment Editor/News & Sports Field Producer/Writer WLS CH. 07-Eyewitness News/Capital Cities August 1984  –  May 1988  (3 years 10 months) ABCNEWS ABC Television 1984  –  1988  (4 years) ABCNEWS ABC Television 1984  –  1988  (4 years) Skills Television Directing Broadcast Television Post Production Production Managment Producing Entertainment Broadcast Reality Film Field Producing Video Storytelling Film Production Camera Avid Feature Films Commercials HD Video Documentaries Avid Media Composer Video Production Media Production See 8+     See less Skills  Television Directing Broadcast Television Post Production Production Managment Producing Entertainment Broadcast Reality Film Field Producing Video Storytelling Film Production Camera Avid Feature Films Commercials HD Video Documentaries Avid Media Composer Video Production Media Production See 8+     See less Television Directing Broadcast Television Post Production Production Managment Producing Entertainment Broadcast Reality Film Field Producing Video Storytelling Film Production Camera Avid Feature Films Commercials HD Video Documentaries Avid Media Composer Video Production Media Production See 8+     See less Television Directing Broadcast Television Post Production Production Managment Producing Entertainment Broadcast Reality Film Field Producing Video Storytelling Film Production Camera Avid Feature Films Commercials HD Video Documentaries Avid Media Composer Video Production Media Production See 8+     See less Education Drake University Bachelor's degree (School of Journalism) 1980  – 1984 Drake University 1980  – 1984 Drake University Bachelor's degree (School of Journalism) 1980  – 1984 Drake University Bachelor's degree (School of Journalism) 1980  – 1984 Drake University Bachelor's degree (School of Journalism) 1980  – 1984 Drake University 1980  – 1984 Drake University 1980  – 1984 Drake University 1980  – 1984 ", "Experience Producer/Writer,\"MSNBC Live with Thomas Roberts\", \"NewsNation with Tamron Hall\", MSNBC June 2010  – Present (5 years 3 months) New York, NY - Directed strategy for and delivery of digital video content \n- Segment producer assignments: produced live interviews; wrote scripts and prepared anchor questions on politics, human interest stories, and breaking news; created graphics and banners \n- Wrote scripts for Primetime shows: business news headlines for \"The Ed Show\" and general news updates for \"Hardball with Chris Matthews\" Producer/Writer, \"MSNBC Live\" MSNBC July 2009  –  May 2010  (11 months) New York, NY - Produced \"CNBC Market Wrap\": researched stories, wrote scripts for business news updates \n- Coordinated digital video requests \n- Segment producer assignments: produced live interviews, wrote scripts, prepared anchor questions on political, crime, weather, and business segments Producer/Writer, CNBC Unit MSNBC January 2003  –  June 2009  (6 years 6 months) NJ/NY - Produced early morning news updates for CNBC's \"Squawk Box\" \n- Selected stories, wrote scripts, prepared MSNBC anchors for cross-talk with CNBC hosts \n- Fill-in writer on \"Morning Joe\" Show, featuring hosts Joe Scarborough and Mika Brzezinski Producer, Planning Unit MSNBC July 1997  –  December 2002  (5 years 6 months) Secaucus, NJ - Participated in strategy meetings for next day's morning news coverage \n- Pitched stories; identified potential guests/experts; prepared instructional note for morning seniors \n- Provided leadership and direction to 4+ producers to ensure video elements prepared under deadline Production Assistant MSNBC July 1996  –  June 1997  (1 year) Secaucus, NJ - Assisted with pre-show and live broadcast production: video, graphics, scripts Freelance - Assignment Desk NBC Station - WMAQ January 1994  –  June 1996  (2 years 6 months) Chicago, IL - Assisted on field shoots; monitored scanners for stories; fielded calls for potential stories \n- Responsible for weekly news stories on local athletes trying out for the Olympics: supervised field shoots, conducted interviews of Olympic hopefuls, collaborated with writers/editors Intern CBS Station - KPIX September 1993  –  December 1993  (4 months) San Francisco Bay Area - Researched, pitched and produced live interviews for public affairs show, “Bay Sunday.” Conducted pre-interviews of guests. Prepared scripts and questions for show host. Producer/Writer,\"MSNBC Live with Thomas Roberts\", \"NewsNation with Tamron Hall\", MSNBC June 2010  – Present (5 years 3 months) New York, NY - Directed strategy for and delivery of digital video content \n- Segment producer assignments: produced live interviews; wrote scripts and prepared anchor questions on politics, human interest stories, and breaking news; created graphics and banners \n- Wrote scripts for Primetime shows: business news headlines for \"The Ed Show\" and general news updates for \"Hardball with Chris Matthews\" Producer/Writer,\"MSNBC Live with Thomas Roberts\", \"NewsNation with Tamron Hall\", MSNBC June 2010  – Present (5 years 3 months) New York, NY - Directed strategy for and delivery of digital video content \n- Segment producer assignments: produced live interviews; wrote scripts and prepared anchor questions on politics, human interest stories, and breaking news; created graphics and banners \n- Wrote scripts for Primetime shows: business news headlines for \"The Ed Show\" and general news updates for \"Hardball with Chris Matthews\" Producer/Writer, \"MSNBC Live\" MSNBC July 2009  –  May 2010  (11 months) New York, NY - Produced \"CNBC Market Wrap\": researched stories, wrote scripts for business news updates \n- Coordinated digital video requests \n- Segment producer assignments: produced live interviews, wrote scripts, prepared anchor questions on political, crime, weather, and business segments Producer/Writer, \"MSNBC Live\" MSNBC July 2009  –  May 2010  (11 months) New York, NY - Produced \"CNBC Market Wrap\": researched stories, wrote scripts for business news updates \n- Coordinated digital video requests \n- Segment producer assignments: produced live interviews, wrote scripts, prepared anchor questions on political, crime, weather, and business segments Producer/Writer, CNBC Unit MSNBC January 2003  –  June 2009  (6 years 6 months) NJ/NY - Produced early morning news updates for CNBC's \"Squawk Box\" \n- Selected stories, wrote scripts, prepared MSNBC anchors for cross-talk with CNBC hosts \n- Fill-in writer on \"Morning Joe\" Show, featuring hosts Joe Scarborough and Mika Brzezinski Producer/Writer, CNBC Unit MSNBC January 2003  –  June 2009  (6 years 6 months) NJ/NY - Produced early morning news updates for CNBC's \"Squawk Box\" \n- Selected stories, wrote scripts, prepared MSNBC anchors for cross-talk with CNBC hosts \n- Fill-in writer on \"Morning Joe\" Show, featuring hosts Joe Scarborough and Mika Brzezinski Producer, Planning Unit MSNBC July 1997  –  December 2002  (5 years 6 months) Secaucus, NJ - Participated in strategy meetings for next day's morning news coverage \n- Pitched stories; identified potential guests/experts; prepared instructional note for morning seniors \n- Provided leadership and direction to 4+ producers to ensure video elements prepared under deadline Producer, Planning Unit MSNBC July 1997  –  December 2002  (5 years 6 months) Secaucus, NJ - Participated in strategy meetings for next day's morning news coverage \n- Pitched stories; identified potential guests/experts; prepared instructional note for morning seniors \n- Provided leadership and direction to 4+ producers to ensure video elements prepared under deadline Production Assistant MSNBC July 1996  –  June 1997  (1 year) Secaucus, NJ - Assisted with pre-show and live broadcast production: video, graphics, scripts Production Assistant MSNBC July 1996  –  June 1997  (1 year) Secaucus, NJ - Assisted with pre-show and live broadcast production: video, graphics, scripts Freelance - Assignment Desk NBC Station - WMAQ January 1994  –  June 1996  (2 years 6 months) Chicago, IL - Assisted on field shoots; monitored scanners for stories; fielded calls for potential stories \n- Responsible for weekly news stories on local athletes trying out for the Olympics: supervised field shoots, conducted interviews of Olympic hopefuls, collaborated with writers/editors Freelance - Assignment Desk NBC Station - WMAQ January 1994  –  June 1996  (2 years 6 months) Chicago, IL - Assisted on field shoots; monitored scanners for stories; fielded calls for potential stories \n- Responsible for weekly news stories on local athletes trying out for the Olympics: supervised field shoots, conducted interviews of Olympic hopefuls, collaborated with writers/editors Intern CBS Station - KPIX September 1993  –  December 1993  (4 months) San Francisco Bay Area - Researched, pitched and produced live interviews for public affairs show, “Bay Sunday.” Conducted pre-interviews of guests. Prepared scripts and questions for show host. Intern CBS Station - KPIX September 1993  –  December 1993  (4 months) San Francisco Bay Area - Researched, pitched and produced live interviews for public affairs show, “Bay Sunday.” Conducted pre-interviews of guests. Prepared scripts and questions for show host. Skills Video Camera: Sony HDV... Editing: Avid, Final... Creative Direction Video Avid Storytelling Broadcast Skills  Video Camera: Sony HDV... Editing: Avid, Final... Creative Direction Video Avid Storytelling Broadcast Video Camera: Sony HDV... Editing: Avid, Final... Creative Direction Video Avid Storytelling Broadcast Video Camera: Sony HDV... Editing: Avid, Final... Creative Direction Video Avid Storytelling Broadcast Education New York University - Leonard N. Stern School of Business MBA 2007  – 2009 Columbia University - Graduate School of Journalism MS,  Journalism 2003  – 2005 Wesleyan University BA New York University - Leonard N. Stern School of Business MBA 2007  – 2009 New York University - Leonard N. Stern School of Business MBA 2007  – 2009 New York University - Leonard N. Stern School of Business MBA 2007  – 2009 Columbia University - Graduate School of Journalism MS,  Journalism 2003  – 2005 Columbia University - Graduate School of Journalism MS,  Journalism 2003  – 2005 Columbia University - Graduate School of Journalism MS,  Journalism 2003  – 2005 Wesleyan University BA Wesleyan University BA Wesleyan University BA ", "Summary Aaron Bleich has worked as a producer and writer since he graduated from Vanderbilt University in 1997, beginning with CBS’s “Day and Date,” a daily news and entertainment magazine show. His television producer credits also include the “Judge Mills Lane Show,” a daily court TV reality strip, and segments for “Metro Guide,” Cablevision’s “original programming” channel seen in the Metropolitan New York Tri-State Area. \n \nIn 1999 his career extended into news, as a producer for MSNBC, where he was in charge of special projects including the November 2000 election coverage. In 2001, he assumed the role of point producer for the 9-11 tragedy. \n \nIn addition to his role as producer of “Fast Lane Summer,” Bleich also worked as the associate producer of research for The History Channel production of “The Lost Book of Nostradamus,” which aired in October of 2007. \n \nCurrently, he is writing and producing a second feature length documentary about drag racing for mediagroup entitled “Quarter Mile,” and the accompanying television series called “Don Garlits Presents… The Greatest Racers.” \n \nBleich holds the position of Vice President of Program Development for mediagroup, where he leads the project development and research team for new programming. \n \nBleich is the winner of a 2002 National Emmy Award for outstanding coverage of the events of 9-11, the ‘160 Award’ for Production Excellence at the Nashville Film Festival, and a Platinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Specialties:Writing, Program Development, Pitching, Finding Source Funding Summary Aaron Bleich has worked as a producer and writer since he graduated from Vanderbilt University in 1997, beginning with CBS’s “Day and Date,” a daily news and entertainment magazine show. His television producer credits also include the “Judge Mills Lane Show,” a daily court TV reality strip, and segments for “Metro Guide,” Cablevision’s “original programming” channel seen in the Metropolitan New York Tri-State Area. \n \nIn 1999 his career extended into news, as a producer for MSNBC, where he was in charge of special projects including the November 2000 election coverage. In 2001, he assumed the role of point producer for the 9-11 tragedy. \n \nIn addition to his role as producer of “Fast Lane Summer,” Bleich also worked as the associate producer of research for The History Channel production of “The Lost Book of Nostradamus,” which aired in October of 2007. \n \nCurrently, he is writing and producing a second feature length documentary about drag racing for mediagroup entitled “Quarter Mile,” and the accompanying television series called “Don Garlits Presents… The Greatest Racers.” \n \nBleich holds the position of Vice President of Program Development for mediagroup, where he leads the project development and research team for new programming. \n \nBleich is the winner of a 2002 National Emmy Award for outstanding coverage of the events of 9-11, the ‘160 Award’ for Production Excellence at the Nashville Film Festival, and a Platinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Specialties:Writing, Program Development, Pitching, Finding Source Funding Aaron Bleich has worked as a producer and writer since he graduated from Vanderbilt University in 1997, beginning with CBS’s “Day and Date,” a daily news and entertainment magazine show. His television producer credits also include the “Judge Mills Lane Show,” a daily court TV reality strip, and segments for “Metro Guide,” Cablevision’s “original programming” channel seen in the Metropolitan New York Tri-State Area. \n \nIn 1999 his career extended into news, as a producer for MSNBC, where he was in charge of special projects including the November 2000 election coverage. In 2001, he assumed the role of point producer for the 9-11 tragedy. \n \nIn addition to his role as producer of “Fast Lane Summer,” Bleich also worked as the associate producer of research for The History Channel production of “The Lost Book of Nostradamus,” which aired in October of 2007. \n \nCurrently, he is writing and producing a second feature length documentary about drag racing for mediagroup entitled “Quarter Mile,” and the accompanying television series called “Don Garlits Presents… The Greatest Racers.” \n \nBleich holds the position of Vice President of Program Development for mediagroup, where he leads the project development and research team for new programming. \n \nBleich is the winner of a 2002 National Emmy Award for outstanding coverage of the events of 9-11, the ‘160 Award’ for Production Excellence at the Nashville Film Festival, and a Platinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Specialties:Writing, Program Development, Pitching, Finding Source Funding Aaron Bleich has worked as a producer and writer since he graduated from Vanderbilt University in 1997, beginning with CBS’s “Day and Date,” a daily news and entertainment magazine show. His television producer credits also include the “Judge Mills Lane Show,” a daily court TV reality strip, and segments for “Metro Guide,” Cablevision’s “original programming” channel seen in the Metropolitan New York Tri-State Area. \n \nIn 1999 his career extended into news, as a producer for MSNBC, where he was in charge of special projects including the November 2000 election coverage. In 2001, he assumed the role of point producer for the 9-11 tragedy. \n \nIn addition to his role as producer of “Fast Lane Summer,” Bleich also worked as the associate producer of research for The History Channel production of “The Lost Book of Nostradamus,” which aired in October of 2007. \n \nCurrently, he is writing and producing a second feature length documentary about drag racing for mediagroup entitled “Quarter Mile,” and the accompanying television series called “Don Garlits Presents… The Greatest Racers.” \n \nBleich holds the position of Vice President of Program Development for mediagroup, where he leads the project development and research team for new programming. \n \nBleich is the winner of a 2002 National Emmy Award for outstanding coverage of the events of 9-11, the ‘160 Award’ for Production Excellence at the Nashville Film Festival, and a Platinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Specialties:Writing, Program Development, Pitching, Finding Source Funding Experience Principal Pepper Tree Media April 2013  – Present (2 years 5 months) new york, new york Pepper Tree Media is a New York City-based production company comprised of award-winning producers, writers, directors, editors and artisans of storytelling. \n \nWe strive to tell stories that matter and have a lasting impact on our culture and lives. Pepper Tree excels at producing award-winning shows for major cable networks as well as documentaries. \n \nPTM was founded by three long-time friends with a desire to produce quality television and film. Here, meaning comes first. Our work is packed with interesting characters, stunning visuals and intriguing story lines. We enjoy life and hope it shows in our work. Segment Producer MSNBC February 2013  – Present (2 years 7 months) 30 rockefeller plaza new york, ny 10112 Report and investigate the news on a daily basis for multiple shows airing on MSNBC and NBC News productions. Executive Producer Sii.TV September 2012  – Present (3 years) New York, NY As EP I work with a team of journalists and tech professionals to build a daily newscast designed around user needs which curates the best of television and internet news while helping to add context to the stories of the day. VP Program Development mediagroup inc. January 2002  – Present (13 years 8 months) Executive Producer OneMinuteNews March 2011  –  2012  (1 year) Tirelessly I lead a group of anchors & producers to bring snack size news to a global millennial audience. Field Producer Powderhouse Productions 2010  –  2010  (less than a year) Writer/Producer Tippingpoint Labs January 2008  –  December 2008  (1 year) Segment Producer MSNBC 1999  –  2002  (3 years) Associate Producer Hurricane Entertainment 1998  –  1999  (1 year) Associate Producer JagFN 1998  –  1998  (less than a year) Production Assistant MetroGuide 1997  –  1998  (1 year) Principal Pepper Tree Media April 2013  – Present (2 years 5 months) new york, new york Pepper Tree Media is a New York City-based production company comprised of award-winning producers, writers, directors, editors and artisans of storytelling. \n \nWe strive to tell stories that matter and have a lasting impact on our culture and lives. Pepper Tree excels at producing award-winning shows for major cable networks as well as documentaries. \n \nPTM was founded by three long-time friends with a desire to produce quality television and film. Here, meaning comes first. Our work is packed with interesting characters, stunning visuals and intriguing story lines. We enjoy life and hope it shows in our work. Principal Pepper Tree Media April 2013  – Present (2 years 5 months) new york, new york Pepper Tree Media is a New York City-based production company comprised of award-winning producers, writers, directors, editors and artisans of storytelling. \n \nWe strive to tell stories that matter and have a lasting impact on our culture and lives. Pepper Tree excels at producing award-winning shows for major cable networks as well as documentaries. \n \nPTM was founded by three long-time friends with a desire to produce quality television and film. Here, meaning comes first. Our work is packed with interesting characters, stunning visuals and intriguing story lines. We enjoy life and hope it shows in our work. Segment Producer MSNBC February 2013  – Present (2 years 7 months) 30 rockefeller plaza new york, ny 10112 Report and investigate the news on a daily basis for multiple shows airing on MSNBC and NBC News productions. Segment Producer MSNBC February 2013  – Present (2 years 7 months) 30 rockefeller plaza new york, ny 10112 Report and investigate the news on a daily basis for multiple shows airing on MSNBC and NBC News productions. Executive Producer Sii.TV September 2012  – Present (3 years) New York, NY As EP I work with a team of journalists and tech professionals to build a daily newscast designed around user needs which curates the best of television and internet news while helping to add context to the stories of the day. Executive Producer Sii.TV September 2012  – Present (3 years) New York, NY As EP I work with a team of journalists and tech professionals to build a daily newscast designed around user needs which curates the best of television and internet news while helping to add context to the stories of the day. VP Program Development mediagroup inc. January 2002  – Present (13 years 8 months) VP Program Development mediagroup inc. January 2002  – Present (13 years 8 months) Executive Producer OneMinuteNews March 2011  –  2012  (1 year) Tirelessly I lead a group of anchors & producers to bring snack size news to a global millennial audience. Executive Producer OneMinuteNews March 2011  –  2012  (1 year) Tirelessly I lead a group of anchors & producers to bring snack size news to a global millennial audience. Field Producer Powderhouse Productions 2010  –  2010  (less than a year) Field Producer Powderhouse Productions 2010  –  2010  (less than a year) Writer/Producer Tippingpoint Labs January 2008  –  December 2008  (1 year) Writer/Producer Tippingpoint Labs January 2008  –  December 2008  (1 year) Segment Producer MSNBC 1999  –  2002  (3 years) Segment Producer MSNBC 1999  –  2002  (3 years) Associate Producer Hurricane Entertainment 1998  –  1999  (1 year) Associate Producer Hurricane Entertainment 1998  –  1999  (1 year) Associate Producer JagFN 1998  –  1998  (less than a year) Associate Producer JagFN 1998  –  1998  (less than a year) Production Assistant MetroGuide 1997  –  1998  (1 year) Production Assistant MetroGuide 1997  –  1998  (1 year) Skills Storytelling Video Press Releases Producing Film Documentaries Pre-production Avid Media Production Broadcast Television Broadcast Digital Media Television HD Video Video Production Entertainment Web Content Post Production Content Strategy New Media Production Managment Screenwriting Reality Film Production Directing Camera Web Video Broadcast Journalism Multimedia Digital Video Final Cut Pro Commercials Feature Films Music Videos Field Producing Short Films Creative Direction Journalism Live Events Publicity News Writing Television Producing Content Development Independent Film Editing Media Relations Editorial Creative Writing Blogging Cinematography See 35+     See less Skills  Storytelling Video Press Releases Producing Film Documentaries Pre-production Avid Media Production Broadcast Television Broadcast Digital Media Television HD Video Video Production Entertainment Web Content Post Production Content Strategy New Media Production Managment Screenwriting Reality Film Production Directing Camera Web Video Broadcast Journalism Multimedia Digital Video Final Cut Pro Commercials Feature Films Music Videos Field Producing Short Films Creative Direction Journalism Live Events Publicity News Writing Television Producing Content Development Independent Film Editing Media Relations Editorial Creative Writing Blogging Cinematography See 35+     See less Storytelling Video Press Releases Producing Film Documentaries Pre-production Avid Media Production Broadcast Television Broadcast Digital Media Television HD Video Video Production Entertainment Web Content Post Production Content Strategy New Media Production Managment Screenwriting Reality Film Production Directing Camera Web Video Broadcast Journalism Multimedia Digital Video Final Cut Pro Commercials Feature Films Music Videos Field Producing Short Films Creative Direction Journalism Live Events Publicity News Writing Television Producing Content Development Independent Film Editing Media Relations Editorial Creative Writing Blogging Cinematography See 35+     See less Storytelling Video Press Releases Producing Film Documentaries Pre-production Avid Media Production Broadcast Television Broadcast Digital Media Television HD Video Video Production Entertainment Web Content Post Production Content Strategy New Media Production Managment Screenwriting Reality Film Production Directing Camera Web Video Broadcast Journalism Multimedia Digital Video Final Cut Pro Commercials Feature Films Music Videos Field Producing Short Films Creative Direction Journalism Live Events Publicity News Writing Television Producing Content Development Independent Film Editing Media Relations Editorial Creative Writing Blogging Cinematography See 35+     See less Education Vanderbilt University BA,  Political Science 1993  – 1997 Activities and Societies:  Student Government Association ,  Co-Captain Debate Team ,  Resident Advisor ,  Vanderbilt University Theatre ,  AEPi Stanford University Summer Program in Debate,  Political Communication 1992  – 1992 Member of elite program for debate studies. Yale University Certificate of Communications Youth Leadership Program (High School),  Communication and Media Studies 1991  – 1991 Member of Junior Statesmen of America's program in leadership and political communications Vanderbilt University BA,  Political Science 1993  – 1997 Activities and Societies:  Student Government Association ,  Co-Captain Debate Team ,  Resident Advisor ,  Vanderbilt University Theatre ,  AEPi Vanderbilt University BA,  Political Science 1993  – 1997 Activities and Societies:  Student Government Association ,  Co-Captain Debate Team ,  Resident Advisor ,  Vanderbilt University Theatre ,  AEPi Vanderbilt University BA,  Political Science 1993  – 1997 Activities and Societies:  Student Government Association ,  Co-Captain Debate Team ,  Resident Advisor ,  Vanderbilt University Theatre ,  AEPi Stanford University Summer Program in Debate,  Political Communication 1992  – 1992 Member of elite program for debate studies. Stanford University Summer Program in Debate,  Political Communication 1992  – 1992 Member of elite program for debate studies. Stanford University Summer Program in Debate,  Political Communication 1992  – 1992 Member of elite program for debate studies. Yale University Certificate of Communications Youth Leadership Program (High School),  Communication and Media Studies 1991  – 1991 Member of Junior Statesmen of America's program in leadership and political communications Yale University Certificate of Communications Youth Leadership Program (High School),  Communication and Media Studies 1991  – 1991 Member of Junior Statesmen of America's program in leadership and political communications Yale University Certificate of Communications Youth Leadership Program (High School),  Communication and Media Studies 1991  – 1991 Member of Junior Statesmen of America's program in leadership and political communications Honors & Awards Additional Honors & Awards '160' Award for Production Excellence Nashville Film Festival \nNational Emmy Award Coverage of 9-11 at NBC News \nPlatinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Additional Honors & Awards '160' Award for Production Excellence Nashville Film Festival \nNational Emmy Award Coverage of 9-11 at NBC News \nPlatinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Additional Honors & Awards '160' Award for Production Excellence Nashville Film Festival \nNational Emmy Award Coverage of 9-11 at NBC News \nPlatinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” Additional Honors & Awards '160' Award for Production Excellence Nashville Film Festival \nNational Emmy Award Coverage of 9-11 at NBC News \nPlatinum Aurora Award for “Best Sports Film” for “Fast Lane Summer.” ", "Summary Producer/Director with 15-years experience in Broadcast, Government and Academic environment.  \n \n- Producer/Director on docs & drama for BBC, Channel 4, Channel 5, Discovery, Nat Geo. Have worked with actors, children, special FX, animation and CGI.  \n \n- Development Producer with the ability to find inventive ways of telling stories.  \n \n- Project Manager for a range of events including the Wellcome Trust Screenwriting Prize in collaboration with Film4/BFI; various panels at game & film festivals. Summary Producer/Director with 15-years experience in Broadcast, Government and Academic environment.  \n \n- Producer/Director on docs & drama for BBC, Channel 4, Channel 5, Discovery, Nat Geo. Have worked with actors, children, special FX, animation and CGI.  \n \n- Development Producer with the ability to find inventive ways of telling stories.  \n \n- Project Manager for a range of events including the Wellcome Trust Screenwriting Prize in collaboration with Film4/BFI; various panels at game & film festivals. Producer/Director with 15-years experience in Broadcast, Government and Academic environment.  \n \n- Producer/Director on docs & drama for BBC, Channel 4, Channel 5, Discovery, Nat Geo. Have worked with actors, children, special FX, animation and CGI.  \n \n- Development Producer with the ability to find inventive ways of telling stories.  \n \n- Project Manager for a range of events including the Wellcome Trust Screenwriting Prize in collaboration with Film4/BFI; various panels at game & film festivals. Producer/Director with 15-years experience in Broadcast, Government and Academic environment.  \n \n- Producer/Director on docs & drama for BBC, Channel 4, Channel 5, Discovery, Nat Geo. Have worked with actors, children, special FX, animation and CGI.  \n \n- Development Producer with the ability to find inventive ways of telling stories.  \n \n- Project Manager for a range of events including the Wellcome Trust Screenwriting Prize in collaboration with Film4/BFI; various panels at game & film festivals. Skills Skills     ", "Experience Development Producer Twofour Group March 2013  – Present (2 years 6 months) Greater Los Angeles Area •\tCoordinated casting and out-reach for multiple shows in development \n•\tResearched new regional television ideas for shows  \n•\tManaged Development Production Assistants and Interns \n•\tCreated all show and cast one-sheets \n•\tConducted and edited all casting Skypes for network pitches Field Producer Big Fish Entertainment/ Vh1 2012  – Present (3 years) NYC Field Produce all content of this docu-reality, 6 person ensemble cast show. Executive Producer Daddies Doll Productions December 2007  – Present (7 years 9 months) New Jersey Develop original content, produce concept and sizzle reels, and produce brand experience suites. Line Producer/ Dog the Bounty Hunter Hybrid Films / A&E July 2010  –  March 2012  (1 year 9 months) NY,NY Handled all facets of field production as well as maintaining the show financials. Development Casting Producer Diga Vision 2012  –  2012  (less than a year) NYC Worked as lead casting producer on multiple show concepts being developed for a variety of networks. Field Producer / \"Chrissy & Mr. Jones\" NFGTV/ Vh1 2012  –  2012  (less than a year) NYC Produced all locations and also acted as in field story producer. Casting VPE Entertainement 2011  –  2011  (less than a year) Producer/Sr. AP Judge Jeanine Pirro Show May 2008  –  December 2010  (2 years 8 months) Emmy nominated Court Television program.  \n \n* Booked all small claims cases and dealt with all guest relations. \n* Pitched potential cases to Executive Producers and host \n* Assisted in story arcs and external elements of each case Casting Producer Left Right 2010  –  2010  (less than a year) Media Consultant Covello Classic 2009  –  2010  (1 year) Casting Producer Cash Cab / Lion TV March 2009  –  May 2009  (3 months) Emmy Award Winning Game Show \n \n* Conducted casting out reach and screening \n* Interviewed potential candidates and tested their trivia knowledge per network requirements \n* Created casting one sheets on all potential candidates \n* Worked with Show Producers to pitch candidates for network approvals Casting Director/Producer TV Land's How'd You Get so Rich w/ Joan Rivers / Mark Burnett January 2009  –  March 2009  (3 months) * Researched and interview millionaires for casting reels \n* Created casting one sheets on all potential candidates \n* Filmed local casting reels for network approval Casting Associate Producer Half Yard Productions / TLC's Say Yes to the Dress February 2008  –  June 2008  (5 months) * Conducted pre-interviews with all prospective candidates for the shoe and coordinated all guess relations \n* Generated story synopsis for Field Producers highlighting all interesting stories \n* Produce Story arcs to assist our field team with their on-site productions \n* Creating casting reports for corporate approval Studio and Field Associate Producer TLC's Fashionably Late w/ Stacy London / BBC Worldwide July 2007  –  October 2007  (4 months) * Coordinated and attended all field shoots  \n* Shot b-cam on location with Sony z1 \n* Booked guests appearing on the show and briefed them prior to each segment \n* Attended meetings with show host and accompanied her on field shoots \n* Participated in daily production meetings, researched and pitch segment and story ideas, wrote segment scripts \n* Assisted as Stylist and Casting Director during pilot Associate Producer NBC News/MSNBC YOUR BUSINESS June 2006  –  July 2007  (1 year 2 months) * Researched show topics and new show concepts for packaged pieces  \n* Interviewed, researched and booked all guests appearing on each show segment \n* Wrote segment scripts in addition to scripts for field shoots \n* Accompany Producers on field shoots to conduct interviews with featured business and shoot B rolls for show \n* Responsible for all travel arrangement, booking guests, calendars/facilities, guest relations, maintain call list Associate Field Producer Tapestry International / TLC's Elemtary School Series October 2005  –  February 2007  (1 year 5 months) * Researched show topics and new show concepts for packaged pieces \n* Obtained all legal releases and rights management for TLC Elementary \n* Wrote segment scripts as well as script rewrites for shows \n* Responsible for all field shoots, booked talent, crew and facilitated all voice over recordings Travel Coordinator NBC Universal 2005  –  2006  (1 year) Travel Co-ordinator / Production Assistant NBC Universal / The Maury Show August 2004  –  September 2005  (1 year 2 months) * Coordinated all facets of guest accommodations and relations; dealt with multiple vendors to ensure best price \n* Provided assistance to Producer/Associate Producer on an ongoing basis and acted as meet/greet coordinator \n* Prepared, managed and tracked budget, petty cash account and expense reports \n* Arranged all ground and air travel, hotel arrangements and transportation to and from show for guests Olympic \"Pass the Torch\" show NBC Universal July 2004  –  July 2004  (1 month) * Production Assistant for segments from recently shot material for live broadcast of the Olympic Torch Passing \n* Responsible for duplication of Beta SP to Digi Beta format for taped segments Bad Boy's of Comedy / HBO series Bad Boy Films/ Latham Entertainment May 2004  –  June 2004  (2 months) * Maintained and regulated call sheets for crew and talent \n* Meet/ greet guest coordinator \n* Managed traffic flow/security behind the scenes and organized VIP's \n* Audience coordination and organization Field PA/ Executive Assistant Crossing Over w/ John Edward / Sixth Avenue Productions April 2003  –  March 2004  (1 year) *Handled all aspects of field production segments including obtaining all necessary approvals and releases \n* Booked all outside crews, equipment for shoots \n* Maintained and managed daily activities and administrative duties for two Executive Producers and John Edward \n* Key liaison between Executive Producers, Corporate staff and internal staff of 40 people ASSISTANT AGENT UGLY NY 2004  –  2004  (less than a year) Development Producer Twofour Group March 2013  – Present (2 years 6 months) Greater Los Angeles Area •\tCoordinated casting and out-reach for multiple shows in development \n•\tResearched new regional television ideas for shows  \n•\tManaged Development Production Assistants and Interns \n•\tCreated all show and cast one-sheets \n•\tConducted and edited all casting Skypes for network pitches Development Producer Twofour Group March 2013  – Present (2 years 6 months) Greater Los Angeles Area •\tCoordinated casting and out-reach for multiple shows in development \n•\tResearched new regional television ideas for shows  \n•\tManaged Development Production Assistants and Interns \n•\tCreated all show and cast one-sheets \n•\tConducted and edited all casting Skypes for network pitches Field Producer Big Fish Entertainment/ Vh1 2012  – Present (3 years) NYC Field Produce all content of this docu-reality, 6 person ensemble cast show. Field Producer Big Fish Entertainment/ Vh1 2012  – Present (3 years) NYC Field Produce all content of this docu-reality, 6 person ensemble cast show. Executive Producer Daddies Doll Productions December 2007  – Present (7 years 9 months) New Jersey Develop original content, produce concept and sizzle reels, and produce brand experience suites. Executive Producer Daddies Doll Productions December 2007  – Present (7 years 9 months) New Jersey Develop original content, produce concept and sizzle reels, and produce brand experience suites. Line Producer/ Dog the Bounty Hunter Hybrid Films / A&E July 2010  –  March 2012  (1 year 9 months) NY,NY Handled all facets of field production as well as maintaining the show financials. Line Producer/ Dog the Bounty Hunter Hybrid Films / A&E July 2010  –  March 2012  (1 year 9 months) NY,NY Handled all facets of field production as well as maintaining the show financials. Development Casting Producer Diga Vision 2012  –  2012  (less than a year) NYC Worked as lead casting producer on multiple show concepts being developed for a variety of networks. Development Casting Producer Diga Vision 2012  –  2012  (less than a year) NYC Worked as lead casting producer on multiple show concepts being developed for a variety of networks. Field Producer / \"Chrissy & Mr. Jones\" NFGTV/ Vh1 2012  –  2012  (less than a year) NYC Produced all locations and also acted as in field story producer. Field Producer / \"Chrissy & Mr. Jones\" NFGTV/ Vh1 2012  –  2012  (less than a year) NYC Produced all locations and also acted as in field story producer. Casting VPE Entertainement 2011  –  2011  (less than a year) Casting VPE Entertainement 2011  –  2011  (less than a year) Producer/Sr. AP Judge Jeanine Pirro Show May 2008  –  December 2010  (2 years 8 months) Emmy nominated Court Television program.  \n \n* Booked all small claims cases and dealt with all guest relations. \n* Pitched potential cases to Executive Producers and host \n* Assisted in story arcs and external elements of each case Producer/Sr. AP Judge Jeanine Pirro Show May 2008  –  December 2010  (2 years 8 months) Emmy nominated Court Television program.  \n \n* Booked all small claims cases and dealt with all guest relations. \n* Pitched potential cases to Executive Producers and host \n* Assisted in story arcs and external elements of each case Casting Producer Left Right 2010  –  2010  (less than a year) Casting Producer Left Right 2010  –  2010  (less than a year) Media Consultant Covello Classic 2009  –  2010  (1 year) Media Consultant Covello Classic 2009  –  2010  (1 year) Casting Producer Cash Cab / Lion TV March 2009  –  May 2009  (3 months) Emmy Award Winning Game Show \n \n* Conducted casting out reach and screening \n* Interviewed potential candidates and tested their trivia knowledge per network requirements \n* Created casting one sheets on all potential candidates \n* Worked with Show Producers to pitch candidates for network approvals Casting Producer Cash Cab / Lion TV March 2009  –  May 2009  (3 months) Emmy Award Winning Game Show \n \n* Conducted casting out reach and screening \n* Interviewed potential candidates and tested their trivia knowledge per network requirements \n* Created casting one sheets on all potential candidates \n* Worked with Show Producers to pitch candidates for network approvals Casting Director/Producer TV Land's How'd You Get so Rich w/ Joan Rivers / Mark Burnett January 2009  –  March 2009  (3 months) * Researched and interview millionaires for casting reels \n* Created casting one sheets on all potential candidates \n* Filmed local casting reels for network approval Casting Director/Producer TV Land's How'd You Get so Rich w/ Joan Rivers / Mark Burnett January 2009  –  March 2009  (3 months) * Researched and interview millionaires for casting reels \n* Created casting one sheets on all potential candidates \n* Filmed local casting reels for network approval Casting Associate Producer Half Yard Productions / TLC's Say Yes to the Dress February 2008  –  June 2008  (5 months) * Conducted pre-interviews with all prospective candidates for the shoe and coordinated all guess relations \n* Generated story synopsis for Field Producers highlighting all interesting stories \n* Produce Story arcs to assist our field team with their on-site productions \n* Creating casting reports for corporate approval Casting Associate Producer Half Yard Productions / TLC's Say Yes to the Dress February 2008  –  June 2008  (5 months) * Conducted pre-interviews with all prospective candidates for the shoe and coordinated all guess relations \n* Generated story synopsis for Field Producers highlighting all interesting stories \n* Produce Story arcs to assist our field team with their on-site productions \n* Creating casting reports for corporate approval Studio and Field Associate Producer TLC's Fashionably Late w/ Stacy London / BBC Worldwide July 2007  –  October 2007  (4 months) * Coordinated and attended all field shoots  \n* Shot b-cam on location with Sony z1 \n* Booked guests appearing on the show and briefed them prior to each segment \n* Attended meetings with show host and accompanied her on field shoots \n* Participated in daily production meetings, researched and pitch segment and story ideas, wrote segment scripts \n* Assisted as Stylist and Casting Director during pilot Studio and Field Associate Producer TLC's Fashionably Late w/ Stacy London / BBC Worldwide July 2007  –  October 2007  (4 months) * Coordinated and attended all field shoots  \n* Shot b-cam on location with Sony z1 \n* Booked guests appearing on the show and briefed them prior to each segment \n* Attended meetings with show host and accompanied her on field shoots \n* Participated in daily production meetings, researched and pitch segment and story ideas, wrote segment scripts \n* Assisted as Stylist and Casting Director during pilot Associate Producer NBC News/MSNBC YOUR BUSINESS June 2006  –  July 2007  (1 year 2 months) * Researched show topics and new show concepts for packaged pieces  \n* Interviewed, researched and booked all guests appearing on each show segment \n* Wrote segment scripts in addition to scripts for field shoots \n* Accompany Producers on field shoots to conduct interviews with featured business and shoot B rolls for show \n* Responsible for all travel arrangement, booking guests, calendars/facilities, guest relations, maintain call list Associate Producer NBC News/MSNBC YOUR BUSINESS June 2006  –  July 2007  (1 year 2 months) * Researched show topics and new show concepts for packaged pieces  \n* Interviewed, researched and booked all guests appearing on each show segment \n* Wrote segment scripts in addition to scripts for field shoots \n* Accompany Producers on field shoots to conduct interviews with featured business and shoot B rolls for show \n* Responsible for all travel arrangement, booking guests, calendars/facilities, guest relations, maintain call list Associate Field Producer Tapestry International / TLC's Elemtary School Series October 2005  –  February 2007  (1 year 5 months) * Researched show topics and new show concepts for packaged pieces \n* Obtained all legal releases and rights management for TLC Elementary \n* Wrote segment scripts as well as script rewrites for shows \n* Responsible for all field shoots, booked talent, crew and facilitated all voice over recordings Associate Field Producer Tapestry International / TLC's Elemtary School Series October 2005  –  February 2007  (1 year 5 months) * Researched show topics and new show concepts for packaged pieces \n* Obtained all legal releases and rights management for TLC Elementary \n* Wrote segment scripts as well as script rewrites for shows \n* Responsible for all field shoots, booked talent, crew and facilitated all voice over recordings Travel Coordinator NBC Universal 2005  –  2006  (1 year) Travel Coordinator NBC Universal 2005  –  2006  (1 year) Travel Co-ordinator / Production Assistant NBC Universal / The Maury Show August 2004  –  September 2005  (1 year 2 months) * Coordinated all facets of guest accommodations and relations; dealt with multiple vendors to ensure best price \n* Provided assistance to Producer/Associate Producer on an ongoing basis and acted as meet/greet coordinator \n* Prepared, managed and tracked budget, petty cash account and expense reports \n* Arranged all ground and air travel, hotel arrangements and transportation to and from show for guests Travel Co-ordinator / Production Assistant NBC Universal / The Maury Show August 2004  –  September 2005  (1 year 2 months) * Coordinated all facets of guest accommodations and relations; dealt with multiple vendors to ensure best price \n* Provided assistance to Producer/Associate Producer on an ongoing basis and acted as meet/greet coordinator \n* Prepared, managed and tracked budget, petty cash account and expense reports \n* Arranged all ground and air travel, hotel arrangements and transportation to and from show for guests Olympic \"Pass the Torch\" show NBC Universal July 2004  –  July 2004  (1 month) * Production Assistant for segments from recently shot material for live broadcast of the Olympic Torch Passing \n* Responsible for duplication of Beta SP to Digi Beta format for taped segments Olympic \"Pass the Torch\" show NBC Universal July 2004  –  July 2004  (1 month) * Production Assistant for segments from recently shot material for live broadcast of the Olympic Torch Passing \n* Responsible for duplication of Beta SP to Digi Beta format for taped segments Bad Boy's of Comedy / HBO series Bad Boy Films/ Latham Entertainment May 2004  –  June 2004  (2 months) * Maintained and regulated call sheets for crew and talent \n* Meet/ greet guest coordinator \n* Managed traffic flow/security behind the scenes and organized VIP's \n* Audience coordination and organization Bad Boy's of Comedy / HBO series Bad Boy Films/ Latham Entertainment May 2004  –  June 2004  (2 months) * Maintained and regulated call sheets for crew and talent \n* Meet/ greet guest coordinator \n* Managed traffic flow/security behind the scenes and organized VIP's \n* Audience coordination and organization Field PA/ Executive Assistant Crossing Over w/ John Edward / Sixth Avenue Productions April 2003  –  March 2004  (1 year) *Handled all aspects of field production segments including obtaining all necessary approvals and releases \n* Booked all outside crews, equipment for shoots \n* Maintained and managed daily activities and administrative duties for two Executive Producers and John Edward \n* Key liaison between Executive Producers, Corporate staff and internal staff of 40 people Field PA/ Executive Assistant Crossing Over w/ John Edward / Sixth Avenue Productions April 2003  –  March 2004  (1 year) *Handled all aspects of field production segments including obtaining all necessary approvals and releases \n* Booked all outside crews, equipment for shoots \n* Maintained and managed daily activities and administrative duties for two Executive Producers and John Edward \n* Key liaison between Executive Producers, Corporate staff and internal staff of 40 people ASSISTANT AGENT UGLY NY 2004  –  2004  (less than a year) ASSISTANT AGENT UGLY NY 2004  –  2004  (less than a year) Skills Television Video Casting Storytelling Voice Over Comedy Reality Video Production Avid Producing Post Production Broadcast Commercials Film Digital Media Skills  Television Video Casting Storytelling Voice Over Comedy Reality Video Production Avid Producing Post Production Broadcast Commercials Film Digital Media Television Video Casting Storytelling Voice Over Comedy Reality Video Production Avid Producing Post Production Broadcast Commercials Film Digital Media Television Video Casting Storytelling Voice Over Comedy Reality Video Production Avid Producing Post Production Broadcast Commercials Film Digital Media Education Seton Hall University B.A,  Television and Film 1999  – 2001 Seton Hall University certification in Television and Video Studio and Remote Production Activities and Societies:  WSOU Radio ,  SHU TV hanover park High School Dipolma 1995  – 1998 Seton Hall University B.A,  Television and Film 1999  – 2001 Seton Hall University certification in Television and Video Studio and Remote Production Activities and Societies:  WSOU Radio ,  SHU TV Seton Hall University B.A,  Television and Film 1999  – 2001 Seton Hall University certification in Television and Video Studio and Remote Production Activities and Societies:  WSOU Radio ,  SHU TV Seton Hall University B.A,  Television and Film 1999  – 2001 Seton Hall University certification in Television and Video Studio and Remote Production Activities and Societies:  WSOU Radio ,  SHU TV hanover park High School Dipolma 1995  – 1998 hanover park High School Dipolma 1995  – 1998 hanover park High School Dipolma 1995  – 1998 ", "Languages English Native or bilingual proficiency Hebrew Professional working proficiency Arabic Elementary proficiency Spanish Full professional proficiency French Limited working proficiency English Native or bilingual proficiency Hebrew Professional working proficiency Arabic Elementary proficiency Spanish Full professional proficiency French Limited working proficiency English Native or bilingual proficiency Hebrew Professional working proficiency Arabic Elementary proficiency Spanish Full professional proficiency French Limited working proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Full professional proficiency Limited working proficiency Skills Final Cut Pro HTML iNews AP ENPS Arabic Spanish French Hebrew Data Visualization Audio Editing Photoshop Wordpress Proofreading InDesign Copy Editing Blogging Avid Journalism WordPress Social Media Editorial Broadcast See 7+     See less Skills  Final Cut Pro HTML iNews AP ENPS Arabic Spanish French Hebrew Data Visualization Audio Editing Photoshop Wordpress Proofreading InDesign Copy Editing Blogging Avid Journalism WordPress Social Media Editorial Broadcast See 7+     See less Final Cut Pro HTML iNews AP ENPS Arabic Spanish French Hebrew Data Visualization Audio Editing Photoshop Wordpress Proofreading InDesign Copy Editing Blogging Avid Journalism WordPress Social Media Editorial Broadcast See 7+     See less Final Cut Pro HTML iNews AP ENPS Arabic Spanish French Hebrew Data Visualization Audio Editing Photoshop Wordpress Proofreading InDesign Copy Editing Blogging Avid Journalism WordPress Social Media Editorial Broadcast See 7+     See less Honors & Awards ", "Summary Passionate and dedicated worker; capable of handling fast-paced environments, meeting tough deadlines, and balancing multiple projects. \n \nSpecialties: media producing and writing, copy editing, video editing, online and social media production. Summary Passionate and dedicated worker; capable of handling fast-paced environments, meeting tough deadlines, and balancing multiple projects. \n \nSpecialties: media producing and writing, copy editing, video editing, online and social media production. Passionate and dedicated worker; capable of handling fast-paced environments, meeting tough deadlines, and balancing multiple projects. \n \nSpecialties: media producing and writing, copy editing, video editing, online and social media production. Passionate and dedicated worker; capable of handling fast-paced environments, meeting tough deadlines, and balancing multiple projects. \n \nSpecialties: media producing and writing, copy editing, video editing, online and social media production. Experience Segment Producer, The Last Word MSNBC August 2015  – Present (1 month) Greater New York City Area Senior Producer (Line-up) Seven Network Limited May 2013  –  July 2015  (2 years 3 months) Sydney Area, Australia • Supervising all editorial content on air and online.  \n• Setting the news agenda and generating story ideas. \n• Producing segments and writing in-show teases. \n• Managing a team of producers, assigning stories and editing work. \n• Acting Executive Producer in control room, making all editorial decisions. \n• Timing shows and communicating with hosts in control room. \n• Inspiring co-workers by being a kick-ass manager. TV Associate Producer Yahoo! April 2013  –  May 2013  (2 months) Sydney Area, Australia • Created original news and entertainment content for Channel Seven's TV website. \n• Drafted and implemented online strategies. \n• Managed social media accounts and websites. \n Freelance Producer Seven Network December 2012  –  April 2013  (5 months) Sydney Area, Australia • Field-produced news stories for 7's \"Today Tonight\". Video Producer / Segment Producer, \"PoliticsNation\" MSNBC December 2010  –  November 2012  (2 years) Greater New York City Area • Oversaw and managed all video content prior to air. \n• Produced elaborate news segments with video and graphic elements. \n• Responsible for organizing and manning breaking news, debate and election coverage. \n• Launched \"PoliticsNation\" website and contributed unique, engaging content to build viewer base. Video Producer MSNBC October 2009  –  November 2010  (1 year 2 months) Greater New York City Area • Responsible for organizing and manning breaking news. \n• Oversaw and managed all video content prior to air. \n• Directed teams of editors and engineers.  \n Associate Producer, \"Early Today\" NBC News September 2008  –  October 2009  (1 year 2 months) Greater New York City Area • Researched, wrote and copyedited original content for news segments and teases. \n• Edited accompanying video elements. \n• Produced related material for msnbc.com and CNBC. \n Production Assistant MSNBC March 2008  –  September 2008  (7 months) Greater New York City Area • Organized daily briefs for hosts. \n• Coordinated in-studio breaking news coverage. \n• Researched and wrote scripts. \n Production Assistant WNYT September 2006  –  January 2008  (1 year 5 months) Albany, New York Area • Composed short segments and articles for air and online. Segment Producer, The Last Word MSNBC August 2015  – Present (1 month) Greater New York City Area Segment Producer, The Last Word MSNBC August 2015  – Present (1 month) Greater New York City Area Senior Producer (Line-up) Seven Network Limited May 2013  –  July 2015  (2 years 3 months) Sydney Area, Australia • Supervising all editorial content on air and online.  \n• Setting the news agenda and generating story ideas. \n• Producing segments and writing in-show teases. \n• Managing a team of producers, assigning stories and editing work. \n• Acting Executive Producer in control room, making all editorial decisions. \n• Timing shows and communicating with hosts in control room. \n• Inspiring co-workers by being a kick-ass manager. Senior Producer (Line-up) Seven Network Limited May 2013  –  July 2015  (2 years 3 months) Sydney Area, Australia • Supervising all editorial content on air and online.  \n• Setting the news agenda and generating story ideas. \n• Producing segments and writing in-show teases. \n• Managing a team of producers, assigning stories and editing work. \n• Acting Executive Producer in control room, making all editorial decisions. \n• Timing shows and communicating with hosts in control room. \n• Inspiring co-workers by being a kick-ass manager. TV Associate Producer Yahoo! April 2013  –  May 2013  (2 months) Sydney Area, Australia • Created original news and entertainment content for Channel Seven's TV website. \n• Drafted and implemented online strategies. \n• Managed social media accounts and websites. \n TV Associate Producer Yahoo! April 2013  –  May 2013  (2 months) Sydney Area, Australia • Created original news and entertainment content for Channel Seven's TV website. \n• Drafted and implemented online strategies. \n• Managed social media accounts and websites. \n Freelance Producer Seven Network December 2012  –  April 2013  (5 months) Sydney Area, Australia • Field-produced news stories for 7's \"Today Tonight\". Freelance Producer Seven Network December 2012  –  April 2013  (5 months) Sydney Area, Australia • Field-produced news stories for 7's \"Today Tonight\". Video Producer / Segment Producer, \"PoliticsNation\" MSNBC December 2010  –  November 2012  (2 years) Greater New York City Area • Oversaw and managed all video content prior to air. \n• Produced elaborate news segments with video and graphic elements. \n• Responsible for organizing and manning breaking news, debate and election coverage. \n• Launched \"PoliticsNation\" website and contributed unique, engaging content to build viewer base. Video Producer / Segment Producer, \"PoliticsNation\" MSNBC December 2010  –  November 2012  (2 years) Greater New York City Area • Oversaw and managed all video content prior to air. \n• Produced elaborate news segments with video and graphic elements. \n• Responsible for organizing and manning breaking news, debate and election coverage. \n• Launched \"PoliticsNation\" website and contributed unique, engaging content to build viewer base. Video Producer MSNBC October 2009  –  November 2010  (1 year 2 months) Greater New York City Area • Responsible for organizing and manning breaking news. \n• Oversaw and managed all video content prior to air. \n• Directed teams of editors and engineers.  \n Video Producer MSNBC October 2009  –  November 2010  (1 year 2 months) Greater New York City Area • Responsible for organizing and manning breaking news. \n• Oversaw and managed all video content prior to air. \n• Directed teams of editors and engineers.  \n Associate Producer, \"Early Today\" NBC News September 2008  –  October 2009  (1 year 2 months) Greater New York City Area • Researched, wrote and copyedited original content for news segments and teases. \n• Edited accompanying video elements. \n• Produced related material for msnbc.com and CNBC. \n Associate Producer, \"Early Today\" NBC News September 2008  –  October 2009  (1 year 2 months) Greater New York City Area • Researched, wrote and copyedited original content for news segments and teases. \n• Edited accompanying video elements. \n• Produced related material for msnbc.com and CNBC. \n Production Assistant MSNBC March 2008  –  September 2008  (7 months) Greater New York City Area • Organized daily briefs for hosts. \n• Coordinated in-studio breaking news coverage. \n• Researched and wrote scripts. \n Production Assistant MSNBC March 2008  –  September 2008  (7 months) Greater New York City Area • Organized daily briefs for hosts. \n• Coordinated in-studio breaking news coverage. \n• Researched and wrote scripts. \n Production Assistant WNYT September 2006  –  January 2008  (1 year 5 months) Albany, New York Area • Composed short segments and articles for air and online. Production Assistant WNYT September 2006  –  January 2008  (1 year 5 months) Albany, New York Area • Composed short segments and articles for air and online. Languages French French French Skills Microsoft Office PowerPoint Excel Copy Editing Research Breaking News Video Editing Editing Broadcast News Writing Television Production Video Production Blogging Microsoft Excel Web Content Management Producing Press Releases Social Media Storytelling Television Writing Video Journalism Public Relations New Media See 10+     See less Skills  Microsoft Office PowerPoint Excel Copy Editing Research Breaking News Video Editing Editing Broadcast News Writing Television Production Video Production Blogging Microsoft Excel Web Content Management Producing Press Releases Social Media Storytelling Television Writing Video Journalism Public Relations New Media See 10+     See less Microsoft Office PowerPoint Excel Copy Editing Research Breaking News Video Editing Editing Broadcast News Writing Television Production Video Production Blogging Microsoft Excel Web Content Management Producing Press Releases Social Media Storytelling Television Writing Video Journalism Public Relations New Media See 10+     See less Microsoft Office PowerPoint Excel Copy Editing Research Breaking News Video Editing Editing Broadcast News Writing Television Production Video Production Blogging Microsoft Excel Web Content Management Producing Press Releases Social Media Storytelling Television Writing Video Journalism Public Relations New Media See 10+     See less Education The George Washington University MPS,  Strategic Public Relations 2008  – 2010 Master of Professional Studies, Strategic Public Relations and Political Management with honors. \nCoursework in political theory, campaign organization, media and public relations, ethics, and political leadership. The College of Saint Rose BA,  Communications , English 2004  – 2008 Bachelor of Arts, Communications and English major with honors. \nCoursework in news writing, broadcasting, video and sound editing. Senior Editor of student newspaper, The Chronicle. The George Washington University MPS,  Strategic Public Relations 2008  – 2010 Master of Professional Studies, Strategic Public Relations and Political Management with honors. \nCoursework in political theory, campaign organization, media and public relations, ethics, and political leadership. The George Washington University MPS,  Strategic Public Relations 2008  – 2010 Master of Professional Studies, Strategic Public Relations and Political Management with honors. \nCoursework in political theory, campaign organization, media and public relations, ethics, and political leadership. The George Washington University MPS,  Strategic Public Relations 2008  – 2010 Master of Professional Studies, Strategic Public Relations and Political Management with honors. \nCoursework in political theory, campaign organization, media and public relations, ethics, and political leadership. The College of Saint Rose BA,  Communications , English 2004  – 2008 Bachelor of Arts, Communications and English major with honors. \nCoursework in news writing, broadcasting, video and sound editing. Senior Editor of student newspaper, The Chronicle. The College of Saint Rose BA,  Communications , English 2004  – 2008 Bachelor of Arts, Communications and English major with honors. \nCoursework in news writing, broadcasting, video and sound editing. Senior Editor of student newspaper, The Chronicle. The College of Saint Rose BA,  Communications , English 2004  – 2008 Bachelor of Arts, Communications and English major with honors. \nCoursework in news writing, broadcasting, video and sound editing. Senior Editor of student newspaper, The Chronicle. Honors & Awards Additional Honors & Awards Two-time Ovation award winner, 2011 Additional Honors & Awards Two-time Ovation award winner, 2011 Additional Honors & Awards Two-time Ovation award winner, 2011 Additional Honors & Awards Two-time Ovation award winner, 2011 ", "Experience Senior Executive Producer MSNBC July 2006  – Present (9 years 2 months) New York, NY Oversee development and production of all long form programming on MSNBC. Senior/Supervising Producer- Longform MSNBC January 2000  –  July 2006  (6 years 7 months) Senior producer of hundreds of documentary programs. Supervising producer overseeing the longform department and its programming inventory. Senior Producer, Dayside News MSNBC April 1996  –  December 1999  (3 years 9 months) One of the lead members of MSNBC's Launch Team. Pre-launch, hired majority of Dayside staff. At launch, oversaw three hours of afternoon programming. Later, managed newsroom staff, daily news coverage planning and field producing of major live events. Executive Producer, 10PM News NBC5- WMAQ Chicago 1994  –  1996  (2 years) Supervised station's primary newscast. Producer, 10PM News NBC5 WMAQ- Chicago 1987  –  1996  (9 years) Producer responsible for station's primary newscast. Senior Executive Producer MSNBC July 2006  – Present (9 years 2 months) New York, NY Oversee development and production of all long form programming on MSNBC. Senior Executive Producer MSNBC July 2006  – Present (9 years 2 months) New York, NY Oversee development and production of all long form programming on MSNBC. Senior/Supervising Producer- Longform MSNBC January 2000  –  July 2006  (6 years 7 months) Senior producer of hundreds of documentary programs. Supervising producer overseeing the longform department and its programming inventory. Senior/Supervising Producer- Longform MSNBC January 2000  –  July 2006  (6 years 7 months) Senior producer of hundreds of documentary programs. Supervising producer overseeing the longform department and its programming inventory. Senior Producer, Dayside News MSNBC April 1996  –  December 1999  (3 years 9 months) One of the lead members of MSNBC's Launch Team. Pre-launch, hired majority of Dayside staff. At launch, oversaw three hours of afternoon programming. Later, managed newsroom staff, daily news coverage planning and field producing of major live events. Senior Producer, Dayside News MSNBC April 1996  –  December 1999  (3 years 9 months) One of the lead members of MSNBC's Launch Team. Pre-launch, hired majority of Dayside staff. At launch, oversaw three hours of afternoon programming. Later, managed newsroom staff, daily news coverage planning and field producing of major live events. Executive Producer, 10PM News NBC5- WMAQ Chicago 1994  –  1996  (2 years) Supervised station's primary newscast. Executive Producer, 10PM News NBC5- WMAQ Chicago 1994  –  1996  (2 years) Supervised station's primary newscast. Producer, 10PM News NBC5 WMAQ- Chicago 1987  –  1996  (9 years) Producer responsible for station's primary newscast. Producer, 10PM News NBC5 WMAQ- Chicago 1987  –  1996  (9 years) Producer responsible for station's primary newscast. Skills Breaking News Television Skills  Breaking News Television Breaking News Television Breaking News Television Education Fenton HS University of Illinois at Chicago Bachelor's,  Communication and Theater Fenton HS Fenton HS Fenton HS University of Illinois at Chicago Bachelor's,  Communication and Theater University of Illinois at Chicago Bachelor's,  Communication and Theater University of Illinois at Chicago Bachelor's,  Communication and Theater ", "Experience Dir. of Development/Sr. Producer, Lonform Programs and MSNBC Films MSNBC 2000  – Present (15 years) Executive Producer, \"Lockup\" series MSNBC 2005  – Present (10 years) Senior Producer, Morning Programs MSNBC May 1999  –  August 2000  (1 year 4 months) Producer MSNBC July 1998  –  May 1999  (11 months) Producer, 5pm/6pm Newscast WNBC 1996  –  1998  (2 years) Producer WIXT-TV 1993  –  1996  (3 years) Anchor/Reporter/Supervising Producer KOMU-TV 8 1990  –  1993  (3 years) Dir. of Development/Sr. Producer, Lonform Programs and MSNBC Films MSNBC 2000  – Present (15 years) Dir. of Development/Sr. Producer, Lonform Programs and MSNBC Films MSNBC 2000  – Present (15 years) Executive Producer, \"Lockup\" series MSNBC 2005  – Present (10 years) Executive Producer, \"Lockup\" series MSNBC 2005  – Present (10 years) Senior Producer, Morning Programs MSNBC May 1999  –  August 2000  (1 year 4 months) Senior Producer, Morning Programs MSNBC May 1999  –  August 2000  (1 year 4 months) Producer MSNBC July 1998  –  May 1999  (11 months) Producer MSNBC July 1998  –  May 1999  (11 months) Producer, 5pm/6pm Newscast WNBC 1996  –  1998  (2 years) Producer, 5pm/6pm Newscast WNBC 1996  –  1998  (2 years) Producer WIXT-TV 1993  –  1996  (3 years) Producer WIXT-TV 1993  –  1996  (3 years) Anchor/Reporter/Supervising Producer KOMU-TV 8 1990  –  1993  (3 years) Anchor/Reporter/Supervising Producer KOMU-TV 8 1990  –  1993  (3 years) Education University of Missouri-Columbia M.A.,  Broadcast Journalism 1990  – 1992 Cornell University B.A.,  American Government 1987  – 1990 University of Missouri-Columbia M.A.,  Broadcast Journalism 1990  – 1992 University of Missouri-Columbia M.A.,  Broadcast Journalism 1990  – 1992 University of Missouri-Columbia M.A.,  Broadcast Journalism 1990  – 1992 Cornell University B.A.,  American Government 1987  – 1990 Cornell University B.A.,  American Government 1987  – 1990 Cornell University B.A.,  American Government 1987  – 1990 ", "Summary I love making content that connects viewers with new ideas and compelling stories. For the past ten years I’ve focused on that goal, building television and digital series for networks like MSNBC, Travel Channel, Food Network, HGTV, Discovery, History, MTV, BonAppetit.com, and GQ.com. I have experience supervising teams in the field, studio, control room and edit bay, and know how to quickly and creatively shape content from concept through delivery.  \n \nMy credits are diverse, spanning documentary, branded, food, competition, science, design, crime, reality and history series. Across the board, I bring a nose for story, eye for directing, and a collaborative spirit.  \n \nSpecialties: Broadcast/Digital Production, Story Development, Supervising Teams, Producing, Directing, Field Producing, Shooting, Writing, Story Producing, Post Producing, Overseeing Multi-Camera Shoots, Television & Web Series, Documentaries \n Summary I love making content that connects viewers with new ideas and compelling stories. For the past ten years I’ve focused on that goal, building television and digital series for networks like MSNBC, Travel Channel, Food Network, HGTV, Discovery, History, MTV, BonAppetit.com, and GQ.com. I have experience supervising teams in the field, studio, control room and edit bay, and know how to quickly and creatively shape content from concept through delivery.  \n \nMy credits are diverse, spanning documentary, branded, food, competition, science, design, crime, reality and history series. Across the board, I bring a nose for story, eye for directing, and a collaborative spirit.  \n \nSpecialties: Broadcast/Digital Production, Story Development, Supervising Teams, Producing, Directing, Field Producing, Shooting, Writing, Story Producing, Post Producing, Overseeing Multi-Camera Shoots, Television & Web Series, Documentaries \n I love making content that connects viewers with new ideas and compelling stories. For the past ten years I’ve focused on that goal, building television and digital series for networks like MSNBC, Travel Channel, Food Network, HGTV, Discovery, History, MTV, BonAppetit.com, and GQ.com. I have experience supervising teams in the field, studio, control room and edit bay, and know how to quickly and creatively shape content from concept through delivery.  \n \nMy credits are diverse, spanning documentary, branded, food, competition, science, design, crime, reality and history series. Across the board, I bring a nose for story, eye for directing, and a collaborative spirit.  \n \nSpecialties: Broadcast/Digital Production, Story Development, Supervising Teams, Producing, Directing, Field Producing, Shooting, Writing, Story Producing, Post Producing, Overseeing Multi-Camera Shoots, Television & Web Series, Documentaries \n I love making content that connects viewers with new ideas and compelling stories. For the past ten years I’ve focused on that goal, building television and digital series for networks like MSNBC, Travel Channel, Food Network, HGTV, Discovery, History, MTV, BonAppetit.com, and GQ.com. I have experience supervising teams in the field, studio, control room and edit bay, and know how to quickly and creatively shape content from concept through delivery.  \n \nMy credits are diverse, spanning documentary, branded, food, competition, science, design, crime, reality and history series. Across the board, I bring a nose for story, eye for directing, and a collaborative spirit.  \n \nSpecialties: Broadcast/Digital Production, Story Development, Supervising Teams, Producing, Directing, Field Producing, Shooting, Writing, Story Producing, Post Producing, Overseeing Multi-Camera Shoots, Television & Web Series, Documentaries \n Experience Supervising Producer Michael Levitt Productions June 2015  – Present (3 months) Greater Los Angeles Area GSN - Pilot \n- Supervised a pilot based off the network's popular show, Skin Wars \n- Worked with executives to establish pilot format; implemented vision across departments \n- Created schedules, generated story beats, established talent talking points  \n- Supervised producers on set, managed story team, prepped for post \n \n Producer Hoff Productions October 2014  –  March 2015  (6 months) San Francisco Bay Area DISCOVERY SCIENCE - \"What Could Possibly Go Wrong?\"  \n \n- Produced a series in which two friends use science to successfully execute internet fails  \n- Generated daily shoot schedules, script beats, shot lists, and talent talking points \n- Oversaw story in the field, assembled stringouts for post \n \n \n Supervising Producer I Digital Networks @ Condé Nast Entertainment Conde Nast March 2014  –  September 2014  (7 months) Greater New York City Area - Managed digital channel launch for Bon Appetit from conception through delivery \n- Supervised multi-camera studio and location shoots for GQ, Teen Vogue and SELF \n- Managed internal and external production companies, filmmakers, writers and editors from pre-production through post \n- Oversaw creative content for series: pitches, casting, scripts, and cuts  \n- Promoted brand standards and strengths across series \n- Created and maintained shoot, edit, and delivery schedules \n- Established content strategies with marketing, development department and creative teams \n- Managed multiple budgets, schedules, and shoots simultaneously  Supervising Producer CBS Corporation November 2013  –  March 2014  (5 months) Greater Los Angeles Area HGTV - \"Brother vs. Brother\" (Competition Design Series) \n \n- Supervised a competition home renovation series featuring the network’s top talent \n- Hired and managed producers; provided creative direction for series’ story arc \n- Directed cast and crew on multi-camera shoots \n- Established story beats, shot lists, managed schedules \n- Built interdepartmental workflow between LA field teams and NY post production Supervising Producer Original Media August 2013  –  November 2013  (4 months) Greater New York City Area TRAVEL CHANNEL - \"American Grilled\" (Food Competition Series) \n \n- Produced a traveling competition cooking show about grill masters \n- Established series’ format with executives, implemented vision across departments \n- Managed story department, created episode line ups, generated story beats \n- Directed talent, vetted scripts, prepped episodes for post \n Senior Producer Relativity Media June 2013  –  August 2013  (3 months) Greater Los Angeles Area FOOD NETWORK - \"Guy's Grocery Games\" (Food Competition Series) \n \n- Produced a supermarket competition cooking show hosted by Guy Fieri \n- Determined format, style, and competition games with executives \n- Pre-interviewed talent, created cast lineup, vetted scripts  \n- Supervised story team, wrote story beats, ran interviews, prepped for post Senior Producer Rock Shrimp Productions NY, LLC March 2013  –  June 2013  (4 months) Greater New York City Area FOOD NETWORK - \"Beat Bobby Flay\" (Food Competition Series) \n \n- Produced a competition show in which chefs try and beat Bobby Flay with a signature dish \n- Supervised story department, interviewed chefs and host, prepped for post \n Senior Producer Rock Shrimp Productions January 2013  –  June 2013  (6 months) Greater New York City Area MULLEN ADVERTISING - \"Fruyo: Effortless\" (:30 National Commercial) \nMULLEN ADVERTISING - \"FAGE: Fill the Fridge\" (Digital Series) \n \n- Produced commercial spot and web series with Bobby Flay, featuring FAGE yogurt \n- Worked with agency to assess client goals, developed cost and timing solutions \n- Managed internal team and external vendors, kept projects on schedule and within budget \n- Oversaw creative from inception to delivery, ensured content met brand strategy Senior Producer Jane Street Entertainment 2011  –  2013  (2 years) Greater New York City Area HGTV - \"Cousins Undercover\" (Home Makeover Series) \nFOOD NETWORK - “Sweet Genius\" (Food Competition Series) \nLIFETIME - \"24 Hour Catwalk\" (Design Competition Series) Senior Producer Notional August 2008  –  2012  (4 years) Greater New York City Area FOOD NETWORK - \"Chopped”\t(Food Competition Series, Seasons 1-10) \n \n- Produced first ten seasons of one of Food Network's highest rated series \n- Trained production teams on series’ format, established workflow systems for field and post teams \n- Supervised control room, field directed bio packages, oversaw interviews \n- Post produced episodes, tracked network milestones and revisions Story Producer Triage Entertainment 2011  –  2011  (less than a year) Greater New York City Area FOOD NETWORK - “All-Star Family Cook-off” (Food Competition Special) \n \n- Produced special in which Food Network stars work with family members to win money for charity \n- Pre-interviewed talent, directed cast on set, ran interviews, prepped story for post Story & Post Producer CBS Television Distribution May 2009  –  August 2009  (4 months) Greater New York City Area FOOD NETWORK-\t“24 Hour Restaurant Battle”\t(Food Competition Series) \n \n- Story and post produced a competition series in which teams open their own restaurants \n- Post produced episodes, assembled Avid stringouts for editors \n- Managed network revisions and deadlines on multiple edits simultaneously  Producer / Shooter MTV September 2007  –  July 2009  (1 year 11 months) Greater New York City Area MTV - \"16 and Pregnant\" (Doc Series) \nMTV - \"True Life: I Have a Husband in Iraq” (Doc Series) \n \n- Directed talent, created daily story beats and shot lists \n- Tracked story in the field, generated summaries for post Field Producer Overture Films / Michael Moore January 2009  –  May 2009  (5 months) “Capitalism: A Love Story” (Doc Feature) \n \n- Researched, coordinated, and directed segments for a film covering the world financial crisis \n- Located, followed and interviewed families dealing with foreclosures and living on the streets Producer / Shooter MSNBC May 2008  –  December 2008  (8 months) Greater New York City Area MSNBC - “Runaways: Austin” (Documentary Series) \nMSNBC - \"Runaways: San Diego\" (Documentary Series) \n \n- Filmed and followed the lives of runaway teens dealing with housing and drug problems \n- Researched shelters, found contributors, tracked story arcs, prepped outlines for post Producer / Shooter Gigantic Pictures April 2008  –  May 2008  (2 months) Greater New York City Area MTV\t-\t“Camp’d Out”\t(Reality Series) \n \n-Field produced, filmed, and tracked the stories of three kids at a summer snowboard camp striving to meet their personal athletic goals Producer / Shooter Left Right March 2008  –  April 2008  (2 months) Greater New York City Area MTV\t-\t“True Life: Another Life on the Web” (Doc Series) \nMTV - \"True Life: I Need A Transplant\" (Doc Series) \n \n- Field produced the story of a teenage girl with a secret online identity, and a young man battling cancer. Operated as a one-woman band, shooting, directing, producing and running audio. \n Producer / Shooter Four Seasons International February 2008  –  March 2008  (2 months) Greater New York City Area A&E\t-\t“Psychic Kids”\t(Series) \n \n- Filmed and interviewed kids coping with their psychic abilities \n- Shot / directed / field produced segments Field Producer The Idea Factory December 2007  –  February 2008  (3 months) Greater Los Angeles Area TLC - \"Big Medicine\" (Reality Series) \n \n- Field directed the journey of an overweight patient going through weight-loss surgery \n- Tracked episode narrative, generated story beats, prepped episode for post Field Producer CBS September 2007  –  November 2007  (3 months) Greater Los Angeles Area CBS \"Do You Trust Me\" (Game show) Story & Post Producer Concentric Entertainment June 2007  –  September 2007  (4 months) Greater New York City Area FINE LIVING - \"Home 2nd Home\" (Home Renovation Series) \n \n- Produced, wrote, and post produced a show about the challenges of buying a second home \n Story & Post Producer Engel Entertainment August 2006  –  May 2007  (10 months) Greater New York City Area DISCOVERY HEALTH - \"Runway Moms\" (Reality Series) \n \n- Story and post produced a series about the health concerns of pregnant models living in NYC Producer / Writer Dan Sexton Media March 2006  –  August 2006  (6 months) San Francisco Bay Area FINE LIVING \"Windshield America\" \n \n- Field produced and wrote a host driven series about individuals who are helping their local communities Producer / Writer Indigo Films October 2005  –  February 2006  (5 months) San Francisco Bay Area WEATHER CHANNEL- “Full Force Nature” \n \n- Wrote and field produced a half-hour series about the effects of devastating weather \n- Operated as a one-woman band, shooting, directing, producing and running audio \n Senior Producer Indigo Films May 2005  –  October 2005  (6 months) San Francisco Bay Area HISTORY CHANNEL - \"USS Constellation: The Battle for Freedom\" (Doc Special) \n \n- Produced an overseas reenactment-driven documentary about the 1850’s transatlantic slave trade \n- Hired talent and crew, negotiated rates and contracts, managed budgets and schedules \n- Generated script breakdowns and shot lists, directed second unit Producer Michael Hoff Productions February 2005  –  May 2005  (4 months) San Francisco Bay Area DISCOVERY - “Best Ranger Competition”  \nDISCOVERY - \"Motorcycle Lightning\" \nDISCOVERY - \"Wired Next Fest\" \n \n- Produced, field directed and shot 2nd camera for Discovery specials featuring Army Rangers and motorcycle enthusiasts Supervising Producer Michael Hoff Productions February 2003  –  January 2005  (2 years) San Francisco Bay Area TruTV- \"I,Detective\" (True Crime Series) \n \n- Supervised four seasons of a true crime series about homicide detectives \n- Liaison between network and production company on all creative, logistic, and editorial issues \n- Directed 52 recreations, created script breakdowns, oversaw casting and art departments \n- Vetted pitches, scripts and cuts, managed network milestones, revisions and deliverables Supervising Producer Michael Levitt Productions June 2015  – Present (3 months) Greater Los Angeles Area GSN - Pilot \n- Supervised a pilot based off the network's popular show, Skin Wars \n- Worked with executives to establish pilot format; implemented vision across departments \n- Created schedules, generated story beats, established talent talking points  \n- Supervised producers on set, managed story team, prepped for post \n \n Supervising Producer Michael Levitt Productions June 2015  – Present (3 months) Greater Los Angeles Area GSN - Pilot \n- Supervised a pilot based off the network's popular show, Skin Wars \n- Worked with executives to establish pilot format; implemented vision across departments \n- Created schedules, generated story beats, established talent talking points  \n- Supervised producers on set, managed story team, prepped for post \n \n Producer Hoff Productions October 2014  –  March 2015  (6 months) San Francisco Bay Area DISCOVERY SCIENCE - \"What Could Possibly Go Wrong?\"  \n \n- Produced a series in which two friends use science to successfully execute internet fails  \n- Generated daily shoot schedules, script beats, shot lists, and talent talking points \n- Oversaw story in the field, assembled stringouts for post \n \n \n Producer Hoff Productions October 2014  –  March 2015  (6 months) San Francisco Bay Area DISCOVERY SCIENCE - \"What Could Possibly Go Wrong?\"  \n \n- Produced a series in which two friends use science to successfully execute internet fails  \n- Generated daily shoot schedules, script beats, shot lists, and talent talking points \n- Oversaw story in the field, assembled stringouts for post \n \n \n Supervising Producer I Digital Networks @ Condé Nast Entertainment Conde Nast March 2014  –  September 2014  (7 months) Greater New York City Area - Managed digital channel launch for Bon Appetit from conception through delivery \n- Supervised multi-camera studio and location shoots for GQ, Teen Vogue and SELF \n- Managed internal and external production companies, filmmakers, writers and editors from pre-production through post \n- Oversaw creative content for series: pitches, casting, scripts, and cuts  \n- Promoted brand standards and strengths across series \n- Created and maintained shoot, edit, and delivery schedules \n- Established content strategies with marketing, development department and creative teams \n- Managed multiple budgets, schedules, and shoots simultaneously  Supervising Producer I Digital Networks @ Condé Nast Entertainment Conde Nast March 2014  –  September 2014  (7 months) Greater New York City Area - Managed digital channel launch for Bon Appetit from conception through delivery \n- Supervised multi-camera studio and location shoots for GQ, Teen Vogue and SELF \n- Managed internal and external production companies, filmmakers, writers and editors from pre-production through post \n- Oversaw creative content for series: pitches, casting, scripts, and cuts  \n- Promoted brand standards and strengths across series \n- Created and maintained shoot, edit, and delivery schedules \n- Established content strategies with marketing, development department and creative teams \n- Managed multiple budgets, schedules, and shoots simultaneously  Supervising Producer CBS Corporation November 2013  –  March 2014  (5 months) Greater Los Angeles Area HGTV - \"Brother vs. Brother\" (Competition Design Series) \n \n- Supervised a competition home renovation series featuring the network’s top talent \n- Hired and managed producers; provided creative direction for series’ story arc \n- Directed cast and crew on multi-camera shoots \n- Established story beats, shot lists, managed schedules \n- Built interdepartmental workflow between LA field teams and NY post production Supervising Producer CBS Corporation November 2013  –  March 2014  (5 months) Greater Los Angeles Area HGTV - \"Brother vs. Brother\" (Competition Design Series) \n \n- Supervised a competition home renovation series featuring the network’s top talent \n- Hired and managed producers; provided creative direction for series’ story arc \n- Directed cast and crew on multi-camera shoots \n- Established story beats, shot lists, managed schedules \n- Built interdepartmental workflow between LA field teams and NY post production Supervising Producer Original Media August 2013  –  November 2013  (4 months) Greater New York City Area TRAVEL CHANNEL - \"American Grilled\" (Food Competition Series) \n \n- Produced a traveling competition cooking show about grill masters \n- Established series’ format with executives, implemented vision across departments \n- Managed story department, created episode line ups, generated story beats \n- Directed talent, vetted scripts, prepped episodes for post \n Supervising Producer Original Media August 2013  –  November 2013  (4 months) Greater New York City Area TRAVEL CHANNEL - \"American Grilled\" (Food Competition Series) \n \n- Produced a traveling competition cooking show about grill masters \n- Established series’ format with executives, implemented vision across departments \n- Managed story department, created episode line ups, generated story beats \n- Directed talent, vetted scripts, prepped episodes for post \n Senior Producer Relativity Media June 2013  –  August 2013  (3 months) Greater Los Angeles Area FOOD NETWORK - \"Guy's Grocery Games\" (Food Competition Series) \n \n- Produced a supermarket competition cooking show hosted by Guy Fieri \n- Determined format, style, and competition games with executives \n- Pre-interviewed talent, created cast lineup, vetted scripts  \n- Supervised story team, wrote story beats, ran interviews, prepped for post Senior Producer Relativity Media June 2013  –  August 2013  (3 months) Greater Los Angeles Area FOOD NETWORK - \"Guy's Grocery Games\" (Food Competition Series) \n \n- Produced a supermarket competition cooking show hosted by Guy Fieri \n- Determined format, style, and competition games with executives \n- Pre-interviewed talent, created cast lineup, vetted scripts  \n- Supervised story team, wrote story beats, ran interviews, prepped for post Senior Producer Rock Shrimp Productions NY, LLC March 2013  –  June 2013  (4 months) Greater New York City Area FOOD NETWORK - \"Beat Bobby Flay\" (Food Competition Series) \n \n- Produced a competition show in which chefs try and beat Bobby Flay with a signature dish \n- Supervised story department, interviewed chefs and host, prepped for post \n Senior Producer Rock Shrimp Productions NY, LLC March 2013  –  June 2013  (4 months) Greater New York City Area FOOD NETWORK - \"Beat Bobby Flay\" (Food Competition Series) \n \n- Produced a competition show in which chefs try and beat Bobby Flay with a signature dish \n- Supervised story department, interviewed chefs and host, prepped for post \n Senior Producer Rock Shrimp Productions January 2013  –  June 2013  (6 months) Greater New York City Area MULLEN ADVERTISING - \"Fruyo: Effortless\" (:30 National Commercial) \nMULLEN ADVERTISING - \"FAGE: Fill the Fridge\" (Digital Series) \n \n- Produced commercial spot and web series with Bobby Flay, featuring FAGE yogurt \n- Worked with agency to assess client goals, developed cost and timing solutions \n- Managed internal team and external vendors, kept projects on schedule and within budget \n- Oversaw creative from inception to delivery, ensured content met brand strategy Senior Producer Rock Shrimp Productions January 2013  –  June 2013  (6 months) Greater New York City Area MULLEN ADVERTISING - \"Fruyo: Effortless\" (:30 National Commercial) \nMULLEN ADVERTISING - \"FAGE: Fill the Fridge\" (Digital Series) \n \n- Produced commercial spot and web series with Bobby Flay, featuring FAGE yogurt \n- Worked with agency to assess client goals, developed cost and timing solutions \n- Managed internal team and external vendors, kept projects on schedule and within budget \n- Oversaw creative from inception to delivery, ensured content met brand strategy Senior Producer Jane Street Entertainment 2011  –  2013  (2 years) Greater New York City Area HGTV - \"Cousins Undercover\" (Home Makeover Series) \nFOOD NETWORK - “Sweet Genius\" (Food Competition Series) \nLIFETIME - \"24 Hour Catwalk\" (Design Competition Series) Senior Producer Jane Street Entertainment 2011  –  2013  (2 years) Greater New York City Area HGTV - \"Cousins Undercover\" (Home Makeover Series) \nFOOD NETWORK - “Sweet Genius\" (Food Competition Series) \nLIFETIME - \"24 Hour Catwalk\" (Design Competition Series) Senior Producer Notional August 2008  –  2012  (4 years) Greater New York City Area FOOD NETWORK - \"Chopped”\t(Food Competition Series, Seasons 1-10) \n \n- Produced first ten seasons of one of Food Network's highest rated series \n- Trained production teams on series’ format, established workflow systems for field and post teams \n- Supervised control room, field directed bio packages, oversaw interviews \n- Post produced episodes, tracked network milestones and revisions Senior Producer Notional August 2008  –  2012  (4 years) Greater New York City Area FOOD NETWORK - \"Chopped”\t(Food Competition Series, Seasons 1-10) \n \n- Produced first ten seasons of one of Food Network's highest rated series \n- Trained production teams on series’ format, established workflow systems for field and post teams \n- Supervised control room, field directed bio packages, oversaw interviews \n- Post produced episodes, tracked network milestones and revisions Story Producer Triage Entertainment 2011  –  2011  (less than a year) Greater New York City Area FOOD NETWORK - “All-Star Family Cook-off” (Food Competition Special) \n \n- Produced special in which Food Network stars work with family members to win money for charity \n- Pre-interviewed talent, directed cast on set, ran interviews, prepped story for post Story Producer Triage Entertainment 2011  –  2011  (less than a year) Greater New York City Area FOOD NETWORK - “All-Star Family Cook-off” (Food Competition Special) \n \n- Produced special in which Food Network stars work with family members to win money for charity \n- Pre-interviewed talent, directed cast on set, ran interviews, prepped story for post Story & Post Producer CBS Television Distribution May 2009  –  August 2009  (4 months) Greater New York City Area FOOD NETWORK-\t“24 Hour Restaurant Battle”\t(Food Competition Series) \n \n- Story and post produced a competition series in which teams open their own restaurants \n- Post produced episodes, assembled Avid stringouts for editors \n- Managed network revisions and deadlines on multiple edits simultaneously  Story & Post Producer CBS Television Distribution May 2009  –  August 2009  (4 months) Greater New York City Area FOOD NETWORK-\t“24 Hour Restaurant Battle”\t(Food Competition Series) \n \n- Story and post produced a competition series in which teams open their own restaurants \n- Post produced episodes, assembled Avid stringouts for editors \n- Managed network revisions and deadlines on multiple edits simultaneously  Producer / Shooter MTV September 2007  –  July 2009  (1 year 11 months) Greater New York City Area MTV - \"16 and Pregnant\" (Doc Series) \nMTV - \"True Life: I Have a Husband in Iraq” (Doc Series) \n \n- Directed talent, created daily story beats and shot lists \n- Tracked story in the field, generated summaries for post Producer / Shooter MTV September 2007  –  July 2009  (1 year 11 months) Greater New York City Area MTV - \"16 and Pregnant\" (Doc Series) \nMTV - \"True Life: I Have a Husband in Iraq” (Doc Series) \n \n- Directed talent, created daily story beats and shot lists \n- Tracked story in the field, generated summaries for post Field Producer Overture Films / Michael Moore January 2009  –  May 2009  (5 months) “Capitalism: A Love Story” (Doc Feature) \n \n- Researched, coordinated, and directed segments for a film covering the world financial crisis \n- Located, followed and interviewed families dealing with foreclosures and living on the streets Field Producer Overture Films / Michael Moore January 2009  –  May 2009  (5 months) “Capitalism: A Love Story” (Doc Feature) \n \n- Researched, coordinated, and directed segments for a film covering the world financial crisis \n- Located, followed and interviewed families dealing with foreclosures and living on the streets Producer / Shooter MSNBC May 2008  –  December 2008  (8 months) Greater New York City Area MSNBC - “Runaways: Austin” (Documentary Series) \nMSNBC - \"Runaways: San Diego\" (Documentary Series) \n \n- Filmed and followed the lives of runaway teens dealing with housing and drug problems \n- Researched shelters, found contributors, tracked story arcs, prepped outlines for post Producer / Shooter MSNBC May 2008  –  December 2008  (8 months) Greater New York City Area MSNBC - “Runaways: Austin” (Documentary Series) \nMSNBC - \"Runaways: San Diego\" (Documentary Series) \n \n- Filmed and followed the lives of runaway teens dealing with housing and drug problems \n- Researched shelters, found contributors, tracked story arcs, prepped outlines for post Producer / Shooter Gigantic Pictures April 2008  –  May 2008  (2 months) Greater New York City Area MTV\t-\t“Camp’d Out”\t(Reality Series) \n \n-Field produced, filmed, and tracked the stories of three kids at a summer snowboard camp striving to meet their personal athletic goals Producer / Shooter Gigantic Pictures April 2008  –  May 2008  (2 months) Greater New York City Area MTV\t-\t“Camp’d Out”\t(Reality Series) \n \n-Field produced, filmed, and tracked the stories of three kids at a summer snowboard camp striving to meet their personal athletic goals Producer / Shooter Left Right March 2008  –  April 2008  (2 months) Greater New York City Area MTV\t-\t“True Life: Another Life on the Web” (Doc Series) \nMTV - \"True Life: I Need A Transplant\" (Doc Series) \n \n- Field produced the story of a teenage girl with a secret online identity, and a young man battling cancer. Operated as a one-woman band, shooting, directing, producing and running audio. \n Producer / Shooter Left Right March 2008  –  April 2008  (2 months) Greater New York City Area MTV\t-\t“True Life: Another Life on the Web” (Doc Series) \nMTV - \"True Life: I Need A Transplant\" (Doc Series) \n \n- Field produced the story of a teenage girl with a secret online identity, and a young man battling cancer. Operated as a one-woman band, shooting, directing, producing and running audio. \n Producer / Shooter Four Seasons International February 2008  –  March 2008  (2 months) Greater New York City Area A&E\t-\t“Psychic Kids”\t(Series) \n \n- Filmed and interviewed kids coping with their psychic abilities \n- Shot / directed / field produced segments Producer / Shooter Four Seasons International February 2008  –  March 2008  (2 months) Greater New York City Area A&E\t-\t“Psychic Kids”\t(Series) \n \n- Filmed and interviewed kids coping with their psychic abilities \n- Shot / directed / field produced segments Field Producer The Idea Factory December 2007  –  February 2008  (3 months) Greater Los Angeles Area TLC - \"Big Medicine\" (Reality Series) \n \n- Field directed the journey of an overweight patient going through weight-loss surgery \n- Tracked episode narrative, generated story beats, prepped episode for post Field Producer The Idea Factory December 2007  –  February 2008  (3 months) Greater Los Angeles Area TLC - \"Big Medicine\" (Reality Series) \n \n- Field directed the journey of an overweight patient going through weight-loss surgery \n- Tracked episode narrative, generated story beats, prepped episode for post Field Producer CBS September 2007  –  November 2007  (3 months) Greater Los Angeles Area CBS \"Do You Trust Me\" (Game show) Field Producer CBS September 2007  –  November 2007  (3 months) Greater Los Angeles Area CBS \"Do You Trust Me\" (Game show) Story & Post Producer Concentric Entertainment June 2007  –  September 2007  (4 months) Greater New York City Area FINE LIVING - \"Home 2nd Home\" (Home Renovation Series) \n \n- Produced, wrote, and post produced a show about the challenges of buying a second home \n Story & Post Producer Concentric Entertainment June 2007  –  September 2007  (4 months) Greater New York City Area FINE LIVING - \"Home 2nd Home\" (Home Renovation Series) \n \n- Produced, wrote, and post produced a show about the challenges of buying a second home \n Story & Post Producer Engel Entertainment August 2006  –  May 2007  (10 months) Greater New York City Area DISCOVERY HEALTH - \"Runway Moms\" (Reality Series) \n \n- Story and post produced a series about the health concerns of pregnant models living in NYC Story & Post Producer Engel Entertainment August 2006  –  May 2007  (10 months) Greater New York City Area DISCOVERY HEALTH - \"Runway Moms\" (Reality Series) \n \n- Story and post produced a series about the health concerns of pregnant models living in NYC Producer / Writer Dan Sexton Media March 2006  –  August 2006  (6 months) San Francisco Bay Area FINE LIVING \"Windshield America\" \n \n- Field produced and wrote a host driven series about individuals who are helping their local communities Producer / Writer Dan Sexton Media March 2006  –  August 2006  (6 months) San Francisco Bay Area FINE LIVING \"Windshield America\" \n \n- Field produced and wrote a host driven series about individuals who are helping their local communities Producer / Writer Indigo Films October 2005  –  February 2006  (5 months) San Francisco Bay Area WEATHER CHANNEL- “Full Force Nature” \n \n- Wrote and field produced a half-hour series about the effects of devastating weather \n- Operated as a one-woman band, shooting, directing, producing and running audio \n Producer / Writer Indigo Films October 2005  –  February 2006  (5 months) San Francisco Bay Area WEATHER CHANNEL- “Full Force Nature” \n \n- Wrote and field produced a half-hour series about the effects of devastating weather \n- Operated as a one-woman band, shooting, directing, producing and running audio \n Senior Producer Indigo Films May 2005  –  October 2005  (6 months) San Francisco Bay Area HISTORY CHANNEL - \"USS Constellation: The Battle for Freedom\" (Doc Special) \n \n- Produced an overseas reenactment-driven documentary about the 1850’s transatlantic slave trade \n- Hired talent and crew, negotiated rates and contracts, managed budgets and schedules \n- Generated script breakdowns and shot lists, directed second unit Senior Producer Indigo Films May 2005  –  October 2005  (6 months) San Francisco Bay Area HISTORY CHANNEL - \"USS Constellation: The Battle for Freedom\" (Doc Special) \n \n- Produced an overseas reenactment-driven documentary about the 1850’s transatlantic slave trade \n- Hired talent and crew, negotiated rates and contracts, managed budgets and schedules \n- Generated script breakdowns and shot lists, directed second unit Producer Michael Hoff Productions February 2005  –  May 2005  (4 months) San Francisco Bay Area DISCOVERY - “Best Ranger Competition”  \nDISCOVERY - \"Motorcycle Lightning\" \nDISCOVERY - \"Wired Next Fest\" \n \n- Produced, field directed and shot 2nd camera for Discovery specials featuring Army Rangers and motorcycle enthusiasts Producer Michael Hoff Productions February 2005  –  May 2005  (4 months) San Francisco Bay Area DISCOVERY - “Best Ranger Competition”  \nDISCOVERY - \"Motorcycle Lightning\" \nDISCOVERY - \"Wired Next Fest\" \n \n- Produced, field directed and shot 2nd camera for Discovery specials featuring Army Rangers and motorcycle enthusiasts Supervising Producer Michael Hoff Productions February 2003  –  January 2005  (2 years) San Francisco Bay Area TruTV- \"I,Detective\" (True Crime Series) \n \n- Supervised four seasons of a true crime series about homicide detectives \n- Liaison between network and production company on all creative, logistic, and editorial issues \n- Directed 52 recreations, created script breakdowns, oversaw casting and art departments \n- Vetted pitches, scripts and cuts, managed network milestones, revisions and deliverables Supervising Producer Michael Hoff Productions February 2003  –  January 2005  (2 years) San Francisco Bay Area TruTV- \"I,Detective\" (True Crime Series) \n \n- Supervised four seasons of a true crime series about homicide detectives \n- Liaison between network and production company on all creative, logistic, and editorial issues \n- Directed 52 recreations, created script breakdowns, oversaw casting and art departments \n- Vetted pitches, scripts and cuts, managed network milestones, revisions and deliverables Languages English Spanish English Spanish English Spanish Skills Post Production Reality Video Production Documentaries Television Reality TV Producing Editing Camera Operating Avid Storytelling Final Cut Pro New Media Avid Media Composer Management Film Production Video See 2+     See less Skills  Post Production Reality Video Production Documentaries Television Reality TV Producing Editing Camera Operating Avid Storytelling Final Cut Pro New Media Avid Media Composer Management Film Production Video See 2+     See less Post Production Reality Video Production Documentaries Television Reality TV Producing Editing Camera Operating Avid Storytelling Final Cut Pro New Media Avid Media Composer Management Film Production Video See 2+     See less Post Production Reality Video Production Documentaries Television Reality TV Producing Editing Camera Operating Avid Storytelling Final Cut Pro New Media Avid Media Composer Management Film Production Video See 2+     See less Education University of California, Davis BS,  Design Activities and Societies:  Phi Kappa Phi ,  Photography Department Asst. ,  Cultural Studies Coordinator Universitat de Barcelona Design University of California, Davis BS,  Design Activities and Societies:  Phi Kappa Phi ,  Photography Department Asst. ,  Cultural Studies Coordinator University of California, Davis BS,  Design Activities and Societies:  Phi Kappa Phi ,  Photography Department Asst. ,  Cultural Studies Coordinator University of California, Davis BS,  Design Activities and Societies:  Phi Kappa Phi ,  Photography Department Asst. ,  Cultural Studies Coordinator Universitat de Barcelona Design Universitat de Barcelona Design Universitat de Barcelona Design ", "Experience Digital Producer msnbc, \"Morning Joe\" March 2015  – Present (6 months) Producer msnbc, \"Morning Joe\" March 2014  –  March 2015  (1 year 1 month) Segment Producer msnbc, \"Morning Joe\" October 2009  –  March 2014  (4 years 6 months) \"Morning Joe\" Associate Producer msnbc, \"Morning Joe\" October 2007  –  October 2009  (2 years 1 month) Freelance Writer NY1 News 2007  –  2007  (less than a year) Video Producer msnbc, \"Early Today\" 2005  –  2007  (2 years) Production Assistant msnbc 2004  –  2005  (1 year) Digital Producer msnbc, \"Morning Joe\" March 2015  – Present (6 months) Digital Producer msnbc, \"Morning Joe\" March 2015  – Present (6 months) Producer msnbc, \"Morning Joe\" March 2014  –  March 2015  (1 year 1 month) Producer msnbc, \"Morning Joe\" March 2014  –  March 2015  (1 year 1 month) Segment Producer msnbc, \"Morning Joe\" October 2009  –  March 2014  (4 years 6 months) \"Morning Joe\" Segment Producer msnbc, \"Morning Joe\" October 2009  –  March 2014  (4 years 6 months) \"Morning Joe\" Associate Producer msnbc, \"Morning Joe\" October 2007  –  October 2009  (2 years 1 month) Associate Producer msnbc, \"Morning Joe\" October 2007  –  October 2009  (2 years 1 month) Freelance Writer NY1 News 2007  –  2007  (less than a year) Freelance Writer NY1 News 2007  –  2007  (less than a year) Video Producer msnbc, \"Early Today\" 2005  –  2007  (2 years) Video Producer msnbc, \"Early Today\" 2005  –  2007  (2 years) Production Assistant msnbc 2004  –  2005  (1 year) Production Assistant msnbc 2004  –  2005  (1 year) Skills Field Producing Avid Editing Television Blogging Broadcast Journalism Storytelling Broadcast Breaking News New Media Video Production Journalism Field Production Skills  Field Producing Avid Editing Television Blogging Broadcast Journalism Storytelling Broadcast Breaking News New Media Video Production Journalism Field Production Field Producing Avid Editing Television Blogging Broadcast Journalism Storytelling Broadcast Breaking News New Media Video Production Journalism Field Production Field Producing Avid Editing Television Blogging Broadcast Journalism Storytelling Broadcast Breaking News New Media Video Production Journalism Field Production Education Columbia University - School of International and Public Affairs MPA,  Advanced Management and Finance University of Pennsylvania Bachelor of Arts (B.A.),  Communication and Media Studies Columbia University - School of International and Public Affairs MPA,  Advanced Management and Finance Columbia University - School of International and Public Affairs MPA,  Advanced Management and Finance Columbia University - School of International and Public Affairs MPA,  Advanced Management and Finance University of Pennsylvania Bachelor of Arts (B.A.),  Communication and Media Studies University of Pennsylvania Bachelor of Arts (B.A.),  Communication and Media Studies University of Pennsylvania Bachelor of Arts (B.A.),  Communication and Media Studies Honors & Awards 2013 Emmy Award Nomination, Outstanding News Discussion and Analysis: Newtown Tragedy Additional Honors & Awards 2008 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts \n \n2011 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts 2013 Emmy Award Nomination, Outstanding News Discussion and Analysis: Newtown Tragedy 2013 Emmy Award Nomination, Outstanding News Discussion and Analysis: Newtown Tragedy 2013 Emmy Award Nomination, Outstanding News Discussion and Analysis: Newtown Tragedy Additional Honors & Awards 2008 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts \n \n2011 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts Additional Honors & Awards 2008 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts \n \n2011 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts Additional Honors & Awards 2008 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts \n \n2011 NBC Universal Ovation Award Recipient: “Above and Beyond” efforts "]}