{"position": "Software QA Engineering Manager", "company": "Google", "profiles": ["Skills Skills     Education Stanford University Entrepreneurship and Project Management , A 2011  – 2012 - Focuses on understanding how to bring your business idea to life with a compelling business plan.  \n \n- Create and present an “elevator pitch”.  \n \n- How to assess customer needs.  \n \n- Implement creativity and insight more than ever.  \n \n- Comprehend discipline of design which unlock and shape that creative energy to make the services and products people will pay for.  \n \n- Apply design thinking to creating a product the market wants and needs.  \n \n- How to better navigate the idea-to-income path by  \n1) recognizing innovative opportunities. \n2) transforming their ideas into true innovations.  \n \n- Learn to “think patiently” to allow the best solutions to percolate to the top of our imagination.  \n \n- Explore projects that were “out of money and out of time” but were nonetheless rescued as a breakthrough solution was realized.  San Jose State University MS,  Software Engineering 2006  – 2008 University of Mumbai B.E,  Information Technology 2001  – 2005 Stanford University Entrepreneurship and Project Management , A 2011  – 2012 - Focuses on understanding how to bring your business idea to life with a compelling business plan.  \n \n- Create and present an “elevator pitch”.  \n \n- How to assess customer needs.  \n \n- Implement creativity and insight more than ever.  \n \n- Comprehend discipline of design which unlock and shape that creative energy to make the services and products people will pay for.  \n \n- Apply design thinking to creating a product the market wants and needs.  \n \n- How to better navigate the idea-to-income path by  \n1) recognizing innovative opportunities. \n2) transforming their ideas into true innovations.  \n \n- Learn to “think patiently” to allow the best solutions to percolate to the top of our imagination.  \n \n- Explore projects that were “out of money and out of time” but were nonetheless rescued as a breakthrough solution was realized.  Stanford University Entrepreneurship and Project Management , A 2011  – 2012 - Focuses on understanding how to bring your business idea to life with a compelling business plan.  \n \n- Create and present an “elevator pitch”.  \n \n- How to assess customer needs.  \n \n- Implement creativity and insight more than ever.  \n \n- Comprehend discipline of design which unlock and shape that creative energy to make the services and products people will pay for.  \n \n- Apply design thinking to creating a product the market wants and needs.  \n \n- How to better navigate the idea-to-income path by  \n1) recognizing innovative opportunities. \n2) transforming their ideas into true innovations.  \n \n- Learn to “think patiently” to allow the best solutions to percolate to the top of our imagination.  \n \n- Explore projects that were “out of money and out of time” but were nonetheless rescued as a breakthrough solution was realized.  Stanford University Entrepreneurship and Project Management , A 2011  – 2012 - Focuses on understanding how to bring your business idea to life with a compelling business plan.  \n \n- Create and present an “elevator pitch”.  \n \n- How to assess customer needs.  \n \n- Implement creativity and insight more than ever.  \n \n- Comprehend discipline of design which unlock and shape that creative energy to make the services and products people will pay for.  \n \n- Apply design thinking to creating a product the market wants and needs.  \n \n- How to better navigate the idea-to-income path by  \n1) recognizing innovative opportunities. \n2) transforming their ideas into true innovations.  \n \n- Learn to “think patiently” to allow the best solutions to percolate to the top of our imagination.  \n \n- Explore projects that were “out of money and out of time” but were nonetheless rescued as a breakthrough solution was realized.  San Jose State University MS,  Software Engineering 2006  – 2008 San Jose State University MS,  Software Engineering 2006  – 2008 San Jose State University MS,  Software Engineering 2006  – 2008 University of Mumbai B.E,  Information Technology 2001  – 2005 University of Mumbai B.E,  Information Technology 2001  – 2005 University of Mumbai B.E,  Information Technology 2001  – 2005 Honors & Awards ", "Summary I have over 27 years of experience in Quality Assurance ranging from larger companies to startups. I have managed UAT teams of up to 80 people. QA groups up to 12 and offshore teams located in India of up to 15. I understand how to manage offshore teams and how to deal with the risks and potential hurdles. \nIn my experience I have built 3 QA departments from the ground up at various startups by bringing in structure into a chaos environment. This included helping develop functional specs, BRD and test plans and test cases. Introducing new tools like bug tracking systems , automation tools and virtual OS like VM ware.  \nI have developed test plans for many shrink wrap, hardware and web based applications. This also includes social media apps and ecommerce. Used various tools like Quality Center to develop, log and track test cases through many test cycles. I have a understanding of Waterfall Test Cycles and experience with Agile & Extreme programming as it relates to the SDLC. \nIf you have any questions feel free to contact me at your leisure. \n \n \nSpecialties: Software QA Summary I have over 27 years of experience in Quality Assurance ranging from larger companies to startups. I have managed UAT teams of up to 80 people. QA groups up to 12 and offshore teams located in India of up to 15. I understand how to manage offshore teams and how to deal with the risks and potential hurdles. \nIn my experience I have built 3 QA departments from the ground up at various startups by bringing in structure into a chaos environment. This included helping develop functional specs, BRD and test plans and test cases. Introducing new tools like bug tracking systems , automation tools and virtual OS like VM ware.  \nI have developed test plans for many shrink wrap, hardware and web based applications. This also includes social media apps and ecommerce. Used various tools like Quality Center to develop, log and track test cases through many test cycles. I have a understanding of Waterfall Test Cycles and experience with Agile & Extreme programming as it relates to the SDLC. \nIf you have any questions feel free to contact me at your leisure. \n \n \nSpecialties: Software QA I have over 27 years of experience in Quality Assurance ranging from larger companies to startups. I have managed UAT teams of up to 80 people. QA groups up to 12 and offshore teams located in India of up to 15. I understand how to manage offshore teams and how to deal with the risks and potential hurdles. \nIn my experience I have built 3 QA departments from the ground up at various startups by bringing in structure into a chaos environment. This included helping develop functional specs, BRD and test plans and test cases. Introducing new tools like bug tracking systems , automation tools and virtual OS like VM ware.  \nI have developed test plans for many shrink wrap, hardware and web based applications. This also includes social media apps and ecommerce. Used various tools like Quality Center to develop, log and track test cases through many test cycles. I have a understanding of Waterfall Test Cycles and experience with Agile & Extreme programming as it relates to the SDLC. \nIf you have any questions feel free to contact me at your leisure. \n \n \nSpecialties: Software QA I have over 27 years of experience in Quality Assurance ranging from larger companies to startups. I have managed UAT teams of up to 80 people. QA groups up to 12 and offshore teams located in India of up to 15. I understand how to manage offshore teams and how to deal with the risks and potential hurdles. \nIn my experience I have built 3 QA departments from the ground up at various startups by bringing in structure into a chaos environment. This included helping develop functional specs, BRD and test plans and test cases. Introducing new tools like bug tracking systems , automation tools and virtual OS like VM ware.  \nI have developed test plans for many shrink wrap, hardware and web based applications. This also includes social media apps and ecommerce. Used various tools like Quality Center to develop, log and track test cases through many test cycles. I have a understanding of Waterfall Test Cycles and experience with Agile & Extreme programming as it relates to the SDLC. \nIf you have any questions feel free to contact me at your leisure. \n \n \nSpecialties: Software QA Experience IT Manager Chavez Institute For Law and Social Justice (Non-Profit) September 2014  – Present (1 year) San Francisco Bay Area Managed overall IT for all the Attorneys \n \n\tSupported IT deliverables for all Attorneys at the Chavez Institute which includes server, client configuration. \n\tSetup and configured Skype centers for attorneys to contact clients remotely \n\tSupported all Chavez Institute attorneys across the US with all IT related issues, questions and deliverables \n\tResponsible for website development and social media interaction. \n \n Moderator Jimsjobs.com July 2002  – Present (13 years 2 months) JimsJobs isn't just about job posts. This site allows users and recruiters to post jobs, share ideas/leads and upload resumes into the jimsjobs' database. We consider this a community. I volunteer my time to help others in need of employment and I help the community network. QA Team Lead FPL - Accenture March 2014  –  September 2014  (7 months) Miami/Fort Lauderdale Area \tDefine QA Agile Strategy and milestones and collect participant information. \n\tTrack progress of QA deliverables, execution progress, and defects against release timeline. \n\tDefine QA engagement model across participating Lead PMs, Developers and Tracks. \n\tPrepare materials for and lead QA status meetings. \n\tFacilitate meetings with Lead Business Analysts to ensure requirements are captured correctly. \n\tFacilitate training sessions to ensure all testers are prepared for sprint execution. \n\tEnsure all QA Testers have necessary access and tools available in stage Qa Lead Cisco - Accenture September 2013  –  March 2014  (7 months) San Jose, Ca \tDefine BAT (business acceptance testing) milestones and collect participant information. \n\tTrack progress of BAT deliverables, execution progress, and defects against release timeline. \n\tDefine BAT engagement model across participating Lead PMs, tracks, and audiences. \n\tPrepare materials for and lead BAT kickoff meetings. \n\tEngage with Lead PMs and business/stakeholders to consolidate BAT scenarios, data setup requests, and order creation requirements. \n\tFacilitate meetings with Lead PMs and data setup/order creation teams to ensure requirements are captured correctly. \n\tFacilitate training sessions to ensure all BAT testers are prepared for execution. \n\tEnsure all BAT users have necessary access and tools available in stage QA Lead Pacific Gas and Electric Company January 2012  –  June 2013  (1 year 6 months) San Francisco Bay Area \tManaged the development of Application Validation test plan and test cases while also completing hands-on testing at the functionality level. \n\tManaged and Executed Testing through the Application Validation lifecycle. \n\tPartnered with Architecture Team, PG&E Business teams to identify issues and concerns of the application validation lifecycle as part of the methodical approach to correcting any bug fixes. \n\tManaged User Acceptance Testing and Pre-Testing off all Business Applications to meet Windows 7 Compatibility Standards. QA Lead Levi Strauss & Co. April 2011  –  September 2011  (6 months) \tManaged the development of Functional test plan and test cases for various Levi Strauss web projects, while also completing hands-on testing at the functionality level. \n\tManaged and mentored group of 2 QA Testers through the QA Agile lifecycle. \n\tPartnered with Marketing Team, Business teams to identify issues and concerns of the Agile validation lifecycle as part of the methodical approach to correcting any bug fixes or discussing change requests. \n\tParticipated Architectural and Status meetings with the Architecture and Project Management teams to identify the overall strategy of testing for feature changes and new functionality. QA Coordinator Yahoo! July 2010  –  April 2011  (10 months) \tManaged the development of Application Validation test plan and test cases while also completing hands-on testing at the functionality level. \n\tManaged and mentored group of 5 QA Testers through the Application Validation lifecycle. \n\tPartnered with Architecture Team, International Business teams to identify issues and concerns of the application validation lifecycle as part of the methodical approach to correcting any bug fixes. \n\tParticipated Architectural and Status meetings with the Architecture and Project Management teams to identify the overall strategy of testing for feature changes and new functionality. QA Lead Nielsen Media Research January 2010  –  July 2010  (7 months) \tManaged the development of .NET Nielsen UKOM application test plan and test cases while also completing hands-on testing at the functionality level. \n\tPartnered with Development Team, Offshore QA and UAT Team to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tParticipated in UI and Functionality meetings with the Development team to identify the overall strategy of testing for feature changes and new functionality. \n\tWorked with Business Units responsible for proof of concept and development of Business Requirements and Software Requirement Specifications. QA Consultant Wells Fargo June 2008  –  December 2008  (7 months) \tManaged the development of UAT Test Cases, while also having responsibility for the authentication, risk, functionality, and hands-on testing of the product at a business UAT level. \n\tPartnered with Development Team and Business Users to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tWorked with Business Units responsible for proof of concept and development of Business Requirements and Software Requirement Specifications. QA Contractor Omneon Video Networks March 2008  –  June 2008  (4 months) \tManaged the development of test plan and test cases while also completing hands-on testing at the functionality level. \n\tPartnered with Development Team and Business Users to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tParticipated in UI and Functionality meetings with the Development and Business teams to identify the overall strategy of testing for feature changes and new functionality. QA Lead Electronic Arts October 2007  –  February 2008  (5 months) QA Test Lead for the WBTS build management system. \n \nThe Environment consists of XML, Java Script, C++ \n \n•\tResponsible for development of test plan and test cases for the UAT test cycle of WBTS. \n•\tManaged and Supported Mastering Labs through the whole UAT testing cycle. \n•\tWorked closely with WBTS Development team and Business team to respond to issues and concerns \n•\tAttended UI and Functionality meetings with the WBTS Development and Business teams to help in the overall strategy of testing for functionality changes and new functionality. \n•\tCompleted hands-on testing of WBTS functionality level. QA Consultant Adobe March 2007  –  October 2007  (8 months) QA Consultant for Web Content. The project consisted of the development of a developer’s community. \n \nThe Environment consists of XML, Java Script, Flash \n \n•\tResponsible for development of test plan and test cases for the overall developer’s community \n•\tWorked closely with Web Development team and Business team to respond to issues and concerns \n•\tAttended UI and Functionality meetings with the Development and Business teams to help in the overall strategy of testing for specific content changes and new functionality. \n•\tCompleted hands-on testing of developer’s community from a content look and feel level and functionality level. \n \nTools & Environments: Windows OS, Macintosh OS QA Lead AOL October 2006  –  March 2007  (6 months) QA Functional Lead for AOL Uncutvideo. A website that allows you to view videos from amateurs or professionals from all over the world. You have the ability to upload and share your videos, add comments, ratings to videos of others.  \n \nThe Environment consists of XML, Linux, Apache Web Server, Apache Tomcat App Server, Sybase database. \n \n•\tResponsible for leading the functional front end of the Uncutvideo Project \n•\tDeveloped Test Strategies and Cases for the functional area for each testing cycle. \n•\tHelped manage offshore team of feature review and assignment of work.  \n•\tMentored and Reviewed test cases and strategy with offshore team. \n•\tWorked closely with Dev team to respond to review and respond to issues \n•\tAttended UI meeting with project teams to help in the overall testing strategy of the specific functionality (IE. New features, Feature Changes). \n•\tHands-on on testing of Uncut Video for functional front end with some testing in backend. QA Lead Adobe April 2006  –  September 2006  (6 months) QA Project Manager for CALM (Licensing Management). The Customer Administration and License Management project purpose is to clean up duplicate data in the Licensing Website and , at the application level, allow internal Adobe and external customers to self clean or merge their own data. As well as to mitigate future account/profile creation if an account/profile exists. \n \n \nThe environment consists of J2ee, SAP \n \n \n•\tResponsible for the overall Quality Assurance process of the CALM application. \n•\tImplemented project planning, Technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Adobe.  \n•\tDeveloped test plans and test cases for the testing cycle for the CALM project \n•\tManaged testing teams for User Acceptance Testing for various Adobe locations \n•\tAssisted in project management detail of the overall project QA Project Lead Riverdeep July 2005  –  March 2006  (9 months) The environment consists of J2ee, Tomcat, and Apache, Browser Based (IE 6.x, Firefox) \n \n•\tResponsible for the overall Quality Assurance process of the Learning Management System application. \n•\tImplemented project planning, Technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Riverdeep.  \n•\tMeasured and evaluated costs within the organization by identifying the relationships between the inputs to the processes and the output from the processes, which allowed me to meet schedules for the Learning Management System project. \n•\tGathered requirements from internal clients and developed a business case document that was used in analysis of prototype.  \n \n•\tManaged 9 offshore QA Engineers in India. \n•\tAssisted in project management detail of the overall project. QA Project Lead Charles Schwab - Contract 2004  –  2005  (1 year) Testing Manager for Charles Schwab’s Fixed Income Trading Platform – SBS (Schwab Bond Source). SBS is a high profile and key-trading platform for Schwab, which supports FI Traders, Retail Representatives and trading on Schwab.com and Schwab Institutional.  \nThe environment consists of J2ee, Websphere 8.1, and HTML.  \n•\tResponsible for the overall Quality Assurance process of the Web Channel application. \n•\tImplemented project planning, technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Schwab.  \n•\tDeveloped Master Test Execution and Test Use Cases for Web Channel Application. \n•\tDeveloped objectives for UAT phase and performance testing phase. \n•\tGathered requirements from internal clients and developed a business case document that was used in analysis of prototype.  \n•\tManaged 6 offshore QA Engineers in India and 3 onshore engineers. \n•\tAssisted in project management detail of the overall project. QA Lead I-S-Cubed February 2004  –  December 2004  (11 months) I-S-Cubed developed SecureOMS which is the first comprehensive cryptographic key management solution for network-connected devices in the global financial services, retail and enterprise markets. Delivered as a fully configured system comprising I-S-Cubed proprietary software running on a fortified clustering platform, the patent-pending SecureOMS technology ensures both high availability and the capacity to scale as needed. This enterprise-class key management solution includes an SQL database for maximum performance and interoperates with industry leading hardware security modules and host management software. SecureOMS has been tested and accepted by world-renowned strategic partners for global usage. I was directly responsible for the QA activities of the team, coordinating the efforts of resources and working with external clients. QA SmokeClinic 2001  –  2003  (2 years) \tDeveloped methodology for testing corporate website, assisted in HTML content development, provide support (customer/tech) to end-users, implemented testing of workflow and implemented content management changes to site enhancement. QA Director Improvenet 2000  –  2001  (1 year) \tManaged and Mentored 3 QA engineers through the QA lifecycle while supporting 14 developers within my organization. \n\tManaged QA for corporate websites, developed test plans and testing methodology for the e-commerce website. \n\tDeveloped and managed QA department annual budget of 150k. QA Manager Getmedia 2000  –  2000  (less than a year) \tManaged and mentored 5 QA Engineers and 1 Build/Release Engineers while supporting 10 software developers and 5 project developers within my organization. \n\tDeveloped test plans and a testing methodology for testing service applications and participated in the development of an efficient build process of applications. \n\tEstablished and managed QA/Build department annual budget of 100k. QA Manager Bevocal 2000  –  2000  (less than a year) \tManaged and mentored 5 QA Engineers and 2 Build/Release Engineers while supporting 10 software developers and 5 project developers within my organization. \n\tDeveloped test plans and a testing methodology for testing service applications and participated in the development of an efficient build process of applications. \n\tEstablished and managed QA/Build department annual budget of 100k. QA Lead Rendition 1996  –  1999  (3 years) IT Manager Chavez Institute For Law and Social Justice (Non-Profit) September 2014  – Present (1 year) San Francisco Bay Area Managed overall IT for all the Attorneys \n \n\tSupported IT deliverables for all Attorneys at the Chavez Institute which includes server, client configuration. \n\tSetup and configured Skype centers for attorneys to contact clients remotely \n\tSupported all Chavez Institute attorneys across the US with all IT related issues, questions and deliverables \n\tResponsible for website development and social media interaction. \n \n IT Manager Chavez Institute For Law and Social Justice (Non-Profit) September 2014  – Present (1 year) San Francisco Bay Area Managed overall IT for all the Attorneys \n \n\tSupported IT deliverables for all Attorneys at the Chavez Institute which includes server, client configuration. \n\tSetup and configured Skype centers for attorneys to contact clients remotely \n\tSupported all Chavez Institute attorneys across the US with all IT related issues, questions and deliverables \n\tResponsible for website development and social media interaction. \n \n Moderator Jimsjobs.com July 2002  – Present (13 years 2 months) JimsJobs isn't just about job posts. This site allows users and recruiters to post jobs, share ideas/leads and upload resumes into the jimsjobs' database. We consider this a community. I volunteer my time to help others in need of employment and I help the community network. Moderator Jimsjobs.com July 2002  – Present (13 years 2 months) JimsJobs isn't just about job posts. This site allows users and recruiters to post jobs, share ideas/leads and upload resumes into the jimsjobs' database. We consider this a community. I volunteer my time to help others in need of employment and I help the community network. QA Team Lead FPL - Accenture March 2014  –  September 2014  (7 months) Miami/Fort Lauderdale Area \tDefine QA Agile Strategy and milestones and collect participant information. \n\tTrack progress of QA deliverables, execution progress, and defects against release timeline. \n\tDefine QA engagement model across participating Lead PMs, Developers and Tracks. \n\tPrepare materials for and lead QA status meetings. \n\tFacilitate meetings with Lead Business Analysts to ensure requirements are captured correctly. \n\tFacilitate training sessions to ensure all testers are prepared for sprint execution. \n\tEnsure all QA Testers have necessary access and tools available in stage QA Team Lead FPL - Accenture March 2014  –  September 2014  (7 months) Miami/Fort Lauderdale Area \tDefine QA Agile Strategy and milestones and collect participant information. \n\tTrack progress of QA deliverables, execution progress, and defects against release timeline. \n\tDefine QA engagement model across participating Lead PMs, Developers and Tracks. \n\tPrepare materials for and lead QA status meetings. \n\tFacilitate meetings with Lead Business Analysts to ensure requirements are captured correctly. \n\tFacilitate training sessions to ensure all testers are prepared for sprint execution. \n\tEnsure all QA Testers have necessary access and tools available in stage Qa Lead Cisco - Accenture September 2013  –  March 2014  (7 months) San Jose, Ca \tDefine BAT (business acceptance testing) milestones and collect participant information. \n\tTrack progress of BAT deliverables, execution progress, and defects against release timeline. \n\tDefine BAT engagement model across participating Lead PMs, tracks, and audiences. \n\tPrepare materials for and lead BAT kickoff meetings. \n\tEngage with Lead PMs and business/stakeholders to consolidate BAT scenarios, data setup requests, and order creation requirements. \n\tFacilitate meetings with Lead PMs and data setup/order creation teams to ensure requirements are captured correctly. \n\tFacilitate training sessions to ensure all BAT testers are prepared for execution. \n\tEnsure all BAT users have necessary access and tools available in stage Qa Lead Cisco - Accenture September 2013  –  March 2014  (7 months) San Jose, Ca \tDefine BAT (business acceptance testing) milestones and collect participant information. \n\tTrack progress of BAT deliverables, execution progress, and defects against release timeline. \n\tDefine BAT engagement model across participating Lead PMs, tracks, and audiences. \n\tPrepare materials for and lead BAT kickoff meetings. \n\tEngage with Lead PMs and business/stakeholders to consolidate BAT scenarios, data setup requests, and order creation requirements. \n\tFacilitate meetings with Lead PMs and data setup/order creation teams to ensure requirements are captured correctly. \n\tFacilitate training sessions to ensure all BAT testers are prepared for execution. \n\tEnsure all BAT users have necessary access and tools available in stage QA Lead Pacific Gas and Electric Company January 2012  –  June 2013  (1 year 6 months) San Francisco Bay Area \tManaged the development of Application Validation test plan and test cases while also completing hands-on testing at the functionality level. \n\tManaged and Executed Testing through the Application Validation lifecycle. \n\tPartnered with Architecture Team, PG&E Business teams to identify issues and concerns of the application validation lifecycle as part of the methodical approach to correcting any bug fixes. \n\tManaged User Acceptance Testing and Pre-Testing off all Business Applications to meet Windows 7 Compatibility Standards. QA Lead Pacific Gas and Electric Company January 2012  –  June 2013  (1 year 6 months) San Francisco Bay Area \tManaged the development of Application Validation test plan and test cases while also completing hands-on testing at the functionality level. \n\tManaged and Executed Testing through the Application Validation lifecycle. \n\tPartnered with Architecture Team, PG&E Business teams to identify issues and concerns of the application validation lifecycle as part of the methodical approach to correcting any bug fixes. \n\tManaged User Acceptance Testing and Pre-Testing off all Business Applications to meet Windows 7 Compatibility Standards. QA Lead Levi Strauss & Co. April 2011  –  September 2011  (6 months) \tManaged the development of Functional test plan and test cases for various Levi Strauss web projects, while also completing hands-on testing at the functionality level. \n\tManaged and mentored group of 2 QA Testers through the QA Agile lifecycle. \n\tPartnered with Marketing Team, Business teams to identify issues and concerns of the Agile validation lifecycle as part of the methodical approach to correcting any bug fixes or discussing change requests. \n\tParticipated Architectural and Status meetings with the Architecture and Project Management teams to identify the overall strategy of testing for feature changes and new functionality. QA Lead Levi Strauss & Co. April 2011  –  September 2011  (6 months) \tManaged the development of Functional test plan and test cases for various Levi Strauss web projects, while also completing hands-on testing at the functionality level. \n\tManaged and mentored group of 2 QA Testers through the QA Agile lifecycle. \n\tPartnered with Marketing Team, Business teams to identify issues and concerns of the Agile validation lifecycle as part of the methodical approach to correcting any bug fixes or discussing change requests. \n\tParticipated Architectural and Status meetings with the Architecture and Project Management teams to identify the overall strategy of testing for feature changes and new functionality. QA Coordinator Yahoo! July 2010  –  April 2011  (10 months) \tManaged the development of Application Validation test plan and test cases while also completing hands-on testing at the functionality level. \n\tManaged and mentored group of 5 QA Testers through the Application Validation lifecycle. \n\tPartnered with Architecture Team, International Business teams to identify issues and concerns of the application validation lifecycle as part of the methodical approach to correcting any bug fixes. \n\tParticipated Architectural and Status meetings with the Architecture and Project Management teams to identify the overall strategy of testing for feature changes and new functionality. QA Coordinator Yahoo! July 2010  –  April 2011  (10 months) \tManaged the development of Application Validation test plan and test cases while also completing hands-on testing at the functionality level. \n\tManaged and mentored group of 5 QA Testers through the Application Validation lifecycle. \n\tPartnered with Architecture Team, International Business teams to identify issues and concerns of the application validation lifecycle as part of the methodical approach to correcting any bug fixes. \n\tParticipated Architectural and Status meetings with the Architecture and Project Management teams to identify the overall strategy of testing for feature changes and new functionality. QA Lead Nielsen Media Research January 2010  –  July 2010  (7 months) \tManaged the development of .NET Nielsen UKOM application test plan and test cases while also completing hands-on testing at the functionality level. \n\tPartnered with Development Team, Offshore QA and UAT Team to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tParticipated in UI and Functionality meetings with the Development team to identify the overall strategy of testing for feature changes and new functionality. \n\tWorked with Business Units responsible for proof of concept and development of Business Requirements and Software Requirement Specifications. QA Lead Nielsen Media Research January 2010  –  July 2010  (7 months) \tManaged the development of .NET Nielsen UKOM application test plan and test cases while also completing hands-on testing at the functionality level. \n\tPartnered with Development Team, Offshore QA and UAT Team to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tParticipated in UI and Functionality meetings with the Development team to identify the overall strategy of testing for feature changes and new functionality. \n\tWorked with Business Units responsible for proof of concept and development of Business Requirements and Software Requirement Specifications. QA Consultant Wells Fargo June 2008  –  December 2008  (7 months) \tManaged the development of UAT Test Cases, while also having responsibility for the authentication, risk, functionality, and hands-on testing of the product at a business UAT level. \n\tPartnered with Development Team and Business Users to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tWorked with Business Units responsible for proof of concept and development of Business Requirements and Software Requirement Specifications. QA Consultant Wells Fargo June 2008  –  December 2008  (7 months) \tManaged the development of UAT Test Cases, while also having responsibility for the authentication, risk, functionality, and hands-on testing of the product at a business UAT level. \n\tPartnered with Development Team and Business Users to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tWorked with Business Units responsible for proof of concept and development of Business Requirements and Software Requirement Specifications. QA Contractor Omneon Video Networks March 2008  –  June 2008  (4 months) \tManaged the development of test plan and test cases while also completing hands-on testing at the functionality level. \n\tPartnered with Development Team and Business Users to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tParticipated in UI and Functionality meetings with the Development and Business teams to identify the overall strategy of testing for feature changes and new functionality. QA Contractor Omneon Video Networks March 2008  –  June 2008  (4 months) \tManaged the development of test plan and test cases while also completing hands-on testing at the functionality level. \n\tPartnered with Development Team and Business Users to identify issues and concerns of the product as part of the methodical approach to correcting any bug fixes. \n\tParticipated in UI and Functionality meetings with the Development and Business teams to identify the overall strategy of testing for feature changes and new functionality. QA Lead Electronic Arts October 2007  –  February 2008  (5 months) QA Test Lead for the WBTS build management system. \n \nThe Environment consists of XML, Java Script, C++ \n \n•\tResponsible for development of test plan and test cases for the UAT test cycle of WBTS. \n•\tManaged and Supported Mastering Labs through the whole UAT testing cycle. \n•\tWorked closely with WBTS Development team and Business team to respond to issues and concerns \n•\tAttended UI and Functionality meetings with the WBTS Development and Business teams to help in the overall strategy of testing for functionality changes and new functionality. \n•\tCompleted hands-on testing of WBTS functionality level. QA Lead Electronic Arts October 2007  –  February 2008  (5 months) QA Test Lead for the WBTS build management system. \n \nThe Environment consists of XML, Java Script, C++ \n \n•\tResponsible for development of test plan and test cases for the UAT test cycle of WBTS. \n•\tManaged and Supported Mastering Labs through the whole UAT testing cycle. \n•\tWorked closely with WBTS Development team and Business team to respond to issues and concerns \n•\tAttended UI and Functionality meetings with the WBTS Development and Business teams to help in the overall strategy of testing for functionality changes and new functionality. \n•\tCompleted hands-on testing of WBTS functionality level. QA Consultant Adobe March 2007  –  October 2007  (8 months) QA Consultant for Web Content. The project consisted of the development of a developer’s community. \n \nThe Environment consists of XML, Java Script, Flash \n \n•\tResponsible for development of test plan and test cases for the overall developer’s community \n•\tWorked closely with Web Development team and Business team to respond to issues and concerns \n•\tAttended UI and Functionality meetings with the Development and Business teams to help in the overall strategy of testing for specific content changes and new functionality. \n•\tCompleted hands-on testing of developer’s community from a content look and feel level and functionality level. \n \nTools & Environments: Windows OS, Macintosh OS QA Consultant Adobe March 2007  –  October 2007  (8 months) QA Consultant for Web Content. The project consisted of the development of a developer’s community. \n \nThe Environment consists of XML, Java Script, Flash \n \n•\tResponsible for development of test plan and test cases for the overall developer’s community \n•\tWorked closely with Web Development team and Business team to respond to issues and concerns \n•\tAttended UI and Functionality meetings with the Development and Business teams to help in the overall strategy of testing for specific content changes and new functionality. \n•\tCompleted hands-on testing of developer’s community from a content look and feel level and functionality level. \n \nTools & Environments: Windows OS, Macintosh OS QA Lead AOL October 2006  –  March 2007  (6 months) QA Functional Lead for AOL Uncutvideo. A website that allows you to view videos from amateurs or professionals from all over the world. You have the ability to upload and share your videos, add comments, ratings to videos of others.  \n \nThe Environment consists of XML, Linux, Apache Web Server, Apache Tomcat App Server, Sybase database. \n \n•\tResponsible for leading the functional front end of the Uncutvideo Project \n•\tDeveloped Test Strategies and Cases for the functional area for each testing cycle. \n•\tHelped manage offshore team of feature review and assignment of work.  \n•\tMentored and Reviewed test cases and strategy with offshore team. \n•\tWorked closely with Dev team to respond to review and respond to issues \n•\tAttended UI meeting with project teams to help in the overall testing strategy of the specific functionality (IE. New features, Feature Changes). \n•\tHands-on on testing of Uncut Video for functional front end with some testing in backend. QA Lead AOL October 2006  –  March 2007  (6 months) QA Functional Lead for AOL Uncutvideo. A website that allows you to view videos from amateurs or professionals from all over the world. You have the ability to upload and share your videos, add comments, ratings to videos of others.  \n \nThe Environment consists of XML, Linux, Apache Web Server, Apache Tomcat App Server, Sybase database. \n \n•\tResponsible for leading the functional front end of the Uncutvideo Project \n•\tDeveloped Test Strategies and Cases for the functional area for each testing cycle. \n•\tHelped manage offshore team of feature review and assignment of work.  \n•\tMentored and Reviewed test cases and strategy with offshore team. \n•\tWorked closely with Dev team to respond to review and respond to issues \n•\tAttended UI meeting with project teams to help in the overall testing strategy of the specific functionality (IE. New features, Feature Changes). \n•\tHands-on on testing of Uncut Video for functional front end with some testing in backend. QA Lead Adobe April 2006  –  September 2006  (6 months) QA Project Manager for CALM (Licensing Management). The Customer Administration and License Management project purpose is to clean up duplicate data in the Licensing Website and , at the application level, allow internal Adobe and external customers to self clean or merge their own data. As well as to mitigate future account/profile creation if an account/profile exists. \n \n \nThe environment consists of J2ee, SAP \n \n \n•\tResponsible for the overall Quality Assurance process of the CALM application. \n•\tImplemented project planning, Technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Adobe.  \n•\tDeveloped test plans and test cases for the testing cycle for the CALM project \n•\tManaged testing teams for User Acceptance Testing for various Adobe locations \n•\tAssisted in project management detail of the overall project QA Lead Adobe April 2006  –  September 2006  (6 months) QA Project Manager for CALM (Licensing Management). The Customer Administration and License Management project purpose is to clean up duplicate data in the Licensing Website and , at the application level, allow internal Adobe and external customers to self clean or merge their own data. As well as to mitigate future account/profile creation if an account/profile exists. \n \n \nThe environment consists of J2ee, SAP \n \n \n•\tResponsible for the overall Quality Assurance process of the CALM application. \n•\tImplemented project planning, Technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Adobe.  \n•\tDeveloped test plans and test cases for the testing cycle for the CALM project \n•\tManaged testing teams for User Acceptance Testing for various Adobe locations \n•\tAssisted in project management detail of the overall project QA Project Lead Riverdeep July 2005  –  March 2006  (9 months) The environment consists of J2ee, Tomcat, and Apache, Browser Based (IE 6.x, Firefox) \n \n•\tResponsible for the overall Quality Assurance process of the Learning Management System application. \n•\tImplemented project planning, Technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Riverdeep.  \n•\tMeasured and evaluated costs within the organization by identifying the relationships between the inputs to the processes and the output from the processes, which allowed me to meet schedules for the Learning Management System project. \n•\tGathered requirements from internal clients and developed a business case document that was used in analysis of prototype.  \n \n•\tManaged 9 offshore QA Engineers in India. \n•\tAssisted in project management detail of the overall project. QA Project Lead Riverdeep July 2005  –  March 2006  (9 months) The environment consists of J2ee, Tomcat, and Apache, Browser Based (IE 6.x, Firefox) \n \n•\tResponsible for the overall Quality Assurance process of the Learning Management System application. \n•\tImplemented project planning, Technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Riverdeep.  \n•\tMeasured and evaluated costs within the organization by identifying the relationships between the inputs to the processes and the output from the processes, which allowed me to meet schedules for the Learning Management System project. \n•\tGathered requirements from internal clients and developed a business case document that was used in analysis of prototype.  \n \n•\tManaged 9 offshore QA Engineers in India. \n•\tAssisted in project management detail of the overall project. QA Project Lead Charles Schwab - Contract 2004  –  2005  (1 year) Testing Manager for Charles Schwab’s Fixed Income Trading Platform – SBS (Schwab Bond Source). SBS is a high profile and key-trading platform for Schwab, which supports FI Traders, Retail Representatives and trading on Schwab.com and Schwab Institutional.  \nThe environment consists of J2ee, Websphere 8.1, and HTML.  \n•\tResponsible for the overall Quality Assurance process of the Web Channel application. \n•\tImplemented project planning, technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Schwab.  \n•\tDeveloped Master Test Execution and Test Use Cases for Web Channel Application. \n•\tDeveloped objectives for UAT phase and performance testing phase. \n•\tGathered requirements from internal clients and developed a business case document that was used in analysis of prototype.  \n•\tManaged 6 offshore QA Engineers in India and 3 onshore engineers. \n•\tAssisted in project management detail of the overall project. QA Project Lead Charles Schwab - Contract 2004  –  2005  (1 year) Testing Manager for Charles Schwab’s Fixed Income Trading Platform – SBS (Schwab Bond Source). SBS is a high profile and key-trading platform for Schwab, which supports FI Traders, Retail Representatives and trading on Schwab.com and Schwab Institutional.  \nThe environment consists of J2ee, Websphere 8.1, and HTML.  \n•\tResponsible for the overall Quality Assurance process of the Web Channel application. \n•\tImplemented project planning, technical Standards and guidelines for Software Development Lifecycle. This allowed me to meet quality standards for Schwab.  \n•\tDeveloped Master Test Execution and Test Use Cases for Web Channel Application. \n•\tDeveloped objectives for UAT phase and performance testing phase. \n•\tGathered requirements from internal clients and developed a business case document that was used in analysis of prototype.  \n•\tManaged 6 offshore QA Engineers in India and 3 onshore engineers. \n•\tAssisted in project management detail of the overall project. QA Lead I-S-Cubed February 2004  –  December 2004  (11 months) I-S-Cubed developed SecureOMS which is the first comprehensive cryptographic key management solution for network-connected devices in the global financial services, retail and enterprise markets. Delivered as a fully configured system comprising I-S-Cubed proprietary software running on a fortified clustering platform, the patent-pending SecureOMS technology ensures both high availability and the capacity to scale as needed. This enterprise-class key management solution includes an SQL database for maximum performance and interoperates with industry leading hardware security modules and host management software. SecureOMS has been tested and accepted by world-renowned strategic partners for global usage. I was directly responsible for the QA activities of the team, coordinating the efforts of resources and working with external clients. QA Lead I-S-Cubed February 2004  –  December 2004  (11 months) I-S-Cubed developed SecureOMS which is the first comprehensive cryptographic key management solution for network-connected devices in the global financial services, retail and enterprise markets. Delivered as a fully configured system comprising I-S-Cubed proprietary software running on a fortified clustering platform, the patent-pending SecureOMS technology ensures both high availability and the capacity to scale as needed. This enterprise-class key management solution includes an SQL database for maximum performance and interoperates with industry leading hardware security modules and host management software. SecureOMS has been tested and accepted by world-renowned strategic partners for global usage. I was directly responsible for the QA activities of the team, coordinating the efforts of resources and working with external clients. QA SmokeClinic 2001  –  2003  (2 years) \tDeveloped methodology for testing corporate website, assisted in HTML content development, provide support (customer/tech) to end-users, implemented testing of workflow and implemented content management changes to site enhancement. QA SmokeClinic 2001  –  2003  (2 years) \tDeveloped methodology for testing corporate website, assisted in HTML content development, provide support (customer/tech) to end-users, implemented testing of workflow and implemented content management changes to site enhancement. QA Director Improvenet 2000  –  2001  (1 year) \tManaged and Mentored 3 QA engineers through the QA lifecycle while supporting 14 developers within my organization. \n\tManaged QA for corporate websites, developed test plans and testing methodology for the e-commerce website. \n\tDeveloped and managed QA department annual budget of 150k. QA Director Improvenet 2000  –  2001  (1 year) \tManaged and Mentored 3 QA engineers through the QA lifecycle while supporting 14 developers within my organization. \n\tManaged QA for corporate websites, developed test plans and testing methodology for the e-commerce website. \n\tDeveloped and managed QA department annual budget of 150k. QA Manager Getmedia 2000  –  2000  (less than a year) \tManaged and mentored 5 QA Engineers and 1 Build/Release Engineers while supporting 10 software developers and 5 project developers within my organization. \n\tDeveloped test plans and a testing methodology for testing service applications and participated in the development of an efficient build process of applications. \n\tEstablished and managed QA/Build department annual budget of 100k. QA Manager Getmedia 2000  –  2000  (less than a year) \tManaged and mentored 5 QA Engineers and 1 Build/Release Engineers while supporting 10 software developers and 5 project developers within my organization. \n\tDeveloped test plans and a testing methodology for testing service applications and participated in the development of an efficient build process of applications. \n\tEstablished and managed QA/Build department annual budget of 100k. QA Manager Bevocal 2000  –  2000  (less than a year) \tManaged and mentored 5 QA Engineers and 2 Build/Release Engineers while supporting 10 software developers and 5 project developers within my organization. \n\tDeveloped test plans and a testing methodology for testing service applications and participated in the development of an efficient build process of applications. \n\tEstablished and managed QA/Build department annual budget of 100k. QA Manager Bevocal 2000  –  2000  (less than a year) \tManaged and mentored 5 QA Engineers and 2 Build/Release Engineers while supporting 10 software developers and 5 project developers within my organization. \n\tDeveloped test plans and a testing methodology for testing service applications and participated in the development of an efficient build process of applications. \n\tEstablished and managed QA/Build department annual budget of 100k. QA Lead Rendition 1996  –  1999  (3 years) QA Lead Rendition 1996  –  1999  (3 years) Skills Windows Agile Selenium Agile Methodologies Test Planning Software Quality... Testing Databases Java Linux Management Project Management Software Documentation SDLC SQL JavaScript Quality Assurance Web Applications XML Test Cases Performance Testing User Acceptance Testing Strategy .NET Scrum Unix Perl Test Strategy See 13+     See less Skills  Windows Agile Selenium Agile Methodologies Test Planning Software Quality... Testing Databases Java Linux Management Project Management Software Documentation SDLC SQL JavaScript Quality Assurance Web Applications XML Test Cases Performance Testing User Acceptance Testing Strategy .NET Scrum Unix Perl Test Strategy See 13+     See less Windows Agile Selenium Agile Methodologies Test Planning Software Quality... Testing Databases Java Linux Management Project Management Software Documentation SDLC SQL JavaScript Quality Assurance Web Applications XML Test Cases Performance Testing User Acceptance Testing Strategy .NET Scrum Unix Perl Test Strategy See 13+     See less Windows Agile Selenium Agile Methodologies Test Planning Software Quality... Testing Databases Java Linux Management Project Management Software Documentation SDLC SQL JavaScript Quality Assurance Web Applications XML Test Cases Performance Testing User Acceptance Testing Strategy .NET Scrum Unix Perl Test Strategy See 13+     See less Education San Jose State University 1994  – 1995 De Anza College AA,  GE 1988  – 1993 San Jose State University 1994  – 1995 San Jose State University 1994  – 1995 San Jose State University 1994  – 1995 De Anza College AA,  GE 1988  – 1993 De Anza College AA,  GE 1988  – 1993 De Anza College AA,  GE 1988  – 1993 ", "Summary IT and Customer Support Professional with comprehensive desktop support and user training. Motivated to provide excellent response time and resolution to users. \n \nSpecialties: IT Management, Property System Administration, Technology Review and Implementation, End User Training and Support Summary IT and Customer Support Professional with comprehensive desktop support and user training. Motivated to provide excellent response time and resolution to users. \n \nSpecialties: IT Management, Property System Administration, Technology Review and Implementation, End User Training and Support IT and Customer Support Professional with comprehensive desktop support and user training. Motivated to provide excellent response time and resolution to users. \n \nSpecialties: IT Management, Property System Administration, Technology Review and Implementation, End User Training and Support IT and Customer Support Professional with comprehensive desktop support and user training. Motivated to provide excellent response time and resolution to users. \n \nSpecialties: IT Management, Property System Administration, Technology Review and Implementation, End User Training and Support Experience Senior Technical Support Engineer Xobni (Acquired by Yahoo!) September 2011  –  July 2013  (1 year 11 months) San Francisco Bay Area IT Manager Kimpton Hotels 2006  –  December 2010  (4 years) IT Manager Backbone Entertainment 2003  –  2006  (3 years) IT Supervisor Eidos 1998  –  2001  (3 years) Lead Tester Eidos Interactive October 1998  –  August 1999  (11 months) Lead Tester Microprose January 1997  –  January 1998  (1 year 1 month) QA Lead Microprose 1996  –  1998  (2 years) QA tester MicroProse Software, Inc. 1996  –  1998  (2 years) Senior Technical Support Engineer Xobni (Acquired by Yahoo!) September 2011  –  July 2013  (1 year 11 months) San Francisco Bay Area Senior Technical Support Engineer Xobni (Acquired by Yahoo!) September 2011  –  July 2013  (1 year 11 months) San Francisco Bay Area IT Manager Kimpton Hotels 2006  –  December 2010  (4 years) IT Manager Kimpton Hotels 2006  –  December 2010  (4 years) IT Manager Backbone Entertainment 2003  –  2006  (3 years) IT Manager Backbone Entertainment 2003  –  2006  (3 years) IT Supervisor Eidos 1998  –  2001  (3 years) IT Supervisor Eidos 1998  –  2001  (3 years) Lead Tester Eidos Interactive October 1998  –  August 1999  (11 months) Lead Tester Eidos Interactive October 1998  –  August 1999  (11 months) Lead Tester Microprose January 1997  –  January 1998  (1 year 1 month) Lead Tester Microprose January 1997  –  January 1998  (1 year 1 month) QA Lead Microprose 1996  –  1998  (2 years) QA Lead Microprose 1996  –  1998  (2 years) QA tester MicroProse Software, Inc. 1996  –  1998  (2 years) QA tester MicroProse Software, Inc. 1996  –  1998  (2 years) Skills IT Management Project Management Quality Assurance System Administration iPhone Servers Windows Android Mac OS X Active Directory Networking Team Management Team Leadership Troubleshooting Windows Server Video Games Budgets Technical Support Databases Security OS X Team Building Testing Agile Project Management VMware See 10+     See less Skills  IT Management Project Management Quality Assurance System Administration iPhone Servers Windows Android Mac OS X Active Directory Networking Team Management Team Leadership Troubleshooting Windows Server Video Games Budgets Technical Support Databases Security OS X Team Building Testing Agile Project Management VMware See 10+     See less IT Management Project Management Quality Assurance System Administration iPhone Servers Windows Android Mac OS X Active Directory Networking Team Management Team Leadership Troubleshooting Windows Server Video Games Budgets Technical Support Databases Security OS X Team Building Testing Agile Project Management VMware See 10+     See less IT Management Project Management Quality Assurance System Administration iPhone Servers Windows Android Mac OS X Active Directory Networking Team Management Team Leadership Troubleshooting Windows Server Video Games Budgets Technical Support Databases Security OS X Team Building Testing Agile Project Management VMware See 10+     See less ", "Experience QA Manager Yahoo! August 2009  – Present (6 years 1 month) Sunnyvale, CA Managing QA testing group of 5 QA Engineers in Yahoo, for Core Content Tool, Maps and Geo. Very hands on QA manager to deal with multiple teams for Frontend and Backend testing.  \n \nResponsible for hiring, managing daily activities of QA staff, planning and executing test schedules, development and maintenance of automated test scripts, installation functional testing and writing user guides. \n \nProvide daily updates to project team and weekly reports to up level. Mentor member to solve daily issue and help team to improve the process during QA cycle. QA lead Yahoo! Product Submit Platform April 2008  –  August 2009  (1 year 5 months) sunnyvale, ca QA lead Yahoo Hotjobs November 2004  –  March 2008  (3 years 5 months) Senior QA engineer Genealogy.com 2000  –  2003  (3 years) QA Manager Yahoo! August 2009  – Present (6 years 1 month) Sunnyvale, CA Managing QA testing group of 5 QA Engineers in Yahoo, for Core Content Tool, Maps and Geo. Very hands on QA manager to deal with multiple teams for Frontend and Backend testing.  \n \nResponsible for hiring, managing daily activities of QA staff, planning and executing test schedules, development and maintenance of automated test scripts, installation functional testing and writing user guides. \n \nProvide daily updates to project team and weekly reports to up level. Mentor member to solve daily issue and help team to improve the process during QA cycle. QA Manager Yahoo! August 2009  – Present (6 years 1 month) Sunnyvale, CA Managing QA testing group of 5 QA Engineers in Yahoo, for Core Content Tool, Maps and Geo. Very hands on QA manager to deal with multiple teams for Frontend and Backend testing.  \n \nResponsible for hiring, managing daily activities of QA staff, planning and executing test schedules, development and maintenance of automated test scripts, installation functional testing and writing user guides. \n \nProvide daily updates to project team and weekly reports to up level. Mentor member to solve daily issue and help team to improve the process during QA cycle. QA lead Yahoo! Product Submit Platform April 2008  –  August 2009  (1 year 5 months) sunnyvale, ca QA lead Yahoo! Product Submit Platform April 2008  –  August 2009  (1 year 5 months) sunnyvale, ca QA lead Yahoo Hotjobs November 2004  –  March 2008  (3 years 5 months) QA lead Yahoo Hotjobs November 2004  –  March 2008  (3 years 5 months) Senior QA engineer Genealogy.com 2000  –  2003  (3 years) Senior QA engineer Genealogy.com 2000  –  2003  (3 years) Languages Mandarin Japanese Mandarin Japanese Mandarin Japanese Skills Selenium Test Automation Bugzilla TestNG Agile Methodologies QTP WebDriver Test Planning Software Quality... Scrum Hadoop White Box Testing Perl Test Automation... Quality Assurance Testing See 1+     See less Skills  Selenium Test Automation Bugzilla TestNG Agile Methodologies QTP WebDriver Test Planning Software Quality... Scrum Hadoop White Box Testing Perl Test Automation... Quality Assurance Testing See 1+     See less Selenium Test Automation Bugzilla TestNG Agile Methodologies QTP WebDriver Test Planning Software Quality... Scrum Hadoop White Box Testing Perl Test Automation... Quality Assurance Testing See 1+     See less Selenium Test Automation Bugzilla TestNG Agile Methodologies QTP WebDriver Test Planning Software Quality... Scrum Hadoop White Box Testing Perl Test Automation... Quality Assurance Testing See 1+     See less ", "Summary {Cell phone number}: 13146506139 \n{Email}: martin6810508@hotmail.com \n \nI have over 7 years of industry experiences in web testing and mobile testing. Having strong testing expertise in both Microsoft related technologies and Linux related open source technologies, i've played as test project architect and test project lead for 5 years, in Microsoft, Yahoo, and Amazon.  \n \nMy technical skill sets spans in: selenium webdriver, hudson, java, c#, php, asp.net, javascript, jQuery, YUI, shell, perl, ruby, python, windows, linux, iOS, Android, sql server, teradata database, and oracle database. \n \nI have solid expertise in doing: web-based UI functional test automation, web-based UI layout test automation, mobile web based UI functional test, mobile app based UI functional test, web sevice testing, security testing, performance testing, load test, stress test, continuous integration / continuous deployment, internationalization test, and globalization test. \n \nI also have strong experience in managing agile development project. As a scrum master, i manageded a team of 6 developers and 3 QAs for a large scale global product. Summary {Cell phone number}: 13146506139 \n{Email}: martin6810508@hotmail.com \n \nI have over 7 years of industry experiences in web testing and mobile testing. Having strong testing expertise in both Microsoft related technologies and Linux related open source technologies, i've played as test project architect and test project lead for 5 years, in Microsoft, Yahoo, and Amazon.  \n \nMy technical skill sets spans in: selenium webdriver, hudson, java, c#, php, asp.net, javascript, jQuery, YUI, shell, perl, ruby, python, windows, linux, iOS, Android, sql server, teradata database, and oracle database. \n \nI have solid expertise in doing: web-based UI functional test automation, web-based UI layout test automation, mobile web based UI functional test, mobile app based UI functional test, web sevice testing, security testing, performance testing, load test, stress test, continuous integration / continuous deployment, internationalization test, and globalization test. \n \nI also have strong experience in managing agile development project. As a scrum master, i manageded a team of 6 developers and 3 QAs for a large scale global product. {Cell phone number}: 13146506139 \n{Email}: martin6810508@hotmail.com \n \nI have over 7 years of industry experiences in web testing and mobile testing. Having strong testing expertise in both Microsoft related technologies and Linux related open source technologies, i've played as test project architect and test project lead for 5 years, in Microsoft, Yahoo, and Amazon.  \n \nMy technical skill sets spans in: selenium webdriver, hudson, java, c#, php, asp.net, javascript, jQuery, YUI, shell, perl, ruby, python, windows, linux, iOS, Android, sql server, teradata database, and oracle database. \n \nI have solid expertise in doing: web-based UI functional test automation, web-based UI layout test automation, mobile web based UI functional test, mobile app based UI functional test, web sevice testing, security testing, performance testing, load test, stress test, continuous integration / continuous deployment, internationalization test, and globalization test. \n \nI also have strong experience in managing agile development project. As a scrum master, i manageded a team of 6 developers and 3 QAs for a large scale global product. {Cell phone number}: 13146506139 \n{Email}: martin6810508@hotmail.com \n \nI have over 7 years of industry experiences in web testing and mobile testing. Having strong testing expertise in both Microsoft related technologies and Linux related open source technologies, i've played as test project architect and test project lead for 5 years, in Microsoft, Yahoo, and Amazon.  \n \nMy technical skill sets spans in: selenium webdriver, hudson, java, c#, php, asp.net, javascript, jQuery, YUI, shell, perl, ruby, python, windows, linux, iOS, Android, sql server, teradata database, and oracle database. \n \nI have solid expertise in doing: web-based UI functional test automation, web-based UI layout test automation, mobile web based UI functional test, mobile app based UI functional test, web sevice testing, security testing, performance testing, load test, stress test, continuous integration / continuous deployment, internationalization test, and globalization test. \n \nI also have strong experience in managing agile development project. As a scrum master, i manageded a team of 6 developers and 3 QAs for a large scale global product. Experience Senior Software Test Engineer (test lead role) Yahoo January 2014  – Present (1 year 8 months) Beijing City, China Working as test lead, testing Yahoo online search ads optimization server. The ad optimization server working as a webservice, doing ads optimization for search ads displayed to users of yahoo search engine (search.yahoo.com) on PC, and mobile devices.  \n \nTechnical scope:  \n- build up Continous Delivery pipelines, with Jekins, shell, perl and python. \n- write automated tests to verify production functions and performance, with python and robot test framework. Test Lead Amazon China July 2012  –  January 2014  (1 year 7 months) Beijing, China Play as a test lead, i work with my QA team members to deliver testing for the following projects:  \n \n- Image block:  \nThe component to display product images on each detail page of Amazon retail website in destop browsers.  \n \nMy role in this project: \nI worked as test lead, lead 2 other QAs to finish testing for the project. \n \n- UDP on mobile devices: \nThe component to display product images on each detail page of Amazon retail website on mobile devices, including iphone, ipad, android phone, and amazon kindle fire.  \n \nMy role in this project: \nI worked on my own, doing testing for the whole project. \n \n- Dapei  \nA sub website of Amazon retail website.  \n \nMy role in this project: \nI work on my own, doing testing for the whole website. \n \n- iSee \nA cutting edge test tool for doing UI layout test automation. It can largely reduce manual testing efforts on finding UI layout issues, which was a industry gap in test automation.  \n \nMy role in this project: \nI initiated this project, and worked as program manager and architect, lead a team of 3 developers and a dev manager to finish building, testing, and release this tool. QA Lead Yahoo! Global R&D Center July 2010  –  July 2012  (2 years 1 month) Beijing, China I work as a technical test lead, leading a team of full time employees, contractors, and interns. My main responsibilities are: bring technical solutions (build or refactor test frameworks and test tools) to the test team, guiding and coaching team members in doing test automation, build continuously integration (CI) pipeline, and ensure product release testing are done in time with high quality.  \n \nIn addition, I play as a scrum master of the agile team, managing product development, testing, and release lifecycle, and monitor the whole process through well-defined quality metrics. \n \nTechnical scope:  \nphp, java, maven, c#, javascript, shell, perl, linux, windows, ios, android, automation framework design & implementation, ui automation testing, web service testing, back end system testing, performance testing, security testing, i18n testing, ci with hudson, cruise control, build plugins and extentions for ci pipline, code coverage. QA automation engineer Teradata 2009  –  2010  (1 year) Beijing, China Technical scope:  \nui automation test framework design and implementation. hudson ci, performance testing. SDET Lead (Onsite) Microsoft China 2006  –  2009  (3 years) Beijing, China . Technical scope: c#, asp.net, windows, ui automation, web service testing, performance testing, security testing. ci with cruise control. \nProduct: online advertising publishing website for Microsoft search engine. Senior Software Test Engineer (test lead role) Yahoo January 2014  – Present (1 year 8 months) Beijing City, China Working as test lead, testing Yahoo online search ads optimization server. The ad optimization server working as a webservice, doing ads optimization for search ads displayed to users of yahoo search engine (search.yahoo.com) on PC, and mobile devices.  \n \nTechnical scope:  \n- build up Continous Delivery pipelines, with Jekins, shell, perl and python. \n- write automated tests to verify production functions and performance, with python and robot test framework. Senior Software Test Engineer (test lead role) Yahoo January 2014  – Present (1 year 8 months) Beijing City, China Working as test lead, testing Yahoo online search ads optimization server. The ad optimization server working as a webservice, doing ads optimization for search ads displayed to users of yahoo search engine (search.yahoo.com) on PC, and mobile devices.  \n \nTechnical scope:  \n- build up Continous Delivery pipelines, with Jekins, shell, perl and python. \n- write automated tests to verify production functions and performance, with python and robot test framework. Test Lead Amazon China July 2012  –  January 2014  (1 year 7 months) Beijing, China Play as a test lead, i work with my QA team members to deliver testing for the following projects:  \n \n- Image block:  \nThe component to display product images on each detail page of Amazon retail website in destop browsers.  \n \nMy role in this project: \nI worked as test lead, lead 2 other QAs to finish testing for the project. \n \n- UDP on mobile devices: \nThe component to display product images on each detail page of Amazon retail website on mobile devices, including iphone, ipad, android phone, and amazon kindle fire.  \n \nMy role in this project: \nI worked on my own, doing testing for the whole project. \n \n- Dapei  \nA sub website of Amazon retail website.  \n \nMy role in this project: \nI work on my own, doing testing for the whole website. \n \n- iSee \nA cutting edge test tool for doing UI layout test automation. It can largely reduce manual testing efforts on finding UI layout issues, which was a industry gap in test automation.  \n \nMy role in this project: \nI initiated this project, and worked as program manager and architect, lead a team of 3 developers and a dev manager to finish building, testing, and release this tool. Test Lead Amazon China July 2012  –  January 2014  (1 year 7 months) Beijing, China Play as a test lead, i work with my QA team members to deliver testing for the following projects:  \n \n- Image block:  \nThe component to display product images on each detail page of Amazon retail website in destop browsers.  \n \nMy role in this project: \nI worked as test lead, lead 2 other QAs to finish testing for the project. \n \n- UDP on mobile devices: \nThe component to display product images on each detail page of Amazon retail website on mobile devices, including iphone, ipad, android phone, and amazon kindle fire.  \n \nMy role in this project: \nI worked on my own, doing testing for the whole project. \n \n- Dapei  \nA sub website of Amazon retail website.  \n \nMy role in this project: \nI work on my own, doing testing for the whole website. \n \n- iSee \nA cutting edge test tool for doing UI layout test automation. It can largely reduce manual testing efforts on finding UI layout issues, which was a industry gap in test automation.  \n \nMy role in this project: \nI initiated this project, and worked as program manager and architect, lead a team of 3 developers and a dev manager to finish building, testing, and release this tool. QA Lead Yahoo! Global R&D Center July 2010  –  July 2012  (2 years 1 month) Beijing, China I work as a technical test lead, leading a team of full time employees, contractors, and interns. My main responsibilities are: bring technical solutions (build or refactor test frameworks and test tools) to the test team, guiding and coaching team members in doing test automation, build continuously integration (CI) pipeline, and ensure product release testing are done in time with high quality.  \n \nIn addition, I play as a scrum master of the agile team, managing product development, testing, and release lifecycle, and monitor the whole process through well-defined quality metrics. \n \nTechnical scope:  \nphp, java, maven, c#, javascript, shell, perl, linux, windows, ios, android, automation framework design & implementation, ui automation testing, web service testing, back end system testing, performance testing, security testing, i18n testing, ci with hudson, cruise control, build plugins and extentions for ci pipline, code coverage. QA Lead Yahoo! Global R&D Center July 2010  –  July 2012  (2 years 1 month) Beijing, China I work as a technical test lead, leading a team of full time employees, contractors, and interns. My main responsibilities are: bring technical solutions (build or refactor test frameworks and test tools) to the test team, guiding and coaching team members in doing test automation, build continuously integration (CI) pipeline, and ensure product release testing are done in time with high quality.  \n \nIn addition, I play as a scrum master of the agile team, managing product development, testing, and release lifecycle, and monitor the whole process through well-defined quality metrics. \n \nTechnical scope:  \nphp, java, maven, c#, javascript, shell, perl, linux, windows, ios, android, automation framework design & implementation, ui automation testing, web service testing, back end system testing, performance testing, security testing, i18n testing, ci with hudson, cruise control, build plugins and extentions for ci pipline, code coverage. QA automation engineer Teradata 2009  –  2010  (1 year) Beijing, China Technical scope:  \nui automation test framework design and implementation. hudson ci, performance testing. QA automation engineer Teradata 2009  –  2010  (1 year) Beijing, China Technical scope:  \nui automation test framework design and implementation. hudson ci, performance testing. SDET Lead (Onsite) Microsoft China 2006  –  2009  (3 years) Beijing, China . Technical scope: c#, asp.net, windows, ui automation, web service testing, performance testing, security testing. ci with cruise control. \nProduct: online advertising publishing website for Microsoft search engine. SDET Lead (Onsite) Microsoft China 2006  –  2009  (3 years) Beijing, China . Technical scope: c#, asp.net, windows, ui automation, web service testing, performance testing, security testing. ci with cruise control. \nProduct: online advertising publishing website for Microsoft search engine. Languages English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Perl Java JavaScript PHP C# Selenium Test Automation Agile Methodologies Shell Scripting Linux Windows MySQL Mobile Internet Mobile Applications Web Services Web Applications Maven Continuous Integration Hudson Tortoise SVN Bugzilla Software Engineering Distributed Systems Scalability Testing Hadoop Python Ruby jQuery See 14+     See less Skills  Perl Java JavaScript PHP C# Selenium Test Automation Agile Methodologies Shell Scripting Linux Windows MySQL Mobile Internet Mobile Applications Web Services Web Applications Maven Continuous Integration Hudson Tortoise SVN Bugzilla Software Engineering Distributed Systems Scalability Testing Hadoop Python Ruby jQuery See 14+     See less Perl Java JavaScript PHP C# Selenium Test Automation Agile Methodologies Shell Scripting Linux Windows MySQL Mobile Internet Mobile Applications Web Services Web Applications Maven Continuous Integration Hudson Tortoise SVN Bugzilla Software Engineering Distributed Systems Scalability Testing Hadoop Python Ruby jQuery See 14+     See less Perl Java JavaScript PHP C# Selenium Test Automation Agile Methodologies Shell Scripting Linux Windows MySQL Mobile Internet Mobile Applications Web Services Web Applications Maven Continuous Integration Hudson Tortoise SVN Bugzilla Software Engineering Distributed Systems Scalability Testing Hadoop Python Ruby jQuery See 14+     See less Education The University of Sheffield Master,  Information management 2004  – 2006 Southwest Jiaotong University Bs,  Computer Science 1999  – 2003 The University of Sheffield Master,  Information management 2004  – 2006 The University of Sheffield Master,  Information management 2004  – 2006 The University of Sheffield Master,  Information management 2004  – 2006 Southwest Jiaotong University Bs,  Computer Science 1999  – 2003 Southwest Jiaotong University Bs,  Computer Science 1999  – 2003 Southwest Jiaotong University Bs,  Computer Science 1999  – 2003 ", "Summary * Over 14 years of experience in the field of Technology in Software Development & Testing of Software Applications in the roles of a QA Lead Manager / Engineer / Analyst in the areas of CRM Applications (Saleforce.com, Siebel), SAP and Web Technology and Web Services and Client/Server. \n* Experience in area of Reviewing Requirements, Analyzing Business Specifications, Resource Estimation, Documentation and Test Plan Creation, Test Cases Development, Execution and Defect Tracking & Defects Reporting of projects with Manual and Automated testing tools using Selenium, Jira, Rally, VersionOne, QTP, Load Runner, QC / TD, Rational Products (Requisite Pro, Test Manager, Clear Quest). \n* Experience in Leading, Coaching and Guiding the team on Agile practices and working as Scrum Master and removing team impediments to deliver the high quality releases. \n* Extensive experience in managing all facets of the Project Life Cycle (SDLC), Agile Process and Scrum Methodologies. \n* Capable of handling Multiple Tasks and Projects and able to perform independently with timely delivery against aggressive deadlines. \n* Excellent interpersonal communication skills, functional and technical documentation skills. \n* Experience on working and coordinating both On-Site and Offshore model. \n \nSpecialties: QE Lead Engineer, Scrum Master, Product Owner, Selenium, Jira, Rally, VersionOne, Gerrit, GIT, Salesforce.com (SFDC) Test Manager, Bugzilla, Selenium, QTP, Load Runner, Tortoise SVN, Soap UI, XML, Siebel, SFDC, Java, Knouen Office Sync, SQL, PL/SQL, Oracle, Load Runner, SAP, EDI, Test Metrics. Summary * Over 14 years of experience in the field of Technology in Software Development & Testing of Software Applications in the roles of a QA Lead Manager / Engineer / Analyst in the areas of CRM Applications (Saleforce.com, Siebel), SAP and Web Technology and Web Services and Client/Server. \n* Experience in area of Reviewing Requirements, Analyzing Business Specifications, Resource Estimation, Documentation and Test Plan Creation, Test Cases Development, Execution and Defect Tracking & Defects Reporting of projects with Manual and Automated testing tools using Selenium, Jira, Rally, VersionOne, QTP, Load Runner, QC / TD, Rational Products (Requisite Pro, Test Manager, Clear Quest). \n* Experience in Leading, Coaching and Guiding the team on Agile practices and working as Scrum Master and removing team impediments to deliver the high quality releases. \n* Extensive experience in managing all facets of the Project Life Cycle (SDLC), Agile Process and Scrum Methodologies. \n* Capable of handling Multiple Tasks and Projects and able to perform independently with timely delivery against aggressive deadlines. \n* Excellent interpersonal communication skills, functional and technical documentation skills. \n* Experience on working and coordinating both On-Site and Offshore model. \n \nSpecialties: QE Lead Engineer, Scrum Master, Product Owner, Selenium, Jira, Rally, VersionOne, Gerrit, GIT, Salesforce.com (SFDC) Test Manager, Bugzilla, Selenium, QTP, Load Runner, Tortoise SVN, Soap UI, XML, Siebel, SFDC, Java, Knouen Office Sync, SQL, PL/SQL, Oracle, Load Runner, SAP, EDI, Test Metrics. * Over 14 years of experience in the field of Technology in Software Development & Testing of Software Applications in the roles of a QA Lead Manager / Engineer / Analyst in the areas of CRM Applications (Saleforce.com, Siebel), SAP and Web Technology and Web Services and Client/Server. \n* Experience in area of Reviewing Requirements, Analyzing Business Specifications, Resource Estimation, Documentation and Test Plan Creation, Test Cases Development, Execution and Defect Tracking & Defects Reporting of projects with Manual and Automated testing tools using Selenium, Jira, Rally, VersionOne, QTP, Load Runner, QC / TD, Rational Products (Requisite Pro, Test Manager, Clear Quest). \n* Experience in Leading, Coaching and Guiding the team on Agile practices and working as Scrum Master and removing team impediments to deliver the high quality releases. \n* Extensive experience in managing all facets of the Project Life Cycle (SDLC), Agile Process and Scrum Methodologies. \n* Capable of handling Multiple Tasks and Projects and able to perform independently with timely delivery against aggressive deadlines. \n* Excellent interpersonal communication skills, functional and technical documentation skills. \n* Experience on working and coordinating both On-Site and Offshore model. \n \nSpecialties: QE Lead Engineer, Scrum Master, Product Owner, Selenium, Jira, Rally, VersionOne, Gerrit, GIT, Salesforce.com (SFDC) Test Manager, Bugzilla, Selenium, QTP, Load Runner, Tortoise SVN, Soap UI, XML, Siebel, SFDC, Java, Knouen Office Sync, SQL, PL/SQL, Oracle, Load Runner, SAP, EDI, Test Metrics. * Over 14 years of experience in the field of Technology in Software Development & Testing of Software Applications in the roles of a QA Lead Manager / Engineer / Analyst in the areas of CRM Applications (Saleforce.com, Siebel), SAP and Web Technology and Web Services and Client/Server. \n* Experience in area of Reviewing Requirements, Analyzing Business Specifications, Resource Estimation, Documentation and Test Plan Creation, Test Cases Development, Execution and Defect Tracking & Defects Reporting of projects with Manual and Automated testing tools using Selenium, Jira, Rally, VersionOne, QTP, Load Runner, QC / TD, Rational Products (Requisite Pro, Test Manager, Clear Quest). \n* Experience in Leading, Coaching and Guiding the team on Agile practices and working as Scrum Master and removing team impediments to deliver the high quality releases. \n* Extensive experience in managing all facets of the Project Life Cycle (SDLC), Agile Process and Scrum Methodologies. \n* Capable of handling Multiple Tasks and Projects and able to perform independently with timely delivery against aggressive deadlines. \n* Excellent interpersonal communication skills, functional and technical documentation skills. \n* Experience on working and coordinating both On-Site and Offshore model. \n \nSpecialties: QE Lead Engineer, Scrum Master, Product Owner, Selenium, Jira, Rally, VersionOne, Gerrit, GIT, Salesforce.com (SFDC) Test Manager, Bugzilla, Selenium, QTP, Load Runner, Tortoise SVN, Soap UI, XML, Siebel, SFDC, Java, Knouen Office Sync, SQL, PL/SQL, Oracle, Load Runner, SAP, EDI, Test Metrics. Experience QA Lead Engineer and Scrum Master Yahoo! December 2009  – Present (5 years 9 months) Santa Clara QA Lead Analyst KCI Medical May 2009  –  December 2009  (8 months) Sr. QA Analyst / Lead Autodesk March 2004  –  April 2009  (5 years 2 months) QA Automation Analyst Merrill Lynch 2003  –  2004  (1 year) Project: WMTP - Automation Tool QTP 6.0 & 6.5 IT QA Analyst Boeing 2002  –  2003  (1 year) Project: BOECOM Replacement Project, SeaTac, WA QA Analyst Aerospan.com 2000  –  2002  (2 years) QA Lead Engineer and Scrum Master Yahoo! December 2009  – Present (5 years 9 months) Santa Clara QA Lead Engineer and Scrum Master Yahoo! December 2009  – Present (5 years 9 months) Santa Clara QA Lead Analyst KCI Medical May 2009  –  December 2009  (8 months) QA Lead Analyst KCI Medical May 2009  –  December 2009  (8 months) Sr. QA Analyst / Lead Autodesk March 2004  –  April 2009  (5 years 2 months) Sr. QA Analyst / Lead Autodesk March 2004  –  April 2009  (5 years 2 months) QA Automation Analyst Merrill Lynch 2003  –  2004  (1 year) Project: WMTP - Automation Tool QTP 6.0 & 6.5 QA Automation Analyst Merrill Lynch 2003  –  2004  (1 year) Project: WMTP - Automation Tool QTP 6.0 & 6.5 IT QA Analyst Boeing 2002  –  2003  (1 year) Project: BOECOM Replacement Project, SeaTac, WA IT QA Analyst Boeing 2002  –  2003  (1 year) Project: BOECOM Replacement Project, SeaTac, WA QA Analyst Aerospan.com 2000  –  2002  (2 years) QA Analyst Aerospan.com 2000  –  2002  (2 years) Skills Quality Center Quality Assurance LoadRunner Integration QTP Scrum Business Analysis Bugzilla Test Planning Skills  Quality Center Quality Assurance LoadRunner Integration QTP Scrum Business Analysis Bugzilla Test Planning Quality Center Quality Assurance LoadRunner Integration QTP Scrum Business Analysis Bugzilla Test Planning Quality Center Quality Assurance LoadRunner Integration QTP Scrum Business Analysis Bugzilla Test Planning Education Symbiosis International University MBA 2005  – 2007 Osmania University B. Sc 1991  – 1993 Alagappa University B.Ed Symbiosis International University MBA 2005  – 2007 Symbiosis International University MBA 2005  – 2007 Symbiosis International University MBA 2005  – 2007 Osmania University B. Sc 1991  – 1993 Osmania University B. Sc 1991  – 1993 Osmania University B. Sc 1991  – 1993 Alagappa University B.Ed Alagappa University B.Ed Alagappa University B.Ed ", "Experience UI QA Manager Workday June 2013  – Present (2 years 3 months) Manage QA resources allocated to UI related scrum team. This includes making sure we have cross team communications with the application teams and the server teams.  \n \nManage weekly patch releases. Ensure all automation and smoke tests pass for all pipelines. (My team monitors more than 15 automation plans). Manage the team systematically to minimize false negatives. Ensure all bugs are verified and that fixes are applied to both trunk and release candidate branches.  \n \nEnsure automation tests for new features are added and appropriately toggled in different confidence levels. In addition to functional automation, this also includes accessibility, internationalization, outage, content delivery network (CDN), and responsive/device automation. \n \nWorked closely with development team to make sure each UI widget is adequately automated. This may include negative/error message testing, keyboard navigation, pdf validation, and currency/date/time testing. \n \nMeet with Customer Support on a weekly basis to discuss hot issues. Got on customer calls to help troubleshoot UI specific issues. \n \nWorked with data scientists to determine customer usage (e.g., browser and device usage). By leveraging usage data, we can focus our testing on widely used areas. \n QA Lead Yahoo February 2003  – Present (12 years 7 months) Manage testing and release of Yahoo! Messenger client for last 5 releases. Manage testing of Messenger in Y! Mail. Implemented Agile testing practice. Coordinated release with various teams, including server engineering, product development, operations, customer support, and international/localization team.  \n \nWorked closely with product managers, program managers, UED designers, and development managers to define product cycle and schedule. Helped product manager define product workflow and behavior.  \n \nManage QA teams in US, India, and China. Trained and mentored them to use Test Case and Bug Management System effectively.  \n \nPerformed bucket testing of user targeted advertisement. Ads were targeted based on IP-location and user search pattern.  \n \nCreated UI automation harness using SILKTEST and Ranorex (implemented in C#). Implemented data driven test cases using xml files. Managed a group of automation engineers to extend and add test cases to the harness. \n \nManaged VoIP and Video testing. This included bandwidth limitation testing, packet loss/reorder testing, and NAT testing. Performed network debugging by using WireShark and Fiddler.  \n \nPerformed client performance test and memory leak detection. Ensured the client performs well with large contact list for long duration. \n \nWorked with customer support to ensure level 3 issues are resolved. Software QA Lead VITRIA, INC January 1999  –  January 2003  (4 years 1 month) Tested Vitria's Enterprise Application Integration software. This involved creating business process models and establishing connectivity with various database connectors.  \n \nBusiness process models from corporate clients were also used for testing.  \n \nLed the effort in automating GUI testing using SilkTest. Developed SilkTest classes and API to interact with our java application. Trained GUI developers to use SilkTest for unit testing. \n \nCreated automated test suite using company's Java API and company's test harness. The test suite was created by inheriting from the test harness's interface. The test suite was used for functional testing (e.g., Corba idl stub generation) as well as stress testing. \n \nTested Vitria's web portal and workflow system. This involved the knowledge of installing and configuring web servers (Apache, IIS, iPlanet, Tomcat), ldap servers (iPlanet), databases (Oracle 8I, SQL Server), servlet engine (JRUN), and other 3rd party software. QA Technical Lead Intraspect Software January 1998  –  January 1999  (1 year 1 month) Monitored and evaluated server performance by using Performance Monitor and Network Monitor. Data collected include memory usage, CPU usage, paging frequency, and disk activities. \n \nPerformed whitebox testing using company's http API and template API. Developed a GUI unit-testing tool by using java.awt package. QA Engineer ARAXSYS INC January 1997  –  January 1998  (1 year 1 month) Developed Windows 95/NT client/server testing software by using company product's core API. A scripting tool was developed by using Visual C++ to read test-suite files. Environmental Engineer ERM WEST INC January 1993  –  January 1997  (4 years 1 month) Designed groundwater and soil remediation systems. Acted as Operation and Maintenance Manager for a soil vapor extraction system. UI QA Manager Workday June 2013  – Present (2 years 3 months) Manage QA resources allocated to UI related scrum team. This includes making sure we have cross team communications with the application teams and the server teams.  \n \nManage weekly patch releases. Ensure all automation and smoke tests pass for all pipelines. (My team monitors more than 15 automation plans). Manage the team systematically to minimize false negatives. Ensure all bugs are verified and that fixes are applied to both trunk and release candidate branches.  \n \nEnsure automation tests for new features are added and appropriately toggled in different confidence levels. In addition to functional automation, this also includes accessibility, internationalization, outage, content delivery network (CDN), and responsive/device automation. \n \nWorked closely with development team to make sure each UI widget is adequately automated. This may include negative/error message testing, keyboard navigation, pdf validation, and currency/date/time testing. \n \nMeet with Customer Support on a weekly basis to discuss hot issues. Got on customer calls to help troubleshoot UI specific issues. \n \nWorked with data scientists to determine customer usage (e.g., browser and device usage). By leveraging usage data, we can focus our testing on widely used areas. \n UI QA Manager Workday June 2013  – Present (2 years 3 months) Manage QA resources allocated to UI related scrum team. This includes making sure we have cross team communications with the application teams and the server teams.  \n \nManage weekly patch releases. Ensure all automation and smoke tests pass for all pipelines. (My team monitors more than 15 automation plans). Manage the team systematically to minimize false negatives. Ensure all bugs are verified and that fixes are applied to both trunk and release candidate branches.  \n \nEnsure automation tests for new features are added and appropriately toggled in different confidence levels. In addition to functional automation, this also includes accessibility, internationalization, outage, content delivery network (CDN), and responsive/device automation. \n \nWorked closely with development team to make sure each UI widget is adequately automated. This may include negative/error message testing, keyboard navigation, pdf validation, and currency/date/time testing. \n \nMeet with Customer Support on a weekly basis to discuss hot issues. Got on customer calls to help troubleshoot UI specific issues. \n \nWorked with data scientists to determine customer usage (e.g., browser and device usage). By leveraging usage data, we can focus our testing on widely used areas. \n QA Lead Yahoo February 2003  – Present (12 years 7 months) Manage testing and release of Yahoo! Messenger client for last 5 releases. Manage testing of Messenger in Y! Mail. Implemented Agile testing practice. Coordinated release with various teams, including server engineering, product development, operations, customer support, and international/localization team.  \n \nWorked closely with product managers, program managers, UED designers, and development managers to define product cycle and schedule. Helped product manager define product workflow and behavior.  \n \nManage QA teams in US, India, and China. Trained and mentored them to use Test Case and Bug Management System effectively.  \n \nPerformed bucket testing of user targeted advertisement. Ads were targeted based on IP-location and user search pattern.  \n \nCreated UI automation harness using SILKTEST and Ranorex (implemented in C#). Implemented data driven test cases using xml files. Managed a group of automation engineers to extend and add test cases to the harness. \n \nManaged VoIP and Video testing. This included bandwidth limitation testing, packet loss/reorder testing, and NAT testing. Performed network debugging by using WireShark and Fiddler.  \n \nPerformed client performance test and memory leak detection. Ensured the client performs well with large contact list for long duration. \n \nWorked with customer support to ensure level 3 issues are resolved. QA Lead Yahoo February 2003  – Present (12 years 7 months) Manage testing and release of Yahoo! Messenger client for last 5 releases. Manage testing of Messenger in Y! Mail. Implemented Agile testing practice. Coordinated release with various teams, including server engineering, product development, operations, customer support, and international/localization team.  \n \nWorked closely with product managers, program managers, UED designers, and development managers to define product cycle and schedule. Helped product manager define product workflow and behavior.  \n \nManage QA teams in US, India, and China. Trained and mentored them to use Test Case and Bug Management System effectively.  \n \nPerformed bucket testing of user targeted advertisement. Ads were targeted based on IP-location and user search pattern.  \n \nCreated UI automation harness using SILKTEST and Ranorex (implemented in C#). Implemented data driven test cases using xml files. Managed a group of automation engineers to extend and add test cases to the harness. \n \nManaged VoIP and Video testing. This included bandwidth limitation testing, packet loss/reorder testing, and NAT testing. Performed network debugging by using WireShark and Fiddler.  \n \nPerformed client performance test and memory leak detection. Ensured the client performs well with large contact list for long duration. \n \nWorked with customer support to ensure level 3 issues are resolved. Software QA Lead VITRIA, INC January 1999  –  January 2003  (4 years 1 month) Tested Vitria's Enterprise Application Integration software. This involved creating business process models and establishing connectivity with various database connectors.  \n \nBusiness process models from corporate clients were also used for testing.  \n \nLed the effort in automating GUI testing using SilkTest. Developed SilkTest classes and API to interact with our java application. Trained GUI developers to use SilkTest for unit testing. \n \nCreated automated test suite using company's Java API and company's test harness. The test suite was created by inheriting from the test harness's interface. The test suite was used for functional testing (e.g., Corba idl stub generation) as well as stress testing. \n \nTested Vitria's web portal and workflow system. This involved the knowledge of installing and configuring web servers (Apache, IIS, iPlanet, Tomcat), ldap servers (iPlanet), databases (Oracle 8I, SQL Server), servlet engine (JRUN), and other 3rd party software. Software QA Lead VITRIA, INC January 1999  –  January 2003  (4 years 1 month) Tested Vitria's Enterprise Application Integration software. This involved creating business process models and establishing connectivity with various database connectors.  \n \nBusiness process models from corporate clients were also used for testing.  \n \nLed the effort in automating GUI testing using SilkTest. Developed SilkTest classes and API to interact with our java application. Trained GUI developers to use SilkTest for unit testing. \n \nCreated automated test suite using company's Java API and company's test harness. The test suite was created by inheriting from the test harness's interface. The test suite was used for functional testing (e.g., Corba idl stub generation) as well as stress testing. \n \nTested Vitria's web portal and workflow system. This involved the knowledge of installing and configuring web servers (Apache, IIS, iPlanet, Tomcat), ldap servers (iPlanet), databases (Oracle 8I, SQL Server), servlet engine (JRUN), and other 3rd party software. QA Technical Lead Intraspect Software January 1998  –  January 1999  (1 year 1 month) Monitored and evaluated server performance by using Performance Monitor and Network Monitor. Data collected include memory usage, CPU usage, paging frequency, and disk activities. \n \nPerformed whitebox testing using company's http API and template API. Developed a GUI unit-testing tool by using java.awt package. QA Technical Lead Intraspect Software January 1998  –  January 1999  (1 year 1 month) Monitored and evaluated server performance by using Performance Monitor and Network Monitor. Data collected include memory usage, CPU usage, paging frequency, and disk activities. \n \nPerformed whitebox testing using company's http API and template API. Developed a GUI unit-testing tool by using java.awt package. QA Engineer ARAXSYS INC January 1997  –  January 1998  (1 year 1 month) Developed Windows 95/NT client/server testing software by using company product's core API. A scripting tool was developed by using Visual C++ to read test-suite files. QA Engineer ARAXSYS INC January 1997  –  January 1998  (1 year 1 month) Developed Windows 95/NT client/server testing software by using company product's core API. A scripting tool was developed by using Visual C++ to read test-suite files. Environmental Engineer ERM WEST INC January 1993  –  January 1997  (4 years 1 month) Designed groundwater and soil remediation systems. Acted as Operation and Maintenance Manager for a soil vapor extraction system. Environmental Engineer ERM WEST INC January 1993  –  January 1997  (4 years 1 month) Designed groundwater and soil remediation systems. Acted as Operation and Maintenance Manager for a soil vapor extraction system. Skills Test Automation Scalability Software Quality... Agile Methodologies REST Distributed Systems Test Cases Scrum API Testing Test Planning Java Selenium Skills  Test Automation Scalability Software Quality... Agile Methodologies REST Distributed Systems Test Cases Scrum API Testing Test Planning Java Selenium Test Automation Scalability Software Quality... Agile Methodologies REST Distributed Systems Test Cases Scrum API Testing Test Planning Java Selenium Test Automation Scalability Software Quality... Agile Methodologies REST Distributed Systems Test Cases Scrum API Testing Test Planning Java Selenium Education UC Berkeley Bachelor's degree,  Civil Engineering 1991  – 1993 University of California, Berkeley Bachelor of Science,  Civil/Environmental Engineering 1993 UC Berkeley Bachelor's degree,  Civil Engineering 1991  – 1993 UC Berkeley Bachelor's degree,  Civil Engineering 1991  – 1993 UC Berkeley Bachelor's degree,  Civil Engineering 1991  – 1993 University of California, Berkeley Bachelor of Science,  Civil/Environmental Engineering 1993 University of California, Berkeley Bachelor of Science,  Civil/Environmental Engineering 1993 University of California, Berkeley Bachelor of Science,  Civil/Environmental Engineering 1993 ", "Experience QA Lead Yahoo! January 2009  – Present (6 years 8 months) QA Lead Microsoft January 2002  –  February 2009  (7 years 2 months) QA Engineer Google January 1999  –  February 2001  (2 years 2 months) QA Lead Yahoo! January 2009  – Present (6 years 8 months) QA Lead Yahoo! January 2009  – Present (6 years 8 months) QA Lead Microsoft January 2002  –  February 2009  (7 years 2 months) QA Lead Microsoft January 2002  –  February 2009  (7 years 2 months) QA Engineer Google January 1999  –  February 2001  (2 years 2 months) QA Engineer Google January 1999  –  February 2001  (2 years 2 months) Skills QAD Automotive Skills  QAD Automotive QAD Automotive QAD Automotive Education Stanford University Bachelor of Science (BS),  Computer Science 1995  – 1999 Stanford University Bachelor of Science (BS),  Computer Science 1995  – 1999 Stanford University Bachelor of Science (BS),  Computer Science 1995  – 1999 Stanford University Bachelor of Science (BS),  Computer Science 1995  – 1999 ", "Summary I build high performance complex computer systems. In doing so, I provide the management, engineering and architecture experience to build excellent systems. Specialties:Management, Large scale system engineering/architecture, Linux, Apache, Quality Assurance, Performance Engineering, Perl, Shell Scripting, C, C++, . Working with offshore teams, off-shoring projects, working in cross location workplaces. Summary I build high performance complex computer systems. In doing so, I provide the management, engineering and architecture experience to build excellent systems. Specialties:Management, Large scale system engineering/architecture, Linux, Apache, Quality Assurance, Performance Engineering, Perl, Shell Scripting, C, C++, . Working with offshore teams, off-shoring projects, working in cross location workplaces. I build high performance complex computer systems. In doing so, I provide the management, engineering and architecture experience to build excellent systems. Specialties:Management, Large scale system engineering/architecture, Linux, Apache, Quality Assurance, Performance Engineering, Perl, Shell Scripting, C, C++, . Working with offshore teams, off-shoring projects, working in cross location workplaces. I build high performance complex computer systems. In doing so, I provide the management, engineering and architecture experience to build excellent systems. Specialties:Management, Large scale system engineering/architecture, Linux, Apache, Quality Assurance, Performance Engineering, Perl, Shell Scripting, C, C++, . Working with offshore teams, off-shoring projects, working in cross location workplaces. Experience Sr. Dir. Engineering Yahoo March 2014  – Present (1 year 6 months) Burbank, CA Director of Engineering Yahoo March 2011  –  March 2014  (3 years 1 month) Manage Engineering tasks as part of the Yahoo!-Microsoft Search Alliance Director of SA QE Yahoo Inc February 2005  –  March 2011  (6 years 2 months) Lead the Search Advertising Quality Engineering Department. Software Quality Assurance Engineer Countrywide Securities Corporation 2004  –  February 2005  (1 year) Test high performing Bond Trading Software. Software QA Consultant Public Storage 2002  –  2004  (2 years) Consulting Test position. Software QA Lead Enfish Corp 1998  –  2002  (4 years) Lead test team on the Enfish Tracker project. Sr. Dir. Engineering Yahoo March 2014  – Present (1 year 6 months) Burbank, CA Sr. Dir. Engineering Yahoo March 2014  – Present (1 year 6 months) Burbank, CA Director of Engineering Yahoo March 2011  –  March 2014  (3 years 1 month) Manage Engineering tasks as part of the Yahoo!-Microsoft Search Alliance Director of Engineering Yahoo March 2011  –  March 2014  (3 years 1 month) Manage Engineering tasks as part of the Yahoo!-Microsoft Search Alliance Director of SA QE Yahoo Inc February 2005  –  March 2011  (6 years 2 months) Lead the Search Advertising Quality Engineering Department. Director of SA QE Yahoo Inc February 2005  –  March 2011  (6 years 2 months) Lead the Search Advertising Quality Engineering Department. Software Quality Assurance Engineer Countrywide Securities Corporation 2004  –  February 2005  (1 year) Test high performing Bond Trading Software. Software Quality Assurance Engineer Countrywide Securities Corporation 2004  –  February 2005  (1 year) Test high performing Bond Trading Software. Software QA Consultant Public Storage 2002  –  2004  (2 years) Consulting Test position. Software QA Consultant Public Storage 2002  –  2004  (2 years) Consulting Test position. Software QA Lead Enfish Corp 1998  –  2002  (4 years) Lead test team on the Enfish Tracker project. Software QA Lead Enfish Corp 1998  –  2002  (4 years) Lead test team on the Enfish Tracker project. Languages English English English Skills monkey juggling Perl Linux Agile Methodologies Apache Scalability Software Development Continuous Integration C++ Distributed Systems Shell Scripting Testing Quality Assurance SQL Red Hat Linux Software Quality... Agile Project Management Software Engineering Unix Open Source Scrum Hadoop Ruby Software Design REST Python Architecture Web Applications Subversion System Architecture Big Data Git Web Services MapReduce Mobile Applications Java See 21+     See less Skills  monkey juggling Perl Linux Agile Methodologies Apache Scalability Software Development Continuous Integration C++ Distributed Systems Shell Scripting Testing Quality Assurance SQL Red Hat Linux Software Quality... Agile Project Management Software Engineering Unix Open Source Scrum Hadoop Ruby Software Design REST Python Architecture Web Applications Subversion System Architecture Big Data Git Web Services MapReduce Mobile Applications Java See 21+     See less monkey juggling Perl Linux Agile Methodologies Apache Scalability Software Development Continuous Integration C++ Distributed Systems Shell Scripting Testing Quality Assurance SQL Red Hat Linux Software Quality... Agile Project Management Software Engineering Unix Open Source Scrum Hadoop Ruby Software Design REST Python Architecture Web Applications Subversion System Architecture Big Data Git Web Services MapReduce Mobile Applications Java See 21+     See less monkey juggling Perl Linux Agile Methodologies Apache Scalability Software Development Continuous Integration C++ Distributed Systems Shell Scripting Testing Quality Assurance SQL Red Hat Linux Software Quality... Agile Project Management Software Engineering Unix Open Source Scrum Hadoop Ruby Software Design REST Python Architecture Web Applications Subversion System Architecture Big Data Git Web Services MapReduce Mobile Applications Java See 21+     See less Education University of California, Los Angeles BS,  Chemical Engineering 1990  – 1995 Activities and Societies:  Engima\nDaily Bruin University of California, Los Angeles BS,  Chemical Engineering 1990  – 1995 Activities and Societies:  Engima\nDaily Bruin University of California, Los Angeles BS,  Chemical Engineering 1990  – 1995 Activities and Societies:  Engima\nDaily Bruin University of California, Los Angeles BS,  Chemical Engineering 1990  – 1995 Activities and Societies:  Engima\nDaily Bruin ", "Summary - Strong communication skills, being able to convey intent and detail effectively through both written and verbal communiqué.  \n- Adaptable to changing workloads and quick to learn new tools as well as incorporating them. \n- Work well in groups, maintaining good relations with various departments and teams. \n- A keen and critical eye for identifying product problems and ensuring customer satisfaction. Summary - Strong communication skills, being able to convey intent and detail effectively through both written and verbal communiqué.  \n- Adaptable to changing workloads and quick to learn new tools as well as incorporating them. \n- Work well in groups, maintaining good relations with various departments and teams. \n- A keen and critical eye for identifying product problems and ensuring customer satisfaction. - Strong communication skills, being able to convey intent and detail effectively through both written and verbal communiqué.  \n- Adaptable to changing workloads and quick to learn new tools as well as incorporating them. \n- Work well in groups, maintaining good relations with various departments and teams. \n- A keen and critical eye for identifying product problems and ensuring customer satisfaction. - Strong communication skills, being able to convey intent and detail effectively through both written and verbal communiqué.  \n- Adaptable to changing workloads and quick to learn new tools as well as incorporating them. \n- Work well in groups, maintaining good relations with various departments and teams. \n- A keen and critical eye for identifying product problems and ensuring customer satisfaction. Experience Senior QA Lead Monarc Gaming Labs December 2014  – Present (9 months) QA Manager Perfect World Entertainment, Inc. June 2014  – Present (1 year 3 months) Redwood City QA Lead Perfect World Entertainment, Inc. August 2013  –  June 2014  (11 months) Redwood City, CA QA Engineer III Zynga 2012  –  August 2013  (1 year) San Francisco Bay Area Billing Representative Perfect World Entertainment, Inc. 2010  –  2012  (2 years) Redwood City, CA Communicated directly with customers through user-submitted tickets and billing hotline phone calls. \nResearched ticket trends to help create pre-emptive solutions for common and current issues. Customer Service Representative AT&T Mobility December 2009  –  June 2010  (7 months) Harrisburg, Pennsylvania Area Answered calls from AT&T’s wide userbase of over 87 million customers, utilizing top-grade customer service skills to resolve customer issues while maintaining their account fidelity and privacy QA Tester Xfire April 2009  –  August 2009  (5 months) Palo Alto, CA Tracked end-user reports of errors with the Xfire client, following the issue through error reporting, developer bug fixing and forum-based announcement of the problem’s solution. QA Tester - Pogo Electronic Arts November 2008  –  January 2009  (3 months) Redwood Shores, CA Balanced priorities between multiple projects and teams at the same time, budgeting daily work time to ensure that all assignments were completed in the most optimized time possible. IT Specialist Yahoo August 2007  –  November 2008  (1 year 4 months) Served as frontline support, greeting Yahoo employees both in person and over the phone while diagnosing their problems and issues in a friendly and timely manner. QA Tester Sony Computer Entertainment of America (SCEA) March 2005  –  August 2007  (2 years 6 months) Tested titles in 1-week cycles with changing teams using varying platforms. QA Tester Nelson Staffing Solutions 2003  –  2007  (4 years) QA Tester Namco Bandai Games America 2004  –  2005  (1 year) San Jose, CA QA Tester Electronic Arts 2003  –  2004  (1 year) Redwood Shores, CA Senior QA Lead Monarc Gaming Labs December 2014  – Present (9 months) Senior QA Lead Monarc Gaming Labs December 2014  – Present (9 months) QA Manager Perfect World Entertainment, Inc. June 2014  – Present (1 year 3 months) Redwood City QA Manager Perfect World Entertainment, Inc. June 2014  – Present (1 year 3 months) Redwood City QA Lead Perfect World Entertainment, Inc. August 2013  –  June 2014  (11 months) Redwood City, CA QA Lead Perfect World Entertainment, Inc. August 2013  –  June 2014  (11 months) Redwood City, CA QA Engineer III Zynga 2012  –  August 2013  (1 year) San Francisco Bay Area QA Engineer III Zynga 2012  –  August 2013  (1 year) San Francisco Bay Area Billing Representative Perfect World Entertainment, Inc. 2010  –  2012  (2 years) Redwood City, CA Communicated directly with customers through user-submitted tickets and billing hotline phone calls. \nResearched ticket trends to help create pre-emptive solutions for common and current issues. Billing Representative Perfect World Entertainment, Inc. 2010  –  2012  (2 years) Redwood City, CA Communicated directly with customers through user-submitted tickets and billing hotline phone calls. \nResearched ticket trends to help create pre-emptive solutions for common and current issues. Customer Service Representative AT&T Mobility December 2009  –  June 2010  (7 months) Harrisburg, Pennsylvania Area Answered calls from AT&T’s wide userbase of over 87 million customers, utilizing top-grade customer service skills to resolve customer issues while maintaining their account fidelity and privacy Customer Service Representative AT&T Mobility December 2009  –  June 2010  (7 months) Harrisburg, Pennsylvania Area Answered calls from AT&T’s wide userbase of over 87 million customers, utilizing top-grade customer service skills to resolve customer issues while maintaining their account fidelity and privacy QA Tester Xfire April 2009  –  August 2009  (5 months) Palo Alto, CA Tracked end-user reports of errors with the Xfire client, following the issue through error reporting, developer bug fixing and forum-based announcement of the problem’s solution. QA Tester Xfire April 2009  –  August 2009  (5 months) Palo Alto, CA Tracked end-user reports of errors with the Xfire client, following the issue through error reporting, developer bug fixing and forum-based announcement of the problem’s solution. QA Tester - Pogo Electronic Arts November 2008  –  January 2009  (3 months) Redwood Shores, CA Balanced priorities between multiple projects and teams at the same time, budgeting daily work time to ensure that all assignments were completed in the most optimized time possible. QA Tester - Pogo Electronic Arts November 2008  –  January 2009  (3 months) Redwood Shores, CA Balanced priorities between multiple projects and teams at the same time, budgeting daily work time to ensure that all assignments were completed in the most optimized time possible. IT Specialist Yahoo August 2007  –  November 2008  (1 year 4 months) Served as frontline support, greeting Yahoo employees both in person and over the phone while diagnosing their problems and issues in a friendly and timely manner. IT Specialist Yahoo August 2007  –  November 2008  (1 year 4 months) Served as frontline support, greeting Yahoo employees both in person and over the phone while diagnosing their problems and issues in a friendly and timely manner. QA Tester Sony Computer Entertainment of America (SCEA) March 2005  –  August 2007  (2 years 6 months) Tested titles in 1-week cycles with changing teams using varying platforms. QA Tester Sony Computer Entertainment of America (SCEA) March 2005  –  August 2007  (2 years 6 months) Tested titles in 1-week cycles with changing teams using varying platforms. QA Tester Nelson Staffing Solutions 2003  –  2007  (4 years) QA Tester Nelson Staffing Solutions 2003  –  2007  (4 years) QA Tester Namco Bandai Games America 2004  –  2005  (1 year) San Jose, CA QA Tester Namco Bandai Games America 2004  –  2005  (1 year) San Jose, CA QA Tester Electronic Arts 2003  –  2004  (1 year) Redwood Shores, CA QA Tester Electronic Arts 2003  –  2004  (1 year) Redwood Shores, CA Languages   Skills JIRA Software Quality... Video Games Test Planning Quality Assurance Game Development Game Design Microsoft Office Agile Methodologies Bug Tracking Test Management Test Cases Scrum Risk Management Bilingual Mobile Games Perforce Computer Games See 3+     See less Skills  JIRA Software Quality... Video Games Test Planning Quality Assurance Game Development Game Design Microsoft Office Agile Methodologies Bug Tracking Test Management Test Cases Scrum Risk Management Bilingual Mobile Games Perforce Computer Games See 3+     See less JIRA Software Quality... Video Games Test Planning Quality Assurance Game Development Game Design Microsoft Office Agile Methodologies Bug Tracking Test Management Test Cases Scrum Risk Management Bilingual Mobile Games Perforce Computer Games See 3+     See less JIRA Software Quality... Video Games Test Planning Quality Assurance Game Development Game Design Microsoft Office Agile Methodologies Bug Tracking Test Management Test Cases Scrum Risk Management Bilingual Mobile Games Perforce Computer Games See 3+     See less Honors & Awards ", "Summary Dynamic Internationalization & Localization Expert with 15+ years industry experience in Globalization development and testing of Internet products: 5 years at Netscape, 3 years at AOL, 1 year at Ebay & 7 years at Yahoo. Proven ability to set and adjust short and long-term goals for multiple teams; prioritize projects and tasks, manage resources (productivity and budgets) with a consistent, predictable outcome: projects are completed on time, within resource and budget constraints. Proficient in driving international product requirements and standards across multiple product groups, balancing customer and business needs. Developed and managing QE teams from the ground-up, both regionally & overseas; with managers and leads on multiple, parallel projects focusing on product quality, and efficiency to support world’s largest Internet audience for Yahoo! Desktop and Mobile applications; Experience with vendor management, streamlining Internationalization and localization testing processes and automation tools, tracking and reporting on reducing time to market, increasing localization quality and reducing costs. Metrics and ROI driven. Built an effective, reliable and efficient working environment with highest Employee Survey Satisfaction with lowest attrition rate in the company. \n \n• Trilingual French/Russian/English. Specialties:Developing & managing global organizations, Internationalization and localization standards, testing, Open Source Software testing tools, QE/CM/release organization creation/growth, Process & tools improvement, Vendor management and outsourcing;management Summary Dynamic Internationalization & Localization Expert with 15+ years industry experience in Globalization development and testing of Internet products: 5 years at Netscape, 3 years at AOL, 1 year at Ebay & 7 years at Yahoo. Proven ability to set and adjust short and long-term goals for multiple teams; prioritize projects and tasks, manage resources (productivity and budgets) with a consistent, predictable outcome: projects are completed on time, within resource and budget constraints. Proficient in driving international product requirements and standards across multiple product groups, balancing customer and business needs. Developed and managing QE teams from the ground-up, both regionally & overseas; with managers and leads on multiple, parallel projects focusing on product quality, and efficiency to support world’s largest Internet audience for Yahoo! Desktop and Mobile applications; Experience with vendor management, streamlining Internationalization and localization testing processes and automation tools, tracking and reporting on reducing time to market, increasing localization quality and reducing costs. Metrics and ROI driven. Built an effective, reliable and efficient working environment with highest Employee Survey Satisfaction with lowest attrition rate in the company. \n \n• Trilingual French/Russian/English. Specialties:Developing & managing global organizations, Internationalization and localization standards, testing, Open Source Software testing tools, QE/CM/release organization creation/growth, Process & tools improvement, Vendor management and outsourcing;management Dynamic Internationalization & Localization Expert with 15+ years industry experience in Globalization development and testing of Internet products: 5 years at Netscape, 3 years at AOL, 1 year at Ebay & 7 years at Yahoo. Proven ability to set and adjust short and long-term goals for multiple teams; prioritize projects and tasks, manage resources (productivity and budgets) with a consistent, predictable outcome: projects are completed on time, within resource and budget constraints. Proficient in driving international product requirements and standards across multiple product groups, balancing customer and business needs. Developed and managing QE teams from the ground-up, both regionally & overseas; with managers and leads on multiple, parallel projects focusing on product quality, and efficiency to support world’s largest Internet audience for Yahoo! Desktop and Mobile applications; Experience with vendor management, streamlining Internationalization and localization testing processes and automation tools, tracking and reporting on reducing time to market, increasing localization quality and reducing costs. Metrics and ROI driven. Built an effective, reliable and efficient working environment with highest Employee Survey Satisfaction with lowest attrition rate in the company. \n \n• Trilingual French/Russian/English. Specialties:Developing & managing global organizations, Internationalization and localization standards, testing, Open Source Software testing tools, QE/CM/release organization creation/growth, Process & tools improvement, Vendor management and outsourcing;management Dynamic Internationalization & Localization Expert with 15+ years industry experience in Globalization development and testing of Internet products: 5 years at Netscape, 3 years at AOL, 1 year at Ebay & 7 years at Yahoo. Proven ability to set and adjust short and long-term goals for multiple teams; prioritize projects and tasks, manage resources (productivity and budgets) with a consistent, predictable outcome: projects are completed on time, within resource and budget constraints. Proficient in driving international product requirements and standards across multiple product groups, balancing customer and business needs. Developed and managing QE teams from the ground-up, both regionally & overseas; with managers and leads on multiple, parallel projects focusing on product quality, and efficiency to support world’s largest Internet audience for Yahoo! Desktop and Mobile applications; Experience with vendor management, streamlining Internationalization and localization testing processes and automation tools, tracking and reporting on reducing time to market, increasing localization quality and reducing costs. Metrics and ROI driven. Built an effective, reliable and efficient working environment with highest Employee Survey Satisfaction with lowest attrition rate in the company. \n \n• Trilingual French/Russian/English. Specialties:Developing & managing global organizations, Internationalization and localization standards, testing, Open Source Software testing tools, QE/CM/release organization creation/growth, Process & tools improvement, Vendor management and outsourcing;management Experience Director, Localization services Yahoo July 2015  – Present (2 months) Director, Globalization Testing Yahoo October 2013  – Present (1 year 11 months) Senior QE Manager, Internationalization and Localization expert Yahoo! inc. October 2006  –  September 2013  (7 years) San Francisco Bay Area Internationalization QA architect Yahoo! April 2009  –  September 2009  (6 months) Running Global ready program, designing internationalization QA processes, globalization testing, internationalization training, automation tools, localization outsourcing Internationalization/Localization QA manager Yahoo! June 2004  –  October 2007  (3 years 5 months) managing team of 10 QA engineers Sr. I18n QA engineer AOL 1999  –  2004  (5 years) Internationalization qa/QA lead Netscape Communications, Inc April 1996  –  June 1999  (3 years 3 months) Director, Localization services Yahoo July 2015  – Present (2 months) Director, Localization services Yahoo July 2015  – Present (2 months) Director, Globalization Testing Yahoo October 2013  – Present (1 year 11 months) Director, Globalization Testing Yahoo October 2013  – Present (1 year 11 months) Senior QE Manager, Internationalization and Localization expert Yahoo! inc. October 2006  –  September 2013  (7 years) San Francisco Bay Area Senior QE Manager, Internationalization and Localization expert Yahoo! inc. October 2006  –  September 2013  (7 years) San Francisco Bay Area Internationalization QA architect Yahoo! April 2009  –  September 2009  (6 months) Running Global ready program, designing internationalization QA processes, globalization testing, internationalization training, automation tools, localization outsourcing Internationalization QA architect Yahoo! April 2009  –  September 2009  (6 months) Running Global ready program, designing internationalization QA processes, globalization testing, internationalization training, automation tools, localization outsourcing Internationalization/Localization QA manager Yahoo! June 2004  –  October 2007  (3 years 5 months) managing team of 10 QA engineers Internationalization/Localization QA manager Yahoo! June 2004  –  October 2007  (3 years 5 months) managing team of 10 QA engineers Sr. I18n QA engineer AOL 1999  –  2004  (5 years) Sr. I18n QA engineer AOL 1999  –  2004  (5 years) Internationalization qa/QA lead Netscape Communications, Inc April 1996  –  June 1999  (3 years 3 months) Internationalization qa/QA lead Netscape Communications, Inc April 1996  –  June 1999  (3 years 3 months) Skills Internationalization Localization Globalization Quality Assurance Testing L10n Localization Testing Website Localization I18n Software Quality... Agile Methodologies Scrum Selenium Mobile Devices Translation Bugzilla Software Project... Product Management Japanese XML Vendor Management Terminology Multilingual Software Engineering Outsourcing Mobile Applications Agile Project Management Test Automation Scalability JIRA Linguistics Bug Tracking Manuals See 18+     See less Skills  Internationalization Localization Globalization Quality Assurance Testing L10n Localization Testing Website Localization I18n Software Quality... Agile Methodologies Scrum Selenium Mobile Devices Translation Bugzilla Software Project... Product Management Japanese XML Vendor Management Terminology Multilingual Software Engineering Outsourcing Mobile Applications Agile Project Management Test Automation Scalability JIRA Linguistics Bug Tracking Manuals See 18+     See less Internationalization Localization Globalization Quality Assurance Testing L10n Localization Testing Website Localization I18n Software Quality... Agile Methodologies Scrum Selenium Mobile Devices Translation Bugzilla Software Project... Product Management Japanese XML Vendor Management Terminology Multilingual Software Engineering Outsourcing Mobile Applications Agile Project Management Test Automation Scalability JIRA Linguistics Bug Tracking Manuals See 18+     See less Internationalization Localization Globalization Quality Assurance Testing L10n Localization Testing Website Localization I18n Software Quality... Agile Methodologies Scrum Selenium Mobile Devices Translation Bugzilla Software Project... Product Management Japanese XML Vendor Management Terminology Multilingual Software Engineering Outsourcing Mobile Applications Agile Project Management Test Automation Scalability JIRA Linguistics Bug Tracking Manuals See 18+     See less Education Santa Clara University MA in counseling psychology 2005  – 2009 Saint Petersburg State University MA in computational linguistics 1983  – 1989 Santa Clara University MA in counseling psychology 2005  – 2009 Santa Clara University MA in counseling psychology 2005  – 2009 Santa Clara University MA in counseling psychology 2005  – 2009 Saint Petersburg State University MA in computational linguistics 1983  – 1989 Saint Petersburg State University MA in computational linguistics 1983  – 1989 Saint Petersburg State University MA in computational linguistics 1983  – 1989 ", "Summary Accomplished SQA professional with over 18 years driving success at top high-tech companies. Proven expertise with complete software development cycle and strategies to create quality products for an expanding customer base. Results-oriented and self-motivated team leader with solid experience from enterprise-level deployments to quality edutainment titles. Comprehensive technical talents to design and initiate customized solutions that continually improve organizational effectiveness and support changing business needs \n \nSpecialties: Mobile Software, Wireless, Mobile Data Access, PalmOS, PocketPC, RIM, Symbian, iOS, Android OS, HTML, DHTML, JavaScript, HTTP, Browser Compatibility, Quality Assurance, Selenium, Black and White box testing, Device Anywhere, Agile, Certified ScrumMaster Summary Accomplished SQA professional with over 18 years driving success at top high-tech companies. Proven expertise with complete software development cycle and strategies to create quality products for an expanding customer base. Results-oriented and self-motivated team leader with solid experience from enterprise-level deployments to quality edutainment titles. Comprehensive technical talents to design and initiate customized solutions that continually improve organizational effectiveness and support changing business needs \n \nSpecialties: Mobile Software, Wireless, Mobile Data Access, PalmOS, PocketPC, RIM, Symbian, iOS, Android OS, HTML, DHTML, JavaScript, HTTP, Browser Compatibility, Quality Assurance, Selenium, Black and White box testing, Device Anywhere, Agile, Certified ScrumMaster Accomplished SQA professional with over 18 years driving success at top high-tech companies. Proven expertise with complete software development cycle and strategies to create quality products for an expanding customer base. Results-oriented and self-motivated team leader with solid experience from enterprise-level deployments to quality edutainment titles. Comprehensive technical talents to design and initiate customized solutions that continually improve organizational effectiveness and support changing business needs \n \nSpecialties: Mobile Software, Wireless, Mobile Data Access, PalmOS, PocketPC, RIM, Symbian, iOS, Android OS, HTML, DHTML, JavaScript, HTTP, Browser Compatibility, Quality Assurance, Selenium, Black and White box testing, Device Anywhere, Agile, Certified ScrumMaster Accomplished SQA professional with over 18 years driving success at top high-tech companies. Proven expertise with complete software development cycle and strategies to create quality products for an expanding customer base. Results-oriented and self-motivated team leader with solid experience from enterprise-level deployments to quality edutainment titles. Comprehensive technical talents to design and initiate customized solutions that continually improve organizational effectiveness and support changing business needs \n \nSpecialties: Mobile Software, Wireless, Mobile Data Access, PalmOS, PocketPC, RIM, Symbian, iOS, Android OS, HTML, DHTML, JavaScript, HTTP, Browser Compatibility, Quality Assurance, Selenium, Black and White box testing, Device Anywhere, Agile, Certified ScrumMaster Languages Spanish Spanish Spanish Skills Scrum Quality Assurance Web Testing Exploratory Testing End-to-end Testing Test Estimation Website Testing Compatibility Testing Localization Testing Test Tools Mobile Payments Mobile Banking Windows Mobile iPhone Blackberry Smartphones iLife iWork Aperture Parallels BBEdit Navicat Mac OS X Android Test Management Defect Tracking Test Cases Mobile Applications Mobile Devices Agile Methodologies SDLC Selenium JIRA Testing User Acceptance Testing Test Planning Software Quality... Testing Tools XML OS X Bug Tracking Regression Testing Black Box Testing Enterprise Software Usability Testing Agile Testing Agile Project Management Manual Testing Release Management Mobile Testing See 35+     See less Skills  Scrum Quality Assurance Web Testing Exploratory Testing End-to-end Testing Test Estimation Website Testing Compatibility Testing Localization Testing Test Tools Mobile Payments Mobile Banking Windows Mobile iPhone Blackberry Smartphones iLife iWork Aperture Parallels BBEdit Navicat Mac OS X Android Test Management Defect Tracking Test Cases Mobile Applications Mobile Devices Agile Methodologies SDLC Selenium JIRA Testing User Acceptance Testing Test Planning Software Quality... Testing Tools XML OS X Bug Tracking Regression Testing Black Box Testing Enterprise Software Usability Testing Agile Testing Agile Project Management Manual Testing Release Management Mobile Testing See 35+     See less Scrum Quality Assurance Web Testing Exploratory Testing End-to-end Testing Test Estimation Website Testing Compatibility Testing Localization Testing Test Tools Mobile Payments Mobile Banking Windows Mobile iPhone Blackberry Smartphones iLife iWork Aperture Parallels BBEdit Navicat Mac OS X Android Test Management Defect Tracking Test Cases Mobile Applications Mobile Devices Agile Methodologies SDLC Selenium JIRA Testing User Acceptance Testing Test Planning Software Quality... Testing Tools XML OS X Bug Tracking Regression Testing Black Box Testing Enterprise Software Usability Testing Agile Testing Agile Project Management Manual Testing Release Management Mobile Testing See 35+     See less Scrum Quality Assurance Web Testing Exploratory Testing End-to-end Testing Test Estimation Website Testing Compatibility Testing Localization Testing Test Tools Mobile Payments Mobile Banking Windows Mobile iPhone Blackberry Smartphones iLife iWork Aperture Parallels BBEdit Navicat Mac OS X Android Test Management Defect Tracking Test Cases Mobile Applications Mobile Devices Agile Methodologies SDLC Selenium JIRA Testing User Acceptance Testing Test Planning Software Quality... Testing Tools XML OS X Bug Tracking Regression Testing Black Box Testing Enterprise Software Usability Testing Agile Testing Agile Project Management Manual Testing Release Management Mobile Testing See 35+     See less ", "Skills Agile Methodologies Test Automation Scrum Selenium Perl Scalability Hadoop Distributed Systems Java Software Quality... Linux Continuous Integration Software Development Unix Software Engineering Python REST Test Planning Web Services Cloud Computing See 5+     See less Skills  Agile Methodologies Test Automation Scrum Selenium Perl Scalability Hadoop Distributed Systems Java Software Quality... Linux Continuous Integration Software Development Unix Software Engineering Python REST Test Planning Web Services Cloud Computing See 5+     See less Agile Methodologies Test Automation Scrum Selenium Perl Scalability Hadoop Distributed Systems Java Software Quality... Linux Continuous Integration Software Development Unix Software Engineering Python REST Test Planning Web Services Cloud Computing See 5+     See less Agile Methodologies Test Automation Scrum Selenium Perl Scalability Hadoop Distributed Systems Java Software Quality... Linux Continuous Integration Software Development Unix Software Engineering Python REST Test Planning Web Services Cloud Computing See 5+     See less ", "Summary work with passion and professional. Summary work with passion and professional. work with passion and professional. work with passion and professional. Experience QA Lead LinkedIn May 2015  – Present (4 months) Beijing City, China SQA Amazon Lab126 June 2014  –  May 2015  (1 year) Beijing City, China Senior QA App Annie November 2013  –  May 2014  (7 months) Beijing City, China Senior Automation Engineer/QA Lead Zynga July 2012  –  November 2013  (1 year 5 months) Beijing QE Yahoo! Beijing R&D Center April 2010  –  July 2012  (2 years 4 months) Beijing QA Lead LinkedIn May 2015  – Present (4 months) Beijing City, China QA Lead LinkedIn May 2015  – Present (4 months) Beijing City, China SQA Amazon Lab126 June 2014  –  May 2015  (1 year) Beijing City, China SQA Amazon Lab126 June 2014  –  May 2015  (1 year) Beijing City, China Senior QA App Annie November 2013  –  May 2014  (7 months) Beijing City, China Senior QA App Annie November 2013  –  May 2014  (7 months) Beijing City, China Senior Automation Engineer/QA Lead Zynga July 2012  –  November 2013  (1 year 5 months) Beijing Senior Automation Engineer/QA Lead Zynga July 2012  –  November 2013  (1 year 5 months) Beijing QE Yahoo! Beijing R&D Center April 2010  –  July 2012  (2 years 4 months) Beijing QE Yahoo! Beijing R&D Center April 2010  –  July 2012  (2 years 4 months) Beijing Languages English English English Skills Software Quality... Scrum Agile Methodologies Python Perl Test Planning Distributed Systems Test Automation C++ Testing Scalability Skills  Software Quality... Scrum Agile Methodologies Python Perl Test Planning Distributed Systems Test Automation C++ Testing Scalability Software Quality... Scrum Agile Methodologies Python Perl Test Planning Distributed Systems Test Automation C++ Testing Scalability Software Quality... Scrum Agile Methodologies Python Perl Test Planning Distributed Systems Test Automation C++ Testing Scalability Education Beijing Technology and Business University Bachelor's degree,  Electrical and Electronics Engineering 2001  – 2005 As a student at that collage. Beijing Technology and Business University Bachelor's degree,  Electrical and Electronics Engineering 2001  – 2005 As a student at that collage. Beijing Technology and Business University Bachelor's degree,  Electrical and Electronics Engineering 2001  – 2005 As a student at that collage. Beijing Technology and Business University Bachelor's degree,  Electrical and Electronics Engineering 2001  – 2005 As a student at that collage. ", "Skills Agile Methodologies Software Quality... Test Automation JIRA QTP Software Development Test Planning Quality Assurance Manual Testing Testing XML Regression Testing Scrum Performance Testing Quality Center Selenium See 1+     See less Skills  Agile Methodologies Software Quality... Test Automation JIRA QTP Software Development Test Planning Quality Assurance Manual Testing Testing XML Regression Testing Scrum Performance Testing Quality Center Selenium See 1+     See less Agile Methodologies Software Quality... Test Automation JIRA QTP Software Development Test Planning Quality Assurance Manual Testing Testing XML Regression Testing Scrum Performance Testing Quality Center Selenium See 1+     See less Agile Methodologies Software Quality... Test Automation JIRA QTP Software Development Test Planning Quality Assurance Manual Testing Testing XML Regression Testing Scrum Performance Testing Quality Center Selenium See 1+     See less ", "Skills Cloud Computing Distributed Systems Linux Clustering Parallel Computing Unix Operating Systems Agile Methodologies Quality Assurance Test Automation Test Planning Test Automation... Scalability Perl Unix Shell Scripting Hadoop Mobile Applications Shell Scripting Software Engineering System Testing Linux Software Development Scrum Unix See 7+     See less Skills  Cloud Computing Distributed Systems Linux Clustering Parallel Computing Unix Operating Systems Agile Methodologies Quality Assurance Test Automation Test Planning Test Automation... Scalability Perl Unix Shell Scripting Hadoop Mobile Applications Shell Scripting Software Engineering System Testing Linux Software Development Scrum Unix See 7+     See less Cloud Computing Distributed Systems Linux Clustering Parallel Computing Unix Operating Systems Agile Methodologies Quality Assurance Test Automation Test Planning Test Automation... Scalability Perl Unix Shell Scripting Hadoop Mobile Applications Shell Scripting Software Engineering System Testing Linux Software Development Scrum Unix See 7+     See less Cloud Computing Distributed Systems Linux Clustering Parallel Computing Unix Operating Systems Agile Methodologies Quality Assurance Test Automation Test Planning Test Automation... Scalability Perl Unix Shell Scripting Hadoop Mobile Applications Shell Scripting Software Engineering System Testing Linux Software Development Scrum Unix See 7+     See less ", "Summary Software Quality Assurance Engineer \n \n- 10 years of experience in Software Quality Engineering \n- Self-starter with strong analytical and problem solving skills \n- Work independently and in cross-functional teams \n- Highly motivated, detail oriented, and passionate about Quality \n- Proven track record of excellent test management skills including on-time delivery and successful launching of software products \n- Simultaneously managing multiple company-wide projects \n- Coordinate test effort across different projects/teams \n \n- Experienced in Mobile IOS/Android testing \n- Experienced in Globalization (G11n), Internationalization (i18n) and Localization (L10n) Testing \n- Experienced in Performance and scalability Testing (JMeter/NeoLoad)  \n- Experienced in Web front end automation (Java/TestNg/Selenium/QPT) \n- Lead multiple Yahoo web and mobile projects \n- 4 years of experiences in leading oversea testers to deliver multiple releases and build up automation framework \n- Experienced in Agile/Scrum/Sprint software development methodologies and work with people globally. Summary Software Quality Assurance Engineer \n \n- 10 years of experience in Software Quality Engineering \n- Self-starter with strong analytical and problem solving skills \n- Work independently and in cross-functional teams \n- Highly motivated, detail oriented, and passionate about Quality \n- Proven track record of excellent test management skills including on-time delivery and successful launching of software products \n- Simultaneously managing multiple company-wide projects \n- Coordinate test effort across different projects/teams \n \n- Experienced in Mobile IOS/Android testing \n- Experienced in Globalization (G11n), Internationalization (i18n) and Localization (L10n) Testing \n- Experienced in Performance and scalability Testing (JMeter/NeoLoad)  \n- Experienced in Web front end automation (Java/TestNg/Selenium/QPT) \n- Lead multiple Yahoo web and mobile projects \n- 4 years of experiences in leading oversea testers to deliver multiple releases and build up automation framework \n- Experienced in Agile/Scrum/Sprint software development methodologies and work with people globally. Software Quality Assurance Engineer \n \n- 10 years of experience in Software Quality Engineering \n- Self-starter with strong analytical and problem solving skills \n- Work independently and in cross-functional teams \n- Highly motivated, detail oriented, and passionate about Quality \n- Proven track record of excellent test management skills including on-time delivery and successful launching of software products \n- Simultaneously managing multiple company-wide projects \n- Coordinate test effort across different projects/teams \n \n- Experienced in Mobile IOS/Android testing \n- Experienced in Globalization (G11n), Internationalization (i18n) and Localization (L10n) Testing \n- Experienced in Performance and scalability Testing (JMeter/NeoLoad)  \n- Experienced in Web front end automation (Java/TestNg/Selenium/QPT) \n- Lead multiple Yahoo web and mobile projects \n- 4 years of experiences in leading oversea testers to deliver multiple releases and build up automation framework \n- Experienced in Agile/Scrum/Sprint software development methodologies and work with people globally. Software Quality Assurance Engineer \n \n- 10 years of experience in Software Quality Engineering \n- Self-starter with strong analytical and problem solving skills \n- Work independently and in cross-functional teams \n- Highly motivated, detail oriented, and passionate about Quality \n- Proven track record of excellent test management skills including on-time delivery and successful launching of software products \n- Simultaneously managing multiple company-wide projects \n- Coordinate test effort across different projects/teams \n \n- Experienced in Mobile IOS/Android testing \n- Experienced in Globalization (G11n), Internationalization (i18n) and Localization (L10n) Testing \n- Experienced in Performance and scalability Testing (JMeter/NeoLoad)  \n- Experienced in Web front end automation (Java/TestNg/Selenium/QPT) \n- Lead multiple Yahoo web and mobile projects \n- 4 years of experiences in leading oversea testers to deliver multiple releases and build up automation framework \n- Experienced in Agile/Scrum/Sprint software development methodologies and work with people globally. Experience Mobile Quality Engineer Yahoo January 2014  – Present (1 year 8 months) United States - Lead Yahoo News Digest and Yahoo News testing effort for both IOS and Android platforms \n- Specialized on IOS and Android devices testing \n- Develop appropriate testing assignments and assess the performance of the software test engineers \n- Participate in testing as an individual contributor to establish and maintain expertise on all products \n- Participate in project meetings with product managers and development engineers as required. \n- Develop appropriate test methodology and metrics to define quality for products, components, features and enhancements. \n- Write product test documentation (test plans and test cases) based on product specifications \n- Develop appropriate functional, regression and system tests to assure product quality \n- Develop, modify and maintain a comprehensive suite of automated test cases for our product platform using open source test tools \n- Identify, communicate and follow-up with engineering on issues discovered during the test process \n- Participate in release deployments to the production environment and troubleshooting production issues \n- Experienced with UI automaiton G11N QA Lead Yahoo! June 2010  –  December 2013  (3 years 7 months) Sunnyvale, CA • Lead the QE offshore team in continuous releases of different Yahoo! products across different platforms: Contacts, Advertising, Mobile Search, Mobile Yahoo News, Rich Media Exchange \n• Manage offshore team in China \n• Create test plan and checklist for each release; triage bugs on a daily basis and consolidate issues from different intls. \n• Work with developer, project manager, developer manager for project planning and identify issues. \n• Work with automation team for intl automation execution and analysis which includes smoke test and acceptance test. \n• Work closely with intl project managers across different countries. \n• Work closely with developer team and localization project managers in on-going basis to ensure all issues are escalated QA Engineer Rearden Commerce April 2007  –  June 2010  (3 years 3 months) Foster City, CA • Automated/Maintained/Executed test cases/test suites using Java Fitnesse framework. Test suites include seed data suite, BAT suite, regression suite, project new feature suite. \n• Performed black and grey box testing for Dashboards projects that were used by administrators to configure various aspects of the Rearden Personal Assistant from global scale to company specific which included management tier, multi clusters, global level, partner level, domain level and user level. \n• Developed test plan and test cases. \n• Worked closely with developers and project managers. \n• Analyzed failures and reported in the JIRA bug tracking system. Performance Engineer Rearden Commerce November 2008  –  August 2009  (10 months) Foster City, CA • Developed DIFF tool for comparing historical results for each release. \n• Documented performance testing needs for each project release. \n• Identified gaps in the performance tests based on the addition of the new feature functionality. Identified related areas to regress \n• Understand and document all configurable parameters for the new feature; planed for test cases that cover the different configuration options. \n• Attended all release meetings and kept everyone aware of performance tests/regressions \n• Executed performance test results post integration \n• Kept track of the bugs from performance testing and reduced performance bugs backlog. \n \n \nEnvironment: Java, WinXP, Linux, PHP, MySQL, Perforce, XShell, GIT, R Performance QA Rearden Commerce (formerly Talaris) April 2007  –  November 2008  (1 year 8 months) • Worked closely with the development team, other QA teams and sustaining teams to develop and apply customized performance strategies. \n• Effectively communicated performance testing methodologies and result analysis with internal and external teams and maintains schedules for assigned performance areas. \n• Created and executed NeoLoad Scripts based on the requirements. Setup the KPI/Baseline for each release and patch. \n• Analyzed the Performance reports and generate results/Metrics in the form of graphs to be presented to Management. \n• Analyzed server response under peak load to identify the server bottlenecks. \n• Performed constant evaluation of third party tools and new technologies to integrate solutions that are suitable for use within the corporate testing framework (such as QC and QTP, QC and Fitnesse, LoadRunner). Produce convincing demo to the whole software team before committing to the evaluation. \n• Performed Mobile Server performance testing using JMeter. Create Test Script using JUnit. Automated JMeter run using Ant build. \n• Created Seed Data script using Java Fitnesse. \n• Automated web application testing using QTP and Fitnesse. \n• Managed performance testing machines. Software Consultant Skillnet Solutions Inc., Sunnyvale, CA July 2004  –  April 2007  (2 years 10 months) Cupertino, CA • Worked as Data Migration Engineer for Saks Fifth Avenue, AOL and Lanier Direct. \n• Involved in BlueMartini Application and Database upgrade \n• Performed Data migration across Solaris, Linux and Windows platforms, and across Oracle, MS SQL database. \n• Reported and resolved issues during data migration process. \n• Performed data validation using db diff tool and SQL scripts. \n• Performed custom Data Migration for AOL custom schemas. \n• Created JDBC command line application for user management data loading. \n• Worked as QA Analyst for Saks Fifth Avenue, Canadian Tire, Gymboree, Hot Topic Inc \n• Developed Test Plan\\Test Cases for functional, error, user interface, regression and scenario-base \n• Reported and documented defects using Test Director, Jira, Bugzilla. \n• Executed SQL queries for grey-box testing. \n• Worked as UI Prototype Engineer for ProUnlimited \n• Created UI prototypes in HTML, CSS and JavaScript. Application was cross platform compatible (PC/IE/Fire fox, Mac/IE/Safari/Safari). \n• Worked with UI Designer to create functional prototypes based on their specifications. \n• Coordinated with offshore developers. \n• Worked as BlueMartini Consultant for IKON \n• Developed JSP, Business Action classes, Business Objects, Validation classes, DNA configure files. Created and maintained Wish List functionalities. \n• Backup and Restore Databases. \n• Resolved defects and performed QA testing. Debugged Java code and analyze different kind of log files to trace problem. QA Engineer BlueMartini Software Inc July 2003  –  July 2004  (1 year 1 month) • Completed whole testing life cycle for Business Intelligence (data mining and reporting). \n• Created test plans, test cases/scripts, defect reports for multiple products \n• Executed black box and grey box tests which included functional, regression, scenario-based, upgrade, and I18n/L10n testing. \n• Installed Blue Martini products and third party software, including WebLogic, WebSphere, JDK, and Hummingbird SearchServer on different platforms, such as Windows 2000/SQL 2K, Solaris/Oracle, and AIX/DB2. \n• Created SQL queries for Report correctness testing on both SQL2k and Oracle. \n• Worked on Perl script to run daily builds and BlueMartini command line tools on multiple platforms. \n• Worked with Quick Test Professional 6.0 testing tool to perform functional and regression testing and VB script to store test results in MSSQL2k and TCMS. Mobile Quality Engineer Yahoo January 2014  – Present (1 year 8 months) United States - Lead Yahoo News Digest and Yahoo News testing effort for both IOS and Android platforms \n- Specialized on IOS and Android devices testing \n- Develop appropriate testing assignments and assess the performance of the software test engineers \n- Participate in testing as an individual contributor to establish and maintain expertise on all products \n- Participate in project meetings with product managers and development engineers as required. \n- Develop appropriate test methodology and metrics to define quality for products, components, features and enhancements. \n- Write product test documentation (test plans and test cases) based on product specifications \n- Develop appropriate functional, regression and system tests to assure product quality \n- Develop, modify and maintain a comprehensive suite of automated test cases for our product platform using open source test tools \n- Identify, communicate and follow-up with engineering on issues discovered during the test process \n- Participate in release deployments to the production environment and troubleshooting production issues \n- Experienced with UI automaiton Mobile Quality Engineer Yahoo January 2014  – Present (1 year 8 months) United States - Lead Yahoo News Digest and Yahoo News testing effort for both IOS and Android platforms \n- Specialized on IOS and Android devices testing \n- Develop appropriate testing assignments and assess the performance of the software test engineers \n- Participate in testing as an individual contributor to establish and maintain expertise on all products \n- Participate in project meetings with product managers and development engineers as required. \n- Develop appropriate test methodology and metrics to define quality for products, components, features and enhancements. \n- Write product test documentation (test plans and test cases) based on product specifications \n- Develop appropriate functional, regression and system tests to assure product quality \n- Develop, modify and maintain a comprehensive suite of automated test cases for our product platform using open source test tools \n- Identify, communicate and follow-up with engineering on issues discovered during the test process \n- Participate in release deployments to the production environment and troubleshooting production issues \n- Experienced with UI automaiton G11N QA Lead Yahoo! June 2010  –  December 2013  (3 years 7 months) Sunnyvale, CA • Lead the QE offshore team in continuous releases of different Yahoo! products across different platforms: Contacts, Advertising, Mobile Search, Mobile Yahoo News, Rich Media Exchange \n• Manage offshore team in China \n• Create test plan and checklist for each release; triage bugs on a daily basis and consolidate issues from different intls. \n• Work with developer, project manager, developer manager for project planning and identify issues. \n• Work with automation team for intl automation execution and analysis which includes smoke test and acceptance test. \n• Work closely with intl project managers across different countries. \n• Work closely with developer team and localization project managers in on-going basis to ensure all issues are escalated G11N QA Lead Yahoo! June 2010  –  December 2013  (3 years 7 months) Sunnyvale, CA • Lead the QE offshore team in continuous releases of different Yahoo! products across different platforms: Contacts, Advertising, Mobile Search, Mobile Yahoo News, Rich Media Exchange \n• Manage offshore team in China \n• Create test plan and checklist for each release; triage bugs on a daily basis and consolidate issues from different intls. \n• Work with developer, project manager, developer manager for project planning and identify issues. \n• Work with automation team for intl automation execution and analysis which includes smoke test and acceptance test. \n• Work closely with intl project managers across different countries. \n• Work closely with developer team and localization project managers in on-going basis to ensure all issues are escalated QA Engineer Rearden Commerce April 2007  –  June 2010  (3 years 3 months) Foster City, CA • Automated/Maintained/Executed test cases/test suites using Java Fitnesse framework. Test suites include seed data suite, BAT suite, regression suite, project new feature suite. \n• Performed black and grey box testing for Dashboards projects that were used by administrators to configure various aspects of the Rearden Personal Assistant from global scale to company specific which included management tier, multi clusters, global level, partner level, domain level and user level. \n• Developed test plan and test cases. \n• Worked closely with developers and project managers. \n• Analyzed failures and reported in the JIRA bug tracking system. QA Engineer Rearden Commerce April 2007  –  June 2010  (3 years 3 months) Foster City, CA • Automated/Maintained/Executed test cases/test suites using Java Fitnesse framework. Test suites include seed data suite, BAT suite, regression suite, project new feature suite. \n• Performed black and grey box testing for Dashboards projects that were used by administrators to configure various aspects of the Rearden Personal Assistant from global scale to company specific which included management tier, multi clusters, global level, partner level, domain level and user level. \n• Developed test plan and test cases. \n• Worked closely with developers and project managers. \n• Analyzed failures and reported in the JIRA bug tracking system. Performance Engineer Rearden Commerce November 2008  –  August 2009  (10 months) Foster City, CA • Developed DIFF tool for comparing historical results for each release. \n• Documented performance testing needs for each project release. \n• Identified gaps in the performance tests based on the addition of the new feature functionality. Identified related areas to regress \n• Understand and document all configurable parameters for the new feature; planed for test cases that cover the different configuration options. \n• Attended all release meetings and kept everyone aware of performance tests/regressions \n• Executed performance test results post integration \n• Kept track of the bugs from performance testing and reduced performance bugs backlog. \n \n \nEnvironment: Java, WinXP, Linux, PHP, MySQL, Perforce, XShell, GIT, R Performance Engineer Rearden Commerce November 2008  –  August 2009  (10 months) Foster City, CA • Developed DIFF tool for comparing historical results for each release. \n• Documented performance testing needs for each project release. \n• Identified gaps in the performance tests based on the addition of the new feature functionality. Identified related areas to regress \n• Understand and document all configurable parameters for the new feature; planed for test cases that cover the different configuration options. \n• Attended all release meetings and kept everyone aware of performance tests/regressions \n• Executed performance test results post integration \n• Kept track of the bugs from performance testing and reduced performance bugs backlog. \n \n \nEnvironment: Java, WinXP, Linux, PHP, MySQL, Perforce, XShell, GIT, R Performance QA Rearden Commerce (formerly Talaris) April 2007  –  November 2008  (1 year 8 months) • Worked closely with the development team, other QA teams and sustaining teams to develop and apply customized performance strategies. \n• Effectively communicated performance testing methodologies and result analysis with internal and external teams and maintains schedules for assigned performance areas. \n• Created and executed NeoLoad Scripts based on the requirements. Setup the KPI/Baseline for each release and patch. \n• Analyzed the Performance reports and generate results/Metrics in the form of graphs to be presented to Management. \n• Analyzed server response under peak load to identify the server bottlenecks. \n• Performed constant evaluation of third party tools and new technologies to integrate solutions that are suitable for use within the corporate testing framework (such as QC and QTP, QC and Fitnesse, LoadRunner). Produce convincing demo to the whole software team before committing to the evaluation. \n• Performed Mobile Server performance testing using JMeter. Create Test Script using JUnit. Automated JMeter run using Ant build. \n• Created Seed Data script using Java Fitnesse. \n• Automated web application testing using QTP and Fitnesse. \n• Managed performance testing machines. Performance QA Rearden Commerce (formerly Talaris) April 2007  –  November 2008  (1 year 8 months) • Worked closely with the development team, other QA teams and sustaining teams to develop and apply customized performance strategies. \n• Effectively communicated performance testing methodologies and result analysis with internal and external teams and maintains schedules for assigned performance areas. \n• Created and executed NeoLoad Scripts based on the requirements. Setup the KPI/Baseline for each release and patch. \n• Analyzed the Performance reports and generate results/Metrics in the form of graphs to be presented to Management. \n• Analyzed server response under peak load to identify the server bottlenecks. \n• Performed constant evaluation of third party tools and new technologies to integrate solutions that are suitable for use within the corporate testing framework (such as QC and QTP, QC and Fitnesse, LoadRunner). Produce convincing demo to the whole software team before committing to the evaluation. \n• Performed Mobile Server performance testing using JMeter. Create Test Script using JUnit. Automated JMeter run using Ant build. \n• Created Seed Data script using Java Fitnesse. \n• Automated web application testing using QTP and Fitnesse. \n• Managed performance testing machines. Software Consultant Skillnet Solutions Inc., Sunnyvale, CA July 2004  –  April 2007  (2 years 10 months) Cupertino, CA • Worked as Data Migration Engineer for Saks Fifth Avenue, AOL and Lanier Direct. \n• Involved in BlueMartini Application and Database upgrade \n• Performed Data migration across Solaris, Linux and Windows platforms, and across Oracle, MS SQL database. \n• Reported and resolved issues during data migration process. \n• Performed data validation using db diff tool and SQL scripts. \n• Performed custom Data Migration for AOL custom schemas. \n• Created JDBC command line application for user management data loading. \n• Worked as QA Analyst for Saks Fifth Avenue, Canadian Tire, Gymboree, Hot Topic Inc \n• Developed Test Plan\\Test Cases for functional, error, user interface, regression and scenario-base \n• Reported and documented defects using Test Director, Jira, Bugzilla. \n• Executed SQL queries for grey-box testing. \n• Worked as UI Prototype Engineer for ProUnlimited \n• Created UI prototypes in HTML, CSS and JavaScript. Application was cross platform compatible (PC/IE/Fire fox, Mac/IE/Safari/Safari). \n• Worked with UI Designer to create functional prototypes based on their specifications. \n• Coordinated with offshore developers. \n• Worked as BlueMartini Consultant for IKON \n• Developed JSP, Business Action classes, Business Objects, Validation classes, DNA configure files. Created and maintained Wish List functionalities. \n• Backup and Restore Databases. \n• Resolved defects and performed QA testing. Debugged Java code and analyze different kind of log files to trace problem. Software Consultant Skillnet Solutions Inc., Sunnyvale, CA July 2004  –  April 2007  (2 years 10 months) Cupertino, CA • Worked as Data Migration Engineer for Saks Fifth Avenue, AOL and Lanier Direct. \n• Involved in BlueMartini Application and Database upgrade \n• Performed Data migration across Solaris, Linux and Windows platforms, and across Oracle, MS SQL database. \n• Reported and resolved issues during data migration process. \n• Performed data validation using db diff tool and SQL scripts. \n• Performed custom Data Migration for AOL custom schemas. \n• Created JDBC command line application for user management data loading. \n• Worked as QA Analyst for Saks Fifth Avenue, Canadian Tire, Gymboree, Hot Topic Inc \n• Developed Test Plan\\Test Cases for functional, error, user interface, regression and scenario-base \n• Reported and documented defects using Test Director, Jira, Bugzilla. \n• Executed SQL queries for grey-box testing. \n• Worked as UI Prototype Engineer for ProUnlimited \n• Created UI prototypes in HTML, CSS and JavaScript. Application was cross platform compatible (PC/IE/Fire fox, Mac/IE/Safari/Safari). \n• Worked with UI Designer to create functional prototypes based on their specifications. \n• Coordinated with offshore developers. \n• Worked as BlueMartini Consultant for IKON \n• Developed JSP, Business Action classes, Business Objects, Validation classes, DNA configure files. Created and maintained Wish List functionalities. \n• Backup and Restore Databases. \n• Resolved defects and performed QA testing. Debugged Java code and analyze different kind of log files to trace problem. QA Engineer BlueMartini Software Inc July 2003  –  July 2004  (1 year 1 month) • Completed whole testing life cycle for Business Intelligence (data mining and reporting). \n• Created test plans, test cases/scripts, defect reports for multiple products \n• Executed black box and grey box tests which included functional, regression, scenario-based, upgrade, and I18n/L10n testing. \n• Installed Blue Martini products and third party software, including WebLogic, WebSphere, JDK, and Hummingbird SearchServer on different platforms, such as Windows 2000/SQL 2K, Solaris/Oracle, and AIX/DB2. \n• Created SQL queries for Report correctness testing on both SQL2k and Oracle. \n• Worked on Perl script to run daily builds and BlueMartini command line tools on multiple platforms. \n• Worked with Quick Test Professional 6.0 testing tool to perform functional and regression testing and VB script to store test results in MSSQL2k and TCMS. QA Engineer BlueMartini Software Inc July 2003  –  July 2004  (1 year 1 month) • Completed whole testing life cycle for Business Intelligence (data mining and reporting). \n• Created test plans, test cases/scripts, defect reports for multiple products \n• Executed black box and grey box tests which included functional, regression, scenario-based, upgrade, and I18n/L10n testing. \n• Installed Blue Martini products and third party software, including WebLogic, WebSphere, JDK, and Hummingbird SearchServer on different platforms, such as Windows 2000/SQL 2K, Solaris/Oracle, and AIX/DB2. \n• Created SQL queries for Report correctness testing on both SQL2k and Oracle. \n• Worked on Perl script to run daily builds and BlueMartini command line tools on multiple platforms. \n• Worked with Quick Test Professional 6.0 testing tool to perform functional and regression testing and VB script to store test results in MSSQL2k and TCMS. Languages Chinese Chinese Chinese Skills Scalability Test Automation Quality Assurance Perl Agile Methodologies Distributed Systems Selenium Web Applications REST Java Scrum JIRA Test Planning Software Quality... Skills  Scalability Test Automation Quality Assurance Perl Agile Methodologies Distributed Systems Selenium Web Applications REST Java Scrum JIRA Test Planning Software Quality... Scalability Test Automation Quality Assurance Perl Agile Methodologies Distributed Systems Selenium Web Applications REST Java Scrum JIRA Test Planning Software Quality... Scalability Test Automation Quality Assurance Perl Agile Methodologies Distributed Systems Selenium Web Applications REST Java Scrum JIRA Test Planning Software Quality... Education Northwestern Polytechnic University master,  computer science 2001  – 2002 Teaching Assistant University of Toronto - Innis College Bachelor of Arts (B.A.),  Economics 1995  – 1999 Northwestern Polytechnic University master,  computer science 2001  – 2002 Teaching Assistant Northwestern Polytechnic University master,  computer science 2001  – 2002 Teaching Assistant Northwestern Polytechnic University master,  computer science 2001  – 2002 Teaching Assistant University of Toronto - Innis College Bachelor of Arts (B.A.),  Economics 1995  – 1999 University of Toronto - Innis College Bachelor of Arts (B.A.),  Economics 1995  – 1999 University of Toronto - Innis College Bachelor of Arts (B.A.),  Economics 1995  – 1999 ", "Skills Skills     ", "Summary Specialties:Customer Service, Technical Help Desk, Mentor, Trainer, Lead/Manager, Search Marketing, SEO, Computer Programming, Google Certified, Yahoo Ambassador, Summary Specialties:Customer Service, Technical Help Desk, Mentor, Trainer, Lead/Manager, Search Marketing, SEO, Computer Programming, Google Certified, Yahoo Ambassador, Specialties:Customer Service, Technical Help Desk, Mentor, Trainer, Lead/Manager, Search Marketing, SEO, Computer Programming, Google Certified, Yahoo Ambassador, Specialties:Customer Service, Technical Help Desk, Mentor, Trainer, Lead/Manager, Search Marketing, SEO, Computer Programming, Google Certified, Yahoo Ambassador, Experience Sales Service Representative II Convergys June 2012  – Present (3 years 3 months) Hickory/Lenoir, North Carolina Area Owner RJSEM AD Agency October 2009  –  August 2012  (2 years 11 months) Marketing/ Web Developer Petjolie | The Ultimate Pet Lounge April 2011  –  July 2012  (1 year 4 months) Online Account Executive WebVisible June 2010  –  September 2010  (4 months) Account Executive Seccion Amarilla USA February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla February 2010  –  May 2010  (4 months) Advisor/Data Entry Apple/Primetheraputics November 2009  –  February 2010  (4 months) Advisor/Data Entry Apple/Primetheraputics November 2009  –  January 2010  (3 months) Search Engine Marketing Manager AT&T Advertising Solutions January 2009  –  December 2009  (1 year) SEM-Search Engine Manager AT&T Advertising Solutions January 2009  –  November 2009  (11 months) Search Engine Marketing Manger T Advertising Solutions January 2009  –  November 2009  (11 months) Search Engine Marketing Manger T Advertising Solutions January 2009  –  November 2009  (11 months) Small Business Associate II Yahoo! Inc November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Sponsored Search November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Search Marketing November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Search Marketing November 2006  –  November 2008  (2 years 1 month) Customer Care Representative eHarmony.com July 2004  –  November 2006  (2 years 5 months) Customer Care Representative eHarmony.com July 2004  –  November 2006  (2 years 5 months) Email Customer Rep eHarmony.com 2002  –  2006  (4 years) QA Lead T Long Distance November 2003  –  July 2004  (9 months) QA Lead AT&T Long Distance/MCM VXI November 2003  –  July 2004  (9 months) QA Lead T Long Distance November 2003  –  July 2004  (9 months) Email Representative, QA Specialist T February 2000  –  September 2002  (2 years 8 months) Email Representative, QA Specialist T February 2000  –  September 2002  (2 years 8 months) AT&T WorldNet Service Rep/QA TeleTech 1997  –  2002  (5 years) Customer Service/Technical Support T WorldNet Service March 1999  –  February 2000  (1 year) Customer Service/Technical Support T WorldNet Service March 1999  –  February 2000  (1 year) Sales Service Representative II Convergys June 2012  – Present (3 years 3 months) Hickory/Lenoir, North Carolina Area Sales Service Representative II Convergys June 2012  – Present (3 years 3 months) Hickory/Lenoir, North Carolina Area Owner RJSEM AD Agency October 2009  –  August 2012  (2 years 11 months) Owner RJSEM AD Agency October 2009  –  August 2012  (2 years 11 months) Marketing/ Web Developer Petjolie | The Ultimate Pet Lounge April 2011  –  July 2012  (1 year 4 months) Online Marketing/ Web Developer Petjolie | The Ultimate Pet Lounge April 2011  –  July 2012  (1 year 4 months) Online Account Executive WebVisible June 2010  –  September 2010  (4 months) Account Executive WebVisible June 2010  –  September 2010  (4 months) Account Executive Seccion Amarilla USA February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla USA February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla February 2010  –  May 2010  (4 months) Account Executive Seccion Amarilla February 2010  –  May 2010  (4 months) Advisor/Data Entry Apple/Primetheraputics November 2009  –  February 2010  (4 months) Advisor/Data Entry Apple/Primetheraputics November 2009  –  February 2010  (4 months) Advisor/Data Entry Apple/Primetheraputics November 2009  –  January 2010  (3 months) Advisor/Data Entry Apple/Primetheraputics November 2009  –  January 2010  (3 months) Search Engine Marketing Manager AT&T Advertising Solutions January 2009  –  December 2009  (1 year) Search Engine Marketing Manager AT&T Advertising Solutions January 2009  –  December 2009  (1 year) SEM-Search Engine Manager AT&T Advertising Solutions January 2009  –  November 2009  (11 months) SEM-Search Engine Manager AT&T Advertising Solutions January 2009  –  November 2009  (11 months) Search Engine Marketing Manger T Advertising Solutions January 2009  –  November 2009  (11 months) Search Engine Marketing Manger T Advertising Solutions January 2009  –  November 2009  (11 months) Search Engine Marketing Manger T Advertising Solutions January 2009  –  November 2009  (11 months) Search Engine Marketing Manger T Advertising Solutions January 2009  –  November 2009  (11 months) Small Business Associate II Yahoo! Inc November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Inc November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Sponsored Search November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Sponsored Search November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Search Marketing November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Search Marketing November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Search Marketing November 2006  –  November 2008  (2 years 1 month) Small Business Associate II Yahoo! Search Marketing November 2006  –  November 2008  (2 years 1 month) Customer Care Representative eHarmony.com July 2004  –  November 2006  (2 years 5 months) Customer Care Representative eHarmony.com July 2004  –  November 2006  (2 years 5 months) Customer Care Representative eHarmony.com July 2004  –  November 2006  (2 years 5 months) Customer Care Representative eHarmony.com July 2004  –  November 2006  (2 years 5 months) Email Customer Rep eHarmony.com 2002  –  2006  (4 years) Email Customer Rep eHarmony.com 2002  –  2006  (4 years) QA Lead T Long Distance November 2003  –  July 2004  (9 months) QA Lead T Long Distance November 2003  –  July 2004  (9 months) QA Lead AT&T Long Distance/MCM VXI November 2003  –  July 2004  (9 months) QA Lead AT&T Long Distance/MCM VXI November 2003  –  July 2004  (9 months) QA Lead T Long Distance November 2003  –  July 2004  (9 months) QA Lead T Long Distance November 2003  –  July 2004  (9 months) Email Representative, QA Specialist T February 2000  –  September 2002  (2 years 8 months) Email Representative, QA Specialist T February 2000  –  September 2002  (2 years 8 months) Email Representative, QA Specialist T February 2000  –  September 2002  (2 years 8 months) Email Representative, QA Specialist T February 2000  –  September 2002  (2 years 8 months) AT&T WorldNet Service Rep/QA TeleTech 1997  –  2002  (5 years) AT&T WorldNet Service Rep/QA TeleTech 1997  –  2002  (5 years) Customer Service/Technical Support T WorldNet Service March 1999  –  February 2000  (1 year) Customer Service/Technical Support T WorldNet Service March 1999  –  February 2000  (1 year) Customer Service/Technical Support T WorldNet Service March 1999  –  February 2000  (1 year) Customer Service/Technical Support T WorldNet Service March 1999  –  February 2000  (1 year) Skills SEM SEO Online Advertising Lead Generation PPC CRM Advertising Marketing Mobile Devices Social Media Web Marketing Sales Facebook Mobile Advertising Sales Management Cold Calling Customer Satisfaction See 2+     See less Skills  SEM SEO Online Advertising Lead Generation PPC CRM Advertising Marketing Mobile Devices Social Media Web Marketing Sales Facebook Mobile Advertising Sales Management Cold Calling Customer Satisfaction See 2+     See less SEM SEO Online Advertising Lead Generation PPC CRM Advertising Marketing Mobile Devices Social Media Web Marketing Sales Facebook Mobile Advertising Sales Management Cold Calling Customer Satisfaction See 2+     See less SEM SEO Online Advertising Lead Generation PPC CRM Advertising Marketing Mobile Devices Social Media Web Marketing Sales Facebook Mobile Advertising Sales Management Cold Calling Customer Satisfaction See 2+     See less ", "Summary 12+ years of experience in IT (Development,Testing and Training/Teaching) \n \n• Strong leadership skills in building amazing quality teams and talent by investment in automation and innovation \n \n• Hands on experience in every phase of quality engineering cycle from planning through implementation \n \n• Expertise in working with cross-functional teams as an overall QE point of contact for many products and applications \n \n• Handled testing cycle of multiple products in parallel and a leader in guiding the team to deliver products on time that is guaranteed of quality \n \n• Expertise in preparing test strategy, test plan, test summary reports based on the user requirement document and production data for all kinds of testing \n \n• Proficient in different types of testing such as functional, regression, security, backward compatibility and cross browser testing \n \n• Through expertise in web services, RESTful APIs manual testing and automation of the same \n \n• Played instrumental roles in identifying, championing and implementing test processes and models that led to the successful delivery of product releases under varied platforms \n \n• Identified and implemented numerous best practices for QE in test strategy, automation, execution and reporting. \n \nSpecialties:  \n \n* Have thorough knowledge in QA process.  \n \n* Web Application E-2-E Testing \n \n* Frontend Web App Automation using PROTRACTOR and Jasmine. \n \n* Web Service, RESTful API testing \n \n* Automation of Web Service RESTful API using JMETER \n \n* Automation Library Desing and Implementaion \n \n* Expertise in FE automation tools like SilkTest, Selenium, WebDriver 2.0 etc... \n \n* Security Testing with tools like Ferret, Scanmus, Coverity Prevent 4.x and Tarantula, etc  \n \n* Backend Testing - Acquiring and Processing  \n \n* I18N / L10N testing - Globalization \n \n* Installer and Configurator Testing \n \n* Mentored and managed junior in the team on the product, process, procedures. Summary 12+ years of experience in IT (Development,Testing and Training/Teaching) \n \n• Strong leadership skills in building amazing quality teams and talent by investment in automation and innovation \n \n• Hands on experience in every phase of quality engineering cycle from planning through implementation \n \n• Expertise in working with cross-functional teams as an overall QE point of contact for many products and applications \n \n• Handled testing cycle of multiple products in parallel and a leader in guiding the team to deliver products on time that is guaranteed of quality \n \n• Expertise in preparing test strategy, test plan, test summary reports based on the user requirement document and production data for all kinds of testing \n \n• Proficient in different types of testing such as functional, regression, security, backward compatibility and cross browser testing \n \n• Through expertise in web services, RESTful APIs manual testing and automation of the same \n \n• Played instrumental roles in identifying, championing and implementing test processes and models that led to the successful delivery of product releases under varied platforms \n \n• Identified and implemented numerous best practices for QE in test strategy, automation, execution and reporting. \n \nSpecialties:  \n \n* Have thorough knowledge in QA process.  \n \n* Web Application E-2-E Testing \n \n* Frontend Web App Automation using PROTRACTOR and Jasmine. \n \n* Web Service, RESTful API testing \n \n* Automation of Web Service RESTful API using JMETER \n \n* Automation Library Desing and Implementaion \n \n* Expertise in FE automation tools like SilkTest, Selenium, WebDriver 2.0 etc... \n \n* Security Testing with tools like Ferret, Scanmus, Coverity Prevent 4.x and Tarantula, etc  \n \n* Backend Testing - Acquiring and Processing  \n \n* I18N / L10N testing - Globalization \n \n* Installer and Configurator Testing \n \n* Mentored and managed junior in the team on the product, process, procedures. 12+ years of experience in IT (Development,Testing and Training/Teaching) \n \n• Strong leadership skills in building amazing quality teams and talent by investment in automation and innovation \n \n• Hands on experience in every phase of quality engineering cycle from planning through implementation \n \n• Expertise in working with cross-functional teams as an overall QE point of contact for many products and applications \n \n• Handled testing cycle of multiple products in parallel and a leader in guiding the team to deliver products on time that is guaranteed of quality \n \n• Expertise in preparing test strategy, test plan, test summary reports based on the user requirement document and production data for all kinds of testing \n \n• Proficient in different types of testing such as functional, regression, security, backward compatibility and cross browser testing \n \n• Through expertise in web services, RESTful APIs manual testing and automation of the same \n \n• Played instrumental roles in identifying, championing and implementing test processes and models that led to the successful delivery of product releases under varied platforms \n \n• Identified and implemented numerous best practices for QE in test strategy, automation, execution and reporting. \n \nSpecialties:  \n \n* Have thorough knowledge in QA process.  \n \n* Web Application E-2-E Testing \n \n* Frontend Web App Automation using PROTRACTOR and Jasmine. \n \n* Web Service, RESTful API testing \n \n* Automation of Web Service RESTful API using JMETER \n \n* Automation Library Desing and Implementaion \n \n* Expertise in FE automation tools like SilkTest, Selenium, WebDriver 2.0 etc... \n \n* Security Testing with tools like Ferret, Scanmus, Coverity Prevent 4.x and Tarantula, etc  \n \n* Backend Testing - Acquiring and Processing  \n \n* I18N / L10N testing - Globalization \n \n* Installer and Configurator Testing \n \n* Mentored and managed junior in the team on the product, process, procedures. 12+ years of experience in IT (Development,Testing and Training/Teaching) \n \n• Strong leadership skills in building amazing quality teams and talent by investment in automation and innovation \n \n• Hands on experience in every phase of quality engineering cycle from planning through implementation \n \n• Expertise in working with cross-functional teams as an overall QE point of contact for many products and applications \n \n• Handled testing cycle of multiple products in parallel and a leader in guiding the team to deliver products on time that is guaranteed of quality \n \n• Expertise in preparing test strategy, test plan, test summary reports based on the user requirement document and production data for all kinds of testing \n \n• Proficient in different types of testing such as functional, regression, security, backward compatibility and cross browser testing \n \n• Through expertise in web services, RESTful APIs manual testing and automation of the same \n \n• Played instrumental roles in identifying, championing and implementing test processes and models that led to the successful delivery of product releases under varied platforms \n \n• Identified and implemented numerous best practices for QE in test strategy, automation, execution and reporting. \n \nSpecialties:  \n \n* Have thorough knowledge in QA process.  \n \n* Web Application E-2-E Testing \n \n* Frontend Web App Automation using PROTRACTOR and Jasmine. \n \n* Web Service, RESTful API testing \n \n* Automation of Web Service RESTful API using JMETER \n \n* Automation Library Desing and Implementaion \n \n* Expertise in FE automation tools like SilkTest, Selenium, WebDriver 2.0 etc... \n \n* Security Testing with tools like Ferret, Scanmus, Coverity Prevent 4.x and Tarantula, etc  \n \n* Backend Testing - Acquiring and Processing  \n \n* I18N / L10N testing - Globalization \n \n* Installer and Configurator Testing \n \n* Mentored and managed junior in the team on the product, process, procedures. Experience Principal Quality Engineer / QA Manager Yahoo! October 2011  – Present (3 years 11 months) Bangaon Area, India Publishing Tools(FE): Editorial Tools( Publish and Creatr (Tumblr) ) \n***************************************** \n \n1. Managing the Quality Efforts for Media Publishing Tools w.r.t Functional, Automation and Security. \n \n2. Automation of FrontEnd using PROTRACTOR, Jasmine \n \n3. Testing and Certifying publishing frontend tool for functional,automation and security.  \n \n \nPublishing Tools(FE) : Publish Service layer( RESTful Web Service) \n************************************************** \n1. Managing the quality efforts for Publishing Service Layer (PSL), a RESTful web service layer providing the needed services to all the plugins of Media Publishing tools (PD2 and publish.yahoo.com) front-end \n \n2. Automation of PSL, a RESTful Web service API using JMETER \n \n3. Testing and certifying of the web service API with automation for every release.  \n \n \n \n \n \n \n \n \n-- Tech Lead Yahoo! April 2010  –  September 2011  (1 year 6 months) Producers Desktop(PD2 and Editopia) \n********************************************* \nLeading the Quality Efforts for Producers Desktop(PD2 and Editopia) - state-of-the-art editorial tools that enable Yahoo! editors deliver the best viewing experience in key landing sites such as www.yahoo.com, news.yahoo.com \n \nDesing of a novel library for PD automation which ensures that automation scripts need not be changed when GUI changes.  \nThe Library methods are designed such that any change in UI needs to be reflected only in Library methods, and the test methods remain unaffected. \n \nResponsible for Security Testing and Adhoc Testing for the PD2 \n \nFeeds Solution(Y! Post) \n**************************** \n \nLead the Quality Efforts for the Feeds Solution Projects Listing - Real Estate and Locals \n \nWorked on Y! Post, a platform for feeds acquisition and processing system based on Map-Reduce paradigm.  \n \nTesting of Yahoo! Listings back-end system for processing US Real Estate and Locals. \n \nTesting of Yahoo! Media back-end system for processing NPC. \n \nPerformance and Durability Testing for Yahoo! Listings back-end system for Real Estate and Locals \n \nResponsible for Security Testing for all the products under Y! Post. QA Lead - Sustaining Patches for CommsExp Sun Microsystems November 2006  –  April 2008  (1 year 6 months) Comms Express \n******************* \n \nLeading the quality efforts for the Communication Express(Integration of Mail,Calendar and Addressbook) sustaining patches. \n \nAutomation of the entire production as customer specific sustaining patches needs to be certified with in 2 working days. \n \nAutomating many core features using SilkTest \n \nInstaller and Configuration Testing for CE and Convergence \n \nIWC - Convergence \n********************** \nTesting the NextGen Web App - Convergence-a integrated Web Client(Integration of Mail,Calendar, Addressbook and Instant Messanger) \n \nAutomating many core features using Selenuium \n \nInstaller and Configuration Testing for CE and Convergence MTS2 Sun Microsystems June 2005  –  November 2006  (1 year 6 months) IT Consultant & Traniner STEP,SSIT Campus September 2002  –  May 2005  (2 years 9 months) Principal Quality Engineer / QA Manager Yahoo! October 2011  – Present (3 years 11 months) Bangaon Area, India Publishing Tools(FE): Editorial Tools( Publish and Creatr (Tumblr) ) \n***************************************** \n \n1. Managing the Quality Efforts for Media Publishing Tools w.r.t Functional, Automation and Security. \n \n2. Automation of FrontEnd using PROTRACTOR, Jasmine \n \n3. Testing and Certifying publishing frontend tool for functional,automation and security.  \n \n \nPublishing Tools(FE) : Publish Service layer( RESTful Web Service) \n************************************************** \n1. Managing the quality efforts for Publishing Service Layer (PSL), a RESTful web service layer providing the needed services to all the plugins of Media Publishing tools (PD2 and publish.yahoo.com) front-end \n \n2. Automation of PSL, a RESTful Web service API using JMETER \n \n3. Testing and certifying of the web service API with automation for every release.  \n \n \n \n \n \n \n \n \n-- Principal Quality Engineer / QA Manager Yahoo! October 2011  – Present (3 years 11 months) Bangaon Area, India Publishing Tools(FE): Editorial Tools( Publish and Creatr (Tumblr) ) \n***************************************** \n \n1. Managing the Quality Efforts for Media Publishing Tools w.r.t Functional, Automation and Security. \n \n2. Automation of FrontEnd using PROTRACTOR, Jasmine \n \n3. Testing and Certifying publishing frontend tool for functional,automation and security.  \n \n \nPublishing Tools(FE) : Publish Service layer( RESTful Web Service) \n************************************************** \n1. Managing the quality efforts for Publishing Service Layer (PSL), a RESTful web service layer providing the needed services to all the plugins of Media Publishing tools (PD2 and publish.yahoo.com) front-end \n \n2. Automation of PSL, a RESTful Web service API using JMETER \n \n3. Testing and certifying of the web service API with automation for every release.  \n \n \n \n \n \n \n \n \n-- Tech Lead Yahoo! April 2010  –  September 2011  (1 year 6 months) Producers Desktop(PD2 and Editopia) \n********************************************* \nLeading the Quality Efforts for Producers Desktop(PD2 and Editopia) - state-of-the-art editorial tools that enable Yahoo! editors deliver the best viewing experience in key landing sites such as www.yahoo.com, news.yahoo.com \n \nDesing of a novel library for PD automation which ensures that automation scripts need not be changed when GUI changes.  \nThe Library methods are designed such that any change in UI needs to be reflected only in Library methods, and the test methods remain unaffected. \n \nResponsible for Security Testing and Adhoc Testing for the PD2 \n \nFeeds Solution(Y! Post) \n**************************** \n \nLead the Quality Efforts for the Feeds Solution Projects Listing - Real Estate and Locals \n \nWorked on Y! Post, a platform for feeds acquisition and processing system based on Map-Reduce paradigm.  \n \nTesting of Yahoo! Listings back-end system for processing US Real Estate and Locals. \n \nTesting of Yahoo! Media back-end system for processing NPC. \n \nPerformance and Durability Testing for Yahoo! Listings back-end system for Real Estate and Locals \n \nResponsible for Security Testing for all the products under Y! Post. Tech Lead Yahoo! April 2010  –  September 2011  (1 year 6 months) Producers Desktop(PD2 and Editopia) \n********************************************* \nLeading the Quality Efforts for Producers Desktop(PD2 and Editopia) - state-of-the-art editorial tools that enable Yahoo! editors deliver the best viewing experience in key landing sites such as www.yahoo.com, news.yahoo.com \n \nDesing of a novel library for PD automation which ensures that automation scripts need not be changed when GUI changes.  \nThe Library methods are designed such that any change in UI needs to be reflected only in Library methods, and the test methods remain unaffected. \n \nResponsible for Security Testing and Adhoc Testing for the PD2 \n \nFeeds Solution(Y! Post) \n**************************** \n \nLead the Quality Efforts for the Feeds Solution Projects Listing - Real Estate and Locals \n \nWorked on Y! Post, a platform for feeds acquisition and processing system based on Map-Reduce paradigm.  \n \nTesting of Yahoo! Listings back-end system for processing US Real Estate and Locals. \n \nTesting of Yahoo! Media back-end system for processing NPC. \n \nPerformance and Durability Testing for Yahoo! Listings back-end system for Real Estate and Locals \n \nResponsible for Security Testing for all the products under Y! Post. QA Lead - Sustaining Patches for CommsExp Sun Microsystems November 2006  –  April 2008  (1 year 6 months) Comms Express \n******************* \n \nLeading the quality efforts for the Communication Express(Integration of Mail,Calendar and Addressbook) sustaining patches. \n \nAutomation of the entire production as customer specific sustaining patches needs to be certified with in 2 working days. \n \nAutomating many core features using SilkTest \n \nInstaller and Configuration Testing for CE and Convergence \n \nIWC - Convergence \n********************** \nTesting the NextGen Web App - Convergence-a integrated Web Client(Integration of Mail,Calendar, Addressbook and Instant Messanger) \n \nAutomating many core features using Selenuium \n \nInstaller and Configuration Testing for CE and Convergence QA Lead - Sustaining Patches for CommsExp Sun Microsystems November 2006  –  April 2008  (1 year 6 months) Comms Express \n******************* \n \nLeading the quality efforts for the Communication Express(Integration of Mail,Calendar and Addressbook) sustaining patches. \n \nAutomation of the entire production as customer specific sustaining patches needs to be certified with in 2 working days. \n \nAutomating many core features using SilkTest \n \nInstaller and Configuration Testing for CE and Convergence \n \nIWC - Convergence \n********************** \nTesting the NextGen Web App - Convergence-a integrated Web Client(Integration of Mail,Calendar, Addressbook and Instant Messanger) \n \nAutomating many core features using Selenuium \n \nInstaller and Configuration Testing for CE and Convergence MTS2 Sun Microsystems June 2005  –  November 2006  (1 year 6 months) MTS2 Sun Microsystems June 2005  –  November 2006  (1 year 6 months) IT Consultant & Traniner STEP,SSIT Campus September 2002  –  May 2005  (2 years 9 months) IT Consultant & Traniner STEP,SSIT Campus September 2002  –  May 2005  (2 years 9 months) Languages Kannada Kannada Kannada Skills Selenium Performance Testing SilkTest Testing Quality Assurance Automation Web Applications Test Automation Test Management Unix Java Linux Software Quality... Solaris C Hudson Core Java Scrum Agile Methodologies Web Services Test Planning REST See 7+     See less Skills  Selenium Performance Testing SilkTest Testing Quality Assurance Automation Web Applications Test Automation Test Management Unix Java Linux Software Quality... Solaris C Hudson Core Java Scrum Agile Methodologies Web Services Test Planning REST See 7+     See less Selenium Performance Testing SilkTest Testing Quality Assurance Automation Web Applications Test Automation Test Management Unix Java Linux Software Quality... Solaris C Hudson Core Java Scrum Agile Methodologies Web Services Test Planning REST See 7+     See less Selenium Performance Testing SilkTest Testing Quality Assurance Automation Web Applications Test Automation Test Management Unix Java Linux Software Quality... Solaris C Hudson Core Java Scrum Agile Methodologies Web Services Test Planning REST See 7+     See less ", "Experience Lead Quality Engineer Yahoo June 2014  – Present (1 year 3 months) Sunnyvale,CA Selnium, TestNG, Java, Jira, Mac, Splunk Senior Quality Assurance Bitcasa, Inc. June 2013  –  May 2014  (1 year) Mountain View, CA IOS, Mac, Jira, Test Rail, SQL, Linux, Web API,Git, Windows, Jenkins, Selenium, Python, Java, TestNG Software Quality Assurance Engineer Yahoo! April 2012  –  June 2013  (1 year 3 months) Sunnyvale, CA Perl, Shell, Test Manager, Atlas, Pandora, Bugzilla, SVN, Unix, MAC, Putty, Jenkins DMD QA lead Wells Fargo December 2009  –  March 2012  (2 years 4 months) San Leandro, CA Perl, Oracle, TOAD, PL/SQL, Mercury Quality Center, Informatica PowerCenter 8.1, Windows, SQL Server , TOAD , Microsoft Visio, UNIX Quality Assurance Engineer Sony Electronics December 2008  –  December 2009  (1 year 1 month) San Jose, CA Sony Ebook reader/ Sony PRS (Portable Reading System),Sony Reader Store ,Adobe DRM, Selenium, Perl, Mac, Window Vista, Shell Scripts, Windows XP, Ivalsun,  \n \nhttp://en.wikipedia.org/wiki/Sony_Reader Senior Subject Matter Expert Amdocs June 2006  –  December 2008  (2 years 7 months) Pune India, Dallas US, Canada C++, Pro C, PL/SQL, Test Complete, Oracle, Shell, UNIX, Perl, Windows, Xtra-C, Test Track, Quality Center Member of Technical Staff Persistent Systems July 2004  –  June 2006  (2 years) Pune, India Oracle, Netezza, TOAD, Quality Center, SQL, Perl, Shell Scripts, UNIX, Windows, TOAD, Winrunner, Loadrunner, Test Track, FTP, HP-UX, Solaris, Postgres, AIX, TRU-64 Lead Quality Engineer Yahoo June 2014  – Present (1 year 3 months) Sunnyvale,CA Selnium, TestNG, Java, Jira, Mac, Splunk Lead Quality Engineer Yahoo June 2014  – Present (1 year 3 months) Sunnyvale,CA Selnium, TestNG, Java, Jira, Mac, Splunk Senior Quality Assurance Bitcasa, Inc. June 2013  –  May 2014  (1 year) Mountain View, CA IOS, Mac, Jira, Test Rail, SQL, Linux, Web API,Git, Windows, Jenkins, Selenium, Python, Java, TestNG Senior Quality Assurance Bitcasa, Inc. June 2013  –  May 2014  (1 year) Mountain View, CA IOS, Mac, Jira, Test Rail, SQL, Linux, Web API,Git, Windows, Jenkins, Selenium, Python, Java, TestNG Software Quality Assurance Engineer Yahoo! April 2012  –  June 2013  (1 year 3 months) Sunnyvale, CA Perl, Shell, Test Manager, Atlas, Pandora, Bugzilla, SVN, Unix, MAC, Putty, Jenkins Software Quality Assurance Engineer Yahoo! April 2012  –  June 2013  (1 year 3 months) Sunnyvale, CA Perl, Shell, Test Manager, Atlas, Pandora, Bugzilla, SVN, Unix, MAC, Putty, Jenkins DMD QA lead Wells Fargo December 2009  –  March 2012  (2 years 4 months) San Leandro, CA Perl, Oracle, TOAD, PL/SQL, Mercury Quality Center, Informatica PowerCenter 8.1, Windows, SQL Server , TOAD , Microsoft Visio, UNIX DMD QA lead Wells Fargo December 2009  –  March 2012  (2 years 4 months) San Leandro, CA Perl, Oracle, TOAD, PL/SQL, Mercury Quality Center, Informatica PowerCenter 8.1, Windows, SQL Server , TOAD , Microsoft Visio, UNIX Quality Assurance Engineer Sony Electronics December 2008  –  December 2009  (1 year 1 month) San Jose, CA Sony Ebook reader/ Sony PRS (Portable Reading System),Sony Reader Store ,Adobe DRM, Selenium, Perl, Mac, Window Vista, Shell Scripts, Windows XP, Ivalsun,  \n \nhttp://en.wikipedia.org/wiki/Sony_Reader Quality Assurance Engineer Sony Electronics December 2008  –  December 2009  (1 year 1 month) San Jose, CA Sony Ebook reader/ Sony PRS (Portable Reading System),Sony Reader Store ,Adobe DRM, Selenium, Perl, Mac, Window Vista, Shell Scripts, Windows XP, Ivalsun,  \n \nhttp://en.wikipedia.org/wiki/Sony_Reader Senior Subject Matter Expert Amdocs June 2006  –  December 2008  (2 years 7 months) Pune India, Dallas US, Canada C++, Pro C, PL/SQL, Test Complete, Oracle, Shell, UNIX, Perl, Windows, Xtra-C, Test Track, Quality Center Senior Subject Matter Expert Amdocs June 2006  –  December 2008  (2 years 7 months) Pune India, Dallas US, Canada C++, Pro C, PL/SQL, Test Complete, Oracle, Shell, UNIX, Perl, Windows, Xtra-C, Test Track, Quality Center Member of Technical Staff Persistent Systems July 2004  –  June 2006  (2 years) Pune, India Oracle, Netezza, TOAD, Quality Center, SQL, Perl, Shell Scripts, UNIX, Windows, TOAD, Winrunner, Loadrunner, Test Track, FTP, HP-UX, Solaris, Postgres, AIX, TRU-64 Member of Technical Staff Persistent Systems July 2004  –  June 2006  (2 years) Pune, India Oracle, Netezza, TOAD, Quality Center, SQL, Perl, Shell Scripts, UNIX, Windows, TOAD, Winrunner, Loadrunner, Test Track, FTP, HP-UX, Solaris, Postgres, AIX, TRU-64 Skills Selenium Java Testing Unix SQL Shell Scripting C++ TestNG Perl Script Git Jenkins Informatica Bugzilla SDLC Agile Methodologies HP Quality Center Appium Perl See 3+     See less Skills  Selenium Java Testing Unix SQL Shell Scripting C++ TestNG Perl Script Git Jenkins Informatica Bugzilla SDLC Agile Methodologies HP Quality Center Appium Perl See 3+     See less Selenium Java Testing Unix SQL Shell Scripting C++ TestNG Perl Script Git Jenkins Informatica Bugzilla SDLC Agile Methodologies HP Quality Center Appium Perl See 3+     See less Selenium Java Testing Unix SQL Shell Scripting C++ TestNG Perl Script Git Jenkins Informatica Bugzilla SDLC Agile Methodologies HP Quality Center Appium Perl See 3+     See less ", "Experience Techincal Yahoo!( QA Lead) Yahoo! May 2008  – Present (7 years 4 months) Senior Specialist Merrill Lynch June 2007  –  May 2008  (1 year) Analyst Resolution Health Inc 2005  –  2007  (2 years) Programmer/Analyst Mccue Systems Inc 2004  –  2005  (1 year) Software Engineer Wipro Technologies 1999  –  2000  (1 year) Techincal Yahoo!( QA Lead) Yahoo! May 2008  – Present (7 years 4 months) Techincal Yahoo!( QA Lead) Yahoo! May 2008  – Present (7 years 4 months) Senior Specialist Merrill Lynch June 2007  –  May 2008  (1 year) Senior Specialist Merrill Lynch June 2007  –  May 2008  (1 year) Analyst Resolution Health Inc 2005  –  2007  (2 years) Analyst Resolution Health Inc 2005  –  2007  (2 years) Programmer/Analyst Mccue Systems Inc 2004  –  2005  (1 year) Programmer/Analyst Mccue Systems Inc 2004  –  2005  (1 year) Software Engineer Wipro Technologies 1999  –  2000  (1 year) Software Engineer Wipro Technologies 1999  –  2000  (1 year) Skills SQL Skills  SQL SQL SQL Education Mahatma Gandhi University B.Tech,  Computer Science & Engineering Mahatma Gandhi University B.Tech,  Computer Science & Engineering Mahatma Gandhi University B.Tech,  Computer Science & Engineering Mahatma Gandhi University B.Tech,  Computer Science & Engineering ", "Languages Português Native or bilingual proficiency Inglês Native or bilingual proficiency Espanhol Full professional proficiency Francês Professional working proficiency Alemão Elementary proficiency Português Native or bilingual proficiency Inglês Native or bilingual proficiency Espanhol Full professional proficiency Francês Professional working proficiency Alemão Elementary proficiency Português Native or bilingual proficiency Inglês Native or bilingual proficiency Espanhol Full professional proficiency Francês Professional working proficiency Alemão Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Elementary proficiency Skills Globalization Localization Website Localization Translation User Experience Product Management Internationalization Brazilian Portuguese Multilingual Mobile Devices Content Management Portuguese Cross-functional Team... Agile Methodologies Web Project Management Digital Media L10n Project Management Terminology Spanish Linguistics Enterprise Software Multimedia Quality Assurance French Manuals Foreign Languages See 12+     See less Skills  Globalization Localization Website Localization Translation User Experience Product Management Internationalization Brazilian Portuguese Multilingual Mobile Devices Content Management Portuguese Cross-functional Team... Agile Methodologies Web Project Management Digital Media L10n Project Management Terminology Spanish Linguistics Enterprise Software Multimedia Quality Assurance French Manuals Foreign Languages See 12+     See less Globalization Localization Website Localization Translation User Experience Product Management Internationalization Brazilian Portuguese Multilingual Mobile Devices Content Management Portuguese Cross-functional Team... Agile Methodologies Web Project Management Digital Media L10n Project Management Terminology Spanish Linguistics Enterprise Software Multimedia Quality Assurance French Manuals Foreign Languages See 12+     See less Globalization Localization Website Localization Translation User Experience Product Management Internationalization Brazilian Portuguese Multilingual Mobile Devices Content Management Portuguese Cross-functional Team... Agile Methodologies Web Project Management Digital Media L10n Project Management Terminology Spanish Linguistics Enterprise Software Multimedia Quality Assurance French Manuals Foreign Languages See 12+     See less "]}