{"position": "Software Engineer-Quality Assurance Engineer", "company": "Google", "profiles": ["Experience QA engineer Yahoo! QA engineer Yahoo! QA engineer Yahoo! ", "Skills Test Automation Quality Assurance Agile Methodologies Distributed Systems Test Cases Regression Testing Skills  Test Automation Quality Assurance Agile Methodologies Distributed Systems Test Cases Regression Testing Test Automation Quality Assurance Agile Methodologies Distributed Systems Test Cases Regression Testing Test Automation Quality Assurance Agile Methodologies Distributed Systems Test Cases Regression Testing ", "Experience QA Engineer Yahoo! October 2006  – Present (8 years 11 months) QA FaceTime Communications 2004  –  2006  (2 years) QA Engineer Yahoo! October 2006  – Present (8 years 11 months) QA Engineer Yahoo! October 2006  – Present (8 years 11 months) QA FaceTime Communications 2004  –  2006  (2 years) QA FaceTime Communications 2004  –  2006  (2 years) Education Harihar Polyfibers Bachelor of Engineering (BE),  Computer Science Harihar Polyfibers Bachelor of Engineering (BE),  Computer Science Harihar Polyfibers Bachelor of Engineering (BE),  Computer Science Harihar Polyfibers Bachelor of Engineering (BE),  Computer Science ", "Experience QA Engineer Yahoo! April 2008  – Present (7 years 5 months) Software Development Engineer in Test Microsoft March 2007  –  March 2008  (1 year 1 month) Software Engineer Xilinx January 1998  –  January 2007  (9 years 1 month) QA Engineer Yahoo! April 2008  – Present (7 years 5 months) QA Engineer Yahoo! April 2008  – Present (7 years 5 months) Software Development Engineer in Test Microsoft March 2007  –  March 2008  (1 year 1 month) Software Development Engineer in Test Microsoft March 2007  –  March 2008  (1 year 1 month) Software Engineer Xilinx January 1998  –  January 2007  (9 years 1 month) Software Engineer Xilinx January 1998  –  January 2007  (9 years 1 month) Skills Distributed Systems Test Automation Scalability Agile Methodologies Testing Quality Assurance Skills  Distributed Systems Test Automation Scalability Agile Methodologies Testing Quality Assurance Distributed Systems Test Automation Scalability Agile Methodologies Testing Quality Assurance Distributed Systems Test Automation Scalability Agile Methodologies Testing Quality Assurance Education California Polytechnic State University-San Luis Obispo BS,  Computer Science 1993  – 1997 California Polytechnic State University-San Luis Obispo BS,  Computer Science 1993  – 1997 California Polytechnic State University-San Luis Obispo BS,  Computer Science 1993  – 1997 California Polytechnic State University-San Luis Obispo BS,  Computer Science 1993  – 1997 ", "Experience Sr. QA Engineer Trend Micro Senior QA Engineer Yahoo October 2012  – Present (2 years 11 months) Taipei City, Taiwan Sr. QA Engineer Trend Micro August 2005  –  September 2012  (7 years 2 months) Taipei City, Taiwan Sr. QA Engineer Trend Micro Sr. QA Engineer Trend Micro Senior QA Engineer Yahoo October 2012  – Present (2 years 11 months) Taipei City, Taiwan Senior QA Engineer Yahoo October 2012  – Present (2 years 11 months) Taipei City, Taiwan Sr. QA Engineer Trend Micro August 2005  –  September 2012  (7 years 2 months) Taipei City, Taiwan Sr. QA Engineer Trend Micro August 2005  –  September 2012  (7 years 2 months) Taipei City, Taiwan Skills Quality Assurance Agile Methodologies Software Development Java Linux SQL XML Testing Selenium WebDriver Scrum Perl Skills  Quality Assurance Agile Methodologies Software Development Java Linux SQL XML Testing Selenium WebDriver Scrum Perl Quality Assurance Agile Methodologies Software Development Java Linux SQL XML Testing Selenium WebDriver Scrum Perl Quality Assurance Agile Methodologies Software Development Java Linux SQL XML Testing Selenium WebDriver Scrum Perl Education National Cheng Kung University master,  computer science 2003  – 2005 National Cheng Kung University Master's degree of Computer Science National Cheng Kung University master,  computer science 2003  – 2005 National Cheng Kung University master,  computer science 2003  – 2005 National Cheng Kung University master,  computer science 2003  – 2005 National Cheng Kung University Master's degree of Computer Science National Cheng Kung University Master's degree of Computer Science National Cheng Kung University Master's degree of Computer Science ", "Experience QA Engineer Yahoo! QA Engineer Yahoo! QA Engineer Yahoo! ", "Skills Selenium Bugzilla QTP LoadRunner Test Automation Agile Methodologies Quality Center Testing Test Planning Skills  Selenium Bugzilla QTP LoadRunner Test Automation Agile Methodologies Quality Center Testing Test Planning Selenium Bugzilla QTP LoadRunner Test Automation Agile Methodologies Quality Center Testing Test Planning Selenium Bugzilla QTP LoadRunner Test Automation Agile Methodologies Quality Center Testing Test Planning ", "Experience Senior QA Engineer Yahoo! QA lead Core Mobility 2005  –  2008  (3 years) Senior QA Engineer Yahoo! Senior QA Engineer Yahoo! QA lead Core Mobility 2005  –  2008  (3 years) QA lead Core Mobility 2005  –  2008  (3 years) Skills Perl Java Agile Methodologies Mobile Applications Test Automation Skills  Perl Java Agile Methodologies Mobile Applications Test Automation Perl Java Agile Methodologies Mobile Applications Test Automation Perl Java Agile Methodologies Mobile Applications Test Automation Education YCCE YCCE YCCE YCCE ", "Skills Test Automation Server Architecture Automation Quality Assurance TestNG Test Planning Scalability Perl Distributed Systems Java Unix Search C MySQL SQL Databases JUnit See 2+     See less Skills  Test Automation Server Architecture Automation Quality Assurance TestNG Test Planning Scalability Perl Distributed Systems Java Unix Search C MySQL SQL Databases JUnit See 2+     See less Test Automation Server Architecture Automation Quality Assurance TestNG Test Planning Scalability Perl Distributed Systems Java Unix Search C MySQL SQL Databases JUnit See 2+     See less Test Automation Server Architecture Automation Quality Assurance TestNG Test Planning Scalability Perl Distributed Systems Java Unix Search C MySQL SQL Databases JUnit See 2+     See less ", "Languages Espanol English Espanol English Espanol English Skills Close Attention to... Teamwork Fully bilingual English Global Communications Flexibility Axis Yahoo Search Time Travel Mobile Phone Apps CSS HTML Windows Mobile Test Planning Test Cases Device Anywhere Regression Testing Smoke Testing Device Testing JavaScript Mobile Devices Software Quality... Usability Testing charles web debugging Mobile Applications Test Automation Agile Methodologies Android Scrum Quality Assurance See 14+     See less Skills  Close Attention to... Teamwork Fully bilingual English Global Communications Flexibility Axis Yahoo Search Time Travel Mobile Phone Apps CSS HTML Windows Mobile Test Planning Test Cases Device Anywhere Regression Testing Smoke Testing Device Testing JavaScript Mobile Devices Software Quality... Usability Testing charles web debugging Mobile Applications Test Automation Agile Methodologies Android Scrum Quality Assurance See 14+     See less Close Attention to... Teamwork Fully bilingual English Global Communications Flexibility Axis Yahoo Search Time Travel Mobile Phone Apps CSS HTML Windows Mobile Test Planning Test Cases Device Anywhere Regression Testing Smoke Testing Device Testing JavaScript Mobile Devices Software Quality... Usability Testing charles web debugging Mobile Applications Test Automation Agile Methodologies Android Scrum Quality Assurance See 14+     See less Close Attention to... Teamwork Fully bilingual English Global Communications Flexibility Axis Yahoo Search Time Travel Mobile Phone Apps CSS HTML Windows Mobile Test Planning Test Cases Device Anywhere Regression Testing Smoke Testing Device Testing JavaScript Mobile Devices Software Quality... Usability Testing charles web debugging Mobile Applications Test Automation Agile Methodologies Android Scrum Quality Assurance See 14+     See less ", "Skills Black Box Testing Load Testing Eggplant JMeter Unix SQL Web Testing Mobile Testing MRAID HTML5 testing Rich media ads Smart ads Web services testing Scrum/Agile testing Skills  Black Box Testing Load Testing Eggplant JMeter Unix SQL Web Testing Mobile Testing MRAID HTML5 testing Rich media ads Smart ads Web services testing Scrum/Agile testing Black Box Testing Load Testing Eggplant JMeter Unix SQL Web Testing Mobile Testing MRAID HTML5 testing Rich media ads Smart ads Web services testing Scrum/Agile testing Black Box Testing Load Testing Eggplant JMeter Unix SQL Web Testing Mobile Testing MRAID HTML5 testing Rich media ads Smart ads Web services testing Scrum/Agile testing ", "Experience qa engineer Yahoo! quality engineer Sun Microsystems 2000  –  2006  (6 years) qa engineer Yahoo! qa engineer Yahoo! quality engineer Sun Microsystems 2000  –  2006  (6 years) quality engineer Sun Microsystems 2000  –  2006  (6 years) ", "Experience Sr. QA Engineer Yahoo! September 2000  – Present (15 years) QA Engineer Firstwave Technologies 2000  –  2000  (less than a year) Sr. QA Engineer Yahoo! September 2000  – Present (15 years) Sr. QA Engineer Yahoo! September 2000  – Present (15 years) QA Engineer Firstwave Technologies 2000  –  2000  (less than a year) QA Engineer Firstwave Technologies 2000  –  2000  (less than a year) Skills Quality Assurance Agile Methodologies Software Development Mobile Applications Leadership JavaScript Scrum XML Java Web Applications Skills  Quality Assurance Agile Methodologies Software Development Mobile Applications Leadership JavaScript Scrum XML Java Web Applications Quality Assurance Agile Methodologies Software Development Mobile Applications Leadership JavaScript Scrum XML Java Web Applications Quality Assurance Agile Methodologies Software Development Mobile Applications Leadership JavaScript Scrum XML Java Web Applications Education Auburn University 1995  – 1999 Auburn University 1995  – 1999 Auburn University 1995  – 1999 Auburn University 1995  – 1999 ", "Skills SQL TestNG Linux XML Java JavaScript Skills  SQL TestNG Linux XML Java JavaScript SQL TestNG Linux XML Java JavaScript SQL TestNG Linux XML Java JavaScript ", "Experience Senior QA Engineer Yahoo May 2015  – Present (4 months) Senior Software QA Engineer if(we) October 2014  – Present (11 months) Test automation, Test automation framework development, Testing tools development, CI test server development and maintains. Software QA Engineer eBay Inc November 2012  –  September 2014  (1 year 11 months) Timonium, MD, USA •\tResponsible for the QA of the PayPal BillMeLater AuthEngine. Use groovy, spock and soapUI to do Integration test, end to end test, functionality test, regression test and smoke test for new features and changes in Java developed SOAP and RESTful WebService. \n•\tAccomplish sprint task of the DEV team and contribute to the CI build and Regression Test of the QA team. \n•\tResponsible for updating and maintaining the core testing API project “WhiteShark” which is our fundamental testing Library writing in groovy as a maven project. \n•\tDesign service layer testing API with QAs, implement Bamboo/Jenkins CI build for nightly build and smoke test after each push. \n•\tDevelop Web Service client in “WhiteShark” with factory design pattern. \n•\tDeploy web service application on glassfish on local machine and testing against local. \n•\tRequest QA environments push to release management team and verify push successful by running smoke test. \n•\tCoordinate with developers on SVN/git brunching, build and deploy on team server for testing. \n•\tBeing a member of team that apply agile methodology, participate in scrum daily stand up, scoring, planning, review and retrospective. \n•\tBuild connection to database using pain JDBC connection and DAOs, reversal engine Hibernate model object and DAOs used for testing. \n•\tWork with DBDs DEVs on solving any exceptions or issue after push to QA and DEV environments. Java Developer eTeam May 2012  –  October 2012  (6 months) South Plainfield, NJ, USA •\tDevelopment web service using Java Technologies: Spring framework, Hibernate, JMS, EJB, JAXB, JTA, JPA. \n•\tPair programming with senior java developers and complete sprint stories. \n•\tWrite and wired up processers in business logic flow, update Spring configure class or xml file. \n•\tCreate data model and DAO layer with Hibernate, configure hibernate mapping file with one-to-one, one-to-many and many-to-many relationship. \n•\tCreate Web Service end point and writing marshaller and unmarshaller. \n•\tAssociate with DBDs to update DAOs with data model changes. \n•\tUpdate and create database push script with PL/SQL. Web Developer CulturePlay LLC October 2011  –  May 2012  (8 months) Brooklyn, NY, USA •\tFront end development, with JSP and MVC \n•\tUse Dreamweaver, HTML, CSS, JavaScript, JQuery to do web page development. \n•\tDeveloping web game for children education. \n•\tCommunicate with tech lead weekly to report progress and sync business requirements. Senior QA Engineer Yahoo May 2015  – Present (4 months) Senior QA Engineer Yahoo May 2015  – Present (4 months) Senior Software QA Engineer if(we) October 2014  – Present (11 months) Test automation, Test automation framework development, Testing tools development, CI test server development and maintains. Senior Software QA Engineer if(we) October 2014  – Present (11 months) Test automation, Test automation framework development, Testing tools development, CI test server development and maintains. Software QA Engineer eBay Inc November 2012  –  September 2014  (1 year 11 months) Timonium, MD, USA •\tResponsible for the QA of the PayPal BillMeLater AuthEngine. Use groovy, spock and soapUI to do Integration test, end to end test, functionality test, regression test and smoke test for new features and changes in Java developed SOAP and RESTful WebService. \n•\tAccomplish sprint task of the DEV team and contribute to the CI build and Regression Test of the QA team. \n•\tResponsible for updating and maintaining the core testing API project “WhiteShark” which is our fundamental testing Library writing in groovy as a maven project. \n•\tDesign service layer testing API with QAs, implement Bamboo/Jenkins CI build for nightly build and smoke test after each push. \n•\tDevelop Web Service client in “WhiteShark” with factory design pattern. \n•\tDeploy web service application on glassfish on local machine and testing against local. \n•\tRequest QA environments push to release management team and verify push successful by running smoke test. \n•\tCoordinate with developers on SVN/git brunching, build and deploy on team server for testing. \n•\tBeing a member of team that apply agile methodology, participate in scrum daily stand up, scoring, planning, review and retrospective. \n•\tBuild connection to database using pain JDBC connection and DAOs, reversal engine Hibernate model object and DAOs used for testing. \n•\tWork with DBDs DEVs on solving any exceptions or issue after push to QA and DEV environments. Software QA Engineer eBay Inc November 2012  –  September 2014  (1 year 11 months) Timonium, MD, USA •\tResponsible for the QA of the PayPal BillMeLater AuthEngine. Use groovy, spock and soapUI to do Integration test, end to end test, functionality test, regression test and smoke test for new features and changes in Java developed SOAP and RESTful WebService. \n•\tAccomplish sprint task of the DEV team and contribute to the CI build and Regression Test of the QA team. \n•\tResponsible for updating and maintaining the core testing API project “WhiteShark” which is our fundamental testing Library writing in groovy as a maven project. \n•\tDesign service layer testing API with QAs, implement Bamboo/Jenkins CI build for nightly build and smoke test after each push. \n•\tDevelop Web Service client in “WhiteShark” with factory design pattern. \n•\tDeploy web service application on glassfish on local machine and testing against local. \n•\tRequest QA environments push to release management team and verify push successful by running smoke test. \n•\tCoordinate with developers on SVN/git brunching, build and deploy on team server for testing. \n•\tBeing a member of team that apply agile methodology, participate in scrum daily stand up, scoring, planning, review and retrospective. \n•\tBuild connection to database using pain JDBC connection and DAOs, reversal engine Hibernate model object and DAOs used for testing. \n•\tWork with DBDs DEVs on solving any exceptions or issue after push to QA and DEV environments. Java Developer eTeam May 2012  –  October 2012  (6 months) South Plainfield, NJ, USA •\tDevelopment web service using Java Technologies: Spring framework, Hibernate, JMS, EJB, JAXB, JTA, JPA. \n•\tPair programming with senior java developers and complete sprint stories. \n•\tWrite and wired up processers in business logic flow, update Spring configure class or xml file. \n•\tCreate data model and DAO layer with Hibernate, configure hibernate mapping file with one-to-one, one-to-many and many-to-many relationship. \n•\tCreate Web Service end point and writing marshaller and unmarshaller. \n•\tAssociate with DBDs to update DAOs with data model changes. \n•\tUpdate and create database push script with PL/SQL. Java Developer eTeam May 2012  –  October 2012  (6 months) South Plainfield, NJ, USA •\tDevelopment web service using Java Technologies: Spring framework, Hibernate, JMS, EJB, JAXB, JTA, JPA. \n•\tPair programming with senior java developers and complete sprint stories. \n•\tWrite and wired up processers in business logic flow, update Spring configure class or xml file. \n•\tCreate data model and DAO layer with Hibernate, configure hibernate mapping file with one-to-one, one-to-many and many-to-many relationship. \n•\tCreate Web Service end point and writing marshaller and unmarshaller. \n•\tAssociate with DBDs to update DAOs with data model changes. \n•\tUpdate and create database push script with PL/SQL. Web Developer CulturePlay LLC October 2011  –  May 2012  (8 months) Brooklyn, NY, USA •\tFront end development, with JSP and MVC \n•\tUse Dreamweaver, HTML, CSS, JavaScript, JQuery to do web page development. \n•\tDeveloping web game for children education. \n•\tCommunicate with tech lead weekly to report progress and sync business requirements. Web Developer CulturePlay LLC October 2011  –  May 2012  (8 months) Brooklyn, NY, USA •\tFront end development, with JSP and MVC \n•\tUse Dreamweaver, HTML, CSS, JavaScript, JQuery to do web page development. \n•\tDeveloping web game for children education. \n•\tCommunicate with tech lead weekly to report progress and sync business requirements. Languages English Chinese English Chinese English Chinese Skills JavaScript SQL CSS Databases .NET Java Oracle PL/SQL JSP Unix Shell Scripting Microsoft SQL Server C++ Hibernate 3.1 Spring HTML MVC DAO XML JavaServlets Ant Maven Git J2EE Web Services SOAP RESTful WebServices JAXB JPA JTA ORM See 14+     See less Skills  JavaScript SQL CSS Databases .NET Java Oracle PL/SQL JSP Unix Shell Scripting Microsoft SQL Server C++ Hibernate 3.1 Spring HTML MVC DAO XML JavaServlets Ant Maven Git J2EE Web Services SOAP RESTful WebServices JAXB JPA JTA ORM See 14+     See less JavaScript SQL CSS Databases .NET Java Oracle PL/SQL JSP Unix Shell Scripting Microsoft SQL Server C++ Hibernate 3.1 Spring HTML MVC DAO XML JavaServlets Ant Maven Git J2EE Web Services SOAP RESTful WebServices JAXB JPA JTA ORM See 14+     See less JavaScript SQL CSS Databases .NET Java Oracle PL/SQL JSP Unix Shell Scripting Microsoft SQL Server C++ Hibernate 3.1 Spring HTML MVC DAO XML JavaServlets Ant Maven Git J2EE Web Services SOAP RESTful WebServices JAXB JPA JTA ORM See 14+     See less Education New York University Master of Science (M.S.),  Computer Science , A 2010  – 2012 Beijing University of Post and Telecommunications Bachelor's degree,  Automation , A 2005  – 2009 New York University Master of Science (M.S.),  Computer Science , A 2010  – 2012 New York University Master of Science (M.S.),  Computer Science , A 2010  – 2012 New York University Master of Science (M.S.),  Computer Science , A 2010  – 2012 Beijing University of Post and Telecommunications Bachelor's degree,  Automation , A 2005  – 2009 Beijing University of Post and Telecommunications Bachelor's degree,  Automation , A 2005  – 2009 Beijing University of Post and Telecommunications Bachelor's degree,  Automation , A 2005  – 2009 ", "Summary QA Summary QA QA QA Experience tester Motorola QA Engineer yahoo testing tester Motorola tester Motorola QA Engineer yahoo testing QA Engineer yahoo testing Languages English tamil Hindi malayalam kannada telugu English tamil Hindi malayalam kannada telugu English tamil Hindi malayalam kannada telugu ", "Experience QA Engineer Yahoo QA Engineer Yahoo QA Engineer Yahoo Education Visvesvaraya Technological University 2001  – 2005 Visvesvaraya Technological University 2001  – 2005 Visvesvaraya Technological University 2001  – 2005 Visvesvaraya Technological University 2001  – 2005 ", "Experience Senior QA Engineer Yahoo! February 2010  – Present (5 years 7 months) QA Engineer VMware July 2008  –  February 2010  (1 year 8 months) Senior QA Engineer Yahoo! February 2010  – Present (5 years 7 months) Senior QA Engineer Yahoo! February 2010  – Present (5 years 7 months) QA Engineer VMware July 2008  –  February 2010  (1 year 8 months) QA Engineer VMware July 2008  –  February 2010  (1 year 8 months) Skills SilkTest Test Automation Selenium Bugzilla TestNG Agile Methodologies Perforce Software Quality... Perl Java JUnit Test Planning Python JIRA Linux Test Automation... Scrum JMeter Eclipse White Box Testing See 5+     See less Skills  SilkTest Test Automation Selenium Bugzilla TestNG Agile Methodologies Perforce Software Quality... Perl Java JUnit Test Planning Python JIRA Linux Test Automation... Scrum JMeter Eclipse White Box Testing See 5+     See less SilkTest Test Automation Selenium Bugzilla TestNG Agile Methodologies Perforce Software Quality... Perl Java JUnit Test Planning Python JIRA Linux Test Automation... Scrum JMeter Eclipse White Box Testing See 5+     See less SilkTest Test Automation Selenium Bugzilla TestNG Agile Methodologies Perforce Software Quality... Perl Java JUnit Test Planning Python JIRA Linux Test Automation... Scrum JMeter Eclipse White Box Testing See 5+     See less Education Chetana English School Chetana English School Chetana English School Chetana English School ", "Experience QA Engineer Yahoo! QA Engineer Yahoo! QA Engineer Yahoo! Education University of California, Davis 1998  – 2003 University of California, Davis 1998  – 2003 University of California, Davis 1998  – 2003 University of California, Davis 1998  – 2003 "]}