{"position": "Summer Intern - Hourly", "company": "Google", "profiles": ["Experience Postdoctoral Researcher NC State University August 2015  – Present (1 month) Research Assistant North Carolina State University May 2009  –  July 2015  (6 years 3 months) Software Engineering Research Test Architect - Level 1 @ Accenture Technology Labs Accenture May 2013  –  August 2013  (4 months) San Jose, California Research Intern @ IBM India Research Labs IBM May 2011  –  August 2011  (4 months) Banglore, India Studied evolution of unit test suite evolution of large-scale open source software targeted towards automated fixing of broken unit tests. Research Intern @ Software Engineering Research Lab FDA August 2011  –  2011  (less than a year) White Oak, Silver Spring, MD Developed Natural Langage processing techniques to perform semantic inference of information targeted towards automated signal processing of adverse event reports in medical devices. Summer Intern @ Software Engineering Research Lab FDA May 2010  –  August 2010  (4 months) White Oak, Silver Spring, MD Developed information retrieval framework to handle big data (huge volume of adverse event reports) targeted towards automated signal processing of adverse event reports in medical devices. Software Engineer Hughes Systique Corporation July 2007  –  December 2008  (1 year 6 months) Worked on two projects  \n1. In house research project revolving around VoIP (SIP - XMPP) \n2. Worked on a EMS Project with HNS as the client. Postdoctoral Researcher NC State University August 2015  – Present (1 month) Postdoctoral Researcher NC State University August 2015  – Present (1 month) Research Assistant North Carolina State University May 2009  –  July 2015  (6 years 3 months) Software Engineering Research Research Assistant North Carolina State University May 2009  –  July 2015  (6 years 3 months) Software Engineering Research Test Architect - Level 1 @ Accenture Technology Labs Accenture May 2013  –  August 2013  (4 months) San Jose, California Test Architect - Level 1 @ Accenture Technology Labs Accenture May 2013  –  August 2013  (4 months) San Jose, California Research Intern @ IBM India Research Labs IBM May 2011  –  August 2011  (4 months) Banglore, India Studied evolution of unit test suite evolution of large-scale open source software targeted towards automated fixing of broken unit tests. Research Intern @ IBM India Research Labs IBM May 2011  –  August 2011  (4 months) Banglore, India Studied evolution of unit test suite evolution of large-scale open source software targeted towards automated fixing of broken unit tests. Research Intern @ Software Engineering Research Lab FDA August 2011  –  2011  (less than a year) White Oak, Silver Spring, MD Developed Natural Langage processing techniques to perform semantic inference of information targeted towards automated signal processing of adverse event reports in medical devices. Research Intern @ Software Engineering Research Lab FDA August 2011  –  2011  (less than a year) White Oak, Silver Spring, MD Developed Natural Langage processing techniques to perform semantic inference of information targeted towards automated signal processing of adverse event reports in medical devices. Summer Intern @ Software Engineering Research Lab FDA May 2010  –  August 2010  (4 months) White Oak, Silver Spring, MD Developed information retrieval framework to handle big data (huge volume of adverse event reports) targeted towards automated signal processing of adverse event reports in medical devices. Summer Intern @ Software Engineering Research Lab FDA May 2010  –  August 2010  (4 months) White Oak, Silver Spring, MD Developed information retrieval framework to handle big data (huge volume of adverse event reports) targeted towards automated signal processing of adverse event reports in medical devices. Software Engineer Hughes Systique Corporation July 2007  –  December 2008  (1 year 6 months) Worked on two projects  \n1. In house research project revolving around VoIP (SIP - XMPP) \n2. Worked on a EMS Project with HNS as the client. Software Engineer Hughes Systique Corporation July 2007  –  December 2008  (1 year 6 months) Worked on two projects  \n1. In house research project revolving around VoIP (SIP - XMPP) \n2. Worked on a EMS Project with HNS as the client. Skills Software Engineering Software Verification Program Analysis Text Mining Information Retrieval Research Algorithms Data Structures Java JSP Core Java Eclipse Natural Language... Computer Science Programming Software Development Unix ClearCase XML Object Oriented Design Tomcat JavaScript Design Patterns See 8+     See less Skills  Software Engineering Software Verification Program Analysis Text Mining Information Retrieval Research Algorithms Data Structures Java JSP Core Java Eclipse Natural Language... Computer Science Programming Software Development Unix ClearCase XML Object Oriented Design Tomcat JavaScript Design Patterns See 8+     See less Software Engineering Software Verification Program Analysis Text Mining Information Retrieval Research Algorithms Data Structures Java JSP Core Java Eclipse Natural Language... Computer Science Programming Software Development Unix ClearCase XML Object Oriented Design Tomcat JavaScript Design Patterns See 8+     See less Software Engineering Software Verification Program Analysis Text Mining Information Retrieval Research Algorithms Data Structures Java JSP Core Java Eclipse Natural Language... Computer Science Programming Software Development Unix ClearCase XML Object Oriented Design Tomcat JavaScript Design Patterns See 8+     See less Education North Carolina State University PhD.,  Computer Science 2010  – 2015 North Carolina State University MS,  Computer Science 2009  – 2011 University of Pune Engineering(BE),  Computer Science 2003  – 2007 North Carolina State University PhD.,  Computer Science 2010  – 2015 North Carolina State University PhD.,  Computer Science 2010  – 2015 North Carolina State University PhD.,  Computer Science 2010  – 2015 North Carolina State University MS,  Computer Science 2009  – 2011 North Carolina State University MS,  Computer Science 2009  – 2011 North Carolina State University MS,  Computer Science 2009  – 2011 University of Pune Engineering(BE),  Computer Science 2003  – 2007 University of Pune Engineering(BE),  Computer Science 2003  – 2007 University of Pune Engineering(BE),  Computer Science 2003  – 2007 ", "Experience Student Ambassador Semcon August 2015  – Present (1 month) Gothenburg, Sweden Summer Intern, Software Engineering Jeppesen, a Boeing Company June 2015  –  July 2015  (2 months) Gothenburg, Sweden Corporate Event Manager CHARM 2015 - Chalmers Student Union July 2014  –  June 2015  (1 year) Chalmers University of Technology CHARM 2015 was the Chalmers Student Union Work Fair for the semester of 2015 and is the largest work fair in the Nordics. I was in charge of all corporate events both during and before the fair. This included lectures, workshops, study visits etc. Main tasks included organizing the events and contacting companies interested in participating at CHARM. In addition to this I was responsible for a new technology exhibit named \"CHARMtech\" for CHARM2015. I also supervised three members from the Project Group as well as several hosts during the fair. This included giving them tasks to do before and during the fair as well as overseeing their work and providing them with input and support. Summer Intern - Software Developer Jeppesen June 2014  –  August 2014  (3 months) Gothenburg, Sweden Assisted one of teams with everyday tasks. Most of the work was conducted in Java, Eclipse RCP and Python. The summer internship provided valuable insight into how large scale software is written, tested, deployed and maintained. In addition to this, the importance of TDD and well designed objective-oriented code (according to SOLID and following general guidelines such as the ones found in \"Clean Code\") was highly emphasized, which resulted in a better understanding of how to approach design of software systems. Software Developer Ericsson June 2012  –  September 2012  (4 months) Gothenburg, Sweden Enabling and conducting tests with Erlang QuickCheck of RBS related software. Software Developer Ericsson June 2011  –  August 2011  (3 months) Sweden Software testing (Erlang QuickCheck). Student Ambassador Semcon August 2015  – Present (1 month) Gothenburg, Sweden Student Ambassador Semcon August 2015  – Present (1 month) Gothenburg, Sweden Summer Intern, Software Engineering Jeppesen, a Boeing Company June 2015  –  July 2015  (2 months) Gothenburg, Sweden Summer Intern, Software Engineering Jeppesen, a Boeing Company June 2015  –  July 2015  (2 months) Gothenburg, Sweden Corporate Event Manager CHARM 2015 - Chalmers Student Union July 2014  –  June 2015  (1 year) Chalmers University of Technology CHARM 2015 was the Chalmers Student Union Work Fair for the semester of 2015 and is the largest work fair in the Nordics. I was in charge of all corporate events both during and before the fair. This included lectures, workshops, study visits etc. Main tasks included organizing the events and contacting companies interested in participating at CHARM. In addition to this I was responsible for a new technology exhibit named \"CHARMtech\" for CHARM2015. I also supervised three members from the Project Group as well as several hosts during the fair. This included giving them tasks to do before and during the fair as well as overseeing their work and providing them with input and support. Corporate Event Manager CHARM 2015 - Chalmers Student Union July 2014  –  June 2015  (1 year) Chalmers University of Technology CHARM 2015 was the Chalmers Student Union Work Fair for the semester of 2015 and is the largest work fair in the Nordics. I was in charge of all corporate events both during and before the fair. This included lectures, workshops, study visits etc. Main tasks included organizing the events and contacting companies interested in participating at CHARM. In addition to this I was responsible for a new technology exhibit named \"CHARMtech\" for CHARM2015. I also supervised three members from the Project Group as well as several hosts during the fair. This included giving them tasks to do before and during the fair as well as overseeing their work and providing them with input and support. Summer Intern - Software Developer Jeppesen June 2014  –  August 2014  (3 months) Gothenburg, Sweden Assisted one of teams with everyday tasks. Most of the work was conducted in Java, Eclipse RCP and Python. The summer internship provided valuable insight into how large scale software is written, tested, deployed and maintained. In addition to this, the importance of TDD and well designed objective-oriented code (according to SOLID and following general guidelines such as the ones found in \"Clean Code\") was highly emphasized, which resulted in a better understanding of how to approach design of software systems. Summer Intern - Software Developer Jeppesen June 2014  –  August 2014  (3 months) Gothenburg, Sweden Assisted one of teams with everyday tasks. Most of the work was conducted in Java, Eclipse RCP and Python. The summer internship provided valuable insight into how large scale software is written, tested, deployed and maintained. In addition to this, the importance of TDD and well designed objective-oriented code (according to SOLID and following general guidelines such as the ones found in \"Clean Code\") was highly emphasized, which resulted in a better understanding of how to approach design of software systems. Software Developer Ericsson June 2012  –  September 2012  (4 months) Gothenburg, Sweden Enabling and conducting tests with Erlang QuickCheck of RBS related software. Software Developer Ericsson June 2012  –  September 2012  (4 months) Gothenburg, Sweden Enabling and conducting tests with Erlang QuickCheck of RBS related software. Software Developer Ericsson June 2011  –  August 2011  (3 months) Sweden Software testing (Erlang QuickCheck). Software Developer Ericsson June 2011  –  August 2011  (3 months) Sweden Software testing (Erlang QuickCheck). Languages English Full professional proficiency Swedish Native or bilingual proficiency Serbian Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Swedish Native or bilingual proficiency Serbian Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Swedish Native or bilingual proficiency Serbian Native or bilingual proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Simulink Matlab Engineering Erlang C++ Software Development Business Development Capital Budgeting Mathematical Modeling Control Systems Design Digital Signal... Logistics Embedded Systems Numerical Simulation Microsoft Excel Java C Linux CAD Catia Python Django Git See 8+     See less Skills  Simulink Matlab Engineering Erlang C++ Software Development Business Development Capital Budgeting Mathematical Modeling Control Systems Design Digital Signal... Logistics Embedded Systems Numerical Simulation Microsoft Excel Java C Linux CAD Catia Python Django Git See 8+     See less Simulink Matlab Engineering Erlang C++ Software Development Business Development Capital Budgeting Mathematical Modeling Control Systems Design Digital Signal... Logistics Embedded Systems Numerical Simulation Microsoft Excel Java C Linux CAD Catia Python Django Git See 8+     See less Simulink Matlab Engineering Erlang C++ Software Development Business Development Capital Budgeting Mathematical Modeling Control Systems Design Digital Signal... Logistics Embedded Systems Numerical Simulation Microsoft Excel Java C Linux CAD Catia Python Django Git See 8+     See less Education Chalmers University of Technology Master's Degree,  Systems, Controls & Mechatronics 2014  – 2016 School of Economics and Commercial Law, Göteborg University Bachelor of Science (B.Sc.),  Business Administration - Industrial and Financial Management 2012  – 2014 Chalmers tekniska högskola / Chalmers University of Technology Bachelor of Science (B.Sc.),  Mechatronics , Robotics, and Automation Engineering 2010  – 2013 Sigrid Rudebecks Chalmers University of Technology Master's Degree,  Systems, Controls & Mechatronics 2014  – 2016 Chalmers University of Technology Master's Degree,  Systems, Controls & Mechatronics 2014  – 2016 Chalmers University of Technology Master's Degree,  Systems, Controls & Mechatronics 2014  – 2016 School of Economics and Commercial Law, Göteborg University Bachelor of Science (B.Sc.),  Business Administration - Industrial and Financial Management 2012  – 2014 School of Economics and Commercial Law, Göteborg University Bachelor of Science (B.Sc.),  Business Administration - Industrial and Financial Management 2012  – 2014 School of Economics and Commercial Law, Göteborg University Bachelor of Science (B.Sc.),  Business Administration - Industrial and Financial Management 2012  – 2014 Chalmers tekniska högskola / Chalmers University of Technology Bachelor of Science (B.Sc.),  Mechatronics , Robotics, and Automation Engineering 2010  – 2013 Chalmers tekniska högskola / Chalmers University of Technology Bachelor of Science (B.Sc.),  Mechatronics , Robotics, and Automation Engineering 2010  – 2013 Chalmers tekniska högskola / Chalmers University of Technology Bachelor of Science (B.Sc.),  Mechatronics , Robotics, and Automation Engineering 2010  – 2013 Sigrid Rudebecks Sigrid Rudebecks Sigrid Rudebecks Honors & Awards ", "Experience Software developer--Physical Modeling Group The MathWorks, Inc. Summer intern (software engineering) Akamai Technologies 2000  –  2000  (less than a year) Software developer--Physical Modeling Group The MathWorks, Inc. Software developer--Physical Modeling Group The MathWorks, Inc. Summer intern (software engineering) Akamai Technologies 2000  –  2000  (less than a year) Summer intern (software engineering) Akamai Technologies 2000  –  2000  (less than a year) Skills Matlab Software Development C++ Software Engineering C Algorithms Programming Skills  Matlab Software Development C++ Software Engineering C Algorithms Programming Matlab Software Development C++ Software Engineering C Algorithms Programming Matlab Software Development C++ Software Engineering C Algorithms Programming Education Massachusetts Institute of Technology Massachusetts Institute of Technology Massachusetts Institute of Technology Massachusetts Institute of Technology ", "Experience Summer Intern - Software Engineering NASA Glenn Research Center May 2015  – Present (4 months) Cleveland, Ohio Area Student Independent Research Intern JPL (NASA's Jet Propulsion Laboratory) September 2014  –  December 2014  (4 months) Pasadena, CA Senior Financial Analyst - Theatrical Participations Universal Pictures, NBCUniversal, Inc. June 2013  –  February 2014  (9 months) Senior Analyst Warner Bros. Entertainment Group of Companies June 2011  –  June 2013  (2 years 1 month) Internal Audit Intern DreamWorks Animation September 2010  –  May 2011  (9 months) Business Development Intern California Medical Systems January 2011  –  April 2011  (4 months) Summer Intern - Software Engineering NASA Glenn Research Center May 2015  – Present (4 months) Cleveland, Ohio Area Summer Intern - Software Engineering NASA Glenn Research Center May 2015  – Present (4 months) Cleveland, Ohio Area Student Independent Research Intern JPL (NASA's Jet Propulsion Laboratory) September 2014  –  December 2014  (4 months) Pasadena, CA Student Independent Research Intern JPL (NASA's Jet Propulsion Laboratory) September 2014  –  December 2014  (4 months) Pasadena, CA Senior Financial Analyst - Theatrical Participations Universal Pictures, NBCUniversal, Inc. June 2013  –  February 2014  (9 months) Senior Financial Analyst - Theatrical Participations Universal Pictures, NBCUniversal, Inc. June 2013  –  February 2014  (9 months) Senior Analyst Warner Bros. Entertainment Group of Companies June 2011  –  June 2013  (2 years 1 month) Senior Analyst Warner Bros. Entertainment Group of Companies June 2011  –  June 2013  (2 years 1 month) Internal Audit Intern DreamWorks Animation September 2010  –  May 2011  (9 months) Internal Audit Intern DreamWorks Animation September 2010  –  May 2011  (9 months) Business Development Intern California Medical Systems January 2011  –  April 2011  (4 months) Business Development Intern California Medical Systems January 2011  –  April 2011  (4 months) Languages Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Software Development Software Design Data Analysis Process Improvement Forecasting Financial Modeling Financial Analysis Financial Reporting SAP Internal Controls Business Analysis Skills  Software Development Software Design Data Analysis Process Improvement Forecasting Financial Modeling Financial Analysis Financial Reporting SAP Internal Controls Business Analysis Software Development Software Design Data Analysis Process Improvement Forecasting Financial Modeling Financial Analysis Financial Reporting SAP Internal Controls Business Analysis Software Development Software Design Data Analysis Process Improvement Forecasting Financial Modeling Financial Analysis Financial Reporting SAP Internal Controls Business Analysis Education University of California, San Diego University of California, San Diego University of California, San Diego University of California, San Diego Honors & Awards ", "Summary Information technology professional with a focus on business analysis for application development. Current role at McDonald's involves the elicitation and management of detailed requirements for desktop, web-based, and mobile solutions across multiple departments. Also responsible for the design and testing of application data, functionality, and usability. Previous experience includes 4+ years at a global consulting firm, with clients spanning a wide variety of industries. Strong advocate for communication and documentation that is effective at keeping both business and technical teams in sync, resulting in intuitive user experiences and fulfillment of stakeholder goals. Summary Information technology professional with a focus on business analysis for application development. Current role at McDonald's involves the elicitation and management of detailed requirements for desktop, web-based, and mobile solutions across multiple departments. Also responsible for the design and testing of application data, functionality, and usability. Previous experience includes 4+ years at a global consulting firm, with clients spanning a wide variety of industries. Strong advocate for communication and documentation that is effective at keeping both business and technical teams in sync, resulting in intuitive user experiences and fulfillment of stakeholder goals. Information technology professional with a focus on business analysis for application development. Current role at McDonald's involves the elicitation and management of detailed requirements for desktop, web-based, and mobile solutions across multiple departments. Also responsible for the design and testing of application data, functionality, and usability. Previous experience includes 4+ years at a global consulting firm, with clients spanning a wide variety of industries. Strong advocate for communication and documentation that is effective at keeping both business and technical teams in sync, resulting in intuitive user experiences and fulfillment of stakeholder goals. Information technology professional with a focus on business analysis for application development. Current role at McDonald's involves the elicitation and management of detailed requirements for desktop, web-based, and mobile solutions across multiple departments. Also responsible for the design and testing of application data, functionality, and usability. Previous experience includes 4+ years at a global consulting firm, with clients spanning a wide variety of industries. Strong advocate for communication and documentation that is effective at keeping both business and technical teams in sync, resulting in intuitive user experiences and fulfillment of stakeholder goals. Experience Senior Business Analyst, US IT McDonald's Corporation June 2015  – Present (3 months) Greater Chicago Area Business Technical Analyst, US IT McDonald's Corporation December 2012  –  May 2015  (2 years 6 months) Greater Chicago Area Consultant, Systems Integration and Technology Accenture July 2008  –  November 2012  (4 years 5 months) Greater Chicago Area Summer Intern, Software Engineering Motorola May 2006  –  August 2007  (1 year 4 months) Greater Chicago Area Senior Business Analyst, US IT McDonald's Corporation June 2015  – Present (3 months) Greater Chicago Area Senior Business Analyst, US IT McDonald's Corporation June 2015  – Present (3 months) Greater Chicago Area Business Technical Analyst, US IT McDonald's Corporation December 2012  –  May 2015  (2 years 6 months) Greater Chicago Area Business Technical Analyst, US IT McDonald's Corporation December 2012  –  May 2015  (2 years 6 months) Greater Chicago Area Consultant, Systems Integration and Technology Accenture July 2008  –  November 2012  (4 years 5 months) Greater Chicago Area Consultant, Systems Integration and Technology Accenture July 2008  –  November 2012  (4 years 5 months) Greater Chicago Area Summer Intern, Software Engineering Motorola May 2006  –  August 2007  (1 year 4 months) Greater Chicago Area Summer Intern, Software Engineering Motorola May 2006  –  August 2007  (1 year 4 months) Greater Chicago Area Skills Skills     Education University of Notre Dame Bachelor of Science,  Computer Engineering 2004  – 2008 Activities and Societies:  Joint Engineering Council ,  Interhall Athletics Commissioner ,  WVFI Radio Show Host St. Laurence High School 2000  – 2004 University of Notre Dame Bachelor of Science,  Computer Engineering 2004  – 2008 Activities and Societies:  Joint Engineering Council ,  Interhall Athletics Commissioner ,  WVFI Radio Show Host University of Notre Dame Bachelor of Science,  Computer Engineering 2004  – 2008 Activities and Societies:  Joint Engineering Council ,  Interhall Athletics Commissioner ,  WVFI Radio Show Host University of Notre Dame Bachelor of Science,  Computer Engineering 2004  – 2008 Activities and Societies:  Joint Engineering Council ,  Interhall Athletics Commissioner ,  WVFI Radio Show Host St. Laurence High School 2000  – 2004 St. Laurence High School 2000  – 2004 St. Laurence High School 2000  – 2004 ", "Experience Analyst/Programmer GIRO May 2012  – Present (3 years 4 months) summer intern (software engineering) Dental Wings May 2011  –  August 2011  (4 months) summer intern (software engineering) CAE May 2010  –  August 2010  (4 months) Analyst/Programmer GIRO May 2012  – Present (3 years 4 months) Analyst/Programmer GIRO May 2012  – Present (3 years 4 months) summer intern (software engineering) Dental Wings May 2011  –  August 2011  (4 months) summer intern (software engineering) Dental Wings May 2011  –  August 2011  (4 months) summer intern (software engineering) CAE May 2010  –  August 2010  (4 months) summer intern (software engineering) CAE May 2010  –  August 2010  (4 months) Education École Polytechnique de Montréal Computer Engineering 2008  – 2012 École Polytechnique de Montréal Computer Engineering 2008  – 2012 École Polytechnique de Montréal Computer Engineering 2008  – 2012 École Polytechnique de Montréal Computer Engineering 2008  – 2012 ", "Summary Specialties:Java and C/C++ programming Summary Specialties:Java and C/C++ programming Specialties:Java and C/C++ programming Specialties:Java and C/C++ programming Experience Programmer Analyst Professional Computer Sciences Corporation April 2010  – Present (5 years 5 months) - Programming Teamcenter customizations for Electric Boat using C and ITK (library of functions provided by Siemens) \n- Configuring Teamcenter environments \n- Java programming \n- Experience throughout the software lifecycle: requirements, software specification document, coding, code review, test plan, and testing. Summer Intern - Software Engineering Knolls Atomic Power Laboratory May 2009  –  July 2009  (3 months) •\tWorked collaboratively with a team of software engineers to help design and develop an API for processing of XML files used as input to physics and thermal-hydraulic design analysis. \n•\tSoftware written in Java using object-oriented design with multi-level class structure. \n•\tClass structure designed for re-use within a Graphical User Interface (GUI). \n•\tCompleted reading from and writing to an XML file using JAXB. \n•\tIsolated applications from changes to the XML format by encapsulating JAXB generated Java classes. \n•\tDeveloped prototype of GUI application that will interact with the API. \n•\tWrote Junit test cases for each Java class that was developed. \n•\tSoftware tools used: Eclipse, XMLSpy, Subversion, WinCVS, JAXB. Summer Intern - IT AT&T June 2008  –  August 2008  (3 months) •\tUsed SQL to update/query databases to fix bugs regarding billing issues. \n•\tWorked in a team environment where communication was valued. Programmer Analyst Professional Computer Sciences Corporation April 2010  – Present (5 years 5 months) - Programming Teamcenter customizations for Electric Boat using C and ITK (library of functions provided by Siemens) \n- Configuring Teamcenter environments \n- Java programming \n- Experience throughout the software lifecycle: requirements, software specification document, coding, code review, test plan, and testing. Programmer Analyst Professional Computer Sciences Corporation April 2010  – Present (5 years 5 months) - Programming Teamcenter customizations for Electric Boat using C and ITK (library of functions provided by Siemens) \n- Configuring Teamcenter environments \n- Java programming \n- Experience throughout the software lifecycle: requirements, software specification document, coding, code review, test plan, and testing. Summer Intern - Software Engineering Knolls Atomic Power Laboratory May 2009  –  July 2009  (3 months) •\tWorked collaboratively with a team of software engineers to help design and develop an API for processing of XML files used as input to physics and thermal-hydraulic design analysis. \n•\tSoftware written in Java using object-oriented design with multi-level class structure. \n•\tClass structure designed for re-use within a Graphical User Interface (GUI). \n•\tCompleted reading from and writing to an XML file using JAXB. \n•\tIsolated applications from changes to the XML format by encapsulating JAXB generated Java classes. \n•\tDeveloped prototype of GUI application that will interact with the API. \n•\tWrote Junit test cases for each Java class that was developed. \n•\tSoftware tools used: Eclipse, XMLSpy, Subversion, WinCVS, JAXB. Summer Intern - Software Engineering Knolls Atomic Power Laboratory May 2009  –  July 2009  (3 months) •\tWorked collaboratively with a team of software engineers to help design and develop an API for processing of XML files used as input to physics and thermal-hydraulic design analysis. \n•\tSoftware written in Java using object-oriented design with multi-level class structure. \n•\tClass structure designed for re-use within a Graphical User Interface (GUI). \n•\tCompleted reading from and writing to an XML file using JAXB. \n•\tIsolated applications from changes to the XML format by encapsulating JAXB generated Java classes. \n•\tDeveloped prototype of GUI application that will interact with the API. \n•\tWrote Junit test cases for each Java class that was developed. \n•\tSoftware tools used: Eclipse, XMLSpy, Subversion, WinCVS, JAXB. Summer Intern - IT AT&T June 2008  –  August 2008  (3 months) •\tUsed SQL to update/query databases to fix bugs regarding billing issues. \n•\tWorked in a team environment where communication was valued. Summer Intern - IT AT&T June 2008  –  August 2008  (3 months) •\tUsed SQL to update/query databases to fix bugs regarding billing issues. \n•\tWorked in a team environment where communication was valued. Skills Eclipse Java SQL Software Engineering C++ C ITK Skills  Eclipse Java SQL Software Engineering C++ C ITK Eclipse Java SQL Software Engineering C++ C ITK Eclipse Java SQL Software Engineering C++ C ITK Education Clarkson University Bachelor of Science,  Software Engineering 2007  – 2009 SUNY Canton Associate,  Engineering Science 2005  – 2007 Clarkson University Bachelor of Science,  Software Engineering 2007  – 2009 Clarkson University Bachelor of Science,  Software Engineering 2007  – 2009 Clarkson University Bachelor of Science,  Software Engineering 2007  – 2009 SUNY Canton Associate,  Engineering Science 2005  – 2007 SUNY Canton Associate,  Engineering Science 2005  – 2007 SUNY Canton Associate,  Engineering Science 2005  – 2007 ", "Summary Deeply curious about understanding large-scale networks and how to better engineer and manage them. \n \nSpecialties: building high performance software, web development, internet infrastructure Summary Deeply curious about understanding large-scale networks and how to better engineer and manage them. \n \nSpecialties: building high performance software, web development, internet infrastructure Deeply curious about understanding large-scale networks and how to better engineer and manage them. \n \nSpecialties: building high performance software, web development, internet infrastructure Deeply curious about understanding large-scale networks and how to better engineer and manage them. \n \nSpecialties: building high performance software, web development, internet infrastructure Experience Senior Software Development Engineer Amazon January 2015  – Present (8 months) Principal Engineer Juniper Networks September 2013  –  December 2014  (1 year 4 months) Performance Team Lead Atlassian April 2012  –  September 2013  (1 year 6 months) Sydney Area, Australia Software Architect Riverbed Technology July 2011  –  March 2012  (9 months) Software Architect Zeus Technology April 2010  –  August 2011  (1 year 5 months) Responsible for the overall architecture of Zeus' products and working with partners in strategic relationships. Senior Software Engineer Zeus Technology 2003  –  April 2010  (7 years) Responsible for new feature design, development and testing in Zeus' product portfolio; mainly the ZXTM family of products. \n \nArchitect and technical lead for Zeus' ZXTM GLB product. Summer Intern - IT Support/Payroll Maintenance TransLink July 2002  –  October 2002  (4 months) Summer Intern - Software Engineering Ion Technologies July 2001  –  October 2001  (4 months) Summer Intern - Software Testing Nortel 1998  –  1999  (1 year) Senior Software Development Engineer Amazon January 2015  – Present (8 months) Senior Software Development Engineer Amazon January 2015  – Present (8 months) Principal Engineer Juniper Networks September 2013  –  December 2014  (1 year 4 months) Principal Engineer Juniper Networks September 2013  –  December 2014  (1 year 4 months) Performance Team Lead Atlassian April 2012  –  September 2013  (1 year 6 months) Sydney Area, Australia Performance Team Lead Atlassian April 2012  –  September 2013  (1 year 6 months) Sydney Area, Australia Software Architect Riverbed Technology July 2011  –  March 2012  (9 months) Software Architect Riverbed Technology July 2011  –  March 2012  (9 months) Software Architect Zeus Technology April 2010  –  August 2011  (1 year 5 months) Responsible for the overall architecture of Zeus' products and working with partners in strategic relationships. Software Architect Zeus Technology April 2010  –  August 2011  (1 year 5 months) Responsible for the overall architecture of Zeus' products and working with partners in strategic relationships. Senior Software Engineer Zeus Technology 2003  –  April 2010  (7 years) Responsible for new feature design, development and testing in Zeus' product portfolio; mainly the ZXTM family of products. \n \nArchitect and technical lead for Zeus' ZXTM GLB product. Senior Software Engineer Zeus Technology 2003  –  April 2010  (7 years) Responsible for new feature design, development and testing in Zeus' product portfolio; mainly the ZXTM family of products. \n \nArchitect and technical lead for Zeus' ZXTM GLB product. Summer Intern - IT Support/Payroll Maintenance TransLink July 2002  –  October 2002  (4 months) Summer Intern - IT Support/Payroll Maintenance TransLink July 2002  –  October 2002  (4 months) Summer Intern - Software Engineering Ion Technologies July 2001  –  October 2001  (4 months) Summer Intern - Software Engineering Ion Technologies July 2001  –  October 2001  (4 months) Summer Intern - Software Testing Nortel 1998  –  1999  (1 year) Summer Intern - Software Testing Nortel 1998  –  1999  (1 year) Skills Software Engineering Distributed Systems Linux Cloud Computing Unix Software Development Python Agile Methodologies Testing Web Development System Architecture SaaS Architecture TCP/IP JavaScript C++ Git Scala Enterprise Software Virtualization Perforce R Erlang Haskell See 9+     See less Skills  Software Engineering Distributed Systems Linux Cloud Computing Unix Software Development Python Agile Methodologies Testing Web Development System Architecture SaaS Architecture TCP/IP JavaScript C++ Git Scala Enterprise Software Virtualization Perforce R Erlang Haskell See 9+     See less Software Engineering Distributed Systems Linux Cloud Computing Unix Software Development Python Agile Methodologies Testing Web Development System Architecture SaaS Architecture TCP/IP JavaScript C++ Git Scala Enterprise Software Virtualization Perforce R Erlang Haskell See 9+     See less Software Engineering Distributed Systems Linux Cloud Computing Unix Software Development Python Agile Methodologies Testing Web Development System Architecture SaaS Architecture TCP/IP JavaScript C++ Git Scala Enterprise Software Virtualization Perforce R Erlang Haskell See 9+     See less Education University of Cambridge 2:1,  Computer Science 2000  – 2003 University of Cambridge 2:1,  Computer Science 2000  – 2003 University of Cambridge 2:1,  Computer Science 2000  – 2003 University of Cambridge 2:1,  Computer Science 2000  – 2003 ", "Experience Undergraduate Hourly(Programmer) University of Illinois at Urbana-Champaign November 2013  – Present (1 year 10 months) * Collaborated with ECE professor and other Computer Science students to develop mixed-signal \nCAD software which utilizes Visual C++ and the .NET framework. R&D Summer Intern(Software Engineering) Dow AgroSciences May 2014  –  August 2014  (4 months) Collaborated with software engineers at Dow AgroSciences on an application to provide \nstatistical tools to agricultural chemists. \n* Developed a library to parse data stored in a legacy file format. \n* Refactored legacy code that was written in R into C# to improve performance and \nmaintainability. \n* Developed new user interface using C# and Windows Presentation Foundation. \n* Managed new and existing code with a version control system (SVN). \n* Regularly met with statisticians at Dow AgroSciences to discuss the user interface, system \nrequirements, and other application features. Undergraduate Hourly(Programmer) University of Illinois at Urbana-Champaign November 2013  – Present (1 year 10 months) * Collaborated with ECE professor and other Computer Science students to develop mixed-signal \nCAD software which utilizes Visual C++ and the .NET framework. Undergraduate Hourly(Programmer) University of Illinois at Urbana-Champaign November 2013  – Present (1 year 10 months) * Collaborated with ECE professor and other Computer Science students to develop mixed-signal \nCAD software which utilizes Visual C++ and the .NET framework. R&D Summer Intern(Software Engineering) Dow AgroSciences May 2014  –  August 2014  (4 months) Collaborated with software engineers at Dow AgroSciences on an application to provide \nstatistical tools to agricultural chemists. \n* Developed a library to parse data stored in a legacy file format. \n* Refactored legacy code that was written in R into C# to improve performance and \nmaintainability. \n* Developed new user interface using C# and Windows Presentation Foundation. \n* Managed new and existing code with a version control system (SVN). \n* Regularly met with statisticians at Dow AgroSciences to discuss the user interface, system \nrequirements, and other application features. R&D Summer Intern(Software Engineering) Dow AgroSciences May 2014  –  August 2014  (4 months) Collaborated with software engineers at Dow AgroSciences on an application to provide \nstatistical tools to agricultural chemists. \n* Developed a library to parse data stored in a legacy file format. \n* Refactored legacy code that was written in R into C# to improve performance and \nmaintainability. \n* Developed new user interface using C# and Windows Presentation Foundation. \n* Managed new and existing code with a version control system (SVN). \n* Regularly met with statisticians at Dow AgroSciences to discuss the user interface, system \nrequirements, and other application features. Education U of I Bachelor of Science (B.S.),  Computer Science , Junior 2012  – 2016 University of Illinois Bachelor of Science,  Computer Science U of I Bachelor of Science (B.S.),  Computer Science , Junior 2012  – 2016 U of I Bachelor of Science (B.S.),  Computer Science , Junior 2012  – 2016 U of I Bachelor of Science (B.S.),  Computer Science , Junior 2012  – 2016 University of Illinois Bachelor of Science,  Computer Science University of Illinois Bachelor of Science,  Computer Science University of Illinois Bachelor of Science,  Computer Science ", "Experience Project Manager LHP Software September 2011  – Present (4 years) C2ST Project Manager/Lead Architect LHP Software April 2006  –  May 2014  (8 years 2 months) Columbus, Indiana Area Senior Oracle Developer AAR Corp August 2005  –  March 2006  (8 months) Indianapolis, Indiana Area Business Systems Analyst/Oracle Developer Cummins Inc. May 1999  –  March 2005  (5 years 11 months) Columbus, Indiana Area Summer Intern - Software Engineering ITT Aerospace/Communications Division May 1998  –  August 1998  (4 months) Fort Wayne, Indiana Area Office Assistant HJS Sound Equipment June 1997  –  August 1997  (3 months) New Haven, Indiana Area Project Manager LHP Software September 2011  – Present (4 years) Project Manager LHP Software September 2011  – Present (4 years) C2ST Project Manager/Lead Architect LHP Software April 2006  –  May 2014  (8 years 2 months) Columbus, Indiana Area C2ST Project Manager/Lead Architect LHP Software April 2006  –  May 2014  (8 years 2 months) Columbus, Indiana Area Senior Oracle Developer AAR Corp August 2005  –  March 2006  (8 months) Indianapolis, Indiana Area Senior Oracle Developer AAR Corp August 2005  –  March 2006  (8 months) Indianapolis, Indiana Area Business Systems Analyst/Oracle Developer Cummins Inc. May 1999  –  March 2005  (5 years 11 months) Columbus, Indiana Area Business Systems Analyst/Oracle Developer Cummins Inc. May 1999  –  March 2005  (5 years 11 months) Columbus, Indiana Area Summer Intern - Software Engineering ITT Aerospace/Communications Division May 1998  –  August 1998  (4 months) Fort Wayne, Indiana Area Summer Intern - Software Engineering ITT Aerospace/Communications Division May 1998  –  August 1998  (4 months) Fort Wayne, Indiana Area Office Assistant HJS Sound Equipment June 1997  –  August 1997  (3 months) New Haven, Indiana Area Office Assistant HJS Sound Equipment June 1997  –  August 1997  (3 months) New Haven, Indiana Area Languages English English English Skills Embedded Software Software Development C Testing Software Engineering Oracle SDLC ClearCase Embedded Systems C# Engineering Requirements Analysis Software Project... Project Management Skills  Embedded Software Software Development C Testing Software Engineering Oracle SDLC ClearCase Embedded Systems C# Engineering Requirements Analysis Software Project... Project Management Embedded Software Software Development C Testing Software Engineering Oracle SDLC ClearCase Embedded Systems C# Engineering Requirements Analysis Software Project... Project Management Embedded Software Software Development C Testing Software Engineering Oracle SDLC ClearCase Embedded Systems C# Engineering Requirements Analysis Software Project... Project Management Education Indiana University - Kelley School of Business BS,  Computer Information Systems 1995  – 1999 Activities and Societies:  Honors Division ,  Business Honors ,  Toastmasters International ,  All Campus Band Indiana University - Kelley School of Business BS,  Computer Information Systems 1995  – 1999 Activities and Societies:  Honors Division ,  Business Honors ,  Toastmasters International ,  All Campus Band Indiana University - Kelley School of Business BS,  Computer Information Systems 1995  – 1999 Activities and Societies:  Honors Division ,  Business Honors ,  Toastmasters International ,  All Campus Band Indiana University - Kelley School of Business BS,  Computer Information Systems 1995  – 1999 Activities and Societies:  Honors Division ,  Business Honors ,  Toastmasters International ,  All Campus Band ", "Summary I am currently a senior student at University of Washington majoyed in Applied Computational Math Science and Computer Science. I also do lot of part time coding and I founded ZEL-studio (www.zel-studio.com) where a group of young student doing app development and had distrubuted to both Apple App store and Google Play store. currently looking full - time computer science relative position and internship oppertunity. Summary I am currently a senior student at University of Washington majoyed in Applied Computational Math Science and Computer Science. I also do lot of part time coding and I founded ZEL-studio (www.zel-studio.com) where a group of young student doing app development and had distrubuted to both Apple App store and Google Play store. currently looking full - time computer science relative position and internship oppertunity. I am currently a senior student at University of Washington majoyed in Applied Computational Math Science and Computer Science. I also do lot of part time coding and I founded ZEL-studio (www.zel-studio.com) where a group of young student doing app development and had distrubuted to both Apple App store and Google Play store. currently looking full - time computer science relative position and internship oppertunity. I am currently a senior student at University of Washington majoyed in Applied Computational Math Science and Computer Science. I also do lot of part time coding and I founded ZEL-studio (www.zel-studio.com) where a group of young student doing app development and had distrubuted to both Apple App store and Google Play store. currently looking full - time computer science relative position and internship oppertunity. Experience Teaching Assistant University of Washingt Web Programming class TA April 2014  – Present (1 year 5 months) University of Washington Lead a quiz discussion sections twice a week, and a lab section once a week. Holding IPL (office hours) two hours a week to help student with their homework problem, grade weekly assignments, midterms and finals. Researcher UW Ubiquitous Computing Lab Research January 2014  – Present (1 year 8 months) Greater Seattle Area Maitain and update all Ubiqutous Lab server and database with information processed by differnet testing devices around the world, manage POST request to different devices with status update from the server. Software Engineer TUNE June 2014  –  September 2014  (4 months) Greater Seattle Area Added multi-threads download, import, to the current Hadoop Map reduce model where improve the programs speed by up to 20% \n \nDevelop, testing and building a database manage system(infiniDB, Druid io) \n \nWrite bash script to test the infiniDB performance under special cases. Alignment software development for ATLAS Inner Detector at LHC Atlas September 2013  –  January 2014  (5 months) Greater Seattle Area Use C++ and Python to formulate and simulate particles move in three-dimensional space and build the alignment software to align the particles travel path. Technical Consultant University of Washington computer lab consultant: September 2013  –  December 2013  (4 months) University of Washington,Seattle Uses sell script to maintain and update all the computers under Windows, Mac OS, and Linux system in the art and science lab. Summer Internship Mobile team Sina Corporation June 2013  –  September 2013  (4 months) Beijing City, China Update and debug the Sina iOS news app, checking and maintaining the database, API modification, auto layout retouch, and some UI improvement. Summer Intern Software Engineering Mobiletrain.org June 2012  –  September 2012  (4 months) Beijing City, China Build the Soap, Socket, UDP, and media stream for the social media app that develop by mobilertrain.org Teaching Assistant University of Washingt Web Programming class TA April 2014  – Present (1 year 5 months) University of Washington Lead a quiz discussion sections twice a week, and a lab section once a week. Holding IPL (office hours) two hours a week to help student with their homework problem, grade weekly assignments, midterms and finals. Teaching Assistant University of Washingt Web Programming class TA April 2014  – Present (1 year 5 months) University of Washington Lead a quiz discussion sections twice a week, and a lab section once a week. Holding IPL (office hours) two hours a week to help student with their homework problem, grade weekly assignments, midterms and finals. Researcher UW Ubiquitous Computing Lab Research January 2014  – Present (1 year 8 months) Greater Seattle Area Maitain and update all Ubiqutous Lab server and database with information processed by differnet testing devices around the world, manage POST request to different devices with status update from the server. Researcher UW Ubiquitous Computing Lab Research January 2014  – Present (1 year 8 months) Greater Seattle Area Maitain and update all Ubiqutous Lab server and database with information processed by differnet testing devices around the world, manage POST request to different devices with status update from the server. Software Engineer TUNE June 2014  –  September 2014  (4 months) Greater Seattle Area Added multi-threads download, import, to the current Hadoop Map reduce model where improve the programs speed by up to 20% \n \nDevelop, testing and building a database manage system(infiniDB, Druid io) \n \nWrite bash script to test the infiniDB performance under special cases. Software Engineer TUNE June 2014  –  September 2014  (4 months) Greater Seattle Area Added multi-threads download, import, to the current Hadoop Map reduce model where improve the programs speed by up to 20% \n \nDevelop, testing and building a database manage system(infiniDB, Druid io) \n \nWrite bash script to test the infiniDB performance under special cases. Alignment software development for ATLAS Inner Detector at LHC Atlas September 2013  –  January 2014  (5 months) Greater Seattle Area Use C++ and Python to formulate and simulate particles move in three-dimensional space and build the alignment software to align the particles travel path. Alignment software development for ATLAS Inner Detector at LHC Atlas September 2013  –  January 2014  (5 months) Greater Seattle Area Use C++ and Python to formulate and simulate particles move in three-dimensional space and build the alignment software to align the particles travel path. Technical Consultant University of Washington computer lab consultant: September 2013  –  December 2013  (4 months) University of Washington,Seattle Uses sell script to maintain and update all the computers under Windows, Mac OS, and Linux system in the art and science lab. Technical Consultant University of Washington computer lab consultant: September 2013  –  December 2013  (4 months) University of Washington,Seattle Uses sell script to maintain and update all the computers under Windows, Mac OS, and Linux system in the art and science lab. Summer Internship Mobile team Sina Corporation June 2013  –  September 2013  (4 months) Beijing City, China Update and debug the Sina iOS news app, checking and maintaining the database, API modification, auto layout retouch, and some UI improvement. Summer Internship Mobile team Sina Corporation June 2013  –  September 2013  (4 months) Beijing City, China Update and debug the Sina iOS news app, checking and maintaining the database, API modification, auto layout retouch, and some UI improvement. Summer Intern Software Engineering Mobiletrain.org June 2012  –  September 2012  (4 months) Beijing City, China Build the Soap, Socket, UDP, and media stream for the social media app that develop by mobilertrain.org Summer Intern Software Engineering Mobiletrain.org June 2012  –  September 2012  (4 months) Beijing City, China Build the Soap, Socket, UDP, and media stream for the social media app that develop by mobilertrain.org Languages   Skills Java Objective-C Python Hadoop MapReduce Hive Pigs Cloud Computing HTML CSS JavaScript JSON Unix Shell Scripting Macintosh Applications Macintosh hardware C++ Language XML cloud Linux Software Engineering C++ Software Development Mobile Applications Databases Microsoft Office PHP Computer Science SQL C Bash See 15+     See less Skills  Java Objective-C Python Hadoop MapReduce Hive Pigs Cloud Computing HTML CSS JavaScript JSON Unix Shell Scripting Macintosh Applications Macintosh hardware C++ Language XML cloud Linux Software Engineering C++ Software Development Mobile Applications Databases Microsoft Office PHP Computer Science SQL C Bash See 15+     See less Java Objective-C Python Hadoop MapReduce Hive Pigs Cloud Computing HTML CSS JavaScript JSON Unix Shell Scripting Macintosh Applications Macintosh hardware C++ Language XML cloud Linux Software Engineering C++ Software Development Mobile Applications Databases Microsoft Office PHP Computer Science SQL C Bash See 15+     See less Java Objective-C Python Hadoop MapReduce Hive Pigs Cloud Computing HTML CSS JavaScript JSON Unix Shell Scripting Macintosh Applications Macintosh hardware C++ Language XML cloud Linux Software Engineering C++ Software Development Mobile Applications Databases Microsoft Office PHP Computer Science SQL C Bash See 15+     See less Education University of Washington Bachelor of Science (BS),  ACMS , CSE 2010  – 2015 University of Washington University of Washington Bachelor of Science (BS),  ACMS , CSE 2010  – 2015 University of Washington Bachelor of Science (BS),  ACMS , CSE 2010  – 2015 University of Washington Bachelor of Science (BS),  ACMS , CSE 2010  – 2015 University of Washington University of Washington University of Washington Honors & Awards ", "Summary Specialties:Hadoop, Database Systems, Query Processing, Query Optimization, Data Warehousing, Multidimensional Databases, Real time low latency data collection, large scale distributed systems, data pipelines, workflow scheduling. Summary Specialties:Hadoop, Database Systems, Query Processing, Query Optimization, Data Warehousing, Multidimensional Databases, Real time low latency data collection, large scale distributed systems, data pipelines, workflow scheduling. Specialties:Hadoop, Database Systems, Query Processing, Query Optimization, Data Warehousing, Multidimensional Databases, Real time low latency data collection, large scale distributed systems, data pipelines, workflow scheduling. Specialties:Hadoop, Database Systems, Query Processing, Query Optimization, Data Warehousing, Multidimensional Databases, Real time low latency data collection, large scale distributed systems, data pipelines, workflow scheduling. Experience VP Engineering, Data Electronic Arts April 2012  – Present (3 years 5 months) San Francisco Bay Area Senior Director, Engineering [Greenplum] EMC May 2011  –  April 2012  (1 year) San Francisco Bay Area Director, Engineering Yahoo! June 2006  –  May 2011  (5 years) San Francisco Bay Area Consulting Member of Technical Staff Oracle March 2006  –  May 2006  (3 months) Staff Engineer Siebel Systems November 2001  –  February 2006  (4 years 4 months) Staff Engineer nQuire January 2001  –  November 2001  (11 months) Summer Intern, Scalable Database Systems Group IBM T.J. Watson Research Center, Hawthorne NY May 1999  –  August 1999  (4 months) Summer Intern, Network Computing Research Group Bell Laboratories, Lucent Technologies, Murray Hill, NJ June 1998  –  August 1998  (3 months) Summer Intern, Software Engineering Research Group Bellcore Research (now Telcordia), Morristown, NJ June 1996  –  August 1996  (3 months) VP Engineering, Data Electronic Arts April 2012  – Present (3 years 5 months) San Francisco Bay Area VP Engineering, Data Electronic Arts April 2012  – Present (3 years 5 months) San Francisco Bay Area Senior Director, Engineering [Greenplum] EMC May 2011  –  April 2012  (1 year) San Francisco Bay Area Senior Director, Engineering [Greenplum] EMC May 2011  –  April 2012  (1 year) San Francisco Bay Area Director, Engineering Yahoo! June 2006  –  May 2011  (5 years) San Francisco Bay Area Director, Engineering Yahoo! June 2006  –  May 2011  (5 years) San Francisco Bay Area Consulting Member of Technical Staff Oracle March 2006  –  May 2006  (3 months) Consulting Member of Technical Staff Oracle March 2006  –  May 2006  (3 months) Staff Engineer Siebel Systems November 2001  –  February 2006  (4 years 4 months) Staff Engineer Siebel Systems November 2001  –  February 2006  (4 years 4 months) Staff Engineer nQuire January 2001  –  November 2001  (11 months) Staff Engineer nQuire January 2001  –  November 2001  (11 months) Summer Intern, Scalable Database Systems Group IBM T.J. Watson Research Center, Hawthorne NY May 1999  –  August 1999  (4 months) Summer Intern, Scalable Database Systems Group IBM T.J. Watson Research Center, Hawthorne NY May 1999  –  August 1999  (4 months) Summer Intern, Network Computing Research Group Bell Laboratories, Lucent Technologies, Murray Hill, NJ June 1998  –  August 1998  (3 months) Summer Intern, Network Computing Research Group Bell Laboratories, Lucent Technologies, Murray Hill, NJ June 1998  –  August 1998  (3 months) Summer Intern, Software Engineering Research Group Bellcore Research (now Telcordia), Morristown, NJ June 1996  –  August 1996  (3 months) Summer Intern, Software Engineering Research Group Bellcore Research (now Telcordia), Morristown, NJ June 1996  –  August 1996  (3 months) Skills Hadoop Data Warehousing Database Systems Query Optimization Distributed Systems Databases Machine Learning MapReduce Data Mining Cloud Computing Scalability Software Engineering Integration Information Retrieval Big Data Algorithms Grid Computing Unix Linux Enterprise Software Agile Methodologies Software Development Open Source Analytics REST System Architecture Leadership See 12+     See less Skills  Hadoop Data Warehousing Database Systems Query Optimization Distributed Systems Databases Machine Learning MapReduce Data Mining Cloud Computing Scalability Software Engineering Integration Information Retrieval Big Data Algorithms Grid Computing Unix Linux Enterprise Software Agile Methodologies Software Development Open Source Analytics REST System Architecture Leadership See 12+     See less Hadoop Data Warehousing Database Systems Query Optimization Distributed Systems Databases Machine Learning MapReduce Data Mining Cloud Computing Scalability Software Engineering Integration Information Retrieval Big Data Algorithms Grid Computing Unix Linux Enterprise Software Agile Methodologies Software Development Open Source Analytics REST System Architecture Leadership See 12+     See less Hadoop Data Warehousing Database Systems Query Optimization Distributed Systems Databases Machine Learning MapReduce Data Mining Cloud Computing Scalability Software Engineering Integration Information Retrieval Big Data Algorithms Grid Computing Unix Linux Enterprise Software Agile Methodologies Software Development Open Source Analytics REST System Architecture Leadership See 12+     See less Education Columbia University Ph.D.,  Computer Science (databases) 1995  – 2000 Dissertation Title: Computing and Querying Datacubes Activities and Societies:  Graduate Student Advisory Council Indian Institute of Technology, Kharagpur B. Tech,  Computer Science 1991  – 1995 La Martiniere ICSE/ISC,  Science 1979  – 1991 Columbia University Ph.D.,  Computer Science (databases) 1995  – 2000 Dissertation Title: Computing and Querying Datacubes Activities and Societies:  Graduate Student Advisory Council Columbia University Ph.D.,  Computer Science (databases) 1995  – 2000 Dissertation Title: Computing and Querying Datacubes Activities and Societies:  Graduate Student Advisory Council Columbia University Ph.D.,  Computer Science (databases) 1995  – 2000 Dissertation Title: Computing and Querying Datacubes Activities and Societies:  Graduate Student Advisory Council Indian Institute of Technology, Kharagpur B. Tech,  Computer Science 1991  – 1995 Indian Institute of Technology, Kharagpur B. Tech,  Computer Science 1991  – 1995 Indian Institute of Technology, Kharagpur B. Tech,  Computer Science 1991  – 1995 La Martiniere ICSE/ISC,  Science 1979  – 1991 La Martiniere ICSE/ISC,  Science 1979  – 1991 La Martiniere ICSE/ISC,  Science 1979  – 1991 ", "Experience Co-Founder Terrasoft Labs January 1998  – Present (17 years 8 months) Avalon, CA Connect the world. Semester Intern, Software Engineering ViaSat March 2011  –  August 2011  (6 months) Carlsbad, CA Maintained and deployed network virtualization infrastructure. Summer Intern, Software Engineering ViaSat May 2010  –  August 2010  (4 months) Cleveland, OH Developed C system models and created automated build system. Summer Intern, Process Development Schering-Plough Research Institute June 2008  –  August 2008  (3 months) Memphis, TN Refined Coppertone manufacturing process. Summer Intern, New Technologies Schering-Plough Research Institute June 2007  –  August 2007  (3 months) Memphis, TN Reorganized R&D Library and developed electronic document archive. Co-Founder Terrasoft Labs January 1998  – Present (17 years 8 months) Avalon, CA Connect the world. Co-Founder Terrasoft Labs January 1998  – Present (17 years 8 months) Avalon, CA Connect the world. Semester Intern, Software Engineering ViaSat March 2011  –  August 2011  (6 months) Carlsbad, CA Maintained and deployed network virtualization infrastructure. Semester Intern, Software Engineering ViaSat March 2011  –  August 2011  (6 months) Carlsbad, CA Maintained and deployed network virtualization infrastructure. Summer Intern, Software Engineering ViaSat May 2010  –  August 2010  (4 months) Cleveland, OH Developed C system models and created automated build system. Summer Intern, Software Engineering ViaSat May 2010  –  August 2010  (4 months) Cleveland, OH Developed C system models and created automated build system. Summer Intern, Process Development Schering-Plough Research Institute June 2008  –  August 2008  (3 months) Memphis, TN Refined Coppertone manufacturing process. Summer Intern, Process Development Schering-Plough Research Institute June 2008  –  August 2008  (3 months) Memphis, TN Refined Coppertone manufacturing process. Summer Intern, New Technologies Schering-Plough Research Institute June 2007  –  August 2007  (3 months) Memphis, TN Reorganized R&D Library and developed electronic document archive. Summer Intern, New Technologies Schering-Plough Research Institute June 2007  –  August 2007  (3 months) Memphis, TN Reorganized R&D Library and developed electronic document archive. Skills Python C++ Shell Scripting Skills  Python C++ Shell Scripting Python C++ Shell Scripting Python C++ Shell Scripting Education Rice University BSEE,  Electrical and Computer Engineering 2007  – 2013 Activities and Societies:  National Society of Collegiate Scholars ,  IEEE ,  Rice Jazz Band Rice University BSEE,  Electrical and Computer Engineering 2007  – 2013 Activities and Societies:  National Society of Collegiate Scholars ,  IEEE ,  Rice Jazz Band Rice University BSEE,  Electrical and Computer Engineering 2007  – 2013 Activities and Societies:  National Society of Collegiate Scholars ,  IEEE ,  Rice Jazz Band Rice University BSEE,  Electrical and Computer Engineering 2007  – 2013 Activities and Societies:  National Society of Collegiate Scholars ,  IEEE ,  Rice Jazz Band ", "Summary Specialties:Engine Controls, FADEC, DO-178B Summary Specialties:Engine Controls, FADEC, DO-178B Specialties:Engine Controls, FADEC, DO-178B Specialties:Engine Controls, FADEC, DO-178B Experience Engineer Honda R&D Americas, Inc May 2015  – Present (4 months) Systems Engineer / Safety and Reliability Engineer Triumph Group August 2014  –  January 2015  (6 months) Safety and Reliability Engineer Triumph Group April 2013  –  July 2014  (1 year 4 months) West Hartford, CT Safety and Reliability Engineer United Technologies July 2012  –  March 2013  (9 months) Safety and Reliability Engineer Goodrich November 2011  –  June 2012  (8 months) West Hartford, CT Systems Engineer Goodrich Aerospace April 2008  –  October 2011  (3 years 7 months) Engineer United Technologies August 2002  –  March 2008  (5 years 8 months) Intern GE Medical Systems May 2001  –  August 2001  (4 months) Summer Intern – Software Engineering Engineering Co-op Hamilton Sundstrand 2000  –  2001  (1 year) Engineer Honda R&D Americas, Inc May 2015  – Present (4 months) Engineer Honda R&D Americas, Inc May 2015  – Present (4 months) Systems Engineer / Safety and Reliability Engineer Triumph Group August 2014  –  January 2015  (6 months) Systems Engineer / Safety and Reliability Engineer Triumph Group August 2014  –  January 2015  (6 months) Safety and Reliability Engineer Triumph Group April 2013  –  July 2014  (1 year 4 months) West Hartford, CT Safety and Reliability Engineer Triumph Group April 2013  –  July 2014  (1 year 4 months) West Hartford, CT Safety and Reliability Engineer United Technologies July 2012  –  March 2013  (9 months) Safety and Reliability Engineer United Technologies July 2012  –  March 2013  (9 months) Safety and Reliability Engineer Goodrich November 2011  –  June 2012  (8 months) West Hartford, CT Safety and Reliability Engineer Goodrich November 2011  –  June 2012  (8 months) West Hartford, CT Systems Engineer Goodrich Aerospace April 2008  –  October 2011  (3 years 7 months) Systems Engineer Goodrich Aerospace April 2008  –  October 2011  (3 years 7 months) Engineer United Technologies August 2002  –  March 2008  (5 years 8 months) Engineer United Technologies August 2002  –  March 2008  (5 years 8 months) Intern GE Medical Systems May 2001  –  August 2001  (4 months) Summer Intern – Software Engineering Intern GE Medical Systems May 2001  –  August 2001  (4 months) Summer Intern – Software Engineering Engineering Co-op Hamilton Sundstrand 2000  –  2001  (1 year) Engineering Co-op Hamilton Sundstrand 2000  –  2001  (1 year) Skills DO-178B Software Engineering Aerospace Systems Engineering Engineering Management Telelogic DOORS Avionics Earned Value Management Embedded Systems Simulations System Design Requirements Management Embedded Software Testing Engineering Aircraft Spacecraft Project Management ARINC 429 See 4+     See less Skills  DO-178B Software Engineering Aerospace Systems Engineering Engineering Management Telelogic DOORS Avionics Earned Value Management Embedded Systems Simulations System Design Requirements Management Embedded Software Testing Engineering Aircraft Spacecraft Project Management ARINC 429 See 4+     See less DO-178B Software Engineering Aerospace Systems Engineering Engineering Management Telelogic DOORS Avionics Earned Value Management Embedded Systems Simulations System Design Requirements Management Embedded Software Testing Engineering Aircraft Spacecraft Project Management ARINC 429 See 4+     See less DO-178B Software Engineering Aerospace Systems Engineering Engineering Management Telelogic DOORS Avionics Earned Value Management Embedded Systems Simulations System Design Requirements Management Embedded Software Testing Engineering Aircraft Spacecraft Project Management ARINC 429 See 4+     See less Education Rensselaer Polytechnic Institute at Hartford MS,  Computer Science 2004  – 2007 University of Wisconsin-Madison BS,  Computer Science and Electrical Engineering 2000  – 2003 University of Wisconsin-Milwaukee Electrical Engineering 1997  – 1999 Royal Collage 1989  – 1996 Mahanama Vidyalaya 1983  – 1988 Rensselaer Polytechnic Institute at Hartford MS,  Computer Science 2004  – 2007 Rensselaer Polytechnic Institute at Hartford MS,  Computer Science 2004  – 2007 Rensselaer Polytechnic Institute at Hartford MS,  Computer Science 2004  – 2007 University of Wisconsin-Madison BS,  Computer Science and Electrical Engineering 2000  – 2003 University of Wisconsin-Madison BS,  Computer Science and Electrical Engineering 2000  – 2003 University of Wisconsin-Madison BS,  Computer Science and Electrical Engineering 2000  – 2003 University of Wisconsin-Milwaukee Electrical Engineering 1997  – 1999 University of Wisconsin-Milwaukee Electrical Engineering 1997  – 1999 University of Wisconsin-Milwaukee Electrical Engineering 1997  – 1999 Royal Collage 1989  – 1996 Royal Collage 1989  – 1996 Royal Collage 1989  – 1996 Mahanama Vidyalaya 1983  – 1988 Mahanama Vidyalaya 1983  – 1988 Mahanama Vidyalaya 1983  – 1988 ", "Summary I'm a Lead Architect for the upcoming family of Nvidia GPUs.  \n \nMy interests lie in studying parallel programs (e.g., CUDA), authoring tools to gain more visibility into how they perform on the GPU, and of course, to architect the GPUs to make these programs run even better. I interface with various teams within Nvidia to get everyone on agreement with upcoming plans. \n \nI was also a Senior Research Scientist at Nvidia Research, where I authored similar tools. I was also the author of a critical tracing tools still being used (now for over 5 years) for full-chip verification and performance analysis.  \n \nI hold a Ph.D from University of Illinois in Computer Science, have published papers with over 100 citations (see Google Scholar), was the primary author a tool, Iperf, that has over a million downloads. \n \nI like tackling new problems with a long-term focus, learning from colleagues and mentoring colleagues. Of course, I love to code and debug along the way. \n \nSpecialties: Area expertise: Graphics processors and associated APIs (CUDA, OpenGL and DirectX), real-time systems, computer networks.  \n \nLanguage/OS skills where I've had 4+ years of working expertise. \n- Languages: CUDA/C/C++/Java/Perl/Python \n- OS: Windows and Linux. \n- Dev tools: Eclipse/Visual Studio. Summary I'm a Lead Architect for the upcoming family of Nvidia GPUs.  \n \nMy interests lie in studying parallel programs (e.g., CUDA), authoring tools to gain more visibility into how they perform on the GPU, and of course, to architect the GPUs to make these programs run even better. I interface with various teams within Nvidia to get everyone on agreement with upcoming plans. \n \nI was also a Senior Research Scientist at Nvidia Research, where I authored similar tools. I was also the author of a critical tracing tools still being used (now for over 5 years) for full-chip verification and performance analysis.  \n \nI hold a Ph.D from University of Illinois in Computer Science, have published papers with over 100 citations (see Google Scholar), was the primary author a tool, Iperf, that has over a million downloads. \n \nI like tackling new problems with a long-term focus, learning from colleagues and mentoring colleagues. Of course, I love to code and debug along the way. \n \nSpecialties: Area expertise: Graphics processors and associated APIs (CUDA, OpenGL and DirectX), real-time systems, computer networks.  \n \nLanguage/OS skills where I've had 4+ years of working expertise. \n- Languages: CUDA/C/C++/Java/Perl/Python \n- OS: Windows and Linux. \n- Dev tools: Eclipse/Visual Studio. I'm a Lead Architect for the upcoming family of Nvidia GPUs.  \n \nMy interests lie in studying parallel programs (e.g., CUDA), authoring tools to gain more visibility into how they perform on the GPU, and of course, to architect the GPUs to make these programs run even better. I interface with various teams within Nvidia to get everyone on agreement with upcoming plans. \n \nI was also a Senior Research Scientist at Nvidia Research, where I authored similar tools. I was also the author of a critical tracing tools still being used (now for over 5 years) for full-chip verification and performance analysis.  \n \nI hold a Ph.D from University of Illinois in Computer Science, have published papers with over 100 citations (see Google Scholar), was the primary author a tool, Iperf, that has over a million downloads. \n \nI like tackling new problems with a long-term focus, learning from colleagues and mentoring colleagues. Of course, I love to code and debug along the way. \n \nSpecialties: Area expertise: Graphics processors and associated APIs (CUDA, OpenGL and DirectX), real-time systems, computer networks.  \n \nLanguage/OS skills where I've had 4+ years of working expertise. \n- Languages: CUDA/C/C++/Java/Perl/Python \n- OS: Windows and Linux. \n- Dev tools: Eclipse/Visual Studio. I'm a Lead Architect for the upcoming family of Nvidia GPUs.  \n \nMy interests lie in studying parallel programs (e.g., CUDA), authoring tools to gain more visibility into how they perform on the GPU, and of course, to architect the GPUs to make these programs run even better. I interface with various teams within Nvidia to get everyone on agreement with upcoming plans. \n \nI was also a Senior Research Scientist at Nvidia Research, where I authored similar tools. I was also the author of a critical tracing tools still being used (now for over 5 years) for full-chip verification and performance analysis.  \n \nI hold a Ph.D from University of Illinois in Computer Science, have published papers with over 100 citations (see Google Scholar), was the primary author a tool, Iperf, that has over a million downloads. \n \nI like tackling new problems with a long-term focus, learning from colleagues and mentoring colleagues. Of course, I love to code and debug along the way. \n \nSpecialties: Area expertise: Graphics processors and associated APIs (CUDA, OpenGL and DirectX), real-time systems, computer networks.  \n \nLanguage/OS skills where I've had 4+ years of working expertise. \n- Languages: CUDA/C/C++/Java/Perl/Python \n- OS: Windows and Linux. \n- Dev tools: Eclipse/Visual Studio. Experience Senior Research Scientist NVIDIA April 2012  –  December 2013  (1 year 9 months) Senior Architect NVIDIA October 2006  –  March 2012  (5 years 6 months) Graduate Research Assistant University of Illinois at Urbana-Champaign August 2000  –  September 2006  (6 years 2 months) Summer Intern Software Engineering Institute May 2005  –  August 2005  (4 months) President (Asha UIUC chapter) Asha for Education August 2003  –  July 2004  (1 year) Treasurer (Asha UIUC Chapter) Asha for Education August 2002  –  July 2003  (1 year) Summer Intern SLAC National Accelerator Laboratory May 2002  –  August 2002  (4 months) Senior Software Engineer Novell October 1998  –  July 2000  (1 year 10 months) Senior Research Scientist NVIDIA April 2012  –  December 2013  (1 year 9 months) Senior Research Scientist NVIDIA April 2012  –  December 2013  (1 year 9 months) Senior Architect NVIDIA October 2006  –  March 2012  (5 years 6 months) Senior Architect NVIDIA October 2006  –  March 2012  (5 years 6 months) Graduate Research Assistant University of Illinois at Urbana-Champaign August 2000  –  September 2006  (6 years 2 months) Graduate Research Assistant University of Illinois at Urbana-Champaign August 2000  –  September 2006  (6 years 2 months) Summer Intern Software Engineering Institute May 2005  –  August 2005  (4 months) Summer Intern Software Engineering Institute May 2005  –  August 2005  (4 months) President (Asha UIUC chapter) Asha for Education August 2003  –  July 2004  (1 year) President (Asha UIUC chapter) Asha for Education August 2003  –  July 2004  (1 year) Treasurer (Asha UIUC Chapter) Asha for Education August 2002  –  July 2003  (1 year) Treasurer (Asha UIUC Chapter) Asha for Education August 2002  –  July 2003  (1 year) Summer Intern SLAC National Accelerator Laboratory May 2002  –  August 2002  (4 months) Summer Intern SLAC National Accelerator Laboratory May 2002  –  August 2002  (4 months) Senior Software Engineer Novell October 1998  –  July 2000  (1 year 10 months) Senior Software Engineer Novell October 1998  –  July 2000  (1 year 10 months) Education University of Illinois at Urbana-Champaign Ph.D,  Computer Science 2002  – 2006 University of Illinois at Urbana-Champaign M.S.,  Computer Science 2000  – 2002 University of Mysore B.E.,  Computer Science and Engineering 1994  – 1998 University of Illinois at Urbana-Champaign Ph.D,  Computer Science 2002  – 2006 University of Illinois at Urbana-Champaign Ph.D,  Computer Science 2002  – 2006 University of Illinois at Urbana-Champaign Ph.D,  Computer Science 2002  – 2006 University of Illinois at Urbana-Champaign M.S.,  Computer Science 2000  – 2002 University of Illinois at Urbana-Champaign M.S.,  Computer Science 2000  – 2002 University of Illinois at Urbana-Champaign M.S.,  Computer Science 2000  – 2002 University of Mysore B.E.,  Computer Science and Engineering 1994  – 1998 University of Mysore B.E.,  Computer Science and Engineering 1994  – 1998 University of Mysore B.E.,  Computer Science and Engineering 1994  – 1998 ", "Skills MVC Perl Cloud Computing Linux Statistical Data... Apache Systems Engineering DNS Anycast System Monitoring XML SQL MySQL Python Unix Databases JavaScript Software Development Solaris Shell Scripting Software Engineering System Administration PostgreSQL Operating Systems Scalability Bash Microsoft SQL Server See 12+     See less Skills  MVC Perl Cloud Computing Linux Statistical Data... Apache Systems Engineering DNS Anycast System Monitoring XML SQL MySQL Python Unix Databases JavaScript Software Development Solaris Shell Scripting Software Engineering System Administration PostgreSQL Operating Systems Scalability Bash Microsoft SQL Server See 12+     See less MVC Perl Cloud Computing Linux Statistical Data... Apache Systems Engineering DNS Anycast System Monitoring XML SQL MySQL Python Unix Databases JavaScript Software Development Solaris Shell Scripting Software Engineering System Administration PostgreSQL Operating Systems Scalability Bash Microsoft SQL Server See 12+     See less MVC Perl Cloud Computing Linux Statistical Data... Apache Systems Engineering DNS Anycast System Monitoring XML SQL MySQL Python Unix Databases JavaScript Software Development Solaris Shell Scripting Software Engineering System Administration PostgreSQL Operating Systems Scalability Bash Microsoft SQL Server See 12+     See less ", "Skills Pattern Recognition C++ C Algorithms Testing Skills  Pattern Recognition C++ C Algorithms Testing Pattern Recognition C++ C Algorithms Testing Pattern Recognition C++ C Algorithms Testing ", "Experience Investment Analyst T. Rowe Price September 2011  – Present (4 years) Singapore, Hong Kong Equity Research - Asia-Pacific ex-Japan Utilities and Infrastructure MBA Student London Business School August 2009  –  June 2011  (1 year 11 months) Summer intern - Investment Analyst T. Rowe Price International June 2010  –  September 2010  (4 months) Equity Research Manager, Treasury Citibank Singapore Ltd. June 2006  –  June 2009  (3 years 1 month) Asset-liability management and fixed income Assistant Manager, Business Development Citibank Singapore Ltd. July 2004  –  June 2006  (2 years) Summer intern - Software engineering Merrill Lynch January 2003  –  June 2003  (6 months) Singapore Investment Analyst T. Rowe Price September 2011  – Present (4 years) Singapore, Hong Kong Equity Research - Asia-Pacific ex-Japan Utilities and Infrastructure Investment Analyst T. Rowe Price September 2011  – Present (4 years) Singapore, Hong Kong Equity Research - Asia-Pacific ex-Japan Utilities and Infrastructure MBA Student London Business School August 2009  –  June 2011  (1 year 11 months) MBA Student London Business School August 2009  –  June 2011  (1 year 11 months) Summer intern - Investment Analyst T. Rowe Price International June 2010  –  September 2010  (4 months) Equity Research Summer intern - Investment Analyst T. Rowe Price International June 2010  –  September 2010  (4 months) Equity Research Manager, Treasury Citibank Singapore Ltd. June 2006  –  June 2009  (3 years 1 month) Asset-liability management and fixed income Manager, Treasury Citibank Singapore Ltd. June 2006  –  June 2009  (3 years 1 month) Asset-liability management and fixed income Assistant Manager, Business Development Citibank Singapore Ltd. July 2004  –  June 2006  (2 years) Assistant Manager, Business Development Citibank Singapore Ltd. July 2004  –  June 2006  (2 years) Summer intern - Software engineering Merrill Lynch January 2003  –  June 2003  (6 months) Singapore Summer intern - Software engineering Merrill Lynch January 2003  –  June 2003  (6 months) Singapore Skills Business Development Business Strategy Capital Markets Corporate Finance Economics Emerging Markets Financial Analysis Financial Modeling Fixed Income Investment Banking Investments Treasury Valuation Skills  Business Development Business Strategy Capital Markets Corporate Finance Economics Emerging Markets Financial Analysis Financial Modeling Fixed Income Investment Banking Investments Treasury Valuation Business Development Business Strategy Capital Markets Corporate Finance Economics Emerging Markets Financial Analysis Financial Modeling Fixed Income Investment Banking Investments Treasury Valuation Business Development Business Strategy Capital Markets Corporate Finance Economics Emerging Markets Financial Analysis Financial Modeling Fixed Income Investment Banking Investments Treasury Valuation Education London Business School Master of Business Administration 2009  – 2011 National University of Singapore Bachelor of Engineering,  Computer Engineering 2000  – 2004 London Business School Master of Business Administration 2009  – 2011 London Business School Master of Business Administration 2009  – 2011 London Business School Master of Business Administration 2009  – 2011 National University of Singapore Bachelor of Engineering,  Computer Engineering 2000  – 2004 National University of Singapore Bachelor of Engineering,  Computer Engineering 2000  – 2004 National University of Singapore Bachelor of Engineering,  Computer Engineering 2000  – 2004 ", "Experience Associate Storm Ventures June 2013  –  September 2013  (4 months) Menlo Park Early Stage Enterprise Software Investing \n \n• Product Development & Strategy, Market Analysis, Financial Modeling, Sourcing \n• Focus Areas : SaaS, Mobile and Cloud Infrastructure Engineering & Product Oracle April 2007  –  March 2012  (5 years) Redwood Shores, California Developed Software and Management Tools that provide Information Technology organizations with an overview of the multiple tiers of technology used to sustain business transactions.  \n \n• Led the development of a new data management product to support enhanced monitoring of data centers. \n• Designed protocols for remote management, monitoring and analysis of customer data. \n• Designed a new load balancing mechanism to make multi-target communication more efficient. \n• Led an effort to demonstrate the monitoring features of Enterprise Manager to customers \n• Coordinated the work of teams across California and India Senior Analyst Regal Corporate Advisors March 2010  –  February 2012  (2 years) Hyderabad, India Early Stage Investor \n \n• Product Development & Strategy, Market Analysis, and Business Development \n• Focus Areas : Technology, Healthcare and Bio-Technology Software Engineer Intern Google Corporation July 2006  –  September 2006  (3 months) Mountain View, California Google Apps is a cloud-based productivity suite that helps you and your team connect and get work done from anywhere on any device \n \n• Member of the pre-launch founding team of Google Apps for Enterprise (Led by Derek Parham, Pavni Diwanji). \n• Designed and Developed web based productivity infrastructure that enhances collaboration and communication Summer Intern Oracle June 2005  –  September 2005  (4 months) Redwood Shores, California Oracle Enterprise Manager is a set of web-based tools aimed at managing software and hardware produced by Oracle Corporation as well as non-Oracle entities. \n \n• Developed products to extend the capabilities of Enterprise Manager to monitor third party devices and applications under a common interface. \n• Designed the first plug-ins to monitor the F5 BIG-IP load balancer and Microsoft SQL Server. Summer Intern Software Engineering Inc May 2004  –  August 2004  (4 months) Santa Clara, California Software Engineering Incorporated developed Real Time Embedded Systems for Autonomous Devices \n \n• Real Time Embedded Systems - Autonomous (Self Driving) Vehicles Associate Storm Ventures June 2013  –  September 2013  (4 months) Menlo Park Early Stage Enterprise Software Investing \n \n• Product Development & Strategy, Market Analysis, Financial Modeling, Sourcing \n• Focus Areas : SaaS, Mobile and Cloud Infrastructure Associate Storm Ventures June 2013  –  September 2013  (4 months) Menlo Park Early Stage Enterprise Software Investing \n \n• Product Development & Strategy, Market Analysis, Financial Modeling, Sourcing \n• Focus Areas : SaaS, Mobile and Cloud Infrastructure Engineering & Product Oracle April 2007  –  March 2012  (5 years) Redwood Shores, California Developed Software and Management Tools that provide Information Technology organizations with an overview of the multiple tiers of technology used to sustain business transactions.  \n \n• Led the development of a new data management product to support enhanced monitoring of data centers. \n• Designed protocols for remote management, monitoring and analysis of customer data. \n• Designed a new load balancing mechanism to make multi-target communication more efficient. \n• Led an effort to demonstrate the monitoring features of Enterprise Manager to customers \n• Coordinated the work of teams across California and India Engineering & Product Oracle April 2007  –  March 2012  (5 years) Redwood Shores, California Developed Software and Management Tools that provide Information Technology organizations with an overview of the multiple tiers of technology used to sustain business transactions.  \n \n• Led the development of a new data management product to support enhanced monitoring of data centers. \n• Designed protocols for remote management, monitoring and analysis of customer data. \n• Designed a new load balancing mechanism to make multi-target communication more efficient. \n• Led an effort to demonstrate the monitoring features of Enterprise Manager to customers \n• Coordinated the work of teams across California and India Senior Analyst Regal Corporate Advisors March 2010  –  February 2012  (2 years) Hyderabad, India Early Stage Investor \n \n• Product Development & Strategy, Market Analysis, and Business Development \n• Focus Areas : Technology, Healthcare and Bio-Technology Senior Analyst Regal Corporate Advisors March 2010  –  February 2012  (2 years) Hyderabad, India Early Stage Investor \n \n• Product Development & Strategy, Market Analysis, and Business Development \n• Focus Areas : Technology, Healthcare and Bio-Technology Software Engineer Intern Google Corporation July 2006  –  September 2006  (3 months) Mountain View, California Google Apps is a cloud-based productivity suite that helps you and your team connect and get work done from anywhere on any device \n \n• Member of the pre-launch founding team of Google Apps for Enterprise (Led by Derek Parham, Pavni Diwanji). \n• Designed and Developed web based productivity infrastructure that enhances collaboration and communication Software Engineer Intern Google Corporation July 2006  –  September 2006  (3 months) Mountain View, California Google Apps is a cloud-based productivity suite that helps you and your team connect and get work done from anywhere on any device \n \n• Member of the pre-launch founding team of Google Apps for Enterprise (Led by Derek Parham, Pavni Diwanji). \n• Designed and Developed web based productivity infrastructure that enhances collaboration and communication Summer Intern Oracle June 2005  –  September 2005  (4 months) Redwood Shores, California Oracle Enterprise Manager is a set of web-based tools aimed at managing software and hardware produced by Oracle Corporation as well as non-Oracle entities. \n \n• Developed products to extend the capabilities of Enterprise Manager to monitor third party devices and applications under a common interface. \n• Designed the first plug-ins to monitor the F5 BIG-IP load balancer and Microsoft SQL Server. Summer Intern Oracle June 2005  –  September 2005  (4 months) Redwood Shores, California Oracle Enterprise Manager is a set of web-based tools aimed at managing software and hardware produced by Oracle Corporation as well as non-Oracle entities. \n \n• Developed products to extend the capabilities of Enterprise Manager to monitor third party devices and applications under a common interface. \n• Designed the first plug-ins to monitor the F5 BIG-IP load balancer and Microsoft SQL Server. Summer Intern Software Engineering Inc May 2004  –  August 2004  (4 months) Santa Clara, California Software Engineering Incorporated developed Real Time Embedded Systems for Autonomous Devices \n \n• Real Time Embedded Systems - Autonomous (Self Driving) Vehicles Summer Intern Software Engineering Inc May 2004  –  August 2004  (4 months) Santa Clara, California Software Engineering Incorporated developed Real Time Embedded Systems for Autonomous Devices \n \n• Real Time Embedded Systems - Autonomous (Self Driving) Vehicles Languages   Skills Embedded Systems Distributed Systems Architectures Venture Capital Enterprise Software Entrepreneurship Business Strategy Product Management Financial Analysis Investments Java C Perl Software Engineering SaaS Mobile Devices See 1+     See less Skills  Embedded Systems Distributed Systems Architectures Venture Capital Enterprise Software Entrepreneurship Business Strategy Product Management Financial Analysis Investments Java C Perl Software Engineering SaaS Mobile Devices See 1+     See less Embedded Systems Distributed Systems Architectures Venture Capital Enterprise Software Entrepreneurship Business Strategy Product Management Financial Analysis Investments Java C Perl Software Engineering SaaS Mobile Devices See 1+     See less Embedded Systems Distributed Systems Architectures Venture Capital Enterprise Software Entrepreneurship Business Strategy Product Management Financial Analysis Investments Java C Perl Software Engineering SaaS Mobile Devices See 1+     See less Education Stanford Graduate School of Business Master of Business Administration (M.B.A.) 2012  – 2014 Activities and Societies:  Academic Committee ,  Entrepreneurship Club ,  Venture Capital Club. Finance & Investing Club ,  Health Care Club Stanford University Master of Science,  Computer Engineering 2005  – 2007 Best Paper Award - HPCA (High Performance Computing Architecture 2007) for a paper titled \n\"Evaluating MapReduce for Multi-core and Multiprocessor Systems\" with Professor Christos Kozyrakis \n \nGoogle Eng-Edu Talk by Co-Author, Colby Ranger - MapReduce for Multicore-MultiProcessor Systems \n \nArchitecture Group - Explored developments in architecture design and performance. Carnegie Mellon University Bachelor of Science,  Electrical and Computer Engineering 2002  – 2005 Robotics & Autonomous Vehicles \nLarge Scale Network Protocol Analysis and Development Stanford Graduate School of Business Master of Business Administration (M.B.A.) 2012  – 2014 Activities and Societies:  Academic Committee ,  Entrepreneurship Club ,  Venture Capital Club. Finance & Investing Club ,  Health Care Club Stanford Graduate School of Business Master of Business Administration (M.B.A.) 2012  – 2014 Activities and Societies:  Academic Committee ,  Entrepreneurship Club ,  Venture Capital Club. Finance & Investing Club ,  Health Care Club Stanford Graduate School of Business Master of Business Administration (M.B.A.) 2012  – 2014 Activities and Societies:  Academic Committee ,  Entrepreneurship Club ,  Venture Capital Club. Finance & Investing Club ,  Health Care Club Stanford University Master of Science,  Computer Engineering 2005  – 2007 Best Paper Award - HPCA (High Performance Computing Architecture 2007) for a paper titled \n\"Evaluating MapReduce for Multi-core and Multiprocessor Systems\" with Professor Christos Kozyrakis \n \nGoogle Eng-Edu Talk by Co-Author, Colby Ranger - MapReduce for Multicore-MultiProcessor Systems \n \nArchitecture Group - Explored developments in architecture design and performance. Stanford University Master of Science,  Computer Engineering 2005  – 2007 Best Paper Award - HPCA (High Performance Computing Architecture 2007) for a paper titled \n\"Evaluating MapReduce for Multi-core and Multiprocessor Systems\" with Professor Christos Kozyrakis \n \nGoogle Eng-Edu Talk by Co-Author, Colby Ranger - MapReduce for Multicore-MultiProcessor Systems \n \nArchitecture Group - Explored developments in architecture design and performance. Stanford University Master of Science,  Computer Engineering 2005  – 2007 Best Paper Award - HPCA (High Performance Computing Architecture 2007) for a paper titled \n\"Evaluating MapReduce for Multi-core and Multiprocessor Systems\" with Professor Christos Kozyrakis \n \nGoogle Eng-Edu Talk by Co-Author, Colby Ranger - MapReduce for Multicore-MultiProcessor Systems \n \nArchitecture Group - Explored developments in architecture design and performance. Carnegie Mellon University Bachelor of Science,  Electrical and Computer Engineering 2002  – 2005 Robotics & Autonomous Vehicles \nLarge Scale Network Protocol Analysis and Development Carnegie Mellon University Bachelor of Science,  Electrical and Computer Engineering 2002  – 2005 Robotics & Autonomous Vehicles \nLarge Scale Network Protocol Analysis and Development Carnegie Mellon University Bachelor of Science,  Electrical and Computer Engineering 2002  – 2005 Robotics & Autonomous Vehicles \nLarge Scale Network Protocol Analysis and Development ", "Summary Experienced Systems Design Engineer excited by working on multidisciplinary engineering teams to design and field complex products. A dynamic role with wide ranging responsibilities requiring a varied skill set is ideal. Summary Experienced Systems Design Engineer excited by working on multidisciplinary engineering teams to design and field complex products. A dynamic role with wide ranging responsibilities requiring a varied skill set is ideal. Experienced Systems Design Engineer excited by working on multidisciplinary engineering teams to design and field complex products. A dynamic role with wide ranging responsibilities requiring a varied skill set is ideal. Experienced Systems Design Engineer excited by working on multidisciplinary engineering teams to design and field complex products. A dynamic role with wide ranging responsibilities requiring a varied skill set is ideal. Experience Systems Engineer Northrop Grumman Corporation May 2009  – Present (6 years 4 months) Huntsville, Alabama Area Systems Engineering for Critical Infrastructure and Force Protection applications, Systems Engineering from cradle to grave. Involved in R&D, new product realization efforts, field testing and deployed product sustainment. Co-op Engineer ADTRAN August 2006  –  April 2008  (1 year 9 months) Huntsville, Alabama Area Alternated full time employment with full time school in the Co-op program. \nDVT Co-op Engineer, January 2008 to April 2008 \nSoftware Group Co-op Engineer, May 2007 to August 2007 \nProduct Qualification Co-op Engineer, August 2006 to December 2006 Summer Intern, Software Engineering Directorate US Army May 2005  –  August 2005  (4 months) Huntsville, Alabama Area 3D modeling and texturing. Software testing and document validation. Systems Engineer Northrop Grumman Corporation May 2009  – Present (6 years 4 months) Huntsville, Alabama Area Systems Engineering for Critical Infrastructure and Force Protection applications, Systems Engineering from cradle to grave. Involved in R&D, new product realization efforts, field testing and deployed product sustainment. Systems Engineer Northrop Grumman Corporation May 2009  – Present (6 years 4 months) Huntsville, Alabama Area Systems Engineering for Critical Infrastructure and Force Protection applications, Systems Engineering from cradle to grave. Involved in R&D, new product realization efforts, field testing and deployed product sustainment. Co-op Engineer ADTRAN August 2006  –  April 2008  (1 year 9 months) Huntsville, Alabama Area Alternated full time employment with full time school in the Co-op program. \nDVT Co-op Engineer, January 2008 to April 2008 \nSoftware Group Co-op Engineer, May 2007 to August 2007 \nProduct Qualification Co-op Engineer, August 2006 to December 2006 Co-op Engineer ADTRAN August 2006  –  April 2008  (1 year 9 months) Huntsville, Alabama Area Alternated full time employment with full time school in the Co-op program. \nDVT Co-op Engineer, January 2008 to April 2008 \nSoftware Group Co-op Engineer, May 2007 to August 2007 \nProduct Qualification Co-op Engineer, August 2006 to December 2006 Summer Intern, Software Engineering Directorate US Army May 2005  –  August 2005  (4 months) Huntsville, Alabama Area 3D modeling and texturing. Software testing and document validation. Summer Intern, Software Engineering Directorate US Army May 2005  –  August 2005  (4 months) Huntsville, Alabama Area 3D modeling and texturing. Software testing and document validation. Skills Systems Engineering Electrical Engineering Information Assurance Product Development Testing Computer Security Integration System Design DoD Requirements Management Engineering Management Government Contracting Systems Design Skills  Systems Engineering Electrical Engineering Information Assurance Product Development Testing Computer Security Integration System Design DoD Requirements Management Engineering Management Government Contracting Systems Design Systems Engineering Electrical Engineering Information Assurance Product Development Testing Computer Security Integration System Design DoD Requirements Management Engineering Management Government Contracting Systems Design Systems Engineering Electrical Engineering Information Assurance Product Development Testing Computer Security Integration System Design DoD Requirements Management Engineering Management Government Contracting Systems Design Education University of Alabama in Huntsville BSE,  Electrical Engineering Graduated with Honors Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu University of Alabama in Huntsville BSE,  Electrical Engineering Graduated with Honors Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu University of Alabama in Huntsville BSE,  Electrical Engineering Graduated with Honors Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu University of Alabama in Huntsville BSE,  Electrical Engineering Graduated with Honors Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu Honors & Awards Additional Honors & Awards Eagle Scout, Boy Scouts of America Additional Honors & Awards Eagle Scout, Boy Scouts of America Additional Honors & Awards Eagle Scout, Boy Scouts of America Additional Honors & Awards Eagle Scout, Boy Scouts of America ", "Experience SOFTWARE ENGINEER Cisco Systems October 2010  – Present (4 years 11 months) BANGALORE TECHNICAL ANALYST V2Solutions / InfoStretch Corporation August 2010  –  September 2010  (2 months) MUMBAI / AHMEDABAD SOFTWARE ENGINEER Ocwen Financial Solutions / Altisource Financial Solutions February 2008  –  June 2010  (2 years 5 months) BANGALORE JUNIOR SOFTWARE ENGINEER Ocwen Financial Solutions / Altisource Financial Solutions January 2006  –  January 2008  (2 years 1 month) BANGALORE Associate Trainee - Software Development Epitome Finance Pvt. Ltd. June 2005  –  November 2005  (6 months) Epitome Finance Pvt. Ltd. is the Enterprise Solutions Partner for Tata Consultancy Services - (TCS) Summer Intern - Software Engineering Fusion Informatics Pvt. Ltd. January 2005  –  April 2005  (4 months) FUSION INFORMATICS PRIVATE LIMITED SOFTWARE ENGINEER Cisco Systems October 2010  – Present (4 years 11 months) BANGALORE SOFTWARE ENGINEER Cisco Systems October 2010  – Present (4 years 11 months) BANGALORE TECHNICAL ANALYST V2Solutions / InfoStretch Corporation August 2010  –  September 2010  (2 months) MUMBAI / AHMEDABAD TECHNICAL ANALYST V2Solutions / InfoStretch Corporation August 2010  –  September 2010  (2 months) MUMBAI / AHMEDABAD SOFTWARE ENGINEER Ocwen Financial Solutions / Altisource Financial Solutions February 2008  –  June 2010  (2 years 5 months) BANGALORE SOFTWARE ENGINEER Ocwen Financial Solutions / Altisource Financial Solutions February 2008  –  June 2010  (2 years 5 months) BANGALORE JUNIOR SOFTWARE ENGINEER Ocwen Financial Solutions / Altisource Financial Solutions January 2006  –  January 2008  (2 years 1 month) BANGALORE JUNIOR SOFTWARE ENGINEER Ocwen Financial Solutions / Altisource Financial Solutions January 2006  –  January 2008  (2 years 1 month) BANGALORE Associate Trainee - Software Development Epitome Finance Pvt. Ltd. June 2005  –  November 2005  (6 months) Epitome Finance Pvt. Ltd. is the Enterprise Solutions Partner for Tata Consultancy Services - (TCS) Associate Trainee - Software Development Epitome Finance Pvt. Ltd. June 2005  –  November 2005  (6 months) Epitome Finance Pvt. Ltd. is the Enterprise Solutions Partner for Tata Consultancy Services - (TCS) Summer Intern - Software Engineering Fusion Informatics Pvt. Ltd. January 2005  –  April 2005  (4 months) FUSION INFORMATICS PRIVATE LIMITED Summer Intern - Software Engineering Fusion Informatics Pvt. Ltd. January 2005  –  April 2005  (4 months) FUSION INFORMATICS PRIVATE LIMITED Skills Core Java Java Java Enterprise Edition Struts Web Services XML SQL Eclipse Servlets JSP Spring iBatis Hibernate Tomcat Software Development JDBC Software Engineering Spring Framework See 3+     See less Skills  Core Java Java Java Enterprise Edition Struts Web Services XML SQL Eclipse Servlets JSP Spring iBatis Hibernate Tomcat Software Development JDBC Software Engineering Spring Framework See 3+     See less Core Java Java Java Enterprise Edition Struts Web Services XML SQL Eclipse Servlets JSP Spring iBatis Hibernate Tomcat Software Development JDBC Software Engineering Spring Framework See 3+     See less Core Java Java Java Enterprise Edition Struts Web Services XML SQL Eclipse Servlets JSP Spring iBatis Hibernate Tomcat Software Development JDBC Software Engineering Spring Framework See 3+     See less Education SAURASHTRA UNIVERSITY - NOW : GUJARAT TECHNOLOGICAL UNIVERSITY G.T.U. B.E.,  Information Technology , GPA : 3.9/4 2001  – 2005 SHRI SURVODAYA VIDYA MANDIR H.S.C.,  Higher Secondary Education 1999  – 2001 Sister Nivedita S.S.E.,  Secondary Education 1986  – 1999 SAURASHTRA UNIVERSITY - NOW : GUJARAT TECHNOLOGICAL UNIVERSITY G.T.U. B.E.,  Information Technology , GPA : 3.9/4 2001  – 2005 SAURASHTRA UNIVERSITY - NOW : GUJARAT TECHNOLOGICAL UNIVERSITY G.T.U. B.E.,  Information Technology , GPA : 3.9/4 2001  – 2005 SAURASHTRA UNIVERSITY - NOW : GUJARAT TECHNOLOGICAL UNIVERSITY G.T.U. B.E.,  Information Technology , GPA : 3.9/4 2001  – 2005 SHRI SURVODAYA VIDYA MANDIR H.S.C.,  Higher Secondary Education 1999  – 2001 SHRI SURVODAYA VIDYA MANDIR H.S.C.,  Higher Secondary Education 1999  – 2001 SHRI SURVODAYA VIDYA MANDIR H.S.C.,  Higher Secondary Education 1999  – 2001 Sister Nivedita S.S.E.,  Secondary Education 1986  – 1999 Sister Nivedita S.S.E.,  Secondary Education 1986  – 1999 Sister Nivedita S.S.E.,  Secondary Education 1986  – 1999 ", "Languages   Skills Analytics Mergers & Acquisitions Financial Modeling Management Consulting Due Diligence Corporate Finance Marketing Analytics Change Management Strategy Valuation Analysis DCF Finance Business Development Product Management Management Private Equity See 2+     See less Skills  Analytics Mergers & Acquisitions Financial Modeling Management Consulting Due Diligence Corporate Finance Marketing Analytics Change Management Strategy Valuation Analysis DCF Finance Business Development Product Management Management Private Equity See 2+     See less Analytics Mergers & Acquisitions Financial Modeling Management Consulting Due Diligence Corporate Finance Marketing Analytics Change Management Strategy Valuation Analysis DCF Finance Business Development Product Management Management Private Equity See 2+     See less Analytics Mergers & Acquisitions Financial Modeling Management Consulting Due Diligence Corporate Finance Marketing Analytics Change Management Strategy Valuation Analysis DCF Finance Business Development Product Management Management Private Equity See 2+     See less Education Columbia Business School MBA 2010  – 2012 Pragmatic Marketing Product Management Certification 2014  – 2014 Carnegie Mellon University Master of Science 2004  – 2006 Villanova University Lean Six Sigma Black Belt 2012  – 2012 The Takshashila Institution Graduate Certificate 2012  – 2012 Cochin University of Science and Technology Bachelors 2000  – 2004 Columbia Business School MBA 2010  – 2012 Columbia Business School MBA 2010  – 2012 Columbia Business School MBA 2010  – 2012 Pragmatic Marketing Product Management Certification 2014  – 2014 Pragmatic Marketing Product Management Certification 2014  – 2014 Pragmatic Marketing Product Management Certification 2014  – 2014 Carnegie Mellon University Master of Science 2004  – 2006 Carnegie Mellon University Master of Science 2004  – 2006 Carnegie Mellon University Master of Science 2004  – 2006 Villanova University Lean Six Sigma Black Belt 2012  – 2012 Villanova University Lean Six Sigma Black Belt 2012  – 2012 Villanova University Lean Six Sigma Black Belt 2012  – 2012 The Takshashila Institution Graduate Certificate 2012  – 2012 The Takshashila Institution Graduate Certificate 2012  – 2012 The Takshashila Institution Graduate Certificate 2012  – 2012 Cochin University of Science and Technology Bachelors 2000  – 2004 Cochin University of Science and Technology Bachelors 2000  – 2004 Cochin University of Science and Technology Bachelors 2000  – 2004 Honors & Awards ", "Summary • 2+ years of experience in a client-facing technology role involving regular interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects, support staff and end-users (non-technical). \n• Experience in all phases of SDLC right from requirement gathering to post-delivery support and maintenance. \n• Full-stack web development experience in Java, JavaScript, Dojo, HTML, CSS, XML, SQL, JSPs and other J2EE frameworks such as Struts and JSF.  \n• Oracle certified professional Java SE 6 programmer. Summary • 2+ years of experience in a client-facing technology role involving regular interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects, support staff and end-users (non-technical). \n• Experience in all phases of SDLC right from requirement gathering to post-delivery support and maintenance. \n• Full-stack web development experience in Java, JavaScript, Dojo, HTML, CSS, XML, SQL, JSPs and other J2EE frameworks such as Struts and JSF.  \n• Oracle certified professional Java SE 6 programmer. • 2+ years of experience in a client-facing technology role involving regular interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects, support staff and end-users (non-technical). \n• Experience in all phases of SDLC right from requirement gathering to post-delivery support and maintenance. \n• Full-stack web development experience in Java, JavaScript, Dojo, HTML, CSS, XML, SQL, JSPs and other J2EE frameworks such as Struts and JSF.  \n• Oracle certified professional Java SE 6 programmer. • 2+ years of experience in a client-facing technology role involving regular interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects, support staff and end-users (non-technical). \n• Experience in all phases of SDLC right from requirement gathering to post-delivery support and maintenance. \n• Full-stack web development experience in Java, JavaScript, Dojo, HTML, CSS, XML, SQL, JSPs and other J2EE frameworks such as Struts and JSF.  \n• Oracle certified professional Java SE 6 programmer. Experience Demo Engineer Salesforce July 2015  – Present (2 months) San Francisco, California Software Developer Intern 8x8, Inc. January 2015  –  March 2015  (3 months) San Jose, CA •\tWorking with product management and other stakeholders to assist in developing prototypes/wireframes and extending the current product in terms of both technology and features. Media Services Assistant Santa Clara University November 2013  –  December 2014  (1 year 2 months) San Francisco Bay Area •\tAddressed queries and provided technical support to faculty, students and staff across the entire university campus. \n•\tWorked with vendor support personnel and a team of 20+ undergraduate student assistants to troubleshoot and fix problems onsite in various locations on campus within extremely short windows of time. Research Summer Intern (Software Engineering) IBM Research June 2014  –  September 2014  (4 months) IBM Almaden Research Center - Designed and developed a feature-rich web application for a metagenomics research platform targeted at the food industry. \n- This involved full-stack web application development in Java, JavaScript, RESTful services, JPA, XML. \n- Also participated in a 3-day long extensive training program on ‘Information extraction from unstructured text’ which involved writing AQL modules for context-aware extraction of text from large datasets. Software Developer Tata Consultancy Services August 2011  –  August 2013  (2 years 1 month) Hyderabad Area, India •\tSingle Point of Contact (SPoC) and primary developer for 4 SOX compliant web applications used by a US based manufacturing giant for management and reporting of company sales data. \n•\tThis involved daily interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects and end-users from the client’s sales team.  \n•\tParticipated through-out requirement-gathering, implementation, delivery and post-delivery support phases for over 20 major application enhancements. \n•\tImplementation involved design and development in Java, J2EE, JavaScript, SQL, XML and UNIX shell scripting. \n•\tProvided live-production application support for over 12 mission-critical monthly sales-reporting activities by the client. Demo Engineer Salesforce July 2015  – Present (2 months) San Francisco, California Demo Engineer Salesforce July 2015  – Present (2 months) San Francisco, California Software Developer Intern 8x8, Inc. January 2015  –  March 2015  (3 months) San Jose, CA •\tWorking with product management and other stakeholders to assist in developing prototypes/wireframes and extending the current product in terms of both technology and features. Software Developer Intern 8x8, Inc. January 2015  –  March 2015  (3 months) San Jose, CA •\tWorking with product management and other stakeholders to assist in developing prototypes/wireframes and extending the current product in terms of both technology and features. Media Services Assistant Santa Clara University November 2013  –  December 2014  (1 year 2 months) San Francisco Bay Area •\tAddressed queries and provided technical support to faculty, students and staff across the entire university campus. \n•\tWorked with vendor support personnel and a team of 20+ undergraduate student assistants to troubleshoot and fix problems onsite in various locations on campus within extremely short windows of time. Media Services Assistant Santa Clara University November 2013  –  December 2014  (1 year 2 months) San Francisco Bay Area •\tAddressed queries and provided technical support to faculty, students and staff across the entire university campus. \n•\tWorked with vendor support personnel and a team of 20+ undergraduate student assistants to troubleshoot and fix problems onsite in various locations on campus within extremely short windows of time. Research Summer Intern (Software Engineering) IBM Research June 2014  –  September 2014  (4 months) IBM Almaden Research Center - Designed and developed a feature-rich web application for a metagenomics research platform targeted at the food industry. \n- This involved full-stack web application development in Java, JavaScript, RESTful services, JPA, XML. \n- Also participated in a 3-day long extensive training program on ‘Information extraction from unstructured text’ which involved writing AQL modules for context-aware extraction of text from large datasets. Research Summer Intern (Software Engineering) IBM Research June 2014  –  September 2014  (4 months) IBM Almaden Research Center - Designed and developed a feature-rich web application for a metagenomics research platform targeted at the food industry. \n- This involved full-stack web application development in Java, JavaScript, RESTful services, JPA, XML. \n- Also participated in a 3-day long extensive training program on ‘Information extraction from unstructured text’ which involved writing AQL modules for context-aware extraction of text from large datasets. Software Developer Tata Consultancy Services August 2011  –  August 2013  (2 years 1 month) Hyderabad Area, India •\tSingle Point of Contact (SPoC) and primary developer for 4 SOX compliant web applications used by a US based manufacturing giant for management and reporting of company sales data. \n•\tThis involved daily interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects and end-users from the client’s sales team.  \n•\tParticipated through-out requirement-gathering, implementation, delivery and post-delivery support phases for over 20 major application enhancements. \n•\tImplementation involved design and development in Java, J2EE, JavaScript, SQL, XML and UNIX shell scripting. \n•\tProvided live-production application support for over 12 mission-critical monthly sales-reporting activities by the client. Software Developer Tata Consultancy Services August 2011  –  August 2013  (2 years 1 month) Hyderabad Area, India •\tSingle Point of Contact (SPoC) and primary developer for 4 SOX compliant web applications used by a US based manufacturing giant for management and reporting of company sales data. \n•\tThis involved daily interaction with a varied customer base of Subject Matter Experts (SMEs), technical architects and end-users from the client’s sales team.  \n•\tParticipated through-out requirement-gathering, implementation, delivery and post-delivery support phases for over 20 major application enhancements. \n•\tImplementation involved design and development in Java, J2EE, JavaScript, SQL, XML and UNIX shell scripting. \n•\tProvided live-production application support for over 12 mission-critical monthly sales-reporting activities by the client. Languages English Full professional proficiency Telugu Native or bilingual proficiency Hindi Native or bilingual proficiency Kannada Native or bilingual proficiency English Full professional proficiency Telugu Native or bilingual proficiency Hindi Native or bilingual proficiency Kannada Native or bilingual proficiency English Full professional proficiency Telugu Native or bilingual proficiency Hindi Native or bilingual proficiency Kannada Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Java Enterprise Edition JavaScript Dojo Text Analytics Information Extraction... Annotation Query... SQL Android Development Servlets C XML Hibernate J2EE JSP Struts HTML WebSphere Application... SQL DB2 XML Based Server Pages... Web Applications Software Engineering Eclipse Programming MySQL DB2 JDBC Java JavaSE J2EE Application... REST JSON C++ See 17+     See less Skills  Java Enterprise Edition JavaScript Dojo Text Analytics Information Extraction... Annotation Query... SQL Android Development Servlets C XML Hibernate J2EE JSP Struts HTML WebSphere Application... SQL DB2 XML Based Server Pages... Web Applications Software Engineering Eclipse Programming MySQL DB2 JDBC Java JavaSE J2EE Application... REST JSON C++ See 17+     See less Java Enterprise Edition JavaScript Dojo Text Analytics Information Extraction... Annotation Query... SQL Android Development Servlets C XML Hibernate J2EE JSP Struts HTML WebSphere Application... SQL DB2 XML Based Server Pages... Web Applications Software Engineering Eclipse Programming MySQL DB2 JDBC Java JavaSE J2EE Application... REST JSON C++ See 17+     See less Java Enterprise Edition JavaScript Dojo Text Analytics Information Extraction... Annotation Query... SQL Android Development Servlets C XML Hibernate J2EE JSP Struts HTML WebSphere Application... SQL DB2 XML Based Server Pages... Web Applications Software Engineering Eclipse Programming MySQL DB2 JDBC Java JavaSE J2EE Application... REST JSON C++ See 17+     See less Education Santa Clara University Master's degree,  Computer Engineering , 3.59/4.00 2013  – 2015 Jawaharlal Nehru Technological University Bachelor of Technology (B.Tech.),  Electronics and Communication Engineering 2007  – 2011 Activities and Societies:  Secretary ,  Rotaract GVPCOE ,  Executive Council Member of AECE (Association of Electronics and Communication Engineers) ,  Member of editorial board ,  Electrozoom Santa Clara University Master's degree,  Computer Engineering , 3.59/4.00 2013  – 2015 Santa Clara University Master's degree,  Computer Engineering , 3.59/4.00 2013  – 2015 Santa Clara University Master's degree,  Computer Engineering , 3.59/4.00 2013  – 2015 Jawaharlal Nehru Technological University Bachelor of Technology (B.Tech.),  Electronics and Communication Engineering 2007  – 2011 Activities and Societies:  Secretary ,  Rotaract GVPCOE ,  Executive Council Member of AECE (Association of Electronics and Communication Engineers) ,  Member of editorial board ,  Electrozoom Jawaharlal Nehru Technological University Bachelor of Technology (B.Tech.),  Electronics and Communication Engineering 2007  – 2011 Activities and Societies:  Secretary ,  Rotaract GVPCOE ,  Executive Council Member of AECE (Association of Electronics and Communication Engineers) ,  Member of editorial board ,  Electrozoom Jawaharlal Nehru Technological University Bachelor of Technology (B.Tech.),  Electronics and Communication Engineering 2007  – 2011 Activities and Societies:  Secretary ,  Rotaract GVPCOE ,  Executive Council Member of AECE (Association of Electronics and Communication Engineers) ,  Member of editorial board ,  Electrozoom Honors & Awards Kudos Award Tata Consultancy Services Ltd. November 2011 Award for exceptional performance in the Initial Learning Program (ILP) at TCS (Top 5% of a group of 250 associates) On the Spot Award Tata Consultancy Services Ltd. September 2012 Awarded for excellent performance and high quality deliverables in a team of 47 associates. First Prize for Paper Presentation at Kshetragn 2010 GITAM University 2010 Kudos Award Tata Consultancy Services Ltd. November 2011 Award for exceptional performance in the Initial Learning Program (ILP) at TCS (Top 5% of a group of 250 associates) Kudos Award Tata Consultancy Services Ltd. November 2011 Award for exceptional performance in the Initial Learning Program (ILP) at TCS (Top 5% of a group of 250 associates) Kudos Award Tata Consultancy Services Ltd. November 2011 Award for exceptional performance in the Initial Learning Program (ILP) at TCS (Top 5% of a group of 250 associates) On the Spot Award Tata Consultancy Services Ltd. September 2012 Awarded for excellent performance and high quality deliverables in a team of 47 associates. On the Spot Award Tata Consultancy Services Ltd. September 2012 Awarded for excellent performance and high quality deliverables in a team of 47 associates. On the Spot Award Tata Consultancy Services Ltd. September 2012 Awarded for excellent performance and high quality deliverables in a team of 47 associates. First Prize for Paper Presentation at Kshetragn 2010 GITAM University 2010 First Prize for Paper Presentation at Kshetragn 2010 GITAM University 2010 First Prize for Paper Presentation at Kshetragn 2010 GITAM University 2010 ", "Languages   Skills Skills     Honors & Awards ", "Experience Developer/Programmer Analyst II Yusen Logistics (Americas), Inc. August 2014  – Present (1 year 1 month) Cordova, TN Systems Analyst Yusen Logistics (Americas), Inc. September 2013  –  July 2014  (11 months) Garden City, New York Roles and responsibilities include: Data analysis and data manipulation; Database creation; Performing database queries, movements, functions and reports utilizing screens and interfaces; Importing Excel files into Access and documentation. Computer Support Consultant Carnegie Mellon University's Heinz College August 2012  –  August 2013  (1 year 1 month) The Cluster User Consultants are the first point of contact for students, staff and faculty seeking technical assistance for cluster, classroom, and network services issues. They serve as members of the Heinz Computing department by providing technical support over the phone and in person, and maintain the smooth operation of the Heinz Computing clusters and network printers. Cluster User Consultants also work with the administrative office of computing services, learning and maintaining the daily functions of the office. vLab System Administrator Carnegie Mellon University's Heinz College 2012  –  2012  (less than a year) The Systems Administrator for the Virtual Lab primary responsibilities include application packaging with VMWare \nThinApp; ThinApp application testing; ThinApp Application deployment; Virtual image creation and testing in VMWare \nView; system user support; and documentation. Account Manager MMI Marketing 2012  –  2012  (less than a year) Advertising, Communication, Consulting, Education/Teaching, Human Resources, Management/Administration, \nMarketing/Sales, Public Relations/Event Planning Administrative/Technological Assistant Pittsburgh Digital 2011  –  2011  (less than a year) Greater Pittsburgh Area Assisted in the production of prototypes for various musical technologies. Dealt with administrative and IT decisions. Summer Intern Software Engineering Institute 2009  –  2009  (less than a year) Greater Pittsburgh Area Solved computer related issues to ensure that the users can do their jobs. Duties included \nbuilding computers, software installs and fixes, and solving networking issues. Summer Intern Arup 2008  –  2008  (less than a year) Greater New York City Area Commissioning Intern: Duties included document creating and editing; observing the commissioning progress at various \nbuild sites; assistance with the creation of a new website; worked on projects involving building controls. Developer/Programmer Analyst II Yusen Logistics (Americas), Inc. August 2014  – Present (1 year 1 month) Cordova, TN Developer/Programmer Analyst II Yusen Logistics (Americas), Inc. August 2014  – Present (1 year 1 month) Cordova, TN Systems Analyst Yusen Logistics (Americas), Inc. September 2013  –  July 2014  (11 months) Garden City, New York Roles and responsibilities include: Data analysis and data manipulation; Database creation; Performing database queries, movements, functions and reports utilizing screens and interfaces; Importing Excel files into Access and documentation. Systems Analyst Yusen Logistics (Americas), Inc. September 2013  –  July 2014  (11 months) Garden City, New York Roles and responsibilities include: Data analysis and data manipulation; Database creation; Performing database queries, movements, functions and reports utilizing screens and interfaces; Importing Excel files into Access and documentation. Computer Support Consultant Carnegie Mellon University's Heinz College August 2012  –  August 2013  (1 year 1 month) The Cluster User Consultants are the first point of contact for students, staff and faculty seeking technical assistance for cluster, classroom, and network services issues. They serve as members of the Heinz Computing department by providing technical support over the phone and in person, and maintain the smooth operation of the Heinz Computing clusters and network printers. Cluster User Consultants also work with the administrative office of computing services, learning and maintaining the daily functions of the office. Computer Support Consultant Carnegie Mellon University's Heinz College August 2012  –  August 2013  (1 year 1 month) The Cluster User Consultants are the first point of contact for students, staff and faculty seeking technical assistance for cluster, classroom, and network services issues. They serve as members of the Heinz Computing department by providing technical support over the phone and in person, and maintain the smooth operation of the Heinz Computing clusters and network printers. Cluster User Consultants also work with the administrative office of computing services, learning and maintaining the daily functions of the office. vLab System Administrator Carnegie Mellon University's Heinz College 2012  –  2012  (less than a year) The Systems Administrator for the Virtual Lab primary responsibilities include application packaging with VMWare \nThinApp; ThinApp application testing; ThinApp Application deployment; Virtual image creation and testing in VMWare \nView; system user support; and documentation. vLab System Administrator Carnegie Mellon University's Heinz College 2012  –  2012  (less than a year) The Systems Administrator for the Virtual Lab primary responsibilities include application packaging with VMWare \nThinApp; ThinApp application testing; ThinApp Application deployment; Virtual image creation and testing in VMWare \nView; system user support; and documentation. Account Manager MMI Marketing 2012  –  2012  (less than a year) Advertising, Communication, Consulting, Education/Teaching, Human Resources, Management/Administration, \nMarketing/Sales, Public Relations/Event Planning Account Manager MMI Marketing 2012  –  2012  (less than a year) Advertising, Communication, Consulting, Education/Teaching, Human Resources, Management/Administration, \nMarketing/Sales, Public Relations/Event Planning Administrative/Technological Assistant Pittsburgh Digital 2011  –  2011  (less than a year) Greater Pittsburgh Area Assisted in the production of prototypes for various musical technologies. Dealt with administrative and IT decisions. Administrative/Technological Assistant Pittsburgh Digital 2011  –  2011  (less than a year) Greater Pittsburgh Area Assisted in the production of prototypes for various musical technologies. Dealt with administrative and IT decisions. Summer Intern Software Engineering Institute 2009  –  2009  (less than a year) Greater Pittsburgh Area Solved computer related issues to ensure that the users can do their jobs. Duties included \nbuilding computers, software installs and fixes, and solving networking issues. Summer Intern Software Engineering Institute 2009  –  2009  (less than a year) Greater Pittsburgh Area Solved computer related issues to ensure that the users can do their jobs. Duties included \nbuilding computers, software installs and fixes, and solving networking issues. Summer Intern Arup 2008  –  2008  (less than a year) Greater New York City Area Commissioning Intern: Duties included document creating and editing; observing the commissioning progress at various \nbuild sites; assistance with the creation of a new website; worked on projects involving building controls. Summer Intern Arup 2008  –  2008  (less than a year) Greater New York City Area Commissioning Intern: Duties included document creating and editing; observing the commissioning progress at various \nbuild sites; assistance with the creation of a new website; worked on projects involving building controls. Languages English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Microsoft Office Visio Microsoft Excel Access MS Project PowerPoint Minitab Logic Pro German Pro Tools SQL Server Management... Microsoft SQL Server Data Analysis Skills  Microsoft Office Visio Microsoft Excel Access MS Project PowerPoint Minitab Logic Pro German Pro Tools SQL Server Management... Microsoft SQL Server Data Analysis Microsoft Office Visio Microsoft Excel Access MS Project PowerPoint Minitab Logic Pro German Pro Tools SQL Server Management... Microsoft SQL Server Data Analysis Microsoft Office Visio Microsoft Excel Access MS Project PowerPoint Minitab Logic Pro German Pro Tools SQL Server Management... Microsoft SQL Server Data Analysis Education Carnegie Mellon University Bachelor of Science (BS),  Policy and Management 2007  – 2013 Carnegie Mellon University Minor,  Music Technology 2007  – 2013 Carnegie Mellon University Bachelor of Science (BS),  Policy and Management 2007  – 2013 Carnegie Mellon University Bachelor of Science (BS),  Policy and Management 2007  – 2013 Carnegie Mellon University Bachelor of Science (BS),  Policy and Management 2007  – 2013 Carnegie Mellon University Minor,  Music Technology 2007  – 2013 Carnegie Mellon University Minor,  Music Technology 2007  – 2013 Carnegie Mellon University Minor,  Music Technology 2007  – 2013 "]}