{"position": "Supervisor", "company": "Google", "profiles": ["Summary 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects Summary 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects 20 years of experience in Accounting and Finance with expertise in financial accounting, planning, reporting, outsourcing, process transformation and re-engineering. During my career to date I have successfully reshaped functions, departments and teams resulting in performance improvement and growth together with the successful implementation of key strategic initiatives.  \n \nI have proven management and interpersonal skills with recognised ability to lead, coach and motivate team members, vendors, peers and executives locally, cross functionally and across multiple geographies. \n \nExcellent business acumen and experience in practice, industry and financial services as a member of Chartered Accountants Ireland. Technically up to date on key financial reporting and tax requirements. I am a confident communicator and experienced facilitator for workshops and team strategy setting. Specialties:Management, Financial Accounting, Reporting, Outsourcing, Process Improvement, Controls, Projects Experience Director FP&A Yahoo EMEA Yahoo April 2015  – Present (5 months) Senior Manager - FP&A Yahoo EMEA Yahoo 2014  – Present (1 year) Head of EMEA FP&A for Revenue and Cost. This includes the Sales Commission process. Senior Manager, EMEA Accounting and Reporting Yahoo 2013  –  2014  (1 year) Responsible for the full end to end EMEA Revenue Accounting process. Senior Manager, EMEA Accounting and Reporting Yahoo 2012  –  2013  (1 year) Responsible for the full end to end EMEA General Accounting function together with the Global Intercompany Process Senior Manager, EMEA Accounting and Reporting Yahoo 2011  –  2012  (1 year) Dublin Responsible for the full end to end EMEA General Accounting function. Financial Operations Manager, IBM Global Business Services, Teleco Division IBM September 1997  –  April 2010  (12 years 8 months) Ireland Project Accounting Manager - Accounting COE - Software Group IBM March 2007  –  November 2007  (9 months) Ireland Business Operations and Foreign Trade Manager - Intergrated Supply Chain IBM January 2004  –  August 2006  (2 years 8 months) Ireland Finance and Business Operations Manager - Site Operations IBM October 2000  –  January 2004  (3 years 4 months) Ireland Finance and Planning Analyst Lead - Global Services IBM September 1997  –  September 2000  (3 years 1 month) Ireland Project Accountant - Shares Dividends Department Bank Of Ireland 1996  –  1997  (1 year) Trainee Chartered Accountant John P Greely & Co, Chartered Accountants 1992  –  1996  (4 years) Director FP&A Yahoo EMEA Yahoo April 2015  – Present (5 months) Director FP&A Yahoo EMEA Yahoo April 2015  – Present (5 months) Senior Manager - FP&A Yahoo EMEA Yahoo 2014  – Present (1 year) Head of EMEA FP&A for Revenue and Cost. This includes the Sales Commission process. Senior Manager - FP&A Yahoo EMEA Yahoo 2014  – Present (1 year) Head of EMEA FP&A for Revenue and Cost. This includes the Sales Commission process. Senior Manager, EMEA Accounting and Reporting Yahoo 2013  –  2014  (1 year) Responsible for the full end to end EMEA Revenue Accounting process. Senior Manager, EMEA Accounting and Reporting Yahoo 2013  –  2014  (1 year) Responsible for the full end to end EMEA Revenue Accounting process. Senior Manager, EMEA Accounting and Reporting Yahoo 2012  –  2013  (1 year) Responsible for the full end to end EMEA General Accounting function together with the Global Intercompany Process Senior Manager, EMEA Accounting and Reporting Yahoo 2012  –  2013  (1 year) Responsible for the full end to end EMEA General Accounting function together with the Global Intercompany Process Senior Manager, EMEA Accounting and Reporting Yahoo 2011  –  2012  (1 year) Dublin Responsible for the full end to end EMEA General Accounting function. Senior Manager, EMEA Accounting and Reporting Yahoo 2011  –  2012  (1 year) Dublin Responsible for the full end to end EMEA General Accounting function. Financial Operations Manager, IBM Global Business Services, Teleco Division IBM September 1997  –  April 2010  (12 years 8 months) Ireland Financial Operations Manager, IBM Global Business Services, Teleco Division IBM September 1997  –  April 2010  (12 years 8 months) Ireland Project Accounting Manager - Accounting COE - Software Group IBM March 2007  –  November 2007  (9 months) Ireland Project Accounting Manager - Accounting COE - Software Group IBM March 2007  –  November 2007  (9 months) Ireland Business Operations and Foreign Trade Manager - Intergrated Supply Chain IBM January 2004  –  August 2006  (2 years 8 months) Ireland Business Operations and Foreign Trade Manager - Intergrated Supply Chain IBM January 2004  –  August 2006  (2 years 8 months) Ireland Finance and Business Operations Manager - Site Operations IBM October 2000  –  January 2004  (3 years 4 months) Ireland Finance and Business Operations Manager - Site Operations IBM October 2000  –  January 2004  (3 years 4 months) Ireland Finance and Planning Analyst Lead - Global Services IBM September 1997  –  September 2000  (3 years 1 month) Ireland Finance and Planning Analyst Lead - Global Services IBM September 1997  –  September 2000  (3 years 1 month) Ireland Project Accountant - Shares Dividends Department Bank Of Ireland 1996  –  1997  (1 year) Project Accountant - Shares Dividends Department Bank Of Ireland 1996  –  1997  (1 year) Trainee Chartered Accountant John P Greely & Co, Chartered Accountants 1992  –  1996  (4 years) Trainee Chartered Accountant John P Greely & Co, Chartered Accountants 1992  –  1996  (4 years) Skills Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Skills  Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Internal Controls Management Financial Reporting Process Improvement Sarbanes-Oxley Act Financial Accounting Strategy Managerial Finance Outsourcing Accounting Education Institute of Chartered Accountants in Ire 1993  – 1997 Dublin Business School 1991  – 1992 Institute of Chartered Accountants in Ire 1993  – 1997 Institute of Chartered Accountants in Ire 1993  – 1997 Institute of Chartered Accountants in Ire 1993  – 1997 Dublin Business School 1991  – 1992 Dublin Business School 1991  – 1992 Dublin Business School 1991  – 1992 ", "Experience Product Manager Yahoo May 2013  – Present (2 years 4 months) Sunnyvale Search Editorial Manager Yahoo! February 2011  – Present (4 years 7 months) Managed a team of 7 resources which included mobile and web search editors \n•\tAm the market lead for Direct Displays on Yahoo! India Search page and was involved from planning to production stages of the direct diplays. Set the roadmap and goal for India market while working with the international leads and Product Manager’s. \n•\tWorked with engineering, product, sales, legal to implement critical project for India Search like cricket direct display, bing transition etc. \n•\tEnsuring the daily programming of the Trending Searches feed that is featured on the home pages and other properties of Yahoo! India. Trending Searches, which appears on both Web and Mobile versions of Yahoo, is based on the latest Search data and trends \n•\tEnsuring Yahoo! Search users find relevant answers to their queries as quickly as possible by managing editorial testing that is basis for algorithmic results improvements; programming of Search Shortcuts, filtering of adult and illegal results, programming of News and Image Direct Displays, and programming of promotional ads Program Manager Yahoo! August 2012  –  April 2013  (9 months) Sunnyvale Asst Product Manager Yahoo! June 2009  –  February 2011  (1 year 9 months) Bangalore, India •\tWorked with India metrics team to come out with a standard dashboard for India Search which included me to understand various tools which resulted in a dashboard which summarizes the IN search and is send across to various management folks. \n•\tPlayed an important part to sync up with global Shortcut leads to get Direct Display’s implemented for local market \n•\tPoint of contact for any new or enhanced DD/IY for India in terms of market requirements, Query Planner feed updation, QA, and sign off. \n•\tLaunched Query Categorization project in India to identify the top categories queries and their intents on IN search which was later used by various other teams like Yahoo! Movies, Yahoo! cricket, etc to get the query pattern and query volume related to these categories \n•\tWorked in sync with Front Page team to make the best for search on Front Page. Tracked performance of the Front Page search box and trending terms on weekly and monthly basis and understood the reason for rise and fall in numbers. Web and Mobile Search Quality Analyst Yahoo! November 2006  –  June 2009  (2 years 8 months) Product Manager Yahoo May 2013  – Present (2 years 4 months) Sunnyvale Product Manager Yahoo May 2013  – Present (2 years 4 months) Sunnyvale Search Editorial Manager Yahoo! February 2011  – Present (4 years 7 months) Managed a team of 7 resources which included mobile and web search editors \n•\tAm the market lead for Direct Displays on Yahoo! India Search page and was involved from planning to production stages of the direct diplays. Set the roadmap and goal for India market while working with the international leads and Product Manager’s. \n•\tWorked with engineering, product, sales, legal to implement critical project for India Search like cricket direct display, bing transition etc. \n•\tEnsuring the daily programming of the Trending Searches feed that is featured on the home pages and other properties of Yahoo! India. Trending Searches, which appears on both Web and Mobile versions of Yahoo, is based on the latest Search data and trends \n•\tEnsuring Yahoo! Search users find relevant answers to their queries as quickly as possible by managing editorial testing that is basis for algorithmic results improvements; programming of Search Shortcuts, filtering of adult and illegal results, programming of News and Image Direct Displays, and programming of promotional ads Search Editorial Manager Yahoo! February 2011  – Present (4 years 7 months) Managed a team of 7 resources which included mobile and web search editors \n•\tAm the market lead for Direct Displays on Yahoo! India Search page and was involved from planning to production stages of the direct diplays. Set the roadmap and goal for India market while working with the international leads and Product Manager’s. \n•\tWorked with engineering, product, sales, legal to implement critical project for India Search like cricket direct display, bing transition etc. \n•\tEnsuring the daily programming of the Trending Searches feed that is featured on the home pages and other properties of Yahoo! India. Trending Searches, which appears on both Web and Mobile versions of Yahoo, is based on the latest Search data and trends \n•\tEnsuring Yahoo! Search users find relevant answers to their queries as quickly as possible by managing editorial testing that is basis for algorithmic results improvements; programming of Search Shortcuts, filtering of adult and illegal results, programming of News and Image Direct Displays, and programming of promotional ads Program Manager Yahoo! August 2012  –  April 2013  (9 months) Sunnyvale Program Manager Yahoo! August 2012  –  April 2013  (9 months) Sunnyvale Asst Product Manager Yahoo! June 2009  –  February 2011  (1 year 9 months) Bangalore, India •\tWorked with India metrics team to come out with a standard dashboard for India Search which included me to understand various tools which resulted in a dashboard which summarizes the IN search and is send across to various management folks. \n•\tPlayed an important part to sync up with global Shortcut leads to get Direct Display’s implemented for local market \n•\tPoint of contact for any new or enhanced DD/IY for India in terms of market requirements, Query Planner feed updation, QA, and sign off. \n•\tLaunched Query Categorization project in India to identify the top categories queries and their intents on IN search which was later used by various other teams like Yahoo! Movies, Yahoo! cricket, etc to get the query pattern and query volume related to these categories \n•\tWorked in sync with Front Page team to make the best for search on Front Page. Tracked performance of the Front Page search box and trending terms on weekly and monthly basis and understood the reason for rise and fall in numbers. Asst Product Manager Yahoo! June 2009  –  February 2011  (1 year 9 months) Bangalore, India •\tWorked with India metrics team to come out with a standard dashboard for India Search which included me to understand various tools which resulted in a dashboard which summarizes the IN search and is send across to various management folks. \n•\tPlayed an important part to sync up with global Shortcut leads to get Direct Display’s implemented for local market \n•\tPoint of contact for any new or enhanced DD/IY for India in terms of market requirements, Query Planner feed updation, QA, and sign off. \n•\tLaunched Query Categorization project in India to identify the top categories queries and their intents on IN search which was later used by various other teams like Yahoo! Movies, Yahoo! cricket, etc to get the query pattern and query volume related to these categories \n•\tWorked in sync with Front Page team to make the best for search on Front Page. Tracked performance of the Front Page search box and trending terms on weekly and monthly basis and understood the reason for rise and fall in numbers. Web and Mobile Search Quality Analyst Yahoo! November 2006  –  June 2009  (2 years 8 months) Web and Mobile Search Quality Analyst Yahoo! November 2006  –  June 2009  (2 years 8 months) Skills Search Mobile Devices Agile Methodologies Project Management Analysis Team Management Testing Management Product Management Skills  Search Mobile Devices Agile Methodologies Project Management Analysis Team Management Testing Management Product Management Search Mobile Devices Agile Methodologies Project Management Analysis Team Management Testing Management Product Management Search Mobile Devices Agile Methodologies Project Management Analysis Team Management Testing Management Product Management Education International Institute of Information Technology Master of Business Administration (MBA) Malnad College of Engg Bachelor of Engineering (BE) International Institute of Information Technology Master of Business Administration (MBA) International Institute of Information Technology Master of Business Administration (MBA) International Institute of Information Technology Master of Business Administration (MBA) Malnad College of Engg Bachelor of Engineering (BE) Malnad College of Engg Bachelor of Engineering (BE) Malnad College of Engg Bachelor of Engineering (BE) ", "Summary A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. Summary A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. A highly self-motivated manager with wide-ranging experience in the areas of software development, project management (PMP certified), account management, customer support and QA in the area of mobile services. With over 10 years of experience in the mobile sector, and deep knowledge of how telcos/carriers in Asia and Europe operate and a good understanding of the systems and processes within these organizations. In depth understanding of the mobile eco-system and how the different players interact.  \n \nHave experience working in start-up, R&D and MNC environments and familiar with matrix structure and working with teams both local and remote. Have a proven track record of working with people across cultures and have built cross-border teams with members from Singapore, India, UK, Indonesia and China. Specialties:Project management across US, EU, Asia. Operationalized test pipeline. People management – hired/trained/coached several mobile test teams. Set up and ran outsourced in-market and mobile device testing. Knowledge of SMS/carrier billing protocols, mobile Web and native client (iOS/Android) testing. Developed test frameworks using Perl, TestNG, HTMLUnit/Webdriver. Set up automation for CI (Hudson). Excellent communication skills – conducted training on mobile testing. Fluent in Mandarin. Experience Senior Manager, Engineering Services (Quality Engineering Tools and Best Practices) Yahoo April 2014  – Present (1 year 5 months) United States Building up the mobile (apps) quality team and capabilities at Yahoo! Manager, Quality Engineering Tools and Best Practices Yahoo! January 2013  –  March 2014  (1 year 3 months) United States In charge of test strategy and test tools for Mobile and Emerging Products organization.  \nSet up a team of top notch mobile test engineers to support various mobile app teams.  \nTeam supported launch of Weather, Yahoo and Flickr mobile apps. \nIn charge of Mobile Web Standards for company.  \nMember of Quality Council. \nSet up mobile device testing strategy for entire mobile organization. \nDefined roles and expectations for various levels of SET for mobile organization. \nSet up interview pipeline for hiring SETs for mobile organization. QA Manager - Media Experiences Mobile Yahoo! August 2011  –  December 2012  (1 year 5 months) Sunnyvale, CA Define Mobile Testing Strategy for Mobile Web and Native apps across Media Experiences team \nDevelop training plans and material on mobile testing for QA/testers in Media Experiences team. \nManage/Coach/Mentor team of 6 mobile test engineers in US/TW. QA Manager – Global Mobile Frontdoors Yahoo! November 2010  –  August 2011  (10 months) Singapore •\tIn charge of QA team of 5 QA engineers globally in 3 locations: Singapore, London, Delhi \n•\tIn charge of QA of mobile web frontpage, iPhone app QA Manager (Mobile ICE) APAC/EU Yahoo! December 2009  –  November 2010  (1 year) •\tManage team of 5 QA engineers and testers from 3 locations: Singapore, London, Delhi. \n•\tWinner of ICE Hack day – conceived the idea for winning app and led the dev, design and test teams to build and deploy the app.  \n•\tConceived, designed and built test framework using TestNG and HTMLUnit for easy test automation setup. \n•\tImproved QA project process by setting up framework for team to manage various QA aspects of projects. Regional QA Manager / Ad-Syndication Engineering Lead Yahoo! January 2008  –  December 2009  (2 years) •\tManage team of 6 QA engineers and testers. \n•\tProject manage daily bug prioritization for APAC/LATAM/EU mobile projects for bi-weekly sprints – this involved coordination between peer teams based in US and London. Set up coordination framework to facilitate communication and sharing of information and resources.  \n•\tOperationalized testing across APAC, LATAM, EU for oneSearch, new mobile frontpage \n•\tEngineering and QA support for integration of ad syndication platform with Maxis, Idea, Hutch (AU) \n•\tSet up automated testing for US team in support of AT&T oneSearch launch \n•\tConceived and built automated test process for Y! Mobile Widgets for APAC using Selenium framework. \n•\tResponsible for demo handset set up for CommunicAsia 2008 and 2009 for Y! Mobile \n•\tYahoo! Superstar Nominee (2008, 2009) Regional QA Manager Yahoo! January 2007  –  December 2008  (2 years) •\tSet up QA organization within Yahoo! Connected Life APAC team. This was a regional team for localization testing.  \n•\tResponsible for QA for Yahoo! mobile products across Singapore, Malaysia, Vietnam, Thailand, Indonesia, , India, Korea, Taiwan, Australia, New Zealand, Hong Kong. Products launched - Yahoo! Go, oneSearch, mobile websites, WAP Mail/Messenger, SMS oneSearch. \n•\tSet up test automation framework using Perl WWW::Mechanize for all APAC frontpages, oneSearch localization and subscription services.  \n•\tSet up outsourced in-market testing framework for carrier testing Yahoo! mobile apps across Asia.  \n•\tQA responsibilities include supporting 20+ carrier partners in APAC. Presentations made to Globe, Sensis (AU), TNZ among others. \n•\tResponsible for demo handset set up for GSMA Asia Mobile Congress in Macau for Y! Mobile \n•\tYahoo! Connected Life \"Go Big\" team award Lead Mobile Engineer Yahoo! South East Asia August 2005  –  January 2007  (1 year 6 months) •\tSingle Mobile Engineer managing SMS, WAP and BI platforms across South East Asia – Singapore, Malaysia, Philippines, Thailand, Vietnam, Indonesia. This involved ensuring all services were working well with minimal downtime due to carrier issues.  \n•\tEngineering lead for launching SMS services in Vietnam. This required deep involvement in setting up connectivity between SMS aggregator, technical evaluation of aggregator and working with SMS Messenger team to complete the integration.  \n•\tManaged the transition of Mobile operations to team in Bangalore and lead for Business Continuity project.  \n•\tManaged 2 data center migrations for mobile properties.  \n•\tSet up better monitoring and escalations – this led to improved SMS connectivity with carriers thus leading to doubling of mobile revenue. \n•\tYahoo! Odessey Award winner - for leadership in SEA Mobile \n•\tYahoo! Superstar Nominee. Consultant , Customer Support, Developer, Account Manager Flying Broom Pte Ltd (Tech startup) September 2000  –  August 2005  (5 years) •\tPioneer member of start-up. Participated in the growth of company from angel funding phase to conceptualizing and deploying own solution to paying customer.  \n•\tInvolved in conceptualization and writing of formal project proposals to customers.  \n•\tEditor of software manuals for company.  \n•\tInvolved in various aspects of solution delivery process from requirements gathering to deployment of system to providing 24x7 operations support for end-users.  \n•\tConceptualized, built and deployed GUI for distributed real-time system incorporating workflow management of real-time, mobile content delivery system.  \n•\tConceptualized and built business intelligence system handling millions of records each day. Research Assistant National University of Singapore July 1996  –  September 2000  (4 years 3 months) 1. Project managed 2 government funded research projects: \na. port vessel assignment project \nb. bus/subway commuter routing project \nsee http://citeseer.ist.psu.edu/281757.html \n2. Assisted professor in running research lab - Resource Allocation and Scheduling Lab (NUS) Senior Manager, Engineering Services (Quality Engineering Tools and Best Practices) Yahoo April 2014  – Present (1 year 5 months) United States Building up the mobile (apps) quality team and capabilities at Yahoo! Senior Manager, Engineering Services (Quality Engineering Tools and Best Practices) Yahoo April 2014  – Present (1 year 5 months) United States Building up the mobile (apps) quality team and capabilities at Yahoo! Manager, Quality Engineering Tools and Best Practices Yahoo! January 2013  –  March 2014  (1 year 3 months) United States In charge of test strategy and test tools for Mobile and Emerging Products organization.  \nSet up a team of top notch mobile test engineers to support various mobile app teams.  \nTeam supported launch of Weather, Yahoo and Flickr mobile apps. \nIn charge of Mobile Web Standards for company.  \nMember of Quality Council. \nSet up mobile device testing strategy for entire mobile organization. \nDefined roles and expectations for various levels of SET for mobile organization. \nSet up interview pipeline for hiring SETs for mobile organization. Manager, Quality Engineering Tools and Best Practices Yahoo! January 2013  –  March 2014  (1 year 3 months) United States In charge of test strategy and test tools for Mobile and Emerging Products organization.  \nSet up a team of top notch mobile test engineers to support various mobile app teams.  \nTeam supported launch of Weather, Yahoo and Flickr mobile apps. \nIn charge of Mobile Web Standards for company.  \nMember of Quality Council. \nSet up mobile device testing strategy for entire mobile organization. \nDefined roles and expectations for various levels of SET for mobile organization. \nSet up interview pipeline for hiring SETs for mobile organization. QA Manager - Media Experiences Mobile Yahoo! August 2011  –  December 2012  (1 year 5 months) Sunnyvale, CA Define Mobile Testing Strategy for Mobile Web and Native apps across Media Experiences team \nDevelop training plans and material on mobile testing for QA/testers in Media Experiences team. \nManage/Coach/Mentor team of 6 mobile test engineers in US/TW. QA Manager - Media Experiences Mobile Yahoo! August 2011  –  December 2012  (1 year 5 months) Sunnyvale, CA Define Mobile Testing Strategy for Mobile Web and Native apps across Media Experiences team \nDevelop training plans and material on mobile testing for QA/testers in Media Experiences team. \nManage/Coach/Mentor team of 6 mobile test engineers in US/TW. QA Manager – Global Mobile Frontdoors Yahoo! November 2010  –  August 2011  (10 months) Singapore •\tIn charge of QA team of 5 QA engineers globally in 3 locations: Singapore, London, Delhi \n•\tIn charge of QA of mobile web frontpage, iPhone app QA Manager – Global Mobile Frontdoors Yahoo! November 2010  –  August 2011  (10 months) Singapore •\tIn charge of QA team of 5 QA engineers globally in 3 locations: Singapore, London, Delhi \n•\tIn charge of QA of mobile web frontpage, iPhone app QA Manager (Mobile ICE) APAC/EU Yahoo! December 2009  –  November 2010  (1 year) •\tManage team of 5 QA engineers and testers from 3 locations: Singapore, London, Delhi. \n•\tWinner of ICE Hack day – conceived the idea for winning app and led the dev, design and test teams to build and deploy the app.  \n•\tConceived, designed and built test framework using TestNG and HTMLUnit for easy test automation setup. \n•\tImproved QA project process by setting up framework for team to manage various QA aspects of projects. QA Manager (Mobile ICE) APAC/EU Yahoo! December 2009  –  November 2010  (1 year) •\tManage team of 5 QA engineers and testers from 3 locations: Singapore, London, Delhi. \n•\tWinner of ICE Hack day – conceived the idea for winning app and led the dev, design and test teams to build and deploy the app.  \n•\tConceived, designed and built test framework using TestNG and HTMLUnit for easy test automation setup. \n•\tImproved QA project process by setting up framework for team to manage various QA aspects of projects. Regional QA Manager / Ad-Syndication Engineering Lead Yahoo! January 2008  –  December 2009  (2 years) •\tManage team of 6 QA engineers and testers. \n•\tProject manage daily bug prioritization for APAC/LATAM/EU mobile projects for bi-weekly sprints – this involved coordination between peer teams based in US and London. Set up coordination framework to facilitate communication and sharing of information and resources.  \n•\tOperationalized testing across APAC, LATAM, EU for oneSearch, new mobile frontpage \n•\tEngineering and QA support for integration of ad syndication platform with Maxis, Idea, Hutch (AU) \n•\tSet up automated testing for US team in support of AT&T oneSearch launch \n•\tConceived and built automated test process for Y! Mobile Widgets for APAC using Selenium framework. \n•\tResponsible for demo handset set up for CommunicAsia 2008 and 2009 for Y! Mobile \n•\tYahoo! Superstar Nominee (2008, 2009) Regional QA Manager / Ad-Syndication Engineering Lead Yahoo! January 2008  –  December 2009  (2 years) •\tManage team of 6 QA engineers and testers. \n•\tProject manage daily bug prioritization for APAC/LATAM/EU mobile projects for bi-weekly sprints – this involved coordination between peer teams based in US and London. Set up coordination framework to facilitate communication and sharing of information and resources.  \n•\tOperationalized testing across APAC, LATAM, EU for oneSearch, new mobile frontpage \n•\tEngineering and QA support for integration of ad syndication platform with Maxis, Idea, Hutch (AU) \n•\tSet up automated testing for US team in support of AT&T oneSearch launch \n•\tConceived and built automated test process for Y! Mobile Widgets for APAC using Selenium framework. \n•\tResponsible for demo handset set up for CommunicAsia 2008 and 2009 for Y! Mobile \n•\tYahoo! Superstar Nominee (2008, 2009) Regional QA Manager Yahoo! January 2007  –  December 2008  (2 years) •\tSet up QA organization within Yahoo! Connected Life APAC team. This was a regional team for localization testing.  \n•\tResponsible for QA for Yahoo! mobile products across Singapore, Malaysia, Vietnam, Thailand, Indonesia, , India, Korea, Taiwan, Australia, New Zealand, Hong Kong. Products launched - Yahoo! Go, oneSearch, mobile websites, WAP Mail/Messenger, SMS oneSearch. \n•\tSet up test automation framework using Perl WWW::Mechanize for all APAC frontpages, oneSearch localization and subscription services.  \n•\tSet up outsourced in-market testing framework for carrier testing Yahoo! mobile apps across Asia.  \n•\tQA responsibilities include supporting 20+ carrier partners in APAC. Presentations made to Globe, Sensis (AU), TNZ among others. \n•\tResponsible for demo handset set up for GSMA Asia Mobile Congress in Macau for Y! Mobile \n•\tYahoo! Connected Life \"Go Big\" team award Regional QA Manager Yahoo! January 2007  –  December 2008  (2 years) •\tSet up QA organization within Yahoo! Connected Life APAC team. This was a regional team for localization testing.  \n•\tResponsible for QA for Yahoo! mobile products across Singapore, Malaysia, Vietnam, Thailand, Indonesia, , India, Korea, Taiwan, Australia, New Zealand, Hong Kong. Products launched - Yahoo! Go, oneSearch, mobile websites, WAP Mail/Messenger, SMS oneSearch. \n•\tSet up test automation framework using Perl WWW::Mechanize for all APAC frontpages, oneSearch localization and subscription services.  \n•\tSet up outsourced in-market testing framework for carrier testing Yahoo! mobile apps across Asia.  \n•\tQA responsibilities include supporting 20+ carrier partners in APAC. Presentations made to Globe, Sensis (AU), TNZ among others. \n•\tResponsible for demo handset set up for GSMA Asia Mobile Congress in Macau for Y! Mobile \n•\tYahoo! Connected Life \"Go Big\" team award Lead Mobile Engineer Yahoo! South East Asia August 2005  –  January 2007  (1 year 6 months) •\tSingle Mobile Engineer managing SMS, WAP and BI platforms across South East Asia – Singapore, Malaysia, Philippines, Thailand, Vietnam, Indonesia. This involved ensuring all services were working well with minimal downtime due to carrier issues.  \n•\tEngineering lead for launching SMS services in Vietnam. This required deep involvement in setting up connectivity between SMS aggregator, technical evaluation of aggregator and working with SMS Messenger team to complete the integration.  \n•\tManaged the transition of Mobile operations to team in Bangalore and lead for Business Continuity project.  \n•\tManaged 2 data center migrations for mobile properties.  \n•\tSet up better monitoring and escalations – this led to improved SMS connectivity with carriers thus leading to doubling of mobile revenue. \n•\tYahoo! Odessey Award winner - for leadership in SEA Mobile \n•\tYahoo! Superstar Nominee. Lead Mobile Engineer Yahoo! South East Asia August 2005  –  January 2007  (1 year 6 months) •\tSingle Mobile Engineer managing SMS, WAP and BI platforms across South East Asia – Singapore, Malaysia, Philippines, Thailand, Vietnam, Indonesia. This involved ensuring all services were working well with minimal downtime due to carrier issues.  \n•\tEngineering lead for launching SMS services in Vietnam. This required deep involvement in setting up connectivity between SMS aggregator, technical evaluation of aggregator and working with SMS Messenger team to complete the integration.  \n•\tManaged the transition of Mobile operations to team in Bangalore and lead for Business Continuity project.  \n•\tManaged 2 data center migrations for mobile properties.  \n•\tSet up better monitoring and escalations – this led to improved SMS connectivity with carriers thus leading to doubling of mobile revenue. \n•\tYahoo! Odessey Award winner - for leadership in SEA Mobile \n•\tYahoo! Superstar Nominee. Consultant , Customer Support, Developer, Account Manager Flying Broom Pte Ltd (Tech startup) September 2000  –  August 2005  (5 years) •\tPioneer member of start-up. Participated in the growth of company from angel funding phase to conceptualizing and deploying own solution to paying customer.  \n•\tInvolved in conceptualization and writing of formal project proposals to customers.  \n•\tEditor of software manuals for company.  \n•\tInvolved in various aspects of solution delivery process from requirements gathering to deployment of system to providing 24x7 operations support for end-users.  \n•\tConceptualized, built and deployed GUI for distributed real-time system incorporating workflow management of real-time, mobile content delivery system.  \n•\tConceptualized and built business intelligence system handling millions of records each day. Consultant , Customer Support, Developer, Account Manager Flying Broom Pte Ltd (Tech startup) September 2000  –  August 2005  (5 years) •\tPioneer member of start-up. Participated in the growth of company from angel funding phase to conceptualizing and deploying own solution to paying customer.  \n•\tInvolved in conceptualization and writing of formal project proposals to customers.  \n•\tEditor of software manuals for company.  \n•\tInvolved in various aspects of solution delivery process from requirements gathering to deployment of system to providing 24x7 operations support for end-users.  \n•\tConceptualized, built and deployed GUI for distributed real-time system incorporating workflow management of real-time, mobile content delivery system.  \n•\tConceptualized and built business intelligence system handling millions of records each day. Research Assistant National University of Singapore July 1996  –  September 2000  (4 years 3 months) 1. Project managed 2 government funded research projects: \na. port vessel assignment project \nb. bus/subway commuter routing project \nsee http://citeseer.ist.psu.edu/281757.html \n2. Assisted professor in running research lab - Resource Allocation and Scheduling Lab (NUS) Research Assistant National University of Singapore July 1996  –  September 2000  (4 years 3 months) 1. Project managed 2 government funded research projects: \na. port vessel assignment project \nb. bus/subway commuter routing project \nsee http://citeseer.ist.psu.edu/281757.html \n2. Assisted professor in running research lab - Resource Allocation and Scheduling Lab (NUS) Languages English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Skills  Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Mobile Devices Agile Methodologies Product Management Perl Mobile Applications Software Project... Mobile Internet Mobile Technology Test Automation Software Quality... Scrum iPhone Team Management Selenium Software Development Android Web Applications User Experience Software Engineering Agile Project Management TestNG Project Management Java PHP REST Subversion Linux MySQL JavaScript Business Intelligence Python Web Development Apache Web Services Mobile Communications C++ Git PMP Object Oriented Design Objective-C Eclipse Testing Management Quality Assurance Scalability Start-ups Usability Testing Integration JIRA Distributed Systems See 35+     See less Education National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore BSc.,  Computer Science 1992  – 1996 St. Joseph's Institution Stanford University Stanford University National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore MSc.,  Computer Science 1997  – 2000 Applied Genetic Algorithms to a contrained resource allocation problem - ship berth allocation. National University of Singapore BSc.,  Computer Science 1992  – 1996 National University of Singapore BSc.,  Computer Science 1992  – 1996 National University of Singapore BSc.,  Computer Science 1992  – 1996 St. Joseph's Institution St. Joseph's Institution St. Joseph's Institution Stanford University Stanford University Stanford University Stanford University Stanford University Stanford University Honors & Awards Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award Additional Honors & Awards 2010 - Yahoo! ICE Hack Day winner (team award - lead) \n2008 - Nominated for Yahoo! Superstar Award \n2007 - Yahoo! Connected Life - Go BIG award - team award for Yahoo! CL APAC team for oneSearch  \n2006 - Yahoo! International Engineering Odessey Award \n2006 - Nominated for Yahoo! Superstar Award ", "Skills Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Skills  Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less Agile Methodologies Project Management Online Advertising Cross-functional Team... E-commerce Search Analytics Online Marketing Program Management Agile Project Management Strategic Partnerships Networking SEM User Experience Product Management Web Analytics SaaS Start-ups Mobile Devices See 4+     See less ", "Summary Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Summary Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Tenured career in Project & Event Management, and Continual Service Improvement, with over 7 years of proven success and leadership in the IT & Service Engineering industries. I am experienced in managing enterprise software implementations using Agile & ITIL methodologies. Certified Scrum Master and in Disaster Recovery & Business Continuity Management. I am currently pursuing CAPM & PMP certifications. Experience Sr. Project/Program Manager - Yahoo Search Products Yahoo April 2015  – Present (5 months) Sunnyvale, California Currently project managing product portfolio and service delivery for the Yahoo Search organization. Project Manager Yahoo May 2013  –  March 2015  (1 year 11 months) Sunnyvale, California I am currently managing software implementation projects to improve efficiencies for Production Operation employees. Using Agile methodologies, I am partnering alongside Engineers & Developers to deploy a machine learning solution which manages alert volume with the goals of decreasing time to detect and resolving events at a faster rate. I am also driving a project to implement an enterprise application to track & measure business continuity planning tests and results. Program Manager - Help Desk Institute (HDI) HDI Silicon Valley September 2008  –  March 2014  (5 years 7 months) Silicon Valley HDI Silicon Valley is a non-profit chapter of the HDI national organization; an industry leader in the distribution of IT best practices. As the VP of Program Management, I work with key contacts to facilitate meetings & events for IT professionals to come together to discuss common industry challenges, share ideas and build a network of contacts. Through connecting with the HDI organization, IT professionals can be connected with a wide array of career advancing opportunities across the Silicon Valley area, resulting in measurable career development. Outside of monthly Chapter IT meetings, other events I organize within SVHDI consist of Job Fairs, Resume & Interview workshops, Student meetings and key initiatives that benefit the communities of Silicon Valley. Business Operations Manager - Production Operations Yahoo! February 2011  –  May 2013  (2 years 4 months) Sunnyvale, CA Led cross functional team efforts towards implementing industry standard best practices, with the goal of improving operational maturity levels from a reactive model to a place of optimal business partnership. Using SMART goal planning, I was tasked with moving company application & server monitoring alerts to a centralized team (Tier 1), while identifying automation & self healing opportunities to reduce repetitive incidents. Documenting service management lifecycle proposals, I coordinated with vendor selection committees to review ITSM solutions, which resulted in the removal of fragmented tools & processes. The program provided significant cost savings and gave ompany engineers increased capacity to spend time on innovating for the future. Service Delivery Manager Yahoo! February 2011  –  February 2012  (1 year 1 month) Santa Clara, CA In February 2011, I co-founded and successfully launched a Quality of Service team, which was based on ITIL v3 continual service improvement best practices. After outlining the team vision and methodology, I mentored a talented and diverse group of specialists across IT operations, who were focused on a wide array of globally focused initiatives. Through the implementation the Quality of Service team, we were able to centralize the management of process improvement initiatives across Employee Support, increasing capacity across support teams, introducing transparency and removing duplication of work. Using SMART goal planning, I trained the specialists how to incorporate proven industry standard best practices into the management of initiatives, which led to the successful completion of multiple outstanding projects. Business Operations Manager - IT Yahoo December 2009  –  February 2011  (1 year 3 months) Santa Clara, California Measured the return on investment for all projects managed across the employee support organization, presenting highlights, identifying obstacles and developing quarterly business strategies. Led an industry standard maturity assessment, which allowed for focused operational improvement plans to be devised and executed upon. Coordinated quarterly and annual OPEX and CAPEX financial planning, leading executive initiatives to identify headcount spend year over year, as well as reviewing software & hardware costs to eliminate unnecessary maintenance, professional service and licensing costs. Global IT Relations Lead Yahoo! October 2008  –  December 2009  (1 year 3 months) Santa Clara, CA Partnered with Regional IT Managers across business units in Europe, India and Asia to standardize operational procedures with the goal of offering consistent service delivery levels 24/7. Some efforts consisted of implementing Live Chat, allowing for bilingual support, introducing marketing campaigns to drive service requests from Tier 2 to Tier 1 and assisting with the M&A for Maktoob, which is the Middle East largest internet search company. Working closely with Managers, concentrated efforts centered around socializing and driving support requests to a Global Service Desk team, using streamlined processes, reducing operational costs and increasing the capacity of Tier 2 teams. Global Service Desk Supervisor Yahoo! April 2007  –  October 2008  (1 year 7 months) Manhattan, NY Managed Global Service Desk Support Technicians Onsite, Remotely and Internationally, delivering on aggressive goals to achieve 90% FCR, Largely focusing on continual and sustainable service improvement, I partnered with regional support supervisors and senior management to introduce industry best practices, mature processes and streamline workflow efficiencies.\tIncorporated India region into Service Desk, consolidating IT support under a single Global Service Desk and assisted in the introduction of targeted SLA's, which allowed for accurate performance baselines. Service Desk Technician Sony Music Entertainment July 2006  –  April 2007  (10 months) Manhattan, NY Provided quality and timely technical support to entertainment teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted in the introduction of industry standard operating best practices, implementing a knowledge database & documenting operational procedures, workflows and training material. Service Desk Technician Pfizer Pharmaceuticals April 2006  –  June 2006  (3 months) Parsippany, NJ Provided quality and timely technical support to pharmaceutical teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted with performing root cause analysis, providing workarounds and identifying long term solutions - often leading to incident reduction. Technical Account Supervisor C3i January 2003  –  October 2005  (2 years 10 months) Morristown, NY Supervised technical support teams based on SLA's with Johnson & Johnson (Vistakon), ensuring consistent service delivery, timely problem resolution, and quality customer satisfaction. I consistently performed trend/root cause analysis to identify common issues reported to the Service Desk, with the goals of reducing repetitive incidents and identifying accurate knowledge, for support teams. Partnered with training department to deliver industry standard customer service best practices and required technical operational & escalation procedures, which were measured through monthly assessments. Junior Business Analyst JDS Uniphase April 2000  –  June 2002  (2 years 3 months) Asbury, NJ Deployed Oracle Customer Relationship Management software throughout the the Sales Force. Partnering closely with Oracle consultants, I drove data conversion efforts - moving the Sales department from a flat file system, assisted consultants in the configuration of back-end applications and documented User Acceptance Testing requirements & results. I also performed post deployment validation, managed Tier 1 application support and provided reporting. Sr. Project/Program Manager - Yahoo Search Products Yahoo April 2015  – Present (5 months) Sunnyvale, California Currently project managing product portfolio and service delivery for the Yahoo Search organization. Sr. Project/Program Manager - Yahoo Search Products Yahoo April 2015  – Present (5 months) Sunnyvale, California Currently project managing product portfolio and service delivery for the Yahoo Search organization. Project Manager Yahoo May 2013  –  March 2015  (1 year 11 months) Sunnyvale, California I am currently managing software implementation projects to improve efficiencies for Production Operation employees. Using Agile methodologies, I am partnering alongside Engineers & Developers to deploy a machine learning solution which manages alert volume with the goals of decreasing time to detect and resolving events at a faster rate. I am also driving a project to implement an enterprise application to track & measure business continuity planning tests and results. Project Manager Yahoo May 2013  –  March 2015  (1 year 11 months) Sunnyvale, California I am currently managing software implementation projects to improve efficiencies for Production Operation employees. Using Agile methodologies, I am partnering alongside Engineers & Developers to deploy a machine learning solution which manages alert volume with the goals of decreasing time to detect and resolving events at a faster rate. I am also driving a project to implement an enterprise application to track & measure business continuity planning tests and results. Program Manager - Help Desk Institute (HDI) HDI Silicon Valley September 2008  –  March 2014  (5 years 7 months) Silicon Valley HDI Silicon Valley is a non-profit chapter of the HDI national organization; an industry leader in the distribution of IT best practices. As the VP of Program Management, I work with key contacts to facilitate meetings & events for IT professionals to come together to discuss common industry challenges, share ideas and build a network of contacts. Through connecting with the HDI organization, IT professionals can be connected with a wide array of career advancing opportunities across the Silicon Valley area, resulting in measurable career development. Outside of monthly Chapter IT meetings, other events I organize within SVHDI consist of Job Fairs, Resume & Interview workshops, Student meetings and key initiatives that benefit the communities of Silicon Valley. Program Manager - Help Desk Institute (HDI) HDI Silicon Valley September 2008  –  March 2014  (5 years 7 months) Silicon Valley HDI Silicon Valley is a non-profit chapter of the HDI national organization; an industry leader in the distribution of IT best practices. As the VP of Program Management, I work with key contacts to facilitate meetings & events for IT professionals to come together to discuss common industry challenges, share ideas and build a network of contacts. Through connecting with the HDI organization, IT professionals can be connected with a wide array of career advancing opportunities across the Silicon Valley area, resulting in measurable career development. Outside of monthly Chapter IT meetings, other events I organize within SVHDI consist of Job Fairs, Resume & Interview workshops, Student meetings and key initiatives that benefit the communities of Silicon Valley. Business Operations Manager - Production Operations Yahoo! February 2011  –  May 2013  (2 years 4 months) Sunnyvale, CA Led cross functional team efforts towards implementing industry standard best practices, with the goal of improving operational maturity levels from a reactive model to a place of optimal business partnership. Using SMART goal planning, I was tasked with moving company application & server monitoring alerts to a centralized team (Tier 1), while identifying automation & self healing opportunities to reduce repetitive incidents. Documenting service management lifecycle proposals, I coordinated with vendor selection committees to review ITSM solutions, which resulted in the removal of fragmented tools & processes. The program provided significant cost savings and gave ompany engineers increased capacity to spend time on innovating for the future. Business Operations Manager - Production Operations Yahoo! February 2011  –  May 2013  (2 years 4 months) Sunnyvale, CA Led cross functional team efforts towards implementing industry standard best practices, with the goal of improving operational maturity levels from a reactive model to a place of optimal business partnership. Using SMART goal planning, I was tasked with moving company application & server monitoring alerts to a centralized team (Tier 1), while identifying automation & self healing opportunities to reduce repetitive incidents. Documenting service management lifecycle proposals, I coordinated with vendor selection committees to review ITSM solutions, which resulted in the removal of fragmented tools & processes. The program provided significant cost savings and gave ompany engineers increased capacity to spend time on innovating for the future. Service Delivery Manager Yahoo! February 2011  –  February 2012  (1 year 1 month) Santa Clara, CA In February 2011, I co-founded and successfully launched a Quality of Service team, which was based on ITIL v3 continual service improvement best practices. After outlining the team vision and methodology, I mentored a talented and diverse group of specialists across IT operations, who were focused on a wide array of globally focused initiatives. Through the implementation the Quality of Service team, we were able to centralize the management of process improvement initiatives across Employee Support, increasing capacity across support teams, introducing transparency and removing duplication of work. Using SMART goal planning, I trained the specialists how to incorporate proven industry standard best practices into the management of initiatives, which led to the successful completion of multiple outstanding projects. Service Delivery Manager Yahoo! February 2011  –  February 2012  (1 year 1 month) Santa Clara, CA In February 2011, I co-founded and successfully launched a Quality of Service team, which was based on ITIL v3 continual service improvement best practices. After outlining the team vision and methodology, I mentored a talented and diverse group of specialists across IT operations, who were focused on a wide array of globally focused initiatives. Through the implementation the Quality of Service team, we were able to centralize the management of process improvement initiatives across Employee Support, increasing capacity across support teams, introducing transparency and removing duplication of work. Using SMART goal planning, I trained the specialists how to incorporate proven industry standard best practices into the management of initiatives, which led to the successful completion of multiple outstanding projects. Business Operations Manager - IT Yahoo December 2009  –  February 2011  (1 year 3 months) Santa Clara, California Measured the return on investment for all projects managed across the employee support organization, presenting highlights, identifying obstacles and developing quarterly business strategies. Led an industry standard maturity assessment, which allowed for focused operational improvement plans to be devised and executed upon. Coordinated quarterly and annual OPEX and CAPEX financial planning, leading executive initiatives to identify headcount spend year over year, as well as reviewing software & hardware costs to eliminate unnecessary maintenance, professional service and licensing costs. Business Operations Manager - IT Yahoo December 2009  –  February 2011  (1 year 3 months) Santa Clara, California Measured the return on investment for all projects managed across the employee support organization, presenting highlights, identifying obstacles and developing quarterly business strategies. Led an industry standard maturity assessment, which allowed for focused operational improvement plans to be devised and executed upon. Coordinated quarterly and annual OPEX and CAPEX financial planning, leading executive initiatives to identify headcount spend year over year, as well as reviewing software & hardware costs to eliminate unnecessary maintenance, professional service and licensing costs. Global IT Relations Lead Yahoo! October 2008  –  December 2009  (1 year 3 months) Santa Clara, CA Partnered with Regional IT Managers across business units in Europe, India and Asia to standardize operational procedures with the goal of offering consistent service delivery levels 24/7. Some efforts consisted of implementing Live Chat, allowing for bilingual support, introducing marketing campaigns to drive service requests from Tier 2 to Tier 1 and assisting with the M&A for Maktoob, which is the Middle East largest internet search company. Working closely with Managers, concentrated efforts centered around socializing and driving support requests to a Global Service Desk team, using streamlined processes, reducing operational costs and increasing the capacity of Tier 2 teams. Global IT Relations Lead Yahoo! October 2008  –  December 2009  (1 year 3 months) Santa Clara, CA Partnered with Regional IT Managers across business units in Europe, India and Asia to standardize operational procedures with the goal of offering consistent service delivery levels 24/7. Some efforts consisted of implementing Live Chat, allowing for bilingual support, introducing marketing campaigns to drive service requests from Tier 2 to Tier 1 and assisting with the M&A for Maktoob, which is the Middle East largest internet search company. Working closely with Managers, concentrated efforts centered around socializing and driving support requests to a Global Service Desk team, using streamlined processes, reducing operational costs and increasing the capacity of Tier 2 teams. Global Service Desk Supervisor Yahoo! April 2007  –  October 2008  (1 year 7 months) Manhattan, NY Managed Global Service Desk Support Technicians Onsite, Remotely and Internationally, delivering on aggressive goals to achieve 90% FCR, Largely focusing on continual and sustainable service improvement, I partnered with regional support supervisors and senior management to introduce industry best practices, mature processes and streamline workflow efficiencies.\tIncorporated India region into Service Desk, consolidating IT support under a single Global Service Desk and assisted in the introduction of targeted SLA's, which allowed for accurate performance baselines. Global Service Desk Supervisor Yahoo! April 2007  –  October 2008  (1 year 7 months) Manhattan, NY Managed Global Service Desk Support Technicians Onsite, Remotely and Internationally, delivering on aggressive goals to achieve 90% FCR, Largely focusing on continual and sustainable service improvement, I partnered with regional support supervisors and senior management to introduce industry best practices, mature processes and streamline workflow efficiencies.\tIncorporated India region into Service Desk, consolidating IT support under a single Global Service Desk and assisted in the introduction of targeted SLA's, which allowed for accurate performance baselines. Service Desk Technician Sony Music Entertainment July 2006  –  April 2007  (10 months) Manhattan, NY Provided quality and timely technical support to entertainment teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted in the introduction of industry standard operating best practices, implementing a knowledge database & documenting operational procedures, workflows and training material. Service Desk Technician Sony Music Entertainment July 2006  –  April 2007  (10 months) Manhattan, NY Provided quality and timely technical support to entertainment teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted in the introduction of industry standard operating best practices, implementing a knowledge database & documenting operational procedures, workflows and training material. Service Desk Technician Pfizer Pharmaceuticals April 2006  –  June 2006  (3 months) Parsippany, NJ Provided quality and timely technical support to pharmaceutical teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted with performing root cause analysis, providing workarounds and identifying long term solutions - often leading to incident reduction. Service Desk Technician Pfizer Pharmaceuticals April 2006  –  June 2006  (3 months) Parsippany, NJ Provided quality and timely technical support to pharmaceutical teams. I worked in the capacity as a Service Desk Technician, troubleshooting connectivity issues, off the shelf & proprietary applications, PDA’s and Exchange problems. While largely working to resolve service requests and incidents, I also assisted with performing root cause analysis, providing workarounds and identifying long term solutions - often leading to incident reduction. Technical Account Supervisor C3i January 2003  –  October 2005  (2 years 10 months) Morristown, NY Supervised technical support teams based on SLA's with Johnson & Johnson (Vistakon), ensuring consistent service delivery, timely problem resolution, and quality customer satisfaction. I consistently performed trend/root cause analysis to identify common issues reported to the Service Desk, with the goals of reducing repetitive incidents and identifying accurate knowledge, for support teams. Partnered with training department to deliver industry standard customer service best practices and required technical operational & escalation procedures, which were measured through monthly assessments. Technical Account Supervisor C3i January 2003  –  October 2005  (2 years 10 months) Morristown, NY Supervised technical support teams based on SLA's with Johnson & Johnson (Vistakon), ensuring consistent service delivery, timely problem resolution, and quality customer satisfaction. I consistently performed trend/root cause analysis to identify common issues reported to the Service Desk, with the goals of reducing repetitive incidents and identifying accurate knowledge, for support teams. Partnered with training department to deliver industry standard customer service best practices and required technical operational & escalation procedures, which were measured through monthly assessments. Junior Business Analyst JDS Uniphase April 2000  –  June 2002  (2 years 3 months) Asbury, NJ Deployed Oracle Customer Relationship Management software throughout the the Sales Force. Partnering closely with Oracle consultants, I drove data conversion efforts - moving the Sales department from a flat file system, assisted consultants in the configuration of back-end applications and documented User Acceptance Testing requirements & results. I also performed post deployment validation, managed Tier 1 application support and provided reporting. Junior Business Analyst JDS Uniphase April 2000  –  June 2002  (2 years 3 months) Asbury, NJ Deployed Oracle Customer Relationship Management software throughout the the Sales Force. Partnering closely with Oracle consultants, I drove data conversion efforts - moving the Sales department from a flat file system, assisted consultants in the configuration of back-end applications and documented User Acceptance Testing requirements & results. I also performed post deployment validation, managed Tier 1 application support and provided reporting. Skills Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Skills  Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Business Process... Team Leadership Management ITIL Project Management IT Operations Sla Service Delivery Program Management Customer Service Global Operations Performance Metrics Networking Troubleshooting Technical Support Resource Management Business Planning Business Relationship... Strategic Financial... Service Desk Management Staffing Analysis Team Mentoring Software Lifecycle... Executive Presentations Statistical Reporting M&A analysis User Acceptance Testing Best Practices People Management Problem Solving Certified Scrum Master... Agile Project Management Agile Methodologies Sprint Planning Business Continuity... Disaster Recovery Integration CRM See 23+     See less Education Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Kings Lynn College, United Kingdom Culinary School 1989  – 1990 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Fakenham High School, Norfolk, United Kingdom 1984  – 1989 Honors & Awards Certified Scrum Master Cerification Scrum Alliance January 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) Certified Scrum Master Cerification Scrum Alliance January 2014 Certified Scrum Master Cerification Scrum Alliance January 2014 Certified Scrum Master Cerification Scrum Alliance January 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 ABCP Certification (Business Continuity Management & Disaster Recovery) Disaster Recovery Institute (DRI) October 2014 Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) Additional Honors & Awards HDI Service Desk Lead \nHDI Service Desk Manager \nHDI 2011 Board Officer of the Year (Silicon Valley) ", "Skills Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less Skills  Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less Agile Project Management Integration Agile Methodologies Cross-functional Team... Business Intelligence Java Cloud Computing Program Management Oracle Scrum Project Management Leadership SDLC Start-ups Scalability E-commerce Linux Product Management Change Management PMO See 5+     See less ", "Languages English English English Skills Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less Skills  Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less Product Management Leadership Analytics Strategic Partnerships Cross-functional Team... User Experience Project Management Mobile Marketing Marketing Online Advertising Vendor Management Strategy Product Development Product Marketing Program Management Online Marketing Digital Marketing SEM E-commerce Customer Experience Business Process Sales Operations Salesforce.com Marketing Management Go-to-market Strategy Sales Social Media Competitive Analysis Enterprise Software See 14+     See less ", "Summary 17 years experience with progressively larger hardware systems and applications, most recently focusing on program management and global fleet/infrastructure implementation and consolidation. Experiences include taking leadership or consulting roles in the design, development, deployment, maintenance and refactoring of a full spectrum of hardware & designing operations-literate process & PMO practice. \n \nSignificant contributions in \n->Program Portfolio & Program management mapping business strategy & requirements to practicable operations plans \n->Distributed computing systems deployment and support \n->Production quality design and implementation (up to 5 9s) \n \n \nSpecialties: I work for and with people - not companies. I believe in ruthlessly simple strategy and implementation, driven with diplomatic but focused goals development, systems analysis, problem analysis, workflow design/fix, technology integration, crisis management.  \n \nSpecific areas of technical expertise: UNIX/LINUX storage(NAS/SAN/DAS), information lifecycle management, distributed computing (proprietary and commercial systems), RDBMS hardware architecture, method agnostic program & project management. Summary 17 years experience with progressively larger hardware systems and applications, most recently focusing on program management and global fleet/infrastructure implementation and consolidation. Experiences include taking leadership or consulting roles in the design, development, deployment, maintenance and refactoring of a full spectrum of hardware & designing operations-literate process & PMO practice. \n \nSignificant contributions in \n->Program Portfolio & Program management mapping business strategy & requirements to practicable operations plans \n->Distributed computing systems deployment and support \n->Production quality design and implementation (up to 5 9s) \n \n \nSpecialties: I work for and with people - not companies. I believe in ruthlessly simple strategy and implementation, driven with diplomatic but focused goals development, systems analysis, problem analysis, workflow design/fix, technology integration, crisis management.  \n \nSpecific areas of technical expertise: UNIX/LINUX storage(NAS/SAN/DAS), information lifecycle management, distributed computing (proprietary and commercial systems), RDBMS hardware architecture, method agnostic program & project management. 17 years experience with progressively larger hardware systems and applications, most recently focusing on program management and global fleet/infrastructure implementation and consolidation. Experiences include taking leadership or consulting roles in the design, development, deployment, maintenance and refactoring of a full spectrum of hardware & designing operations-literate process & PMO practice. \n \nSignificant contributions in \n->Program Portfolio & Program management mapping business strategy & requirements to practicable operations plans \n->Distributed computing systems deployment and support \n->Production quality design and implementation (up to 5 9s) \n \n \nSpecialties: I work for and with people - not companies. I believe in ruthlessly simple strategy and implementation, driven with diplomatic but focused goals development, systems analysis, problem analysis, workflow design/fix, technology integration, crisis management.  \n \nSpecific areas of technical expertise: UNIX/LINUX storage(NAS/SAN/DAS), information lifecycle management, distributed computing (proprietary and commercial systems), RDBMS hardware architecture, method agnostic program & project management. 17 years experience with progressively larger hardware systems and applications, most recently focusing on program management and global fleet/infrastructure implementation and consolidation. Experiences include taking leadership or consulting roles in the design, development, deployment, maintenance and refactoring of a full spectrum of hardware & designing operations-literate process & PMO practice. \n \nSignificant contributions in \n->Program Portfolio & Program management mapping business strategy & requirements to practicable operations plans \n->Distributed computing systems deployment and support \n->Production quality design and implementation (up to 5 9s) \n \n \nSpecialties: I work for and with people - not companies. I believe in ruthlessly simple strategy and implementation, driven with diplomatic but focused goals development, systems analysis, problem analysis, workflow design/fix, technology integration, crisis management.  \n \nSpecific areas of technical expertise: UNIX/LINUX storage(NAS/SAN/DAS), information lifecycle management, distributed computing (proprietary and commercial systems), RDBMS hardware architecture, method agnostic program & project management. Experience Sr. Manager, Ad Products Production Engineering PMO Yahoo! April 2013  – Present (2 years 5 months) Sunnyvale, CA \n \nManage and position a multi-disciplinary team with the perspective, processes, and tools to do their best and most effective work making Yahoo awesome!  \n-> Partner with Ad Products leadership to drive efficient and effective response on business unit priorities & Yahoo's horizontal program initiatives \n-> Support program and project operations and team administration activities for Ad Products Production Engineering team \n-> Establish and maintain practices that facilitate support of our partner engineering teams within Ad Products and across Yahoo. \n Manager, Revenue SE Program Management Office Yahoo! March 2012  – Present (3 years 6 months) Santa Clara, CA Progam Manager, Advertising Service Engineering Yahoo! July 2011  –  March 2012  (9 months) San Francisco Bay Area Technical Program Manager - Contract Yahoo! August 2010  –  August 2011  (1 year 1 month) Sunnyvale, CA Partner with and drive in-house infrastructure & operations teams on the development of standards, structures, and processes for a global datacenter capacity optimization program.  IT Professional Independent August 2009  –  August 2010  (1 year 1 month) Private consulting - IT strategy, technology optimization, storage architecture and deployment planning for small business. Technical Program Manager Google April 2005  –  August 2009  (4 years 5 months) Global deployment focused technical program manager engaged in operations wide IT hardware portfolio managment, best program management practice, and effective cross functional team coordination. Manager, IT Operations Incyte December 2003  –  July 2004  (8 months) Assumed management responsibility for 6 person IT Operations team during the scale down and closure of Incyte's west coast head quarter operations. This included reporting directly to the CIO, and overseeing the rehoming of infrastructure services, and collection, accounting and asset liquidation of a state of art datacenter over 6 months, broom clean delivery to new tenants at close. Systems Architect Incyte Corporation October 1999  –  July 2004  (4 years 10 months) Managed the interface between internal customers in Genomics/Information Product Group and the IT organization; defined, translated, and refined business requirements \n*Reported to head of IT (direct) and EVP Information Sciences  \n*Guidance and oversight on IT planning and purchasing strategy \n*Enterprise Storage strategy specialist \n*Hardware and Workflow design, implementation, analysis \n*Allocation/Recycling/Rightsizing computing resources \n*Capacity monitoring and planning Bioinformatics Fellow Incyte Genomics 2000  –  2003  (3 years) Palo Alto, CA Science <-> IT Systems translater at the developing edge of high throughput data analysis/bioinformatics for pharmaceutical research on gene data. Bioinformatics and Dataflow Incyte Corporation March 1995  –  October 1999  (4 years 8 months) From dataflow/workflow design and team management through resource monitoring and planning - engaged in all aspects of data handling with Incyte's highly novel information processing pipeline. UNIX command line computing, algorithm analysis, high performance computing concepts. Sr. Manager, Ad Products Production Engineering PMO Yahoo! April 2013  – Present (2 years 5 months) Sunnyvale, CA \n \nManage and position a multi-disciplinary team with the perspective, processes, and tools to do their best and most effective work making Yahoo awesome!  \n-> Partner with Ad Products leadership to drive efficient and effective response on business unit priorities & Yahoo's horizontal program initiatives \n-> Support program and project operations and team administration activities for Ad Products Production Engineering team \n-> Establish and maintain practices that facilitate support of our partner engineering teams within Ad Products and across Yahoo. \n Sr. Manager, Ad Products Production Engineering PMO Yahoo! April 2013  – Present (2 years 5 months) Sunnyvale, CA \n \nManage and position a multi-disciplinary team with the perspective, processes, and tools to do their best and most effective work making Yahoo awesome!  \n-> Partner with Ad Products leadership to drive efficient and effective response on business unit priorities & Yahoo's horizontal program initiatives \n-> Support program and project operations and team administration activities for Ad Products Production Engineering team \n-> Establish and maintain practices that facilitate support of our partner engineering teams within Ad Products and across Yahoo. \n Manager, Revenue SE Program Management Office Yahoo! March 2012  – Present (3 years 6 months) Santa Clara, CA Manager, Revenue SE Program Management Office Yahoo! March 2012  – Present (3 years 6 months) Santa Clara, CA Progam Manager, Advertising Service Engineering Yahoo! July 2011  –  March 2012  (9 months) San Francisco Bay Area Progam Manager, Advertising Service Engineering Yahoo! July 2011  –  March 2012  (9 months) San Francisco Bay Area Technical Program Manager - Contract Yahoo! August 2010  –  August 2011  (1 year 1 month) Sunnyvale, CA Partner with and drive in-house infrastructure & operations teams on the development of standards, structures, and processes for a global datacenter capacity optimization program.  Technical Program Manager - Contract Yahoo! August 2010  –  August 2011  (1 year 1 month) Sunnyvale, CA Partner with and drive in-house infrastructure & operations teams on the development of standards, structures, and processes for a global datacenter capacity optimization program.  IT Professional Independent August 2009  –  August 2010  (1 year 1 month) Private consulting - IT strategy, technology optimization, storage architecture and deployment planning for small business. IT Professional Independent August 2009  –  August 2010  (1 year 1 month) Private consulting - IT strategy, technology optimization, storage architecture and deployment planning for small business. Technical Program Manager Google April 2005  –  August 2009  (4 years 5 months) Global deployment focused technical program manager engaged in operations wide IT hardware portfolio managment, best program management practice, and effective cross functional team coordination. Technical Program Manager Google April 2005  –  August 2009  (4 years 5 months) Global deployment focused technical program manager engaged in operations wide IT hardware portfolio managment, best program management practice, and effective cross functional team coordination. Manager, IT Operations Incyte December 2003  –  July 2004  (8 months) Assumed management responsibility for 6 person IT Operations team during the scale down and closure of Incyte's west coast head quarter operations. This included reporting directly to the CIO, and overseeing the rehoming of infrastructure services, and collection, accounting and asset liquidation of a state of art datacenter over 6 months, broom clean delivery to new tenants at close. Manager, IT Operations Incyte December 2003  –  July 2004  (8 months) Assumed management responsibility for 6 person IT Operations team during the scale down and closure of Incyte's west coast head quarter operations. This included reporting directly to the CIO, and overseeing the rehoming of infrastructure services, and collection, accounting and asset liquidation of a state of art datacenter over 6 months, broom clean delivery to new tenants at close. Systems Architect Incyte Corporation October 1999  –  July 2004  (4 years 10 months) Managed the interface between internal customers in Genomics/Information Product Group and the IT organization; defined, translated, and refined business requirements \n*Reported to head of IT (direct) and EVP Information Sciences  \n*Guidance and oversight on IT planning and purchasing strategy \n*Enterprise Storage strategy specialist \n*Hardware and Workflow design, implementation, analysis \n*Allocation/Recycling/Rightsizing computing resources \n*Capacity monitoring and planning Systems Architect Incyte Corporation October 1999  –  July 2004  (4 years 10 months) Managed the interface between internal customers in Genomics/Information Product Group and the IT organization; defined, translated, and refined business requirements \n*Reported to head of IT (direct) and EVP Information Sciences  \n*Guidance and oversight on IT planning and purchasing strategy \n*Enterprise Storage strategy specialist \n*Hardware and Workflow design, implementation, analysis \n*Allocation/Recycling/Rightsizing computing resources \n*Capacity monitoring and planning Bioinformatics Fellow Incyte Genomics 2000  –  2003  (3 years) Palo Alto, CA Science <-> IT Systems translater at the developing edge of high throughput data analysis/bioinformatics for pharmaceutical research on gene data. Bioinformatics Fellow Incyte Genomics 2000  –  2003  (3 years) Palo Alto, CA Science <-> IT Systems translater at the developing edge of high throughput data analysis/bioinformatics for pharmaceutical research on gene data. Bioinformatics and Dataflow Incyte Corporation March 1995  –  October 1999  (4 years 8 months) From dataflow/workflow design and team management through resource monitoring and planning - engaged in all aspects of data handling with Incyte's highly novel information processing pipeline. UNIX command line computing, algorithm analysis, high performance computing concepts. Bioinformatics and Dataflow Incyte Corporation March 1995  –  October 1999  (4 years 8 months) From dataflow/workflow design and team management through resource monitoring and planning - engaged in all aspects of data handling with Incyte's highly novel information processing pipeline. UNIX command line computing, algorithm analysis, high performance computing concepts. Skills Project Portfolio... IT Rightsizing Distributed Systems Project Management Technology Integration Systems Analysis Crisis Management Problem Analysis Data Center Cloud Computing Perl Linux Agile Methodologies Software Development Unix Management System Architecture Program Management Security Strategy IT Operations Integration SDLC Scalability PMO Leadership System Deployment SaaS Storage Infrastructure IT Strategy Enterprise Software Portfolio Management Cross-functional Team... See 19+     See less Skills  Project Portfolio... IT Rightsizing Distributed Systems Project Management Technology Integration Systems Analysis Crisis Management Problem Analysis Data Center Cloud Computing Perl Linux Agile Methodologies Software Development Unix Management System Architecture Program Management Security Strategy IT Operations Integration SDLC Scalability PMO Leadership System Deployment SaaS Storage Infrastructure IT Strategy Enterprise Software Portfolio Management Cross-functional Team... See 19+     See less Project Portfolio... IT Rightsizing Distributed Systems Project Management Technology Integration Systems Analysis Crisis Management Problem Analysis Data Center Cloud Computing Perl Linux Agile Methodologies Software Development Unix Management System Architecture Program Management Security Strategy IT Operations Integration SDLC Scalability PMO Leadership System Deployment SaaS Storage Infrastructure IT Strategy Enterprise Software Portfolio Management Cross-functional Team... See 19+     See less Project Portfolio... IT Rightsizing Distributed Systems Project Management Technology Integration Systems Analysis Crisis Management Problem Analysis Data Center Cloud Computing Perl Linux Agile Methodologies Software Development Unix Management System Architecture Program Management Security Strategy IT Operations Integration SDLC Scalability PMO Leadership System Deployment SaaS Storage Infrastructure IT Strategy Enterprise Software Portfolio Management Cross-functional Team... See 19+     See less Education Pennsylvania State University B.S.,  Molecular and Cell Biology August 1987  – August 1991 Pennsylvania State University B.S.,  Molecular and Cell Biology August 1987  – August 1991 Pennsylvania State University B.S.,  Molecular and Cell Biology August 1987  – August 1991 Pennsylvania State University B.S.,  Molecular and Cell Biology August 1987  – August 1991 ", "Skills Scrum Agile Project Management Agile Methodologies PMP Program Management Project Planning Project Management Product Management Strategic Partnerships Mobile Devices Cloud Computing Start-ups Cross-functional Team... Go-to-market Strategy Integration Software Development Business Development Software Engineering Enterprise Software Strategy Web Applications Management Integrated Marketing Telecommunications Vendor Management User Experience E-commerce CRM Scalability Online Advertising Back-end Operations See 16+     See less Skills  Scrum Agile Project Management Agile Methodologies PMP Program Management Project Planning Project Management Product Management Strategic Partnerships Mobile Devices Cloud Computing Start-ups Cross-functional Team... Go-to-market Strategy Integration Software Development Business Development Software Engineering Enterprise Software Strategy Web Applications Management Integrated Marketing Telecommunications Vendor Management User Experience E-commerce CRM Scalability Online Advertising Back-end Operations See 16+     See less Scrum Agile Project Management Agile Methodologies PMP Program Management Project Planning Project Management Product Management Strategic Partnerships Mobile Devices Cloud Computing Start-ups Cross-functional Team... Go-to-market Strategy Integration Software Development Business Development Software Engineering Enterprise Software Strategy Web Applications Management Integrated Marketing Telecommunications Vendor Management User Experience E-commerce CRM Scalability Online Advertising Back-end Operations See 16+     See less Scrum Agile Project Management Agile Methodologies PMP Program Management Project Planning Project Management Product Management Strategic Partnerships Mobile Devices Cloud Computing Start-ups Cross-functional Team... Go-to-market Strategy Integration Software Development Business Development Software Engineering Enterprise Software Strategy Web Applications Management Integrated Marketing Telecommunications Vendor Management User Experience E-commerce CRM Scalability Online Advertising Back-end Operations See 16+     See less Honors & Awards ", "Skills Ad Networks Ad Exchanges Behavioral Targeting Website Monetization Advertising Operations Digital Media Online Advertising Mobile Advertising Advertising Online Marketing Strategy Web Marketing Display Advertising Digital Strategy Web Analytics Skills  Ad Networks Ad Exchanges Behavioral Targeting Website Monetization Advertising Operations Digital Media Online Advertising Mobile Advertising Advertising Online Marketing Strategy Web Marketing Display Advertising Digital Strategy Web Analytics Ad Networks Ad Exchanges Behavioral Targeting Website Monetization Advertising Operations Digital Media Online Advertising Mobile Advertising Advertising Online Marketing Strategy Web Marketing Display Advertising Digital Strategy Web Analytics Ad Networks Ad Exchanges Behavioral Targeting Website Monetization Advertising Operations Digital Media Online Advertising Mobile Advertising Advertising Online Marketing Strategy Web Marketing Display Advertising Digital Strategy Web Analytics ", "Summary Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Summary Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Seasoned and extremely versatile Silicon Valley leader with 17 years of experience across a very diverse set of industries and functions at large multinational technology corporations, including Yahoo and HP. Specialties include:  \n•\tStrategic Planning/Execution (17 years)\t \n•\tMetrics Targeting & Evaluation (17 years) \n•\tStrategic Partnerships/Joint Ventures (9 years) \n•\tContract/Deal Negotiation (9 years)  \n•\tProgram/Project Management (8 years) \n•\tProduct Management/Marketing (7 years) \n•\tCustomer Care Operations (5 years) \n•\tPeople Management (4 years) \n Experience Sr. HR Program Manager, Global Talent Operations Yahoo March 2015  – Present (6 months) Sunnyvale, California •\tProgram Management: Lead the program; negotiate contracts and work with legal on policy, guide managers regarding on-boarding/off-boarding, partner with IT on the backend processes, and engage with leadership on the overall status and future direction of the program.  \n•\tLeadership: Provide day to day guidance and mentorship to team of supplied by vendor (Managed Services Provider); remove barriers, and ensure vendor is meeting expectations as specified in the agreement. \n Sr. HR Program Manager, Global Talent Operations Yahoo March 2015  – Present (6 months) Sunnyvale, California •\tProgram Management: Lead the program; negotiate contracts and work with legal on policy, guide managers regarding on-boarding/off-boarding, partner with IT on the backend processes, and engage with leadership on the overall status and future direction of the program.  \n•\tLeadership: Provide day to day guidance and mentorship to team of supplied by vendor (Managed Services Provider); remove barriers, and ensure vendor is meeting expectations as specified in the agreement. \n Sr. HR Program Manager, Global Talent Operations Yahoo March 2015  – Present (6 months) Sunnyvale, California •\tProgram Management: Lead the program; negotiate contracts and work with legal on policy, guide managers regarding on-boarding/off-boarding, partner with IT on the backend processes, and engage with leadership on the overall status and future direction of the program.  \n•\tLeadership: Provide day to day guidance and mentorship to team of supplied by vendor (Managed Services Provider); remove barriers, and ensure vendor is meeting expectations as specified in the agreement. \n Skills Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less Skills  Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less Business Developement Operations Management Channel Marketing Department Leadership Strategic Planning Social Media Strategy Metrics Targeting &... Budgeting and... Customer Experience Product Marketing People Management Customer Service Social Media Marketing Management Business Development Budgets Metrics Leadership Evaluation Forecasting Analytics Strategic Partnerships Competitive Analysis Strategy Team Leadership Customer Satisfaction Cross-functional Team... Program Management Project Management See 14+     See less ", "Experience Senior Manager / Senior Project Manager, Display Operations Council Yahoo!, Inc. August 2013  – Present (2 years 1 month) Sunnyvale, CA Senior Execution Project Manager, Display Account Management Operations Yahoo March 2012  –  July 2013  (1 year 5 months) Sunnyvale, CA Senior Strategic Project Manager, Display Account Management Operations Yahoo January 2010  –  February 2012  (2 years 2 months) Sunnyvale, CA Account Manager, Display Account Management Yahoo January 2006  –  December 2009  (4 years) Sunnyvale, CA Sales Planner, Yahoo! Client Services Yahoo January 2004  –  December 2005  (2 years) Sunnyvale, CA Media Delivery Specialist, Yahoo! Client Services Yahoo December 2002  –  December 2003  (1 year 1 month) Sunnyvale, CA Advertising Account Representative, Yahoo! Client Services Yahoo June 2000  –  November 2002  (2 years 6 months) Sunnyvale, CA Senior Manager / Senior Project Manager, Display Operations Council Yahoo!, Inc. August 2013  – Present (2 years 1 month) Sunnyvale, CA Senior Manager / Senior Project Manager, Display Operations Council Yahoo!, Inc. August 2013  – Present (2 years 1 month) Sunnyvale, CA Senior Execution Project Manager, Display Account Management Operations Yahoo March 2012  –  July 2013  (1 year 5 months) Sunnyvale, CA Senior Execution Project Manager, Display Account Management Operations Yahoo March 2012  –  July 2013  (1 year 5 months) Sunnyvale, CA Senior Strategic Project Manager, Display Account Management Operations Yahoo January 2010  –  February 2012  (2 years 2 months) Sunnyvale, CA Senior Strategic Project Manager, Display Account Management Operations Yahoo January 2010  –  February 2012  (2 years 2 months) Sunnyvale, CA Account Manager, Display Account Management Yahoo January 2006  –  December 2009  (4 years) Sunnyvale, CA Account Manager, Display Account Management Yahoo January 2006  –  December 2009  (4 years) Sunnyvale, CA Sales Planner, Yahoo! Client Services Yahoo January 2004  –  December 2005  (2 years) Sunnyvale, CA Sales Planner, Yahoo! Client Services Yahoo January 2004  –  December 2005  (2 years) Sunnyvale, CA Media Delivery Specialist, Yahoo! Client Services Yahoo December 2002  –  December 2003  (1 year 1 month) Sunnyvale, CA Media Delivery Specialist, Yahoo! Client Services Yahoo December 2002  –  December 2003  (1 year 1 month) Sunnyvale, CA Advertising Account Representative, Yahoo! Client Services Yahoo June 2000  –  November 2002  (2 years 6 months) Sunnyvale, CA Advertising Account Representative, Yahoo! Client Services Yahoo June 2000  –  November 2002  (2 years 6 months) Sunnyvale, CA Education California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 Saint Mary's College of California 1996  – 1997 California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 California State University-Chico BS,  Business Administration ,  with an emphasis in Marketing 1998  – 2000 Saint Mary's College of California 1996  – 1997 Saint Mary's College of California 1996  – 1997 Saint Mary's College of California 1996  – 1997 ", "Skills FreeBSD C PHP Linux Security Apache Skills  FreeBSD C PHP Linux Security Apache FreeBSD C PHP Linux Security Apache FreeBSD C PHP Linux Security Apache ", "Skills Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less Skills  Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less Cloud Computing Go-to-market Strategy Mobile Applications Perl Agile Methodologies Large Scale Systems Large Scale Deployments Early-stage Startups Distributed Systems Cross Functional... BSD Virtualization Data Center Scalability SaaS Service Delivery International Project... Software Installation System Deployment System Migration Big Data Reliability Hadoop Cross Functional Team... See 9+     See less ", "Skills Sales Operations Sales Presentations Brand Management SEM Big Data Forecasting Business Intelligence Web Video Web Development Direct Response Mergers PPC Online Advertising Monetization Ad Serving Rich Media SEO Behavioral Targeting Product Management Strategic Partnerships Web Analytics Display Advertising Strategy CRM Digital Marketing Advertising Business Development Management Lead Generation Analytics Account Management Start-ups Mergers & Acquisitions Email Marketing Leadership Awesomeness Web Marketing Marketing Cross-functional Team... E-commerce Mobile Marketing Online Marketing See 27+     See less Skills  Sales Operations Sales Presentations Brand Management SEM Big Data Forecasting Business Intelligence Web Video Web Development Direct Response Mergers PPC Online Advertising Monetization Ad Serving Rich Media SEO Behavioral Targeting Product Management Strategic Partnerships Web Analytics Display Advertising Strategy CRM Digital Marketing Advertising Business Development Management Lead Generation Analytics Account Management Start-ups Mergers & Acquisitions Email Marketing Leadership Awesomeness Web Marketing Marketing Cross-functional Team... E-commerce Mobile Marketing Online Marketing See 27+     See less Sales Operations Sales Presentations Brand Management SEM Big Data Forecasting Business Intelligence Web Video Web Development Direct Response Mergers PPC Online Advertising Monetization Ad Serving Rich Media SEO Behavioral Targeting Product Management Strategic Partnerships Web Analytics Display Advertising Strategy CRM Digital Marketing Advertising Business Development Management Lead Generation Analytics Account Management Start-ups Mergers & Acquisitions Email Marketing Leadership Awesomeness Web Marketing Marketing Cross-functional Team... E-commerce Mobile Marketing Online Marketing See 27+     See less Sales Operations Sales Presentations Brand Management SEM Big Data Forecasting Business Intelligence Web Video Web Development Direct Response Mergers PPC Online Advertising Monetization Ad Serving Rich Media SEO Behavioral Targeting Product Management Strategic Partnerships Web Analytics Display Advertising Strategy CRM Digital Marketing Advertising Business Development Management Lead Generation Analytics Account Management Start-ups Mergers & Acquisitions Email Marketing Leadership Awesomeness Web Marketing Marketing Cross-functional Team... E-commerce Mobile Marketing Online Marketing See 27+     See less Honors & Awards Center of Revenue Award for Completely Crushing It in H1 2014 January 2014 Additional Honors & Awards Partner Team SuperStar Award for Highest Revenue Optimizations, 2012 Center of Revenue Award for Completely Crushing It in H1 2014 January 2014 Center of Revenue Award for Completely Crushing It in H1 2014 January 2014 Center of Revenue Award for Completely Crushing It in H1 2014 January 2014 Additional Honors & Awards Partner Team SuperStar Award for Highest Revenue Optimizations, 2012 Additional Honors & Awards Partner Team SuperStar Award for Highest Revenue Optimizations, 2012 Additional Honors & Awards Partner Team SuperStar Award for Highest Revenue Optimizations, 2012 ", "Experience EMEA Search Operations Senior Manager Yahoo April 2015  – Present (5 months) Dublin EMEA Search Operations Manager Yahoo! January 2013  – Present (2 years 8 months) Dublin •\tLead responsibility for the day-to-day running of the Search Operations team, managing and maintaining a superior level of service whilst owning and reporting on team and individual KPI’s \n•\tLead team in Sales, Technical and Escalation support for all Search sales team in EMEA \n•\tWork with Search leaders across EMEA to set and promote the vision and goals for the Search Operations team as a whole and execute strategy \n•\tCollaborate with peer group across Regions to ensure a consistent approach in all operational aspects \n•\tMain decision maker on all operations process and policy approvals \n•\tEnsure continuous performance management and development within the teams \n•\tDrive relevant Yahoo! projects considering all operational aspects and communicating preferred process across the group \n•\tLiaise with Microsoft regarding the Search Alliance partnership and tiering of Customers.  \n•\tIncrease operational performance Q on Q and overall effectiveness of the Team; develop and implement solutions and define strategies and the roadmap to get there \n•\tMaintain an up to date understanding of market/industry trends EU SMB Search Marketing Manager Yahoo! January 2012  –  January 2013  (1 year 1 month) Ireland Manage EU Markets for small to medium business. \nDirectly manage a staff of 11 account managers and Creative’s \nConstantly innovate and develop sales strategies across several markets for blue chip companies. \nEnsures that quarterly and annual new booking goals are met by assigned team; supports individual rep's booking goals by providing the training, support, and tools necessary to maximize growth \nTrack and analyse all sales related activities including call activity levels, account management, new account development, sales and prospect reporting processes. \nProvide direction regarding sales behaviours, appropriate coaching and guidance for sales reps to improve performance. Addresses performance issues and provides on-going and corrective feedback in a timely and constructive manner. SMB Search Acquisition Manager Yahoo! November 2010  –  January 2012  (1 year 3 months) Dublin - Directly manage a growing team of Account Executives focused on acquiring new business in PPC. \n- Provide sales mentorship and elevate the team’s abilities to manage and close revenue \n- Constantly innovate ways to balance sales opportunities, client management, and new customer online needs \n- Manage an experienced group of Account executives working on Agency development to grow business and encourage best practices in Yahoo Search Senior Account Manager Yahoo! April 2010  –  November 2010  (8 months) Built up a brand new sales team, from developing processes to interviewing and hiring staff and setting, benchmarking targets. \nCoaching the new sales team in outbound cold calling \nDeveloping and maintaining a sales pipeline. \nPPC account manager for new Business with serious growth potential, recommending best practices and influencing clients marketing strategies and Budget. Account Manager Yahoo! November 2008  –  April 2010  (1 year 6 months) Portfolio of 160+ UK/IRE based clients \nBusiness Relationship Development of current and dormant client accounts. \nClient and Marketing event visits around the UK and Ireland. \nProviding ongoing sales support to client base for online campaigns in all sectors: Gambling, Adult, Retail, Financial, travel and Entertainment.  \nProviding Strategic advice & help with resolve of financial issues Direct Sales Rep Magnet Networks 2006  –  2007  (1 year) While working for Magnet, My sales role involved inbound and outbound sales calls and following up on potential leads. The main area of sales was broadband to residential homes but also involved telephone and TV services. Sales Consultant Carole Nash Insurance 2005  –  2006  (1 year) Worked both on the Sales team and the Renewal team in my time with Carole Nash. This enabled myself to experience all factors of the sales process. Outbound and inbound calling selling motorbike insurance, Customer retention, handling and overcoming objections from consumers. EMEA Search Operations Senior Manager Yahoo April 2015  – Present (5 months) Dublin EMEA Search Operations Senior Manager Yahoo April 2015  – Present (5 months) Dublin EMEA Search Operations Manager Yahoo! January 2013  – Present (2 years 8 months) Dublin •\tLead responsibility for the day-to-day running of the Search Operations team, managing and maintaining a superior level of service whilst owning and reporting on team and individual KPI’s \n•\tLead team in Sales, Technical and Escalation support for all Search sales team in EMEA \n•\tWork with Search leaders across EMEA to set and promote the vision and goals for the Search Operations team as a whole and execute strategy \n•\tCollaborate with peer group across Regions to ensure a consistent approach in all operational aspects \n•\tMain decision maker on all operations process and policy approvals \n•\tEnsure continuous performance management and development within the teams \n•\tDrive relevant Yahoo! projects considering all operational aspects and communicating preferred process across the group \n•\tLiaise with Microsoft regarding the Search Alliance partnership and tiering of Customers.  \n•\tIncrease operational performance Q on Q and overall effectiveness of the Team; develop and implement solutions and define strategies and the roadmap to get there \n•\tMaintain an up to date understanding of market/industry trends EMEA Search Operations Manager Yahoo! January 2013  – Present (2 years 8 months) Dublin •\tLead responsibility for the day-to-day running of the Search Operations team, managing and maintaining a superior level of service whilst owning and reporting on team and individual KPI’s \n•\tLead team in Sales, Technical and Escalation support for all Search sales team in EMEA \n•\tWork with Search leaders across EMEA to set and promote the vision and goals for the Search Operations team as a whole and execute strategy \n•\tCollaborate with peer group across Regions to ensure a consistent approach in all operational aspects \n•\tMain decision maker on all operations process and policy approvals \n•\tEnsure continuous performance management and development within the teams \n•\tDrive relevant Yahoo! projects considering all operational aspects and communicating preferred process across the group \n•\tLiaise with Microsoft regarding the Search Alliance partnership and tiering of Customers.  \n•\tIncrease operational performance Q on Q and overall effectiveness of the Team; develop and implement solutions and define strategies and the roadmap to get there \n•\tMaintain an up to date understanding of market/industry trends EU SMB Search Marketing Manager Yahoo! January 2012  –  January 2013  (1 year 1 month) Ireland Manage EU Markets for small to medium business. \nDirectly manage a staff of 11 account managers and Creative’s \nConstantly innovate and develop sales strategies across several markets for blue chip companies. \nEnsures that quarterly and annual new booking goals are met by assigned team; supports individual rep's booking goals by providing the training, support, and tools necessary to maximize growth \nTrack and analyse all sales related activities including call activity levels, account management, new account development, sales and prospect reporting processes. \nProvide direction regarding sales behaviours, appropriate coaching and guidance for sales reps to improve performance. Addresses performance issues and provides on-going and corrective feedback in a timely and constructive manner. EU SMB Search Marketing Manager Yahoo! January 2012  –  January 2013  (1 year 1 month) Ireland Manage EU Markets for small to medium business. \nDirectly manage a staff of 11 account managers and Creative’s \nConstantly innovate and develop sales strategies across several markets for blue chip companies. \nEnsures that quarterly and annual new booking goals are met by assigned team; supports individual rep's booking goals by providing the training, support, and tools necessary to maximize growth \nTrack and analyse all sales related activities including call activity levels, account management, new account development, sales and prospect reporting processes. \nProvide direction regarding sales behaviours, appropriate coaching and guidance for sales reps to improve performance. Addresses performance issues and provides on-going and corrective feedback in a timely and constructive manner. SMB Search Acquisition Manager Yahoo! November 2010  –  January 2012  (1 year 3 months) Dublin - Directly manage a growing team of Account Executives focused on acquiring new business in PPC. \n- Provide sales mentorship and elevate the team’s abilities to manage and close revenue \n- Constantly innovate ways to balance sales opportunities, client management, and new customer online needs \n- Manage an experienced group of Account executives working on Agency development to grow business and encourage best practices in Yahoo Search SMB Search Acquisition Manager Yahoo! November 2010  –  January 2012  (1 year 3 months) Dublin - Directly manage a growing team of Account Executives focused on acquiring new business in PPC. \n- Provide sales mentorship and elevate the team’s abilities to manage and close revenue \n- Constantly innovate ways to balance sales opportunities, client management, and new customer online needs \n- Manage an experienced group of Account executives working on Agency development to grow business and encourage best practices in Yahoo Search Senior Account Manager Yahoo! April 2010  –  November 2010  (8 months) Built up a brand new sales team, from developing processes to interviewing and hiring staff and setting, benchmarking targets. \nCoaching the new sales team in outbound cold calling \nDeveloping and maintaining a sales pipeline. \nPPC account manager for new Business with serious growth potential, recommending best practices and influencing clients marketing strategies and Budget. Senior Account Manager Yahoo! April 2010  –  November 2010  (8 months) Built up a brand new sales team, from developing processes to interviewing and hiring staff and setting, benchmarking targets. \nCoaching the new sales team in outbound cold calling \nDeveloping and maintaining a sales pipeline. \nPPC account manager for new Business with serious growth potential, recommending best practices and influencing clients marketing strategies and Budget. Account Manager Yahoo! November 2008  –  April 2010  (1 year 6 months) Portfolio of 160+ UK/IRE based clients \nBusiness Relationship Development of current and dormant client accounts. \nClient and Marketing event visits around the UK and Ireland. \nProviding ongoing sales support to client base for online campaigns in all sectors: Gambling, Adult, Retail, Financial, travel and Entertainment.  \nProviding Strategic advice & help with resolve of financial issues Account Manager Yahoo! November 2008  –  April 2010  (1 year 6 months) Portfolio of 160+ UK/IRE based clients \nBusiness Relationship Development of current and dormant client accounts. \nClient and Marketing event visits around the UK and Ireland. \nProviding ongoing sales support to client base for online campaigns in all sectors: Gambling, Adult, Retail, Financial, travel and Entertainment.  \nProviding Strategic advice & help with resolve of financial issues Direct Sales Rep Magnet Networks 2006  –  2007  (1 year) While working for Magnet, My sales role involved inbound and outbound sales calls and following up on potential leads. The main area of sales was broadband to residential homes but also involved telephone and TV services. Direct Sales Rep Magnet Networks 2006  –  2007  (1 year) While working for Magnet, My sales role involved inbound and outbound sales calls and following up on potential leads. The main area of sales was broadband to residential homes but also involved telephone and TV services. Sales Consultant Carole Nash Insurance 2005  –  2006  (1 year) Worked both on the Sales team and the Renewal team in my time with Carole Nash. This enabled myself to experience all factors of the sales process. Outbound and inbound calling selling motorbike insurance, Customer retention, handling and overcoming objections from consumers. Sales Consultant Carole Nash Insurance 2005  –  2006  (1 year) Worked both on the Sales team and the Renewal team in my time with Carole Nash. This enabled myself to experience all factors of the sales process. Outbound and inbound calling selling motorbike insurance, Customer retention, handling and overcoming objections from consumers. Skills Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Skills  Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Sales Management Advertising Sales PPC Inside Sales Sales Recruitment Excel Visio Outlook Sales Coach Direct Sales Client Retention Online Marketing Customer Service Microsoft Word Online Advertising Management SEM Sales Recruiting Search Advertising Yahoo Search Marketing Coaching SEO Search Account Management Digital Marketing Microsoft Excel Sales Operations Lead Generation Customer Retention Web Analytics Display Advertising Sales Process Strategy CRM Team Leadership See 21+     See less Education Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 Dundalk Institute of Technology Honours Degree,  Business Management 2001  – 2005 ", "Skills Ad Networks Behavioral Targeting Ad Serving Mobile Advertising Online Advertising Ad Exchanges Marketing Communications Display Advertising Strategic Partnerships DoubleClick Brand Management Mobile Marketing SEM Web Analytics Digital Media Digital Marketing Digital Strategy Strategy Online Marketing Analytics E-commerce PPC Advertising Marketing See 9+     See less Skills  Ad Networks Behavioral Targeting Ad Serving Mobile Advertising Online Advertising Ad Exchanges Marketing Communications Display Advertising Strategic Partnerships DoubleClick Brand Management Mobile Marketing SEM Web Analytics Digital Media Digital Marketing Digital Strategy Strategy Online Marketing Analytics E-commerce PPC Advertising Marketing See 9+     See less Ad Networks Behavioral Targeting Ad Serving Mobile Advertising Online Advertising Ad Exchanges Marketing Communications Display Advertising Strategic Partnerships DoubleClick Brand Management Mobile Marketing SEM Web Analytics Digital Media Digital Marketing Digital Strategy Strategy Online Marketing Analytics E-commerce PPC Advertising Marketing See 9+     See less Ad Networks Behavioral Targeting Ad Serving Mobile Advertising Online Advertising Ad Exchanges Marketing Communications Display Advertising Strategic Partnerships DoubleClick Brand Management Mobile Marketing SEM Web Analytics Digital Media Digital Marketing Digital Strategy Strategy Online Marketing Analytics E-commerce PPC Advertising Marketing See 9+     See less ", "Summary •\tCoordinate activities of product managers, visual designers, web developers, software and hardware engineers on new products and new tools features that are key for editorial activities. \n•\tEditorial production activity in the markets, including local events specials, features and sales specials \n•\tProvides input for the correct functionality of editorial and programming tools for daily activity \n•\tProtect and enforce brand and product guidelines, achieving standards and sharing best practices \n•\tProvide insights and/or support around editorial publishing enhancements for the editorial team \n•\tCoordinates or provides directly localization feedback and translations when required \n•\tCoordinates or provides bug filling and fixing for local operational issues \n•\tCoordinates or provides Testing and support the launch of a product or feature in liaison with Product and Business operations teams \n•\tWorks closely with Editor in Chief and rest of Managers in editorial to identify opportunities to serve local audience segments \n \nSpecialties: •\tExtensive experience with web content and product operations \n•\tProject and program management demonstrated capabilities \n•\tHighly efficient delivering processes \n•\tLocalization and QA experience \n•\tInterpersonal skills to manage and relate with multiple teams with different objectives \n•\tExcellent and proven organisation skills and attention to details \n•\tGreat organizational, interpersonal, and influential communication skills Summary •\tCoordinate activities of product managers, visual designers, web developers, software and hardware engineers on new products and new tools features that are key for editorial activities. \n•\tEditorial production activity in the markets, including local events specials, features and sales specials \n•\tProvides input for the correct functionality of editorial and programming tools for daily activity \n•\tProtect and enforce brand and product guidelines, achieving standards and sharing best practices \n•\tProvide insights and/or support around editorial publishing enhancements for the editorial team \n•\tCoordinates or provides directly localization feedback and translations when required \n•\tCoordinates or provides bug filling and fixing for local operational issues \n•\tCoordinates or provides Testing and support the launch of a product or feature in liaison with Product and Business operations teams \n•\tWorks closely with Editor in Chief and rest of Managers in editorial to identify opportunities to serve local audience segments \n \nSpecialties: •\tExtensive experience with web content and product operations \n•\tProject and program management demonstrated capabilities \n•\tHighly efficient delivering processes \n•\tLocalization and QA experience \n•\tInterpersonal skills to manage and relate with multiple teams with different objectives \n•\tExcellent and proven organisation skills and attention to details \n•\tGreat organizational, interpersonal, and influential communication skills •\tCoordinate activities of product managers, visual designers, web developers, software and hardware engineers on new products and new tools features that are key for editorial activities. \n•\tEditorial production activity in the markets, including local events specials, features and sales specials \n•\tProvides input for the correct functionality of editorial and programming tools for daily activity \n•\tProtect and enforce brand and product guidelines, achieving standards and sharing best practices \n•\tProvide insights and/or support around editorial publishing enhancements for the editorial team \n•\tCoordinates or provides directly localization feedback and translations when required \n•\tCoordinates or provides bug filling and fixing for local operational issues \n•\tCoordinates or provides Testing and support the launch of a product or feature in liaison with Product and Business operations teams \n•\tWorks closely with Editor in Chief and rest of Managers in editorial to identify opportunities to serve local audience segments \n \nSpecialties: •\tExtensive experience with web content and product operations \n•\tProject and program management demonstrated capabilities \n•\tHighly efficient delivering processes \n•\tLocalization and QA experience \n•\tInterpersonal skills to manage and relate with multiple teams with different objectives \n•\tExcellent and proven organisation skills and attention to details \n•\tGreat organizational, interpersonal, and influential communication skills •\tCoordinate activities of product managers, visual designers, web developers, software and hardware engineers on new products and new tools features that are key for editorial activities. \n•\tEditorial production activity in the markets, including local events specials, features and sales specials \n•\tProvides input for the correct functionality of editorial and programming tools for daily activity \n•\tProtect and enforce brand and product guidelines, achieving standards and sharing best practices \n•\tProvide insights and/or support around editorial publishing enhancements for the editorial team \n•\tCoordinates or provides directly localization feedback and translations when required \n•\tCoordinates or provides bug filling and fixing for local operational issues \n•\tCoordinates or provides Testing and support the launch of a product or feature in liaison with Product and Business operations teams \n•\tWorks closely with Editor in Chief and rest of Managers in editorial to identify opportunities to serve local audience segments \n \nSpecialties: •\tExtensive experience with web content and product operations \n•\tProject and program management demonstrated capabilities \n•\tHighly efficient delivering processes \n•\tLocalization and QA experience \n•\tInterpersonal skills to manage and relate with multiple teams with different objectives \n•\tExcellent and proven organisation skills and attention to details \n•\tGreat organizational, interpersonal, and influential communication skills Experience Product Operations Manager for Sports and Information, International Yahoo May 2015  – Present (4 months) Milan Area, Italy My properties portfolio include: \nSports, Finance, News, Cars and Weather \nRegions: \nEMEA, LATAM, INSEA and Canada Sports Product Operations Manager EMEA Yahoo! May 2013  –  May 2015  (2 years 1 month) Milan I was Product Manager responsible for Yahoo! Sports sites across EMEA. Product Operations Manager Yahoo! Italia July 2010  –  May 2013  (2 years 11 months) Coordinator of Editorial Operations Team Product Manager for Yahoo! Sports Italy Yahoo Italia October 2002  –  May 2013  (10 years 8 months) Content Producer for Finance Yahoo! Italia April 2003  –  April 2007  (4 years 1 month) Responsible for Finance section for Yahoo! Italia Product Manager for fifaworldcup.com Yahoo! Italia September 2005  –  July 2006  (11 months) From september 2005 to july 2006 i was Product Manager for the italian version of fifaworldcup.com, the official site for FIFA World Cup 2006 (partnership between Yahoo! and Fifa). Surfer Yahoo! Italia September 2001  –  October 2002  (1 year 2 months) I worked on the development of the Directory for Yahoo! Italy reviewing and commenting more than 10.000 sites Product Operations Manager for Sports and Information, International Yahoo May 2015  – Present (4 months) Milan Area, Italy My properties portfolio include: \nSports, Finance, News, Cars and Weather \nRegions: \nEMEA, LATAM, INSEA and Canada Product Operations Manager for Sports and Information, International Yahoo May 2015  – Present (4 months) Milan Area, Italy My properties portfolio include: \nSports, Finance, News, Cars and Weather \nRegions: \nEMEA, LATAM, INSEA and Canada Sports Product Operations Manager EMEA Yahoo! May 2013  –  May 2015  (2 years 1 month) Milan I was Product Manager responsible for Yahoo! Sports sites across EMEA. Sports Product Operations Manager EMEA Yahoo! May 2013  –  May 2015  (2 years 1 month) Milan I was Product Manager responsible for Yahoo! Sports sites across EMEA. Product Operations Manager Yahoo! Italia July 2010  –  May 2013  (2 years 11 months) Coordinator of Editorial Operations Team Product Operations Manager Yahoo! Italia July 2010  –  May 2013  (2 years 11 months) Coordinator of Editorial Operations Team Product Manager for Yahoo! Sports Italy Yahoo Italia October 2002  –  May 2013  (10 years 8 months) Product Manager for Yahoo! Sports Italy Yahoo Italia October 2002  –  May 2013  (10 years 8 months) Content Producer for Finance Yahoo! Italia April 2003  –  April 2007  (4 years 1 month) Responsible for Finance section for Yahoo! Italia Content Producer for Finance Yahoo! Italia April 2003  –  April 2007  (4 years 1 month) Responsible for Finance section for Yahoo! Italia Product Manager for fifaworldcup.com Yahoo! Italia September 2005  –  July 2006  (11 months) From september 2005 to july 2006 i was Product Manager for the italian version of fifaworldcup.com, the official site for FIFA World Cup 2006 (partnership between Yahoo! and Fifa). Product Manager for fifaworldcup.com Yahoo! Italia September 2005  –  July 2006  (11 months) From september 2005 to july 2006 i was Product Manager for the italian version of fifaworldcup.com, the official site for FIFA World Cup 2006 (partnership between Yahoo! and Fifa). Surfer Yahoo! Italia September 2001  –  October 2002  (1 year 2 months) I worked on the development of the Directory for Yahoo! Italy reviewing and commenting more than 10.000 sites Surfer Yahoo! Italia September 2001  –  October 2002  (1 year 2 months) I worked on the development of the Directory for Yahoo! Italy reviewing and commenting more than 10.000 sites Languages English French Italian English French Italian English French Italian Skills Product Management Project Management Web Project Management Content Management Management Website Development Digital Strategy Content Development Operations Management Web Content Program Management Website Localization Online Advertising Digital Media Digital Marketing Web Content Production Product Strategy Editing Editorial Skills PPC User Experience Web Analytics Website Support Affiliate Marketing Mobile Marketing Quality Assurance Competitive Analysis Google Analytics Project Portfolio... Project Coordination Agile Project Management Scrum See 17+     See less Skills  Product Management Project Management Web Project Management Content Management Management Website Development Digital Strategy Content Development Operations Management Web Content Program Management Website Localization Online Advertising Digital Media Digital Marketing Web Content Production Product Strategy Editing Editorial Skills PPC User Experience Web Analytics Website Support Affiliate Marketing Mobile Marketing Quality Assurance Competitive Analysis Google Analytics Project Portfolio... Project Coordination Agile Project Management Scrum See 17+     See less Product Management Project Management Web Project Management Content Management Management Website Development Digital Strategy Content Development Operations Management Web Content Program Management Website Localization Online Advertising Digital Media Digital Marketing Web Content Production Product Strategy Editing Editorial Skills PPC User Experience Web Analytics Website Support Affiliate Marketing Mobile Marketing Quality Assurance Competitive Analysis Google Analytics Project Portfolio... Project Coordination Agile Project Management Scrum See 17+     See less Product Management Project Management Web Project Management Content Management Management Website Development Digital Strategy Content Development Operations Management Web Content Program Management Website Localization Online Advertising Digital Media Digital Marketing Web Content Production Product Strategy Editing Editorial Skills PPC User Experience Web Analytics Website Support Affiliate Marketing Mobile Marketing Quality Assurance Competitive Analysis Google Analytics Project Portfolio... Project Coordination Agile Project Management Scrum See 17+     See less Education Università degli Studi di Milano Bachelor in Political Science,  International Law 1997  – 2002 Istituto Tecnico Commerciale, Gavirate (Va) High School Certicate in Accountancy,  Accountancy 1990  – 1995 Università degli Studi di Milano Bachelor in Political Science,  International Law 1997  – 2002 Università degli Studi di Milano Bachelor in Political Science,  International Law 1997  – 2002 Università degli Studi di Milano Bachelor in Political Science,  International Law 1997  – 2002 Istituto Tecnico Commerciale, Gavirate (Va) High School Certicate in Accountancy,  Accountancy 1990  – 1995 Istituto Tecnico Commerciale, Gavirate (Va) High School Certicate in Accountancy,  Accountancy 1990  – 1995 Istituto Tecnico Commerciale, Gavirate (Va) High School Certicate in Accountancy,  Accountancy 1990  – 1995 Honors & Awards Yahoo Editorial Awards 2014 Yahoo December 2014 For the great coverage of FIFA World Cup 2014. Yahoo! Editorial Awards 2012 Yahoo! March 2013 The 2012 Editorial Awards recognizes the best in captivating writing, engaging slideshows, great videos, and an all-around compelling editorial experiences in Yahoo! properties. Yahoo! Editorial Award 2010 Yahoo! April 2011 These awards honor Yahoos who engage their audiences with original blogs, must-see videos, state-of-the-art marketing materials, and comprehensive technical documentation. Yahoo Editorial Awards 2014 Yahoo December 2014 For the great coverage of FIFA World Cup 2014. Yahoo Editorial Awards 2014 Yahoo December 2014 For the great coverage of FIFA World Cup 2014. Yahoo Editorial Awards 2014 Yahoo December 2014 For the great coverage of FIFA World Cup 2014. Yahoo! Editorial Awards 2012 Yahoo! March 2013 The 2012 Editorial Awards recognizes the best in captivating writing, engaging slideshows, great videos, and an all-around compelling editorial experiences in Yahoo! properties. Yahoo! Editorial Awards 2012 Yahoo! March 2013 The 2012 Editorial Awards recognizes the best in captivating writing, engaging slideshows, great videos, and an all-around compelling editorial experiences in Yahoo! properties. Yahoo! Editorial Awards 2012 Yahoo! March 2013 The 2012 Editorial Awards recognizes the best in captivating writing, engaging slideshows, great videos, and an all-around compelling editorial experiences in Yahoo! properties. Yahoo! Editorial Award 2010 Yahoo! April 2011 These awards honor Yahoos who engage their audiences with original blogs, must-see videos, state-of-the-art marketing materials, and comprehensive technical documentation. Yahoo! Editorial Award 2010 Yahoo! April 2011 These awards honor Yahoos who engage their audiences with original blogs, must-see videos, state-of-the-art marketing materials, and comprehensive technical documentation. Yahoo! Editorial Award 2010 Yahoo! April 2011 These awards honor Yahoos who engage their audiences with original blogs, must-see videos, state-of-the-art marketing materials, and comprehensive technical documentation. ", "Experience Senior Manager, Account Management Yahoo! April 2013  – Present (2 years 5 months) New York, NY Manager, Search Account Management Yahoo! October 2010  – Present (4 years 11 months) Account Lead, Yahoo! Search Yahoo! June 2009  –  October 2010  (1 year 5 months) Greater New York City Area Senior Account Manager, Yahoo! Search Yahoo! April 2008  –  June 2009  (1 year 3 months) Greater New York City Area Operations Specialist, North American Sales Yahoo! July 2007  –  March 2008  (9 months) Greater New York City Area Manager, Events Marketing American Stock Exchange 2001  –  2007  (6 years) Senior Manager, Account Management Yahoo! April 2013  – Present (2 years 5 months) New York, NY Senior Manager, Account Management Yahoo! April 2013  – Present (2 years 5 months) New York, NY Manager, Search Account Management Yahoo! October 2010  – Present (4 years 11 months) Manager, Search Account Management Yahoo! October 2010  – Present (4 years 11 months) Account Lead, Yahoo! Search Yahoo! June 2009  –  October 2010  (1 year 5 months) Greater New York City Area Account Lead, Yahoo! Search Yahoo! June 2009  –  October 2010  (1 year 5 months) Greater New York City Area Senior Account Manager, Yahoo! Search Yahoo! April 2008  –  June 2009  (1 year 3 months) Greater New York City Area Senior Account Manager, Yahoo! Search Yahoo! April 2008  –  June 2009  (1 year 3 months) Greater New York City Area Operations Specialist, North American Sales Yahoo! July 2007  –  March 2008  (9 months) Greater New York City Area Operations Specialist, North American Sales Yahoo! July 2007  –  March 2008  (9 months) Greater New York City Area Manager, Events Marketing American Stock Exchange 2001  –  2007  (6 years) Manager, Events Marketing American Stock Exchange 2001  –  2007  (6 years) Skills Search Advertising Search SEM PPC Yahoo Search Display Advertising Conversion Optimization MSN AdCenter Yahoo Search Marketing Skills  Search Advertising Search SEM PPC Yahoo Search Display Advertising Conversion Optimization MSN AdCenter Yahoo Search Marketing Search Advertising Search SEM PPC Yahoo Search Display Advertising Conversion Optimization MSN AdCenter Yahoo Search Marketing Search Advertising Search SEM PPC Yahoo Search Display Advertising Conversion Optimization MSN AdCenter Yahoo Search Marketing Education Baruch College BBA,  Marketing Management Baruch College BBA,  Marketing Management Baruch College BBA,  Marketing Management Baruch College BBA,  Marketing Management ", "Skills Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less Skills  Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less Online Advertising Account Management Online Marketing Digital Marketing SEM PPC Sales Operations Operations Management Optimization People Management Search Sponsored Search Sales Management Search Advertising Yahoo Search Marketing Team Leadership Team Management SEO Digital Strategy Analytics Ad Networks Web Analytics Management Mobile Advertising Display Advertising Web Marketing Lead Generation Mobile Marketing E-commerce MSN AdCenter Salesforce.com See 16+     See less ", "Experience Senior Product Marketing Manager Yahoo November 2014  – Present (10 months) Greater New York City Area As the product marketing manager for Yahoo News and Yahoo Tech, I partner closely with Yahoo sales, editorial and business leaders, as well as partner marketing teams (Insights, PR, Creative, CRM, Social, etc.), to develop marketing campaigns that support revenue and engagement goals and are critical to Yahoo’s success. I balance the needs and goals of the programs launched in the Americas region with the needs and goals of our product development partners and marketers in Yahoo’s other global regions, supporting international rollouts of launches as necessary. Board Member, Yahoo Employee Foundation (YEF) Yahoo February 2014  – Present (1 year 7 months) Founded by Yahoo employees in 1999 with leadership from David Filo and Jerry Yang, the Yahoo Employee Foundation is a grassroots, philanthropic organization that gives Yahoo employees easy and accessible ways to give back to their communities. \n \nYEF provides Yahoos opportunities to donate time, talent, and money to benefit local non-profit organizations and charities. This occurs in two main ways: 1) throughout the year YEF organizes volunteer events and seasonal donation drives (school backpacks, holiday gifts, etc.); and 2) YEF grants money to nonprofit organizations with programs that address issues of concern to Yahoos.  \n \nYEF is 100% employee run by Yahoos who volunteer their time to serve on various committees. The US-based YEF Advisory Board is currently comprised of 17 Yahoos who run the day-to-day operations of YEF and contribute to a wide array of viewpoints to the the direction of the Foundation. Additionally, YEF has committees and chapters in the US, EMEA, India and APAC. News Lead - Senior Manager, Media Solutions Yahoo November 2013  –  November 2014  (1 year 1 month) New York I was responsible for monetization, packaging and sales strategy for Yahoo News - the #1 news network online - inclusive of Yahoo News and Yahoo Tech. Senior Manager, Media Solutions - Y! News Yahoo! February 2012  –  November 2013  (1 year 10 months) Greater New York City Area In this role, I was an online marketing expert responsible for implementing strategic direction to increase monetization of Yahoo News. I cultivated strong relationships across internal business units and with our ABC News partners to develop and implement the go-to-market framework for our video franchises, which included: ongoing review of packaging, pricing, sales collateral, editorial concept development, troubleshooting ad delivery issues and overall process implementation.  \n \nThis role leveraged strong marketing expertise, creativity and strategic vision to drive revenue by creating compelling value propositions and communicating persuasive stories to the Yahoo sales force and our marketer clients through engaging sales materials. \n \nMy primary role is was as the business owner for Yahoo! News: Video includes owning the Yahoo & ABC News partnership – which consists of co-produced original video programs and as-needed support for Good Morning America on Yahoo - and Yahoo Original Video programming. In this position, I developed and grew the Yahoo News Video franchise by executing strategic and tactical sales support initiatives, product positioning, ad program development and driving revenue. Additionally, I worked closely with internal and external partners to manage pipelines and market demand/feedback, editorial teams on program development and ideation, and worked with reporting and ad operations to ensure successful program and process management. Senior Manager, Strategic Development: Y! Content Solutions Yahoo! October 2011  –  February 2012  (5 months) Greater New York City Area In this role I was dedicated to creating powerful ideas, creative solutions and unique brand-defining opportunities for Yahoo’s advertising partners across a breadth of categories around tentpoles, anchors and events. These include but are not limited to, Olympics, Super Bowl, Elections, Awards Shows, and more.  \n \nI partnered closely with key stakeholders across the company including but not limited to, editorial, property leads, creative services, social marketing, video and product teams to create memorable, customized, best in class consumer and advertiser experiences. \n \nMy role was to help set strategy and leadership to promote Yahoo! as THE place to be for big events. Promotions Manager Disney Interactive Media Group April 2011  –  October 2011  (7 months) Greater New York City Area My role was responsible for assisting in the creation of new marketing opportunities and promotional ad products that enabled the ad sales team to sell progressive digital advertising solutions (both to external advertisers and Disney affiliated advertisers). I worked closely with the sales team to drive promotions and sales strategies and tactics for all Disney Interactive Media Group properties including: Disney.com, Disneychannel.com, DisneyXD.com and the Family Network of Sites as well as mobile and social gaming . Additionally, I worked with the Disney Media Sales & Marketing cross-platform campaign development team - which included TV, Radio and Print teams - for creation and execution of cross platform programs. \n \nMy daily responsibilities included ideating and developing digital marketing/promotion concepts, aiding in organization of team communications both internally amongst the Marketing & Promotions team as well as to the NY sales team and working closely with editorial teams, legal and ad opps teams as needed. Additionally, I was the marketing 'Kids' expert and was the go-to person for kid targeted campaigns, stayed up-to-date on the rules and regulations around advertising to kids and provided my team with regular competitive analysis to ensure we were competitive in the Kids marketplace. Associate Promotions Manager Disney Interactive Media Group October 2009  –  April 2011  (1 year 7 months) Greater New York City Area Associate Marketing Manager FamilyFun Magazine Disney Publishing Worldwide February 2008  –  October 2009  (1 year 9 months) Greater New York City Area Marketing Coordinator - FamilyFun Magazine The Walt Disney Company March 2007  –  February 2008  (1 year) Greater New York City Area Undergraduate Associate Disney Consumer Products August 2006  –  March 2007  (8 months) Greater Los Angeles Area Senior Product Marketing Manager Yahoo November 2014  – Present (10 months) Greater New York City Area As the product marketing manager for Yahoo News and Yahoo Tech, I partner closely with Yahoo sales, editorial and business leaders, as well as partner marketing teams (Insights, PR, Creative, CRM, Social, etc.), to develop marketing campaigns that support revenue and engagement goals and are critical to Yahoo’s success. I balance the needs and goals of the programs launched in the Americas region with the needs and goals of our product development partners and marketers in Yahoo’s other global regions, supporting international rollouts of launches as necessary. Senior Product Marketing Manager Yahoo November 2014  – Present (10 months) Greater New York City Area As the product marketing manager for Yahoo News and Yahoo Tech, I partner closely with Yahoo sales, editorial and business leaders, as well as partner marketing teams (Insights, PR, Creative, CRM, Social, etc.), to develop marketing campaigns that support revenue and engagement goals and are critical to Yahoo’s success. I balance the needs and goals of the programs launched in the Americas region with the needs and goals of our product development partners and marketers in Yahoo’s other global regions, supporting international rollouts of launches as necessary. Board Member, Yahoo Employee Foundation (YEF) Yahoo February 2014  – Present (1 year 7 months) Founded by Yahoo employees in 1999 with leadership from David Filo and Jerry Yang, the Yahoo Employee Foundation is a grassroots, philanthropic organization that gives Yahoo employees easy and accessible ways to give back to their communities. \n \nYEF provides Yahoos opportunities to donate time, talent, and money to benefit local non-profit organizations and charities. This occurs in two main ways: 1) throughout the year YEF organizes volunteer events and seasonal donation drives (school backpacks, holiday gifts, etc.); and 2) YEF grants money to nonprofit organizations with programs that address issues of concern to Yahoos.  \n \nYEF is 100% employee run by Yahoos who volunteer their time to serve on various committees. The US-based YEF Advisory Board is currently comprised of 17 Yahoos who run the day-to-day operations of YEF and contribute to a wide array of viewpoints to the the direction of the Foundation. Additionally, YEF has committees and chapters in the US, EMEA, India and APAC. Board Member, Yahoo Employee Foundation (YEF) Yahoo February 2014  – Present (1 year 7 months) Founded by Yahoo employees in 1999 with leadership from David Filo and Jerry Yang, the Yahoo Employee Foundation is a grassroots, philanthropic organization that gives Yahoo employees easy and accessible ways to give back to their communities. \n \nYEF provides Yahoos opportunities to donate time, talent, and money to benefit local non-profit organizations and charities. This occurs in two main ways: 1) throughout the year YEF organizes volunteer events and seasonal donation drives (school backpacks, holiday gifts, etc.); and 2) YEF grants money to nonprofit organizations with programs that address issues of concern to Yahoos.  \n \nYEF is 100% employee run by Yahoos who volunteer their time to serve on various committees. The US-based YEF Advisory Board is currently comprised of 17 Yahoos who run the day-to-day operations of YEF and contribute to a wide array of viewpoints to the the direction of the Foundation. Additionally, YEF has committees and chapters in the US, EMEA, India and APAC. News Lead - Senior Manager, Media Solutions Yahoo November 2013  –  November 2014  (1 year 1 month) New York I was responsible for monetization, packaging and sales strategy for Yahoo News - the #1 news network online - inclusive of Yahoo News and Yahoo Tech. News Lead - Senior Manager, Media Solutions Yahoo November 2013  –  November 2014  (1 year 1 month) New York I was responsible for monetization, packaging and sales strategy for Yahoo News - the #1 news network online - inclusive of Yahoo News and Yahoo Tech. Senior Manager, Media Solutions - Y! News Yahoo! February 2012  –  November 2013  (1 year 10 months) Greater New York City Area In this role, I was an online marketing expert responsible for implementing strategic direction to increase monetization of Yahoo News. I cultivated strong relationships across internal business units and with our ABC News partners to develop and implement the go-to-market framework for our video franchises, which included: ongoing review of packaging, pricing, sales collateral, editorial concept development, troubleshooting ad delivery issues and overall process implementation.  \n \nThis role leveraged strong marketing expertise, creativity and strategic vision to drive revenue by creating compelling value propositions and communicating persuasive stories to the Yahoo sales force and our marketer clients through engaging sales materials. \n \nMy primary role is was as the business owner for Yahoo! News: Video includes owning the Yahoo & ABC News partnership – which consists of co-produced original video programs and as-needed support for Good Morning America on Yahoo - and Yahoo Original Video programming. In this position, I developed and grew the Yahoo News Video franchise by executing strategic and tactical sales support initiatives, product positioning, ad program development and driving revenue. Additionally, I worked closely with internal and external partners to manage pipelines and market demand/feedback, editorial teams on program development and ideation, and worked with reporting and ad operations to ensure successful program and process management. Senior Manager, Media Solutions - Y! News Yahoo! February 2012  –  November 2013  (1 year 10 months) Greater New York City Area In this role, I was an online marketing expert responsible for implementing strategic direction to increase monetization of Yahoo News. I cultivated strong relationships across internal business units and with our ABC News partners to develop and implement the go-to-market framework for our video franchises, which included: ongoing review of packaging, pricing, sales collateral, editorial concept development, troubleshooting ad delivery issues and overall process implementation.  \n \nThis role leveraged strong marketing expertise, creativity and strategic vision to drive revenue by creating compelling value propositions and communicating persuasive stories to the Yahoo sales force and our marketer clients through engaging sales materials. \n \nMy primary role is was as the business owner for Yahoo! News: Video includes owning the Yahoo & ABC News partnership – which consists of co-produced original video programs and as-needed support for Good Morning America on Yahoo - and Yahoo Original Video programming. In this position, I developed and grew the Yahoo News Video franchise by executing strategic and tactical sales support initiatives, product positioning, ad program development and driving revenue. Additionally, I worked closely with internal and external partners to manage pipelines and market demand/feedback, editorial teams on program development and ideation, and worked with reporting and ad operations to ensure successful program and process management. Senior Manager, Strategic Development: Y! Content Solutions Yahoo! October 2011  –  February 2012  (5 months) Greater New York City Area In this role I was dedicated to creating powerful ideas, creative solutions and unique brand-defining opportunities for Yahoo’s advertising partners across a breadth of categories around tentpoles, anchors and events. These include but are not limited to, Olympics, Super Bowl, Elections, Awards Shows, and more.  \n \nI partnered closely with key stakeholders across the company including but not limited to, editorial, property leads, creative services, social marketing, video and product teams to create memorable, customized, best in class consumer and advertiser experiences. \n \nMy role was to help set strategy and leadership to promote Yahoo! as THE place to be for big events. Senior Manager, Strategic Development: Y! Content Solutions Yahoo! October 2011  –  February 2012  (5 months) Greater New York City Area In this role I was dedicated to creating powerful ideas, creative solutions and unique brand-defining opportunities for Yahoo’s advertising partners across a breadth of categories around tentpoles, anchors and events. These include but are not limited to, Olympics, Super Bowl, Elections, Awards Shows, and more.  \n \nI partnered closely with key stakeholders across the company including but not limited to, editorial, property leads, creative services, social marketing, video and product teams to create memorable, customized, best in class consumer and advertiser experiences. \n \nMy role was to help set strategy and leadership to promote Yahoo! as THE place to be for big events. Promotions Manager Disney Interactive Media Group April 2011  –  October 2011  (7 months) Greater New York City Area My role was responsible for assisting in the creation of new marketing opportunities and promotional ad products that enabled the ad sales team to sell progressive digital advertising solutions (both to external advertisers and Disney affiliated advertisers). I worked closely with the sales team to drive promotions and sales strategies and tactics for all Disney Interactive Media Group properties including: Disney.com, Disneychannel.com, DisneyXD.com and the Family Network of Sites as well as mobile and social gaming . Additionally, I worked with the Disney Media Sales & Marketing cross-platform campaign development team - which included TV, Radio and Print teams - for creation and execution of cross platform programs. \n \nMy daily responsibilities included ideating and developing digital marketing/promotion concepts, aiding in organization of team communications both internally amongst the Marketing & Promotions team as well as to the NY sales team and working closely with editorial teams, legal and ad opps teams as needed. Additionally, I was the marketing 'Kids' expert and was the go-to person for kid targeted campaigns, stayed up-to-date on the rules and regulations around advertising to kids and provided my team with regular competitive analysis to ensure we were competitive in the Kids marketplace. Promotions Manager Disney Interactive Media Group April 2011  –  October 2011  (7 months) Greater New York City Area My role was responsible for assisting in the creation of new marketing opportunities and promotional ad products that enabled the ad sales team to sell progressive digital advertising solutions (both to external advertisers and Disney affiliated advertisers). I worked closely with the sales team to drive promotions and sales strategies and tactics for all Disney Interactive Media Group properties including: Disney.com, Disneychannel.com, DisneyXD.com and the Family Network of Sites as well as mobile and social gaming . Additionally, I worked with the Disney Media Sales & Marketing cross-platform campaign development team - which included TV, Radio and Print teams - for creation and execution of cross platform programs. \n \nMy daily responsibilities included ideating and developing digital marketing/promotion concepts, aiding in organization of team communications both internally amongst the Marketing & Promotions team as well as to the NY sales team and working closely with editorial teams, legal and ad opps teams as needed. Additionally, I was the marketing 'Kids' expert and was the go-to person for kid targeted campaigns, stayed up-to-date on the rules and regulations around advertising to kids and provided my team with regular competitive analysis to ensure we were competitive in the Kids marketplace. Associate Promotions Manager Disney Interactive Media Group October 2009  –  April 2011  (1 year 7 months) Greater New York City Area Associate Promotions Manager Disney Interactive Media Group October 2009  –  April 2011  (1 year 7 months) Greater New York City Area Associate Marketing Manager FamilyFun Magazine Disney Publishing Worldwide February 2008  –  October 2009  (1 year 9 months) Greater New York City Area Associate Marketing Manager FamilyFun Magazine Disney Publishing Worldwide February 2008  –  October 2009  (1 year 9 months) Greater New York City Area Marketing Coordinator - FamilyFun Magazine The Walt Disney Company March 2007  –  February 2008  (1 year) Greater New York City Area Marketing Coordinator - FamilyFun Magazine The Walt Disney Company March 2007  –  February 2008  (1 year) Greater New York City Area Undergraduate Associate Disney Consumer Products August 2006  –  March 2007  (8 months) Greater Los Angeles Area Undergraduate Associate Disney Consumer Products August 2006  –  March 2007  (8 months) Greater Los Angeles Area Skills Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Skills  Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Digital Media Digital Marketing Integrated Marketing Online Advertising Product Marketing Sales Tools Development Online Video Strategy Online Video Marketing Organization Time Management Writing PowerPoint Microsoft Excel Managing Priorities Strategic Planning Marketing Strategy Business Strategy Management Advertising Mobile Devices Advertising Sales Sales Online Marketing Digital Strategy See 9+     See less Education Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) Fordham University - Graduate School of Business Administration MBA,  Marketing & Management , 3.9 (on a 4 point scale) 2010  – 2013 Activities and Societies:  Phi Kappa Phi - Graduate Level Honor Society (Exclusive to the top 10% of graduate students at Fordham)\nBeta Gamma Sigma - Business Honor Society (The highest scholastic honor that a Graduate School of Business Administration at Fordham can achieve) University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters University of Southern California BS,  Sales and Marketing 2002  – 2006 Activities and Societies:  Gamma Phi Beta ,  Sports Business Association ,  Phi Alpha Delta ,  Pepsters ", "Skills Product Development Product Management Product Marketing Product Strategy Mobile Cross-functional Team... Go-to-market Strategy Product Monetization Product Launches Operations Management Project Management E-commerce Monetization Search Content Management Competitive Analysis SEM Online Advertising Start-ups Marketing Strategy Partner Management Team Leadership Sales Support Product Life Cycle... Search Systems Search Applications Search Syndication Search Analytics Global Market Experience Online Marketplace Marketing Strategic Partnerships Analytics PPC Search Advertising Mobile Advertising Management Digital Marketing A/B testing User Experience Conversion Optimization Mobile Internet Product Requirements Web Marketing Web 2.0 Mobile Devices Strategy Web Analytics Leadership Digital Strategy See 35+     See less Skills  Product Development Product Management Product Marketing Product Strategy Mobile Cross-functional Team... Go-to-market Strategy Product Monetization Product Launches Operations Management Project Management E-commerce Monetization Search Content Management Competitive Analysis SEM Online Advertising Start-ups Marketing Strategy Partner Management Team Leadership Sales Support Product Life Cycle... Search Systems Search Applications Search Syndication Search Analytics Global Market Experience Online Marketplace Marketing Strategic Partnerships Analytics PPC Search Advertising Mobile Advertising Management Digital Marketing A/B testing User Experience Conversion Optimization Mobile Internet Product Requirements Web Marketing Web 2.0 Mobile Devices Strategy Web Analytics Leadership Digital Strategy See 35+     See less Product Development Product Management Product Marketing Product Strategy Mobile Cross-functional Team... Go-to-market Strategy Product Monetization Product Launches Operations Management Project Management E-commerce Monetization Search Content Management Competitive Analysis SEM Online Advertising Start-ups Marketing Strategy Partner Management Team Leadership Sales Support Product Life Cycle... Search Systems Search Applications Search Syndication Search Analytics Global Market Experience Online Marketplace Marketing Strategic Partnerships Analytics PPC Search Advertising Mobile Advertising Management Digital Marketing A/B testing User Experience Conversion Optimization Mobile Internet Product Requirements Web Marketing Web 2.0 Mobile Devices Strategy Web Analytics Leadership Digital Strategy See 35+     See less Product Development Product Management Product Marketing Product Strategy Mobile Cross-functional Team... Go-to-market Strategy Product Monetization Product Launches Operations Management Project Management E-commerce Monetization Search Content Management Competitive Analysis SEM Online Advertising Start-ups Marketing Strategy Partner Management Team Leadership Sales Support Product Life Cycle... Search Systems Search Applications Search Syndication Search Analytics Global Market Experience Online Marketplace Marketing Strategic Partnerships Analytics PPC Search Advertising Mobile Advertising Management Digital Marketing A/B testing User Experience Conversion Optimization Mobile Internet Product Requirements Web Marketing Web 2.0 Mobile Devices Strategy Web Analytics Leadership Digital Strategy See 35+     See less ", "Summary A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. Summary A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. A highly experienced finance professional and project manager who has led strategic business critical projects in fast changing cross functional environments. Strong Interpersonal skills, ability to communicate with influence, goal orientated, master at getting things done and demonstrated excellence in people management skills. \n \nAn effective collaborator with outsourcing partners and internally to implement change in the following finance operations areas: Customer Order Management, Credit Assignment, Billing and Collections, Revenue Recognition, Affiliate Partner Management, Procure to Pay, Business Process Outsourcing, and Statutory Accounts. \n \nSolid achievements through delivering critical key business initiatives supporting defined business goals for Oracle Financials such as Salesforce CRM integration, localisation enhancements and reporting, process standardization and application upgrades. Experience Senior Project Manager Yahoo! December 2007  –  May 2014  (6 years 6 months) Dublin Senior Manager Consulting Deloitte September 2005  –  November 2007  (2 years 3 months) Dublin, Ireland Senior Business Applications Consultant Fujitsu Services March 1999  –  August 2005  (6 years 6 months) Dublin, Ireland Senior Applications Consultant Infor October 1996  –  March 1999  (2 years 6 months) Dublin, Irelabd Financial Planning Manager Unilever August 1990  –  September 1996  (6 years 2 months) Dublin, Ireland Cost Accounting Manager Henkel CEE February 1985  –  August 1990  (5 years 7 months) Dublin, Ireland Senior Project Manager Yahoo! December 2007  –  May 2014  (6 years 6 months) Dublin Senior Project Manager Yahoo! December 2007  –  May 2014  (6 years 6 months) Dublin Senior Manager Consulting Deloitte September 2005  –  November 2007  (2 years 3 months) Dublin, Ireland Senior Manager Consulting Deloitte September 2005  –  November 2007  (2 years 3 months) Dublin, Ireland Senior Business Applications Consultant Fujitsu Services March 1999  –  August 2005  (6 years 6 months) Dublin, Ireland Senior Business Applications Consultant Fujitsu Services March 1999  –  August 2005  (6 years 6 months) Dublin, Ireland Senior Applications Consultant Infor October 1996  –  March 1999  (2 years 6 months) Dublin, Irelabd Senior Applications Consultant Infor October 1996  –  March 1999  (2 years 6 months) Dublin, Irelabd Financial Planning Manager Unilever August 1990  –  September 1996  (6 years 2 months) Dublin, Ireland Financial Planning Manager Unilever August 1990  –  September 1996  (6 years 2 months) Dublin, Ireland Cost Accounting Manager Henkel CEE February 1985  –  August 1990  (5 years 7 months) Dublin, Ireland Cost Accounting Manager Henkel CEE February 1985  –  August 1990  (5 years 7 months) Dublin, Ireland Skills PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less Skills  PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less PMO Management Project Delivery Data Center Oracle E-Business Suite Business Process... Project Portfolio... Program Management Business Analysis Software Project... Project Management Change Management IT Strategy Process Improvement Business Process Project Planning Strategic Planning Vendor Management Cross-functional Team... See 4+     See less Education Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Dublin Business School ACMA,  Accounting 1986  – 1989 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Digital Marketing Institute Professional Diploma in Digital Marketing 2014  – 2014 Dublin Business School ACMA,  Accounting 1986  – 1989 Dublin Business School ACMA,  Accounting 1986  – 1989 Dublin Business School ACMA,  Accounting 1986  – 1989 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Higher Diploma in Education 1984  – 1984 National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society National University of Ireland, Galway Bachelor of Commerce,  Management Accouting 1980  – 1984 Activities and Societies:  Third World Society "]}