{"position": "Technical Yahoo - Software Engineer - Monthly", "company": "Google", "profiles": ["Skills Java Enterprise Architecture Agile Methodologies J2EE Application... Struts Hibernate JavaScript AJAX Continuous Integration Jenkins Git Test Automation Selenium Java Enterprise Edition JIRA Radar Web Logic JUnit See 3+     See less Skills  Java Enterprise Architecture Agile Methodologies J2EE Application... Struts Hibernate JavaScript AJAX Continuous Integration Jenkins Git Test Automation Selenium Java Enterprise Edition JIRA Radar Web Logic JUnit See 3+     See less Java Enterprise Architecture Agile Methodologies J2EE Application... Struts Hibernate JavaScript AJAX Continuous Integration Jenkins Git Test Automation Selenium Java Enterprise Edition JIRA Radar Web Logic JUnit See 3+     See less Java Enterprise Architecture Agile Methodologies J2EE Application... Struts Hibernate JavaScript AJAX Continuous Integration Jenkins Git Test Automation Selenium Java Enterprise Edition JIRA Radar Web Logic JUnit See 3+     See less ", "Summary I received BSc. in Electrical Engineering with specialization in digital signal processing and communication systems from Sharif University of Technology, Iran, in 2004. My BS project was focused on speech enhancement. I received MSc. and PhD all in Electrical and Computer Engineering with specialization in communication and information systems at University of Waterloo, Canada, in 2006 and 2011, respectively. My Masters thesis was focused on video motion estimation which I applied pattern recognition techniques for motion tracking over sequence of video frames. My other works include video shot detection via information theoretic classification. During my PhD, I designed an adaptive MAC protocol based on IEEE 802.11p standard to optimize the quality of video communication in highly mobile ad-hoc networks. I also applied pattern classification techniques to optimally select the communication relays for video distribution in vehicular netrworks. I am skilled in pattern recognition, image processing, video compression standards and rest-based web service development. Summary I received BSc. in Electrical Engineering with specialization in digital signal processing and communication systems from Sharif University of Technology, Iran, in 2004. My BS project was focused on speech enhancement. I received MSc. and PhD all in Electrical and Computer Engineering with specialization in communication and information systems at University of Waterloo, Canada, in 2006 and 2011, respectively. My Masters thesis was focused on video motion estimation which I applied pattern recognition techniques for motion tracking over sequence of video frames. My other works include video shot detection via information theoretic classification. During my PhD, I designed an adaptive MAC protocol based on IEEE 802.11p standard to optimize the quality of video communication in highly mobile ad-hoc networks. I also applied pattern classification techniques to optimally select the communication relays for video distribution in vehicular netrworks. I am skilled in pattern recognition, image processing, video compression standards and rest-based web service development. I received BSc. in Electrical Engineering with specialization in digital signal processing and communication systems from Sharif University of Technology, Iran, in 2004. My BS project was focused on speech enhancement. I received MSc. and PhD all in Electrical and Computer Engineering with specialization in communication and information systems at University of Waterloo, Canada, in 2006 and 2011, respectively. My Masters thesis was focused on video motion estimation which I applied pattern recognition techniques for motion tracking over sequence of video frames. My other works include video shot detection via information theoretic classification. During my PhD, I designed an adaptive MAC protocol based on IEEE 802.11p standard to optimize the quality of video communication in highly mobile ad-hoc networks. I also applied pattern classification techniques to optimally select the communication relays for video distribution in vehicular netrworks. I am skilled in pattern recognition, image processing, video compression standards and rest-based web service development. I received BSc. in Electrical Engineering with specialization in digital signal processing and communication systems from Sharif University of Technology, Iran, in 2004. My BS project was focused on speech enhancement. I received MSc. and PhD all in Electrical and Computer Engineering with specialization in communication and information systems at University of Waterloo, Canada, in 2006 and 2011, respectively. My Masters thesis was focused on video motion estimation which I applied pattern recognition techniques for motion tracking over sequence of video frames. My other works include video shot detection via information theoretic classification. During my PhD, I designed an adaptive MAC protocol based on IEEE 802.11p standard to optimize the quality of video communication in highly mobile ad-hoc networks. I also applied pattern classification techniques to optimally select the communication relays for video distribution in vehicular netrworks. I am skilled in pattern recognition, image processing, video compression standards and rest-based web service development. Experience Data Scientist Coffee Meets Bagel November 2013  –  February 2014  (4 months) San Francisco Bay Area Machine Learning, Feature Extraction, Feature Selection, Metric Definitions, Recommendation Engines, Data Mining, Python/Django. Development Consultant FinancialForce.com March 2013  –  June 2013  (4 months) Toronto - Java REST-based web service development on Heroku cloud platform. \n- Utilized Session Management, OAuth authentication flow to communicate from external web- \nservice hosted on Heroku with \u2028force.com platform application. \n- Utilized web service development tools such as Apache Maven, Git, Apache Tomcat container.  \n- SSL-based communications between cloud-hosted applications. Research & Development Software Engineer Met-Scan Canada Ltd November 2011  –  December 2012  (1 year 2 months) Toronto Video communication between LAMP server and Android devices (Java/SQL).  \nPhysical Network Design of IP Video Communication over Fiber Transport Backbone. Data Scientist Coffee Meets Bagel November 2013  –  February 2014  (4 months) San Francisco Bay Area Machine Learning, Feature Extraction, Feature Selection, Metric Definitions, Recommendation Engines, Data Mining, Python/Django. Data Scientist Coffee Meets Bagel November 2013  –  February 2014  (4 months) San Francisco Bay Area Machine Learning, Feature Extraction, Feature Selection, Metric Definitions, Recommendation Engines, Data Mining, Python/Django. Development Consultant FinancialForce.com March 2013  –  June 2013  (4 months) Toronto - Java REST-based web service development on Heroku cloud platform. \n- Utilized Session Management, OAuth authentication flow to communicate from external web- \nservice hosted on Heroku with \u2028force.com platform application. \n- Utilized web service development tools such as Apache Maven, Git, Apache Tomcat container.  \n- SSL-based communications between cloud-hosted applications. Development Consultant FinancialForce.com March 2013  –  June 2013  (4 months) Toronto - Java REST-based web service development on Heroku cloud platform. \n- Utilized Session Management, OAuth authentication flow to communicate from external web- \nservice hosted on Heroku with \u2028force.com platform application. \n- Utilized web service development tools such as Apache Maven, Git, Apache Tomcat container.  \n- SSL-based communications between cloud-hosted applications. Research & Development Software Engineer Met-Scan Canada Ltd November 2011  –  December 2012  (1 year 2 months) Toronto Video communication between LAMP server and Android devices (Java/SQL).  \nPhysical Network Design of IP Video Communication over Fiber Transport Backbone. Research & Development Software Engineer Met-Scan Canada Ltd November 2011  –  December 2012  (1 year 2 months) Toronto Video communication between LAMP server and Android devices (Java/SQL).  \nPhysical Network Design of IP Video Communication over Fiber Transport Backbone. Languages English Full professional proficiency Persian Native or bilingual proficiency English Full professional proficiency Persian Native or bilingual proficiency English Full professional proficiency Persian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Linux Signal Processing Algorithms Java Matlab Machine Learning Pattern Recognition Image Processing Software Development Communication Protocols Digital Signal... Data Mining Stochastic Processes MySQL Apache Pig Python Bash Distributed Systems Big Data Hadoop R Oozie Recommender Systems Regression Models Data Science See 10+     See less Skills  Linux Signal Processing Algorithms Java Matlab Machine Learning Pattern Recognition Image Processing Software Development Communication Protocols Digital Signal... Data Mining Stochastic Processes MySQL Apache Pig Python Bash Distributed Systems Big Data Hadoop R Oozie Recommender Systems Regression Models Data Science See 10+     See less Linux Signal Processing Algorithms Java Matlab Machine Learning Pattern Recognition Image Processing Software Development Communication Protocols Digital Signal... Data Mining Stochastic Processes MySQL Apache Pig Python Bash Distributed Systems Big Data Hadoop R Oozie Recommender Systems Regression Models Data Science See 10+     See less Linux Signal Processing Algorithms Java Matlab Machine Learning Pattern Recognition Image Processing Software Development Communication Protocols Digital Signal... Data Mining Stochastic Processes MySQL Apache Pig Python Bash Distributed Systems Big Data Hadoop R Oozie Recommender Systems Regression Models Data Science See 10+     See less Education University of Waterloo PhD,  Electrical and Computer Eng. 2007  – 2011 Dissertation titled \"Cross-Layer Video Quality of Service Provision over Vehicular Networks\" \nI applied pattern classification methods for relay selection in video distribution over highly mobile ad-hoc networks. Activities and Societies:  IEEE University of Waterloo MASc,  Electrical and Computer Engineering 2004  – 2006 With Specialization in Pattern Recognition, Computer Vision, Image and Video Processing. \nMy MS thesis work includes: 1) Video Shot Detection via Information Theoretic Classification \n2) Adaptive Video Motion Estimation Algorithms \n \nI acquired In-dept knowledge in following areas: Pattern Classification, Bayes Decision Theory, Bayes and Maximum Likelihood Parameter Estimation, Non-Parametric Classification Techniques, Linear Discriminant Functions, Support Vector Machines, Neural Networks, Image Processing/Computer Vision Algorithms, Machine Learning, Stochastic Processes and Statistical Signal Processing. Activities and Societies:  IEEE Sharif University of Technology BS,  Electricl Engineering 2000  – 2004 With Specialization in Speech/Voice signal Processing University of Waterloo PhD,  Electrical and Computer Eng. 2007  – 2011 Dissertation titled \"Cross-Layer Video Quality of Service Provision over Vehicular Networks\" \nI applied pattern classification methods for relay selection in video distribution over highly mobile ad-hoc networks. Activities and Societies:  IEEE University of Waterloo PhD,  Electrical and Computer Eng. 2007  – 2011 Dissertation titled \"Cross-Layer Video Quality of Service Provision over Vehicular Networks\" \nI applied pattern classification methods for relay selection in video distribution over highly mobile ad-hoc networks. Activities and Societies:  IEEE University of Waterloo PhD,  Electrical and Computer Eng. 2007  – 2011 Dissertation titled \"Cross-Layer Video Quality of Service Provision over Vehicular Networks\" \nI applied pattern classification methods for relay selection in video distribution over highly mobile ad-hoc networks. Activities and Societies:  IEEE University of Waterloo MASc,  Electrical and Computer Engineering 2004  – 2006 With Specialization in Pattern Recognition, Computer Vision, Image and Video Processing. \nMy MS thesis work includes: 1) Video Shot Detection via Information Theoretic Classification \n2) Adaptive Video Motion Estimation Algorithms \n \nI acquired In-dept knowledge in following areas: Pattern Classification, Bayes Decision Theory, Bayes and Maximum Likelihood Parameter Estimation, Non-Parametric Classification Techniques, Linear Discriminant Functions, Support Vector Machines, Neural Networks, Image Processing/Computer Vision Algorithms, Machine Learning, Stochastic Processes and Statistical Signal Processing. Activities and Societies:  IEEE University of Waterloo MASc,  Electrical and Computer Engineering 2004  – 2006 With Specialization in Pattern Recognition, Computer Vision, Image and Video Processing. \nMy MS thesis work includes: 1) Video Shot Detection via Information Theoretic Classification \n2) Adaptive Video Motion Estimation Algorithms \n \nI acquired In-dept knowledge in following areas: Pattern Classification, Bayes Decision Theory, Bayes and Maximum Likelihood Parameter Estimation, Non-Parametric Classification Techniques, Linear Discriminant Functions, Support Vector Machines, Neural Networks, Image Processing/Computer Vision Algorithms, Machine Learning, Stochastic Processes and Statistical Signal Processing. Activities and Societies:  IEEE University of Waterloo MASc,  Electrical and Computer Engineering 2004  – 2006 With Specialization in Pattern Recognition, Computer Vision, Image and Video Processing. \nMy MS thesis work includes: 1) Video Shot Detection via Information Theoretic Classification \n2) Adaptive Video Motion Estimation Algorithms \n \nI acquired In-dept knowledge in following areas: Pattern Classification, Bayes Decision Theory, Bayes and Maximum Likelihood Parameter Estimation, Non-Parametric Classification Techniques, Linear Discriminant Functions, Support Vector Machines, Neural Networks, Image Processing/Computer Vision Algorithms, Machine Learning, Stochastic Processes and Statistical Signal Processing. Activities and Societies:  IEEE Sharif University of Technology BS,  Electricl Engineering 2000  – 2004 With Specialization in Speech/Voice signal Processing Sharif University of Technology BS,  Electricl Engineering 2000  – 2004 With Specialization in Speech/Voice signal Processing Sharif University of Technology BS,  Electricl Engineering 2000  – 2004 With Specialization in Speech/Voice signal Processing Honors & Awards MITACS Enterprise Internship Grant MITACS September 2012 ORDCF Bell Scholarship Ontario Research and Development Challenges Fund September 2008 Faculty of Engineering Scholarship University of Waterloo 2008 International Doctoral Student Scholarship University of Waterloo January 2007 Faculty of Engineering Scholarship University of Waterloo January 2006 International Masters Student Scholarship University of Waterloo September 2004 MITACS Enterprise Internship Grant MITACS September 2012 MITACS Enterprise Internship Grant MITACS September 2012 MITACS Enterprise Internship Grant MITACS September 2012 ORDCF Bell Scholarship Ontario Research and Development Challenges Fund September 2008 ORDCF Bell Scholarship Ontario Research and Development Challenges Fund September 2008 ORDCF Bell Scholarship Ontario Research and Development Challenges Fund September 2008 Faculty of Engineering Scholarship University of Waterloo 2008 Faculty of Engineering Scholarship University of Waterloo 2008 Faculty of Engineering Scholarship University of Waterloo 2008 International Doctoral Student Scholarship University of Waterloo January 2007 International Doctoral Student Scholarship University of Waterloo January 2007 International Doctoral Student Scholarship University of Waterloo January 2007 Faculty of Engineering Scholarship University of Waterloo January 2006 Faculty of Engineering Scholarship University of Waterloo January 2006 Faculty of Engineering Scholarship University of Waterloo January 2006 International Masters Student Scholarship University of Waterloo September 2004 International Masters Student Scholarship University of Waterloo September 2004 International Masters Student Scholarship University of Waterloo September 2004 ", "Summary 7+ years of experience in designing software systems for leaders in Internet, Technology & Finance industry. \n \nProficient in designing large scalable distributed systems using Agile methodologies under high-pressure environment. \n \nPassionate programmer with problem solving acumen coupled with good soft skills. Summary 7+ years of experience in designing software systems for leaders in Internet, Technology & Finance industry. \n \nProficient in designing large scalable distributed systems using Agile methodologies under high-pressure environment. \n \nPassionate programmer with problem solving acumen coupled with good soft skills. 7+ years of experience in designing software systems for leaders in Internet, Technology & Finance industry. \n \nProficient in designing large scalable distributed systems using Agile methodologies under high-pressure environment. \n \nPassionate programmer with problem solving acumen coupled with good soft skills. 7+ years of experience in designing software systems for leaders in Internet, Technology & Finance industry. \n \nProficient in designing large scalable distributed systems using Agile methodologies under high-pressure environment. \n \nPassionate programmer with problem solving acumen coupled with good soft skills. Experience Technical Yahoo, Software Engineer @ Flickr Flickr August 2014  – Present (1 year 1 month) San Francisco Bay Area Backend Engineer \n \nLead and implemented the Backend & API layer development for Wallart, which allows users to order photos as wall mounts. This was a key project to meet Flickr’s revenue targets as well as establish itself in this market space. \n \nLead the data analysis effort to get more transparency into User-clicks profiling & conversion funneling using web analytics tools. This resulted into re-defining marketing strategies along with future product enhancements. \n \nEnabled international shipping in over 200 countries for all Flickr products by re-designing the backend for the ordering system. \n \nLeading the Backend development for Re-designing the backend infrastructure for storing and computing user, photo and referral statistics. This will be central warehouse of the data of above 1million users. It will help in providing real time transparency in metrics like view counts, favs, clicks, referrers, discoverable factor etc. This product is being re-designed with the aim be the flagship product for analysis. Senior Analyst Developer Goldman Sachs March 2013  –  July 2014  (1 year 5 months) Greater New York City Area Operations Technology Framework Core \n \nDesigned a relational database and implemented server side code for a 3 Tier application that served as a process inventory tool for 4000 users. [DB2, RESTful Webservice Jersey, Hibernate, Spring, XML]  \n \nEnhanced the service layer of an application that manages static data. [Hibernate,RESTful Webservice]  \n \nSpearheaded the development of a tool that will help teams calculate their software deployment risk. [Slang]  \n \nMentored an intern to code UI components and server Side tests. [.NET, Java] Senior Analyst Developer Goldman Sachs January 2012  –  July 2014  (2 years 7 months) Derivatives Trade Processing Technology \n \nCreated a reconciliation process that would manage risk across 3 different trading systems.[Java, Sybase IQ]  \n \nExtended JIRA plugin to auto-populate fields on a ticket creation. [jQuery, Java, JIRA, PL-SQL]  \n \nDeveloped a control that guarantees every booked trade will not fall off any risk mitigation systems.[Slang]  \n \nConceptualized and coded a process to track close to Real-Time updates on Bloomberg pricing objects. This allows other systems to feed of these updates instead of duplicate Bloomberg feeds. [Slang, SecDB]  \n \nCoded an automated Version Control that tests and promotes a version to production. [Slang, XML] Marketing Reasercher Northeastern University January 2008  –  December 2009  (2 years) Greater Boston Area Part Time \nDeveloped and maintained website for the course curriculum of the marketing department \nCompiled papers on the influx of marketing strategies from developing to developed countries. Internship Analyst Developer Goldman Sachs June 2009  –  August 2009  (3 months) Derivatives Trade Processing Technology \n \nDeveloped a scalable ETL framework providing the firms client exposure.[Sybase, Atmos EMC Cloud] \n \nDesigned an object oriented code base to test trades in an automated fashion. [Java, Ant, Fitness]  \n \nCoded a HTML parser that would parse required data on the page into java objects. [HTML, Java] Assitant Systems Engineer Tata Consultancy Services August 2005  –  August 2007  (2 years 1 month) Interface Team - Core Banking Solution \n \n[Shell, SQL, Cobol] \n \nDesigned and implemented interfaces between Core Banking Solution and applications supporting Anti-Money Laundering Solution (AML), CDSL Depository, Check Truncation & SWIFT.  \n \nAutomated the process to migrate large data into the AML monitoring system.  \n \nWorked with a global team in designing the Disaster Recovery Management Process. Technical Yahoo, Software Engineer @ Flickr Flickr August 2014  – Present (1 year 1 month) San Francisco Bay Area Backend Engineer \n \nLead and implemented the Backend & API layer development for Wallart, which allows users to order photos as wall mounts. This was a key project to meet Flickr’s revenue targets as well as establish itself in this market space. \n \nLead the data analysis effort to get more transparency into User-clicks profiling & conversion funneling using web analytics tools. This resulted into re-defining marketing strategies along with future product enhancements. \n \nEnabled international shipping in over 200 countries for all Flickr products by re-designing the backend for the ordering system. \n \nLeading the Backend development for Re-designing the backend infrastructure for storing and computing user, photo and referral statistics. This will be central warehouse of the data of above 1million users. It will help in providing real time transparency in metrics like view counts, favs, clicks, referrers, discoverable factor etc. This product is being re-designed with the aim be the flagship product for analysis. Technical Yahoo, Software Engineer @ Flickr Flickr August 2014  – Present (1 year 1 month) San Francisco Bay Area Backend Engineer \n \nLead and implemented the Backend & API layer development for Wallart, which allows users to order photos as wall mounts. This was a key project to meet Flickr’s revenue targets as well as establish itself in this market space. \n \nLead the data analysis effort to get more transparency into User-clicks profiling & conversion funneling using web analytics tools. This resulted into re-defining marketing strategies along with future product enhancements. \n \nEnabled international shipping in over 200 countries for all Flickr products by re-designing the backend for the ordering system. \n \nLeading the Backend development for Re-designing the backend infrastructure for storing and computing user, photo and referral statistics. This will be central warehouse of the data of above 1million users. It will help in providing real time transparency in metrics like view counts, favs, clicks, referrers, discoverable factor etc. This product is being re-designed with the aim be the flagship product for analysis. Senior Analyst Developer Goldman Sachs March 2013  –  July 2014  (1 year 5 months) Greater New York City Area Operations Technology Framework Core \n \nDesigned a relational database and implemented server side code for a 3 Tier application that served as a process inventory tool for 4000 users. [DB2, RESTful Webservice Jersey, Hibernate, Spring, XML]  \n \nEnhanced the service layer of an application that manages static data. [Hibernate,RESTful Webservice]  \n \nSpearheaded the development of a tool that will help teams calculate their software deployment risk. [Slang]  \n \nMentored an intern to code UI components and server Side tests. [.NET, Java] Senior Analyst Developer Goldman Sachs March 2013  –  July 2014  (1 year 5 months) Greater New York City Area Operations Technology Framework Core \n \nDesigned a relational database and implemented server side code for a 3 Tier application that served as a process inventory tool for 4000 users. [DB2, RESTful Webservice Jersey, Hibernate, Spring, XML]  \n \nEnhanced the service layer of an application that manages static data. [Hibernate,RESTful Webservice]  \n \nSpearheaded the development of a tool that will help teams calculate their software deployment risk. [Slang]  \n \nMentored an intern to code UI components and server Side tests. [.NET, Java] Senior Analyst Developer Goldman Sachs January 2012  –  July 2014  (2 years 7 months) Derivatives Trade Processing Technology \n \nCreated a reconciliation process that would manage risk across 3 different trading systems.[Java, Sybase IQ]  \n \nExtended JIRA plugin to auto-populate fields on a ticket creation. [jQuery, Java, JIRA, PL-SQL]  \n \nDeveloped a control that guarantees every booked trade will not fall off any risk mitigation systems.[Slang]  \n \nConceptualized and coded a process to track close to Real-Time updates on Bloomberg pricing objects. This allows other systems to feed of these updates instead of duplicate Bloomberg feeds. [Slang, SecDB]  \n \nCoded an automated Version Control that tests and promotes a version to production. [Slang, XML] Senior Analyst Developer Goldman Sachs January 2012  –  July 2014  (2 years 7 months) Derivatives Trade Processing Technology \n \nCreated a reconciliation process that would manage risk across 3 different trading systems.[Java, Sybase IQ]  \n \nExtended JIRA plugin to auto-populate fields on a ticket creation. [jQuery, Java, JIRA, PL-SQL]  \n \nDeveloped a control that guarantees every booked trade will not fall off any risk mitigation systems.[Slang]  \n \nConceptualized and coded a process to track close to Real-Time updates on Bloomberg pricing objects. This allows other systems to feed of these updates instead of duplicate Bloomberg feeds. [Slang, SecDB]  \n \nCoded an automated Version Control that tests and promotes a version to production. [Slang, XML] Marketing Reasercher Northeastern University January 2008  –  December 2009  (2 years) Greater Boston Area Part Time \nDeveloped and maintained website for the course curriculum of the marketing department \nCompiled papers on the influx of marketing strategies from developing to developed countries. Marketing Reasercher Northeastern University January 2008  –  December 2009  (2 years) Greater Boston Area Part Time \nDeveloped and maintained website for the course curriculum of the marketing department \nCompiled papers on the influx of marketing strategies from developing to developed countries. Internship Analyst Developer Goldman Sachs June 2009  –  August 2009  (3 months) Derivatives Trade Processing Technology \n \nDeveloped a scalable ETL framework providing the firms client exposure.[Sybase, Atmos EMC Cloud] \n \nDesigned an object oriented code base to test trades in an automated fashion. [Java, Ant, Fitness]  \n \nCoded a HTML parser that would parse required data on the page into java objects. [HTML, Java] Internship Analyst Developer Goldman Sachs June 2009  –  August 2009  (3 months) Derivatives Trade Processing Technology \n \nDeveloped a scalable ETL framework providing the firms client exposure.[Sybase, Atmos EMC Cloud] \n \nDesigned an object oriented code base to test trades in an automated fashion. [Java, Ant, Fitness]  \n \nCoded a HTML parser that would parse required data on the page into java objects. [HTML, Java] Assitant Systems Engineer Tata Consultancy Services August 2005  –  August 2007  (2 years 1 month) Interface Team - Core Banking Solution \n \n[Shell, SQL, Cobol] \n \nDesigned and implemented interfaces between Core Banking Solution and applications supporting Anti-Money Laundering Solution (AML), CDSL Depository, Check Truncation & SWIFT.  \n \nAutomated the process to migrate large data into the AML monitoring system.  \n \nWorked with a global team in designing the Disaster Recovery Management Process. Assitant Systems Engineer Tata Consultancy Services August 2005  –  August 2007  (2 years 1 month) Interface Team - Core Banking Solution \n \n[Shell, SQL, Cobol] \n \nDesigned and implemented interfaces between Core Banking Solution and applications supporting Anti-Money Laundering Solution (AML), CDSL Depository, Check Truncation & SWIFT.  \n \nAutomated the process to migrate large data into the AML monitoring system.  \n \nWorked with a global team in designing the Disaster Recovery Management Process. Languages English Hindi Marathi German Native or bilingual proficiency English Hindi Marathi German Native or bilingual proficiency English Hindi Marathi German Native or bilingual proficiency Native or bilingual proficiency Skills Java SQL JavaScript C++ C# MySQL PHP Oracle Sybase Sybase IQ DB2 XML Spring Hibernate RESTful WebServices Perl Databases Spring Framework See 3+     See less Skills  Java SQL JavaScript C++ C# MySQL PHP Oracle Sybase Sybase IQ DB2 XML Spring Hibernate RESTful WebServices Perl Databases Spring Framework See 3+     See less Java SQL JavaScript C++ C# MySQL PHP Oracle Sybase Sybase IQ DB2 XML Spring Hibernate RESTful WebServices Perl Databases Spring Framework See 3+     See less Java SQL JavaScript C++ C# MySQL PHP Oracle Sybase Sybase IQ DB2 XML Spring Hibernate RESTful WebServices Perl Databases Spring Framework See 3+     See less Education Northeastern University Master of Science (MS),  Computer Science , 3.95/4 2007  – 2009 University of Mumbai Bachelor of engineering,  Computer Engineering , 3.8/4 2007  – 2009 Northeastern University Master of Science (MS),  Computer Science , 3.95/4 2007  – 2009 Northeastern University Master of Science (MS),  Computer Science , 3.95/4 2007  – 2009 Northeastern University Master of Science (MS),  Computer Science , 3.95/4 2007  – 2009 University of Mumbai Bachelor of engineering,  Computer Engineering , 3.8/4 2007  – 2009 University of Mumbai Bachelor of engineering,  Computer Engineering , 3.8/4 2007  – 2009 University of Mumbai Bachelor of engineering,  Computer Engineering , 3.8/4 2007  – 2009 ", "Summary Accomplished and results driven professional with extensive experience in architecting and building high quality internet-based products as well as traditional enterprise software. Proven ability to build, manage and motivate teams, yet not afraid to get into details and drive large and small projects from prototype through launch, leading by example. Forward-thinking innovator whose high quality, on-time results and solutions have engaged teams and boasted very low attrition rates. Summary Accomplished and results driven professional with extensive experience in architecting and building high quality internet-based products as well as traditional enterprise software. Proven ability to build, manage and motivate teams, yet not afraid to get into details and drive large and small projects from prototype through launch, leading by example. Forward-thinking innovator whose high quality, on-time results and solutions have engaged teams and boasted very low attrition rates. Accomplished and results driven professional with extensive experience in architecting and building high quality internet-based products as well as traditional enterprise software. Proven ability to build, manage and motivate teams, yet not afraid to get into details and drive large and small projects from prototype through launch, leading by example. Forward-thinking innovator whose high quality, on-time results and solutions have engaged teams and boasted very low attrition rates. Accomplished and results driven professional with extensive experience in architecting and building high quality internet-based products as well as traditional enterprise software. Proven ability to build, manage and motivate teams, yet not afraid to get into details and drive large and small projects from prototype through launch, leading by example. Forward-thinking innovator whose high quality, on-time results and solutions have engaged teams and boasted very low attrition rates. Experience VP Technology Apigee January 2014  –  July 2015  (1 year 7 months) San Jose, CA - After InsightsOne merger, successfully Integrated InsightsOne engineering team and renamed InsightsOne product as Apigee Insights. \n- Driving Apigee Insights adoption with customers as well as inside the company. \n- Leading advanced product development for Big Data Predictive Analytics. Founder and VP Engineering InsightsOne (Merged with Apigee) January 2011  –  December 2013  (3 years) Santa Clara, California - Recruited and mentored an all star team of 15 engineers. \n- Took the first customer live by personally building the multi-tenant product ground up while still working from garage. \n- Built product for Predictive Analytics on Big Data using innovative GRASP technology by combining user events behavior graph and Bayesian machine learning. \n- Worked closely with initial customers such as Independence Blue Cross, Equifax, PayPal, Aetna, United Online to drive successful implementation of product. \n- Company raised Series A from top investors with Norwest as lead and later merged with Apigee with significant returns to shareholders and employees Director of Engineering Yahoo! Inc October 2007  –  December 2010  (3 years 3 months) Sunnyvale, CA Most of my work was related to processing large data to derive insight and recommendation. Here are a few notable projects: \n \nY! Advertising Analytics: Built first deep analytics product for advertisers by integrating search and display campaign data with audience engagement data on Yahoo! Network. The product provided deep insight to advertisers about how users were engaging with their campaigns across different channels. It is one of the most appreciated products by Yahoo! Sales, impacting millions in renewal dollars and additional business from advertisers. \n \nY! Audience Analytics: As part of the audience analytics team, developed interesting products that provided a complex understanding of user engagement on the Yahoo! Network, as well as built products which helped increase customer awareness throughout Yahoo! properties. \n \n \nUser Value/Lifetime Value: System computes the value generated by the user on each property in addition to the entire Yahoo! network,also predicting lifetime value of the given segment of users. \n \nPath Analysis Platform: The platform to analyze the funnel, inflow/outflow and frequently used path by 500 million+ users on 5 million+ pages resulting in billions of page views on Yahoo! \n \nDigits(near real-time reporting): First near real-time reporting application to provide engagement metrics segmented by demographic & geographic for all Yahoo! properties. \n \nConversion Analysis: Built multiple versions of end-to-end platform to understand the effectiveness of the internal marketing campaigns. \n \nRecommendation System: Built the Affinity Engine(US Patent# 6873996) to compute similarity and worked with multiple properties such as Yahoo! Personals, Hotjobs, Y! Music, Y!Education and many more to deploy recommendations to increase the user engagement. \n \nCIA/FBI: Data driven applications to discover competitors for the given domain and measure revenue impact of marketing and engagement events. Sr. Engineering Manager Yahoo! Inc November 2005  –  September 2007  (1 year 11 months) Engineering Manager Yahoo! Inc January 2004  –  October 2005  (1 year 10 months) Technical Yahoo(Software Engineer) Yahoo! Inc February 2001  –  December 2003  (2 years 11 months) Software Engineer BMC Software, Inc November 1999  –  February 2001  (1 year 4 months) Started working as the first developer on the DB2 UDB Database backup/recovery tool (UBT) from the prototype stage to release to market. In two years, theteam grew from 2 to 10 people. Among the tasks completed: \n• Completed the Proof concept prototype by using DB2 UDB API in C++ on UNIX and NT. \n• Worked with the lead to build thearchitecture and design of the system. \n• Completed the development of the system by working on the core piece understanding the database internal storage structure. \n• Developed communication between different components of the UBT using (TCP/IP) socket programming. \n• Implemented the prototype of DB2 to transaction Log Analyzer to recover selected changes Product Developer Duet Technology, Delhi INDIA July 1997  –  November 1998  (1 year 5 months) •\tDesign and development of WGL to STIL and STIL to WGL translator using semantic Object Model translation using C++, lex/yacc on UNIX.  \n•\tDevelopment of STIL Analyzer to process STIL File \n•\tDesign of grammar for the description of Design Rule Macros (DRM). \n•\tDesign and implementation of Object Model for DRM using C++.  \n•\tDevelopment of parser to read DRM files and populate Object Model using lex/yacc and C++.  \n•\tIntegration of the DRM implementation in the existing Master port to read the DRM Macros from DRM file. Product Developer PCL Mindware, Delhi India July 1996  –  June 1997  (1 year) •\tDesign and development of Logging Daemon for transaction service using CORBA, C+ and IPC to log the Propagation Context when transaction leaves the process boundary. \n•\tDevelopment of Transaction Service of CORBA for NEC-ORB using C++ NEC-ORB on UNIX. VP Technology Apigee January 2014  –  July 2015  (1 year 7 months) San Jose, CA - After InsightsOne merger, successfully Integrated InsightsOne engineering team and renamed InsightsOne product as Apigee Insights. \n- Driving Apigee Insights adoption with customers as well as inside the company. \n- Leading advanced product development for Big Data Predictive Analytics. VP Technology Apigee January 2014  –  July 2015  (1 year 7 months) San Jose, CA - After InsightsOne merger, successfully Integrated InsightsOne engineering team and renamed InsightsOne product as Apigee Insights. \n- Driving Apigee Insights adoption with customers as well as inside the company. \n- Leading advanced product development for Big Data Predictive Analytics. Founder and VP Engineering InsightsOne (Merged with Apigee) January 2011  –  December 2013  (3 years) Santa Clara, California - Recruited and mentored an all star team of 15 engineers. \n- Took the first customer live by personally building the multi-tenant product ground up while still working from garage. \n- Built product for Predictive Analytics on Big Data using innovative GRASP technology by combining user events behavior graph and Bayesian machine learning. \n- Worked closely with initial customers such as Independence Blue Cross, Equifax, PayPal, Aetna, United Online to drive successful implementation of product. \n- Company raised Series A from top investors with Norwest as lead and later merged with Apigee with significant returns to shareholders and employees Founder and VP Engineering InsightsOne (Merged with Apigee) January 2011  –  December 2013  (3 years) Santa Clara, California - Recruited and mentored an all star team of 15 engineers. \n- Took the first customer live by personally building the multi-tenant product ground up while still working from garage. \n- Built product for Predictive Analytics on Big Data using innovative GRASP technology by combining user events behavior graph and Bayesian machine learning. \n- Worked closely with initial customers such as Independence Blue Cross, Equifax, PayPal, Aetna, United Online to drive successful implementation of product. \n- Company raised Series A from top investors with Norwest as lead and later merged with Apigee with significant returns to shareholders and employees Director of Engineering Yahoo! Inc October 2007  –  December 2010  (3 years 3 months) Sunnyvale, CA Most of my work was related to processing large data to derive insight and recommendation. Here are a few notable projects: \n \nY! Advertising Analytics: Built first deep analytics product for advertisers by integrating search and display campaign data with audience engagement data on Yahoo! Network. The product provided deep insight to advertisers about how users were engaging with their campaigns across different channels. It is one of the most appreciated products by Yahoo! Sales, impacting millions in renewal dollars and additional business from advertisers. \n \nY! Audience Analytics: As part of the audience analytics team, developed interesting products that provided a complex understanding of user engagement on the Yahoo! Network, as well as built products which helped increase customer awareness throughout Yahoo! properties. \n \n \nUser Value/Lifetime Value: System computes the value generated by the user on each property in addition to the entire Yahoo! network,also predicting lifetime value of the given segment of users. \n \nPath Analysis Platform: The platform to analyze the funnel, inflow/outflow and frequently used path by 500 million+ users on 5 million+ pages resulting in billions of page views on Yahoo! \n \nDigits(near real-time reporting): First near real-time reporting application to provide engagement metrics segmented by demographic & geographic for all Yahoo! properties. \n \nConversion Analysis: Built multiple versions of end-to-end platform to understand the effectiveness of the internal marketing campaigns. \n \nRecommendation System: Built the Affinity Engine(US Patent# 6873996) to compute similarity and worked with multiple properties such as Yahoo! Personals, Hotjobs, Y! Music, Y!Education and many more to deploy recommendations to increase the user engagement. \n \nCIA/FBI: Data driven applications to discover competitors for the given domain and measure revenue impact of marketing and engagement events. Director of Engineering Yahoo! Inc October 2007  –  December 2010  (3 years 3 months) Sunnyvale, CA Most of my work was related to processing large data to derive insight and recommendation. Here are a few notable projects: \n \nY! Advertising Analytics: Built first deep analytics product for advertisers by integrating search and display campaign data with audience engagement data on Yahoo! Network. The product provided deep insight to advertisers about how users were engaging with their campaigns across different channels. It is one of the most appreciated products by Yahoo! Sales, impacting millions in renewal dollars and additional business from advertisers. \n \nY! Audience Analytics: As part of the audience analytics team, developed interesting products that provided a complex understanding of user engagement on the Yahoo! Network, as well as built products which helped increase customer awareness throughout Yahoo! properties. \n \n \nUser Value/Lifetime Value: System computes the value generated by the user on each property in addition to the entire Yahoo! network,also predicting lifetime value of the given segment of users. \n \nPath Analysis Platform: The platform to analyze the funnel, inflow/outflow and frequently used path by 500 million+ users on 5 million+ pages resulting in billions of page views on Yahoo! \n \nDigits(near real-time reporting): First near real-time reporting application to provide engagement metrics segmented by demographic & geographic for all Yahoo! properties. \n \nConversion Analysis: Built multiple versions of end-to-end platform to understand the effectiveness of the internal marketing campaigns. \n \nRecommendation System: Built the Affinity Engine(US Patent# 6873996) to compute similarity and worked with multiple properties such as Yahoo! Personals, Hotjobs, Y! Music, Y!Education and many more to deploy recommendations to increase the user engagement. \n \nCIA/FBI: Data driven applications to discover competitors for the given domain and measure revenue impact of marketing and engagement events. Sr. Engineering Manager Yahoo! Inc November 2005  –  September 2007  (1 year 11 months) Sr. Engineering Manager Yahoo! Inc November 2005  –  September 2007  (1 year 11 months) Engineering Manager Yahoo! Inc January 2004  –  October 2005  (1 year 10 months) Engineering Manager Yahoo! Inc January 2004  –  October 2005  (1 year 10 months) Technical Yahoo(Software Engineer) Yahoo! Inc February 2001  –  December 2003  (2 years 11 months) Technical Yahoo(Software Engineer) Yahoo! Inc February 2001  –  December 2003  (2 years 11 months) Software Engineer BMC Software, Inc November 1999  –  February 2001  (1 year 4 months) Started working as the first developer on the DB2 UDB Database backup/recovery tool (UBT) from the prototype stage to release to market. In two years, theteam grew from 2 to 10 people. Among the tasks completed: \n• Completed the Proof concept prototype by using DB2 UDB API in C++ on UNIX and NT. \n• Worked with the lead to build thearchitecture and design of the system. \n• Completed the development of the system by working on the core piece understanding the database internal storage structure. \n• Developed communication between different components of the UBT using (TCP/IP) socket programming. \n• Implemented the prototype of DB2 to transaction Log Analyzer to recover selected changes Software Engineer BMC Software, Inc November 1999  –  February 2001  (1 year 4 months) Started working as the first developer on the DB2 UDB Database backup/recovery tool (UBT) from the prototype stage to release to market. In two years, theteam grew from 2 to 10 people. Among the tasks completed: \n• Completed the Proof concept prototype by using DB2 UDB API in C++ on UNIX and NT. \n• Worked with the lead to build thearchitecture and design of the system. \n• Completed the development of the system by working on the core piece understanding the database internal storage structure. \n• Developed communication between different components of the UBT using (TCP/IP) socket programming. \n• Implemented the prototype of DB2 to transaction Log Analyzer to recover selected changes Product Developer Duet Technology, Delhi INDIA July 1997  –  November 1998  (1 year 5 months) •\tDesign and development of WGL to STIL and STIL to WGL translator using semantic Object Model translation using C++, lex/yacc on UNIX.  \n•\tDevelopment of STIL Analyzer to process STIL File \n•\tDesign of grammar for the description of Design Rule Macros (DRM). \n•\tDesign and implementation of Object Model for DRM using C++.  \n•\tDevelopment of parser to read DRM files and populate Object Model using lex/yacc and C++.  \n•\tIntegration of the DRM implementation in the existing Master port to read the DRM Macros from DRM file. Product Developer Duet Technology, Delhi INDIA July 1997  –  November 1998  (1 year 5 months) •\tDesign and development of WGL to STIL and STIL to WGL translator using semantic Object Model translation using C++, lex/yacc on UNIX.  \n•\tDevelopment of STIL Analyzer to process STIL File \n•\tDesign of grammar for the description of Design Rule Macros (DRM). \n•\tDesign and implementation of Object Model for DRM using C++.  \n•\tDevelopment of parser to read DRM files and populate Object Model using lex/yacc and C++.  \n•\tIntegration of the DRM implementation in the existing Master port to read the DRM Macros from DRM file. Product Developer PCL Mindware, Delhi India July 1996  –  June 1997  (1 year) •\tDesign and development of Logging Daemon for transaction service using CORBA, C+ and IPC to log the Propagation Context when transaction leaves the process boundary. \n•\tDevelopment of Transaction Service of CORBA for NEC-ORB using C++ NEC-ORB on UNIX. Product Developer PCL Mindware, Delhi India July 1996  –  June 1997  (1 year) •\tDesign and development of Logging Daemon for transaction service using CORBA, C+ and IPC to log the Propagation Context when transaction leaves the process boundary. \n•\tDevelopment of Transaction Service of CORBA for NEC-ORB using C++ NEC-ORB on UNIX. Skills Hadoop Scalability Big Data Distributed Systems Analytics MapReduce C++ Cloud Computing Enterprise Software Integration Agile Methodologies Databases JavaScript Perl MySQL Unix Machine Learning See 2+     See less Skills  Hadoop Scalability Big Data Distributed Systems Analytics MapReduce C++ Cloud Computing Enterprise Software Integration Agile Methodologies Databases JavaScript Perl MySQL Unix Machine Learning See 2+     See less Hadoop Scalability Big Data Distributed Systems Analytics MapReduce C++ Cloud Computing Enterprise Software Integration Agile Methodologies Databases JavaScript Perl MySQL Unix Machine Learning See 2+     See less Hadoop Scalability Big Data Distributed Systems Analytics MapReduce C++ Cloud Computing Enterprise Software Integration Agile Methodologies Databases JavaScript Perl MySQL Unix Machine Learning See 2+     See less Education National Institute of Technology, Hamirpur, India B. Tech.,  Computer Science 1992  – 1996 - Awarded a gold medal for being the best graduating student in the Computer Science department. \n- Awarded a second gold medal for being the best graduating student across all departments. National Institute of Technology, Hamirpur, India B. Tech.,  Computer Science 1992  – 1996 - Awarded a gold medal for being the best graduating student in the Computer Science department. \n- Awarded a second gold medal for being the best graduating student across all departments. National Institute of Technology, Hamirpur, India B. Tech.,  Computer Science 1992  – 1996 - Awarded a gold medal for being the best graduating student in the Computer Science department. \n- Awarded a second gold medal for being the best graduating student across all departments. National Institute of Technology, Hamirpur, India B. Tech.,  Computer Science 1992  – 1996 - Awarded a gold medal for being the best graduating student in the Computer Science department. \n- Awarded a second gold medal for being the best graduating student across all departments. Honors & Awards Additional Honors & Awards - Yahoo! SDS’s “Data Wizard Award” as a dream team member for building Path Analysis System - 2005 \n \n- Yahoo! SDS’s “Data Wizard Award” for building a reusable system which replaced existing system with 4 days processing time with 4 hour processing time - 2004 \n \n- Yahoo! Data Group’s “SUPERSTAR Award” for building and evangelizing the Affinity Engine - 2003 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in CSE department - 1996 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in all departments - 1996 Additional Honors & Awards - Yahoo! SDS’s “Data Wizard Award” as a dream team member for building Path Analysis System - 2005 \n \n- Yahoo! SDS’s “Data Wizard Award” for building a reusable system which replaced existing system with 4 days processing time with 4 hour processing time - 2004 \n \n- Yahoo! Data Group’s “SUPERSTAR Award” for building and evangelizing the Affinity Engine - 2003 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in CSE department - 1996 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in all departments - 1996 Additional Honors & Awards - Yahoo! SDS’s “Data Wizard Award” as a dream team member for building Path Analysis System - 2005 \n \n- Yahoo! SDS’s “Data Wizard Award” for building a reusable system which replaced existing system with 4 days processing time with 4 hour processing time - 2004 \n \n- Yahoo! Data Group’s “SUPERSTAR Award” for building and evangelizing the Affinity Engine - 2003 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in CSE department - 1996 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in all departments - 1996 Additional Honors & Awards - Yahoo! SDS’s “Data Wizard Award” as a dream team member for building Path Analysis System - 2005 \n \n- Yahoo! SDS’s “Data Wizard Award” for building a reusable system which replaced existing system with 4 days processing time with 4 hour processing time - 2004 \n \n- Yahoo! Data Group’s “SUPERSTAR Award” for building and evangelizing the Affinity Engine - 2003 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in CSE department - 1996 \n \n- Gold medal from R.E.C. Hamirpur (HP) - topper in all departments - 1996 ", "Experience Frontend Engineer Yahoo April 2015  – Present (5 months) Sunnyvale, California Frontend Engineer on finance.yahoo.com. Technical Yahoo! Software Engineer Yahoo! June 2013  –  April 2015  (1 year 11 months) Sunnyvale, CA I work for Yahoo! Media Publishing team to develop publishing tool used by editors for content authoring and distribution. Skills: Ember.js, node.js Technical Intern Yahoo! June 2012  –  June 2013  (1 year 1 month) Sunnyvale, CA I work for Yahoo! Media Publishing team to develop a product called PYC ( publish.yahoo.com) using Node.js. PYC is used by the editors for publishing content on Yahoo! media properties. Graduate Student San Jose State University August 2011  –  May 2013  (1 year 10 months) San Jose, CA Software Engineer Tieto Software Technologies October 2010  –  July 2011  (10 months) Pune Area, India Served Tieto in: \nDeveloping a product TCM (Tieto Client Manager), a web based fund unit ledger for shareholder \nadministration and fund distribution. \nDeveloped programs in C# and ASP.NET for order handling, account and distribution module. \nInvolved in bug fixing, unit testing and report generation. Software Engineer FDS Infotech July 2008  –  September 2010  (2 years 3 months) Pune Area, India Served FDS in: \nDeveloping a web based ERP solution, FDS Axis \nDeveloped programs in C# and ASP.NET for Sales, Purchase and Warehouse Management. \nInvolved in Code Refactoring and optimization, bug fixing and unit testing. \nDeveloped an application called Asset Manager for an asset management firm which involves \nproviding entire back office support to the Client. \nDeveloped applications in C# for portfolio management, creating order tickets, entering fills from \nvarious brokers, generating trade reports, End of the day procedure. Frontend Engineer Yahoo April 2015  – Present (5 months) Sunnyvale, California Frontend Engineer on finance.yahoo.com. Frontend Engineer Yahoo April 2015  – Present (5 months) Sunnyvale, California Frontend Engineer on finance.yahoo.com. Technical Yahoo! Software Engineer Yahoo! June 2013  –  April 2015  (1 year 11 months) Sunnyvale, CA I work for Yahoo! Media Publishing team to develop publishing tool used by editors for content authoring and distribution. Skills: Ember.js, node.js Technical Yahoo! Software Engineer Yahoo! June 2013  –  April 2015  (1 year 11 months) Sunnyvale, CA I work for Yahoo! Media Publishing team to develop publishing tool used by editors for content authoring and distribution. Skills: Ember.js, node.js Technical Intern Yahoo! June 2012  –  June 2013  (1 year 1 month) Sunnyvale, CA I work for Yahoo! Media Publishing team to develop a product called PYC ( publish.yahoo.com) using Node.js. PYC is used by the editors for publishing content on Yahoo! media properties. Technical Intern Yahoo! June 2012  –  June 2013  (1 year 1 month) Sunnyvale, CA I work for Yahoo! Media Publishing team to develop a product called PYC ( publish.yahoo.com) using Node.js. PYC is used by the editors for publishing content on Yahoo! media properties. Graduate Student San Jose State University August 2011  –  May 2013  (1 year 10 months) San Jose, CA Graduate Student San Jose State University August 2011  –  May 2013  (1 year 10 months) San Jose, CA Software Engineer Tieto Software Technologies October 2010  –  July 2011  (10 months) Pune Area, India Served Tieto in: \nDeveloping a product TCM (Tieto Client Manager), a web based fund unit ledger for shareholder \nadministration and fund distribution. \nDeveloped programs in C# and ASP.NET for order handling, account and distribution module. \nInvolved in bug fixing, unit testing and report generation. Software Engineer Tieto Software Technologies October 2010  –  July 2011  (10 months) Pune Area, India Served Tieto in: \nDeveloping a product TCM (Tieto Client Manager), a web based fund unit ledger for shareholder \nadministration and fund distribution. \nDeveloped programs in C# and ASP.NET for order handling, account and distribution module. \nInvolved in bug fixing, unit testing and report generation. Software Engineer FDS Infotech July 2008  –  September 2010  (2 years 3 months) Pune Area, India Served FDS in: \nDeveloping a web based ERP solution, FDS Axis \nDeveloped programs in C# and ASP.NET for Sales, Purchase and Warehouse Management. \nInvolved in Code Refactoring and optimization, bug fixing and unit testing. \nDeveloped an application called Asset Manager for an asset management firm which involves \nproviding entire back office support to the Client. \nDeveloped applications in C# for portfolio management, creating order tickets, entering fills from \nvarious brokers, generating trade reports, End of the day procedure. Software Engineer FDS Infotech July 2008  –  September 2010  (2 years 3 months) Pune Area, India Served FDS in: \nDeveloping a web based ERP solution, FDS Axis \nDeveloped programs in C# and ASP.NET for Sales, Purchase and Warehouse Management. \nInvolved in Code Refactoring and optimization, bug fixing and unit testing. \nDeveloped an application called Asset Manager for an asset management firm which involves \nproviding entire back office support to the Client. \nDeveloped applications in C# for portfolio management, creating order tickets, entering fills from \nvarious brokers, generating trade reports, End of the day procedure. Skills C# REST Servlets JavaScript JSP MySQL AJAX XML JMS Node.js Jade .NET SQL Server HTML Web Services SQL UML CSS HTML 5 CSS3 Backbone.js Ember.js jQuery See 8+     See less Skills  C# REST Servlets JavaScript JSP MySQL AJAX XML JMS Node.js Jade .NET SQL Server HTML Web Services SQL UML CSS HTML 5 CSS3 Backbone.js Ember.js jQuery See 8+     See less C# REST Servlets JavaScript JSP MySQL AJAX XML JMS Node.js Jade .NET SQL Server HTML Web Services SQL UML CSS HTML 5 CSS3 Backbone.js Ember.js jQuery See 8+     See less C# REST Servlets JavaScript JSP MySQL AJAX XML JMS Node.js Jade .NET SQL Server HTML Web Services SQL UML CSS HTML 5 CSS3 Backbone.js Ember.js jQuery See 8+     See less Education San Jose State University Master of Science,  Software Engineering 2011  – 2013 University of Pune Bachelor of Engineering,  Computer Science 2004  – 2008 Courses: Data Structures, Object Oriented Modeling and Design, Principles of Programming Languages, \nDesign and Analysis of Algorithms, Software Engineering. San Jose State University Master of Science,  Software Engineering 2011  – 2013 San Jose State University Master of Science,  Software Engineering 2011  – 2013 San Jose State University Master of Science,  Software Engineering 2011  – 2013 University of Pune Bachelor of Engineering,  Computer Science 2004  – 2008 Courses: Data Structures, Object Oriented Modeling and Design, Principles of Programming Languages, \nDesign and Analysis of Algorithms, Software Engineering. University of Pune Bachelor of Engineering,  Computer Science 2004  – 2008 Courses: Data Structures, Object Oriented Modeling and Design, Principles of Programming Languages, \nDesign and Analysis of Algorithms, Software Engineering. University of Pune Bachelor of Engineering,  Computer Science 2004  – 2008 Courses: Data Structures, Object Oriented Modeling and Design, Principles of Programming Languages, \nDesign and Analysis of Algorithms, Software Engineering. ", "Summary •\t12 years of experience in software development and software engineering. \n•\tExtensive knowledge of Java (Servlets, J2EE, Beans, JSP, JSTL, JDBC), php, C, C++, HTML and JavaScript. \n•\tExperience working with latest database management systems such as Oracle and SQL Server 2000. \n•\tExpertise in SQL, PL/SQL (Stored Procedures and Triggers). \n•\tDesigning experience using UML and Patterns. Designed Object model (Class Diagram), Functional model (Use Cases, Scenarios and Sequence Diagrams) for software applications. \n•\tExperience working on different platforms such as Solaris, HP-UX, Windows and Macintosh. \n•\tImplemented software development processes such as SDLC from the product definition phase through to the implementation phase of a product.  \n•\tGood understanding of UNIX operating system and UNIX shell scripting. \n•\tDesigned test plans and test cases and implemented White box and Black box testing techniques. \n•\tTaken up various roles such as developer, Project Lead and software test engineer. \n \nSpecialties: •\tOperating Systems: Sun Solaris 9.0, HP-UX, Windows NT/2000 \n•\tProgramming Languages: Java, C, C++, Visual Basic, JavaScript, VBScript, Perl and Shell scripting \n•\tDevelopment: J2EE (Servlets, JSP, Beans, RMI, JDBC), Java applets, Threads, AJAX, Perl/CGI, PHP, ASP, IIS Server, Apache Tomcat Server, GlassFish \n•\tDatabases: Oracle8.x, MySQL, SQL Server 2000 \n•\tGUI & Tools: Visual Basic 6.0, Rational Rose, MS Office, StarOffice, NetBeans IDE, Teamware and Mercurial SCM Summary •\t12 years of experience in software development and software engineering. \n•\tExtensive knowledge of Java (Servlets, J2EE, Beans, JSP, JSTL, JDBC), php, C, C++, HTML and JavaScript. \n•\tExperience working with latest database management systems such as Oracle and SQL Server 2000. \n•\tExpertise in SQL, PL/SQL (Stored Procedures and Triggers). \n•\tDesigning experience using UML and Patterns. Designed Object model (Class Diagram), Functional model (Use Cases, Scenarios and Sequence Diagrams) for software applications. \n•\tExperience working on different platforms such as Solaris, HP-UX, Windows and Macintosh. \n•\tImplemented software development processes such as SDLC from the product definition phase through to the implementation phase of a product.  \n•\tGood understanding of UNIX operating system and UNIX shell scripting. \n•\tDesigned test plans and test cases and implemented White box and Black box testing techniques. \n•\tTaken up various roles such as developer, Project Lead and software test engineer. \n \nSpecialties: •\tOperating Systems: Sun Solaris 9.0, HP-UX, Windows NT/2000 \n•\tProgramming Languages: Java, C, C++, Visual Basic, JavaScript, VBScript, Perl and Shell scripting \n•\tDevelopment: J2EE (Servlets, JSP, Beans, RMI, JDBC), Java applets, Threads, AJAX, Perl/CGI, PHP, ASP, IIS Server, Apache Tomcat Server, GlassFish \n•\tDatabases: Oracle8.x, MySQL, SQL Server 2000 \n•\tGUI & Tools: Visual Basic 6.0, Rational Rose, MS Office, StarOffice, NetBeans IDE, Teamware and Mercurial SCM •\t12 years of experience in software development and software engineering. \n•\tExtensive knowledge of Java (Servlets, J2EE, Beans, JSP, JSTL, JDBC), php, C, C++, HTML and JavaScript. \n•\tExperience working with latest database management systems such as Oracle and SQL Server 2000. \n•\tExpertise in SQL, PL/SQL (Stored Procedures and Triggers). \n•\tDesigning experience using UML and Patterns. Designed Object model (Class Diagram), Functional model (Use Cases, Scenarios and Sequence Diagrams) for software applications. \n•\tExperience working on different platforms such as Solaris, HP-UX, Windows and Macintosh. \n•\tImplemented software development processes such as SDLC from the product definition phase through to the implementation phase of a product.  \n•\tGood understanding of UNIX operating system and UNIX shell scripting. \n•\tDesigned test plans and test cases and implemented White box and Black box testing techniques. \n•\tTaken up various roles such as developer, Project Lead and software test engineer. \n \nSpecialties: •\tOperating Systems: Sun Solaris 9.0, HP-UX, Windows NT/2000 \n•\tProgramming Languages: Java, C, C++, Visual Basic, JavaScript, VBScript, Perl and Shell scripting \n•\tDevelopment: J2EE (Servlets, JSP, Beans, RMI, JDBC), Java applets, Threads, AJAX, Perl/CGI, PHP, ASP, IIS Server, Apache Tomcat Server, GlassFish \n•\tDatabases: Oracle8.x, MySQL, SQL Server 2000 \n•\tGUI & Tools: Visual Basic 6.0, Rational Rose, MS Office, StarOffice, NetBeans IDE, Teamware and Mercurial SCM •\t12 years of experience in software development and software engineering. \n•\tExtensive knowledge of Java (Servlets, J2EE, Beans, JSP, JSTL, JDBC), php, C, C++, HTML and JavaScript. \n•\tExperience working with latest database management systems such as Oracle and SQL Server 2000. \n•\tExpertise in SQL, PL/SQL (Stored Procedures and Triggers). \n•\tDesigning experience using UML and Patterns. Designed Object model (Class Diagram), Functional model (Use Cases, Scenarios and Sequence Diagrams) for software applications. \n•\tExperience working on different platforms such as Solaris, HP-UX, Windows and Macintosh. \n•\tImplemented software development processes such as SDLC from the product definition phase through to the implementation phase of a product.  \n•\tGood understanding of UNIX operating system and UNIX shell scripting. \n•\tDesigned test plans and test cases and implemented White box and Black box testing techniques. \n•\tTaken up various roles such as developer, Project Lead and software test engineer. \n \nSpecialties: •\tOperating Systems: Sun Solaris 9.0, HP-UX, Windows NT/2000 \n•\tProgramming Languages: Java, C, C++, Visual Basic, JavaScript, VBScript, Perl and Shell scripting \n•\tDevelopment: J2EE (Servlets, JSP, Beans, RMI, JDBC), Java applets, Threads, AJAX, Perl/CGI, PHP, ASP, IIS Server, Apache Tomcat Server, GlassFish \n•\tDatabases: Oracle8.x, MySQL, SQL Server 2000 \n•\tGUI & Tools: Visual Basic 6.0, Rational Rose, MS Office, StarOffice, NetBeans IDE, Teamware and Mercurial SCM Experience Senior Member Of Technical Staff (Software Engineer) Oracle Corporation February 2010  – Present (5 years 7 months) Development Engineering Professional - 3 (Software Engineer) Sun Microsystems March 2007  –  February 2010  (3 years) As a part of Sun Learning Services (APS group), we provide developer documentation tool for J2SE that is shipped with the JDK. I am a Software Engineer on the team and work with other engineers on the J2SE Java Language and Tools group. \n \nRole: \n•\tInteract with software development engineers, quality team, support team and product managers to analyze, prioritize requests and develop code required to update and maintain the javadoc/doclet software, for JDK releases, to support API documentation and ongoing JSR work. \n \n•\tDevelop comprehensive and realistic schedules for completing and delivering bug fixes, enhancements, and documentation regarding javadoc/doclet software for JDK. \n \n•\tDeveloped and delivered a Javadoc plug-in to the NetBeans team. Developers can access the Java API documentation from the NetBeans IDE. The plug-in is a NetBeans module wrapped around the javadoc bundle. \n \n•\tUpdated code that generates the Java tutorial to reflect new license and copyright information. Also fixed some bugs related to the software. \n \n•\tDeveloped and maintaining an online documentation tool called DocWeb which provides one stop developer documentation for Java developers. It is an open source community driven project which has API documentation and user contributions such as translations, annotation, code samples and bug references. I also worked on initial requirements gathering for the project. \n \n•\tParticipated at JavaOne 2008 manning the Sun Developer Network (SDN) booth promoting the DocWeb project to the community. Intermediate Technical Yahoo! (Software Engineer) Yahoo! November 2004  –  March 2007  (2 years 5 months) Technical operations group of the Customer care organization is responsible for all customer care systems and tools. I was the tools engineer on the team. \n \nRole: \n•\tDesigning and developing property tools mapping application. The application helps to maps various Yahoo properties to tools that are used to support these properties. The application will provide information which will help to provide required access level for tools to the customer care agents. \n \n•\tMaintaining and developing reports for customer care organization on KANA Email System. Reporting capabilities are daily, weekly and monthly. The reports are developed using Perl and Oracle. The reports include, customer care agent productivity reports, new email queues report, customer care agent quality assurance report etc. \n \n•\tDesigning an access request tool which will use the property mapping application that I have developed to provide an interface to the customer care supervisor who can then request access for certain tools for a specific user based on the profile mapping that is gathered by the property tools mapping application. \n \n•\tAdministering customer care agent tools access and providing escalation support for all customer care related tools. Software Engineering Intern Sun Microsystems May 2003  –  August 2005  (2 years 4 months) At the Scalable Systems Release Management group at Sun Microsystems we develop automated tools and websites for the group to help these program managers track each and every project, bug reports and to generate reports. \n \nRole: \n•\tDesigning and developing Goals tracking tool, this tool is used to track the goals in an organization. It is a web based tool. The tool helps to track the goals drill down through the management hierarchy from the Executive VP to the 1st level managers. \n \n•\tDesigning and developing Sun Sigma Tool. It generates reports by tracking expected goals and targets against those achieved. It keeps track of the number of employees that are enrolled in or have successfully completed various Sun Sigma courses and orientations. \n \n•\tDeveloped and tested a Perl script to populate a password file, for a tracking application, from the central database. \n \n•\tDesigned and implemented a database in Oracle for bug tracking application. Written triggers and sequences. \n \n•\tModified and tested an application called 'Course registration tool.' It is an online application which allows employees to register for classes. \n \n•\tModified and tested a tool called Employee Profile Tool. The tool uses Oracle database to store information. The tool allows employees to maintain their profile and makes it available on demand. Senior Member Of Technical Staff (Software Engineer) Oracle Corporation February 2010  – Present (5 years 7 months) Senior Member Of Technical Staff (Software Engineer) Oracle Corporation February 2010  – Present (5 years 7 months) Development Engineering Professional - 3 (Software Engineer) Sun Microsystems March 2007  –  February 2010  (3 years) As a part of Sun Learning Services (APS group), we provide developer documentation tool for J2SE that is shipped with the JDK. I am a Software Engineer on the team and work with other engineers on the J2SE Java Language and Tools group. \n \nRole: \n•\tInteract with software development engineers, quality team, support team and product managers to analyze, prioritize requests and develop code required to update and maintain the javadoc/doclet software, for JDK releases, to support API documentation and ongoing JSR work. \n \n•\tDevelop comprehensive and realistic schedules for completing and delivering bug fixes, enhancements, and documentation regarding javadoc/doclet software for JDK. \n \n•\tDeveloped and delivered a Javadoc plug-in to the NetBeans team. Developers can access the Java API documentation from the NetBeans IDE. The plug-in is a NetBeans module wrapped around the javadoc bundle. \n \n•\tUpdated code that generates the Java tutorial to reflect new license and copyright information. Also fixed some bugs related to the software. \n \n•\tDeveloped and maintaining an online documentation tool called DocWeb which provides one stop developer documentation for Java developers. It is an open source community driven project which has API documentation and user contributions such as translations, annotation, code samples and bug references. I also worked on initial requirements gathering for the project. \n \n•\tParticipated at JavaOne 2008 manning the Sun Developer Network (SDN) booth promoting the DocWeb project to the community. Development Engineering Professional - 3 (Software Engineer) Sun Microsystems March 2007  –  February 2010  (3 years) As a part of Sun Learning Services (APS group), we provide developer documentation tool for J2SE that is shipped with the JDK. I am a Software Engineer on the team and work with other engineers on the J2SE Java Language and Tools group. \n \nRole: \n•\tInteract with software development engineers, quality team, support team and product managers to analyze, prioritize requests and develop code required to update and maintain the javadoc/doclet software, for JDK releases, to support API documentation and ongoing JSR work. \n \n•\tDevelop comprehensive and realistic schedules for completing and delivering bug fixes, enhancements, and documentation regarding javadoc/doclet software for JDK. \n \n•\tDeveloped and delivered a Javadoc plug-in to the NetBeans team. Developers can access the Java API documentation from the NetBeans IDE. The plug-in is a NetBeans module wrapped around the javadoc bundle. \n \n•\tUpdated code that generates the Java tutorial to reflect new license and copyright information. Also fixed some bugs related to the software. \n \n•\tDeveloped and maintaining an online documentation tool called DocWeb which provides one stop developer documentation for Java developers. It is an open source community driven project which has API documentation and user contributions such as translations, annotation, code samples and bug references. I also worked on initial requirements gathering for the project. \n \n•\tParticipated at JavaOne 2008 manning the Sun Developer Network (SDN) booth promoting the DocWeb project to the community. Intermediate Technical Yahoo! (Software Engineer) Yahoo! November 2004  –  March 2007  (2 years 5 months) Technical operations group of the Customer care organization is responsible for all customer care systems and tools. I was the tools engineer on the team. \n \nRole: \n•\tDesigning and developing property tools mapping application. The application helps to maps various Yahoo properties to tools that are used to support these properties. The application will provide information which will help to provide required access level for tools to the customer care agents. \n \n•\tMaintaining and developing reports for customer care organization on KANA Email System. Reporting capabilities are daily, weekly and monthly. The reports are developed using Perl and Oracle. The reports include, customer care agent productivity reports, new email queues report, customer care agent quality assurance report etc. \n \n•\tDesigning an access request tool which will use the property mapping application that I have developed to provide an interface to the customer care supervisor who can then request access for certain tools for a specific user based on the profile mapping that is gathered by the property tools mapping application. \n \n•\tAdministering customer care agent tools access and providing escalation support for all customer care related tools. Intermediate Technical Yahoo! (Software Engineer) Yahoo! November 2004  –  March 2007  (2 years 5 months) Technical operations group of the Customer care organization is responsible for all customer care systems and tools. I was the tools engineer on the team. \n \nRole: \n•\tDesigning and developing property tools mapping application. The application helps to maps various Yahoo properties to tools that are used to support these properties. The application will provide information which will help to provide required access level for tools to the customer care agents. \n \n•\tMaintaining and developing reports for customer care organization on KANA Email System. Reporting capabilities are daily, weekly and monthly. The reports are developed using Perl and Oracle. The reports include, customer care agent productivity reports, new email queues report, customer care agent quality assurance report etc. \n \n•\tDesigning an access request tool which will use the property mapping application that I have developed to provide an interface to the customer care supervisor who can then request access for certain tools for a specific user based on the profile mapping that is gathered by the property tools mapping application. \n \n•\tAdministering customer care agent tools access and providing escalation support for all customer care related tools. Software Engineering Intern Sun Microsystems May 2003  –  August 2005  (2 years 4 months) At the Scalable Systems Release Management group at Sun Microsystems we develop automated tools and websites for the group to help these program managers track each and every project, bug reports and to generate reports. \n \nRole: \n•\tDesigning and developing Goals tracking tool, this tool is used to track the goals in an organization. It is a web based tool. The tool helps to track the goals drill down through the management hierarchy from the Executive VP to the 1st level managers. \n \n•\tDesigning and developing Sun Sigma Tool. It generates reports by tracking expected goals and targets against those achieved. It keeps track of the number of employees that are enrolled in or have successfully completed various Sun Sigma courses and orientations. \n \n•\tDeveloped and tested a Perl script to populate a password file, for a tracking application, from the central database. \n \n•\tDesigned and implemented a database in Oracle for bug tracking application. Written triggers and sequences. \n \n•\tModified and tested an application called 'Course registration tool.' It is an online application which allows employees to register for classes. \n \n•\tModified and tested a tool called Employee Profile Tool. The tool uses Oracle database to store information. The tool allows employees to maintain their profile and makes it available on demand. Software Engineering Intern Sun Microsystems May 2003  –  August 2005  (2 years 4 months) At the Scalable Systems Release Management group at Sun Microsystems we develop automated tools and websites for the group to help these program managers track each and every project, bug reports and to generate reports. \n \nRole: \n•\tDesigning and developing Goals tracking tool, this tool is used to track the goals in an organization. It is a web based tool. The tool helps to track the goals drill down through the management hierarchy from the Executive VP to the 1st level managers. \n \n•\tDesigning and developing Sun Sigma Tool. It generates reports by tracking expected goals and targets against those achieved. It keeps track of the number of employees that are enrolled in or have successfully completed various Sun Sigma courses and orientations. \n \n•\tDeveloped and tested a Perl script to populate a password file, for a tracking application, from the central database. \n \n•\tDesigned and implemented a database in Oracle for bug tracking application. Written triggers and sequences. \n \n•\tModified and tested an application called 'Course registration tool.' It is an online application which allows employees to register for classes. \n \n•\tModified and tested a tool called Employee Profile Tool. The tool uses Oracle database to store information. The tool allows employees to maintain their profile and makes it available on demand. Skills Java Software Development UML Unix Java Enterprise Edition Perl PL/SQL Oracle MySQL Skills  Java Software Development UML Unix Java Enterprise Edition Perl PL/SQL Oracle MySQL Java Software Development UML Unix Java Enterprise Edition Perl PL/SQL Oracle MySQL Java Software Development UML Unix Java Enterprise Edition Perl PL/SQL Oracle MySQL Education California State University-Chico MS,  Computer Science 2000  – 2002 University of Mumbai BE,  Computer Engineering 1996  – 2000 California State University-Chico MS,  Computer Science 2000  – 2002 California State University-Chico MS,  Computer Science 2000  – 2002 California State University-Chico MS,  Computer Science 2000  – 2002 University of Mumbai BE,  Computer Engineering 1996  – 2000 University of Mumbai BE,  Computer Engineering 1996  – 2000 University of Mumbai BE,  Computer Engineering 1996  – 2000 ", "Summary Experience: \n- Veteran practitioner of the agile development process. \n- Windows Mobile Professional SDK and BlackBerry SmartPhone Application Development; \n- Passion in creating applications that increase the efficiency of collaboration and communication between users; \n- Architecture of open(SDK, API, SPI), scalable, modularized software services and components; \n- Maintain coherence between an engaging user experience and the services that provide the features; \n- Conduct architectural tradeoff analysis to arrive at most logical and pragmatic architectural approaches; \n- Strong debugging and problem solving skills at development and production environments; \n- Leading and motivating software dev teams from project start to general availability; \n- Implementation of service interoperability between Java and .Net platforms; \n- Working with international development teams; Specialties:Architecture Patterns: SmartPhone Applications, Enterprise Application, SOA, Multi-User and Multi-Threading, Asynchronous and Event Driven, Dependency Injection \n \nMicrosoft:  \n•Net Framework: C# , .Net BCL and Concurrency, ASP.NET, ASMX, Web Stress Tools, WCF, WF, VS.Net 2008 \n•OS: Windows Vista, Windows Server \n•Products and APIs: Exchange Server API, Office Communicator API, MSMQ, IIS5.1/6.0/7.0 \n \nJava:  \n•Java 5 SDK, Java Concurrency \n \nOpen Source: \n•Eclipse, Equinox OSGi, Knoplerfish Summary Experience: \n- Veteran practitioner of the agile development process. \n- Windows Mobile Professional SDK and BlackBerry SmartPhone Application Development; \n- Passion in creating applications that increase the efficiency of collaboration and communication between users; \n- Architecture of open(SDK, API, SPI), scalable, modularized software services and components; \n- Maintain coherence between an engaging user experience and the services that provide the features; \n- Conduct architectural tradeoff analysis to arrive at most logical and pragmatic architectural approaches; \n- Strong debugging and problem solving skills at development and production environments; \n- Leading and motivating software dev teams from project start to general availability; \n- Implementation of service interoperability between Java and .Net platforms; \n- Working with international development teams; Specialties:Architecture Patterns: SmartPhone Applications, Enterprise Application, SOA, Multi-User and Multi-Threading, Asynchronous and Event Driven, Dependency Injection \n \nMicrosoft:  \n•Net Framework: C# , .Net BCL and Concurrency, ASP.NET, ASMX, Web Stress Tools, WCF, WF, VS.Net 2008 \n•OS: Windows Vista, Windows Server \n•Products and APIs: Exchange Server API, Office Communicator API, MSMQ, IIS5.1/6.0/7.0 \n \nJava:  \n•Java 5 SDK, Java Concurrency \n \nOpen Source: \n•Eclipse, Equinox OSGi, Knoplerfish Experience: \n- Veteran practitioner of the agile development process. \n- Windows Mobile Professional SDK and BlackBerry SmartPhone Application Development; \n- Passion in creating applications that increase the efficiency of collaboration and communication between users; \n- Architecture of open(SDK, API, SPI), scalable, modularized software services and components; \n- Maintain coherence between an engaging user experience and the services that provide the features; \n- Conduct architectural tradeoff analysis to arrive at most logical and pragmatic architectural approaches; \n- Strong debugging and problem solving skills at development and production environments; \n- Leading and motivating software dev teams from project start to general availability; \n- Implementation of service interoperability between Java and .Net platforms; \n- Working with international development teams; Specialties:Architecture Patterns: SmartPhone Applications, Enterprise Application, SOA, Multi-User and Multi-Threading, Asynchronous and Event Driven, Dependency Injection \n \nMicrosoft:  \n•Net Framework: C# , .Net BCL and Concurrency, ASP.NET, ASMX, Web Stress Tools, WCF, WF, VS.Net 2008 \n•OS: Windows Vista, Windows Server \n•Products and APIs: Exchange Server API, Office Communicator API, MSMQ, IIS5.1/6.0/7.0 \n \nJava:  \n•Java 5 SDK, Java Concurrency \n \nOpen Source: \n•Eclipse, Equinox OSGi, Knoplerfish Experience: \n- Veteran practitioner of the agile development process. \n- Windows Mobile Professional SDK and BlackBerry SmartPhone Application Development; \n- Passion in creating applications that increase the efficiency of collaboration and communication between users; \n- Architecture of open(SDK, API, SPI), scalable, modularized software services and components; \n- Maintain coherence between an engaging user experience and the services that provide the features; \n- Conduct architectural tradeoff analysis to arrive at most logical and pragmatic architectural approaches; \n- Strong debugging and problem solving skills at development and production environments; \n- Leading and motivating software dev teams from project start to general availability; \n- Implementation of service interoperability between Java and .Net platforms; \n- Working with international development teams; Specialties:Architecture Patterns: SmartPhone Applications, Enterprise Application, SOA, Multi-User and Multi-Threading, Asynchronous and Event Driven, Dependency Injection \n \nMicrosoft:  \n•Net Framework: C# , .Net BCL and Concurrency, ASP.NET, ASMX, Web Stress Tools, WCF, WF, VS.Net 2008 \n•OS: Windows Vista, Windows Server \n•Products and APIs: Exchange Server API, Office Communicator API, MSMQ, IIS5.1/6.0/7.0 \n \nJava:  \n•Java 5 SDK, Java Concurrency \n \nOpen Source: \n•Eclipse, Equinox OSGi, Knoplerfish Experience Senior Technical Yahoo (Software Engineer) Yahoo! February 2010  – Present (5 years 7 months) Sunnyvale,CA Senior Software Engineer LiteScape Technologies September 2008  –  June 2009  (10 months) Software Architect/Senior Software Engineer Lead Siemens Communications May 1998  –  September 2008  (10 years 5 months) Software Architect Voysys Corporation November 1988  –  April 1998  (9 years 6 months) Senior Technical Yahoo (Software Engineer) Yahoo! February 2010  – Present (5 years 7 months) Sunnyvale,CA Senior Technical Yahoo (Software Engineer) Yahoo! February 2010  – Present (5 years 7 months) Sunnyvale,CA Senior Software Engineer LiteScape Technologies September 2008  –  June 2009  (10 months) Senior Software Engineer LiteScape Technologies September 2008  –  June 2009  (10 months) Software Architect/Senior Software Engineer Lead Siemens Communications May 1998  –  September 2008  (10 years 5 months) Software Architect/Senior Software Engineer Lead Siemens Communications May 1998  –  September 2008  (10 years 5 months) Software Architect Voysys Corporation November 1988  –  April 1998  (9 years 6 months) Software Architect Voysys Corporation November 1988  –  April 1998  (9 years 6 months) Skills Java Agile Methodologies Software Development SOA Skills  Java Agile Methodologies Software Development SOA Java Agile Methodologies Software Development SOA Java Agile Methodologies Software Development SOA Education San Jose State University BS 1982  – 1986 San Jose State University BS 1982  – 1986 San Jose State University BS 1982  – 1986 San Jose State University BS 1982  – 1986 ", "Summary 12 years of experience as a software engineer, most recently at a business intelligence startup, after returning to school in 2007 to complete a Masters in Technology and Policy at MIT. Also have experience with real-time search engines (at Yahoo). \n \nI love to solve complex problems that have never been solved before. \n \nI am a fast learner of new technologies, and passionate about building clean, high-performance, reliable and easy-to-use systems.  \n \nI am skilled at communicating technical concepts clearly and concisely to both technical and non-technical audiences. I have experience as a technical feature lead, working with product management to plan the product roadmap and identify how to break down a large scope into small chunks that individually provide business value. \n \nI am excited about the possibility of applying technology to solve problems in large-scale, distributed systems, such as energy, smart grid and water management. \n \nSpecial interests at the moment: concurrency; distributed systems; actor-based systems (Akka, Go) Summary 12 years of experience as a software engineer, most recently at a business intelligence startup, after returning to school in 2007 to complete a Masters in Technology and Policy at MIT. Also have experience with real-time search engines (at Yahoo). \n \nI love to solve complex problems that have never been solved before. \n \nI am a fast learner of new technologies, and passionate about building clean, high-performance, reliable and easy-to-use systems.  \n \nI am skilled at communicating technical concepts clearly and concisely to both technical and non-technical audiences. I have experience as a technical feature lead, working with product management to plan the product roadmap and identify how to break down a large scope into small chunks that individually provide business value. \n \nI am excited about the possibility of applying technology to solve problems in large-scale, distributed systems, such as energy, smart grid and water management. \n \nSpecial interests at the moment: concurrency; distributed systems; actor-based systems (Akka, Go) 12 years of experience as a software engineer, most recently at a business intelligence startup, after returning to school in 2007 to complete a Masters in Technology and Policy at MIT. Also have experience with real-time search engines (at Yahoo). \n \nI love to solve complex problems that have never been solved before. \n \nI am a fast learner of new technologies, and passionate about building clean, high-performance, reliable and easy-to-use systems.  \n \nI am skilled at communicating technical concepts clearly and concisely to both technical and non-technical audiences. I have experience as a technical feature lead, working with product management to plan the product roadmap and identify how to break down a large scope into small chunks that individually provide business value. \n \nI am excited about the possibility of applying technology to solve problems in large-scale, distributed systems, such as energy, smart grid and water management. \n \nSpecial interests at the moment: concurrency; distributed systems; actor-based systems (Akka, Go) 12 years of experience as a software engineer, most recently at a business intelligence startup, after returning to school in 2007 to complete a Masters in Technology and Policy at MIT. Also have experience with real-time search engines (at Yahoo). \n \nI love to solve complex problems that have never been solved before. \n \nI am a fast learner of new technologies, and passionate about building clean, high-performance, reliable and easy-to-use systems.  \n \nI am skilled at communicating technical concepts clearly and concisely to both technical and non-technical audiences. I have experience as a technical feature lead, working with product management to plan the product roadmap and identify how to break down a large scope into small chunks that individually provide business value. \n \nI am excited about the possibility of applying technology to solve problems in large-scale, distributed systems, such as energy, smart grid and water management. \n \nSpecial interests at the moment: concurrency; distributed systems; actor-based systems (Akka, Go) Experience Lead Launch Engineer Google September 2014  – Present (1 year) San Francisco Bay Area Principal Software Engineer Tidemark Systems, Inc. July 2012  –  August 2014  (2 years 2 months) Redwood City, CA Data Analysis / Software Development / Project Management MIT Joint Program on the Science and Policy of Global Change January 2009  –  July 2012  (3 years 7 months) Cambridge, Massachusetts Research Assistant, Broadband Policy MIT September 2007  –  August 2008  (1 year) Technical Yahoo (Software Engineer) Yahoo October 2005  –  June 2006  (9 months) Senior Software Engineer Entopia October 2004  –  September 2005  (1 year) Systems Software Developer HighWire Press June 1999  –  September 2004  (5 years 4 months) Software Engineer BIOTRONIK October 1996  –  February 1999  (2 years 5 months) Lake Oswego, OR Lead Launch Engineer Google September 2014  – Present (1 year) San Francisco Bay Area Lead Launch Engineer Google September 2014  – Present (1 year) San Francisco Bay Area Principal Software Engineer Tidemark Systems, Inc. July 2012  –  August 2014  (2 years 2 months) Redwood City, CA Principal Software Engineer Tidemark Systems, Inc. July 2012  –  August 2014  (2 years 2 months) Redwood City, CA Data Analysis / Software Development / Project Management MIT Joint Program on the Science and Policy of Global Change January 2009  –  July 2012  (3 years 7 months) Cambridge, Massachusetts Data Analysis / Software Development / Project Management MIT Joint Program on the Science and Policy of Global Change January 2009  –  July 2012  (3 years 7 months) Cambridge, Massachusetts Research Assistant, Broadband Policy MIT September 2007  –  August 2008  (1 year) Research Assistant, Broadband Policy MIT September 2007  –  August 2008  (1 year) Technical Yahoo (Software Engineer) Yahoo October 2005  –  June 2006  (9 months) Technical Yahoo (Software Engineer) Yahoo October 2005  –  June 2006  (9 months) Senior Software Engineer Entopia October 2004  –  September 2005  (1 year) Senior Software Engineer Entopia October 2004  –  September 2005  (1 year) Systems Software Developer HighWire Press June 1999  –  September 2004  (5 years 4 months) Systems Software Developer HighWire Press June 1999  –  September 2004  (5 years 4 months) Software Engineer BIOTRONIK October 1996  –  February 1999  (2 years 5 months) Lake Oswego, OR Software Engineer BIOTRONIK October 1996  –  February 1999  (2 years 5 months) Lake Oswego, OR Skills Java Python Data Analysis Software Engineering SQL C++ Scalability Project Management Distributed Systems Numerical Modeling Research Writing Database Design GAMS Algorithms Business Intelligence R See 2+     See less Skills  Java Python Data Analysis Software Engineering SQL C++ Scalability Project Management Distributed Systems Numerical Modeling Research Writing Database Design GAMS Algorithms Business Intelligence R See 2+     See less Java Python Data Analysis Software Engineering SQL C++ Scalability Project Management Distributed Systems Numerical Modeling Research Writing Database Design GAMS Algorithms Business Intelligence R See 2+     See less Java Python Data Analysis Software Engineering SQL C++ Scalability Project Management Distributed Systems Numerical Modeling Research Writing Database Design GAMS Algorithms Business Intelligence R See 2+     See less Education Massachusetts Institute of Technology M.S. 2007  – 2010 The London School of Economics and Political Science (LSE) 2006  – 2007 Reed College B.A. August 1994  – May 1996 Simon's Rock College A.A. 1992  – 1994 Massachusetts Institute of Technology M.S. 2007  – 2010 Massachusetts Institute of Technology M.S. 2007  – 2010 Massachusetts Institute of Technology M.S. 2007  – 2010 The London School of Economics and Political Science (LSE) 2006  – 2007 The London School of Economics and Political Science (LSE) 2006  – 2007 The London School of Economics and Political Science (LSE) 2006  – 2007 Reed College B.A. August 1994  – May 1996 Reed College B.A. August 1994  – May 1996 Reed College B.A. August 1994  – May 1996 Simon's Rock College A.A. 1992  – 1994 Simon's Rock College A.A. 1992  – 1994 Simon's Rock College A.A. 1992  – 1994 ", "Experience Paranoids Yahoo October 2011  – Present (3 years 11 months) hong kong Senior Product Manager / Associate Product Director 6waves February 2010  –  October 2011  (1 year 9 months) Technical Yahoo! (Software Architect of Asia / Information Security) Yahoo! January 2009  –  January 2010  (1 year 1 month) Technical Yahoo! (Chief Software Architect of HK/ Information Security) Yahoo! July 2008  –  January 2009  (7 months) Technical Yahoo! (Software Architect / Information Security) Yahoo! July 2006  –  July 2008  (2 years 1 month) Technical Yahoo! (Software Engineer) Yahoo! July 2004  –  July 2006  (2 years 1 month) Graduate Trainee PCCW January 2004  –  July 2004  (7 months) Research Associate / Honorary Research Associate The Chinese University of Hong Kong July 2001  –  December 2003  (2 years 6 months) Paranoids Yahoo October 2011  – Present (3 years 11 months) hong kong Paranoids Yahoo October 2011  – Present (3 years 11 months) hong kong Senior Product Manager / Associate Product Director 6waves February 2010  –  October 2011  (1 year 9 months) Senior Product Manager / Associate Product Director 6waves February 2010  –  October 2011  (1 year 9 months) Technical Yahoo! (Software Architect of Asia / Information Security) Yahoo! January 2009  –  January 2010  (1 year 1 month) Technical Yahoo! (Software Architect of Asia / Information Security) Yahoo! January 2009  –  January 2010  (1 year 1 month) Technical Yahoo! (Chief Software Architect of HK/ Information Security) Yahoo! July 2008  –  January 2009  (7 months) Technical Yahoo! (Chief Software Architect of HK/ Information Security) Yahoo! July 2008  –  January 2009  (7 months) Technical Yahoo! (Software Architect / Information Security) Yahoo! July 2006  –  July 2008  (2 years 1 month) Technical Yahoo! (Software Architect / Information Security) Yahoo! July 2006  –  July 2008  (2 years 1 month) Technical Yahoo! (Software Engineer) Yahoo! July 2004  –  July 2006  (2 years 1 month) Technical Yahoo! (Software Engineer) Yahoo! July 2004  –  July 2006  (2 years 1 month) Graduate Trainee PCCW January 2004  –  July 2004  (7 months) Graduate Trainee PCCW January 2004  –  July 2004  (7 months) Research Associate / Honorary Research Associate The Chinese University of Hong Kong July 2001  –  December 2003  (2 years 6 months) Research Associate / Honorary Research Associate The Chinese University of Hong Kong July 2001  –  December 2003  (2 years 6 months) Languages English English English Skills PHP Product Management Perl User Experience MySQL E-commerce Online Advertising Web Analytics Mobile Devices JavaScript Analytics MapReduce Linux Java ISO 27001 Lead Auditor Ruby Ruby on Rails Software Development HTML 5 Git Cloud Computing Security Web Development Information Security Software Engineering LAMP Scalability See 12+     See less Skills  PHP Product Management Perl User Experience MySQL E-commerce Online Advertising Web Analytics Mobile Devices JavaScript Analytics MapReduce Linux Java ISO 27001 Lead Auditor Ruby Ruby on Rails Software Development HTML 5 Git Cloud Computing Security Web Development Information Security Software Engineering LAMP Scalability See 12+     See less PHP Product Management Perl User Experience MySQL E-commerce Online Advertising Web Analytics Mobile Devices JavaScript Analytics MapReduce Linux Java ISO 27001 Lead Auditor Ruby Ruby on Rails Software Development HTML 5 Git Cloud Computing Security Web Development Information Security Software Engineering LAMP Scalability See 12+     See less PHP Product Management Perl User Experience MySQL E-commerce Online Advertising Web Analytics Mobile Devices JavaScript Analytics MapReduce Linux Java ISO 27001 Lead Auditor Ruby Ruby on Rails Software Development HTML 5 Git Cloud Computing Security Web Development Information Security Software Engineering LAMP Scalability See 12+     See less Honors & Awards ", "Skills Hadoop Data Structures MapReduce Machine Learning Information Retrieval Distributed Systems C++ Algorithms Software Design Scalability Python Skills  Hadoop Data Structures MapReduce Machine Learning Information Retrieval Distributed Systems C++ Algorithms Software Design Scalability Python Hadoop Data Structures MapReduce Machine Learning Information Retrieval Distributed Systems C++ Algorithms Software Design Scalability Python Hadoop Data Structures MapReduce Machine Learning Information Retrieval Distributed Systems C++ Algorithms Software Design Scalability Python ", "Summary Specialties:* Expert level knowledge in PHP and MySql  \n* 5+ years of experience building middleware components for various web applications on LAMP stack using version control systems such as SVN and CVS \n* Strong experience in building web services in XML/JSON formats \n* Experience in Object Oriented Design, MVC frameworks and design patterns. \n* Working knowledge in Java, Shell scripting, HTML, CSS, Javascript \n* Familiar with AGILE development Summary Specialties:* Expert level knowledge in PHP and MySql  \n* 5+ years of experience building middleware components for various web applications on LAMP stack using version control systems such as SVN and CVS \n* Strong experience in building web services in XML/JSON formats \n* Experience in Object Oriented Design, MVC frameworks and design patterns. \n* Working knowledge in Java, Shell scripting, HTML, CSS, Javascript \n* Familiar with AGILE development Specialties:* Expert level knowledge in PHP and MySql  \n* 5+ years of experience building middleware components for various web applications on LAMP stack using version control systems such as SVN and CVS \n* Strong experience in building web services in XML/JSON formats \n* Experience in Object Oriented Design, MVC frameworks and design patterns. \n* Working knowledge in Java, Shell scripting, HTML, CSS, Javascript \n* Familiar with AGILE development Specialties:* Expert level knowledge in PHP and MySql  \n* 5+ years of experience building middleware components for various web applications on LAMP stack using version control systems such as SVN and CVS \n* Strong experience in building web services in XML/JSON formats \n* Experience in Object Oriented Design, MVC frameworks and design patterns. \n* Working knowledge in Java, Shell scripting, HTML, CSS, Javascript \n* Familiar with AGILE development Experience Senior Software Engineer Coupons.com November 2011  – Present (3 years 10 months) Software Engineer Yahoo! March 2007  –  November 2011  (4 years 9 months) Worked on a editorially driven curation system (code named Aspen) for Yahoo Buzz. This application generated various Topic Pages with a set of modules containing different types of content such as photos, videos and articles. My role involved building middle -tier components and web services using OO PHP and MySql. \n \n* Contributed in building reputation & incentive system by developing web service layer using REST protocol. \n \n* Automated the process of MySql schema upgrades using a commandline PHP. The script was integrated with the release process to automatically upgrade MySql schema on all the production machines. \n \n* Worked on MySql database design from scratch and implementing PHP layer for various components such as abuse reporting, and reputation & incentive. Writing unit tests using PHPUnit for different backend libraries. \n \n* Experience working with designers, front-end engineers and product managers right from early stage of implementation. Technical Yahoo! (Software Engineer) Yahoo! May 2008  –  August 2009  (1 year 4 months) Y! Glue (Globally Linked User Editors) was a search application where search results page was presented as a set of modules with rich media content using APIs from Yahoo and various third parties. \n \n* Developing modules consuming internal and external webservices using PHP, MySql, HTML and CSS. \n \n* Developed an internal prototyping tool for editors to help measure the performance of a Glue page in terms of module ranking. The tool generated a page with multiple prints of the same module for a given set of keywords. This was built using Yahoo! proprietary MVC framework in PHP. \n \n* Worked on MySql database design for new components and maintained existing database DB. Also, provided database support to the team. Technical Yahoo! (Software Engineer) Yahoo! March 2007  –  May 2008  (1 year 3 months) Yahoo Sales Ops Team \n \nBuilt several internal tools for sales operations team using PHP, MySql. \n \n* IO tool - Yahoo! Search Marketing team used this tool to maintain Insertion Orders for sales. This was used by Account/Sales Executives/Managers. \n \n* Elite Performer - This tool was developed for Ad Sales Operations team. This was a nomination tool used to reward talent in Sales organization. \n \n* GPMT Dashboard - Project management tool was developed for sales team. The tool kept track track of projects/assignments for project managers reflecting project status, no. of hours worked etc. Application Developer Thunder Data Systems October 2006  –  March 2007  (6 months) Hands-on experience combining solid understanding of PHP/MySQL programming.  \n \n* Designed and implemented small scale web based applications such as time tracking system, invoicing software, shopping carts. Participated in full software project development cycle for client implementations.  \n \n* Developed a shopping cart using PHP and payment gateway API like Authorize.net secured credit card processing. \n \n* Experience in relational database design and maintenance. Experience in writing project specification and requirements analysis, creating flowcharts and prototypes. Product Devloper BMC Software January 2004  –  October 2005  (1 year 10 months) * Worked on SmartDBA product suite, consisting of products like SQL Explorer, DBXray. These products are primarily used for monitoring \"health\" of the database in terms of performance, query analysis, etc. \n \n* Designed and implemented modules and feature enhancements for these products using Java, DB2, Oracle, Eclipse editor and Visual Source Safe (VSS) as a version control system.  \n \n* Expertise in Object Oriented Design. Advanced training in multi-tiered architecture database products. Participated in internal training programs for Oracle, and DB2. Software Trainee Vertex Software October 2003  –  December 2003  (3 months) Developing applications using JSP, Servlets, HTML, CSS. \n \n* Designed and developed \"Computer Based Testing\" (CBT) application using JSP, Servlets, MSSQL database. This application was used as an internal tool in the company. \n \n* Participated in entire software development life cycle from requirement analysis to software testing. Involved in creating technical documents such as requirements and specification document, and design document. Senior Software Engineer Coupons.com November 2011  – Present (3 years 10 months) Senior Software Engineer Coupons.com November 2011  – Present (3 years 10 months) Software Engineer Yahoo! March 2007  –  November 2011  (4 years 9 months) Worked on a editorially driven curation system (code named Aspen) for Yahoo Buzz. This application generated various Topic Pages with a set of modules containing different types of content such as photos, videos and articles. My role involved building middle -tier components and web services using OO PHP and MySql. \n \n* Contributed in building reputation & incentive system by developing web service layer using REST protocol. \n \n* Automated the process of MySql schema upgrades using a commandline PHP. The script was integrated with the release process to automatically upgrade MySql schema on all the production machines. \n \n* Worked on MySql database design from scratch and implementing PHP layer for various components such as abuse reporting, and reputation & incentive. Writing unit tests using PHPUnit for different backend libraries. \n \n* Experience working with designers, front-end engineers and product managers right from early stage of implementation. Software Engineer Yahoo! March 2007  –  November 2011  (4 years 9 months) Worked on a editorially driven curation system (code named Aspen) for Yahoo Buzz. This application generated various Topic Pages with a set of modules containing different types of content such as photos, videos and articles. My role involved building middle -tier components and web services using OO PHP and MySql. \n \n* Contributed in building reputation & incentive system by developing web service layer using REST protocol. \n \n* Automated the process of MySql schema upgrades using a commandline PHP. The script was integrated with the release process to automatically upgrade MySql schema on all the production machines. \n \n* Worked on MySql database design from scratch and implementing PHP layer for various components such as abuse reporting, and reputation & incentive. Writing unit tests using PHPUnit for different backend libraries. \n \n* Experience working with designers, front-end engineers and product managers right from early stage of implementation. Technical Yahoo! (Software Engineer) Yahoo! May 2008  –  August 2009  (1 year 4 months) Y! Glue (Globally Linked User Editors) was a search application where search results page was presented as a set of modules with rich media content using APIs from Yahoo and various third parties. \n \n* Developing modules consuming internal and external webservices using PHP, MySql, HTML and CSS. \n \n* Developed an internal prototyping tool for editors to help measure the performance of a Glue page in terms of module ranking. The tool generated a page with multiple prints of the same module for a given set of keywords. This was built using Yahoo! proprietary MVC framework in PHP. \n \n* Worked on MySql database design for new components and maintained existing database DB. Also, provided database support to the team. Technical Yahoo! (Software Engineer) Yahoo! May 2008  –  August 2009  (1 year 4 months) Y! Glue (Globally Linked User Editors) was a search application where search results page was presented as a set of modules with rich media content using APIs from Yahoo and various third parties. \n \n* Developing modules consuming internal and external webservices using PHP, MySql, HTML and CSS. \n \n* Developed an internal prototyping tool for editors to help measure the performance of a Glue page in terms of module ranking. The tool generated a page with multiple prints of the same module for a given set of keywords. This was built using Yahoo! proprietary MVC framework in PHP. \n \n* Worked on MySql database design for new components and maintained existing database DB. Also, provided database support to the team. Technical Yahoo! (Software Engineer) Yahoo! March 2007  –  May 2008  (1 year 3 months) Yahoo Sales Ops Team \n \nBuilt several internal tools for sales operations team using PHP, MySql. \n \n* IO tool - Yahoo! Search Marketing team used this tool to maintain Insertion Orders for sales. This was used by Account/Sales Executives/Managers. \n \n* Elite Performer - This tool was developed for Ad Sales Operations team. This was a nomination tool used to reward talent in Sales organization. \n \n* GPMT Dashboard - Project management tool was developed for sales team. The tool kept track track of projects/assignments for project managers reflecting project status, no. of hours worked etc. Technical Yahoo! (Software Engineer) Yahoo! March 2007  –  May 2008  (1 year 3 months) Yahoo Sales Ops Team \n \nBuilt several internal tools for sales operations team using PHP, MySql. \n \n* IO tool - Yahoo! Search Marketing team used this tool to maintain Insertion Orders for sales. This was used by Account/Sales Executives/Managers. \n \n* Elite Performer - This tool was developed for Ad Sales Operations team. This was a nomination tool used to reward talent in Sales organization. \n \n* GPMT Dashboard - Project management tool was developed for sales team. The tool kept track track of projects/assignments for project managers reflecting project status, no. of hours worked etc. Application Developer Thunder Data Systems October 2006  –  March 2007  (6 months) Hands-on experience combining solid understanding of PHP/MySQL programming.  \n \n* Designed and implemented small scale web based applications such as time tracking system, invoicing software, shopping carts. Participated in full software project development cycle for client implementations.  \n \n* Developed a shopping cart using PHP and payment gateway API like Authorize.net secured credit card processing. \n \n* Experience in relational database design and maintenance. Experience in writing project specification and requirements analysis, creating flowcharts and prototypes. Application Developer Thunder Data Systems October 2006  –  March 2007  (6 months) Hands-on experience combining solid understanding of PHP/MySQL programming.  \n \n* Designed and implemented small scale web based applications such as time tracking system, invoicing software, shopping carts. Participated in full software project development cycle for client implementations.  \n \n* Developed a shopping cart using PHP and payment gateway API like Authorize.net secured credit card processing. \n \n* Experience in relational database design and maintenance. Experience in writing project specification and requirements analysis, creating flowcharts and prototypes. Product Devloper BMC Software January 2004  –  October 2005  (1 year 10 months) * Worked on SmartDBA product suite, consisting of products like SQL Explorer, DBXray. These products are primarily used for monitoring \"health\" of the database in terms of performance, query analysis, etc. \n \n* Designed and implemented modules and feature enhancements for these products using Java, DB2, Oracle, Eclipse editor and Visual Source Safe (VSS) as a version control system.  \n \n* Expertise in Object Oriented Design. Advanced training in multi-tiered architecture database products. Participated in internal training programs for Oracle, and DB2. Product Devloper BMC Software January 2004  –  October 2005  (1 year 10 months) * Worked on SmartDBA product suite, consisting of products like SQL Explorer, DBXray. These products are primarily used for monitoring \"health\" of the database in terms of performance, query analysis, etc. \n \n* Designed and implemented modules and feature enhancements for these products using Java, DB2, Oracle, Eclipse editor and Visual Source Safe (VSS) as a version control system.  \n \n* Expertise in Object Oriented Design. Advanced training in multi-tiered architecture database products. Participated in internal training programs for Oracle, and DB2. Software Trainee Vertex Software October 2003  –  December 2003  (3 months) Developing applications using JSP, Servlets, HTML, CSS. \n \n* Designed and developed \"Computer Based Testing\" (CBT) application using JSP, Servlets, MSSQL database. This application was used as an internal tool in the company. \n \n* Participated in entire software development life cycle from requirement analysis to software testing. Involved in creating technical documents such as requirements and specification document, and design document. Software Trainee Vertex Software October 2003  –  December 2003  (3 months) Developing applications using JSP, Servlets, HTML, CSS. \n \n* Designed and developed \"Computer Based Testing\" (CBT) application using JSP, Servlets, MSSQL database. This application was used as an internal tool in the company. \n \n* Participated in entire software development life cycle from requirement analysis to software testing. Involved in creating technical documents such as requirements and specification document, and design document. Languages English Marathi Hindi English Marathi Hindi English Marathi Hindi Skills Agile Methodologies Web Services MySQL Software Development Shell Scripting Subversion CSS Web Applications PHP Java Solr Search Mercurial Software Product... Skills  Agile Methodologies Web Services MySQL Software Development Shell Scripting Subversion CSS Web Applications PHP Java Solr Search Mercurial Software Product... Agile Methodologies Web Services MySQL Software Development Shell Scripting Subversion CSS Web Applications PHP Java Solr Search Mercurial Software Product... Agile Methodologies Web Services MySQL Software Development Shell Scripting Subversion CSS Web Applications PHP Java Solr Search Mercurial Software Product... Education Stanford Continuing Studies Product Management 2015  – 2015 BUS 38 Product Management: The Art and Science of Building Great Products University of Pune B E,  Computer Science 1999  – 2003 Stanford Continuing Studies Product Management 2015  – 2015 BUS 38 Product Management: The Art and Science of Building Great Products Stanford Continuing Studies Product Management 2015  – 2015 BUS 38 Product Management: The Art and Science of Building Great Products Stanford Continuing Studies Product Management 2015  – 2015 BUS 38 Product Management: The Art and Science of Building Great Products University of Pune B E,  Computer Science 1999  – 2003 University of Pune B E,  Computer Science 1999  – 2003 University of Pune B E,  Computer Science 1999  – 2003 ", "Skills Integration Management Program Management Product Management Strategy Business Strategy Project Management Software Development Agile Methodologies Testing Product Development Sales Operations Business Process Project Planning Marketing Unix Software Quality... Distributed Systems See 3+     See less Skills  Integration Management Program Management Product Management Strategy Business Strategy Project Management Software Development Agile Methodologies Testing Product Development Sales Operations Business Process Project Planning Marketing Unix Software Quality... Distributed Systems See 3+     See less Integration Management Program Management Product Management Strategy Business Strategy Project Management Software Development Agile Methodologies Testing Product Development Sales Operations Business Process Project Planning Marketing Unix Software Quality... Distributed Systems See 3+     See less Integration Management Program Management Product Management Strategy Business Strategy Project Management Software Development Agile Methodologies Testing Product Development Sales Operations Business Process Project Planning Marketing Unix Software Quality... Distributed Systems See 3+     See less ", "Summary I am Scrum Master for my team and lead QA/Testing efforts from business requirements gathering to deployment and release. \n \nMy core interests are Application and Appliance Development to make world a better and safer place.  Summary I am Scrum Master for my team and lead QA/Testing efforts from business requirements gathering to deployment and release. \n \nMy core interests are Application and Appliance Development to make world a better and safer place.  I am Scrum Master for my team and lead QA/Testing efforts from business requirements gathering to deployment and release. \n \nMy core interests are Application and Appliance Development to make world a better and safer place.  I am Scrum Master for my team and lead QA/Testing efforts from business requirements gathering to deployment and release. \n \nMy core interests are Application and Appliance Development to make world a better and safer place.  Languages Hindi Marathi Hindi Marathi Hindi Marathi Skills Leadership Test Planning Testing Business Process... Resource Development Test Automation... JUnit Selenium Java C# .NET ASP.NET SQL TestNG Release Management Web Services Web Applications Unix Shell Scripting REST Linux Manual Testing Black Box Testing System Testing Software Quality... Integration Testing JavaScript Subversion White Box Testing UI testing Web Testing ASP.NET AJAX Web Development Agile Methodologies Scrum See 19+     See less Skills  Leadership Test Planning Testing Business Process... Resource Development Test Automation... JUnit Selenium Java C# .NET ASP.NET SQL TestNG Release Management Web Services Web Applications Unix Shell Scripting REST Linux Manual Testing Black Box Testing System Testing Software Quality... Integration Testing JavaScript Subversion White Box Testing UI testing Web Testing ASP.NET AJAX Web Development Agile Methodologies Scrum See 19+     See less Leadership Test Planning Testing Business Process... Resource Development Test Automation... JUnit Selenium Java C# .NET ASP.NET SQL TestNG Release Management Web Services Web Applications Unix Shell Scripting REST Linux Manual Testing Black Box Testing System Testing Software Quality... Integration Testing JavaScript Subversion White Box Testing UI testing Web Testing ASP.NET AJAX Web Development Agile Methodologies Scrum See 19+     See less Leadership Test Planning Testing Business Process... Resource Development Test Automation... JUnit Selenium Java C# .NET ASP.NET SQL TestNG Release Management Web Services Web Applications Unix Shell Scripting REST Linux Manual Testing Black Box Testing System Testing Software Quality... Integration Testing JavaScript Subversion White Box Testing UI testing Web Testing ASP.NET AJAX Web Development Agile Methodologies Scrum See 19+     See less ", "Experience Technical Yahoo! (Software Engineer) Yahoo! July 2007  – Present (8 years 2 months) Sunnyvale, CA Lead Software Engineer iKorb Inc. June 2004  –  July 2007  (3 years 2 months) Santa Cruz, CA Technical Yahoo! (Software Engineer) Yahoo! July 2007  – Present (8 years 2 months) Sunnyvale, CA Technical Yahoo! (Software Engineer) Yahoo! July 2007  – Present (8 years 2 months) Sunnyvale, CA Lead Software Engineer iKorb Inc. June 2004  –  July 2007  (3 years 2 months) Santa Cruz, CA Lead Software Engineer iKorb Inc. June 2004  –  July 2007  (3 years 2 months) Santa Cruz, CA Skills JavaScript PHP Databases Flash YUI Scalability CSS MySQL ActionScript Skills  JavaScript PHP Databases Flash YUI Scalability CSS MySQL ActionScript JavaScript PHP Databases Flash YUI Scalability CSS MySQL ActionScript JavaScript PHP Databases Flash YUI Scalability CSS MySQL ActionScript Education University of California, Santa Cruz BS,  Computer Science 2000  – 2004 University of California, Santa Cruz BS,  Computer Science 2000  – 2004 University of California, Santa Cruz BS,  Computer Science 2000  – 2004 University of California, Santa Cruz BS,  Computer Science 2000  – 2004 ", "Summary Snehal is a Product Entrepreneur with more than 13 years of professional experience leading innovative products and technologies and delighting lives of 10’s of millions of users globally. \n \nSnehal co-founded Dhingana, India's largest music streaming service, and was its founding CEO till 2013 and then President and CTO till early 2014. Dhingana was acquired by Rdio in March 2014. He joined Rdio's executive team as VP - Emerging Markets overseeing Business Strategy and Product across India and other emerging markets.  \n \nAt Dhingana, he has: \n- Co-owned and driven the overall vision and business strategy in addition to leading the overall execution of all products \n- Led the company through two rounds of funding - Series A $1.25M (Feb’11) led by Inventus Capital and Series B of $7M (April’12) led by Lightspeed with participation from Helion Ventures \n- Successfully hired and retained a highly talented team of senior management leads and individual contributors across Product, Engineering, Marketing and Business Development verticals from companies like Yahoo, Amazon, Microsoft and Zynga \n- Scaled the team to 30 employees across Sunnyvale, CA and Pune, India \n- Led adoption of metric driven approach and ensured products are built and scaled to be used by millions of users with almost no cost in paid marketing \n \nSnehal has a decade of experience in various senior product management and engineering roles at companies like Yahoo!, Symantec & ADP. At Yahoo!, Snehal lead the Product Management efforts across all key Yahoo! Media properties like News, Movies, Finance, Sports for Social Sharing Initiatives, as well the company’s Open APIs initiative for getting media properties on Mobile. His team’s goal was to make the key media properties more social & open to drive user engagement and capture reach.  \n \nSpecialties: Entrepreneurship, Business Strategy, Product Management, Mobile, Product Inception / Ideation, UX/Design, Organizational leadership, Consumer Internet Summary Snehal is a Product Entrepreneur with more than 13 years of professional experience leading innovative products and technologies and delighting lives of 10’s of millions of users globally. \n \nSnehal co-founded Dhingana, India's largest music streaming service, and was its founding CEO till 2013 and then President and CTO till early 2014. Dhingana was acquired by Rdio in March 2014. He joined Rdio's executive team as VP - Emerging Markets overseeing Business Strategy and Product across India and other emerging markets.  \n \nAt Dhingana, he has: \n- Co-owned and driven the overall vision and business strategy in addition to leading the overall execution of all products \n- Led the company through two rounds of funding - Series A $1.25M (Feb’11) led by Inventus Capital and Series B of $7M (April’12) led by Lightspeed with participation from Helion Ventures \n- Successfully hired and retained a highly talented team of senior management leads and individual contributors across Product, Engineering, Marketing and Business Development verticals from companies like Yahoo, Amazon, Microsoft and Zynga \n- Scaled the team to 30 employees across Sunnyvale, CA and Pune, India \n- Led adoption of metric driven approach and ensured products are built and scaled to be used by millions of users with almost no cost in paid marketing \n \nSnehal has a decade of experience in various senior product management and engineering roles at companies like Yahoo!, Symantec & ADP. At Yahoo!, Snehal lead the Product Management efforts across all key Yahoo! Media properties like News, Movies, Finance, Sports for Social Sharing Initiatives, as well the company’s Open APIs initiative for getting media properties on Mobile. His team’s goal was to make the key media properties more social & open to drive user engagement and capture reach.  \n \nSpecialties: Entrepreneurship, Business Strategy, Product Management, Mobile, Product Inception / Ideation, UX/Design, Organizational leadership, Consumer Internet Snehal is a Product Entrepreneur with more than 13 years of professional experience leading innovative products and technologies and delighting lives of 10’s of millions of users globally. \n \nSnehal co-founded Dhingana, India's largest music streaming service, and was its founding CEO till 2013 and then President and CTO till early 2014. Dhingana was acquired by Rdio in March 2014. He joined Rdio's executive team as VP - Emerging Markets overseeing Business Strategy and Product across India and other emerging markets.  \n \nAt Dhingana, he has: \n- Co-owned and driven the overall vision and business strategy in addition to leading the overall execution of all products \n- Led the company through two rounds of funding - Series A $1.25M (Feb’11) led by Inventus Capital and Series B of $7M (April’12) led by Lightspeed with participation from Helion Ventures \n- Successfully hired and retained a highly talented team of senior management leads and individual contributors across Product, Engineering, Marketing and Business Development verticals from companies like Yahoo, Amazon, Microsoft and Zynga \n- Scaled the team to 30 employees across Sunnyvale, CA and Pune, India \n- Led adoption of metric driven approach and ensured products are built and scaled to be used by millions of users with almost no cost in paid marketing \n \nSnehal has a decade of experience in various senior product management and engineering roles at companies like Yahoo!, Symantec & ADP. At Yahoo!, Snehal lead the Product Management efforts across all key Yahoo! Media properties like News, Movies, Finance, Sports for Social Sharing Initiatives, as well the company’s Open APIs initiative for getting media properties on Mobile. His team’s goal was to make the key media properties more social & open to drive user engagement and capture reach.  \n \nSpecialties: Entrepreneurship, Business Strategy, Product Management, Mobile, Product Inception / Ideation, UX/Design, Organizational leadership, Consumer Internet Snehal is a Product Entrepreneur with more than 13 years of professional experience leading innovative products and technologies and delighting lives of 10’s of millions of users globally. \n \nSnehal co-founded Dhingana, India's largest music streaming service, and was its founding CEO till 2013 and then President and CTO till early 2014. Dhingana was acquired by Rdio in March 2014. He joined Rdio's executive team as VP - Emerging Markets overseeing Business Strategy and Product across India and other emerging markets.  \n \nAt Dhingana, he has: \n- Co-owned and driven the overall vision and business strategy in addition to leading the overall execution of all products \n- Led the company through two rounds of funding - Series A $1.25M (Feb’11) led by Inventus Capital and Series B of $7M (April’12) led by Lightspeed with participation from Helion Ventures \n- Successfully hired and retained a highly talented team of senior management leads and individual contributors across Product, Engineering, Marketing and Business Development verticals from companies like Yahoo, Amazon, Microsoft and Zynga \n- Scaled the team to 30 employees across Sunnyvale, CA and Pune, India \n- Led adoption of metric driven approach and ensured products are built and scaled to be used by millions of users with almost no cost in paid marketing \n \nSnehal has a decade of experience in various senior product management and engineering roles at companies like Yahoo!, Symantec & ADP. At Yahoo!, Snehal lead the Product Management efforts across all key Yahoo! Media properties like News, Movies, Finance, Sports for Social Sharing Initiatives, as well the company’s Open APIs initiative for getting media properties on Mobile. His team’s goal was to make the key media properties more social & open to drive user engagement and capture reach.  \n \nSpecialties: Entrepreneurship, Business Strategy, Product Management, Mobile, Product Inception / Ideation, UX/Design, Organizational leadership, Consumer Internet Experience Vice President, Emerging Markets Rdio March 2014  – Present (1 year 6 months) San Francisco Bay Area Responsible for running Rdio across India and Emerging markets \n \nOverseeing P&L, Business Development, Sales and Marketing Co-founder, President & CTO Dhingana February 2013  –  February 2014  (1 year 1 month) Sunnyvale, CA CEO and Co-founder Dhingana February 2011  –  February 2013  (2 years 1 month) Sunnyvale, CA Product Management Yahoo! February 2009  –  February 2011  (2 years 1 month) Lead the Product Management for Social Sharing Initiatives across all key Yahoo! Media properties like News, Movies, Finance and Sports. Also lead the company’s Open APIs initiative for getting media properties on Mobile. \n•\tLead Y! Media Social Sharing widget/platform integration on all Y! Media properties (Finance, News, TV, Movies, Music, OMG - having 5-6 billion widget views per month) \n•\tEnabling easy sharing across Facebook and Twitter, tracking clicks & shares, providing real time analytics. Provide a single version for social sharing and social analytics \n•\tLocalization of the products across 12 languages \n•\tTalking to different y! media properties, convincing them to use our product and stick to one standard \n•\tLead Y! Open APIs for Mobile and Web: coming up with open API standards, market research on how other major players are doing it (NYTimes, Flickr, Google etc). Meeting with leads from major Y! Media properties, getting them to use the standards & pushing for the right way of building open APIs across all properties. These Open APIs are now used by Y! Mobile, Y! Tech and Y! Apps on iPhone and iPad \n•\tLead Y! Media Read Me Later product: market research on already existing players in this domain, build a case to chose the right option: build our own or acquire an existing player Technical Yahoo! Yahoo! September 2006  –  August 2008  (2 years) Sunnyvale, CA Worked as a Technical Yahoo! / Software Engineer in Yahoo! News, Media Engineering department.  \n•\tBuilt highly scalable, reliable software for dynamic news websites and backend servers  \n•\tLead a new initiative ‘People of the Web’ that was part of Yahoo News! Sites. Oversaw the backend design and development and made sure all goals were reached and tracked properly.  \n•\tImplemented highly scalable Memory and File based Caching technologies for fast information retrieval using PHP/C++ and Design Patterns \n•\tDesigned and Developed different backend modules and web services using XML, Design Patterns, PHP, Apache and MySQL. \n•\tDesigned normalized Database Schemas for highly scalable backend servers, replicating these databases using MySQL replications on FreeBSD Servers \n•\tDeveloped and refined the middle tire business logic for Yahoo News Servers using PHP, XML, Web Services and MySQL \n•\tGeneralized the Most Popular (Most Emailed and Most Recommended) modules so that they can be used across Yahoo Media Engineering groups Sr. Engineer Symantec Corporation August 2004  –  August 2006  (2 years 1 month) Software Engineer Teradata, NCR Corporation May 2003  –  August 2004  (1 year 4 months) Software Engineer ADP Company July 2000  –  June 2002  (2 years) Vice President, Emerging Markets Rdio March 2014  – Present (1 year 6 months) San Francisco Bay Area Responsible for running Rdio across India and Emerging markets \n \nOverseeing P&L, Business Development, Sales and Marketing Vice President, Emerging Markets Rdio March 2014  – Present (1 year 6 months) San Francisco Bay Area Responsible for running Rdio across India and Emerging markets \n \nOverseeing P&L, Business Development, Sales and Marketing Co-founder, President & CTO Dhingana February 2013  –  February 2014  (1 year 1 month) Sunnyvale, CA Co-founder, President & CTO Dhingana February 2013  –  February 2014  (1 year 1 month) Sunnyvale, CA CEO and Co-founder Dhingana February 2011  –  February 2013  (2 years 1 month) Sunnyvale, CA CEO and Co-founder Dhingana February 2011  –  February 2013  (2 years 1 month) Sunnyvale, CA Product Management Yahoo! February 2009  –  February 2011  (2 years 1 month) Lead the Product Management for Social Sharing Initiatives across all key Yahoo! Media properties like News, Movies, Finance and Sports. Also lead the company’s Open APIs initiative for getting media properties on Mobile. \n•\tLead Y! Media Social Sharing widget/platform integration on all Y! Media properties (Finance, News, TV, Movies, Music, OMG - having 5-6 billion widget views per month) \n•\tEnabling easy sharing across Facebook and Twitter, tracking clicks & shares, providing real time analytics. Provide a single version for social sharing and social analytics \n•\tLocalization of the products across 12 languages \n•\tTalking to different y! media properties, convincing them to use our product and stick to one standard \n•\tLead Y! Open APIs for Mobile and Web: coming up with open API standards, market research on how other major players are doing it (NYTimes, Flickr, Google etc). Meeting with leads from major Y! Media properties, getting them to use the standards & pushing for the right way of building open APIs across all properties. These Open APIs are now used by Y! Mobile, Y! Tech and Y! Apps on iPhone and iPad \n•\tLead Y! Media Read Me Later product: market research on already existing players in this domain, build a case to chose the right option: build our own or acquire an existing player Product Management Yahoo! February 2009  –  February 2011  (2 years 1 month) Lead the Product Management for Social Sharing Initiatives across all key Yahoo! Media properties like News, Movies, Finance and Sports. Also lead the company’s Open APIs initiative for getting media properties on Mobile. \n•\tLead Y! Media Social Sharing widget/platform integration on all Y! Media properties (Finance, News, TV, Movies, Music, OMG - having 5-6 billion widget views per month) \n•\tEnabling easy sharing across Facebook and Twitter, tracking clicks & shares, providing real time analytics. Provide a single version for social sharing and social analytics \n•\tLocalization of the products across 12 languages \n•\tTalking to different y! media properties, convincing them to use our product and stick to one standard \n•\tLead Y! Open APIs for Mobile and Web: coming up with open API standards, market research on how other major players are doing it (NYTimes, Flickr, Google etc). Meeting with leads from major Y! Media properties, getting them to use the standards & pushing for the right way of building open APIs across all properties. These Open APIs are now used by Y! Mobile, Y! Tech and Y! Apps on iPhone and iPad \n•\tLead Y! Media Read Me Later product: market research on already existing players in this domain, build a case to chose the right option: build our own or acquire an existing player Technical Yahoo! Yahoo! September 2006  –  August 2008  (2 years) Sunnyvale, CA Worked as a Technical Yahoo! / Software Engineer in Yahoo! News, Media Engineering department.  \n•\tBuilt highly scalable, reliable software for dynamic news websites and backend servers  \n•\tLead a new initiative ‘People of the Web’ that was part of Yahoo News! Sites. Oversaw the backend design and development and made sure all goals were reached and tracked properly.  \n•\tImplemented highly scalable Memory and File based Caching technologies for fast information retrieval using PHP/C++ and Design Patterns \n•\tDesigned and Developed different backend modules and web services using XML, Design Patterns, PHP, Apache and MySQL. \n•\tDesigned normalized Database Schemas for highly scalable backend servers, replicating these databases using MySQL replications on FreeBSD Servers \n•\tDeveloped and refined the middle tire business logic for Yahoo News Servers using PHP, XML, Web Services and MySQL \n•\tGeneralized the Most Popular (Most Emailed and Most Recommended) modules so that they can be used across Yahoo Media Engineering groups Technical Yahoo! Yahoo! September 2006  –  August 2008  (2 years) Sunnyvale, CA Worked as a Technical Yahoo! / Software Engineer in Yahoo! News, Media Engineering department.  \n•\tBuilt highly scalable, reliable software for dynamic news websites and backend servers  \n•\tLead a new initiative ‘People of the Web’ that was part of Yahoo News! Sites. Oversaw the backend design and development and made sure all goals were reached and tracked properly.  \n•\tImplemented highly scalable Memory and File based Caching technologies for fast information retrieval using PHP/C++ and Design Patterns \n•\tDesigned and Developed different backend modules and web services using XML, Design Patterns, PHP, Apache and MySQL. \n•\tDesigned normalized Database Schemas for highly scalable backend servers, replicating these databases using MySQL replications on FreeBSD Servers \n•\tDeveloped and refined the middle tire business logic for Yahoo News Servers using PHP, XML, Web Services and MySQL \n•\tGeneralized the Most Popular (Most Emailed and Most Recommended) modules so that they can be used across Yahoo Media Engineering groups Sr. Engineer Symantec Corporation August 2004  –  August 2006  (2 years 1 month) Sr. Engineer Symantec Corporation August 2004  –  August 2006  (2 years 1 month) Software Engineer Teradata, NCR Corporation May 2003  –  August 2004  (1 year 4 months) Software Engineer Teradata, NCR Corporation May 2003  –  August 2004  (1 year 4 months) Software Engineer ADP Company July 2000  –  June 2002  (2 years) Software Engineer ADP Company July 2000  –  June 2002  (2 years) Skills Product Management Entrepreneurship Scalability Analytics Mobile Devices Start-ups Hadoop Leadership Mobile Applications Business Development Software Design Distributed Systems User Experience Scrum Web Services Agile Methodologies See 1+     See less Skills  Product Management Entrepreneurship Scalability Analytics Mobile Devices Start-ups Hadoop Leadership Mobile Applications Business Development Software Design Distributed Systems User Experience Scrum Web Services Agile Methodologies See 1+     See less Product Management Entrepreneurship Scalability Analytics Mobile Devices Start-ups Hadoop Leadership Mobile Applications Business Development Software Design Distributed Systems User Experience Scrum Web Services Agile Methodologies See 1+     See less Product Management Entrepreneurship Scalability Analytics Mobile Devices Start-ups Hadoop Leadership Mobile Applications Business Development Software Design Distributed Systems User Experience Scrum Web Services Agile Methodologies See 1+     See less Education University of Southern California MS,  Computer Science 2002  – 2004 GPA 3.81 College of Engineering Pune Bachelor of Engineering,  Computer Engineering 1996  – 2000 University of Southern California MS,  Computer Science 2002  – 2004 GPA 3.81 University of Southern California MS,  Computer Science 2002  – 2004 GPA 3.81 University of Southern California MS,  Computer Science 2002  – 2004 GPA 3.81 College of Engineering Pune Bachelor of Engineering,  Computer Engineering 1996  – 2000 College of Engineering Pune Bachelor of Engineering,  Computer Engineering 1996  – 2000 College of Engineering Pune Bachelor of Engineering,  Computer Engineering 1996  – 2000 Honors & Awards ", "Experience Technical Product Manager Expedia, Inc. March 2014  – Present (1 year 6 months) Bellevue, WA Define and deliver on Lodging Meta API Roadmap with the goal to optimize multi billion dollar shopping path for Expedia's top meta search partners' traffic Practice Manager iLink Systems November 2008  –  March 2014  (5 years 5 months) Bellevue, WA Project Manager Proteans Software Solutions March 2007  –  November 2008  (1 year 9 months) Founder, CEO Wintricate Technologies August 2006  –  March 2007  (8 months) Principal Software Engineer SupportSoft December 2004  –  August 2006  (1 year 9 months) Software Engineer Microsoft Corp October 2001  –  October 2004  (3 years 1 month) Technical Yahoo! (Software Engineer) Yahoo! Inc September 2001  –  October 2001  (2 months) Software Associate Strand Life Sciences/ PicoPeta Simputers January 2001  –  September 2001  (9 months) Project Associate Indian Institute of Science March 1999  –  January 2001  (1 year 11 months) Intern Oracle India Development Center April 1998  –  September 1998  (6 months) bangalore, India Technical Product Manager Expedia, Inc. March 2014  – Present (1 year 6 months) Bellevue, WA Define and deliver on Lodging Meta API Roadmap with the goal to optimize multi billion dollar shopping path for Expedia's top meta search partners' traffic Technical Product Manager Expedia, Inc. March 2014  – Present (1 year 6 months) Bellevue, WA Define and deliver on Lodging Meta API Roadmap with the goal to optimize multi billion dollar shopping path for Expedia's top meta search partners' traffic Practice Manager iLink Systems November 2008  –  March 2014  (5 years 5 months) Bellevue, WA Practice Manager iLink Systems November 2008  –  March 2014  (5 years 5 months) Bellevue, WA Project Manager Proteans Software Solutions March 2007  –  November 2008  (1 year 9 months) Project Manager Proteans Software Solutions March 2007  –  November 2008  (1 year 9 months) Founder, CEO Wintricate Technologies August 2006  –  March 2007  (8 months) Founder, CEO Wintricate Technologies August 2006  –  March 2007  (8 months) Principal Software Engineer SupportSoft December 2004  –  August 2006  (1 year 9 months) Principal Software Engineer SupportSoft December 2004  –  August 2006  (1 year 9 months) Software Engineer Microsoft Corp October 2001  –  October 2004  (3 years 1 month) Software Engineer Microsoft Corp October 2001  –  October 2004  (3 years 1 month) Technical Yahoo! (Software Engineer) Yahoo! Inc September 2001  –  October 2001  (2 months) Technical Yahoo! (Software Engineer) Yahoo! Inc September 2001  –  October 2001  (2 months) Software Associate Strand Life Sciences/ PicoPeta Simputers January 2001  –  September 2001  (9 months) Software Associate Strand Life Sciences/ PicoPeta Simputers January 2001  –  September 2001  (9 months) Project Associate Indian Institute of Science March 1999  –  January 2001  (1 year 11 months) Project Associate Indian Institute of Science March 1999  –  January 2001  (1 year 11 months) Intern Oracle India Development Center April 1998  –  September 1998  (6 months) bangalore, India Intern Oracle India Development Center April 1998  –  September 1998  (6 months) bangalore, India Languages Kannada Hindi Kannada Hindi Kannada Hindi Skills Cloud Computing SharePoint Windows Azure Software Project... Software Development .NET Mobile Applications Healthcare Enterprise Architecture Agile Project Management Product Management Development of... Office 365 Agile Methodologies Speech Synthesis Natural Language... Information Retrieval Marketing Strategy Enterprise Software Scrum Solution Architecture Visual Studio SOA Software Engineering Software Design Web Services SaaS WCF Requirements Analysis Business Intelligence C# See 16+     See less Skills  Cloud Computing SharePoint Windows Azure Software Project... Software Development .NET Mobile Applications Healthcare Enterprise Architecture Agile Project Management Product Management Development of... Office 365 Agile Methodologies Speech Synthesis Natural Language... Information Retrieval Marketing Strategy Enterprise Software Scrum Solution Architecture Visual Studio SOA Software Engineering Software Design Web Services SaaS WCF Requirements Analysis Business Intelligence C# See 16+     See less Cloud Computing SharePoint Windows Azure Software Project... Software Development .NET Mobile Applications Healthcare Enterprise Architecture Agile Project Management Product Management Development of... Office 365 Agile Methodologies Speech Synthesis Natural Language... Information Retrieval Marketing Strategy Enterprise Software Scrum Solution Architecture Visual Studio SOA Software Engineering Software Design Web Services SaaS WCF Requirements Analysis Business Intelligence C# See 16+     See less Cloud Computing SharePoint Windows Azure Software Project... Software Development .NET Mobile Applications Healthcare Enterprise Architecture Agile Project Management Product Management Development of... Office 365 Agile Methodologies Speech Synthesis Natural Language... Information Retrieval Marketing Strategy Enterprise Software Scrum Solution Architecture Visual Studio SOA Software Engineering Software Design Web Services SaaS WCF Requirements Analysis Business Intelligence C# See 16+     See less Education University of Washington Software Product Management 2010  – 2011 Indian Institute of Science Computer Science and Automation 1999  – 2000 Activities and Societies:  Free classes for underprivileged children in and around the institute ,  in the early days of http://www.friendsofchildrentrust.org/ University of Mysore Bachelor Of Engineering,  Computer Science and Engineering 1994  – 1998 Activities and Societies:  Mysore Amateur Radio Club ,  Mysore Amateur Naturalists Sarvodaya Junior College University of Washington Software Product Management 2010  – 2011 University of Washington Software Product Management 2010  – 2011 University of Washington Software Product Management 2010  – 2011 Indian Institute of Science Computer Science and Automation 1999  – 2000 Activities and Societies:  Free classes for underprivileged children in and around the institute ,  in the early days of http://www.friendsofchildrentrust.org/ Indian Institute of Science Computer Science and Automation 1999  – 2000 Activities and Societies:  Free classes for underprivileged children in and around the institute ,  in the early days of http://www.friendsofchildrentrust.org/ Indian Institute of Science Computer Science and Automation 1999  – 2000 Activities and Societies:  Free classes for underprivileged children in and around the institute ,  in the early days of http://www.friendsofchildrentrust.org/ University of Mysore Bachelor Of Engineering,  Computer Science and Engineering 1994  – 1998 Activities and Societies:  Mysore Amateur Radio Club ,  Mysore Amateur Naturalists University of Mysore Bachelor Of Engineering,  Computer Science and Engineering 1994  – 1998 Activities and Societies:  Mysore Amateur Radio Club ,  Mysore Amateur Naturalists University of Mysore Bachelor Of Engineering,  Computer Science and Engineering 1994  – 1998 Activities and Societies:  Mysore Amateur Radio Club ,  Mysore Amateur Naturalists Sarvodaya Junior College Sarvodaya Junior College Sarvodaya Junior College Honors & Awards Additional Honors & Awards Award for Exceptional Service as a Co-Ordinater(Wireless group) during 5th National Games \nEngineering Best Performer award at SupportSoft in 2005 Additional Honors & Awards Award for Exceptional Service as a Co-Ordinater(Wireless group) during 5th National Games \nEngineering Best Performer award at SupportSoft in 2005 Additional Honors & Awards Award for Exceptional Service as a Co-Ordinater(Wireless group) during 5th National Games \nEngineering Best Performer award at SupportSoft in 2005 Additional Honors & Awards Award for Exceptional Service as a Co-Ordinater(Wireless group) during 5th National Games \nEngineering Best Performer award at SupportSoft in 2005 ", "Summary Application developer and Software Engineer with strong skills and conceptual knowledge. \n \nSeeking for an internship/full-time position in an organization, specifically focusing on web/software development. Specialties:Object Oriented Analysis and Design, MVC, Design Patterns, Software Architecture, SDLCs, Agile/Scrum, Agile/XP, UML Modeling, Database Optimization/ Normalization, J2EE technology, Spring framework, Google Technologies, API programming, UI development, SQL, Databases, Virtualization, Computer Networks, Hard Real-time Systems, Project management. Summary Application developer and Software Engineer with strong skills and conceptual knowledge. \n \nSeeking for an internship/full-time position in an organization, specifically focusing on web/software development. Specialties:Object Oriented Analysis and Design, MVC, Design Patterns, Software Architecture, SDLCs, Agile/Scrum, Agile/XP, UML Modeling, Database Optimization/ Normalization, J2EE technology, Spring framework, Google Technologies, API programming, UI development, SQL, Databases, Virtualization, Computer Networks, Hard Real-time Systems, Project management. Application developer and Software Engineer with strong skills and conceptual knowledge. \n \nSeeking for an internship/full-time position in an organization, specifically focusing on web/software development. Specialties:Object Oriented Analysis and Design, MVC, Design Patterns, Software Architecture, SDLCs, Agile/Scrum, Agile/XP, UML Modeling, Database Optimization/ Normalization, J2EE technology, Spring framework, Google Technologies, API programming, UI development, SQL, Databases, Virtualization, Computer Networks, Hard Real-time Systems, Project management. Application developer and Software Engineer with strong skills and conceptual knowledge. \n \nSeeking for an internship/full-time position in an organization, specifically focusing on web/software development. Specialties:Object Oriented Analysis and Design, MVC, Design Patterns, Software Architecture, SDLCs, Agile/Scrum, Agile/XP, UML Modeling, Database Optimization/ Normalization, J2EE technology, Spring framework, Google Technologies, API programming, UI development, SQL, Databases, Virtualization, Computer Networks, Hard Real-time Systems, Project management. Experience Technical Yahoo Yahoo September 2014  – Present (1 year) United States Building nextgen Fantasy Sports experiences.. Technical Yahoo - Software Engineer Yahoo! January 2012  – Present (3 years 8 months) San Francisco Bay Area Technical Yahoo - Intern Yahoo! June 2011  –  December 2011  (7 months) Santa Clara Developed a dashboard project for Premium Services Infrastructure Team at Yahoo! using Sherpa (Yahoo! cloud service for Database management), YQL and Cocktails framework. Software Development Manager Thrive Research Inc April 2011  –  June 2011  (3 months) Responsible for leading the team of developers in Engineering department. Report directly to the CEO of the company. Create business processes, delegate responsibilities amongst the engineers with agreement of the CEO. Coordinate product development.  \n \nOther responsibilities - Risk identification and mitigation, Scheduling, Framework and Architecture designing, coding with J2EE, hybernate, Ajax, MySql, Appfuse. Student Programmer Santa Clara University July 2010  –  June 2011  (1 year) Developed a web based software for the Associate Dean of School of Engineering to analyze a huge student related database to study different parameters and factors which lead to successful career path in Engineering.  \n \nTechnologies used - JSP, Spring 3.0, Jasper Reports, Open-flash-charts, Servlets, MS-ACCESS, DWR, HTML, CSS. \n \nThe tool provides intelligent information from the historical stored data and surveys. For example the results that help the Associate Dean to identify the academic preparation and motivational factors that contribute to student success in engineering, impact of factors such as community-based \nprojects, active learning approach, demographic factors, student preparation on their retention in the program. Tech Support Administrator University of Georgia January 2010  –  July 2010  (7 months) Assist students, faculties and staff members of School of Social Work at University of Georgia in their technology needs. \n \nDeveloped a Web-based Faculty-Course evaluation tool.  \n(JSP, EJB, Servlets, Snap Survey, MySQL, HTML, CSS) \n(http://micky073.myweb.uga.edu/Survey/ssw_evaluation.htm)  \n \nWorked on development and modification of Plone theme (Banjo, Deliverance-proxy, Python, XML, Plone, Zope) (Major contribution in editing portlets, setting up Banjo and Deliverance proxy, writing the transformation rules, and applying the transformations)( http://ssw.uga.edu/) \n \nDid the requirements elicitation for virtualizing (Server, Desktop, Data & Network Virtualization) the School’s existing network. Based on my analysis, designed the solution and \nworked with the vendor (Systems Alliance) to implement it efficiently. (VMware VIEW 4.0) \n \nIdentified and implemented different security measures for the information systems and servers. (Major contribution in implementing SSH, preventing DOS attack, Spam bots, Web Robots, SQL injections, Java Script injections and Man- in-the-Middle attacks such as ARP spoofing, port spoofing, ping floods, SYN flood attacks, MAC address filtering etc.) \n \nWorked on the development, testing and deployment phases of Web-based Field Education Application. (PHP, MySQL, MVC architecture, CSS, JavaScript, JUnit) Student Programmer University of Georgia June 2009  –  December 2009  (7 months) Developed a web based application using C# with .Net framework to generate different sorts of reports (flash charts and flash maps) for the analysis purpose for the dean of School of Agricultural and Environmental Sciences at University of Georgia. Research Assitant University of Georgia July 2008  –  December 2009  (1 year 6 months) Perform research in the area of Hard Real -Time Systems scheduling.  \n \nWorked under my professor to develop a simulator for an optimal real-time scheduling algorithm named LLREF (Largest Local Remaining Execution time First) for Identical and Universal multi-processing platforms. \n \nAlso modify the algorithm to check its optimality for the Dynamically Voltage Scalable Multi-processing system. Teaching Assistant University of Georgia July 2008  –  December 2008  (6 months) Assisted my graduate advisor for the graduate level course of Computer Architecture. Software Engineer Intern Idea Cellular Ltd January 2008  –  June 2008  (6 months) Develop a software based application for the automation of business processes at Idea Cellular.  \n \nProject named \"Paperless !dea\" was a product which enabled employees of different departments of Idea Cellular Limited to communicate and access different services on web which was previously done using paper forms and applications. \n \nIT department was governed by IBM, so coordinated development work with IBM employees. Technical Yahoo Yahoo September 2014  – Present (1 year) United States Building nextgen Fantasy Sports experiences.. Technical Yahoo Yahoo September 2014  – Present (1 year) United States Building nextgen Fantasy Sports experiences.. Technical Yahoo - Software Engineer Yahoo! January 2012  – Present (3 years 8 months) San Francisco Bay Area Technical Yahoo - Software Engineer Yahoo! January 2012  – Present (3 years 8 months) San Francisco Bay Area Technical Yahoo - Intern Yahoo! June 2011  –  December 2011  (7 months) Santa Clara Developed a dashboard project for Premium Services Infrastructure Team at Yahoo! using Sherpa (Yahoo! cloud service for Database management), YQL and Cocktails framework. Technical Yahoo - Intern Yahoo! June 2011  –  December 2011  (7 months) Santa Clara Developed a dashboard project for Premium Services Infrastructure Team at Yahoo! using Sherpa (Yahoo! cloud service for Database management), YQL and Cocktails framework. Software Development Manager Thrive Research Inc April 2011  –  June 2011  (3 months) Responsible for leading the team of developers in Engineering department. Report directly to the CEO of the company. Create business processes, delegate responsibilities amongst the engineers with agreement of the CEO. Coordinate product development.  \n \nOther responsibilities - Risk identification and mitigation, Scheduling, Framework and Architecture designing, coding with J2EE, hybernate, Ajax, MySql, Appfuse. Software Development Manager Thrive Research Inc April 2011  –  June 2011  (3 months) Responsible for leading the team of developers in Engineering department. Report directly to the CEO of the company. Create business processes, delegate responsibilities amongst the engineers with agreement of the CEO. Coordinate product development.  \n \nOther responsibilities - Risk identification and mitigation, Scheduling, Framework and Architecture designing, coding with J2EE, hybernate, Ajax, MySql, Appfuse. Student Programmer Santa Clara University July 2010  –  June 2011  (1 year) Developed a web based software for the Associate Dean of School of Engineering to analyze a huge student related database to study different parameters and factors which lead to successful career path in Engineering.  \n \nTechnologies used - JSP, Spring 3.0, Jasper Reports, Open-flash-charts, Servlets, MS-ACCESS, DWR, HTML, CSS. \n \nThe tool provides intelligent information from the historical stored data and surveys. For example the results that help the Associate Dean to identify the academic preparation and motivational factors that contribute to student success in engineering, impact of factors such as community-based \nprojects, active learning approach, demographic factors, student preparation on their retention in the program. Student Programmer Santa Clara University July 2010  –  June 2011  (1 year) Developed a web based software for the Associate Dean of School of Engineering to analyze a huge student related database to study different parameters and factors which lead to successful career path in Engineering.  \n \nTechnologies used - JSP, Spring 3.0, Jasper Reports, Open-flash-charts, Servlets, MS-ACCESS, DWR, HTML, CSS. \n \nThe tool provides intelligent information from the historical stored data and surveys. For example the results that help the Associate Dean to identify the academic preparation and motivational factors that contribute to student success in engineering, impact of factors such as community-based \nprojects, active learning approach, demographic factors, student preparation on their retention in the program. Tech Support Administrator University of Georgia January 2010  –  July 2010  (7 months) Assist students, faculties and staff members of School of Social Work at University of Georgia in their technology needs. \n \nDeveloped a Web-based Faculty-Course evaluation tool.  \n(JSP, EJB, Servlets, Snap Survey, MySQL, HTML, CSS) \n(http://micky073.myweb.uga.edu/Survey/ssw_evaluation.htm)  \n \nWorked on development and modification of Plone theme (Banjo, Deliverance-proxy, Python, XML, Plone, Zope) (Major contribution in editing portlets, setting up Banjo and Deliverance proxy, writing the transformation rules, and applying the transformations)( http://ssw.uga.edu/) \n \nDid the requirements elicitation for virtualizing (Server, Desktop, Data & Network Virtualization) the School’s existing network. Based on my analysis, designed the solution and \nworked with the vendor (Systems Alliance) to implement it efficiently. (VMware VIEW 4.0) \n \nIdentified and implemented different security measures for the information systems and servers. (Major contribution in implementing SSH, preventing DOS attack, Spam bots, Web Robots, SQL injections, Java Script injections and Man- in-the-Middle attacks such as ARP spoofing, port spoofing, ping floods, SYN flood attacks, MAC address filtering etc.) \n \nWorked on the development, testing and deployment phases of Web-based Field Education Application. (PHP, MySQL, MVC architecture, CSS, JavaScript, JUnit) Tech Support Administrator University of Georgia January 2010  –  July 2010  (7 months) Assist students, faculties and staff members of School of Social Work at University of Georgia in their technology needs. \n \nDeveloped a Web-based Faculty-Course evaluation tool.  \n(JSP, EJB, Servlets, Snap Survey, MySQL, HTML, CSS) \n(http://micky073.myweb.uga.edu/Survey/ssw_evaluation.htm)  \n \nWorked on development and modification of Plone theme (Banjo, Deliverance-proxy, Python, XML, Plone, Zope) (Major contribution in editing portlets, setting up Banjo and Deliverance proxy, writing the transformation rules, and applying the transformations)( http://ssw.uga.edu/) \n \nDid the requirements elicitation for virtualizing (Server, Desktop, Data & Network Virtualization) the School’s existing network. Based on my analysis, designed the solution and \nworked with the vendor (Systems Alliance) to implement it efficiently. (VMware VIEW 4.0) \n \nIdentified and implemented different security measures for the information systems and servers. (Major contribution in implementing SSH, preventing DOS attack, Spam bots, Web Robots, SQL injections, Java Script injections and Man- in-the-Middle attacks such as ARP spoofing, port spoofing, ping floods, SYN flood attacks, MAC address filtering etc.) \n \nWorked on the development, testing and deployment phases of Web-based Field Education Application. (PHP, MySQL, MVC architecture, CSS, JavaScript, JUnit) Student Programmer University of Georgia June 2009  –  December 2009  (7 months) Developed a web based application using C# with .Net framework to generate different sorts of reports (flash charts and flash maps) for the analysis purpose for the dean of School of Agricultural and Environmental Sciences at University of Georgia. Student Programmer University of Georgia June 2009  –  December 2009  (7 months) Developed a web based application using C# with .Net framework to generate different sorts of reports (flash charts and flash maps) for the analysis purpose for the dean of School of Agricultural and Environmental Sciences at University of Georgia. Research Assitant University of Georgia July 2008  –  December 2009  (1 year 6 months) Perform research in the area of Hard Real -Time Systems scheduling.  \n \nWorked under my professor to develop a simulator for an optimal real-time scheduling algorithm named LLREF (Largest Local Remaining Execution time First) for Identical and Universal multi-processing platforms. \n \nAlso modify the algorithm to check its optimality for the Dynamically Voltage Scalable Multi-processing system. Research Assitant University of Georgia July 2008  –  December 2009  (1 year 6 months) Perform research in the area of Hard Real -Time Systems scheduling.  \n \nWorked under my professor to develop a simulator for an optimal real-time scheduling algorithm named LLREF (Largest Local Remaining Execution time First) for Identical and Universal multi-processing platforms. \n \nAlso modify the algorithm to check its optimality for the Dynamically Voltage Scalable Multi-processing system. Teaching Assistant University of Georgia July 2008  –  December 2008  (6 months) Assisted my graduate advisor for the graduate level course of Computer Architecture. Teaching Assistant University of Georgia July 2008  –  December 2008  (6 months) Assisted my graduate advisor for the graduate level course of Computer Architecture. Software Engineer Intern Idea Cellular Ltd January 2008  –  June 2008  (6 months) Develop a software based application for the automation of business processes at Idea Cellular.  \n \nProject named \"Paperless !dea\" was a product which enabled employees of different departments of Idea Cellular Limited to communicate and access different services on web which was previously done using paper forms and applications. \n \nIT department was governed by IBM, so coordinated development work with IBM employees. Software Engineer Intern Idea Cellular Ltd January 2008  –  June 2008  (6 months) Develop a software based application for the automation of business processes at Idea Cellular.  \n \nProject named \"Paperless !dea\" was a product which enabled employees of different departments of Idea Cellular Limited to communicate and access different services on web which was previously done using paper forms and applications. \n \nIT department was governed by IBM, so coordinated development work with IBM employees. Skills SQL XML Agile Methodologies MySQL jQuery JavaScript SDLC JSP Skills  SQL XML Agile Methodologies MySQL jQuery JavaScript SDLC JSP SQL XML Agile Methodologies MySQL jQuery JavaScript SDLC JSP SQL XML Agile Methodologies MySQL jQuery JavaScript SDLC JSP Education Santa Clara University Master of Science,  Software Engineering 2010  – 2011 Transferred some of my course work from University of Georgia. Took a transfer to specialize my computer science background in to Software Engineering The University of Georgia Master of Science,  Computer Science 2008  – 2010 Did some of my graduate course work at Department of Computer Science at University of Georgia. Nirma University Bachelore of Technology,  Informtion Technology 2004  – 2008 Santa Clara University Master of Science,  Software Engineering 2010  – 2011 Transferred some of my course work from University of Georgia. Took a transfer to specialize my computer science background in to Software Engineering Santa Clara University Master of Science,  Software Engineering 2010  – 2011 Transferred some of my course work from University of Georgia. Took a transfer to specialize my computer science background in to Software Engineering Santa Clara University Master of Science,  Software Engineering 2010  – 2011 Transferred some of my course work from University of Georgia. Took a transfer to specialize my computer science background in to Software Engineering The University of Georgia Master of Science,  Computer Science 2008  – 2010 Did some of my graduate course work at Department of Computer Science at University of Georgia. The University of Georgia Master of Science,  Computer Science 2008  – 2010 Did some of my graduate course work at Department of Computer Science at University of Georgia. The University of Georgia Master of Science,  Computer Science 2008  – 2010 Did some of my graduate course work at Department of Computer Science at University of Georgia. Nirma University Bachelore of Technology,  Informtion Technology 2004  – 2008 Nirma University Bachelore of Technology,  Informtion Technology 2004  – 2008 Nirma University Bachelore of Technology,  Informtion Technology 2004  – 2008 "]}