{"position": "Technical Trainer", "company": "Google", "profiles": ["Summary HIGHLIGHTS \nCreated documentation and training for document review process and case management on 3rd party application Relativity \n \nCreated Concordance Paralegal Certification Program for national law firm in order to standardize technical skill set and perform tasks more efficiently, therefore saving the firm time and money \n \nProvided new hire orientation and technology training to support staff, managers and attorneys \n \nProvided firm training for new Electronic Expense Reporting Application, and VOIP Phone Systems \n \nPrepared presentations and voice recordings for several e-brief tutorials using Adobe Captivate \n \nTested software upgrades for current legal applications \n \nProvided user support remotely as well as at user's desktop on firm-wide applications \n \nSPECIALTIES \nOver 12 years experience as a Technical Trainer and Litigation Support Professional. \n \nAcquired advanced training in Litigation/Trial Support applications such as Concordance, CaseMap, Summation, LiveNote, TrialDirector/Sanction, and IPRO.  \n \nExperienced in a variety of 3rd party document review platforms such as Relativity.  \n \nVersatile and tenacious technology troubleshooter. \n \nPatient with the \"technology shy\". Summary HIGHLIGHTS \nCreated documentation and training for document review process and case management on 3rd party application Relativity \n \nCreated Concordance Paralegal Certification Program for national law firm in order to standardize technical skill set and perform tasks more efficiently, therefore saving the firm time and money \n \nProvided new hire orientation and technology training to support staff, managers and attorneys \n \nProvided firm training for new Electronic Expense Reporting Application, and VOIP Phone Systems \n \nPrepared presentations and voice recordings for several e-brief tutorials using Adobe Captivate \n \nTested software upgrades for current legal applications \n \nProvided user support remotely as well as at user's desktop on firm-wide applications \n \nSPECIALTIES \nOver 12 years experience as a Technical Trainer and Litigation Support Professional. \n \nAcquired advanced training in Litigation/Trial Support applications such as Concordance, CaseMap, Summation, LiveNote, TrialDirector/Sanction, and IPRO.  \n \nExperienced in a variety of 3rd party document review platforms such as Relativity.  \n \nVersatile and tenacious technology troubleshooter. \n \nPatient with the \"technology shy\". HIGHLIGHTS \nCreated documentation and training for document review process and case management on 3rd party application Relativity \n \nCreated Concordance Paralegal Certification Program for national law firm in order to standardize technical skill set and perform tasks more efficiently, therefore saving the firm time and money \n \nProvided new hire orientation and technology training to support staff, managers and attorneys \n \nProvided firm training for new Electronic Expense Reporting Application, and VOIP Phone Systems \n \nPrepared presentations and voice recordings for several e-brief tutorials using Adobe Captivate \n \nTested software upgrades for current legal applications \n \nProvided user support remotely as well as at user's desktop on firm-wide applications \n \nSPECIALTIES \nOver 12 years experience as a Technical Trainer and Litigation Support Professional. \n \nAcquired advanced training in Litigation/Trial Support applications such as Concordance, CaseMap, Summation, LiveNote, TrialDirector/Sanction, and IPRO.  \n \nExperienced in a variety of 3rd party document review platforms such as Relativity.  \n \nVersatile and tenacious technology troubleshooter. \n \nPatient with the \"technology shy\". HIGHLIGHTS \nCreated documentation and training for document review process and case management on 3rd party application Relativity \n \nCreated Concordance Paralegal Certification Program for national law firm in order to standardize technical skill set and perform tasks more efficiently, therefore saving the firm time and money \n \nProvided new hire orientation and technology training to support staff, managers and attorneys \n \nProvided firm training for new Electronic Expense Reporting Application, and VOIP Phone Systems \n \nPrepared presentations and voice recordings for several e-brief tutorials using Adobe Captivate \n \nTested software upgrades for current legal applications \n \nProvided user support remotely as well as at user's desktop on firm-wide applications \n \nSPECIALTIES \nOver 12 years experience as a Technical Trainer and Litigation Support Professional. \n \nAcquired advanced training in Litigation/Trial Support applications such as Concordance, CaseMap, Summation, LiveNote, TrialDirector/Sanction, and IPRO.  \n \nExperienced in a variety of 3rd party document review platforms such as Relativity.  \n \nVersatile and tenacious technology troubleshooter. \n \nPatient with the \"technology shy\". Experience Trainer Vedder Price P.C. September 2013  – Present (2 years) Greater Chicago Area Training Specialist Barnes & Thornburg LLP March 2010  –  September 2013  (3 years 7 months) Litigation Support Analyst Sidley Austin November 2008  –  October 2009  (1 year) Technical Trainer/Lit Support Specialist Schiff Hardin LLP September 2005  –  November 2008  (3 years 3 months) Lit Support Analyst - Contractor for Sidley Austin Williams Lea September 2003  –  September 2005  (2 years 1 month) Litigation Support Assistant Adecco June 2003  –  September 2003  (4 months) Lit Support/Technical Writer and Trainer CACI August 2001  –  May 2003  (1 year 10 months) Library Specialist/Trainer Spiegel and McDiarmid 1999  –  2001  (2 years) Washington D.C. Metro Area Library Assistant/Internet Trainer Sughrue Mion PLLC 1998  –  1999  (1 year) Washington D.C. Metro Area Library Assistant Howrey LLP 1995  –  1998  (3 years) Washington D.C. Metro Area Trainer Vedder Price P.C. September 2013  – Present (2 years) Greater Chicago Area Trainer Vedder Price P.C. September 2013  – Present (2 years) Greater Chicago Area Training Specialist Barnes & Thornburg LLP March 2010  –  September 2013  (3 years 7 months) Training Specialist Barnes & Thornburg LLP March 2010  –  September 2013  (3 years 7 months) Litigation Support Analyst Sidley Austin November 2008  –  October 2009  (1 year) Litigation Support Analyst Sidley Austin November 2008  –  October 2009  (1 year) Technical Trainer/Lit Support Specialist Schiff Hardin LLP September 2005  –  November 2008  (3 years 3 months) Technical Trainer/Lit Support Specialist Schiff Hardin LLP September 2005  –  November 2008  (3 years 3 months) Lit Support Analyst - Contractor for Sidley Austin Williams Lea September 2003  –  September 2005  (2 years 1 month) Lit Support Analyst - Contractor for Sidley Austin Williams Lea September 2003  –  September 2005  (2 years 1 month) Litigation Support Assistant Adecco June 2003  –  September 2003  (4 months) Litigation Support Assistant Adecco June 2003  –  September 2003  (4 months) Lit Support/Technical Writer and Trainer CACI August 2001  –  May 2003  (1 year 10 months) Lit Support/Technical Writer and Trainer CACI August 2001  –  May 2003  (1 year 10 months) Library Specialist/Trainer Spiegel and McDiarmid 1999  –  2001  (2 years) Washington D.C. Metro Area Library Specialist/Trainer Spiegel and McDiarmid 1999  –  2001  (2 years) Washington D.C. Metro Area Library Assistant/Internet Trainer Sughrue Mion PLLC 1998  –  1999  (1 year) Washington D.C. Metro Area Library Assistant/Internet Trainer Sughrue Mion PLLC 1998  –  1999  (1 year) Washington D.C. Metro Area Library Assistant Howrey LLP 1995  –  1998  (3 years) Washington D.C. Metro Area Library Assistant Howrey LLP 1995  –  1998  (3 years) Washington D.C. Metro Area Skills IPRO LiveNote Sanction Litigation Support CaseMap Training Autonomy iManage Microsoft Office Intranet CT Summation Legal Research Skills Mobile Devices Mobile Applications Windows 7 Document Management Legal Research Trials Document Review Relativity Litigation Legal Writing Software Documentation Courts Management Arbitration Intellectual Property Mediation See 12+     See less Skills  IPRO LiveNote Sanction Litigation Support CaseMap Training Autonomy iManage Microsoft Office Intranet CT Summation Legal Research Skills Mobile Devices Mobile Applications Windows 7 Document Management Legal Research Trials Document Review Relativity Litigation Legal Writing Software Documentation Courts Management Arbitration Intellectual Property Mediation See 12+     See less IPRO LiveNote Sanction Litigation Support CaseMap Training Autonomy iManage Microsoft Office Intranet CT Summation Legal Research Skills Mobile Devices Mobile Applications Windows 7 Document Management Legal Research Trials Document Review Relativity Litigation Legal Writing Software Documentation Courts Management Arbitration Intellectual Property Mediation See 12+     See less IPRO LiveNote Sanction Litigation Support CaseMap Training Autonomy iManage Microsoft Office Intranet CT Summation Legal Research Skills Mobile Devices Mobile Applications Windows 7 Document Management Legal Research Trials Document Review Relativity Litigation Legal Writing Software Documentation Courts Management Arbitration Intellectual Property Mediation See 12+     See less Education University of Illinois at Chicago Bachelor of Arts in Liberal Arts and Sciences,  Communications 1988  – 1992 University of Illinois at Chicago Bachelor of Arts in Liberal Arts and Sciences,  Communications 1988  – 1992 University of Illinois at Chicago Bachelor of Arts in Liberal Arts and Sciences,  Communications 1988  – 1992 University of Illinois at Chicago Bachelor of Arts in Liberal Arts and Sciences,  Communications 1988  – 1992 ", "Summary Technology Training and Support Specialist with over 15 years of solid experience specializing in legal technical training for mid to large-size firms. Highly productive in a fast-paced environment by providing targeted training in various settings. Exceptional ability to communicate technical information to diverse audiences. Provide training on legal applications and Microsoft Office Suite. Effective at working independently, taking initiative and setting priorities to meet the business needs. Specialties:Legal Technical Trainer, Help Desk Support Summary Technology Training and Support Specialist with over 15 years of solid experience specializing in legal technical training for mid to large-size firms. Highly productive in a fast-paced environment by providing targeted training in various settings. Exceptional ability to communicate technical information to diverse audiences. Provide training on legal applications and Microsoft Office Suite. Effective at working independently, taking initiative and setting priorities to meet the business needs. Specialties:Legal Technical Trainer, Help Desk Support Technology Training and Support Specialist with over 15 years of solid experience specializing in legal technical training for mid to large-size firms. Highly productive in a fast-paced environment by providing targeted training in various settings. Exceptional ability to communicate technical information to diverse audiences. Provide training on legal applications and Microsoft Office Suite. Effective at working independently, taking initiative and setting priorities to meet the business needs. Specialties:Legal Technical Trainer, Help Desk Support Technology Training and Support Specialist with over 15 years of solid experience specializing in legal technical training for mid to large-size firms. Highly productive in a fast-paced environment by providing targeted training in various settings. Exceptional ability to communicate technical information to diverse audiences. Provide training on legal applications and Microsoft Office Suite. Effective at working independently, taking initiative and setting priorities to meet the business needs. Specialties:Legal Technical Trainer, Help Desk Support Experience Technical Trainer II Howrey LLP 1999  –  2010  (11 years) Provided training and support to over 100 end-users including new employee orientation, VoIP training, new software/updates, and project-based training for attorneys, management and support staff in Los Angeles, Irvine, San Francisco, and Menlo Park offices. Evaluated monthly training courses to meet business needs. Scheduled classes, created training documentation, quick reference guides and learning aids. MIS Training Specialist Loeb & Loeb LLP 1986  –  1999  (13 years) Provided training for attorneys, secretaries, word processors and support staff on all firm-approved software applications. Prepared documentation and training materials. Assisted the word processors with formatting complex documents. Technical Trainer II Howrey LLP 1999  –  2010  (11 years) Provided training and support to over 100 end-users including new employee orientation, VoIP training, new software/updates, and project-based training for attorneys, management and support staff in Los Angeles, Irvine, San Francisco, and Menlo Park offices. Evaluated monthly training courses to meet business needs. Scheduled classes, created training documentation, quick reference guides and learning aids. Technical Trainer II Howrey LLP 1999  –  2010  (11 years) Provided training and support to over 100 end-users including new employee orientation, VoIP training, new software/updates, and project-based training for attorneys, management and support staff in Los Angeles, Irvine, San Francisco, and Menlo Park offices. Evaluated monthly training courses to meet business needs. Scheduled classes, created training documentation, quick reference guides and learning aids. MIS Training Specialist Loeb & Loeb LLP 1986  –  1999  (13 years) Provided training for attorneys, secretaries, word processors and support staff on all firm-approved software applications. Prepared documentation and training materials. Assisted the word processors with formatting complex documents. MIS Training Specialist Loeb & Loeb LLP 1986  –  1999  (13 years) Provided training for attorneys, secretaries, word processors and support staff on all firm-approved software applications. Prepared documentation and training materials. Assisted the word processors with formatting complex documents. Skills Microsoft Office CompareRite Concordance DeltaView DocXchange/DocXtools eFax FullAuthority GroupWise iManage Humminbird Interwoven Kronos LegalKey LiveNote Lotus Notes SAP/BRE SharePoint 2007 US Court Forms VoIP VPN WebEx See 6+     See less Skills  Microsoft Office CompareRite Concordance DeltaView DocXchange/DocXtools eFax FullAuthority GroupWise iManage Humminbird Interwoven Kronos LegalKey LiveNote Lotus Notes SAP/BRE SharePoint 2007 US Court Forms VoIP VPN WebEx See 6+     See less Microsoft Office CompareRite Concordance DeltaView DocXchange/DocXtools eFax FullAuthority GroupWise iManage Humminbird Interwoven Kronos LegalKey LiveNote Lotus Notes SAP/BRE SharePoint 2007 US Court Forms VoIP VPN WebEx See 6+     See less Microsoft Office CompareRite Concordance DeltaView DocXchange/DocXtools eFax FullAuthority GroupWise iManage Humminbird Interwoven Kronos LegalKey LiveNote Lotus Notes SAP/BRE SharePoint 2007 US Court Forms VoIP VPN WebEx See 6+     See less ", "Experience Technical Trainer Howrey LLP Technical Trainer Howrey LLP Technical Trainer Howrey LLP ", "Experience Technical Trainer Howrey LLP Technical Trainer Howrey LLP Technical Trainer Howrey LLP ", "Experience Business Solutions Consultant Axios Systems 2015  – Present (less than a year) Munich Area, Germany IT Manager Germany fieldfisher March 2011  –  December 2014  (3 years 10 months) München •\tIT Manager für die drei deutschen Standorte mit Budget und Personalverantwortung, sowie Bestell- und Inventarverantwortung \n•\tMitglied der IT Management Gruppe, des Change Management Boards sowie des Emergency Response Teams \n•\tInformation Security Officer für Deutschland (verantwortlich für die Anpassung und Einführung der IS Prozesse, basierend auf ISO 27001, in Deutschland) \n•\tIT Trainer für die deutschen Standorte (inklusive Nortel VoIP, Abrechnungssoftware, FileSite, Microsoft Office und Schulung neuer Mitarbeiter) \n•\tAdministrator für die deutschen Standorte (verantwortlich für die Netzwerk Infrastruktur (inklusive VPN) und die Server (Active Directory, Exchange, Print, WinScribe, SCCM, Altiris, Blackberry Enterprise und RSA)) \n•\tIT Projektleiter für die Eingliederung der gesamten IT der deutschen Büros von Howrey LLP zu Field Fisher Waterhouse LLP \n•\tIT Projekteiter für die Eingliederung der IT des Hamburger Standortes  \n•\tVerantwortlich für das Transition Management von Microsoft SCCM, Windows 7 und Office 2010 und Lync als Telefonie Lösung in Deutschland \n•\tProjektleiter für Ausarbeitung und Einführung des Incident Management Prozesses (basierend auf ITIL) European Technical Trainer and Support Officer Howrey LLP October 2007  –  February 2011  (3 years 5 months) •\tEuropäischer IT Trainer (Schulung sämtlicher Mitarbeiter in Europa, sowohl vor Ort als auch per Webinar, in Microsoft Office, SAP, Cisco VoIP, FileSite, DTE, New Joiner Training uvm.) \n•\tIT Administrator für München (verantwortlich für alle Server (Active Directory, Print, Backups und Lotus Notes) sowie für die IT Infrastruktur, inklusive Klimatisierung und Notstromaggregat) \n•\tBackup für das Europäische Netzwerk Team (verantwortlich für Server Wartung und Software Aktualisierung) \n•\tRecords Manager für München (Implementierung und Schulung einer elektronischen Akten Archivierung) \n•\tProjektleitung für die Implementierung von SharePoint in Europa, sowie weltweit verantwortlich für die Schulung aller Mitarbeiter (inklusive Vorstand)  \n•\tMitglied des Projektteams sowie verantwortlich für die Schulung aller Mitarbeiter in Europa im Rahmen der Einführung von SAP R/3 \n•\tMitglied des Projektteams zur Implementierung von Cisco VoIP in Madrid Technical Support Specialist Kirkland & Ellis LLP October 2006  –  September 2007  (1 year) •\tVerantwortlich für die Betreuung der IT am Standort München sowie dem Konferenzbüro in Frankfurt \n•\tAdministrator des Galaxy Backup Systems, Blackberry Enterprise Server und des Lotus Notes Servers, Siemens HiPath 4000 \n•\tVerantwortlich für die Bestellung und das Inventarmanagement des gesamten IT Bestandes \n•\tIT Schulung aller Mitarbeiter \n•\tProjektleitung für die Hardwareaktualisierung aller 50 Nutzer sowie die gleichzeitige Einführung von Windows XP und Office 2003 Consultant Pentland Firth January 2006  –  August 2006  (8 months) München •\tAnalyse der Kundenbedürfnisse, sowie die darauf basierende Erarbeitung der Konzepte für den Kunden \n•\tErstellen und interne Vorführung sowie Besprechung von Kundenpräsentationen \n•\tEinführung und Pflege einer betriebsinternen Wikipedia Enterprise Support Apple Computers International November 2003  –  February 2006  (2 years 4 months) Enterprise Support Europe Januar 2005 – Dezember 2005 \n \n•\tUnterstützung von Apple Partnern und Großkunden in Europa bezgl. Server Soft- und Hardware (XServe, XRaid, OS X Server, XSAN) \n•\tUnterstützung aller Kunden in Europa im Bereich Multimedia Software (z.B. Final Cut Pro, DVD Studio Pro, Logic Pro, Shake und Motion) \n•\tMitglied der weltweiten Multimedia und Server Hit Squads \n•\tZertifiziert als Apple System Administrator und Apple Certified Final Cut Pro Professional in Advanced Editing und Finishing \n \nTier 2 (Specialty Support) Dezember 2003 – Dezember 2004 \n \n•\tUnterstützung von Apple Partnern und Resellern in Europa  \n•\tUnterstützung aller Kunden in Europa in den Bereichen Server Soft- und Hardware sowie Multimedia Software \n•\tMitglied der weltweiten Multimedia und Server Hit Squads \n•\tMitglied des weltweiten Mac OS X Champion Teams \n \nTier 1 Support November 2003 – Dezember 2003 \n \n•\tUnterstützung aller Kunden in Europa in den Bereichen Mac OS X und OS 9, Hardware und Multimedia Software, sowie iPod \n•\tMitglied des weltweiten Mac OS X Champion Teams Business Solutions Consultant Axios Systems 2015  – Present (less than a year) Munich Area, Germany Business Solutions Consultant Axios Systems 2015  – Present (less than a year) Munich Area, Germany IT Manager Germany fieldfisher March 2011  –  December 2014  (3 years 10 months) München •\tIT Manager für die drei deutschen Standorte mit Budget und Personalverantwortung, sowie Bestell- und Inventarverantwortung \n•\tMitglied der IT Management Gruppe, des Change Management Boards sowie des Emergency Response Teams \n•\tInformation Security Officer für Deutschland (verantwortlich für die Anpassung und Einführung der IS Prozesse, basierend auf ISO 27001, in Deutschland) \n•\tIT Trainer für die deutschen Standorte (inklusive Nortel VoIP, Abrechnungssoftware, FileSite, Microsoft Office und Schulung neuer Mitarbeiter) \n•\tAdministrator für die deutschen Standorte (verantwortlich für die Netzwerk Infrastruktur (inklusive VPN) und die Server (Active Directory, Exchange, Print, WinScribe, SCCM, Altiris, Blackberry Enterprise und RSA)) \n•\tIT Projektleiter für die Eingliederung der gesamten IT der deutschen Büros von Howrey LLP zu Field Fisher Waterhouse LLP \n•\tIT Projekteiter für die Eingliederung der IT des Hamburger Standortes  \n•\tVerantwortlich für das Transition Management von Microsoft SCCM, Windows 7 und Office 2010 und Lync als Telefonie Lösung in Deutschland \n•\tProjektleiter für Ausarbeitung und Einführung des Incident Management Prozesses (basierend auf ITIL) IT Manager Germany fieldfisher March 2011  –  December 2014  (3 years 10 months) München •\tIT Manager für die drei deutschen Standorte mit Budget und Personalverantwortung, sowie Bestell- und Inventarverantwortung \n•\tMitglied der IT Management Gruppe, des Change Management Boards sowie des Emergency Response Teams \n•\tInformation Security Officer für Deutschland (verantwortlich für die Anpassung und Einführung der IS Prozesse, basierend auf ISO 27001, in Deutschland) \n•\tIT Trainer für die deutschen Standorte (inklusive Nortel VoIP, Abrechnungssoftware, FileSite, Microsoft Office und Schulung neuer Mitarbeiter) \n•\tAdministrator für die deutschen Standorte (verantwortlich für die Netzwerk Infrastruktur (inklusive VPN) und die Server (Active Directory, Exchange, Print, WinScribe, SCCM, Altiris, Blackberry Enterprise und RSA)) \n•\tIT Projektleiter für die Eingliederung der gesamten IT der deutschen Büros von Howrey LLP zu Field Fisher Waterhouse LLP \n•\tIT Projekteiter für die Eingliederung der IT des Hamburger Standortes  \n•\tVerantwortlich für das Transition Management von Microsoft SCCM, Windows 7 und Office 2010 und Lync als Telefonie Lösung in Deutschland \n•\tProjektleiter für Ausarbeitung und Einführung des Incident Management Prozesses (basierend auf ITIL) European Technical Trainer and Support Officer Howrey LLP October 2007  –  February 2011  (3 years 5 months) •\tEuropäischer IT Trainer (Schulung sämtlicher Mitarbeiter in Europa, sowohl vor Ort als auch per Webinar, in Microsoft Office, SAP, Cisco VoIP, FileSite, DTE, New Joiner Training uvm.) \n•\tIT Administrator für München (verantwortlich für alle Server (Active Directory, Print, Backups und Lotus Notes) sowie für die IT Infrastruktur, inklusive Klimatisierung und Notstromaggregat) \n•\tBackup für das Europäische Netzwerk Team (verantwortlich für Server Wartung und Software Aktualisierung) \n•\tRecords Manager für München (Implementierung und Schulung einer elektronischen Akten Archivierung) \n•\tProjektleitung für die Implementierung von SharePoint in Europa, sowie weltweit verantwortlich für die Schulung aller Mitarbeiter (inklusive Vorstand)  \n•\tMitglied des Projektteams sowie verantwortlich für die Schulung aller Mitarbeiter in Europa im Rahmen der Einführung von SAP R/3 \n•\tMitglied des Projektteams zur Implementierung von Cisco VoIP in Madrid European Technical Trainer and Support Officer Howrey LLP October 2007  –  February 2011  (3 years 5 months) •\tEuropäischer IT Trainer (Schulung sämtlicher Mitarbeiter in Europa, sowohl vor Ort als auch per Webinar, in Microsoft Office, SAP, Cisco VoIP, FileSite, DTE, New Joiner Training uvm.) \n•\tIT Administrator für München (verantwortlich für alle Server (Active Directory, Print, Backups und Lotus Notes) sowie für die IT Infrastruktur, inklusive Klimatisierung und Notstromaggregat) \n•\tBackup für das Europäische Netzwerk Team (verantwortlich für Server Wartung und Software Aktualisierung) \n•\tRecords Manager für München (Implementierung und Schulung einer elektronischen Akten Archivierung) \n•\tProjektleitung für die Implementierung von SharePoint in Europa, sowie weltweit verantwortlich für die Schulung aller Mitarbeiter (inklusive Vorstand)  \n•\tMitglied des Projektteams sowie verantwortlich für die Schulung aller Mitarbeiter in Europa im Rahmen der Einführung von SAP R/3 \n•\tMitglied des Projektteams zur Implementierung von Cisco VoIP in Madrid Technical Support Specialist Kirkland & Ellis LLP October 2006  –  September 2007  (1 year) •\tVerantwortlich für die Betreuung der IT am Standort München sowie dem Konferenzbüro in Frankfurt \n•\tAdministrator des Galaxy Backup Systems, Blackberry Enterprise Server und des Lotus Notes Servers, Siemens HiPath 4000 \n•\tVerantwortlich für die Bestellung und das Inventarmanagement des gesamten IT Bestandes \n•\tIT Schulung aller Mitarbeiter \n•\tProjektleitung für die Hardwareaktualisierung aller 50 Nutzer sowie die gleichzeitige Einführung von Windows XP und Office 2003 Technical Support Specialist Kirkland & Ellis LLP October 2006  –  September 2007  (1 year) •\tVerantwortlich für die Betreuung der IT am Standort München sowie dem Konferenzbüro in Frankfurt \n•\tAdministrator des Galaxy Backup Systems, Blackberry Enterprise Server und des Lotus Notes Servers, Siemens HiPath 4000 \n•\tVerantwortlich für die Bestellung und das Inventarmanagement des gesamten IT Bestandes \n•\tIT Schulung aller Mitarbeiter \n•\tProjektleitung für die Hardwareaktualisierung aller 50 Nutzer sowie die gleichzeitige Einführung von Windows XP und Office 2003 Consultant Pentland Firth January 2006  –  August 2006  (8 months) München •\tAnalyse der Kundenbedürfnisse, sowie die darauf basierende Erarbeitung der Konzepte für den Kunden \n•\tErstellen und interne Vorführung sowie Besprechung von Kundenpräsentationen \n•\tEinführung und Pflege einer betriebsinternen Wikipedia Consultant Pentland Firth January 2006  –  August 2006  (8 months) München •\tAnalyse der Kundenbedürfnisse, sowie die darauf basierende Erarbeitung der Konzepte für den Kunden \n•\tErstellen und interne Vorführung sowie Besprechung von Kundenpräsentationen \n•\tEinführung und Pflege einer betriebsinternen Wikipedia Enterprise Support Apple Computers International November 2003  –  February 2006  (2 years 4 months) Enterprise Support Europe Januar 2005 – Dezember 2005 \n \n•\tUnterstützung von Apple Partnern und Großkunden in Europa bezgl. Server Soft- und Hardware (XServe, XRaid, OS X Server, XSAN) \n•\tUnterstützung aller Kunden in Europa im Bereich Multimedia Software (z.B. Final Cut Pro, DVD Studio Pro, Logic Pro, Shake und Motion) \n•\tMitglied der weltweiten Multimedia und Server Hit Squads \n•\tZertifiziert als Apple System Administrator und Apple Certified Final Cut Pro Professional in Advanced Editing und Finishing \n \nTier 2 (Specialty Support) Dezember 2003 – Dezember 2004 \n \n•\tUnterstützung von Apple Partnern und Resellern in Europa  \n•\tUnterstützung aller Kunden in Europa in den Bereichen Server Soft- und Hardware sowie Multimedia Software \n•\tMitglied der weltweiten Multimedia und Server Hit Squads \n•\tMitglied des weltweiten Mac OS X Champion Teams \n \nTier 1 Support November 2003 – Dezember 2003 \n \n•\tUnterstützung aller Kunden in Europa in den Bereichen Mac OS X und OS 9, Hardware und Multimedia Software, sowie iPod \n•\tMitglied des weltweiten Mac OS X Champion Teams Enterprise Support Apple Computers International November 2003  –  February 2006  (2 years 4 months) Enterprise Support Europe Januar 2005 – Dezember 2005 \n \n•\tUnterstützung von Apple Partnern und Großkunden in Europa bezgl. Server Soft- und Hardware (XServe, XRaid, OS X Server, XSAN) \n•\tUnterstützung aller Kunden in Europa im Bereich Multimedia Software (z.B. Final Cut Pro, DVD Studio Pro, Logic Pro, Shake und Motion) \n•\tMitglied der weltweiten Multimedia und Server Hit Squads \n•\tZertifiziert als Apple System Administrator und Apple Certified Final Cut Pro Professional in Advanced Editing und Finishing \n \nTier 2 (Specialty Support) Dezember 2003 – Dezember 2004 \n \n•\tUnterstützung von Apple Partnern und Resellern in Europa  \n•\tUnterstützung aller Kunden in Europa in den Bereichen Server Soft- und Hardware sowie Multimedia Software \n•\tMitglied der weltweiten Multimedia und Server Hit Squads \n•\tMitglied des weltweiten Mac OS X Champion Teams \n \nTier 1 Support November 2003 – Dezember 2003 \n \n•\tUnterstützung aller Kunden in Europa in den Bereichen Mac OS X und OS 9, Hardware und Multimedia Software, sowie iPod \n•\tMitglied des weltweiten Mac OS X Champion Teams Languages Deutsch Native or bilingual proficiency Englisch Full professional proficiency Französisch Elementary proficiency Spanisch Elementary proficiency Italienisch Elementary proficiency Deutsch Native or bilingual proficiency Englisch Full professional proficiency Französisch Elementary proficiency Spanisch Elementary proficiency Italienisch Elementary proficiency Deutsch Native or bilingual proficiency Englisch Full professional proficiency Französisch Elementary proficiency Spanisch Elementary proficiency Italienisch Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills Support Server Hardware OS X SharePoint Blackberry Enterprise... Rechnernetze SCCM SAP R/3 Skills  Support Server Hardware OS X SharePoint Blackberry Enterprise... Rechnernetze SCCM SAP R/3 Support Server Hardware OS X SharePoint Blackberry Enterprise... Rechnernetze SCCM SAP R/3 Support Server Hardware OS X SharePoint Blackberry Enterprise... Rechnernetze SCCM SAP R/3 Education Universität Regensburg Jura 1998  – 2003 Golden Gate University Political Science 1995  – 1996 Activities and Societies:  Student Government ,  Student Newspaper ,  Soccer Team Universität Regensburg Jura 1998  – 2003 Universität Regensburg Jura 1998  – 2003 Universität Regensburg Jura 1998  – 2003 Golden Gate University Political Science 1995  – 1996 Activities and Societies:  Student Government ,  Student Newspaper ,  Soccer Team Golden Gate University Political Science 1995  – 1996 Activities and Societies:  Student Government ,  Student Newspaper ,  Soccer Team Golden Gate University Political Science 1995  – 1996 Activities and Societies:  Student Government ,  Student Newspaper ,  Soccer Team Honors & Awards Howrey Excellence Award CEO 2009 Award for outstanding contribution to the firm WoW Apple 2005 Award for outstanding performance Certificate of Merit Dean of University 1996 In recognition of outstanding academic performance Howrey Excellence Award CEO 2009 Award for outstanding contribution to the firm Howrey Excellence Award CEO 2009 Award for outstanding contribution to the firm Howrey Excellence Award CEO 2009 Award for outstanding contribution to the firm WoW Apple 2005 Award for outstanding performance WoW Apple 2005 Award for outstanding performance WoW Apple 2005 Award for outstanding performance Certificate of Merit Dean of University 1996 In recognition of outstanding academic performance Certificate of Merit Dean of University 1996 In recognition of outstanding academic performance Certificate of Merit Dean of University 1996 In recognition of outstanding academic performance ", "Summary Technical writer/training professional with ten years experience designing and implementing training materials and online courses. \n \n~ Proficient in use of ADDIE model in designing informative and engaging lessons \n~ Highly skilled in facilitating and delivering training to instructors and end-users \n~ Excellent verbal and written communication skills \n~ Insightful and quick to understand new software Summary Technical writer/training professional with ten years experience designing and implementing training materials and online courses. \n \n~ Proficient in use of ADDIE model in designing informative and engaging lessons \n~ Highly skilled in facilitating and delivering training to instructors and end-users \n~ Excellent verbal and written communication skills \n~ Insightful and quick to understand new software Technical writer/training professional with ten years experience designing and implementing training materials and online courses. \n \n~ Proficient in use of ADDIE model in designing informative and engaging lessons \n~ Highly skilled in facilitating and delivering training to instructors and end-users \n~ Excellent verbal and written communication skills \n~ Insightful and quick to understand new software Technical writer/training professional with ten years experience designing and implementing training materials and online courses. \n \n~ Proficient in use of ADDIE model in designing informative and engaging lessons \n~ Highly skilled in facilitating and delivering training to instructors and end-users \n~ Excellent verbal and written communication skills \n~ Insightful and quick to understand new software Experience Instructional Designer Consultant Cisco January 2014  – Present (1 year 8 months) Senior Technical Trainer Yahoo! May 2010  –  November 2013  (3 years 7 months) Manage all phases of instructional design and provide timely training documentation for internal customer service representatives in an agile environment. Responsible for development, compilation and production of training contents, including participant guides, instructor outlines, and presentation slides. \n \nDesign and maintain training content primarily for Account services policies and procedures, abuse moderation and the Flickr photo site by Yahoo \nDevelop online learning content using IBM Kenexa’s LCMS and Adobe Captivate \nSuccessfully and positively collaborate with subject matter experts, including engineers, product managers and quality specialists in the development, review and validation of training content \nLead train-the-trainer sessions for global instructors via Adobe Connect and WebEx webcasts \nCoach and mentor members of the development team  \nConduct content and editorial reviews, providing constructive feedback Technical Trainer Howrey LLP September 1995  –  February 2010  (14 years 6 months) a transnational law firm that focused on Antitrust, Global Litigation and Intellectual Property with over 1,400 attorneys and staff. My skills in instructional design and experience as a litigation secretary made me the 'go-to' person for new software implementations. As a technical trainer, my duties also included instructor led training and support of both Northern California offices and synchronous trainings for the global firm. \nInstructional Design \nDevelop and maintain training materials, including presentations, student guides, lab guides, instructor guides, and classroom support materials. \nTimely manage firm-wide training projects using the ADDIE model, often acting as subject matter expert. \nSuccessfully and positively collaborate with developers and subject matter experts ensuring highest quality training programs for new and updated applications. \nDesigned and implemented course evaluation system providing the training team and firm management with measurable feedback of course effectiveness and acceptance. \nDesign and create engaging eLearning courses utilizing Adobe Captivate and Articulate. \nTechnical Training and Support \nConduct technical new hire orientations and software training for office staff, attorneys and outside counsel via instructor led training and seminars in person and via WebEx.  \nProvided in person, hands-on training of high profile program to European offices. \nDeveloped and implemented curriculum plan providing targeted training and ensuring highest level of proficiency for litigation secretarial staff in Northern California. \nRecipient of STAR awards for Excellence and Agent of Change. \nSuccessfully managed design and implementation of orientations for two separate groups merged into local offices, personally instructing and supporting each group. \nManage firm's LCMS - subscriptions, resources, course uploads, scheduling. Litigation and Trademark Secretary Arnold, White & Durkee 1995  –  2000  (5 years) Manage active Federal and State litigation and trademark counseling practice for dynamic partner. Legal Secretary/Paralegal Nicholas Damer, Counsellor at Law February 1994  –  August 1995  (1 year 7 months) Manage all secretarial and reception duties for sole practitioner civil litigator. Various Customer Service Positions Great Western Bank August 1986  –  December 1993  (7 years 5 months) In branch and back office manager/supervisor; was progressively promoted from part-time teller to new account representative to supervisory positions. Tour Mechandising Clerk Universal Studios June 1981  –  July 1986  (5 years 2 months) Employed part-time in Tour Merchandise Department gaining work experience while attending school. Instructional Designer Consultant Cisco January 2014  – Present (1 year 8 months) Instructional Designer Consultant Cisco January 2014  – Present (1 year 8 months) Senior Technical Trainer Yahoo! May 2010  –  November 2013  (3 years 7 months) Manage all phases of instructional design and provide timely training documentation for internal customer service representatives in an agile environment. Responsible for development, compilation and production of training contents, including participant guides, instructor outlines, and presentation slides. \n \nDesign and maintain training content primarily for Account services policies and procedures, abuse moderation and the Flickr photo site by Yahoo \nDevelop online learning content using IBM Kenexa’s LCMS and Adobe Captivate \nSuccessfully and positively collaborate with subject matter experts, including engineers, product managers and quality specialists in the development, review and validation of training content \nLead train-the-trainer sessions for global instructors via Adobe Connect and WebEx webcasts \nCoach and mentor members of the development team  \nConduct content and editorial reviews, providing constructive feedback Senior Technical Trainer Yahoo! May 2010  –  November 2013  (3 years 7 months) Manage all phases of instructional design and provide timely training documentation for internal customer service representatives in an agile environment. Responsible for development, compilation and production of training contents, including participant guides, instructor outlines, and presentation slides. \n \nDesign and maintain training content primarily for Account services policies and procedures, abuse moderation and the Flickr photo site by Yahoo \nDevelop online learning content using IBM Kenexa’s LCMS and Adobe Captivate \nSuccessfully and positively collaborate with subject matter experts, including engineers, product managers and quality specialists in the development, review and validation of training content \nLead train-the-trainer sessions for global instructors via Adobe Connect and WebEx webcasts \nCoach and mentor members of the development team  \nConduct content and editorial reviews, providing constructive feedback Technical Trainer Howrey LLP September 1995  –  February 2010  (14 years 6 months) a transnational law firm that focused on Antitrust, Global Litigation and Intellectual Property with over 1,400 attorneys and staff. My skills in instructional design and experience as a litigation secretary made me the 'go-to' person for new software implementations. As a technical trainer, my duties also included instructor led training and support of both Northern California offices and synchronous trainings for the global firm. \nInstructional Design \nDevelop and maintain training materials, including presentations, student guides, lab guides, instructor guides, and classroom support materials. \nTimely manage firm-wide training projects using the ADDIE model, often acting as subject matter expert. \nSuccessfully and positively collaborate with developers and subject matter experts ensuring highest quality training programs for new and updated applications. \nDesigned and implemented course evaluation system providing the training team and firm management with measurable feedback of course effectiveness and acceptance. \nDesign and create engaging eLearning courses utilizing Adobe Captivate and Articulate. \nTechnical Training and Support \nConduct technical new hire orientations and software training for office staff, attorneys and outside counsel via instructor led training and seminars in person and via WebEx.  \nProvided in person, hands-on training of high profile program to European offices. \nDeveloped and implemented curriculum plan providing targeted training and ensuring highest level of proficiency for litigation secretarial staff in Northern California. \nRecipient of STAR awards for Excellence and Agent of Change. \nSuccessfully managed design and implementation of orientations for two separate groups merged into local offices, personally instructing and supporting each group. \nManage firm's LCMS - subscriptions, resources, course uploads, scheduling. Technical Trainer Howrey LLP September 1995  –  February 2010  (14 years 6 months) a transnational law firm that focused on Antitrust, Global Litigation and Intellectual Property with over 1,400 attorneys and staff. My skills in instructional design and experience as a litigation secretary made me the 'go-to' person for new software implementations. As a technical trainer, my duties also included instructor led training and support of both Northern California offices and synchronous trainings for the global firm. \nInstructional Design \nDevelop and maintain training materials, including presentations, student guides, lab guides, instructor guides, and classroom support materials. \nTimely manage firm-wide training projects using the ADDIE model, often acting as subject matter expert. \nSuccessfully and positively collaborate with developers and subject matter experts ensuring highest quality training programs for new and updated applications. \nDesigned and implemented course evaluation system providing the training team and firm management with measurable feedback of course effectiveness and acceptance. \nDesign and create engaging eLearning courses utilizing Adobe Captivate and Articulate. \nTechnical Training and Support \nConduct technical new hire orientations and software training for office staff, attorneys and outside counsel via instructor led training and seminars in person and via WebEx.  \nProvided in person, hands-on training of high profile program to European offices. \nDeveloped and implemented curriculum plan providing targeted training and ensuring highest level of proficiency for litigation secretarial staff in Northern California. \nRecipient of STAR awards for Excellence and Agent of Change. \nSuccessfully managed design and implementation of orientations for two separate groups merged into local offices, personally instructing and supporting each group. \nManage firm's LCMS - subscriptions, resources, course uploads, scheduling. Litigation and Trademark Secretary Arnold, White & Durkee 1995  –  2000  (5 years) Manage active Federal and State litigation and trademark counseling practice for dynamic partner. Litigation and Trademark Secretary Arnold, White & Durkee 1995  –  2000  (5 years) Manage active Federal and State litigation and trademark counseling practice for dynamic partner. Legal Secretary/Paralegal Nicholas Damer, Counsellor at Law February 1994  –  August 1995  (1 year 7 months) Manage all secretarial and reception duties for sole practitioner civil litigator. Legal Secretary/Paralegal Nicholas Damer, Counsellor at Law February 1994  –  August 1995  (1 year 7 months) Manage all secretarial and reception duties for sole practitioner civil litigator. Various Customer Service Positions Great Western Bank August 1986  –  December 1993  (7 years 5 months) In branch and back office manager/supervisor; was progressively promoted from part-time teller to new account representative to supervisory positions. Various Customer Service Positions Great Western Bank August 1986  –  December 1993  (7 years 5 months) In branch and back office manager/supervisor; was progressively promoted from part-time teller to new account representative to supervisory positions. Tour Mechandising Clerk Universal Studios June 1981  –  July 1986  (5 years 2 months) Employed part-time in Tour Merchandise Department gaining work experience while attending school. Tour Mechandising Clerk Universal Studios June 1981  –  July 1986  (5 years 2 months) Employed part-time in Tour Merchandise Department gaining work experience while attending school. Skills Captivate Adobe Acrobat WebEx Software Documentation Knowledge Management Intellectual Property Project Management Outlook Microsoft Office Troubleshooting VPN Document Management Instructional Design ITIL Instructor-led Training Program Management Training See 2+     See less Skills  Captivate Adobe Acrobat WebEx Software Documentation Knowledge Management Intellectual Property Project Management Outlook Microsoft Office Troubleshooting VPN Document Management Instructional Design ITIL Instructor-led Training Program Management Training See 2+     See less Captivate Adobe Acrobat WebEx Software Documentation Knowledge Management Intellectual Property Project Management Outlook Microsoft Office Troubleshooting VPN Document Management Instructional Design ITIL Instructor-led Training Program Management Training See 2+     See less Captivate Adobe Acrobat WebEx Software Documentation Knowledge Management Intellectual Property Project Management Outlook Microsoft Office Troubleshooting VPN Document Management Instructional Design ITIL Instructor-led Training Program Management Training See 2+     See less Education California State University-Northridge BA,  Political Science 1983  – 1988 California State University-Northridge BA,  Political Science 1983  – 1988 California State University-Northridge BA,  Political Science 1983  – 1988 California State University-Northridge BA,  Political Science 1983  – 1988 ", "Summary EHR Implementation Consultant | Support Specialist | Technical Trainer \n \nAngel is a corporate instructor with a strong background in MS Office, Adobe, Clinical Systems, and HTML applications. Well rounded in client supporting, project management, flowsheets, workflow and training. With over 5 years providing EMR Support & Training within many healthcare practices, Angel has experienced management of groups, communication, computer and software. He has extensive, growing knowledge of personal systems, proprietary and third party software applications and devices.  \n \nAngel has a strong commitment to professional growth and development with the ability to thrive in a busy and diverse environment. \n \n \n \n• eClinicalWorks (ECW) • Computerized Order Entry (CPOE)  \n• Allscripts (SCM) • Help desk Mac and Windows experience \n• ClinDocs • Content Development / Maintenance ( manuals) \n• EPrescribe • Application facilitation \n• Mediation Reconciliation • Knowledge of Electronic Medical Records (EMR) Summary EHR Implementation Consultant | Support Specialist | Technical Trainer \n \nAngel is a corporate instructor with a strong background in MS Office, Adobe, Clinical Systems, and HTML applications. Well rounded in client supporting, project management, flowsheets, workflow and training. With over 5 years providing EMR Support & Training within many healthcare practices, Angel has experienced management of groups, communication, computer and software. He has extensive, growing knowledge of personal systems, proprietary and third party software applications and devices.  \n \nAngel has a strong commitment to professional growth and development with the ability to thrive in a busy and diverse environment. \n \n \n \n• eClinicalWorks (ECW) • Computerized Order Entry (CPOE)  \n• Allscripts (SCM) • Help desk Mac and Windows experience \n• ClinDocs • Content Development / Maintenance ( manuals) \n• EPrescribe • Application facilitation \n• Mediation Reconciliation • Knowledge of Electronic Medical Records (EMR) EHR Implementation Consultant | Support Specialist | Technical Trainer \n \nAngel is a corporate instructor with a strong background in MS Office, Adobe, Clinical Systems, and HTML applications. Well rounded in client supporting, project management, flowsheets, workflow and training. With over 5 years providing EMR Support & Training within many healthcare practices, Angel has experienced management of groups, communication, computer and software. He has extensive, growing knowledge of personal systems, proprietary and third party software applications and devices.  \n \nAngel has a strong commitment to professional growth and development with the ability to thrive in a busy and diverse environment. \n \n \n \n• eClinicalWorks (ECW) • Computerized Order Entry (CPOE)  \n• Allscripts (SCM) • Help desk Mac and Windows experience \n• ClinDocs • Content Development / Maintenance ( manuals) \n• EPrescribe • Application facilitation \n• Mediation Reconciliation • Knowledge of Electronic Medical Records (EMR) EHR Implementation Consultant | Support Specialist | Technical Trainer \n \nAngel is a corporate instructor with a strong background in MS Office, Adobe, Clinical Systems, and HTML applications. Well rounded in client supporting, project management, flowsheets, workflow and training. With over 5 years providing EMR Support & Training within many healthcare practices, Angel has experienced management of groups, communication, computer and software. He has extensive, growing knowledge of personal systems, proprietary and third party software applications and devices.  \n \nAngel has a strong commitment to professional growth and development with the ability to thrive in a busy and diverse environment. \n \n \n \n• eClinicalWorks (ECW) • Computerized Order Entry (CPOE)  \n• Allscripts (SCM) • Help desk Mac and Windows experience \n• ClinDocs • Content Development / Maintenance ( manuals) \n• EPrescribe • Application facilitation \n• Mediation Reconciliation • Knowledge of Electronic Medical Records (EMR) Experience Go Live Consultant NorthShore University HealthSystem April 2014  – Present (1 year 5 months) manhasset, new york Currently supporting the Stabilization and enhancement phase of the project. Desktop Support Consultant Halcyon Cabot Partners, Ltd September 2014  –  January 2015  (5 months) New York Technical support for investment boutique. Activation Support NorthShore LIJ Franklin Hospital April 2013  –  May 2013  (2 months) Long Island Go Live Activation/ EMR Support North Mississippi Medical Center October 2012  –  November 2012  (2 months) Tupelo, MS Activation Support Yavapai Regional Medical Center June 2012  –  June 2012  (1 month) Prescott, AZ Desktop Support/ Service Desk Hachette Livre May 2008  –  November 2010  (2 years 7 months) New York, NY Internship - BMC Desktop Support Howrey LLP January 2008  –  April 2008  (4 months) Go Live Consultant NorthShore University HealthSystem April 2014  – Present (1 year 5 months) manhasset, new york Currently supporting the Stabilization and enhancement phase of the project. Go Live Consultant NorthShore University HealthSystem April 2014  – Present (1 year 5 months) manhasset, new york Currently supporting the Stabilization and enhancement phase of the project. Desktop Support Consultant Halcyon Cabot Partners, Ltd September 2014  –  January 2015  (5 months) New York Technical support for investment boutique. Desktop Support Consultant Halcyon Cabot Partners, Ltd September 2014  –  January 2015  (5 months) New York Technical support for investment boutique. Activation Support NorthShore LIJ Franklin Hospital April 2013  –  May 2013  (2 months) Long Island Activation Support NorthShore LIJ Franklin Hospital April 2013  –  May 2013  (2 months) Long Island Go Live Activation/ EMR Support North Mississippi Medical Center October 2012  –  November 2012  (2 months) Tupelo, MS Go Live Activation/ EMR Support North Mississippi Medical Center October 2012  –  November 2012  (2 months) Tupelo, MS Activation Support Yavapai Regional Medical Center June 2012  –  June 2012  (1 month) Prescott, AZ Activation Support Yavapai Regional Medical Center June 2012  –  June 2012  (1 month) Prescott, AZ Desktop Support/ Service Desk Hachette Livre May 2008  –  November 2010  (2 years 7 months) New York, NY Desktop Support/ Service Desk Hachette Livre May 2008  –  November 2010  (2 years 7 months) New York, NY Internship - BMC Desktop Support Howrey LLP January 2008  –  April 2008  (4 months) Internship - BMC Desktop Support Howrey LLP January 2008  –  April 2008  (4 months) Languages Spanish Portuguese Spanish Portuguese Spanish Portuguese Skills Technical Support Remote Desktop People Skills Windows Vista Windows 7 Antivirus Customer Service Sunrise Clinical Manager End User Training CPOE Quality Assurance Software Project... Data Migration Software Implementation eClinical Go Live Support Delivering Technical... HTML Live Upgrade Support Analysts Desktop Deployment Software Packaging Computer Repair Computer Hardware Audio Visual Support System Migration Software Deployment Photoshop Mac OS Microsoft Windows 98 Hard Drives Modems Device Drivers Software Training Manuals Project Management Needs Analysis Windows 7 Migration Captivate Client Relations Skills Service Desk NexGen GoLive EHR Help Desk Support Training Windows XP XP See 33+     See less Skills  Technical Support Remote Desktop People Skills Windows Vista Windows 7 Antivirus Customer Service Sunrise Clinical Manager End User Training CPOE Quality Assurance Software Project... Data Migration Software Implementation eClinical Go Live Support Delivering Technical... HTML Live Upgrade Support Analysts Desktop Deployment Software Packaging Computer Repair Computer Hardware Audio Visual Support System Migration Software Deployment Photoshop Mac OS Microsoft Windows 98 Hard Drives Modems Device Drivers Software Training Manuals Project Management Needs Analysis Windows 7 Migration Captivate Client Relations Skills Service Desk NexGen GoLive EHR Help Desk Support Training Windows XP XP See 33+     See less Technical Support Remote Desktop People Skills Windows Vista Windows 7 Antivirus Customer Service Sunrise Clinical Manager End User Training CPOE Quality Assurance Software Project... Data Migration Software Implementation eClinical Go Live Support Delivering Technical... HTML Live Upgrade Support Analysts Desktop Deployment Software Packaging Computer Repair Computer Hardware Audio Visual Support System Migration Software Deployment Photoshop Mac OS Microsoft Windows 98 Hard Drives Modems Device Drivers Software Training Manuals Project Management Needs Analysis Windows 7 Migration Captivate Client Relations Skills Service Desk NexGen GoLive EHR Help Desk Support Training Windows XP XP See 33+     See less Technical Support Remote Desktop People Skills Windows Vista Windows 7 Antivirus Customer Service Sunrise Clinical Manager End User Training CPOE Quality Assurance Software Project... Data Migration Software Implementation eClinical Go Live Support Delivering Technical... HTML Live Upgrade Support Analysts Desktop Deployment Software Packaging Computer Repair Computer Hardware Audio Visual Support System Migration Software Deployment Photoshop Mac OS Microsoft Windows 98 Hard Drives Modems Device Drivers Software Training Manuals Project Management Needs Analysis Windows 7 Migration Captivate Client Relations Skills Service Desk NexGen GoLive EHR Help Desk Support Training Windows XP XP See 33+     See less Education New York College of Health Professions Associates in Occupational Studies,  Massage Therapy 2011  – 2012 NovaWorks Mac OS X Support Essentials​,  Mac Computer Support 2009  – 2009 Activities and Societies:  -Completed a three day intensive course that consisted of numerous hands-on MAC supporting activities. Perscola, Inc A+,  Compute Science 2007  – 2008 Activities and Societies:  -Completed the course using a number of hands-on learning activities ,  along with interactive online testing.\n-Attended a one month intensive internship that covered computer repairing ,  networking ,  and \"Sysprepping\" for rollouts amongst other duties. CompUSA MOUS,  Computer Software and Media Applications 2005  – 2005 East Side Community High School High School Diploma,  General Education 2001  – 2005 New York College of Health Professions Associates in Occupational Studies,  Massage Therapy 2011  – 2012 New York College of Health Professions Associates in Occupational Studies,  Massage Therapy 2011  – 2012 New York College of Health Professions Associates in Occupational Studies,  Massage Therapy 2011  – 2012 NovaWorks Mac OS X Support Essentials​,  Mac Computer Support 2009  – 2009 Activities and Societies:  -Completed a three day intensive course that consisted of numerous hands-on MAC supporting activities. NovaWorks Mac OS X Support Essentials​,  Mac Computer Support 2009  – 2009 Activities and Societies:  -Completed a three day intensive course that consisted of numerous hands-on MAC supporting activities. NovaWorks Mac OS X Support Essentials​,  Mac Computer Support 2009  – 2009 Activities and Societies:  -Completed a three day intensive course that consisted of numerous hands-on MAC supporting activities. Perscola, Inc A+,  Compute Science 2007  – 2008 Activities and Societies:  -Completed the course using a number of hands-on learning activities ,  along with interactive online testing.\n-Attended a one month intensive internship that covered computer repairing ,  networking ,  and \"Sysprepping\" for rollouts amongst other duties. Perscola, Inc A+,  Compute Science 2007  – 2008 Activities and Societies:  -Completed the course using a number of hands-on learning activities ,  along with interactive online testing.\n-Attended a one month intensive internship that covered computer repairing ,  networking ,  and \"Sysprepping\" for rollouts amongst other duties. Perscola, Inc A+,  Compute Science 2007  – 2008 Activities and Societies:  -Completed the course using a number of hands-on learning activities ,  along with interactive online testing.\n-Attended a one month intensive internship that covered computer repairing ,  networking ,  and \"Sysprepping\" for rollouts amongst other duties. CompUSA MOUS,  Computer Software and Media Applications 2005  – 2005 CompUSA MOUS,  Computer Software and Media Applications 2005  – 2005 CompUSA MOUS,  Computer Software and Media Applications 2005  – 2005 East Side Community High School High School Diploma,  General Education 2001  – 2005 East Side Community High School High School Diploma,  General Education 2001  – 2005 East Side Community High School High School Diploma,  General Education 2001  – 2005 ", "Experience Learning Technologies Specialist Venable LLP April 2015  – Present (5 months) Washington D.C. Metro Area Co Founder, Grant Writer/Administrator Angels of Hope Ministries, Inc. 1994  – Present (21 years) Washington D.C. Metro Area 501c3 in SE D.C. providing quality outreach program to unserved residents. Missions Coordinator Christian Methodist Episcopal Church 2006  – Present (9 years) Africa Plan logistics for missions work to 13 countries in Africa, oversee the missions budget and operations and coordinate travel and documentation. Assistant Executive Christian Methodist Episcopal Church 2006  – Present (9 years) Africa, Haiti & Jamaica Trainer Steptoe & Johnson LLP June 2011  –  April 2015  (3 years 11 months) Washington D.C. Metro Area Technical Trainer Technical Trainer WilmerHale 2011  –  2011  (less than a year) Technology Trainer Howrey LLP 2008  –  2011  (3 years) Washington D.C. Metro Area Technical Trainer IT Trainer Wiley Rein LLP 2006  –  2008  (2 years) Support Specialist Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates 2003  –  2006  (3 years) Application Specialist Blank Rome LLP 2001  –  2003  (2 years) Technical Director Hyman, Phelps & McNamara, P.C. 2000  –  2001  (1 year) Technical Trainer & Systems Administrator Akin Gump Strauss Hauer & Feld LLP 1998  –  2000  (2 years) Washington D.C. Metro Area Learning Technologies Specialist Venable LLP April 2015  – Present (5 months) Washington D.C. Metro Area Learning Technologies Specialist Venable LLP April 2015  – Present (5 months) Washington D.C. Metro Area Co Founder, Grant Writer/Administrator Angels of Hope Ministries, Inc. 1994  – Present (21 years) Washington D.C. Metro Area 501c3 in SE D.C. providing quality outreach program to unserved residents. Co Founder, Grant Writer/Administrator Angels of Hope Ministries, Inc. 1994  – Present (21 years) Washington D.C. Metro Area 501c3 in SE D.C. providing quality outreach program to unserved residents. Missions Coordinator Christian Methodist Episcopal Church 2006  – Present (9 years) Africa Plan logistics for missions work to 13 countries in Africa, oversee the missions budget and operations and coordinate travel and documentation. Missions Coordinator Christian Methodist Episcopal Church 2006  – Present (9 years) Africa Plan logistics for missions work to 13 countries in Africa, oversee the missions budget and operations and coordinate travel and documentation. Assistant Executive Christian Methodist Episcopal Church 2006  – Present (9 years) Africa, Haiti & Jamaica Assistant Executive Christian Methodist Episcopal Church 2006  – Present (9 years) Africa, Haiti & Jamaica Trainer Steptoe & Johnson LLP June 2011  –  April 2015  (3 years 11 months) Washington D.C. Metro Area Technical Trainer Trainer Steptoe & Johnson LLP June 2011  –  April 2015  (3 years 11 months) Washington D.C. Metro Area Technical Trainer Technical Trainer WilmerHale 2011  –  2011  (less than a year) Technical Trainer WilmerHale 2011  –  2011  (less than a year) Technology Trainer Howrey LLP 2008  –  2011  (3 years) Washington D.C. Metro Area Technical Trainer Technology Trainer Howrey LLP 2008  –  2011  (3 years) Washington D.C. Metro Area Technical Trainer IT Trainer Wiley Rein LLP 2006  –  2008  (2 years) IT Trainer Wiley Rein LLP 2006  –  2008  (2 years) Support Specialist Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates 2003  –  2006  (3 years) Support Specialist Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates 2003  –  2006  (3 years) Application Specialist Blank Rome LLP 2001  –  2003  (2 years) Application Specialist Blank Rome LLP 2001  –  2003  (2 years) Technical Director Hyman, Phelps & McNamara, P.C. 2000  –  2001  (1 year) Technical Director Hyman, Phelps & McNamara, P.C. 2000  –  2001  (1 year) Technical Trainer & Systems Administrator Akin Gump Strauss Hauer & Feld LLP 1998  –  2000  (2 years) Washington D.C. Metro Area Technical Trainer & Systems Administrator Akin Gump Strauss Hauer & Feld LLP 1998  –  2000  (2 years) Washington D.C. Metro Area Languages English English English Skills iManage Trials Litigation Support Relativity IPRO Westlaw LiveNote Document Management Document Review Leadership Intellectual Property EDRMS Accutrac CaseMap Patent Litigation Litigation Legal Writing Training Commercial Litigation Licensing Nonprofits Legal Research Public Speaking Strategic Public... Great Organizer See 10+     See less Skills  iManage Trials Litigation Support Relativity IPRO Westlaw LiveNote Document Management Document Review Leadership Intellectual Property EDRMS Accutrac CaseMap Patent Litigation Litigation Legal Writing Training Commercial Litigation Licensing Nonprofits Legal Research Public Speaking Strategic Public... Great Organizer See 10+     See less iManage Trials Litigation Support Relativity IPRO Westlaw LiveNote Document Management Document Review Leadership Intellectual Property EDRMS Accutrac CaseMap Patent Litigation Litigation Legal Writing Training Commercial Litigation Licensing Nonprofits Legal Research Public Speaking Strategic Public... Great Organizer See 10+     See less iManage Trials Litigation Support Relativity IPRO Westlaw LiveNote Document Management Document Review Leadership Intellectual Property EDRMS Accutrac CaseMap Patent Litigation Litigation Legal Writing Training Commercial Litigation Licensing Nonprofits Legal Research Public Speaking Strategic Public... Great Organizer See 10+     See less ", "Summary With over 25 years’ experience in technical training, project management, quality control and testing, instructional design and end-user support, I am effective at providing software training and creating training materials and eLearning for a diverse group of staff and lawyers, with a focus on legal applications and Microsoft Office Suite. I have worked in a variety of environments and function as a team player and autonomous project lead who excels at taking initiative and setting priorities to meet business needs while interacting well with individuals at various levels of an organization. I am recognized for excellence in service, integrity, and efficiency. \n \nSpecialties include: MOS Office 2010 Certification, eLearning (Captivate), SharePoint Summary With over 25 years’ experience in technical training, project management, quality control and testing, instructional design and end-user support, I am effective at providing software training and creating training materials and eLearning for a diverse group of staff and lawyers, with a focus on legal applications and Microsoft Office Suite. I have worked in a variety of environments and function as a team player and autonomous project lead who excels at taking initiative and setting priorities to meet business needs while interacting well with individuals at various levels of an organization. I am recognized for excellence in service, integrity, and efficiency. \n \nSpecialties include: MOS Office 2010 Certification, eLearning (Captivate), SharePoint With over 25 years’ experience in technical training, project management, quality control and testing, instructional design and end-user support, I am effective at providing software training and creating training materials and eLearning for a diverse group of staff and lawyers, with a focus on legal applications and Microsoft Office Suite. I have worked in a variety of environments and function as a team player and autonomous project lead who excels at taking initiative and setting priorities to meet business needs while interacting well with individuals at various levels of an organization. I am recognized for excellence in service, integrity, and efficiency. \n \nSpecialties include: MOS Office 2010 Certification, eLearning (Captivate), SharePoint With over 25 years’ experience in technical training, project management, quality control and testing, instructional design and end-user support, I am effective at providing software training and creating training materials and eLearning for a diverse group of staff and lawyers, with a focus on legal applications and Microsoft Office Suite. I have worked in a variety of environments and function as a team player and autonomous project lead who excels at taking initiative and setting priorities to meet business needs while interacting well with individuals at various levels of an organization. I am recognized for excellence in service, integrity, and efficiency. \n \nSpecialties include: MOS Office 2010 Certification, eLearning (Captivate), SharePoint Experience Technical Trainer Winston & Strawn LLP March 2011  – Present (4 years 6 months) * Design, administer, and deliver technical training curriculum. Assess departmental and organizational needs. Research and leverage industry best practices to design and implement e-Learning strategies and development solutions that meet industry standards.  \n* Train new firm personnel on standard firm software applications and telephones. Develop and conduct training on advanced topics/features on various firm standard applications. \n* Design and develop interactive e-Learning training courses. Develop e-Learning modules to complement existing instructor led training, marketing pieces. \n* Conduct classroom and one-on-one just in time training. Schedule training by conferring with department heads, prospective students and other IS Staff. \n* Perform quality assurance testing on new applications, document templates, and technology-driven training including system, usability, and functional testing. Work with appropriate individuals or teams to resolve issues identified in the quality assurance process. \n* Work with Project Managers as the training resource on projects that will impact end-users.  \n* Learn new software/features, identify training needs, identify appropriate training methodologies, cross-train other Trainers, develop training schedules, train end-users, and evaluate training. \n* SME on SharePoint and MacroView creating training materials, instructor guides, testing scripts and then training on same. \n* Evaluate and recommend software packages upon request. \n* Assist the Technical Support Center in supporting firm personnel when necessary. Technical Trainer Howrey LLP August 1998  –  March 2011  (12 years 8 months) Houston * Act as an intermediary between the business and the technical community to collect, clarify, and translate business requirements into documentation and conceptual design from which application training solutions were developed.  \n* Managed various training projects creating project proposals, requirements documents, reviewing current IT systems and evaluating against future needs, reviewing training vendors, meeting with various communities to understand business requirements, and supervising the development of test scripts for trainers pre-pilot and test scripts for pilot users, training materials, schedules and communications. I was considered the ‘expert’ trainer when historical data was needed for software projects.  \n* Provided firm wide training and support for over 1,400 employees with primary focus on the Houston, Chicago and Salt Lake City offices. Conducted technical orientations and software training for attorneys and staff via instructor led hands-on training, seminars in person or via WebEx.  \n* Applied best practices following corporate policies and procedures.  \n* Developed Howrey’s IT course catalog and curriculum for all internal IT training.  \n* Developed training standards and checklists for new employees; these standards were used by all trainers.  \n* Wrote and maintained training materials, including presentations, student manuals, Quick Reference Guides, lab exercises, trainer manuals, and other classroom support materials.  \n* Designed and implement eLearning courses utilizing Adobe Captivate. \n* Recipient of two STAR awards for ‘Excellence’ and ‘Swimming Upstream’ Consultant/Contract Trainer New Data Strategies, Inc. June 1997  –  July 1998  (1 year 2 months) Houston * Assigned to Windows 95/ MS Office 97 projects with various Exxon Mobile companies.  \n* Coordinated end-user education and developed training materials and other documentation using technical writing skills.  \n* Trained and supported 3,000+ end-users on various Microsoft products, Visio and Windows Distributed Desktop.  \n* On a secondary project, I managed the rollout of Microsoft Outlook including creating project proposals: identified customer requirements; performed cost benefit analysis; and prepared and managed budgets.  \n* Designed and created training manuals and marketing materials as well as other relevant documentation. Migrated 310 users to MS Outlook.  \n* Designed and created PowerPoint presentations for the Legal Department which were used to secure contracts with Brazil. Software Training Manager Computer City July 1994  –  June 1997  (3 years) Greater Minneapolis-St. Paul Area and Houston, Texas * Trained on numerous Microsoft, Corel, Lotus and Windows products and all other software applications as requested by clients.  \n* Coordinated, customized and supervised various training projects for companies such as Dow Chemical, Sam Goody, Brown & Root, State of Minnesota and City of St. Paul including providing retraining programs for dislocated workers.  \n* Setup and configured new systems; performed hardware upgrades. MIS Technology Analyst Norwest Corporate Bank July 1989  –  June 1994  (5 years) Minneapolis, MN * Developed and implemented the Corporate Bank software training program.  \n* Designed and created end-user manuals. Trained 800+ end-users on Microsoft products, Harvard Graphics and Lotus 1-2-3.  \n* Served as Senior Technical Resource for second level Help Desk support.  \n* Established and educated end-users on end-user computing policies and procedures.  \n* Prepared annual Risk Evaluations; maintained software and hardware inventories for 900+ PCs both nationally and internationally.  \n* Provided financial, analytical and technical expertise necessary to design, recommend and implement end-user computing systems and software application changes while addressing their overall integration with current and future Corporate Bank systems.  \n* Recommended and trained on Disaster Recovery Policies and Procedures related to IT. Technical Trainer Winston & Strawn LLP March 2011  – Present (4 years 6 months) * Design, administer, and deliver technical training curriculum. Assess departmental and organizational needs. Research and leverage industry best practices to design and implement e-Learning strategies and development solutions that meet industry standards.  \n* Train new firm personnel on standard firm software applications and telephones. Develop and conduct training on advanced topics/features on various firm standard applications. \n* Design and develop interactive e-Learning training courses. Develop e-Learning modules to complement existing instructor led training, marketing pieces. \n* Conduct classroom and one-on-one just in time training. Schedule training by conferring with department heads, prospective students and other IS Staff. \n* Perform quality assurance testing on new applications, document templates, and technology-driven training including system, usability, and functional testing. Work with appropriate individuals or teams to resolve issues identified in the quality assurance process. \n* Work with Project Managers as the training resource on projects that will impact end-users.  \n* Learn new software/features, identify training needs, identify appropriate training methodologies, cross-train other Trainers, develop training schedules, train end-users, and evaluate training. \n* SME on SharePoint and MacroView creating training materials, instructor guides, testing scripts and then training on same. \n* Evaluate and recommend software packages upon request. \n* Assist the Technical Support Center in supporting firm personnel when necessary. Technical Trainer Winston & Strawn LLP March 2011  – Present (4 years 6 months) * Design, administer, and deliver technical training curriculum. Assess departmental and organizational needs. Research and leverage industry best practices to design and implement e-Learning strategies and development solutions that meet industry standards.  \n* Train new firm personnel on standard firm software applications and telephones. Develop and conduct training on advanced topics/features on various firm standard applications. \n* Design and develop interactive e-Learning training courses. Develop e-Learning modules to complement existing instructor led training, marketing pieces. \n* Conduct classroom and one-on-one just in time training. Schedule training by conferring with department heads, prospective students and other IS Staff. \n* Perform quality assurance testing on new applications, document templates, and technology-driven training including system, usability, and functional testing. Work with appropriate individuals or teams to resolve issues identified in the quality assurance process. \n* Work with Project Managers as the training resource on projects that will impact end-users.  \n* Learn new software/features, identify training needs, identify appropriate training methodologies, cross-train other Trainers, develop training schedules, train end-users, and evaluate training. \n* SME on SharePoint and MacroView creating training materials, instructor guides, testing scripts and then training on same. \n* Evaluate and recommend software packages upon request. \n* Assist the Technical Support Center in supporting firm personnel when necessary. Technical Trainer Howrey LLP August 1998  –  March 2011  (12 years 8 months) Houston * Act as an intermediary between the business and the technical community to collect, clarify, and translate business requirements into documentation and conceptual design from which application training solutions were developed.  \n* Managed various training projects creating project proposals, requirements documents, reviewing current IT systems and evaluating against future needs, reviewing training vendors, meeting with various communities to understand business requirements, and supervising the development of test scripts for trainers pre-pilot and test scripts for pilot users, training materials, schedules and communications. I was considered the ‘expert’ trainer when historical data was needed for software projects.  \n* Provided firm wide training and support for over 1,400 employees with primary focus on the Houston, Chicago and Salt Lake City offices. Conducted technical orientations and software training for attorneys and staff via instructor led hands-on training, seminars in person or via WebEx.  \n* Applied best practices following corporate policies and procedures.  \n* Developed Howrey’s IT course catalog and curriculum for all internal IT training.  \n* Developed training standards and checklists for new employees; these standards were used by all trainers.  \n* Wrote and maintained training materials, including presentations, student manuals, Quick Reference Guides, lab exercises, trainer manuals, and other classroom support materials.  \n* Designed and implement eLearning courses utilizing Adobe Captivate. \n* Recipient of two STAR awards for ‘Excellence’ and ‘Swimming Upstream’ Technical Trainer Howrey LLP August 1998  –  March 2011  (12 years 8 months) Houston * Act as an intermediary between the business and the technical community to collect, clarify, and translate business requirements into documentation and conceptual design from which application training solutions were developed.  \n* Managed various training projects creating project proposals, requirements documents, reviewing current IT systems and evaluating against future needs, reviewing training vendors, meeting with various communities to understand business requirements, and supervising the development of test scripts for trainers pre-pilot and test scripts for pilot users, training materials, schedules and communications. I was considered the ‘expert’ trainer when historical data was needed for software projects.  \n* Provided firm wide training and support for over 1,400 employees with primary focus on the Houston, Chicago and Salt Lake City offices. Conducted technical orientations and software training for attorneys and staff via instructor led hands-on training, seminars in person or via WebEx.  \n* Applied best practices following corporate policies and procedures.  \n* Developed Howrey’s IT course catalog and curriculum for all internal IT training.  \n* Developed training standards and checklists for new employees; these standards were used by all trainers.  \n* Wrote and maintained training materials, including presentations, student manuals, Quick Reference Guides, lab exercises, trainer manuals, and other classroom support materials.  \n* Designed and implement eLearning courses utilizing Adobe Captivate. \n* Recipient of two STAR awards for ‘Excellence’ and ‘Swimming Upstream’ Consultant/Contract Trainer New Data Strategies, Inc. June 1997  –  July 1998  (1 year 2 months) Houston * Assigned to Windows 95/ MS Office 97 projects with various Exxon Mobile companies.  \n* Coordinated end-user education and developed training materials and other documentation using technical writing skills.  \n* Trained and supported 3,000+ end-users on various Microsoft products, Visio and Windows Distributed Desktop.  \n* On a secondary project, I managed the rollout of Microsoft Outlook including creating project proposals: identified customer requirements; performed cost benefit analysis; and prepared and managed budgets.  \n* Designed and created training manuals and marketing materials as well as other relevant documentation. Migrated 310 users to MS Outlook.  \n* Designed and created PowerPoint presentations for the Legal Department which were used to secure contracts with Brazil. Consultant/Contract Trainer New Data Strategies, Inc. June 1997  –  July 1998  (1 year 2 months) Houston * Assigned to Windows 95/ MS Office 97 projects with various Exxon Mobile companies.  \n* Coordinated end-user education and developed training materials and other documentation using technical writing skills.  \n* Trained and supported 3,000+ end-users on various Microsoft products, Visio and Windows Distributed Desktop.  \n* On a secondary project, I managed the rollout of Microsoft Outlook including creating project proposals: identified customer requirements; performed cost benefit analysis; and prepared and managed budgets.  \n* Designed and created training manuals and marketing materials as well as other relevant documentation. Migrated 310 users to MS Outlook.  \n* Designed and created PowerPoint presentations for the Legal Department which were used to secure contracts with Brazil. Software Training Manager Computer City July 1994  –  June 1997  (3 years) Greater Minneapolis-St. Paul Area and Houston, Texas * Trained on numerous Microsoft, Corel, Lotus and Windows products and all other software applications as requested by clients.  \n* Coordinated, customized and supervised various training projects for companies such as Dow Chemical, Sam Goody, Brown & Root, State of Minnesota and City of St. Paul including providing retraining programs for dislocated workers.  \n* Setup and configured new systems; performed hardware upgrades. Software Training Manager Computer City July 1994  –  June 1997  (3 years) Greater Minneapolis-St. Paul Area and Houston, Texas * Trained on numerous Microsoft, Corel, Lotus and Windows products and all other software applications as requested by clients.  \n* Coordinated, customized and supervised various training projects for companies such as Dow Chemical, Sam Goody, Brown & Root, State of Minnesota and City of St. Paul including providing retraining programs for dislocated workers.  \n* Setup and configured new systems; performed hardware upgrades. MIS Technology Analyst Norwest Corporate Bank July 1989  –  June 1994  (5 years) Minneapolis, MN * Developed and implemented the Corporate Bank software training program.  \n* Designed and created end-user manuals. Trained 800+ end-users on Microsoft products, Harvard Graphics and Lotus 1-2-3.  \n* Served as Senior Technical Resource for second level Help Desk support.  \n* Established and educated end-users on end-user computing policies and procedures.  \n* Prepared annual Risk Evaluations; maintained software and hardware inventories for 900+ PCs both nationally and internationally.  \n* Provided financial, analytical and technical expertise necessary to design, recommend and implement end-user computing systems and software application changes while addressing their overall integration with current and future Corporate Bank systems.  \n* Recommended and trained on Disaster Recovery Policies and Procedures related to IT. MIS Technology Analyst Norwest Corporate Bank July 1989  –  June 1994  (5 years) Minneapolis, MN * Developed and implemented the Corporate Bank software training program.  \n* Designed and created end-user manuals. Trained 800+ end-users on Microsoft products, Harvard Graphics and Lotus 1-2-3.  \n* Served as Senior Technical Resource for second level Help Desk support.  \n* Established and educated end-users on end-user computing policies and procedures.  \n* Prepared annual Risk Evaluations; maintained software and hardware inventories for 900+ PCs both nationally and internationally.  \n* Provided financial, analytical and technical expertise necessary to design, recommend and implement end-user computing systems and software application changes while addressing their overall integration with current and future Corporate Bank systems.  \n* Recommended and trained on Disaster Recovery Policies and Procedures related to IT. Skills Software Documentation Training SharePoint Program Management Technical Writing Skills  Software Documentation Training SharePoint Program Management Technical Writing Software Documentation Training SharePoint Program Management Technical Writing Software Documentation Training SharePoint Program Management Technical Writing Education Gustavus Adolphus College University of Minnesota Gustavus Adolphus College Gustavus Adolphus College Gustavus Adolphus College University of Minnesota University of Minnesota University of Minnesota "]}