{"position": "Tech Yahoo", "company": "Google", "profiles": ["Summary • Experienced front-end software developer with a passion for learning and taking on new challenges.  \n \n• I have developed solutions for a variety of platforms in a variety of languages, including single-page Javascript/HTML clients, Node.js services, Flex/Flash/ActionScript 3.0 clients, and Win32/C++/COM clients. I have had some brief stints with Objective-C/iPhone and C#/.NET development as well. \n \n• The last couple of years, I have spent most of my time developing rich, single-page HTML and Javascript clients (with jQuery). Recently, Node.js has allowed me to spread my wings a bit more and develop on the server-side as well. \n \n• Prior to that, I worked on Flex 3/ActionScript 3.0 clients, and optimizing Flash applications. \n \n• Even further back, I developed Windows applications using COM, ActiveX, C++, STL, Boost, MFC, and Win32. \n \n• I really cut my teeth as a professional software engineer developing extensions for Excel using the Excel C API and building COM add-ins. I still have a warm place in my heart for COM. Summary • Experienced front-end software developer with a passion for learning and taking on new challenges.  \n \n• I have developed solutions for a variety of platforms in a variety of languages, including single-page Javascript/HTML clients, Node.js services, Flex/Flash/ActionScript 3.0 clients, and Win32/C++/COM clients. I have had some brief stints with Objective-C/iPhone and C#/.NET development as well. \n \n• The last couple of years, I have spent most of my time developing rich, single-page HTML and Javascript clients (with jQuery). Recently, Node.js has allowed me to spread my wings a bit more and develop on the server-side as well. \n \n• Prior to that, I worked on Flex 3/ActionScript 3.0 clients, and optimizing Flash applications. \n \n• Even further back, I developed Windows applications using COM, ActiveX, C++, STL, Boost, MFC, and Win32. \n \n• I really cut my teeth as a professional software engineer developing extensions for Excel using the Excel C API and building COM add-ins. I still have a warm place in my heart for COM. • Experienced front-end software developer with a passion for learning and taking on new challenges.  \n \n• I have developed solutions for a variety of platforms in a variety of languages, including single-page Javascript/HTML clients, Node.js services, Flex/Flash/ActionScript 3.0 clients, and Win32/C++/COM clients. I have had some brief stints with Objective-C/iPhone and C#/.NET development as well. \n \n• The last couple of years, I have spent most of my time developing rich, single-page HTML and Javascript clients (with jQuery). Recently, Node.js has allowed me to spread my wings a bit more and develop on the server-side as well. \n \n• Prior to that, I worked on Flex 3/ActionScript 3.0 clients, and optimizing Flash applications. \n \n• Even further back, I developed Windows applications using COM, ActiveX, C++, STL, Boost, MFC, and Win32. \n \n• I really cut my teeth as a professional software engineer developing extensions for Excel using the Excel C API and building COM add-ins. I still have a warm place in my heart for COM. • Experienced front-end software developer with a passion for learning and taking on new challenges.  \n \n• I have developed solutions for a variety of platforms in a variety of languages, including single-page Javascript/HTML clients, Node.js services, Flex/Flash/ActionScript 3.0 clients, and Win32/C++/COM clients. I have had some brief stints with Objective-C/iPhone and C#/.NET development as well. \n \n• The last couple of years, I have spent most of my time developing rich, single-page HTML and Javascript clients (with jQuery). Recently, Node.js has allowed me to spread my wings a bit more and develop on the server-side as well. \n \n• Prior to that, I worked on Flex 3/ActionScript 3.0 clients, and optimizing Flash applications. \n \n• Even further back, I developed Windows applications using COM, ActiveX, C++, STL, Boost, MFC, and Win32. \n \n• I really cut my teeth as a professional software engineer developing extensions for Excel using the Excel C API and building COM add-ins. I still have a warm place in my heart for COM. Experience Senior Software Engineer Yahoo! July 2013  – Present (2 years 2 months) Created an enhanced contact details screen/application for Yahoo Contacts, powered by Node.js/Express. The application federates calls to internal Yahoo services to produce rich contact details for selected contacts. The feature served as a pilot for Node.js use by Contacts as well as a nice enhancement to the product in and of itself; its success is prompting more Node.js development by the team. \n \nIn order to meet some new product requirements for mail search, I created a search autocomplete component for Yahoo mail's front end which federates multiple types of data across a variety of services which return their data asynchronously. The component is very flexible, supporting the ability to hook up data sources, renderers, and selection handlers from any number of data providers, all of whom can return their data at any time. Replaced the current, inflexible, hodge-podge solutions in mail supporting some subsets of this functionality, and refactored accordingly.  \n \nUsing Node.js/Express, I built a tool used by one of the editorial teams in Yahoo. The tool required reading from and writing to large files, so for performance reasons, it used Node's streaming APIs. \n \nCreated a web client (using jQuery) to help test, develop, and prove out a new search related project at Yahoo. The client was developed while working in tandem with engineers owning the server component to help prove out the model of what was needed for the project and to learn how best to structure the project's APIs. The client supports streaming responses via chunked transfer encoding. Software Engineer Xobni November 2009  –  July 2013  (3 years 9 months) Worked on Xobni’s generic out of box/on-boarding application. It's a flexible, rich web client backed by Node.js. It is used by several web and native mobile clients to walk users through our login, signup, and third-party OAuth flows. \n \nI was one of the lead developers for a Chrome/Firefox/Safari extension that integrates Xobni functionality with GMail (https://www.xobni.com/download/gmail). This is a single-page HTML5/Javascript application that uses Xobni's cloud API to fetch rich contact data to display as the user interacts with email messages in GMail. \n \nBuilt a CardDAV server for Xobni contacts in Node.js (on top of jsDAV). This allows the iPhone and OSX Address Book, for example, to sync locally a user's Xobni contacts without a special Xobni client. This is an ongoing pet project. \n \nBuilt an LDAP adapter for Xobni contacts in Node.js (on top of ldapjs). This allows the iPhone and other LDAP clients to perform LDAP directory searches against a user's Xobni contacts.  \n \nVarious nodejs/Express services to showcase Xobni's data. \n \nC#/.NET programming for the world's leading Outlook plugin, focusing particularly on the .NET/COM bridge, Win32 API hooks (e.g. subclassing Windows messages), and COM Addin support. I was also one of two engineers to refactor the plugin to support x64. Software Engineer Gaia Online March 2008  –  November 2009  (1 year 9 months) Senior Flex 3/ActionScript 3.0 developer for zOMG! \n \nI added many game features, but was particularly focused on optimization and efficiency issues (e.g. finding and fixing reasons for low frame rates and excessive garbage collection). \n \nI helped spearhead the project to retroactively add Flex to the game, and architected a new UI framework based on Flex modules. I also implemented several new and improved UI elements. \n \nI wrote the MMO's wrapper around AOL’s ActionScript AIM API (wimas3), implementing chat over AIM for the game. \n \nGaia had no build process for its front-end applications when I joined, so I created a continuous integration system, back-porting several projects to use it, including zOMG! Senior Software Engineer Yahoo! June 2006  –  March 2008  (1 year 10 months) Senior developer for a Flex 3/ActionScript 3.0 implementation of Y! Messenger for the Web \n \nI was one of the key architects and implementers of Yahoo!’s web messenger product, built using ActionScript 3.0 and the Flex 3 framework. I also designed and built a continuous build system for the project. This product was spun off into JetBlue’s instant messenger solution on its planes in flight. \n \nThe product was also spun off into myM, a web messenger product that integrated messages, wall posts, vitality information, etc. from Facebook, MySpace, and AIM. myM was released in beta internally and to some test groups with much acclaim, but Yahoo! shelved the product in early 2007 before releasing it to the general public. Staff Software Engineer Intuit February 2005  –  June 2006  (1 year 5 months) Served as technical lead for a team of five regular (and sometimes as many as ten) developers refactoring the QuickBooks code base to remove the limits on the number of elements in a QuickBooks list (these are feature-level lists, such as the Customer List, Vendor List, Item List, etc.). Essentially, this involved changing a fundamental data type used in a very large codebase. Because the list subsystem and this data type permeated the codebase, the project had tremendous impact on the product and required changes to almost every major piece of functionality in QuickBooks (approximately 200,000 lines of code were changed across more than 20 modules); it also posed particular problems for serialization code and external (e.g. API) clients. The challenges in the project included rooting out what portions of the codebase (often old and undocumented) would be affected, figuring out how to change them, and helping to manage and coordinate a very large set of changes. \n \nCritical to the success of the project was my development of an instrumentation class to cause compilation errors in many places where we missed changing one of these fundamental data types. Lead Software Engineer FactSet Research Systems January 2004  –  January 2005  (1 year 1 month) Lead architect and programmer for many solutions that integrated FactSet’s data with Microsoft Office (Active Publishing Workstation (APW) and the FactSet-Excel Link), using C++, COM, ActiveX, Win32, DDE, Excel's binary file format, and VBA. \n \nAPW was FactSet’s publishing solution, allowing users to populate and update Office documents with FactSet financial data; the FactSet-Excel Link allowed clients to integrate FactSet data into their spreadsheets in a myriad of ways, including the exporting server-based reports to Excel (using XML and HTML), providing custom worksheet functions to retrieve FactSet data, real-time updates in Excel cells (using DDE), and merging requested FactSet data into Excel files on disk by manipulating the Excel file format (BIFF). \n \nHelped spearhead FactSet’s transition from multibyte to Unicode in its PC applications. Wrote the code to enable all the Office integration products and features to support Unicode. Senior Software Engineer, Lead Excel developer FactSet Research Systems October 2001  –  January 2004  (2 years 4 months) Rearchitected FactSet's Excel spreadsheet updating functionality (called Data Downloading), replacing a difficult to maintain and to enhance algorithm involving file format manipulation with an algorithm based on OLE automation of Excel and HTML/XML/CSS. This enabled several important enhancements that were outstanding requests for many years. The process involved touching a great deal of low-level code and modifying FactSet's proprietary protocols for transmitting data. \n \nRearchitected FactSet's mechanism for exporting online reports to Excel, replacing a DDE-based mechanism with an XML/HTML/clipboard based one. Based on my architecture and leadership, FactSet is now able to export reports to PowerPoint presentations and to Word documents. \n \nImplemented linking of Excel cells populated with FactSet data to online documents from which the data was pulled, architecting a solution that uses a custom URL protocol and COM. Software Engineer FactSet Software Systems October 1998  –  October 2001  (3 years 1 month) Taught myself C++, COM, MFC, and the Windows API after not having programmed in C for 10 years. \n \nVarious enhancements to FactSet's home-grown thin client, using C++, MFC, and the Windows API. \n \nRearchitected FactSet's custom worksheet function for retrieving user-requested data. Converted the code from an old Excel C API to using Excel OLE automation, fixed many bugs, and implemented many enhancements and stabilizations. Instructor, Teaching Assistant Johns Hopkins University, Center for Talented Youth January 1985  –  January 1997  (12 years 1 month) Instructor and co-author of a text for Introduction to Theoretical Computer Science at Johns Hopkins Center for Talented Youth (CTY) summer program. Johns Hopkins’ CTY program allows academically gifted junior high school and high school students to study college and graduate level material over the summer. In a single three week session, they learned in my course Pascal or Scheme; Propositional Logic; finite state automata theory; the Chomsky hierarchy; and Turing Machines and undecidability. Since no course like this exists elsewhere, a co-author and I devised a 200+ page textbook to serve as the course text. Senior Software Engineer Yahoo! July 2013  – Present (2 years 2 months) Created an enhanced contact details screen/application for Yahoo Contacts, powered by Node.js/Express. The application federates calls to internal Yahoo services to produce rich contact details for selected contacts. The feature served as a pilot for Node.js use by Contacts as well as a nice enhancement to the product in and of itself; its success is prompting more Node.js development by the team. \n \nIn order to meet some new product requirements for mail search, I created a search autocomplete component for Yahoo mail's front end which federates multiple types of data across a variety of services which return their data asynchronously. The component is very flexible, supporting the ability to hook up data sources, renderers, and selection handlers from any number of data providers, all of whom can return their data at any time. Replaced the current, inflexible, hodge-podge solutions in mail supporting some subsets of this functionality, and refactored accordingly.  \n \nUsing Node.js/Express, I built a tool used by one of the editorial teams in Yahoo. The tool required reading from and writing to large files, so for performance reasons, it used Node's streaming APIs. \n \nCreated a web client (using jQuery) to help test, develop, and prove out a new search related project at Yahoo. The client was developed while working in tandem with engineers owning the server component to help prove out the model of what was needed for the project and to learn how best to structure the project's APIs. The client supports streaming responses via chunked transfer encoding. Senior Software Engineer Yahoo! July 2013  – Present (2 years 2 months) Created an enhanced contact details screen/application for Yahoo Contacts, powered by Node.js/Express. The application federates calls to internal Yahoo services to produce rich contact details for selected contacts. The feature served as a pilot for Node.js use by Contacts as well as a nice enhancement to the product in and of itself; its success is prompting more Node.js development by the team. \n \nIn order to meet some new product requirements for mail search, I created a search autocomplete component for Yahoo mail's front end which federates multiple types of data across a variety of services which return their data asynchronously. The component is very flexible, supporting the ability to hook up data sources, renderers, and selection handlers from any number of data providers, all of whom can return their data at any time. Replaced the current, inflexible, hodge-podge solutions in mail supporting some subsets of this functionality, and refactored accordingly.  \n \nUsing Node.js/Express, I built a tool used by one of the editorial teams in Yahoo. The tool required reading from and writing to large files, so for performance reasons, it used Node's streaming APIs. \n \nCreated a web client (using jQuery) to help test, develop, and prove out a new search related project at Yahoo. The client was developed while working in tandem with engineers owning the server component to help prove out the model of what was needed for the project and to learn how best to structure the project's APIs. The client supports streaming responses via chunked transfer encoding. Software Engineer Xobni November 2009  –  July 2013  (3 years 9 months) Worked on Xobni’s generic out of box/on-boarding application. It's a flexible, rich web client backed by Node.js. It is used by several web and native mobile clients to walk users through our login, signup, and third-party OAuth flows. \n \nI was one of the lead developers for a Chrome/Firefox/Safari extension that integrates Xobni functionality with GMail (https://www.xobni.com/download/gmail). This is a single-page HTML5/Javascript application that uses Xobni's cloud API to fetch rich contact data to display as the user interacts with email messages in GMail. \n \nBuilt a CardDAV server for Xobni contacts in Node.js (on top of jsDAV). This allows the iPhone and OSX Address Book, for example, to sync locally a user's Xobni contacts without a special Xobni client. This is an ongoing pet project. \n \nBuilt an LDAP adapter for Xobni contacts in Node.js (on top of ldapjs). This allows the iPhone and other LDAP clients to perform LDAP directory searches against a user's Xobni contacts.  \n \nVarious nodejs/Express services to showcase Xobni's data. \n \nC#/.NET programming for the world's leading Outlook plugin, focusing particularly on the .NET/COM bridge, Win32 API hooks (e.g. subclassing Windows messages), and COM Addin support. I was also one of two engineers to refactor the plugin to support x64. Software Engineer Xobni November 2009  –  July 2013  (3 years 9 months) Worked on Xobni’s generic out of box/on-boarding application. It's a flexible, rich web client backed by Node.js. It is used by several web and native mobile clients to walk users through our login, signup, and third-party OAuth flows. \n \nI was one of the lead developers for a Chrome/Firefox/Safari extension that integrates Xobni functionality with GMail (https://www.xobni.com/download/gmail). This is a single-page HTML5/Javascript application that uses Xobni's cloud API to fetch rich contact data to display as the user interacts with email messages in GMail. \n \nBuilt a CardDAV server for Xobni contacts in Node.js (on top of jsDAV). This allows the iPhone and OSX Address Book, for example, to sync locally a user's Xobni contacts without a special Xobni client. This is an ongoing pet project. \n \nBuilt an LDAP adapter for Xobni contacts in Node.js (on top of ldapjs). This allows the iPhone and other LDAP clients to perform LDAP directory searches against a user's Xobni contacts.  \n \nVarious nodejs/Express services to showcase Xobni's data. \n \nC#/.NET programming for the world's leading Outlook plugin, focusing particularly on the .NET/COM bridge, Win32 API hooks (e.g. subclassing Windows messages), and COM Addin support. I was also one of two engineers to refactor the plugin to support x64. Software Engineer Gaia Online March 2008  –  November 2009  (1 year 9 months) Senior Flex 3/ActionScript 3.0 developer for zOMG! \n \nI added many game features, but was particularly focused on optimization and efficiency issues (e.g. finding and fixing reasons for low frame rates and excessive garbage collection). \n \nI helped spearhead the project to retroactively add Flex to the game, and architected a new UI framework based on Flex modules. I also implemented several new and improved UI elements. \n \nI wrote the MMO's wrapper around AOL’s ActionScript AIM API (wimas3), implementing chat over AIM for the game. \n \nGaia had no build process for its front-end applications when I joined, so I created a continuous integration system, back-porting several projects to use it, including zOMG! Software Engineer Gaia Online March 2008  –  November 2009  (1 year 9 months) Senior Flex 3/ActionScript 3.0 developer for zOMG! \n \nI added many game features, but was particularly focused on optimization and efficiency issues (e.g. finding and fixing reasons for low frame rates and excessive garbage collection). \n \nI helped spearhead the project to retroactively add Flex to the game, and architected a new UI framework based on Flex modules. I also implemented several new and improved UI elements. \n \nI wrote the MMO's wrapper around AOL’s ActionScript AIM API (wimas3), implementing chat over AIM for the game. \n \nGaia had no build process for its front-end applications when I joined, so I created a continuous integration system, back-porting several projects to use it, including zOMG! Senior Software Engineer Yahoo! June 2006  –  March 2008  (1 year 10 months) Senior developer for a Flex 3/ActionScript 3.0 implementation of Y! Messenger for the Web \n \nI was one of the key architects and implementers of Yahoo!’s web messenger product, built using ActionScript 3.0 and the Flex 3 framework. I also designed and built a continuous build system for the project. This product was spun off into JetBlue’s instant messenger solution on its planes in flight. \n \nThe product was also spun off into myM, a web messenger product that integrated messages, wall posts, vitality information, etc. from Facebook, MySpace, and AIM. myM was released in beta internally and to some test groups with much acclaim, but Yahoo! shelved the product in early 2007 before releasing it to the general public. Senior Software Engineer Yahoo! June 2006  –  March 2008  (1 year 10 months) Senior developer for a Flex 3/ActionScript 3.0 implementation of Y! Messenger for the Web \n \nI was one of the key architects and implementers of Yahoo!’s web messenger product, built using ActionScript 3.0 and the Flex 3 framework. I also designed and built a continuous build system for the project. This product was spun off into JetBlue’s instant messenger solution on its planes in flight. \n \nThe product was also spun off into myM, a web messenger product that integrated messages, wall posts, vitality information, etc. from Facebook, MySpace, and AIM. myM was released in beta internally and to some test groups with much acclaim, but Yahoo! shelved the product in early 2007 before releasing it to the general public. Staff Software Engineer Intuit February 2005  –  June 2006  (1 year 5 months) Served as technical lead for a team of five regular (and sometimes as many as ten) developers refactoring the QuickBooks code base to remove the limits on the number of elements in a QuickBooks list (these are feature-level lists, such as the Customer List, Vendor List, Item List, etc.). Essentially, this involved changing a fundamental data type used in a very large codebase. Because the list subsystem and this data type permeated the codebase, the project had tremendous impact on the product and required changes to almost every major piece of functionality in QuickBooks (approximately 200,000 lines of code were changed across more than 20 modules); it also posed particular problems for serialization code and external (e.g. API) clients. The challenges in the project included rooting out what portions of the codebase (often old and undocumented) would be affected, figuring out how to change them, and helping to manage and coordinate a very large set of changes. \n \nCritical to the success of the project was my development of an instrumentation class to cause compilation errors in many places where we missed changing one of these fundamental data types. Staff Software Engineer Intuit February 2005  –  June 2006  (1 year 5 months) Served as technical lead for a team of five regular (and sometimes as many as ten) developers refactoring the QuickBooks code base to remove the limits on the number of elements in a QuickBooks list (these are feature-level lists, such as the Customer List, Vendor List, Item List, etc.). Essentially, this involved changing a fundamental data type used in a very large codebase. Because the list subsystem and this data type permeated the codebase, the project had tremendous impact on the product and required changes to almost every major piece of functionality in QuickBooks (approximately 200,000 lines of code were changed across more than 20 modules); it also posed particular problems for serialization code and external (e.g. API) clients. The challenges in the project included rooting out what portions of the codebase (often old and undocumented) would be affected, figuring out how to change them, and helping to manage and coordinate a very large set of changes. \n \nCritical to the success of the project was my development of an instrumentation class to cause compilation errors in many places where we missed changing one of these fundamental data types. Lead Software Engineer FactSet Research Systems January 2004  –  January 2005  (1 year 1 month) Lead architect and programmer for many solutions that integrated FactSet’s data with Microsoft Office (Active Publishing Workstation (APW) and the FactSet-Excel Link), using C++, COM, ActiveX, Win32, DDE, Excel's binary file format, and VBA. \n \nAPW was FactSet’s publishing solution, allowing users to populate and update Office documents with FactSet financial data; the FactSet-Excel Link allowed clients to integrate FactSet data into their spreadsheets in a myriad of ways, including the exporting server-based reports to Excel (using XML and HTML), providing custom worksheet functions to retrieve FactSet data, real-time updates in Excel cells (using DDE), and merging requested FactSet data into Excel files on disk by manipulating the Excel file format (BIFF). \n \nHelped spearhead FactSet’s transition from multibyte to Unicode in its PC applications. Wrote the code to enable all the Office integration products and features to support Unicode. Lead Software Engineer FactSet Research Systems January 2004  –  January 2005  (1 year 1 month) Lead architect and programmer for many solutions that integrated FactSet’s data with Microsoft Office (Active Publishing Workstation (APW) and the FactSet-Excel Link), using C++, COM, ActiveX, Win32, DDE, Excel's binary file format, and VBA. \n \nAPW was FactSet’s publishing solution, allowing users to populate and update Office documents with FactSet financial data; the FactSet-Excel Link allowed clients to integrate FactSet data into their spreadsheets in a myriad of ways, including the exporting server-based reports to Excel (using XML and HTML), providing custom worksheet functions to retrieve FactSet data, real-time updates in Excel cells (using DDE), and merging requested FactSet data into Excel files on disk by manipulating the Excel file format (BIFF). \n \nHelped spearhead FactSet’s transition from multibyte to Unicode in its PC applications. Wrote the code to enable all the Office integration products and features to support Unicode. Senior Software Engineer, Lead Excel developer FactSet Research Systems October 2001  –  January 2004  (2 years 4 months) Rearchitected FactSet's Excel spreadsheet updating functionality (called Data Downloading), replacing a difficult to maintain and to enhance algorithm involving file format manipulation with an algorithm based on OLE automation of Excel and HTML/XML/CSS. This enabled several important enhancements that were outstanding requests for many years. The process involved touching a great deal of low-level code and modifying FactSet's proprietary protocols for transmitting data. \n \nRearchitected FactSet's mechanism for exporting online reports to Excel, replacing a DDE-based mechanism with an XML/HTML/clipboard based one. Based on my architecture and leadership, FactSet is now able to export reports to PowerPoint presentations and to Word documents. \n \nImplemented linking of Excel cells populated with FactSet data to online documents from which the data was pulled, architecting a solution that uses a custom URL protocol and COM. Senior Software Engineer, Lead Excel developer FactSet Research Systems October 2001  –  January 2004  (2 years 4 months) Rearchitected FactSet's Excel spreadsheet updating functionality (called Data Downloading), replacing a difficult to maintain and to enhance algorithm involving file format manipulation with an algorithm based on OLE automation of Excel and HTML/XML/CSS. This enabled several important enhancements that were outstanding requests for many years. The process involved touching a great deal of low-level code and modifying FactSet's proprietary protocols for transmitting data. \n \nRearchitected FactSet's mechanism for exporting online reports to Excel, replacing a DDE-based mechanism with an XML/HTML/clipboard based one. Based on my architecture and leadership, FactSet is now able to export reports to PowerPoint presentations and to Word documents. \n \nImplemented linking of Excel cells populated with FactSet data to online documents from which the data was pulled, architecting a solution that uses a custom URL protocol and COM. Software Engineer FactSet Software Systems October 1998  –  October 2001  (3 years 1 month) Taught myself C++, COM, MFC, and the Windows API after not having programmed in C for 10 years. \n \nVarious enhancements to FactSet's home-grown thin client, using C++, MFC, and the Windows API. \n \nRearchitected FactSet's custom worksheet function for retrieving user-requested data. Converted the code from an old Excel C API to using Excel OLE automation, fixed many bugs, and implemented many enhancements and stabilizations. Software Engineer FactSet Software Systems October 1998  –  October 2001  (3 years 1 month) Taught myself C++, COM, MFC, and the Windows API after not having programmed in C for 10 years. \n \nVarious enhancements to FactSet's home-grown thin client, using C++, MFC, and the Windows API. \n \nRearchitected FactSet's custom worksheet function for retrieving user-requested data. Converted the code from an old Excel C API to using Excel OLE automation, fixed many bugs, and implemented many enhancements and stabilizations. Instructor, Teaching Assistant Johns Hopkins University, Center for Talented Youth January 1985  –  January 1997  (12 years 1 month) Instructor and co-author of a text for Introduction to Theoretical Computer Science at Johns Hopkins Center for Talented Youth (CTY) summer program. Johns Hopkins’ CTY program allows academically gifted junior high school and high school students to study college and graduate level material over the summer. In a single three week session, they learned in my course Pascal or Scheme; Propositional Logic; finite state automata theory; the Chomsky hierarchy; and Turing Machines and undecidability. Since no course like this exists elsewhere, a co-author and I devised a 200+ page textbook to serve as the course text. Instructor, Teaching Assistant Johns Hopkins University, Center for Talented Youth January 1985  –  January 1997  (12 years 1 month) Instructor and co-author of a text for Introduction to Theoretical Computer Science at Johns Hopkins Center for Talented Youth (CTY) summer program. Johns Hopkins’ CTY program allows academically gifted junior high school and high school students to study college and graduate level material over the summer. In a single three week session, they learned in my course Pascal or Scheme; Propositional Logic; finite state automata theory; the Chomsky hierarchy; and Turing Machines and undecidability. Since no course like this exists elsewhere, a co-author and I devised a 200+ page textbook to serve as the course text. Skills HTML Agile Methodologies Git C++ Software Engineering JavaScript REST ActiveX AJAX XML Software Development Java Flex Foosball Skills  HTML Agile Methodologies Git C++ Software Engineering JavaScript REST ActiveX AJAX XML Software Development Java Flex Foosball HTML Agile Methodologies Git C++ Software Engineering JavaScript REST ActiveX AJAX XML Software Development Java Flex Foosball HTML Agile Methodologies Git C++ Software Engineering JavaScript REST ActiveX AJAX XML Software Development Java Flex Foosball Education University of California, Los Angeles Ph. D.,  Philosophy 1991  – 1998 Princeton University A. B,  Philosophy 1986  – 1990 University of California, Los Angeles Ph. D.,  Philosophy 1991  – 1998 University of California, Los Angeles Ph. D.,  Philosophy 1991  – 1998 University of California, Los Angeles Ph. D.,  Philosophy 1991  – 1998 Princeton University A. B,  Philosophy 1986  – 1990 Princeton University A. B,  Philosophy 1986  – 1990 Princeton University A. B,  Philosophy 1986  – 1990 ", "Summary Senior Software engineer with experience developing big data ETL and analytics systems. I have worked on several end-to-end projects using native Hadoop MapReduce, Spark, Hive, Pig, HBase, Oozie, HCatalog, time series analysis, and machine learning. Summary Senior Software engineer with experience developing big data ETL and analytics systems. I have worked on several end-to-end projects using native Hadoop MapReduce, Spark, Hive, Pig, HBase, Oozie, HCatalog, time series analysis, and machine learning. Senior Software engineer with experience developing big data ETL and analytics systems. I have worked on several end-to-end projects using native Hadoop MapReduce, Spark, Hive, Pig, HBase, Oozie, HCatalog, time series analysis, and machine learning. Senior Software engineer with experience developing big data ETL and analytics systems. I have worked on several end-to-end projects using native Hadoop MapReduce, Spark, Hive, Pig, HBase, Oozie, HCatalog, time series analysis, and machine learning. Experience Senior Software Engineer - Advertising and Data Yahoo April 2014  – Present (1 year 5 months) Sunnyvale, CA • Developed next generation audience ETL data pipeline using the Hadoop stack. \n• Scaled data pipeline from ~40 billion events per day to ~180 billion events per day. \n• Designed and implemented data pipeline auditing system for Sarbanes–Oxley compliance. \n• Responsible for Spark platform evaluation for use in ETL data pipelines. \n• Participated in 6+ on campus recruiting and interviewing trips at UCSD and UW. Software Engineer - Advertising and Data Yahoo March 2013  –  April 2014  (1 year 2 months) Sunnyvale, CA • Developed analytics system to analyze and predict social web traffic patterns. \n• Developed time series prediction algorithm to forecast social web 'viral' events. \n• Lead team in experimentation with artificial neural networks and statistical regression models. \n• Developed Oozie data pipeline, Pig scripts, and maintained MySQL database with LiquiBase. Associate Software Engineer - Advertising and Data Yahoo July 2012  –  March 2013  (9 months) Sunnyvale, CA • Designed and implemented a REST API for tagging software artifacts using Groovy/Grails. \n• Developed client interface to software artifact REST API. \n• Presented several company tech talks on TDD and BDD best practices. Intern Software Engineer - Advertising and Data Yahoo June 2011  –  September 2011  (4 months) Santa Clara CA • Implemented software test standards enforcement crawler. \n• Designed and implemented a build failure analysis dashboard for Jenkins. \n• Developed and extended architecture graph visualization DSL and related web service. Senior Software Engineer - Advertising and Data Yahoo April 2014  – Present (1 year 5 months) Sunnyvale, CA • Developed next generation audience ETL data pipeline using the Hadoop stack. \n• Scaled data pipeline from ~40 billion events per day to ~180 billion events per day. \n• Designed and implemented data pipeline auditing system for Sarbanes–Oxley compliance. \n• Responsible for Spark platform evaluation for use in ETL data pipelines. \n• Participated in 6+ on campus recruiting and interviewing trips at UCSD and UW. Senior Software Engineer - Advertising and Data Yahoo April 2014  – Present (1 year 5 months) Sunnyvale, CA • Developed next generation audience ETL data pipeline using the Hadoop stack. \n• Scaled data pipeline from ~40 billion events per day to ~180 billion events per day. \n• Designed and implemented data pipeline auditing system for Sarbanes–Oxley compliance. \n• Responsible for Spark platform evaluation for use in ETL data pipelines. \n• Participated in 6+ on campus recruiting and interviewing trips at UCSD and UW. Software Engineer - Advertising and Data Yahoo March 2013  –  April 2014  (1 year 2 months) Sunnyvale, CA • Developed analytics system to analyze and predict social web traffic patterns. \n• Developed time series prediction algorithm to forecast social web 'viral' events. \n• Lead team in experimentation with artificial neural networks and statistical regression models. \n• Developed Oozie data pipeline, Pig scripts, and maintained MySQL database with LiquiBase. Software Engineer - Advertising and Data Yahoo March 2013  –  April 2014  (1 year 2 months) Sunnyvale, CA • Developed analytics system to analyze and predict social web traffic patterns. \n• Developed time series prediction algorithm to forecast social web 'viral' events. \n• Lead team in experimentation with artificial neural networks and statistical regression models. \n• Developed Oozie data pipeline, Pig scripts, and maintained MySQL database with LiquiBase. Associate Software Engineer - Advertising and Data Yahoo July 2012  –  March 2013  (9 months) Sunnyvale, CA • Designed and implemented a REST API for tagging software artifacts using Groovy/Grails. \n• Developed client interface to software artifact REST API. \n• Presented several company tech talks on TDD and BDD best practices. Associate Software Engineer - Advertising and Data Yahoo July 2012  –  March 2013  (9 months) Sunnyvale, CA • Designed and implemented a REST API for tagging software artifacts using Groovy/Grails. \n• Developed client interface to software artifact REST API. \n• Presented several company tech talks on TDD and BDD best practices. Intern Software Engineer - Advertising and Data Yahoo June 2011  –  September 2011  (4 months) Santa Clara CA • Implemented software test standards enforcement crawler. \n• Designed and implemented a build failure analysis dashboard for Jenkins. \n• Developed and extended architecture graph visualization DSL and related web service. Intern Software Engineer - Advertising and Data Yahoo June 2011  –  September 2011  (4 months) Santa Clara CA • Implemented software test standards enforcement crawler. \n• Designed and implemented a build failure analysis dashboard for Jenkins. \n• Developed and extended architecture graph visualization DSL and related web service. Languages   Skills Java Hadoop Perl Web Services Scalability Oozie Git REST Data Mining Python Apache Pig HBase Distributed Systems MapReduce Test Driven Development Big Data Software Development Groovy Machine Learning SQL ETL Clojure Scala Hive lisp Haskell Scrum Agile Kanban See 14+     See less Skills  Java Hadoop Perl Web Services Scalability Oozie Git REST Data Mining Python Apache Pig HBase Distributed Systems MapReduce Test Driven Development Big Data Software Development Groovy Machine Learning SQL ETL Clojure Scala Hive lisp Haskell Scrum Agile Kanban See 14+     See less Java Hadoop Perl Web Services Scalability Oozie Git REST Data Mining Python Apache Pig HBase Distributed Systems MapReduce Test Driven Development Big Data Software Development Groovy Machine Learning SQL ETL Clojure Scala Hive lisp Haskell Scrum Agile Kanban See 14+     See less Java Hadoop Perl Web Services Scalability Oozie Git REST Data Mining Python Apache Pig HBase Distributed Systems MapReduce Test Driven Development Big Data Software Development Groovy Machine Learning SQL ETL Clojure Scala Hive lisp Haskell Scrum Agile Kanban See 14+     See less Education University of California, San Diego Bachelor of Science,  Computer Science 2008  – 2012 UC San Diego - Extension Graduate Certificate, Data Mining,  Computer Science 2012  – 2013 University of California, San Diego Bachelor of Science,  Computer Science 2008  – 2012 University of California, San Diego Bachelor of Science,  Computer Science 2008  – 2012 University of California, San Diego Bachelor of Science,  Computer Science 2008  – 2012 UC San Diego - Extension Graduate Certificate, Data Mining,  Computer Science 2012  – 2013 UC San Diego - Extension Graduate Certificate, Data Mining,  Computer Science 2012  – 2013 UC San Diego - Extension Graduate Certificate, Data Mining,  Computer Science 2012  – 2013 Honors & Awards Provost Honors UCSD November 2010 Provost Honors UCSD June 2012 Yahoo Q4 2013 Hackday Yahoo November 2013 Won company hack day competition for best mobile app, which displayed socially trending pages. Provost Honors UCSD November 2010 Provost Honors UCSD November 2010 Provost Honors UCSD November 2010 Provost Honors UCSD June 2012 Provost Honors UCSD June 2012 Provost Honors UCSD June 2012 Yahoo Q4 2013 Hackday Yahoo November 2013 Won company hack day competition for best mobile app, which displayed socially trending pages. Yahoo Q4 2013 Hackday Yahoo November 2013 Won company hack day competition for best mobile app, which displayed socially trending pages. Yahoo Q4 2013 Hackday Yahoo November 2013 Won company hack day competition for best mobile app, which displayed socially trending pages. ", "Summary Technical Leader for Yahoo Front Doors and communities team. \n \nBefore joining Yahoo, was developing for the web at top players of the Brazilian market. Always up to date with the latest technologies, standards and trends. \n \nAcademic education in Product Design, with great knowledge about usability. Fluent in Portuguese and English. \n \nExperience in requirements gathering and documentation, information and content architecture and prototype development. \n \n--- \nlast update 2009 Specialties:Effective knowledge of most common computer languages and design patterns. \nbrowser peculiarities. Javascript, css, Ajax, SEO. \nSocial networks. User contributed content. News and content management systems. Service integration. Data visualization. Summary Technical Leader for Yahoo Front Doors and communities team. \n \nBefore joining Yahoo, was developing for the web at top players of the Brazilian market. Always up to date with the latest technologies, standards and trends. \n \nAcademic education in Product Design, with great knowledge about usability. Fluent in Portuguese and English. \n \nExperience in requirements gathering and documentation, information and content architecture and prototype development. \n \n--- \nlast update 2009 Specialties:Effective knowledge of most common computer languages and design patterns. \nbrowser peculiarities. Javascript, css, Ajax, SEO. \nSocial networks. User contributed content. News and content management systems. Service integration. Data visualization. Technical Leader for Yahoo Front Doors and communities team. \n \nBefore joining Yahoo, was developing for the web at top players of the Brazilian market. Always up to date with the latest technologies, standards and trends. \n \nAcademic education in Product Design, with great knowledge about usability. Fluent in Portuguese and English. \n \nExperience in requirements gathering and documentation, information and content architecture and prototype development. \n \n--- \nlast update 2009 Specialties:Effective knowledge of most common computer languages and design patterns. \nbrowser peculiarities. Javascript, css, Ajax, SEO. \nSocial networks. User contributed content. News and content management systems. Service integration. Data visualization. Technical Leader for Yahoo Front Doors and communities team. \n \nBefore joining Yahoo, was developing for the web at top players of the Brazilian market. Always up to date with the latest technologies, standards and trends. \n \nAcademic education in Product Design, with great knowledge about usability. Fluent in Portuguese and English. \n \nExperience in requirements gathering and documentation, information and content architecture and prototype development. \n \n--- \nlast update 2009 Specialties:Effective knowledge of most common computer languages and design patterns. \nbrowser peculiarities. Javascript, css, Ajax, SEO. \nSocial networks. User contributed content. News and content management systems. Service integration. Data visualization. Experience Software Engineer, Sr. Yahoo! March 2010  – Present (5 years 6 months) Improving delivery and privacy on Display Advertising. Software Engineer Yahoo! Brazil March 2009  –  February 2010  (1 year) Social Applications innovation Team for Latin America and Southeast Asia. \nMember of the regional Security task force (Local paranoid). Software Engineer, Tech Lead Yahoo! Brazil August 2008  –  March 2009  (8 months) Technical Leader for Yahoo Front Doors and communities team. \nResponsible for Americas' front page infrastructure. \nMember of the regional Security task force (Local paranoid). Software Engineer Yahoo! Brazil December 2007  –  August 2008  (9 months) Joined the Americas Platform Team. Solutions deployed at Brazil, Argentina, Mexico, U.S (espanol.yahoo.com), Canada (incl. french). \nLater, active role on expanding to Chile, Colombia, Venezuela and Peru. Responsible from Web Front end user interface to backend infrastructure. \nPart of the global Performance task force. \nOrganized the First Latin America Internal Hack Day. Software Engineer Yahoo! September 2006  –  December 2007  (1 year 4 months) joined the search marketing team. Worked with an experienced team that came to Yahoo in the acquisition of TeRespondo.com (the first SEM network in Brazil, Mexico and Argentina) to improve and maintain the platform. Helped to roll it out to Indian markets. Introduced the team to effective version control usage and agile development, while learned a lot about internationalization, indexing, and search algorithms. \nTook initiative to help whenever possible with user interface improvement. Senior Developer Catho Online February 2005  –  April 2006  (1 year 3 months) The biggest Brazilian jobs portal. Unfortunately also famous for mass mail marketing. \nJoined the NetQI team, a social networking website, created initially to be a brazillian Linkedin, but later changed to became an Orkut clone. \nRefactored the initial code and architecture, as to allow new features to be implemented gradually. \nBesides implementing new features I actively coordinated the planning and implementation of a development and testing environment, and QA concepts --later adopted thorough the company, where I was responsible for the training. \nIn face of the crescent success of the website, I Designed a new storage architecture that made better use of NFS (sharding and cache tweaks), later adopted by every other company project. \nAmong the new features implemented was a feature rich, real time, web based, Instant Messaging application, using Ajax. Webmaster UOL inc. September 2003  –  February 2005  (1 year 6 months) UOL is the biggest portal in Brazil. Launched new media properties and update their existing sites to more maintainable and standards compliant formats. \nHelped enabling video content for Linux and mac users on their live streaming news sites. \n \nLearned a lot about scalability and the benefits of incremental launches. Owner nazsco 2002  –  2004  (2 years) My second adventure in opening a company. Clients ranged from small 5 people offices to Universities. Consulting jobs ranged from websites for non-profit organizations, CMS for universities to custom unix solutions for research laboratories. \n \nLater went back to retail software and focused on the car dealerships market. Tapped the market by being the only product that had a relevant online listing. Mostly thanks to SEO techniques still largely ignored by the competition. Webmaster Folha de S.Paulo March 1999  –  September 2003  (4 years 7 months) Helped build and launch, from the ground up, the first online newspaper in Brazil, ‘Folha Online’, the website for Brazil’s top newspaper Folha de São Paulo. \nIn 2000, going beyond my expected duties, and after analyzing data from informal usability tests with users, Reduced noticeable loading time on the homepage by breaking the layout table in several blocks (the lazy loading technique of the table design era!). A simple solution that proved worth on a medium were the reader's attention span last a few seconds, and where most of users were still on dial up. The website became the most visited on Brazil that year. Developer Self Employed 1997  –  2000  (3 years) Retail automation. Initially creating versions for Windows 32 bits from software originally written in Clipper; \nLater innovating the market with never seen before Business Intelligence and Data Visualizations on such commodity products. Acquired strong retail market (and sadly, windows API) knowledge Software Engineer, Sr. Yahoo! March 2010  – Present (5 years 6 months) Improving delivery and privacy on Display Advertising. Software Engineer, Sr. Yahoo! March 2010  – Present (5 years 6 months) Improving delivery and privacy on Display Advertising. Software Engineer Yahoo! Brazil March 2009  –  February 2010  (1 year) Social Applications innovation Team for Latin America and Southeast Asia. \nMember of the regional Security task force (Local paranoid). Software Engineer Yahoo! Brazil March 2009  –  February 2010  (1 year) Social Applications innovation Team for Latin America and Southeast Asia. \nMember of the regional Security task force (Local paranoid). Software Engineer, Tech Lead Yahoo! Brazil August 2008  –  March 2009  (8 months) Technical Leader for Yahoo Front Doors and communities team. \nResponsible for Americas' front page infrastructure. \nMember of the regional Security task force (Local paranoid). Software Engineer, Tech Lead Yahoo! Brazil August 2008  –  March 2009  (8 months) Technical Leader for Yahoo Front Doors and communities team. \nResponsible for Americas' front page infrastructure. \nMember of the regional Security task force (Local paranoid). Software Engineer Yahoo! Brazil December 2007  –  August 2008  (9 months) Joined the Americas Platform Team. Solutions deployed at Brazil, Argentina, Mexico, U.S (espanol.yahoo.com), Canada (incl. french). \nLater, active role on expanding to Chile, Colombia, Venezuela and Peru. Responsible from Web Front end user interface to backend infrastructure. \nPart of the global Performance task force. \nOrganized the First Latin America Internal Hack Day. Software Engineer Yahoo! Brazil December 2007  –  August 2008  (9 months) Joined the Americas Platform Team. Solutions deployed at Brazil, Argentina, Mexico, U.S (espanol.yahoo.com), Canada (incl. french). \nLater, active role on expanding to Chile, Colombia, Venezuela and Peru. Responsible from Web Front end user interface to backend infrastructure. \nPart of the global Performance task force. \nOrganized the First Latin America Internal Hack Day. Software Engineer Yahoo! September 2006  –  December 2007  (1 year 4 months) joined the search marketing team. Worked with an experienced team that came to Yahoo in the acquisition of TeRespondo.com (the first SEM network in Brazil, Mexico and Argentina) to improve and maintain the platform. Helped to roll it out to Indian markets. Introduced the team to effective version control usage and agile development, while learned a lot about internationalization, indexing, and search algorithms. \nTook initiative to help whenever possible with user interface improvement. Software Engineer Yahoo! September 2006  –  December 2007  (1 year 4 months) joined the search marketing team. Worked with an experienced team that came to Yahoo in the acquisition of TeRespondo.com (the first SEM network in Brazil, Mexico and Argentina) to improve and maintain the platform. Helped to roll it out to Indian markets. Introduced the team to effective version control usage and agile development, while learned a lot about internationalization, indexing, and search algorithms. \nTook initiative to help whenever possible with user interface improvement. Senior Developer Catho Online February 2005  –  April 2006  (1 year 3 months) The biggest Brazilian jobs portal. Unfortunately also famous for mass mail marketing. \nJoined the NetQI team, a social networking website, created initially to be a brazillian Linkedin, but later changed to became an Orkut clone. \nRefactored the initial code and architecture, as to allow new features to be implemented gradually. \nBesides implementing new features I actively coordinated the planning and implementation of a development and testing environment, and QA concepts --later adopted thorough the company, where I was responsible for the training. \nIn face of the crescent success of the website, I Designed a new storage architecture that made better use of NFS (sharding and cache tweaks), later adopted by every other company project. \nAmong the new features implemented was a feature rich, real time, web based, Instant Messaging application, using Ajax. Senior Developer Catho Online February 2005  –  April 2006  (1 year 3 months) The biggest Brazilian jobs portal. Unfortunately also famous for mass mail marketing. \nJoined the NetQI team, a social networking website, created initially to be a brazillian Linkedin, but later changed to became an Orkut clone. \nRefactored the initial code and architecture, as to allow new features to be implemented gradually. \nBesides implementing new features I actively coordinated the planning and implementation of a development and testing environment, and QA concepts --later adopted thorough the company, where I was responsible for the training. \nIn face of the crescent success of the website, I Designed a new storage architecture that made better use of NFS (sharding and cache tweaks), later adopted by every other company project. \nAmong the new features implemented was a feature rich, real time, web based, Instant Messaging application, using Ajax. Webmaster UOL inc. September 2003  –  February 2005  (1 year 6 months) UOL is the biggest portal in Brazil. Launched new media properties and update their existing sites to more maintainable and standards compliant formats. \nHelped enabling video content for Linux and mac users on their live streaming news sites. \n \nLearned a lot about scalability and the benefits of incremental launches. Webmaster UOL inc. September 2003  –  February 2005  (1 year 6 months) UOL is the biggest portal in Brazil. Launched new media properties and update their existing sites to more maintainable and standards compliant formats. \nHelped enabling video content for Linux and mac users on their live streaming news sites. \n \nLearned a lot about scalability and the benefits of incremental launches. Owner nazsco 2002  –  2004  (2 years) My second adventure in opening a company. Clients ranged from small 5 people offices to Universities. Consulting jobs ranged from websites for non-profit organizations, CMS for universities to custom unix solutions for research laboratories. \n \nLater went back to retail software and focused on the car dealerships market. Tapped the market by being the only product that had a relevant online listing. Mostly thanks to SEO techniques still largely ignored by the competition. Owner nazsco 2002  –  2004  (2 years) My second adventure in opening a company. Clients ranged from small 5 people offices to Universities. Consulting jobs ranged from websites for non-profit organizations, CMS for universities to custom unix solutions for research laboratories. \n \nLater went back to retail software and focused on the car dealerships market. Tapped the market by being the only product that had a relevant online listing. Mostly thanks to SEO techniques still largely ignored by the competition. Webmaster Folha de S.Paulo March 1999  –  September 2003  (4 years 7 months) Helped build and launch, from the ground up, the first online newspaper in Brazil, ‘Folha Online’, the website for Brazil’s top newspaper Folha de São Paulo. \nIn 2000, going beyond my expected duties, and after analyzing data from informal usability tests with users, Reduced noticeable loading time on the homepage by breaking the layout table in several blocks (the lazy loading technique of the table design era!). A simple solution that proved worth on a medium were the reader's attention span last a few seconds, and where most of users were still on dial up. The website became the most visited on Brazil that year. Webmaster Folha de S.Paulo March 1999  –  September 2003  (4 years 7 months) Helped build and launch, from the ground up, the first online newspaper in Brazil, ‘Folha Online’, the website for Brazil’s top newspaper Folha de São Paulo. \nIn 2000, going beyond my expected duties, and after analyzing data from informal usability tests with users, Reduced noticeable loading time on the homepage by breaking the layout table in several blocks (the lazy loading technique of the table design era!). A simple solution that proved worth on a medium were the reader's attention span last a few seconds, and where most of users were still on dial up. The website became the most visited on Brazil that year. Developer Self Employed 1997  –  2000  (3 years) Retail automation. Initially creating versions for Windows 32 bits from software originally written in Clipper; \nLater innovating the market with never seen before Business Intelligence and Data Visualizations on such commodity products. Acquired strong retail market (and sadly, windows API) knowledge Developer Self Employed 1997  –  2000  (3 years) Retail automation. Initially creating versions for Windows 32 bits from software originally written in Clipper; \nLater innovating the market with never seen before Business Intelligence and Data Visualizations on such commodity products. Acquired strong retail market (and sadly, windows API) knowledge Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Front-end Development Usability Front-end CSS SEO JavaScript HTML Information Architecture Web Development Agile Methodologies AJAX Web Applications Unix JSON SEM E-commerce User Interface PHP User Interface Design REST Scrum Software Development Perl Apache User Experience MySQL Python Design Patterns Git Mobile Devices LAMP OOP Mobile Applications Linux Objective-C Subversion Shell Scripting Ruby Hadoop Bash Open Source Scalability CMS Object Oriented Design Continuous Integration Ruby on Rails Distributed Systems jQuery HTML 5 Software Engineering See 35+     See less Skills  Front-end Development Usability Front-end CSS SEO JavaScript HTML Information Architecture Web Development Agile Methodologies AJAX Web Applications Unix JSON SEM E-commerce User Interface PHP User Interface Design REST Scrum Software Development Perl Apache User Experience MySQL Python Design Patterns Git Mobile Devices LAMP OOP Mobile Applications Linux Objective-C Subversion Shell Scripting Ruby Hadoop Bash Open Source Scalability CMS Object Oriented Design Continuous Integration Ruby on Rails Distributed Systems jQuery HTML 5 Software Engineering See 35+     See less Front-end Development Usability Front-end CSS SEO JavaScript HTML Information Architecture Web Development Agile Methodologies AJAX Web Applications Unix JSON SEM E-commerce User Interface PHP User Interface Design REST Scrum Software Development Perl Apache User Experience MySQL Python Design Patterns Git Mobile Devices LAMP OOP Mobile Applications Linux Objective-C Subversion Shell Scripting Ruby Hadoop Bash Open Source Scalability CMS Object Oriented Design Continuous Integration Ruby on Rails Distributed Systems jQuery HTML 5 Software Engineering See 35+     See less Front-end Development Usability Front-end CSS SEO JavaScript HTML Information Architecture Web Development Agile Methodologies AJAX Web Applications Unix JSON SEM E-commerce User Interface PHP User Interface Design REST Scrum Software Development Perl Apache User Experience MySQL Python Design Patterns Git Mobile Devices LAMP OOP Mobile Applications Linux Objective-C Subversion Shell Scripting Ruby Hadoop Bash Open Source Scalability CMS Object Oriented Design Continuous Integration Ruby on Rails Distributed Systems jQuery HTML 5 Software Engineering See 35+     See less Education Centro Universitário Belas Artes de São Paulo BAAS,  Product Design 2003  – 2007 Activities and Societies:  Project Management Centro Universitário Belas Artes de São Paulo BAAS,  Product Design 2003  – 2007 Activities and Societies:  Project Management Centro Universitário Belas Artes de São Paulo BAAS,  Product Design 2003  – 2007 Activities and Societies:  Project Management Centro Universitário Belas Artes de São Paulo BAAS,  Product Design 2003  – 2007 Activities and Societies:  Project Management ", "Experience Senior Software Engineer Yahoo (Yahoo Marketing Analytics) June 2014  – Present (1 year 3 months) Sunnyvale, CA - Big data/data mining \n- Measuring advertising effectiveness \n- Data insights. \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Senior Software Engineer Yahoo (Yahoo Search) October 2011  –  June 2014  (2 years 9 months) Sunnyvale, CA - Big data/data mining. \n- Data insights.  \n- Search result / ads \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Software Engineer Yahoo (Yahoo Research) August 2010  –  September 2011  (1 year 2 months) Sunnyvale, CA - Big data/data mining. \n- Measuring the effects of advertising. \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Software Engineer Yahoo (Yahoo Search) June 2007  –  July 2010  (3 years 2 months) Sunnyvale, ca - Big data/data mining.  \n- Yahoo search results / ads \n- Bucket testing / AB test \n Software Engineer FutureDial September 2005  –  June 2007  (1 year 10 months) Sunnyvale, CA - Developed a mobile to desktop sync software.  Software Engineer Websitesource February 2005  –  August 2005  (7 months) Austin, Texas Area - Maintained and upgraded large number of server, network and security.  \n- Built and maintained web service processes.  IT Analyst The University of Texas at Austin December 2004  –  August 2005  (9 months) Austin, Texas Area - Managed software, hardware and IT network.  \n- Worked on several IT projects.  Senior Software Engineer Yahoo (Yahoo Marketing Analytics) June 2014  – Present (1 year 3 months) Sunnyvale, CA - Big data/data mining \n- Measuring advertising effectiveness \n- Data insights. \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Senior Software Engineer Yahoo (Yahoo Marketing Analytics) June 2014  – Present (1 year 3 months) Sunnyvale, CA - Big data/data mining \n- Measuring advertising effectiveness \n- Data insights. \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Senior Software Engineer Yahoo (Yahoo Search) October 2011  –  June 2014  (2 years 9 months) Sunnyvale, CA - Big data/data mining. \n- Data insights.  \n- Search result / ads \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Senior Software Engineer Yahoo (Yahoo Search) October 2011  –  June 2014  (2 years 9 months) Sunnyvale, CA - Big data/data mining. \n- Data insights.  \n- Search result / ads \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Software Engineer Yahoo (Yahoo Research) August 2010  –  September 2011  (1 year 2 months) Sunnyvale, CA - Big data/data mining. \n- Measuring the effects of advertising. \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Software Engineer Yahoo (Yahoo Research) August 2010  –  September 2011  (1 year 2 months) Sunnyvale, CA - Big data/data mining. \n- Measuring the effects of advertising. \n- Hadoop/Pig/Hive/Java/Map Reduce/Linux Software Engineer Yahoo (Yahoo Search) June 2007  –  July 2010  (3 years 2 months) Sunnyvale, ca - Big data/data mining.  \n- Yahoo search results / ads \n- Bucket testing / AB test \n Software Engineer Yahoo (Yahoo Search) June 2007  –  July 2010  (3 years 2 months) Sunnyvale, ca - Big data/data mining.  \n- Yahoo search results / ads \n- Bucket testing / AB test \n Software Engineer FutureDial September 2005  –  June 2007  (1 year 10 months) Sunnyvale, CA - Developed a mobile to desktop sync software.  Software Engineer FutureDial September 2005  –  June 2007  (1 year 10 months) Sunnyvale, CA - Developed a mobile to desktop sync software.  Software Engineer Websitesource February 2005  –  August 2005  (7 months) Austin, Texas Area - Maintained and upgraded large number of server, network and security.  \n- Built and maintained web service processes.  Software Engineer Websitesource February 2005  –  August 2005  (7 months) Austin, Texas Area - Maintained and upgraded large number of server, network and security.  \n- Built and maintained web service processes.  IT Analyst The University of Texas at Austin December 2004  –  August 2005  (9 months) Austin, Texas Area - Managed software, hardware and IT network.  \n- Worked on several IT projects.  IT Analyst The University of Texas at Austin December 2004  –  August 2005  (9 months) Austin, Texas Area - Managed software, hardware and IT network.  \n- Worked on several IT projects.  Skills Distributed Systems Java Scalability JavaScript Python Linux Perl Hadoop Skills  Distributed Systems Java Scalability JavaScript Python Linux Perl Hadoop Distributed Systems Java Scalability JavaScript Python Linux Perl Hadoop Distributed Systems Java Scalability JavaScript Python Linux Perl Hadoop Education The University of Texas at Austin Computer Science The University of Texas at Austin Computer Science The University of Texas at Austin Computer Science The University of Texas at Austin Computer Science ", "Summary Full stack software engineer with startup experience capable of beautiful UI development and scalable server solutions. Specialized in client development but with strong, diverse interests in server development. Interested in continuous education, bleeding edge technology, great user experiences, and collaboration with other talented, inspired teammates. Looking for exciting and challenging projects with opportunities to learn and grow my skill set. \n \nSpecialties and interests: Javascript, NodeJS, Hadoop, Java, C#, HTML, MySQL, Actionscript, Flex, Interaction Design, usability, performance, scalability, optimization, reusable platforms. Summary Full stack software engineer with startup experience capable of beautiful UI development and scalable server solutions. Specialized in client development but with strong, diverse interests in server development. Interested in continuous education, bleeding edge technology, great user experiences, and collaboration with other talented, inspired teammates. Looking for exciting and challenging projects with opportunities to learn and grow my skill set. \n \nSpecialties and interests: Javascript, NodeJS, Hadoop, Java, C#, HTML, MySQL, Actionscript, Flex, Interaction Design, usability, performance, scalability, optimization, reusable platforms. Full stack software engineer with startup experience capable of beautiful UI development and scalable server solutions. Specialized in client development but with strong, diverse interests in server development. Interested in continuous education, bleeding edge technology, great user experiences, and collaboration with other talented, inspired teammates. Looking for exciting and challenging projects with opportunities to learn and grow my skill set. \n \nSpecialties and interests: Javascript, NodeJS, Hadoop, Java, C#, HTML, MySQL, Actionscript, Flex, Interaction Design, usability, performance, scalability, optimization, reusable platforms. Full stack software engineer with startup experience capable of beautiful UI development and scalable server solutions. Specialized in client development but with strong, diverse interests in server development. Interested in continuous education, bleeding edge technology, great user experiences, and collaboration with other talented, inspired teammates. Looking for exciting and challenging projects with opportunities to learn and grow my skill set. \n \nSpecialties and interests: Javascript, NodeJS, Hadoop, Java, C#, HTML, MySQL, Actionscript, Flex, Interaction Design, usability, performance, scalability, optimization, reusable platforms. Experience Senior Software Engineer Yahoo July 2013  – Present (2 years 2 months) Sunnyvale, CA Senior Software Engineer Xobni December 2009  –  July 2013  (3 years 8 months) My broad technology interests have allowed me to work on a wide variety of projects. Here's some examples. \n- Team lead: Rewrote and optimized our data processing engine and server in NodeJS and MySQL \n- Team lead: Wrote our modern big data platform in Hadoop, Pig, NodeJS, and MySQL \n- Wrote lightweight browser extensions and comprehensive Gmail integration platform that accommodates sidebar injection, and custom autosuggest for use with Smartr Inbox for Gmail \n- Wrote several portions of Smartr Inbox for Gmail UI including message viewing, jumping to Gmail message,and recent history \n- Rewrote C# Xobni for Outlook plugin installation experience using finite state machine to accommodate various user flows. \n- Internationalized C# Xobni for Outlook plugin. \n- Cowrote link extraction and Facebook message integration into our Cloud infrastructure Software Engineer Gaia Interactive 2008  –  October 2009  (1 year) - Optimized memory usage and extensively refactored our fully featured Flash MMO, zOMG, into a reusable virtual worlds platform in Flex and Actionscript 3. Other, non game-related virtual worlds could take advantage of zOMG's rich feature set. \n- Built a game framework in Actionscript 3 to unify common features across new AS3 games and older AS2 games.  \n- Built a Flex application for a user's inventory management and trying on virtual clothing \n- Built Gaia's virtual prom event from existing components and dramatically decreased network load. Software Engineer Yahoo! January 2007  –  March 2008  (1 year 3 months) - Built custom Flex component for conversation area which included accurate emoticon placement and speech bubbles \n- Built Flex application that allowed users to build custom emoticons for sharing in conversations \n- Built custom Flex tab component to show chat activity in inactive tabs \n- Helped build lightweight login screen that loaded the Messenger application in the background IMVironment Engineer Yahoo! September 2005  –  December 2006  (1 year 4 months) An IMVironment is an interactive game or advertisement shown within a Yahoo! Messenger IM window written in Actionscript and Javascript \n- Built Actionscript 3 IMVironment library that we could deliver to clients to create and customize their own IMVs. \n- Built FIFA 2006 IMVironment under a tight deadline which showed live updating scores to users. \n- Worked with third parties such as Apple Jacks, Build-A-Bear, and US Army to design and build custom IMVironments Designer / Webmaster World Ahead Publishing January 2003  –  September 2005  (2 years 9 months) Prototype Design Intern Yahoo! 2005  –  2005  (less than a year) Multimedia Intern Boeing 2004  –  2004  (less than a year) Senior Software Engineer Yahoo July 2013  – Present (2 years 2 months) Sunnyvale, CA Senior Software Engineer Yahoo July 2013  – Present (2 years 2 months) Sunnyvale, CA Senior Software Engineer Xobni December 2009  –  July 2013  (3 years 8 months) My broad technology interests have allowed me to work on a wide variety of projects. Here's some examples. \n- Team lead: Rewrote and optimized our data processing engine and server in NodeJS and MySQL \n- Team lead: Wrote our modern big data platform in Hadoop, Pig, NodeJS, and MySQL \n- Wrote lightweight browser extensions and comprehensive Gmail integration platform that accommodates sidebar injection, and custom autosuggest for use with Smartr Inbox for Gmail \n- Wrote several portions of Smartr Inbox for Gmail UI including message viewing, jumping to Gmail message,and recent history \n- Rewrote C# Xobni for Outlook plugin installation experience using finite state machine to accommodate various user flows. \n- Internationalized C# Xobni for Outlook plugin. \n- Cowrote link extraction and Facebook message integration into our Cloud infrastructure Senior Software Engineer Xobni December 2009  –  July 2013  (3 years 8 months) My broad technology interests have allowed me to work on a wide variety of projects. Here's some examples. \n- Team lead: Rewrote and optimized our data processing engine and server in NodeJS and MySQL \n- Team lead: Wrote our modern big data platform in Hadoop, Pig, NodeJS, and MySQL \n- Wrote lightweight browser extensions and comprehensive Gmail integration platform that accommodates sidebar injection, and custom autosuggest for use with Smartr Inbox for Gmail \n- Wrote several portions of Smartr Inbox for Gmail UI including message viewing, jumping to Gmail message,and recent history \n- Rewrote C# Xobni for Outlook plugin installation experience using finite state machine to accommodate various user flows. \n- Internationalized C# Xobni for Outlook plugin. \n- Cowrote link extraction and Facebook message integration into our Cloud infrastructure Software Engineer Gaia Interactive 2008  –  October 2009  (1 year) - Optimized memory usage and extensively refactored our fully featured Flash MMO, zOMG, into a reusable virtual worlds platform in Flex and Actionscript 3. Other, non game-related virtual worlds could take advantage of zOMG's rich feature set. \n- Built a game framework in Actionscript 3 to unify common features across new AS3 games and older AS2 games.  \n- Built a Flex application for a user's inventory management and trying on virtual clothing \n- Built Gaia's virtual prom event from existing components and dramatically decreased network load. Software Engineer Gaia Interactive 2008  –  October 2009  (1 year) - Optimized memory usage and extensively refactored our fully featured Flash MMO, zOMG, into a reusable virtual worlds platform in Flex and Actionscript 3. Other, non game-related virtual worlds could take advantage of zOMG's rich feature set. \n- Built a game framework in Actionscript 3 to unify common features across new AS3 games and older AS2 games.  \n- Built a Flex application for a user's inventory management and trying on virtual clothing \n- Built Gaia's virtual prom event from existing components and dramatically decreased network load. Software Engineer Yahoo! January 2007  –  March 2008  (1 year 3 months) - Built custom Flex component for conversation area which included accurate emoticon placement and speech bubbles \n- Built Flex application that allowed users to build custom emoticons for sharing in conversations \n- Built custom Flex tab component to show chat activity in inactive tabs \n- Helped build lightweight login screen that loaded the Messenger application in the background Software Engineer Yahoo! January 2007  –  March 2008  (1 year 3 months) - Built custom Flex component for conversation area which included accurate emoticon placement and speech bubbles \n- Built Flex application that allowed users to build custom emoticons for sharing in conversations \n- Built custom Flex tab component to show chat activity in inactive tabs \n- Helped build lightweight login screen that loaded the Messenger application in the background IMVironment Engineer Yahoo! September 2005  –  December 2006  (1 year 4 months) An IMVironment is an interactive game or advertisement shown within a Yahoo! Messenger IM window written in Actionscript and Javascript \n- Built Actionscript 3 IMVironment library that we could deliver to clients to create and customize their own IMVs. \n- Built FIFA 2006 IMVironment under a tight deadline which showed live updating scores to users. \n- Worked with third parties such as Apple Jacks, Build-A-Bear, and US Army to design and build custom IMVironments IMVironment Engineer Yahoo! September 2005  –  December 2006  (1 year 4 months) An IMVironment is an interactive game or advertisement shown within a Yahoo! Messenger IM window written in Actionscript and Javascript \n- Built Actionscript 3 IMVironment library that we could deliver to clients to create and customize their own IMVs. \n- Built FIFA 2006 IMVironment under a tight deadline which showed live updating scores to users. \n- Worked with third parties such as Apple Jacks, Build-A-Bear, and US Army to design and build custom IMVironments Designer / Webmaster World Ahead Publishing January 2003  –  September 2005  (2 years 9 months) Designer / Webmaster World Ahead Publishing January 2003  –  September 2005  (2 years 9 months) Prototype Design Intern Yahoo! 2005  –  2005  (less than a year) Prototype Design Intern Yahoo! 2005  –  2005  (less than a year) Multimedia Intern Boeing 2004  –  2004  (less than a year) Multimedia Intern Boeing 2004  –  2004  (less than a year) Skills Alphablox AJAX Usability Flex Performance Tuning CSS HTML jQuery JavaScript PHP Interaction Design MySQL DHTML Flash Communications Audits User Interface Design Hadoop Apache Pig Software Engineering SVG Foosball Node.js See 7+     See less Skills  Alphablox AJAX Usability Flex Performance Tuning CSS HTML jQuery JavaScript PHP Interaction Design MySQL DHTML Flash Communications Audits User Interface Design Hadoop Apache Pig Software Engineering SVG Foosball Node.js See 7+     See less Alphablox AJAX Usability Flex Performance Tuning CSS HTML jQuery JavaScript PHP Interaction Design MySQL DHTML Flash Communications Audits User Interface Design Hadoop Apache Pig Software Engineering SVG Foosball Node.js See 7+     See less Alphablox AJAX Usability Flex Performance Tuning CSS HTML jQuery JavaScript PHP Interaction Design MySQL DHTML Flash Communications Audits User Interface Design Hadoop Apache Pig Software Engineering SVG Foosball Node.js See 7+     See less Education Rochester Institute of Technology Information Technology: New Media 2001  – 2005 Graduated with Highest Honors Activities and Societies:  Varsity Tennis Rochester Institute of Technology Information Technology: New Media 2001  – 2005 Graduated with Highest Honors Activities and Societies:  Varsity Tennis Rochester Institute of Technology Information Technology: New Media 2001  – 2005 Graduated with Highest Honors Activities and Societies:  Varsity Tennis Rochester Institute of Technology Information Technology: New Media 2001  – 2005 Graduated with Highest Honors Activities and Societies:  Varsity Tennis Honors & Awards 2005 RIT Ellingson Award winner RIT Athletics May 2005 Student athlete of the year. Excellence in academics and athletics. Most Fun Hack Yahoo! April 2007 Won \"Most Fun\" award at company-wide Yahoo Hack Day for coauthoring a Maps Hack with inertial scroll and rotational capabilities 2005 RIT Ellingson Award winner RIT Athletics May 2005 Student athlete of the year. Excellence in academics and athletics. 2005 RIT Ellingson Award winner RIT Athletics May 2005 Student athlete of the year. Excellence in academics and athletics. 2005 RIT Ellingson Award winner RIT Athletics May 2005 Student athlete of the year. Excellence in academics and athletics. Most Fun Hack Yahoo! April 2007 Won \"Most Fun\" award at company-wide Yahoo Hack Day for coauthoring a Maps Hack with inertial scroll and rotational capabilities Most Fun Hack Yahoo! April 2007 Won \"Most Fun\" award at company-wide Yahoo Hack Day for coauthoring a Maps Hack with inertial scroll and rotational capabilities Most Fun Hack Yahoo! April 2007 Won \"Most Fun\" award at company-wide Yahoo Hack Day for coauthoring a Maps Hack with inertial scroll and rotational capabilities ", "Skills JavaScript Java Software Engineering Agile Methodologies Distributed Systems Software Development PHP AJAX Linux Web Development JUnit Skills  JavaScript Java Software Engineering Agile Methodologies Distributed Systems Software Development PHP AJAX Linux Web Development JUnit JavaScript Java Software Engineering Agile Methodologies Distributed Systems Software Development PHP AJAX Linux Web Development JUnit JavaScript Java Software Engineering Agile Methodologies Distributed Systems Software Development PHP AJAX Linux Web Development JUnit ", "Experience Senior Software Engineer - Content Personalization & Understanding Yahoo March 2014  – Present (1 year 6 months) United States - Current working on Yahoo Recommends (Personalization as a service): http://yahoo.tumblr.com/post/96977561949/a-new-publisher-solution-yahoo-recommends \n \n- Worked video personalization - including content ingestion, content processing and query time content ranking (based on a given user and the content pool). This was rolled out to screen.yahoo.com and article pages on news.yahoo.com. \nExample:  \n \nhttps://screen.yahoo.com/videos-for-you/ \n \nhttp://news.yahoo.com/two-more-colossal-pharaoh-statues-unveiled-egypt-153602577.html - \"Videos For You\" module on the right rail. Software Engineer - Content Personalization And Understanding Yahoo! February 2013  –  March 2014  (1 year 2 months) - Working on a personalization engine that delivers deeply personalized content.  \n- The engine powers the infinite stream on the yahoo.com homepage. \n- Played a key role in the speedy integration of the Summly summarization engine with the Yahoo! content pipeline. Some excerpts from the press: \n\"Perhaps the most impressive thing about this new app is the speed with which the Summly integration was achieved. Even if things were rolling behind the scenes before the announcement of the acquisition, the product cycle looks to have been quite short.\" - Darrell E., Techcrunch, http://tinyurl.com/c6p4nub Software Engineer - Cloud Platform Group Yahoo! January 2011  –  January 2013  (2 years 1 month) Design and Development of scalable, highly available distributed systems that formed the backbone of the ad-targeting, personalization and various other properties across Yahoo! Graduate Research Assistant Georgia Institute of Technology January 2010  –  December 2010  (1 year) Working on the \"OrgSim\" project which models a human behavior into agent based simulation of an enterprise Software Engineer Intern Yahoo! May 2010  –  August 2010  (4 months) Research Intern DRDO, Bangalore January 2009  –  May 2009  (5 months) Worked on the application of the HMM concept in information extraction from \"bag of words\" documents as part of the AI & NN team at Centre of Artificial Intelligence and Robotics, DRDO, Bangalore, India Senior Software Engineer - Content Personalization & Understanding Yahoo March 2014  – Present (1 year 6 months) United States - Current working on Yahoo Recommends (Personalization as a service): http://yahoo.tumblr.com/post/96977561949/a-new-publisher-solution-yahoo-recommends \n \n- Worked video personalization - including content ingestion, content processing and query time content ranking (based on a given user and the content pool). This was rolled out to screen.yahoo.com and article pages on news.yahoo.com. \nExample:  \n \nhttps://screen.yahoo.com/videos-for-you/ \n \nhttp://news.yahoo.com/two-more-colossal-pharaoh-statues-unveiled-egypt-153602577.html - \"Videos For You\" module on the right rail. Senior Software Engineer - Content Personalization & Understanding Yahoo March 2014  – Present (1 year 6 months) United States - Current working on Yahoo Recommends (Personalization as a service): http://yahoo.tumblr.com/post/96977561949/a-new-publisher-solution-yahoo-recommends \n \n- Worked video personalization - including content ingestion, content processing and query time content ranking (based on a given user and the content pool). This was rolled out to screen.yahoo.com and article pages on news.yahoo.com. \nExample:  \n \nhttps://screen.yahoo.com/videos-for-you/ \n \nhttp://news.yahoo.com/two-more-colossal-pharaoh-statues-unveiled-egypt-153602577.html - \"Videos For You\" module on the right rail. Software Engineer - Content Personalization And Understanding Yahoo! February 2013  –  March 2014  (1 year 2 months) - Working on a personalization engine that delivers deeply personalized content.  \n- The engine powers the infinite stream on the yahoo.com homepage. \n- Played a key role in the speedy integration of the Summly summarization engine with the Yahoo! content pipeline. Some excerpts from the press: \n\"Perhaps the most impressive thing about this new app is the speed with which the Summly integration was achieved. Even if things were rolling behind the scenes before the announcement of the acquisition, the product cycle looks to have been quite short.\" - Darrell E., Techcrunch, http://tinyurl.com/c6p4nub Software Engineer - Content Personalization And Understanding Yahoo! February 2013  –  March 2014  (1 year 2 months) - Working on a personalization engine that delivers deeply personalized content.  \n- The engine powers the infinite stream on the yahoo.com homepage. \n- Played a key role in the speedy integration of the Summly summarization engine with the Yahoo! content pipeline. Some excerpts from the press: \n\"Perhaps the most impressive thing about this new app is the speed with which the Summly integration was achieved. Even if things were rolling behind the scenes before the announcement of the acquisition, the product cycle looks to have been quite short.\" - Darrell E., Techcrunch, http://tinyurl.com/c6p4nub Software Engineer - Cloud Platform Group Yahoo! January 2011  –  January 2013  (2 years 1 month) Design and Development of scalable, highly available distributed systems that formed the backbone of the ad-targeting, personalization and various other properties across Yahoo! Software Engineer - Cloud Platform Group Yahoo! January 2011  –  January 2013  (2 years 1 month) Design and Development of scalable, highly available distributed systems that formed the backbone of the ad-targeting, personalization and various other properties across Yahoo! Graduate Research Assistant Georgia Institute of Technology January 2010  –  December 2010  (1 year) Working on the \"OrgSim\" project which models a human behavior into agent based simulation of an enterprise Graduate Research Assistant Georgia Institute of Technology January 2010  –  December 2010  (1 year) Working on the \"OrgSim\" project which models a human behavior into agent based simulation of an enterprise Software Engineer Intern Yahoo! May 2010  –  August 2010  (4 months) Software Engineer Intern Yahoo! May 2010  –  August 2010  (4 months) Research Intern DRDO, Bangalore January 2009  –  May 2009  (5 months) Worked on the application of the HMM concept in information extraction from \"bag of words\" documents as part of the AI & NN team at Centre of Artificial Intelligence and Robotics, DRDO, Bangalore, India Research Intern DRDO, Bangalore January 2009  –  May 2009  (5 months) Worked on the application of the HMM concept in information extraction from \"bag of words\" documents as part of the AI & NN team at Centre of Artificial Intelligence and Robotics, DRDO, Bangalore, India Skills Distributed Systems Machine Learning C++ Java Artificial Intelligence Natural Language... Python Malware Analysis Intelligent Systems Sentiment Analysis Weka Octave Apache Storm Hadoop HBase Skills  Distributed Systems Machine Learning C++ Java Artificial Intelligence Natural Language... Python Malware Analysis Intelligent Systems Sentiment Analysis Weka Octave Apache Storm Hadoop HBase Distributed Systems Machine Learning C++ Java Artificial Intelligence Natural Language... Python Malware Analysis Intelligent Systems Sentiment Analysis Weka Octave Apache Storm Hadoop HBase Distributed Systems Machine Learning C++ Java Artificial Intelligence Natural Language... Python Malware Analysis Intelligent Systems Sentiment Analysis Weka Octave Apache Storm Hadoop HBase Education Georgia Institute of Technology MS,  Computer Science-Information Security 2009  – 2010 Activities and Societies:  Member: Security Reading Group ,  GTISC ,  Georgia Insitute of Technology ,  Atlanta Visvesvaraya Technological University BE,  Computer Science and Engineering 2005  – 2009 Bethany High School Georgia Institute of Technology MS,  Computer Science-Information Security 2009  – 2010 Activities and Societies:  Member: Security Reading Group ,  GTISC ,  Georgia Insitute of Technology ,  Atlanta Georgia Institute of Technology MS,  Computer Science-Information Security 2009  – 2010 Activities and Societies:  Member: Security Reading Group ,  GTISC ,  Georgia Insitute of Technology ,  Atlanta Georgia Institute of Technology MS,  Computer Science-Information Security 2009  – 2010 Activities and Societies:  Member: Security Reading Group ,  GTISC ,  Georgia Insitute of Technology ,  Atlanta Visvesvaraya Technological University BE,  Computer Science and Engineering 2005  – 2009 Visvesvaraya Technological University BE,  Computer Science and Engineering 2005  – 2009 Visvesvaraya Technological University BE,  Computer Science and Engineering 2005  – 2009 Bethany High School Bethany High School Bethany High School Honors & Awards Additional Honors & Awards 1. Academic Excellence Award, SJBIT, 2009 \n \n2.Best Paper Award: \"Analyzing Credit Card fraud detection using data mining techniques\" at the 20th Computer Society of India(CSI) conference 2006, RVCE, Bangalore Additional Honors & Awards 1. Academic Excellence Award, SJBIT, 2009 \n \n2.Best Paper Award: \"Analyzing Credit Card fraud detection using data mining techniques\" at the 20th Computer Society of India(CSI) conference 2006, RVCE, Bangalore Additional Honors & Awards 1. Academic Excellence Award, SJBIT, 2009 \n \n2.Best Paper Award: \"Analyzing Credit Card fraud detection using data mining techniques\" at the 20th Computer Society of India(CSI) conference 2006, RVCE, Bangalore Additional Honors & Awards 1. Academic Excellence Award, SJBIT, 2009 \n \n2.Best Paper Award: \"Analyzing Credit Card fraud detection using data mining techniques\" at the 20th Computer Society of India(CSI) conference 2006, RVCE, Bangalore ", "Summary Software architect with deep experience in enterprise software, games and consumer applications for mobile devices. \n \niOS, Android, C, C++, Objective C, Java, client/server, network, internet, mobile, phone, tablet, gaming, apps, OO, REST, RDBMS, AWS, Play!, Dart. Summary Software architect with deep experience in enterprise software, games and consumer applications for mobile devices. \n \niOS, Android, C, C++, Objective C, Java, client/server, network, internet, mobile, phone, tablet, gaming, apps, OO, REST, RDBMS, AWS, Play!, Dart. Software architect with deep experience in enterprise software, games and consumer applications for mobile devices. \n \niOS, Android, C, C++, Objective C, Java, client/server, network, internet, mobile, phone, tablet, gaming, apps, OO, REST, RDBMS, AWS, Play!, Dart. Software architect with deep experience in enterprise software, games and consumer applications for mobile devices. \n \niOS, Android, C, C++, Objective C, Java, client/server, network, internet, mobile, phone, tablet, gaming, apps, OO, REST, RDBMS, AWS, Play!, Dart. Skills Mobile Devices Android Mobile Applications Software Engineering Java Windows Mobile BREW iOS Objective-C C C++ Internet Client/server Tablets Smartphones REST OO Software Development RDBMS Mobile Phone Apps iPhone Cross-platform... Amazon Web Services... Embedded Systems iOS development See 9+     See less Skills  Mobile Devices Android Mobile Applications Software Engineering Java Windows Mobile BREW iOS Objective-C C C++ Internet Client/server Tablets Smartphones REST OO Software Development RDBMS Mobile Phone Apps iPhone Cross-platform... Amazon Web Services... Embedded Systems iOS development See 9+     See less Mobile Devices Android Mobile Applications Software Engineering Java Windows Mobile BREW iOS Objective-C C C++ Internet Client/server Tablets Smartphones REST OO Software Development RDBMS Mobile Phone Apps iPhone Cross-platform... Amazon Web Services... Embedded Systems iOS development See 9+     See less Mobile Devices Android Mobile Applications Software Engineering Java Windows Mobile BREW iOS Objective-C C C++ Internet Client/server Tablets Smartphones REST OO Software Development RDBMS Mobile Phone Apps iPhone Cross-platform... Amazon Web Services... Embedded Systems iOS development See 9+     See less Honors & Awards ", "Summary Bilingual experienced lead software developer for the most popular portal site in Japan. \n \n* Ten years of experience in front-end/back-end programming at Yahoo! Japan. \n* Awarded as a Yahoo! Japan Super Star for reducing the number of spams drastically by analyzing quantitative and qualitative data. \n* Speak good English and manage regular technical collaboration with Yahoo! Inc. \n* Work closely with Operations for planning and maintaining the releases. Specialties:Team building, Technical collaboration, Quantitative and Qualitative analysis, \nC/C++, Perl, FreeBSD, Linux, \nBilingual in Japanese and English Summary Bilingual experienced lead software developer for the most popular portal site in Japan. \n \n* Ten years of experience in front-end/back-end programming at Yahoo! Japan. \n* Awarded as a Yahoo! Japan Super Star for reducing the number of spams drastically by analyzing quantitative and qualitative data. \n* Speak good English and manage regular technical collaboration with Yahoo! Inc. \n* Work closely with Operations for planning and maintaining the releases. Specialties:Team building, Technical collaboration, Quantitative and Qualitative analysis, \nC/C++, Perl, FreeBSD, Linux, \nBilingual in Japanese and English Bilingual experienced lead software developer for the most popular portal site in Japan. \n \n* Ten years of experience in front-end/back-end programming at Yahoo! Japan. \n* Awarded as a Yahoo! Japan Super Star for reducing the number of spams drastically by analyzing quantitative and qualitative data. \n* Speak good English and manage regular technical collaboration with Yahoo! Inc. \n* Work closely with Operations for planning and maintaining the releases. Specialties:Team building, Technical collaboration, Quantitative and Qualitative analysis, \nC/C++, Perl, FreeBSD, Linux, \nBilingual in Japanese and English Bilingual experienced lead software developer for the most popular portal site in Japan. \n \n* Ten years of experience in front-end/back-end programming at Yahoo! Japan. \n* Awarded as a Yahoo! Japan Super Star for reducing the number of spams drastically by analyzing quantitative and qualitative data. \n* Speak good English and manage regular technical collaboration with Yahoo! Inc. \n* Work closely with Operations for planning and maintaining the releases. Specialties:Team building, Technical collaboration, Quantitative and Qualitative analysis, \nC/C++, Perl, FreeBSD, Linux, \nBilingual in Japanese and English Experience Software Engineer, Yahoo! Mail Back-end Yahoo! JAPAN October 2014  – Present (11 months) Software Engineer, Advertisement Delivery Yahoo! JAPAN October 2013  –  September 2014  (1 year) * Responsible for developing and operating an advertisement delivery systems. Lead Software Engineer, Yahoo! Mail Delivery and Antispam Yahoo! JAPAN January 2004  –  September 2013  (9 years 9 months) * Responsible for re-architect and introducing delivery/anti-spam systems for Japanese market. Manage to list up Japanese features and change some part of systems suitable for Japanese environment. \n* Architect together with partner company(Yahoo! Inc.) engineers and decide which system should launch in Japan. \n* Designing and developing only Japanese features delivery/anti-spam functions.  \n* Responsible for contact with partner company's engineers for some requirements and questions. \n* Planning delivery/anti-spam systems in whole schedule such as coding, test and release. \n* Conducting to take counsel with Japanese operation engineers about release schedule and hardware set up. Software Engineer, Yahoo! Mail Yahoo! JAPAN October 2000  –  September 2004  (4 years) * Developed a customer care support tool that can track reports from customers and operation histories. \n* Designed some Yahoo! Mail billing systems, for example account name changing service. \n* Re-designed some new back-end systems of Yahoo! Mail. \n* Managed the server capacity for the rapid Japanese user growth. \n* Analized Addressbook data and producted the guide of operation. Software Engineer, Yahoo! Mail Back-end Yahoo! JAPAN October 2014  – Present (11 months) Software Engineer, Yahoo! Mail Back-end Yahoo! JAPAN October 2014  – Present (11 months) Software Engineer, Advertisement Delivery Yahoo! JAPAN October 2013  –  September 2014  (1 year) * Responsible for developing and operating an advertisement delivery systems. Software Engineer, Advertisement Delivery Yahoo! JAPAN October 2013  –  September 2014  (1 year) * Responsible for developing and operating an advertisement delivery systems. Lead Software Engineer, Yahoo! Mail Delivery and Antispam Yahoo! JAPAN January 2004  –  September 2013  (9 years 9 months) * Responsible for re-architect and introducing delivery/anti-spam systems for Japanese market. Manage to list up Japanese features and change some part of systems suitable for Japanese environment. \n* Architect together with partner company(Yahoo! Inc.) engineers and decide which system should launch in Japan. \n* Designing and developing only Japanese features delivery/anti-spam functions.  \n* Responsible for contact with partner company's engineers for some requirements and questions. \n* Planning delivery/anti-spam systems in whole schedule such as coding, test and release. \n* Conducting to take counsel with Japanese operation engineers about release schedule and hardware set up. Lead Software Engineer, Yahoo! Mail Delivery and Antispam Yahoo! JAPAN January 2004  –  September 2013  (9 years 9 months) * Responsible for re-architect and introducing delivery/anti-spam systems for Japanese market. Manage to list up Japanese features and change some part of systems suitable for Japanese environment. \n* Architect together with partner company(Yahoo! Inc.) engineers and decide which system should launch in Japan. \n* Designing and developing only Japanese features delivery/anti-spam functions.  \n* Responsible for contact with partner company's engineers for some requirements and questions. \n* Planning delivery/anti-spam systems in whole schedule such as coding, test and release. \n* Conducting to take counsel with Japanese operation engineers about release schedule and hardware set up. Software Engineer, Yahoo! Mail Yahoo! JAPAN October 2000  –  September 2004  (4 years) * Developed a customer care support tool that can track reports from customers and operation histories. \n* Designed some Yahoo! Mail billing systems, for example account name changing service. \n* Re-designed some new back-end systems of Yahoo! Mail. \n* Managed the server capacity for the rapid Japanese user growth. \n* Analized Addressbook data and producted the guide of operation. Software Engineer, Yahoo! Mail Yahoo! JAPAN October 2000  –  September 2004  (4 years) * Developed a customer care support tool that can track reports from customers and operation histories. \n* Designed some Yahoo! Mail billing systems, for example account name changing service. \n* Re-designed some new back-end systems of Yahoo! Mail. \n* Managed the server capacity for the rapid Japanese user growth. \n* Analized Addressbook data and producted the guide of operation. Skills C++ Software Documentation Testing Linux Management Mail Server Network Security Anti-spam Software Development Unix C Skills  C++ Software Documentation Testing Linux Management Mail Server Network Security Anti-spam Software Development Unix C C++ Software Documentation Testing Linux Management Mail Server Network Security Anti-spam Software Development Unix C C++ Software Documentation Testing Linux Management Mail Server Network Security Anti-spam Software Development Unix C Education 千葉大学 / Chiba University MS,  Electrical Engineering 1999  – 2001 千葉大学 / Chiba University BS,  Electrical Engineering 1997  – 1999 沼津工業高等専門学校 / Numazu National College of Technology Electrical Engineering 1992  – 1997 千葉大学 / Chiba University MS,  Electrical Engineering 1999  – 2001 千葉大学 / Chiba University MS,  Electrical Engineering 1999  – 2001 千葉大学 / Chiba University MS,  Electrical Engineering 1999  – 2001 千葉大学 / Chiba University BS,  Electrical Engineering 1997  – 1999 千葉大学 / Chiba University BS,  Electrical Engineering 1997  – 1999 千葉大学 / Chiba University BS,  Electrical Engineering 1997  – 1999 沼津工業高等専門学校 / Numazu National College of Technology Electrical Engineering 1992  – 1997 沼津工業高等専門学校 / Numazu National College of Technology Electrical Engineering 1992  – 1997 沼津工業高等専門学校 / Numazu National College of Technology Electrical Engineering 1992  – 1997 ", "Experience Principal Software Engineer Yahoo April 2015  – Present (5 months) Champaign, Illinois Working with the open source community to build the next-generation interface for Hadoop and the Hadoop stack, for the entire Yahoo grid. Engineering lead for integration of Cloudera Hue (Hadoop User Experience) to Yahoo Apache Hadoop clusters. \n \nLead for automation frameworks for all distributed computing platforms in the Yahoo Grid Platforms Group. Senior Software Engineer Yahoo August 2012  –  March 2015  (2 years 8 months) Champaign, Illinois Engineering lead for integration of Cloudera Hue (Hadoop User Experience) to Yahoo Apache Hadoop clusters. \n \nLead for automation frameworks for the following in the Yahoo Grid Platforms Group: \n \n• Apache Hadoop \n• Apache Storm \n• Apache Spark \n• Yahoo Grid Data Management \n• Apache Tez Senior Programmer Volition Inc. / THQ January 2009  –  August 2012  (3 years 8 months) Champaign, Illinois Lead for continuous integration engineering and automation for the following game titles, on Xbox 360, Sony PlayStation 3, and PC: \n \n• Saints Row IV (2013) \n• Saints Row: The Third (2011) \n• Red Faction: Armageddon (2011) \n• Guillermo del Toro's inSANE (unreleased) \n• Core technology platforms and tools Senior Software Engineer Yahoo August 2007  –  December 2008  (1 year 5 months) Champaign, Illinois Automation frameworks for Yahoo Strategic Data Solutions. Senior Software Engineer Motorola April 2005  –  August 2007  (2 years 5 months) Champaign, Illinois Automation frameworks and tools for Motorola Mobile Devices OS platforms, for products including: \n \n• RAZR, SLVR, KRZR, PEBL, ROKR, RAZR2, SCPL, SLDR, and more. Software Engineer Motorola March 2003  –  April 2005  (2 years 2 months) Champaign, Illinois Automation frameworks and tools for Motorola Mobile Devices OS platforms, for products including: \n \n• RAZR, SLVR, KRZR, PEBL, ROKR, RAZR2, SCPL, SLDR, and more. Software Developer Strata Decision Technology May 2000  –  March 2003  (2 years 11 months) Champaign, Illinois Software engineering for Strata Decision Technology strategic financial planning platforms. Principal Software Engineer Yahoo April 2015  – Present (5 months) Champaign, Illinois Working with the open source community to build the next-generation interface for Hadoop and the Hadoop stack, for the entire Yahoo grid. Engineering lead for integration of Cloudera Hue (Hadoop User Experience) to Yahoo Apache Hadoop clusters. \n \nLead for automation frameworks for all distributed computing platforms in the Yahoo Grid Platforms Group. Principal Software Engineer Yahoo April 2015  – Present (5 months) Champaign, Illinois Working with the open source community to build the next-generation interface for Hadoop and the Hadoop stack, for the entire Yahoo grid. Engineering lead for integration of Cloudera Hue (Hadoop User Experience) to Yahoo Apache Hadoop clusters. \n \nLead for automation frameworks for all distributed computing platforms in the Yahoo Grid Platforms Group. Senior Software Engineer Yahoo August 2012  –  March 2015  (2 years 8 months) Champaign, Illinois Engineering lead for integration of Cloudera Hue (Hadoop User Experience) to Yahoo Apache Hadoop clusters. \n \nLead for automation frameworks for the following in the Yahoo Grid Platforms Group: \n \n• Apache Hadoop \n• Apache Storm \n• Apache Spark \n• Yahoo Grid Data Management \n• Apache Tez Senior Software Engineer Yahoo August 2012  –  March 2015  (2 years 8 months) Champaign, Illinois Engineering lead for integration of Cloudera Hue (Hadoop User Experience) to Yahoo Apache Hadoop clusters. \n \nLead for automation frameworks for the following in the Yahoo Grid Platforms Group: \n \n• Apache Hadoop \n• Apache Storm \n• Apache Spark \n• Yahoo Grid Data Management \n• Apache Tez Senior Programmer Volition Inc. / THQ January 2009  –  August 2012  (3 years 8 months) Champaign, Illinois Lead for continuous integration engineering and automation for the following game titles, on Xbox 360, Sony PlayStation 3, and PC: \n \n• Saints Row IV (2013) \n• Saints Row: The Third (2011) \n• Red Faction: Armageddon (2011) \n• Guillermo del Toro's inSANE (unreleased) \n• Core technology platforms and tools Senior Programmer Volition Inc. / THQ January 2009  –  August 2012  (3 years 8 months) Champaign, Illinois Lead for continuous integration engineering and automation for the following game titles, on Xbox 360, Sony PlayStation 3, and PC: \n \n• Saints Row IV (2013) \n• Saints Row: The Third (2011) \n• Red Faction: Armageddon (2011) \n• Guillermo del Toro's inSANE (unreleased) \n• Core technology platforms and tools Senior Software Engineer Yahoo August 2007  –  December 2008  (1 year 5 months) Champaign, Illinois Automation frameworks for Yahoo Strategic Data Solutions. Senior Software Engineer Yahoo August 2007  –  December 2008  (1 year 5 months) Champaign, Illinois Automation frameworks for Yahoo Strategic Data Solutions. Senior Software Engineer Motorola April 2005  –  August 2007  (2 years 5 months) Champaign, Illinois Automation frameworks and tools for Motorola Mobile Devices OS platforms, for products including: \n \n• RAZR, SLVR, KRZR, PEBL, ROKR, RAZR2, SCPL, SLDR, and more. Senior Software Engineer Motorola April 2005  –  August 2007  (2 years 5 months) Champaign, Illinois Automation frameworks and tools for Motorola Mobile Devices OS platforms, for products including: \n \n• RAZR, SLVR, KRZR, PEBL, ROKR, RAZR2, SCPL, SLDR, and more. Software Engineer Motorola March 2003  –  April 2005  (2 years 2 months) Champaign, Illinois Automation frameworks and tools for Motorola Mobile Devices OS platforms, for products including: \n \n• RAZR, SLVR, KRZR, PEBL, ROKR, RAZR2, SCPL, SLDR, and more. Software Engineer Motorola March 2003  –  April 2005  (2 years 2 months) Champaign, Illinois Automation frameworks and tools for Motorola Mobile Devices OS platforms, for products including: \n \n• RAZR, SLVR, KRZR, PEBL, ROKR, RAZR2, SCPL, SLDR, and more. Software Developer Strata Decision Technology May 2000  –  March 2003  (2 years 11 months) Champaign, Illinois Software engineering for Strata Decision Technology strategic financial planning platforms. Software Developer Strata Decision Technology May 2000  –  March 2003  (2 years 11 months) Champaign, Illinois Software engineering for Strata Decision Technology strategic financial planning platforms. Skills Java Perl C Continuous Integration Cloud Computing Hadoop Software Engineering Test Automation... Automation Frameworks Automation Distributed Systems Python Mobile Technology Big Data Video Games Debugging Maven Eclipse See 3+     See less Skills  Java Perl C Continuous Integration Cloud Computing Hadoop Software Engineering Test Automation... Automation Frameworks Automation Distributed Systems Python Mobile Technology Big Data Video Games Debugging Maven Eclipse See 3+     See less Java Perl C Continuous Integration Cloud Computing Hadoop Software Engineering Test Automation... Automation Frameworks Automation Distributed Systems Python Mobile Technology Big Data Video Games Debugging Maven Eclipse See 3+     See less Java Perl C Continuous Integration Cloud Computing Hadoop Software Engineering Test Automation... Automation Frameworks Automation Distributed Systems Python Mobile Technology Big Data Video Games Debugging Maven Eclipse See 3+     See less Education University of Illinois at Urbana-Champaign B.S.,  Computer Science , College of Engineering 1996  – 2000 University of Illinois at Urbana-Champaign B.S.,  Computer Science , College of Engineering 1996  – 2000 University of Illinois at Urbana-Champaign B.S.,  Computer Science , College of Engineering 1996  – 2000 University of Illinois at Urbana-Champaign B.S.,  Computer Science , College of Engineering 1996  – 2000 ", "Summary Highly motivated individual with leadership skills and solid technical background in backend development, high performance web pages, mobile browser and application development in embedded systems. Recognized for productivity, fast learning, ability to focus and excellent attention to detail. Experienced in managing and developing large scale application and working on multiple projects simultaneously, with agile software development using SCRUM. Summary Highly motivated individual with leadership skills and solid technical background in backend development, high performance web pages, mobile browser and application development in embedded systems. Recognized for productivity, fast learning, ability to focus and excellent attention to detail. Experienced in managing and developing large scale application and working on multiple projects simultaneously, with agile software development using SCRUM. Highly motivated individual with leadership skills and solid technical background in backend development, high performance web pages, mobile browser and application development in embedded systems. Recognized for productivity, fast learning, ability to focus and excellent attention to detail. Experienced in managing and developing large scale application and working on multiple projects simultaneously, with agile software development using SCRUM. Highly motivated individual with leadership skills and solid technical background in backend development, high performance web pages, mobile browser and application development in embedded systems. Recognized for productivity, fast learning, ability to focus and excellent attention to detail. Experienced in managing and developing large scale application and working on multiple projects simultaneously, with agile software development using SCRUM. Experience Senior Software Engineer Yahoo September 2013  – Present (2 years) United States - Individual contributor in Cloud Services User Data team.  \n- Responsible for feature development, customer onboarding and troubleshooting production systems that are high availability and low latency. \n Engineering Manager Yahoo! July 2011  – Present (4 years 2 months) United States * Manage a team of engineers to develop a content moderation platform and tools that provides machine, community and human moderation support for user generated content (UGC) on Yahoo network. \n* Drive Software Development Life Cycle process: work with Product manager and other stakeholders to define product requirements, facilitates architecture design review, oversees feature development and testing and manages release schedule using agile development model. \n* Manage issue tracking, bug triage and provide product support and consulting. \n* Work with cross-functional and cross-geographical teams to evaluate how the system is meeting their needs. \n* Hold technical discussion with other platform teams to define engineering requirements of product features to ensure platforms work seamlessly together to provide end-to-end UGC solution for properties. \n* Drive team to continue innovate new algorithm for detecting ever-changing spam pattern. Senior Software Engineer Yahoo September 2013  – Present (2 years) United States - Individual contributor in Cloud Services User Data team.  \n- Responsible for feature development, customer onboarding and troubleshooting production systems that are high availability and low latency. \n Senior Software Engineer Yahoo September 2013  – Present (2 years) United States - Individual contributor in Cloud Services User Data team.  \n- Responsible for feature development, customer onboarding and troubleshooting production systems that are high availability and low latency. \n Engineering Manager Yahoo! July 2011  – Present (4 years 2 months) United States * Manage a team of engineers to develop a content moderation platform and tools that provides machine, community and human moderation support for user generated content (UGC) on Yahoo network. \n* Drive Software Development Life Cycle process: work with Product manager and other stakeholders to define product requirements, facilitates architecture design review, oversees feature development and testing and manages release schedule using agile development model. \n* Manage issue tracking, bug triage and provide product support and consulting. \n* Work with cross-functional and cross-geographical teams to evaluate how the system is meeting their needs. \n* Hold technical discussion with other platform teams to define engineering requirements of product features to ensure platforms work seamlessly together to provide end-to-end UGC solution for properties. \n* Drive team to continue innovate new algorithm for detecting ever-changing spam pattern. Engineering Manager Yahoo! July 2011  – Present (4 years 2 months) United States * Manage a team of engineers to develop a content moderation platform and tools that provides machine, community and human moderation support for user generated content (UGC) on Yahoo network. \n* Drive Software Development Life Cycle process: work with Product manager and other stakeholders to define product requirements, facilitates architecture design review, oversees feature development and testing and manages release schedule using agile development model. \n* Manage issue tracking, bug triage and provide product support and consulting. \n* Work with cross-functional and cross-geographical teams to evaluate how the system is meeting their needs. \n* Hold technical discussion with other platform teams to define engineering requirements of product features to ensure platforms work seamlessly together to provide end-to-end UGC solution for properties. \n* Drive team to continue innovate new algorithm for detecting ever-changing spam pattern. Languages   Skills PHP JavaScript Perl HTML CSS C C++ Agile Methodologies Software Development Skills  PHP JavaScript Perl HTML CSS C C++ Agile Methodologies Software Development PHP JavaScript Perl HTML CSS C C++ Agile Methodologies Software Development PHP JavaScript Perl HTML CSS C C++ Agile Methodologies Software Development ", "Summary Experience in architecture, strategy, design, development, implementation, and operations of very large internet infrastructure/systems and marketplace Summary Experience in architecture, strategy, design, development, implementation, and operations of very large internet infrastructure/systems and marketplace Experience in architecture, strategy, design, development, implementation, and operations of very large internet infrastructure/systems and marketplace Experience in architecture, strategy, design, development, implementation, and operations of very large internet infrastructure/systems and marketplace Experience Principal Software Engineer Yahoo Inc! September 2012  – Present (3 years) Presently working on Yahoo! Mail Web experience and monetization Software Developer xAd, Inc November 2011  –  August 2012  (10 months) Mobile Search and Display Advertising. Lead Software Engineer, Yahoo Guaranteed Display Advertising system v2.0 Yahoo! Inc August 2008  –  December 2011  (3 years 5 months) First engineer to join the GD 2.0 Serving system. Prototype, Design and build the Serving systems and algorithms for next generation of Yahoo!'s Guaranteed Display advertising platform (GD 2.0). \n \n* Ongoing Feature development for Yahoo's Next generation Display advertising serving system, in close collaboration with scientists, mathematicians, economists and research engineers from Yahoo! Research Labs and Applied sciences. The systems are build to handle Billions of Page views Per Day. \n \n* Built the first prototype for the GD2 Online Serving system, all the way from the first line of code for the first iteration of the production system. This system was launched in shadow mode in march 2009, taking tee'd off production traffic, for basic systemic/algorithmic analysis. The learnings were used in the next iteration of serving-systems development, which replaced the old system in may 2011 .  \n \n* Built the core algorithmic components for Indexing and Search infrastructure used to retrieve matching Ads for a given user-visit/query/page-view, with sub-millisecond index-lookup-latencies on search over a corpus of over several hundred-thousand documents in a single partition. Augmented the existing Index Serving infrastructure to accommodate the newly developed core indexing infrastructure, and reliable transport support for GD 2.0. The work was based on the following papers:  \n \n- \"Efficiently Evaluating Complex Boolean Expressions\", Marcus Fontoura, Suhas Sadanandan, Jayavel Shanmugasundaram, Sergei Vassilvitski, Erik Vee, Srihari Venkatesan, Jason Zien, SIGMOD 2010 \n \n- \"Indexing Boolean Expressions\", Steven Whang, Chad Brower, Jayavel. Shanmugasundaram, Sergei Vassilvitskii, Erik Vee, VLDB 2009 \n \n* Cross platform/Cross team initiatives related to indexing (for NonGuaranteed Display advertising, Supplyscaping etc) Tinkerer in the Display Advertising world Yahoo! Inc August 2008  –  November 2008  (4 months) Yahoo!'s Guaranteed Delivery \"Classic\" backend infrastructure, which has been running for several years. \n \nBefore starting on building the next-generation of advertising system, it was important to understand the existing ad-serving system, and I started on this project. \n \nThe \"classic\" adserving system currently handles (globally) the online-serving of all of Yahoo's Guranteed Ad inventory, and contributes to Billion+ $$ in revenue (much of Yahoo's display ad revenue).  \n \nFiguring out and bug-fixing the core ad-selection and ad-scoring logic of the GD 1.0 adserver within 2 months of joining the team, amongst other enhancements and bug fixes. \n \nHelped the performance certification initiative by taking up performance testing and tuning of the GD 1.0 adserver for both Yahoo! Internal traffic (YAN) , and Yahoo Newspaper consortium (NC) traffic on the very first week of joining this team, and developed supporting scripts/tools for performance testing. The work helped towards adserver performance certification for for LZ 2.0 and 3.0 milestone-releases. Lead Software Engineer, Y! Alerts, Audience platform engineering Yahoo! Inc December 2007  –  August 2008  (9 months) Overall technical leadership for Yahoo! Alerts V2.0 infrastructure project for around 10 months, till its initial Launch. This was in addition to my responsibilities with the Y! Avatars project. \n \nYahoo! Alerts is a publish-subscribe system, used widely within and outside the company.  \n \nWithin this infrastructure project, I developed the scheduling component and the delayed-alerts component.  \n \nThe scheduling component figures when to send what Alert, and to whom, once a document-match is confirmed,  \nThe delayed-alert component stored the information in case users have subscribed to once-a-day or aggregated feeds, instead of realtime, and triggered a send to the user, at the appropriate time) Lead Software Engineer, Y! Avatars, Audience platform engineering Yahoo! Inc April 2006  –  August 2008  (2 years 5 months) Took over the ownership and technical leadership (Architecture, design, feature development) of Y! Avatars project (backend and frontend). Built, mentored and trained a team of around 10 people including senior engineers, front end engineers, visual and interaction designers, and interfaced with business product managers and content product managers.  \n \nWe built and maintained the software end-to-end, including deployment to and operations of 200+ servers and Multiple Storage Filers, Akamai/CDN, and later transitioned the operations to a dedicated operations team \n \nThe platform handled 300 Million+ views per day, including traffic from big properties like Yahoo! Mail, Yahoo Answers, Yahoo Messenger, and Yahoo Search results page. \n \nWe grew the product from a 3.5Million$$ per year Yahoo! property to 10Million$$ per year property, scaled the platform to handle 50X the traffic it handled when we took over it, Added fault tolerance to the architecture, added redundancy, and released multiple features (including virtual world, and the \"second most used\" Messenger plugin).  \n \nScaling this project within a short duration of 2 months after taking ownership, was critical to the Yahoo! Answers launch, and the then Y! Search EVP Qi Lu was in direct interaction with Senior management of this project, to ensure its success. \n \nThe backend components has challenges related scale and latency. The Server components we developed handled 15k+ requests/second/box, handling data for 60Million+ user-records partitioned and replicated over boxes distributed over many colos, and guaranteeing a 99.5% SLA of < 3 milliseconds.  \n \nThe system allowed users to select and combine \"items\" to create their own display-images (Users could select stuff from amongst a pool of ~7000, and ever/still-growing set of usable items) and this resulted in billions of possible unique combinations/display-images. Trading off storage costs with latency of combining at call-time, was another challenge. Lead Software Engineer, Y! EM Classifieds, Audience platform engineering Yahoo! Inc January 2007  –  September 2007  (9 months) Y! Classifieds version 2.0, launched in Y! Emerging Markets (Y! Singapore, India, Vietnam, Taiwan) \n \nContributed to all areas of the project, and provided technical leadership to the backend team.  \n \nThis project was heavy on MySQL and \"Vespa\" (Vespa is an in-house searchbox solution/vertical search infrastructure, where we had to heavily tweak the parameters contributing to relevancy of documents and ranking of search results across multiple product-categories) Senior Software Engineer, Y! Briefcase 2.0, Audience platform engineering Yahoo! Inc December 2005  –  May 2006  (6 months) Built a fully functional prototype for Y! Briefcase version 2.0 (In approximately 4 months). Was part of a 2 member team which developed this software end-to-end.  \n \nWe also developed a Windows desktop client, exposing features for Yahoo! Briefcase, like automatic backup and restore of data, where you could configure the Folders you want to backup. The restores were check-pointed, and would restart from where it stopped, if you disconnected and reconnected later on.  \n \nThe product was demo'ed to the then Yahoo! COO, Dan Rosensweig, who was evaluating various strategic areas to invest in.  \n(Unfortunately, due to perceived storage costs at that time -- the project didn't get funding :). This was around the time when Gmail had just started ridiculing the whole storage-game. ) \n \n(In this project, we implemented features exposed by the then-famous idrive.com. Recently, companies like mozy.com have exposed similar features) Senior Software Engineer, Y! Message Boards 2.0, Audience platform engineering Yahoo! Inc December 2005  –  April 2006  (5 months) Y! Message boards 2.0 infrastructure project. \n \n(I contributed to this project, while I was also owning the Y! polls 2.0 platform) \n \nContributed to feature development and enhancements. Also performance tuned the infrastructure (around mysql database backend, and freebsd tcp stack tuning) Senior Software Engineer, Y! Polls 2.0, Audience platform engineering Yahoo! Inc April 2004  –  April 2006  (2 years 1 month) Y! Polls Platform version 2.0, revamping Yahoo's Polls infrastructure to scale to 100Million+ page views per day, and 10M+ writes per day, handling traffic from Y! Finance, Y! sports and Y! News Frontpages (amongst the 35+ Yahoo properties which used this system). This system had a global deployment, with independent setups for multiple geographies (US, Singapore, Latin America, China). The Backend infrastructure was written in C++, with MySQL database backend, and PHP for Templating. One of the first projects at Yahoo! to be built on top of MySQL backend.  \n \nApart from the core backend, I also worked on a unified administration/management tool for this system, through which content producers could create and schedule quizzes/polls for various Yahoo properties, across geographies. (Implementing the admin tool gave me some UI development exposure early on) \n \nWorked mostly as a single man army for the duration of this platform project, architecting, designing, maintaining and deploying, and customer interfacing for 2 years. \n \n \nDuring the duration of this project, I also got an opportunity to train some of Yahoo's Master Oracle DBAs, who were new to the MySQL world ;-) (This was mostly around MySQL configuration for InnoDB engine tweaked for performance, Replication chaining, and selective replication across multiple colos) Software Engineer, Y! Messenger Server Core Yahoo Inc! June 2003  –  March 2004  (10 months) Y! Messenger Server Core. Part of a (then) 10 member team which developed, maintained and deployed all of Y! Instant Messenger backend. \n \nContributed to new-feature development related to online presence indication infrastructure, online file transfer, realtime QOS statistics gathering, and performance testing and bug-fixing in other Core server components related to user and event management. Principal Software Engineer Yahoo Inc! September 2012  – Present (3 years) Presently working on Yahoo! Mail Web experience and monetization Principal Software Engineer Yahoo Inc! September 2012  – Present (3 years) Presently working on Yahoo! Mail Web experience and monetization Software Developer xAd, Inc November 2011  –  August 2012  (10 months) Mobile Search and Display Advertising. Software Developer xAd, Inc November 2011  –  August 2012  (10 months) Mobile Search and Display Advertising. Lead Software Engineer, Yahoo Guaranteed Display Advertising system v2.0 Yahoo! Inc August 2008  –  December 2011  (3 years 5 months) First engineer to join the GD 2.0 Serving system. Prototype, Design and build the Serving systems and algorithms for next generation of Yahoo!'s Guaranteed Display advertising platform (GD 2.0). \n \n* Ongoing Feature development for Yahoo's Next generation Display advertising serving system, in close collaboration with scientists, mathematicians, economists and research engineers from Yahoo! Research Labs and Applied sciences. The systems are build to handle Billions of Page views Per Day. \n \n* Built the first prototype for the GD2 Online Serving system, all the way from the first line of code for the first iteration of the production system. This system was launched in shadow mode in march 2009, taking tee'd off production traffic, for basic systemic/algorithmic analysis. The learnings were used in the next iteration of serving-systems development, which replaced the old system in may 2011 .  \n \n* Built the core algorithmic components for Indexing and Search infrastructure used to retrieve matching Ads for a given user-visit/query/page-view, with sub-millisecond index-lookup-latencies on search over a corpus of over several hundred-thousand documents in a single partition. Augmented the existing Index Serving infrastructure to accommodate the newly developed core indexing infrastructure, and reliable transport support for GD 2.0. The work was based on the following papers:  \n \n- \"Efficiently Evaluating Complex Boolean Expressions\", Marcus Fontoura, Suhas Sadanandan, Jayavel Shanmugasundaram, Sergei Vassilvitski, Erik Vee, Srihari Venkatesan, Jason Zien, SIGMOD 2010 \n \n- \"Indexing Boolean Expressions\", Steven Whang, Chad Brower, Jayavel. Shanmugasundaram, Sergei Vassilvitskii, Erik Vee, VLDB 2009 \n \n* Cross platform/Cross team initiatives related to indexing (for NonGuaranteed Display advertising, Supplyscaping etc) Lead Software Engineer, Yahoo Guaranteed Display Advertising system v2.0 Yahoo! Inc August 2008  –  December 2011  (3 years 5 months) First engineer to join the GD 2.0 Serving system. Prototype, Design and build the Serving systems and algorithms for next generation of Yahoo!'s Guaranteed Display advertising platform (GD 2.0). \n \n* Ongoing Feature development for Yahoo's Next generation Display advertising serving system, in close collaboration with scientists, mathematicians, economists and research engineers from Yahoo! Research Labs and Applied sciences. The systems are build to handle Billions of Page views Per Day. \n \n* Built the first prototype for the GD2 Online Serving system, all the way from the first line of code for the first iteration of the production system. This system was launched in shadow mode in march 2009, taking tee'd off production traffic, for basic systemic/algorithmic analysis. The learnings were used in the next iteration of serving-systems development, which replaced the old system in may 2011 .  \n \n* Built the core algorithmic components for Indexing and Search infrastructure used to retrieve matching Ads for a given user-visit/query/page-view, with sub-millisecond index-lookup-latencies on search over a corpus of over several hundred-thousand documents in a single partition. Augmented the existing Index Serving infrastructure to accommodate the newly developed core indexing infrastructure, and reliable transport support for GD 2.0. The work was based on the following papers:  \n \n- \"Efficiently Evaluating Complex Boolean Expressions\", Marcus Fontoura, Suhas Sadanandan, Jayavel Shanmugasundaram, Sergei Vassilvitski, Erik Vee, Srihari Venkatesan, Jason Zien, SIGMOD 2010 \n \n- \"Indexing Boolean Expressions\", Steven Whang, Chad Brower, Jayavel. Shanmugasundaram, Sergei Vassilvitskii, Erik Vee, VLDB 2009 \n \n* Cross platform/Cross team initiatives related to indexing (for NonGuaranteed Display advertising, Supplyscaping etc) Tinkerer in the Display Advertising world Yahoo! Inc August 2008  –  November 2008  (4 months) Yahoo!'s Guaranteed Delivery \"Classic\" backend infrastructure, which has been running for several years. \n \nBefore starting on building the next-generation of advertising system, it was important to understand the existing ad-serving system, and I started on this project. \n \nThe \"classic\" adserving system currently handles (globally) the online-serving of all of Yahoo's Guranteed Ad inventory, and contributes to Billion+ $$ in revenue (much of Yahoo's display ad revenue).  \n \nFiguring out and bug-fixing the core ad-selection and ad-scoring logic of the GD 1.0 adserver within 2 months of joining the team, amongst other enhancements and bug fixes. \n \nHelped the performance certification initiative by taking up performance testing and tuning of the GD 1.0 adserver for both Yahoo! Internal traffic (YAN) , and Yahoo Newspaper consortium (NC) traffic on the very first week of joining this team, and developed supporting scripts/tools for performance testing. The work helped towards adserver performance certification for for LZ 2.0 and 3.0 milestone-releases. Tinkerer in the Display Advertising world Yahoo! Inc August 2008  –  November 2008  (4 months) Yahoo!'s Guaranteed Delivery \"Classic\" backend infrastructure, which has been running for several years. \n \nBefore starting on building the next-generation of advertising system, it was important to understand the existing ad-serving system, and I started on this project. \n \nThe \"classic\" adserving system currently handles (globally) the online-serving of all of Yahoo's Guranteed Ad inventory, and contributes to Billion+ $$ in revenue (much of Yahoo's display ad revenue).  \n \nFiguring out and bug-fixing the core ad-selection and ad-scoring logic of the GD 1.0 adserver within 2 months of joining the team, amongst other enhancements and bug fixes. \n \nHelped the performance certification initiative by taking up performance testing and tuning of the GD 1.0 adserver for both Yahoo! Internal traffic (YAN) , and Yahoo Newspaper consortium (NC) traffic on the very first week of joining this team, and developed supporting scripts/tools for performance testing. The work helped towards adserver performance certification for for LZ 2.0 and 3.0 milestone-releases. Lead Software Engineer, Y! Alerts, Audience platform engineering Yahoo! Inc December 2007  –  August 2008  (9 months) Overall technical leadership for Yahoo! Alerts V2.0 infrastructure project for around 10 months, till its initial Launch. This was in addition to my responsibilities with the Y! Avatars project. \n \nYahoo! Alerts is a publish-subscribe system, used widely within and outside the company.  \n \nWithin this infrastructure project, I developed the scheduling component and the delayed-alerts component.  \n \nThe scheduling component figures when to send what Alert, and to whom, once a document-match is confirmed,  \nThe delayed-alert component stored the information in case users have subscribed to once-a-day or aggregated feeds, instead of realtime, and triggered a send to the user, at the appropriate time) Lead Software Engineer, Y! Alerts, Audience platform engineering Yahoo! Inc December 2007  –  August 2008  (9 months) Overall technical leadership for Yahoo! Alerts V2.0 infrastructure project for around 10 months, till its initial Launch. This was in addition to my responsibilities with the Y! Avatars project. \n \nYahoo! Alerts is a publish-subscribe system, used widely within and outside the company.  \n \nWithin this infrastructure project, I developed the scheduling component and the delayed-alerts component.  \n \nThe scheduling component figures when to send what Alert, and to whom, once a document-match is confirmed,  \nThe delayed-alert component stored the information in case users have subscribed to once-a-day or aggregated feeds, instead of realtime, and triggered a send to the user, at the appropriate time) Lead Software Engineer, Y! Avatars, Audience platform engineering Yahoo! Inc April 2006  –  August 2008  (2 years 5 months) Took over the ownership and technical leadership (Architecture, design, feature development) of Y! Avatars project (backend and frontend). Built, mentored and trained a team of around 10 people including senior engineers, front end engineers, visual and interaction designers, and interfaced with business product managers and content product managers.  \n \nWe built and maintained the software end-to-end, including deployment to and operations of 200+ servers and Multiple Storage Filers, Akamai/CDN, and later transitioned the operations to a dedicated operations team \n \nThe platform handled 300 Million+ views per day, including traffic from big properties like Yahoo! Mail, Yahoo Answers, Yahoo Messenger, and Yahoo Search results page. \n \nWe grew the product from a 3.5Million$$ per year Yahoo! property to 10Million$$ per year property, scaled the platform to handle 50X the traffic it handled when we took over it, Added fault tolerance to the architecture, added redundancy, and released multiple features (including virtual world, and the \"second most used\" Messenger plugin).  \n \nScaling this project within a short duration of 2 months after taking ownership, was critical to the Yahoo! Answers launch, and the then Y! Search EVP Qi Lu was in direct interaction with Senior management of this project, to ensure its success. \n \nThe backend components has challenges related scale and latency. The Server components we developed handled 15k+ requests/second/box, handling data for 60Million+ user-records partitioned and replicated over boxes distributed over many colos, and guaranteeing a 99.5% SLA of < 3 milliseconds.  \n \nThe system allowed users to select and combine \"items\" to create their own display-images (Users could select stuff from amongst a pool of ~7000, and ever/still-growing set of usable items) and this resulted in billions of possible unique combinations/display-images. Trading off storage costs with latency of combining at call-time, was another challenge. Lead Software Engineer, Y! Avatars, Audience platform engineering Yahoo! Inc April 2006  –  August 2008  (2 years 5 months) Took over the ownership and technical leadership (Architecture, design, feature development) of Y! Avatars project (backend and frontend). Built, mentored and trained a team of around 10 people including senior engineers, front end engineers, visual and interaction designers, and interfaced with business product managers and content product managers.  \n \nWe built and maintained the software end-to-end, including deployment to and operations of 200+ servers and Multiple Storage Filers, Akamai/CDN, and later transitioned the operations to a dedicated operations team \n \nThe platform handled 300 Million+ views per day, including traffic from big properties like Yahoo! Mail, Yahoo Answers, Yahoo Messenger, and Yahoo Search results page. \n \nWe grew the product from a 3.5Million$$ per year Yahoo! property to 10Million$$ per year property, scaled the platform to handle 50X the traffic it handled when we took over it, Added fault tolerance to the architecture, added redundancy, and released multiple features (including virtual world, and the \"second most used\" Messenger plugin).  \n \nScaling this project within a short duration of 2 months after taking ownership, was critical to the Yahoo! Answers launch, and the then Y! Search EVP Qi Lu was in direct interaction with Senior management of this project, to ensure its success. \n \nThe backend components has challenges related scale and latency. The Server components we developed handled 15k+ requests/second/box, handling data for 60Million+ user-records partitioned and replicated over boxes distributed over many colos, and guaranteeing a 99.5% SLA of < 3 milliseconds.  \n \nThe system allowed users to select and combine \"items\" to create their own display-images (Users could select stuff from amongst a pool of ~7000, and ever/still-growing set of usable items) and this resulted in billions of possible unique combinations/display-images. Trading off storage costs with latency of combining at call-time, was another challenge. Lead Software Engineer, Y! EM Classifieds, Audience platform engineering Yahoo! Inc January 2007  –  September 2007  (9 months) Y! Classifieds version 2.0, launched in Y! Emerging Markets (Y! Singapore, India, Vietnam, Taiwan) \n \nContributed to all areas of the project, and provided technical leadership to the backend team.  \n \nThis project was heavy on MySQL and \"Vespa\" (Vespa is an in-house searchbox solution/vertical search infrastructure, where we had to heavily tweak the parameters contributing to relevancy of documents and ranking of search results across multiple product-categories) Lead Software Engineer, Y! EM Classifieds, Audience platform engineering Yahoo! Inc January 2007  –  September 2007  (9 months) Y! Classifieds version 2.0, launched in Y! Emerging Markets (Y! Singapore, India, Vietnam, Taiwan) \n \nContributed to all areas of the project, and provided technical leadership to the backend team.  \n \nThis project was heavy on MySQL and \"Vespa\" (Vespa is an in-house searchbox solution/vertical search infrastructure, where we had to heavily tweak the parameters contributing to relevancy of documents and ranking of search results across multiple product-categories) Senior Software Engineer, Y! Briefcase 2.0, Audience platform engineering Yahoo! Inc December 2005  –  May 2006  (6 months) Built a fully functional prototype for Y! Briefcase version 2.0 (In approximately 4 months). Was part of a 2 member team which developed this software end-to-end.  \n \nWe also developed a Windows desktop client, exposing features for Yahoo! Briefcase, like automatic backup and restore of data, where you could configure the Folders you want to backup. The restores were check-pointed, and would restart from where it stopped, if you disconnected and reconnected later on.  \n \nThe product was demo'ed to the then Yahoo! COO, Dan Rosensweig, who was evaluating various strategic areas to invest in.  \n(Unfortunately, due to perceived storage costs at that time -- the project didn't get funding :). This was around the time when Gmail had just started ridiculing the whole storage-game. ) \n \n(In this project, we implemented features exposed by the then-famous idrive.com. Recently, companies like mozy.com have exposed similar features) Senior Software Engineer, Y! Briefcase 2.0, Audience platform engineering Yahoo! Inc December 2005  –  May 2006  (6 months) Built a fully functional prototype for Y! Briefcase version 2.0 (In approximately 4 months). Was part of a 2 member team which developed this software end-to-end.  \n \nWe also developed a Windows desktop client, exposing features for Yahoo! Briefcase, like automatic backup and restore of data, where you could configure the Folders you want to backup. The restores were check-pointed, and would restart from where it stopped, if you disconnected and reconnected later on.  \n \nThe product was demo'ed to the then Yahoo! COO, Dan Rosensweig, who was evaluating various strategic areas to invest in.  \n(Unfortunately, due to perceived storage costs at that time -- the project didn't get funding :). This was around the time when Gmail had just started ridiculing the whole storage-game. ) \n \n(In this project, we implemented features exposed by the then-famous idrive.com. Recently, companies like mozy.com have exposed similar features) Senior Software Engineer, Y! Message Boards 2.0, Audience platform engineering Yahoo! Inc December 2005  –  April 2006  (5 months) Y! Message boards 2.0 infrastructure project. \n \n(I contributed to this project, while I was also owning the Y! polls 2.0 platform) \n \nContributed to feature development and enhancements. Also performance tuned the infrastructure (around mysql database backend, and freebsd tcp stack tuning) Senior Software Engineer, Y! Message Boards 2.0, Audience platform engineering Yahoo! Inc December 2005  –  April 2006  (5 months) Y! Message boards 2.0 infrastructure project. \n \n(I contributed to this project, while I was also owning the Y! polls 2.0 platform) \n \nContributed to feature development and enhancements. Also performance tuned the infrastructure (around mysql database backend, and freebsd tcp stack tuning) Senior Software Engineer, Y! Polls 2.0, Audience platform engineering Yahoo! Inc April 2004  –  April 2006  (2 years 1 month) Y! Polls Platform version 2.0, revamping Yahoo's Polls infrastructure to scale to 100Million+ page views per day, and 10M+ writes per day, handling traffic from Y! Finance, Y! sports and Y! News Frontpages (amongst the 35+ Yahoo properties which used this system). This system had a global deployment, with independent setups for multiple geographies (US, Singapore, Latin America, China). The Backend infrastructure was written in C++, with MySQL database backend, and PHP for Templating. One of the first projects at Yahoo! to be built on top of MySQL backend.  \n \nApart from the core backend, I also worked on a unified administration/management tool for this system, through which content producers could create and schedule quizzes/polls for various Yahoo properties, across geographies. (Implementing the admin tool gave me some UI development exposure early on) \n \nWorked mostly as a single man army for the duration of this platform project, architecting, designing, maintaining and deploying, and customer interfacing for 2 years. \n \n \nDuring the duration of this project, I also got an opportunity to train some of Yahoo's Master Oracle DBAs, who were new to the MySQL world ;-) (This was mostly around MySQL configuration for InnoDB engine tweaked for performance, Replication chaining, and selective replication across multiple colos) Senior Software Engineer, Y! Polls 2.0, Audience platform engineering Yahoo! Inc April 2004  –  April 2006  (2 years 1 month) Y! Polls Platform version 2.0, revamping Yahoo's Polls infrastructure to scale to 100Million+ page views per day, and 10M+ writes per day, handling traffic from Y! Finance, Y! sports and Y! News Frontpages (amongst the 35+ Yahoo properties which used this system). This system had a global deployment, with independent setups for multiple geographies (US, Singapore, Latin America, China). The Backend infrastructure was written in C++, with MySQL database backend, and PHP for Templating. One of the first projects at Yahoo! to be built on top of MySQL backend.  \n \nApart from the core backend, I also worked on a unified administration/management tool for this system, through which content producers could create and schedule quizzes/polls for various Yahoo properties, across geographies. (Implementing the admin tool gave me some UI development exposure early on) \n \nWorked mostly as a single man army for the duration of this platform project, architecting, designing, maintaining and deploying, and customer interfacing for 2 years. \n \n \nDuring the duration of this project, I also got an opportunity to train some of Yahoo's Master Oracle DBAs, who were new to the MySQL world ;-) (This was mostly around MySQL configuration for InnoDB engine tweaked for performance, Replication chaining, and selective replication across multiple colos) Software Engineer, Y! Messenger Server Core Yahoo Inc! June 2003  –  March 2004  (10 months) Y! Messenger Server Core. Part of a (then) 10 member team which developed, maintained and deployed all of Y! Instant Messenger backend. \n \nContributed to new-feature development related to online presence indication infrastructure, online file transfer, realtime QOS statistics gathering, and performance testing and bug-fixing in other Core server components related to user and event management. Software Engineer, Y! Messenger Server Core Yahoo Inc! June 2003  –  March 2004  (10 months) Y! Messenger Server Core. Part of a (then) 10 member team which developed, maintained and deployed all of Y! Instant Messenger backend. \n \nContributed to new-feature development related to online presence indication infrastructure, online file transfer, realtime QOS statistics gathering, and performance testing and bug-fixing in other Core server components related to user and event management. Skills Scalability Product Management Information Retrieval MapReduce Distributed Systems MySQL Hadoop Perl Apache Pig Algorithms Large Scale Systems Design Strategy Big Data Innovation PHP Linux Architectures Architecture Python Machine Learning See 5+     See less Skills  Scalability Product Management Information Retrieval MapReduce Distributed Systems MySQL Hadoop Perl Apache Pig Algorithms Large Scale Systems Design Strategy Big Data Innovation PHP Linux Architectures Architecture Python Machine Learning See 5+     See less Scalability Product Management Information Retrieval MapReduce Distributed Systems MySQL Hadoop Perl Apache Pig Algorithms Large Scale Systems Design Strategy Big Data Innovation PHP Linux Architectures Architecture Python Machine Learning See 5+     See less Scalability Product Management Information Retrieval MapReduce Distributed Systems MySQL Hadoop Perl Apache Pig Algorithms Large Scale Systems Design Strategy Big Data Innovation PHP Linux Architectures Architecture Python Machine Learning See 5+     See less ", "Experience Software Engineer Yahoo! September 2013  – Present (2 years) Richardson, TX Software Engineer Ignite Technologies January 2007  –  September 2013  (6 years 9 months) Software Engineer Yahoo! February 2002  –  January 2007  (5 years) Software Engineer HireWorks March 2001  –  February 2002  (1 year) Software Engineer Yahoo! July 1999  –  March 2001  (1 year 9 months) Software Engineer Computer Language Research/RIA October 1992  –  July 1999  (6 years 10 months) Computer Systems Manager American Choral Directors Association June 1989  –  October 1992  (3 years 5 months) Software Engineer Yahoo! September 2013  – Present (2 years) Richardson, TX Software Engineer Yahoo! September 2013  – Present (2 years) Richardson, TX Software Engineer Ignite Technologies January 2007  –  September 2013  (6 years 9 months) Software Engineer Ignite Technologies January 2007  –  September 2013  (6 years 9 months) Software Engineer Yahoo! February 2002  –  January 2007  (5 years) Software Engineer Yahoo! February 2002  –  January 2007  (5 years) Software Engineer HireWorks March 2001  –  February 2002  (1 year) Software Engineer HireWorks March 2001  –  February 2002  (1 year) Software Engineer Yahoo! July 1999  –  March 2001  (1 year 9 months) Software Engineer Yahoo! July 1999  –  March 2001  (1 year 9 months) Software Engineer Computer Language Research/RIA October 1992  –  July 1999  (6 years 10 months) Software Engineer Computer Language Research/RIA October 1992  –  July 1999  (6 years 10 months) Computer Systems Manager American Choral Directors Association June 1989  –  October 1992  (3 years 5 months) Computer Systems Manager American Choral Directors Association June 1989  –  October 1992  (3 years 5 months) Skills C++ C SQL Server C# .NET ASP JavaScript XML Microsoft SQL Server Software Development Skills  C++ C SQL Server C# .NET ASP JavaScript XML Microsoft SQL Server Software Development C++ C SQL Server C# .NET ASP JavaScript XML Microsoft SQL Server Software Development C++ C SQL Server C# .NET ASP JavaScript XML Microsoft SQL Server Software Development Education Cameron University BS,  Computer Science 1985  – 1990 Cameron University BS,  Computer Science 1985  – 1990 Cameron University BS,  Computer Science 1985  – 1990 Cameron University BS,  Computer Science 1985  – 1990 ", "Summary I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. Summary I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. Experience Software Engineer Etsy 2015  – Present (less than a year) San Francisco, California Sr. Software Engineer - YDN Team Yahoo! May 2013  – Present (2 years 4 months) Sunnyvale, CA USA Revamping Yahoo!'s sites featuring technology offerings that the company provides for third party/independent developers. \n \nIdeating and executing on a corporate repository of development technology knowledge redesign, implementation and re-launch. Sr. Software Engineer - Carmot Media Team Yahoo! May 2012  –  May 2013  (1 year 1 month) Sunnyvale, CA USA Work on the addition of new features as well as providing bug fixes for Carmot: Yahoo!'s massive storage and serving platform of media content (news agencies stories, videos as well as some user generated content). \n \nOnline storage and serving components are built using C++ and run on a RHEL Linux environment. \n \nOffline storage and enrichment components are in a large Hadoop cluster and make use of Hadoop Map/Reduce, Hadoop Pig, and Hadoop Oozie technologies. Sr. Software Engineer - Content Agility Solutions Team Yahoo! July 2010  –  April 2012  (1 year 10 months) Sunnyvale, CA USA Designed and built systems to facilitate the company-wide effort to move away from siloed data stores and into cloud based platforms. \n \nProvided cloud platform customers with programs to bring data into the company's cloud platform (data onboarding). \n \nProvided cloud platform customers with reference implementations and prototypes of programs to build offline enrichments using cloud infrastructure. Mainly used Hadoop Map/Reduce, Hadoop Pig and Hadoop Oozie. \n \nServed as a liaison between cloud platform customers and cloud platform owners, advocating for better understanding among the parties. On one hand, encouraged customers to follow platform guidelines, and on the other one, argued in favor of implementation of customer requests. Sr. Software Engineer - Localization Tools Team Yahoo! Inc. January 2009  –  June 2010  (1 year 6 months) Sunnyvale, CA USA Implemented a REST based API to back a crowd-sourcing translation contribution system. Unit testing code coverage as well as static analysis in a continuous integration environment were used to enforce high quality standards. \n \nDesigned and implemented a workflow engine on the centralized localization system to allow the management of translations originating from different sources: vendor provided, in-house editorially provided, user contributed. \n \nImplemented tools for developers and release engineering to integrate into the development cycle while ensuring a correct translation package was available at every stage. Software Engineer - Localization Tools Team Yahoo! January 2008  –  December 2008  (1 year) Sunnyvale, CA USA Played a key role in the internationalization effort on high priority project \"Yahoo! Open Strategy\" by working with the team to ensure that all deliverables were built with internationalization in mind from the start. \n \nProvided tools that are used during release/deployment to make sure that releases ship with the right language and localization packs. \n \nWorked on regular sprint tasks once the project had a good internationalization foundation. Software Engineer - International Tiger Team Yahoo! October 2005  –  December 2007  (2 years 3 months) Sunnyvale, CA USA Designed and implemented internationalization features of new and existing Yahoo! properties: Y! Answers, Y! 360. \n \nDeveloped dynamic checking system for validating systems' correct handling of character encodings that is still in use and is used to check web content for many format and encoding related issues prior to pushing it live. Software Engineer Etsy 2015  – Present (less than a year) San Francisco, California Software Engineer Etsy 2015  – Present (less than a year) San Francisco, California Sr. Software Engineer - YDN Team Yahoo! May 2013  – Present (2 years 4 months) Sunnyvale, CA USA Revamping Yahoo!'s sites featuring technology offerings that the company provides for third party/independent developers. \n \nIdeating and executing on a corporate repository of development technology knowledge redesign, implementation and re-launch. Sr. Software Engineer - YDN Team Yahoo! May 2013  – Present (2 years 4 months) Sunnyvale, CA USA Revamping Yahoo!'s sites featuring technology offerings that the company provides for third party/independent developers. \n \nIdeating and executing on a corporate repository of development technology knowledge redesign, implementation and re-launch. Sr. Software Engineer - Carmot Media Team Yahoo! May 2012  –  May 2013  (1 year 1 month) Sunnyvale, CA USA Work on the addition of new features as well as providing bug fixes for Carmot: Yahoo!'s massive storage and serving platform of media content (news agencies stories, videos as well as some user generated content). \n \nOnline storage and serving components are built using C++ and run on a RHEL Linux environment. \n \nOffline storage and enrichment components are in a large Hadoop cluster and make use of Hadoop Map/Reduce, Hadoop Pig, and Hadoop Oozie technologies. Sr. Software Engineer - Carmot Media Team Yahoo! May 2012  –  May 2013  (1 year 1 month) Sunnyvale, CA USA Work on the addition of new features as well as providing bug fixes for Carmot: Yahoo!'s massive storage and serving platform of media content (news agencies stories, videos as well as some user generated content). \n \nOnline storage and serving components are built using C++ and run on a RHEL Linux environment. \n \nOffline storage and enrichment components are in a large Hadoop cluster and make use of Hadoop Map/Reduce, Hadoop Pig, and Hadoop Oozie technologies. Sr. Software Engineer - Content Agility Solutions Team Yahoo! July 2010  –  April 2012  (1 year 10 months) Sunnyvale, CA USA Designed and built systems to facilitate the company-wide effort to move away from siloed data stores and into cloud based platforms. \n \nProvided cloud platform customers with programs to bring data into the company's cloud platform (data onboarding). \n \nProvided cloud platform customers with reference implementations and prototypes of programs to build offline enrichments using cloud infrastructure. Mainly used Hadoop Map/Reduce, Hadoop Pig and Hadoop Oozie. \n \nServed as a liaison between cloud platform customers and cloud platform owners, advocating for better understanding among the parties. On one hand, encouraged customers to follow platform guidelines, and on the other one, argued in favor of implementation of customer requests. Sr. Software Engineer - Content Agility Solutions Team Yahoo! July 2010  –  April 2012  (1 year 10 months) Sunnyvale, CA USA Designed and built systems to facilitate the company-wide effort to move away from siloed data stores and into cloud based platforms. \n \nProvided cloud platform customers with programs to bring data into the company's cloud platform (data onboarding). \n \nProvided cloud platform customers with reference implementations and prototypes of programs to build offline enrichments using cloud infrastructure. Mainly used Hadoop Map/Reduce, Hadoop Pig and Hadoop Oozie. \n \nServed as a liaison between cloud platform customers and cloud platform owners, advocating for better understanding among the parties. On one hand, encouraged customers to follow platform guidelines, and on the other one, argued in favor of implementation of customer requests. Sr. Software Engineer - Localization Tools Team Yahoo! Inc. January 2009  –  June 2010  (1 year 6 months) Sunnyvale, CA USA Implemented a REST based API to back a crowd-sourcing translation contribution system. Unit testing code coverage as well as static analysis in a continuous integration environment were used to enforce high quality standards. \n \nDesigned and implemented a workflow engine on the centralized localization system to allow the management of translations originating from different sources: vendor provided, in-house editorially provided, user contributed. \n \nImplemented tools for developers and release engineering to integrate into the development cycle while ensuring a correct translation package was available at every stage. Sr. Software Engineer - Localization Tools Team Yahoo! Inc. January 2009  –  June 2010  (1 year 6 months) Sunnyvale, CA USA Implemented a REST based API to back a crowd-sourcing translation contribution system. Unit testing code coverage as well as static analysis in a continuous integration environment were used to enforce high quality standards. \n \nDesigned and implemented a workflow engine on the centralized localization system to allow the management of translations originating from different sources: vendor provided, in-house editorially provided, user contributed. \n \nImplemented tools for developers and release engineering to integrate into the development cycle while ensuring a correct translation package was available at every stage. Software Engineer - Localization Tools Team Yahoo! January 2008  –  December 2008  (1 year) Sunnyvale, CA USA Played a key role in the internationalization effort on high priority project \"Yahoo! Open Strategy\" by working with the team to ensure that all deliverables were built with internationalization in mind from the start. \n \nProvided tools that are used during release/deployment to make sure that releases ship with the right language and localization packs. \n \nWorked on regular sprint tasks once the project had a good internationalization foundation. Software Engineer - Localization Tools Team Yahoo! January 2008  –  December 2008  (1 year) Sunnyvale, CA USA Played a key role in the internationalization effort on high priority project \"Yahoo! Open Strategy\" by working with the team to ensure that all deliverables were built with internationalization in mind from the start. \n \nProvided tools that are used during release/deployment to make sure that releases ship with the right language and localization packs. \n \nWorked on regular sprint tasks once the project had a good internationalization foundation. Software Engineer - International Tiger Team Yahoo! October 2005  –  December 2007  (2 years 3 months) Sunnyvale, CA USA Designed and implemented internationalization features of new and existing Yahoo! properties: Y! Answers, Y! 360. \n \nDeveloped dynamic checking system for validating systems' correct handling of character encodings that is still in use and is used to check web content for many format and encoding related issues prior to pushing it live. Software Engineer - International Tiger Team Yahoo! October 2005  –  December 2007  (2 years 3 months) Sunnyvale, CA USA Designed and implemented internationalization features of new and existing Yahoo! properties: Y! Answers, Y! 360. \n \nDeveloped dynamic checking system for validating systems' correct handling of character encodings that is still in use and is used to check web content for many format and encoding related issues prior to pushing it live. Skills Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Skills  Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Education Universidad Autónoma Metropolitana 1997  – 2002 Universidad Autónoma Metropolitana 1997  – 2002 Universidad Autónoma Metropolitana 1997  – 2002 Universidad Autónoma Metropolitana 1997  – 2002 ", "Summary Frontend Software Engineer \n \n1. HTML, CSS, Javascript (ReactJS, YUI, and Vanilla Javascript), NodeJS \n2. Mobile web development  \n3. Large scale and high performance web site Summary Frontend Software Engineer \n \n1. HTML, CSS, Javascript (ReactJS, YUI, and Vanilla Javascript), NodeJS \n2. Mobile web development  \n3. Large scale and high performance web site Frontend Software Engineer \n \n1. HTML, CSS, Javascript (ReactJS, YUI, and Vanilla Javascript), NodeJS \n2. Mobile web development  \n3. Large scale and high performance web site Frontend Software Engineer \n \n1. HTML, CSS, Javascript (ReactJS, YUI, and Vanilla Javascript), NodeJS \n2. Mobile web development  \n3. Large scale and high performance web site Experience Senior Software Engineer Yahoo October 2013  – Present (1 year 11 months) United States Build new generation of Yahoo homepage (desktop and mobile web) on top of NodeJS. Engineering Team Lead Yahoo! June 2013  –  October 2013  (5 months) 1. Lead a team of 5 engineers to develop common content browsing experiences (APAC region) on top of Yahoo! Manhattan framework (NodeJS) \n2. Software developer using NodeJS, CSS, Dust, Express, Compass hosted on git \n3. Product backlog analysis and define \n4. Cross functional team (distributed teams) communication and collaboration \n5. Lead of testing framework Senior Software Engineer Yahoo! April 2013  –  October 2013  (7 months) 1. Build and develop new generation project on top of Yahoo! Manhattan framework (NodeJS) for Yahoo! APAC (Taiwan and Hong Kong). \n2. Evaluate and establish testing infrastructure/tool for new project. (Javascript testing framework). \n3. Design high level testing strategy. \n4. Facilitate scrum team for better agile practice. Software Engineer/ Quality Engineer Lead Yahoo! July 2012  –  April 2013  (10 months) 1. Deliver high quality product of Yahoo! News product \n2. Develop and quality control of Yahoo! News 2012 US Presidential election \n3. Team test strategy design \n4. White box testing \n5. Trainer of new generation testing in Singapore and Bangalore Quality Engineer Yahoo! November 2009  –  July 2012  (2 years 9 months) Media Products & Solutions, News Engineering \n•\tInitial next generation news product. \n• Merge 5 code base to 1 code base. \n• Scrum/Agile practice. \n• CI (Continuous integration) practice \n• Analyzed product requirement to developed test cases systematically. \n•\tInternational working experience.  \n•\tDeveloped automated testing script to increase testing efficiency and product quality. \n•\tContinuous Integration practice. \n•\tDeployed product across 6 regions 26 sites (news.yahoo.com). \n•\tDevelop and deploy partnership site Good Morning America with ABC News. \n•\tCross functional team cooperation Corporal of Signal Corps/ Engineer Lead Ministry of National Defense December 2008  –  November 2009  (1 year) •\tInitiated Army signal corps communication equipment simulator project. \n•\tAnalyzed project requirement and designed system architecture.  \n•\tDeveloped two web-based applications for military training purpose. \n•\tManaged/Trained 6 soldiers to develop educational simulator software. Senior Software Engineer Yahoo October 2013  – Present (1 year 11 months) United States Build new generation of Yahoo homepage (desktop and mobile web) on top of NodeJS. Senior Software Engineer Yahoo October 2013  – Present (1 year 11 months) United States Build new generation of Yahoo homepage (desktop and mobile web) on top of NodeJS. Engineering Team Lead Yahoo! June 2013  –  October 2013  (5 months) 1. Lead a team of 5 engineers to develop common content browsing experiences (APAC region) on top of Yahoo! Manhattan framework (NodeJS) \n2. Software developer using NodeJS, CSS, Dust, Express, Compass hosted on git \n3. Product backlog analysis and define \n4. Cross functional team (distributed teams) communication and collaboration \n5. Lead of testing framework Engineering Team Lead Yahoo! June 2013  –  October 2013  (5 months) 1. Lead a team of 5 engineers to develop common content browsing experiences (APAC region) on top of Yahoo! Manhattan framework (NodeJS) \n2. Software developer using NodeJS, CSS, Dust, Express, Compass hosted on git \n3. Product backlog analysis and define \n4. Cross functional team (distributed teams) communication and collaboration \n5. Lead of testing framework Senior Software Engineer Yahoo! April 2013  –  October 2013  (7 months) 1. Build and develop new generation project on top of Yahoo! Manhattan framework (NodeJS) for Yahoo! APAC (Taiwan and Hong Kong). \n2. Evaluate and establish testing infrastructure/tool for new project. (Javascript testing framework). \n3. Design high level testing strategy. \n4. Facilitate scrum team for better agile practice. Senior Software Engineer Yahoo! April 2013  –  October 2013  (7 months) 1. Build and develop new generation project on top of Yahoo! Manhattan framework (NodeJS) for Yahoo! APAC (Taiwan and Hong Kong). \n2. Evaluate and establish testing infrastructure/tool for new project. (Javascript testing framework). \n3. Design high level testing strategy. \n4. Facilitate scrum team for better agile practice. Software Engineer/ Quality Engineer Lead Yahoo! July 2012  –  April 2013  (10 months) 1. Deliver high quality product of Yahoo! News product \n2. Develop and quality control of Yahoo! News 2012 US Presidential election \n3. Team test strategy design \n4. White box testing \n5. Trainer of new generation testing in Singapore and Bangalore Software Engineer/ Quality Engineer Lead Yahoo! July 2012  –  April 2013  (10 months) 1. Deliver high quality product of Yahoo! News product \n2. Develop and quality control of Yahoo! News 2012 US Presidential election \n3. Team test strategy design \n4. White box testing \n5. Trainer of new generation testing in Singapore and Bangalore Quality Engineer Yahoo! November 2009  –  July 2012  (2 years 9 months) Media Products & Solutions, News Engineering \n•\tInitial next generation news product. \n• Merge 5 code base to 1 code base. \n• Scrum/Agile practice. \n• CI (Continuous integration) practice \n• Analyzed product requirement to developed test cases systematically. \n•\tInternational working experience.  \n•\tDeveloped automated testing script to increase testing efficiency and product quality. \n•\tContinuous Integration practice. \n•\tDeployed product across 6 regions 26 sites (news.yahoo.com). \n•\tDevelop and deploy partnership site Good Morning America with ABC News. \n•\tCross functional team cooperation Quality Engineer Yahoo! November 2009  –  July 2012  (2 years 9 months) Media Products & Solutions, News Engineering \n•\tInitial next generation news product. \n• Merge 5 code base to 1 code base. \n• Scrum/Agile practice. \n• CI (Continuous integration) practice \n• Analyzed product requirement to developed test cases systematically. \n•\tInternational working experience.  \n•\tDeveloped automated testing script to increase testing efficiency and product quality. \n•\tContinuous Integration practice. \n•\tDeployed product across 6 regions 26 sites (news.yahoo.com). \n•\tDevelop and deploy partnership site Good Morning America with ABC News. \n•\tCross functional team cooperation Corporal of Signal Corps/ Engineer Lead Ministry of National Defense December 2008  –  November 2009  (1 year) •\tInitiated Army signal corps communication equipment simulator project. \n•\tAnalyzed project requirement and designed system architecture.  \n•\tDeveloped two web-based applications for military training purpose. \n•\tManaged/Trained 6 soldiers to develop educational simulator software. Corporal of Signal Corps/ Engineer Lead Ministry of National Defense December 2008  –  November 2009  (1 year) •\tInitiated Army signal corps communication equipment simulator project. \n•\tAnalyzed project requirement and designed system architecture.  \n•\tDeveloped two web-based applications for military training purpose. \n•\tManaged/Trained 6 soldiers to develop educational simulator software. Languages Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Java Selenium Testing TestNG ActionScript Flex Agile Methodologies Continuous Integration Automated Software... C++ YUI CSS JavaScript PHP Web Applications Selenium Node.js Mocha Scrum MySQL HTML 5 Test Automation Testing REST Hudson Git Subversion Software Engineering AJAX Maven Software Quality... User Experience Integration Agile Project Management See 18+     See less Skills  Java Selenium Testing TestNG ActionScript Flex Agile Methodologies Continuous Integration Automated Software... C++ YUI CSS JavaScript PHP Web Applications Selenium Node.js Mocha Scrum MySQL HTML 5 Test Automation Testing REST Hudson Git Subversion Software Engineering AJAX Maven Software Quality... User Experience Integration Agile Project Management See 18+     See less Java Selenium Testing TestNG ActionScript Flex Agile Methodologies Continuous Integration Automated Software... C++ YUI CSS JavaScript PHP Web Applications Selenium Node.js Mocha Scrum MySQL HTML 5 Test Automation Testing REST Hudson Git Subversion Software Engineering AJAX Maven Software Quality... User Experience Integration Agile Project Management See 18+     See less Java Selenium Testing TestNG ActionScript Flex Agile Methodologies Continuous Integration Automated Software... C++ YUI CSS JavaScript PHP Web Applications Selenium Node.js Mocha Scrum MySQL HTML 5 Test Automation Testing REST Hudson Git Subversion Software Engineering AJAX Maven Software Quality... User Experience Integration Agile Project Management See 18+     See less Education National Chengchi University Bachelor of Business Administration,  Management Information Systems 2004  – 2008 Universität Mannheim Exchange Program,  Business/Commerce , General 2008  – 2008 National Chengchi University Bachelor of Business Administration,  Management Information Systems 2004  – 2008 National Chengchi University Bachelor of Business Administration,  Management Information Systems 2004  – 2008 National Chengchi University Bachelor of Business Administration,  Management Information Systems 2004  – 2008 Universität Mannheim Exchange Program,  Business/Commerce , General 2008  – 2008 Universität Mannheim Exchange Program,  Business/Commerce , General 2008  – 2008 Universität Mannheim Exchange Program,  Business/Commerce , General 2008  – 2008 ", "Summary I am a front end engineer with a passion for user experience and user interface design. I believe in creating a well performant product, but I enjoy my job the most when I get to make it more intuitive, interactive and sharp. I am a pixel pusher! Summary I am a front end engineer with a passion for user experience and user interface design. I believe in creating a well performant product, but I enjoy my job the most when I get to make it more intuitive, interactive and sharp. I am a pixel pusher! I am a front end engineer with a passion for user experience and user interface design. I believe in creating a well performant product, but I enjoy my job the most when I get to make it more intuitive, interactive and sharp. I am a pixel pusher! I am a front end engineer with a passion for user experience and user interface design. I believe in creating a well performant product, but I enjoy my job the most when I get to make it more intuitive, interactive and sharp. I am a pixel pusher! Experience Senior Software Engineer, UX Lead Yahoo - Video Experiences October 2014  – Present (11 months) Santa Monica, California • Led a 3 person team tasked to build engaging video modules used all over the Yahoo network including Yahoo Screen redesign; UX improvements and new feature recommendations increased user engagement by 5% over last quarter. \n• Mentored and supervised three new college grads on all aspects of coding and team processes; all of them went on to being highly productive during their first quarter. \n• Developed product and engineering roadmaps, flush out task allocation and organize the scrum board for a team of nine as the Scrum Master. Software Engineer, Tech Yahoo Yahoo - Yahoo Screen July 2013  –  August 2014  (1 year 2 months) Santa Monica, California • Spearheaded the development of 90% of the user facing components for Yahoo’s redesigned video site for all three screens; The new site along with its partner sites facilitated a 76% YoY growth in the number of video streams and currently attracts over 65.3 million users per month. \n• Was awarded the Yahoo You Rock Award for excellence in Q1 2014. Software Engineer, Intermediate Yahoo - Media Content Experiences October 2012  –  June 2013  (9 months) Santa Monica, California • Owned development of the article and slideshow experience for Yahoo News, Sports, Finance and other media sites across three screens as part of the core content presentation team leading the redesign of Yahoo News; Yahoo News site today has over 450 million users per month. \n• Architected a flexible system for developing custom themes for Yahoo media sites in a mere span of three days; The system was widely adopted by over 5 different media properties. Software Engineer, Intermediate Yahoo - Media Foundation Team July 2011  –  September 2012  (1 year 3 months) Santa Monica, California Built scaleable client and server side, customer and partner facing applications for the Yahoo Publishing Platform empowering 300+ highly trafficked Yahoo Media websites in over 10 different languages. Interactive Technology Intern PLUM Agency, New York May 2010  –  August 2010  (4 months) Manhattan, New York Web development, website UI, mobile site development. Senior Software Engineer, UX Lead Yahoo - Video Experiences October 2014  – Present (11 months) Santa Monica, California • Led a 3 person team tasked to build engaging video modules used all over the Yahoo network including Yahoo Screen redesign; UX improvements and new feature recommendations increased user engagement by 5% over last quarter. \n• Mentored and supervised three new college grads on all aspects of coding and team processes; all of them went on to being highly productive during their first quarter. \n• Developed product and engineering roadmaps, flush out task allocation and organize the scrum board for a team of nine as the Scrum Master. Senior Software Engineer, UX Lead Yahoo - Video Experiences October 2014  – Present (11 months) Santa Monica, California • Led a 3 person team tasked to build engaging video modules used all over the Yahoo network including Yahoo Screen redesign; UX improvements and new feature recommendations increased user engagement by 5% over last quarter. \n• Mentored and supervised three new college grads on all aspects of coding and team processes; all of them went on to being highly productive during their first quarter. \n• Developed product and engineering roadmaps, flush out task allocation and organize the scrum board for a team of nine as the Scrum Master. Software Engineer, Tech Yahoo Yahoo - Yahoo Screen July 2013  –  August 2014  (1 year 2 months) Santa Monica, California • Spearheaded the development of 90% of the user facing components for Yahoo’s redesigned video site for all three screens; The new site along with its partner sites facilitated a 76% YoY growth in the number of video streams and currently attracts over 65.3 million users per month. \n• Was awarded the Yahoo You Rock Award for excellence in Q1 2014. Software Engineer, Tech Yahoo Yahoo - Yahoo Screen July 2013  –  August 2014  (1 year 2 months) Santa Monica, California • Spearheaded the development of 90% of the user facing components for Yahoo’s redesigned video site for all three screens; The new site along with its partner sites facilitated a 76% YoY growth in the number of video streams and currently attracts over 65.3 million users per month. \n• Was awarded the Yahoo You Rock Award for excellence in Q1 2014. Software Engineer, Intermediate Yahoo - Media Content Experiences October 2012  –  June 2013  (9 months) Santa Monica, California • Owned development of the article and slideshow experience for Yahoo News, Sports, Finance and other media sites across three screens as part of the core content presentation team leading the redesign of Yahoo News; Yahoo News site today has over 450 million users per month. \n• Architected a flexible system for developing custom themes for Yahoo media sites in a mere span of three days; The system was widely adopted by over 5 different media properties. Software Engineer, Intermediate Yahoo - Media Content Experiences October 2012  –  June 2013  (9 months) Santa Monica, California • Owned development of the article and slideshow experience for Yahoo News, Sports, Finance and other media sites across three screens as part of the core content presentation team leading the redesign of Yahoo News; Yahoo News site today has over 450 million users per month. \n• Architected a flexible system for developing custom themes for Yahoo media sites in a mere span of three days; The system was widely adopted by over 5 different media properties. Software Engineer, Intermediate Yahoo - Media Foundation Team July 2011  –  September 2012  (1 year 3 months) Santa Monica, California Built scaleable client and server side, customer and partner facing applications for the Yahoo Publishing Platform empowering 300+ highly trafficked Yahoo Media websites in over 10 different languages. Software Engineer, Intermediate Yahoo - Media Foundation Team July 2011  –  September 2012  (1 year 3 months) Santa Monica, California Built scaleable client and server side, customer and partner facing applications for the Yahoo Publishing Platform empowering 300+ highly trafficked Yahoo Media websites in over 10 different languages. Interactive Technology Intern PLUM Agency, New York May 2010  –  August 2010  (4 months) Manhattan, New York Web development, website UI, mobile site development. Interactive Technology Intern PLUM Agency, New York May 2010  –  August 2010  (4 months) Manhattan, New York Web development, website UI, mobile site development. Languages English Full professional proficiency Bengali Native or bilingual proficiency Hindi Native or bilingual proficiency English Full professional proficiency Bengali Native or bilingual proficiency Hindi Native or bilingual proficiency English Full professional proficiency Bengali Native or bilingual proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills PHP Kanban Agile Methodologies YUI JavaScript User Interface Web Development Front-end JSON HTML 5 CSS Git Subversion Scrum REST User Experience HTML5 CSS3 HTML See 4+     See less Skills  PHP Kanban Agile Methodologies YUI JavaScript User Interface Web Development Front-end JSON HTML 5 CSS Git Subversion Scrum REST User Experience HTML5 CSS3 HTML See 4+     See less PHP Kanban Agile Methodologies YUI JavaScript User Interface Web Development Front-end JSON HTML 5 CSS Git Subversion Scrum REST User Experience HTML5 CSS3 HTML See 4+     See less PHP Kanban Agile Methodologies YUI JavaScript User Interface Web Development Front-end JSON HTML 5 CSS Git Subversion Scrum REST User Experience HTML5 CSS3 HTML See 4+     See less Education Columbia Engineering MS,  Computer Science 2009  – 2010 Heritage Institute of Technology BTech,  Information Technology 2005  – 2009 Columbia Engineering MS,  Computer Science 2009  – 2010 Columbia Engineering MS,  Computer Science 2009  – 2010 Columbia Engineering MS,  Computer Science 2009  – 2010 Heritage Institute of Technology BTech,  Information Technology 2005  – 2009 Heritage Institute of Technology BTech,  Information Technology 2005  – 2009 Heritage Institute of Technology BTech,  Information Technology 2005  – 2009 ", "Experience Senior Software Engineer in Search Yahoo September 2014  – Present (1 year) San Francisco Bay Area Software Engineer in Platforms Yahoo October 2012  –  September 2014  (2 years) San Francisco Bay Area Developed components and machine-learned models for the Content Analysis Platform. Specialized in feature engineering, training and quality analysis of machine-learned relevance ranking models for entities in arbitrary web pages. \n \nRole evolved into lead engineer, providing technical guidance to customers, product managers, and junior engineers. Software Engineer in Search (Japanese Language) Yahoo! January 2008  –  October 2012  (4 years 10 months) San Francisco Bay Area Did research and development of machine learning applications for Yahoo! Japan search properties, including phrase recognition and spam document classification. \n \nDid research and development of features for Yahoo! Japan search properties (primarily mobile web search) including crawling, document processing and entity extraction, indexing, query processing, and front-end systems. \n \nPerformed regular analysis of search result relevance, focusing on comparison with competitors. \n \nRegularly conducted correspondence with engineers in Japan, and delivered presentations of analysis and other project results, in Japanese. Web Team Manager, Software Engineer Become Japan Corporation May 2006  –  November 2007  (1 year 7 months) Tokyo, Japan Served as manager and lead engineer of the company's team of web application engineers, in charge of gathering project requirements and managing team member schedules. \n \nDeveloped and maintained the major server-side front-end system components of the company's comparison shopping search engine, including socket level programming and multithread programming. Senior Software Engineer Ashley Associates K.K. September 2003  –  April 2006  (2 years 8 months) Tokyo, Japan Developed and maintained web Content Management Systems for numerous clients, including application programming and management of databases using a variety of character encodings (Shift JIS, Unicode, ISO-2022-JP, GB, etc.) and developed conversion methods for vendor-specific character sets. \n \nIn a project management role for more complex development projects, maintained regular communication with clients and conveyed their requirements to members of the involved departments (programming, production, design). In instances where I managed multiple projects simultaneously, I assigned priorities and maintained schedules for each team. \n \nOccasionally assisted with translations for the translation services department. Systems Engineer Fujitsu Chubu Systems Limited August 2002  –  August 2003  (1 year 1 month) Nagoya, Aichi, Japan Developed simulation software for industrial distribution systems, including an expert system back-end for finding optimal use of space inside containers and delivery trucks, and a front-end which obtained container packing configuration data from SQL databases and generated a graphical display that could be rotated in three dimensions using the mouse. \n \nMaintained documentation such as specifications and internal reports in Japanese. Software Engineer (Intern) /n software August 2000  –  June 2002  (1 year 11 months) Raleigh-Durham, North Carolina Area Wrote software demonstrations of visual programming components that support all major internet protocols. Examples with full graphical user interfaces included an email client, a Usenet newsreader, and an FTP client. \n \nDesigned and developed internet chat software components for AOL Instant Messenger, MSN Messenger, and Jabber. Senior Software Engineer in Search Yahoo September 2014  – Present (1 year) San Francisco Bay Area Senior Software Engineer in Search Yahoo September 2014  – Present (1 year) San Francisco Bay Area Software Engineer in Platforms Yahoo October 2012  –  September 2014  (2 years) San Francisco Bay Area Developed components and machine-learned models for the Content Analysis Platform. Specialized in feature engineering, training and quality analysis of machine-learned relevance ranking models for entities in arbitrary web pages. \n \nRole evolved into lead engineer, providing technical guidance to customers, product managers, and junior engineers. Software Engineer in Platforms Yahoo October 2012  –  September 2014  (2 years) San Francisco Bay Area Developed components and machine-learned models for the Content Analysis Platform. Specialized in feature engineering, training and quality analysis of machine-learned relevance ranking models for entities in arbitrary web pages. \n \nRole evolved into lead engineer, providing technical guidance to customers, product managers, and junior engineers. Software Engineer in Search (Japanese Language) Yahoo! January 2008  –  October 2012  (4 years 10 months) San Francisco Bay Area Did research and development of machine learning applications for Yahoo! Japan search properties, including phrase recognition and spam document classification. \n \nDid research and development of features for Yahoo! Japan search properties (primarily mobile web search) including crawling, document processing and entity extraction, indexing, query processing, and front-end systems. \n \nPerformed regular analysis of search result relevance, focusing on comparison with competitors. \n \nRegularly conducted correspondence with engineers in Japan, and delivered presentations of analysis and other project results, in Japanese. Software Engineer in Search (Japanese Language) Yahoo! January 2008  –  October 2012  (4 years 10 months) San Francisco Bay Area Did research and development of machine learning applications for Yahoo! Japan search properties, including phrase recognition and spam document classification. \n \nDid research and development of features for Yahoo! Japan search properties (primarily mobile web search) including crawling, document processing and entity extraction, indexing, query processing, and front-end systems. \n \nPerformed regular analysis of search result relevance, focusing on comparison with competitors. \n \nRegularly conducted correspondence with engineers in Japan, and delivered presentations of analysis and other project results, in Japanese. Web Team Manager, Software Engineer Become Japan Corporation May 2006  –  November 2007  (1 year 7 months) Tokyo, Japan Served as manager and lead engineer of the company's team of web application engineers, in charge of gathering project requirements and managing team member schedules. \n \nDeveloped and maintained the major server-side front-end system components of the company's comparison shopping search engine, including socket level programming and multithread programming. Web Team Manager, Software Engineer Become Japan Corporation May 2006  –  November 2007  (1 year 7 months) Tokyo, Japan Served as manager and lead engineer of the company's team of web application engineers, in charge of gathering project requirements and managing team member schedules. \n \nDeveloped and maintained the major server-side front-end system components of the company's comparison shopping search engine, including socket level programming and multithread programming. Senior Software Engineer Ashley Associates K.K. September 2003  –  April 2006  (2 years 8 months) Tokyo, Japan Developed and maintained web Content Management Systems for numerous clients, including application programming and management of databases using a variety of character encodings (Shift JIS, Unicode, ISO-2022-JP, GB, etc.) and developed conversion methods for vendor-specific character sets. \n \nIn a project management role for more complex development projects, maintained regular communication with clients and conveyed their requirements to members of the involved departments (programming, production, design). In instances where I managed multiple projects simultaneously, I assigned priorities and maintained schedules for each team. \n \nOccasionally assisted with translations for the translation services department. Senior Software Engineer Ashley Associates K.K. September 2003  –  April 2006  (2 years 8 months) Tokyo, Japan Developed and maintained web Content Management Systems for numerous clients, including application programming and management of databases using a variety of character encodings (Shift JIS, Unicode, ISO-2022-JP, GB, etc.) and developed conversion methods for vendor-specific character sets. \n \nIn a project management role for more complex development projects, maintained regular communication with clients and conveyed their requirements to members of the involved departments (programming, production, design). In instances where I managed multiple projects simultaneously, I assigned priorities and maintained schedules for each team. \n \nOccasionally assisted with translations for the translation services department. Systems Engineer Fujitsu Chubu Systems Limited August 2002  –  August 2003  (1 year 1 month) Nagoya, Aichi, Japan Developed simulation software for industrial distribution systems, including an expert system back-end for finding optimal use of space inside containers and delivery trucks, and a front-end which obtained container packing configuration data from SQL databases and generated a graphical display that could be rotated in three dimensions using the mouse. \n \nMaintained documentation such as specifications and internal reports in Japanese. Systems Engineer Fujitsu Chubu Systems Limited August 2002  –  August 2003  (1 year 1 month) Nagoya, Aichi, Japan Developed simulation software for industrial distribution systems, including an expert system back-end for finding optimal use of space inside containers and delivery trucks, and a front-end which obtained container packing configuration data from SQL databases and generated a graphical display that could be rotated in three dimensions using the mouse. \n \nMaintained documentation such as specifications and internal reports in Japanese. Software Engineer (Intern) /n software August 2000  –  June 2002  (1 year 11 months) Raleigh-Durham, North Carolina Area Wrote software demonstrations of visual programming components that support all major internet protocols. Examples with full graphical user interfaces included an email client, a Usenet newsreader, and an FTP client. \n \nDesigned and developed internet chat software components for AOL Instant Messenger, MSN Messenger, and Jabber. Software Engineer (Intern) /n software August 2000  –  June 2002  (1 year 11 months) Raleigh-Durham, North Carolina Area Wrote software demonstrations of visual programming components that support all major internet protocols. Examples with full graphical user interfaces included an email client, a Usenet newsreader, and an FTP client. \n \nDesigned and developed internet chat software components for AOL Instant Messenger, MSN Messenger, and Jabber. Languages English Japanese English Japanese English Japanese Skills Natural Language... Artificial Intelligence Machine Learning Data Mining Algorithms Information Retrieval Java C++ MySQL Distributed Systems Scalability Software Engineering Linux Computer Science Hadoop Skills  Natural Language... Artificial Intelligence Machine Learning Data Mining Algorithms Information Retrieval Java C++ MySQL Distributed Systems Scalability Software Engineering Linux Computer Science Hadoop Natural Language... Artificial Intelligence Machine Learning Data Mining Algorithms Information Retrieval Java C++ MySQL Distributed Systems Scalability Software Engineering Linux Computer Science Hadoop Natural Language... Artificial Intelligence Machine Learning Data Mining Algorithms Information Retrieval Java C++ MySQL Distributed Systems Scalability Software Engineering Linux Computer Science Hadoop Education Stanford University Graduate Certificate,  Artificial Intelligence 2009  – 2011 North Carolina State University BS,  Major: Computer Science | Minor: Japanese Language 1997  – 2002 Nagoya University 2001  – 2001 Exchange student in the NUPACE program. Stanford University Graduate Certificate,  Artificial Intelligence 2009  – 2011 Stanford University Graduate Certificate,  Artificial Intelligence 2009  – 2011 Stanford University Graduate Certificate,  Artificial Intelligence 2009  – 2011 North Carolina State University BS,  Major: Computer Science | Minor: Japanese Language 1997  – 2002 North Carolina State University BS,  Major: Computer Science | Minor: Japanese Language 1997  – 2002 North Carolina State University BS,  Major: Computer Science | Minor: Japanese Language 1997  – 2002 Nagoya University 2001  – 2001 Exchange student in the NUPACE program. Nagoya University 2001  – 2001 Exchange student in the NUPACE program. Nagoya University 2001  – 2001 Exchange student in the NUPACE program. Honors & Awards Yahoo Q2 Hack Day Award, Search June 2015 Yahoo Q3 Hack Day Award, Best Overall Hack July 2014 Yahoo Q4 Hack Day Award, Mobile Category November 2013 Yahoo Q3 Hack Day Hacker's Choice Award September 2012 James T. Caldwell Scholarship Golden Key National Honor Society Upsilon Pi Epsilon Honor Society in the Computing Sciences Phi Kappa Phi Honor Society Yahoo Q2 Hack Day Award, Search June 2015 Yahoo Q2 Hack Day Award, Search June 2015 Yahoo Q2 Hack Day Award, Search June 2015 Yahoo Q3 Hack Day Award, Best Overall Hack July 2014 Yahoo Q3 Hack Day Award, Best Overall Hack July 2014 Yahoo Q3 Hack Day Award, Best Overall Hack July 2014 Yahoo Q4 Hack Day Award, Mobile Category November 2013 Yahoo Q4 Hack Day Award, Mobile Category November 2013 Yahoo Q4 Hack Day Award, Mobile Category November 2013 Yahoo Q3 Hack Day Hacker's Choice Award September 2012 Yahoo Q3 Hack Day Hacker's Choice Award September 2012 Yahoo Q3 Hack Day Hacker's Choice Award September 2012 James T. Caldwell Scholarship James T. Caldwell Scholarship James T. Caldwell Scholarship Golden Key National Honor Society Golden Key National Honor Society Golden Key National Honor Society Upsilon Pi Epsilon Honor Society in the Computing Sciences Upsilon Pi Epsilon Honor Society in the Computing Sciences Upsilon Pi Epsilon Honor Society in the Computing Sciences Phi Kappa Phi Honor Society Phi Kappa Phi Honor Society Phi Kappa Phi Honor Society ", "Summary Specialties:Java, PHP, JavaScript, HTML, CSS, XML Summary Specialties:Java, PHP, JavaScript, HTML, CSS, XML Specialties:Java, PHP, JavaScript, HTML, CSS, XML Specialties:Java, PHP, JavaScript, HTML, CSS, XML Experience Senior Software Engineer Technical Lead Yahoo October 2014  – Present (11 months) Sunnyvale, CA, USA Led a team to deliver Tumblr theme-based solutions to quickly launch Yahoo sites that can support premium branding as well as targeted advertising campaigns. The theme generation solution is build on an internal framework that is based on React.js and Flux architecture and can generate Tumblr themes that are highly customizable to support all Yahoo properties. Lastly, these Yahoo sites are fully internationalized, instrumented to gather data for analytic, measured for performance, monitored for user-impacting incidents with fallback solution, and globally available for traffic scalabilty.  Front-End Software Engineer Yahoo! August 2011  – Present (4 years 1 month) Mountain View, California, USA Front-end software engineer at Custom Brand Experience group. The group specializes in creating extensively customized content for advertisers and developing special event sites to market Yahoo! as one of the top content provider on the web. Software Engineer Yahoo! October 2007  –  August 2011  (3 years 11 months) Content Platform Tools Engineering - develop tools to manage, enrich, and share content across Yahoo's media properties. Contractor at Yahoo! WorkforceLogic July 2007  –  October 2007  (4 months) Contracted as a web developer for Yahoo! internal publishing tools Senior Software Engineer Technical Lead Yahoo October 2014  – Present (11 months) Sunnyvale, CA, USA Led a team to deliver Tumblr theme-based solutions to quickly launch Yahoo sites that can support premium branding as well as targeted advertising campaigns. The theme generation solution is build on an internal framework that is based on React.js and Flux architecture and can generate Tumblr themes that are highly customizable to support all Yahoo properties. Lastly, these Yahoo sites are fully internationalized, instrumented to gather data for analytic, measured for performance, monitored for user-impacting incidents with fallback solution, and globally available for traffic scalabilty.  Senior Software Engineer Technical Lead Yahoo October 2014  – Present (11 months) Sunnyvale, CA, USA Led a team to deliver Tumblr theme-based solutions to quickly launch Yahoo sites that can support premium branding as well as targeted advertising campaigns. The theme generation solution is build on an internal framework that is based on React.js and Flux architecture and can generate Tumblr themes that are highly customizable to support all Yahoo properties. Lastly, these Yahoo sites are fully internationalized, instrumented to gather data for analytic, measured for performance, monitored for user-impacting incidents with fallback solution, and globally available for traffic scalabilty.  Front-End Software Engineer Yahoo! August 2011  – Present (4 years 1 month) Mountain View, California, USA Front-end software engineer at Custom Brand Experience group. The group specializes in creating extensively customized content for advertisers and developing special event sites to market Yahoo! as one of the top content provider on the web. Front-End Software Engineer Yahoo! August 2011  – Present (4 years 1 month) Mountain View, California, USA Front-end software engineer at Custom Brand Experience group. The group specializes in creating extensively customized content for advertisers and developing special event sites to market Yahoo! as one of the top content provider on the web. Software Engineer Yahoo! October 2007  –  August 2011  (3 years 11 months) Content Platform Tools Engineering - develop tools to manage, enrich, and share content across Yahoo's media properties. Software Engineer Yahoo! October 2007  –  August 2011  (3 years 11 months) Content Platform Tools Engineering - develop tools to manage, enrich, and share content across Yahoo's media properties. Contractor at Yahoo! WorkforceLogic July 2007  –  October 2007  (4 months) Contracted as a web developer for Yahoo! internal publishing tools Contractor at Yahoo! WorkforceLogic July 2007  –  October 2007  (4 months) Contracted as a web developer for Yahoo! internal publishing tools Skills JavaScript Node.js HTML CSS PHP Java YUI Skills  JavaScript Node.js HTML CSS PHP Java YUI JavaScript Node.js HTML CSS PHP Java YUI JavaScript Node.js HTML CSS PHP Java YUI Education University of California at Bachelor,  Computer Science 2001  – 2007 University of California, San Diego BS,  Computer Science 2001  – 2007 University of California at Bachelor,  Computer Science 2001  – 2007 University of California at Bachelor,  Computer Science 2001  – 2007 University of California at Bachelor,  Computer Science 2001  – 2007 University of California, San Diego BS,  Computer Science 2001  – 2007 University of California, San Diego BS,  Computer Science 2001  – 2007 University of California, San Diego BS,  Computer Science 2001  – 2007 ", "Summary • Proficiency in designing the CMS solutions through analyzing and researching the existing workflows, consolidating the requirements and then providing the better solution to improve process and save the operation costs.  \n• Good knowledge in tuning performance of data mining in MySQL and Oracle and proficiency in designing statistics reporting GUI through proper and efficient front-end techniques.  \n• Expert in designing the high-productive publishing platforms with straight-forward interactive designs and concise operating workflow based on efficient front-end technique implementation. \n• Possessed the great project management with good problem solving and conflict resolution skills Specialties:Internalization, Architecture, Statistics, Publishing Eco system, Web high performance Summary • Proficiency in designing the CMS solutions through analyzing and researching the existing workflows, consolidating the requirements and then providing the better solution to improve process and save the operation costs.  \n• Good knowledge in tuning performance of data mining in MySQL and Oracle and proficiency in designing statistics reporting GUI through proper and efficient front-end techniques.  \n• Expert in designing the high-productive publishing platforms with straight-forward interactive designs and concise operating workflow based on efficient front-end technique implementation. \n• Possessed the great project management with good problem solving and conflict resolution skills Specialties:Internalization, Architecture, Statistics, Publishing Eco system, Web high performance • Proficiency in designing the CMS solutions through analyzing and researching the existing workflows, consolidating the requirements and then providing the better solution to improve process and save the operation costs.  \n• Good knowledge in tuning performance of data mining in MySQL and Oracle and proficiency in designing statistics reporting GUI through proper and efficient front-end techniques.  \n• Expert in designing the high-productive publishing platforms with straight-forward interactive designs and concise operating workflow based on efficient front-end technique implementation. \n• Possessed the great project management with good problem solving and conflict resolution skills Specialties:Internalization, Architecture, Statistics, Publishing Eco system, Web high performance • Proficiency in designing the CMS solutions through analyzing and researching the existing workflows, consolidating the requirements and then providing the better solution to improve process and save the operation costs.  \n• Good knowledge in tuning performance of data mining in MySQL and Oracle and proficiency in designing statistics reporting GUI through proper and efficient front-end techniques.  \n• Expert in designing the high-productive publishing platforms with straight-forward interactive designs and concise operating workflow based on efficient front-end technique implementation. \n• Possessed the great project management with good problem solving and conflict resolution skills Specialties:Internalization, Architecture, Statistics, Publishing Eco system, Web high performance Experience Search Principal Software Engineer Yahoo April 2014  – Present (1 year 5 months) sunnyvale Lead Boss API, Boss Portal Media Principal Software Engineer Yahoo! January 2012  –  May 2014  (2 years 5 months) United States I am responsible for managing Yahoo!’s Media Publishing Tool within the Yahoo! Media Department in the Sunnyvale, California office. The Media Publishing Department has offices in Denver, Colorado and Bangalore, India, along with the Sunnyvale office. \n \nI am responsible for working with other department leaders within the Media Department, that are located in Sunnyvale, on the development of the Media Publishing Tools. The publishing platform is the central tool used by all Media website publications throughout Yahoo!. The global websites for Yahoo! News, Sports, Finance, Movies, Shine, and Music for example. \n \ntech : Nodejs, swig, express. YUI. Sr. Software Engineer Yahoo! December 2008  –  January 2012  (3 years 2 months) I have led a project for publishing system for all media properties in Yahoo! - News, Sports, Finance, Movie, and Etc. Mainly it's for internal users such as engineers, producers and editor to build/manage it. the goal is to build publishing ecosystem including site builder, content programming, and statistics. \n \nI have worked on worldwide engineers and producers - TW, India, Sunnyvale, Santa Monica, .. Platform Engineering Manager Yahoo June 2004  –  November 2008  (4 years 6 months) YAHOO ASIA REGIONAL ENGINEERING TEAM  \n•\tMainly charging of CMS platform development and deployment in APAC. \n•\tFormed the Asia CMS cooperation through closely working with KR, TW and HK locals and increase Media Suite adoption in APAC. \n•\tAssisted to deploy EPT in HK. \n•\tDeployed Pyramid in Japan Y! and implemented to 4 media properties. It will expand to all Y! JP media properties including front page. \n•\tDesigned and developed real-time metrics reporting system Sphinx used for visualizing and reusing the raw data of redirect logs and SDS statistics data to serve Asia producers. (Q1, 08’) \n•\tDesigned and developed Asia User Interface (UI) Library, Nexus Design (http://asia.nexus.corp.yahoo.com/) for APAC UED to archive and manage their interaction design patterns. (Q2, 08’)  \n•\tAssisted to introduce and implement Media Suite to HK, TW and KR. Especially for KR, successfully implemented Media Suite Pilot Finance News (April, 08’). \n•\tDesigned and developed the producer desktop plug-in authoring tool for serving Asian producers. \n•\tDesigning and developing Blokus, Asia Page and Site Builder, for filling the gap between media suite and legacy system. \n•\tI18N trailblazer, ACE Architect Software Engineer Yahoo! June 2004  –  January 2007  (2 years 8 months) Asia Central Service Team, Korea Front-end engineering lead (March.06 ~ Dec.07)  \n•\tReshuffled KR Design division’s web developers and then formed the new front-end engineering team \n•\tLed a team of 14 front end engineers \n•\tIntroduced and implemented Rosetta to serve Korea F2E’s template management \n•\tFocused on optimizing the page performance through better code management and code review \n•\tDefined the guideline and best practice for front end development  \n•\tDesigned and developed the APAC front-end prototype center Nexus (http://kr.nexus.corp.yahoo.com/) for sharing the functions or modules with javascript functions. \n•\tDesigned and developed Pharos (http://pharos2.corp.kr1.yahoo.com/index.php?t=list ) for serving front-end engineers to efficiently develop and manage the front-end templates. \nAsia Central Service Team, Korea Front-page & central service engineering Manager (Fed.05 ~ March.07)  \n•\tIntroduced and implemented CMS system Jake to Pilot Project Korea Finance. \n•\tConsolidated all of Korean editorials tools and defined the CMS patterns in KR. \n•\tDesigned and developed Pyramid for serving KR front page and main properties’ editorial tools Assistant Engineer Neowiz October 2003  –  June 2004  (9 months) • Constructed the CRM system through building up the data warehouse on Oracle  \n• Achieved reliability and reduces operating costs using robust database \n• Implemented the statistics using PL/SQL, and C Assistant Engineer Dreamwiz January 2000  –  October 2003  (3 years 10 months) • Developed Blog community service using C and MySQL \n• Developed Message Board \n• Developed the statistics tool based on user's clicks and pageview using C and MySQL Search Principal Software Engineer Yahoo April 2014  – Present (1 year 5 months) sunnyvale Lead Boss API, Boss Portal Search Principal Software Engineer Yahoo April 2014  – Present (1 year 5 months) sunnyvale Lead Boss API, Boss Portal Media Principal Software Engineer Yahoo! January 2012  –  May 2014  (2 years 5 months) United States I am responsible for managing Yahoo!’s Media Publishing Tool within the Yahoo! Media Department in the Sunnyvale, California office. The Media Publishing Department has offices in Denver, Colorado and Bangalore, India, along with the Sunnyvale office. \n \nI am responsible for working with other department leaders within the Media Department, that are located in Sunnyvale, on the development of the Media Publishing Tools. The publishing platform is the central tool used by all Media website publications throughout Yahoo!. The global websites for Yahoo! News, Sports, Finance, Movies, Shine, and Music for example. \n \ntech : Nodejs, swig, express. YUI. Media Principal Software Engineer Yahoo! January 2012  –  May 2014  (2 years 5 months) United States I am responsible for managing Yahoo!’s Media Publishing Tool within the Yahoo! Media Department in the Sunnyvale, California office. The Media Publishing Department has offices in Denver, Colorado and Bangalore, India, along with the Sunnyvale office. \n \nI am responsible for working with other department leaders within the Media Department, that are located in Sunnyvale, on the development of the Media Publishing Tools. The publishing platform is the central tool used by all Media website publications throughout Yahoo!. The global websites for Yahoo! News, Sports, Finance, Movies, Shine, and Music for example. \n \ntech : Nodejs, swig, express. YUI. Sr. Software Engineer Yahoo! December 2008  –  January 2012  (3 years 2 months) I have led a project for publishing system for all media properties in Yahoo! - News, Sports, Finance, Movie, and Etc. Mainly it's for internal users such as engineers, producers and editor to build/manage it. the goal is to build publishing ecosystem including site builder, content programming, and statistics. \n \nI have worked on worldwide engineers and producers - TW, India, Sunnyvale, Santa Monica, .. Sr. Software Engineer Yahoo! December 2008  –  January 2012  (3 years 2 months) I have led a project for publishing system for all media properties in Yahoo! - News, Sports, Finance, Movie, and Etc. Mainly it's for internal users such as engineers, producers and editor to build/manage it. the goal is to build publishing ecosystem including site builder, content programming, and statistics. \n \nI have worked on worldwide engineers and producers - TW, India, Sunnyvale, Santa Monica, .. Platform Engineering Manager Yahoo June 2004  –  November 2008  (4 years 6 months) YAHOO ASIA REGIONAL ENGINEERING TEAM  \n•\tMainly charging of CMS platform development and deployment in APAC. \n•\tFormed the Asia CMS cooperation through closely working with KR, TW and HK locals and increase Media Suite adoption in APAC. \n•\tAssisted to deploy EPT in HK. \n•\tDeployed Pyramid in Japan Y! and implemented to 4 media properties. It will expand to all Y! JP media properties including front page. \n•\tDesigned and developed real-time metrics reporting system Sphinx used for visualizing and reusing the raw data of redirect logs and SDS statistics data to serve Asia producers. (Q1, 08’) \n•\tDesigned and developed Asia User Interface (UI) Library, Nexus Design (http://asia.nexus.corp.yahoo.com/) for APAC UED to archive and manage their interaction design patterns. (Q2, 08’)  \n•\tAssisted to introduce and implement Media Suite to HK, TW and KR. Especially for KR, successfully implemented Media Suite Pilot Finance News (April, 08’). \n•\tDesigned and developed the producer desktop plug-in authoring tool for serving Asian producers. \n•\tDesigning and developing Blokus, Asia Page and Site Builder, for filling the gap between media suite and legacy system. \n•\tI18N trailblazer, ACE Architect Platform Engineering Manager Yahoo June 2004  –  November 2008  (4 years 6 months) YAHOO ASIA REGIONAL ENGINEERING TEAM  \n•\tMainly charging of CMS platform development and deployment in APAC. \n•\tFormed the Asia CMS cooperation through closely working with KR, TW and HK locals and increase Media Suite adoption in APAC. \n•\tAssisted to deploy EPT in HK. \n•\tDeployed Pyramid in Japan Y! and implemented to 4 media properties. It will expand to all Y! JP media properties including front page. \n•\tDesigned and developed real-time metrics reporting system Sphinx used for visualizing and reusing the raw data of redirect logs and SDS statistics data to serve Asia producers. (Q1, 08’) \n•\tDesigned and developed Asia User Interface (UI) Library, Nexus Design (http://asia.nexus.corp.yahoo.com/) for APAC UED to archive and manage their interaction design patterns. (Q2, 08’)  \n•\tAssisted to introduce and implement Media Suite to HK, TW and KR. Especially for KR, successfully implemented Media Suite Pilot Finance News (April, 08’). \n•\tDesigned and developed the producer desktop plug-in authoring tool for serving Asian producers. \n•\tDesigning and developing Blokus, Asia Page and Site Builder, for filling the gap between media suite and legacy system. \n•\tI18N trailblazer, ACE Architect Software Engineer Yahoo! June 2004  –  January 2007  (2 years 8 months) Asia Central Service Team, Korea Front-end engineering lead (March.06 ~ Dec.07)  \n•\tReshuffled KR Design division’s web developers and then formed the new front-end engineering team \n•\tLed a team of 14 front end engineers \n•\tIntroduced and implemented Rosetta to serve Korea F2E’s template management \n•\tFocused on optimizing the page performance through better code management and code review \n•\tDefined the guideline and best practice for front end development  \n•\tDesigned and developed the APAC front-end prototype center Nexus (http://kr.nexus.corp.yahoo.com/) for sharing the functions or modules with javascript functions. \n•\tDesigned and developed Pharos (http://pharos2.corp.kr1.yahoo.com/index.php?t=list ) for serving front-end engineers to efficiently develop and manage the front-end templates. \nAsia Central Service Team, Korea Front-page & central service engineering Manager (Fed.05 ~ March.07)  \n•\tIntroduced and implemented CMS system Jake to Pilot Project Korea Finance. \n•\tConsolidated all of Korean editorials tools and defined the CMS patterns in KR. \n•\tDesigned and developed Pyramid for serving KR front page and main properties’ editorial tools Software Engineer Yahoo! June 2004  –  January 2007  (2 years 8 months) Asia Central Service Team, Korea Front-end engineering lead (March.06 ~ Dec.07)  \n•\tReshuffled KR Design division’s web developers and then formed the new front-end engineering team \n•\tLed a team of 14 front end engineers \n•\tIntroduced and implemented Rosetta to serve Korea F2E’s template management \n•\tFocused on optimizing the page performance through better code management and code review \n•\tDefined the guideline and best practice for front end development  \n•\tDesigned and developed the APAC front-end prototype center Nexus (http://kr.nexus.corp.yahoo.com/) for sharing the functions or modules with javascript functions. \n•\tDesigned and developed Pharos (http://pharos2.corp.kr1.yahoo.com/index.php?t=list ) for serving front-end engineers to efficiently develop and manage the front-end templates. \nAsia Central Service Team, Korea Front-page & central service engineering Manager (Fed.05 ~ March.07)  \n•\tIntroduced and implemented CMS system Jake to Pilot Project Korea Finance. \n•\tConsolidated all of Korean editorials tools and defined the CMS patterns in KR. \n•\tDesigned and developed Pyramid for serving KR front page and main properties’ editorial tools Assistant Engineer Neowiz October 2003  –  June 2004  (9 months) • Constructed the CRM system through building up the data warehouse on Oracle  \n• Achieved reliability and reduces operating costs using robust database \n• Implemented the statistics using PL/SQL, and C Assistant Engineer Neowiz October 2003  –  June 2004  (9 months) • Constructed the CRM system through building up the data warehouse on Oracle  \n• Achieved reliability and reduces operating costs using robust database \n• Implemented the statistics using PL/SQL, and C Assistant Engineer Dreamwiz January 2000  –  October 2003  (3 years 10 months) • Developed Blog community service using C and MySQL \n• Developed Message Board \n• Developed the statistics tool based on user's clicks and pageview using C and MySQL Assistant Engineer Dreamwiz January 2000  –  October 2003  (3 years 10 months) • Developed Blog community service using C and MySQL \n• Developed Message Board \n• Developed the statistics tool based on user's clicks and pageview using C and MySQL Skills Apache nodejs PHP JavaScript MySQL C++ HTML CSS Solution Architecture Agile Methodologies Scrum Design Patterns Oracle REST Databases Node.js See 1+     See less Skills  Apache nodejs PHP JavaScript MySQL C++ HTML CSS Solution Architecture Agile Methodologies Scrum Design Patterns Oracle REST Databases Node.js See 1+     See less Apache nodejs PHP JavaScript MySQL C++ HTML CSS Solution Architecture Agile Methodologies Scrum Design Patterns Oracle REST Databases Node.js See 1+     See less Apache nodejs PHP JavaScript MySQL C++ HTML CSS Solution Architecture Agile Methodologies Scrum Design Patterns Oracle REST Databases Node.js See 1+     See less Education Yonsei University BS Yonsei University BS Yonsei University BS Yonsei University BS Honors & Awards Additional Honors & Awards Yahoo! Odyssey Awards 2007,  \nYahoo! Odyssey Awards 2008 H1 \nYahoo! Odyssey Awards 2008 H2  \nYahoo! You Rocks Award, 2011 \nYahoo! Super Star Award, 2011 Additional Honors & Awards Yahoo! Odyssey Awards 2007,  \nYahoo! Odyssey Awards 2008 H1 \nYahoo! Odyssey Awards 2008 H2  \nYahoo! You Rocks Award, 2011 \nYahoo! Super Star Award, 2011 Additional Honors & Awards Yahoo! Odyssey Awards 2007,  \nYahoo! Odyssey Awards 2008 H1 \nYahoo! Odyssey Awards 2008 H2  \nYahoo! You Rocks Award, 2011 \nYahoo! Super Star Award, 2011 Additional Honors & Awards Yahoo! Odyssey Awards 2007,  \nYahoo! Odyssey Awards 2008 H1 \nYahoo! Odyssey Awards 2008 H2  \nYahoo! You Rocks Award, 2011 \nYahoo! Super Star Award, 2011 ", "Summary EXECUTIVE PROFILE  \n•\tExpertise in system architecture and design in distributed backend system \n•\tAccomplished front-end technologies and knowledge of high performance websites \n•\tExperiences in mobile application development \n•\tBe versatile on multiple technical stacks and flexible to business needs \n•\tStrong problem analysis and solving skills \n•\tFluent oral English and good communication skills \n \nTECHNICAL SKILLS \nLanguages:\tJava; JavaScript; Objective C; C++ \nSystems:\tLinux (Fedora, RHEL, CentOS, Ubuntu); Mac; Windows \nDatabases:\tMS SQL Server; MySQL \nTechnologies/Tools: \nTomcat; JSP/Servlet; Maven; Ant; JMeter; \nHTML5; CSS3; jQuery; YUI; Bootstrap; Bower; AngularJS; \nApache; NodeJS; NPM; Express; \niOS; XCode; Objective C; Cocoa Pod; \nGit; Subversion; Jenkins/Hudson Summary EXECUTIVE PROFILE  \n•\tExpertise in system architecture and design in distributed backend system \n•\tAccomplished front-end technologies and knowledge of high performance websites \n•\tExperiences in mobile application development \n•\tBe versatile on multiple technical stacks and flexible to business needs \n•\tStrong problem analysis and solving skills \n•\tFluent oral English and good communication skills \n \nTECHNICAL SKILLS \nLanguages:\tJava; JavaScript; Objective C; C++ \nSystems:\tLinux (Fedora, RHEL, CentOS, Ubuntu); Mac; Windows \nDatabases:\tMS SQL Server; MySQL \nTechnologies/Tools: \nTomcat; JSP/Servlet; Maven; Ant; JMeter; \nHTML5; CSS3; jQuery; YUI; Bootstrap; Bower; AngularJS; \nApache; NodeJS; NPM; Express; \niOS; XCode; Objective C; Cocoa Pod; \nGit; Subversion; Jenkins/Hudson EXECUTIVE PROFILE  \n•\tExpertise in system architecture and design in distributed backend system \n•\tAccomplished front-end technologies and knowledge of high performance websites \n•\tExperiences in mobile application development \n•\tBe versatile on multiple technical stacks and flexible to business needs \n•\tStrong problem analysis and solving skills \n•\tFluent oral English and good communication skills \n \nTECHNICAL SKILLS \nLanguages:\tJava; JavaScript; Objective C; C++ \nSystems:\tLinux (Fedora, RHEL, CentOS, Ubuntu); Mac; Windows \nDatabases:\tMS SQL Server; MySQL \nTechnologies/Tools: \nTomcat; JSP/Servlet; Maven; Ant; JMeter; \nHTML5; CSS3; jQuery; YUI; Bootstrap; Bower; AngularJS; \nApache; NodeJS; NPM; Express; \niOS; XCode; Objective C; Cocoa Pod; \nGit; Subversion; Jenkins/Hudson EXECUTIVE PROFILE  \n•\tExpertise in system architecture and design in distributed backend system \n•\tAccomplished front-end technologies and knowledge of high performance websites \n•\tExperiences in mobile application development \n•\tBe versatile on multiple technical stacks and flexible to business needs \n•\tStrong problem analysis and solving skills \n•\tFluent oral English and good communication skills \n \nTECHNICAL SKILLS \nLanguages:\tJava; JavaScript; Objective C; C++ \nSystems:\tLinux (Fedora, RHEL, CentOS, Ubuntu); Mac; Windows \nDatabases:\tMS SQL Server; MySQL \nTechnologies/Tools: \nTomcat; JSP/Servlet; Maven; Ant; JMeter; \nHTML5; CSS3; jQuery; YUI; Bootstrap; Bower; AngularJS; \nApache; NodeJS; NPM; Express; \niOS; XCode; Objective C; Cocoa Pod; \nGit; Subversion; Jenkins/Hudson Experience Principal Software Engineer Yahoo October 2013  – Present (1 year 11 months) ONEPUSH/UNP - YAHOO NOTIFICATION PLATFORM \n•\tTook over the UNP (unified notification platform) system which is a sophisticated Java backend platform quickly with a small team. \n•\tReviewed the architecture and implementation of UNP, identified the major pain points and led the team to apply the design fixes. Turned UNP from a troublemaker into a stable and performant situation. \n•\tDrive the architectural discussion of UNP/OnePush migration with architects and customers from HQ. Well defined and executed the migration path and plan for all mobile traffic. \n•\tHands-on coding, code review and design review. Be detail oriented on daily development activities. \n•\tManage 3 scrum teams (UNP, Messaging SDK and Cloud Console) as code contributor, technical leader, scrum master and people manager. Senior Software Engineer Yahoo April 2012  –  October 2013  (1 year 7 months) YAHOO ANSWERS MOBILE \n•\tSetup a new team in a short time and trained the team from barely any front-end experience to the strongest front-end team at Yahoo Beijing R&D center. \n•\tImplemented the foundation framework for the new mobile site for Yahoo Answers from scratch using the cutting edge technologies like NodeJS, HTML5 and CSS3. \n•\tLaunched the new site with modern UI and richer features and meanwhile reduced the page latency by more than 50%. \n•\tCoordinated with backend team, product managers and design team from different locations. Setup the sprint execution and release process agreed by all parties, delivered the results on time and based on priorities. Gained respect from partners even at a competition position. Software Engineer Yahoo! July 2010  –  April 2012  (1 year 10 months) YAHOO MESSENGER (07/2010-08/2012) \n•\tLead the front-end effort of Yahoo Messenger web components based on Apache, PHP and JavaScript. \n•\tLead a front-end team to prototype the next generation Messenger client with hybrid technologies of web and native. \n•\tImplement the first prototype of Messenger client using Qt and WebKit as the container and rendering engine, HTML5 and JavaScript for UI and business logic. \n•\tTransitioned to mobile (iOS and Android) Messenger clients. Quickly ramped up and released a few new versions mainly addressing the stability issues. Senior Software Engineer Thomson Reuters April 2009  –  July 2010  (1 year 4 months) RECOMMENDATION ENGINE OF REUTERS.COM \n•\tLead technical team to deliver recommendation engine releases for reuters.com. Related technologies: Java, Mahout, Voldemort, Berkeley DB and memcached. \n•\tArchitected recommendation engine for major editions of reuters.com. \n•\tPerformed load test, performance analysis and tuning for recommendation engine. \n•\tGained practical knowledge of machine learning algorithms including collaborative filtering and FPGrowth. Software Engineer Thomson Reuters August 2007  –  March 2009  (1 year 8 months) REUTERS RESEARCH & FILEWATCH \n•\tPorted legacy ASP website to ASP.NET, built desktop-like UI using ExtJs framework, and performed enhancements to improve user experience and productivity. \n•\tPorted legacy back-end processes from Perl to .NET, improved system stability and performance. \n•\tCreated an automated build and deployment process based on Apache Ant. Software Engineer Founder Electronics July 2004  –  August 2007  (3 years 2 months) IMES PHOTO MANAGEMENT SYSTEM \n•\tDesigned and implemented a distributed and scalable image processing and data importing service based on Spring, Hibernate and ImageMagick. \n•\tDeveloped web-based asset management system in ASP.NET, JavaScript and XSLT. \n•\tImplemented data importing service using C++ and COM. \n•\tCreated RESTful web services for cross product integration. Principal Software Engineer Yahoo October 2013  – Present (1 year 11 months) ONEPUSH/UNP - YAHOO NOTIFICATION PLATFORM \n•\tTook over the UNP (unified notification platform) system which is a sophisticated Java backend platform quickly with a small team. \n•\tReviewed the architecture and implementation of UNP, identified the major pain points and led the team to apply the design fixes. Turned UNP from a troublemaker into a stable and performant situation. \n•\tDrive the architectural discussion of UNP/OnePush migration with architects and customers from HQ. Well defined and executed the migration path and plan for all mobile traffic. \n•\tHands-on coding, code review and design review. Be detail oriented on daily development activities. \n•\tManage 3 scrum teams (UNP, Messaging SDK and Cloud Console) as code contributor, technical leader, scrum master and people manager. Principal Software Engineer Yahoo October 2013  – Present (1 year 11 months) ONEPUSH/UNP - YAHOO NOTIFICATION PLATFORM \n•\tTook over the UNP (unified notification platform) system which is a sophisticated Java backend platform quickly with a small team. \n•\tReviewed the architecture and implementation of UNP, identified the major pain points and led the team to apply the design fixes. Turned UNP from a troublemaker into a stable and performant situation. \n•\tDrive the architectural discussion of UNP/OnePush migration with architects and customers from HQ. Well defined and executed the migration path and plan for all mobile traffic. \n•\tHands-on coding, code review and design review. Be detail oriented on daily development activities. \n•\tManage 3 scrum teams (UNP, Messaging SDK and Cloud Console) as code contributor, technical leader, scrum master and people manager. Senior Software Engineer Yahoo April 2012  –  October 2013  (1 year 7 months) YAHOO ANSWERS MOBILE \n•\tSetup a new team in a short time and trained the team from barely any front-end experience to the strongest front-end team at Yahoo Beijing R&D center. \n•\tImplemented the foundation framework for the new mobile site for Yahoo Answers from scratch using the cutting edge technologies like NodeJS, HTML5 and CSS3. \n•\tLaunched the new site with modern UI and richer features and meanwhile reduced the page latency by more than 50%. \n•\tCoordinated with backend team, product managers and design team from different locations. Setup the sprint execution and release process agreed by all parties, delivered the results on time and based on priorities. Gained respect from partners even at a competition position. Senior Software Engineer Yahoo April 2012  –  October 2013  (1 year 7 months) YAHOO ANSWERS MOBILE \n•\tSetup a new team in a short time and trained the team from barely any front-end experience to the strongest front-end team at Yahoo Beijing R&D center. \n•\tImplemented the foundation framework for the new mobile site for Yahoo Answers from scratch using the cutting edge technologies like NodeJS, HTML5 and CSS3. \n•\tLaunched the new site with modern UI and richer features and meanwhile reduced the page latency by more than 50%. \n•\tCoordinated with backend team, product managers and design team from different locations. Setup the sprint execution and release process agreed by all parties, delivered the results on time and based on priorities. Gained respect from partners even at a competition position. Software Engineer Yahoo! July 2010  –  April 2012  (1 year 10 months) YAHOO MESSENGER (07/2010-08/2012) \n•\tLead the front-end effort of Yahoo Messenger web components based on Apache, PHP and JavaScript. \n•\tLead a front-end team to prototype the next generation Messenger client with hybrid technologies of web and native. \n•\tImplement the first prototype of Messenger client using Qt and WebKit as the container and rendering engine, HTML5 and JavaScript for UI and business logic. \n•\tTransitioned to mobile (iOS and Android) Messenger clients. Quickly ramped up and released a few new versions mainly addressing the stability issues. Software Engineer Yahoo! July 2010  –  April 2012  (1 year 10 months) YAHOO MESSENGER (07/2010-08/2012) \n•\tLead the front-end effort of Yahoo Messenger web components based on Apache, PHP and JavaScript. \n•\tLead a front-end team to prototype the next generation Messenger client with hybrid technologies of web and native. \n•\tImplement the first prototype of Messenger client using Qt and WebKit as the container and rendering engine, HTML5 and JavaScript for UI and business logic. \n•\tTransitioned to mobile (iOS and Android) Messenger clients. Quickly ramped up and released a few new versions mainly addressing the stability issues. Senior Software Engineer Thomson Reuters April 2009  –  July 2010  (1 year 4 months) RECOMMENDATION ENGINE OF REUTERS.COM \n•\tLead technical team to deliver recommendation engine releases for reuters.com. Related technologies: Java, Mahout, Voldemort, Berkeley DB and memcached. \n•\tArchitected recommendation engine for major editions of reuters.com. \n•\tPerformed load test, performance analysis and tuning for recommendation engine. \n•\tGained practical knowledge of machine learning algorithms including collaborative filtering and FPGrowth. Senior Software Engineer Thomson Reuters April 2009  –  July 2010  (1 year 4 months) RECOMMENDATION ENGINE OF REUTERS.COM \n•\tLead technical team to deliver recommendation engine releases for reuters.com. Related technologies: Java, Mahout, Voldemort, Berkeley DB and memcached. \n•\tArchitected recommendation engine for major editions of reuters.com. \n•\tPerformed load test, performance analysis and tuning for recommendation engine. \n•\tGained practical knowledge of machine learning algorithms including collaborative filtering and FPGrowth. Software Engineer Thomson Reuters August 2007  –  March 2009  (1 year 8 months) REUTERS RESEARCH & FILEWATCH \n•\tPorted legacy ASP website to ASP.NET, built desktop-like UI using ExtJs framework, and performed enhancements to improve user experience and productivity. \n•\tPorted legacy back-end processes from Perl to .NET, improved system stability and performance. \n•\tCreated an automated build and deployment process based on Apache Ant. Software Engineer Thomson Reuters August 2007  –  March 2009  (1 year 8 months) REUTERS RESEARCH & FILEWATCH \n•\tPorted legacy ASP website to ASP.NET, built desktop-like UI using ExtJs framework, and performed enhancements to improve user experience and productivity. \n•\tPorted legacy back-end processes from Perl to .NET, improved system stability and performance. \n•\tCreated an automated build and deployment process based on Apache Ant. Software Engineer Founder Electronics July 2004  –  August 2007  (3 years 2 months) IMES PHOTO MANAGEMENT SYSTEM \n•\tDesigned and implemented a distributed and scalable image processing and data importing service based on Spring, Hibernate and ImageMagick. \n•\tDeveloped web-based asset management system in ASP.NET, JavaScript and XSLT. \n•\tImplemented data importing service using C++ and COM. \n•\tCreated RESTful web services for cross product integration. Software Engineer Founder Electronics July 2004  –  August 2007  (3 years 2 months) IMES PHOTO MANAGEMENT SYSTEM \n•\tDesigned and implemented a distributed and scalable image processing and data importing service based on Spring, Hibernate and ImageMagick. \n•\tDeveloped web-based asset management system in ASP.NET, JavaScript and XSLT. \n•\tImplemented data importing service using C++ and COM. \n•\tCreated RESTful web services for cross product integration. Languages Chinese English Chinese English Chinese English Skills Microsoft SQL Server MySQL Java AJAX SQL JavaScript Perl Hadoop CSS .NET Agile Methodologies Distributed Systems Design Patterns Git Linux Programming REST Mobile Applications Subversion Python Web Development Software Engineering Java Enterprise Edition Object Oriented Design Shell Scripting Web Services Scrum See 12+     See less Skills  Microsoft SQL Server MySQL Java AJAX SQL JavaScript Perl Hadoop CSS .NET Agile Methodologies Distributed Systems Design Patterns Git Linux Programming REST Mobile Applications Subversion Python Web Development Software Engineering Java Enterprise Edition Object Oriented Design Shell Scripting Web Services Scrum See 12+     See less Microsoft SQL Server MySQL Java AJAX SQL JavaScript Perl Hadoop CSS .NET Agile Methodologies Distributed Systems Design Patterns Git Linux Programming REST Mobile Applications Subversion Python Web Development Software Engineering Java Enterprise Edition Object Oriented Design Shell Scripting Web Services Scrum See 12+     See less Microsoft SQL Server MySQL Java AJAX SQL JavaScript Perl Hadoop CSS .NET Agile Methodologies Distributed Systems Design Patterns Git Linux Programming REST Mobile Applications Subversion Python Web Development Software Engineering Java Enterprise Edition Object Oriented Design Shell Scripting Web Services Scrum See 12+     See less Education Tsinghua University Master,  Electronic Engineering 2001  – 2004 Tsinghua University Bachelor,  Electronic Engineering 1997  – 2001 Tsinghua University Master,  Electronic Engineering 2001  – 2004 Tsinghua University Master,  Electronic Engineering 2001  – 2004 Tsinghua University Master,  Electronic Engineering 2001  – 2004 Tsinghua University Bachelor,  Electronic Engineering 1997  – 2001 Tsinghua University Bachelor,  Electronic Engineering 1997  – 2001 Tsinghua University Bachelor,  Electronic Engineering 1997  – 2001 ", "Summary 11 years of work experience in the Software Industry. I have worked on both the the telecom domain as well as the Web world. Have been extensively coding in C,C++,Java and PHP \n \nSpecialties: C, C++, Java, PHP, Computer Networks, Operating Systems, Webservices, iOS, objective-c Summary 11 years of work experience in the Software Industry. I have worked on both the the telecom domain as well as the Web world. Have been extensively coding in C,C++,Java and PHP \n \nSpecialties: C, C++, Java, PHP, Computer Networks, Operating Systems, Webservices, iOS, objective-c 11 years of work experience in the Software Industry. I have worked on both the the telecom domain as well as the Web world. Have been extensively coding in C,C++,Java and PHP \n \nSpecialties: C, C++, Java, PHP, Computer Networks, Operating Systems, Webservices, iOS, objective-c 11 years of work experience in the Software Industry. I have worked on both the the telecom domain as well as the Web world. Have been extensively coding in C,C++,Java and PHP \n \nSpecialties: C, C++, Java, PHP, Computer Networks, Operating Systems, Webservices, iOS, objective-c Experience Principal Software Engineer Yahoo! July 2012  – Present (3 years 2 months) Sunnyvale Backend Lead for various projects.  \nResponsible for designing the Architecture and implementing the features on the projects including \n1. Groups Chat Platform \n2. Weather Backend Ingestion and Serving with Multi-provider support \n3. Daily Fantasy Sports Senior Software Engineer Yahoo! October 2011  –  September 2012  (1 year) Sunnyvale Backend Engineer for IntoNow \n \nAbout the product  \n- IntoNow introduces a true TV companion experience with synchronized news headlines, in-depth sports stats, and tweets from your favorite actors. \n- IntoNow makes engaging with your friends around your favorite television shows easy and fun. Just tap the green button when you’re watching, and IntoNow will identify the show, right down to the episode. Once identified it’s easy to share with your friends on Twitter or Facebook. \n \nMy responsibilities \n- Involved in the redesign of backend infrastructure for high scalability  \n- Designed a framework for write through cache solution. This helps in faster reads from the cache and reduces the load on primary storage \n- Working on the “News Feed Aggregation” for various actions taken by users on the intonow app and how it is propagated to his network of friends for better user engagement. \n- Designed the activity feed(friends, everyone, onair) for the Intonow app. The new design reduced the latency multi-folds with reads happening from cache instead of the primary store \n- Designed and implemented the user notification system for the IntoNow app. The new design uses write-fan logic for cache and primary store as notifications were sent a list of friends involved in a particular activity. \n- Designed and implemented the FriendsList for fetching an user’s friends information from cache and updating the information when a friend is added or deleted. \n- Unit tests and Scenario tests for all backend apis. Software Engineer Yahoo! December 2010  –  October 2011  (11 months) Sunnyvale Y! Universal Header  \n- Designed and implemented the back-end for the \"Persistent header\" component for Universal head.   \n- Designed and implemented the Lego wrapper for the universal header component which helped in pushing the universal header to properties that were using Lego components.  \n- Added new features to  the UCS publishing system which was used for configuring the Universal Header for different properties and vendors.  \n- Successfully onboarded many properties from across the globe to use UH2.0 and provided support to them when they had issues with Universal Header \n \nBubbles Iphone App \nBubbles was a spatial social networking app which was created as an experiment at Yahoo. The user could create bubbles of a certain circumference and invite others to join the bubble. Once inside the bubble , the users could share pictures, have discussions and exchange information. However the users have to be present at the same location and the same time as the bubble to interact with it. Hence if the bubble is created in Sunnyvale for an event from 3pm to 4pm, then a person in San Francisco cannot participate in it. \n \nMy Responsibilities - \n- Designed and developed the Iphone App for \"Bubbles\"  \n- Wrote the framework for Request management used by various screens \n- Wrote the \"Pull to Refresh\" library  \n- Implemented \"Custom Cells\" for various tables based of different needs \n- Implemented the Asynchronous Image loading library to load images in background threads and not holding up the main thread. \n \n- Implemented the Backend API to fetch activities in a Bubble. \n- Designed and Implemented the Auto-creation of \"Bubbles\" based on Events feed Software Engineer Yahoo! October 2009  –  November 2010  (1 year 2 months) Worked on Integration of Facebook, Twitter and Zynga with Yahoo Updates. \nThe project involved designing and implementing the “Updates” and “Notifications” widgets to be used by different Yahoo properties. The “Updates” widget collected activity feeds of the user from different networks including Yahoo, Facebook and Twitter and served them at one place. When the user logged on to Y!mail , he would get all his facebook and twitter feeds in a tab on his mail account. \nThe “Notifications” widget served various types of notifications to the user including “New mail”, messenger notifications and zynga games notifications. \nMy Responsibilities: \n-\tInvolved in the design of the platform architecture to develop the widgets \n-\tTeam Lead for the design and implementation effort of “Notifications” backend team  \n-\tDesigned and developed the updates widget backend apis \n-\tWorked with YQL team in designing the tables for the facebook and twitter news feed retrieval \n-\tDesigned and implemented the “immediate retry” logic and pagination for facebook and twitter feeds \n-\tUnit testing of “Updates” and “Notifications” widget Software Engineer - Intermediate Yahoo! July 2008  –  October 2009  (1 year 4 months) The project involved designing a new FrontPage for Yahoo! which is a customized for every  \nuser and has the ability to add other third party applications \n \nMy Responsibilities: \n-\tInvolved in the design of the platform architecture to develop new modules for the FrontPage \n-\tDesigned and developed the Weather module for the new FrontPage \n-\tDesigned and implemented the Super PA (Personal Assistant) module which is customizable for each user. \n-\tDesigned and implemented the Local Events module for the Personal Assistant \n-\tUnit testing of the Super PA, Local Events and Weather Module Software Engineering Intern NextWave Broadband May 2007  –  July 2008  (1 year 3 months) Designer and Developer for Lower Layer Mac Simulator for WIMAX Subscriber and Base Stations Senior Software Engineer Tata Elxsi September 2004  –  August 2006  (2 years) Software Designer and Developer for SIP Stack (VOIP) which successfully inter-operated with 30 different SIP clients Principal Software Engineer Yahoo! July 2012  – Present (3 years 2 months) Sunnyvale Backend Lead for various projects.  \nResponsible for designing the Architecture and implementing the features on the projects including \n1. Groups Chat Platform \n2. Weather Backend Ingestion and Serving with Multi-provider support \n3. Daily Fantasy Sports Principal Software Engineer Yahoo! July 2012  – Present (3 years 2 months) Sunnyvale Backend Lead for various projects.  \nResponsible for designing the Architecture and implementing the features on the projects including \n1. Groups Chat Platform \n2. Weather Backend Ingestion and Serving with Multi-provider support \n3. Daily Fantasy Sports Senior Software Engineer Yahoo! October 2011  –  September 2012  (1 year) Sunnyvale Backend Engineer for IntoNow \n \nAbout the product  \n- IntoNow introduces a true TV companion experience with synchronized news headlines, in-depth sports stats, and tweets from your favorite actors. \n- IntoNow makes engaging with your friends around your favorite television shows easy and fun. Just tap the green button when you’re watching, and IntoNow will identify the show, right down to the episode. Once identified it’s easy to share with your friends on Twitter or Facebook. \n \nMy responsibilities \n- Involved in the redesign of backend infrastructure for high scalability  \n- Designed a framework for write through cache solution. This helps in faster reads from the cache and reduces the load on primary storage \n- Working on the “News Feed Aggregation” for various actions taken by users on the intonow app and how it is propagated to his network of friends for better user engagement. \n- Designed the activity feed(friends, everyone, onair) for the Intonow app. The new design reduced the latency multi-folds with reads happening from cache instead of the primary store \n- Designed and implemented the user notification system for the IntoNow app. The new design uses write-fan logic for cache and primary store as notifications were sent a list of friends involved in a particular activity. \n- Designed and implemented the FriendsList for fetching an user’s friends information from cache and updating the information when a friend is added or deleted. \n- Unit tests and Scenario tests for all backend apis. Senior Software Engineer Yahoo! October 2011  –  September 2012  (1 year) Sunnyvale Backend Engineer for IntoNow \n \nAbout the product  \n- IntoNow introduces a true TV companion experience with synchronized news headlines, in-depth sports stats, and tweets from your favorite actors. \n- IntoNow makes engaging with your friends around your favorite television shows easy and fun. Just tap the green button when you’re watching, and IntoNow will identify the show, right down to the episode. Once identified it’s easy to share with your friends on Twitter or Facebook. \n \nMy responsibilities \n- Involved in the redesign of backend infrastructure for high scalability  \n- Designed a framework for write through cache solution. This helps in faster reads from the cache and reduces the load on primary storage \n- Working on the “News Feed Aggregation” for various actions taken by users on the intonow app and how it is propagated to his network of friends for better user engagement. \n- Designed the activity feed(friends, everyone, onair) for the Intonow app. The new design reduced the latency multi-folds with reads happening from cache instead of the primary store \n- Designed and implemented the user notification system for the IntoNow app. The new design uses write-fan logic for cache and primary store as notifications were sent a list of friends involved in a particular activity. \n- Designed and implemented the FriendsList for fetching an user’s friends information from cache and updating the information when a friend is added or deleted. \n- Unit tests and Scenario tests for all backend apis. Software Engineer Yahoo! December 2010  –  October 2011  (11 months) Sunnyvale Y! Universal Header  \n- Designed and implemented the back-end for the \"Persistent header\" component for Universal head.   \n- Designed and implemented the Lego wrapper for the universal header component which helped in pushing the universal header to properties that were using Lego components.  \n- Added new features to  the UCS publishing system which was used for configuring the Universal Header for different properties and vendors.  \n- Successfully onboarded many properties from across the globe to use UH2.0 and provided support to them when they had issues with Universal Header \n \nBubbles Iphone App \nBubbles was a spatial social networking app which was created as an experiment at Yahoo. The user could create bubbles of a certain circumference and invite others to join the bubble. Once inside the bubble , the users could share pictures, have discussions and exchange information. However the users have to be present at the same location and the same time as the bubble to interact with it. Hence if the bubble is created in Sunnyvale for an event from 3pm to 4pm, then a person in San Francisco cannot participate in it. \n \nMy Responsibilities - \n- Designed and developed the Iphone App for \"Bubbles\"  \n- Wrote the framework for Request management used by various screens \n- Wrote the \"Pull to Refresh\" library  \n- Implemented \"Custom Cells\" for various tables based of different needs \n- Implemented the Asynchronous Image loading library to load images in background threads and not holding up the main thread. \n \n- Implemented the Backend API to fetch activities in a Bubble. \n- Designed and Implemented the Auto-creation of \"Bubbles\" based on Events feed Software Engineer Yahoo! December 2010  –  October 2011  (11 months) Sunnyvale Y! Universal Header  \n- Designed and implemented the back-end for the \"Persistent header\" component for Universal head.   \n- Designed and implemented the Lego wrapper for the universal header component which helped in pushing the universal header to properties that were using Lego components.  \n- Added new features to  the UCS publishing system which was used for configuring the Universal Header for different properties and vendors.  \n- Successfully onboarded many properties from across the globe to use UH2.0 and provided support to them when they had issues with Universal Header \n \nBubbles Iphone App \nBubbles was a spatial social networking app which was created as an experiment at Yahoo. The user could create bubbles of a certain circumference and invite others to join the bubble. Once inside the bubble , the users could share pictures, have discussions and exchange information. However the users have to be present at the same location and the same time as the bubble to interact with it. Hence if the bubble is created in Sunnyvale for an event from 3pm to 4pm, then a person in San Francisco cannot participate in it. \n \nMy Responsibilities - \n- Designed and developed the Iphone App for \"Bubbles\"  \n- Wrote the framework for Request management used by various screens \n- Wrote the \"Pull to Refresh\" library  \n- Implemented \"Custom Cells\" for various tables based of different needs \n- Implemented the Asynchronous Image loading library to load images in background threads and not holding up the main thread. \n \n- Implemented the Backend API to fetch activities in a Bubble. \n- Designed and Implemented the Auto-creation of \"Bubbles\" based on Events feed Software Engineer Yahoo! October 2009  –  November 2010  (1 year 2 months) Worked on Integration of Facebook, Twitter and Zynga with Yahoo Updates. \nThe project involved designing and implementing the “Updates” and “Notifications” widgets to be used by different Yahoo properties. The “Updates” widget collected activity feeds of the user from different networks including Yahoo, Facebook and Twitter and served them at one place. When the user logged on to Y!mail , he would get all his facebook and twitter feeds in a tab on his mail account. \nThe “Notifications” widget served various types of notifications to the user including “New mail”, messenger notifications and zynga games notifications. \nMy Responsibilities: \n-\tInvolved in the design of the platform architecture to develop the widgets \n-\tTeam Lead for the design and implementation effort of “Notifications” backend team  \n-\tDesigned and developed the updates widget backend apis \n-\tWorked with YQL team in designing the tables for the facebook and twitter news feed retrieval \n-\tDesigned and implemented the “immediate retry” logic and pagination for facebook and twitter feeds \n-\tUnit testing of “Updates” and “Notifications” widget Software Engineer Yahoo! October 2009  –  November 2010  (1 year 2 months) Worked on Integration of Facebook, Twitter and Zynga with Yahoo Updates. \nThe project involved designing and implementing the “Updates” and “Notifications” widgets to be used by different Yahoo properties. The “Updates” widget collected activity feeds of the user from different networks including Yahoo, Facebook and Twitter and served them at one place. When the user logged on to Y!mail , he would get all his facebook and twitter feeds in a tab on his mail account. \nThe “Notifications” widget served various types of notifications to the user including “New mail”, messenger notifications and zynga games notifications. \nMy Responsibilities: \n-\tInvolved in the design of the platform architecture to develop the widgets \n-\tTeam Lead for the design and implementation effort of “Notifications” backend team  \n-\tDesigned and developed the updates widget backend apis \n-\tWorked with YQL team in designing the tables for the facebook and twitter news feed retrieval \n-\tDesigned and implemented the “immediate retry” logic and pagination for facebook and twitter feeds \n-\tUnit testing of “Updates” and “Notifications” widget Software Engineer - Intermediate Yahoo! July 2008  –  October 2009  (1 year 4 months) The project involved designing a new FrontPage for Yahoo! which is a customized for every  \nuser and has the ability to add other third party applications \n \nMy Responsibilities: \n-\tInvolved in the design of the platform architecture to develop new modules for the FrontPage \n-\tDesigned and developed the Weather module for the new FrontPage \n-\tDesigned and implemented the Super PA (Personal Assistant) module which is customizable for each user. \n-\tDesigned and implemented the Local Events module for the Personal Assistant \n-\tUnit testing of the Super PA, Local Events and Weather Module Software Engineer - Intermediate Yahoo! July 2008  –  October 2009  (1 year 4 months) The project involved designing a new FrontPage for Yahoo! which is a customized for every  \nuser and has the ability to add other third party applications \n \nMy Responsibilities: \n-\tInvolved in the design of the platform architecture to develop new modules for the FrontPage \n-\tDesigned and developed the Weather module for the new FrontPage \n-\tDesigned and implemented the Super PA (Personal Assistant) module which is customizable for each user. \n-\tDesigned and implemented the Local Events module for the Personal Assistant \n-\tUnit testing of the Super PA, Local Events and Weather Module Software Engineering Intern NextWave Broadband May 2007  –  July 2008  (1 year 3 months) Designer and Developer for Lower Layer Mac Simulator for WIMAX Subscriber and Base Stations Software Engineering Intern NextWave Broadband May 2007  –  July 2008  (1 year 3 months) Designer and Developer for Lower Layer Mac Simulator for WIMAX Subscriber and Base Stations Senior Software Engineer Tata Elxsi September 2004  –  August 2006  (2 years) Software Designer and Developer for SIP Stack (VOIP) which successfully inter-operated with 30 different SIP clients Senior Software Engineer Tata Elxsi September 2004  –  August 2006  (2 years) Software Designer and Developer for SIP Stack (VOIP) which successfully inter-operated with 30 different SIP clients Languages English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Native or bilingual proficiency Kannada Native or bilingual proficiency Telugu Professional working proficiency English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Native or bilingual proficiency Kannada Native or bilingual proficiency Telugu Professional working proficiency English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Native or bilingual proficiency Kannada Native or bilingual proficiency Telugu Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills PHP C C++ Java Objective-C iPhone development MySQL Redis Memcached Web Services API Apache Web Applications Backend Scalability High Availability Subversion Linux Git JavaScript Distributed Systems REST Software Engineering See 8+     See less Skills  PHP C C++ Java Objective-C iPhone development MySQL Redis Memcached Web Services API Apache Web Applications Backend Scalability High Availability Subversion Linux Git JavaScript Distributed Systems REST Software Engineering See 8+     See less PHP C C++ Java Objective-C iPhone development MySQL Redis Memcached Web Services API Apache Web Applications Backend Scalability High Availability Subversion Linux Git JavaScript Distributed Systems REST Software Engineering See 8+     See less PHP C C++ Java Objective-C iPhone development MySQL Redis Memcached Web Services API Apache Web Applications Backend Scalability High Availability Subversion Linux Git JavaScript Distributed Systems REST Software Engineering See 8+     See less Education San Diego State University-California State University MS,  Computer Science 2006  – 2008 Visvesvaraya Technological University BE,  Information Science 2000  – 2004 San Diego State University-California State University MS,  Computer Science 2006  – 2008 San Diego State University-California State University MS,  Computer Science 2006  – 2008 San Diego State University-California State University MS,  Computer Science 2006  – 2008 Visvesvaraya Technological University BE,  Information Science 2000  – 2004 Visvesvaraya Technological University BE,  Information Science 2000  – 2004 Visvesvaraya Technological University BE,  Information Science 2000  – 2004 Honors & Awards Yahoo Super Star - Intonow team Yahoo! inc September 2012 IntoNow team received the Super Star award for 2012 for delivering an awesome product with high quality in a short time period. Super Star is the highest honor at Yahoo awarded for technical excellence  Hackday Winner Summer 2013 Yahoo! Inc May 2013 Won the Overall Hackday Winner Prize for our iOS auto-uploader feature for Flickr app. Yahoo Super Star - Intonow team Yahoo! inc September 2012 IntoNow team received the Super Star award for 2012 for delivering an awesome product with high quality in a short time period. Super Star is the highest honor at Yahoo awarded for technical excellence  Yahoo Super Star - Intonow team Yahoo! inc September 2012 IntoNow team received the Super Star award for 2012 for delivering an awesome product with high quality in a short time period. Super Star is the highest honor at Yahoo awarded for technical excellence  Yahoo Super Star - Intonow team Yahoo! inc September 2012 IntoNow team received the Super Star award for 2012 for delivering an awesome product with high quality in a short time period. Super Star is the highest honor at Yahoo awarded for technical excellence  Hackday Winner Summer 2013 Yahoo! Inc May 2013 Won the Overall Hackday Winner Prize for our iOS auto-uploader feature for Flickr app. Hackday Winner Summer 2013 Yahoo! Inc May 2013 Won the Overall Hackday Winner Prize for our iOS auto-uploader feature for Flickr app. Hackday Winner Summer 2013 Yahoo! Inc May 2013 Won the Overall Hackday Winner Prize for our iOS auto-uploader feature for Flickr app. ", "Skills Cloud Computing Java System Architecture Mobile Applications iPhone C++ J2EE Hadoop Software Development MySQL Scalability XML Distributed Systems PHP REST Agile SQL Web Services Engineering Management Software Design Objective-C Architecture Scrum Multithreading Software Engineering Linux Windows Perl Agile Methodologies Apache MapReduce Shell Scripting Object Oriented Design See 18+     See less Skills  Cloud Computing Java System Architecture Mobile Applications iPhone C++ J2EE Hadoop Software Development MySQL Scalability XML Distributed Systems PHP REST Agile SQL Web Services Engineering Management Software Design Objective-C Architecture Scrum Multithreading Software Engineering Linux Windows Perl Agile Methodologies Apache MapReduce Shell Scripting Object Oriented Design See 18+     See less Cloud Computing Java System Architecture Mobile Applications iPhone C++ J2EE Hadoop Software Development MySQL Scalability XML Distributed Systems PHP REST Agile SQL Web Services Engineering Management Software Design Objective-C Architecture Scrum Multithreading Software Engineering Linux Windows Perl Agile Methodologies Apache MapReduce Shell Scripting Object Oriented Design See 18+     See less Cloud Computing Java System Architecture Mobile Applications iPhone C++ J2EE Hadoop Software Development MySQL Scalability XML Distributed Systems PHP REST Agile SQL Web Services Engineering Management Software Design Objective-C Architecture Scrum Multithreading Software Engineering Linux Windows Perl Agile Methodologies Apache MapReduce Shell Scripting Object Oriented Design See 18+     See less ", "Experience Senior Android System and Software Engineer Yahoo August 2014  – Present (1 year 1 month) Tech lead and developer for the Yahoo SmartContacts project (currently pre-installed on some Sprint devices). \n \nI'm the technical support and point of contact for the interaction between Yahoo, carriers and OEMs. \n \nI designed and built a device-abstraction layer for the SmartContacts's integration into the OEM devices and carrier services. I provided a reference implementation of this layer based on AOSP as well as a test harness to validate the OEM's implementation. I directly supported the SmartContacts integration with OEM's teams. \n \nToday, I'm 60% dedicated to pure research and prototyping on AOSP (android system), 20% dedicated to a more classic android application development (for example, I've implemented the incoming call screen of SmartContacts), and 20% dedicated to the interactions with the OEMs. \n \n Android Senior Software Engineer Yahoo! August 2013  –  August 2014  (1 year 1 month) Develop components shared across all the android native applications at Yahoo! like the sidebar (navigation drawer), different backend clients, ... \n \nI'm also the main developer of the Yahoo Today tab in the Yahoo mail android application. Senior Software Engineer for Content Platform Group Yahoo! August 2011  –  August 2013  (2 years 1 month) Sunnyvale, CA Conception and development of the next generation of content serving system at Yahoo!.  \nAgile environment (SCRUM), Test Driven Development and Behavior Driven Development. \nShare and improve my knowledges in technologies like Grid, NoSQL and REST WebServices. Senior Software Engineer for Cloud Platform Solutions Yahoo! August 2010  –  August 2011  (1 year 1 month) Build tools and utilities to onboard, monitor and use the Yahoo! Cloud Platform and Grid. \nSupport internal customers in order to use efficiently the grid and the Yahoo! content platform. \nTroubleshoot grid related issues. Senior Software Engineer for Localization Yahoo! November 2007  –  August 2010  (2 years 10 months) Build the backend of the central localization platform for Yahoo! used by all the global Yahoo! properties like mail, frontpage, messenger, ... Java Engineer Thales Services September 2005  –  November 2007  (2 years 3 months) Web EDI Engineer Illicom 2002  –  2005  (3 years) Java Trainee Engineer Exis January 2001  –  September 2001  (9 months) Senior Android System and Software Engineer Yahoo August 2014  – Present (1 year 1 month) Tech lead and developer for the Yahoo SmartContacts project (currently pre-installed on some Sprint devices). \n \nI'm the technical support and point of contact for the interaction between Yahoo, carriers and OEMs. \n \nI designed and built a device-abstraction layer for the SmartContacts's integration into the OEM devices and carrier services. I provided a reference implementation of this layer based on AOSP as well as a test harness to validate the OEM's implementation. I directly supported the SmartContacts integration with OEM's teams. \n \nToday, I'm 60% dedicated to pure research and prototyping on AOSP (android system), 20% dedicated to a more classic android application development (for example, I've implemented the incoming call screen of SmartContacts), and 20% dedicated to the interactions with the OEMs. \n \n Senior Android System and Software Engineer Yahoo August 2014  – Present (1 year 1 month) Tech lead and developer for the Yahoo SmartContacts project (currently pre-installed on some Sprint devices). \n \nI'm the technical support and point of contact for the interaction between Yahoo, carriers and OEMs. \n \nI designed and built a device-abstraction layer for the SmartContacts's integration into the OEM devices and carrier services. I provided a reference implementation of this layer based on AOSP as well as a test harness to validate the OEM's implementation. I directly supported the SmartContacts integration with OEM's teams. \n \nToday, I'm 60% dedicated to pure research and prototyping on AOSP (android system), 20% dedicated to a more classic android application development (for example, I've implemented the incoming call screen of SmartContacts), and 20% dedicated to the interactions with the OEMs. \n \n Android Senior Software Engineer Yahoo! August 2013  –  August 2014  (1 year 1 month) Develop components shared across all the android native applications at Yahoo! like the sidebar (navigation drawer), different backend clients, ... \n \nI'm also the main developer of the Yahoo Today tab in the Yahoo mail android application. Android Senior Software Engineer Yahoo! August 2013  –  August 2014  (1 year 1 month) Develop components shared across all the android native applications at Yahoo! like the sidebar (navigation drawer), different backend clients, ... \n \nI'm also the main developer of the Yahoo Today tab in the Yahoo mail android application. Senior Software Engineer for Content Platform Group Yahoo! August 2011  –  August 2013  (2 years 1 month) Sunnyvale, CA Conception and development of the next generation of content serving system at Yahoo!.  \nAgile environment (SCRUM), Test Driven Development and Behavior Driven Development. \nShare and improve my knowledges in technologies like Grid, NoSQL and REST WebServices. Senior Software Engineer for Content Platform Group Yahoo! August 2011  –  August 2013  (2 years 1 month) Sunnyvale, CA Conception and development of the next generation of content serving system at Yahoo!.  \nAgile environment (SCRUM), Test Driven Development and Behavior Driven Development. \nShare and improve my knowledges in technologies like Grid, NoSQL and REST WebServices. Senior Software Engineer for Cloud Platform Solutions Yahoo! August 2010  –  August 2011  (1 year 1 month) Build tools and utilities to onboard, monitor and use the Yahoo! Cloud Platform and Grid. \nSupport internal customers in order to use efficiently the grid and the Yahoo! content platform. \nTroubleshoot grid related issues. Senior Software Engineer for Cloud Platform Solutions Yahoo! August 2010  –  August 2011  (1 year 1 month) Build tools and utilities to onboard, monitor and use the Yahoo! Cloud Platform and Grid. \nSupport internal customers in order to use efficiently the grid and the Yahoo! content platform. \nTroubleshoot grid related issues. Senior Software Engineer for Localization Yahoo! November 2007  –  August 2010  (2 years 10 months) Build the backend of the central localization platform for Yahoo! used by all the global Yahoo! properties like mail, frontpage, messenger, ... Senior Software Engineer for Localization Yahoo! November 2007  –  August 2010  (2 years 10 months) Build the backend of the central localization platform for Yahoo! used by all the global Yahoo! properties like mail, frontpage, messenger, ... Java Engineer Thales Services September 2005  –  November 2007  (2 years 3 months) Java Engineer Thales Services September 2005  –  November 2007  (2 years 3 months) Web EDI Engineer Illicom 2002  –  2005  (3 years) Web EDI Engineer Illicom 2002  –  2005  (3 years) Java Trainee Engineer Exis January 2001  –  September 2001  (9 months) Java Trainee Engineer Exis January 2001  –  September 2001  (9 months) Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Java REST Web Services Hadoop Agile Web Services TDD Scrum Cloud Computing J2EE Tomcat Apache Software Engineering MySQL C++ Unix Linux Subversion Eclipse Shell Scripting Maven SQL Spring Hibernate JUnit Continuous Integration UML JDBC Bash Hudson See 14+     See less Skills  Java REST Web Services Hadoop Agile Web Services TDD Scrum Cloud Computing J2EE Tomcat Apache Software Engineering MySQL C++ Unix Linux Subversion Eclipse Shell Scripting Maven SQL Spring Hibernate JUnit Continuous Integration UML JDBC Bash Hudson See 14+     See less Java REST Web Services Hadoop Agile Web Services TDD Scrum Cloud Computing J2EE Tomcat Apache Software Engineering MySQL C++ Unix Linux Subversion Eclipse Shell Scripting Maven SQL Spring Hibernate JUnit Continuous Integration UML JDBC Bash Hudson See 14+     See less Java REST Web Services Hadoop Agile Web Services TDD Scrum Cloud Computing J2EE Tomcat Apache Software Engineering MySQL C++ Unix Linux Subversion Eclipse Shell Scripting Maven SQL Spring Hibernate JUnit Continuous Integration UML JDBC Bash Hudson See 14+     See less Education Université de Poitiers Master's degrees 1998  – 2001 Université Claude Bernard Lyon 1 1995  – 1998 Université de Poitiers Master's degrees 1998  – 2001 Université de Poitiers Master's degrees 1998  – 2001 Université de Poitiers Master's degrees 1998  – 2001 Université Claude Bernard Lyon 1 1995  – 1998 Université Claude Bernard Lyon 1 1995  – 1998 Université Claude Bernard Lyon 1 1995  – 1998 "]}