{"position": "Web Operations Engineering Lead", "company": "Google", "profiles": ["Skills Skills     ", "Summary Radha is focused on building talent pipeline, engaging and motivating the teams, Optimizing the allocation of resources, Inculcate the culture of collaboration and innovation on products and services, ensures the stability of products and services at large scale, Transitioning inter teams working model to DevOps model, Automation of engineering operations for resiliency and reliability of large scale systems. \n \nRadha's delivery of work spans across multiple organizations like Ads &Data, Platforms, Media Publishers, Search & Communications. \n \nRadha is passionate in generating new ideas for products and services that certainly add value to the business. He was successful in ideating dozen ideas for Yahoo in the last 2 years.  \n \nRadha has Business/Products Domain proficiency in Ads and Data products and services for digital advertising and marketing. \n \nRadha's technology domain proficiency in building and maintaining of large scale (comprising 1000's of nodes) data processing, storing and reporting systems using distributed computing technologies like Hadoop/Hive/HBase and RDBMS technologies like Oracle, and MySQL. Summary Radha is focused on building talent pipeline, engaging and motivating the teams, Optimizing the allocation of resources, Inculcate the culture of collaboration and innovation on products and services, ensures the stability of products and services at large scale, Transitioning inter teams working model to DevOps model, Automation of engineering operations for resiliency and reliability of large scale systems. \n \nRadha's delivery of work spans across multiple organizations like Ads &Data, Platforms, Media Publishers, Search & Communications. \n \nRadha is passionate in generating new ideas for products and services that certainly add value to the business. He was successful in ideating dozen ideas for Yahoo in the last 2 years.  \n \nRadha has Business/Products Domain proficiency in Ads and Data products and services for digital advertising and marketing. \n \nRadha's technology domain proficiency in building and maintaining of large scale (comprising 1000's of nodes) data processing, storing and reporting systems using distributed computing technologies like Hadoop/Hive/HBase and RDBMS technologies like Oracle, and MySQL. Radha is focused on building talent pipeline, engaging and motivating the teams, Optimizing the allocation of resources, Inculcate the culture of collaboration and innovation on products and services, ensures the stability of products and services at large scale, Transitioning inter teams working model to DevOps model, Automation of engineering operations for resiliency and reliability of large scale systems. \n \nRadha's delivery of work spans across multiple organizations like Ads &Data, Platforms, Media Publishers, Search & Communications. \n \nRadha is passionate in generating new ideas for products and services that certainly add value to the business. He was successful in ideating dozen ideas for Yahoo in the last 2 years.  \n \nRadha has Business/Products Domain proficiency in Ads and Data products and services for digital advertising and marketing. \n \nRadha's technology domain proficiency in building and maintaining of large scale (comprising 1000's of nodes) data processing, storing and reporting systems using distributed computing technologies like Hadoop/Hive/HBase and RDBMS technologies like Oracle, and MySQL. Radha is focused on building talent pipeline, engaging and motivating the teams, Optimizing the allocation of resources, Inculcate the culture of collaboration and innovation on products and services, ensures the stability of products and services at large scale, Transitioning inter teams working model to DevOps model, Automation of engineering operations for resiliency and reliability of large scale systems. \n \nRadha's delivery of work spans across multiple organizations like Ads &Data, Platforms, Media Publishers, Search & Communications. \n \nRadha is passionate in generating new ideas for products and services that certainly add value to the business. He was successful in ideating dozen ideas for Yahoo in the last 2 years.  \n \nRadha has Business/Products Domain proficiency in Ads and Data products and services for digital advertising and marketing. \n \nRadha's technology domain proficiency in building and maintaining of large scale (comprising 1000's of nodes) data processing, storing and reporting systems using distributed computing technologies like Hadoop/Hive/HBase and RDBMS technologies like Oracle, and MySQL. Experience Dir, Ads and Data Production Engg Yahoo October 2014  – Present (11 months) Build and engage teams, new college grads hiring, build tech community at site level, resource allocation and optimization, promote innovation on products and services, nurturing DevOps work culture, automate engineering operations for resiliency and reliability, connect with production engg and operations teams, upkeep and running of databases and audience data systems, plan and execute tech refresh and product roadmap delivery. Sr. Mgr, Ads and Data Production Engg Yahoo! October 2010  –  September 2014  (4 years) Bangaon Area, India database engineering and operations for Ads and Data products including Audience engagement metrics, Advertising systems \"Sponsored Search, Guaranteed Delivery, Native Ads and Ad Exchange\", and other products notably Media, Communications and Big Data Platforms. Mgr, Database engg & operations Yahoo April 2007  –  September 2010  (3 years 6 months) Bengaluru Area, India Plan and execute database engineering related tasks, upkeep and running of databases for Yahoo Search Marketing and Display advertising systems. Sr. Tech Lead, Yahoo Search Marketing Yahoo January 2006  –  March 2007  (1 year 3 months) Bengaluru Area, India Prioritize, plan and execute database engineering and operations related projects for Yahoo Search Marketing Roadmap Tech Lead, Yahoo Direct email platform Yahoo December 2003  –  January 2006  (2 years 2 months) Bengaluru Area, India Upkeep and running of databases for data analytics group, Design, develop and implement products roadmap tasks for direct email platform (run campaigns to promote Yahoo Search, Communication, and Media products) Sr. Lead Technical FirstApex Software Technologies Pvt. Ltd July 2000  –  December 2003  (3 years 6 months) Design, develop and test enterprise software for insurance industry and guide software engineers with technical and functional knowledge to make them understand and enable them to build software packages. Systems Analyst Insyst Technologies (MEA) LTD (now 3i Infotech) January 1999  –  July 2000  (1 year 7 months) Design, Develop and Implement Management information systems for mid size enterprises using a MIS product called Orion. Dir, Ads and Data Production Engg Yahoo October 2014  – Present (11 months) Build and engage teams, new college grads hiring, build tech community at site level, resource allocation and optimization, promote innovation on products and services, nurturing DevOps work culture, automate engineering operations for resiliency and reliability, connect with production engg and operations teams, upkeep and running of databases and audience data systems, plan and execute tech refresh and product roadmap delivery. Dir, Ads and Data Production Engg Yahoo October 2014  – Present (11 months) Build and engage teams, new college grads hiring, build tech community at site level, resource allocation and optimization, promote innovation on products and services, nurturing DevOps work culture, automate engineering operations for resiliency and reliability, connect with production engg and operations teams, upkeep and running of databases and audience data systems, plan and execute tech refresh and product roadmap delivery. Sr. Mgr, Ads and Data Production Engg Yahoo! October 2010  –  September 2014  (4 years) Bangaon Area, India database engineering and operations for Ads and Data products including Audience engagement metrics, Advertising systems \"Sponsored Search, Guaranteed Delivery, Native Ads and Ad Exchange\", and other products notably Media, Communications and Big Data Platforms. Sr. Mgr, Ads and Data Production Engg Yahoo! October 2010  –  September 2014  (4 years) Bangaon Area, India database engineering and operations for Ads and Data products including Audience engagement metrics, Advertising systems \"Sponsored Search, Guaranteed Delivery, Native Ads and Ad Exchange\", and other products notably Media, Communications and Big Data Platforms. Mgr, Database engg & operations Yahoo April 2007  –  September 2010  (3 years 6 months) Bengaluru Area, India Plan and execute database engineering related tasks, upkeep and running of databases for Yahoo Search Marketing and Display advertising systems. Mgr, Database engg & operations Yahoo April 2007  –  September 2010  (3 years 6 months) Bengaluru Area, India Plan and execute database engineering related tasks, upkeep and running of databases for Yahoo Search Marketing and Display advertising systems. Sr. Tech Lead, Yahoo Search Marketing Yahoo January 2006  –  March 2007  (1 year 3 months) Bengaluru Area, India Prioritize, plan and execute database engineering and operations related projects for Yahoo Search Marketing Roadmap Sr. Tech Lead, Yahoo Search Marketing Yahoo January 2006  –  March 2007  (1 year 3 months) Bengaluru Area, India Prioritize, plan and execute database engineering and operations related projects for Yahoo Search Marketing Roadmap Tech Lead, Yahoo Direct email platform Yahoo December 2003  –  January 2006  (2 years 2 months) Bengaluru Area, India Upkeep and running of databases for data analytics group, Design, develop and implement products roadmap tasks for direct email platform (run campaigns to promote Yahoo Search, Communication, and Media products) Tech Lead, Yahoo Direct email platform Yahoo December 2003  –  January 2006  (2 years 2 months) Bengaluru Area, India Upkeep and running of databases for data analytics group, Design, develop and implement products roadmap tasks for direct email platform (run campaigns to promote Yahoo Search, Communication, and Media products) Sr. Lead Technical FirstApex Software Technologies Pvt. Ltd July 2000  –  December 2003  (3 years 6 months) Design, develop and test enterprise software for insurance industry and guide software engineers with technical and functional knowledge to make them understand and enable them to build software packages. Sr. Lead Technical FirstApex Software Technologies Pvt. Ltd July 2000  –  December 2003  (3 years 6 months) Design, develop and test enterprise software for insurance industry and guide software engineers with technical and functional knowledge to make them understand and enable them to build software packages. Systems Analyst Insyst Technologies (MEA) LTD (now 3i Infotech) January 1999  –  July 2000  (1 year 7 months) Design, Develop and Implement Management information systems for mid size enterprises using a MIS product called Orion. Systems Analyst Insyst Technologies (MEA) LTD (now 3i Infotech) January 1999  –  July 2000  (1 year 7 months) Design, Develop and Implement Management information systems for mid size enterprises using a MIS product called Orion. Languages English English English Skills Distributed Systems Big Data Perl Hadoop Scalability Agile Methodologies Data Warehousing Shell Scripting Unix MapReduce Oracle Cloud Computing Linux SQL Performance Tuning MySQL ETL NoSQL Software Development Apache Open Source Databases High Availability Solaris PL/SQL Java Enterprise Software SDLC See 13+     See less Skills  Distributed Systems Big Data Perl Hadoop Scalability Agile Methodologies Data Warehousing Shell Scripting Unix MapReduce Oracle Cloud Computing Linux SQL Performance Tuning MySQL ETL NoSQL Software Development Apache Open Source Databases High Availability Solaris PL/SQL Java Enterprise Software SDLC See 13+     See less Distributed Systems Big Data Perl Hadoop Scalability Agile Methodologies Data Warehousing Shell Scripting Unix MapReduce Oracle Cloud Computing Linux SQL Performance Tuning MySQL ETL NoSQL Software Development Apache Open Source Databases High Availability Solaris PL/SQL Java Enterprise Software SDLC See 13+     See less Distributed Systems Big Data Perl Hadoop Scalability Agile Methodologies Data Warehousing Shell Scripting Unix MapReduce Oracle Cloud Computing Linux SQL Performance Tuning MySQL ETL NoSQL Software Development Apache Open Source Databases High Availability Solaris PL/SQL Java Enterprise Software SDLC See 13+     See less Education Indian Institute of Management, Bangalore Executive General Management Programme,  Business Administration and Management , General 2013  – 2014 Birla Institute of Technology and Science, Pilani MS,  Software Engineering 2010  – 2012 Manonmaniam Sundaranar University M.C.A,  Computer Science 1995  – 1998 Madurai Kamaraj University B.Sc,  Computer Science 1991  – 1994 Indian Institute of Management, Bangalore Executive General Management Programme,  Business Administration and Management , General 2013  – 2014 Indian Institute of Management, Bangalore Executive General Management Programme,  Business Administration and Management , General 2013  – 2014 Indian Institute of Management, Bangalore Executive General Management Programme,  Business Administration and Management , General 2013  – 2014 Birla Institute of Technology and Science, Pilani MS,  Software Engineering 2010  – 2012 Birla Institute of Technology and Science, Pilani MS,  Software Engineering 2010  – 2012 Birla Institute of Technology and Science, Pilani MS,  Software Engineering 2010  – 2012 Manonmaniam Sundaranar University M.C.A,  Computer Science 1995  – 1998 Manonmaniam Sundaranar University M.C.A,  Computer Science 1995  – 1998 Manonmaniam Sundaranar University M.C.A,  Computer Science 1995  – 1998 Madurai Kamaraj University B.Sc,  Computer Science 1991  – 1994 Madurai Kamaraj University B.Sc,  Computer Science 1991  – 1994 Madurai Kamaraj University B.Sc,  Computer Science 1991  – 1994 Honors & Awards Golden Eagle Award Arvind Tiwary, CEO, FirstApex December 2000 Radha had always been going an extra mile in providing best customer experience and support during the implementation of OPUS (OPen underwriting system) insurance product for one of the major Life/General insurance company in Germany. Radha was chosen by IT head of that insurance company to implement the same software package for its regional offices in APAC. Y2K Specialist Pramod Gangadharan, Product Manager, Insyst Technologies January 2000 Radha was instrumental in understanding and resolving Y2K issues for the top 5 customers in Middle East within the span of 5 months. Radha developed and automated a Y2K tool to find and fix date format issues for 100's of Oracle forms 3.0 / reports 3.0 /Pro*C and Oracle 7 Pl/SQL code. The work done by Radha was phenomenal without his automation tool, the customers would have experienced Y2K issues and could not have attained Y2K compliance prior to Jan 2000.  Yahoo Ratna CEO, Yahoo SDC India Pvt Ltd October 2006 Radha played a critical role in managing the paid search database engineering and operations from Bangalore site, along with his counter part team in US location. Radha closely engaged with BIG Ops team helping them in optimizing the data loading and reporting process which ensured no SLA miss and improved the performance of ETL and Reporting performance by 2X to 3X . Radha Played a pivotal role in setting up the Database environment for Paid search systems, went beyond the call of duty to accommodate the shortage of staff to get things done.  \n \nThrough His Dedication, commitment and relentless focus, he set an outstanding example for Operational excellence. \n Golden Eagle Award Arvind Tiwary, CEO, FirstApex December 2000 Radha had always been going an extra mile in providing best customer experience and support during the implementation of OPUS (OPen underwriting system) insurance product for one of the major Life/General insurance company in Germany. Radha was chosen by IT head of that insurance company to implement the same software package for its regional offices in APAC. Golden Eagle Award Arvind Tiwary, CEO, FirstApex December 2000 Radha had always been going an extra mile in providing best customer experience and support during the implementation of OPUS (OPen underwriting system) insurance product for one of the major Life/General insurance company in Germany. Radha was chosen by IT head of that insurance company to implement the same software package for its regional offices in APAC. Golden Eagle Award Arvind Tiwary, CEO, FirstApex December 2000 Radha had always been going an extra mile in providing best customer experience and support during the implementation of OPUS (OPen underwriting system) insurance product for one of the major Life/General insurance company in Germany. Radha was chosen by IT head of that insurance company to implement the same software package for its regional offices in APAC. Y2K Specialist Pramod Gangadharan, Product Manager, Insyst Technologies January 2000 Radha was instrumental in understanding and resolving Y2K issues for the top 5 customers in Middle East within the span of 5 months. Radha developed and automated a Y2K tool to find and fix date format issues for 100's of Oracle forms 3.0 / reports 3.0 /Pro*C and Oracle 7 Pl/SQL code. The work done by Radha was phenomenal without his automation tool, the customers would have experienced Y2K issues and could not have attained Y2K compliance prior to Jan 2000.  Y2K Specialist Pramod Gangadharan, Product Manager, Insyst Technologies January 2000 Radha was instrumental in understanding and resolving Y2K issues for the top 5 customers in Middle East within the span of 5 months. Radha developed and automated a Y2K tool to find and fix date format issues for 100's of Oracle forms 3.0 / reports 3.0 /Pro*C and Oracle 7 Pl/SQL code. The work done by Radha was phenomenal without his automation tool, the customers would have experienced Y2K issues and could not have attained Y2K compliance prior to Jan 2000.  Y2K Specialist Pramod Gangadharan, Product Manager, Insyst Technologies January 2000 Radha was instrumental in understanding and resolving Y2K issues for the top 5 customers in Middle East within the span of 5 months. Radha developed and automated a Y2K tool to find and fix date format issues for 100's of Oracle forms 3.0 / reports 3.0 /Pro*C and Oracle 7 Pl/SQL code. The work done by Radha was phenomenal without his automation tool, the customers would have experienced Y2K issues and could not have attained Y2K compliance prior to Jan 2000.  Yahoo Ratna CEO, Yahoo SDC India Pvt Ltd October 2006 Radha played a critical role in managing the paid search database engineering and operations from Bangalore site, along with his counter part team in US location. Radha closely engaged with BIG Ops team helping them in optimizing the data loading and reporting process which ensured no SLA miss and improved the performance of ETL and Reporting performance by 2X to 3X . Radha Played a pivotal role in setting up the Database environment for Paid search systems, went beyond the call of duty to accommodate the shortage of staff to get things done.  \n \nThrough His Dedication, commitment and relentless focus, he set an outstanding example for Operational excellence. \n Yahoo Ratna CEO, Yahoo SDC India Pvt Ltd October 2006 Radha played a critical role in managing the paid search database engineering and operations from Bangalore site, along with his counter part team in US location. Radha closely engaged with BIG Ops team helping them in optimizing the data loading and reporting process which ensured no SLA miss and improved the performance of ETL and Reporting performance by 2X to 3X . Radha Played a pivotal role in setting up the Database environment for Paid search systems, went beyond the call of duty to accommodate the shortage of staff to get things done.  \n \nThrough His Dedication, commitment and relentless focus, he set an outstanding example for Operational excellence. \n Yahoo Ratna CEO, Yahoo SDC India Pvt Ltd October 2006 Radha played a critical role in managing the paid search database engineering and operations from Bangalore site, along with his counter part team in US location. Radha closely engaged with BIG Ops team helping them in optimizing the data loading and reporting process which ensured no SLA miss and improved the performance of ETL and Reporting performance by 2X to 3X . Radha Played a pivotal role in setting up the Database environment for Paid search systems, went beyond the call of duty to accommodate the shortage of staff to get things done.  \n \nThrough His Dedication, commitment and relentless focus, he set an outstanding example for Operational excellence. \n ", "Summary Systems Engineer and Administrator in the LargeScale IT Infrastructure domain. Proficient in the area of Virtualization, Hadoop Clusters, Linux Systems Engineering & Administration, Server & Network monitoring & management in huge complex environments. \n \nAm well versed with Lean Management techniques and DevOps approach.  \n \nEnergetic and goal-oriented professional with a well-sounded background in supporting a progressive organization performance and growth.  \nAm zealous and have a passion to improve continuously. Am an articulate communicator who can fluently speak the languages of both people and technology, exceptional interpersonal skills while interacting effectively with the team.  Summary Systems Engineer and Administrator in the LargeScale IT Infrastructure domain. Proficient in the area of Virtualization, Hadoop Clusters, Linux Systems Engineering & Administration, Server & Network monitoring & management in huge complex environments. \n \nAm well versed with Lean Management techniques and DevOps approach.  \n \nEnergetic and goal-oriented professional with a well-sounded background in supporting a progressive organization performance and growth.  \nAm zealous and have a passion to improve continuously. Am an articulate communicator who can fluently speak the languages of both people and technology, exceptional interpersonal skills while interacting effectively with the team.  Systems Engineer and Administrator in the LargeScale IT Infrastructure domain. Proficient in the area of Virtualization, Hadoop Clusters, Linux Systems Engineering & Administration, Server & Network monitoring & management in huge complex environments. \n \nAm well versed with Lean Management techniques and DevOps approach.  \n \nEnergetic and goal-oriented professional with a well-sounded background in supporting a progressive organization performance and growth.  \nAm zealous and have a passion to improve continuously. Am an articulate communicator who can fluently speak the languages of both people and technology, exceptional interpersonal skills while interacting effectively with the team.  Systems Engineer and Administrator in the LargeScale IT Infrastructure domain. Proficient in the area of Virtualization, Hadoop Clusters, Linux Systems Engineering & Administration, Server & Network monitoring & management in huge complex environments. \n \nAm well versed with Lean Management techniques and DevOps approach.  \n \nEnergetic and goal-oriented professional with a well-sounded background in supporting a progressive organization performance and growth.  \nAm zealous and have a passion to improve continuously. Am an articulate communicator who can fluently speak the languages of both people and technology, exceptional interpersonal skills while interacting effectively with the team.  Experience Senior Production Engineer Yahoo April 2015  – Present (5 months) Bengaluru Area, India Member of Grid Service Engineering & Operations team that maintains Yahoo's Grid Infrastructure running on Apache Hadoop. \n \nI take care of Data Movement/Replication between Hadoop grids i.e. (acquiring,replication and deletion of data onto grids from various Data Warehouses) and Data lifecycle management.  \nI manage Apache HCatalog, Hive, HiveServer2 related tasks at Yahoo.  \nI am responsible for Core Grid/Hadoop Operations (Hadoop) using methods like Continuous Delivery and Continuous Deployment. Technical Lead Yahoo! September 2011  –  March 2015  (3 years 7 months) Member of Grid Service Engineering & Operations team that maintains Yahoo's Grid Infrastructure running on Apache Hadoop. \n \nI take care of Data Movement/Replication between Hadoop grids i.e. (acquiring,replication and deletion of data onto grids from various Data Warehouses) and Data lifecycle management.  \nI manage Apache HCatalog, Hive, HiveServer2 related tasks at Yahoo.  \nI am responsible for Core Grid/Hadoop Operations (Hadoop) using methods like Continuous Delivery and Continuous Deployment. Engineer Analyst JPMorgan Chase July 2010  –  September 2011  (1 year 3 months) Hyderabad Area, India Global Technology Infrastructure - Core Infrastructure Services: \n \nI built, configured and validated VMware vSphere, VMware ESX, VMware vCenter, RedHat Enterprise Linux servers on various H/W platforms like Dell,HP. \n \nI designed validation checklists which were later scripted and automated for the Cisco UCS NextGen Datacenter Gear. \n \nResponsible for a smooth error-free server delivery into Production . \n \nI was part of design, development, implementation and integration of our in-house linux-based CGI/Perl Automation tool that validates the build and pushes the hosts into Production with very less manual intervention. \n \nWinner of GTI CIS Spot Bonus Award in 2011. Consultant - IT Operations Playdom August 2009  –  July 2010  (1 year) Built & Deployed Distributed Monitoring & Managing services for Playdom's gaming infrastructure.  \nBuilt and organized NetEnrich's NOC team responsible for 24x7 for Service Delivery and operations of Playdom's gaming infrastructure compromising of Linux servers running Apache, Tomcat, MySQL and Network Hardware Load balancers. Sr. Engineer NetEnrich June 2006  –  July 2010  (4 years 2 months) In charge of building network operations centers for infrastructure management services of various clients. \n \nResponsible for infrastructure designing, implementation, monitoring, management & operations of VMware, Linux and Windows based customer environments. \n \nDesigned and Built VMware ESXi Hypervisor based Monitoring Appliances \n \nDesigned, Implemented & Integrated various tools and technologies required for NetEnrich Service delivery. ITS Consultant Trend Micro January 2008  –  December 2009  (2 years) Built & Deployed Distributed Monitoring & Managing services for Trend Micro ITS SAAS Services across different locations across the globe. \n \nResponsible for IT Service Delivery and operations of TrendMicro ITS IT Infrastructure which consisted Redhat Linux, Microsoft Windows, Mail and Database Servers. \n \nBuilt and Organized the NetEnrich NOC team for TrendMicro ITS Services Consultant Savvis March 2007  –  March 2008  (1 year 1 month) Built & Deployed distributed monitoring that monitored the status and health of 400+ websites, web and application servers hosted by Savvis from different network locations and network points Senior Production Engineer Yahoo April 2015  – Present (5 months) Bengaluru Area, India Member of Grid Service Engineering & Operations team that maintains Yahoo's Grid Infrastructure running on Apache Hadoop. \n \nI take care of Data Movement/Replication between Hadoop grids i.e. (acquiring,replication and deletion of data onto grids from various Data Warehouses) and Data lifecycle management.  \nI manage Apache HCatalog, Hive, HiveServer2 related tasks at Yahoo.  \nI am responsible for Core Grid/Hadoop Operations (Hadoop) using methods like Continuous Delivery and Continuous Deployment. Senior Production Engineer Yahoo April 2015  – Present (5 months) Bengaluru Area, India Member of Grid Service Engineering & Operations team that maintains Yahoo's Grid Infrastructure running on Apache Hadoop. \n \nI take care of Data Movement/Replication between Hadoop grids i.e. (acquiring,replication and deletion of data onto grids from various Data Warehouses) and Data lifecycle management.  \nI manage Apache HCatalog, Hive, HiveServer2 related tasks at Yahoo.  \nI am responsible for Core Grid/Hadoop Operations (Hadoop) using methods like Continuous Delivery and Continuous Deployment. Technical Lead Yahoo! September 2011  –  March 2015  (3 years 7 months) Member of Grid Service Engineering & Operations team that maintains Yahoo's Grid Infrastructure running on Apache Hadoop. \n \nI take care of Data Movement/Replication between Hadoop grids i.e. (acquiring,replication and deletion of data onto grids from various Data Warehouses) and Data lifecycle management.  \nI manage Apache HCatalog, Hive, HiveServer2 related tasks at Yahoo.  \nI am responsible for Core Grid/Hadoop Operations (Hadoop) using methods like Continuous Delivery and Continuous Deployment. Technical Lead Yahoo! September 2011  –  March 2015  (3 years 7 months) Member of Grid Service Engineering & Operations team that maintains Yahoo's Grid Infrastructure running on Apache Hadoop. \n \nI take care of Data Movement/Replication between Hadoop grids i.e. (acquiring,replication and deletion of data onto grids from various Data Warehouses) and Data lifecycle management.  \nI manage Apache HCatalog, Hive, HiveServer2 related tasks at Yahoo.  \nI am responsible for Core Grid/Hadoop Operations (Hadoop) using methods like Continuous Delivery and Continuous Deployment. Engineer Analyst JPMorgan Chase July 2010  –  September 2011  (1 year 3 months) Hyderabad Area, India Global Technology Infrastructure - Core Infrastructure Services: \n \nI built, configured and validated VMware vSphere, VMware ESX, VMware vCenter, RedHat Enterprise Linux servers on various H/W platforms like Dell,HP. \n \nI designed validation checklists which were later scripted and automated for the Cisco UCS NextGen Datacenter Gear. \n \nResponsible for a smooth error-free server delivery into Production . \n \nI was part of design, development, implementation and integration of our in-house linux-based CGI/Perl Automation tool that validates the build and pushes the hosts into Production with very less manual intervention. \n \nWinner of GTI CIS Spot Bonus Award in 2011. Engineer Analyst JPMorgan Chase July 2010  –  September 2011  (1 year 3 months) Hyderabad Area, India Global Technology Infrastructure - Core Infrastructure Services: \n \nI built, configured and validated VMware vSphere, VMware ESX, VMware vCenter, RedHat Enterprise Linux servers on various H/W platforms like Dell,HP. \n \nI designed validation checklists which were later scripted and automated for the Cisco UCS NextGen Datacenter Gear. \n \nResponsible for a smooth error-free server delivery into Production . \n \nI was part of design, development, implementation and integration of our in-house linux-based CGI/Perl Automation tool that validates the build and pushes the hosts into Production with very less manual intervention. \n \nWinner of GTI CIS Spot Bonus Award in 2011. Consultant - IT Operations Playdom August 2009  –  July 2010  (1 year) Built & Deployed Distributed Monitoring & Managing services for Playdom's gaming infrastructure.  \nBuilt and organized NetEnrich's NOC team responsible for 24x7 for Service Delivery and operations of Playdom's gaming infrastructure compromising of Linux servers running Apache, Tomcat, MySQL and Network Hardware Load balancers. Consultant - IT Operations Playdom August 2009  –  July 2010  (1 year) Built & Deployed Distributed Monitoring & Managing services for Playdom's gaming infrastructure.  \nBuilt and organized NetEnrich's NOC team responsible for 24x7 for Service Delivery and operations of Playdom's gaming infrastructure compromising of Linux servers running Apache, Tomcat, MySQL and Network Hardware Load balancers. Sr. Engineer NetEnrich June 2006  –  July 2010  (4 years 2 months) In charge of building network operations centers for infrastructure management services of various clients. \n \nResponsible for infrastructure designing, implementation, monitoring, management & operations of VMware, Linux and Windows based customer environments. \n \nDesigned and Built VMware ESXi Hypervisor based Monitoring Appliances \n \nDesigned, Implemented & Integrated various tools and technologies required for NetEnrich Service delivery. Sr. Engineer NetEnrich June 2006  –  July 2010  (4 years 2 months) In charge of building network operations centers for infrastructure management services of various clients. \n \nResponsible for infrastructure designing, implementation, monitoring, management & operations of VMware, Linux and Windows based customer environments. \n \nDesigned and Built VMware ESXi Hypervisor based Monitoring Appliances \n \nDesigned, Implemented & Integrated various tools and technologies required for NetEnrich Service delivery. ITS Consultant Trend Micro January 2008  –  December 2009  (2 years) Built & Deployed Distributed Monitoring & Managing services for Trend Micro ITS SAAS Services across different locations across the globe. \n \nResponsible for IT Service Delivery and operations of TrendMicro ITS IT Infrastructure which consisted Redhat Linux, Microsoft Windows, Mail and Database Servers. \n \nBuilt and Organized the NetEnrich NOC team for TrendMicro ITS Services ITS Consultant Trend Micro January 2008  –  December 2009  (2 years) Built & Deployed Distributed Monitoring & Managing services for Trend Micro ITS SAAS Services across different locations across the globe. \n \nResponsible for IT Service Delivery and operations of TrendMicro ITS IT Infrastructure which consisted Redhat Linux, Microsoft Windows, Mail and Database Servers. \n \nBuilt and Organized the NetEnrich NOC team for TrendMicro ITS Services Consultant Savvis March 2007  –  March 2008  (1 year 1 month) Built & Deployed distributed monitoring that monitored the status and health of 400+ websites, web and application servers hosted by Savvis from different network locations and network points Consultant Savvis March 2007  –  March 2008  (1 year 1 month) Built & Deployed distributed monitoring that monitored the status and health of 400+ websites, web and application servers hosted by Savvis from different network locations and network points Skills Virtualization Red Hat Linux Linux Nagios Apache Data Center VMware ESX VMware Remote Infrastructure... VMware Infrastructure Servers Shell Scripting IT Operations RHEL Infrastructure Open Source Web Infrastructure Hadoop Hadoop Administration Hadoop Cluster... HBase HBase Administration Data Management Grid Computing Continuous Improvement Continuous Delivery DevOps Business Strategy Business Administration Project Management Product Management Project Planning Lean Management Kanban Kaizen See 20+     See less Skills  Virtualization Red Hat Linux Linux Nagios Apache Data Center VMware ESX VMware Remote Infrastructure... VMware Infrastructure Servers Shell Scripting IT Operations RHEL Infrastructure Open Source Web Infrastructure Hadoop Hadoop Administration Hadoop Cluster... HBase HBase Administration Data Management Grid Computing Continuous Improvement Continuous Delivery DevOps Business Strategy Business Administration Project Management Product Management Project Planning Lean Management Kanban Kaizen See 20+     See less Virtualization Red Hat Linux Linux Nagios Apache Data Center VMware ESX VMware Remote Infrastructure... VMware Infrastructure Servers Shell Scripting IT Operations RHEL Infrastructure Open Source Web Infrastructure Hadoop Hadoop Administration Hadoop Cluster... HBase HBase Administration Data Management Grid Computing Continuous Improvement Continuous Delivery DevOps Business Strategy Business Administration Project Management Product Management Project Planning Lean Management Kanban Kaizen See 20+     See less Virtualization Red Hat Linux Linux Nagios Apache Data Center VMware ESX VMware Remote Infrastructure... VMware Infrastructure Servers Shell Scripting IT Operations RHEL Infrastructure Open Source Web Infrastructure Hadoop Hadoop Administration Hadoop Cluster... HBase HBase Administration Data Management Grid Computing Continuous Improvement Continuous Delivery DevOps Business Strategy Business Administration Project Management Product Management Project Planning Lean Management Kanban Kaizen See 20+     See less Education Symbiosis Institute of Business Management Master of Business Administration (M.B.A.),  Operations Management and Supervision 2012  – 2015 Activities and Societies:  MBA (EE) Andhra University B.Tech,  Computer Sciences 2002  – 2006 SRKR Engineering College B.Tech,  Computer Science 2002  – 2006 J Sikile School Secondary School 1990  – 2000 Symbiosis Institute of Business Management Master of Business Administration (M.B.A.),  Operations Management and Supervision 2012  – 2015 Activities and Societies:  MBA (EE) Symbiosis Institute of Business Management Master of Business Administration (M.B.A.),  Operations Management and Supervision 2012  – 2015 Activities and Societies:  MBA (EE) Symbiosis Institute of Business Management Master of Business Administration (M.B.A.),  Operations Management and Supervision 2012  – 2015 Activities and Societies:  MBA (EE) Andhra University B.Tech,  Computer Sciences 2002  – 2006 Andhra University B.Tech,  Computer Sciences 2002  – 2006 Andhra University B.Tech,  Computer Sciences 2002  – 2006 SRKR Engineering College B.Tech,  Computer Science 2002  – 2006 SRKR Engineering College B.Tech,  Computer Science 2002  – 2006 SRKR Engineering College B.Tech,  Computer Science 2002  – 2006 J Sikile School Secondary School 1990  – 2000 J Sikile School Secondary School 1990  – 2000 J Sikile School Secondary School 1990  – 2000 ", "Summary Senior Information Technology expert with 20 years experience in the design, delivery, and operations of business critical, diversified platforms supporting rapid, dynamic business growth. Extensive experience delivering enterprise class software and infrastructure solutions in all phases of the project, application delivery, and operations life cycles including mobile and cloud based solutions.  \n \nExperience in implementing and managing global delivery and managed service models.Effective at building and managing high performing, geographically diversified, cost effective teams. Self-motivated, energetic, and customer oriented with strong leadership, and communication skills. \n \nAble to demonstrated ability to define effective strategy and drive tactical and technical operations. Clearly communicate the organization's mission and motivate team to achieve results that are on-time, on-scope and on-budget. Lead across boundaries delivering results with accountability in matrix organizations, Proactively plan and forecast CAPEX, Cap Labor, budget and resource allocation.  \n \nExperience in running global technical operations with high transaction websites and transforming company from on-premise to Cloud and adapting DevOps. \n \nSpecialties \n \nCloud Architectures - SaaS, IaaS, PaaS, DBaas,iPaaS \nMoving applications from on-premise to SaaS \nAdapting Devops Culture \nPlatform Engineering  \nBuilding Hybrid Cloud \nInfrastructure and Virtualization \nLXC -Docker \nProduction Operations and Service Engineering  \nEnterprise Architecture Strategy \nERP and Databases \nBig Data  \nHigh Traffic websites  \nBusiness Continuity Plan (BCP) & Disaster Recovery  \nAgile -Scrum, Kanban \nProject-Program Management  \nVendor Management and Evaluations \nPeople Management and Team-Building \nBuilding IT Roadmaps, IT budgets and Cost control \nRisk Assessment and mitigation Summary Senior Information Technology expert with 20 years experience in the design, delivery, and operations of business critical, diversified platforms supporting rapid, dynamic business growth. Extensive experience delivering enterprise class software and infrastructure solutions in all phases of the project, application delivery, and operations life cycles including mobile and cloud based solutions.  \n \nExperience in implementing and managing global delivery and managed service models.Effective at building and managing high performing, geographically diversified, cost effective teams. Self-motivated, energetic, and customer oriented with strong leadership, and communication skills. \n \nAble to demonstrated ability to define effective strategy and drive tactical and technical operations. Clearly communicate the organization's mission and motivate team to achieve results that are on-time, on-scope and on-budget. Lead across boundaries delivering results with accountability in matrix organizations, Proactively plan and forecast CAPEX, Cap Labor, budget and resource allocation.  \n \nExperience in running global technical operations with high transaction websites and transforming company from on-premise to Cloud and adapting DevOps. \n \nSpecialties \n \nCloud Architectures - SaaS, IaaS, PaaS, DBaas,iPaaS \nMoving applications from on-premise to SaaS \nAdapting Devops Culture \nPlatform Engineering  \nBuilding Hybrid Cloud \nInfrastructure and Virtualization \nLXC -Docker \nProduction Operations and Service Engineering  \nEnterprise Architecture Strategy \nERP and Databases \nBig Data  \nHigh Traffic websites  \nBusiness Continuity Plan (BCP) & Disaster Recovery  \nAgile -Scrum, Kanban \nProject-Program Management  \nVendor Management and Evaluations \nPeople Management and Team-Building \nBuilding IT Roadmaps, IT budgets and Cost control \nRisk Assessment and mitigation Senior Information Technology expert with 20 years experience in the design, delivery, and operations of business critical, diversified platforms supporting rapid, dynamic business growth. Extensive experience delivering enterprise class software and infrastructure solutions in all phases of the project, application delivery, and operations life cycles including mobile and cloud based solutions.  \n \nExperience in implementing and managing global delivery and managed service models.Effective at building and managing high performing, geographically diversified, cost effective teams. Self-motivated, energetic, and customer oriented with strong leadership, and communication skills. \n \nAble to demonstrated ability to define effective strategy and drive tactical and technical operations. Clearly communicate the organization's mission and motivate team to achieve results that are on-time, on-scope and on-budget. Lead across boundaries delivering results with accountability in matrix organizations, Proactively plan and forecast CAPEX, Cap Labor, budget and resource allocation.  \n \nExperience in running global technical operations with high transaction websites and transforming company from on-premise to Cloud and adapting DevOps. \n \nSpecialties \n \nCloud Architectures - SaaS, IaaS, PaaS, DBaas,iPaaS \nMoving applications from on-premise to SaaS \nAdapting Devops Culture \nPlatform Engineering  \nBuilding Hybrid Cloud \nInfrastructure and Virtualization \nLXC -Docker \nProduction Operations and Service Engineering  \nEnterprise Architecture Strategy \nERP and Databases \nBig Data  \nHigh Traffic websites  \nBusiness Continuity Plan (BCP) & Disaster Recovery  \nAgile -Scrum, Kanban \nProject-Program Management  \nVendor Management and Evaluations \nPeople Management and Team-Building \nBuilding IT Roadmaps, IT budgets and Cost control \nRisk Assessment and mitigation Senior Information Technology expert with 20 years experience in the design, delivery, and operations of business critical, diversified platforms supporting rapid, dynamic business growth. Extensive experience delivering enterprise class software and infrastructure solutions in all phases of the project, application delivery, and operations life cycles including mobile and cloud based solutions.  \n \nExperience in implementing and managing global delivery and managed service models.Effective at building and managing high performing, geographically diversified, cost effective teams. Self-motivated, energetic, and customer oriented with strong leadership, and communication skills. \n \nAble to demonstrated ability to define effective strategy and drive tactical and technical operations. Clearly communicate the organization's mission and motivate team to achieve results that are on-time, on-scope and on-budget. Lead across boundaries delivering results with accountability in matrix organizations, Proactively plan and forecast CAPEX, Cap Labor, budget and resource allocation.  \n \nExperience in running global technical operations with high transaction websites and transforming company from on-premise to Cloud and adapting DevOps. \n \nSpecialties \n \nCloud Architectures - SaaS, IaaS, PaaS, DBaas,iPaaS \nMoving applications from on-premise to SaaS \nAdapting Devops Culture \nPlatform Engineering  \nBuilding Hybrid Cloud \nInfrastructure and Virtualization \nLXC -Docker \nProduction Operations and Service Engineering  \nEnterprise Architecture Strategy \nERP and Databases \nBig Data  \nHigh Traffic websites  \nBusiness Continuity Plan (BCP) & Disaster Recovery  \nAgile -Scrum, Kanban \nProject-Program Management  \nVendor Management and Evaluations \nPeople Management and Team-Building \nBuilding IT Roadmaps, IT budgets and Cost control \nRisk Assessment and mitigation Experience Director IT - Platform Engineering and Operations Yahoo October 2014  – Present (11 months) Leading Platform Engineering and IT Applications operations team. \n \nAs part of the Platform Engineering leadership team, helping the company's transformation to cloud. Transitioning from an on-premise traditional IT system architecture to a cloud-based distributed hybrid architecture. \n \nEnabling accelerated application delivery by adapting Devops culture, investing in Continuous Integration/Delivery, Automation,Scalable and Stateless Applications, Platform based development \n \nBuilding standard framework for provisioning and configuring cloud-based infrastructure components including PaaS in hybrid cloud, iPass and DBaaS \n \nLeading IT corporate operations team responsible for doing operational, service engineering support and incident response/management. Sr Manager Corporate Platforms Yahoo Inc April 2011  –  October 2014  (3 years 7 months) Lead IT corporate operations and Platform Engg team responsible for doing operational and service engineering support for 130+ vendor (third party) and custom applications. \n \nImplementing Continuous Integration and Continuous Deployment using Aria,Jenkins,chef etc \n \nResponsible for virtualization (vmware and openstack), standardizing hardware platform, and technology stack across all enterprise and custom applications, Also consolidation of applications into 2 data centers. \n \nLed an initiative to consolidate and standardize support process and platform builds improving availability, getting rid of tech debt for all applications including third party applications, custom applications, external and internal corporate sites. Also drive upgrade strategy and build roadmap with various vendors and partners.  \n \nBuild and maintain applications that are secure, scalable and always available. Sr. Manager Corporate Applications Yahoo 2008  –  2011  (3 years) Sr Manager Corporate Applications - 2008-2011 \n \nLead the team comprising of Database and Application Administrators , Architects responsible for Infrastructure, Architecture, Operations, DBA management, Application Management and Security of all corporate applications \n \nResponsible for supporting applications including  \nOracle Applications, Hyperion, Digital Assest Management, Kronos, MyTime, Equity Edge, Pattsy, Plataue/LMS, Mariner, Cardinus, Confirmit, Version One, Adobe Connect, Legal Tracking, Opentext, ADP Payroll, Assurenet/Reconnet, Oversight, Chemsoft, SaaS, SalesComp and many more Principal Yahoo Yahoo 2006  –  2008  (2 years) Technical / Practice Manager Oracle November 2000  –  April 2006  (5 years 6 months) Oracle Development - 2004-2006 \nPrincipal Architect - Development services  \nSupported the 8,000 user E-Business Suite Division's tools, production environments & infrastructure - hundreds of E-Business suite environments, Databases up to 8 Terabyte, 2000 Linux/Unix/Solaris/HP servers & over 1.5 Petabyte diskspace. \n \n \nOracle Consulting - 2000-2005 \nTechnical Manager / Practice Manager - Responsible for Project Management, Technical Architect , DBA manager, Apps DBA at various clients like \n \nFidelity Investments \nTetra Tech \nHoudini \nCardinal Health \nBon Appetite \nCisco Systems \nAgilent Technology \nBellsouth \nGAP \nNetwork Appliances \nSony \nStanford University \nSun Microsystems \nHoneywell \nBizzard \nIron Mountain \nSilicon Valley group \nMotorola IT Consultant GDI Infotech 1999  –  2000  (1 year) Client – General Motors  \nWorked as a lead Oracle DBA for General Motors, Detroit Information Warehouse project. Was responsible for designing, implementation, Maintenance of 3 terabyte of Information warehouse and related OLAP tools. Senior Database Administrator VIP Industries Limited April 1996  –  May 1999  (3 years 2 months) Oracle DBA for VIP Industries. Architect for systems like Attendance and Payroll System, MRP System, Indirect Item System, Profitability and Excise System. Also worked as Production DBA. Director IT - Platform Engineering and Operations Yahoo October 2014  – Present (11 months) Leading Platform Engineering and IT Applications operations team. \n \nAs part of the Platform Engineering leadership team, helping the company's transformation to cloud. Transitioning from an on-premise traditional IT system architecture to a cloud-based distributed hybrid architecture. \n \nEnabling accelerated application delivery by adapting Devops culture, investing in Continuous Integration/Delivery, Automation,Scalable and Stateless Applications, Platform based development \n \nBuilding standard framework for provisioning and configuring cloud-based infrastructure components including PaaS in hybrid cloud, iPass and DBaaS \n \nLeading IT corporate operations team responsible for doing operational, service engineering support and incident response/management. Director IT - Platform Engineering and Operations Yahoo October 2014  – Present (11 months) Leading Platform Engineering and IT Applications operations team. \n \nAs part of the Platform Engineering leadership team, helping the company's transformation to cloud. Transitioning from an on-premise traditional IT system architecture to a cloud-based distributed hybrid architecture. \n \nEnabling accelerated application delivery by adapting Devops culture, investing in Continuous Integration/Delivery, Automation,Scalable and Stateless Applications, Platform based development \n \nBuilding standard framework for provisioning and configuring cloud-based infrastructure components including PaaS in hybrid cloud, iPass and DBaaS \n \nLeading IT corporate operations team responsible for doing operational, service engineering support and incident response/management. Sr Manager Corporate Platforms Yahoo Inc April 2011  –  October 2014  (3 years 7 months) Lead IT corporate operations and Platform Engg team responsible for doing operational and service engineering support for 130+ vendor (third party) and custom applications. \n \nImplementing Continuous Integration and Continuous Deployment using Aria,Jenkins,chef etc \n \nResponsible for virtualization (vmware and openstack), standardizing hardware platform, and technology stack across all enterprise and custom applications, Also consolidation of applications into 2 data centers. \n \nLed an initiative to consolidate and standardize support process and platform builds improving availability, getting rid of tech debt for all applications including third party applications, custom applications, external and internal corporate sites. Also drive upgrade strategy and build roadmap with various vendors and partners.  \n \nBuild and maintain applications that are secure, scalable and always available. Sr Manager Corporate Platforms Yahoo Inc April 2011  –  October 2014  (3 years 7 months) Lead IT corporate operations and Platform Engg team responsible for doing operational and service engineering support for 130+ vendor (third party) and custom applications. \n \nImplementing Continuous Integration and Continuous Deployment using Aria,Jenkins,chef etc \n \nResponsible for virtualization (vmware and openstack), standardizing hardware platform, and technology stack across all enterprise and custom applications, Also consolidation of applications into 2 data centers. \n \nLed an initiative to consolidate and standardize support process and platform builds improving availability, getting rid of tech debt for all applications including third party applications, custom applications, external and internal corporate sites. Also drive upgrade strategy and build roadmap with various vendors and partners.  \n \nBuild and maintain applications that are secure, scalable and always available. Sr. Manager Corporate Applications Yahoo 2008  –  2011  (3 years) Sr Manager Corporate Applications - 2008-2011 \n \nLead the team comprising of Database and Application Administrators , Architects responsible for Infrastructure, Architecture, Operations, DBA management, Application Management and Security of all corporate applications \n \nResponsible for supporting applications including  \nOracle Applications, Hyperion, Digital Assest Management, Kronos, MyTime, Equity Edge, Pattsy, Plataue/LMS, Mariner, Cardinus, Confirmit, Version One, Adobe Connect, Legal Tracking, Opentext, ADP Payroll, Assurenet/Reconnet, Oversight, Chemsoft, SaaS, SalesComp and many more Sr. Manager Corporate Applications Yahoo 2008  –  2011  (3 years) Sr Manager Corporate Applications - 2008-2011 \n \nLead the team comprising of Database and Application Administrators , Architects responsible for Infrastructure, Architecture, Operations, DBA management, Application Management and Security of all corporate applications \n \nResponsible for supporting applications including  \nOracle Applications, Hyperion, Digital Assest Management, Kronos, MyTime, Equity Edge, Pattsy, Plataue/LMS, Mariner, Cardinus, Confirmit, Version One, Adobe Connect, Legal Tracking, Opentext, ADP Payroll, Assurenet/Reconnet, Oversight, Chemsoft, SaaS, SalesComp and many more Principal Yahoo Yahoo 2006  –  2008  (2 years) Principal Yahoo Yahoo 2006  –  2008  (2 years) Technical / Practice Manager Oracle November 2000  –  April 2006  (5 years 6 months) Oracle Development - 2004-2006 \nPrincipal Architect - Development services  \nSupported the 8,000 user E-Business Suite Division's tools, production environments & infrastructure - hundreds of E-Business suite environments, Databases up to 8 Terabyte, 2000 Linux/Unix/Solaris/HP servers & over 1.5 Petabyte diskspace. \n \n \nOracle Consulting - 2000-2005 \nTechnical Manager / Practice Manager - Responsible for Project Management, Technical Architect , DBA manager, Apps DBA at various clients like \n \nFidelity Investments \nTetra Tech \nHoudini \nCardinal Health \nBon Appetite \nCisco Systems \nAgilent Technology \nBellsouth \nGAP \nNetwork Appliances \nSony \nStanford University \nSun Microsystems \nHoneywell \nBizzard \nIron Mountain \nSilicon Valley group \nMotorola Technical / Practice Manager Oracle November 2000  –  April 2006  (5 years 6 months) Oracle Development - 2004-2006 \nPrincipal Architect - Development services  \nSupported the 8,000 user E-Business Suite Division's tools, production environments & infrastructure - hundreds of E-Business suite environments, Databases up to 8 Terabyte, 2000 Linux/Unix/Solaris/HP servers & over 1.5 Petabyte diskspace. \n \n \nOracle Consulting - 2000-2005 \nTechnical Manager / Practice Manager - Responsible for Project Management, Technical Architect , DBA manager, Apps DBA at various clients like \n \nFidelity Investments \nTetra Tech \nHoudini \nCardinal Health \nBon Appetite \nCisco Systems \nAgilent Technology \nBellsouth \nGAP \nNetwork Appliances \nSony \nStanford University \nSun Microsystems \nHoneywell \nBizzard \nIron Mountain \nSilicon Valley group \nMotorola IT Consultant GDI Infotech 1999  –  2000  (1 year) Client – General Motors  \nWorked as a lead Oracle DBA for General Motors, Detroit Information Warehouse project. Was responsible for designing, implementation, Maintenance of 3 terabyte of Information warehouse and related OLAP tools. IT Consultant GDI Infotech 1999  –  2000  (1 year) Client – General Motors  \nWorked as a lead Oracle DBA for General Motors, Detroit Information Warehouse project. Was responsible for designing, implementation, Maintenance of 3 terabyte of Information warehouse and related OLAP tools. Senior Database Administrator VIP Industries Limited April 1996  –  May 1999  (3 years 2 months) Oracle DBA for VIP Industries. Architect for systems like Attendance and Payroll System, MRP System, Indirect Item System, Profitability and Excise System. Also worked as Production DBA. Senior Database Administrator VIP Industries Limited April 1996  –  May 1999  (3 years 2 months) Oracle DBA for VIP Industries. Architect for systems like Attendance and Payroll System, MRP System, Indirect Item System, Profitability and Excise System. Also worked as Production DBA. Languages English Hindi Marathi English Hindi Marathi English Hindi Marathi Skills Solution Architecture SaaS Databases IT Operations Cloud Computing Software Project... Performance Tuning Enterprise Architecture Business Intelligence IT Strategy Architecture Oracle E-Business Suite SDLC Project Management ERP Oracle Software Development Microsoft SQL Server Siebel ITIL Certified Process Improvement Large Scale Systems Architectures PMP Project Planning Business Continuity Operations Management Executive Programs Hyperion Enterprise Operational Planning Program Executions Roadmap SOX Compliancy Docker ipaas PaaS IaaS Hybrid Cloud Cloud Applications Agile Methodologies DevOps Scrum Kanban Production Operations Service Engineering People Management Virtualization Infrastructure High Availability High Performance Teams Big Data See 35+     See less Skills  Solution Architecture SaaS Databases IT Operations Cloud Computing Software Project... Performance Tuning Enterprise Architecture Business Intelligence IT Strategy Architecture Oracle E-Business Suite SDLC Project Management ERP Oracle Software Development Microsoft SQL Server Siebel ITIL Certified Process Improvement Large Scale Systems Architectures PMP Project Planning Business Continuity Operations Management Executive Programs Hyperion Enterprise Operational Planning Program Executions Roadmap SOX Compliancy Docker ipaas PaaS IaaS Hybrid Cloud Cloud Applications Agile Methodologies DevOps Scrum Kanban Production Operations Service Engineering People Management Virtualization Infrastructure High Availability High Performance Teams Big Data See 35+     See less Solution Architecture SaaS Databases IT Operations Cloud Computing Software Project... Performance Tuning Enterprise Architecture Business Intelligence IT Strategy Architecture Oracle E-Business Suite SDLC Project Management ERP Oracle Software Development Microsoft SQL Server Siebel ITIL Certified Process Improvement Large Scale Systems Architectures PMP Project Planning Business Continuity Operations Management Executive Programs Hyperion Enterprise Operational Planning Program Executions Roadmap SOX Compliancy Docker ipaas PaaS IaaS Hybrid Cloud Cloud Applications Agile Methodologies DevOps Scrum Kanban Production Operations Service Engineering People Management Virtualization Infrastructure High Availability High Performance Teams Big Data See 35+     See less Solution Architecture SaaS Databases IT Operations Cloud Computing Software Project... Performance Tuning Enterprise Architecture Business Intelligence IT Strategy Architecture Oracle E-Business Suite SDLC Project Management ERP Oracle Software Development Microsoft SQL Server Siebel ITIL Certified Process Improvement Large Scale Systems Architectures PMP Project Planning Business Continuity Operations Management Executive Programs Hyperion Enterprise Operational Planning Program Executions Roadmap SOX Compliancy Docker ipaas PaaS IaaS Hybrid Cloud Cloud Applications Agile Methodologies DevOps Scrum Kanban Production Operations Service Engineering People Management Virtualization Infrastructure High Availability High Performance Teams Big Data See 35+     See less Education University of Pune B.E,  Computer Engineering 1992  – 1996 University of Pune B.E,  Computer Engineering 1992  – 1996 University of Pune B.E,  Computer Engineering 1992  – 1996 University of Pune B.E,  Computer Engineering 1992  – 1996 ", "Summary • Seasoned and culturally aware executive with over 20 years proven technical leadership, global management, talent development and rapid execution skills. \n \n• Passionate about building highly effective organizations with exceptionally engaged employees. Proven history of strategic transformations by adopting cutting-edge industry best practices, driving cultural change & automation, attracting/developing key talent and optimizing process inefficiencies. \n \n• Results-driven track record of concurrently launching and managing some of the highest profile global platforms – for example Yahoo Gemini advertising system with over $1B annual revenue run-rate. \n \n• 24/7 responsibility for tens of thousands of servers serving 100s of millions of customers across dozens of Internet, Mobile and Revenue services. \n \n• Driven significant improvements in speed-to-market, performance, service quality and opex/capex optimization – DevOps, CI/CD, Cloud, Disaster Recovery/BCP, ITIL, Automation, Instrumentation, Monitoring, KPIs, etc… \n \n• Full breadth of technology industry experience from small startups through multi-national enterprises. Summary • Seasoned and culturally aware executive with over 20 years proven technical leadership, global management, talent development and rapid execution skills. \n \n• Passionate about building highly effective organizations with exceptionally engaged employees. Proven history of strategic transformations by adopting cutting-edge industry best practices, driving cultural change & automation, attracting/developing key talent and optimizing process inefficiencies. \n \n• Results-driven track record of concurrently launching and managing some of the highest profile global platforms – for example Yahoo Gemini advertising system with over $1B annual revenue run-rate. \n \n• 24/7 responsibility for tens of thousands of servers serving 100s of millions of customers across dozens of Internet, Mobile and Revenue services. \n \n• Driven significant improvements in speed-to-market, performance, service quality and opex/capex optimization – DevOps, CI/CD, Cloud, Disaster Recovery/BCP, ITIL, Automation, Instrumentation, Monitoring, KPIs, etc… \n \n• Full breadth of technology industry experience from small startups through multi-national enterprises. • Seasoned and culturally aware executive with over 20 years proven technical leadership, global management, talent development and rapid execution skills. \n \n• Passionate about building highly effective organizations with exceptionally engaged employees. Proven history of strategic transformations by adopting cutting-edge industry best practices, driving cultural change & automation, attracting/developing key talent and optimizing process inefficiencies. \n \n• Results-driven track record of concurrently launching and managing some of the highest profile global platforms – for example Yahoo Gemini advertising system with over $1B annual revenue run-rate. \n \n• 24/7 responsibility for tens of thousands of servers serving 100s of millions of customers across dozens of Internet, Mobile and Revenue services. \n \n• Driven significant improvements in speed-to-market, performance, service quality and opex/capex optimization – DevOps, CI/CD, Cloud, Disaster Recovery/BCP, ITIL, Automation, Instrumentation, Monitoring, KPIs, etc… \n \n• Full breadth of technology industry experience from small startups through multi-national enterprises. • Seasoned and culturally aware executive with over 20 years proven technical leadership, global management, talent development and rapid execution skills. \n \n• Passionate about building highly effective organizations with exceptionally engaged employees. Proven history of strategic transformations by adopting cutting-edge industry best practices, driving cultural change & automation, attracting/developing key talent and optimizing process inefficiencies. \n \n• Results-driven track record of concurrently launching and managing some of the highest profile global platforms – for example Yahoo Gemini advertising system with over $1B annual revenue run-rate. \n \n• 24/7 responsibility for tens of thousands of servers serving 100s of millions of customers across dozens of Internet, Mobile and Revenue services. \n \n• Driven significant improvements in speed-to-market, performance, service quality and opex/capex optimization – DevOps, CI/CD, Cloud, Disaster Recovery/BCP, ITIL, Automation, Instrumentation, Monitoring, KPIs, etc… \n \n• Full breadth of technology industry experience from small startups through multi-national enterprises. Experience Senior Director, Service Engineering Yahoo! April 2010  – Present (5 years 5 months) London, UK & Sunnyvale, California • Grew and directly managed global organization of 65 DevOps/Production Engineers and first/second/third line managers spread across eight countries. \n• From scratch, built up, managed and tore down teams in Silicon Valley, London, Hamburg, Trondheim, Tel Aviv, Bangalore, Singapore and Beijing. \n• Developed and executed multi-national/global location strategies aligned to long term business objectives. \n• Participated in global M&A reviews and due diligence. \n• Instituted scalable and efficient processes for incident, release, capacity, SLA, etc... management. \n• Optimized alerting, monitoring and response/resolution systems for TTD/TTS improvements and cost efficiency. \n• Managed multi-million dollar annual capex and opex budgets. \n• Rolled out agile and CI/CD automation programs. \n• Managed a variety of Yahoo's core services including Gemini (Native and Search Advertising Revenue platform), all Mobile services (including Mobile Homepage, Mobile Search, Mobile Mail, etc...), various Mobile apps, Personalization & Ad Targeting platforms, Cloud hosting, Registration/Login and Vertical Search systems. \n• Executed numerous new service deployments and launches to grow business successfully. \n• Drove wide-ranging cultural change, moving organizations from reactive/operational activities to proactive and efficient DevOps mindset and methodologies. \n• Mentored individuals, managers/directors and teams into \"top talent\" award winning levels. Director, Service Engineering Yahoo! January 2005  –  March 2010  (5 years 3 months) London, UK & Sunnyvale, California Head of Operations Digital Rum May 2002  –  January 2005  (2 years 9 months) London, United Kingdom • Led teams responsible for all internal and external production technical and IT infrastructure. \n• Set up a monitoring service, outsourced telephone helpdesk and internal second-line call-out system to provide 24/7 support to all customer facing services. \n• Investigated, designed and implemented numerous improvements to dramatically increase service availability and performance (SLAs). These covered areas such as hot standby, use of Ultra Monkey / LVS load-balancers, etc… \n• Migrated of web and application services from costly, commercial software (eg. Weblogic, Solaris, etc…) to high performance, stable, open source solutions (eg. JBoss, Linux, etc…). \n• Implemented IP multi-pathing and redundant disk arrays for maximum resiliency of the Solaris Oracle servers. \n• Performed M&A due diligence and integrated organisation/services/infrastructure of acquired company (Scan). \n• Deployed, tested and managed numerous mobile services for Vodafone, O2, Orange, T-Mobile, Argos, British Airways, Virgin Atlantic, France Telecom, etc… Head of IT Xtempus January 2001  –  May 2002  (1 year 5 months) London, United Kingdom • Was in charge of all internal, external and security services at a startup mobile services company. \n• Rolled out, managed and helped develop bespoke mobile services for customers such as Vodafone, Orange and News International. \n• Setup X.25 to TCP/IP translation on Cisco routers to connect to Vodafone’s SMSC. \n• Radically overhauled security setup and processes. \n• Implemented multi site IPSec VPNs using Cisco routers, Cisco PIX firewalls, FreeS/WAN Linux servers and, for roaming users, Windows 2000. \n• Virtualised and load balanced many existing services to improve reliability and save on costs. \n• Built and maintained a large number of internal Java/JSP and Oracle development servers. Operations Manager Talkcast Corporation Plc January 2000  –  January 2001  (1 year 1 month) London, United Kingdom • Was in charge of all internal, external and security services at a startup internet media company. \n• Hired and supervised a team of Unix/NT Systems Administrators, Oracle DBAs and internal Helpdesk staff. \n• From scratch, designed, specified, implemented and managed all web, wap, mail, dns, streaming, e-commerce and sms services and also the underlying network infrastructure. \n• Utilised various techniques (including load balancing, automatic monitoring and failover, etc…) to provide resilient services. \n• Set up multiple dedicated TCP/IP and X.25 leased lines. \n• Established and maintained company wide security policy (including firewalls, secure financial transactions, email virus scanning and dealing with sensitive customer data). \n• Successfully passed two third-party security audits of our network (including an external test attack performed by PWC). \n• Liased with third parties to supply hardware, software, telecoms, human and other resources. Systems Administration Manager Thus PLC (was Demon Internet Ltd) September 1999  –  January 2000  (5 months) London, United Kingdom • Technical management role responsible for a large team of Unix/NT Systems and Security administrators. \n• Looked after enterprise-class customer facing systems and network. \n• Designed, project managed and rolled out new services. \n• Dealt with issues of capacity planning, security and technology development. \n• Provided regular weekly KPI/metric reports on service performance and availability. \n• Carried out selection interviews for the employment of new team members. \n• Team building and development. Team Leader of Backend Services Demon Internet February 1998  –  August 1999  (1 year 7 months) London, United Kingdom • Was responsible for maintaining all of the services provided by the Backend Services team at the highest level of availability (these included security, authentication, dial-up routing, authoritative and caching DNS, fax to email / email to fax and backups). \n• Forward planned service upgrades based on system reports, monitoring tools and other information. \n• Implemented resilient solutions for customer facing services. \n• Was crucially involved in the rapid design and setup of the “in2home.co.uk”, “currantbun.com” and “beeb.net” virtual ISPs. \n• Tested hardware and software for Year 2000 compliance; Recruited and trained new staff. Senior Systems Administrator Demon Internet February 1996  –  January 1998  (2 years) London, United Kingdom • Designed, built, configured and maintained a variety of customer facing, critical, Unix based services. \n• Developed and setup tools to monitor system performance and planned subsequent kernel and system performance tuning. \n• Liased with potential suppliers and subsequently evaluated hardware/software writing assessment reports. \n• Provided twenty-four hour pager cover in the event of unexpected system failures. \n• Documented services and maintenance procedures. Support Engineer Demon Internet April 1995  –  February 1996  (11 months) London, United Kingdom • Provided technical support for a wide range of operating systems and networking applications. \n• Gained good practical working knowledge of debugging the fundamental internet protocols (SMTP, NNTP, DNS, HTTP, FTP, etc) and other computing / networking / telcoms related issues. \n• Solved customer problems by telephone and occasionally on site. Layout Artist Epigram - University of Bristol Student Newspaper October 1993  –  June 1994  (9 months) Bristol, United Kingdom • Composed University newspaper on Apple Macintosh computers using word processing and desktop publishing software (PageMaker and Word). \n• Utilised scanning and image manipulation software (Ofoto and Photoshop) to insert and cleanup photographs. \n• Worked in a team to strict deadlines. Senior Director, Service Engineering Yahoo! April 2010  – Present (5 years 5 months) London, UK & Sunnyvale, California • Grew and directly managed global organization of 65 DevOps/Production Engineers and first/second/third line managers spread across eight countries. \n• From scratch, built up, managed and tore down teams in Silicon Valley, London, Hamburg, Trondheim, Tel Aviv, Bangalore, Singapore and Beijing. \n• Developed and executed multi-national/global location strategies aligned to long term business objectives. \n• Participated in global M&A reviews and due diligence. \n• Instituted scalable and efficient processes for incident, release, capacity, SLA, etc... management. \n• Optimized alerting, monitoring and response/resolution systems for TTD/TTS improvements and cost efficiency. \n• Managed multi-million dollar annual capex and opex budgets. \n• Rolled out agile and CI/CD automation programs. \n• Managed a variety of Yahoo's core services including Gemini (Native and Search Advertising Revenue platform), all Mobile services (including Mobile Homepage, Mobile Search, Mobile Mail, etc...), various Mobile apps, Personalization & Ad Targeting platforms, Cloud hosting, Registration/Login and Vertical Search systems. \n• Executed numerous new service deployments and launches to grow business successfully. \n• Drove wide-ranging cultural change, moving organizations from reactive/operational activities to proactive and efficient DevOps mindset and methodologies. \n• Mentored individuals, managers/directors and teams into \"top talent\" award winning levels. Senior Director, Service Engineering Yahoo! April 2010  – Present (5 years 5 months) London, UK & Sunnyvale, California • Grew and directly managed global organization of 65 DevOps/Production Engineers and first/second/third line managers spread across eight countries. \n• From scratch, built up, managed and tore down teams in Silicon Valley, London, Hamburg, Trondheim, Tel Aviv, Bangalore, Singapore and Beijing. \n• Developed and executed multi-national/global location strategies aligned to long term business objectives. \n• Participated in global M&A reviews and due diligence. \n• Instituted scalable and efficient processes for incident, release, capacity, SLA, etc... management. \n• Optimized alerting, monitoring and response/resolution systems for TTD/TTS improvements and cost efficiency. \n• Managed multi-million dollar annual capex and opex budgets. \n• Rolled out agile and CI/CD automation programs. \n• Managed a variety of Yahoo's core services including Gemini (Native and Search Advertising Revenue platform), all Mobile services (including Mobile Homepage, Mobile Search, Mobile Mail, etc...), various Mobile apps, Personalization & Ad Targeting platforms, Cloud hosting, Registration/Login and Vertical Search systems. \n• Executed numerous new service deployments and launches to grow business successfully. \n• Drove wide-ranging cultural change, moving organizations from reactive/operational activities to proactive and efficient DevOps mindset and methodologies. \n• Mentored individuals, managers/directors and teams into \"top talent\" award winning levels. Director, Service Engineering Yahoo! January 2005  –  March 2010  (5 years 3 months) London, UK & Sunnyvale, California Director, Service Engineering Yahoo! January 2005  –  March 2010  (5 years 3 months) London, UK & Sunnyvale, California Head of Operations Digital Rum May 2002  –  January 2005  (2 years 9 months) London, United Kingdom • Led teams responsible for all internal and external production technical and IT infrastructure. \n• Set up a monitoring service, outsourced telephone helpdesk and internal second-line call-out system to provide 24/7 support to all customer facing services. \n• Investigated, designed and implemented numerous improvements to dramatically increase service availability and performance (SLAs). These covered areas such as hot standby, use of Ultra Monkey / LVS load-balancers, etc… \n• Migrated of web and application services from costly, commercial software (eg. Weblogic, Solaris, etc…) to high performance, stable, open source solutions (eg. JBoss, Linux, etc…). \n• Implemented IP multi-pathing and redundant disk arrays for maximum resiliency of the Solaris Oracle servers. \n• Performed M&A due diligence and integrated organisation/services/infrastructure of acquired company (Scan). \n• Deployed, tested and managed numerous mobile services for Vodafone, O2, Orange, T-Mobile, Argos, British Airways, Virgin Atlantic, France Telecom, etc… Head of Operations Digital Rum May 2002  –  January 2005  (2 years 9 months) London, United Kingdom • Led teams responsible for all internal and external production technical and IT infrastructure. \n• Set up a monitoring service, outsourced telephone helpdesk and internal second-line call-out system to provide 24/7 support to all customer facing services. \n• Investigated, designed and implemented numerous improvements to dramatically increase service availability and performance (SLAs). These covered areas such as hot standby, use of Ultra Monkey / LVS load-balancers, etc… \n• Migrated of web and application services from costly, commercial software (eg. Weblogic, Solaris, etc…) to high performance, stable, open source solutions (eg. JBoss, Linux, etc…). \n• Implemented IP multi-pathing and redundant disk arrays for maximum resiliency of the Solaris Oracle servers. \n• Performed M&A due diligence and integrated organisation/services/infrastructure of acquired company (Scan). \n• Deployed, tested and managed numerous mobile services for Vodafone, O2, Orange, T-Mobile, Argos, British Airways, Virgin Atlantic, France Telecom, etc… Head of IT Xtempus January 2001  –  May 2002  (1 year 5 months) London, United Kingdom • Was in charge of all internal, external and security services at a startup mobile services company. \n• Rolled out, managed and helped develop bespoke mobile services for customers such as Vodafone, Orange and News International. \n• Setup X.25 to TCP/IP translation on Cisco routers to connect to Vodafone’s SMSC. \n• Radically overhauled security setup and processes. \n• Implemented multi site IPSec VPNs using Cisco routers, Cisco PIX firewalls, FreeS/WAN Linux servers and, for roaming users, Windows 2000. \n• Virtualised and load balanced many existing services to improve reliability and save on costs. \n• Built and maintained a large number of internal Java/JSP and Oracle development servers. Head of IT Xtempus January 2001  –  May 2002  (1 year 5 months) London, United Kingdom • Was in charge of all internal, external and security services at a startup mobile services company. \n• Rolled out, managed and helped develop bespoke mobile services for customers such as Vodafone, Orange and News International. \n• Setup X.25 to TCP/IP translation on Cisco routers to connect to Vodafone’s SMSC. \n• Radically overhauled security setup and processes. \n• Implemented multi site IPSec VPNs using Cisco routers, Cisco PIX firewalls, FreeS/WAN Linux servers and, for roaming users, Windows 2000. \n• Virtualised and load balanced many existing services to improve reliability and save on costs. \n• Built and maintained a large number of internal Java/JSP and Oracle development servers. Operations Manager Talkcast Corporation Plc January 2000  –  January 2001  (1 year 1 month) London, United Kingdom • Was in charge of all internal, external and security services at a startup internet media company. \n• Hired and supervised a team of Unix/NT Systems Administrators, Oracle DBAs and internal Helpdesk staff. \n• From scratch, designed, specified, implemented and managed all web, wap, mail, dns, streaming, e-commerce and sms services and also the underlying network infrastructure. \n• Utilised various techniques (including load balancing, automatic monitoring and failover, etc…) to provide resilient services. \n• Set up multiple dedicated TCP/IP and X.25 leased lines. \n• Established and maintained company wide security policy (including firewalls, secure financial transactions, email virus scanning and dealing with sensitive customer data). \n• Successfully passed two third-party security audits of our network (including an external test attack performed by PWC). \n• Liased with third parties to supply hardware, software, telecoms, human and other resources. Operations Manager Talkcast Corporation Plc January 2000  –  January 2001  (1 year 1 month) London, United Kingdom • Was in charge of all internal, external and security services at a startup internet media company. \n• Hired and supervised a team of Unix/NT Systems Administrators, Oracle DBAs and internal Helpdesk staff. \n• From scratch, designed, specified, implemented and managed all web, wap, mail, dns, streaming, e-commerce and sms services and also the underlying network infrastructure. \n• Utilised various techniques (including load balancing, automatic monitoring and failover, etc…) to provide resilient services. \n• Set up multiple dedicated TCP/IP and X.25 leased lines. \n• Established and maintained company wide security policy (including firewalls, secure financial transactions, email virus scanning and dealing with sensitive customer data). \n• Successfully passed two third-party security audits of our network (including an external test attack performed by PWC). \n• Liased with third parties to supply hardware, software, telecoms, human and other resources. Systems Administration Manager Thus PLC (was Demon Internet Ltd) September 1999  –  January 2000  (5 months) London, United Kingdom • Technical management role responsible for a large team of Unix/NT Systems and Security administrators. \n• Looked after enterprise-class customer facing systems and network. \n• Designed, project managed and rolled out new services. \n• Dealt with issues of capacity planning, security and technology development. \n• Provided regular weekly KPI/metric reports on service performance and availability. \n• Carried out selection interviews for the employment of new team members. \n• Team building and development. Systems Administration Manager Thus PLC (was Demon Internet Ltd) September 1999  –  January 2000  (5 months) London, United Kingdom • Technical management role responsible for a large team of Unix/NT Systems and Security administrators. \n• Looked after enterprise-class customer facing systems and network. \n• Designed, project managed and rolled out new services. \n• Dealt with issues of capacity planning, security and technology development. \n• Provided regular weekly KPI/metric reports on service performance and availability. \n• Carried out selection interviews for the employment of new team members. \n• Team building and development. Team Leader of Backend Services Demon Internet February 1998  –  August 1999  (1 year 7 months) London, United Kingdom • Was responsible for maintaining all of the services provided by the Backend Services team at the highest level of availability (these included security, authentication, dial-up routing, authoritative and caching DNS, fax to email / email to fax and backups). \n• Forward planned service upgrades based on system reports, monitoring tools and other information. \n• Implemented resilient solutions for customer facing services. \n• Was crucially involved in the rapid design and setup of the “in2home.co.uk”, “currantbun.com” and “beeb.net” virtual ISPs. \n• Tested hardware and software for Year 2000 compliance; Recruited and trained new staff. Team Leader of Backend Services Demon Internet February 1998  –  August 1999  (1 year 7 months) London, United Kingdom • Was responsible for maintaining all of the services provided by the Backend Services team at the highest level of availability (these included security, authentication, dial-up routing, authoritative and caching DNS, fax to email / email to fax and backups). \n• Forward planned service upgrades based on system reports, monitoring tools and other information. \n• Implemented resilient solutions for customer facing services. \n• Was crucially involved in the rapid design and setup of the “in2home.co.uk”, “currantbun.com” and “beeb.net” virtual ISPs. \n• Tested hardware and software for Year 2000 compliance; Recruited and trained new staff. Senior Systems Administrator Demon Internet February 1996  –  January 1998  (2 years) London, United Kingdom • Designed, built, configured and maintained a variety of customer facing, critical, Unix based services. \n• Developed and setup tools to monitor system performance and planned subsequent kernel and system performance tuning. \n• Liased with potential suppliers and subsequently evaluated hardware/software writing assessment reports. \n• Provided twenty-four hour pager cover in the event of unexpected system failures. \n• Documented services and maintenance procedures. Senior Systems Administrator Demon Internet February 1996  –  January 1998  (2 years) London, United Kingdom • Designed, built, configured and maintained a variety of customer facing, critical, Unix based services. \n• Developed and setup tools to monitor system performance and planned subsequent kernel and system performance tuning. \n• Liased with potential suppliers and subsequently evaluated hardware/software writing assessment reports. \n• Provided twenty-four hour pager cover in the event of unexpected system failures. \n• Documented services and maintenance procedures. Support Engineer Demon Internet April 1995  –  February 1996  (11 months) London, United Kingdom • Provided technical support for a wide range of operating systems and networking applications. \n• Gained good practical working knowledge of debugging the fundamental internet protocols (SMTP, NNTP, DNS, HTTP, FTP, etc) and other computing / networking / telcoms related issues. \n• Solved customer problems by telephone and occasionally on site. Support Engineer Demon Internet April 1995  –  February 1996  (11 months) London, United Kingdom • Provided technical support for a wide range of operating systems and networking applications. \n• Gained good practical working knowledge of debugging the fundamental internet protocols (SMTP, NNTP, DNS, HTTP, FTP, etc) and other computing / networking / telcoms related issues. \n• Solved customer problems by telephone and occasionally on site. Layout Artist Epigram - University of Bristol Student Newspaper October 1993  –  June 1994  (9 months) Bristol, United Kingdom • Composed University newspaper on Apple Macintosh computers using word processing and desktop publishing software (PageMaker and Word). \n• Utilised scanning and image manipulation software (Ofoto and Photoshop) to insert and cleanup photographs. \n• Worked in a team to strict deadlines. Layout Artist Epigram - University of Bristol Student Newspaper October 1993  –  June 1994  (9 months) Bristol, United Kingdom • Composed University newspaper on Apple Macintosh computers using word processing and desktop publishing software (PageMaker and Word). \n• Utilised scanning and image manipulation software (Ofoto and Photoshop) to insert and cleanup photographs. \n• Worked in a team to strict deadlines. Languages English Native or bilingual proficiency Polish Native or bilingual proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Mobile Devices Scalability System Administration Linux Cloud Computing Mobile Applications Apache Agile Methodologies Open Source Mobile Internet System Architecture Unix Leadership Cross-functional Team... High Availability Shell Scripting Technical Leadership Team Management Distributed Systems MySQL Operations Management Service Operations ITIL SaaS Service Engineering Java People Management Team Leadership Engineering Web Services PHP TCP/IP Release Management See 18+     See less Skills  Mobile Devices Scalability System Administration Linux Cloud Computing Mobile Applications Apache Agile Methodologies Open Source Mobile Internet System Architecture Unix Leadership Cross-functional Team... High Availability Shell Scripting Technical Leadership Team Management Distributed Systems MySQL Operations Management Service Operations ITIL SaaS Service Engineering Java People Management Team Leadership Engineering Web Services PHP TCP/IP Release Management See 18+     See less Mobile Devices Scalability System Administration Linux Cloud Computing Mobile Applications Apache Agile Methodologies Open Source Mobile Internet System Architecture Unix Leadership Cross-functional Team... High Availability Shell Scripting Technical Leadership Team Management Distributed Systems MySQL Operations Management Service Operations ITIL SaaS Service Engineering Java People Management Team Leadership Engineering Web Services PHP TCP/IP Release Management See 18+     See less Mobile Devices Scalability System Administration Linux Cloud Computing Mobile Applications Apache Agile Methodologies Open Source Mobile Internet System Architecture Unix Leadership Cross-functional Team... High Availability Shell Scripting Technical Leadership Team Management Distributed Systems MySQL Operations Management Service Operations ITIL SaaS Service Engineering Java People Management Team Leadership Engineering Web Services PHP TCP/IP Release Management See 18+     See less Education University of Bristol BSc,  Physics October 1991  – July 1994 Latymer Upper School 1983  – 1991 University of Bristol BSc,  Physics October 1991  – July 1994 University of Bristol BSc,  Physics October 1991  – July 1994 University of Bristol BSc,  Physics October 1991  – July 1994 Latymer Upper School 1983  – 1991 Latymer Upper School 1983  – 1991 Latymer Upper School 1983  – 1991 Honors & Awards Yahoo You Rock Award - Social Chrome platform 2011 Yahoo Odyssey Award - FIFA World Cup mobile portal and SMS service SVP, International Engineering - John Linwood 2006 Yahoo You Rock Award - Social Chrome platform 2011 Yahoo You Rock Award - Social Chrome platform 2011 Yahoo You Rock Award - Social Chrome platform 2011 Yahoo Odyssey Award - FIFA World Cup mobile portal and SMS service SVP, International Engineering - John Linwood 2006 Yahoo Odyssey Award - FIFA World Cup mobile portal and SMS service SVP, International Engineering - John Linwood 2006 Yahoo Odyssey Award - FIFA World Cup mobile portal and SMS service SVP, International Engineering - John Linwood 2006 ", "Experience Sr Engineering Manager - DevOps,Production Engineering at Yahoo! Yahoo January 2015  – Present (8 months) Sr Manager Service Engineering - Yahoo! Mail Yahoo! August 2012  – Present (3 years 1 month) Bengaluru Area, India Sr Manager Service Engineering - Yahoo! Mail Backend, Delivery and Antispam Yahoo! January 2011  –  August 2012  (1 year 8 months) San Francisco Bay Area Technical Lead - Yahoo Social platforms Yahoo! October 2009  –  December 2010  (1 year 3 months) San Francisco Bay Area Technical Lead - Yahoo! Mail Yahoo! September 2007  –  October 2009  (2 years 2 months) San Francisco Bay Area Technical Yahoo! Yahoo Mail Yahoo! August 2003  –  August 2007  (4 years 1 month) Bengaluru Area, India Tech support Engg Talisma Corporation December 1999  –  August 2003  (3 years 9 months) Sr Engineering Manager - DevOps,Production Engineering at Yahoo! Yahoo January 2015  – Present (8 months) Sr Engineering Manager - DevOps,Production Engineering at Yahoo! Yahoo January 2015  – Present (8 months) Sr Manager Service Engineering - Yahoo! Mail Yahoo! August 2012  – Present (3 years 1 month) Bengaluru Area, India Sr Manager Service Engineering - Yahoo! Mail Yahoo! August 2012  – Present (3 years 1 month) Bengaluru Area, India Sr Manager Service Engineering - Yahoo! Mail Backend, Delivery and Antispam Yahoo! January 2011  –  August 2012  (1 year 8 months) San Francisco Bay Area Sr Manager Service Engineering - Yahoo! Mail Backend, Delivery and Antispam Yahoo! January 2011  –  August 2012  (1 year 8 months) San Francisco Bay Area Technical Lead - Yahoo Social platforms Yahoo! October 2009  –  December 2010  (1 year 3 months) San Francisco Bay Area Technical Lead - Yahoo Social platforms Yahoo! October 2009  –  December 2010  (1 year 3 months) San Francisco Bay Area Technical Lead - Yahoo! Mail Yahoo! September 2007  –  October 2009  (2 years 2 months) San Francisco Bay Area Technical Lead - Yahoo! Mail Yahoo! September 2007  –  October 2009  (2 years 2 months) San Francisco Bay Area Technical Yahoo! Yahoo Mail Yahoo! August 2003  –  August 2007  (4 years 1 month) Bengaluru Area, India Technical Yahoo! Yahoo Mail Yahoo! August 2003  –  August 2007  (4 years 1 month) Bengaluru Area, India Tech support Engg Talisma Corporation December 1999  –  August 2003  (3 years 9 months) Tech support Engg Talisma Corporation December 1999  –  August 2003  (3 years 9 months) Skills Perl Unix Unix Shell Scripting FreeBSD Linux Red Hat Linux DevOps Operational Excellence Application Support High Availability Cloud Computing Performance Tuning High Performance... Technical Leadership Scalability Shell Scripting Apache REST Distributed Systems Bash Open Source MapReduce Agile Methodologies See 8+     See less Skills  Perl Unix Unix Shell Scripting FreeBSD Linux Red Hat Linux DevOps Operational Excellence Application Support High Availability Cloud Computing Performance Tuning High Performance... Technical Leadership Scalability Shell Scripting Apache REST Distributed Systems Bash Open Source MapReduce Agile Methodologies See 8+     See less Perl Unix Unix Shell Scripting FreeBSD Linux Red Hat Linux DevOps Operational Excellence Application Support High Availability Cloud Computing Performance Tuning High Performance... Technical Leadership Scalability Shell Scripting Apache REST Distributed Systems Bash Open Source MapReduce Agile Methodologies See 8+     See less Perl Unix Unix Shell Scripting FreeBSD Linux Red Hat Linux DevOps Operational Excellence Application Support High Availability Cloud Computing Performance Tuning High Performance... Technical Leadership Scalability Shell Scripting Apache REST Distributed Systems Bash Open Source MapReduce Agile Methodologies See 8+     See less Education University of Kerala Bachelor of Science (B.Sc.) 1992  – 1997 University of Kerala Bachelor of Science (B.Sc.) 1992  – 1997 University of Kerala Bachelor of Science (B.Sc.) 1992  – 1997 University of Kerala Bachelor of Science (B.Sc.) 1992  – 1997 ", "Languages English Spanish German (20%) English Spanish German (20%) English Spanish German (20%) Skills Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Skills  Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Cloud Computing Agile Methodologies SaaS Distributed Systems Product Management Linux Perl Cross-functional Team... Software Development DevOps Kanban Scalability Production Engineering Mobile Technology Video Security Management Scrum Enterprise Software Leadership Computer Network... Product Development See 6+     See less Honors & Awards Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award Yahoo Super Star Yahoo 2012 Individual recipient of Yahoo's most important recognition award ", "Summary Over 12+ years of experience in the Internet and Enterprise software development including stints at large technology companies (Yahoo, Microsoft, Oracle). \n \nProven record to provide complex engineering solutions to business problems. As engineering lead, responsible for engineering architecture, design, delivery along with managing quality and DevOps. Hands on and management expertise in productizing high throughput, low latency web services, catering to 800M+ users serving 9B+ requests per day. Platforms build is highly distributed systems with footprint of 2000+ serves spread in multiple geographical locations.  \n \nPeople and engineering development management - Lead team of size ranging between 8 to 14, promoted 5+ individual contributors to next level, managed out low performers over past 4 years.  \n \nKey engineering skills - LAMP, C++,Java,Pig, Tomcat,Jetty, Memcache, Redis, ActiveMQ, ATS,Squid, DOT/DHT store, Hadoop, HBase, MySQL, Splunk, Jenkin, Git. \n Summary Over 12+ years of experience in the Internet and Enterprise software development including stints at large technology companies (Yahoo, Microsoft, Oracle). \n \nProven record to provide complex engineering solutions to business problems. As engineering lead, responsible for engineering architecture, design, delivery along with managing quality and DevOps. Hands on and management expertise in productizing high throughput, low latency web services, catering to 800M+ users serving 9B+ requests per day. Platforms build is highly distributed systems with footprint of 2000+ serves spread in multiple geographical locations.  \n \nPeople and engineering development management - Lead team of size ranging between 8 to 14, promoted 5+ individual contributors to next level, managed out low performers over past 4 years.  \n \nKey engineering skills - LAMP, C++,Java,Pig, Tomcat,Jetty, Memcache, Redis, ActiveMQ, ATS,Squid, DOT/DHT store, Hadoop, HBase, MySQL, Splunk, Jenkin, Git. \n Over 12+ years of experience in the Internet and Enterprise software development including stints at large technology companies (Yahoo, Microsoft, Oracle). \n \nProven record to provide complex engineering solutions to business problems. As engineering lead, responsible for engineering architecture, design, delivery along with managing quality and DevOps. Hands on and management expertise in productizing high throughput, low latency web services, catering to 800M+ users serving 9B+ requests per day. Platforms build is highly distributed systems with footprint of 2000+ serves spread in multiple geographical locations.  \n \nPeople and engineering development management - Lead team of size ranging between 8 to 14, promoted 5+ individual contributors to next level, managed out low performers over past 4 years.  \n \nKey engineering skills - LAMP, C++,Java,Pig, Tomcat,Jetty, Memcache, Redis, ActiveMQ, ATS,Squid, DOT/DHT store, Hadoop, HBase, MySQL, Splunk, Jenkin, Git. \n Over 12+ years of experience in the Internet and Enterprise software development including stints at large technology companies (Yahoo, Microsoft, Oracle). \n \nProven record to provide complex engineering solutions to business problems. As engineering lead, responsible for engineering architecture, design, delivery along with managing quality and DevOps. Hands on and management expertise in productizing high throughput, low latency web services, catering to 800M+ users serving 9B+ requests per day. Platforms build is highly distributed systems with footprint of 2000+ serves spread in multiple geographical locations.  \n \nPeople and engineering development management - Lead team of size ranging between 8 to 14, promoted 5+ individual contributors to next level, managed out low performers over past 4 years.  \n \nKey engineering skills - LAMP, C++,Java,Pig, Tomcat,Jetty, Memcache, Redis, ActiveMQ, ATS,Squid, DOT/DHT store, Hadoop, HBase, MySQL, Splunk, Jenkin, Git. \n Experience Senior Engineering Manager Yahoo! April 2013  – Present (2 years 5 months) Sunnyvale, CA Currently leading contacts/Addressbook engineering team which is part of Xobni/Mail Org to make Yahoo mail more people/entity centric. \n \n- Modernized Adressbook platform (10+ year old codebase) on Apache Traffic Server/Jetty/Redis/NoSQL technology serving 100k+ requests per seconds. \n- Re-implemented cardDAV protocol for contacts to support native mobile sync functionality for key devices like iOS, Android, Kindle Devices. Increased DAU by 4x. \n- Migrated contacts storage from Filer to internal NoSQL datastore format for 400M+ users, added 5TB/region Redis footprint to reduce latency under 10ms.  \n- Reduced production release cycle to daily with continuous delivery, new stack helped in reducing production server footprint by 3x with 99.9% availability.  \n- Launched Import contacts from Facebook, Outlook, Gmail, CSV sources. Increased daily imported contacts metrics by 2x over multiple quarters by feature iterations. \n- Rolled out multiple features to increase core contacts fields like Name, Photo, Email, Phone numbers.  \n- Never miss mail from friends (Rescue inbound mails from spam folder based on address book data of user), Crisis2opportunity (Restore contacts from last 10 backed up snapshots). \n \nBuilt Credstore platform for Yahoo wide use cases to support partner integration such as Facebook, LinkedIn, Outlook, Twitter etc to securely store and refresh the user’s third party tokens. \n \nI encourage you to try few interesting features of Yahoo mail particularly search for your friend(autosuggest), import contacts from Facebook, sync contacts on iPhone etc where me and my team have put lot of efforts to enhance your experience. Do let me know if you have feedback. \n \nKey Technology used - Java, cardDAV/Oauth2/Quartz, Jetty, Apache Traffic server, Redis, DOT/DHT store, Hadoop, Splunk, Jenkin, Git. \n Engineering Manager Yahoo! August 2011  –  March 2013  (1 year 8 months) Bangalore UGCCloud Platform - which powers comment, poll, message board, user activities etc across Yahoo media properties (like news, sports, finance etc) globally by providing RESTFul web services. Played engineering lead role to manage backend and front end experiences, managed multiple small scrum teams, managed 12-14 engineers directly.  \n \nIncreased user generated content by 100% by YoY in 2012 by various quick iterations of features. (Base: x Billion activities). Key features rolled out includes notification support, my/user comments Tab, popular now comment sort order, expanded reply, better spam management, etc. Bucket tested Disqus commenting platform vs homegrown commenting solution.  \n \nIn 2012 - made 2 major UI iterations for message board experience. This resulted in increasing PVs and time spent by 130%, 160% respectively QoQ (Base: xx million PVs, xx million minute). You can see latest version of message board here (per ticker) http://finance.yahoo.com/mb/YHOO \n \nKey Technology used - Java, PHP, CSS, Tomcat, Apache Traffic server, Memcache, DOT/DHT store, Hadoop, Jenkin, Git. Principal Engineer Yahoo! March 2011  –  August 2011  (6 months) Bangalore Part of new UGC Cloud platform which replaced internal 4 legacy platforms including legacy commenting platform where I contributed as individual developer. UGC Cloud platform was re-architectured on new stack(ATS, Tomcat, Java, DHT, DOT, Hadoop etc). Involved as lead for moving commenting functionality and then contributing broadly in other areas. Owned complete responsibility of development and on-boarding/migrating legacy experiences and providing new innovative features for commenting across Y! network. Design, coding for legacy commenting functionality which was based on MySQL datastore to new stack of memcache, DHT (Distributed Hast Table) & DOT (Distributed Ordered Table). \n \nResults achieved - 100% traffic migration to new stack, Key business metrics (like contribution, UU, spam) improved by 50–70% on new platform. Improved other operational metrics like 99.85% availability, <300ms of latency for APIs, etc. \n \nKey Technology used - Java, Tomcat, Apache Traffic server, Memcache, ActiveMQ, DOT/DHT store, Hadoop. Tech Lead Yahoo! January 2009  –  March 2011  (2 years 3 months) Bangalore Worked on property hosted User Generated Content(phUGC) platform which powers commenting functionality on yahoo network. Launched commenting for the first time on US news in 2010 and then to across 200 media properties globally.  \n \nFocused on design and implementing commenting functionality, end to end performance benchmarking. Took up initiative to get right filters and innovating features to curb spam on Yahoo network.  \n \nTechnology Used - Squid, Apache, PHP/C++, MySQL SDE Microsoft July 2005  –  December 2008  (3 years 6 months) Hyderabad Worked on product development. Shipped DPM V2. (Microsoft Data Protection manager). Individual contributor - responsible for design and implementation of tape library management functions and backing data on tapes.  \n \nTechnology used - c++, tape library ioctl, windows server Member Technical staff Oracle July 2004  –  June 2005  (1 year) Bangalore Worked on development of product \"Oracle Discoverer Enterprise\". Primary responsibility included fixing customer reported bugs, crashes, performance issues. \n \nTechnology used - gdb, c++ Software Engineer Robert Bosch June 2003  –  July 2004  (1 year 2 months) Worked on Path Navigation software development. Senior Engineering Manager Yahoo! April 2013  – Present (2 years 5 months) Sunnyvale, CA Currently leading contacts/Addressbook engineering team which is part of Xobni/Mail Org to make Yahoo mail more people/entity centric. \n \n- Modernized Adressbook platform (10+ year old codebase) on Apache Traffic Server/Jetty/Redis/NoSQL technology serving 100k+ requests per seconds. \n- Re-implemented cardDAV protocol for contacts to support native mobile sync functionality for key devices like iOS, Android, Kindle Devices. Increased DAU by 4x. \n- Migrated contacts storage from Filer to internal NoSQL datastore format for 400M+ users, added 5TB/region Redis footprint to reduce latency under 10ms.  \n- Reduced production release cycle to daily with continuous delivery, new stack helped in reducing production server footprint by 3x with 99.9% availability.  \n- Launched Import contacts from Facebook, Outlook, Gmail, CSV sources. Increased daily imported contacts metrics by 2x over multiple quarters by feature iterations. \n- Rolled out multiple features to increase core contacts fields like Name, Photo, Email, Phone numbers.  \n- Never miss mail from friends (Rescue inbound mails from spam folder based on address book data of user), Crisis2opportunity (Restore contacts from last 10 backed up snapshots). \n \nBuilt Credstore platform for Yahoo wide use cases to support partner integration such as Facebook, LinkedIn, Outlook, Twitter etc to securely store and refresh the user’s third party tokens. \n \nI encourage you to try few interesting features of Yahoo mail particularly search for your friend(autosuggest), import contacts from Facebook, sync contacts on iPhone etc where me and my team have put lot of efforts to enhance your experience. Do let me know if you have feedback. \n \nKey Technology used - Java, cardDAV/Oauth2/Quartz, Jetty, Apache Traffic server, Redis, DOT/DHT store, Hadoop, Splunk, Jenkin, Git. \n Senior Engineering Manager Yahoo! April 2013  – Present (2 years 5 months) Sunnyvale, CA Currently leading contacts/Addressbook engineering team which is part of Xobni/Mail Org to make Yahoo mail more people/entity centric. \n \n- Modernized Adressbook platform (10+ year old codebase) on Apache Traffic Server/Jetty/Redis/NoSQL technology serving 100k+ requests per seconds. \n- Re-implemented cardDAV protocol for contacts to support native mobile sync functionality for key devices like iOS, Android, Kindle Devices. Increased DAU by 4x. \n- Migrated contacts storage from Filer to internal NoSQL datastore format for 400M+ users, added 5TB/region Redis footprint to reduce latency under 10ms.  \n- Reduced production release cycle to daily with continuous delivery, new stack helped in reducing production server footprint by 3x with 99.9% availability.  \n- Launched Import contacts from Facebook, Outlook, Gmail, CSV sources. Increased daily imported contacts metrics by 2x over multiple quarters by feature iterations. \n- Rolled out multiple features to increase core contacts fields like Name, Photo, Email, Phone numbers.  \n- Never miss mail from friends (Rescue inbound mails from spam folder based on address book data of user), Crisis2opportunity (Restore contacts from last 10 backed up snapshots). \n \nBuilt Credstore platform for Yahoo wide use cases to support partner integration such as Facebook, LinkedIn, Outlook, Twitter etc to securely store and refresh the user’s third party tokens. \n \nI encourage you to try few interesting features of Yahoo mail particularly search for your friend(autosuggest), import contacts from Facebook, sync contacts on iPhone etc where me and my team have put lot of efforts to enhance your experience. Do let me know if you have feedback. \n \nKey Technology used - Java, cardDAV/Oauth2/Quartz, Jetty, Apache Traffic server, Redis, DOT/DHT store, Hadoop, Splunk, Jenkin, Git. \n Engineering Manager Yahoo! August 2011  –  March 2013  (1 year 8 months) Bangalore UGCCloud Platform - which powers comment, poll, message board, user activities etc across Yahoo media properties (like news, sports, finance etc) globally by providing RESTFul web services. Played engineering lead role to manage backend and front end experiences, managed multiple small scrum teams, managed 12-14 engineers directly.  \n \nIncreased user generated content by 100% by YoY in 2012 by various quick iterations of features. (Base: x Billion activities). Key features rolled out includes notification support, my/user comments Tab, popular now comment sort order, expanded reply, better spam management, etc. Bucket tested Disqus commenting platform vs homegrown commenting solution.  \n \nIn 2012 - made 2 major UI iterations for message board experience. This resulted in increasing PVs and time spent by 130%, 160% respectively QoQ (Base: xx million PVs, xx million minute). You can see latest version of message board here (per ticker) http://finance.yahoo.com/mb/YHOO \n \nKey Technology used - Java, PHP, CSS, Tomcat, Apache Traffic server, Memcache, DOT/DHT store, Hadoop, Jenkin, Git. Engineering Manager Yahoo! August 2011  –  March 2013  (1 year 8 months) Bangalore UGCCloud Platform - which powers comment, poll, message board, user activities etc across Yahoo media properties (like news, sports, finance etc) globally by providing RESTFul web services. Played engineering lead role to manage backend and front end experiences, managed multiple small scrum teams, managed 12-14 engineers directly.  \n \nIncreased user generated content by 100% by YoY in 2012 by various quick iterations of features. (Base: x Billion activities). Key features rolled out includes notification support, my/user comments Tab, popular now comment sort order, expanded reply, better spam management, etc. Bucket tested Disqus commenting platform vs homegrown commenting solution.  \n \nIn 2012 - made 2 major UI iterations for message board experience. This resulted in increasing PVs and time spent by 130%, 160% respectively QoQ (Base: xx million PVs, xx million minute). You can see latest version of message board here (per ticker) http://finance.yahoo.com/mb/YHOO \n \nKey Technology used - Java, PHP, CSS, Tomcat, Apache Traffic server, Memcache, DOT/DHT store, Hadoop, Jenkin, Git. Principal Engineer Yahoo! March 2011  –  August 2011  (6 months) Bangalore Part of new UGC Cloud platform which replaced internal 4 legacy platforms including legacy commenting platform where I contributed as individual developer. UGC Cloud platform was re-architectured on new stack(ATS, Tomcat, Java, DHT, DOT, Hadoop etc). Involved as lead for moving commenting functionality and then contributing broadly in other areas. Owned complete responsibility of development and on-boarding/migrating legacy experiences and providing new innovative features for commenting across Y! network. Design, coding for legacy commenting functionality which was based on MySQL datastore to new stack of memcache, DHT (Distributed Hast Table) & DOT (Distributed Ordered Table). \n \nResults achieved - 100% traffic migration to new stack, Key business metrics (like contribution, UU, spam) improved by 50–70% on new platform. Improved other operational metrics like 99.85% availability, <300ms of latency for APIs, etc. \n \nKey Technology used - Java, Tomcat, Apache Traffic server, Memcache, ActiveMQ, DOT/DHT store, Hadoop. Principal Engineer Yahoo! March 2011  –  August 2011  (6 months) Bangalore Part of new UGC Cloud platform which replaced internal 4 legacy platforms including legacy commenting platform where I contributed as individual developer. UGC Cloud platform was re-architectured on new stack(ATS, Tomcat, Java, DHT, DOT, Hadoop etc). Involved as lead for moving commenting functionality and then contributing broadly in other areas. Owned complete responsibility of development and on-boarding/migrating legacy experiences and providing new innovative features for commenting across Y! network. Design, coding for legacy commenting functionality which was based on MySQL datastore to new stack of memcache, DHT (Distributed Hast Table) & DOT (Distributed Ordered Table). \n \nResults achieved - 100% traffic migration to new stack, Key business metrics (like contribution, UU, spam) improved by 50–70% on new platform. Improved other operational metrics like 99.85% availability, <300ms of latency for APIs, etc. \n \nKey Technology used - Java, Tomcat, Apache Traffic server, Memcache, ActiveMQ, DOT/DHT store, Hadoop. Tech Lead Yahoo! January 2009  –  March 2011  (2 years 3 months) Bangalore Worked on property hosted User Generated Content(phUGC) platform which powers commenting functionality on yahoo network. Launched commenting for the first time on US news in 2010 and then to across 200 media properties globally.  \n \nFocused on design and implementing commenting functionality, end to end performance benchmarking. Took up initiative to get right filters and innovating features to curb spam on Yahoo network.  \n \nTechnology Used - Squid, Apache, PHP/C++, MySQL Tech Lead Yahoo! January 2009  –  March 2011  (2 years 3 months) Bangalore Worked on property hosted User Generated Content(phUGC) platform which powers commenting functionality on yahoo network. Launched commenting for the first time on US news in 2010 and then to across 200 media properties globally.  \n \nFocused on design and implementing commenting functionality, end to end performance benchmarking. Took up initiative to get right filters and innovating features to curb spam on Yahoo network.  \n \nTechnology Used - Squid, Apache, PHP/C++, MySQL SDE Microsoft July 2005  –  December 2008  (3 years 6 months) Hyderabad Worked on product development. Shipped DPM V2. (Microsoft Data Protection manager). Individual contributor - responsible for design and implementation of tape library management functions and backing data on tapes.  \n \nTechnology used - c++, tape library ioctl, windows server SDE Microsoft July 2005  –  December 2008  (3 years 6 months) Hyderabad Worked on product development. Shipped DPM V2. (Microsoft Data Protection manager). Individual contributor - responsible for design and implementation of tape library management functions and backing data on tapes.  \n \nTechnology used - c++, tape library ioctl, windows server Member Technical staff Oracle July 2004  –  June 2005  (1 year) Bangalore Worked on development of product \"Oracle Discoverer Enterprise\". Primary responsibility included fixing customer reported bugs, crashes, performance issues. \n \nTechnology used - gdb, c++ Member Technical staff Oracle July 2004  –  June 2005  (1 year) Bangalore Worked on development of product \"Oracle Discoverer Enterprise\". Primary responsibility included fixing customer reported bugs, crashes, performance issues. \n \nTechnology used - gdb, c++ Software Engineer Robert Bosch June 2003  –  July 2004  (1 year 2 months) Worked on Path Navigation software development. Software Engineer Robert Bosch June 2003  –  July 2004  (1 year 2 months) Worked on Path Navigation software development. Skills Hadoop Scalability Distributed Systems Java Agile Methodologies REST C++ Cloud Computing Large Scale Systems MySQL PHP Shell Scripting Software Development Enterprise Software Tomcat LAMP See 1+     See less Skills  Hadoop Scalability Distributed Systems Java Agile Methodologies REST C++ Cloud Computing Large Scale Systems MySQL PHP Shell Scripting Software Development Enterprise Software Tomcat LAMP See 1+     See less Hadoop Scalability Distributed Systems Java Agile Methodologies REST C++ Cloud Computing Large Scale Systems MySQL PHP Shell Scripting Software Development Enterprise Software Tomcat LAMP See 1+     See less Hadoop Scalability Distributed Systems Java Agile Methodologies REST C++ Cloud Computing Large Scale Systems MySQL PHP Shell Scripting Software Development Enterprise Software Tomcat LAMP See 1+     See less Education National Institute of Technology Karnataka BE,  Computer 1999  – 2003 National Institute of Technology Karnataka BE,  Computer 1999  – 2003 National Institute of Technology Karnataka BE,  Computer 1999  – 2003 National Institute of Technology Karnataka BE,  Computer 1999  – 2003 ", "Summary DevOps engineer with focus on Continuous Delivery, Infrastructure Provisioning, Configuration Management, and Automation for Internet-based products. Summary DevOps engineer with focus on Continuous Delivery, Infrastructure Provisioning, Configuration Management, and Automation for Internet-based products. DevOps engineer with focus on Continuous Delivery, Infrastructure Provisioning, Configuration Management, and Automation for Internet-based products. DevOps engineer with focus on Continuous Delivery, Infrastructure Provisioning, Configuration Management, and Automation for Internet-based products. Experience Service Engineering Manager Yahoo!7 January 2009  –  June 2013  (4 years 6 months) Managing a DevOps team to support online products with millions of users: \n* Service and Infrastructure Management \n* Software Delivery. \n* Designing Business Continuity and High Availability solutions. Programmer Yahoo!7 August 2008  –  December 2008  (5 months) Web development. Senior Programmer I-Net Bridge July 1999  –  June 2008  (9 years) Designing, developing, and supporting back-end processes and application services for industry leading financial information products. Programmer Liberty Life December 1997  –  June 1999  (1 year 7 months) * Programming and maintenance of messaging middleware.  \n* UNIX system administration. Service Engineering Manager Yahoo!7 January 2009  –  June 2013  (4 years 6 months) Managing a DevOps team to support online products with millions of users: \n* Service and Infrastructure Management \n* Software Delivery. \n* Designing Business Continuity and High Availability solutions. Service Engineering Manager Yahoo!7 January 2009  –  June 2013  (4 years 6 months) Managing a DevOps team to support online products with millions of users: \n* Service and Infrastructure Management \n* Software Delivery. \n* Designing Business Continuity and High Availability solutions. Programmer Yahoo!7 August 2008  –  December 2008  (5 months) Web development. Programmer Yahoo!7 August 2008  –  December 2008  (5 months) Web development. Senior Programmer I-Net Bridge July 1999  –  June 2008  (9 years) Designing, developing, and supporting back-end processes and application services for industry leading financial information products. Senior Programmer I-Net Bridge July 1999  –  June 2008  (9 years) Designing, developing, and supporting back-end processes and application services for industry leading financial information products. Programmer Liberty Life December 1997  –  June 1999  (1 year 7 months) * Programming and maintenance of messaging middleware.  \n* UNIX system administration. Programmer Liberty Life December 1997  –  June 1999  (1 year 7 months) * Programming and maintenance of messaging middleware.  \n* UNIX system administration. Languages   Skills Continuous Delivery Continuous Integration Linux Perl MySQL Web Development PostgreSQL System Administration Scalability PHP C++ REST Service Availability Release Engineering DevOps Capacity Management Release Management ITIL v3 Foundations... LAMP Business Continuity... Incident Management C/C++ STL Linux System... Python Infrastructure JavaScript CSS High Availability Software Development See 14+     See less Skills  Continuous Delivery Continuous Integration Linux Perl MySQL Web Development PostgreSQL System Administration Scalability PHP C++ REST Service Availability Release Engineering DevOps Capacity Management Release Management ITIL v3 Foundations... LAMP Business Continuity... Incident Management C/C++ STL Linux System... Python Infrastructure JavaScript CSS High Availability Software Development See 14+     See less Continuous Delivery Continuous Integration Linux Perl MySQL Web Development PostgreSQL System Administration Scalability PHP C++ REST Service Availability Release Engineering DevOps Capacity Management Release Management ITIL v3 Foundations... LAMP Business Continuity... Incident Management C/C++ STL Linux System... Python Infrastructure JavaScript CSS High Availability Software Development See 14+     See less Continuous Delivery Continuous Integration Linux Perl MySQL Web Development PostgreSQL System Administration Scalability PHP C++ REST Service Availability Release Engineering DevOps Capacity Management Release Management ITIL v3 Foundations... LAMP Business Continuity... Incident Management C/C++ STL Linux System... Python Infrastructure JavaScript CSS High Availability Software Development See 14+     See less Education University of Pretoria/Universiteit van Pretoria B.Sc.,  Computer Science 1995  – 1997 University of Pretoria/Universiteit van Pretoria B.Sc.,  Computer Science 1995  – 1997 University of Pretoria/Universiteit van Pretoria B.Sc.,  Computer Science 1995  – 1997 University of Pretoria/Universiteit van Pretoria B.Sc.,  Computer Science 1995  – 1997 ", "Summary Specialties: Linux devops Summary Specialties: Linux devops Specialties: Linux devops Specialties: Linux devops Languages   Skills Unix Linux Shell Scripting Apache Linux System... Perl Scalability Bash Distributed Systems Hadoop Python TCP/IP NFS Unix Shell Scripting Nagios IPv6 High Availability FreeBSD haproxy DevOps Open Source Red Hat Linux LAMP Docker Agile Methodologies See 10+     See less Skills  Unix Linux Shell Scripting Apache Linux System... Perl Scalability Bash Distributed Systems Hadoop Python TCP/IP NFS Unix Shell Scripting Nagios IPv6 High Availability FreeBSD haproxy DevOps Open Source Red Hat Linux LAMP Docker Agile Methodologies See 10+     See less Unix Linux Shell Scripting Apache Linux System... Perl Scalability Bash Distributed Systems Hadoop Python TCP/IP NFS Unix Shell Scripting Nagios IPv6 High Availability FreeBSD haproxy DevOps Open Source Red Hat Linux LAMP Docker Agile Methodologies See 10+     See less Unix Linux Shell Scripting Apache Linux System... Perl Scalability Bash Distributed Systems Hadoop Python TCP/IP NFS Unix Shell Scripting Nagios IPv6 High Availability FreeBSD haproxy DevOps Open Source Red Hat Linux LAMP Docker Agile Methodologies See 10+     See less Honors & Awards Smooth Operator Yahoo! October 2008 Smooth Operator, Q2 2008 - Selected from Yahoo's worldwide U Rock Yahoo September 2014 U Rock, Q1-Q2 2014, Selected among Ads and Data, Yahoo! SDC Bangalore. Yahoo Ratna Yahoo November 2014 Selected among Production Engineering, India Smooth Operator Yahoo! October 2008 Smooth Operator, Q2 2008 - Selected from Yahoo's worldwide Smooth Operator Yahoo! October 2008 Smooth Operator, Q2 2008 - Selected from Yahoo's worldwide Smooth Operator Yahoo! October 2008 Smooth Operator, Q2 2008 - Selected from Yahoo's worldwide U Rock Yahoo September 2014 U Rock, Q1-Q2 2014, Selected among Ads and Data, Yahoo! SDC Bangalore. U Rock Yahoo September 2014 U Rock, Q1-Q2 2014, Selected among Ads and Data, Yahoo! SDC Bangalore. U Rock Yahoo September 2014 U Rock, Q1-Q2 2014, Selected among Ads and Data, Yahoo! SDC Bangalore. Yahoo Ratna Yahoo November 2014 Selected among Production Engineering, India Yahoo Ratna Yahoo November 2014 Selected among Production Engineering, India Yahoo Ratna Yahoo November 2014 Selected among Production Engineering, India ", "Experience Lead, Site Reliability Engineering Yahoo June 2015  – Present (3 months) Sunnyvale, CA Manager, Site Reliability Engineering Yahoo! April 2013  – Present (2 years 5 months) Bangalore, India Communications, Mobile and Emerging Products Tech Lead, service engineering (DevOps) Yahoo April 2010  –  March 2013  (3 years) Tech Lead, Site reliability engineering Yahoo April 2008  –  March 2010  (2 years) Senior System Engineer, NOC Yahoo April 2005  –  March 2008  (3 years) System Engineer Marlabs Inc March 2004  –  March 2005  (1 year 1 month) System Consultant Linux Learning Centre November 2003  –  March 2004  (5 months) Lead, Site Reliability Engineering Yahoo June 2015  – Present (3 months) Sunnyvale, CA Lead, Site Reliability Engineering Yahoo June 2015  – Present (3 months) Sunnyvale, CA Manager, Site Reliability Engineering Yahoo! April 2013  – Present (2 years 5 months) Bangalore, India Communications, Mobile and Emerging Products Manager, Site Reliability Engineering Yahoo! April 2013  – Present (2 years 5 months) Bangalore, India Communications, Mobile and Emerging Products Tech Lead, service engineering (DevOps) Yahoo April 2010  –  March 2013  (3 years) Tech Lead, service engineering (DevOps) Yahoo April 2010  –  March 2013  (3 years) Tech Lead, Site reliability engineering Yahoo April 2008  –  March 2010  (2 years) Tech Lead, Site reliability engineering Yahoo April 2008  –  March 2010  (2 years) Senior System Engineer, NOC Yahoo April 2005  –  March 2008  (3 years) Senior System Engineer, NOC Yahoo April 2005  –  March 2008  (3 years) System Engineer Marlabs Inc March 2004  –  March 2005  (1 year 1 month) System Engineer Marlabs Inc March 2004  –  March 2005  (1 year 1 month) System Consultant Linux Learning Centre November 2003  –  March 2004  (5 months) System Consultant Linux Learning Centre November 2003  –  March 2004  (5 months) Skills Distributed Systems NoSQL High Availability RESTful WebServices ElasticSearch logstash kibana Apache Pig Hadoop MongoDB Redis Memcached MySQL JavaScript jQuery Ruby Sinatra PHP Python Perl Scalability Apache LAMP Linux System Monitoring Mail Server Shell Scripting Large Scale Systems Open Source DNS Nagios Unix Red Hat Linux Bash System Administration FreeBSD Troubleshooting Incident Management Root Cause Analysis Change Management Mentoring People Development Project Planning Operations Management Technical Leadership Technical Training See 31+     See less Skills  Distributed Systems NoSQL High Availability RESTful WebServices ElasticSearch logstash kibana Apache Pig Hadoop MongoDB Redis Memcached MySQL JavaScript jQuery Ruby Sinatra PHP Python Perl Scalability Apache LAMP Linux System Monitoring Mail Server Shell Scripting Large Scale Systems Open Source DNS Nagios Unix Red Hat Linux Bash System Administration FreeBSD Troubleshooting Incident Management Root Cause Analysis Change Management Mentoring People Development Project Planning Operations Management Technical Leadership Technical Training See 31+     See less Distributed Systems NoSQL High Availability RESTful WebServices ElasticSearch logstash kibana Apache Pig Hadoop MongoDB Redis Memcached MySQL JavaScript jQuery Ruby Sinatra PHP Python Perl Scalability Apache LAMP Linux System Monitoring Mail Server Shell Scripting Large Scale Systems Open Source DNS Nagios Unix Red Hat Linux Bash System Administration FreeBSD Troubleshooting Incident Management Root Cause Analysis Change Management Mentoring People Development Project Planning Operations Management Technical Leadership Technical Training See 31+     See less Distributed Systems NoSQL High Availability RESTful WebServices ElasticSearch logstash kibana Apache Pig Hadoop MongoDB Redis Memcached MySQL JavaScript jQuery Ruby Sinatra PHP Python Perl Scalability Apache LAMP Linux System Monitoring Mail Server Shell Scripting Large Scale Systems Open Source DNS Nagios Unix Red Hat Linux Bash System Administration FreeBSD Troubleshooting Incident Management Root Cause Analysis Change Management Mentoring People Development Project Planning Operations Management Technical Leadership Technical Training See 31+     See less Education Mahatma Gandhi University Vimalagiri ilahia Mahatma Gandhi University Mahatma Gandhi University Mahatma Gandhi University Vimalagiri Vimalagiri Vimalagiri ilahia ilahia ilahia ", "Summary * 10 years of total experience in IT industry with 8 years of experience in the Internet industry. \n* Worked as Devops/production engineer/site reliability engineer/service engineer/system administrator roles \n* Large scale production engineering experience with webhosting, e-commerce and internet email technologies. \n* Strong foundation on web technologies with high availability and failover using GSLB. \n* Experience in working with teams spread across the globe. \n* Experience in working in very dynamic and fast paced environment. \n \n*Skills & Expertise: \n \nLinux and Unix operating systems (Redhat Linux and Freebsd) \nApache web server \nPerl and shell scripting for infrastructure automation \nNagios for monitoring \nMySQL server administration \nDNS server administration with Bind \nApache Traffic Server \nHigh availability and failover with hardware and software load balancers and GSLB \nSubversion for source control management \nVarious TCP/IP protocols like HTTP,FTP,NFS,SMTP,POP3,IMAP \nTcpdump for network analysis \nAgile methodologies with scrum  \nIncident management and change management \nConfiguration Management \nGomez for site performance monitoring \n \nBasic knowledge of: \n \nAmazon Web Services (AWS) \nPuppet for configuration management \nOpenstack for IaaS \nSplunk for log analysis \nGit for source control \nHadoop for Big Data analysis \nNode.js and Apache Tomcat Summary * 10 years of total experience in IT industry with 8 years of experience in the Internet industry. \n* Worked as Devops/production engineer/site reliability engineer/service engineer/system administrator roles \n* Large scale production engineering experience with webhosting, e-commerce and internet email technologies. \n* Strong foundation on web technologies with high availability and failover using GSLB. \n* Experience in working with teams spread across the globe. \n* Experience in working in very dynamic and fast paced environment. \n \n*Skills & Expertise: \n \nLinux and Unix operating systems (Redhat Linux and Freebsd) \nApache web server \nPerl and shell scripting for infrastructure automation \nNagios for monitoring \nMySQL server administration \nDNS server administration with Bind \nApache Traffic Server \nHigh availability and failover with hardware and software load balancers and GSLB \nSubversion for source control management \nVarious TCP/IP protocols like HTTP,FTP,NFS,SMTP,POP3,IMAP \nTcpdump for network analysis \nAgile methodologies with scrum  \nIncident management and change management \nConfiguration Management \nGomez for site performance monitoring \n \nBasic knowledge of: \n \nAmazon Web Services (AWS) \nPuppet for configuration management \nOpenstack for IaaS \nSplunk for log analysis \nGit for source control \nHadoop for Big Data analysis \nNode.js and Apache Tomcat * 10 years of total experience in IT industry with 8 years of experience in the Internet industry. \n* Worked as Devops/production engineer/site reliability engineer/service engineer/system administrator roles \n* Large scale production engineering experience with webhosting, e-commerce and internet email technologies. \n* Strong foundation on web technologies with high availability and failover using GSLB. \n* Experience in working with teams spread across the globe. \n* Experience in working in very dynamic and fast paced environment. \n \n*Skills & Expertise: \n \nLinux and Unix operating systems (Redhat Linux and Freebsd) \nApache web server \nPerl and shell scripting for infrastructure automation \nNagios for monitoring \nMySQL server administration \nDNS server administration with Bind \nApache Traffic Server \nHigh availability and failover with hardware and software load balancers and GSLB \nSubversion for source control management \nVarious TCP/IP protocols like HTTP,FTP,NFS,SMTP,POP3,IMAP \nTcpdump for network analysis \nAgile methodologies with scrum  \nIncident management and change management \nConfiguration Management \nGomez for site performance monitoring \n \nBasic knowledge of: \n \nAmazon Web Services (AWS) \nPuppet for configuration management \nOpenstack for IaaS \nSplunk for log analysis \nGit for source control \nHadoop for Big Data analysis \nNode.js and Apache Tomcat * 10 years of total experience in IT industry with 8 years of experience in the Internet industry. \n* Worked as Devops/production engineer/site reliability engineer/service engineer/system administrator roles \n* Large scale production engineering experience with webhosting, e-commerce and internet email technologies. \n* Strong foundation on web technologies with high availability and failover using GSLB. \n* Experience in working with teams spread across the globe. \n* Experience in working in very dynamic and fast paced environment. \n \n*Skills & Expertise: \n \nLinux and Unix operating systems (Redhat Linux and Freebsd) \nApache web server \nPerl and shell scripting for infrastructure automation \nNagios for monitoring \nMySQL server administration \nDNS server administration with Bind \nApache Traffic Server \nHigh availability and failover with hardware and software load balancers and GSLB \nSubversion for source control management \nVarious TCP/IP protocols like HTTP,FTP,NFS,SMTP,POP3,IMAP \nTcpdump for network analysis \nAgile methodologies with scrum  \nIncident management and change management \nConfiguration Management \nGomez for site performance monitoring \n \nBasic knowledge of: \n \nAmazon Web Services (AWS) \nPuppet for configuration management \nOpenstack for IaaS \nSplunk for log analysis \nGit for source control \nHadoop for Big Data analysis \nNode.js and Apache Tomcat Experience Production Engineering/DevOps Lead for Yahoo Web Hosting Yahoo August 2012  – Present (3 years 1 month) Bangalore Responsibilities: \n* Working as a lead production engineer (Devops/site reliability engineer) for Yahoo Web Hosting under Yahoo Small Business Services umbrella \n* Ensuring zero downtime for Small Business customers which includes web hosting and e-commerce websites (Yahoo Store) and underlying ordering and provisioning platform. \n* Working closely with Developers, QA team and Product Management to launch new features and products. \n* Leading various production engineering centric projects like abuse detection and prevention for different kind of abuses including content abuse and network abuse (DDos.) \n* Configuring monitoring for different components using both property hosted (nagios) and internal cloud based monitoring system. \n* Doing configuration management for the infrastructure using internal configuration management system \n* Automating day today tasks using scripting languages like Perl and Shell scripting. \n* Load testing, H/W utilization benchmarking and capacity projections. \n* Leading data center migration projects to migrate infrastructure and application stack between data centers across the world. \n* Maintaining multiple database server clusters running MySQL which has high availability and load balancing capabilities. \n* Part of 12x7 oncall rotation to ensure site reliability. \n* Participate in all phases of the software development life cycle from specification through launch, providing hardware and systems expertise and representing operability requirements around all aspects of a product or product line. \n* Conducting postmortems to identify remediation items for outages and working on the permanent fix. \n* Conducting meetings with Customer Care management and leads to discuss outages and remediation which are being worked on. \n* Own Incident Response and change management processes and policies for the property \n* Support central security team for fixing security issues with the property. \n* Handle software deployment for the property. Senior Systems Engineer for Yahoo Web Hosting Yahoo! June 2010  –  July 2012  (2 years 2 months) Bangalore Responsibilities: \n* Ensuring zero downtime for Small Business customers which includes web hosting and e-commerce websites (Yahoo Store) and underlying ordering and provisioning platform. \n* Working closely with Developers, QA and Product Management to launch new features and products. \n* Configuring monitoring for different components using both property hosted (nagios) and internal cloud based monitoring system. \n*Doing configuration management for the infrastructure using internal configuration management system \n* Automating the day today tasks using scripting languages like Perl and Shell scripting. \n* Load testing, H/W utilisation benchmarking and capacity projections. \n* Maintaining multiple database server clusters running MySQL which has high availability and load balancing capabilities. \n* Part of 12x7 oncall rotation to ensure site reliability. \n* Support central security team for fixing security issues with the property. \n* Handle software deployment for the property. SRE for Yahoo Mail Yahoo! December 2008  –  May 2010  (1 year 6 months) Bangalore Responsibilities: \n* Site Reliability Engineering team member for one of biggest E Mail installations in the world.  \n* Triaging and resolving service / application outages for Yahoo Mail \n* Primary point of contact for any Yahoo mail related event, alerts or outages. \n* Working with Broadband partners (ATT/BT/Verizon/Rogers and TNZ) and Premium Bizmail customers to resolve outages with mail system hosted by Yahoo \n* Automation, writing scripts (Perl/Shell) for day-to-day activates and repetitive tasks. \n* Managing all Yahoo Mail servers (Linux/Unix) for performance and uptime. \n* Isolating, Identifying and performing system troubleshooting on server alerts. \n* Creating and auditing run books/knowledge base \n* Recruiting and training newer team members Operations Center Tier 2 Engineer Yahoo! July 2007  –  December 2008  (1 year 6 months) Bangalore Responsibilities: \n* Providing level 2 support for Yahoo properties like Messenger, Login Services, Media, Frontpage, Mobile and Mail \n* Doing process improvements, automation, ensuring of SLA's, analyzing and implementing various monitoring tools. \n* Incident management for the supported properties \n* Working as an integration lead for onboarding properties to Tier 2 team. \n* Helped in building 12X7 coverage for Bangalore Operations center by recruiting and training newer team members. Operations Center Tier 1 Engineer Yahoo! December 2005  –  June 2007  (1 year 7 months) Responsibilities: \n* Monitoring and managing the Systems, Storage and Network Infrastructure of Yahoo! Production Environment globally. \n* Ensuring high availability and reliability for production serving systems \n* Executing & debugging first & second level diagnostics and troubleshooting on Unix OS/Application and Network across multiple data centers. \n* Incident management for whole of Yahoo \n* Process improvements, automation, ensuring of SLA's, analyzing and implementing various monitoring tools. \n* Recruiting and training newer team members Sys Admin e4e May 2004  –  November 2005  (1 year 7 months) Managing systems in Linux environment. Production Engineering/DevOps Lead for Yahoo Web Hosting Yahoo August 2012  – Present (3 years 1 month) Bangalore Responsibilities: \n* Working as a lead production engineer (Devops/site reliability engineer) for Yahoo Web Hosting under Yahoo Small Business Services umbrella \n* Ensuring zero downtime for Small Business customers which includes web hosting and e-commerce websites (Yahoo Store) and underlying ordering and provisioning platform. \n* Working closely with Developers, QA team and Product Management to launch new features and products. \n* Leading various production engineering centric projects like abuse detection and prevention for different kind of abuses including content abuse and network abuse (DDos.) \n* Configuring monitoring for different components using both property hosted (nagios) and internal cloud based monitoring system. \n* Doing configuration management for the infrastructure using internal configuration management system \n* Automating day today tasks using scripting languages like Perl and Shell scripting. \n* Load testing, H/W utilization benchmarking and capacity projections. \n* Leading data center migration projects to migrate infrastructure and application stack between data centers across the world. \n* Maintaining multiple database server clusters running MySQL which has high availability and load balancing capabilities. \n* Part of 12x7 oncall rotation to ensure site reliability. \n* Participate in all phases of the software development life cycle from specification through launch, providing hardware and systems expertise and representing operability requirements around all aspects of a product or product line. \n* Conducting postmortems to identify remediation items for outages and working on the permanent fix. \n* Conducting meetings with Customer Care management and leads to discuss outages and remediation which are being worked on. \n* Own Incident Response and change management processes and policies for the property \n* Support central security team for fixing security issues with the property. \n* Handle software deployment for the property. Production Engineering/DevOps Lead for Yahoo Web Hosting Yahoo August 2012  – Present (3 years 1 month) Bangalore Responsibilities: \n* Working as a lead production engineer (Devops/site reliability engineer) for Yahoo Web Hosting under Yahoo Small Business Services umbrella \n* Ensuring zero downtime for Small Business customers which includes web hosting and e-commerce websites (Yahoo Store) and underlying ordering and provisioning platform. \n* Working closely with Developers, QA team and Product Management to launch new features and products. \n* Leading various production engineering centric projects like abuse detection and prevention for different kind of abuses including content abuse and network abuse (DDos.) \n* Configuring monitoring for different components using both property hosted (nagios) and internal cloud based monitoring system. \n* Doing configuration management for the infrastructure using internal configuration management system \n* Automating day today tasks using scripting languages like Perl and Shell scripting. \n* Load testing, H/W utilization benchmarking and capacity projections. \n* Leading data center migration projects to migrate infrastructure and application stack between data centers across the world. \n* Maintaining multiple database server clusters running MySQL which has high availability and load balancing capabilities. \n* Part of 12x7 oncall rotation to ensure site reliability. \n* Participate in all phases of the software development life cycle from specification through launch, providing hardware and systems expertise and representing operability requirements around all aspects of a product or product line. \n* Conducting postmortems to identify remediation items for outages and working on the permanent fix. \n* Conducting meetings with Customer Care management and leads to discuss outages and remediation which are being worked on. \n* Own Incident Response and change management processes and policies for the property \n* Support central security team for fixing security issues with the property. \n* Handle software deployment for the property. Senior Systems Engineer for Yahoo Web Hosting Yahoo! June 2010  –  July 2012  (2 years 2 months) Bangalore Responsibilities: \n* Ensuring zero downtime for Small Business customers which includes web hosting and e-commerce websites (Yahoo Store) and underlying ordering and provisioning platform. \n* Working closely with Developers, QA and Product Management to launch new features and products. \n* Configuring monitoring for different components using both property hosted (nagios) and internal cloud based monitoring system. \n*Doing configuration management for the infrastructure using internal configuration management system \n* Automating the day today tasks using scripting languages like Perl and Shell scripting. \n* Load testing, H/W utilisation benchmarking and capacity projections. \n* Maintaining multiple database server clusters running MySQL which has high availability and load balancing capabilities. \n* Part of 12x7 oncall rotation to ensure site reliability. \n* Support central security team for fixing security issues with the property. \n* Handle software deployment for the property. Senior Systems Engineer for Yahoo Web Hosting Yahoo! June 2010  –  July 2012  (2 years 2 months) Bangalore Responsibilities: \n* Ensuring zero downtime for Small Business customers which includes web hosting and e-commerce websites (Yahoo Store) and underlying ordering and provisioning platform. \n* Working closely with Developers, QA and Product Management to launch new features and products. \n* Configuring monitoring for different components using both property hosted (nagios) and internal cloud based monitoring system. \n*Doing configuration management for the infrastructure using internal configuration management system \n* Automating the day today tasks using scripting languages like Perl and Shell scripting. \n* Load testing, H/W utilisation benchmarking and capacity projections. \n* Maintaining multiple database server clusters running MySQL which has high availability and load balancing capabilities. \n* Part of 12x7 oncall rotation to ensure site reliability. \n* Support central security team for fixing security issues with the property. \n* Handle software deployment for the property. SRE for Yahoo Mail Yahoo! December 2008  –  May 2010  (1 year 6 months) Bangalore Responsibilities: \n* Site Reliability Engineering team member for one of biggest E Mail installations in the world.  \n* Triaging and resolving service / application outages for Yahoo Mail \n* Primary point of contact for any Yahoo mail related event, alerts or outages. \n* Working with Broadband partners (ATT/BT/Verizon/Rogers and TNZ) and Premium Bizmail customers to resolve outages with mail system hosted by Yahoo \n* Automation, writing scripts (Perl/Shell) for day-to-day activates and repetitive tasks. \n* Managing all Yahoo Mail servers (Linux/Unix) for performance and uptime. \n* Isolating, Identifying and performing system troubleshooting on server alerts. \n* Creating and auditing run books/knowledge base \n* Recruiting and training newer team members SRE for Yahoo Mail Yahoo! December 2008  –  May 2010  (1 year 6 months) Bangalore Responsibilities: \n* Site Reliability Engineering team member for one of biggest E Mail installations in the world.  \n* Triaging and resolving service / application outages for Yahoo Mail \n* Primary point of contact for any Yahoo mail related event, alerts or outages. \n* Working with Broadband partners (ATT/BT/Verizon/Rogers and TNZ) and Premium Bizmail customers to resolve outages with mail system hosted by Yahoo \n* Automation, writing scripts (Perl/Shell) for day-to-day activates and repetitive tasks. \n* Managing all Yahoo Mail servers (Linux/Unix) for performance and uptime. \n* Isolating, Identifying and performing system troubleshooting on server alerts. \n* Creating and auditing run books/knowledge base \n* Recruiting and training newer team members Operations Center Tier 2 Engineer Yahoo! July 2007  –  December 2008  (1 year 6 months) Bangalore Responsibilities: \n* Providing level 2 support for Yahoo properties like Messenger, Login Services, Media, Frontpage, Mobile and Mail \n* Doing process improvements, automation, ensuring of SLA's, analyzing and implementing various monitoring tools. \n* Incident management for the supported properties \n* Working as an integration lead for onboarding properties to Tier 2 team. \n* Helped in building 12X7 coverage for Bangalore Operations center by recruiting and training newer team members. Operations Center Tier 2 Engineer Yahoo! July 2007  –  December 2008  (1 year 6 months) Bangalore Responsibilities: \n* Providing level 2 support for Yahoo properties like Messenger, Login Services, Media, Frontpage, Mobile and Mail \n* Doing process improvements, automation, ensuring of SLA's, analyzing and implementing various monitoring tools. \n* Incident management for the supported properties \n* Working as an integration lead for onboarding properties to Tier 2 team. \n* Helped in building 12X7 coverage for Bangalore Operations center by recruiting and training newer team members. Operations Center Tier 1 Engineer Yahoo! December 2005  –  June 2007  (1 year 7 months) Responsibilities: \n* Monitoring and managing the Systems, Storage and Network Infrastructure of Yahoo! Production Environment globally. \n* Ensuring high availability and reliability for production serving systems \n* Executing & debugging first & second level diagnostics and troubleshooting on Unix OS/Application and Network across multiple data centers. \n* Incident management for whole of Yahoo \n* Process improvements, automation, ensuring of SLA's, analyzing and implementing various monitoring tools. \n* Recruiting and training newer team members Operations Center Tier 1 Engineer Yahoo! December 2005  –  June 2007  (1 year 7 months) Responsibilities: \n* Monitoring and managing the Systems, Storage and Network Infrastructure of Yahoo! Production Environment globally. \n* Ensuring high availability and reliability for production serving systems \n* Executing & debugging first & second level diagnostics and troubleshooting on Unix OS/Application and Network across multiple data centers. \n* Incident management for whole of Yahoo \n* Process improvements, automation, ensuring of SLA's, analyzing and implementing various monitoring tools. \n* Recruiting and training newer team members Sys Admin e4e May 2004  –  November 2005  (1 year 7 months) Managing systems in Linux environment. Sys Admin e4e May 2004  –  November 2005  (1 year 7 months) Managing systems in Linux environment. Skills Apache Shell Scripting Perl Red Hat Linux Unix Nagios NFS Unix Shell Scripting Linux System... Scalability CCNA SSL Linux RHCE MySQL FreeBSD Bash High Availability DNS Web Hosting E-commerce TCP/IP Agile Methodologies Incident Management DevOps Subversion Git Scrum Splunk Amazon Web Services... Puppet Load Balancing Cloud Computing Distributed Systems See 19+     See less Skills  Apache Shell Scripting Perl Red Hat Linux Unix Nagios NFS Unix Shell Scripting Linux System... Scalability CCNA SSL Linux RHCE MySQL FreeBSD Bash High Availability DNS Web Hosting E-commerce TCP/IP Agile Methodologies Incident Management DevOps Subversion Git Scrum Splunk Amazon Web Services... Puppet Load Balancing Cloud Computing Distributed Systems See 19+     See less Apache Shell Scripting Perl Red Hat Linux Unix Nagios NFS Unix Shell Scripting Linux System... Scalability CCNA SSL Linux RHCE MySQL FreeBSD Bash High Availability DNS Web Hosting E-commerce TCP/IP Agile Methodologies Incident Management DevOps Subversion Git Scrum Splunk Amazon Web Services... Puppet Load Balancing Cloud Computing Distributed Systems See 19+     See less Apache Shell Scripting Perl Red Hat Linux Unix Nagios NFS Unix Shell Scripting Linux System... Scalability CCNA SSL Linux RHCE MySQL FreeBSD Bash High Availability DNS Web Hosting E-commerce TCP/IP Agile Methodologies Incident Management DevOps Subversion Git Scrum Splunk Amazon Web Services... Puppet Load Balancing Cloud Computing Distributed Systems See 19+     See less Education SM University MCA,  Masters in Computer Applications , 71 Nettur Technical Training Foundation Computer Engineering , 83 University of Calicut Pre Degree,  Science , 76 KPC HS, Pattanur SSLC , 93 SM University MCA,  Masters in Computer Applications , 71 SM University MCA,  Masters in Computer Applications , 71 SM University MCA,  Masters in Computer Applications , 71 Nettur Technical Training Foundation Computer Engineering , 83 Nettur Technical Training Foundation Computer Engineering , 83 Nettur Technical Training Foundation Computer Engineering , 83 University of Calicut Pre Degree,  Science , 76 University of Calicut Pre Degree,  Science , 76 University of Calicut Pre Degree,  Science , 76 KPC HS, Pattanur SSLC , 93 KPC HS, Pattanur SSLC , 93 KPC HS, Pattanur SSLC , 93 ", "Summary Beno is a customer-focused, product-driven technology leader with a record of successfully managing large projects across multiple teams. Beno manages international DevOps teams, Operations teams, Professional Services teams and Customer Care teams. He treats production environments and the services he manages as iterative products regularly looking for areas to improve and adjust to customer needs. Summary Beno is a customer-focused, product-driven technology leader with a record of successfully managing large projects across multiple teams. Beno manages international DevOps teams, Operations teams, Professional Services teams and Customer Care teams. He treats production environments and the services he manages as iterative products regularly looking for areas to improve and adjust to customer needs. Beno is a customer-focused, product-driven technology leader with a record of successfully managing large projects across multiple teams. Beno manages international DevOps teams, Operations teams, Professional Services teams and Customer Care teams. He treats production environments and the services he manages as iterative products regularly looking for areas to improve and adjust to customer needs. Beno is a customer-focused, product-driven technology leader with a record of successfully managing large projects across multiple teams. Beno manages international DevOps teams, Operations teams, Professional Services teams and Customer Care teams. He treats production environments and the services he manages as iterative products regularly looking for areas to improve and adjust to customer needs. Experience Sr. Manager - Yahoo Media, Content Licensing and Video Platform Yahoo! March 2013  – Present (2 years 6 months) Greater Boston Area Direct the international Video DevOps team, the Video Professional Services team and, the Live Video Operations team for Yahoo. Responsible for all of Yahoo’s Video services including the Video CDN, Video Transcoding, Yahoo Player that contribute to millions in revenue and more than 2,000 high-performance systems with strict uptimes (99.99), delivering up to 1.2Tb/sec. Contribute to Video strategy by driving execution across five or more Business Units. Manage vendor relations. Manage CAPEX/OPEX budgeting and iterative Capacity planning  \n \n• Managed a 1025% Growth of live video events while maintaining 99.9% uptime across Video systems. \n• Maintained staff attrition of < 2% (9% company average) while managing up to 23 team members.  \n• Drafted Yahoo’s global operability guidelines that are the minimum bar of operability every Yahoo product must meet for production acceptance as a member of a small cross-functional team. \n• Increased Video transcoding capacity 10x and content storage 4x within two weeks (75% faster than co. average deploy time.) resulting in a successful Flickr May Day launch by leveraging relationships across Yahoo and direct team management. \n• Directed more than 70% of Yahoo’s platform services to successful Business Continuity Certifications. \n• Managed 2012 Olympic Games Video preparation for Yahoo by directing a multi-level matrix org. \n• Automated 100% of remediation for the Video Platform through Chef recipe project Sr. Manager, Yahoo!, Content Platforms - Video and Grid Yahoo! July 2011  –  March 2013  (1 year 9 months) Greater Boston Area Manage international Video DevOps and the Hadoop Grid Data Loading team. Manage simultaneous large scale, production projects. Manage Yahoo Video CAPEX/OPEX and contribute to Yahoo Hadoop CAPEX/OPEX. Coach international team of individual contributors.  \n•\tReduced OpEx $1mm/yr by converting Microsoft host to Linux \n•\tManaged 9Pb of daily data transfer with zero data loss. \n•\tChaired the Platform Data Services (PDS) Tech Leads a cross-team group of Tech Leads and Architects in the PDS Business Unit \n•\tMember of Yahoo’s Edge Steering Committee that is responsible for Yahoo’s Edge Operation Strategy \n•\tManaged a 50% YoY growth in Live Video events while maintaining 99.99% uptime. \n•\tMigrated 100% of production infrastructure through Yahoo’s Rewire project, a company-wide effort to consolidate into new Yahoo O&O Datacenters. Sr. Manager, Yahoo! Video Platform Yahoo! March 2009  –  October 2011  (2 years 8 months) Greater Boston Area Manage the international DevOps team responsible for all video at Yahoo. Oversee capacity expansion. Oversee CAPEX and OPEX planning. Foster staff of directs and provide mentoring for others. Work with Sr. and Executive leadership planning large Events.  \n \n• Doubled capacity of Yahoo Video services in two weeks preparing for the Royal Wedding broadcast \n• Managed 2010 Olympic Games Video preparation for Yahoo by directing a multi-level matrix org. \n Sr. Operations Manager Maven Networks July 2008  –  March 2009  (9 months) Greater Boston Area Direct Operations liaison for clients including, Virgin Media, Turner Networks, NewsCorp, and HBO. Provide architectural input on customized client solutions. Improve and maintain custom client integrations with the Maven Stack. Responsible for production, and pre-production environments. Operations Liaison between Professional Services team, in-house Devel teams, and off-shore Devel contractors.  \n•Managed Maven’s Operations Environment, ensuring $2mm in revenue \n•Migrated 100% of clients from legacy stack to next-gen stack in one quarter, managed a small matrix team performing nightly migrations for 12 weeks. \n•Managed Maven’s pre-production and integration environments enabling Fortune 500 clientele testing. \n Sr. Systems Engineer Gotuit Media May 2007  –  May 2008  (1 year 1 month) Greater Boston Area • Maintained, administered, secured mid-frame and desktop/mobile computers, networking hardware/infrastructure and software solutions a the primary information technology support person supporting up to 24 servers and up to 24 end users. \n• Managed multiple simultaneously evolving technology related projects to completion. \n• Served as primary support person for Gotuit Media Corporation supporting users onsite and offsite. Products supported included Windows operating systems; Linux/Unix based operating systems, Macintosh operating systems, Blackberry handheld devices and related end user applications. \n• Managed Microsoft Active Directory infrastructure, Exchange Email System, and DNS system for Gotuit Media Corporation improving reliability, security and functionality. \n System Adminstrator WGBH Educational Foundation December 1999  –  May 2007  (7 years 6 months) Greater Boston Area • Maintained, administered, secured enterprise class, mid-frame and desktop/mobile level computers, networking hardware and software solutions as a member of a four person team working with up to 80 servers and up to 1200 end users \n• Managed/designed backup, and business continuity strategies. \n• Sought means to utilize and/or improve computing and networking infrastructure to support foundation-wide computing needs. \n Account Executive eContacts October 1998  –  December 1999  (1 year 3 months) Greater Boston Area Customer liaison for key clients.  \nSupport sales staff providing research and sales engineering services \nProvide technical support and support for in-house and Dublin based staff. Sr. Manager - Yahoo Media, Content Licensing and Video Platform Yahoo! March 2013  – Present (2 years 6 months) Greater Boston Area Direct the international Video DevOps team, the Video Professional Services team and, the Live Video Operations team for Yahoo. Responsible for all of Yahoo’s Video services including the Video CDN, Video Transcoding, Yahoo Player that contribute to millions in revenue and more than 2,000 high-performance systems with strict uptimes (99.99), delivering up to 1.2Tb/sec. Contribute to Video strategy by driving execution across five or more Business Units. Manage vendor relations. Manage CAPEX/OPEX budgeting and iterative Capacity planning  \n \n• Managed a 1025% Growth of live video events while maintaining 99.9% uptime across Video systems. \n• Maintained staff attrition of < 2% (9% company average) while managing up to 23 team members.  \n• Drafted Yahoo’s global operability guidelines that are the minimum bar of operability every Yahoo product must meet for production acceptance as a member of a small cross-functional team. \n• Increased Video transcoding capacity 10x and content storage 4x within two weeks (75% faster than co. average deploy time.) resulting in a successful Flickr May Day launch by leveraging relationships across Yahoo and direct team management. \n• Directed more than 70% of Yahoo’s platform services to successful Business Continuity Certifications. \n• Managed 2012 Olympic Games Video preparation for Yahoo by directing a multi-level matrix org. \n• Automated 100% of remediation for the Video Platform through Chef recipe project Sr. Manager - Yahoo Media, Content Licensing and Video Platform Yahoo! March 2013  – Present (2 years 6 months) Greater Boston Area Direct the international Video DevOps team, the Video Professional Services team and, the Live Video Operations team for Yahoo. Responsible for all of Yahoo’s Video services including the Video CDN, Video Transcoding, Yahoo Player that contribute to millions in revenue and more than 2,000 high-performance systems with strict uptimes (99.99), delivering up to 1.2Tb/sec. Contribute to Video strategy by driving execution across five or more Business Units. Manage vendor relations. Manage CAPEX/OPEX budgeting and iterative Capacity planning  \n \n• Managed a 1025% Growth of live video events while maintaining 99.9% uptime across Video systems. \n• Maintained staff attrition of < 2% (9% company average) while managing up to 23 team members.  \n• Drafted Yahoo’s global operability guidelines that are the minimum bar of operability every Yahoo product must meet for production acceptance as a member of a small cross-functional team. \n• Increased Video transcoding capacity 10x and content storage 4x within two weeks (75% faster than co. average deploy time.) resulting in a successful Flickr May Day launch by leveraging relationships across Yahoo and direct team management. \n• Directed more than 70% of Yahoo’s platform services to successful Business Continuity Certifications. \n• Managed 2012 Olympic Games Video preparation for Yahoo by directing a multi-level matrix org. \n• Automated 100% of remediation for the Video Platform through Chef recipe project Sr. Manager, Yahoo!, Content Platforms - Video and Grid Yahoo! July 2011  –  March 2013  (1 year 9 months) Greater Boston Area Manage international Video DevOps and the Hadoop Grid Data Loading team. Manage simultaneous large scale, production projects. Manage Yahoo Video CAPEX/OPEX and contribute to Yahoo Hadoop CAPEX/OPEX. Coach international team of individual contributors.  \n•\tReduced OpEx $1mm/yr by converting Microsoft host to Linux \n•\tManaged 9Pb of daily data transfer with zero data loss. \n•\tChaired the Platform Data Services (PDS) Tech Leads a cross-team group of Tech Leads and Architects in the PDS Business Unit \n•\tMember of Yahoo’s Edge Steering Committee that is responsible for Yahoo’s Edge Operation Strategy \n•\tManaged a 50% YoY growth in Live Video events while maintaining 99.99% uptime. \n•\tMigrated 100% of production infrastructure through Yahoo’s Rewire project, a company-wide effort to consolidate into new Yahoo O&O Datacenters. Sr. Manager, Yahoo!, Content Platforms - Video and Grid Yahoo! July 2011  –  March 2013  (1 year 9 months) Greater Boston Area Manage international Video DevOps and the Hadoop Grid Data Loading team. Manage simultaneous large scale, production projects. Manage Yahoo Video CAPEX/OPEX and contribute to Yahoo Hadoop CAPEX/OPEX. Coach international team of individual contributors.  \n•\tReduced OpEx $1mm/yr by converting Microsoft host to Linux \n•\tManaged 9Pb of daily data transfer with zero data loss. \n•\tChaired the Platform Data Services (PDS) Tech Leads a cross-team group of Tech Leads and Architects in the PDS Business Unit \n•\tMember of Yahoo’s Edge Steering Committee that is responsible for Yahoo’s Edge Operation Strategy \n•\tManaged a 50% YoY growth in Live Video events while maintaining 99.99% uptime. \n•\tMigrated 100% of production infrastructure through Yahoo’s Rewire project, a company-wide effort to consolidate into new Yahoo O&O Datacenters. Sr. Manager, Yahoo! Video Platform Yahoo! March 2009  –  October 2011  (2 years 8 months) Greater Boston Area Manage the international DevOps team responsible for all video at Yahoo. Oversee capacity expansion. Oversee CAPEX and OPEX planning. Foster staff of directs and provide mentoring for others. Work with Sr. and Executive leadership planning large Events.  \n \n• Doubled capacity of Yahoo Video services in two weeks preparing for the Royal Wedding broadcast \n• Managed 2010 Olympic Games Video preparation for Yahoo by directing a multi-level matrix org. \n Sr. Manager, Yahoo! Video Platform Yahoo! March 2009  –  October 2011  (2 years 8 months) Greater Boston Area Manage the international DevOps team responsible for all video at Yahoo. Oversee capacity expansion. Oversee CAPEX and OPEX planning. Foster staff of directs and provide mentoring for others. Work with Sr. and Executive leadership planning large Events.  \n \n• Doubled capacity of Yahoo Video services in two weeks preparing for the Royal Wedding broadcast \n• Managed 2010 Olympic Games Video preparation for Yahoo by directing a multi-level matrix org. \n Sr. Operations Manager Maven Networks July 2008  –  March 2009  (9 months) Greater Boston Area Direct Operations liaison for clients including, Virgin Media, Turner Networks, NewsCorp, and HBO. Provide architectural input on customized client solutions. Improve and maintain custom client integrations with the Maven Stack. Responsible for production, and pre-production environments. Operations Liaison between Professional Services team, in-house Devel teams, and off-shore Devel contractors.  \n•Managed Maven’s Operations Environment, ensuring $2mm in revenue \n•Migrated 100% of clients from legacy stack to next-gen stack in one quarter, managed a small matrix team performing nightly migrations for 12 weeks. \n•Managed Maven’s pre-production and integration environments enabling Fortune 500 clientele testing. \n Sr. Operations Manager Maven Networks July 2008  –  March 2009  (9 months) Greater Boston Area Direct Operations liaison for clients including, Virgin Media, Turner Networks, NewsCorp, and HBO. Provide architectural input on customized client solutions. Improve and maintain custom client integrations with the Maven Stack. Responsible for production, and pre-production environments. Operations Liaison between Professional Services team, in-house Devel teams, and off-shore Devel contractors.  \n•Managed Maven’s Operations Environment, ensuring $2mm in revenue \n•Migrated 100% of clients from legacy stack to next-gen stack in one quarter, managed a small matrix team performing nightly migrations for 12 weeks. \n•Managed Maven’s pre-production and integration environments enabling Fortune 500 clientele testing. \n Sr. Systems Engineer Gotuit Media May 2007  –  May 2008  (1 year 1 month) Greater Boston Area • Maintained, administered, secured mid-frame and desktop/mobile computers, networking hardware/infrastructure and software solutions a the primary information technology support person supporting up to 24 servers and up to 24 end users. \n• Managed multiple simultaneously evolving technology related projects to completion. \n• Served as primary support person for Gotuit Media Corporation supporting users onsite and offsite. Products supported included Windows operating systems; Linux/Unix based operating systems, Macintosh operating systems, Blackberry handheld devices and related end user applications. \n• Managed Microsoft Active Directory infrastructure, Exchange Email System, and DNS system for Gotuit Media Corporation improving reliability, security and functionality. \n Sr. Systems Engineer Gotuit Media May 2007  –  May 2008  (1 year 1 month) Greater Boston Area • Maintained, administered, secured mid-frame and desktop/mobile computers, networking hardware/infrastructure and software solutions a the primary information technology support person supporting up to 24 servers and up to 24 end users. \n• Managed multiple simultaneously evolving technology related projects to completion. \n• Served as primary support person for Gotuit Media Corporation supporting users onsite and offsite. Products supported included Windows operating systems; Linux/Unix based operating systems, Macintosh operating systems, Blackberry handheld devices and related end user applications. \n• Managed Microsoft Active Directory infrastructure, Exchange Email System, and DNS system for Gotuit Media Corporation improving reliability, security and functionality. \n System Adminstrator WGBH Educational Foundation December 1999  –  May 2007  (7 years 6 months) Greater Boston Area • Maintained, administered, secured enterprise class, mid-frame and desktop/mobile level computers, networking hardware and software solutions as a member of a four person team working with up to 80 servers and up to 1200 end users \n• Managed/designed backup, and business continuity strategies. \n• Sought means to utilize and/or improve computing and networking infrastructure to support foundation-wide computing needs. \n System Adminstrator WGBH Educational Foundation December 1999  –  May 2007  (7 years 6 months) Greater Boston Area • Maintained, administered, secured enterprise class, mid-frame and desktop/mobile level computers, networking hardware and software solutions as a member of a four person team working with up to 80 servers and up to 1200 end users \n• Managed/designed backup, and business continuity strategies. \n• Sought means to utilize and/or improve computing and networking infrastructure to support foundation-wide computing needs. \n Account Executive eContacts October 1998  –  December 1999  (1 year 3 months) Greater Boston Area Customer liaison for key clients.  \nSupport sales staff providing research and sales engineering services \nProvide technical support and support for in-house and Dublin based staff. Account Executive eContacts October 1998  –  December 1999  (1 year 3 months) Greater Boston Area Customer liaison for key clients.  \nSupport sales staff providing research and sales engineering services \nProvide technical support and support for in-house and Dublin based staff. Languages English English English Skills MySQL Video Linux Digital Media Strategic Planning Team Leadership Cloud Computing Streaming Media Scalability Hadoop Apache Strategic Partnerships Big Data Collaboration Management Operations Management Large Scale Events Product Management Quality Assurance Distributed Systems Mobile Applications Agile Methodologies Mobile Technology Monetization Networking Scrum Strategy REST Unix User Experience Web Analytics SaaS Web Applications Start-ups Open Source Software Development Online Advertising System Architecture Web Video Troubleshooting Perl Leadership Cross-functional Team... See 28+     See less Skills  MySQL Video Linux Digital Media Strategic Planning Team Leadership Cloud Computing Streaming Media Scalability Hadoop Apache Strategic Partnerships Big Data Collaboration Management Operations Management Large Scale Events Product Management Quality Assurance Distributed Systems Mobile Applications Agile Methodologies Mobile Technology Monetization Networking Scrum Strategy REST Unix User Experience Web Analytics SaaS Web Applications Start-ups Open Source Software Development Online Advertising System Architecture Web Video Troubleshooting Perl Leadership Cross-functional Team... See 28+     See less MySQL Video Linux Digital Media Strategic Planning Team Leadership Cloud Computing Streaming Media Scalability Hadoop Apache Strategic Partnerships Big Data Collaboration Management Operations Management Large Scale Events Product Management Quality Assurance Distributed Systems Mobile Applications Agile Methodologies Mobile Technology Monetization Networking Scrum Strategy REST Unix User Experience Web Analytics SaaS Web Applications Start-ups Open Source Software Development Online Advertising System Architecture Web Video Troubleshooting Perl Leadership Cross-functional Team... See 28+     See less MySQL Video Linux Digital Media Strategic Planning Team Leadership Cloud Computing Streaming Media Scalability Hadoop Apache Strategic Partnerships Big Data Collaboration Management Operations Management Large Scale Events Product Management Quality Assurance Distributed Systems Mobile Applications Agile Methodologies Mobile Technology Monetization Networking Scrum Strategy REST Unix User Experience Web Analytics SaaS Web Applications Start-ups Open Source Software Development Online Advertising System Architecture Web Video Troubleshooting Perl Leadership Cross-functional Team... See 28+     See less Honors & Awards Yahoo Superstar Award Yahoo Superstar Award Yahoo Superstar Award Yahoo Superstar Award ", "Summary - Currently working for Yahoo Software Development Centre as Technical Lead handling end-to-end operations for various hosted websites. \n- 9+ yrs of professional work experience. \n- Experience in E-commerce and Financial domain. \n- Experience in interacting with Business/Technology groups analyzing business \nneeds. \n- Real time experience by working in coordination with Goldman Sachs Operations team in Tokyo and also with offshore team. \n- Knowledge and administration of FIX protocol \n- Production support for various hosted Websites/Properties \n- L3 Escalation point for Production issues. \n- BCP and High availability (LB/VIP) technologies \n- Continuous Integration setup and release management \n- Incident management \n- Capacity and performance analysis \n- Site up and on call support \n- Implementing website specific monitoring and enhancements \n- Application and system call tracing \n- Team mentoring and knowledge transfer \n- Open Source OS Technologies (Red Hat, Ubuntu, CentOS, Fedora) \n- Linux system/application administration \n- Unix Internals \n- Python and shell scripting for automation \n- Planning and Design of web technologies (Akamai, DNS, Load balancer, Apache Performance tuning/Scaling). \n- Caching (Squid/Apache Traffic Server/memcached) \n- Database Technologies- MySQL \n- NoSQL databases- Mongo DB \n- Deployment tools- Jenkins, Hudson \n- Troubleshooting OS performance issues \n- Distributed Computing- Hadoop implementation and management \n- Virtualization technologies - VMware \n- Kanban implementation across technical teams using kanbanize tool \n- Cloud implementation technologies - Amazon Web Services, Open Stack \n- Docker deployment and maintained isolated application stack Summary - Currently working for Yahoo Software Development Centre as Technical Lead handling end-to-end operations for various hosted websites. \n- 9+ yrs of professional work experience. \n- Experience in E-commerce and Financial domain. \n- Experience in interacting with Business/Technology groups analyzing business \nneeds. \n- Real time experience by working in coordination with Goldman Sachs Operations team in Tokyo and also with offshore team. \n- Knowledge and administration of FIX protocol \n- Production support for various hosted Websites/Properties \n- L3 Escalation point for Production issues. \n- BCP and High availability (LB/VIP) technologies \n- Continuous Integration setup and release management \n- Incident management \n- Capacity and performance analysis \n- Site up and on call support \n- Implementing website specific monitoring and enhancements \n- Application and system call tracing \n- Team mentoring and knowledge transfer \n- Open Source OS Technologies (Red Hat, Ubuntu, CentOS, Fedora) \n- Linux system/application administration \n- Unix Internals \n- Python and shell scripting for automation \n- Planning and Design of web technologies (Akamai, DNS, Load balancer, Apache Performance tuning/Scaling). \n- Caching (Squid/Apache Traffic Server/memcached) \n- Database Technologies- MySQL \n- NoSQL databases- Mongo DB \n- Deployment tools- Jenkins, Hudson \n- Troubleshooting OS performance issues \n- Distributed Computing- Hadoop implementation and management \n- Virtualization technologies - VMware \n- Kanban implementation across technical teams using kanbanize tool \n- Cloud implementation technologies - Amazon Web Services, Open Stack \n- Docker deployment and maintained isolated application stack - Currently working for Yahoo Software Development Centre as Technical Lead handling end-to-end operations for various hosted websites. \n- 9+ yrs of professional work experience. \n- Experience in E-commerce and Financial domain. \n- Experience in interacting with Business/Technology groups analyzing business \nneeds. \n- Real time experience by working in coordination with Goldman Sachs Operations team in Tokyo and also with offshore team. \n- Knowledge and administration of FIX protocol \n- Production support for various hosted Websites/Properties \n- L3 Escalation point for Production issues. \n- BCP and High availability (LB/VIP) technologies \n- Continuous Integration setup and release management \n- Incident management \n- Capacity and performance analysis \n- Site up and on call support \n- Implementing website specific monitoring and enhancements \n- Application and system call tracing \n- Team mentoring and knowledge transfer \n- Open Source OS Technologies (Red Hat, Ubuntu, CentOS, Fedora) \n- Linux system/application administration \n- Unix Internals \n- Python and shell scripting for automation \n- Planning and Design of web technologies (Akamai, DNS, Load balancer, Apache Performance tuning/Scaling). \n- Caching (Squid/Apache Traffic Server/memcached) \n- Database Technologies- MySQL \n- NoSQL databases- Mongo DB \n- Deployment tools- Jenkins, Hudson \n- Troubleshooting OS performance issues \n- Distributed Computing- Hadoop implementation and management \n- Virtualization technologies - VMware \n- Kanban implementation across technical teams using kanbanize tool \n- Cloud implementation technologies - Amazon Web Services, Open Stack \n- Docker deployment and maintained isolated application stack - Currently working for Yahoo Software Development Centre as Technical Lead handling end-to-end operations for various hosted websites. \n- 9+ yrs of professional work experience. \n- Experience in E-commerce and Financial domain. \n- Experience in interacting with Business/Technology groups analyzing business \nneeds. \n- Real time experience by working in coordination with Goldman Sachs Operations team in Tokyo and also with offshore team. \n- Knowledge and administration of FIX protocol \n- Production support for various hosted Websites/Properties \n- L3 Escalation point for Production issues. \n- BCP and High availability (LB/VIP) technologies \n- Continuous Integration setup and release management \n- Incident management \n- Capacity and performance analysis \n- Site up and on call support \n- Implementing website specific monitoring and enhancements \n- Application and system call tracing \n- Team mentoring and knowledge transfer \n- Open Source OS Technologies (Red Hat, Ubuntu, CentOS, Fedora) \n- Linux system/application administration \n- Unix Internals \n- Python and shell scripting for automation \n- Planning and Design of web technologies (Akamai, DNS, Load balancer, Apache Performance tuning/Scaling). \n- Caching (Squid/Apache Traffic Server/memcached) \n- Database Technologies- MySQL \n- NoSQL databases- Mongo DB \n- Deployment tools- Jenkins, Hudson \n- Troubleshooting OS performance issues \n- Distributed Computing- Hadoop implementation and management \n- Virtualization technologies - VMware \n- Kanban implementation across technical teams using kanbanize tool \n- Cloud implementation technologies - Amazon Web Services, Open Stack \n- Docker deployment and maintained isolated application stack Experience Technical Lead - Search and E-commerce, Yahoo! Shopping Yahoo March 2014  – Present (1 year 6 months) As Technical Lead, managing end-to-end technical/DevOps Operations under Service Engineering for various hosted Search properties/websites. Technical Lead - Media Yahoo June 2013  –  March 2014  (10 months) As Technical Lead, managing end-to-end technical/DevOps operations under Service Engineering for various hosted media properties/websites. Technical Lead - Listings and Marketplace (E-commerce) Yahoo March 2011  –  May 2013  (2 years 3 months) - Managing end-to-end technical/DevOps under service engineering for various hosted properties/websites. \n- Lead for various properties like Yahoo Shopping, Games, Toolbar, Deals, Downloads, Sports, Finance and Weather. \n- Development of new properties, involving a Vespa hosted e-commerce backend, from scratch. \n- Functional lead for a team of 4 members involved in day-to-day site up issues and pro-active incident handling. \n- CI process by automating the builds/releases using various config management tools like Jenkins, Hudson. \n- OS migration of various components (like Frontends and backends) involved. \n- DevOps role at various levels with Core Development Team, Network team, Infrastructure team, Platforms team \n- Python and shell scripting for automation \n- Colo migration from legacy to newer hardware stack \n- Property related change management meetings formulating the production change plan. \n- Production change plans as part of the Release management. This was taken up on a day-to-day basis. \n- Capacity planning (Managing hardware related activities according the expected traffic) and Designing the skeleton of enterprise applications infrastructure from scratch at component level, like apache, MySQL, caching layers, proxies etc. \n- Operational support for developers and end users, including responsibilities such as responding to outages, IRC channels, configuring hosts \n- Load and performance testing for enterprise web applications \n- Reviewing the monitoring of application, performance, feeds \n- Resolution/troubleshooting of issues, which are aggressively tracked through bugs related to specific properties and various components involved like Apache, LB, VIP, Akamai, API layer, Caching, Proxies, Front end web servers, Backend DBs, Storage, Platforms, Partner feeds, FTP drop boxes. \n- BCP planning and documentation \n- Configuration management tools like Chef for managing central repository of pkgs and roles.  \n- Kanban implementation across technical teams using kanbanize tool Senior Engineer - Server Management Wipro January 2007  –  March 2011  (4 years 3 months) Bangalore - Worked in client location as a part of Global System Operations – UNIX team in Goldman Sachs, Bangalore (Jan 2007 – March 2011). Involved in DevOps/ Production support for Goldman Sachs equities trading Infrastructure catering to multiple stock exchanges round the world \n- Was also part of Goldman Sachs Operation team – Tokyo, Japan. Gained real time experience by working/coordination with Goldman Sachs, equities Operations in Tokyo and also with offshore team with regards to Asia System Operations. \n- Member for the initial onsite transition team for the knowledge transfer of Systems project from Goldman Sachs, New York. \n- Knowledge and administration of FIX protocol \n- UNIX/Linux DevOps & Production support involved in the resolution/troubleshooting of escalated tickets from the L1 and L2 teams,handling user requests and incident tickets based on criticality. \n- Performing health checks,system checks and sanity checks to ensure maximum server/ infrastructure availability before/during the start of various Global Stock exchanges. Configuration of alerts/Alert Management \n- Creation, maintenance and updating of support documents \n- Generation of ad-hoc reports based on alert flow / alert handled. Modify of alert configs & Implementation of various measures at application level for continual improvement of operational efficiency \n- Data center Move planning, pre-migration, Scheduling, Execution and post-migration \n- Involved in planning and managing of scheduled Data Center power downs \n- Service Level Targets for Technology Service Operations Group \n- Manage day-to-day operations and infrastructure standardization \n- Involved in RCA for Sev 1 incidents, identify and mitigate risks \n- Weekly review of Incident, Change and identified risks in the environment \n- Establish 24 X 7 global support model and Transformation and Standardization of support being transitioned \n- Automation of daily and repetitive tasks in the environment Systems Management IPsoft January 2006  –  December 2006  (1 year) - Team Member of Global Systems Management team handling operations involving complex administrative tasks in the front edge Data Center environment having 19 data centers with 1400 servers. \n- Managing the data center, which comprises system/software installation, configuration, implementation, monitoring, troubleshooting, and security. Maintaining data integrity/security over the network. \n- Remote automated installation of open OS on Client’s staging/production servers. \n- Shell scripting for task automation and backup processes \n- Managing and ensuring smooth day-to-day operations by troubleshooting various servers including Apache web server, DNS, DHCP, Samba servers. Devising and implementing backup strategy. Technical Lead - Search and E-commerce, Yahoo! Shopping Yahoo March 2014  – Present (1 year 6 months) As Technical Lead, managing end-to-end technical/DevOps Operations under Service Engineering for various hosted Search properties/websites. Technical Lead - Search and E-commerce, Yahoo! Shopping Yahoo March 2014  – Present (1 year 6 months) As Technical Lead, managing end-to-end technical/DevOps Operations under Service Engineering for various hosted Search properties/websites. Technical Lead - Media Yahoo June 2013  –  March 2014  (10 months) As Technical Lead, managing end-to-end technical/DevOps operations under Service Engineering for various hosted media properties/websites. Technical Lead - Media Yahoo June 2013  –  March 2014  (10 months) As Technical Lead, managing end-to-end technical/DevOps operations under Service Engineering for various hosted media properties/websites. Technical Lead - Listings and Marketplace (E-commerce) Yahoo March 2011  –  May 2013  (2 years 3 months) - Managing end-to-end technical/DevOps under service engineering for various hosted properties/websites. \n- Lead for various properties like Yahoo Shopping, Games, Toolbar, Deals, Downloads, Sports, Finance and Weather. \n- Development of new properties, involving a Vespa hosted e-commerce backend, from scratch. \n- Functional lead for a team of 4 members involved in day-to-day site up issues and pro-active incident handling. \n- CI process by automating the builds/releases using various config management tools like Jenkins, Hudson. \n- OS migration of various components (like Frontends and backends) involved. \n- DevOps role at various levels with Core Development Team, Network team, Infrastructure team, Platforms team \n- Python and shell scripting for automation \n- Colo migration from legacy to newer hardware stack \n- Property related change management meetings formulating the production change plan. \n- Production change plans as part of the Release management. This was taken up on a day-to-day basis. \n- Capacity planning (Managing hardware related activities according the expected traffic) and Designing the skeleton of enterprise applications infrastructure from scratch at component level, like apache, MySQL, caching layers, proxies etc. \n- Operational support for developers and end users, including responsibilities such as responding to outages, IRC channels, configuring hosts \n- Load and performance testing for enterprise web applications \n- Reviewing the monitoring of application, performance, feeds \n- Resolution/troubleshooting of issues, which are aggressively tracked through bugs related to specific properties and various components involved like Apache, LB, VIP, Akamai, API layer, Caching, Proxies, Front end web servers, Backend DBs, Storage, Platforms, Partner feeds, FTP drop boxes. \n- BCP planning and documentation \n- Configuration management tools like Chef for managing central repository of pkgs and roles.  \n- Kanban implementation across technical teams using kanbanize tool Technical Lead - Listings and Marketplace (E-commerce) Yahoo March 2011  –  May 2013  (2 years 3 months) - Managing end-to-end technical/DevOps under service engineering for various hosted properties/websites. \n- Lead for various properties like Yahoo Shopping, Games, Toolbar, Deals, Downloads, Sports, Finance and Weather. \n- Development of new properties, involving a Vespa hosted e-commerce backend, from scratch. \n- Functional lead for a team of 4 members involved in day-to-day site up issues and pro-active incident handling. \n- CI process by automating the builds/releases using various config management tools like Jenkins, Hudson. \n- OS migration of various components (like Frontends and backends) involved. \n- DevOps role at various levels with Core Development Team, Network team, Infrastructure team, Platforms team \n- Python and shell scripting for automation \n- Colo migration from legacy to newer hardware stack \n- Property related change management meetings formulating the production change plan. \n- Production change plans as part of the Release management. This was taken up on a day-to-day basis. \n- Capacity planning (Managing hardware related activities according the expected traffic) and Designing the skeleton of enterprise applications infrastructure from scratch at component level, like apache, MySQL, caching layers, proxies etc. \n- Operational support for developers and end users, including responsibilities such as responding to outages, IRC channels, configuring hosts \n- Load and performance testing for enterprise web applications \n- Reviewing the monitoring of application, performance, feeds \n- Resolution/troubleshooting of issues, which are aggressively tracked through bugs related to specific properties and various components involved like Apache, LB, VIP, Akamai, API layer, Caching, Proxies, Front end web servers, Backend DBs, Storage, Platforms, Partner feeds, FTP drop boxes. \n- BCP planning and documentation \n- Configuration management tools like Chef for managing central repository of pkgs and roles.  \n- Kanban implementation across technical teams using kanbanize tool Senior Engineer - Server Management Wipro January 2007  –  March 2011  (4 years 3 months) Bangalore - Worked in client location as a part of Global System Operations – UNIX team in Goldman Sachs, Bangalore (Jan 2007 – March 2011). Involved in DevOps/ Production support for Goldman Sachs equities trading Infrastructure catering to multiple stock exchanges round the world \n- Was also part of Goldman Sachs Operation team – Tokyo, Japan. Gained real time experience by working/coordination with Goldman Sachs, equities Operations in Tokyo and also with offshore team with regards to Asia System Operations. \n- Member for the initial onsite transition team for the knowledge transfer of Systems project from Goldman Sachs, New York. \n- Knowledge and administration of FIX protocol \n- UNIX/Linux DevOps & Production support involved in the resolution/troubleshooting of escalated tickets from the L1 and L2 teams,handling user requests and incident tickets based on criticality. \n- Performing health checks,system checks and sanity checks to ensure maximum server/ infrastructure availability before/during the start of various Global Stock exchanges. Configuration of alerts/Alert Management \n- Creation, maintenance and updating of support documents \n- Generation of ad-hoc reports based on alert flow / alert handled. Modify of alert configs & Implementation of various measures at application level for continual improvement of operational efficiency \n- Data center Move planning, pre-migration, Scheduling, Execution and post-migration \n- Involved in planning and managing of scheduled Data Center power downs \n- Service Level Targets for Technology Service Operations Group \n- Manage day-to-day operations and infrastructure standardization \n- Involved in RCA for Sev 1 incidents, identify and mitigate risks \n- Weekly review of Incident, Change and identified risks in the environment \n- Establish 24 X 7 global support model and Transformation and Standardization of support being transitioned \n- Automation of daily and repetitive tasks in the environment Senior Engineer - Server Management Wipro January 2007  –  March 2011  (4 years 3 months) Bangalore - Worked in client location as a part of Global System Operations – UNIX team in Goldman Sachs, Bangalore (Jan 2007 – March 2011). Involved in DevOps/ Production support for Goldman Sachs equities trading Infrastructure catering to multiple stock exchanges round the world \n- Was also part of Goldman Sachs Operation team – Tokyo, Japan. Gained real time experience by working/coordination with Goldman Sachs, equities Operations in Tokyo and also with offshore team with regards to Asia System Operations. \n- Member for the initial onsite transition team for the knowledge transfer of Systems project from Goldman Sachs, New York. \n- Knowledge and administration of FIX protocol \n- UNIX/Linux DevOps & Production support involved in the resolution/troubleshooting of escalated tickets from the L1 and L2 teams,handling user requests and incident tickets based on criticality. \n- Performing health checks,system checks and sanity checks to ensure maximum server/ infrastructure availability before/during the start of various Global Stock exchanges. Configuration of alerts/Alert Management \n- Creation, maintenance and updating of support documents \n- Generation of ad-hoc reports based on alert flow / alert handled. Modify of alert configs & Implementation of various measures at application level for continual improvement of operational efficiency \n- Data center Move planning, pre-migration, Scheduling, Execution and post-migration \n- Involved in planning and managing of scheduled Data Center power downs \n- Service Level Targets for Technology Service Operations Group \n- Manage day-to-day operations and infrastructure standardization \n- Involved in RCA for Sev 1 incidents, identify and mitigate risks \n- Weekly review of Incident, Change and identified risks in the environment \n- Establish 24 X 7 global support model and Transformation and Standardization of support being transitioned \n- Automation of daily and repetitive tasks in the environment Systems Management IPsoft January 2006  –  December 2006  (1 year) - Team Member of Global Systems Management team handling operations involving complex administrative tasks in the front edge Data Center environment having 19 data centers with 1400 servers. \n- Managing the data center, which comprises system/software installation, configuration, implementation, monitoring, troubleshooting, and security. Maintaining data integrity/security over the network. \n- Remote automated installation of open OS on Client’s staging/production servers. \n- Shell scripting for task automation and backup processes \n- Managing and ensuring smooth day-to-day operations by troubleshooting various servers including Apache web server, DNS, DHCP, Samba servers. Devising and implementing backup strategy. Systems Management IPsoft January 2006  –  December 2006  (1 year) - Team Member of Global Systems Management team handling operations involving complex administrative tasks in the front edge Data Center environment having 19 data centers with 1400 servers. \n- Managing the data center, which comprises system/software installation, configuration, implementation, monitoring, troubleshooting, and security. Maintaining data integrity/security over the network. \n- Remote automated installation of open OS on Client’s staging/production servers. \n- Shell scripting for task automation and backup processes \n- Managing and ensuring smooth day-to-day operations by troubleshooting various servers including Apache web server, DNS, DHCP, Samba servers. Devising and implementing backup strategy. Skills Unix Load Balancing Apache Linux MySQL DevOps Python Bash Unix Shell Scripting Databases Hadoop VMware LAMP Cloud Computing Load Testing MongoDB Amazon Web Services... Configuration Management Distributed Systems Performance Tuning Chef Akamai DNS management Memcached Squid NoSQL Jenkins RedHat Ubuntu Service-Now HP Openview Splunk E-commerce SEO LoadRunner Scalable Web... LAMP administration Network Administration Network Security Operating Systems Continuous Integration Kanban Shell Scripting High Availability DNS FIX protocol Perl Docker Cassandra Servers See 34+     See less Skills  Unix Load Balancing Apache Linux MySQL DevOps Python Bash Unix Shell Scripting Databases Hadoop VMware LAMP Cloud Computing Load Testing MongoDB Amazon Web Services... Configuration Management Distributed Systems Performance Tuning Chef Akamai DNS management Memcached Squid NoSQL Jenkins RedHat Ubuntu Service-Now HP Openview Splunk E-commerce SEO LoadRunner Scalable Web... LAMP administration Network Administration Network Security Operating Systems Continuous Integration Kanban Shell Scripting High Availability DNS FIX protocol Perl Docker Cassandra Servers See 34+     See less Unix Load Balancing Apache Linux MySQL DevOps Python Bash Unix Shell Scripting Databases Hadoop VMware LAMP Cloud Computing Load Testing MongoDB Amazon Web Services... Configuration Management Distributed Systems Performance Tuning Chef Akamai DNS management Memcached Squid NoSQL Jenkins RedHat Ubuntu Service-Now HP Openview Splunk E-commerce SEO LoadRunner Scalable Web... LAMP administration Network Administration Network Security Operating Systems Continuous Integration Kanban Shell Scripting High Availability DNS FIX protocol Perl Docker Cassandra Servers See 34+     See less Unix Load Balancing Apache Linux MySQL DevOps Python Bash Unix Shell Scripting Databases Hadoop VMware LAMP Cloud Computing Load Testing MongoDB Amazon Web Services... Configuration Management Distributed Systems Performance Tuning Chef Akamai DNS management Memcached Squid NoSQL Jenkins RedHat Ubuntu Service-Now HP Openview Splunk E-commerce SEO LoadRunner Scalable Web... LAMP administration Network Administration Network Security Operating Systems Continuous Integration Kanban Shell Scripting High Availability DNS FIX protocol Perl Docker Cassandra Servers See 34+     See less Education University College of Engineering (University of Kerala) Bachelor of Technology (BTech),  Electronics and Communication Engineering 2001  – 2005 Activities and Societies:  School Cricket Team St. Thomas Central School, Trivandrum 12th standard CBSE,  Mathematics and Computer Science University College of Engineering (University of Kerala) Bachelor of Technology (BTech),  Electronics and Communication Engineering 2001  – 2005 Activities and Societies:  School Cricket Team University College of Engineering (University of Kerala) Bachelor of Technology (BTech),  Electronics and Communication Engineering 2001  – 2005 Activities and Societies:  School Cricket Team University College of Engineering (University of Kerala) Bachelor of Technology (BTech),  Electronics and Communication Engineering 2001  – 2005 Activities and Societies:  School Cricket Team St. Thomas Central School, Trivandrum 12th standard CBSE,  Mathematics and Computer Science St. Thomas Central School, Trivandrum 12th standard CBSE,  Mathematics and Computer Science St. Thomas Central School, Trivandrum 12th standard CBSE,  Mathematics and Computer Science Honors & Awards Yahoo U-Rock! Award Yahoo! June 2014 Yahoo Spot Award Yahoo! February 2013 Ownership and execution of complete colo migration project without any down-time and ensuring smooth user experience.  Yahoo U-Rock! Award Yahoo! June 2014 Yahoo U-Rock! Award Yahoo! June 2014 Yahoo U-Rock! Award Yahoo! June 2014 Yahoo Spot Award Yahoo! February 2013 Ownership and execution of complete colo migration project without any down-time and ensuring smooth user experience.  Yahoo Spot Award Yahoo! February 2013 Ownership and execution of complete colo migration project without any down-time and ensuring smooth user experience.  Yahoo Spot Award Yahoo! February 2013 Ownership and execution of complete colo migration project without any down-time and ensuring smooth user experience.  ", "Summary Experienced in building and running large-scale high-traffic Internet sites and services.  \n \nCurrent: \n- DevOps engineer for Yahoo's user database  \n \nPast: \n- Developer for Yahoo Cloud Messaging Service - a hosted pub-sub platform used for messaging and replication use cases. Directly competes Kafka in scale, performance and feature-set; betters it in durability guaranty and multi-tenancy. \n \n- DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Summary Experienced in building and running large-scale high-traffic Internet sites and services.  \n \nCurrent: \n- DevOps engineer for Yahoo's user database  \n \nPast: \n- Developer for Yahoo Cloud Messaging Service - a hosted pub-sub platform used for messaging and replication use cases. Directly competes Kafka in scale, performance and feature-set; betters it in durability guaranty and multi-tenancy. \n \n- DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Experienced in building and running large-scale high-traffic Internet sites and services.  \n \nCurrent: \n- DevOps engineer for Yahoo's user database  \n \nPast: \n- Developer for Yahoo Cloud Messaging Service - a hosted pub-sub platform used for messaging and replication use cases. Directly competes Kafka in scale, performance and feature-set; betters it in durability guaranty and multi-tenancy. \n \n- DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Experienced in building and running large-scale high-traffic Internet sites and services.  \n \nCurrent: \n- DevOps engineer for Yahoo's user database  \n \nPast: \n- Developer for Yahoo Cloud Messaging Service - a hosted pub-sub platform used for messaging and replication use cases. Directly competes Kafka in scale, performance and feature-set; betters it in durability guaranty and multi-tenancy. \n \n- DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Experience Senior Technical Yahoo Yahoo! July 2013  – Present (2 years 2 months) Sunnyvale, CA One of the developers for the Cloud Messaging Service product - a hosted pub-sub platform.  \n \nDirect contributions: \n- Server side implementations of key features of the proprietary Messaging API (queue semantics, load balancing among brokers). Worked on analyzing and improving performance.  \n- Java client bindings for the Messaging API Principal Engineer Yahoo! July 2008  –  July 2013  (5 years 1 month) Bengaluru Area, India DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Member of Technical Staff Persistent Systems June 2005  –  June 2006  (1 year 1 month) Wrote tools to monitor and generate reports for an outbound mail server by StrongMailTM. Senior Technical Yahoo Yahoo! July 2013  – Present (2 years 2 months) Sunnyvale, CA One of the developers for the Cloud Messaging Service product - a hosted pub-sub platform.  \n \nDirect contributions: \n- Server side implementations of key features of the proprietary Messaging API (queue semantics, load balancing among brokers). Worked on analyzing and improving performance.  \n- Java client bindings for the Messaging API Senior Technical Yahoo Yahoo! July 2013  – Present (2 years 2 months) Sunnyvale, CA One of the developers for the Cloud Messaging Service product - a hosted pub-sub platform.  \n \nDirect contributions: \n- Server side implementations of key features of the proprietary Messaging API (queue semantics, load balancing among brokers). Worked on analyzing and improving performance.  \n- Java client bindings for the Messaging API Principal Engineer Yahoo! July 2008  –  July 2013  (5 years 1 month) Bengaluru Area, India DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Principal Engineer Yahoo! July 2008  –  July 2013  (5 years 1 month) Bengaluru Area, India DevOps for Yahoo Membership (Login/Registration), Content Platforms (content crawl, fetch, process, store and serve), Geo Platforms (geo-spatial maps, geocode) Member of Technical Staff Persistent Systems June 2005  –  June 2006  (1 year 1 month) Wrote tools to monitor and generate reports for an outbound mail server by StrongMailTM. Member of Technical Staff Persistent Systems June 2005  –  June 2006  (1 year 1 month) Wrote tools to monitor and generate reports for an outbound mail server by StrongMailTM. Skills Perl Distributed Systems Hadoop Python MySQL Linux Kernel TCP/IP stack Large Scale Systems Linux REST Shell Scripting Skills  Perl Distributed Systems Hadoop Python MySQL Linux Kernel TCP/IP stack Large Scale Systems Linux REST Shell Scripting Perl Distributed Systems Hadoop Python MySQL Linux Kernel TCP/IP stack Large Scale Systems Linux REST Shell Scripting Perl Distributed Systems Hadoop Python MySQL Linux Kernel TCP/IP stack Large Scale Systems Linux REST Shell Scripting Education Indian Institute of Technology, Guwahati M.Tech,  Computer Science 2006  – 2008 Atmiya Institute of Technology and Science B.E.,  Information Technology 2001  – 2005 Indian Institute of Technology, Guwahati M.Tech,  Computer Science 2006  – 2008 Indian Institute of Technology, Guwahati M.Tech,  Computer Science 2006  – 2008 Indian Institute of Technology, Guwahati M.Tech,  Computer Science 2006  – 2008 Atmiya Institute of Technology and Science B.E.,  Information Technology 2001  – 2005 Atmiya Institute of Technology and Science B.E.,  Information Technology 2001  – 2005 Atmiya Institute of Technology and Science B.E.,  Information Technology 2001  – 2005 ", "Summary Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Summary Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Strong technical Director overseeing database operations and infrastructure for one of the world's largest multibillion-dollar Internet media/search company. Possess strong technical leadership, strategic direction, and team management skills combined with solid knowledge of RDBMS, Networking, Storage and Cloud technologies. Build and manage world class organization that has a proven record of delivering projects on time, within budget and with prestine quality. Interested in challenging opportunties where I can engage in design, build and manage large-scale systems to solve complex problem of scaling. \n \nSpecialties \n• Solid knowledge of RDBMS (Oracle/MySQL/SQL Server), Networking, Storage, and Cloud technologies \n• Well versed with HTML, XML, WML, C, Perl, PL/SQL, Transact SQL and Shell Scripting \n• Managing business critical Oracle, MySQL & MS SQL database applications that range from few terabytes to 500 terabytes, deployed using Oracle RAC 10g/11g (2 - 16 node clusters). Experience Senior Director Production Engineering Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manage Yahoo Native Ad Operations Director Data Operations Yahoo! August 2013  – Present (2 years 1 month) United States Manage Yahoo entire data infrastructure that generates over 150 Billion events from multiple data centers across the globe which feeds into various pipelines that generates over 30TB of data in Hadoop infrastructure to generate deep insights into user and revenue metrics for Yahoo. Head of Cloud Operations BitYota November 2012  –  August 2013  (10 months) San Francisco Bay Area o\tEngaged in BitYota’s Infrastructure/Operational Roadmap discussions with Venture Capitalists \no\tCustomer C level staff engagement on BitYota’s Architecture and Performance/Operational benefits \no\tEngaged in pre-sale technical discussions with customers \no\tBudget and Burn rate discussions with BitYota’s Founders and Directors \no\tEngaged in Product stratergy and Product Roadmap course correction meetings \no\tCompetitor landscape analysis for Cost/Performance/Differentiation \no\tManage BitYota’s DataCenter Infrastructure and provisioning \n Director Database Operations Yahoo! August 2011  –  November 2012  (1 year 4 months) Sunnyvale,CA Manage day-to-day operations of databases that generate multiple billion dollars in revenue. This includes architecting, sizing, capacity planning and performance tuning of applications to support the millions of advertisers. Setup Vision, Goals and Mission Statement for the team and rally the troops to successfully complete all milestones. Hire, Mentor and Coach 50+ direct and indirect reports. Manage 1000+ database systems that serve more than 5 Petabyte of storage and databases ranging from few Terabytes to 500+TB. Sr.Manager Database Technologies Yahoo! March 2009  –  August 2011  (2 years 6 months) DBA Manager Yahoo January 2007  –  February 2009  (2 years 2 months) Senior DBA Yahoo! April 2004  –  December 2006  (2 years 9 months) Sr. DBA Altavista January 2000  –  April 2004  (4 years 4 months) Systems Analyst Hofinsoft January 1996  –  July 1997  (1 year 7 months) Senior Director Production Engineering Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manage Yahoo Native Ad Operations Senior Director Production Engineering Yahoo April 2015  – Present (5 months) Sunnyvale, CA Manage Yahoo Native Ad Operations Director Data Operations Yahoo! August 2013  – Present (2 years 1 month) United States Manage Yahoo entire data infrastructure that generates over 150 Billion events from multiple data centers across the globe which feeds into various pipelines that generates over 30TB of data in Hadoop infrastructure to generate deep insights into user and revenue metrics for Yahoo. Director Data Operations Yahoo! August 2013  – Present (2 years 1 month) United States Manage Yahoo entire data infrastructure that generates over 150 Billion events from multiple data centers across the globe which feeds into various pipelines that generates over 30TB of data in Hadoop infrastructure to generate deep insights into user and revenue metrics for Yahoo. Head of Cloud Operations BitYota November 2012  –  August 2013  (10 months) San Francisco Bay Area o\tEngaged in BitYota’s Infrastructure/Operational Roadmap discussions with Venture Capitalists \no\tCustomer C level staff engagement on BitYota’s Architecture and Performance/Operational benefits \no\tEngaged in pre-sale technical discussions with customers \no\tBudget and Burn rate discussions with BitYota’s Founders and Directors \no\tEngaged in Product stratergy and Product Roadmap course correction meetings \no\tCompetitor landscape analysis for Cost/Performance/Differentiation \no\tManage BitYota’s DataCenter Infrastructure and provisioning \n Head of Cloud Operations BitYota November 2012  –  August 2013  (10 months) San Francisco Bay Area o\tEngaged in BitYota’s Infrastructure/Operational Roadmap discussions with Venture Capitalists \no\tCustomer C level staff engagement on BitYota’s Architecture and Performance/Operational benefits \no\tEngaged in pre-sale technical discussions with customers \no\tBudget and Burn rate discussions with BitYota’s Founders and Directors \no\tEngaged in Product stratergy and Product Roadmap course correction meetings \no\tCompetitor landscape analysis for Cost/Performance/Differentiation \no\tManage BitYota’s DataCenter Infrastructure and provisioning \n Director Database Operations Yahoo! August 2011  –  November 2012  (1 year 4 months) Sunnyvale,CA Manage day-to-day operations of databases that generate multiple billion dollars in revenue. This includes architecting, sizing, capacity planning and performance tuning of applications to support the millions of advertisers. Setup Vision, Goals and Mission Statement for the team and rally the troops to successfully complete all milestones. Hire, Mentor and Coach 50+ direct and indirect reports. Manage 1000+ database systems that serve more than 5 Petabyte of storage and databases ranging from few Terabytes to 500+TB. Director Database Operations Yahoo! August 2011  –  November 2012  (1 year 4 months) Sunnyvale,CA Manage day-to-day operations of databases that generate multiple billion dollars in revenue. This includes architecting, sizing, capacity planning and performance tuning of applications to support the millions of advertisers. Setup Vision, Goals and Mission Statement for the team and rally the troops to successfully complete all milestones. Hire, Mentor and Coach 50+ direct and indirect reports. Manage 1000+ database systems that serve more than 5 Petabyte of storage and databases ranging from few Terabytes to 500+TB. Sr.Manager Database Technologies Yahoo! March 2009  –  August 2011  (2 years 6 months) Sr.Manager Database Technologies Yahoo! March 2009  –  August 2011  (2 years 6 months) DBA Manager Yahoo January 2007  –  February 2009  (2 years 2 months) DBA Manager Yahoo January 2007  –  February 2009  (2 years 2 months) Senior DBA Yahoo! April 2004  –  December 2006  (2 years 9 months) Senior DBA Yahoo! April 2004  –  December 2006  (2 years 9 months) Sr. DBA Altavista January 2000  –  April 2004  (4 years 4 months) Sr. DBA Altavista January 2000  –  April 2004  (4 years 4 months) Systems Analyst Hofinsoft January 1996  –  July 1997  (1 year 7 months) Systems Analyst Hofinsoft January 1996  –  July 1997  (1 year 7 months) Skills Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Skills  Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Cloud Computing Databases Oracle Scalability Shell Scripting MySQL Perl Microsoft SQL Server PL/SQL Storage Networking Performance Tuning Agile Methodologies Distributed Systems Unix High Availability Solaris Linux T-SQL Hadoop Oracle RAC XML MSSQL Cassandra Data Warehousing Big Data Apache Cloud Technologies Visual Basic Transact SQL Start-ups Management See 17+     See less Education Madras University B.S,  Math 1989  – 1992 Madras University B.S,  Math 1989  – 1992 Madras University B.S,  Math 1989  – 1992 Madras University B.S,  Math 1989  – 1992 ", "Experience Engineering Team Leader Yahoo! JAPAN October 2013  – Present (1 year 11 months) Engineering team leader in Search service frontend core platforms, and product manager of some of search-metrics-related products for internal DevOps. Search DevOps Yahoo! JAPAN April 2013  –  September 2013  (6 months) - Monitoring, performance tuning, capacity planning, and technical operations of Yahoo! JAPAN Search service group, and so on. \n- Technical reviews and instructions on migrating software development environments Search Operations Yahoo! JAPAN October 2007  –  March 2013  (5 years 6 months) First line operations engineer. \nMonitoring, performance tuning, capacity planning of Yahoo! JAPAN Search product group. \nResponsible for some of the highest traffic sites in Japan, including web-search, directory, multimedia-search, dictionary, encyclopedia, answers aka Chiebukuro, commerce-related-searches, twitter/Facebook 'real-time' searches, and so on. Monitoring Solution Taskforce Yahoo! JAPAN January 2010  –  September 2011  (1 year 9 months) Standardizing company-wide monitoring solutions, and accumulating and sharing best practices. \nLiaison with Yahoo! Inc monitoring solution development team. On sick leave Yahoo! JAPAN March 2011  –  April 2011  (2 months) On sick leave due to oral surgery procedure technical yahoo Yahoo! JAPAN January 2005  –  September 2007  (2 years 9 months) Development of search front-end for Yahoo! JAPAN and annotation systems. Also took part in Yahoo! Global Search Platform development, as a contributor. Web application engineer Zenith Inc. February 2004  –  September 2004  (8 months) Engineer Crumple Inc. April 2001  –  September 2003  (2 years 6 months) Engineering Team Leader Yahoo! JAPAN October 2013  – Present (1 year 11 months) Engineering team leader in Search service frontend core platforms, and product manager of some of search-metrics-related products for internal DevOps. Engineering Team Leader Yahoo! JAPAN October 2013  – Present (1 year 11 months) Engineering team leader in Search service frontend core platforms, and product manager of some of search-metrics-related products for internal DevOps. Search DevOps Yahoo! JAPAN April 2013  –  September 2013  (6 months) - Monitoring, performance tuning, capacity planning, and technical operations of Yahoo! JAPAN Search service group, and so on. \n- Technical reviews and instructions on migrating software development environments Search DevOps Yahoo! JAPAN April 2013  –  September 2013  (6 months) - Monitoring, performance tuning, capacity planning, and technical operations of Yahoo! JAPAN Search service group, and so on. \n- Technical reviews and instructions on migrating software development environments Search Operations Yahoo! JAPAN October 2007  –  March 2013  (5 years 6 months) First line operations engineer. \nMonitoring, performance tuning, capacity planning of Yahoo! JAPAN Search product group. \nResponsible for some of the highest traffic sites in Japan, including web-search, directory, multimedia-search, dictionary, encyclopedia, answers aka Chiebukuro, commerce-related-searches, twitter/Facebook 'real-time' searches, and so on. Search Operations Yahoo! JAPAN October 2007  –  March 2013  (5 years 6 months) First line operations engineer. \nMonitoring, performance tuning, capacity planning of Yahoo! JAPAN Search product group. \nResponsible for some of the highest traffic sites in Japan, including web-search, directory, multimedia-search, dictionary, encyclopedia, answers aka Chiebukuro, commerce-related-searches, twitter/Facebook 'real-time' searches, and so on. Monitoring Solution Taskforce Yahoo! JAPAN January 2010  –  September 2011  (1 year 9 months) Standardizing company-wide monitoring solutions, and accumulating and sharing best practices. \nLiaison with Yahoo! Inc monitoring solution development team. Monitoring Solution Taskforce Yahoo! JAPAN January 2010  –  September 2011  (1 year 9 months) Standardizing company-wide monitoring solutions, and accumulating and sharing best practices. \nLiaison with Yahoo! Inc monitoring solution development team. On sick leave Yahoo! JAPAN March 2011  –  April 2011  (2 months) On sick leave due to oral surgery procedure On sick leave Yahoo! JAPAN March 2011  –  April 2011  (2 months) On sick leave due to oral surgery procedure technical yahoo Yahoo! JAPAN January 2005  –  September 2007  (2 years 9 months) Development of search front-end for Yahoo! JAPAN and annotation systems. Also took part in Yahoo! Global Search Platform development, as a contributor. technical yahoo Yahoo! JAPAN January 2005  –  September 2007  (2 years 9 months) Development of search front-end for Yahoo! JAPAN and annotation systems. Also took part in Yahoo! Global Search Platform development, as a contributor. Web application engineer Zenith Inc. February 2004  –  September 2004  (8 months) Web application engineer Zenith Inc. February 2004  –  September 2004  (8 months) Engineer Crumple Inc. April 2001  –  September 2003  (2 years 6 months) Engineer Crumple Inc. April 2001  –  September 2003  (2 years 6 months) Languages Japanese English Japanese English Japanese English Skills Search System Monitoring High Performance... PHP Perl C Web Applications Linux FreeBSD Apache Scalability Server Architecture High Availability Nagios MySQL Skills  Search System Monitoring High Performance... PHP Perl C Web Applications Linux FreeBSD Apache Scalability Server Architecture High Availability Nagios MySQL Search System Monitoring High Performance... PHP Perl C Web Applications Linux FreeBSD Apache Scalability Server Architecture High Availability Nagios MySQL Search System Monitoring High Performance... PHP Perl C Web Applications Linux FreeBSD Apache Scalability Server Architecture High Availability Nagios MySQL Education Kyoto University Bachelor,  Aeronautical Engineering ,  Physics 1995  – 2001 Activities and Societies:  Yoshida Music Works Kyoto University Bachelor of Engineering (B.E.),  Aerospace , Aeronautical and Astronautical/Space Engineering 1995  – 2000 Kyoto University Bachelor,  Aeronautical Engineering ,  Physics 1995  – 2001 Activities and Societies:  Yoshida Music Works Kyoto University Bachelor,  Aeronautical Engineering ,  Physics 1995  – 2001 Activities and Societies:  Yoshida Music Works Kyoto University Bachelor,  Aeronautical Engineering ,  Physics 1995  – 2001 Activities and Societies:  Yoshida Music Works Kyoto University Bachelor of Engineering (B.E.),  Aerospace , Aeronautical and Astronautical/Space Engineering 1995  – 2000 Kyoto University Bachelor of Engineering (B.E.),  Aerospace , Aeronautical and Astronautical/Space Engineering 1995  – 2000 Kyoto University Bachelor of Engineering (B.E.),  Aerospace , Aeronautical and Astronautical/Space Engineering 1995  – 2000 ", "Summary An passionate technical leader with global experience in architecting/managing/operating large-scale distributed system, devops engineering, Web operations/performance, product resilience engineering, rich tools/platform development. Summary An passionate technical leader with global experience in architecting/managing/operating large-scale distributed system, devops engineering, Web operations/performance, product resilience engineering, rich tools/platform development. An passionate technical leader with global experience in architecting/managing/operating large-scale distributed system, devops engineering, Web operations/performance, product resilience engineering, rich tools/platform development. An passionate technical leader with global experience in architecting/managing/operating large-scale distributed system, devops engineering, Web operations/performance, product resilience engineering, rich tools/platform development. Experience Principal Architect Yahoo October 2014  – Present (11 months) San Francisco Bay Area Tech Yahoo!, Sr Yahoo April 2013  –  September 2014  (1 year 6 months) San Francisco Bay Area Engineering Manager Yahoo April 2011  –  March 2013  (2 years) Managing Yahoo!'s large scale Advertisers application systems that are critical to Yahoo!'s Display business. Principal Engineer Yahoo April 2010  –  March 2011  (1 year) Tech Lead YAHOO! November 2007  –  March 2010  (2 years 5 months) capacity planning, Advertiser application performance analysis, production engineering, System Administration. Senior System Engineer Honeywell Technology Solutions, Inc. January 2004  –  September 2007  (3 years 9 months) Production engineering, capacity planning, addressing and building scalable system with high availability. Principal Architect Yahoo October 2014  – Present (11 months) San Francisco Bay Area Principal Architect Yahoo October 2014  – Present (11 months) San Francisco Bay Area Tech Yahoo!, Sr Yahoo April 2013  –  September 2014  (1 year 6 months) San Francisco Bay Area Tech Yahoo!, Sr Yahoo April 2013  –  September 2014  (1 year 6 months) San Francisco Bay Area Engineering Manager Yahoo April 2011  –  March 2013  (2 years) Managing Yahoo!'s large scale Advertisers application systems that are critical to Yahoo!'s Display business. Engineering Manager Yahoo April 2011  –  March 2013  (2 years) Managing Yahoo!'s large scale Advertisers application systems that are critical to Yahoo!'s Display business. Principal Engineer Yahoo April 2010  –  March 2011  (1 year) Principal Engineer Yahoo April 2010  –  March 2011  (1 year) Tech Lead YAHOO! November 2007  –  March 2010  (2 years 5 months) capacity planning, Advertiser application performance analysis, production engineering, System Administration. Tech Lead YAHOO! November 2007  –  March 2010  (2 years 5 months) capacity planning, Advertiser application performance analysis, production engineering, System Administration. Senior System Engineer Honeywell Technology Solutions, Inc. January 2004  –  September 2007  (3 years 9 months) Production engineering, capacity planning, addressing and building scalable system with high availability. Senior System Engineer Honeywell Technology Solutions, Inc. January 2004  –  September 2007  (3 years 9 months) Production engineering, capacity planning, addressing and building scalable system with high availability. Skills Online Advertising High Availability Hadoop Scalability Java Apache MySQL Solaris Technical Leadership Linux HBase Open Source Enterprise Software LAMP Perl Data Center Spring SOA Weblogic Shell Scripting JBoss Application Server Distributed Systems Unix Tomcat See 9+     See less Skills  Online Advertising High Availability Hadoop Scalability Java Apache MySQL Solaris Technical Leadership Linux HBase Open Source Enterprise Software LAMP Perl Data Center Spring SOA Weblogic Shell Scripting JBoss Application Server Distributed Systems Unix Tomcat See 9+     See less Online Advertising High Availability Hadoop Scalability Java Apache MySQL Solaris Technical Leadership Linux HBase Open Source Enterprise Software LAMP Perl Data Center Spring SOA Weblogic Shell Scripting JBoss Application Server Distributed Systems Unix Tomcat See 9+     See less Online Advertising High Availability Hadoop Scalability Java Apache MySQL Solaris Technical Leadership Linux HBase Open Source Enterprise Software LAMP Perl Data Center Spring SOA Weblogic Shell Scripting JBoss Application Server Distributed Systems Unix Tomcat See 9+     See less Education Bharathiar University MCA,  Computer Applications 2001  – 2004 Activities and Societies:  MCA graduate with distinction Bharathiar University MCA,  Computer Applications 2001  – 2004 Activities and Societies:  MCA graduate with distinction Bharathiar University MCA,  Computer Applications 2001  – 2004 Activities and Societies:  MCA graduate with distinction Bharathiar University MCA,  Computer Applications 2001  – 2004 Activities and Societies:  MCA graduate with distinction Honors & Awards Additional Honors & Awards 2008 YAHOO! India Ratna Award, “employee of the year” award that recognizes and rewards exceptional performers at Yahoo! SDC Bangalore. \n \n2011 YAHOO! Q1 \"U Rock Award\" Additional Honors & Awards 2008 YAHOO! India Ratna Award, “employee of the year” award that recognizes and rewards exceptional performers at Yahoo! SDC Bangalore. \n \n2011 YAHOO! Q1 \"U Rock Award\" Additional Honors & Awards 2008 YAHOO! India Ratna Award, “employee of the year” award that recognizes and rewards exceptional performers at Yahoo! SDC Bangalore. \n \n2011 YAHOO! Q1 \"U Rock Award\" Additional Honors & Awards 2008 YAHOO! India Ratna Award, “employee of the year” award that recognizes and rewards exceptional performers at Yahoo! SDC Bangalore. \n \n2011 YAHOO! Q1 \"U Rock Award\" ", "Summary Highly adaptable UNIX Systems Administrator with over 13 years of experience working with Linux and Sun Solaris (as well as experience with some enterprise Windows platforms) in intranet and Internet environments, with an emphasis on uptime/reliability, support in a 24/7 production environment. \n \nLinux administrator, with a strong performance background in wide variety of professional system support for Linux Systems (or administrations) including, monitoring, configuration, troubleshooting and maintenance of operating systems. Summary Highly adaptable UNIX Systems Administrator with over 13 years of experience working with Linux and Sun Solaris (as well as experience with some enterprise Windows platforms) in intranet and Internet environments, with an emphasis on uptime/reliability, support in a 24/7 production environment. \n \nLinux administrator, with a strong performance background in wide variety of professional system support for Linux Systems (or administrations) including, monitoring, configuration, troubleshooting and maintenance of operating systems. Highly adaptable UNIX Systems Administrator with over 13 years of experience working with Linux and Sun Solaris (as well as experience with some enterprise Windows platforms) in intranet and Internet environments, with an emphasis on uptime/reliability, support in a 24/7 production environment. \n \nLinux administrator, with a strong performance background in wide variety of professional system support for Linux Systems (or administrations) including, monitoring, configuration, troubleshooting and maintenance of operating systems. Highly adaptable UNIX Systems Administrator with over 13 years of experience working with Linux and Sun Solaris (as well as experience with some enterprise Windows platforms) in intranet and Internet environments, with an emphasis on uptime/reliability, support in a 24/7 production environment. \n \nLinux administrator, with a strong performance background in wide variety of professional system support for Linux Systems (or administrations) including, monitoring, configuration, troubleshooting and maintenance of operating systems. Experience DevOps/Service Engineer, Sr Yahoo! Bangalore, Karnataka, India April 2015  – Present (5 months) Bengaluru Area, India Automating runbooks using Chef \nManaging Applications like tomcat, Jetty, hadoop \n DevOps/Service Engineer, Sr Yahoo! Sunnyvale, CA, USA September 2013  –  April 2015  (1 year 8 months) Sunnyvale, CA, USA Systems Engineer Hermitage Infotech LLC - Client: Yahoo! August 2012  –  August 2013  (1 year 1 month) Sunnyvale, CA Consultant - Sr. Unix Administrator Hermitage Infotech LLC - Client: JPMorgan Chase & Co May 2012  –  July 2012  (3 months) Pleasanton, CA Sr. Linux admin Advisen Ltd. February 2006  –  March 2012  (6 years 2 months) New York, NY Consultant - Sr. Linux Administrator Verinon Technologies - Client: Advisen Ltd. November 2005  –  January 2006  (3 months) New York, NY Consultant - Systems Administrator/Application Support Verinon Technologies - Client: SBC Telocom November 2004  –  October 2005  (1 year) Dallas/Fort Worth Area Unix/Linux admin SurgoSystems (Singapore) Pte Ltd. February 2001  –  August 2004  (3 years 7 months) Singapore Windows/Unix Support Wipro Technologies - Consultant February 1999  –  February 2001  (2 years 1 month) Bangalore, Karnataka -India DevOps/Service Engineer, Sr Yahoo! Bangalore, Karnataka, India April 2015  – Present (5 months) Bengaluru Area, India Automating runbooks using Chef \nManaging Applications like tomcat, Jetty, hadoop \n DevOps/Service Engineer, Sr Yahoo! Bangalore, Karnataka, India April 2015  – Present (5 months) Bengaluru Area, India Automating runbooks using Chef \nManaging Applications like tomcat, Jetty, hadoop \n DevOps/Service Engineer, Sr Yahoo! Sunnyvale, CA, USA September 2013  –  April 2015  (1 year 8 months) Sunnyvale, CA, USA DevOps/Service Engineer, Sr Yahoo! Sunnyvale, CA, USA September 2013  –  April 2015  (1 year 8 months) Sunnyvale, CA, USA Systems Engineer Hermitage Infotech LLC - Client: Yahoo! August 2012  –  August 2013  (1 year 1 month) Sunnyvale, CA Systems Engineer Hermitage Infotech LLC - Client: Yahoo! August 2012  –  August 2013  (1 year 1 month) Sunnyvale, CA Consultant - Sr. Unix Administrator Hermitage Infotech LLC - Client: JPMorgan Chase & Co May 2012  –  July 2012  (3 months) Pleasanton, CA Consultant - Sr. Unix Administrator Hermitage Infotech LLC - Client: JPMorgan Chase & Co May 2012  –  July 2012  (3 months) Pleasanton, CA Sr. Linux admin Advisen Ltd. February 2006  –  March 2012  (6 years 2 months) New York, NY Sr. Linux admin Advisen Ltd. February 2006  –  March 2012  (6 years 2 months) New York, NY Consultant - Sr. Linux Administrator Verinon Technologies - Client: Advisen Ltd. November 2005  –  January 2006  (3 months) New York, NY Consultant - Sr. Linux Administrator Verinon Technologies - Client: Advisen Ltd. November 2005  –  January 2006  (3 months) New York, NY Consultant - Systems Administrator/Application Support Verinon Technologies - Client: SBC Telocom November 2004  –  October 2005  (1 year) Dallas/Fort Worth Area Consultant - Systems Administrator/Application Support Verinon Technologies - Client: SBC Telocom November 2004  –  October 2005  (1 year) Dallas/Fort Worth Area Unix/Linux admin SurgoSystems (Singapore) Pte Ltd. February 2001  –  August 2004  (3 years 7 months) Singapore Unix/Linux admin SurgoSystems (Singapore) Pte Ltd. February 2001  –  August 2004  (3 years 7 months) Singapore Windows/Unix Support Wipro Technologies - Consultant February 1999  –  February 2001  (2 years 1 month) Bangalore, Karnataka -India Windows/Unix Support Wipro Technologies - Consultant February 1999  –  February 2001  (2 years 1 month) Bangalore, Karnataka -India Languages English Full professional proficiency Hindi Full professional proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills Linux Shell Scripting Red Hat Linux Unix Solaris High Availability Oracle Data Center RedHat Apache Cluster Disaster Recovery Tomcat Agile Methodologies Linux System... Perl RHEL JBoss Application Server Repository Debian Ubuntu Exchange 2010/2007/2003 Postfix PostgreSQL Performance Tuning Kanban VMware Troubleshooting Chef See 14+     See less Skills  Linux Shell Scripting Red Hat Linux Unix Solaris High Availability Oracle Data Center RedHat Apache Cluster Disaster Recovery Tomcat Agile Methodologies Linux System... Perl RHEL JBoss Application Server Repository Debian Ubuntu Exchange 2010/2007/2003 Postfix PostgreSQL Performance Tuning Kanban VMware Troubleshooting Chef See 14+     See less Linux Shell Scripting Red Hat Linux Unix Solaris High Availability Oracle Data Center RedHat Apache Cluster Disaster Recovery Tomcat Agile Methodologies Linux System... Perl RHEL JBoss Application Server Repository Debian Ubuntu Exchange 2010/2007/2003 Postfix PostgreSQL Performance Tuning Kanban VMware Troubleshooting Chef See 14+     See less Linux Shell Scripting Red Hat Linux Unix Solaris High Availability Oracle Data Center RedHat Apache Cluster Disaster Recovery Tomcat Agile Methodologies Linux System... Perl RHEL JBoss Application Server Repository Debian Ubuntu Exchange 2010/2007/2003 Postfix PostgreSQL Performance Tuning Kanban VMware Troubleshooting Chef See 14+     See less Education Allahabad Agricultural Institute Master of Business Administration (M.B.A.) 2004 Govt. Arts college for men, Anantapur, A.P - India Bachelor of Science (B.Sc.),  Electronics 1994  – 1997 Studied Major as Electronics Activities and Societies:  Cricket Govt. Junior College for boys, Anantapur, A.P India MPC,  Mathematics 1992  – 1994 Cricket Activities and Societies:  Cricket L.R.G High School 10th Standard 1991  – 1992 Activities and Societies:  Foot Ball ,  Cricket Allahabad Agricultural Institute Master of Business Administration (M.B.A.) 2004 Allahabad Agricultural Institute Master of Business Administration (M.B.A.) 2004 Allahabad Agricultural Institute Master of Business Administration (M.B.A.) 2004 Govt. Arts college for men, Anantapur, A.P - India Bachelor of Science (B.Sc.),  Electronics 1994  – 1997 Studied Major as Electronics Activities and Societies:  Cricket Govt. Arts college for men, Anantapur, A.P - India Bachelor of Science (B.Sc.),  Electronics 1994  – 1997 Studied Major as Electronics Activities and Societies:  Cricket Govt. Arts college for men, Anantapur, A.P - India Bachelor of Science (B.Sc.),  Electronics 1994  – 1997 Studied Major as Electronics Activities and Societies:  Cricket Govt. Junior College for boys, Anantapur, A.P India MPC,  Mathematics 1992  – 1994 Cricket Activities and Societies:  Cricket Govt. Junior College for boys, Anantapur, A.P India MPC,  Mathematics 1992  – 1994 Cricket Activities and Societies:  Cricket Govt. Junior College for boys, Anantapur, A.P India MPC,  Mathematics 1992  – 1994 Cricket Activities and Societies:  Cricket L.R.G High School 10th Standard 1991  – 1992 Activities and Societies:  Foot Ball ,  Cricket L.R.G High School 10th Standard 1991  – 1992 Activities and Societies:  Foot Ball ,  Cricket L.R.G High School 10th Standard 1991  – 1992 Activities and Societies:  Foot Ball ,  Cricket Honors & Awards Additional Honors & Awards Microsoft Certified Professional (MCP) \nMicrosoft Certified System Engineer (MCSE) \nSun Solaris 9 Certified systems Administrator \nSun Solaris 9 Certified Network Administrator Additional Honors & Awards Microsoft Certified Professional (MCP) \nMicrosoft Certified System Engineer (MCSE) \nSun Solaris 9 Certified systems Administrator \nSun Solaris 9 Certified Network Administrator Additional Honors & Awards Microsoft Certified Professional (MCP) \nMicrosoft Certified System Engineer (MCSE) \nSun Solaris 9 Certified systems Administrator \nSun Solaris 9 Certified Network Administrator Additional Honors & Awards Microsoft Certified Professional (MCP) \nMicrosoft Certified System Engineer (MCSE) \nSun Solaris 9 Certified systems Administrator \nSun Solaris 9 Certified Network Administrator ", "Summary 1. 11.5 Years (as on Jan/2014) of experience in software industry.  \n2. 9 Years of experience in DevOps (http://en.wikipedia.org/wiki/DevOps) role \n3. 1.5 Years of experience as Engineering Manager. Managed medium sized teams. \n4. Around 2 years of experience working with BigData technologies (Hadoop,Hbase,Storm,Hive,HiveServer) \n5. Have experience in managing one of the biggest Hadoop Clusters in the world in Yahoo! \n6. Has experience in working with team spread across globe \n7. Have build SME (Subject Matter Experts) in team also have worked effectively in eliminating SPOK (Single Point Of Knowledge) \n8. Have experience in recruiting, coaching and building teams from ground up. Managing high performance teams that deliver high quality operational services on “tight” deadlines. Maintaining high team morale. Establishing technical best practices and strong team culture. \n9. Strong focus on product metrics, KPI’s, risk assessment, operation excellence of large scale systems. \n10. Have the ability to quickly and accurately determine critical engineering issues and delegate or nominate appropriate resources to resolve. At times, directly develop (jointly, with line personnel) solutions to those issues. \n11. Expertise in large-scale webhosting and e-commerce platform. Worked as principal engineer for Yahoo! Small business platform \n12. Has expertise in implementing multiple methods to mitigate network based distributed denial of service attacks (DDoS). Have dealt with HTTP brute force, ICMP Flood, SYN Flood, Malformed HTTP header attack, DNS brute force attack. \n13. Worked on content-based abuse detection & mitigation. Implemented tools to detect malware, virus distribution, phishing urls & malicious scripts. \n14. Have experience in designing high availability webhosting platform by implementing GSLB & DNS anycast. \n15. Expertise in Large Scale Capacity Analysis & Planning. Has done capacity analysis & planning for multiple web hosting farms. Summary 1. 11.5 Years (as on Jan/2014) of experience in software industry.  \n2. 9 Years of experience in DevOps (http://en.wikipedia.org/wiki/DevOps) role \n3. 1.5 Years of experience as Engineering Manager. Managed medium sized teams. \n4. Around 2 years of experience working with BigData technologies (Hadoop,Hbase,Storm,Hive,HiveServer) \n5. Have experience in managing one of the biggest Hadoop Clusters in the world in Yahoo! \n6. Has experience in working with team spread across globe \n7. Have build SME (Subject Matter Experts) in team also have worked effectively in eliminating SPOK (Single Point Of Knowledge) \n8. Have experience in recruiting, coaching and building teams from ground up. Managing high performance teams that deliver high quality operational services on “tight” deadlines. Maintaining high team morale. Establishing technical best practices and strong team culture. \n9. Strong focus on product metrics, KPI’s, risk assessment, operation excellence of large scale systems. \n10. Have the ability to quickly and accurately determine critical engineering issues and delegate or nominate appropriate resources to resolve. At times, directly develop (jointly, with line personnel) solutions to those issues. \n11. Expertise in large-scale webhosting and e-commerce platform. Worked as principal engineer for Yahoo! Small business platform \n12. Has expertise in implementing multiple methods to mitigate network based distributed denial of service attacks (DDoS). Have dealt with HTTP brute force, ICMP Flood, SYN Flood, Malformed HTTP header attack, DNS brute force attack. \n13. Worked on content-based abuse detection & mitigation. Implemented tools to detect malware, virus distribution, phishing urls & malicious scripts. \n14. Have experience in designing high availability webhosting platform by implementing GSLB & DNS anycast. \n15. Expertise in Large Scale Capacity Analysis & Planning. Has done capacity analysis & planning for multiple web hosting farms. 1. 11.5 Years (as on Jan/2014) of experience in software industry.  \n2. 9 Years of experience in DevOps (http://en.wikipedia.org/wiki/DevOps) role \n3. 1.5 Years of experience as Engineering Manager. Managed medium sized teams. \n4. Around 2 years of experience working with BigData technologies (Hadoop,Hbase,Storm,Hive,HiveServer) \n5. Have experience in managing one of the biggest Hadoop Clusters in the world in Yahoo! \n6. Has experience in working with team spread across globe \n7. Have build SME (Subject Matter Experts) in team also have worked effectively in eliminating SPOK (Single Point Of Knowledge) \n8. Have experience in recruiting, coaching and building teams from ground up. Managing high performance teams that deliver high quality operational services on “tight” deadlines. Maintaining high team morale. Establishing technical best practices and strong team culture. \n9. Strong focus on product metrics, KPI’s, risk assessment, operation excellence of large scale systems. \n10. Have the ability to quickly and accurately determine critical engineering issues and delegate or nominate appropriate resources to resolve. At times, directly develop (jointly, with line personnel) solutions to those issues. \n11. Expertise in large-scale webhosting and e-commerce platform. Worked as principal engineer for Yahoo! Small business platform \n12. Has expertise in implementing multiple methods to mitigate network based distributed denial of service attacks (DDoS). Have dealt with HTTP brute force, ICMP Flood, SYN Flood, Malformed HTTP header attack, DNS brute force attack. \n13. Worked on content-based abuse detection & mitigation. Implemented tools to detect malware, virus distribution, phishing urls & malicious scripts. \n14. Have experience in designing high availability webhosting platform by implementing GSLB & DNS anycast. \n15. Expertise in Large Scale Capacity Analysis & Planning. Has done capacity analysis & planning for multiple web hosting farms. 1. 11.5 Years (as on Jan/2014) of experience in software industry.  \n2. 9 Years of experience in DevOps (http://en.wikipedia.org/wiki/DevOps) role \n3. 1.5 Years of experience as Engineering Manager. Managed medium sized teams. \n4. Around 2 years of experience working with BigData technologies (Hadoop,Hbase,Storm,Hive,HiveServer) \n5. Have experience in managing one of the biggest Hadoop Clusters in the world in Yahoo! \n6. Has experience in working with team spread across globe \n7. Have build SME (Subject Matter Experts) in team also have worked effectively in eliminating SPOK (Single Point Of Knowledge) \n8. Have experience in recruiting, coaching and building teams from ground up. Managing high performance teams that deliver high quality operational services on “tight” deadlines. Maintaining high team morale. Establishing technical best practices and strong team culture. \n9. Strong focus on product metrics, KPI’s, risk assessment, operation excellence of large scale systems. \n10. Have the ability to quickly and accurately determine critical engineering issues and delegate or nominate appropriate resources to resolve. At times, directly develop (jointly, with line personnel) solutions to those issues. \n11. Expertise in large-scale webhosting and e-commerce platform. Worked as principal engineer for Yahoo! Small business platform \n12. Has expertise in implementing multiple methods to mitigate network based distributed denial of service attacks (DDoS). Have dealt with HTTP brute force, ICMP Flood, SYN Flood, Malformed HTTP header attack, DNS brute force attack. \n13. Worked on content-based abuse detection & mitigation. Implemented tools to detect malware, virus distribution, phishing urls & malicious scripts. \n14. Have experience in designing high availability webhosting platform by implementing GSLB & DNS anycast. \n15. Expertise in Large Scale Capacity Analysis & Planning. Has done capacity analysis & planning for multiple web hosting farms. Experience Staff Engineer LinkedIn June 2015  – Present (3 months) Bengaluru Area, India Senior Development Manager Intuit 2014  – Present (1 year) Bangalore Senior Development Manager (Operations & QE) Mgr, Service Eng Yahoo! October 2012  – Present (2 years 11 months) Bangalore Principal engineer Yahoo! July 2012  –  October 2012  (4 months) India Yahoo grid infrastructure. Principal Engineer Yahoo! October 2011  –  July 2012  (10 months) Bangalore Principal Engineer Small business/Yahoo Store Tech Lead Yahoo! June 2006  –  October 2011  (5 years 5 months) senior software engineer Bobcares June 2003  –  June 2006  (3 years 1 month) Staff Engineer LinkedIn June 2015  – Present (3 months) Bengaluru Area, India Staff Engineer LinkedIn June 2015  – Present (3 months) Bengaluru Area, India Senior Development Manager Intuit 2014  – Present (1 year) Bangalore Senior Development Manager (Operations & QE) Senior Development Manager Intuit 2014  – Present (1 year) Bangalore Senior Development Manager (Operations & QE) Mgr, Service Eng Yahoo! October 2012  – Present (2 years 11 months) Bangalore Mgr, Service Eng Yahoo! October 2012  – Present (2 years 11 months) Bangalore Principal engineer Yahoo! July 2012  –  October 2012  (4 months) India Yahoo grid infrastructure. Principal engineer Yahoo! July 2012  –  October 2012  (4 months) India Yahoo grid infrastructure. Principal Engineer Yahoo! October 2011  –  July 2012  (10 months) Bangalore Principal Engineer Small business/Yahoo Store Principal Engineer Yahoo! October 2011  –  July 2012  (10 months) Bangalore Principal Engineer Small business/Yahoo Store Tech Lead Yahoo! June 2006  –  October 2011  (5 years 5 months) Tech Lead Yahoo! June 2006  –  October 2011  (5 years 5 months) senior software engineer Bobcares June 2003  –  June 2006  (3 years 1 month) senior software engineer Bobcares June 2003  –  June 2006  (3 years 1 month) Skills Perl Apache Hadoop Unix High Availability DNS MySQL Linux Databases JavaScript Unix Shell Scripting Web Hosting Open Source E-commerce HBase TCP/IP Linux Kernel DDoS Mitigation Traffic Management Project Planning Awk Software Project... Tcpdump Kerberos Linux Internals DNS administration Unix Administration Anycast apache traffic server Yarn Amazon Web Services... Shell Scripting See 17+     See less Skills  Perl Apache Hadoop Unix High Availability DNS MySQL Linux Databases JavaScript Unix Shell Scripting Web Hosting Open Source E-commerce HBase TCP/IP Linux Kernel DDoS Mitigation Traffic Management Project Planning Awk Software Project... Tcpdump Kerberos Linux Internals DNS administration Unix Administration Anycast apache traffic server Yarn Amazon Web Services... Shell Scripting See 17+     See less Perl Apache Hadoop Unix High Availability DNS MySQL Linux Databases JavaScript Unix Shell Scripting Web Hosting Open Source E-commerce HBase TCP/IP Linux Kernel DDoS Mitigation Traffic Management Project Planning Awk Software Project... Tcpdump Kerberos Linux Internals DNS administration Unix Administration Anycast apache traffic server Yarn Amazon Web Services... Shell Scripting See 17+     See less Perl Apache Hadoop Unix High Availability DNS MySQL Linux Databases JavaScript Unix Shell Scripting Web Hosting Open Source E-commerce HBase TCP/IP Linux Kernel DDoS Mitigation Traffic Management Project Planning Awk Software Project... Tcpdump Kerberos Linux Internals DNS administration Unix Administration Anycast apache traffic server Yarn Amazon Web Services... Shell Scripting See 17+     See less Education Cochin University of Science and Technology B.Tech,  Computer Science 1999  – 2003 Cochin University of Science and Technology B.Tech,  Computer Science 1999  – 2003 Cochin University of Science and Technology B.Tech,  Computer Science 1999  – 2003 Cochin University of Science and Technology B.Tech,  Computer Science 1999  – 2003 Honors & Awards Q2 2013 Yahoo Globe award Yahoo June 2013 Q2 2013 Yahoo Globe award Yahoo June 2013 Q2 2013 Yahoo Globe award Yahoo June 2013 Q2 2013 Yahoo Globe award Yahoo June 2013 ", "Summary I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. Summary I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. I love creating software every day, I have lots of ideas, and a working knowledge of a wide range of technologies such as: Frontend (React.js, PHP, HTML, CSS, JavaScript [raw, YUI, jquery]), Backend (Node.js, React.js, Java, C, C++, apache httpd, PHP, Perl, Shell scripting, GNU tools), Databases (MySQL, Oracle, DAO and ORM concepts), and Grid computing (Hadoop Map/Reduce, Pig, Oozie). I also know my way around sysadmin tasks, and around DevOps things like: AWS and DNS management. \n \nI wish to work on software that I feel passionate about together with enthusiastic peers and to put my accrued skillset to work by solving challenging and interesting problems. Experience Software Engineer Etsy 2015  – Present (less than a year) San Francisco, California Sr. Software Engineer - YDN Team Yahoo! May 2013  – Present (2 years 4 months) Sunnyvale, CA USA Revamping Yahoo!'s sites featuring technology offerings that the company provides for third party/independent developers. \n \nIdeating and executing on a corporate repository of development technology knowledge redesign, implementation and re-launch. Sr. Software Engineer - Carmot Media Team Yahoo! May 2012  –  May 2013  (1 year 1 month) Sunnyvale, CA USA Work on the addition of new features as well as providing bug fixes for Carmot: Yahoo!'s massive storage and serving platform of media content (news agencies stories, videos as well as some user generated content). \n \nOnline storage and serving components are built using C++ and run on a RHEL Linux environment. \n \nOffline storage and enrichment components are in a large Hadoop cluster and make use of Hadoop Map/Reduce, Hadoop Pig, and Hadoop Oozie technologies. Sr. Software Engineer - Content Agility Solutions Team Yahoo! July 2010  –  April 2012  (1 year 10 months) Sunnyvale, CA USA Designed and built systems to facilitate the company-wide effort to move away from siloed data stores and into cloud based platforms. \n \nProvided cloud platform customers with programs to bring data into the company's cloud platform (data onboarding). \n \nProvided cloud platform customers with reference implementations and prototypes of programs to build offline enrichments using cloud infrastructure. Mainly used Hadoop Map/Reduce, Hadoop Pig and Hadoop Oozie. \n \nServed as a liaison between cloud platform customers and cloud platform owners, advocating for better understanding among the parties. On one hand, encouraged customers to follow platform guidelines, and on the other one, argued in favor of implementation of customer requests. Sr. Software Engineer - Localization Tools Team Yahoo! Inc. January 2009  –  June 2010  (1 year 6 months) Sunnyvale, CA USA Implemented a REST based API to back a crowd-sourcing translation contribution system. Unit testing code coverage as well as static analysis in a continuous integration environment were used to enforce high quality standards. \n \nDesigned and implemented a workflow engine on the centralized localization system to allow the management of translations originating from different sources: vendor provided, in-house editorially provided, user contributed. \n \nImplemented tools for developers and release engineering to integrate into the development cycle while ensuring a correct translation package was available at every stage. Software Engineer - Localization Tools Team Yahoo! January 2008  –  December 2008  (1 year) Sunnyvale, CA USA Played a key role in the internationalization effort on high priority project \"Yahoo! Open Strategy\" by working with the team to ensure that all deliverables were built with internationalization in mind from the start. \n \nProvided tools that are used during release/deployment to make sure that releases ship with the right language and localization packs. \n \nWorked on regular sprint tasks once the project had a good internationalization foundation. Software Engineer - International Tiger Team Yahoo! October 2005  –  December 2007  (2 years 3 months) Sunnyvale, CA USA Designed and implemented internationalization features of new and existing Yahoo! properties: Y! Answers, Y! 360. \n \nDeveloped dynamic checking system for validating systems' correct handling of character encodings that is still in use and is used to check web content for many format and encoding related issues prior to pushing it live. Software Engineer Etsy 2015  – Present (less than a year) San Francisco, California Software Engineer Etsy 2015  – Present (less than a year) San Francisco, California Sr. Software Engineer - YDN Team Yahoo! May 2013  – Present (2 years 4 months) Sunnyvale, CA USA Revamping Yahoo!'s sites featuring technology offerings that the company provides for third party/independent developers. \n \nIdeating and executing on a corporate repository of development technology knowledge redesign, implementation and re-launch. Sr. Software Engineer - YDN Team Yahoo! May 2013  – Present (2 years 4 months) Sunnyvale, CA USA Revamping Yahoo!'s sites featuring technology offerings that the company provides for third party/independent developers. \n \nIdeating and executing on a corporate repository of development technology knowledge redesign, implementation and re-launch. Sr. Software Engineer - Carmot Media Team Yahoo! May 2012  –  May 2013  (1 year 1 month) Sunnyvale, CA USA Work on the addition of new features as well as providing bug fixes for Carmot: Yahoo!'s massive storage and serving platform of media content (news agencies stories, videos as well as some user generated content). \n \nOnline storage and serving components are built using C++ and run on a RHEL Linux environment. \n \nOffline storage and enrichment components are in a large Hadoop cluster and make use of Hadoop Map/Reduce, Hadoop Pig, and Hadoop Oozie technologies. Sr. Software Engineer - Carmot Media Team Yahoo! May 2012  –  May 2013  (1 year 1 month) Sunnyvale, CA USA Work on the addition of new features as well as providing bug fixes for Carmot: Yahoo!'s massive storage and serving platform of media content (news agencies stories, videos as well as some user generated content). \n \nOnline storage and serving components are built using C++ and run on a RHEL Linux environment. \n \nOffline storage and enrichment components are in a large Hadoop cluster and make use of Hadoop Map/Reduce, Hadoop Pig, and Hadoop Oozie technologies. Sr. Software Engineer - Content Agility Solutions Team Yahoo! July 2010  –  April 2012  (1 year 10 months) Sunnyvale, CA USA Designed and built systems to facilitate the company-wide effort to move away from siloed data stores and into cloud based platforms. \n \nProvided cloud platform customers with programs to bring data into the company's cloud platform (data onboarding). \n \nProvided cloud platform customers with reference implementations and prototypes of programs to build offline enrichments using cloud infrastructure. Mainly used Hadoop Map/Reduce, Hadoop Pig and Hadoop Oozie. \n \nServed as a liaison between cloud platform customers and cloud platform owners, advocating for better understanding among the parties. On one hand, encouraged customers to follow platform guidelines, and on the other one, argued in favor of implementation of customer requests. Sr. Software Engineer - Content Agility Solutions Team Yahoo! July 2010  –  April 2012  (1 year 10 months) Sunnyvale, CA USA Designed and built systems to facilitate the company-wide effort to move away from siloed data stores and into cloud based platforms. \n \nProvided cloud platform customers with programs to bring data into the company's cloud platform (data onboarding). \n \nProvided cloud platform customers with reference implementations and prototypes of programs to build offline enrichments using cloud infrastructure. Mainly used Hadoop Map/Reduce, Hadoop Pig and Hadoop Oozie. \n \nServed as a liaison between cloud platform customers and cloud platform owners, advocating for better understanding among the parties. On one hand, encouraged customers to follow platform guidelines, and on the other one, argued in favor of implementation of customer requests. Sr. Software Engineer - Localization Tools Team Yahoo! Inc. January 2009  –  June 2010  (1 year 6 months) Sunnyvale, CA USA Implemented a REST based API to back a crowd-sourcing translation contribution system. Unit testing code coverage as well as static analysis in a continuous integration environment were used to enforce high quality standards. \n \nDesigned and implemented a workflow engine on the centralized localization system to allow the management of translations originating from different sources: vendor provided, in-house editorially provided, user contributed. \n \nImplemented tools for developers and release engineering to integrate into the development cycle while ensuring a correct translation package was available at every stage. Sr. Software Engineer - Localization Tools Team Yahoo! Inc. January 2009  –  June 2010  (1 year 6 months) Sunnyvale, CA USA Implemented a REST based API to back a crowd-sourcing translation contribution system. Unit testing code coverage as well as static analysis in a continuous integration environment were used to enforce high quality standards. \n \nDesigned and implemented a workflow engine on the centralized localization system to allow the management of translations originating from different sources: vendor provided, in-house editorially provided, user contributed. \n \nImplemented tools for developers and release engineering to integrate into the development cycle while ensuring a correct translation package was available at every stage. Software Engineer - Localization Tools Team Yahoo! January 2008  –  December 2008  (1 year) Sunnyvale, CA USA Played a key role in the internationalization effort on high priority project \"Yahoo! Open Strategy\" by working with the team to ensure that all deliverables were built with internationalization in mind from the start. \n \nProvided tools that are used during release/deployment to make sure that releases ship with the right language and localization packs. \n \nWorked on regular sprint tasks once the project had a good internationalization foundation. Software Engineer - Localization Tools Team Yahoo! January 2008  –  December 2008  (1 year) Sunnyvale, CA USA Played a key role in the internationalization effort on high priority project \"Yahoo! Open Strategy\" by working with the team to ensure that all deliverables were built with internationalization in mind from the start. \n \nProvided tools that are used during release/deployment to make sure that releases ship with the right language and localization packs. \n \nWorked on regular sprint tasks once the project had a good internationalization foundation. Software Engineer - International Tiger Team Yahoo! October 2005  –  December 2007  (2 years 3 months) Sunnyvale, CA USA Designed and implemented internationalization features of new and existing Yahoo! properties: Y! Answers, Y! 360. \n \nDeveloped dynamic checking system for validating systems' correct handling of character encodings that is still in use and is used to check web content for many format and encoding related issues prior to pushing it live. Software Engineer - International Tiger Team Yahoo! October 2005  –  December 2007  (2 years 3 months) Sunnyvale, CA USA Designed and implemented internationalization features of new and existing Yahoo! properties: Y! Answers, Y! 360. \n \nDeveloped dynamic checking system for validating systems' correct handling of character encodings that is still in use and is used to check web content for many format and encoding related issues prior to pushing it live. Skills Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Skills  Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Hadoop REST Perl Software Engineering JavaScript MySQL Cloud Computing Continuous Integration PHP Distributed Systems Scalability Java MapReduce Apache Pig jQuery Localization Integration Mobile Applications Shell Scripting Oozie HTML Unix Shell Scripting YUI ORM Apache C++ Agile Methodologies JUnit Tomcat Node.js Metalsmith HTML5 css Amazon Web Services... Amazon EC2 Google App Engine Git Github See 23+     See less Education Universidad Autónoma Metropolitana 1997  – 2002 Universidad Autónoma Metropolitana 1997  – 2002 Universidad Autónoma Metropolitana 1997  – 2002 Universidad Autónoma Metropolitana 1997  – 2002 ", "Experience Head of Production Engineering - Yahoo Mobile and Emerging Products Yahoo April 2013  – Present (2 years 5 months) Sunnyvale, CA Overall leadership of Production Engineering for the newly created Mobile and Emerging Products organization concentrating on iOS and Android native mobile apps and emerging products such as Flickr and Smart TV products. Focus is on performance, availability and operability of the entire portfolio of products through a DevOps model. Head of Production Engineering - Yahoo Mobile and Emerging Products Yahoo April 2013  – Present (2 years 5 months) Sunnyvale, CA Overall leadership of Production Engineering for the newly created Mobile and Emerging Products organization concentrating on iOS and Android native mobile apps and emerging products such as Flickr and Smart TV products. Focus is on performance, availability and operability of the entire portfolio of products through a DevOps model. Head of Production Engineering - Yahoo Mobile and Emerging Products Yahoo April 2013  – Present (2 years 5 months) Sunnyvale, CA Overall leadership of Production Engineering for the newly created Mobile and Emerging Products organization concentrating on iOS and Android native mobile apps and emerging products such as Flickr and Smart TV products. Focus is on performance, availability and operability of the entire portfolio of products through a DevOps model. Skills Mobile Devices Scalability Apache Agile Methodologies LAMP Scrum Perl REST Hadoop Distributed Systems Git Linux Mobile Applications Web Applications Ruby Shell Scripting Amazon Web Services... Subversion Web Services E-commerce High Availability User Experience Agile Project Management PHP JSON Open Source DevOps Web Analytics MySQL Information Architecture JavaScript Web Development Large Scale Systems Production Engineering Service Engineering See 20+     See less Skills  Mobile Devices Scalability Apache Agile Methodologies LAMP Scrum Perl REST Hadoop Distributed Systems Git Linux Mobile Applications Web Applications Ruby Shell Scripting Amazon Web Services... Subversion Web Services E-commerce High Availability User Experience Agile Project Management PHP JSON Open Source DevOps Web Analytics MySQL Information Architecture JavaScript Web Development Large Scale Systems Production Engineering Service Engineering See 20+     See less Mobile Devices Scalability Apache Agile Methodologies LAMP Scrum Perl REST Hadoop Distributed Systems Git Linux Mobile Applications Web Applications Ruby Shell Scripting Amazon Web Services... Subversion Web Services E-commerce High Availability User Experience Agile Project Management PHP JSON Open Source DevOps Web Analytics MySQL Information Architecture JavaScript Web Development Large Scale Systems Production Engineering Service Engineering See 20+     See less Mobile Devices Scalability Apache Agile Methodologies LAMP Scrum Perl REST Hadoop Distributed Systems Git Linux Mobile Applications Web Applications Ruby Shell Scripting Amazon Web Services... Subversion Web Services E-commerce High Availability User Experience Agile Project Management PHP JSON Open Source DevOps Web Analytics MySQL Information Architecture JavaScript Web Development Large Scale Systems Production Engineering Service Engineering See 20+     See less ", "Experience Software Engineer - Yahoo! Cloud Services Yahoo June 2014  – Present (1 year 3 months) San Francisco Bay Area Software Engineer - Yahoo! Cloud Services Yahoo June 2014  – Present (1 year 3 months) San Francisco Bay Area Software Engineer - Yahoo! Cloud Services Yahoo June 2014  – Present (1 year 3 months) San Francisco Bay Area Skills System Administration Linux Databases Shell Scripting Problem Solving Process Improvement Apache Bash Team Leadership Time Management Virtualization DNS Teaching Scalability Mentoring Project Management Lateral Thinking Mobile Devices High Availability Distributed Systems TCP/IP Continuous Integration Operations Management Strategy Training & Development Customer Service System Architecture Systems Engineering Creative Problem Solving Large Scale Systems Project Planning Hudson Agile Methodologies Kanban Requirements Analysis Cloud Computing IaaS Management See 22+     See less Skills  System Administration Linux Databases Shell Scripting Problem Solving Process Improvement Apache Bash Team Leadership Time Management Virtualization DNS Teaching Scalability Mentoring Project Management Lateral Thinking Mobile Devices High Availability Distributed Systems TCP/IP Continuous Integration Operations Management Strategy Training & Development Customer Service System Architecture Systems Engineering Creative Problem Solving Large Scale Systems Project Planning Hudson Agile Methodologies Kanban Requirements Analysis Cloud Computing IaaS Management See 22+     See less System Administration Linux Databases Shell Scripting Problem Solving Process Improvement Apache Bash Team Leadership Time Management Virtualization DNS Teaching Scalability Mentoring Project Management Lateral Thinking Mobile Devices High Availability Distributed Systems TCP/IP Continuous Integration Operations Management Strategy Training & Development Customer Service System Architecture Systems Engineering Creative Problem Solving Large Scale Systems Project Planning Hudson Agile Methodologies Kanban Requirements Analysis Cloud Computing IaaS Management See 22+     See less System Administration Linux Databases Shell Scripting Problem Solving Process Improvement Apache Bash Team Leadership Time Management Virtualization DNS Teaching Scalability Mentoring Project Management Lateral Thinking Mobile Devices High Availability Distributed Systems TCP/IP Continuous Integration Operations Management Strategy Training & Development Customer Service System Architecture Systems Engineering Creative Problem Solving Large Scale Systems Project Planning Hudson Agile Methodologies Kanban Requirements Analysis Cloud Computing IaaS Management See 22+     See less Education Stanford University 2011 DePaul University Master of Science 2005  – 2007 Wyższa Szkoła Biznesu - National Louis University w Nowym Sączu Bachelor of Arts 2002  – 2005 Cisco Certified Network Associate 2003  – 2005 Microsoft MCP 2005  – 2005 Stanford University 2011 Stanford University 2011 Stanford University 2011 DePaul University Master of Science 2005  – 2007 DePaul University Master of Science 2005  – 2007 DePaul University Master of Science 2005  – 2007 Wyższa Szkoła Biznesu - National Louis University w Nowym Sączu Bachelor of Arts 2002  – 2005 Wyższa Szkoła Biznesu - National Louis University w Nowym Sączu Bachelor of Arts 2002  – 2005 Wyższa Szkoła Biznesu - National Louis University w Nowym Sączu Bachelor of Arts 2002  – 2005 Cisco Certified Network Associate 2003  – 2005 Cisco Certified Network Associate 2003  – 2005 Cisco Certified Network Associate 2003  – 2005 Microsoft MCP 2005  – 2005 Microsoft MCP 2005  – 2005 Microsoft MCP 2005  – 2005 Honors & Awards ", "Summary Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Summary Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Striving to lead a team of rockstars, delivering smashing results! Specialties:Linux clustering \nFoundry and F5 load-balancers \nMonitoring: Nagios, Sitescope, Keynotes, Collectd Experience Senior Manager, Service Engineering, Yahoo Communications Yahoo May 2015  – Present (4 months) Responsible for Mail Anti-spam/Delivery, Mail Metadata (VX/Force), Mail Search (Vespa/Force), and Mail BE Services (Homefarm/JEDI services). \n \nManage multiple service engineering teams, managing 30k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo April 2014  –  May 2015  (1 year 2 months) Responsible for Mail anti-spam/delivery, Mail Release Engineering, and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Mail Anti-spam/Delivery & Messenger Yahoo! June 2012  –  March 2014  (1 year 10 months) Sunnyvale, CA Responsible for Mail anti-spam/delivery and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Messenger Yahoo! March 2010  –  June 2012  (2 years 4 months) Sunnyvale, CA Manage a team of senior service engineers, managing thousands of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Manager, Systems Operations Kodak Gallery March 2008  –  March 2010  (2 years 1 month) Emeryville, CA Manage a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Team Lead, Systems Operations Kodak Gallery April 2007  –  March 2008  (1 year) Emeryville, CA Lead a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. UNIX Systems Administrator, Systems Operations Kodak Gallery September 2005  –  April 2007  (1 year 8 months) Emeryville, CA Support an online e-commerce site, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Windows Systems Administrator, Corporate IT Kodak Gallery August 2003  –  September 2005  (2 years 2 months) Emeryville, CA IS Engineer Incyte Genomics July 2002  –  November 2002  (5 months) Palo Alto, CA Systems Administrator Coradiant October 2000  –  April 2002  (1 year 7 months) Senior Manager, Service Engineering, Yahoo Communications Yahoo May 2015  – Present (4 months) Responsible for Mail Anti-spam/Delivery, Mail Metadata (VX/Force), Mail Search (Vespa/Force), and Mail BE Services (Homefarm/JEDI services). \n \nManage multiple service engineering teams, managing 30k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo May 2015  – Present (4 months) Responsible for Mail Anti-spam/Delivery, Mail Metadata (VX/Force), Mail Search (Vespa/Force), and Mail BE Services (Homefarm/JEDI services). \n \nManage multiple service engineering teams, managing 30k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo April 2014  –  May 2015  (1 year 2 months) Responsible for Mail anti-spam/delivery, Mail Release Engineering, and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Senior Manager, Service Engineering, Yahoo Communications Yahoo April 2014  –  May 2015  (1 year 2 months) Responsible for Mail anti-spam/delivery, Mail Release Engineering, and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Mail Anti-spam/Delivery & Messenger Yahoo! June 2012  –  March 2014  (1 year 10 months) Sunnyvale, CA Responsible for Mail anti-spam/delivery and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Mail Anti-spam/Delivery & Messenger Yahoo! June 2012  –  March 2014  (1 year 10 months) Sunnyvale, CA Responsible for Mail anti-spam/delivery and Messenger. \n \nManage multiple service engineering teams, managing 10k+ of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Messenger Yahoo! March 2010  –  June 2012  (2 years 4 months) Sunnyvale, CA Manage a team of senior service engineers, managing thousands of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Service Engineering Manager, Yahoo! Messenger Yahoo! March 2010  –  June 2012  (2 years 4 months) Sunnyvale, CA Manage a team of senior service engineers, managing thousands of application servers in a 24x7 environment, spanning multiple data centers. Tasks involve project management, incident management, release management, escalation manager, coordinating efforts with development, people manager (mentor and develop career growth of staff), participate in oncall rotation, bug triaging and remediation, etc. Manager, Systems Operations Kodak Gallery March 2008  –  March 2010  (2 years 1 month) Emeryville, CA Manage a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Manager, Systems Operations Kodak Gallery March 2008  –  March 2010  (2 years 1 month) Emeryville, CA Manage a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Team Lead, Systems Operations Kodak Gallery April 2007  –  March 2008  (1 year) Emeryville, CA Lead a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Team Lead, Systems Operations Kodak Gallery April 2007  –  March 2008  (1 year) Emeryville, CA Lead a team of linux administrators, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. UNIX Systems Administrator, Systems Operations Kodak Gallery September 2005  –  April 2007  (1 year 8 months) Emeryville, CA Support an online e-commerce site, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. UNIX Systems Administrator, Systems Operations Kodak Gallery September 2005  –  April 2007  (1 year 8 months) Emeryville, CA Support an online e-commerce site, managing 1000+ application servers in a 24x7 environment, spanning multiple data centers. Windows Systems Administrator, Corporate IT Kodak Gallery August 2003  –  September 2005  (2 years 2 months) Emeryville, CA Windows Systems Administrator, Corporate IT Kodak Gallery August 2003  –  September 2005  (2 years 2 months) Emeryville, CA IS Engineer Incyte Genomics July 2002  –  November 2002  (5 months) Palo Alto, CA IS Engineer Incyte Genomics July 2002  –  November 2002  (5 months) Palo Alto, CA Systems Administrator Coradiant October 2000  –  April 2002  (1 year 7 months) Systems Administrator Coradiant October 2000  –  April 2002  (1 year 7 months) Skills RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less Skills  RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less RHCT RHCSA Linux BSD Load Balancing Nagios SiteScope mcse DNS Bugzilla TeamTrack Remedy JIRA MRTG Orca Windows Server 2003 Shell Scripting Project Planning Incident Management Capacity Planning Escalation Management Staff Development Release Management Data Center Bug Tracking VPN Qmail Anti-spam Memcached RHEL SSL DevOps SMTP Scrum Agile Project Management Kanban High Availability Apache Nginx Unix Scalability Distributed Systems Red Hat Linux REST FreeBSD Linux System... Large Scale Systems Agile Methodologies TCP/IP Technical Leadership See 35+     See less Education University of California, Berkeley Certificate 2004  – 2006 University of California, Los Angeles 1992  – 1997 University of California, Berkeley Certificate 2004  – 2006 University of California, Berkeley Certificate 2004  – 2006 University of California, Berkeley Certificate 2004  – 2006 University of California, Los Angeles 1992  – 1997 University of California, Los Angeles 1992  – 1997 University of California, Los Angeles 1992  – 1997 Honors & Awards 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner 2012 Q1 SE&O Hackovation award winner Yahoo May 2012 2012 Q1 SE&O Hackovation award winner "]}