{"position": "Design Consultant", "company": "Google", "profiles": ["Experience Hardware Design Engineer (High End Router and Optical Group) Cisco Systems 2011  – Present (4 years) San Jose, California NCS-6000 Core Router Development \n•Assisted in development of the NCS-6000 10 Port 100 Gbps CXP and CPAK linecards - industry’s first 1Tb/s router linecards \n•Designed the NCS-6000 60 Port 10 Gbps linecard daughtercard assembly. \n•Supported software, manufacturing, and test teams through pre-pilot and production. \n•Designed and developed the CPAK module test board to validate support circuitry for the NCS-6000 CPAK linecard. Hardware Design Engineer (Core Optics and Routing Business Unit) Cisco July 2008  –  2011  (3 years) San Jose, California CRS-3 Core Router Hardware Development \n•Design prime for Cisco CRS-16/S 140 Gbps Multichassis Fabric Card \n•Design prime for Cisco CRS-4/S 140 Gbps Fabric Card \n•Design lead for Cisco CRS-16 Fan Controller timing and glue logic FPGA. Electronics Design Verification and Test Intern Cisco Systems May 2007  –  December 2007  (8 months) San Jose, California Cisco 7600 Test and Verification \n•Tested and validated design and component changes on production and prototype hardware. \n•Developed test scripts to exercise the robustness of design changes. \n•Performed system level verification tasks using diagnostic and functional verification techniques. Hardware Design Engineer (High End Router and Optical Group) Cisco Systems 2011  – Present (4 years) San Jose, California NCS-6000 Core Router Development \n•Assisted in development of the NCS-6000 10 Port 100 Gbps CXP and CPAK linecards - industry’s first 1Tb/s router linecards \n•Designed the NCS-6000 60 Port 10 Gbps linecard daughtercard assembly. \n•Supported software, manufacturing, and test teams through pre-pilot and production. \n•Designed and developed the CPAK module test board to validate support circuitry for the NCS-6000 CPAK linecard. Hardware Design Engineer (High End Router and Optical Group) Cisco Systems 2011  – Present (4 years) San Jose, California NCS-6000 Core Router Development \n•Assisted in development of the NCS-6000 10 Port 100 Gbps CXP and CPAK linecards - industry’s first 1Tb/s router linecards \n•Designed the NCS-6000 60 Port 10 Gbps linecard daughtercard assembly. \n•Supported software, manufacturing, and test teams through pre-pilot and production. \n•Designed and developed the CPAK module test board to validate support circuitry for the NCS-6000 CPAK linecard. Hardware Design Engineer (Core Optics and Routing Business Unit) Cisco July 2008  –  2011  (3 years) San Jose, California CRS-3 Core Router Hardware Development \n•Design prime for Cisco CRS-16/S 140 Gbps Multichassis Fabric Card \n•Design prime for Cisco CRS-4/S 140 Gbps Fabric Card \n•Design lead for Cisco CRS-16 Fan Controller timing and glue logic FPGA. Hardware Design Engineer (Core Optics and Routing Business Unit) Cisco July 2008  –  2011  (3 years) San Jose, California CRS-3 Core Router Hardware Development \n•Design prime for Cisco CRS-16/S 140 Gbps Multichassis Fabric Card \n•Design prime for Cisco CRS-4/S 140 Gbps Fabric Card \n•Design lead for Cisco CRS-16 Fan Controller timing and glue logic FPGA. Electronics Design Verification and Test Intern Cisco Systems May 2007  –  December 2007  (8 months) San Jose, California Cisco 7600 Test and Verification \n•Tested and validated design and component changes on production and prototype hardware. \n•Developed test scripts to exercise the robustness of design changes. \n•Performed system level verification tasks using diagnostic and functional verification techniques. Electronics Design Verification and Test Intern Cisco Systems May 2007  –  December 2007  (8 months) San Jose, California Cisco 7600 Test and Verification \n•Tested and validated design and component changes on production and prototype hardware. \n•Developed test scripts to exercise the robustness of design changes. \n•Performed system level verification tasks using diagnostic and functional verification techniques. Skills Testing Hardware Debugging Cisco Technologies Skills  Testing Hardware Debugging Cisco Technologies Testing Hardware Debugging Cisco Technologies Testing Hardware Debugging Cisco Technologies Education University of the Pacific Bachelor of Science (B.S.),  Computer Engineering 2003  – 2008 University of the Pacific Bachelor of Science (B.S.),  Computer Engineering 2003  – 2008 University of the Pacific Bachelor of Science (B.S.),  Computer Engineering 2003  – 2008 University of the Pacific Bachelor of Science (B.S.),  Computer Engineering 2003  – 2008 ", "Summary Professional engineer with more than 10 years of experience in networking products development. Solid technical expertise and flexible debug skills. Excellent team work spirit. Ability to deliver feature-rich and cost-effective products in high-quality on time. Summary Professional engineer with more than 10 years of experience in networking products development. Solid technical expertise and flexible debug skills. Excellent team work spirit. Ability to deliver feature-rich and cost-effective products in high-quality on time. Professional engineer with more than 10 years of experience in networking products development. Solid technical expertise and flexible debug skills. Excellent team work spirit. Ability to deliver feature-rich and cost-effective products in high-quality on time. Professional engineer with more than 10 years of experience in networking products development. Solid technical expertise and flexible debug skills. Excellent team work spirit. Ability to deliver feature-rich and cost-effective products in high-quality on time. Experience Sr. Hardware Design Engineer Cisco November 2014  – Present (10 months) Shanghai, China Hardware Design Engineer Cisco February 2012  –  October 2014  (2 years 9 months) Shanghai, China Handle high density 10G/40G ports module card development for campus backbone switch, Catalyst 6800. \nDesigned, developed and delivered 32x10G/8x40G module card based on next generation ASIC in high quality within tight schedule. \nEvaluated, coded, simulated and implemented all features in IO FPGA for 16x10G/4x40G module card. Hardware Design Engineer Nokia Siemens Networks August 2010  –  January 2012  (1 year 6 months) Shanghai, China Contribute to the design of 100G module card for Optical Transport Switch. \nBrought up prototypes, fixed bugs, optimized SerDes eye pattern and verified functionalities. \nReviewed and corrected functional specification, schematic and PCB. Team Leader Sercomm Corporation March 2007  –  July 2010  (3 years 5 months) Suzhou, Jiangsu, China Instruct a team to design small business networking products. \n1Gigbits Fiber Gateway \n1Gigbits Ethernet VPN Router \n802.11n wireless AP with POE feature Hardware Design Engineer Sercomm Corporation July 2004  –  March 2007  (2 years 9 months) Suzhou, Jiangsu, China Hold the development of home based networking devices. \n10M/100M Ethernet home Gateway \n200Mbps Power Line Modem Sr. Hardware Design Engineer Cisco November 2014  – Present (10 months) Shanghai, China Sr. Hardware Design Engineer Cisco November 2014  – Present (10 months) Shanghai, China Hardware Design Engineer Cisco February 2012  –  October 2014  (2 years 9 months) Shanghai, China Handle high density 10G/40G ports module card development for campus backbone switch, Catalyst 6800. \nDesigned, developed and delivered 32x10G/8x40G module card based on next generation ASIC in high quality within tight schedule. \nEvaluated, coded, simulated and implemented all features in IO FPGA for 16x10G/4x40G module card. Hardware Design Engineer Cisco February 2012  –  October 2014  (2 years 9 months) Shanghai, China Handle high density 10G/40G ports module card development for campus backbone switch, Catalyst 6800. \nDesigned, developed and delivered 32x10G/8x40G module card based on next generation ASIC in high quality within tight schedule. \nEvaluated, coded, simulated and implemented all features in IO FPGA for 16x10G/4x40G module card. Hardware Design Engineer Nokia Siemens Networks August 2010  –  January 2012  (1 year 6 months) Shanghai, China Contribute to the design of 100G module card for Optical Transport Switch. \nBrought up prototypes, fixed bugs, optimized SerDes eye pattern and verified functionalities. \nReviewed and corrected functional specification, schematic and PCB. Hardware Design Engineer Nokia Siemens Networks August 2010  –  January 2012  (1 year 6 months) Shanghai, China Contribute to the design of 100G module card for Optical Transport Switch. \nBrought up prototypes, fixed bugs, optimized SerDes eye pattern and verified functionalities. \nReviewed and corrected functional specification, schematic and PCB. Team Leader Sercomm Corporation March 2007  –  July 2010  (3 years 5 months) Suzhou, Jiangsu, China Instruct a team to design small business networking products. \n1Gigbits Fiber Gateway \n1Gigbits Ethernet VPN Router \n802.11n wireless AP with POE feature Team Leader Sercomm Corporation March 2007  –  July 2010  (3 years 5 months) Suzhou, Jiangsu, China Instruct a team to design small business networking products. \n1Gigbits Fiber Gateway \n1Gigbits Ethernet VPN Router \n802.11n wireless AP with POE feature Hardware Design Engineer Sercomm Corporation July 2004  –  March 2007  (2 years 9 months) Suzhou, Jiangsu, China Hold the development of home based networking devices. \n10M/100M Ethernet home Gateway \n200Mbps Power Line Modem Hardware Design Engineer Sercomm Corporation July 2004  –  March 2007  (2 years 9 months) Suzhou, Jiangsu, China Hold the development of home based networking devices. \n10M/100M Ethernet home Gateway \n200Mbps Power Line Modem Languages English Mandarin English Mandarin English Mandarin Skills Embedded Systems Hardware Architecture System Design Electronic Circuit... Ethernet Fiber Optics Troubleshooting Debugging Microprocessors High-speed Digital... Signal Timing Signal Integrity FPGA CPLD Verilog TCP/IP Multitasking Skills Project Management Team Management Customer Service Routers See 6+     See less Skills  Embedded Systems Hardware Architecture System Design Electronic Circuit... Ethernet Fiber Optics Troubleshooting Debugging Microprocessors High-speed Digital... Signal Timing Signal Integrity FPGA CPLD Verilog TCP/IP Multitasking Skills Project Management Team Management Customer Service Routers See 6+     See less Embedded Systems Hardware Architecture System Design Electronic Circuit... Ethernet Fiber Optics Troubleshooting Debugging Microprocessors High-speed Digital... Signal Timing Signal Integrity FPGA CPLD Verilog TCP/IP Multitasking Skills Project Management Team Management Customer Service Routers See 6+     See less Embedded Systems Hardware Architecture System Design Electronic Circuit... Ethernet Fiber Optics Troubleshooting Debugging Microprocessors High-speed Digital... Signal Timing Signal Integrity FPGA CPLD Verilog TCP/IP Multitasking Skills Project Management Team Management Customer Service Routers See 6+     See less Education Nanjing Normal University Bachelor of Science (BS),  Electrical and Information Engineering 2000  – 2004 Activities and Societies:  Province award in National Undergraduate Electronic Design Contest Nanjing Normal University Bachelor of Science (BS),  Electrical and Information Engineering 2000  – 2004 Activities and Societies:  Province award in National Undergraduate Electronic Design Contest Nanjing Normal University Bachelor of Science (BS),  Electrical and Information Engineering 2000  – 2004 Activities and Societies:  Province award in National Undergraduate Electronic Design Contest Nanjing Normal University Bachelor of Science (BS),  Electrical and Information Engineering 2000  – 2004 Activities and Societies:  Province award in National Undergraduate Electronic Design Contest ", "Summary Working on Cisco's overall Service Provider solution set.  \n \nSpecialties: IP, IP routing protocols, MPLS, MPLS TE, MPLS FRR, QoS, OTN, TISPAN, IMS, Data Centre, Video, SDN, NFV Summary Working on Cisco's overall Service Provider solution set.  \n \nSpecialties: IP, IP routing protocols, MPLS, MPLS TE, MPLS FRR, QoS, OTN, TISPAN, IMS, Data Centre, Video, SDN, NFV Working on Cisco's overall Service Provider solution set.  \n \nSpecialties: IP, IP routing protocols, MPLS, MPLS TE, MPLS FRR, QoS, OTN, TISPAN, IMS, Data Centre, Video, SDN, NFV Working on Cisco's overall Service Provider solution set.  \n \nSpecialties: IP, IP routing protocols, MPLS, MPLS TE, MPLS FRR, QoS, OTN, TISPAN, IMS, Data Centre, Video, SDN, NFV Experience Service Provider CTO Cisco Systems January 2014  – Present (1 year 8 months) Distinguished Consulting Engineer Cisco Systems 2007  – Present (8 years) Cisco's Wireline Architect. Responsible for defining Cisco's worldwide wireline architecture in the core and aggregation networks and how these elements interact with data centres and deliver high quality video in a cost effective fashion. The role covers working with internal engineering groups, marketing and with Cisco's largest SP customers. Distinguished Systems Engineer Cisco Systems April 2003  –  June 2007  (4 years 3 months) Distinguished Systems Engineer working in the European Service Provider environment. Responsible for conveying Cisco's SP strategy to a wide range of Service Providers in the European arena. Consulting Engineer Cisco Systems May 1998  –  June 2000  (2 years 2 months) Lead System Engineer on the BT account. Responsible for all aspects of Cisco's engagement with BT in the service provider environment Consulting Engineer Cisco Systems 1996  –  1998  (2 years) Pre-sales support to BT Managed Network Service organization. This group provided outsourced networking capabilities to many of the UK's largest organizations and was the forerunner to the MPLS L3 VPN infrastructure used by BT today. Network Design Engineer Cisco Systems February 1995  –  1996  (1 year) Pre-sales technical support in IBM protocols, IP routing and Ethernet switching to the retail and banking industry in the UK. Various IBM Global Services February 1985  –  February 1995  (10 years 1 month) Performed various roles ranging from systems and network operations to network Consultancy Service Provider CTO Cisco Systems January 2014  – Present (1 year 8 months) Service Provider CTO Cisco Systems January 2014  – Present (1 year 8 months) Distinguished Consulting Engineer Cisco Systems 2007  – Present (8 years) Cisco's Wireline Architect. Responsible for defining Cisco's worldwide wireline architecture in the core and aggregation networks and how these elements interact with data centres and deliver high quality video in a cost effective fashion. The role covers working with internal engineering groups, marketing and with Cisco's largest SP customers. Distinguished Consulting Engineer Cisco Systems 2007  – Present (8 years) Cisco's Wireline Architect. Responsible for defining Cisco's worldwide wireline architecture in the core and aggregation networks and how these elements interact with data centres and deliver high quality video in a cost effective fashion. The role covers working with internal engineering groups, marketing and with Cisco's largest SP customers. Distinguished Systems Engineer Cisco Systems April 2003  –  June 2007  (4 years 3 months) Distinguished Systems Engineer working in the European Service Provider environment. Responsible for conveying Cisco's SP strategy to a wide range of Service Providers in the European arena. Distinguished Systems Engineer Cisco Systems April 2003  –  June 2007  (4 years 3 months) Distinguished Systems Engineer working in the European Service Provider environment. Responsible for conveying Cisco's SP strategy to a wide range of Service Providers in the European arena. Consulting Engineer Cisco Systems May 1998  –  June 2000  (2 years 2 months) Lead System Engineer on the BT account. Responsible for all aspects of Cisco's engagement with BT in the service provider environment Consulting Engineer Cisco Systems May 1998  –  June 2000  (2 years 2 months) Lead System Engineer on the BT account. Responsible for all aspects of Cisco's engagement with BT in the service provider environment Consulting Engineer Cisco Systems 1996  –  1998  (2 years) Pre-sales support to BT Managed Network Service organization. This group provided outsourced networking capabilities to many of the UK's largest organizations and was the forerunner to the MPLS L3 VPN infrastructure used by BT today. Consulting Engineer Cisco Systems 1996  –  1998  (2 years) Pre-sales support to BT Managed Network Service organization. This group provided outsourced networking capabilities to many of the UK's largest organizations and was the forerunner to the MPLS L3 VPN infrastructure used by BT today. Network Design Engineer Cisco Systems February 1995  –  1996  (1 year) Pre-sales technical support in IBM protocols, IP routing and Ethernet switching to the retail and banking industry in the UK. Network Design Engineer Cisco Systems February 1995  –  1996  (1 year) Pre-sales technical support in IBM protocols, IP routing and Ethernet switching to the retail and banking industry in the UK. Various IBM Global Services February 1985  –  February 1995  (10 years 1 month) Performed various roles ranging from systems and network operations to network Consultancy Various IBM Global Services February 1985  –  February 1995  (10 years 1 month) Performed various roles ranging from systems and network operations to network Consultancy Skills QoS MPLS Network Architecture Routing IP Ethernet Cisco Technologies Network Function... Data Centre Architecture Networking VPN Routing Protocols Data Center Network Design Pre-sales Computer Network... See 1+     See less Skills  QoS MPLS Network Architecture Routing IP Ethernet Cisco Technologies Network Function... Data Centre Architecture Networking VPN Routing Protocols Data Center Network Design Pre-sales Computer Network... See 1+     See less QoS MPLS Network Architecture Routing IP Ethernet Cisco Technologies Network Function... Data Centre Architecture Networking VPN Routing Protocols Data Center Network Design Pre-sales Computer Network... See 1+     See less QoS MPLS Network Architecture Routing IP Ethernet Cisco Technologies Network Function... Data Centre Architecture Networking VPN Routing Protocols Data Center Network Design Pre-sales Computer Network... See 1+     See less Education City University London Systems and Management City University London Systems and Management City University London Systems and Management City University London Systems and Management ", "Experience ASIC Design Lead Ericsson April 2014  – Present (1 year 5 months) Senior ASIC Design Engineer Cisco Systems January 2005  – Present (10 years 8 months) ASIC Design Lead Ericsson April 2014  – Present (1 year 5 months) ASIC Design Lead Ericsson April 2014  – Present (1 year 5 months) Senior ASIC Design Engineer Cisco Systems January 2005  – Present (10 years 8 months) Senior ASIC Design Engineer Cisco Systems January 2005  – Present (10 years 8 months) Skills Verilog Debugging Ethernet ASIC Embedded Systems TCL FPGA RTL design Hardware Architecture SoC SystemVerilog Functional Verification TCP/IP Routing Perl RTL Design See 1+     See less Skills  Verilog Debugging Ethernet ASIC Embedded Systems TCL FPGA RTL design Hardware Architecture SoC SystemVerilog Functional Verification TCP/IP Routing Perl RTL Design See 1+     See less Verilog Debugging Ethernet ASIC Embedded Systems TCL FPGA RTL design Hardware Architecture SoC SystemVerilog Functional Verification TCP/IP Routing Perl RTL Design See 1+     See less Verilog Debugging Ethernet ASIC Embedded Systems TCL FPGA RTL design Hardware Architecture SoC SystemVerilog Functional Verification TCP/IP Routing Perl RTL Design See 1+     See less ", "Experience Senior IT Design Engineer Cisco February 2014  – Present (1 year 7 months) San Jose, CA * Built a testing and benchmarking Suite to evaluate and optimize designs, hypervisors, in addition to compute and storage products. \n* Oversaw Cisco IT's all Flash Storage Evaluation  \n* Automated the deployment of cisco's private OpenStack deployment across multiple datacenters that met the needs of 3 different teams across the IT organization within an accelerated project deadline. \n* Designing and implementing a OpenShift v2 and v3 environment for agile development by IT developers. IT Design Engineer Cisco August 2011  –  January 2014  (2 years 6 months) San Jose, CA * Lead Citrix Engineer in charge of a XenApp XenDesktop farm that serves over 10k sales users. \n* Lead Backup Administrator overseeing Disaster Recovery of critical data. \n* Storage Administrator for both EMC and NetApp SANs. \n* Compute Administrator for Cisco UCS C and B series servers. \n* Service Assurance utilizing SNMP, APIs, and BASH scripts to monitor critical systems. \n* Developed and Instructed a global tier 1 support staff of 20 engineers. \n* Designed and Implemented a solution utilizing Cisco, VMWare, Citrix, AppSense, and Atlantis Technologies to utilize ephemeral resources on the backend, while providing a user experience that functioned as dedicated resources. It resulted in savings both in capex and opex costs while providing a seamless experience to users. \n* Ran the Citrix environment for the VDI endpoint alpha project. Information Technology Specialist Stanford University October 2003  –  April 2009  (5 years 7 months) Palo Alto, CA * Website and UI Development \n* Site Administration \n* Windows and Linux Administrator  \n* Backup Administrator \n* Desktop Support Computer Support Specialist Institute of Computer Technology (ICT) October 2001  –  2003  (2 years) Sunnyvale, CA * Windows Administrator (Exchange, AD, IIS) \n* Managed 3 Classrooms for use in Adult Education \n* Provided Desktop Support to a staff of 100 Users located across the United States. Computer Support Level 2 Santa Clara County Office of Education October 1999  –  2001  (2 years) Sunnyvale, CA * Provided desktop support to a small office composed of Windows and Mac desktops. \n* Built and provided management for 3 Computer Labs. \n* Created and maintained an Inventory of computer parts and supplies of over 3000 items located in multiple warehouses. \n* Co-taught an A+ Certification course for at risk students. \n* Refurbished and Rebuilt a variety of Dell Laptops for redeployment within High Schools across Santa Clara County. Senior IT Design Engineer Cisco February 2014  – Present (1 year 7 months) San Jose, CA * Built a testing and benchmarking Suite to evaluate and optimize designs, hypervisors, in addition to compute and storage products. \n* Oversaw Cisco IT's all Flash Storage Evaluation  \n* Automated the deployment of cisco's private OpenStack deployment across multiple datacenters that met the needs of 3 different teams across the IT organization within an accelerated project deadline. \n* Designing and implementing a OpenShift v2 and v3 environment for agile development by IT developers. Senior IT Design Engineer Cisco February 2014  – Present (1 year 7 months) San Jose, CA * Built a testing and benchmarking Suite to evaluate and optimize designs, hypervisors, in addition to compute and storage products. \n* Oversaw Cisco IT's all Flash Storage Evaluation  \n* Automated the deployment of cisco's private OpenStack deployment across multiple datacenters that met the needs of 3 different teams across the IT organization within an accelerated project deadline. \n* Designing and implementing a OpenShift v2 and v3 environment for agile development by IT developers. IT Design Engineer Cisco August 2011  –  January 2014  (2 years 6 months) San Jose, CA * Lead Citrix Engineer in charge of a XenApp XenDesktop farm that serves over 10k sales users. \n* Lead Backup Administrator overseeing Disaster Recovery of critical data. \n* Storage Administrator for both EMC and NetApp SANs. \n* Compute Administrator for Cisco UCS C and B series servers. \n* Service Assurance utilizing SNMP, APIs, and BASH scripts to monitor critical systems. \n* Developed and Instructed a global tier 1 support staff of 20 engineers. \n* Designed and Implemented a solution utilizing Cisco, VMWare, Citrix, AppSense, and Atlantis Technologies to utilize ephemeral resources on the backend, while providing a user experience that functioned as dedicated resources. It resulted in savings both in capex and opex costs while providing a seamless experience to users. \n* Ran the Citrix environment for the VDI endpoint alpha project. IT Design Engineer Cisco August 2011  –  January 2014  (2 years 6 months) San Jose, CA * Lead Citrix Engineer in charge of a XenApp XenDesktop farm that serves over 10k sales users. \n* Lead Backup Administrator overseeing Disaster Recovery of critical data. \n* Storage Administrator for both EMC and NetApp SANs. \n* Compute Administrator for Cisco UCS C and B series servers. \n* Service Assurance utilizing SNMP, APIs, and BASH scripts to monitor critical systems. \n* Developed and Instructed a global tier 1 support staff of 20 engineers. \n* Designed and Implemented a solution utilizing Cisco, VMWare, Citrix, AppSense, and Atlantis Technologies to utilize ephemeral resources on the backend, while providing a user experience that functioned as dedicated resources. It resulted in savings both in capex and opex costs while providing a seamless experience to users. \n* Ran the Citrix environment for the VDI endpoint alpha project. Information Technology Specialist Stanford University October 2003  –  April 2009  (5 years 7 months) Palo Alto, CA * Website and UI Development \n* Site Administration \n* Windows and Linux Administrator  \n* Backup Administrator \n* Desktop Support Information Technology Specialist Stanford University October 2003  –  April 2009  (5 years 7 months) Palo Alto, CA * Website and UI Development \n* Site Administration \n* Windows and Linux Administrator  \n* Backup Administrator \n* Desktop Support Computer Support Specialist Institute of Computer Technology (ICT) October 2001  –  2003  (2 years) Sunnyvale, CA * Windows Administrator (Exchange, AD, IIS) \n* Managed 3 Classrooms for use in Adult Education \n* Provided Desktop Support to a staff of 100 Users located across the United States. Computer Support Specialist Institute of Computer Technology (ICT) October 2001  –  2003  (2 years) Sunnyvale, CA * Windows Administrator (Exchange, AD, IIS) \n* Managed 3 Classrooms for use in Adult Education \n* Provided Desktop Support to a staff of 100 Users located across the United States. Computer Support Level 2 Santa Clara County Office of Education October 1999  –  2001  (2 years) Sunnyvale, CA * Provided desktop support to a small office composed of Windows and Mac desktops. \n* Built and provided management for 3 Computer Labs. \n* Created and maintained an Inventory of computer parts and supplies of over 3000 items located in multiple warehouses. \n* Co-taught an A+ Certification course for at risk students. \n* Refurbished and Rebuilt a variety of Dell Laptops for redeployment within High Schools across Santa Clara County. Computer Support Level 2 Santa Clara County Office of Education October 1999  –  2001  (2 years) Sunnyvale, CA * Provided desktop support to a small office composed of Windows and Mac desktops. \n* Built and provided management for 3 Computer Labs. \n* Created and maintained an Inventory of computer parts and supplies of over 3000 items located in multiple warehouses. \n* Co-taught an A+ Certification course for at risk students. \n* Refurbished and Rebuilt a variety of Dell Laptops for redeployment within High Schools across Santa Clara County. Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Citrix Cisco Technologies Virtualization VMware vSphere Data Center Technical Support System Deployment Linux NetApp VDI Storage Area Networks Windows System... Linux System... Linux Server... Nagios OpenStack Puppet Logstash SAN See 5+     See less Skills  Citrix Cisco Technologies Virtualization VMware vSphere Data Center Technical Support System Deployment Linux NetApp VDI Storage Area Networks Windows System... Linux System... Linux Server... Nagios OpenStack Puppet Logstash SAN See 5+     See less Citrix Cisco Technologies Virtualization VMware vSphere Data Center Technical Support System Deployment Linux NetApp VDI Storage Area Networks Windows System... Linux System... Linux Server... Nagios OpenStack Puppet Logstash SAN See 5+     See less Citrix Cisco Technologies Virtualization VMware vSphere Data Center Technical Support System Deployment Linux NetApp VDI Storage Area Networks Windows System... Linux System... Linux Server... Nagios OpenStack Puppet Logstash SAN See 5+     See less Education San Jose State University BA,  Social Sciences 2009  – 2011 De Anza College AA,  History ,  Political Science 2000  – 2003 Fremont High School 1998  – 2001 Fremont High School San Jose State University BA,  Social Sciences 2009  – 2011 San Jose State University BA,  Social Sciences 2009  – 2011 San Jose State University BA,  Social Sciences 2009  – 2011 De Anza College AA,  History ,  Political Science 2000  – 2003 De Anza College AA,  History ,  Political Science 2000  – 2003 De Anza College AA,  History ,  Political Science 2000  – 2003 Fremont High School 1998  – 2001 Fremont High School 1998  – 2001 Fremont High School 1998  – 2001 Fremont High School Fremont High School Fremont High School Honors & Awards Magna Cum Laude San Jose State University May 2011 President's Scholar San Jose State University May 2011 Dean's Scholar San Jose State University May 2010 Award of Excellence Stanford University Magna Cum Laude San Jose State University May 2011 Magna Cum Laude San Jose State University May 2011 Magna Cum Laude San Jose State University May 2011 President's Scholar San Jose State University May 2011 President's Scholar San Jose State University May 2011 President's Scholar San Jose State University May 2011 Dean's Scholar San Jose State University May 2010 Dean's Scholar San Jose State University May 2010 Dean's Scholar San Jose State University May 2010 Award of Excellence Stanford University Award of Excellence Stanford University Award of Excellence Stanford University ", "Summary OBJECTIVE \n Hardworking, multifaceted, and highly motivated Senior PCB Design Engineer seeks position combining solid skills and a passion for PCB Design and Engineering with over 15 years experience in the following areas: \no All phases of circuit board and PCB layout, design, development, and production \no Sourcing, evaluation, and pricing of PCB components for production \no EMI and electronics noise reduction / elimination in compliance with FCC regulations \no Layout and macros/structure development to facilitate signal integrity and layout reuse \no Design spanning BGA substrates, flex circuits, and multi-layered boards \no Schematic capture and layout using Orcad, Cadence Composer, Pcad, Pads (powerpcb) and Allegro \nPROFESSIONAL PROFILE \n Integrates skills in all aspects and phases of PCB design and implementation \n Highly certified and proficient in all relevant industry technology and software applications \n Fully licensed in PCAD, PADS, ORCAD, Spectra (CCT) , Allegro and Board Expedition \n Disciplined self-starter with proven ability to work independently without supervision \n Detail-oriented and committed to accuracy while consistently exceeding organizational deadlines \n In charged of fabrication, assembly and component selection (kiting for assembly). \nNOTABLE ACHIEVEMENTS \n Effected $2 million+ cost savings, reducing production costs 30-40%, by creating unique new PCB layout \n Served on original design team to develop PCB’s used in Syquest’s renowned 3.5/5.25 removable disk drives \n Hand-selected to serve on development team for PCB for use in innovative new 4-gigabyte Quantum disk drive \n Earned three Cisco Achievement Awards for excellent performance in the design and release of macros \n Received Intel Certificate of Recognition reworking and resolving bug on Merced project Summary OBJECTIVE \n Hardworking, multifaceted, and highly motivated Senior PCB Design Engineer seeks position combining solid skills and a passion for PCB Design and Engineering with over 15 years experience in the following areas: \no All phases of circuit board and PCB layout, design, development, and production \no Sourcing, evaluation, and pricing of PCB components for production \no EMI and electronics noise reduction / elimination in compliance with FCC regulations \no Layout and macros/structure development to facilitate signal integrity and layout reuse \no Design spanning BGA substrates, flex circuits, and multi-layered boards \no Schematic capture and layout using Orcad, Cadence Composer, Pcad, Pads (powerpcb) and Allegro \nPROFESSIONAL PROFILE \n Integrates skills in all aspects and phases of PCB design and implementation \n Highly certified and proficient in all relevant industry technology and software applications \n Fully licensed in PCAD, PADS, ORCAD, Spectra (CCT) , Allegro and Board Expedition \n Disciplined self-starter with proven ability to work independently without supervision \n Detail-oriented and committed to accuracy while consistently exceeding organizational deadlines \n In charged of fabrication, assembly and component selection (kiting for assembly). \nNOTABLE ACHIEVEMENTS \n Effected $2 million+ cost savings, reducing production costs 30-40%, by creating unique new PCB layout \n Served on original design team to develop PCB’s used in Syquest’s renowned 3.5/5.25 removable disk drives \n Hand-selected to serve on development team for PCB for use in innovative new 4-gigabyte Quantum disk drive \n Earned three Cisco Achievement Awards for excellent performance in the design and release of macros \n Received Intel Certificate of Recognition reworking and resolving bug on Merced project OBJECTIVE \n Hardworking, multifaceted, and highly motivated Senior PCB Design Engineer seeks position combining solid skills and a passion for PCB Design and Engineering with over 15 years experience in the following areas: \no All phases of circuit board and PCB layout, design, development, and production \no Sourcing, evaluation, and pricing of PCB components for production \no EMI and electronics noise reduction / elimination in compliance with FCC regulations \no Layout and macros/structure development to facilitate signal integrity and layout reuse \no Design spanning BGA substrates, flex circuits, and multi-layered boards \no Schematic capture and layout using Orcad, Cadence Composer, Pcad, Pads (powerpcb) and Allegro \nPROFESSIONAL PROFILE \n Integrates skills in all aspects and phases of PCB design and implementation \n Highly certified and proficient in all relevant industry technology and software applications \n Fully licensed in PCAD, PADS, ORCAD, Spectra (CCT) , Allegro and Board Expedition \n Disciplined self-starter with proven ability to work independently without supervision \n Detail-oriented and committed to accuracy while consistently exceeding organizational deadlines \n In charged of fabrication, assembly and component selection (kiting for assembly). \nNOTABLE ACHIEVEMENTS \n Effected $2 million+ cost savings, reducing production costs 30-40%, by creating unique new PCB layout \n Served on original design team to develop PCB’s used in Syquest’s renowned 3.5/5.25 removable disk drives \n Hand-selected to serve on development team for PCB for use in innovative new 4-gigabyte Quantum disk drive \n Earned three Cisco Achievement Awards for excellent performance in the design and release of macros \n Received Intel Certificate of Recognition reworking and resolving bug on Merced project OBJECTIVE \n Hardworking, multifaceted, and highly motivated Senior PCB Design Engineer seeks position combining solid skills and a passion for PCB Design and Engineering with over 15 years experience in the following areas: \no All phases of circuit board and PCB layout, design, development, and production \no Sourcing, evaluation, and pricing of PCB components for production \no EMI and electronics noise reduction / elimination in compliance with FCC regulations \no Layout and macros/structure development to facilitate signal integrity and layout reuse \no Design spanning BGA substrates, flex circuits, and multi-layered boards \no Schematic capture and layout using Orcad, Cadence Composer, Pcad, Pads (powerpcb) and Allegro \nPROFESSIONAL PROFILE \n Integrates skills in all aspects and phases of PCB design and implementation \n Highly certified and proficient in all relevant industry technology and software applications \n Fully licensed in PCAD, PADS, ORCAD, Spectra (CCT) , Allegro and Board Expedition \n Disciplined self-starter with proven ability to work independently without supervision \n Detail-oriented and committed to accuracy while consistently exceeding organizational deadlines \n In charged of fabrication, assembly and component selection (kiting for assembly). \nNOTABLE ACHIEVEMENTS \n Effected $2 million+ cost savings, reducing production costs 30-40%, by creating unique new PCB layout \n Served on original design team to develop PCB’s used in Syquest’s renowned 3.5/5.25 removable disk drives \n Hand-selected to serve on development team for PCB for use in innovative new 4-gigabyte Quantum disk drive \n Earned three Cisco Achievement Awards for excellent performance in the design and release of macros \n Received Intel Certificate of Recognition reworking and resolving bug on Merced project Experience PCB Design Engineer Osterhout Group February 2012  – Present (3 years 7 months) San Francisco Bay Area Developed layout for RF demo boards. Created symbols libraries. Sr. PCB Design Engieer ITT Force Protection System November 2010  –  February 2012  (1 year 4 months) Thousand Oaks, Ca. Sr. PCB Design Engineer Micron Technology November 2006  –  April 2010  (3 years 6 months) Sr. Design Engineer \n Design and Layout emulators for Imaging also helped in debug and design wafer level module \n PCB (Allegro), Pads and APD for wafer level module and customer support \n Design to all different interfaces from USB to PCMCIA for camera sensors Design Engineer Intel Corp. 1996  –  2008  (12 years) Santa Clara, Ca. Detected bug and resolved bug issue on cpu module \n PCB/Substrate, IC Designer (Allegro) Sr. PCB Design Engineer Avago Technology (formally Agilent Technology) 2004  –  2006  (2 years) San Jose, Ca. Created Die symbols libraries for projects in Allegro for wireless group \n Developed layout for modules and demo boards \n Designed burnin systems for customer qual \n Trained fellow workers on Allegro and cad support Sr. PCB Design Engineer Ditech Communication Corp 2000  –  2004  (4 years) Mountain View, Ca. Created libraries for projects utilizing Pads and Allegro \n Developed layout for diverse network echo canceller boards \n Designed high speed (2.4G) backplanes for OC3 and STSM1 echo canceller network cards \n Trained fellow workers on Allegro and CCT router programs Chip Substrate Design Engineer NVIDIA Corp. 1999  –  2000  (1 year) Santa Clara, Ca. Chip Substrate Design Engineer \n Designed unique, new substrates in Allegro for integrated 64bit and 128 bit graphic chips \n As design team member, made integral contribution to planning and design of all substrates for use by OEM’s \n Created flipped chip and wire bonding using Cadence APD (Advanced Package Design) Signal Integrity/Layout Engineer Cisco Systems 1997  –  1999  (2 years) San Jose, Ca. Created layout macros designed to ensure re-usability in Allegro \n Engineered pinout for ASICs for BGA, CCGA devices and created associated macros \n Performed extensive planning for new ASICs for network line cards, and supervisor cards of Giga Hertz Senior PCB Design Engineer C-Cor Corp. 1996  –  1997  (1 year) Supervised a team of design professionals in the development of high-speed network protocols \n Designed dynamic backplane PCBs in Allegro / Pads for network protocols Sr. PCB Design Engineer Quantum Corporation 1992  –  1996  (4 years) Milpitas, Ca. Rewrite stepper motor design \n Rewrite head design mechanical and flex circuit \n Handled component selection \n Handled all existing manufacturing issues regarding production, assembly machines and processes (overseas), techniques, setup of manufacturing \n Selected by senior management to serve on development team for innovative PCBs for a new 4-GB disk drive \n Made integral contribution on design team that developed PCBs for 1.8 inch and 2.5 inch disk drives PCB Design Engineer Osterhout Group February 2012  – Present (3 years 7 months) San Francisco Bay Area Developed layout for RF demo boards. Created symbols libraries. PCB Design Engineer Osterhout Group February 2012  – Present (3 years 7 months) San Francisco Bay Area Developed layout for RF demo boards. Created symbols libraries. Sr. PCB Design Engieer ITT Force Protection System November 2010  –  February 2012  (1 year 4 months) Thousand Oaks, Ca. Sr. PCB Design Engieer ITT Force Protection System November 2010  –  February 2012  (1 year 4 months) Thousand Oaks, Ca. Sr. PCB Design Engineer Micron Technology November 2006  –  April 2010  (3 years 6 months) Sr. Design Engineer \n Design and Layout emulators for Imaging also helped in debug and design wafer level module \n PCB (Allegro), Pads and APD for wafer level module and customer support \n Design to all different interfaces from USB to PCMCIA for camera sensors Sr. PCB Design Engineer Micron Technology November 2006  –  April 2010  (3 years 6 months) Sr. Design Engineer \n Design and Layout emulators for Imaging also helped in debug and design wafer level module \n PCB (Allegro), Pads and APD for wafer level module and customer support \n Design to all different interfaces from USB to PCMCIA for camera sensors Design Engineer Intel Corp. 1996  –  2008  (12 years) Santa Clara, Ca. Detected bug and resolved bug issue on cpu module \n PCB/Substrate, IC Designer (Allegro) Design Engineer Intel Corp. 1996  –  2008  (12 years) Santa Clara, Ca. Detected bug and resolved bug issue on cpu module \n PCB/Substrate, IC Designer (Allegro) Sr. PCB Design Engineer Avago Technology (formally Agilent Technology) 2004  –  2006  (2 years) San Jose, Ca. Created Die symbols libraries for projects in Allegro for wireless group \n Developed layout for modules and demo boards \n Designed burnin systems for customer qual \n Trained fellow workers on Allegro and cad support Sr. PCB Design Engineer Avago Technology (formally Agilent Technology) 2004  –  2006  (2 years) San Jose, Ca. Created Die symbols libraries for projects in Allegro for wireless group \n Developed layout for modules and demo boards \n Designed burnin systems for customer qual \n Trained fellow workers on Allegro and cad support Sr. PCB Design Engineer Ditech Communication Corp 2000  –  2004  (4 years) Mountain View, Ca. Created libraries for projects utilizing Pads and Allegro \n Developed layout for diverse network echo canceller boards \n Designed high speed (2.4G) backplanes for OC3 and STSM1 echo canceller network cards \n Trained fellow workers on Allegro and CCT router programs Sr. PCB Design Engineer Ditech Communication Corp 2000  –  2004  (4 years) Mountain View, Ca. Created libraries for projects utilizing Pads and Allegro \n Developed layout for diverse network echo canceller boards \n Designed high speed (2.4G) backplanes for OC3 and STSM1 echo canceller network cards \n Trained fellow workers on Allegro and CCT router programs Chip Substrate Design Engineer NVIDIA Corp. 1999  –  2000  (1 year) Santa Clara, Ca. Chip Substrate Design Engineer \n Designed unique, new substrates in Allegro for integrated 64bit and 128 bit graphic chips \n As design team member, made integral contribution to planning and design of all substrates for use by OEM’s \n Created flipped chip and wire bonding using Cadence APD (Advanced Package Design) Chip Substrate Design Engineer NVIDIA Corp. 1999  –  2000  (1 year) Santa Clara, Ca. Chip Substrate Design Engineer \n Designed unique, new substrates in Allegro for integrated 64bit and 128 bit graphic chips \n As design team member, made integral contribution to planning and design of all substrates for use by OEM’s \n Created flipped chip and wire bonding using Cadence APD (Advanced Package Design) Signal Integrity/Layout Engineer Cisco Systems 1997  –  1999  (2 years) San Jose, Ca. Created layout macros designed to ensure re-usability in Allegro \n Engineered pinout for ASICs for BGA, CCGA devices and created associated macros \n Performed extensive planning for new ASICs for network line cards, and supervisor cards of Giga Hertz Signal Integrity/Layout Engineer Cisco Systems 1997  –  1999  (2 years) San Jose, Ca. Created layout macros designed to ensure re-usability in Allegro \n Engineered pinout for ASICs for BGA, CCGA devices and created associated macros \n Performed extensive planning for new ASICs for network line cards, and supervisor cards of Giga Hertz Senior PCB Design Engineer C-Cor Corp. 1996  –  1997  (1 year) Supervised a team of design professionals in the development of high-speed network protocols \n Designed dynamic backplane PCBs in Allegro / Pads for network protocols Senior PCB Design Engineer C-Cor Corp. 1996  –  1997  (1 year) Supervised a team of design professionals in the development of high-speed network protocols \n Designed dynamic backplane PCBs in Allegro / Pads for network protocols Sr. PCB Design Engineer Quantum Corporation 1992  –  1996  (4 years) Milpitas, Ca. Rewrite stepper motor design \n Rewrite head design mechanical and flex circuit \n Handled component selection \n Handled all existing manufacturing issues regarding production, assembly machines and processes (overseas), techniques, setup of manufacturing \n Selected by senior management to serve on development team for innovative PCBs for a new 4-GB disk drive \n Made integral contribution on design team that developed PCBs for 1.8 inch and 2.5 inch disk drives Sr. PCB Design Engineer Quantum Corporation 1992  –  1996  (4 years) Milpitas, Ca. Rewrite stepper motor design \n Rewrite head design mechanical and flex circuit \n Handled component selection \n Handled all existing manufacturing issues regarding production, assembly machines and processes (overseas), techniques, setup of manufacturing \n Selected by senior management to serve on development team for innovative PCBs for a new 4-GB disk drive \n Made integral contribution on design team that developed PCBs for 1.8 inch and 2.5 inch disk drives Skills PCB design Schematic Capture RF Semiconductors Signal Integrity Electronics Allegro CAD Cadence Orcad PCB layout design Wireless Skills  PCB design Schematic Capture RF Semiconductors Signal Integrity Electronics Allegro CAD Cadence Orcad PCB layout design Wireless PCB design Schematic Capture RF Semiconductors Signal Integrity Electronics Allegro CAD Cadence Orcad PCB layout design Wireless PCB design Schematic Capture RF Semiconductors Signal Integrity Electronics Allegro CAD Cadence Orcad PCB layout design Wireless ", "Summary Wide ranging experience in mechanical design and engineering in the fields of transportation, braille computer interface devices for the blind, medical/surgical devices, marine navigation and electronics, 2-way communications, cell phone, energy storage, computer, data storage, retail point of sale equipment, kiosk, industrial and military displays, circuit protection, imaging and detection, speed detection laser equipment, and cable tv industries. \nAll stages of design from concept to mass production. \nAlways targeting innovation and stream lined simplicity in my design work and very hands on with prototyping and production problems. \n \nCo-author of U.S. patent 6,646,889 and several other patent submissions while at American Megatrends and awarded a Distinguished Engineering Innovation award and and an award for 5 patent submissions in 1 quarter while at Motorola.  \n \nI can work on site and also have a seat of Pro-Engineer Wild Fire and a seat of SolidWorks at my home office for off site design work and consulting. \n \nPositions held at: \nNorth American Bus Industries \nFreedom Scientific \nSteris Corporation \nJohnson Outdoors Marine Electronics \nCisco Systems \nGeneral Electric \nSony-Ericsson \nPro-Tech \nLaser Craft \nNCR \nSiemans \nMotorola \nPanasonic \nScientific Atlanta \nAmerican Megatrends \nCoulter Scientific Instruments \nand several other companies. \n \nSpecialties:  \nPro-Engineer Wildfire5/Creo Elements and Creo 2.0 \nSolidWorks  \nWindchill/PDM/PLM Link 9.0 - 10.1 \nIntralink \nDesign and development \nRapid prototyping \nProduct validation \nManufacturing ramp up \nVendor interfacing \nInternational travel to suppliers and manufacturers Summary Wide ranging experience in mechanical design and engineering in the fields of transportation, braille computer interface devices for the blind, medical/surgical devices, marine navigation and electronics, 2-way communications, cell phone, energy storage, computer, data storage, retail point of sale equipment, kiosk, industrial and military displays, circuit protection, imaging and detection, speed detection laser equipment, and cable tv industries. \nAll stages of design from concept to mass production. \nAlways targeting innovation and stream lined simplicity in my design work and very hands on with prototyping and production problems. \n \nCo-author of U.S. patent 6,646,889 and several other patent submissions while at American Megatrends and awarded a Distinguished Engineering Innovation award and and an award for 5 patent submissions in 1 quarter while at Motorola.  \n \nI can work on site and also have a seat of Pro-Engineer Wild Fire and a seat of SolidWorks at my home office for off site design work and consulting. \n \nPositions held at: \nNorth American Bus Industries \nFreedom Scientific \nSteris Corporation \nJohnson Outdoors Marine Electronics \nCisco Systems \nGeneral Electric \nSony-Ericsson \nPro-Tech \nLaser Craft \nNCR \nSiemans \nMotorola \nPanasonic \nScientific Atlanta \nAmerican Megatrends \nCoulter Scientific Instruments \nand several other companies. \n \nSpecialties:  \nPro-Engineer Wildfire5/Creo Elements and Creo 2.0 \nSolidWorks  \nWindchill/PDM/PLM Link 9.0 - 10.1 \nIntralink \nDesign and development \nRapid prototyping \nProduct validation \nManufacturing ramp up \nVendor interfacing \nInternational travel to suppliers and manufacturers Wide ranging experience in mechanical design and engineering in the fields of transportation, braille computer interface devices for the blind, medical/surgical devices, marine navigation and electronics, 2-way communications, cell phone, energy storage, computer, data storage, retail point of sale equipment, kiosk, industrial and military displays, circuit protection, imaging and detection, speed detection laser equipment, and cable tv industries. \nAll stages of design from concept to mass production. \nAlways targeting innovation and stream lined simplicity in my design work and very hands on with prototyping and production problems. \n \nCo-author of U.S. patent 6,646,889 and several other patent submissions while at American Megatrends and awarded a Distinguished Engineering Innovation award and and an award for 5 patent submissions in 1 quarter while at Motorola.  \n \nI can work on site and also have a seat of Pro-Engineer Wild Fire and a seat of SolidWorks at my home office for off site design work and consulting. \n \nPositions held at: \nNorth American Bus Industries \nFreedom Scientific \nSteris Corporation \nJohnson Outdoors Marine Electronics \nCisco Systems \nGeneral Electric \nSony-Ericsson \nPro-Tech \nLaser Craft \nNCR \nSiemans \nMotorola \nPanasonic \nScientific Atlanta \nAmerican Megatrends \nCoulter Scientific Instruments \nand several other companies. \n \nSpecialties:  \nPro-Engineer Wildfire5/Creo Elements and Creo 2.0 \nSolidWorks  \nWindchill/PDM/PLM Link 9.0 - 10.1 \nIntralink \nDesign and development \nRapid prototyping \nProduct validation \nManufacturing ramp up \nVendor interfacing \nInternational travel to suppliers and manufacturers Wide ranging experience in mechanical design and engineering in the fields of transportation, braille computer interface devices for the blind, medical/surgical devices, marine navigation and electronics, 2-way communications, cell phone, energy storage, computer, data storage, retail point of sale equipment, kiosk, industrial and military displays, circuit protection, imaging and detection, speed detection laser equipment, and cable tv industries. \nAll stages of design from concept to mass production. \nAlways targeting innovation and stream lined simplicity in my design work and very hands on with prototyping and production problems. \n \nCo-author of U.S. patent 6,646,889 and several other patent submissions while at American Megatrends and awarded a Distinguished Engineering Innovation award and and an award for 5 patent submissions in 1 quarter while at Motorola.  \n \nI can work on site and also have a seat of Pro-Engineer Wild Fire and a seat of SolidWorks at my home office for off site design work and consulting. \n \nPositions held at: \nNorth American Bus Industries \nFreedom Scientific \nSteris Corporation \nJohnson Outdoors Marine Electronics \nCisco Systems \nGeneral Electric \nSony-Ericsson \nPro-Tech \nLaser Craft \nNCR \nSiemans \nMotorola \nPanasonic \nScientific Atlanta \nAmerican Megatrends \nCoulter Scientific Instruments \nand several other companies. \n \nSpecialties:  \nPro-Engineer Wildfire5/Creo Elements and Creo 2.0 \nSolidWorks  \nWindchill/PDM/PLM Link 9.0 - 10.1 \nIntralink \nDesign and development \nRapid prototyping \nProduct validation \nManufacturing ramp up \nVendor interfacing \nInternational travel to suppliers and manufacturers Experience Sr. Design Engineer Cisco SPVTG April 2014  – Present (1 year 5 months) Lawrenceville, Ga Design engineer responsible for the mechanical design of residential and commercial automation and gateway systems. \nThis includes injection molded enclosure and part design, printed circuit board mechanical lay-out, design of sheet metal tuner and component shielding and electrical component heat transfer solutions. Mechnical Design Engineer North American Bus Industries - NABI August 2012  –  April 2014  (1 year 9 months) Mechanical designer responsible for chassis, frame structure and shell for commercial mass transit buses. Mechanical Design Engineer Freedom Scientific June 2012  –  August 2012  (3 months) Responsible for the design of Braille equipped computer keyboards for the visually impaired. Mechanical Design Engineer STERIS Corporation January 2012  –  June 2012  (6 months) Responsible for the design of sub-systems for surgical tables used in operating rooms to position and restrain human limbs for surgery as well as high weight distribution platforms for medical devices that are stacked on a \"column\" that distribute electrical connections and various oxygen and gas connections and is suspended from a ceiling mounted articulated arm suspension system. Mechanical Design Engineer Humminbird/Johnson Outdoors July 2011  –  January 2012  (7 months) Atlanta, Ga Instrumental in all aspects of mechanical design for the next generation of GPS based navigation systems for Marine craft and side and down looking SONAR. \nThis entailed various gear design for extending and retracting the SONAR head in and out of the water, as well as aluminum casting design, bracketry design, water tight sealing and mechanical PCB layout and electro-mechanical (connectors, etc)l component selection. Lead Engineer and Design Owner Cisco SPVTG 2007  –  July 2011  (4 years) Lead mechanical design engineer for set top boxes, dta's and dvr's in the Subscriber Product Video Technology Group. \nResponsible for mechanical design, layout and development, manufacturing ramp up and production maintenance. \nAlso managed ODM mechanical design for several products. Sr. Mechanical Design Engineer GE Fanuc March 2007  –  August 2007  (6 months) Greenville, S.C. Responsible for the design of ruggedized computers and displays for industrial and military applications. Sr. Mechanical Design Engineer Pro-Tech Solutions May 2006  –  November 2006  (7 months) Suwannee, Ga Sr. Mechanical Design Engineer Motorola Energy Products Division January 1993  –  October 1998  (5 years 10 months) Lawrenceville, Ga Sr. Design Engineer Cisco SPVTG April 2014  – Present (1 year 5 months) Lawrenceville, Ga Design engineer responsible for the mechanical design of residential and commercial automation and gateway systems. \nThis includes injection molded enclosure and part design, printed circuit board mechanical lay-out, design of sheet metal tuner and component shielding and electrical component heat transfer solutions. Sr. Design Engineer Cisco SPVTG April 2014  – Present (1 year 5 months) Lawrenceville, Ga Design engineer responsible for the mechanical design of residential and commercial automation and gateway systems. \nThis includes injection molded enclosure and part design, printed circuit board mechanical lay-out, design of sheet metal tuner and component shielding and electrical component heat transfer solutions. Mechnical Design Engineer North American Bus Industries - NABI August 2012  –  April 2014  (1 year 9 months) Mechanical designer responsible for chassis, frame structure and shell for commercial mass transit buses. Mechnical Design Engineer North American Bus Industries - NABI August 2012  –  April 2014  (1 year 9 months) Mechanical designer responsible for chassis, frame structure and shell for commercial mass transit buses. Mechanical Design Engineer Freedom Scientific June 2012  –  August 2012  (3 months) Responsible for the design of Braille equipped computer keyboards for the visually impaired. Mechanical Design Engineer Freedom Scientific June 2012  –  August 2012  (3 months) Responsible for the design of Braille equipped computer keyboards for the visually impaired. Mechanical Design Engineer STERIS Corporation January 2012  –  June 2012  (6 months) Responsible for the design of sub-systems for surgical tables used in operating rooms to position and restrain human limbs for surgery as well as high weight distribution platforms for medical devices that are stacked on a \"column\" that distribute electrical connections and various oxygen and gas connections and is suspended from a ceiling mounted articulated arm suspension system. Mechanical Design Engineer STERIS Corporation January 2012  –  June 2012  (6 months) Responsible for the design of sub-systems for surgical tables used in operating rooms to position and restrain human limbs for surgery as well as high weight distribution platforms for medical devices that are stacked on a \"column\" that distribute electrical connections and various oxygen and gas connections and is suspended from a ceiling mounted articulated arm suspension system. Mechanical Design Engineer Humminbird/Johnson Outdoors July 2011  –  January 2012  (7 months) Atlanta, Ga Instrumental in all aspects of mechanical design for the next generation of GPS based navigation systems for Marine craft and side and down looking SONAR. \nThis entailed various gear design for extending and retracting the SONAR head in and out of the water, as well as aluminum casting design, bracketry design, water tight sealing and mechanical PCB layout and electro-mechanical (connectors, etc)l component selection. Mechanical Design Engineer Humminbird/Johnson Outdoors July 2011  –  January 2012  (7 months) Atlanta, Ga Instrumental in all aspects of mechanical design for the next generation of GPS based navigation systems for Marine craft and side and down looking SONAR. \nThis entailed various gear design for extending and retracting the SONAR head in and out of the water, as well as aluminum casting design, bracketry design, water tight sealing and mechanical PCB layout and electro-mechanical (connectors, etc)l component selection. Lead Engineer and Design Owner Cisco SPVTG 2007  –  July 2011  (4 years) Lead mechanical design engineer for set top boxes, dta's and dvr's in the Subscriber Product Video Technology Group. \nResponsible for mechanical design, layout and development, manufacturing ramp up and production maintenance. \nAlso managed ODM mechanical design for several products. Lead Engineer and Design Owner Cisco SPVTG 2007  –  July 2011  (4 years) Lead mechanical design engineer for set top boxes, dta's and dvr's in the Subscriber Product Video Technology Group. \nResponsible for mechanical design, layout and development, manufacturing ramp up and production maintenance. \nAlso managed ODM mechanical design for several products. Sr. Mechanical Design Engineer GE Fanuc March 2007  –  August 2007  (6 months) Greenville, S.C. Responsible for the design of ruggedized computers and displays for industrial and military applications. Sr. Mechanical Design Engineer GE Fanuc March 2007  –  August 2007  (6 months) Greenville, S.C. Responsible for the design of ruggedized computers and displays for industrial and military applications. Sr. Mechanical Design Engineer Pro-Tech Solutions May 2006  –  November 2006  (7 months) Suwannee, Ga Sr. Mechanical Design Engineer Pro-Tech Solutions May 2006  –  November 2006  (7 months) Suwannee, Ga Sr. Mechanical Design Engineer Motorola Energy Products Division January 1993  –  October 1998  (5 years 10 months) Lawrenceville, Ga Sr. Mechanical Design Engineer Motorola Energy Products Division January 1993  –  October 1998  (5 years 10 months) Lawrenceville, Ga Skills Pro/Intralink Solidworks Rapid Prototyping Pro/Engineer Sheet Metal Product Design Solid Modeling Windchill Machining Plastic Part Design Injection Molding Pro Engineer Tolerance Analysis Plastics Continuous Improvement Design for Manufacturing Mechanical Engineering PDM CAD Electronics Lean Manufacturing Engineering Engineering Management Electro-mechanical ISO Product Development Manufacturing Six Sigma Root Cause Analysis FMEA Manufacturing... Design of Experiments Product Lifecycle... PCB design R&D Systems Engineering Automation Process Engineering PCB Design SolidWorks PTC Creo See 26+     See less Skills  Pro/Intralink Solidworks Rapid Prototyping Pro/Engineer Sheet Metal Product Design Solid Modeling Windchill Machining Plastic Part Design Injection Molding Pro Engineer Tolerance Analysis Plastics Continuous Improvement Design for Manufacturing Mechanical Engineering PDM CAD Electronics Lean Manufacturing Engineering Engineering Management Electro-mechanical ISO Product Development Manufacturing Six Sigma Root Cause Analysis FMEA Manufacturing... Design of Experiments Product Lifecycle... PCB design R&D Systems Engineering Automation Process Engineering PCB Design SolidWorks PTC Creo See 26+     See less Pro/Intralink Solidworks Rapid Prototyping Pro/Engineer Sheet Metal Product Design Solid Modeling Windchill Machining Plastic Part Design Injection Molding Pro Engineer Tolerance Analysis Plastics Continuous Improvement Design for Manufacturing Mechanical Engineering PDM CAD Electronics Lean Manufacturing Engineering Engineering Management Electro-mechanical ISO Product Development Manufacturing Six Sigma Root Cause Analysis FMEA Manufacturing... Design of Experiments Product Lifecycle... PCB design R&D Systems Engineering Automation Process Engineering PCB Design SolidWorks PTC Creo See 26+     See less Pro/Intralink Solidworks Rapid Prototyping Pro/Engineer Sheet Metal Product Design Solid Modeling Windchill Machining Plastic Part Design Injection Molding Pro Engineer Tolerance Analysis Plastics Continuous Improvement Design for Manufacturing Mechanical Engineering PDM CAD Electronics Lean Manufacturing Engineering Engineering Management Electro-mechanical ISO Product Development Manufacturing Six Sigma Root Cause Analysis FMEA Manufacturing... Design of Experiments Product Lifecycle... PCB design R&D Systems Engineering Automation Process Engineering PCB Design SolidWorks PTC Creo See 26+     See less ", "Summary I am a passionate and hard-working hardware and digital logic design engineer who loves to make an impact in the world with the results I produce and relationships I build. After nearly eight years at Cisco Systems and being responsible for both FPGA Verilog designs as well as HW PCB design on Catalyst Ethernet switches, I recently switched over to work as a hardware systems EE at Apple. \n \nMy first manager instilled a strong sense of integrity in me where I say what I do and do what I say, and I am a firm believer in that \"anything worth doing is worth doing well.\" I've been gifted with two able hands and a keen brain and I certainly don't mind putting all three to work. Life is awesome and I have a feeling it's going to keep getting better. Summary I am a passionate and hard-working hardware and digital logic design engineer who loves to make an impact in the world with the results I produce and relationships I build. After nearly eight years at Cisco Systems and being responsible for both FPGA Verilog designs as well as HW PCB design on Catalyst Ethernet switches, I recently switched over to work as a hardware systems EE at Apple. \n \nMy first manager instilled a strong sense of integrity in me where I say what I do and do what I say, and I am a firm believer in that \"anything worth doing is worth doing well.\" I've been gifted with two able hands and a keen brain and I certainly don't mind putting all three to work. Life is awesome and I have a feeling it's going to keep getting better. I am a passionate and hard-working hardware and digital logic design engineer who loves to make an impact in the world with the results I produce and relationships I build. After nearly eight years at Cisco Systems and being responsible for both FPGA Verilog designs as well as HW PCB design on Catalyst Ethernet switches, I recently switched over to work as a hardware systems EE at Apple. \n \nMy first manager instilled a strong sense of integrity in me where I say what I do and do what I say, and I am a firm believer in that \"anything worth doing is worth doing well.\" I've been gifted with two able hands and a keen brain and I certainly don't mind putting all three to work. Life is awesome and I have a feeling it's going to keep getting better. I am a passionate and hard-working hardware and digital logic design engineer who loves to make an impact in the world with the results I produce and relationships I build. After nearly eight years at Cisco Systems and being responsible for both FPGA Verilog designs as well as HW PCB design on Catalyst Ethernet switches, I recently switched over to work as a hardware systems EE at Apple. \n \nMy first manager instilled a strong sense of integrity in me where I say what I do and do what I say, and I am a firm believer in that \"anything worth doing is worth doing well.\" I've been gifted with two able hands and a keen brain and I certainly don't mind putting all three to work. Life is awesome and I have a feeling it's going to keep getting better. Experience Hardware Systems Design Engineer Apple December 2014  – Present (9 months) Cupertino, CA I am responsible for designing awesome HW products. Senior Hardware PCB & FPGA Design Engineer - Enterprise Networking Group Cisco March 2013  – Present (2 years 6 months) San Jose ●●●●● Technical Skills ●●●●● \n•\tHW Design : Cadence Concept and Allegro, high volume manufacturing, PCB stackup and BGA packaging, DDR3, USB 2.0, PCIE, I2C, PMBUS 2.0, 10/40Gbps Ethernet standards (MDIO, SFI/XFI, SFP+, XGMII, etc.), low and high cost design, oscilloscope, logic analyzer, Ixia and Spirent 1-40Gbps traffic generators \n•\tHW High Speed Design : 10Gbps high speed board design, signal integrity including s-parameters, eye analysis, VNA and TDR analysis, transmission line, power integrity and mapping PDN \n•\tScripting : Perl, Tcl, Expect, Python, batch, Linux and BASH scripting \n•\tDigital Logic Design : Verilog, SystemVerilog, Synplicity, Denali BluePrint RDL, VCS, Xilinx ISE/PlanAhead/Vivado/ChipScope on Virtex 2, Spartan 3, and Kintex 7, Altera Quartus/SignalTap on Stratix I/II, “glue logic” and low-latency datapath designs  \n•\tSoft Skills: Sociable with sales experience, highly communicative and passionate, leadership ability, individually-motivated, promotes creative and simple solutions to complex problems \n \n●●●●● Work Experience ●●●●● \n●●● Xilinx Kintex-7 FPGA Designer (Current) ●●● \n▫\tIEEE802.3 10GBase-R/XGMII oversubscribed Ethernet packet switch and MAC including PPM matching elastic FIFOs, DIC, shared weighted round robin packet scheduler, transparent pipelined memories, floorplanning, 12 clock domains, BluePrint RDL, timing closure at 70% utilization @ 187.5MHz  \n \n●●● Catalyst 3000 40Gbps Line Card HW Design Lead (Current) ●●● \n▫\t10G/40Gbps optical Ethernet EDC line card, SFI/XFI/XLPPI/XLAUI Hardware Design Engineer - Unified Access Business Unit Cisco November 2011  –  March 2013  (1 year 5 months) San Jose ●●● Catalyst 4500-X HW Project Lead ●●● \n▫\t40x10G SFP+ Ethernet switch using Cisco K10 ASIC family \n▫\t20 layer PCB, DDR3, PCIE 2.0, optical ethernet using SFP+, SFI/XFI, $300M/year \n \n●●● 10G/40G Line Card Project Lead ●●● \n▫\t20 layer PCB, QSFP+, 40Gbps XLAUI, XLPPI, s-parameter optimization using RF switches and low loss PCB material/stackup selection Hardware PCB & FPGA Design Engineer - Desktop Switching Business Unit Cisco January 2007  –  November 2011  (4 years 11 months) San Jose ●●● ASIC Emulation PCB Design Lead, Altera Stratix FPGA Designer ●●● \n▫\tDesign 114-FPGA, 10-slot ASIC RTL emulator system using Altera FPGAs, 40 layer backplane, three different 36 layer line cards \n▫\t36 layer PCB line card, LVDS, PCIE 2.0, clocking, power (400W/slot), PCIE 2.0, QDR SRAM, ZDB phase matched clocking, 60A isolated power controllers, ZBC buried capacitance 2oz power planes, Altera Stratix II EP2S180 datapath FPGAs \n▫\t$5 million dollar investment, 5-person team, 12K nets, 6K components, chassis architecture, FPGA design for parallel address bus and clock debugging \n▫\tResponsibilities include chassis architecture, manufacturing test, FPGA clocking, Verilog parallel bus address controller, SignalTap debugging \n \n●●● Catalyst 3850 Ethernet Switch HW System Lead, Xilinx Spartan FPGA Designer ●●● \n▫\tProduct lead system engineer on Catalyst 3850 24-port PoE Ethernet switch using Cisco ASIC \n▫\t10,000 units/month production, 50A ASIC power, 10Gbps SFI/XFI and SGMII signaling, PCIE 2.0, DDR3, USB 2.0 \n▫\tBoards designed: 2 layer cost-optimized daughter card, 12 layer mainboard PCB, 8 layer BGA test card, 10 layer HDI microvia SERDES loopback test card \n▫\tFPGA “glue logic” design in Xilinx Spartan 3AN FPGA including I2C controller, 85% utilization Electronics & Major Appliance Sales Costco Wholesale November 2003  –  December 2006  (3 years 2 months) Carlsbad, CA •\tManual tasks such as organizing, stocking, and presenting inventory to sales roles in the major appliance and electronics department. Requires commitment to quality, great interpersonal skills to identify customer needs and build solutions, and time management. \n \n•\tMaintained average of 24 hours/week throughout college, and 40 hours/week during summer \n \n•\tHighly ranked for great communication and work ethic. Electronics Sales Best Buy January 2000  –  November 2003  (3 years 11 months) Greater San Diego Area • Electronics sales, customer service, manual tasks such as merchandising, inventory, and SOP (Standard Operating Procedure). \n \n• Maintained 16 hours/week throughout high school, 32-40 hours/week throughout the summer. Hardware Systems Design Engineer Apple December 2014  – Present (9 months) Cupertino, CA I am responsible for designing awesome HW products. Hardware Systems Design Engineer Apple December 2014  – Present (9 months) Cupertino, CA I am responsible for designing awesome HW products. Senior Hardware PCB & FPGA Design Engineer - Enterprise Networking Group Cisco March 2013  – Present (2 years 6 months) San Jose ●●●●● Technical Skills ●●●●● \n•\tHW Design : Cadence Concept and Allegro, high volume manufacturing, PCB stackup and BGA packaging, DDR3, USB 2.0, PCIE, I2C, PMBUS 2.0, 10/40Gbps Ethernet standards (MDIO, SFI/XFI, SFP+, XGMII, etc.), low and high cost design, oscilloscope, logic analyzer, Ixia and Spirent 1-40Gbps traffic generators \n•\tHW High Speed Design : 10Gbps high speed board design, signal integrity including s-parameters, eye analysis, VNA and TDR analysis, transmission line, power integrity and mapping PDN \n•\tScripting : Perl, Tcl, Expect, Python, batch, Linux and BASH scripting \n•\tDigital Logic Design : Verilog, SystemVerilog, Synplicity, Denali BluePrint RDL, VCS, Xilinx ISE/PlanAhead/Vivado/ChipScope on Virtex 2, Spartan 3, and Kintex 7, Altera Quartus/SignalTap on Stratix I/II, “glue logic” and low-latency datapath designs  \n•\tSoft Skills: Sociable with sales experience, highly communicative and passionate, leadership ability, individually-motivated, promotes creative and simple solutions to complex problems \n \n●●●●● Work Experience ●●●●● \n●●● Xilinx Kintex-7 FPGA Designer (Current) ●●● \n▫\tIEEE802.3 10GBase-R/XGMII oversubscribed Ethernet packet switch and MAC including PPM matching elastic FIFOs, DIC, shared weighted round robin packet scheduler, transparent pipelined memories, floorplanning, 12 clock domains, BluePrint RDL, timing closure at 70% utilization @ 187.5MHz  \n \n●●● Catalyst 3000 40Gbps Line Card HW Design Lead (Current) ●●● \n▫\t10G/40Gbps optical Ethernet EDC line card, SFI/XFI/XLPPI/XLAUI Senior Hardware PCB & FPGA Design Engineer - Enterprise Networking Group Cisco March 2013  – Present (2 years 6 months) San Jose ●●●●● Technical Skills ●●●●● \n•\tHW Design : Cadence Concept and Allegro, high volume manufacturing, PCB stackup and BGA packaging, DDR3, USB 2.0, PCIE, I2C, PMBUS 2.0, 10/40Gbps Ethernet standards (MDIO, SFI/XFI, SFP+, XGMII, etc.), low and high cost design, oscilloscope, logic analyzer, Ixia and Spirent 1-40Gbps traffic generators \n•\tHW High Speed Design : 10Gbps high speed board design, signal integrity including s-parameters, eye analysis, VNA and TDR analysis, transmission line, power integrity and mapping PDN \n•\tScripting : Perl, Tcl, Expect, Python, batch, Linux and BASH scripting \n•\tDigital Logic Design : Verilog, SystemVerilog, Synplicity, Denali BluePrint RDL, VCS, Xilinx ISE/PlanAhead/Vivado/ChipScope on Virtex 2, Spartan 3, and Kintex 7, Altera Quartus/SignalTap on Stratix I/II, “glue logic” and low-latency datapath designs  \n•\tSoft Skills: Sociable with sales experience, highly communicative and passionate, leadership ability, individually-motivated, promotes creative and simple solutions to complex problems \n \n●●●●● Work Experience ●●●●● \n●●● Xilinx Kintex-7 FPGA Designer (Current) ●●● \n▫\tIEEE802.3 10GBase-R/XGMII oversubscribed Ethernet packet switch and MAC including PPM matching elastic FIFOs, DIC, shared weighted round robin packet scheduler, transparent pipelined memories, floorplanning, 12 clock domains, BluePrint RDL, timing closure at 70% utilization @ 187.5MHz  \n \n●●● Catalyst 3000 40Gbps Line Card HW Design Lead (Current) ●●● \n▫\t10G/40Gbps optical Ethernet EDC line card, SFI/XFI/XLPPI/XLAUI Hardware Design Engineer - Unified Access Business Unit Cisco November 2011  –  March 2013  (1 year 5 months) San Jose ●●● Catalyst 4500-X HW Project Lead ●●● \n▫\t40x10G SFP+ Ethernet switch using Cisco K10 ASIC family \n▫\t20 layer PCB, DDR3, PCIE 2.0, optical ethernet using SFP+, SFI/XFI, $300M/year \n \n●●● 10G/40G Line Card Project Lead ●●● \n▫\t20 layer PCB, QSFP+, 40Gbps XLAUI, XLPPI, s-parameter optimization using RF switches and low loss PCB material/stackup selection Hardware Design Engineer - Unified Access Business Unit Cisco November 2011  –  March 2013  (1 year 5 months) San Jose ●●● Catalyst 4500-X HW Project Lead ●●● \n▫\t40x10G SFP+ Ethernet switch using Cisco K10 ASIC family \n▫\t20 layer PCB, DDR3, PCIE 2.0, optical ethernet using SFP+, SFI/XFI, $300M/year \n \n●●● 10G/40G Line Card Project Lead ●●● \n▫\t20 layer PCB, QSFP+, 40Gbps XLAUI, XLPPI, s-parameter optimization using RF switches and low loss PCB material/stackup selection Hardware PCB & FPGA Design Engineer - Desktop Switching Business Unit Cisco January 2007  –  November 2011  (4 years 11 months) San Jose ●●● ASIC Emulation PCB Design Lead, Altera Stratix FPGA Designer ●●● \n▫\tDesign 114-FPGA, 10-slot ASIC RTL emulator system using Altera FPGAs, 40 layer backplane, three different 36 layer line cards \n▫\t36 layer PCB line card, LVDS, PCIE 2.0, clocking, power (400W/slot), PCIE 2.0, QDR SRAM, ZDB phase matched clocking, 60A isolated power controllers, ZBC buried capacitance 2oz power planes, Altera Stratix II EP2S180 datapath FPGAs \n▫\t$5 million dollar investment, 5-person team, 12K nets, 6K components, chassis architecture, FPGA design for parallel address bus and clock debugging \n▫\tResponsibilities include chassis architecture, manufacturing test, FPGA clocking, Verilog parallel bus address controller, SignalTap debugging \n \n●●● Catalyst 3850 Ethernet Switch HW System Lead, Xilinx Spartan FPGA Designer ●●● \n▫\tProduct lead system engineer on Catalyst 3850 24-port PoE Ethernet switch using Cisco ASIC \n▫\t10,000 units/month production, 50A ASIC power, 10Gbps SFI/XFI and SGMII signaling, PCIE 2.0, DDR3, USB 2.0 \n▫\tBoards designed: 2 layer cost-optimized daughter card, 12 layer mainboard PCB, 8 layer BGA test card, 10 layer HDI microvia SERDES loopback test card \n▫\tFPGA “glue logic” design in Xilinx Spartan 3AN FPGA including I2C controller, 85% utilization Hardware PCB & FPGA Design Engineer - Desktop Switching Business Unit Cisco January 2007  –  November 2011  (4 years 11 months) San Jose ●●● ASIC Emulation PCB Design Lead, Altera Stratix FPGA Designer ●●● \n▫\tDesign 114-FPGA, 10-slot ASIC RTL emulator system using Altera FPGAs, 40 layer backplane, three different 36 layer line cards \n▫\t36 layer PCB line card, LVDS, PCIE 2.0, clocking, power (400W/slot), PCIE 2.0, QDR SRAM, ZDB phase matched clocking, 60A isolated power controllers, ZBC buried capacitance 2oz power planes, Altera Stratix II EP2S180 datapath FPGAs \n▫\t$5 million dollar investment, 5-person team, 12K nets, 6K components, chassis architecture, FPGA design for parallel address bus and clock debugging \n▫\tResponsibilities include chassis architecture, manufacturing test, FPGA clocking, Verilog parallel bus address controller, SignalTap debugging \n \n●●● Catalyst 3850 Ethernet Switch HW System Lead, Xilinx Spartan FPGA Designer ●●● \n▫\tProduct lead system engineer on Catalyst 3850 24-port PoE Ethernet switch using Cisco ASIC \n▫\t10,000 units/month production, 50A ASIC power, 10Gbps SFI/XFI and SGMII signaling, PCIE 2.0, DDR3, USB 2.0 \n▫\tBoards designed: 2 layer cost-optimized daughter card, 12 layer mainboard PCB, 8 layer BGA test card, 10 layer HDI microvia SERDES loopback test card \n▫\tFPGA “glue logic” design in Xilinx Spartan 3AN FPGA including I2C controller, 85% utilization Electronics & Major Appliance Sales Costco Wholesale November 2003  –  December 2006  (3 years 2 months) Carlsbad, CA •\tManual tasks such as organizing, stocking, and presenting inventory to sales roles in the major appliance and electronics department. Requires commitment to quality, great interpersonal skills to identify customer needs and build solutions, and time management. \n \n•\tMaintained average of 24 hours/week throughout college, and 40 hours/week during summer \n \n•\tHighly ranked for great communication and work ethic. Electronics & Major Appliance Sales Costco Wholesale November 2003  –  December 2006  (3 years 2 months) Carlsbad, CA •\tManual tasks such as organizing, stocking, and presenting inventory to sales roles in the major appliance and electronics department. Requires commitment to quality, great interpersonal skills to identify customer needs and build solutions, and time management. \n \n•\tMaintained average of 24 hours/week throughout college, and 40 hours/week during summer \n \n•\tHighly ranked for great communication and work ethic. Electronics Sales Best Buy January 2000  –  November 2003  (3 years 11 months) Greater San Diego Area • Electronics sales, customer service, manual tasks such as merchandising, inventory, and SOP (Standard Operating Procedure). \n \n• Maintained 16 hours/week throughout high school, 32-40 hours/week throughout the summer. Electronics Sales Best Buy January 2000  –  November 2003  (3 years 11 months) Greater San Diego Area • Electronics sales, customer service, manual tasks such as merchandising, inventory, and SOP (Standard Operating Procedure). \n \n• Maintained 16 hours/week throughout high school, 32-40 hours/week throughout the summer. Skills TCL Verilog Ethernet ASIC FPGA TCP/IP Perl Allegro IP PCB design Debugging Embedded Systems Embedded Software Cadence Testing Wireless EDA Hardware Architecture SNMP PCB Design See 5+     See less Skills  TCL Verilog Ethernet ASIC FPGA TCP/IP Perl Allegro IP PCB design Debugging Embedded Systems Embedded Software Cadence Testing Wireless EDA Hardware Architecture SNMP PCB Design See 5+     See less TCL Verilog Ethernet ASIC FPGA TCP/IP Perl Allegro IP PCB design Debugging Embedded Systems Embedded Software Cadence Testing Wireless EDA Hardware Architecture SNMP PCB Design See 5+     See less TCL Verilog Ethernet ASIC FPGA TCP/IP Perl Allegro IP PCB design Debugging Embedded Systems Embedded Software Cadence Testing Wireless EDA Hardware Architecture SNMP PCB Design See 5+     See less Education UCSD BS,  Computer Engineering 2004  – 2006 UCSD BS,  Computer Engineering 2004  – 2006 UCSD BS,  Computer Engineering 2004  – 2006 UCSD BS,  Computer Engineering 2004  – 2006 ", "Summary I have 15+ years in the IT industry, spanning many different roles including global enterprise network operational support/implementations, proof of concept testing and consulting. I have extensive experience on a wide range of enterprise networking technologies. Currently my focus is on data center networking and virtualization with a deep interest in Cisco ACI, OpenFlow, OpenStack and SDN. Summary I have 15+ years in the IT industry, spanning many different roles including global enterprise network operational support/implementations, proof of concept testing and consulting. I have extensive experience on a wide range of enterprise networking technologies. Currently my focus is on data center networking and virtualization with a deep interest in Cisco ACI, OpenFlow, OpenStack and SDN. I have 15+ years in the IT industry, spanning many different roles including global enterprise network operational support/implementations, proof of concept testing and consulting. I have extensive experience on a wide range of enterprise networking technologies. Currently my focus is on data center networking and virtualization with a deep interest in Cisco ACI, OpenFlow, OpenStack and SDN. I have 15+ years in the IT industry, spanning many different roles including global enterprise network operational support/implementations, proof of concept testing and consulting. I have extensive experience on a wide range of enterprise networking technologies. Currently my focus is on data center networking and virtualization with a deep interest in Cisco ACI, OpenFlow, OpenStack and SDN. Experience Data Center Design Engineer Cisco Systems January 2015  – Present (8 months) San Jose, CA Set strategic direction on specific solutions for Cisco data centers as the high level technical resource. Perform design integration for complex, cross-functional systems. Lead technical design reviews of applicable global projects and documents. Consults and liaisons with internal Cisco clients on the most complex issues especially dealing with zero outage application migrations in high density data center environments.  \n \nTECHNOLOGIES AND PROTOCOLS: \n• Data Center Networking: Cisco ACI (Application Centric Infrastructure), Cisco APIC, vPC, Fabric Path, FCoE, OTV, VXLAN; \n• Server/Switch Virtualization: UCS, VMWare, Nexus 1000v, VSG, vASA 1000v; \n• Routing protocols: BGP, IS-IS, OSPF, EIGRP, RIP/RIP2, PBR; \n• IP Multicasting: PIM-SM/DM, PIM bi-dir, PIM SSM, MSDP/MBGP, anycast RP, auto RP, IGMP,  \nIGMP Snooping; \n• IPv6; \n• QoS: LLQ/CBWFQ, PQ/CQ, Traffic Shaping/Policing, WRED; \n• Nexus HW (9K, 7K, 6K, 5K, 2K) \n• Virtual machine platforms (Nexus 1Kv, VSM, VEM, VNMC, VSG, VMware ESX \n• Cisco ACE, global site selection (Cisco GSS) Network Engineer Cisco Systems June 2009  –  January 2015  (5 years 8 months) San Jose, CA Previous Role: Operations IT Engineer - Branch Operations - Extranet and Field Sales Offices. Operational support of Cisco's global extranet and sales offices, to include incident/problem management, architecture/design review, and change release management. Support included WAN, secure remote access technologies, CDN, and wireless infrastructures utilizing distributed, redundant/fault tolerance to maximize production uptime. Also acted as SME in the extranet/FSO space and served as escalation point of contact for various implementations/operations teams. Contributed to numerous Cisco IT architecture, design, policy and cookbook documents in alignment with Cisco-on-Cisco best practice and roadmaps. Contributed to various aspects of personnel management and leadership in areas of coaching/mentoring interviewing, hiring, training (TOIs), and delegation.  \n \nPrevious Role: Lead Operations IT Engineer - Enterprise Innovation Center, an intelligent POC network fabric connecting anyone, anywhere, from any device, to any application or service with excellent user experience, reliably, securely, and seamlessly. Pre-production implementing and testing with Day zero / Day 1 operational support of Identity Services Engine ISE 1.2.0.834 w/BYOD onboarding (WIFI and Wired). Internet Only Network (ION formerly known as guest networking), Cisco network management suite – Cisco Prime Infrastructure 2.0 (CPI), NCS, Network Assurance, NCCM (Network Configuration and Compliance Management) & Image Management (PnP ZTD zero touch deployment), Medianet - Cisco Prime Collaboration Manager (CPCM 1.2 MediaTrace and Performance Monitor), Stadium Vision Mobile, IPv6 (specifically with Tandberg Video Endpoints), Cisco C4510R+E (03.04.00.SG) /Sup7/8-E and C3850 access layer switches, WiSM2, and VSS at the building core. Wireless LAN Controller 7.5.90.3, 3600 Access Points (AIR-CAP36021-A-K9), 802.11AC modules (and WSSI modules), Mobility Services Engine 7.5.1.43, EnergyWise with JouleX. Network Engineer Cisco Systems August 2007  –  June 2009  (1 year 11 months) San Jose, CA Previous role: Operations IT Engineer INS – Intelligent Network Services - Support Cisco's global network to include Data Center infrastructure, Internet, DMZ, Wireless, Telepresence, and Extranet/FSO’s (Remote Access). Involved in all aspects of Planning, Designing, Testing, Implementation, Operation, and Optimization of Cisco's Network Infrastructure. Contributed to numerous Cisco IT architecture, design, policy and cookbook documents in alignment with Cisco-on-Cisco best practice and roadmaps. Managed incidents related to network outages; determined outage root cause and provided short and long-term fixes as needed. Contributed to design forums, enterprise network architecture reviews, technical advisory board, and operational strategy meetings. Contributed to various aspects of personnel management and leadership in areas of coaching/mentoring interviewing, hiring, training (TOIs), and delegation. Network Engineer Consultant Cisco Systems August 2006  –  July 2007  (1 year) Responsible for worldwide replication, staging and deployment of Cisco Customer and Remote Technology Briefing Centers for the Worldwide Sales Enablement Group. The CBC/RTBC program highlighted the breadth and depth of Cisco's Advanced Technologies, giving customers the broad picture of a Cisco end to end solution. Provided consultative product and solution expertise to the SE teams including troubleshooting during and after deployment. Participated regularly as a technical speaker at customer/executive briefings, serving as the subject matter expert for the Advanced Technologies. Advanced Technologies included IP Telephony (VOIP), Security (SDN), Rich Media, Wireless, and Video conferencing Senior IT Engineer Superior Court of California June 2005  –  August 2006  (1 year 3 months) Data Center Design Engineer Cisco Systems January 2015  – Present (8 months) San Jose, CA Set strategic direction on specific solutions for Cisco data centers as the high level technical resource. Perform design integration for complex, cross-functional systems. Lead technical design reviews of applicable global projects and documents. Consults and liaisons with internal Cisco clients on the most complex issues especially dealing with zero outage application migrations in high density data center environments.  \n \nTECHNOLOGIES AND PROTOCOLS: \n• Data Center Networking: Cisco ACI (Application Centric Infrastructure), Cisco APIC, vPC, Fabric Path, FCoE, OTV, VXLAN; \n• Server/Switch Virtualization: UCS, VMWare, Nexus 1000v, VSG, vASA 1000v; \n• Routing protocols: BGP, IS-IS, OSPF, EIGRP, RIP/RIP2, PBR; \n• IP Multicasting: PIM-SM/DM, PIM bi-dir, PIM SSM, MSDP/MBGP, anycast RP, auto RP, IGMP,  \nIGMP Snooping; \n• IPv6; \n• QoS: LLQ/CBWFQ, PQ/CQ, Traffic Shaping/Policing, WRED; \n• Nexus HW (9K, 7K, 6K, 5K, 2K) \n• Virtual machine platforms (Nexus 1Kv, VSM, VEM, VNMC, VSG, VMware ESX \n• Cisco ACE, global site selection (Cisco GSS) Data Center Design Engineer Cisco Systems January 2015  – Present (8 months) San Jose, CA Set strategic direction on specific solutions for Cisco data centers as the high level technical resource. Perform design integration for complex, cross-functional systems. Lead technical design reviews of applicable global projects and documents. Consults and liaisons with internal Cisco clients on the most complex issues especially dealing with zero outage application migrations in high density data center environments.  \n \nTECHNOLOGIES AND PROTOCOLS: \n• Data Center Networking: Cisco ACI (Application Centric Infrastructure), Cisco APIC, vPC, Fabric Path, FCoE, OTV, VXLAN; \n• Server/Switch Virtualization: UCS, VMWare, Nexus 1000v, VSG, vASA 1000v; \n• Routing protocols: BGP, IS-IS, OSPF, EIGRP, RIP/RIP2, PBR; \n• IP Multicasting: PIM-SM/DM, PIM bi-dir, PIM SSM, MSDP/MBGP, anycast RP, auto RP, IGMP,  \nIGMP Snooping; \n• IPv6; \n• QoS: LLQ/CBWFQ, PQ/CQ, Traffic Shaping/Policing, WRED; \n• Nexus HW (9K, 7K, 6K, 5K, 2K) \n• Virtual machine platforms (Nexus 1Kv, VSM, VEM, VNMC, VSG, VMware ESX \n• Cisco ACE, global site selection (Cisco GSS) Network Engineer Cisco Systems June 2009  –  January 2015  (5 years 8 months) San Jose, CA Previous Role: Operations IT Engineer - Branch Operations - Extranet and Field Sales Offices. Operational support of Cisco's global extranet and sales offices, to include incident/problem management, architecture/design review, and change release management. Support included WAN, secure remote access technologies, CDN, and wireless infrastructures utilizing distributed, redundant/fault tolerance to maximize production uptime. Also acted as SME in the extranet/FSO space and served as escalation point of contact for various implementations/operations teams. Contributed to numerous Cisco IT architecture, design, policy and cookbook documents in alignment with Cisco-on-Cisco best practice and roadmaps. Contributed to various aspects of personnel management and leadership in areas of coaching/mentoring interviewing, hiring, training (TOIs), and delegation.  \n \nPrevious Role: Lead Operations IT Engineer - Enterprise Innovation Center, an intelligent POC network fabric connecting anyone, anywhere, from any device, to any application or service with excellent user experience, reliably, securely, and seamlessly. Pre-production implementing and testing with Day zero / Day 1 operational support of Identity Services Engine ISE 1.2.0.834 w/BYOD onboarding (WIFI and Wired). Internet Only Network (ION formerly known as guest networking), Cisco network management suite – Cisco Prime Infrastructure 2.0 (CPI), NCS, Network Assurance, NCCM (Network Configuration and Compliance Management) & Image Management (PnP ZTD zero touch deployment), Medianet - Cisco Prime Collaboration Manager (CPCM 1.2 MediaTrace and Performance Monitor), Stadium Vision Mobile, IPv6 (specifically with Tandberg Video Endpoints), Cisco C4510R+E (03.04.00.SG) /Sup7/8-E and C3850 access layer switches, WiSM2, and VSS at the building core. Wireless LAN Controller 7.5.90.3, 3600 Access Points (AIR-CAP36021-A-K9), 802.11AC modules (and WSSI modules), Mobility Services Engine 7.5.1.43, EnergyWise with JouleX. Network Engineer Cisco Systems June 2009  –  January 2015  (5 years 8 months) San Jose, CA Previous Role: Operations IT Engineer - Branch Operations - Extranet and Field Sales Offices. Operational support of Cisco's global extranet and sales offices, to include incident/problem management, architecture/design review, and change release management. Support included WAN, secure remote access technologies, CDN, and wireless infrastructures utilizing distributed, redundant/fault tolerance to maximize production uptime. Also acted as SME in the extranet/FSO space and served as escalation point of contact for various implementations/operations teams. Contributed to numerous Cisco IT architecture, design, policy and cookbook documents in alignment with Cisco-on-Cisco best practice and roadmaps. Contributed to various aspects of personnel management and leadership in areas of coaching/mentoring interviewing, hiring, training (TOIs), and delegation.  \n \nPrevious Role: Lead Operations IT Engineer - Enterprise Innovation Center, an intelligent POC network fabric connecting anyone, anywhere, from any device, to any application or service with excellent user experience, reliably, securely, and seamlessly. Pre-production implementing and testing with Day zero / Day 1 operational support of Identity Services Engine ISE 1.2.0.834 w/BYOD onboarding (WIFI and Wired). Internet Only Network (ION formerly known as guest networking), Cisco network management suite – Cisco Prime Infrastructure 2.0 (CPI), NCS, Network Assurance, NCCM (Network Configuration and Compliance Management) & Image Management (PnP ZTD zero touch deployment), Medianet - Cisco Prime Collaboration Manager (CPCM 1.2 MediaTrace and Performance Monitor), Stadium Vision Mobile, IPv6 (specifically with Tandberg Video Endpoints), Cisco C4510R+E (03.04.00.SG) /Sup7/8-E and C3850 access layer switches, WiSM2, and VSS at the building core. Wireless LAN Controller 7.5.90.3, 3600 Access Points (AIR-CAP36021-A-K9), 802.11AC modules (and WSSI modules), Mobility Services Engine 7.5.1.43, EnergyWise with JouleX. Network Engineer Cisco Systems August 2007  –  June 2009  (1 year 11 months) San Jose, CA Previous role: Operations IT Engineer INS – Intelligent Network Services - Support Cisco's global network to include Data Center infrastructure, Internet, DMZ, Wireless, Telepresence, and Extranet/FSO’s (Remote Access). Involved in all aspects of Planning, Designing, Testing, Implementation, Operation, and Optimization of Cisco's Network Infrastructure. Contributed to numerous Cisco IT architecture, design, policy and cookbook documents in alignment with Cisco-on-Cisco best practice and roadmaps. Managed incidents related to network outages; determined outage root cause and provided short and long-term fixes as needed. Contributed to design forums, enterprise network architecture reviews, technical advisory board, and operational strategy meetings. Contributed to various aspects of personnel management and leadership in areas of coaching/mentoring interviewing, hiring, training (TOIs), and delegation. Network Engineer Cisco Systems August 2007  –  June 2009  (1 year 11 months) San Jose, CA Previous role: Operations IT Engineer INS – Intelligent Network Services - Support Cisco's global network to include Data Center infrastructure, Internet, DMZ, Wireless, Telepresence, and Extranet/FSO’s (Remote Access). Involved in all aspects of Planning, Designing, Testing, Implementation, Operation, and Optimization of Cisco's Network Infrastructure. Contributed to numerous Cisco IT architecture, design, policy and cookbook documents in alignment with Cisco-on-Cisco best practice and roadmaps. Managed incidents related to network outages; determined outage root cause and provided short and long-term fixes as needed. Contributed to design forums, enterprise network architecture reviews, technical advisory board, and operational strategy meetings. Contributed to various aspects of personnel management and leadership in areas of coaching/mentoring interviewing, hiring, training (TOIs), and delegation. Network Engineer Consultant Cisco Systems August 2006  –  July 2007  (1 year) Responsible for worldwide replication, staging and deployment of Cisco Customer and Remote Technology Briefing Centers for the Worldwide Sales Enablement Group. The CBC/RTBC program highlighted the breadth and depth of Cisco's Advanced Technologies, giving customers the broad picture of a Cisco end to end solution. Provided consultative product and solution expertise to the SE teams including troubleshooting during and after deployment. Participated regularly as a technical speaker at customer/executive briefings, serving as the subject matter expert for the Advanced Technologies. Advanced Technologies included IP Telephony (VOIP), Security (SDN), Rich Media, Wireless, and Video conferencing Network Engineer Consultant Cisco Systems August 2006  –  July 2007  (1 year) Responsible for worldwide replication, staging and deployment of Cisco Customer and Remote Technology Briefing Centers for the Worldwide Sales Enablement Group. The CBC/RTBC program highlighted the breadth and depth of Cisco's Advanced Technologies, giving customers the broad picture of a Cisco end to end solution. Provided consultative product and solution expertise to the SE teams including troubleshooting during and after deployment. Participated regularly as a technical speaker at customer/executive briefings, serving as the subject matter expert for the Advanced Technologies. Advanced Technologies included IP Telephony (VOIP), Security (SDN), Rich Media, Wireless, and Video conferencing Senior IT Engineer Superior Court of California June 2005  –  August 2006  (1 year 3 months) Senior IT Engineer Superior Court of California June 2005  –  August 2006  (1 year 3 months) Skills Cisco Technologies Networking Troubleshooting OSPF Routing EIGRP Cisco IOS Wireless BGP Network Architecture TCP/IP VoIP IPv6 ASA SDN OpenStack OpenFlow OpenDaylight Puppet Chef Cloud Computing ACI OnePK Data Center See 9+     See less Skills  Cisco Technologies Networking Troubleshooting OSPF Routing EIGRP Cisco IOS Wireless BGP Network Architecture TCP/IP VoIP IPv6 ASA SDN OpenStack OpenFlow OpenDaylight Puppet Chef Cloud Computing ACI OnePK Data Center See 9+     See less Cisco Technologies Networking Troubleshooting OSPF Routing EIGRP Cisco IOS Wireless BGP Network Architecture TCP/IP VoIP IPv6 ASA SDN OpenStack OpenFlow OpenDaylight Puppet Chef Cloud Computing ACI OnePK Data Center See 9+     See less Cisco Technologies Networking Troubleshooting OSPF Routing EIGRP Cisco IOS Wireless BGP Network Architecture TCP/IP VoIP IPv6 ASA SDN OpenStack OpenFlow OpenDaylight Puppet Chef Cloud Computing ACI OnePK Data Center See 9+     See less Education Golden Gate University BS CS,  Computer Science 2000  – 2004 University of Southern California Biomedical Engineering 1996  – 2000 Golden Gate University BS CS,  Computer Science 2000  – 2004 Golden Gate University BS CS,  Computer Science 2000  – 2004 Golden Gate University BS CS,  Computer Science 2000  – 2004 University of Southern California Biomedical Engineering 1996  – 2000 University of Southern California Biomedical Engineering 1996  – 2000 University of Southern California Biomedical Engineering 1996  – 2000 ", "Summary 19 years network technology experience covering all aspects of development and operations including Management, Advanced Services, Technical Support, Supply Chain, Product Engineering, Finance, Program Management, Strategy and Planning. 7+ years Management and Leadership experience.  Summary 19 years network technology experience covering all aspects of development and operations including Management, Advanced Services, Technical Support, Supply Chain, Product Engineering, Finance, Program Management, Strategy and Planning. 7+ years Management and Leadership experience.  19 years network technology experience covering all aspects of development and operations including Management, Advanced Services, Technical Support, Supply Chain, Product Engineering, Finance, Program Management, Strategy and Planning. 7+ years Management and Leadership experience.  19 years network technology experience covering all aspects of development and operations including Management, Advanced Services, Technical Support, Supply Chain, Product Engineering, Finance, Program Management, Strategy and Planning. 7+ years Management and Leadership experience.  Experience Business Development Manager Cisco May 2015  – Present (4 months) San Jose, CA Support Cisco Advanced Services Center of Excellence and GDC teams, GES and GSP field sales teams, Security and CCS teams. Key responsibilities: \n+ Optimize partner cost of goods for services delivered in the Americas. \n+ Assess partner quality by tracking and measuring partner satisfaction. \n+ Assist with the oversight of Cisco's Partner Engagement Platform. \n+ Align partner team decisions with Cisco's Advanced Services operating and directed spend models. \n+ Leverage price and benchmark data to drive partner database evolution. \n+ Negotiate rates and volume discounts with staffing partners. \n+ Review and onboard service and staffing partners based on center of excellence delivery requirements.  \n+ Evaluate service partners for preferred status potential. Business Operations Manager / Chief of Staff Cisco Systems June 2012  –  May 2015  (3 years) United States As the Business Operations Manager I oversaw Supply Chain Product Operations OPEX budget, organizational health, headcount, NMS allocations to business segments, and led annual workforce and budget planning activities. I worked closely with Product Operations executives, Cisco Finance and HR to ensure resources are available to meet commitments to our customers (Cisco Engineering) and partners (vendors, component manufacturers, equipment suppliers) so new products have the resources and funding needed to ship new products to market. Assisted with the creation of a Tableau / Oracle based reporting tool to track operations activities.  \nAs the Product Operations Chief of Staff for Enterprise Networking and Transceiver Module Groups I am responsible for executive/organization communications, budget management, training support/development, organization event planning, human resource facilitation, and participate in organization specific projects (Job Architecture, Operations as a Service, Workforce Planning). Manager Product Support Engineering Cisco Systems October 2010  –  June 2012  (1 year 9 months) San Bruno Manage the global Product Support Engineering team for Cisco IronPort and ScanSafe web and email security products in Cisco's Security Technology Business Unit. Product Support builds communication between customers, support engineers, legal, developers and marketing to ensure customer-found caveats are fixed, feature-requests are road-mapped, support processes are efficient and customers are satisfied. As a senior manager I am a key member on several teams: IronPort integration to Cisco, acquisition and integration of ScanSafe, Security Application Council, Security Customer Forums. There are several projects I oversee, including: Beta support, customer release notifications and alerts, support product commits, interim software release tools. \n \nSelected Accomplishments: \n+ Created Beta Support strategy resulting in increased CSE technical skills, a 10% customer satisfaction jump and improved CSE retention. \n+ Automated interim release tool, allowing customers a means to request and receive bug fix releases for high severity problems without increasing development or QA work load. \n+ Expanded PSE product coverage from 3 to 12 Cisco Security platforms without additional budget \n+ Automated release notification process to expand number of customers receiving Marketing release updates and reduce customer upgrade time from 2 weeks to 3 days. Manager Technical Support IronPort Systems October 2008  –  October 2010  (2 years 1 month) San Bruno, CA As the manager of the San Bruno Email Security, Encryption, and Escalation technical support teams I oversaw US oncall and holiday schedules, handled email security customer escalations, held performance reviews, participated in security councils, and influenced the IronPort support vision and strategy. As a security leader, I helped design IronPort’s hosted email security solution and was a member of the hosted product team. As a lead in the IronPort support management team I maintained the management wiki pages, created a critical response process, led initiatives to improve customer satisfaction, and presented support overviews at customer forums. \n \nSelected Accomplishments: \n+ Increased customer satisfaction with email security support from 4.3 to 4.56 \n+ Reduced support escalation and critical response time, resolving customer problems faster Manager Technical Support Operations Cisco Systems January 2006  –  October 2008  (2 years 10 months) San Jose, CA •\tOversee operations of network support labs and technical support team in California and Texas with an annual budget of $5 Million. \n-\tForecast and staff all resources necessary to meet operational and project goals within Salary and Fringe committed budget.  \n-\tForecast department capital and operational expenses, and track to ensure spending is within 2% of commit each quarter. \n•\tServe as line manager point of escalation for all resource, customer and communication conflicts. \n•\tPartner with customers and peers globally to ensure department service level agreements meet customer requirements. \n•\tImprove customer satisfaction through application of DMAIC on all CALO activities.  \n-\tMeasure and analyze existing work and process flow to identify gaps and improvement opportunities. \n-\tPromote innovation of new lab designs to increase equipment utilization and address customer needs. \n•\tEnsure availability of over 50,000 network devices including hubs, routers, switches, firewalls, and APs. \n•\tLead a team of full time engineers, student co-ops, and contractors at 15 local and remote Cisco sites; 70% of the student co-ops turn-over every 6 months. \n-\tEstablished global lab processes, attained finance commitments and maintained high equipment availability over a two year period. \n-\t75% of co-op staff successfully trained to fill full time technical support positions \n•\tDevelop and present monthly and quarterly operations updates to executive management. Lead Product Serviceability Design Engineer Cisco Systems September 2003  –  2006  (3 years) San Jose, CA •\tLed the initiative to automate SDE processes and support notifications \n• Created Business Requirements Documents for IT to enhance PSE tools \n•\tWorked cross-functionally and served as a liaison between hardware and software engineering, marketing, manufacturing, quality engineering, and customer support teams for all new GSR releases. \n• Led hardware diagnostics OBFL project team.  \n- Generated and analyzed Oracle SQL reports to identify key customer problems and hardware quality issues. Product Serviceability Design Engineer Cisco Systems October 1999  –  September 2003  (4 years) San Jose, CA • Worked cross-functionally and served as a liaison between hardware and software engineering, marketing, manufacturing, quality engineering, and customer support teams for three different product families. \n• Participated in all project design phases from Project Requirements Document creation to First Customer Ship. \n• Applied DMAIC process to review of hardware design with quality engineers to ensure value added customer requirements were being met. \n• Utilized business analysis skills to proactively identify user interface and hardware quality problems. \n- Presented key customer issues using cause/effect analysis data with process change recommendations to senior management. \n- Collaborated with Quality Engineering to review customer hardware failure trends and identify process and component workarounds. \n• Created and documented field alert and product safety notices when severe customer problems were identified post-FCS. Customer Support Engineer / Advanced Services Engineer Cisco Systems July 1996  –  October 1999  (3 years 4 months) San Jose, CA Technical Support Engineer StrataCom, Inc June 1995  –  July 1996  (1 year 2 months) System Administrator - various companies IT consultant Self Employed July 1992  –  May 1995  (2 years 11 months) Business Development Manager Cisco May 2015  – Present (4 months) San Jose, CA Support Cisco Advanced Services Center of Excellence and GDC teams, GES and GSP field sales teams, Security and CCS teams. Key responsibilities: \n+ Optimize partner cost of goods for services delivered in the Americas. \n+ Assess partner quality by tracking and measuring partner satisfaction. \n+ Assist with the oversight of Cisco's Partner Engagement Platform. \n+ Align partner team decisions with Cisco's Advanced Services operating and directed spend models. \n+ Leverage price and benchmark data to drive partner database evolution. \n+ Negotiate rates and volume discounts with staffing partners. \n+ Review and onboard service and staffing partners based on center of excellence delivery requirements.  \n+ Evaluate service partners for preferred status potential. Business Development Manager Cisco May 2015  – Present (4 months) San Jose, CA Support Cisco Advanced Services Center of Excellence and GDC teams, GES and GSP field sales teams, Security and CCS teams. Key responsibilities: \n+ Optimize partner cost of goods for services delivered in the Americas. \n+ Assess partner quality by tracking and measuring partner satisfaction. \n+ Assist with the oversight of Cisco's Partner Engagement Platform. \n+ Align partner team decisions with Cisco's Advanced Services operating and directed spend models. \n+ Leverage price and benchmark data to drive partner database evolution. \n+ Negotiate rates and volume discounts with staffing partners. \n+ Review and onboard service and staffing partners based on center of excellence delivery requirements.  \n+ Evaluate service partners for preferred status potential. Business Operations Manager / Chief of Staff Cisco Systems June 2012  –  May 2015  (3 years) United States As the Business Operations Manager I oversaw Supply Chain Product Operations OPEX budget, organizational health, headcount, NMS allocations to business segments, and led annual workforce and budget planning activities. I worked closely with Product Operations executives, Cisco Finance and HR to ensure resources are available to meet commitments to our customers (Cisco Engineering) and partners (vendors, component manufacturers, equipment suppliers) so new products have the resources and funding needed to ship new products to market. Assisted with the creation of a Tableau / Oracle based reporting tool to track operations activities.  \nAs the Product Operations Chief of Staff for Enterprise Networking and Transceiver Module Groups I am responsible for executive/organization communications, budget management, training support/development, organization event planning, human resource facilitation, and participate in organization specific projects (Job Architecture, Operations as a Service, Workforce Planning). Business Operations Manager / Chief of Staff Cisco Systems June 2012  –  May 2015  (3 years) United States As the Business Operations Manager I oversaw Supply Chain Product Operations OPEX budget, organizational health, headcount, NMS allocations to business segments, and led annual workforce and budget planning activities. I worked closely with Product Operations executives, Cisco Finance and HR to ensure resources are available to meet commitments to our customers (Cisco Engineering) and partners (vendors, component manufacturers, equipment suppliers) so new products have the resources and funding needed to ship new products to market. Assisted with the creation of a Tableau / Oracle based reporting tool to track operations activities.  \nAs the Product Operations Chief of Staff for Enterprise Networking and Transceiver Module Groups I am responsible for executive/organization communications, budget management, training support/development, organization event planning, human resource facilitation, and participate in organization specific projects (Job Architecture, Operations as a Service, Workforce Planning). Manager Product Support Engineering Cisco Systems October 2010  –  June 2012  (1 year 9 months) San Bruno Manage the global Product Support Engineering team for Cisco IronPort and ScanSafe web and email security products in Cisco's Security Technology Business Unit. Product Support builds communication between customers, support engineers, legal, developers and marketing to ensure customer-found caveats are fixed, feature-requests are road-mapped, support processes are efficient and customers are satisfied. As a senior manager I am a key member on several teams: IronPort integration to Cisco, acquisition and integration of ScanSafe, Security Application Council, Security Customer Forums. There are several projects I oversee, including: Beta support, customer release notifications and alerts, support product commits, interim software release tools. \n \nSelected Accomplishments: \n+ Created Beta Support strategy resulting in increased CSE technical skills, a 10% customer satisfaction jump and improved CSE retention. \n+ Automated interim release tool, allowing customers a means to request and receive bug fix releases for high severity problems without increasing development or QA work load. \n+ Expanded PSE product coverage from 3 to 12 Cisco Security platforms without additional budget \n+ Automated release notification process to expand number of customers receiving Marketing release updates and reduce customer upgrade time from 2 weeks to 3 days. Manager Product Support Engineering Cisco Systems October 2010  –  June 2012  (1 year 9 months) San Bruno Manage the global Product Support Engineering team for Cisco IronPort and ScanSafe web and email security products in Cisco's Security Technology Business Unit. Product Support builds communication between customers, support engineers, legal, developers and marketing to ensure customer-found caveats are fixed, feature-requests are road-mapped, support processes are efficient and customers are satisfied. As a senior manager I am a key member on several teams: IronPort integration to Cisco, acquisition and integration of ScanSafe, Security Application Council, Security Customer Forums. There are several projects I oversee, including: Beta support, customer release notifications and alerts, support product commits, interim software release tools. \n \nSelected Accomplishments: \n+ Created Beta Support strategy resulting in increased CSE technical skills, a 10% customer satisfaction jump and improved CSE retention. \n+ Automated interim release tool, allowing customers a means to request and receive bug fix releases for high severity problems without increasing development or QA work load. \n+ Expanded PSE product coverage from 3 to 12 Cisco Security platforms without additional budget \n+ Automated release notification process to expand number of customers receiving Marketing release updates and reduce customer upgrade time from 2 weeks to 3 days. Manager Technical Support IronPort Systems October 2008  –  October 2010  (2 years 1 month) San Bruno, CA As the manager of the San Bruno Email Security, Encryption, and Escalation technical support teams I oversaw US oncall and holiday schedules, handled email security customer escalations, held performance reviews, participated in security councils, and influenced the IronPort support vision and strategy. As a security leader, I helped design IronPort’s hosted email security solution and was a member of the hosted product team. As a lead in the IronPort support management team I maintained the management wiki pages, created a critical response process, led initiatives to improve customer satisfaction, and presented support overviews at customer forums. \n \nSelected Accomplishments: \n+ Increased customer satisfaction with email security support from 4.3 to 4.56 \n+ Reduced support escalation and critical response time, resolving customer problems faster Manager Technical Support IronPort Systems October 2008  –  October 2010  (2 years 1 month) San Bruno, CA As the manager of the San Bruno Email Security, Encryption, and Escalation technical support teams I oversaw US oncall and holiday schedules, handled email security customer escalations, held performance reviews, participated in security councils, and influenced the IronPort support vision and strategy. As a security leader, I helped design IronPort’s hosted email security solution and was a member of the hosted product team. As a lead in the IronPort support management team I maintained the management wiki pages, created a critical response process, led initiatives to improve customer satisfaction, and presented support overviews at customer forums. \n \nSelected Accomplishments: \n+ Increased customer satisfaction with email security support from 4.3 to 4.56 \n+ Reduced support escalation and critical response time, resolving customer problems faster Manager Technical Support Operations Cisco Systems January 2006  –  October 2008  (2 years 10 months) San Jose, CA •\tOversee operations of network support labs and technical support team in California and Texas with an annual budget of $5 Million. \n-\tForecast and staff all resources necessary to meet operational and project goals within Salary and Fringe committed budget.  \n-\tForecast department capital and operational expenses, and track to ensure spending is within 2% of commit each quarter. \n•\tServe as line manager point of escalation for all resource, customer and communication conflicts. \n•\tPartner with customers and peers globally to ensure department service level agreements meet customer requirements. \n•\tImprove customer satisfaction through application of DMAIC on all CALO activities.  \n-\tMeasure and analyze existing work and process flow to identify gaps and improvement opportunities. \n-\tPromote innovation of new lab designs to increase equipment utilization and address customer needs. \n•\tEnsure availability of over 50,000 network devices including hubs, routers, switches, firewalls, and APs. \n•\tLead a team of full time engineers, student co-ops, and contractors at 15 local and remote Cisco sites; 70% of the student co-ops turn-over every 6 months. \n-\tEstablished global lab processes, attained finance commitments and maintained high equipment availability over a two year period. \n-\t75% of co-op staff successfully trained to fill full time technical support positions \n•\tDevelop and present monthly and quarterly operations updates to executive management. Manager Technical Support Operations Cisco Systems January 2006  –  October 2008  (2 years 10 months) San Jose, CA •\tOversee operations of network support labs and technical support team in California and Texas with an annual budget of $5 Million. \n-\tForecast and staff all resources necessary to meet operational and project goals within Salary and Fringe committed budget.  \n-\tForecast department capital and operational expenses, and track to ensure spending is within 2% of commit each quarter. \n•\tServe as line manager point of escalation for all resource, customer and communication conflicts. \n•\tPartner with customers and peers globally to ensure department service level agreements meet customer requirements. \n•\tImprove customer satisfaction through application of DMAIC on all CALO activities.  \n-\tMeasure and analyze existing work and process flow to identify gaps and improvement opportunities. \n-\tPromote innovation of new lab designs to increase equipment utilization and address customer needs. \n•\tEnsure availability of over 50,000 network devices including hubs, routers, switches, firewalls, and APs. \n•\tLead a team of full time engineers, student co-ops, and contractors at 15 local and remote Cisco sites; 70% of the student co-ops turn-over every 6 months. \n-\tEstablished global lab processes, attained finance commitments and maintained high equipment availability over a two year period. \n-\t75% of co-op staff successfully trained to fill full time technical support positions \n•\tDevelop and present monthly and quarterly operations updates to executive management. Lead Product Serviceability Design Engineer Cisco Systems September 2003  –  2006  (3 years) San Jose, CA •\tLed the initiative to automate SDE processes and support notifications \n• Created Business Requirements Documents for IT to enhance PSE tools \n•\tWorked cross-functionally and served as a liaison between hardware and software engineering, marketing, manufacturing, quality engineering, and customer support teams for all new GSR releases. \n• Led hardware diagnostics OBFL project team.  \n- Generated and analyzed Oracle SQL reports to identify key customer problems and hardware quality issues. Lead Product Serviceability Design Engineer Cisco Systems September 2003  –  2006  (3 years) San Jose, CA •\tLed the initiative to automate SDE processes and support notifications \n• Created Business Requirements Documents for IT to enhance PSE tools \n•\tWorked cross-functionally and served as a liaison between hardware and software engineering, marketing, manufacturing, quality engineering, and customer support teams for all new GSR releases. \n• Led hardware diagnostics OBFL project team.  \n- Generated and analyzed Oracle SQL reports to identify key customer problems and hardware quality issues. Product Serviceability Design Engineer Cisco Systems October 1999  –  September 2003  (4 years) San Jose, CA • Worked cross-functionally and served as a liaison between hardware and software engineering, marketing, manufacturing, quality engineering, and customer support teams for three different product families. \n• Participated in all project design phases from Project Requirements Document creation to First Customer Ship. \n• Applied DMAIC process to review of hardware design with quality engineers to ensure value added customer requirements were being met. \n• Utilized business analysis skills to proactively identify user interface and hardware quality problems. \n- Presented key customer issues using cause/effect analysis data with process change recommendations to senior management. \n- Collaborated with Quality Engineering to review customer hardware failure trends and identify process and component workarounds. \n• Created and documented field alert and product safety notices when severe customer problems were identified post-FCS. Product Serviceability Design Engineer Cisco Systems October 1999  –  September 2003  (4 years) San Jose, CA • Worked cross-functionally and served as a liaison between hardware and software engineering, marketing, manufacturing, quality engineering, and customer support teams for three different product families. \n• Participated in all project design phases from Project Requirements Document creation to First Customer Ship. \n• Applied DMAIC process to review of hardware design with quality engineers to ensure value added customer requirements were being met. \n• Utilized business analysis skills to proactively identify user interface and hardware quality problems. \n- Presented key customer issues using cause/effect analysis data with process change recommendations to senior management. \n- Collaborated with Quality Engineering to review customer hardware failure trends and identify process and component workarounds. \n• Created and documented field alert and product safety notices when severe customer problems were identified post-FCS. Customer Support Engineer / Advanced Services Engineer Cisco Systems July 1996  –  October 1999  (3 years 4 months) San Jose, CA Customer Support Engineer / Advanced Services Engineer Cisco Systems July 1996  –  October 1999  (3 years 4 months) San Jose, CA Technical Support Engineer StrataCom, Inc June 1995  –  July 1996  (1 year 2 months) Technical Support Engineer StrataCom, Inc June 1995  –  July 1996  (1 year 2 months) System Administrator - various companies IT consultant Self Employed July 1992  –  May 1995  (2 years 11 months) System Administrator - various companies IT consultant Self Employed July 1992  –  May 1995  (2 years 11 months) Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Leadership SaaS Cross-functional Team... Operations Management Cloud Computing Business Analysis Change Management Cisco Technologies Technical Staff... Business Process... Business Strategy Supply Chain Operations Capital Equipment Depreciation Tactical Planning Vision Development Technical Support Integration Firewalls Customer Satisfaction Professional Services Management Data Center Network Security VoIP Process Improvement Project Planning Networking Team Leadership IT Strategy Testing Quality Assurance Six Sigma Enterprise Software Vendor Management Project Management Pre-sales Telecommunications Unified Communications Product Management Program Management Strategy Go-to-market Strategy Analysis See 29+     See less Skills  Leadership SaaS Cross-functional Team... Operations Management Cloud Computing Business Analysis Change Management Cisco Technologies Technical Staff... Business Process... Business Strategy Supply Chain Operations Capital Equipment Depreciation Tactical Planning Vision Development Technical Support Integration Firewalls Customer Satisfaction Professional Services Management Data Center Network Security VoIP Process Improvement Project Planning Networking Team Leadership IT Strategy Testing Quality Assurance Six Sigma Enterprise Software Vendor Management Project Management Pre-sales Telecommunications Unified Communications Product Management Program Management Strategy Go-to-market Strategy Analysis See 29+     See less Leadership SaaS Cross-functional Team... Operations Management Cloud Computing Business Analysis Change Management Cisco Technologies Technical Staff... Business Process... Business Strategy Supply Chain Operations Capital Equipment Depreciation Tactical Planning Vision Development Technical Support Integration Firewalls Customer Satisfaction Professional Services Management Data Center Network Security VoIP Process Improvement Project Planning Networking Team Leadership IT Strategy Testing Quality Assurance Six Sigma Enterprise Software Vendor Management Project Management Pre-sales Telecommunications Unified Communications Product Management Program Management Strategy Go-to-market Strategy Analysis See 29+     See less Leadership SaaS Cross-functional Team... Operations Management Cloud Computing Business Analysis Change Management Cisco Technologies Technical Staff... Business Process... Business Strategy Supply Chain Operations Capital Equipment Depreciation Tactical Planning Vision Development Technical Support Integration Firewalls Customer Satisfaction Professional Services Management Data Center Network Security VoIP Process Improvement Project Planning Networking Team Leadership IT Strategy Testing Quality Assurance Six Sigma Enterprise Software Vendor Management Project Management Pre-sales Telecommunications Unified Communications Product Management Program Management Strategy Go-to-market Strategy Analysis See 29+     See less Education San Jose State University English 1989  – 1992 UC Santa Cruz 1987  – 1989 San Jose State University English 1989  – 1992 San Jose State University English 1989  – 1992 San Jose State University English 1989  – 1992 UC Santa Cruz 1987  – 1989 UC Santa Cruz 1987  – 1989 UC Santa Cruz 1987  – 1989 ", "Summary Hardware Logic Design Engineer. Specialties:RTL coding and design, general coding in C++ and Perl. Data center access routing and switching, Layer 2 congestion management, packet scheduling / QoS. Summary Hardware Logic Design Engineer. Specialties:RTL coding and design, general coding in C++ and Perl. Data center access routing and switching, Layer 2 congestion management, packet scheduling / QoS. Hardware Logic Design Engineer. Specialties:RTL coding and design, general coding in C++ and Perl. Data center access routing and switching, Layer 2 congestion management, packet scheduling / QoS. Hardware Logic Design Engineer. Specialties:RTL coding and design, general coding in C++ and Perl. Data center access routing and switching, Layer 2 congestion management, packet scheduling / QoS. Experience Senior ASIC Design Engineer Cisco January 2014  – Present (1 year 8 months) San Jose, CA Application-Centric Infrastructure Group \n- Designed and implemented output scheduling logic \n- Implemented SPAN/L3/L2 multicast replication and pruning engine \n- Helped with streamlining Spyglass RTL de-linting flow Senior ASIC Design Engineer Cisco September 2008  –  December 2013  (5 years 4 months) San Francisco Bay Area Data Center Group \n- Designed, implemented, and verified scheduling/QoS, egress rewrite, Priority Flow Control, and hash table IP in Nexus 3548 “Algo Boost” ultra-low latency switch ASIC, optimized for algorithmic trading and HPC applications. \n- Designed and maintained optimized hash table IP used in Nexus and Catalyst switching platforms. \n- Contributed to verification and bringup of Cisco Unified Switch ASIC, in Nexus 4000 10G blade server switch modules. \n- Contributed to group SystemVerilog coding and linting guidelines. \n- Rated strong or outstanding in all annual reviews. FPGA Logic Designer Cisco Systems Inc. June 2007  –  August 2007  (3 months) Cable Modem Termination System Business Unit (CMTS BU) \nCoded top-level microarchitecture for DOCSIS 3.0 qualified CMTS MAC processors. Also designed and coded the memory self-test module for the device. Consultive Sales Associate Sears Holdings Corporation July 2005  –  August 2005  (2 months) Grossed over $60,000 in major home appliances, labor contracts, accessories, and maintenance plans in less than a month, after completing the Sears Advances Sales Associate course and training period. (Short duration was due to this being a summer job.) Provided customer service, dealt with complaints, directly contacted contractors, warehouses, and credit agencies. Comprehensively facilitated entire appliance selection and purchase experience. Instrument Technician NASA Goddard Space Flight Center July 2003  –  August 2003  (2 months) Lab For Extraterrestrial Physics \nAnalyzed Bolivian meteoric impact soil samples using Vibrating Sample Magnetometry. \nTested prototypes for the MEMS-based Programmable Microshutter Array to be included in the James Webb Space Telescope, scheduled for launch in 2014 to succeed Hubble. See <http://www.jwst.nasa.gov/microshutters.html> \nTested and analyzed magnetic properties of the rare meteoric mineral tetrataenite for scientific publication. Web Developer NASA Goddard Space Flight Center June 2002  –  July 2002  (2 months) National Space Science Data Center \nRecoded several hundred NASA web pages to comply with Federal accessibility guidelines, using HTML and SSI scripting in a Macromedia Dreamweaver development environment. Senior ASIC Design Engineer Cisco January 2014  – Present (1 year 8 months) San Jose, CA Application-Centric Infrastructure Group \n- Designed and implemented output scheduling logic \n- Implemented SPAN/L3/L2 multicast replication and pruning engine \n- Helped with streamlining Spyglass RTL de-linting flow Senior ASIC Design Engineer Cisco January 2014  – Present (1 year 8 months) San Jose, CA Application-Centric Infrastructure Group \n- Designed and implemented output scheduling logic \n- Implemented SPAN/L3/L2 multicast replication and pruning engine \n- Helped with streamlining Spyglass RTL de-linting flow Senior ASIC Design Engineer Cisco September 2008  –  December 2013  (5 years 4 months) San Francisco Bay Area Data Center Group \n- Designed, implemented, and verified scheduling/QoS, egress rewrite, Priority Flow Control, and hash table IP in Nexus 3548 “Algo Boost” ultra-low latency switch ASIC, optimized for algorithmic trading and HPC applications. \n- Designed and maintained optimized hash table IP used in Nexus and Catalyst switching platforms. \n- Contributed to verification and bringup of Cisco Unified Switch ASIC, in Nexus 4000 10G blade server switch modules. \n- Contributed to group SystemVerilog coding and linting guidelines. \n- Rated strong or outstanding in all annual reviews. Senior ASIC Design Engineer Cisco September 2008  –  December 2013  (5 years 4 months) San Francisco Bay Area Data Center Group \n- Designed, implemented, and verified scheduling/QoS, egress rewrite, Priority Flow Control, and hash table IP in Nexus 3548 “Algo Boost” ultra-low latency switch ASIC, optimized for algorithmic trading and HPC applications. \n- Designed and maintained optimized hash table IP used in Nexus and Catalyst switching platforms. \n- Contributed to verification and bringup of Cisco Unified Switch ASIC, in Nexus 4000 10G blade server switch modules. \n- Contributed to group SystemVerilog coding and linting guidelines. \n- Rated strong or outstanding in all annual reviews. FPGA Logic Designer Cisco Systems Inc. June 2007  –  August 2007  (3 months) Cable Modem Termination System Business Unit (CMTS BU) \nCoded top-level microarchitecture for DOCSIS 3.0 qualified CMTS MAC processors. Also designed and coded the memory self-test module for the device. FPGA Logic Designer Cisco Systems Inc. June 2007  –  August 2007  (3 months) Cable Modem Termination System Business Unit (CMTS BU) \nCoded top-level microarchitecture for DOCSIS 3.0 qualified CMTS MAC processors. Also designed and coded the memory self-test module for the device. Consultive Sales Associate Sears Holdings Corporation July 2005  –  August 2005  (2 months) Grossed over $60,000 in major home appliances, labor contracts, accessories, and maintenance plans in less than a month, after completing the Sears Advances Sales Associate course and training period. (Short duration was due to this being a summer job.) Provided customer service, dealt with complaints, directly contacted contractors, warehouses, and credit agencies. Comprehensively facilitated entire appliance selection and purchase experience. Consultive Sales Associate Sears Holdings Corporation July 2005  –  August 2005  (2 months) Grossed over $60,000 in major home appliances, labor contracts, accessories, and maintenance plans in less than a month, after completing the Sears Advances Sales Associate course and training period. (Short duration was due to this being a summer job.) Provided customer service, dealt with complaints, directly contacted contractors, warehouses, and credit agencies. Comprehensively facilitated entire appliance selection and purchase experience. Instrument Technician NASA Goddard Space Flight Center July 2003  –  August 2003  (2 months) Lab For Extraterrestrial Physics \nAnalyzed Bolivian meteoric impact soil samples using Vibrating Sample Magnetometry. \nTested prototypes for the MEMS-based Programmable Microshutter Array to be included in the James Webb Space Telescope, scheduled for launch in 2014 to succeed Hubble. See <http://www.jwst.nasa.gov/microshutters.html> \nTested and analyzed magnetic properties of the rare meteoric mineral tetrataenite for scientific publication. Instrument Technician NASA Goddard Space Flight Center July 2003  –  August 2003  (2 months) Lab For Extraterrestrial Physics \nAnalyzed Bolivian meteoric impact soil samples using Vibrating Sample Magnetometry. \nTested prototypes for the MEMS-based Programmable Microshutter Array to be included in the James Webb Space Telescope, scheduled for launch in 2014 to succeed Hubble. See <http://www.jwst.nasa.gov/microshutters.html> \nTested and analyzed magnetic properties of the rare meteoric mineral tetrataenite for scientific publication. Web Developer NASA Goddard Space Flight Center June 2002  –  July 2002  (2 months) National Space Science Data Center \nRecoded several hundred NASA web pages to comply with Federal accessibility guidelines, using HTML and SSI scripting in a Macromedia Dreamweaver development environment. Web Developer NASA Goddard Space Flight Center June 2002  –  July 2002  (2 months) National Space Science Data Center \nRecoded several hundred NASA web pages to comply with Federal accessibility guidelines, using HTML and SSI scripting in a Macromedia Dreamweaver development environment. Skills Verilog Perl Embedded Systems Network Processors C++ ASIC TCL FPGA Linux Ethernet Unix IP Routing Data Center Hardware Cisco Technologies RTL Design C QoS SystemVerilog Switches Debugging See 7+     See less Skills  Verilog Perl Embedded Systems Network Processors C++ ASIC TCL FPGA Linux Ethernet Unix IP Routing Data Center Hardware Cisco Technologies RTL Design C QoS SystemVerilog Switches Debugging See 7+     See less Verilog Perl Embedded Systems Network Processors C++ ASIC TCL FPGA Linux Ethernet Unix IP Routing Data Center Hardware Cisco Technologies RTL Design C QoS SystemVerilog Switches Debugging See 7+     See less Verilog Perl Embedded Systems Network Processors C++ ASIC TCL FPGA Linux Ethernet Unix IP Routing Data Center Hardware Cisco Technologies RTL Design C QoS SystemVerilog Switches Debugging See 7+     See less Education Duke University BSE,  Electrical Engineering ,  Biomedical Engineering 2004  – 2008 Activities and Societies:  Duke University Chorale (Section Personnel Manager) Vietnamese Student Association (Treasurer ,  VP of Recruitment ,  President) ,  Round Table Selective Living Group (Highest rated large residential program/fraternity at Duke - Webmaster ,  Historian ,  Co-President) River Hill High School 2000  – 2004 Stanford University Non-Degree Program,  Management Science & Engineering 2013 Organizational Behavior Duke University BSE,  Electrical Engineering ,  Biomedical Engineering 2004  – 2008 Activities and Societies:  Duke University Chorale (Section Personnel Manager) Vietnamese Student Association (Treasurer ,  VP of Recruitment ,  President) ,  Round Table Selective Living Group (Highest rated large residential program/fraternity at Duke - Webmaster ,  Historian ,  Co-President) Duke University BSE,  Electrical Engineering ,  Biomedical Engineering 2004  – 2008 Activities and Societies:  Duke University Chorale (Section Personnel Manager) Vietnamese Student Association (Treasurer ,  VP of Recruitment ,  President) ,  Round Table Selective Living Group (Highest rated large residential program/fraternity at Duke - Webmaster ,  Historian ,  Co-President) Duke University BSE,  Electrical Engineering ,  Biomedical Engineering 2004  – 2008 Activities and Societies:  Duke University Chorale (Section Personnel Manager) Vietnamese Student Association (Treasurer ,  VP of Recruitment ,  President) ,  Round Table Selective Living Group (Highest rated large residential program/fraternity at Duke - Webmaster ,  Historian ,  Co-President) River Hill High School 2000  – 2004 River Hill High School 2000  – 2004 River Hill High School 2000  – 2004 Stanford University Non-Degree Program,  Management Science & Engineering 2013 Organizational Behavior Stanford University Non-Degree Program,  Management Science & Engineering 2013 Organizational Behavior Stanford University Non-Degree Program,  Management Science & Engineering 2013 Organizational Behavior ", "Experience Product Design Engineer E2K Engineering, Inc July 2009  – Present (6 years 2 months) Ben Lomond, CA Working on new product designs, production tooling and other manufacturing infrastructure design and fabrication in my garage workshop. Hardware Design Engineer Altera July 2008  –  July 2009  (1 year 1 month) Santa Cruz, CA Printed circuit and FPGA design engineering, soft CPU functional verification, system-level FPGA CAE tool implementation and debug. I received my first-ever pink-slip during a round of layoffs following the onset of the financial crisis, and after the soft-CPU engineering team leader decided I was insufficiently \"deferential\" for his needs. Having received this valuable feedback, I subsequently elected to concentrate on my own product development work. I later declined an invitation from my former manager to return to Altera after the financial crisis had eased. Hardware Design Engineer Cisco October 1999  –  October 2006  (7 years 1 month) San Jose, CA Board and system level hardware design and debug for the Cisco 12000 (GSR) family of routers. Designed numerous circuit boards, and participated in many large-group design projects, such as new linecard ASIC \"engine\" design and bringup projects, as well as extensive switch-fabric design and debug work. I was a key contributor to numerous successful \"all-hands-on-deck\" high-priority and high-complexity system debug efforts. I managed our group's engineering lab, as a direct continuation of my work at StratumOne. Following the birth of our second child, I resigned to allow my wife to return to work while I raised our children until they reached preschool age. Hardware Design Engineer StratumOne Communications September 1998  –  October 1999  (1 year 2 months) Santa Clara, CA Established the printed circuit development infrastructure for this rapidly-growing VC-backed fabless semiconductor startup, working with high-speed networking interfaces (OC48, OC192). Assisted with development of ASIC I/O layout optimization tools and strategies for signal integrity, designed evaluation board for a \"framer\" ASIC, developed and managed hardware laboratory and corporate PCB CAD infrastructure. I also interviewed many additional board design engineer candidates, and hired one truly excellent engineer. StratumOne was purchased by Cisco in 1999, less than 18 months after it was founded. Hardware Design Engineer, Contractor PSO Systems August 1998  –  September 1998  (2 months) Oakland, CA This was a very small startup (3 people) self-funded by the founder to create a small ARM-based network fileserver appliance. I designed the motherboard, and then presented a budget for the fabrication costs and required laboratory infrastructure, at which point the founder decided that software would be likely to yield a safer ROI, thus ending this effort. Hardware Design Engineer, Contractor Intel Corporation February 1998  –  July 1998  (6 months) Olympia, WA Performed signal-integrity analysis work for the Merced (original Itanium CPU) motherboard design team as a temp contractor through Oxford & Associates. Hardware Design Engineer Eclipse Technical Group October 1997  –  November 1997  (2 months) Mountain View, CA Contributed to bringup of Windows CE hardware and design of novel touch-screen control circuitry. System Integrator Apple January 1997  –  September 1997  (9 months) Cupertino, CA System integrator for high-density configurations of workgroup servers. Solved a number of challenging thermal design issues, worked with manufacturing facility on new product introductions. Hardware Design Engineer Philips November 1996  –  January 1997  (3 months) Sunnyvale, CA Design engineer for Velo1 handheld computer. Assisted with hardware bringup and new feature designs before electing to leave for a position Apple offered me shortly after I started this job. Not my smartest decision. Hardware Design Engineer, Student Intern Sun Microsystems September 1992  –  October 1996  (4 years 2 months) Menlo Park and Mountain View, CA After my summer internship was over, I then talked my way into an undercover \"internship\" position for a project that had been denied funding within SunLabs. Using office supply funds and sampled ICs, and later some incremental and reluctant budget allocations from management, I designed and built the world's first color touchscreen tablet computer, along with my boss and partner-in-crime Dick Sillman. This work became the foundations of an ongoing mobile computing research group in Sun's Technology Development group. After I finally went back to school to complete the remaining coursework for my degree, on my return to Sun I learned that the project I'd intended to work on had been canceled. I then elected to pursue opportunities outside of Sun rather than continue with the alternate internal position I'd been offered. Summer Internship Researcher Sun Microsystems Laboratories, Inc. June 1992  –  August 1992  (3 months) Mountain View, CA Implemented distributed transaction processing facilities using a multi-level two-phase commit algorithm for the SpringOS object-oriented operating system research project. Helped conceive and build the rooftop-mounted catapult for the SunLabs vs. SunSoft water-balloon fight. Hardware Design Engineer, Undergraduate Research Assistant IBM-UCSC Joint Study in Supercomputer Research November 1989  –  June 1992  (2 years 8 months) UC Santa Cruz, CA Contributed to architecture, design and implementation of a coherent shared-memory bus with custom L3 caches and bus controllers running multiple i860 CPUs. Technical Support Technician Tall Tree Systems June 1985  –  June 1987  (2 years 1 month) Palo Alto, CA This was a garage startup that developed the original multi-megabyte IBM PC memory expansion cards, which later formed the (\"uncredited\") basis for the popular EMS bank-switched memory architecture. I started by working in shipping, then production-line hardware testing, and then production board debug/rework, and finally settled into tech support for the rest of my time in high school, during summers and after-school. Computer Tutor Stanford University June 1983  –  August 1983  (3 months) Palo Alto, CA Hired to teach Basic programming for a summer seminar on Microcomputers in Education by the Stanford School of Education. This program was led by Joan Targ, who also ran the Computer Tutors program at Jordan Junior High in Palo Alto. I also volunteered to teach Basic programming on North Star Horizon CP/M and then IBM PC machines for this program during the school years I attended Jordan. Product Design Engineer E2K Engineering, Inc July 2009  – Present (6 years 2 months) Ben Lomond, CA Working on new product designs, production tooling and other manufacturing infrastructure design and fabrication in my garage workshop. Product Design Engineer E2K Engineering, Inc July 2009  – Present (6 years 2 months) Ben Lomond, CA Working on new product designs, production tooling and other manufacturing infrastructure design and fabrication in my garage workshop. Hardware Design Engineer Altera July 2008  –  July 2009  (1 year 1 month) Santa Cruz, CA Printed circuit and FPGA design engineering, soft CPU functional verification, system-level FPGA CAE tool implementation and debug. I received my first-ever pink-slip during a round of layoffs following the onset of the financial crisis, and after the soft-CPU engineering team leader decided I was insufficiently \"deferential\" for his needs. Having received this valuable feedback, I subsequently elected to concentrate on my own product development work. I later declined an invitation from my former manager to return to Altera after the financial crisis had eased. Hardware Design Engineer Altera July 2008  –  July 2009  (1 year 1 month) Santa Cruz, CA Printed circuit and FPGA design engineering, soft CPU functional verification, system-level FPGA CAE tool implementation and debug. I received my first-ever pink-slip during a round of layoffs following the onset of the financial crisis, and after the soft-CPU engineering team leader decided I was insufficiently \"deferential\" for his needs. Having received this valuable feedback, I subsequently elected to concentrate on my own product development work. I later declined an invitation from my former manager to return to Altera after the financial crisis had eased. Hardware Design Engineer Cisco October 1999  –  October 2006  (7 years 1 month) San Jose, CA Board and system level hardware design and debug for the Cisco 12000 (GSR) family of routers. Designed numerous circuit boards, and participated in many large-group design projects, such as new linecard ASIC \"engine\" design and bringup projects, as well as extensive switch-fabric design and debug work. I was a key contributor to numerous successful \"all-hands-on-deck\" high-priority and high-complexity system debug efforts. I managed our group's engineering lab, as a direct continuation of my work at StratumOne. Following the birth of our second child, I resigned to allow my wife to return to work while I raised our children until they reached preschool age. Hardware Design Engineer Cisco October 1999  –  October 2006  (7 years 1 month) San Jose, CA Board and system level hardware design and debug for the Cisco 12000 (GSR) family of routers. Designed numerous circuit boards, and participated in many large-group design projects, such as new linecard ASIC \"engine\" design and bringup projects, as well as extensive switch-fabric design and debug work. I was a key contributor to numerous successful \"all-hands-on-deck\" high-priority and high-complexity system debug efforts. I managed our group's engineering lab, as a direct continuation of my work at StratumOne. Following the birth of our second child, I resigned to allow my wife to return to work while I raised our children until they reached preschool age. Hardware Design Engineer StratumOne Communications September 1998  –  October 1999  (1 year 2 months) Santa Clara, CA Established the printed circuit development infrastructure for this rapidly-growing VC-backed fabless semiconductor startup, working with high-speed networking interfaces (OC48, OC192). Assisted with development of ASIC I/O layout optimization tools and strategies for signal integrity, designed evaluation board for a \"framer\" ASIC, developed and managed hardware laboratory and corporate PCB CAD infrastructure. I also interviewed many additional board design engineer candidates, and hired one truly excellent engineer. StratumOne was purchased by Cisco in 1999, less than 18 months after it was founded. Hardware Design Engineer StratumOne Communications September 1998  –  October 1999  (1 year 2 months) Santa Clara, CA Established the printed circuit development infrastructure for this rapidly-growing VC-backed fabless semiconductor startup, working with high-speed networking interfaces (OC48, OC192). Assisted with development of ASIC I/O layout optimization tools and strategies for signal integrity, designed evaluation board for a \"framer\" ASIC, developed and managed hardware laboratory and corporate PCB CAD infrastructure. I also interviewed many additional board design engineer candidates, and hired one truly excellent engineer. StratumOne was purchased by Cisco in 1999, less than 18 months after it was founded. Hardware Design Engineer, Contractor PSO Systems August 1998  –  September 1998  (2 months) Oakland, CA This was a very small startup (3 people) self-funded by the founder to create a small ARM-based network fileserver appliance. I designed the motherboard, and then presented a budget for the fabrication costs and required laboratory infrastructure, at which point the founder decided that software would be likely to yield a safer ROI, thus ending this effort. Hardware Design Engineer, Contractor PSO Systems August 1998  –  September 1998  (2 months) Oakland, CA This was a very small startup (3 people) self-funded by the founder to create a small ARM-based network fileserver appliance. I designed the motherboard, and then presented a budget for the fabrication costs and required laboratory infrastructure, at which point the founder decided that software would be likely to yield a safer ROI, thus ending this effort. Hardware Design Engineer, Contractor Intel Corporation February 1998  –  July 1998  (6 months) Olympia, WA Performed signal-integrity analysis work for the Merced (original Itanium CPU) motherboard design team as a temp contractor through Oxford & Associates. Hardware Design Engineer, Contractor Intel Corporation February 1998  –  July 1998  (6 months) Olympia, WA Performed signal-integrity analysis work for the Merced (original Itanium CPU) motherboard design team as a temp contractor through Oxford & Associates. Hardware Design Engineer Eclipse Technical Group October 1997  –  November 1997  (2 months) Mountain View, CA Contributed to bringup of Windows CE hardware and design of novel touch-screen control circuitry. Hardware Design Engineer Eclipse Technical Group October 1997  –  November 1997  (2 months) Mountain View, CA Contributed to bringup of Windows CE hardware and design of novel touch-screen control circuitry. System Integrator Apple January 1997  –  September 1997  (9 months) Cupertino, CA System integrator for high-density configurations of workgroup servers. Solved a number of challenging thermal design issues, worked with manufacturing facility on new product introductions. System Integrator Apple January 1997  –  September 1997  (9 months) Cupertino, CA System integrator for high-density configurations of workgroup servers. Solved a number of challenging thermal design issues, worked with manufacturing facility on new product introductions. Hardware Design Engineer Philips November 1996  –  January 1997  (3 months) Sunnyvale, CA Design engineer for Velo1 handheld computer. Assisted with hardware bringup and new feature designs before electing to leave for a position Apple offered me shortly after I started this job. Not my smartest decision. Hardware Design Engineer Philips November 1996  –  January 1997  (3 months) Sunnyvale, CA Design engineer for Velo1 handheld computer. Assisted with hardware bringup and new feature designs before electing to leave for a position Apple offered me shortly after I started this job. Not my smartest decision. Hardware Design Engineer, Student Intern Sun Microsystems September 1992  –  October 1996  (4 years 2 months) Menlo Park and Mountain View, CA After my summer internship was over, I then talked my way into an undercover \"internship\" position for a project that had been denied funding within SunLabs. Using office supply funds and sampled ICs, and later some incremental and reluctant budget allocations from management, I designed and built the world's first color touchscreen tablet computer, along with my boss and partner-in-crime Dick Sillman. This work became the foundations of an ongoing mobile computing research group in Sun's Technology Development group. After I finally went back to school to complete the remaining coursework for my degree, on my return to Sun I learned that the project I'd intended to work on had been canceled. I then elected to pursue opportunities outside of Sun rather than continue with the alternate internal position I'd been offered. Hardware Design Engineer, Student Intern Sun Microsystems September 1992  –  October 1996  (4 years 2 months) Menlo Park and Mountain View, CA After my summer internship was over, I then talked my way into an undercover \"internship\" position for a project that had been denied funding within SunLabs. Using office supply funds and sampled ICs, and later some incremental and reluctant budget allocations from management, I designed and built the world's first color touchscreen tablet computer, along with my boss and partner-in-crime Dick Sillman. This work became the foundations of an ongoing mobile computing research group in Sun's Technology Development group. After I finally went back to school to complete the remaining coursework for my degree, on my return to Sun I learned that the project I'd intended to work on had been canceled. I then elected to pursue opportunities outside of Sun rather than continue with the alternate internal position I'd been offered. Summer Internship Researcher Sun Microsystems Laboratories, Inc. June 1992  –  August 1992  (3 months) Mountain View, CA Implemented distributed transaction processing facilities using a multi-level two-phase commit algorithm for the SpringOS object-oriented operating system research project. Helped conceive and build the rooftop-mounted catapult for the SunLabs vs. SunSoft water-balloon fight. Summer Internship Researcher Sun Microsystems Laboratories, Inc. June 1992  –  August 1992  (3 months) Mountain View, CA Implemented distributed transaction processing facilities using a multi-level two-phase commit algorithm for the SpringOS object-oriented operating system research project. Helped conceive and build the rooftop-mounted catapult for the SunLabs vs. SunSoft water-balloon fight. Hardware Design Engineer, Undergraduate Research Assistant IBM-UCSC Joint Study in Supercomputer Research November 1989  –  June 1992  (2 years 8 months) UC Santa Cruz, CA Contributed to architecture, design and implementation of a coherent shared-memory bus with custom L3 caches and bus controllers running multiple i860 CPUs. Hardware Design Engineer, Undergraduate Research Assistant IBM-UCSC Joint Study in Supercomputer Research November 1989  –  June 1992  (2 years 8 months) UC Santa Cruz, CA Contributed to architecture, design and implementation of a coherent shared-memory bus with custom L3 caches and bus controllers running multiple i860 CPUs. Technical Support Technician Tall Tree Systems June 1985  –  June 1987  (2 years 1 month) Palo Alto, CA This was a garage startup that developed the original multi-megabyte IBM PC memory expansion cards, which later formed the (\"uncredited\") basis for the popular EMS bank-switched memory architecture. I started by working in shipping, then production-line hardware testing, and then production board debug/rework, and finally settled into tech support for the rest of my time in high school, during summers and after-school. Technical Support Technician Tall Tree Systems June 1985  –  June 1987  (2 years 1 month) Palo Alto, CA This was a garage startup that developed the original multi-megabyte IBM PC memory expansion cards, which later formed the (\"uncredited\") basis for the popular EMS bank-switched memory architecture. I started by working in shipping, then production-line hardware testing, and then production board debug/rework, and finally settled into tech support for the rest of my time in high school, during summers and after-school. Computer Tutor Stanford University June 1983  –  August 1983  (3 months) Palo Alto, CA Hired to teach Basic programming for a summer seminar on Microcomputers in Education by the Stanford School of Education. This program was led by Joan Targ, who also ran the Computer Tutors program at Jordan Junior High in Palo Alto. I also volunteered to teach Basic programming on North Star Horizon CP/M and then IBM PC machines for this program during the school years I attended Jordan. Computer Tutor Stanford University June 1983  –  August 1983  (3 months) Palo Alto, CA Hired to teach Basic programming for a summer seminar on Microcomputers in Education by the Stanford School of Education. This program was led by Joan Targ, who also ran the Computer Tutors program at Jordan Junior High in Palo Alto. I also volunteered to teach Basic programming on North Star Horizon CP/M and then IBM PC machines for this program during the school years I attended Jordan. Skills Product Design Debugging Hardware Architecture Embedded Systems PCB design FPGA Logic Design RTL design Verilog Perl C C++ Processors Functional Verification Unix Linux TCP/IP Solidworks 3D modeling software CNC Programming Machining Metal Fabrication Altera SoC Engineering Management PCB Design TCL Semiconductors See 13+     See less Skills  Product Design Debugging Hardware Architecture Embedded Systems PCB design FPGA Logic Design RTL design Verilog Perl C C++ Processors Functional Verification Unix Linux TCP/IP Solidworks 3D modeling software CNC Programming Machining Metal Fabrication Altera SoC Engineering Management PCB Design TCL Semiconductors See 13+     See less Product Design Debugging Hardware Architecture Embedded Systems PCB design FPGA Logic Design RTL design Verilog Perl C C++ Processors Functional Verification Unix Linux TCP/IP Solidworks 3D modeling software CNC Programming Machining Metal Fabrication Altera SoC Engineering Management PCB Design TCL Semiconductors See 13+     See less Product Design Debugging Hardware Architecture Embedded Systems PCB design FPGA Logic Design RTL design Verilog Perl C C++ Processors Functional Verification Unix Linux TCP/IP Solidworks 3D modeling software CNC Programming Machining Metal Fabrication Altera SoC Engineering Management PCB Design TCL Semiconductors See 13+     See less Education University of California, Santa Cruz BS,  Computer Engineering 1987  – 1996 Activities and Societies:  IEEE UCSC Chapter President ,  Undergraduate Representative to the Computer Engineering Board of Studies. Palo Alto High School 1982  – 1987 Activities and Societies:  Rachel H. Austin Award University of California, Santa Cruz BS,  Computer Engineering 1987  – 1996 Activities and Societies:  IEEE UCSC Chapter President ,  Undergraduate Representative to the Computer Engineering Board of Studies. University of California, Santa Cruz BS,  Computer Engineering 1987  – 1996 Activities and Societies:  IEEE UCSC Chapter President ,  Undergraduate Representative to the Computer Engineering Board of Studies. University of California, Santa Cruz BS,  Computer Engineering 1987  – 1996 Activities and Societies:  IEEE UCSC Chapter President ,  Undergraduate Representative to the Computer Engineering Board of Studies. Palo Alto High School 1982  – 1987 Activities and Societies:  Rachel H. Austin Award Palo Alto High School 1982  – 1987 Activities and Societies:  Rachel H. Austin Award Palo Alto High School 1982  – 1987 Activities and Societies:  Rachel H. Austin Award ", "Summary Over 20 years of diverse and challenging experience in the telecommunication industry, combined with powerful analytical skills, a disciplined approach to the task at hand and the innate ability to anticipate potential obstacles are attributes that contribute to a strong record of excellence and acknowledgement for \"getting the job done.\" \n•\tStrong leadership and management skills substantiated by increasing levels of responsibility \n•\tProven leader in task-oriented objectives with excellent communication skills and interrelation experience \n•\tAn unsurpassed commitment to quality and professionalism, directly impacting company image and customer loyalty \n•\tBroad knowledge and understanding of the telecommunications principals, practices and design of: Service Provider market and dynamics, Cisco Wireline and Mobile NGN strategy, SP IP and SP Voice architectures and value propositions, Cisco products and solutions Summary Over 20 years of diverse and challenging experience in the telecommunication industry, combined with powerful analytical skills, a disciplined approach to the task at hand and the innate ability to anticipate potential obstacles are attributes that contribute to a strong record of excellence and acknowledgement for \"getting the job done.\" \n•\tStrong leadership and management skills substantiated by increasing levels of responsibility \n•\tProven leader in task-oriented objectives with excellent communication skills and interrelation experience \n•\tAn unsurpassed commitment to quality and professionalism, directly impacting company image and customer loyalty \n•\tBroad knowledge and understanding of the telecommunications principals, practices and design of: Service Provider market and dynamics, Cisco Wireline and Mobile NGN strategy, SP IP and SP Voice architectures and value propositions, Cisco products and solutions Over 20 years of diverse and challenging experience in the telecommunication industry, combined with powerful analytical skills, a disciplined approach to the task at hand and the innate ability to anticipate potential obstacles are attributes that contribute to a strong record of excellence and acknowledgement for \"getting the job done.\" \n•\tStrong leadership and management skills substantiated by increasing levels of responsibility \n•\tProven leader in task-oriented objectives with excellent communication skills and interrelation experience \n•\tAn unsurpassed commitment to quality and professionalism, directly impacting company image and customer loyalty \n•\tBroad knowledge and understanding of the telecommunications principals, practices and design of: Service Provider market and dynamics, Cisco Wireline and Mobile NGN strategy, SP IP and SP Voice architectures and value propositions, Cisco products and solutions Over 20 years of diverse and challenging experience in the telecommunication industry, combined with powerful analytical skills, a disciplined approach to the task at hand and the innate ability to anticipate potential obstacles are attributes that contribute to a strong record of excellence and acknowledgement for \"getting the job done.\" \n•\tStrong leadership and management skills substantiated by increasing levels of responsibility \n•\tProven leader in task-oriented objectives with excellent communication skills and interrelation experience \n•\tAn unsurpassed commitment to quality and professionalism, directly impacting company image and customer loyalty \n•\tBroad knowledge and understanding of the telecommunications principals, practices and design of: Service Provider market and dynamics, Cisco Wireline and Mobile NGN strategy, SP IP and SP Voice architectures and value propositions, Cisco products and solutions Experience Advanced Services Manager Cisco Systems February 2007  – Present (8 years 7 months) Responsible for positioning Cisco services to strategic customers in the Gulf region and align project teams to deliver upon quality and schedule commitments. \n• I assumed the role in 2007 with advanced services team composed of 10 network consulting engineers and project managers. I grew the team to 45 members split across three functions (UAE, Gulf and shared engineering pool) \n• I lead the delivery of du subscription contract (more than $4M service engagement) over the last 2 years with delivery focus across multiple technologies  Core/infrastructure  Data Center  Voice (enterprise and service provider)  NMS/OSS \n• Lead Dubai Airport Company (previously Dubai Civil Aviation) project as one of Cisco’s strategic customers. \n• Managed all stakeholders of the DAC project migration with interfaces to DAC management and engineering, other vendors and contractors (Arinc, Emirates Computers, Alpha Data, Mindscape) and internally with Cisco sales and channel management. I interfaced directly on weekly management/executive update to ensure seamless vendor/contractor engagement to deliver the project on time with high customer satisfaction. Cisco was the visible interface to this complex project and responsible to manage multiple stakeholder expectations including DAC management. \n• Partner with Cisco sales managers to bundle proper service packages for service provider and large enterprise/public sector customers (Etisalat, du, Wataniya, Qtel, MTC/Zain, Injazat, Masdar, Qatar Foundation, Qatar Petroleum) \nteams in the Gulf. \n• Manage professional services partner engagement to augment short-term resources especially for labour-intensive services (racking, stacking, cabling, on-site provisioning, …). I was responsible to finalize professional services subcontractor scopes and contracts and get Cisco legal approvals. Advanced Services Manager Cisco Systems International 1995  – Present (20 years) System Engineering Manager Cisco Systems July 2003  –  February 2007  (3 years 8 months) Assumed the responsibility for leading the service provider technical team across GCC countries (Gulf, Saudi and Pakistan). Focused on growing the team inline of the business growth in the service provider sector with special attention to: \n•\tPromote Cisco service provider architecture and solutions for wireline and mobile operators in the region (STC, Etisalat, du, Wataniya, MTC/Zain, Batelco, Omantel, Mobilink, Telenore, and others) \n•\tI was responsible to provide technical account plan for strategic Cisco customers in the region and emphasis on technical SWOT analysis per strategic account. This is part of Cisco major account plan. Cisco account team leveraged my technical plan to increase Cisco penetration in the account. \n•\tAligned SE specialization based on high business requirements with SE focus on IP/MPLS Core, SP Voice, BB and Metro Access and Mobile. \n•\tLead a team of sales engineers to position Cisco mobile solutions across Gulf region. Positioned a full-IP architecture to Wataniya as one of the leading regional mobile operators with focus on MPLS core infrastructure and multiservice edge platform with IP to the BTS. \n•\tLead a team of sales engineers to integrate Zain Data Centers to an upgraded IP core infrastructure. \n•\tEstablished very strong relationship internally within Cisco across multiple teams specially CA/Services, Marketing, Vertical and Shared Consulting teams. \n•\tDrove high attach rate of CA to compensate partner and customer qualifications of complex solutions especially for green field proposals including infrastructure and triple play. \n•\tDrove structured and consistent TOI program for top wireline and mobile operators in the region leveraging Cisco Day, Cisco Expo and Partner Summit events - STC, Etisalat, Omantel, Batelco, Qtel, PTCL, Mobilink, Warid and other tier-1 operators in the region. Consulting System Engineer Cisco Systems November 2001  –  July 2003  (1 year 9 months) Promoting new telecommunication technologies in the Gulf, Saudi Arabia, Egypt and North Africa, supporting deployments of multiservice and broadband Cisco solutions in the Middle East and North Africa, as well as technology transfer to Cisco partners and service integrators for new technologies such as broadband cable, multiservice, storage and unified communications. Tendering and Bid manager Cisco Systems July 2000  –  November 2002  (2 years 5 months) Established bid management team in Cisco Middle East to provide more streamlined and efficient support to large and complex deals especially with incumbents and green-field operators. I was a one-man team working closely with the extended bid management team in Europe. My achievements were highly recognized and appreciated by the country managers and regional sales managers in the Middle East: \n• Developed bid management library for the Middle East team to leverage quality tender responses in other opportunities and increase team efficiency to respond to new tenders. \n• Bring best practices from the European teams to the Middle East by linking relevant proposals to the BM Middle East library. \n• Established a structured engagement model with efficient and more optimized engagement of EMEA shared resources in the Middle East. This was reflected in more participation of EMEA consultants in the Middle East as well as better appreciation form the local sales team. \n• Managed several direct proposals which were the first such engagements in the Middle East. \n• Increased the visibility of CA participation in large SP tender proposals. This practice lead to increased CA attached rate in SP Cisco deals and more qualified proposals from the customers’ perspectives. Sales Engineer Cisco Systems May 1999  –  July 2000  (1 year 3 months) As a system engineer I focused on technologies such as VoIP and driving the end-to-end solution strategy as well as network convergence across multiple accounts such as STC (Saudi), NBK (Kuwait), PDO (Oman), ADNOC (UAE), Noor (Egypt) and other more. Software Development Manager Cisco Systems November 1997  –  May 1999  (1 year 7 months) Leading devtest team to certify hardware and software developments for Cisco uBR7200 and uBR900 products. Participated actively with Cable Labs to certify Cisco Cable solutions for DOCSIS 1.x and 2.x. \nLeading software development team for system testing of Interwork Business Unit (IBU) features leveraging requirements from Bank of America, VISA and other IBU customers. Software Engineer Cisco Systems September 1995  –  November 1997  (2 years 3 months) Developing system and regression testplans for CIP, APPN, DLSW+, TN3270 and ALPS. Network Design Engineer IBM May 1994  –  September 1995  (1 year 5 months) Responsible for the capacity planning and performance analysis of IBM’s multiprotocol global network infrastructure operated by Advantis. Development Staff Engineer IBM September 1991  –  May 1994  (2 years 9 months) Responsible for designing and evaluating IBM Open System Adapter for system 390. Researcher Kuwait Institute for Scientific Research June 1984  –  August 1985  (1 year 3 months) Research an optimized national treatment system for Kuwait at the Applied Systems Division in KISR. Advanced Services Manager Cisco Systems February 2007  – Present (8 years 7 months) Responsible for positioning Cisco services to strategic customers in the Gulf region and align project teams to deliver upon quality and schedule commitments. \n• I assumed the role in 2007 with advanced services team composed of 10 network consulting engineers and project managers. I grew the team to 45 members split across three functions (UAE, Gulf and shared engineering pool) \n• I lead the delivery of du subscription contract (more than $4M service engagement) over the last 2 years with delivery focus across multiple technologies  Core/infrastructure  Data Center  Voice (enterprise and service provider)  NMS/OSS \n• Lead Dubai Airport Company (previously Dubai Civil Aviation) project as one of Cisco’s strategic customers. \n• Managed all stakeholders of the DAC project migration with interfaces to DAC management and engineering, other vendors and contractors (Arinc, Emirates Computers, Alpha Data, Mindscape) and internally with Cisco sales and channel management. I interfaced directly on weekly management/executive update to ensure seamless vendor/contractor engagement to deliver the project on time with high customer satisfaction. Cisco was the visible interface to this complex project and responsible to manage multiple stakeholder expectations including DAC management. \n• Partner with Cisco sales managers to bundle proper service packages for service provider and large enterprise/public sector customers (Etisalat, du, Wataniya, Qtel, MTC/Zain, Injazat, Masdar, Qatar Foundation, Qatar Petroleum) \nteams in the Gulf. \n• Manage professional services partner engagement to augment short-term resources especially for labour-intensive services (racking, stacking, cabling, on-site provisioning, …). I was responsible to finalize professional services subcontractor scopes and contracts and get Cisco legal approvals. Advanced Services Manager Cisco Systems February 2007  – Present (8 years 7 months) Responsible for positioning Cisco services to strategic customers in the Gulf region and align project teams to deliver upon quality and schedule commitments. \n• I assumed the role in 2007 with advanced services team composed of 10 network consulting engineers and project managers. I grew the team to 45 members split across three functions (UAE, Gulf and shared engineering pool) \n• I lead the delivery of du subscription contract (more than $4M service engagement) over the last 2 years with delivery focus across multiple technologies  Core/infrastructure  Data Center  Voice (enterprise and service provider)  NMS/OSS \n• Lead Dubai Airport Company (previously Dubai Civil Aviation) project as one of Cisco’s strategic customers. \n• Managed all stakeholders of the DAC project migration with interfaces to DAC management and engineering, other vendors and contractors (Arinc, Emirates Computers, Alpha Data, Mindscape) and internally with Cisco sales and channel management. I interfaced directly on weekly management/executive update to ensure seamless vendor/contractor engagement to deliver the project on time with high customer satisfaction. Cisco was the visible interface to this complex project and responsible to manage multiple stakeholder expectations including DAC management. \n• Partner with Cisco sales managers to bundle proper service packages for service provider and large enterprise/public sector customers (Etisalat, du, Wataniya, Qtel, MTC/Zain, Injazat, Masdar, Qatar Foundation, Qatar Petroleum) \nteams in the Gulf. \n• Manage professional services partner engagement to augment short-term resources especially for labour-intensive services (racking, stacking, cabling, on-site provisioning, …). I was responsible to finalize professional services subcontractor scopes and contracts and get Cisco legal approvals. Advanced Services Manager Cisco Systems International 1995  – Present (20 years) Advanced Services Manager Cisco Systems International 1995  – Present (20 years) System Engineering Manager Cisco Systems July 2003  –  February 2007  (3 years 8 months) Assumed the responsibility for leading the service provider technical team across GCC countries (Gulf, Saudi and Pakistan). Focused on growing the team inline of the business growth in the service provider sector with special attention to: \n•\tPromote Cisco service provider architecture and solutions for wireline and mobile operators in the region (STC, Etisalat, du, Wataniya, MTC/Zain, Batelco, Omantel, Mobilink, Telenore, and others) \n•\tI was responsible to provide technical account plan for strategic Cisco customers in the region and emphasis on technical SWOT analysis per strategic account. This is part of Cisco major account plan. Cisco account team leveraged my technical plan to increase Cisco penetration in the account. \n•\tAligned SE specialization based on high business requirements with SE focus on IP/MPLS Core, SP Voice, BB and Metro Access and Mobile. \n•\tLead a team of sales engineers to position Cisco mobile solutions across Gulf region. Positioned a full-IP architecture to Wataniya as one of the leading regional mobile operators with focus on MPLS core infrastructure and multiservice edge platform with IP to the BTS. \n•\tLead a team of sales engineers to integrate Zain Data Centers to an upgraded IP core infrastructure. \n•\tEstablished very strong relationship internally within Cisco across multiple teams specially CA/Services, Marketing, Vertical and Shared Consulting teams. \n•\tDrove high attach rate of CA to compensate partner and customer qualifications of complex solutions especially for green field proposals including infrastructure and triple play. \n•\tDrove structured and consistent TOI program for top wireline and mobile operators in the region leveraging Cisco Day, Cisco Expo and Partner Summit events - STC, Etisalat, Omantel, Batelco, Qtel, PTCL, Mobilink, Warid and other tier-1 operators in the region. System Engineering Manager Cisco Systems July 2003  –  February 2007  (3 years 8 months) Assumed the responsibility for leading the service provider technical team across GCC countries (Gulf, Saudi and Pakistan). Focused on growing the team inline of the business growth in the service provider sector with special attention to: \n•\tPromote Cisco service provider architecture and solutions for wireline and mobile operators in the region (STC, Etisalat, du, Wataniya, MTC/Zain, Batelco, Omantel, Mobilink, Telenore, and others) \n•\tI was responsible to provide technical account plan for strategic Cisco customers in the region and emphasis on technical SWOT analysis per strategic account. This is part of Cisco major account plan. Cisco account team leveraged my technical plan to increase Cisco penetration in the account. \n•\tAligned SE specialization based on high business requirements with SE focus on IP/MPLS Core, SP Voice, BB and Metro Access and Mobile. \n•\tLead a team of sales engineers to position Cisco mobile solutions across Gulf region. Positioned a full-IP architecture to Wataniya as one of the leading regional mobile operators with focus on MPLS core infrastructure and multiservice edge platform with IP to the BTS. \n•\tLead a team of sales engineers to integrate Zain Data Centers to an upgraded IP core infrastructure. \n•\tEstablished very strong relationship internally within Cisco across multiple teams specially CA/Services, Marketing, Vertical and Shared Consulting teams. \n•\tDrove high attach rate of CA to compensate partner and customer qualifications of complex solutions especially for green field proposals including infrastructure and triple play. \n•\tDrove structured and consistent TOI program for top wireline and mobile operators in the region leveraging Cisco Day, Cisco Expo and Partner Summit events - STC, Etisalat, Omantel, Batelco, Qtel, PTCL, Mobilink, Warid and other tier-1 operators in the region. Consulting System Engineer Cisco Systems November 2001  –  July 2003  (1 year 9 months) Promoting new telecommunication technologies in the Gulf, Saudi Arabia, Egypt and North Africa, supporting deployments of multiservice and broadband Cisco solutions in the Middle East and North Africa, as well as technology transfer to Cisco partners and service integrators for new technologies such as broadband cable, multiservice, storage and unified communications. Consulting System Engineer Cisco Systems November 2001  –  July 2003  (1 year 9 months) Promoting new telecommunication technologies in the Gulf, Saudi Arabia, Egypt and North Africa, supporting deployments of multiservice and broadband Cisco solutions in the Middle East and North Africa, as well as technology transfer to Cisco partners and service integrators for new technologies such as broadband cable, multiservice, storage and unified communications. Tendering and Bid manager Cisco Systems July 2000  –  November 2002  (2 years 5 months) Established bid management team in Cisco Middle East to provide more streamlined and efficient support to large and complex deals especially with incumbents and green-field operators. I was a one-man team working closely with the extended bid management team in Europe. My achievements were highly recognized and appreciated by the country managers and regional sales managers in the Middle East: \n• Developed bid management library for the Middle East team to leverage quality tender responses in other opportunities and increase team efficiency to respond to new tenders. \n• Bring best practices from the European teams to the Middle East by linking relevant proposals to the BM Middle East library. \n• Established a structured engagement model with efficient and more optimized engagement of EMEA shared resources in the Middle East. This was reflected in more participation of EMEA consultants in the Middle East as well as better appreciation form the local sales team. \n• Managed several direct proposals which were the first such engagements in the Middle East. \n• Increased the visibility of CA participation in large SP tender proposals. This practice lead to increased CA attached rate in SP Cisco deals and more qualified proposals from the customers’ perspectives. Tendering and Bid manager Cisco Systems July 2000  –  November 2002  (2 years 5 months) Established bid management team in Cisco Middle East to provide more streamlined and efficient support to large and complex deals especially with incumbents and green-field operators. I was a one-man team working closely with the extended bid management team in Europe. My achievements were highly recognized and appreciated by the country managers and regional sales managers in the Middle East: \n• Developed bid management library for the Middle East team to leverage quality tender responses in other opportunities and increase team efficiency to respond to new tenders. \n• Bring best practices from the European teams to the Middle East by linking relevant proposals to the BM Middle East library. \n• Established a structured engagement model with efficient and more optimized engagement of EMEA shared resources in the Middle East. This was reflected in more participation of EMEA consultants in the Middle East as well as better appreciation form the local sales team. \n• Managed several direct proposals which were the first such engagements in the Middle East. \n• Increased the visibility of CA participation in large SP tender proposals. This practice lead to increased CA attached rate in SP Cisco deals and more qualified proposals from the customers’ perspectives. Sales Engineer Cisco Systems May 1999  –  July 2000  (1 year 3 months) As a system engineer I focused on technologies such as VoIP and driving the end-to-end solution strategy as well as network convergence across multiple accounts such as STC (Saudi), NBK (Kuwait), PDO (Oman), ADNOC (UAE), Noor (Egypt) and other more. Sales Engineer Cisco Systems May 1999  –  July 2000  (1 year 3 months) As a system engineer I focused on technologies such as VoIP and driving the end-to-end solution strategy as well as network convergence across multiple accounts such as STC (Saudi), NBK (Kuwait), PDO (Oman), ADNOC (UAE), Noor (Egypt) and other more. Software Development Manager Cisco Systems November 1997  –  May 1999  (1 year 7 months) Leading devtest team to certify hardware and software developments for Cisco uBR7200 and uBR900 products. Participated actively with Cable Labs to certify Cisco Cable solutions for DOCSIS 1.x and 2.x. \nLeading software development team for system testing of Interwork Business Unit (IBU) features leveraging requirements from Bank of America, VISA and other IBU customers. Software Development Manager Cisco Systems November 1997  –  May 1999  (1 year 7 months) Leading devtest team to certify hardware and software developments for Cisco uBR7200 and uBR900 products. Participated actively with Cable Labs to certify Cisco Cable solutions for DOCSIS 1.x and 2.x. \nLeading software development team for system testing of Interwork Business Unit (IBU) features leveraging requirements from Bank of America, VISA and other IBU customers. Software Engineer Cisco Systems September 1995  –  November 1997  (2 years 3 months) Developing system and regression testplans for CIP, APPN, DLSW+, TN3270 and ALPS. Software Engineer Cisco Systems September 1995  –  November 1997  (2 years 3 months) Developing system and regression testplans for CIP, APPN, DLSW+, TN3270 and ALPS. Network Design Engineer IBM May 1994  –  September 1995  (1 year 5 months) Responsible for the capacity planning and performance analysis of IBM’s multiprotocol global network infrastructure operated by Advantis. Network Design Engineer IBM May 1994  –  September 1995  (1 year 5 months) Responsible for the capacity planning and performance analysis of IBM’s multiprotocol global network infrastructure operated by Advantis. Development Staff Engineer IBM September 1991  –  May 1994  (2 years 9 months) Responsible for designing and evaluating IBM Open System Adapter for system 390. Development Staff Engineer IBM September 1991  –  May 1994  (2 years 9 months) Responsible for designing and evaluating IBM Open System Adapter for system 390. Researcher Kuwait Institute for Scientific Research June 1984  –  August 1985  (1 year 3 months) Research an optimized national treatment system for Kuwait at the Applied Systems Division in KISR. Researcher Kuwait Institute for Scientific Research June 1984  –  August 1985  (1 year 3 months) Research an optimized national treatment system for Kuwait at the Applied Systems Division in KISR. Education North Carolina State University PH.D.,  Operations Research / Computer Science 1986  – 1991 North Carolina State University, Raleigh, NC \n \nMajor: Operations Research\tMinor: Computer Science and Mathematics \nhttp://www.or.ncsu.edu/grad/phd_theses.html \n \nDissertation: Parallel Algorithms for Computing Stationary Probabilities of Large Markov Chains. \nhttp://www.csc.ncsu.edu/faculty/stewart/Publications/PS_files/Halim.ps Activities and Societies:  • Omega Rho: The Operations Research Honor Society. President NCSU chapter (1990-1991) and member since 1989.\n• ORSA: Vice president NCSU chapter (1987-1988) and member since 1986.\n• IEEE: Member (1980-1991) University of Michigan M.Sc.,  Electrical Engineering and Computer Science 1984  – 1985 The University of Michigan, Ann Arbor, MI Jami'at Al-Kuwait B.Sc.,  Electrical and Computer Engineering 1980  – 1984 Kuwait University, Kuwait North Carolina State University PH.D.,  Operations Research / Computer Science 1986  – 1991 North Carolina State University, Raleigh, NC \n \nMajor: Operations Research\tMinor: Computer Science and Mathematics \nhttp://www.or.ncsu.edu/grad/phd_theses.html \n \nDissertation: Parallel Algorithms for Computing Stationary Probabilities of Large Markov Chains. \nhttp://www.csc.ncsu.edu/faculty/stewart/Publications/PS_files/Halim.ps Activities and Societies:  • Omega Rho: The Operations Research Honor Society. President NCSU chapter (1990-1991) and member since 1989.\n• ORSA: Vice president NCSU chapter (1987-1988) and member since 1986.\n• IEEE: Member (1980-1991) North Carolina State University PH.D.,  Operations Research / Computer Science 1986  – 1991 North Carolina State University, Raleigh, NC \n \nMajor: Operations Research\tMinor: Computer Science and Mathematics \nhttp://www.or.ncsu.edu/grad/phd_theses.html \n \nDissertation: Parallel Algorithms for Computing Stationary Probabilities of Large Markov Chains. \nhttp://www.csc.ncsu.edu/faculty/stewart/Publications/PS_files/Halim.ps Activities and Societies:  • Omega Rho: The Operations Research Honor Society. President NCSU chapter (1990-1991) and member since 1989.\n• ORSA: Vice president NCSU chapter (1987-1988) and member since 1986.\n• IEEE: Member (1980-1991) North Carolina State University PH.D.,  Operations Research / Computer Science 1986  – 1991 North Carolina State University, Raleigh, NC \n \nMajor: Operations Research\tMinor: Computer Science and Mathematics \nhttp://www.or.ncsu.edu/grad/phd_theses.html \n \nDissertation: Parallel Algorithms for Computing Stationary Probabilities of Large Markov Chains. \nhttp://www.csc.ncsu.edu/faculty/stewart/Publications/PS_files/Halim.ps Activities and Societies:  • Omega Rho: The Operations Research Honor Society. President NCSU chapter (1990-1991) and member since 1989.\n• ORSA: Vice president NCSU chapter (1987-1988) and member since 1986.\n• IEEE: Member (1980-1991) University of Michigan M.Sc.,  Electrical Engineering and Computer Science 1984  – 1985 The University of Michigan, Ann Arbor, MI University of Michigan M.Sc.,  Electrical Engineering and Computer Science 1984  – 1985 The University of Michigan, Ann Arbor, MI University of Michigan M.Sc.,  Electrical Engineering and Computer Science 1984  – 1985 The University of Michigan, Ann Arbor, MI Jami'at Al-Kuwait B.Sc.,  Electrical and Computer Engineering 1980  – 1984 Kuwait University, Kuwait Jami'at Al-Kuwait B.Sc.,  Electrical and Computer Engineering 1980  – 1984 Kuwait University, Kuwait Jami'at Al-Kuwait B.Sc.,  Electrical and Computer Engineering 1980  – 1984 Kuwait University, Kuwait ", "Summary Principal Engineer for Mobility Solutions at Global SP Solutions Development on Cisco Systems (Engineering/Mobility Business Group). As a PE I'm responsible for homogeneous and integrated development of mobile end to end systems & architectures and its transition to a complementary NFV solutions. The most relevant ones include virtualized EPC insertion on vertical markets (Public Safety, Defense, and Transportation verticals), Telco Cloud offering for VoLTE and Integrated SP and Enterprise mobile service offering. \n \nMy professional live has been tied to the mobile technologies since my early days. After spending 4 years working on R&D and a very intense period on a greenfield mobile SP (now Orange Spain). I joined Cisco in 1999 where I've been focusing on mobile and wireless technologies. I've moved from System/Consultant Engineer on Sales to System Architect and now, Principal Engineer on the Mobility Systems Group. During my +8 years on sales, I've worked with many Tier 1's in different areas; from IP/MPLS unified core designs for Mobile Carriers and VoATM trunking to VoIP Solutions (FMC, IMS, pre-IMS, SIP-based, IP-PBX Hosted/Managed), CS Video solutions, 2.5G/3G/LTE Packet Gateway insertion and managed services for SPs. As Architect I've developed several Mobile systems (Telco WLAN system (Metro/ServiceMesh), WiMAX solution (WBS), Mobile Packet Core (MPC) System. As PE I have been working mainly in two areas, the Telco Cloud project, focusing on VoLTE NFV solution and the expansion of the Private LTE Networks based on virtualised EPC solution, that we named in Cisco, PMB Premium Mobile Broadband. \n \nMy passions are the innovative mobile service solutions and mobile-home/connected services. I have two Company Awards as CSE/SE. Summary Principal Engineer for Mobility Solutions at Global SP Solutions Development on Cisco Systems (Engineering/Mobility Business Group). As a PE I'm responsible for homogeneous and integrated development of mobile end to end systems & architectures and its transition to a complementary NFV solutions. The most relevant ones include virtualized EPC insertion on vertical markets (Public Safety, Defense, and Transportation verticals), Telco Cloud offering for VoLTE and Integrated SP and Enterprise mobile service offering. \n \nMy professional live has been tied to the mobile technologies since my early days. After spending 4 years working on R&D and a very intense period on a greenfield mobile SP (now Orange Spain). I joined Cisco in 1999 where I've been focusing on mobile and wireless technologies. I've moved from System/Consultant Engineer on Sales to System Architect and now, Principal Engineer on the Mobility Systems Group. During my +8 years on sales, I've worked with many Tier 1's in different areas; from IP/MPLS unified core designs for Mobile Carriers and VoATM trunking to VoIP Solutions (FMC, IMS, pre-IMS, SIP-based, IP-PBX Hosted/Managed), CS Video solutions, 2.5G/3G/LTE Packet Gateway insertion and managed services for SPs. As Architect I've developed several Mobile systems (Telco WLAN system (Metro/ServiceMesh), WiMAX solution (WBS), Mobile Packet Core (MPC) System. As PE I have been working mainly in two areas, the Telco Cloud project, focusing on VoLTE NFV solution and the expansion of the Private LTE Networks based on virtualised EPC solution, that we named in Cisco, PMB Premium Mobile Broadband. \n \nMy passions are the innovative mobile service solutions and mobile-home/connected services. I have two Company Awards as CSE/SE. Principal Engineer for Mobility Solutions at Global SP Solutions Development on Cisco Systems (Engineering/Mobility Business Group). As a PE I'm responsible for homogeneous and integrated development of mobile end to end systems & architectures and its transition to a complementary NFV solutions. The most relevant ones include virtualized EPC insertion on vertical markets (Public Safety, Defense, and Transportation verticals), Telco Cloud offering for VoLTE and Integrated SP and Enterprise mobile service offering. \n \nMy professional live has been tied to the mobile technologies since my early days. After spending 4 years working on R&D and a very intense period on a greenfield mobile SP (now Orange Spain). I joined Cisco in 1999 where I've been focusing on mobile and wireless technologies. I've moved from System/Consultant Engineer on Sales to System Architect and now, Principal Engineer on the Mobility Systems Group. During my +8 years on sales, I've worked with many Tier 1's in different areas; from IP/MPLS unified core designs for Mobile Carriers and VoATM trunking to VoIP Solutions (FMC, IMS, pre-IMS, SIP-based, IP-PBX Hosted/Managed), CS Video solutions, 2.5G/3G/LTE Packet Gateway insertion and managed services for SPs. As Architect I've developed several Mobile systems (Telco WLAN system (Metro/ServiceMesh), WiMAX solution (WBS), Mobile Packet Core (MPC) System. As PE I have been working mainly in two areas, the Telco Cloud project, focusing on VoLTE NFV solution and the expansion of the Private LTE Networks based on virtualised EPC solution, that we named in Cisco, PMB Premium Mobile Broadband. \n \nMy passions are the innovative mobile service solutions and mobile-home/connected services. I have two Company Awards as CSE/SE. Principal Engineer for Mobility Solutions at Global SP Solutions Development on Cisco Systems (Engineering/Mobility Business Group). As a PE I'm responsible for homogeneous and integrated development of mobile end to end systems & architectures and its transition to a complementary NFV solutions. The most relevant ones include virtualized EPC insertion on vertical markets (Public Safety, Defense, and Transportation verticals), Telco Cloud offering for VoLTE and Integrated SP and Enterprise mobile service offering. \n \nMy professional live has been tied to the mobile technologies since my early days. After spending 4 years working on R&D and a very intense period on a greenfield mobile SP (now Orange Spain). I joined Cisco in 1999 where I've been focusing on mobile and wireless technologies. I've moved from System/Consultant Engineer on Sales to System Architect and now, Principal Engineer on the Mobility Systems Group. During my +8 years on sales, I've worked with many Tier 1's in different areas; from IP/MPLS unified core designs for Mobile Carriers and VoATM trunking to VoIP Solutions (FMC, IMS, pre-IMS, SIP-based, IP-PBX Hosted/Managed), CS Video solutions, 2.5G/3G/LTE Packet Gateway insertion and managed services for SPs. As Architect I've developed several Mobile systems (Telco WLAN system (Metro/ServiceMesh), WiMAX solution (WBS), Mobile Packet Core (MPC) System. As PE I have been working mainly in two areas, the Telco Cloud project, focusing on VoLTE NFV solution and the expansion of the Private LTE Networks based on virtualised EPC solution, that we named in Cisco, PMB Premium Mobile Broadband. \n \nMy passions are the innovative mobile service solutions and mobile-home/connected services. I have two Company Awards as CSE/SE. Experience Principal Engineer Cisco Systems January 2015  – Present (8 months) Mobile Worker - Spain Principal Engineer on the Mobility Business Group working on two main solutions: Virtualized EPC solution for private networks and vertical markets (Public Safety and defense, Oil-Gas/Mining/etc) including mobility Enterprise/SP convergence, and Virtualized VoLTE offering (Telco-Cloud NFV). Principal Engineer - Systems Development Unit (Eng Ops and Systems)Edit Cisco Systems November 2012  – Present (2 years 10 months) Mobile Worker - A Coruña, Spain Principal Engineer on charge of the Mobile Systems at SDU. The systems cover several mobility related areas; Virtualized EPC solution for vertical markets (PSS/Oil-Gas/Mining/etc), Transport solutions, Mobility Enterprise/SP convergence, and Virtualized VoLTE offering (Telco-Cloud). \n \nLast year I was Lead System Architect on charge of the Mobile Packet Core System at SDU. The System includes; EPC and 3G Core elements, PCRF, OCS, HSS/HLR, Offload solution (WLAN), Mobile Video Optimization/Streaming and IMS OneVoice Architecture support). System has been expanded to support Satellite IP Networks under the same architecture. System Architect - Systems Development Unit (Eng Ops and Systems) Cisco Systems March 2010  –  November 2012  (2 years 9 months) Madrid Area, Spain Lead System Architect on charge of the Mobile Packet Core System for Mobile Service Providers. The System includes; EPC and 3G Core elements, PCRF, OCS, HSS/HLR, Offload solution (WLAN), Mobile Video Optimization/Streaming and IMS OneVoice Architecture support). Technical Leader - SP Systems Unit (SPSU) Cisco Systems August 2007  –  March 2010  (2 years 8 months) Madrid Area, Spain Technical Leader/System Architect of end to end WiMAX architectures. \nService Backend Architect for Data/Voice Service, PDF/PEP and Managed Services on Wireless Technologies. Design Engineer Cisco Systems August 2006  –  August 2007  (1 year 1 month) Madrid Area, Spain Co-Architect & Design Engineer for Wireless MESH solution in Cisco for SP market. \nBackend (PDF/PEP) integration and specification for Wireless (WiFi MESH) networks. Consulting Engineer - Mobile Wireless Cisco Systems August 2005  –  July 2006  (1 year) Madrid Area, Spain Acting as Consultant System Engineer for the main MSPs in Europe working on Value Add Services (IMS and pre-IMS systems, Application servers, virtual and hosted PBX deployments). Managed services for MSPs and mobile video/SIP deployments. Customers include VF-Spain, VF-Portugal, Telefonica-Movistar, Orange, etc. Business Development Manager - Mobile Wireless Cisco Systems August 2004  –  July 2005  (1 year) Madrid Area, Spain Responsible for Manage Services creation for mobile SPs. Lead the unified fixed/mobile data/voice offering to business working with major three groups in Europe. Consulting Engineer - Telefonica Group Cisco Systems July 2000  –  July 2004  (4 years 1 month) Madrid Area, Spain CSE on charge of Movistar (Spain) and global technical advisor for other affiliates. Deployment of unified MPLS core in Spain, Unified Service access for Movistar (Data+Voice), and SIP Service on Cisco side. Reponsible for the architecture of TSM launching in Italy (Core Design and O&M Network). Value add services platform/Network in ViVo (Brazil) are the most relevant projects on this time. Systems Engineer - OSS Specialist Cisco Systems November 1999  –  July 2000  (9 months) Madrid Area, Spain System Engineer associated to New SPs in Spain. Mainly working with Amena (Orange SPAIN), where I was responsible for IP core expansion (first Mobile SP with an MPLS Unified backbone for Services and O&M in Europe) and First Mobile VoATM Trunking deployment in Europe. \nResponsible for OSS solutions in Cisco as vertical resource. OSS and IP Services Network Manager Amena (now Orange Spain) November 1998  –  November 1999  (1 year 1 month) Madrid Area, Spain Responsible for deployment of unified MPLS core to serve both IT and Customer networks, in transition to all-IP support network. Challenging because on those days we just had TDP, since LDP was not standarzided yet. Launching of IP services nodes (WAP, GPRS), and integration of all mobile nodes under a common management umbrella (TeMIP). Implementation of first European VoAAL2 trunking solution for Voice between MSCs (used to connect mainland with remote islands (Balear/Canary)). R&D Engineer Institute for Technology and Research October 1997  –  November 1998  (1 year 2 months) Madrid Area, Spain Senior R&D Engineer working in projects related to Engergy Market (Endesa), HighSpeed Train (AVE) comunications project (Renfe/Vodafone) and Madrid Metro System. Research Assistant Professor Carlos III University November 1993  –  September 1997  (3 years 11 months) Madrid Area, Spain R&D Professor working on my Ph.D thessis. Distributing Operating Systems, I.A. Vison project, Real-Time systems and Object Oriented programing on virtualized environments. Principal Engineer Cisco Systems January 2015  – Present (8 months) Mobile Worker - Spain Principal Engineer on the Mobility Business Group working on two main solutions: Virtualized EPC solution for private networks and vertical markets (Public Safety and defense, Oil-Gas/Mining/etc) including mobility Enterprise/SP convergence, and Virtualized VoLTE offering (Telco-Cloud NFV). Principal Engineer Cisco Systems January 2015  – Present (8 months) Mobile Worker - Spain Principal Engineer on the Mobility Business Group working on two main solutions: Virtualized EPC solution for private networks and vertical markets (Public Safety and defense, Oil-Gas/Mining/etc) including mobility Enterprise/SP convergence, and Virtualized VoLTE offering (Telco-Cloud NFV). Principal Engineer - Systems Development Unit (Eng Ops and Systems)Edit Cisco Systems November 2012  – Present (2 years 10 months) Mobile Worker - A Coruña, Spain Principal Engineer on charge of the Mobile Systems at SDU. The systems cover several mobility related areas; Virtualized EPC solution for vertical markets (PSS/Oil-Gas/Mining/etc), Transport solutions, Mobility Enterprise/SP convergence, and Virtualized VoLTE offering (Telco-Cloud). \n \nLast year I was Lead System Architect on charge of the Mobile Packet Core System at SDU. The System includes; EPC and 3G Core elements, PCRF, OCS, HSS/HLR, Offload solution (WLAN), Mobile Video Optimization/Streaming and IMS OneVoice Architecture support). System has been expanded to support Satellite IP Networks under the same architecture. Principal Engineer - Systems Development Unit (Eng Ops and Systems)Edit Cisco Systems November 2012  – Present (2 years 10 months) Mobile Worker - A Coruña, Spain Principal Engineer on charge of the Mobile Systems at SDU. The systems cover several mobility related areas; Virtualized EPC solution for vertical markets (PSS/Oil-Gas/Mining/etc), Transport solutions, Mobility Enterprise/SP convergence, and Virtualized VoLTE offering (Telco-Cloud). \n \nLast year I was Lead System Architect on charge of the Mobile Packet Core System at SDU. The System includes; EPC and 3G Core elements, PCRF, OCS, HSS/HLR, Offload solution (WLAN), Mobile Video Optimization/Streaming and IMS OneVoice Architecture support). System has been expanded to support Satellite IP Networks under the same architecture. System Architect - Systems Development Unit (Eng Ops and Systems) Cisco Systems March 2010  –  November 2012  (2 years 9 months) Madrid Area, Spain Lead System Architect on charge of the Mobile Packet Core System for Mobile Service Providers. The System includes; EPC and 3G Core elements, PCRF, OCS, HSS/HLR, Offload solution (WLAN), Mobile Video Optimization/Streaming and IMS OneVoice Architecture support). System Architect - Systems Development Unit (Eng Ops and Systems) Cisco Systems March 2010  –  November 2012  (2 years 9 months) Madrid Area, Spain Lead System Architect on charge of the Mobile Packet Core System for Mobile Service Providers. The System includes; EPC and 3G Core elements, PCRF, OCS, HSS/HLR, Offload solution (WLAN), Mobile Video Optimization/Streaming and IMS OneVoice Architecture support). Technical Leader - SP Systems Unit (SPSU) Cisco Systems August 2007  –  March 2010  (2 years 8 months) Madrid Area, Spain Technical Leader/System Architect of end to end WiMAX architectures. \nService Backend Architect for Data/Voice Service, PDF/PEP and Managed Services on Wireless Technologies. Technical Leader - SP Systems Unit (SPSU) Cisco Systems August 2007  –  March 2010  (2 years 8 months) Madrid Area, Spain Technical Leader/System Architect of end to end WiMAX architectures. \nService Backend Architect for Data/Voice Service, PDF/PEP and Managed Services on Wireless Technologies. Design Engineer Cisco Systems August 2006  –  August 2007  (1 year 1 month) Madrid Area, Spain Co-Architect & Design Engineer for Wireless MESH solution in Cisco for SP market. \nBackend (PDF/PEP) integration and specification for Wireless (WiFi MESH) networks. Design Engineer Cisco Systems August 2006  –  August 2007  (1 year 1 month) Madrid Area, Spain Co-Architect & Design Engineer for Wireless MESH solution in Cisco for SP market. \nBackend (PDF/PEP) integration and specification for Wireless (WiFi MESH) networks. Consulting Engineer - Mobile Wireless Cisco Systems August 2005  –  July 2006  (1 year) Madrid Area, Spain Acting as Consultant System Engineer for the main MSPs in Europe working on Value Add Services (IMS and pre-IMS systems, Application servers, virtual and hosted PBX deployments). Managed services for MSPs and mobile video/SIP deployments. Customers include VF-Spain, VF-Portugal, Telefonica-Movistar, Orange, etc. Consulting Engineer - Mobile Wireless Cisco Systems August 2005  –  July 2006  (1 year) Madrid Area, Spain Acting as Consultant System Engineer for the main MSPs in Europe working on Value Add Services (IMS and pre-IMS systems, Application servers, virtual and hosted PBX deployments). Managed services for MSPs and mobile video/SIP deployments. Customers include VF-Spain, VF-Portugal, Telefonica-Movistar, Orange, etc. Business Development Manager - Mobile Wireless Cisco Systems August 2004  –  July 2005  (1 year) Madrid Area, Spain Responsible for Manage Services creation for mobile SPs. Lead the unified fixed/mobile data/voice offering to business working with major three groups in Europe. Business Development Manager - Mobile Wireless Cisco Systems August 2004  –  July 2005  (1 year) Madrid Area, Spain Responsible for Manage Services creation for mobile SPs. Lead the unified fixed/mobile data/voice offering to business working with major three groups in Europe. Consulting Engineer - Telefonica Group Cisco Systems July 2000  –  July 2004  (4 years 1 month) Madrid Area, Spain CSE on charge of Movistar (Spain) and global technical advisor for other affiliates. Deployment of unified MPLS core in Spain, Unified Service access for Movistar (Data+Voice), and SIP Service on Cisco side. Reponsible for the architecture of TSM launching in Italy (Core Design and O&M Network). Value add services platform/Network in ViVo (Brazil) are the most relevant projects on this time. Consulting Engineer - Telefonica Group Cisco Systems July 2000  –  July 2004  (4 years 1 month) Madrid Area, Spain CSE on charge of Movistar (Spain) and global technical advisor for other affiliates. Deployment of unified MPLS core in Spain, Unified Service access for Movistar (Data+Voice), and SIP Service on Cisco side. Reponsible for the architecture of TSM launching in Italy (Core Design and O&M Network). Value add services platform/Network in ViVo (Brazil) are the most relevant projects on this time. Systems Engineer - OSS Specialist Cisco Systems November 1999  –  July 2000  (9 months) Madrid Area, Spain System Engineer associated to New SPs in Spain. Mainly working with Amena (Orange SPAIN), where I was responsible for IP core expansion (first Mobile SP with an MPLS Unified backbone for Services and O&M in Europe) and First Mobile VoATM Trunking deployment in Europe. \nResponsible for OSS solutions in Cisco as vertical resource. Systems Engineer - OSS Specialist Cisco Systems November 1999  –  July 2000  (9 months) Madrid Area, Spain System Engineer associated to New SPs in Spain. Mainly working with Amena (Orange SPAIN), where I was responsible for IP core expansion (first Mobile SP with an MPLS Unified backbone for Services and O&M in Europe) and First Mobile VoATM Trunking deployment in Europe. \nResponsible for OSS solutions in Cisco as vertical resource. OSS and IP Services Network Manager Amena (now Orange Spain) November 1998  –  November 1999  (1 year 1 month) Madrid Area, Spain Responsible for deployment of unified MPLS core to serve both IT and Customer networks, in transition to all-IP support network. Challenging because on those days we just had TDP, since LDP was not standarzided yet. Launching of IP services nodes (WAP, GPRS), and integration of all mobile nodes under a common management umbrella (TeMIP). Implementation of first European VoAAL2 trunking solution for Voice between MSCs (used to connect mainland with remote islands (Balear/Canary)). OSS and IP Services Network Manager Amena (now Orange Spain) November 1998  –  November 1999  (1 year 1 month) Madrid Area, Spain Responsible for deployment of unified MPLS core to serve both IT and Customer networks, in transition to all-IP support network. Challenging because on those days we just had TDP, since LDP was not standarzided yet. Launching of IP services nodes (WAP, GPRS), and integration of all mobile nodes under a common management umbrella (TeMIP). Implementation of first European VoAAL2 trunking solution for Voice between MSCs (used to connect mainland with remote islands (Balear/Canary)). R&D Engineer Institute for Technology and Research October 1997  –  November 1998  (1 year 2 months) Madrid Area, Spain Senior R&D Engineer working in projects related to Engergy Market (Endesa), HighSpeed Train (AVE) comunications project (Renfe/Vodafone) and Madrid Metro System. R&D Engineer Institute for Technology and Research October 1997  –  November 1998  (1 year 2 months) Madrid Area, Spain Senior R&D Engineer working in projects related to Engergy Market (Endesa), HighSpeed Train (AVE) comunications project (Renfe/Vodafone) and Madrid Metro System. Research Assistant Professor Carlos III University November 1993  –  September 1997  (3 years 11 months) Madrid Area, Spain R&D Professor working on my Ph.D thessis. Distributing Operating Systems, I.A. Vison project, Real-Time systems and Object Oriented programing on virtualized environments. Research Assistant Professor Carlos III University November 1993  –  September 1997  (3 years 11 months) Madrid Area, Spain R&D Professor working on my Ph.D thessis. Distributing Operating Systems, I.A. Vison project, Real-Time systems and Object Oriented programing on virtualized environments. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency Galician Native or bilingual proficiency Portuguese Professional working proficiency Italian Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Galician Native or bilingual proficiency Portuguese Professional working proficiency Italian Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Galician Native or bilingual proficiency Portuguese Professional working proficiency Italian Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills LTE-EPC GPRS Proxy Mobile IPv6 WIMAX PCRF QoS, DPI, SBC AAA HSS IMS-VoLTE VoIP WLAN IP Routing and Switching MPLS Networking IP QoS Managed Services Cloud Computing System and Services... Hypervisor Technologies Unified Computing... Mobile Architectures... TCP Proxy Optimization... Mobile Video Public Safety Technology Linux System... Cellular Routers M2M QoS WiMAX VMware WAN Mobile Communications IPv6 MPLS IP Routing Network Design System Deployment Open Source Software Cisco Technologies SNMP 3GPP Mobile Content Cellular Communications System Architecture IMS DB/DC 3G WiFi Operating Systems Network Architecture UMTS See 35+     See less Skills  LTE-EPC GPRS Proxy Mobile IPv6 WIMAX PCRF QoS, DPI, SBC AAA HSS IMS-VoLTE VoIP WLAN IP Routing and Switching MPLS Networking IP QoS Managed Services Cloud Computing System and Services... Hypervisor Technologies Unified Computing... Mobile Architectures... TCP Proxy Optimization... Mobile Video Public Safety Technology Linux System... Cellular Routers M2M QoS WiMAX VMware WAN Mobile Communications IPv6 MPLS IP Routing Network Design System Deployment Open Source Software Cisco Technologies SNMP 3GPP Mobile Content Cellular Communications System Architecture IMS DB/DC 3G WiFi Operating Systems Network Architecture UMTS See 35+     See less LTE-EPC GPRS Proxy Mobile IPv6 WIMAX PCRF QoS, DPI, SBC AAA HSS IMS-VoLTE VoIP WLAN IP Routing and Switching MPLS Networking IP QoS Managed Services Cloud Computing System and Services... Hypervisor Technologies Unified Computing... Mobile Architectures... TCP Proxy Optimization... Mobile Video Public Safety Technology Linux System... Cellular Routers M2M QoS WiMAX VMware WAN Mobile Communications IPv6 MPLS IP Routing Network Design System Deployment Open Source Software Cisco Technologies SNMP 3GPP Mobile Content Cellular Communications System Architecture IMS DB/DC 3G WiFi Operating Systems Network Architecture UMTS See 35+     See less LTE-EPC GPRS Proxy Mobile IPv6 WIMAX PCRF QoS, DPI, SBC AAA HSS IMS-VoLTE VoIP WLAN IP Routing and Switching MPLS Networking IP QoS Managed Services Cloud Computing System and Services... Hypervisor Technologies Unified Computing... Mobile Architectures... TCP Proxy Optimization... Mobile Video Public Safety Technology Linux System... Cellular Routers M2M QoS WiMAX VMware WAN Mobile Communications IPv6 MPLS IP Routing Network Design System Deployment Open Source Software Cisco Technologies SNMP 3GPP Mobile Content Cellular Communications System Architecture IMS DB/DC 3G WiFi Operating Systems Network Architecture UMTS See 35+     See less Education Universidad Politécnica de Madrid (PhD) PhD,  Distributed and Reat time systems. Networking. 1993  – 1997 Collaboration with University of Illinois - Urbana - Distributed OS Systems Lab \nCollaboration with University of Linz - Austria \nCollaboration with Universtiy of Extremadura - Spain \nFinalist paper on Hot Topics on Operating Systems (HotOS IV) - IEEE \nAssociate Professor at Engineering School - Universidad Carlos III - Spain \nSenior Reseracher at IIT (School of Engineering - Unviersidad Pontificia) - IIT is a linked center with MIT-US. Activities and Societies:  Former Member of ACM and former member of IEEE\nSmall Cell Forum Member Universidad Politécnica de Madrid MSC,  Computer Science 1987  – 1993 Software Engineering Department Selected Student.  \nAI Department Selected Student. Activities and Societies:  Software Engineering Lab and Debate Team on AI. Universidad Politécnica de Madrid (PhD) PhD,  Distributed and Reat time systems. Networking. 1993  – 1997 Collaboration with University of Illinois - Urbana - Distributed OS Systems Lab \nCollaboration with University of Linz - Austria \nCollaboration with Universtiy of Extremadura - Spain \nFinalist paper on Hot Topics on Operating Systems (HotOS IV) - IEEE \nAssociate Professor at Engineering School - Universidad Carlos III - Spain \nSenior Reseracher at IIT (School of Engineering - Unviersidad Pontificia) - IIT is a linked center with MIT-US. Activities and Societies:  Former Member of ACM and former member of IEEE\nSmall Cell Forum Member Universidad Politécnica de Madrid (PhD) PhD,  Distributed and Reat time systems. Networking. 1993  – 1997 Collaboration with University of Illinois - Urbana - Distributed OS Systems Lab \nCollaboration with University of Linz - Austria \nCollaboration with Universtiy of Extremadura - Spain \nFinalist paper on Hot Topics on Operating Systems (HotOS IV) - IEEE \nAssociate Professor at Engineering School - Universidad Carlos III - Spain \nSenior Reseracher at IIT (School of Engineering - Unviersidad Pontificia) - IIT is a linked center with MIT-US. Activities and Societies:  Former Member of ACM and former member of IEEE\nSmall Cell Forum Member Universidad Politécnica de Madrid (PhD) PhD,  Distributed and Reat time systems. Networking. 1993  – 1997 Collaboration with University of Illinois - Urbana - Distributed OS Systems Lab \nCollaboration with University of Linz - Austria \nCollaboration with Universtiy of Extremadura - Spain \nFinalist paper on Hot Topics on Operating Systems (HotOS IV) - IEEE \nAssociate Professor at Engineering School - Universidad Carlos III - Spain \nSenior Reseracher at IIT (School of Engineering - Unviersidad Pontificia) - IIT is a linked center with MIT-US. Activities and Societies:  Former Member of ACM and former member of IEEE\nSmall Cell Forum Member Universidad Politécnica de Madrid MSC,  Computer Science 1987  – 1993 Software Engineering Department Selected Student.  \nAI Department Selected Student. Activities and Societies:  Software Engineering Lab and Debate Team on AI. Universidad Politécnica de Madrid MSC,  Computer Science 1987  – 1993 Software Engineering Department Selected Student.  \nAI Department Selected Student. Activities and Societies:  Software Engineering Lab and Debate Team on AI. Universidad Politécnica de Madrid MSC,  Computer Science 1987  – 1993 Software Engineering Department Selected Student.  \nAI Department Selected Student. Activities and Societies:  Software Engineering Lab and Debate Team on AI. ", "Experience Hardware Design Engineer Cisco Systems January 2008  – Present (7 years 8 months) Hardware Test Engineer Cisco Systems December 2006  –  December 2007  (1 year 1 month) San Jose Hardware Design Engineer Associate Credence Systems October 2005  –  October 2006  (1 year 1 month) Milpitas Test Technician (Contractor) Intel Corporation December 2004  –  October 2005  (11 months) Hardware Design Engineer Cisco Systems January 2008  – Present (7 years 8 months) Hardware Design Engineer Cisco Systems January 2008  – Present (7 years 8 months) Hardware Test Engineer Cisco Systems December 2006  –  December 2007  (1 year 1 month) San Jose Hardware Test Engineer Cisco Systems December 2006  –  December 2007  (1 year 1 month) San Jose Hardware Design Engineer Associate Credence Systems October 2005  –  October 2006  (1 year 1 month) Milpitas Hardware Design Engineer Associate Credence Systems October 2005  –  October 2006  (1 year 1 month) Milpitas Test Technician (Contractor) Intel Corporation December 2004  –  October 2005  (11 months) Test Technician (Contractor) Intel Corporation December 2004  –  October 2005  (11 months) Education San Jose State University Master of Business Administration (MBA) , GPA 3.9 2012 San Jose State University Master of Systems Engineering , GPA 3.9 2012 San Jose State University BS Electrical Engineering , GPA 3.7 - Dean's Scholar Award 2007 San Jose State University Master of Business Administration (MBA) , GPA 3.9 2012 San Jose State University Master of Business Administration (MBA) , GPA 3.9 2012 San Jose State University Master of Business Administration (MBA) , GPA 3.9 2012 San Jose State University Master of Systems Engineering , GPA 3.9 2012 San Jose State University Master of Systems Engineering , GPA 3.9 2012 San Jose State University Master of Systems Engineering , GPA 3.9 2012 San Jose State University BS Electrical Engineering , GPA 3.7 - Dean's Scholar Award 2007 San Jose State University BS Electrical Engineering , GPA 3.7 - Dean's Scholar Award 2007 San Jose State University BS Electrical Engineering , GPA 3.7 - Dean's Scholar Award 2007 ", "Skills PCB design DDR RF ESD control Schematic Capture Hardware Architecture Signal Integrity Analog PCB Design Manufacturing Electrical Engineering Skills  PCB design DDR RF ESD control Schematic Capture Hardware Architecture Signal Integrity Analog PCB Design Manufacturing Electrical Engineering PCB design DDR RF ESD control Schematic Capture Hardware Architecture Signal Integrity Analog PCB Design Manufacturing Electrical Engineering PCB design DDR RF ESD control Schematic Capture Hardware Architecture Signal Integrity Analog PCB Design Manufacturing Electrical Engineering ", "Summary Experienced Hardware designer familiar with: \n•\tProduct design and active involvement in cross-functional integration.  \n•\tExperience in schematic capture, board layout, signal integrity, manufacturing process, system debug, and board bringup. \n•\tKnowledge of Intel CPU sub-system design and high speed networking (10Gb, 40Gb). \n•\tStrong understanding of high speed signal issues (PCIe, XAUI, KR, and related signals). \n•\tProactive participation in mechanical enclosure design and thermal analysis. \n•\tStrong analytical and problem solving skills. \n•\tHighly visible individual contributor and team player. \n•\tOutstanding oral and written communication ability. Summary Experienced Hardware designer familiar with: \n•\tProduct design and active involvement in cross-functional integration.  \n•\tExperience in schematic capture, board layout, signal integrity, manufacturing process, system debug, and board bringup. \n•\tKnowledge of Intel CPU sub-system design and high speed networking (10Gb, 40Gb). \n•\tStrong understanding of high speed signal issues (PCIe, XAUI, KR, and related signals). \n•\tProactive participation in mechanical enclosure design and thermal analysis. \n•\tStrong analytical and problem solving skills. \n•\tHighly visible individual contributor and team player. \n•\tOutstanding oral and written communication ability. Experienced Hardware designer familiar with: \n•\tProduct design and active involvement in cross-functional integration.  \n•\tExperience in schematic capture, board layout, signal integrity, manufacturing process, system debug, and board bringup. \n•\tKnowledge of Intel CPU sub-system design and high speed networking (10Gb, 40Gb). \n•\tStrong understanding of high speed signal issues (PCIe, XAUI, KR, and related signals). \n•\tProactive participation in mechanical enclosure design and thermal analysis. \n•\tStrong analytical and problem solving skills. \n•\tHighly visible individual contributor and team player. \n•\tOutstanding oral and written communication ability. Experienced Hardware designer familiar with: \n•\tProduct design and active involvement in cross-functional integration.  \n•\tExperience in schematic capture, board layout, signal integrity, manufacturing process, system debug, and board bringup. \n•\tKnowledge of Intel CPU sub-system design and high speed networking (10Gb, 40Gb). \n•\tStrong understanding of high speed signal issues (PCIe, XAUI, KR, and related signals). \n•\tProactive participation in mechanical enclosure design and thermal analysis. \n•\tStrong analytical and problem solving skills. \n•\tHighly visible individual contributor and team player. \n•\tOutstanding oral and written communication ability. Experience Hardware Design Engineer Cisco Systems (SAVBU) February 2009  – Present (6 years 7 months) Designer of multiple PCI-E Converged Network Adapter(CNA) cards designed for Cisco UCS Rackmount Servers. \n \n* Designed and developed both 10Gb, and 40Gb pci-e cards using a Cisco ASIC and external PHY vendors. \n \n* Responsible for all aspects of hardware design and product development involving definition, specifications, power analysis, schematic capture, layout, and board bring up. \n \n* Responsible for product passing EDVT, MDVT and Regulatory (EMI/Safety).  \n \n* Tested various SFP+ modules (SR, LR, LRM, Copper) for 10Gb with Cisco switches. \n \n* Tested various QSFP modules (SR4, CR4, 4x10G, Breakout cables) for 40Gb with Cisco Switches. \n \n* Coordinated and worked with Software, Firmware, Diagnostics and Software QA teams. \n \n* Worked extensively with Cisco manufacturing to design a quality product on an accelerated schedule. \n \nUCS 260: A Cisco rack mount server using Intel x86 server processors \n \n* Worked with a team to create a server which consists of 2 Intel CPUs, North Bridge, South Bridge, Board Management Controller (BMC), Memory risers, SAS drives, networking interface, and 7 PCI-E Slots. \n \n* Tasks included product specification, schematic entry, layout, and thermal analysis. \n \n* Coordinated and guided Diagnostic team review plans and test validation. \n \n* Traveled to Contract Manufacturer (CM) Foxconn in Shenzhen China. Trained Foxconn engineers while working with Cisco manufacturing to ensure full test coverage. \n \n* Traveled to Contract Manufacturer Foxconn (Houston, TX) site to supervise assembly, configuration and testing before UCS 260 was shipped to customers as part of Direct Fulfillment (DF). Hardware Design Engineer Cisco Systems (DCBU) May 2006  –  January 2009  (2 years 9 months) Designer on Nexus 4000 Switch which plugged into an IBM blade server. \n \n* Board consists of a 20 port Cisco ASIC. Each port is capable of 10Gb. Major Components included a Cisco ASIC, Freescale processor, memory, and flash. \n \n* Responsible for hardware specification, schematic capture, layout, and power analysis. \n \n* Managed engineering project meetings with various groups (SW, SQA, Manufacturing, and Marketing) to make sure tasks were done on time. Supervised EMI, EDVT, and MDVT testing. \n \n* Ensured product matched PRD per IBMs and Cisco’s requirements and met cost requirements (COGs). \n \n* Worked with ASIC and FPGA design team on several issues including timing, power analysis, pinouts, verification and debug. \n \n* Effectively communicated Transfer of Information (TOI) to Cisco’s contract manufacturer (CM), by traveling to Jabil China in Shangai. This resulted in Jabil being self-sufficient in debugging boards and that Cisco was able to meet FCS date. Hardware Engineer Cisco Systems (DCBU) February 2003  –  April 2006  (3 years 3 months) San Francisco Bay Area MDS 8/24c Switch which plugged into an HP bladeserver. \n \n* Designed and debugged a 24 port, 4G fibre-channel switch designed as a module in a HP Blade server.Board consisted of a Cisco ASIC capable of 4Gb per port, CPU, and FPGA \n \n* Visited customer (HP) onsite in Texas to help get product tested properly, and to familiarize HP with Cisco San OS. \n \n* Developed test procedures and transferred debug knowledge to Cisco and Jabil manufacturing teams Hardware Engineer Andiamo Systems (Start-up bought by Cisco Systems) June 2001  –  February 2003  (1 year 9 months) * Responsible for testing newly designed hardware and EDVT chamber qualification of MDS 9000 SAN Switch. \n \n* Tasks include: planning and scheduling of chamber resource allocation; update and verification of FPGA code release; diagnose, troubleshoot and identify failing components through the use of internal diagnostics and SanOS test programs; generate summary and individual failure of test results. \n \n* Write Specs, test plans, interface with Customer during FA process, traveling to vendors, and onsite vendor training. Hardware Design Engineer Cisco Systems (SAVBU) February 2009  – Present (6 years 7 months) Designer of multiple PCI-E Converged Network Adapter(CNA) cards designed for Cisco UCS Rackmount Servers. \n \n* Designed and developed both 10Gb, and 40Gb pci-e cards using a Cisco ASIC and external PHY vendors. \n \n* Responsible for all aspects of hardware design and product development involving definition, specifications, power analysis, schematic capture, layout, and board bring up. \n \n* Responsible for product passing EDVT, MDVT and Regulatory (EMI/Safety).  \n \n* Tested various SFP+ modules (SR, LR, LRM, Copper) for 10Gb with Cisco switches. \n \n* Tested various QSFP modules (SR4, CR4, 4x10G, Breakout cables) for 40Gb with Cisco Switches. \n \n* Coordinated and worked with Software, Firmware, Diagnostics and Software QA teams. \n \n* Worked extensively with Cisco manufacturing to design a quality product on an accelerated schedule. \n \nUCS 260: A Cisco rack mount server using Intel x86 server processors \n \n* Worked with a team to create a server which consists of 2 Intel CPUs, North Bridge, South Bridge, Board Management Controller (BMC), Memory risers, SAS drives, networking interface, and 7 PCI-E Slots. \n \n* Tasks included product specification, schematic entry, layout, and thermal analysis. \n \n* Coordinated and guided Diagnostic team review plans and test validation. \n \n* Traveled to Contract Manufacturer (CM) Foxconn in Shenzhen China. Trained Foxconn engineers while working with Cisco manufacturing to ensure full test coverage. \n \n* Traveled to Contract Manufacturer Foxconn (Houston, TX) site to supervise assembly, configuration and testing before UCS 260 was shipped to customers as part of Direct Fulfillment (DF). Hardware Design Engineer Cisco Systems (SAVBU) February 2009  – Present (6 years 7 months) Designer of multiple PCI-E Converged Network Adapter(CNA) cards designed for Cisco UCS Rackmount Servers. \n \n* Designed and developed both 10Gb, and 40Gb pci-e cards using a Cisco ASIC and external PHY vendors. \n \n* Responsible for all aspects of hardware design and product development involving definition, specifications, power analysis, schematic capture, layout, and board bring up. \n \n* Responsible for product passing EDVT, MDVT and Regulatory (EMI/Safety).  \n \n* Tested various SFP+ modules (SR, LR, LRM, Copper) for 10Gb with Cisco switches. \n \n* Tested various QSFP modules (SR4, CR4, 4x10G, Breakout cables) for 40Gb with Cisco Switches. \n \n* Coordinated and worked with Software, Firmware, Diagnostics and Software QA teams. \n \n* Worked extensively with Cisco manufacturing to design a quality product on an accelerated schedule. \n \nUCS 260: A Cisco rack mount server using Intel x86 server processors \n \n* Worked with a team to create a server which consists of 2 Intel CPUs, North Bridge, South Bridge, Board Management Controller (BMC), Memory risers, SAS drives, networking interface, and 7 PCI-E Slots. \n \n* Tasks included product specification, schematic entry, layout, and thermal analysis. \n \n* Coordinated and guided Diagnostic team review plans and test validation. \n \n* Traveled to Contract Manufacturer (CM) Foxconn in Shenzhen China. Trained Foxconn engineers while working with Cisco manufacturing to ensure full test coverage. \n \n* Traveled to Contract Manufacturer Foxconn (Houston, TX) site to supervise assembly, configuration and testing before UCS 260 was shipped to customers as part of Direct Fulfillment (DF). Hardware Design Engineer Cisco Systems (DCBU) May 2006  –  January 2009  (2 years 9 months) Designer on Nexus 4000 Switch which plugged into an IBM blade server. \n \n* Board consists of a 20 port Cisco ASIC. Each port is capable of 10Gb. Major Components included a Cisco ASIC, Freescale processor, memory, and flash. \n \n* Responsible for hardware specification, schematic capture, layout, and power analysis. \n \n* Managed engineering project meetings with various groups (SW, SQA, Manufacturing, and Marketing) to make sure tasks were done on time. Supervised EMI, EDVT, and MDVT testing. \n \n* Ensured product matched PRD per IBMs and Cisco’s requirements and met cost requirements (COGs). \n \n* Worked with ASIC and FPGA design team on several issues including timing, power analysis, pinouts, verification and debug. \n \n* Effectively communicated Transfer of Information (TOI) to Cisco’s contract manufacturer (CM), by traveling to Jabil China in Shangai. This resulted in Jabil being self-sufficient in debugging boards and that Cisco was able to meet FCS date. Hardware Design Engineer Cisco Systems (DCBU) May 2006  –  January 2009  (2 years 9 months) Designer on Nexus 4000 Switch which plugged into an IBM blade server. \n \n* Board consists of a 20 port Cisco ASIC. Each port is capable of 10Gb. Major Components included a Cisco ASIC, Freescale processor, memory, and flash. \n \n* Responsible for hardware specification, schematic capture, layout, and power analysis. \n \n* Managed engineering project meetings with various groups (SW, SQA, Manufacturing, and Marketing) to make sure tasks were done on time. Supervised EMI, EDVT, and MDVT testing. \n \n* Ensured product matched PRD per IBMs and Cisco’s requirements and met cost requirements (COGs). \n \n* Worked with ASIC and FPGA design team on several issues including timing, power analysis, pinouts, verification and debug. \n \n* Effectively communicated Transfer of Information (TOI) to Cisco’s contract manufacturer (CM), by traveling to Jabil China in Shangai. This resulted in Jabil being self-sufficient in debugging boards and that Cisco was able to meet FCS date. Hardware Engineer Cisco Systems (DCBU) February 2003  –  April 2006  (3 years 3 months) San Francisco Bay Area MDS 8/24c Switch which plugged into an HP bladeserver. \n \n* Designed and debugged a 24 port, 4G fibre-channel switch designed as a module in a HP Blade server.Board consisted of a Cisco ASIC capable of 4Gb per port, CPU, and FPGA \n \n* Visited customer (HP) onsite in Texas to help get product tested properly, and to familiarize HP with Cisco San OS. \n \n* Developed test procedures and transferred debug knowledge to Cisco and Jabil manufacturing teams Hardware Engineer Cisco Systems (DCBU) February 2003  –  April 2006  (3 years 3 months) San Francisco Bay Area MDS 8/24c Switch which plugged into an HP bladeserver. \n \n* Designed and debugged a 24 port, 4G fibre-channel switch designed as a module in a HP Blade server.Board consisted of a Cisco ASIC capable of 4Gb per port, CPU, and FPGA \n \n* Visited customer (HP) onsite in Texas to help get product tested properly, and to familiarize HP with Cisco San OS. \n \n* Developed test procedures and transferred debug knowledge to Cisco and Jabil manufacturing teams Hardware Engineer Andiamo Systems (Start-up bought by Cisco Systems) June 2001  –  February 2003  (1 year 9 months) * Responsible for testing newly designed hardware and EDVT chamber qualification of MDS 9000 SAN Switch. \n \n* Tasks include: planning and scheduling of chamber resource allocation; update and verification of FPGA code release; diagnose, troubleshoot and identify failing components through the use of internal diagnostics and SanOS test programs; generate summary and individual failure of test results. \n \n* Write Specs, test plans, interface with Customer during FA process, traveling to vendors, and onsite vendor training. Hardware Engineer Andiamo Systems (Start-up bought by Cisco Systems) June 2001  –  February 2003  (1 year 9 months) * Responsible for testing newly designed hardware and EDVT chamber qualification of MDS 9000 SAN Switch. \n \n* Tasks include: planning and scheduling of chamber resource allocation; update and verification of FPGA code release; diagnose, troubleshoot and identify failing components through the use of internal diagnostics and SanOS test programs; generate summary and individual failure of test results. \n \n* Write Specs, test plans, interface with Customer during FA process, traveling to vendors, and onsite vendor training. Skills IXIA System Architecture Ethernet Network Processors Embedded Systems TCL Fibre Channel PCB design Hardware FCoE Device Drivers Vera Cisco Technologies Skills  IXIA System Architecture Ethernet Network Processors Embedded Systems TCL Fibre Channel PCB design Hardware FCoE Device Drivers Vera Cisco Technologies IXIA System Architecture Ethernet Network Processors Embedded Systems TCL Fibre Channel PCB design Hardware FCoE Device Drivers Vera Cisco Technologies IXIA System Architecture Ethernet Network Processors Embedded Systems TCL Fibre Channel PCB design Hardware FCoE Device Drivers Vera Cisco Technologies Education University of California, Santa Cruz Bachelor of Science (BS) Computer Engineering; Bachelor of Arts (BA) Business Management Economics,  Computer Engineering and Business Management 1998  – 2003 Activities and Societies:  Graduation Speaker la paz elementry school University of California, Santa Cruz Bachelor of Science (BS) Computer Engineering; Bachelor of Arts (BA) Business Management Economics,  Computer Engineering and Business Management 1998  – 2003 Activities and Societies:  Graduation Speaker University of California, Santa Cruz Bachelor of Science (BS) Computer Engineering; Bachelor of Arts (BA) Business Management Economics,  Computer Engineering and Business Management 1998  – 2003 Activities and Societies:  Graduation Speaker University of California, Santa Cruz Bachelor of Science (BS) Computer Engineering; Bachelor of Arts (BA) Business Management Economics,  Computer Engineering and Business Management 1998  – 2003 Activities and Societies:  Graduation Speaker la paz elementry school la paz elementry school la paz elementry school ", "Experience Hardware Design Engineer Cisco October 2008  – Present (6 years 11 months) Monza/Vimercate Software Automation Developer Cisco October 2001  –  September 2008  (7 years) Monza Hardware Engineer Cisco February 2000  –  October 2001  (1 year 9 months) Monza Hardware Design Engineer Pirelli Cable and System April 1991  –  February 2000  (8 years 11 months) Milan Hardware Design Engineer Cisco October 2008  – Present (6 years 11 months) Monza/Vimercate Hardware Design Engineer Cisco October 2008  – Present (6 years 11 months) Monza/Vimercate Software Automation Developer Cisco October 2001  –  September 2008  (7 years) Monza Software Automation Developer Cisco October 2001  –  September 2008  (7 years) Monza Hardware Engineer Cisco February 2000  –  October 2001  (1 year 9 months) Monza Hardware Engineer Cisco February 2000  –  October 2001  (1 year 9 months) Monza Hardware Design Engineer Pirelli Cable and System April 1991  –  February 2000  (8 years 11 months) Milan Hardware Design Engineer Pirelli Cable and System April 1991  –  February 2000  (8 years 11 months) Milan ", "Skills Cisco Technologies Technical Services Innovation Unified Communications Cisco Wireless Cisco Call Manager Cisco Routing &... Delivering Results Change Management Operational Excellence Skills  Cisco Technologies Technical Services Innovation Unified Communications Cisco Wireless Cisco Call Manager Cisco Routing &... Delivering Results Change Management Operational Excellence Cisco Technologies Technical Services Innovation Unified Communications Cisco Wireless Cisco Call Manager Cisco Routing &... Delivering Results Change Management Operational Excellence Cisco Technologies Technical Services Innovation Unified Communications Cisco Wireless Cisco Call Manager Cisco Routing &... Delivering Results Change Management Operational Excellence ", "Summary * Hardware System Design experience in Access Switches, Service Provider Edge Routers, & Data Center Compute/Storage products. \n \n* Understanding of entire development cycle - HW architecture, HW design specs, component selection, cost analysis, power estimation, hardware design & development, SI analysis, Bring up, HW/SW integration testing, system level debugging, test plans, and manufacturing release. \n \n* Experience with Optical Transceivers, Processors, High Speed Memory Technologies, Network Processors, Switch Fabrics, Ethernet Phys, Jitter-Attenuators, Power-Modules, Power-Sequencers, PCIe, Clock Distribution Tree, High Speed Serial Data Links. \n \n* Work with cross functional teams – CAD/Layout, Software, Mechanical, Compliance, NPI, ODVT, EDVT, MDVT, Devtest/QA, Marketing, Thermal, EMI, Safety, Parametric and Environmental testing teams.  \n* A self starter, highly ambitious and goal directed. Effective independently or as a member of the team and have excellent written and verbal communication skills. Able to handle a multitude of details and meet close deadlines under pressure. Summary * Hardware System Design experience in Access Switches, Service Provider Edge Routers, & Data Center Compute/Storage products. \n \n* Understanding of entire development cycle - HW architecture, HW design specs, component selection, cost analysis, power estimation, hardware design & development, SI analysis, Bring up, HW/SW integration testing, system level debugging, test plans, and manufacturing release. \n \n* Experience with Optical Transceivers, Processors, High Speed Memory Technologies, Network Processors, Switch Fabrics, Ethernet Phys, Jitter-Attenuators, Power-Modules, Power-Sequencers, PCIe, Clock Distribution Tree, High Speed Serial Data Links. \n \n* Work with cross functional teams – CAD/Layout, Software, Mechanical, Compliance, NPI, ODVT, EDVT, MDVT, Devtest/QA, Marketing, Thermal, EMI, Safety, Parametric and Environmental testing teams.  \n* A self starter, highly ambitious and goal directed. Effective independently or as a member of the team and have excellent written and verbal communication skills. Able to handle a multitude of details and meet close deadlines under pressure. * Hardware System Design experience in Access Switches, Service Provider Edge Routers, & Data Center Compute/Storage products. \n \n* Understanding of entire development cycle - HW architecture, HW design specs, component selection, cost analysis, power estimation, hardware design & development, SI analysis, Bring up, HW/SW integration testing, system level debugging, test plans, and manufacturing release. \n \n* Experience with Optical Transceivers, Processors, High Speed Memory Technologies, Network Processors, Switch Fabrics, Ethernet Phys, Jitter-Attenuators, Power-Modules, Power-Sequencers, PCIe, Clock Distribution Tree, High Speed Serial Data Links. \n \n* Work with cross functional teams – CAD/Layout, Software, Mechanical, Compliance, NPI, ODVT, EDVT, MDVT, Devtest/QA, Marketing, Thermal, EMI, Safety, Parametric and Environmental testing teams.  \n* A self starter, highly ambitious and goal directed. Effective independently or as a member of the team and have excellent written and verbal communication skills. Able to handle a multitude of details and meet close deadlines under pressure. * Hardware System Design experience in Access Switches, Service Provider Edge Routers, & Data Center Compute/Storage products. \n \n* Understanding of entire development cycle - HW architecture, HW design specs, component selection, cost analysis, power estimation, hardware design & development, SI analysis, Bring up, HW/SW integration testing, system level debugging, test plans, and manufacturing release. \n \n* Experience with Optical Transceivers, Processors, High Speed Memory Technologies, Network Processors, Switch Fabrics, Ethernet Phys, Jitter-Attenuators, Power-Modules, Power-Sequencers, PCIe, Clock Distribution Tree, High Speed Serial Data Links. \n \n* Work with cross functional teams – CAD/Layout, Software, Mechanical, Compliance, NPI, ODVT, EDVT, MDVT, Devtest/QA, Marketing, Thermal, EMI, Safety, Parametric and Environmental testing teams.  \n* A self starter, highly ambitious and goal directed. Effective independently or as a member of the team and have excellent written and verbal communication skills. Able to handle a multitude of details and meet close deadlines under pressure. Experience Hardware Design Engineer Cisco Systems August 2013  – Present (2 years 1 month) San Jose, California Hardware Architecture, Design, Bring-up, Integrated System Testing & Manufacturing Release of Unified Computing System (UCS) - Compute/Storage products. \n \nDesign & Debug HW boards using embedded CPU, ASIC, Ethernet Switches, and Optical Transceivers. Used JTAG based CPU tool to program Boot Flash Memory. Used CPU tools to optimize DDR3 parameters. Worked with SW, ASIC, and Ethernet switch teams for system level debugging and optimization of high speed interfaces.  Hardware Design Engineer Cisco March 2008  –  August 2013  (5 years 6 months) San Jose, California Hardware Architecture, Design, Bring-up, Integrated System Testing, & Manufacturing Release of Linecards, Backplane for ASR 9000 Series Aggregation Services Routers. \n \n* Placed power modules and components on networking line cards for chassis based telecom 48V power distribution. This include OR-ing diodes, hot-swap controller, Intermediate voltage power bricks, Switching supplies, linear regulators, & power sequencers in cascaded configuration.  \nProgrammed Power sequencers to ramp up/down voltage rails as well as to set fault, alarm, and margin thresholds.  \n \n* Worked with FPGA engineers and FPGA vendors to select glue logic or data plane programmable devices, optimized pin-outs for routing/placement and provided JTAG chain enabled programming and debugging interfaces.  \n \n* Designed clock distribution for DDR, PCIe, FPGA, PHYs, ASICs, and place/program Jitter Attenuators to meet specific physical layer requirements.  \n \n* Placed Network Processors (with Packet, Search, Stats Memories & TCAM), Fabric Interconnect Devices, Ethernet Physical Layer Devices, Optical Transceivers and high speed multi-board interconnects (including signal assignments for data grouping and optimized routing) \n \n* Distributed PCIe Gen1 from root complex to endpoints (located on the same board and pluggable modules) using PCIe switches.  \n \n* Provided two wire interface to connect/monitor thermal sensors, power sequencer alarms, eeprom, etc.  \n \n* Performed serdes tuning (TX FIR and Receiver Equalization ) for high speed interfaces. \n \n* Placed Network Interface synchronizer on line cards to provide backplane reference clock timing to transmit interfaces and also recovered line rate clock to backplane. In addition to this, hitless reference switching and short term holdover for loss of reference inputs.  Senior Hardware Design Engineer Tellabs January 2004  –  March 2008  (4 years 3 months) Santa Clara, California * Performed interop testing of 3.125G SERDES by running PRBS patterns \n \n* Performed SI analysis on 20G chassis based Ethernet line card. This include design of Layer-Stackup, CAD rules, Component placement, Layout supervision, Pre and Post layout SI Simulations using Cadence Specctraquest, Power plane Impedance simulation using Sigrity speed2000, Setup/Hold Timing Analysis (DDR2-667, DDR2-400, QDR2, Power-PC CPU bus), PCIe 2.5G, XAUI Simulations using S-parameter and HSPICE.  \n \n* Performed ASIC package SI simulations. This include characterization of ASIC IO buffers using HSPICE over different transmission line models and temperature ranges, Cross-talk simulation, ASIC signal pins grouping, skew analysis.  \n \n* Lead the HW Design for chassis-based 40G Switch fabric card.  Senior Hardware Design Engineer Luminous Networks December 1998  –  January 2004  (5 years 2 months) Cupertino, California * Designed HW of Modular Edge Access Devices (mix of TDM and IP/Ethernet interfaces) which support Dual Ring Interfaces (Sonet RPR, 2.5Gbps Ethernet), Eight 10/100 Ports and two slots for pluggable modules (24-port T1, 21-port E1, GigE). Involved in all design phases from concept, design, system level debugging to manufacturing release.  \n \n* Designed HW of Fixed Configuration Edge Access Device which supports Dual 1Gbps RPR Ring Interface,16 10/100 Ports, 4 T1/E1 Ports. \n \n* Designed a 2.5G dual channel repeater card for lab testing. The card connects two chassis/rings at a line rate of 3.125Gbps.  \n \n* Designed HW for 8 port 10/100 chassis-based Ethernet line-card. The card is optimized for IP/Ethernet transport and provides full Layer 2/3 support for switching and routing. The 10/100 Card supports both copper and Fiber interfaces. Design Engineer Semi Custom Logic (SLI) March 1997  –  December 1998  (1 year 10 months) Responsibilities included: Firmware Design, Behavioral Modeling in Verilog  \n \n* Calculation of ArcTangent Using CORDIC Algorithm for Satellite Encoder. Performed Behavioral Modeling of CORDIC algorithm in ‘C’. RTL Logic Design/Simulation /Synthesis & Verification in Verilog. \n \n* Firmware for Voice Scrambler Card for Secure Telephony. (Embedded System Product). Wrote complete software for this card. Software routines written in 8051 assembly interacts with DTMF chip, Real time Encryption and decryption of voice packets, Modem module , Serial port, and voice compression chip. Used Proview simulator for initial software coding, Philips Ceibo ICE, HP1662A logic analyzer for debugging and testing \n \n* RTL coding in Verilog HDL / Synthesis of Encryption Algorithm. \n \n* Behavioral Coding/Simulation of Message Digest Algorithm (MD5) in Verilog \n Hardware Design Engineer Cisco Systems August 2013  – Present (2 years 1 month) San Jose, California Hardware Architecture, Design, Bring-up, Integrated System Testing & Manufacturing Release of Unified Computing System (UCS) - Compute/Storage products. \n \nDesign & Debug HW boards using embedded CPU, ASIC, Ethernet Switches, and Optical Transceivers. Used JTAG based CPU tool to program Boot Flash Memory. Used CPU tools to optimize DDR3 parameters. Worked with SW, ASIC, and Ethernet switch teams for system level debugging and optimization of high speed interfaces.  Hardware Design Engineer Cisco Systems August 2013  – Present (2 years 1 month) San Jose, California Hardware Architecture, Design, Bring-up, Integrated System Testing & Manufacturing Release of Unified Computing System (UCS) - Compute/Storage products. \n \nDesign & Debug HW boards using embedded CPU, ASIC, Ethernet Switches, and Optical Transceivers. Used JTAG based CPU tool to program Boot Flash Memory. Used CPU tools to optimize DDR3 parameters. Worked with SW, ASIC, and Ethernet switch teams for system level debugging and optimization of high speed interfaces.  Hardware Design Engineer Cisco March 2008  –  August 2013  (5 years 6 months) San Jose, California Hardware Architecture, Design, Bring-up, Integrated System Testing, & Manufacturing Release of Linecards, Backplane for ASR 9000 Series Aggregation Services Routers. \n \n* Placed power modules and components on networking line cards for chassis based telecom 48V power distribution. This include OR-ing diodes, hot-swap controller, Intermediate voltage power bricks, Switching supplies, linear regulators, & power sequencers in cascaded configuration.  \nProgrammed Power sequencers to ramp up/down voltage rails as well as to set fault, alarm, and margin thresholds.  \n \n* Worked with FPGA engineers and FPGA vendors to select glue logic or data plane programmable devices, optimized pin-outs for routing/placement and provided JTAG chain enabled programming and debugging interfaces.  \n \n* Designed clock distribution for DDR, PCIe, FPGA, PHYs, ASICs, and place/program Jitter Attenuators to meet specific physical layer requirements.  \n \n* Placed Network Processors (with Packet, Search, Stats Memories & TCAM), Fabric Interconnect Devices, Ethernet Physical Layer Devices, Optical Transceivers and high speed multi-board interconnects (including signal assignments for data grouping and optimized routing) \n \n* Distributed PCIe Gen1 from root complex to endpoints (located on the same board and pluggable modules) using PCIe switches.  \n \n* Provided two wire interface to connect/monitor thermal sensors, power sequencer alarms, eeprom, etc.  \n \n* Performed serdes tuning (TX FIR and Receiver Equalization ) for high speed interfaces. \n \n* Placed Network Interface synchronizer on line cards to provide backplane reference clock timing to transmit interfaces and also recovered line rate clock to backplane. In addition to this, hitless reference switching and short term holdover for loss of reference inputs.  Hardware Design Engineer Cisco March 2008  –  August 2013  (5 years 6 months) San Jose, California Hardware Architecture, Design, Bring-up, Integrated System Testing, & Manufacturing Release of Linecards, Backplane for ASR 9000 Series Aggregation Services Routers. \n \n* Placed power modules and components on networking line cards for chassis based telecom 48V power distribution. This include OR-ing diodes, hot-swap controller, Intermediate voltage power bricks, Switching supplies, linear regulators, & power sequencers in cascaded configuration.  \nProgrammed Power sequencers to ramp up/down voltage rails as well as to set fault, alarm, and margin thresholds.  \n \n* Worked with FPGA engineers and FPGA vendors to select glue logic or data plane programmable devices, optimized pin-outs for routing/placement and provided JTAG chain enabled programming and debugging interfaces.  \n \n* Designed clock distribution for DDR, PCIe, FPGA, PHYs, ASICs, and place/program Jitter Attenuators to meet specific physical layer requirements.  \n \n* Placed Network Processors (with Packet, Search, Stats Memories & TCAM), Fabric Interconnect Devices, Ethernet Physical Layer Devices, Optical Transceivers and high speed multi-board interconnects (including signal assignments for data grouping and optimized routing) \n \n* Distributed PCIe Gen1 from root complex to endpoints (located on the same board and pluggable modules) using PCIe switches.  \n \n* Provided two wire interface to connect/monitor thermal sensors, power sequencer alarms, eeprom, etc.  \n \n* Performed serdes tuning (TX FIR and Receiver Equalization ) for high speed interfaces. \n \n* Placed Network Interface synchronizer on line cards to provide backplane reference clock timing to transmit interfaces and also recovered line rate clock to backplane. In addition to this, hitless reference switching and short term holdover for loss of reference inputs.  Senior Hardware Design Engineer Tellabs January 2004  –  March 2008  (4 years 3 months) Santa Clara, California * Performed interop testing of 3.125G SERDES by running PRBS patterns \n \n* Performed SI analysis on 20G chassis based Ethernet line card. This include design of Layer-Stackup, CAD rules, Component placement, Layout supervision, Pre and Post layout SI Simulations using Cadence Specctraquest, Power plane Impedance simulation using Sigrity speed2000, Setup/Hold Timing Analysis (DDR2-667, DDR2-400, QDR2, Power-PC CPU bus), PCIe 2.5G, XAUI Simulations using S-parameter and HSPICE.  \n \n* Performed ASIC package SI simulations. This include characterization of ASIC IO buffers using HSPICE over different transmission line models and temperature ranges, Cross-talk simulation, ASIC signal pins grouping, skew analysis.  \n \n* Lead the HW Design for chassis-based 40G Switch fabric card.  Senior Hardware Design Engineer Tellabs January 2004  –  March 2008  (4 years 3 months) Santa Clara, California * Performed interop testing of 3.125G SERDES by running PRBS patterns \n \n* Performed SI analysis on 20G chassis based Ethernet line card. This include design of Layer-Stackup, CAD rules, Component placement, Layout supervision, Pre and Post layout SI Simulations using Cadence Specctraquest, Power plane Impedance simulation using Sigrity speed2000, Setup/Hold Timing Analysis (DDR2-667, DDR2-400, QDR2, Power-PC CPU bus), PCIe 2.5G, XAUI Simulations using S-parameter and HSPICE.  \n \n* Performed ASIC package SI simulations. This include characterization of ASIC IO buffers using HSPICE over different transmission line models and temperature ranges, Cross-talk simulation, ASIC signal pins grouping, skew analysis.  \n \n* Lead the HW Design for chassis-based 40G Switch fabric card.  Senior Hardware Design Engineer Luminous Networks December 1998  –  January 2004  (5 years 2 months) Cupertino, California * Designed HW of Modular Edge Access Devices (mix of TDM and IP/Ethernet interfaces) which support Dual Ring Interfaces (Sonet RPR, 2.5Gbps Ethernet), Eight 10/100 Ports and two slots for pluggable modules (24-port T1, 21-port E1, GigE). Involved in all design phases from concept, design, system level debugging to manufacturing release.  \n \n* Designed HW of Fixed Configuration Edge Access Device which supports Dual 1Gbps RPR Ring Interface,16 10/100 Ports, 4 T1/E1 Ports. \n \n* Designed a 2.5G dual channel repeater card for lab testing. The card connects two chassis/rings at a line rate of 3.125Gbps.  \n \n* Designed HW for 8 port 10/100 chassis-based Ethernet line-card. The card is optimized for IP/Ethernet transport and provides full Layer 2/3 support for switching and routing. The 10/100 Card supports both copper and Fiber interfaces. Senior Hardware Design Engineer Luminous Networks December 1998  –  January 2004  (5 years 2 months) Cupertino, California * Designed HW of Modular Edge Access Devices (mix of TDM and IP/Ethernet interfaces) which support Dual Ring Interfaces (Sonet RPR, 2.5Gbps Ethernet), Eight 10/100 Ports and two slots for pluggable modules (24-port T1, 21-port E1, GigE). Involved in all design phases from concept, design, system level debugging to manufacturing release.  \n \n* Designed HW of Fixed Configuration Edge Access Device which supports Dual 1Gbps RPR Ring Interface,16 10/100 Ports, 4 T1/E1 Ports. \n \n* Designed a 2.5G dual channel repeater card for lab testing. The card connects two chassis/rings at a line rate of 3.125Gbps.  \n \n* Designed HW for 8 port 10/100 chassis-based Ethernet line-card. The card is optimized for IP/Ethernet transport and provides full Layer 2/3 support for switching and routing. The 10/100 Card supports both copper and Fiber interfaces. Design Engineer Semi Custom Logic (SLI) March 1997  –  December 1998  (1 year 10 months) Responsibilities included: Firmware Design, Behavioral Modeling in Verilog  \n \n* Calculation of ArcTangent Using CORDIC Algorithm for Satellite Encoder. Performed Behavioral Modeling of CORDIC algorithm in ‘C’. RTL Logic Design/Simulation /Synthesis & Verification in Verilog. \n \n* Firmware for Voice Scrambler Card for Secure Telephony. (Embedded System Product). Wrote complete software for this card. Software routines written in 8051 assembly interacts with DTMF chip, Real time Encryption and decryption of voice packets, Modem module , Serial port, and voice compression chip. Used Proview simulator for initial software coding, Philips Ceibo ICE, HP1662A logic analyzer for debugging and testing \n \n* RTL coding in Verilog HDL / Synthesis of Encryption Algorithm. \n \n* Behavioral Coding/Simulation of Message Digest Algorithm (MD5) in Verilog \n Design Engineer Semi Custom Logic (SLI) March 1997  –  December 1998  (1 year 10 months) Responsibilities included: Firmware Design, Behavioral Modeling in Verilog  \n \n* Calculation of ArcTangent Using CORDIC Algorithm for Satellite Encoder. Performed Behavioral Modeling of CORDIC algorithm in ‘C’. RTL Logic Design/Simulation /Synthesis & Verification in Verilog. \n \n* Firmware for Voice Scrambler Card for Secure Telephony. (Embedded System Product). Wrote complete software for this card. Software routines written in 8051 assembly interacts with DTMF chip, Real time Encryption and decryption of voice packets, Modem module , Serial port, and voice compression chip. Used Proview simulator for initial software coding, Philips Ceibo ICE, HP1662A logic analyzer for debugging and testing \n \n* RTL coding in Verilog HDL / Synthesis of Encryption Algorithm. \n \n* Behavioral Coding/Simulation of Message Digest Algorithm (MD5) in Verilog \n Skills Hardware Architecture Product Development Hardware Signal Integrity Logic Design Systems Design Skills  Hardware Architecture Product Development Hardware Signal Integrity Logic Design Systems Design Hardware Architecture Product Development Hardware Signal Integrity Logic Design Systems Design Hardware Architecture Product Development Hardware Signal Integrity Logic Design Systems Design Education Santa Clara University Master’s Degree,  Electrical Engineering 2011 (Major Communication Systems) \nCommunication Systems I & II, Digital Communications, Discrete & Continuous Probability, Electromagnetics I, Signal Integrity, Information Theory, Wireless Communication Systems, Microwave Systems, DSP I, Linear Algebra I &II, Logic Design using HDL, Modern Network Analysis I, Analog Integrated Circuits I, Stochastic Processes I, Linear Control Systems I, Applied Math I, Error Correction Coding, New Product Development –Strategic Planning and Marketing. Santa Clara University Master’s Degree,  Electrical Engineering 2011 (Major Communication Systems) \nCommunication Systems I & II, Digital Communications, Discrete & Continuous Probability, Electromagnetics I, Signal Integrity, Information Theory, Wireless Communication Systems, Microwave Systems, DSP I, Linear Algebra I &II, Logic Design using HDL, Modern Network Analysis I, Analog Integrated Circuits I, Stochastic Processes I, Linear Control Systems I, Applied Math I, Error Correction Coding, New Product Development –Strategic Planning and Marketing. Santa Clara University Master’s Degree,  Electrical Engineering 2011 (Major Communication Systems) \nCommunication Systems I & II, Digital Communications, Discrete & Continuous Probability, Electromagnetics I, Signal Integrity, Information Theory, Wireless Communication Systems, Microwave Systems, DSP I, Linear Algebra I &II, Logic Design using HDL, Modern Network Analysis I, Analog Integrated Circuits I, Stochastic Processes I, Linear Control Systems I, Applied Math I, Error Correction Coding, New Product Development –Strategic Planning and Marketing. Santa Clara University Master’s Degree,  Electrical Engineering 2011 (Major Communication Systems) \nCommunication Systems I & II, Digital Communications, Discrete & Continuous Probability, Electromagnetics I, Signal Integrity, Information Theory, Wireless Communication Systems, Microwave Systems, DSP I, Linear Algebra I &II, Logic Design using HDL, Modern Network Analysis I, Analog Integrated Circuits I, Stochastic Processes I, Linear Control Systems I, Applied Math I, Error Correction Coding, New Product Development –Strategic Planning and Marketing. ", "Summary - DWDM Optical Networks Design Eng. \n- In charge of Design & Development of DWDM equipment \n- HW/SW Integration Engineer Summary - DWDM Optical Networks Design Eng. \n- In charge of Design & Development of DWDM equipment \n- HW/SW Integration Engineer - DWDM Optical Networks Design Eng. \n- In charge of Design & Development of DWDM equipment \n- HW/SW Integration Engineer - DWDM Optical Networks Design Eng. \n- In charge of Design & Development of DWDM equipment \n- HW/SW Integration Engineer Experience Project Leader - Design Engineer Cisco 2003  – Present (12 years) In charge of Design & Development of DWDM networks and equipment for Long Haul / Regional and Metro applications. R&D Optical Design Engineer Cisco February 2000  –  2002  (2 years) Researcher Pirelli Optical Systems February 1999  –  February 2000  (1 year 1 month) Design of Chirped Fiber Bragg Gratings for chromatic dispersion compensation in DWDM networks Project Leader - Design Engineer Cisco 2003  – Present (12 years) In charge of Design & Development of DWDM networks and equipment for Long Haul / Regional and Metro applications. Project Leader - Design Engineer Cisco 2003  – Present (12 years) In charge of Design & Development of DWDM networks and equipment for Long Haul / Regional and Metro applications. R&D Optical Design Engineer Cisco February 2000  –  2002  (2 years) R&D Optical Design Engineer Cisco February 2000  –  2002  (2 years) Researcher Pirelli Optical Systems February 1999  –  February 2000  (1 year 1 month) Design of Chirped Fiber Bragg Gratings for chromatic dispersion compensation in DWDM networks Researcher Pirelli Optical Systems February 1999  –  February 2000  (1 year 1 month) Design of Chirped Fiber Bragg Gratings for chromatic dispersion compensation in DWDM networks Education Politecnico di Milano Electronic Engineering - OptoElectronics 1994  – 1999 Politecnico di Milano Electronic Engineering - OptoElectronics 1994  – 1999 Politecnico di Milano Electronic Engineering - OptoElectronics 1994  – 1999 Politecnico di Milano Electronic Engineering - OptoElectronics 1994  – 1999 ", "Experience Logic Design Engineer Scalable Systems Research Labs, Inc. September 2011  – Present (4 years) Palo Alto, CA Prepare and execute the logic design of GP HPC Processor; verify correctness of the design. Conduct processor design review of the Processor logic design for 28nm standard processes. Document the Processor design and all design changes. ASIC/SoC Performance FPGA Design Richard Arase Design (self) January 2001  – Present (14 years 8 months) Job Title: ASIC/SoC Performance FPGA Design ASIC CMOS Circuit Design Consultant Richard Arase Design (self) January 2000  – Present (15 years 8 months) Design report: process technology substrate doping levels and triple wells, grounding effects, guard rings, shielding, decoupling, and package inductance to optimize isolation at GHz frequencies. The interdependent nature of these techniques and their application determines whether the silicon design meets specifications. IR drop and EM problems cannot be solved separately; they must both be considered during design. \n \nCustomer Service to support entrepreneurs.  \nHigh frequency (>300MHz) RLC parasitics, models, tools for signal integrity, silicon accuracy. \nMarketing seminars presented to prospective customers for new business development. Logic Design Engineer Scalable Systems Research Labs, Inc. September 2011  – Present (4 years) Palo Alto, CA Prepare and execute the logic design of GP HPC Processor; verify correctness of the design. Conduct processor design review of the Processor logic design for 28nm standard processes. Document the Processor design and all design changes. Logic Design Engineer Scalable Systems Research Labs, Inc. September 2011  – Present (4 years) Palo Alto, CA Prepare and execute the logic design of GP HPC Processor; verify correctness of the design. Conduct processor design review of the Processor logic design for 28nm standard processes. Document the Processor design and all design changes. ASIC/SoC Performance FPGA Design Richard Arase Design (self) January 2001  – Present (14 years 8 months) Job Title: ASIC/SoC Performance FPGA Design ASIC/SoC Performance FPGA Design Richard Arase Design (self) January 2001  – Present (14 years 8 months) Job Title: ASIC/SoC Performance FPGA Design ASIC CMOS Circuit Design Consultant Richard Arase Design (self) January 2000  – Present (15 years 8 months) Design report: process technology substrate doping levels and triple wells, grounding effects, guard rings, shielding, decoupling, and package inductance to optimize isolation at GHz frequencies. The interdependent nature of these techniques and their application determines whether the silicon design meets specifications. IR drop and EM problems cannot be solved separately; they must both be considered during design. \n \nCustomer Service to support entrepreneurs.  \nHigh frequency (>300MHz) RLC parasitics, models, tools for signal integrity, silicon accuracy. \nMarketing seminars presented to prospective customers for new business development. ASIC CMOS Circuit Design Consultant Richard Arase Design (self) January 2000  – Present (15 years 8 months) Design report: process technology substrate doping levels and triple wells, grounding effects, guard rings, shielding, decoupling, and package inductance to optimize isolation at GHz frequencies. The interdependent nature of these techniques and their application determines whether the silicon design meets specifications. IR drop and EM problems cannot be solved separately; they must both be considered during design. \n \nCustomer Service to support entrepreneurs.  \nHigh frequency (>300MHz) RLC parasitics, models, tools for signal integrity, silicon accuracy. \nMarketing seminars presented to prospective customers for new business development. Skills SoC FPGA ASIC TCL Verilog Static Timing Analysis VLSI EDA Timing Closure Physical Design Logic Synthesis Integrated Circuit... Functional Verification Low-power Design Primetime IC Microprocessors Logic Design Processors Semiconductors VHDL CMOS Embedded Systems Perl See 9+     See less Skills  SoC FPGA ASIC TCL Verilog Static Timing Analysis VLSI EDA Timing Closure Physical Design Logic Synthesis Integrated Circuit... Functional Verification Low-power Design Primetime IC Microprocessors Logic Design Processors Semiconductors VHDL CMOS Embedded Systems Perl See 9+     See less SoC FPGA ASIC TCL Verilog Static Timing Analysis VLSI EDA Timing Closure Physical Design Logic Synthesis Integrated Circuit... Functional Verification Low-power Design Primetime IC Microprocessors Logic Design Processors Semiconductors VHDL CMOS Embedded Systems Perl See 9+     See less SoC FPGA ASIC TCL Verilog Static Timing Analysis VLSI EDA Timing Closure Physical Design Logic Synthesis Integrated Circuit... Functional Verification Low-power Design Primetime IC Microprocessors Logic Design Processors Semiconductors VHDL CMOS Embedded Systems Perl See 9+     See less Education City University of New York City College Bachelor of Engineering (1973) 1966  – 1973 University of California, Santa Cruz City University of New York City College Bachelor of Engineering (1973) 1966  – 1973 City University of New York City College Bachelor of Engineering (1973) 1966  – 1973 City University of New York City College Bachelor of Engineering (1973) 1966  – 1973 University of California, Santa Cruz University of California, Santa Cruz University of California, Santa Cruz Honors & Awards Additional Honors & Awards NY State Regents Scholarship, 1966 Additional Honors & Awards NY State Regents Scholarship, 1966 Additional Honors & Awards NY State Regents Scholarship, 1966 Additional Honors & Awards NY State Regents Scholarship, 1966 ", "Summary 4 years in EDA R&D background and 10+ years of hands-on experience and tracking records to tape out successful SoC chips in volume production. Extensively understand the design flow from RTL to GDS, timing closure and deep-submicron issues. Summary 4 years in EDA R&D background and 10+ years of hands-on experience and tracking records to tape out successful SoC chips in volume production. Extensively understand the design flow from RTL to GDS, timing closure and deep-submicron issues. 4 years in EDA R&D background and 10+ years of hands-on experience and tracking records to tape out successful SoC chips in volume production. Extensively understand the design flow from RTL to GDS, timing closure and deep-submicron issues. 4 years in EDA R&D background and 10+ years of hands-on experience and tracking records to tape out successful SoC chips in volume production. Extensively understand the design flow from RTL to GDS, timing closure and deep-submicron issues. Experience Hardware Physical Design Engineer, Core Routing Silicon Cisco August 2010  – Present (5 years 1 month) •\tTaped out multiple network processor chips: projects range from 56 to 136 partitions, thousands of memories, 40nm to 22nm. \n•\tCAD tools flow responsibilities: Synopsys ICC P&R flow, physical verification flow for ICV DRC, LVS, density, and ERC. Enhanced the flow for new features and better quality of results. Maintained the flow with 8k lines of scripts. Documented, supported and debug user issues. \n•\tResponsible for partition-level implementation using Synopsys DCG physical synthesis, ICC floorplanning, P&R, CTS, extraction, PT timing closure, ICV physical verification. \n•\tResponsible for chip-level implementation using Cadence Encounter: power grid distribution, channel based repeaters place and route, timing closure, physical verification. \n•\tSetup design environment infrastructure: library installation, multiple sites mirroring, cross-views checks, QA, disk usage monitoring. Hardware ASIC Physical Design Engineer, Gigabits Switching Cisco Systems September 2002  –  August 2010  (8 years) •\tImplementation: physical synthesis, define timing constraints and analysis, partition/floorplan, PT-PX power calculation, logic equalvent check, clock-domain-crossing check, and post-layout signoff timing. \n•\tsynthesis flow: highly integrated and automated top-down or bottom-up flow. \n•\tFPGA implementation using Synplify synthesis, Xilinx tools. SMTS Procket Networks (start-up) acquired by Cisco August 2000  –  September 2002  (2 years 2 months) SMTS ArtX, Inc.(start-up) acquired by ATI Research August 1999  –  October 2000  (1 year 3 months) Physical Design Manager Divio, Inc. (start-up) acquired by ESS Technology 1997  –  1999  (2 years) Established physical design flow for this start-up company by working independently from netlist to GDS tapeout. Physical Design Manager S3 June 1994  –  August 1997  (3 years 3 months) SMTS Cadence Design Systems, IC R&D March 1990  –  June 1994  (4 years 4 months) Hardware Physical Design Engineer, Core Routing Silicon Cisco August 2010  – Present (5 years 1 month) •\tTaped out multiple network processor chips: projects range from 56 to 136 partitions, thousands of memories, 40nm to 22nm. \n•\tCAD tools flow responsibilities: Synopsys ICC P&R flow, physical verification flow for ICV DRC, LVS, density, and ERC. Enhanced the flow for new features and better quality of results. Maintained the flow with 8k lines of scripts. Documented, supported and debug user issues. \n•\tResponsible for partition-level implementation using Synopsys DCG physical synthesis, ICC floorplanning, P&R, CTS, extraction, PT timing closure, ICV physical verification. \n•\tResponsible for chip-level implementation using Cadence Encounter: power grid distribution, channel based repeaters place and route, timing closure, physical verification. \n•\tSetup design environment infrastructure: library installation, multiple sites mirroring, cross-views checks, QA, disk usage monitoring. Hardware Physical Design Engineer, Core Routing Silicon Cisco August 2010  – Present (5 years 1 month) •\tTaped out multiple network processor chips: projects range from 56 to 136 partitions, thousands of memories, 40nm to 22nm. \n•\tCAD tools flow responsibilities: Synopsys ICC P&R flow, physical verification flow for ICV DRC, LVS, density, and ERC. Enhanced the flow for new features and better quality of results. Maintained the flow with 8k lines of scripts. Documented, supported and debug user issues. \n•\tResponsible for partition-level implementation using Synopsys DCG physical synthesis, ICC floorplanning, P&R, CTS, extraction, PT timing closure, ICV physical verification. \n•\tResponsible for chip-level implementation using Cadence Encounter: power grid distribution, channel based repeaters place and route, timing closure, physical verification. \n•\tSetup design environment infrastructure: library installation, multiple sites mirroring, cross-views checks, QA, disk usage monitoring. Hardware ASIC Physical Design Engineer, Gigabits Switching Cisco Systems September 2002  –  August 2010  (8 years) •\tImplementation: physical synthesis, define timing constraints and analysis, partition/floorplan, PT-PX power calculation, logic equalvent check, clock-domain-crossing check, and post-layout signoff timing. \n•\tsynthesis flow: highly integrated and automated top-down or bottom-up flow. \n•\tFPGA implementation using Synplify synthesis, Xilinx tools. Hardware ASIC Physical Design Engineer, Gigabits Switching Cisco Systems September 2002  –  August 2010  (8 years) •\tImplementation: physical synthesis, define timing constraints and analysis, partition/floorplan, PT-PX power calculation, logic equalvent check, clock-domain-crossing check, and post-layout signoff timing. \n•\tsynthesis flow: highly integrated and automated top-down or bottom-up flow. \n•\tFPGA implementation using Synplify synthesis, Xilinx tools. SMTS Procket Networks (start-up) acquired by Cisco August 2000  –  September 2002  (2 years 2 months) SMTS Procket Networks (start-up) acquired by Cisco August 2000  –  September 2002  (2 years 2 months) SMTS ArtX, Inc.(start-up) acquired by ATI Research August 1999  –  October 2000  (1 year 3 months) SMTS ArtX, Inc.(start-up) acquired by ATI Research August 1999  –  October 2000  (1 year 3 months) Physical Design Manager Divio, Inc. (start-up) acquired by ESS Technology 1997  –  1999  (2 years) Established physical design flow for this start-up company by working independently from netlist to GDS tapeout. Physical Design Manager Divio, Inc. (start-up) acquired by ESS Technology 1997  –  1999  (2 years) Established physical design flow for this start-up company by working independently from netlist to GDS tapeout. Physical Design Manager S3 June 1994  –  August 1997  (3 years 3 months) Physical Design Manager S3 June 1994  –  August 1997  (3 years 3 months) SMTS Cadence Design Systems, IC R&D March 1990  –  June 1994  (4 years 4 months) SMTS Cadence Design Systems, IC R&D March 1990  –  June 1994  (4 years 4 months) Languages   Skills ASIC Physical Design Verilog Static Timing Analysis SoC TCL Perl Script Shell Scripting FPGA IC Skills  ASIC Physical Design Verilog Static Timing Analysis SoC TCL Perl Script Shell Scripting FPGA IC ASIC Physical Design Verilog Static Timing Analysis SoC TCL Perl Script Shell Scripting FPGA IC ASIC Physical Design Verilog Static Timing Analysis SoC TCL Perl Script Shell Scripting FPGA IC Education Stony Brook University MSEE,  Electrical Engineering 1988  – 1990 Chung Yuan Christian University BS,  Physics 1984  – 1987 Stony Brook University MSEE,  Electrical Engineering 1988  – 1990 Stony Brook University MSEE,  Electrical Engineering 1988  – 1990 Stony Brook University MSEE,  Electrical Engineering 1988  – 1990 Chung Yuan Christian University BS,  Physics 1984  – 1987 Chung Yuan Christian University BS,  Physics 1984  – 1987 Chung Yuan Christian University BS,  Physics 1984  – 1987 Honors & Awards "]}