{"position": "Documentation Manager", "company": "Google", "profiles": ["Skills Technical Writing Online Help FrameMaker Oxygen XML Editor DITA Technical Documentation Software Documentation Manuals Release Notes Technical Communication Proofreading Wikis HTML Business Intelligence Enterprise Software WebWorks Agile Methodologies Product Management Editing Cisco Technologies Databases Cloud Computing Structured Authoring Usability SnagIt SaaS Content Management Content Development Perforce Usability Testing Scrum Confluence Training Guides Adobe Acrobat Information Design Information Architecture Security User Experience Software Development White Papers See 26+     See less Skills  Technical Writing Online Help FrameMaker Oxygen XML Editor DITA Technical Documentation Software Documentation Manuals Release Notes Technical Communication Proofreading Wikis HTML Business Intelligence Enterprise Software WebWorks Agile Methodologies Product Management Editing Cisco Technologies Databases Cloud Computing Structured Authoring Usability SnagIt SaaS Content Management Content Development Perforce Usability Testing Scrum Confluence Training Guides Adobe Acrobat Information Design Information Architecture Security User Experience Software Development White Papers See 26+     See less Technical Writing Online Help FrameMaker Oxygen XML Editor DITA Technical Documentation Software Documentation Manuals Release Notes Technical Communication Proofreading Wikis HTML Business Intelligence Enterprise Software WebWorks Agile Methodologies Product Management Editing Cisco Technologies Databases Cloud Computing Structured Authoring Usability SnagIt SaaS Content Management Content Development Perforce Usability Testing Scrum Confluence Training Guides Adobe Acrobat Information Design Information Architecture Security User Experience Software Development White Papers See 26+     See less Technical Writing Online Help FrameMaker Oxygen XML Editor DITA Technical Documentation Software Documentation Manuals Release Notes Technical Communication Proofreading Wikis HTML Business Intelligence Enterprise Software WebWorks Agile Methodologies Product Management Editing Cisco Technologies Databases Cloud Computing Structured Authoring Usability SnagIt SaaS Content Management Content Development Perforce Usability Testing Scrum Confluence Training Guides Adobe Acrobat Information Design Information Architecture Security User Experience Software Development White Papers See 26+     See less ", "Skills Knowledge Management FrameMaker Business Process Information Architecture DITA XML Software Documentation RoboHelp Usability Testing Software Quality... Technical Communication Online Help Content Development Arbortext DITA Manuals Technical Documentation Technical Writing SnagIt XMetal Structured Authoring Release Notes Single Sourcing See 7+     See less Skills  Knowledge Management FrameMaker Business Process Information Architecture DITA XML Software Documentation RoboHelp Usability Testing Software Quality... Technical Communication Online Help Content Development Arbortext DITA Manuals Technical Documentation Technical Writing SnagIt XMetal Structured Authoring Release Notes Single Sourcing See 7+     See less Knowledge Management FrameMaker Business Process Information Architecture DITA XML Software Documentation RoboHelp Usability Testing Software Quality... Technical Communication Online Help Content Development Arbortext DITA Manuals Technical Documentation Technical Writing SnagIt XMetal Structured Authoring Release Notes Single Sourcing See 7+     See less Knowledge Management FrameMaker Business Process Information Architecture DITA XML Software Documentation RoboHelp Usability Testing Software Quality... Technical Communication Online Help Content Development Arbortext DITA Manuals Technical Documentation Technical Writing SnagIt XMetal Structured Authoring Release Notes Single Sourcing See 7+     See less ", "Languages Kannada, Hindi Kannada, Hindi Kannada, Hindi Skills Technical Documentation FrameMaker Technical Writing Software Documentation Online Help RoboHelp XML WebWorks Manuals Editing Feature Articles DITA Information Architecture Service Provider... Network Management... Enterprise Software Agile Methodologies Information Architect Reportage Textile Design Feature Writing Consumer Rights... ISO Internal Auditor Content Management Technical Communication Program Management Single Sourcing Strategy See 13+     See less Skills  Technical Documentation FrameMaker Technical Writing Software Documentation Online Help RoboHelp XML WebWorks Manuals Editing Feature Articles DITA Information Architecture Service Provider... Network Management... Enterprise Software Agile Methodologies Information Architect Reportage Textile Design Feature Writing Consumer Rights... ISO Internal Auditor Content Management Technical Communication Program Management Single Sourcing Strategy See 13+     See less Technical Documentation FrameMaker Technical Writing Software Documentation Online Help RoboHelp XML WebWorks Manuals Editing Feature Articles DITA Information Architecture Service Provider... Network Management... Enterprise Software Agile Methodologies Information Architect Reportage Textile Design Feature Writing Consumer Rights... ISO Internal Auditor Content Management Technical Communication Program Management Single Sourcing Strategy See 13+     See less Technical Documentation FrameMaker Technical Writing Software Documentation Online Help RoboHelp XML WebWorks Manuals Editing Feature Articles DITA Information Architecture Service Provider... Network Management... Enterprise Software Agile Methodologies Information Architect Reportage Textile Design Feature Writing Consumer Rights... ISO Internal Auditor Content Management Technical Communication Program Management Single Sourcing Strategy See 13+     See less ", "Experience Lead Technical Writer RedSeal Inc. October 2014  – Present (11 months) Redesigning the entire documentation suite to focus on real-world user tasks and procedures. \nExploring knowledge base solutions to provide faster and easier access to documentation. \n Senior Technical Writer VMware July 2013  –  October 2014  (1 year 4 months) Palo Alto Introduced process improvements suited to an agile development environment, including revamping resolved issues documentation, changing the document release cycle, and adding tools to track and manage coverage of new features. \nGained knowledge of network virtualization concepts working on VMware NSX for Multi-Hypervisor documentation.  \nCollaborated with Support team managers and leads on training materials and support documentation. \n Principal Information Developer Symantec Corporation 2010  –  2013  (3 years) Lead the information development team to complete software releases, including attending all product meetings, planning, scheduling, assigning tasks, reviewing content, and localization management. Met all deadlines. Worked with a cross-functional team of engineers, QA, program managers, and product managers. \n \nExtensive experience leading remote teams. Provided technical leadership, editorial guidance, and mentoring for a team of four writers in both India and the United States. Lead Technical Writer PGP Corporation November 2004  –  June 2010  (5 years 8 months) Developed expertise in security and cryptography and gained deep product knowledge working on the PGP Universal Server/Symantec Encryption Management Server, an enterprise-level key management system. Product includes messaging security policy management, multi-data center clustering, and a complex key management life cycle. Senior Technical Writer Cisco Systems November 2000  –  September 2004  (3 years 11 months) Lead documentation team in creating single-sourced online help and user guides, as well as installation guides, quick start guides, release notes, supported devices tables, and white papers for Cisco Systems products. Lead Technical Writer RedSeal Inc. October 2014  – Present (11 months) Redesigning the entire documentation suite to focus on real-world user tasks and procedures. \nExploring knowledge base solutions to provide faster and easier access to documentation. \n Lead Technical Writer RedSeal Inc. October 2014  – Present (11 months) Redesigning the entire documentation suite to focus on real-world user tasks and procedures. \nExploring knowledge base solutions to provide faster and easier access to documentation. \n Senior Technical Writer VMware July 2013  –  October 2014  (1 year 4 months) Palo Alto Introduced process improvements suited to an agile development environment, including revamping resolved issues documentation, changing the document release cycle, and adding tools to track and manage coverage of new features. \nGained knowledge of network virtualization concepts working on VMware NSX for Multi-Hypervisor documentation.  \nCollaborated with Support team managers and leads on training materials and support documentation. \n Senior Technical Writer VMware July 2013  –  October 2014  (1 year 4 months) Palo Alto Introduced process improvements suited to an agile development environment, including revamping resolved issues documentation, changing the document release cycle, and adding tools to track and manage coverage of new features. \nGained knowledge of network virtualization concepts working on VMware NSX for Multi-Hypervisor documentation.  \nCollaborated with Support team managers and leads on training materials and support documentation. \n Principal Information Developer Symantec Corporation 2010  –  2013  (3 years) Lead the information development team to complete software releases, including attending all product meetings, planning, scheduling, assigning tasks, reviewing content, and localization management. Met all deadlines. Worked with a cross-functional team of engineers, QA, program managers, and product managers. \n \nExtensive experience leading remote teams. Provided technical leadership, editorial guidance, and mentoring for a team of four writers in both India and the United States. Principal Information Developer Symantec Corporation 2010  –  2013  (3 years) Lead the information development team to complete software releases, including attending all product meetings, planning, scheduling, assigning tasks, reviewing content, and localization management. Met all deadlines. Worked with a cross-functional team of engineers, QA, program managers, and product managers. \n \nExtensive experience leading remote teams. Provided technical leadership, editorial guidance, and mentoring for a team of four writers in both India and the United States. Lead Technical Writer PGP Corporation November 2004  –  June 2010  (5 years 8 months) Developed expertise in security and cryptography and gained deep product knowledge working on the PGP Universal Server/Symantec Encryption Management Server, an enterprise-level key management system. Product includes messaging security policy management, multi-data center clustering, and a complex key management life cycle. Lead Technical Writer PGP Corporation November 2004  –  June 2010  (5 years 8 months) Developed expertise in security and cryptography and gained deep product knowledge working on the PGP Universal Server/Symantec Encryption Management Server, an enterprise-level key management system. Product includes messaging security policy management, multi-data center clustering, and a complex key management life cycle. Senior Technical Writer Cisco Systems November 2000  –  September 2004  (3 years 11 months) Lead documentation team in creating single-sourced online help and user guides, as well as installation guides, quick start guides, release notes, supported devices tables, and white papers for Cisco Systems products. Senior Technical Writer Cisco Systems November 2000  –  September 2004  (3 years 11 months) Lead documentation team in creating single-sourced online help and user guides, as well as installation guides, quick start guides, release notes, supported devices tables, and white papers for Cisco Systems products. Skills FrameMaker Technical Writing Enterprise Software Online Help Cloud Computing Security CVS Agile Methodologies User Interface Design XML Localization AuthorIT Encryption Visio Structured Authoring Manuals See 1+     See less Skills  FrameMaker Technical Writing Enterprise Software Online Help Cloud Computing Security CVS Agile Methodologies User Interface Design XML Localization AuthorIT Encryption Visio Structured Authoring Manuals See 1+     See less FrameMaker Technical Writing Enterprise Software Online Help Cloud Computing Security CVS Agile Methodologies User Interface Design XML Localization AuthorIT Encryption Visio Structured Authoring Manuals See 1+     See less FrameMaker Technical Writing Enterprise Software Online Help Cloud Computing Security CVS Agile Methodologies User Interface Design XML Localization AuthorIT Encryption Visio Structured Authoring Manuals See 1+     See less Education University of Denver Certificate,  Publishing Institute - book publishing 1994  – 1994 Pomona College B.A.,  Philosophy 1990  – 1994 Cleveland High School University of Denver Certificate,  Publishing Institute - book publishing 1994  – 1994 University of Denver Certificate,  Publishing Institute - book publishing 1994  – 1994 University of Denver Certificate,  Publishing Institute - book publishing 1994  – 1994 Pomona College B.A.,  Philosophy 1990  – 1994 Pomona College B.A.,  Philosophy 1990  – 1994 Pomona College B.A.,  Philosophy 1990  – 1994 Cleveland High School Cleveland High School Cleveland High School ", "Summary For the moment, I am turning my back on the employment market and trying my hand at the employer market. I have launched the startup - ExtendedRelative.com in the USA. I have a few contractors and partners working with me and we are going through all the experiences associated with any tech startup - from choosing the dominant colour themes for the website and pitch decks, to creating business plans and budgets. We are currently applying to accelerator programmes and are actively seeking funding. We prefer to get money from accelerators rather than venture capital (VC), but if the right VC deal came along, we would consider it. \n \nI am passionate about this project and believe it is an important service for families struggling to make ends meet in the 21st century. \n \nFeel free to reach out to me for more information or look us up on the web.  \n \nBefore March 2013, I was a versatile and highly effective technical writer, instructional designer, and project manager with over a 15-year record of achievement in technical publications and curriculum development, as well as developing software/hardware training programs for major corporations (Cisco, Apple, Adobe), resulting in multiple “outstanding performance” awards.  \n \nAccomplished at managing the design, development, and delivery of technical publications & training curricula (Instructor-led, web- based and e-learning) for internal and external customers. \n \nExceptional interpersonal, communication, and decision-making skills, with a focus on overcoming challenges with training programs involving both customers and partners.  \n \nParticularly interested in designing learning and training programs for instructors and partners, and resolving conflict between cross functional teams. \n \nI possess a balance of strong writing, project management, instructional design, and desktop publishing skills, with an ability to identify emerging issues and generate creative solutions to challenging problems.yy Summary For the moment, I am turning my back on the employment market and trying my hand at the employer market. I have launched the startup - ExtendedRelative.com in the USA. I have a few contractors and partners working with me and we are going through all the experiences associated with any tech startup - from choosing the dominant colour themes for the website and pitch decks, to creating business plans and budgets. We are currently applying to accelerator programmes and are actively seeking funding. We prefer to get money from accelerators rather than venture capital (VC), but if the right VC deal came along, we would consider it. \n \nI am passionate about this project and believe it is an important service for families struggling to make ends meet in the 21st century. \n \nFeel free to reach out to me for more information or look us up on the web.  \n \nBefore March 2013, I was a versatile and highly effective technical writer, instructional designer, and project manager with over a 15-year record of achievement in technical publications and curriculum development, as well as developing software/hardware training programs for major corporations (Cisco, Apple, Adobe), resulting in multiple “outstanding performance” awards.  \n \nAccomplished at managing the design, development, and delivery of technical publications & training curricula (Instructor-led, web- based and e-learning) for internal and external customers. \n \nExceptional interpersonal, communication, and decision-making skills, with a focus on overcoming challenges with training programs involving both customers and partners.  \n \nParticularly interested in designing learning and training programs for instructors and partners, and resolving conflict between cross functional teams. \n \nI possess a balance of strong writing, project management, instructional design, and desktop publishing skills, with an ability to identify emerging issues and generate creative solutions to challenging problems.yy For the moment, I am turning my back on the employment market and trying my hand at the employer market. I have launched the startup - ExtendedRelative.com in the USA. I have a few contractors and partners working with me and we are going through all the experiences associated with any tech startup - from choosing the dominant colour themes for the website and pitch decks, to creating business plans and budgets. We are currently applying to accelerator programmes and are actively seeking funding. We prefer to get money from accelerators rather than venture capital (VC), but if the right VC deal came along, we would consider it. \n \nI am passionate about this project and believe it is an important service for families struggling to make ends meet in the 21st century. \n \nFeel free to reach out to me for more information or look us up on the web.  \n \nBefore March 2013, I was a versatile and highly effective technical writer, instructional designer, and project manager with over a 15-year record of achievement in technical publications and curriculum development, as well as developing software/hardware training programs for major corporations (Cisco, Apple, Adobe), resulting in multiple “outstanding performance” awards.  \n \nAccomplished at managing the design, development, and delivery of technical publications & training curricula (Instructor-led, web- based and e-learning) for internal and external customers. \n \nExceptional interpersonal, communication, and decision-making skills, with a focus on overcoming challenges with training programs involving both customers and partners.  \n \nParticularly interested in designing learning and training programs for instructors and partners, and resolving conflict between cross functional teams. \n \nI possess a balance of strong writing, project management, instructional design, and desktop publishing skills, with an ability to identify emerging issues and generate creative solutions to challenging problems.yy For the moment, I am turning my back on the employment market and trying my hand at the employer market. I have launched the startup - ExtendedRelative.com in the USA. I have a few contractors and partners working with me and we are going through all the experiences associated with any tech startup - from choosing the dominant colour themes for the website and pitch decks, to creating business plans and budgets. We are currently applying to accelerator programmes and are actively seeking funding. We prefer to get money from accelerators rather than venture capital (VC), but if the right VC deal came along, we would consider it. \n \nI am passionate about this project and believe it is an important service for families struggling to make ends meet in the 21st century. \n \nFeel free to reach out to me for more information or look us up on the web.  \n \nBefore March 2013, I was a versatile and highly effective technical writer, instructional designer, and project manager with over a 15-year record of achievement in technical publications and curriculum development, as well as developing software/hardware training programs for major corporations (Cisco, Apple, Adobe), resulting in multiple “outstanding performance” awards.  \n \nAccomplished at managing the design, development, and delivery of technical publications & training curricula (Instructor-led, web- based and e-learning) for internal and external customers. \n \nExceptional interpersonal, communication, and decision-making skills, with a focus on overcoming challenges with training programs involving both customers and partners.  \n \nParticularly interested in designing learning and training programs for instructors and partners, and resolving conflict between cross functional teams. \n \nI possess a balance of strong writing, project management, instructional design, and desktop publishing skills, with an ability to identify emerging issues and generate creative solutions to challenging problems.yy Experience Founder ExtendedRelative June 2010  – Present (5 years 3 months) Senior Technical Writer Molecular Devices June 2012  –  March 2013  (10 months) New Milton, UK Senior Instructional Designer (Manufacturing & LDSG) Cisco Systems July 2007  –  June 2010  (3 years) San Jose, CA Instructional Designer & Project Manager Cisco Systems (Sales Enablement) January 2007  –  July 2007  (7 months) San Jose, CA Senior Technical Writer Anagran November 2006  –  January 2007  (3 months) Training & Documentation Program Manager SNOCAP March 2005  –  April 2006  (1 year 2 months) Lead Technical Writer & Project Manager Adobe Systems May 2004  –  March 2005  (11 months) San Jose, CA Lead Technical Writer & Project Manager Apple Inc. February 2002  –  July 2003  (1 year 6 months) Cupertino, CA Senior Writer & Project Manager (EMBU) Cisco Systems August 2000  –  April 2001  (9 months) San Jose, CA Lead Technical Writer Cisco Systems (ITD Division) December 1999  –  August 2000  (9 months) Technical Writer (IOS Division) Cisco Systems October 1998  –  December 1999  (1 year 3 months) Technical Writer SGI July 1997  –  August 1998  (1 year 2 months) Mountain View, CA Founder ExtendedRelative June 2010  – Present (5 years 3 months) Founder ExtendedRelative June 2010  – Present (5 years 3 months) Senior Technical Writer Molecular Devices June 2012  –  March 2013  (10 months) New Milton, UK Senior Technical Writer Molecular Devices June 2012  –  March 2013  (10 months) New Milton, UK Senior Instructional Designer (Manufacturing & LDSG) Cisco Systems July 2007  –  June 2010  (3 years) San Jose, CA Senior Instructional Designer (Manufacturing & LDSG) Cisco Systems July 2007  –  June 2010  (3 years) San Jose, CA Instructional Designer & Project Manager Cisco Systems (Sales Enablement) January 2007  –  July 2007  (7 months) San Jose, CA Instructional Designer & Project Manager Cisco Systems (Sales Enablement) January 2007  –  July 2007  (7 months) San Jose, CA Senior Technical Writer Anagran November 2006  –  January 2007  (3 months) Senior Technical Writer Anagran November 2006  –  January 2007  (3 months) Training & Documentation Program Manager SNOCAP March 2005  –  April 2006  (1 year 2 months) Training & Documentation Program Manager SNOCAP March 2005  –  April 2006  (1 year 2 months) Lead Technical Writer & Project Manager Adobe Systems May 2004  –  March 2005  (11 months) San Jose, CA Lead Technical Writer & Project Manager Adobe Systems May 2004  –  March 2005  (11 months) San Jose, CA Lead Technical Writer & Project Manager Apple Inc. February 2002  –  July 2003  (1 year 6 months) Cupertino, CA Lead Technical Writer & Project Manager Apple Inc. February 2002  –  July 2003  (1 year 6 months) Cupertino, CA Senior Writer & Project Manager (EMBU) Cisco Systems August 2000  –  April 2001  (9 months) San Jose, CA Senior Writer & Project Manager (EMBU) Cisco Systems August 2000  –  April 2001  (9 months) San Jose, CA Lead Technical Writer Cisco Systems (ITD Division) December 1999  –  August 2000  (9 months) Lead Technical Writer Cisco Systems (ITD Division) December 1999  –  August 2000  (9 months) Technical Writer (IOS Division) Cisco Systems October 1998  –  December 1999  (1 year 3 months) Technical Writer (IOS Division) Cisco Systems October 1998  –  December 1999  (1 year 3 months) Technical Writer SGI July 1997  –  August 1998  (1 year 2 months) Mountain View, CA Technical Writer SGI July 1997  –  August 1998  (1 year 2 months) Mountain View, CA Languages French French French Skills Adobe Presenter Adobe Captivate Adobe FrameMaker Adobe Creative Suite Camtasia InDesign PowerPoint Word Microsoft Office RoboHelp Technical Writing Instructional Design Project Portfolio... SnagIt Journalism Broadcast Journalism Radio Broadcasting Project Coordination Multimedia Project... Program Management End User Training Team Leadership Leading Cross... FrameMaker Captivate User Experience Cross-functional Team... Online Help See 13+     See less Skills  Adobe Presenter Adobe Captivate Adobe FrameMaker Adobe Creative Suite Camtasia InDesign PowerPoint Word Microsoft Office RoboHelp Technical Writing Instructional Design Project Portfolio... SnagIt Journalism Broadcast Journalism Radio Broadcasting Project Coordination Multimedia Project... Program Management End User Training Team Leadership Leading Cross... FrameMaker Captivate User Experience Cross-functional Team... Online Help See 13+     See less Adobe Presenter Adobe Captivate Adobe FrameMaker Adobe Creative Suite Camtasia InDesign PowerPoint Word Microsoft Office RoboHelp Technical Writing Instructional Design Project Portfolio... SnagIt Journalism Broadcast Journalism Radio Broadcasting Project Coordination Multimedia Project... Program Management End User Training Team Leadership Leading Cross... FrameMaker Captivate User Experience Cross-functional Team... Online Help See 13+     See less Adobe Presenter Adobe Captivate Adobe FrameMaker Adobe Creative Suite Camtasia InDesign PowerPoint Word Microsoft Office RoboHelp Technical Writing Instructional Design Project Portfolio... SnagIt Journalism Broadcast Journalism Radio Broadcasting Project Coordination Multimedia Project... Program Management End User Training Team Leadership Leading Cross... FrameMaker Captivate User Experience Cross-functional Team... Online Help See 13+     See less Education Stradbroke School of Journalism Post-Graduate 1991  – 1992 Harrow Film School BA (Hons.) Webster Institute of Technical Writing Technical Writing Certification Stradbroke School of Journalism Post-Graduate 1991  – 1992 Stradbroke School of Journalism Post-Graduate 1991  – 1992 Stradbroke School of Journalism Post-Graduate 1991  – 1992 Harrow Film School BA (Hons.) Harrow Film School BA (Hons.) Harrow Film School BA (Hons.) Webster Institute of Technical Writing Technical Writing Certification Webster Institute of Technical Writing Technical Writing Certification Webster Institute of Technical Writing Technical Writing Certification Honors & Awards Additional Honors & Awards Two \"Outstanding Achievement\" awards at Cisco. Additional Honors & Awards Two \"Outstanding Achievement\" awards at Cisco. Additional Honors & Awards Two \"Outstanding Achievement\" awards at Cisco. Additional Honors & Awards Two \"Outstanding Achievement\" awards at Cisco. ", "Experience Lead Technical Writer Cisco Systems India Pvt Ltd April 2012  – Present (3 years 5 months) Bangalore Lead Technical Writer CDC Software March 2010  –  February 2012  (2 years) Bangalore Technical Lead Verifacts Services Pvt Ltd March 2008  –  February 2010  (2 years) Bangalore Technical Writer Nokia April 2005  –  November 2007  (2 years 8 months) Bangalore Lead Technical Writer Cisco Systems India Pvt Ltd April 2012  – Present (3 years 5 months) Bangalore Lead Technical Writer Cisco Systems India Pvt Ltd April 2012  – Present (3 years 5 months) Bangalore Lead Technical Writer CDC Software March 2010  –  February 2012  (2 years) Bangalore Lead Technical Writer CDC Software March 2010  –  February 2012  (2 years) Bangalore Technical Lead Verifacts Services Pvt Ltd March 2008  –  February 2010  (2 years) Bangalore Technical Lead Verifacts Services Pvt Ltd March 2008  –  February 2010  (2 years) Bangalore Technical Writer Nokia April 2005  –  November 2007  (2 years 8 months) Bangalore Technical Writer Nokia April 2005  –  November 2007  (2 years 8 months) Bangalore Skills Vendor Management Operations Management Skills  Vendor Management Operations Management Vendor Management Operations Management Vendor Management Operations Management Education Bangalore University 1996  – 2001 Bangalore University 1996  – 2001 Bangalore University 1996  – 2001 Bangalore University 1996  – 2001 ", "Summary Interested in a strategic business role that captures value for the organization by providing value to all the stakeholders involved, thereby increasing the firm’s profitability. \n \nBackground: Lead technical writer with 11 years’ experience in the industry, leading documentation programs from end to end, coordinating with various stakeholders, and working in a globally distributed environment. Graduated in commerce and accountancy, currently pursuing an M.B.A. program. \n \nCore competency: \n- Knowledge management, technical writing, and process documentation \n- Documentation project management for entire product release Summary Interested in a strategic business role that captures value for the organization by providing value to all the stakeholders involved, thereby increasing the firm’s profitability. \n \nBackground: Lead technical writer with 11 years’ experience in the industry, leading documentation programs from end to end, coordinating with various stakeholders, and working in a globally distributed environment. Graduated in commerce and accountancy, currently pursuing an M.B.A. program. \n \nCore competency: \n- Knowledge management, technical writing, and process documentation \n- Documentation project management for entire product release Interested in a strategic business role that captures value for the organization by providing value to all the stakeholders involved, thereby increasing the firm’s profitability. \n \nBackground: Lead technical writer with 11 years’ experience in the industry, leading documentation programs from end to end, coordinating with various stakeholders, and working in a globally distributed environment. Graduated in commerce and accountancy, currently pursuing an M.B.A. program. \n \nCore competency: \n- Knowledge management, technical writing, and process documentation \n- Documentation project management for entire product release Interested in a strategic business role that captures value for the organization by providing value to all the stakeholders involved, thereby increasing the firm’s profitability. \n \nBackground: Lead technical writer with 11 years’ experience in the industry, leading documentation programs from end to end, coordinating with various stakeholders, and working in a globally distributed environment. Graduated in commerce and accountancy, currently pursuing an M.B.A. program. \n \nCore competency: \n- Knowledge management, technical writing, and process documentation \n- Documentation project management for entire product release Experience Lead Technical Writer Cisco Systems August 2010  – Present (5 years 1 month) Bangalore Area, India Senior Information Developer SAP Labs India Pvt. Ltd. June 2006  –  August 2010  (4 years 3 months) Bangalore Area, India Technical Writer Technowrites Pvt. Ltd. April 2004  –  April 2006  (2 years 1 month) Search Engine Optimization (SEO) Copywriter SearchEngineEthics.com January 2004  –  March 2004  (3 months) Lead Technical Writer Cisco Systems August 2010  – Present (5 years 1 month) Bangalore Area, India Lead Technical Writer Cisco Systems August 2010  – Present (5 years 1 month) Bangalore Area, India Senior Information Developer SAP Labs India Pvt. Ltd. June 2006  –  August 2010  (4 years 3 months) Bangalore Area, India Senior Information Developer SAP Labs India Pvt. Ltd. June 2006  –  August 2010  (4 years 3 months) Bangalore Area, India Technical Writer Technowrites Pvt. Ltd. April 2004  –  April 2006  (2 years 1 month) Technical Writer Technowrites Pvt. Ltd. April 2004  –  April 2006  (2 years 1 month) Search Engine Optimization (SEO) Copywriter SearchEngineEthics.com January 2004  –  March 2004  (3 months) Search Engine Optimization (SEO) Copywriter SearchEngineEthics.com January 2004  –  March 2004  (3 months) Skills Technical Writing Knowledge Management Management Business Strategy Productivity Improvement Communication Training User Experience Information Architecture process documentation Software Documentation Technical Communication Content Management SEO Manuals FrameMaker Technical Documentation Online Help RoboHelp DITA Editing Document Management See 7+     See less Skills  Technical Writing Knowledge Management Management Business Strategy Productivity Improvement Communication Training User Experience Information Architecture process documentation Software Documentation Technical Communication Content Management SEO Manuals FrameMaker Technical Documentation Online Help RoboHelp DITA Editing Document Management See 7+     See less Technical Writing Knowledge Management Management Business Strategy Productivity Improvement Communication Training User Experience Information Architecture process documentation Software Documentation Technical Communication Content Management SEO Manuals FrameMaker Technical Documentation Online Help RoboHelp DITA Editing Document Management See 7+     See less Technical Writing Knowledge Management Management Business Strategy Productivity Improvement Communication Training User Experience Information Architecture process documentation Software Documentation Technical Communication Content Management SEO Manuals FrameMaker Technical Documentation Online Help RoboHelp DITA Editing Document Management See 7+     See less ", "Summary Technical Documentation Manager: Particularly interested in roles that provide opportunities in people management, documentation program management, training and mentoring, and team building. \n \nSpecialties: Project and program management, Adobe FrameMaker, WebWorks, RoboHelp, HTML, XML, usability, user-centered analysis and design, heuristic evaluation Summary Technical Documentation Manager: Particularly interested in roles that provide opportunities in people management, documentation program management, training and mentoring, and team building. \n \nSpecialties: Project and program management, Adobe FrameMaker, WebWorks, RoboHelp, HTML, XML, usability, user-centered analysis and design, heuristic evaluation Technical Documentation Manager: Particularly interested in roles that provide opportunities in people management, documentation program management, training and mentoring, and team building. \n \nSpecialties: Project and program management, Adobe FrameMaker, WebWorks, RoboHelp, HTML, XML, usability, user-centered analysis and design, heuristic evaluation Technical Documentation Manager: Particularly interested in roles that provide opportunities in people management, documentation program management, training and mentoring, and team building. \n \nSpecialties: Project and program management, Adobe FrameMaker, WebWorks, RoboHelp, HTML, XML, usability, user-centered analysis and design, heuristic evaluation Experience Documentation Manager Cisco May 2014  – Present (1 year 4 months) Bengaluru Area, India Leading a team of writers and managing documentation programs for a range of products in Cisco's Smart Cities and Internet of Everything/Internet of Things (IoT/IoE) space.  Lead Technical Writer Cisco April 2010  –  May 2014  (4 years 2 months) Bangalore Senior Technical Writer Autonomy iManage March 2009  –  March 2010  (1 year 1 month) Bangalore Technical Writer Interwoven June 2006  –  March 2009  (2 years 10 months) Bangalore Documentation Manager Cisco May 2014  – Present (1 year 4 months) Bengaluru Area, India Leading a team of writers and managing documentation programs for a range of products in Cisco's Smart Cities and Internet of Everything/Internet of Things (IoT/IoE) space.  Documentation Manager Cisco May 2014  – Present (1 year 4 months) Bengaluru Area, India Leading a team of writers and managing documentation programs for a range of products in Cisco's Smart Cities and Internet of Everything/Internet of Things (IoT/IoE) space.  Lead Technical Writer Cisco April 2010  –  May 2014  (4 years 2 months) Bangalore Lead Technical Writer Cisco April 2010  –  May 2014  (4 years 2 months) Bangalore Senior Technical Writer Autonomy iManage March 2009  –  March 2010  (1 year 1 month) Bangalore Senior Technical Writer Autonomy iManage March 2009  –  March 2010  (1 year 1 month) Bangalore Technical Writer Interwoven June 2006  –  March 2009  (2 years 10 months) Bangalore Technical Writer Interwoven June 2006  –  March 2009  (2 years 10 months) Bangalore Skills Software Documentation XML Usability Technical Documentation RoboHelp User Interface Design FrameMaker Online Help Testing Web Content Management Document Management Information Design Agile Methodologies Wireframes HTML Content Management Manuals DITA Technical Writing See 4+     See less Skills  Software Documentation XML Usability Technical Documentation RoboHelp User Interface Design FrameMaker Online Help Testing Web Content Management Document Management Information Design Agile Methodologies Wireframes HTML Content Management Manuals DITA Technical Writing See 4+     See less Software Documentation XML Usability Technical Documentation RoboHelp User Interface Design FrameMaker Online Help Testing Web Content Management Document Management Information Design Agile Methodologies Wireframes HTML Content Management Manuals DITA Technical Writing See 4+     See less Software Documentation XML Usability Technical Documentation RoboHelp User Interface Design FrameMaker Online Help Testing Web Content Management Document Management Information Design Agile Methodologies Wireframes HTML Content Management Manuals DITA Technical Writing See 4+     See less Education Indian Institute of Mass Communications Post Graduate Diploma,  Advertising and Public Relations Bangalore University B.Sc.,  Chemistry ,  Environmental Science ,  Biology Activities and Societies:  Dramatics Team Indian Institute of Mass Communications Post Graduate Diploma,  Advertising and Public Relations Indian Institute of Mass Communications Post Graduate Diploma,  Advertising and Public Relations Indian Institute of Mass Communications Post Graduate Diploma,  Advertising and Public Relations Bangalore University B.Sc.,  Chemistry ,  Environmental Science ,  Biology Activities and Societies:  Dramatics Team Bangalore University B.Sc.,  Chemistry ,  Environmental Science ,  Biology Activities and Societies:  Dramatics Team Bangalore University B.Sc.,  Chemistry ,  Environmental Science ,  Biology Activities and Societies:  Dramatics Team Honors & Awards Additional Honors & Awards - Cisco Achievement Program (CAP) Awards for outstanding employee efforts and achievements.  \n- Cisco Award for contributing to Central Technical Communications' large-scale hiring and training new hires initiative.  \n- Cisco Star Award for demonstrating exceptional teamwork and collaboration to deliver high-quality results.  \n- Cisco Spot Award for acting as a catalyst of change and encouraging peers to improve on current results.  \n- Interwoven Worldwide Engineering Star Award for outstanding performance and lasting contribution. \n- Interwoven Spot Award for innovation in documentation. Additional Honors & Awards - Cisco Achievement Program (CAP) Awards for outstanding employee efforts and achievements.  \n- Cisco Award for contributing to Central Technical Communications' large-scale hiring and training new hires initiative.  \n- Cisco Star Award for demonstrating exceptional teamwork and collaboration to deliver high-quality results.  \n- Cisco Spot Award for acting as a catalyst of change and encouraging peers to improve on current results.  \n- Interwoven Worldwide Engineering Star Award for outstanding performance and lasting contribution. \n- Interwoven Spot Award for innovation in documentation. Additional Honors & Awards - Cisco Achievement Program (CAP) Awards for outstanding employee efforts and achievements.  \n- Cisco Award for contributing to Central Technical Communications' large-scale hiring and training new hires initiative.  \n- Cisco Star Award for demonstrating exceptional teamwork and collaboration to deliver high-quality results.  \n- Cisco Spot Award for acting as a catalyst of change and encouraging peers to improve on current results.  \n- Interwoven Worldwide Engineering Star Award for outstanding performance and lasting contribution. \n- Interwoven Spot Award for innovation in documentation. Additional Honors & Awards - Cisco Achievement Program (CAP) Awards for outstanding employee efforts and achievements.  \n- Cisco Award for contributing to Central Technical Communications' large-scale hiring and training new hires initiative.  \n- Cisco Star Award for demonstrating exceptional teamwork and collaboration to deliver high-quality results.  \n- Cisco Spot Award for acting as a catalyst of change and encouraging peers to improve on current results.  \n- Interwoven Worldwide Engineering Star Award for outstanding performance and lasting contribution. \n- Interwoven Spot Award for innovation in documentation. ", "Summary •\tIndustry perspective and best practices understanding acquired over 25 years as technical writer, project lead, information architect (including design), and manager at companies of every size and at every business stage \n•\tKnowledge of networking products and technologies gained through ten years at Cisco Systems, including routers, switches, CLI commands, and more. \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tDocumentation and software project and process management experience \n•\tWeb analytics and web applications experience at Cisco and Avaya, combining that information with online feedback and face-to-face anecdotal customer input, dovetailing into a clear and measurable path for our content. \n•\tKnowledge of storage systems, cloud-based and physical from more than a year at Hitachi Data Systems \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tUnderstanding of video technology and web applications gained during one year at Avaya \n•\tStrong collaboration and teamwork skills, frequently with global teams, including cross- functional program management and win-win negotiating experience \n \nSkills include technical writing of white papers, periodicals, API guides, people and project management, DITA (coursework), SharePoint, FrameMaker, structured FrameMaker, creating style guides, technical editing, metadata frameworks, Acrobat, strategic planning, usability, Linux guides, presentations, structured authoring, network operating systems, various graphics products, Microsoft Office, developing and implementing business processes; information creation, delivery, and architecture. \n Summary •\tIndustry perspective and best practices understanding acquired over 25 years as technical writer, project lead, information architect (including design), and manager at companies of every size and at every business stage \n•\tKnowledge of networking products and technologies gained through ten years at Cisco Systems, including routers, switches, CLI commands, and more. \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tDocumentation and software project and process management experience \n•\tWeb analytics and web applications experience at Cisco and Avaya, combining that information with online feedback and face-to-face anecdotal customer input, dovetailing into a clear and measurable path for our content. \n•\tKnowledge of storage systems, cloud-based and physical from more than a year at Hitachi Data Systems \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tUnderstanding of video technology and web applications gained during one year at Avaya \n•\tStrong collaboration and teamwork skills, frequently with global teams, including cross- functional program management and win-win negotiating experience \n \nSkills include technical writing of white papers, periodicals, API guides, people and project management, DITA (coursework), SharePoint, FrameMaker, structured FrameMaker, creating style guides, technical editing, metadata frameworks, Acrobat, strategic planning, usability, Linux guides, presentations, structured authoring, network operating systems, various graphics products, Microsoft Office, developing and implementing business processes; information creation, delivery, and architecture. \n •\tIndustry perspective and best practices understanding acquired over 25 years as technical writer, project lead, information architect (including design), and manager at companies of every size and at every business stage \n•\tKnowledge of networking products and technologies gained through ten years at Cisco Systems, including routers, switches, CLI commands, and more. \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tDocumentation and software project and process management experience \n•\tWeb analytics and web applications experience at Cisco and Avaya, combining that information with online feedback and face-to-face anecdotal customer input, dovetailing into a clear and measurable path for our content. \n•\tKnowledge of storage systems, cloud-based and physical from more than a year at Hitachi Data Systems \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tUnderstanding of video technology and web applications gained during one year at Avaya \n•\tStrong collaboration and teamwork skills, frequently with global teams, including cross- functional program management and win-win negotiating experience \n \nSkills include technical writing of white papers, periodicals, API guides, people and project management, DITA (coursework), SharePoint, FrameMaker, structured FrameMaker, creating style guides, technical editing, metadata frameworks, Acrobat, strategic planning, usability, Linux guides, presentations, structured authoring, network operating systems, various graphics products, Microsoft Office, developing and implementing business processes; information creation, delivery, and architecture. \n •\tIndustry perspective and best practices understanding acquired over 25 years as technical writer, project lead, information architect (including design), and manager at companies of every size and at every business stage \n•\tKnowledge of networking products and technologies gained through ten years at Cisco Systems, including routers, switches, CLI commands, and more. \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tDocumentation and software project and process management experience \n•\tWeb analytics and web applications experience at Cisco and Avaya, combining that information with online feedback and face-to-face anecdotal customer input, dovetailing into a clear and measurable path for our content. \n•\tKnowledge of storage systems, cloud-based and physical from more than a year at Hitachi Data Systems \n•\tModular content reuse at Cisco and TiVo, and content management solutions at Cisco \n•\tUnderstanding of video technology and web applications gained during one year at Avaya \n•\tStrong collaboration and teamwork skills, frequently with global teams, including cross- functional program management and win-win negotiating experience \n \nSkills include technical writing of white papers, periodicals, API guides, people and project management, DITA (coursework), SharePoint, FrameMaker, structured FrameMaker, creating style guides, technical editing, metadata frameworks, Acrobat, strategic planning, usability, Linux guides, presentations, structured authoring, network operating systems, various graphics products, Microsoft Office, developing and implementing business processes; information creation, delivery, and architecture. \n Experience Lead Technical Writer Hitachi Data Systems March 2014  – Present (1 year 6 months) Santa Clara, CA -Plan and schedule software documentations projects \n-Maintain strong, collaborative relationships with software developers and QA  \n-Document physical and cloud/virtual data storage solutions \n-Automate documentation tasks \n-Database experience with Oracle, Microsoft, VMware, Hitachi software applications \n-Document two storage APIs ( C++ and REST) \n-Lead documentation efforts in an embedded position in a software engineering group with 2 tech writers (soon to be three) \n-Design documentation usability features for database administrators and design engineers \n-Develop increased expertise with version control systems (Subversion) and bug-tracking software Senior Technical Writer Yahoo! August 2013  –  August 2013  (1 month) Sunnyvale, CA Documented processes for CapEX decision-making at Yahoo! as a company, involving interviews with many subject-matter experts in varied parts of the organization: finance, IT, supply-chain management, product management, and more. Customer Service Senior Technical Writer TiVo January 2012  –  March 2013  (1 year 3 months) Alviso, CA Documented complex topics for TV cable operators, including field installation, use of TiVo APIs, MoCA and Ethernet networks, DVR diagnostics and troubleshooting, and so on.  \n•\tCreated reusable content modules for cable operator documents created in FrameMaker \n•\tDocumented internal procedures for employees, to reduce Help Desk traffic.  \n•\tDocumented processes for incident management, to ensure that TiVo implemented industry best practices in serving large customers. Business Analyst and Technical Writer Avaya October 2010  –  December 2011  (1 year 3 months) Santa Clara, CA Worked in a high-powered, global video business development group, writing sales aids, marketing collateral (fact sheets, white papers, FAQs), RFP questions and answers, and sales presentations. In addition I performed these functions:  \n•\tMentored and trained new employees. Built web-based content SharePoint repositories for sales use.  \n•\tDocumented Linux commands and procedures for support engineers in IP video.  \n•\tCreated virtual technical sales environment within a 3D framework with avatars, using web-based applications. Populated environment with information and wall displays, banners, and other media. Senior Technical Marketing Editor Cisco Systems July 2010  –  October 2010  (4 months) San Jose CA Edited and rewrote marketing and technical white papers, data sheets, and related documents with an emphasis on localization. Sabbatical .... January 2008  –  June 2010  (2 years 6 months) Took time off to write a book. Senior Technical Writer, Information Architect, Documentation Manager Cisco Systems November 1998  –  December 2008  (10 years 2 months) San Jose, CA Worked with customers, engineers, writers and editors to document software implementing packet voice over IP with voice, video, and telephony features; internetworking operating system software with a command-line interface; supervised documentation for APIs and scripting languages aimed at developers and partners who created applications that interwork with Cisco voice hardware. Audiences were network designers, network operating engineers, and software developers. \n \nAs a Cisco information specialist for ten years: \n•\tManaged complex knowledge management programs cross functionally, resulting in success for all those involved. \n•\tInitiated effective customer experience and satisfaction programs, including usability testing. Used in-house web analytics to gauge effectiveness, internally and externally. \n•\tConceived, architected, and implemented business scenario docs for key new feature sets, extending information development cycle beyond first customer ship to reflect customer and field experience. \n•\tAllied with technical support Customer Service Engineers to initiate a formal review program that resulted in CSEs providing doc content as well as comments, thereby improving the information provided to customers. \n•\tSupervised global writing team \n\tDocumentation project manager for numerous cross-functional teams \nAs information architect and writer: \n•\tQuickly mastered complex Cisco IOS features to write documentation about voice over IP, telephony routing, SIP, and other complex voice and telephony products. \n•\tParticipated in a group to help specify XML content management solutions and authoring tools. \n•\tDeveloped writing process handbook and checklists for writers and editors.  \n•\tWorked with a select team in designing Cisco’s support, web management design, and documentation knowledge bases on its website. \n•\tCreated lab procedures to test software for documentation purposes. \n•\tImproved process and technical training for new hires. Documentation project manager, Senior Technical Writer Lucent Technologies January 1993  –  October 1998  (5 years 10 months) Publishing Director Ashton-Tate 1982  –  1988  (6 years) Lead Technical Writer Hitachi Data Systems March 2014  – Present (1 year 6 months) Santa Clara, CA -Plan and schedule software documentations projects \n-Maintain strong, collaborative relationships with software developers and QA  \n-Document physical and cloud/virtual data storage solutions \n-Automate documentation tasks \n-Database experience with Oracle, Microsoft, VMware, Hitachi software applications \n-Document two storage APIs ( C++ and REST) \n-Lead documentation efforts in an embedded position in a software engineering group with 2 tech writers (soon to be three) \n-Design documentation usability features for database administrators and design engineers \n-Develop increased expertise with version control systems (Subversion) and bug-tracking software Lead Technical Writer Hitachi Data Systems March 2014  – Present (1 year 6 months) Santa Clara, CA -Plan and schedule software documentations projects \n-Maintain strong, collaborative relationships with software developers and QA  \n-Document physical and cloud/virtual data storage solutions \n-Automate documentation tasks \n-Database experience with Oracle, Microsoft, VMware, Hitachi software applications \n-Document two storage APIs ( C++ and REST) \n-Lead documentation efforts in an embedded position in a software engineering group with 2 tech writers (soon to be three) \n-Design documentation usability features for database administrators and design engineers \n-Develop increased expertise with version control systems (Subversion) and bug-tracking software Senior Technical Writer Yahoo! August 2013  –  August 2013  (1 month) Sunnyvale, CA Documented processes for CapEX decision-making at Yahoo! as a company, involving interviews with many subject-matter experts in varied parts of the organization: finance, IT, supply-chain management, product management, and more. Senior Technical Writer Yahoo! August 2013  –  August 2013  (1 month) Sunnyvale, CA Documented processes for CapEX decision-making at Yahoo! as a company, involving interviews with many subject-matter experts in varied parts of the organization: finance, IT, supply-chain management, product management, and more. Customer Service Senior Technical Writer TiVo January 2012  –  March 2013  (1 year 3 months) Alviso, CA Documented complex topics for TV cable operators, including field installation, use of TiVo APIs, MoCA and Ethernet networks, DVR diagnostics and troubleshooting, and so on.  \n•\tCreated reusable content modules for cable operator documents created in FrameMaker \n•\tDocumented internal procedures for employees, to reduce Help Desk traffic.  \n•\tDocumented processes for incident management, to ensure that TiVo implemented industry best practices in serving large customers. Customer Service Senior Technical Writer TiVo January 2012  –  March 2013  (1 year 3 months) Alviso, CA Documented complex topics for TV cable operators, including field installation, use of TiVo APIs, MoCA and Ethernet networks, DVR diagnostics and troubleshooting, and so on.  \n•\tCreated reusable content modules for cable operator documents created in FrameMaker \n•\tDocumented internal procedures for employees, to reduce Help Desk traffic.  \n•\tDocumented processes for incident management, to ensure that TiVo implemented industry best practices in serving large customers. Business Analyst and Technical Writer Avaya October 2010  –  December 2011  (1 year 3 months) Santa Clara, CA Worked in a high-powered, global video business development group, writing sales aids, marketing collateral (fact sheets, white papers, FAQs), RFP questions and answers, and sales presentations. In addition I performed these functions:  \n•\tMentored and trained new employees. Built web-based content SharePoint repositories for sales use.  \n•\tDocumented Linux commands and procedures for support engineers in IP video.  \n•\tCreated virtual technical sales environment within a 3D framework with avatars, using web-based applications. Populated environment with information and wall displays, banners, and other media. Business Analyst and Technical Writer Avaya October 2010  –  December 2011  (1 year 3 months) Santa Clara, CA Worked in a high-powered, global video business development group, writing sales aids, marketing collateral (fact sheets, white papers, FAQs), RFP questions and answers, and sales presentations. In addition I performed these functions:  \n•\tMentored and trained new employees. Built web-based content SharePoint repositories for sales use.  \n•\tDocumented Linux commands and procedures for support engineers in IP video.  \n•\tCreated virtual technical sales environment within a 3D framework with avatars, using web-based applications. Populated environment with information and wall displays, banners, and other media. Senior Technical Marketing Editor Cisco Systems July 2010  –  October 2010  (4 months) San Jose CA Edited and rewrote marketing and technical white papers, data sheets, and related documents with an emphasis on localization. Senior Technical Marketing Editor Cisco Systems July 2010  –  October 2010  (4 months) San Jose CA Edited and rewrote marketing and technical white papers, data sheets, and related documents with an emphasis on localization. Sabbatical .... January 2008  –  June 2010  (2 years 6 months) Took time off to write a book. Sabbatical .... January 2008  –  June 2010  (2 years 6 months) Took time off to write a book. Senior Technical Writer, Information Architect, Documentation Manager Cisco Systems November 1998  –  December 2008  (10 years 2 months) San Jose, CA Worked with customers, engineers, writers and editors to document software implementing packet voice over IP with voice, video, and telephony features; internetworking operating system software with a command-line interface; supervised documentation for APIs and scripting languages aimed at developers and partners who created applications that interwork with Cisco voice hardware. Audiences were network designers, network operating engineers, and software developers. \n \nAs a Cisco information specialist for ten years: \n•\tManaged complex knowledge management programs cross functionally, resulting in success for all those involved. \n•\tInitiated effective customer experience and satisfaction programs, including usability testing. Used in-house web analytics to gauge effectiveness, internally and externally. \n•\tConceived, architected, and implemented business scenario docs for key new feature sets, extending information development cycle beyond first customer ship to reflect customer and field experience. \n•\tAllied with technical support Customer Service Engineers to initiate a formal review program that resulted in CSEs providing doc content as well as comments, thereby improving the information provided to customers. \n•\tSupervised global writing team \n\tDocumentation project manager for numerous cross-functional teams \nAs information architect and writer: \n•\tQuickly mastered complex Cisco IOS features to write documentation about voice over IP, telephony routing, SIP, and other complex voice and telephony products. \n•\tParticipated in a group to help specify XML content management solutions and authoring tools. \n•\tDeveloped writing process handbook and checklists for writers and editors.  \n•\tWorked with a select team in designing Cisco’s support, web management design, and documentation knowledge bases on its website. \n•\tCreated lab procedures to test software for documentation purposes. \n•\tImproved process and technical training for new hires. Senior Technical Writer, Information Architect, Documentation Manager Cisco Systems November 1998  –  December 2008  (10 years 2 months) San Jose, CA Worked with customers, engineers, writers and editors to document software implementing packet voice over IP with voice, video, and telephony features; internetworking operating system software with a command-line interface; supervised documentation for APIs and scripting languages aimed at developers and partners who created applications that interwork with Cisco voice hardware. Audiences were network designers, network operating engineers, and software developers. \n \nAs a Cisco information specialist for ten years: \n•\tManaged complex knowledge management programs cross functionally, resulting in success for all those involved. \n•\tInitiated effective customer experience and satisfaction programs, including usability testing. Used in-house web analytics to gauge effectiveness, internally and externally. \n•\tConceived, architected, and implemented business scenario docs for key new feature sets, extending information development cycle beyond first customer ship to reflect customer and field experience. \n•\tAllied with technical support Customer Service Engineers to initiate a formal review program that resulted in CSEs providing doc content as well as comments, thereby improving the information provided to customers. \n•\tSupervised global writing team \n\tDocumentation project manager for numerous cross-functional teams \nAs information architect and writer: \n•\tQuickly mastered complex Cisco IOS features to write documentation about voice over IP, telephony routing, SIP, and other complex voice and telephony products. \n•\tParticipated in a group to help specify XML content management solutions and authoring tools. \n•\tDeveloped writing process handbook and checklists for writers and editors.  \n•\tWorked with a select team in designing Cisco’s support, web management design, and documentation knowledge bases on its website. \n•\tCreated lab procedures to test software for documentation purposes. \n•\tImproved process and technical training for new hires. Documentation project manager, Senior Technical Writer Lucent Technologies January 1993  –  October 1998  (5 years 10 months) Documentation project manager, Senior Technical Writer Lucent Technologies January 1993  –  October 1998  (5 years 10 months) Publishing Director Ashton-Tate 1982  –  1988  (6 years) Publishing Director Ashton-Tate 1982  –  1988  (6 years) Languages French Native or bilingual proficiency French Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Skills XML Multimedia Editing CMS WebEx FrameMaker Technical Documentation SnagIt Software Documentation Wikis Telecommunications Adobe Acrobat Visio Captivate Content Development Information Design Training SharePoint Web Content Usability Process Improvement Coaching User Experience Technical Communication DITA Content Management Manuals Quality Control Technical Writing Protocol Content Strategy Cross-functional Team... Instructional Design Web Content Management Video Conferencing White Papers User Interface Recruiting Single Sourcing Requirements Analysis Internal Communications Communication Protocols Usability Testing Budgets SGML Online Help Cloud Computing Program Management Information Architecture Networking See 35+     See less Skills  XML Multimedia Editing CMS WebEx FrameMaker Technical Documentation SnagIt Software Documentation Wikis Telecommunications Adobe Acrobat Visio Captivate Content Development Information Design Training SharePoint Web Content Usability Process Improvement Coaching User Experience Technical Communication DITA Content Management Manuals Quality Control Technical Writing Protocol Content Strategy Cross-functional Team... Instructional Design Web Content Management Video Conferencing White Papers User Interface Recruiting Single Sourcing Requirements Analysis Internal Communications Communication Protocols Usability Testing Budgets SGML Online Help Cloud Computing Program Management Information Architecture Networking See 35+     See less XML Multimedia Editing CMS WebEx FrameMaker Technical Documentation SnagIt Software Documentation Wikis Telecommunications Adobe Acrobat Visio Captivate Content Development Information Design Training SharePoint Web Content Usability Process Improvement Coaching User Experience Technical Communication DITA Content Management Manuals Quality Control Technical Writing Protocol Content Strategy Cross-functional Team... Instructional Design Web Content Management Video Conferencing White Papers User Interface Recruiting Single Sourcing Requirements Analysis Internal Communications Communication Protocols Usability Testing Budgets SGML Online Help Cloud Computing Program Management Information Architecture Networking See 35+     See less XML Multimedia Editing CMS WebEx FrameMaker Technical Documentation SnagIt Software Documentation Wikis Telecommunications Adobe Acrobat Visio Captivate Content Development Information Design Training SharePoint Web Content Usability Process Improvement Coaching User Experience Technical Communication DITA Content Management Manuals Quality Control Technical Writing Protocol Content Strategy Cross-functional Team... Instructional Design Web Content Management Video Conferencing White Papers User Interface Recruiting Single Sourcing Requirements Analysis Internal Communications Communication Protocols Usability Testing Budgets SGML Online Help Cloud Computing Program Management Information Architecture Networking See 35+     See less Education University of North Carolina at Chapel Hill BFA,  Art University of North Carolina at Chapel Hill BFA,  Art University of North Carolina at Chapel Hill BFA,  Art University of North Carolina at Chapel Hill BFA,  Art Honors & Awards Distinguished Technical Communicator (world-wide) Society of Technical Communications October 1994 Designed and helped execute a Systems Administrator Guide for a telephony product, with content based on customer input. Distinguished Technical Communicator (world-wide) Society of Technical Communications October 1994 Designed and helped execute a Systems Administrator Guide for a telephony product, with content based on customer input. Distinguished Technical Communicator (world-wide) Society of Technical Communications October 1994 Designed and helped execute a Systems Administrator Guide for a telephony product, with content based on customer input. Distinguished Technical Communicator (world-wide) Society of Technical Communications October 1994 Designed and helped execute a Systems Administrator Guide for a telephony product, with content based on customer input. ", "Summary Jean Anderson is a highly influential, results-driven, business continuity/disaster recovery (BC/DR) leader with a passion for empowering companies and communities to maintain continuous operations and respond quickly and successfully during catastrophic disasters. \n \nLeveraging a dynamic combination of leadership in disaster prevention, response and mitigation and deep technical expertise, Anderson is a Certified Business Continuity Professional with years of proven success using the latest best-in-class technologies, architecture, best practices and process solutions to protect corporate data and revenue for companies worldwide. \n \nAs a respected thought leader and subject matter expert, she is known as an enthusiastic advocate for BC/DR among both internal and external communities, as well as a strong collaborator across diverse stakeholders - including community, government and non-profit entities. \n \nA quality-driven manager with a reputation for organization and efficiency in high-pressure, deadline-driven, rapidly changing environments, she excels at creating and managing program plans and leading high-performing teams to achieve exceptional results. Summary Jean Anderson is a highly influential, results-driven, business continuity/disaster recovery (BC/DR) leader with a passion for empowering companies and communities to maintain continuous operations and respond quickly and successfully during catastrophic disasters. \n \nLeveraging a dynamic combination of leadership in disaster prevention, response and mitigation and deep technical expertise, Anderson is a Certified Business Continuity Professional with years of proven success using the latest best-in-class technologies, architecture, best practices and process solutions to protect corporate data and revenue for companies worldwide. \n \nAs a respected thought leader and subject matter expert, she is known as an enthusiastic advocate for BC/DR among both internal and external communities, as well as a strong collaborator across diverse stakeholders - including community, government and non-profit entities. \n \nA quality-driven manager with a reputation for organization and efficiency in high-pressure, deadline-driven, rapidly changing environments, she excels at creating and managing program plans and leading high-performing teams to achieve exceptional results. Jean Anderson is a highly influential, results-driven, business continuity/disaster recovery (BC/DR) leader with a passion for empowering companies and communities to maintain continuous operations and respond quickly and successfully during catastrophic disasters. \n \nLeveraging a dynamic combination of leadership in disaster prevention, response and mitigation and deep technical expertise, Anderson is a Certified Business Continuity Professional with years of proven success using the latest best-in-class technologies, architecture, best practices and process solutions to protect corporate data and revenue for companies worldwide. \n \nAs a respected thought leader and subject matter expert, she is known as an enthusiastic advocate for BC/DR among both internal and external communities, as well as a strong collaborator across diverse stakeholders - including community, government and non-profit entities. \n \nA quality-driven manager with a reputation for organization and efficiency in high-pressure, deadline-driven, rapidly changing environments, she excels at creating and managing program plans and leading high-performing teams to achieve exceptional results. Jean Anderson is a highly influential, results-driven, business continuity/disaster recovery (BC/DR) leader with a passion for empowering companies and communities to maintain continuous operations and respond quickly and successfully during catastrophic disasters. \n \nLeveraging a dynamic combination of leadership in disaster prevention, response and mitigation and deep technical expertise, Anderson is a Certified Business Continuity Professional with years of proven success using the latest best-in-class technologies, architecture, best practices and process solutions to protect corporate data and revenue for companies worldwide. \n \nAs a respected thought leader and subject matter expert, she is known as an enthusiastic advocate for BC/DR among both internal and external communities, as well as a strong collaborator across diverse stakeholders - including community, government and non-profit entities. \n \nA quality-driven manager with a reputation for organization and efficiency in high-pressure, deadline-driven, rapidly changing environments, she excels at creating and managing program plans and leading high-performing teams to achieve exceptional results. Experience IT Resiliency Operations Service Manager Cisco November 2012  – Present (2 years 10 months) San Jose, CA Directs a large virtual team of Cisco IT partners in managing best-in-class IT business resiliency and disaster recovery programs that protect Cisco’s global business.  \n \nPartners with key IT leaders and BC/DR champions from multiple functional groups, to manage development of best-in-class resiliency programs and best practices. Thought leader in business process analysis, decision-making, and key business initiatives. Building collaborative relationships within a large, matrixed organization, and acknowledged as BC/DR subject matter expert within Cisco IT, the BC/DR industry, and as an active leader in BC/DR working groups.  \n \nKEY CONTRIBUTIONS: \n \n► Guided development and deployment of best-in-class BC/DR architecture, best practices, infrastructure build-out, BC/DR adoption and compliance validation processes, and the launch of the Cisco IT resiliency operations service \n \n► Architected Cisco IT BC/DR Compliance Validation testing strategy by analyzing requirements and managing development of standard policies, process, procedures to emulate business interruptions and minimize production planned down time \n \n► Introduced programs to mitigate business continuity risks to people, processes, and technology across Cisco IT  \n \n► Spearheaded development of a standardized BC/DR adoption process across the global Cisco IT organization \n \n► Supported business development of IT resiliency operations service through leading partnerships across Cisco IT \n \n► Active member of the Cisco Emergency Response Team and Cisco Disaster Incident Response Team  \n \n► Managed application of BC/DR solutions that produce tangible business results including substantial reduction in planned production down times \n \n► Selected as IT Resiliency Subject Matter Expert (SME) to present Executive Briefing Conferences to Cisco Customers \n \n► Selected to lead the Cisco IT Availability Management program across all of Cisco IT Business Continuity Disaster Recovery Consultant Anderson Project Management Services May 2010  – Present (5 years 4 months) Aptos, CA Business Continuity and Disaster Recovery consultant providing resiliency planning with comprehensive solutions for people and data. Plan to prevent, mitigate, survive, respond, recover, and restore normal services as soon as possible. Planning to respond together encourages teamwork that improves daily operations and morale. \n \nDISASTER SURVIVAL AND RESPONSE PLANS, TRAINING, AND SUPPORT \n \n► Designed and developed content for Disaster Recovery and Business Continuity web sites including: www.seascapecert.org and www.santacruzready.org.  \n \n► Developed these Disaster Survival, Response, Recover, and Restore Services training/response materials:  \n \n► Santa Cruz County Disaster Survival PowerPoint  \n \n► Household, street, office, and neighborhood disaster surveys vetted and approved for disaster reporting  \n \n► Disaster Survival planning, response, recovery, and restoration of services documents.  \n \n► Designed www.seascapecert.org web site, managed development of web site, and wrote content on the site. Disaster Planning & Response Project Manager - Seascape CERT US Department of Homeland Security October 2001  – Present (13 years 11 months) Aptos, CA Leadership role in Community Emergency Response Team (CERT) that prepares and trains our Seascape community to respond and recover quickly from emergency incidents or disasters.  \n \nKEY CONTRIBUTIONS: \n \n► Developed and provided free disaster planning toolkits for community members.  \n \n► Designed and developed content for disaster recovery and business continuity website (SeascapeCERT.org)  \n \n► Contributed to growth of trained team that was recognized as two-time champions of CERT competitions Business Continuity / Disaster Recovery Program Manager Cisco 2010  –  2012  (2 years) San Jose, CA As overall Program Manager at Cisco (through CH Reynolds), oversaw program schedule, resources, and costing; capacity planning; risk assessment and mitigation; testing; project gate approvals; and data center builds. \n \nManaged development and deployment of standard best-in-class BC/DR solutions, including: \n \n► Cisco IT Data Center Application Resiliency Recovery and Compliance Validation Plans \n \n► Cisco IT Data Center Middleware Recovery and Compliance Validation Plans \n \n► Cisco IT internal and external Resiliency Recovery and Compliance Validation Plans \n \n► Cisco IT BC/DR Resiliency Compliance Validation Test Cases that minimize production down time \n \n \nKEY CONTRIBUTIONS: \n \n► Served as Cisco IT Program Testing Manager for multi-million dollar BC/DR program, overseeing builds and resiliency compliance validations for best-in-class innovative re-use data center including VMware, Oracle, NetApp, EMC, and Cisco UCS and networking. \n \n► Validated the BC/DR re-use data center disaster recovery solution and the Cisco disaster response plan from incident start through restoration of services in the data center \n \n► Trained member of the Cisco Disaster Incident Response Team; First Aid and CPR certified Disaster Recovery Business Representative & Program Manager Santa Cruz County Emergency Coordinating Committee 2007  –  2011  (4 years) Santa Cruz, CA Participated in management and coordination of disaster planning for disaster mitigation and recovery for all County public safety agencies. Project manager for team who developed free emergency services information portal (SantaCruzReady.com). Developed disaster survival planning, response, recovery, and restoration of services training/response materials including Santa Cruz County disaster survival PowerPoint. Senior Data Center Operations Project Manager Adify Corporation October 2008  –  July 2010  (1 year 10 months) San Bruno, CA Managed operations projects in redundant data centers, processing millions of ad clicks and impressions for this online media advertising company. With oversight for deployment, testing, and updating of major platform releases, assessed and addressed release risks for project stakeholders and implemented best-practice plans and processes to drive on-time completion of projects. \n \nGuided the implementation of diverse initiatives, including: \n \n► BC/DR Data Center Operations Program & Projects \n \n► Data Center Systems Software & Hardware Upgrades \n \n► NetOPS Wiki/Shared Storage Content Projects\t \n \n► Online Media Audit Project \n \n \nKEY CONTRIBUTIONS: \n \n► Designed, developed, and implemented disaster recovery/business continuity program for data center platform operations, providing protection for the Adify revenue-generating platform in all data centers \n \n► Managed corporate-wide audit project enabling Adify to pass multiple industry audits for the first time ever \n \n► Created and integrated cohesive software release launch policies and procedures for the Adify platform  \n \n► Engineered deployment system for release test environments across 10 online media ad platform development networks and for multiple IT groups (engineering, QA, API development, pre-production, etc.) Disaster Recovery / Business Continuity Program Manager Community Action Board of Santa Cruz County October 2007  –  October 2008  (1 year 1 month) Santa Cruz, CA Developed DR/BC program including an overall corporate disaster plan and custom plans for 7 diverse agencies. Program scope included staff DR/BC workshop, custom Incident Command System (ICS), and corporate Community Emergency Response Team (CERT). Established business continuity policies and procedures for corporate and all 7 agencies that included asset inventory, emergency contacts, damage assessment, recovery, and community outreach. Project Manager / Technical Business Analyst SHOP•COM August 2006  –  May 2008  (1 year 10 months) Project Manager for online shopping standard policies and procedures project including accounting and billing inputs, reporting analysis, and standardization of data fields for reports. Developed Payment Card Industry (PCI) Data Security compliance policies and procedures for PCI audit. Defined and managed all project deliverables. Senior Project Manager & Content Developer Anderson Writing Services February 1988  –  January 2008  (20 years) As a certified Project Manager, managed content development and product development programs in deadline-driven and rapidly changing environments, delivering quality results on schedule. technical content development consulting services. Graduate and Alumni Leadership Santa Cruz County 2006  –  2007  (1 year) Project Manager for project team who developed the Disaster Recovery and Business Continuity plan, contributed disaster supplies, successfully deployed the plan for the Aptos Chamber of Commerce, and trained the staff. Content Project Lead Microsoft TV 2005  –  May 2006  (1 year) As Content Project Lead for MSTV's Foundation Project Team, held responsibility for entire content release deliverable including designing, launching, installing, and configuring networks for Microsoft TV products. Developed MSTV/Comcast data center operations policies and procedures for Planning, Backup/Restore, Monitoring/Troubleshooting, Operations Reference, Disaster Recovery/Business Continuity, and Security. Author Lighthouse Publishing 2000  –  2005  (5 years) Published author of the empowering “Hannah & Niki Mysteries” for 10- to 14-year-old girls. Portal Project Manager Cisco August 2001  –  June 2002  (11 months) As part of the Cisco Hosted Applications Initiative team, managed design, development, launch, and updates of Cisco project web site and wrote most of the content with technical and business SMEs. Managed remote web development team and successfully consolidated all critical project information with efficient access and retrieval for Cisco internal and external partners, resulting in improved project satisfaction and performance metrics. \n \nPrimary deliverables included: \n \n► Cisco project web site including project, technical and business content \n \n► Technology and business White Papers on hosted applications project / business approach \n \n► Standard specification templates used by internal / external engineers and business partners \n \n► Internal design and functional technical specifications for the hosted applications project Senior Technical Writer Palm 1998  –  2001  (3 years) Developed Software Development Kit (SDK) and Conduit Development Kit (CDK) documentation for external development partners. Lead Technical Writer 3Com Corporation 1985  –  2000  (15 years) Developed extensive technical content for U.S. and international customers for multiple 3Com products. Applied networking expertise and award-winning writing skills to make direct contributions to increased sales, higher customer satisfaction, and decreased customer support costs. Project team content lead and managed documentation deliverables for the project. Honored with international writing awards for technical manuals, earning publicity and increasing sales for 3Com. \n \nPrimary deliverables included: \n \n► Quick Starts  \n \n► Help Systems \n \n► ENG Specifications  \n \n► Web Content  \n \n► Software Applications Content  \n \n► Developer Content Senior Technical Writer Cisco 1998  –  1999  (1 year) Developed highly technical Cisco IOS release content for System Administrators, deployment launch staff, and Cisco release training. American Red Cross Disaster Services Leadership American Red Cross January 1982  –  1995  (13 years) USA RED CROSS DISASTER RESPONSE LEADERSHIP ROLES \n \n► American Red Cross (ARC) Emergency Services Chairperson - San Mateo County  \n \n► American Red Cross (ARC) San Mateo County Board of Directors \n \n► American Red Cross (ARC) SFO Disaster Action Team Leader \n \n► American Red Cross (ARC) Disaster Action Team Leader \n \n► American Red Cross (ARC) Santa Cruz County Board of Directors \n \n \nRED CROSS DISASTER RESPONSE TRAINING DEVELOPMENT \n \nDeveloped these Red Cross Disaster Survival, Response, Recover, & Restore Services training/response materials:  \n \n► San Mateo County American Red Cross Disaster Response Plan  \n \n► San Mateo American Red Cross Disaster Action Team Response Training  \n \n► San Mateo American Red Cross Disaster Action Team Response Handbook  \n \n► San Mateo American Red Cross Air Crash Disaster Training and Air Crash Disaster Handbook  \n \n► San Mateo American Red Cross Disaster Shelter Manager Guide update.  \n \n \nAMERICAN RED CROSS DISASTER RESPONSE LEADERSHIP EXPERIENCE  \n \n► Santa Cruz Floods – Red Cross Disaster Services Administration, Damage Assessment, Mass Care  \n \n► Alviso Floods - Mobile Canteen  \n \n► Civil Air Patrol Search and Rescue - Mass Care for Drills - Alturas  \n \n► Lexington Fires Los Gatos High School - Shelter Manager  \n \n► SFO Airport Disaster Drills  \n \n► Loma Prieta Earthquake - Santa Cruz Civic Center Shelter Manager  \n \n► Silicon Valley Team Project Manager: American Red Cross Disaster Reporting Database IT Resiliency Operations Service Manager Cisco November 2012  – Present (2 years 10 months) San Jose, CA Directs a large virtual team of Cisco IT partners in managing best-in-class IT business resiliency and disaster recovery programs that protect Cisco’s global business.  \n \nPartners with key IT leaders and BC/DR champions from multiple functional groups, to manage development of best-in-class resiliency programs and best practices. Thought leader in business process analysis, decision-making, and key business initiatives. Building collaborative relationships within a large, matrixed organization, and acknowledged as BC/DR subject matter expert within Cisco IT, the BC/DR industry, and as an active leader in BC/DR working groups.  \n \nKEY CONTRIBUTIONS: \n \n► Guided development and deployment of best-in-class BC/DR architecture, best practices, infrastructure build-out, BC/DR adoption and compliance validation processes, and the launch of the Cisco IT resiliency operations service \n \n► Architected Cisco IT BC/DR Compliance Validation testing strategy by analyzing requirements and managing development of standard policies, process, procedures to emulate business interruptions and minimize production planned down time \n \n► Introduced programs to mitigate business continuity risks to people, processes, and technology across Cisco IT  \n \n► Spearheaded development of a standardized BC/DR adoption process across the global Cisco IT organization \n \n► Supported business development of IT resiliency operations service through leading partnerships across Cisco IT \n \n► Active member of the Cisco Emergency Response Team and Cisco Disaster Incident Response Team  \n \n► Managed application of BC/DR solutions that produce tangible business results including substantial reduction in planned production down times \n \n► Selected as IT Resiliency Subject Matter Expert (SME) to present Executive Briefing Conferences to Cisco Customers \n \n► Selected to lead the Cisco IT Availability Management program across all of Cisco IT IT Resiliency Operations Service Manager Cisco November 2012  – Present (2 years 10 months) San Jose, CA Directs a large virtual team of Cisco IT partners in managing best-in-class IT business resiliency and disaster recovery programs that protect Cisco’s global business.  \n \nPartners with key IT leaders and BC/DR champions from multiple functional groups, to manage development of best-in-class resiliency programs and best practices. Thought leader in business process analysis, decision-making, and key business initiatives. Building collaborative relationships within a large, matrixed organization, and acknowledged as BC/DR subject matter expert within Cisco IT, the BC/DR industry, and as an active leader in BC/DR working groups.  \n \nKEY CONTRIBUTIONS: \n \n► Guided development and deployment of best-in-class BC/DR architecture, best practices, infrastructure build-out, BC/DR adoption and compliance validation processes, and the launch of the Cisco IT resiliency operations service \n \n► Architected Cisco IT BC/DR Compliance Validation testing strategy by analyzing requirements and managing development of standard policies, process, procedures to emulate business interruptions and minimize production planned down time \n \n► Introduced programs to mitigate business continuity risks to people, processes, and technology across Cisco IT  \n \n► Spearheaded development of a standardized BC/DR adoption process across the global Cisco IT organization \n \n► Supported business development of IT resiliency operations service through leading partnerships across Cisco IT \n \n► Active member of the Cisco Emergency Response Team and Cisco Disaster Incident Response Team  \n \n► Managed application of BC/DR solutions that produce tangible business results including substantial reduction in planned production down times \n \n► Selected as IT Resiliency Subject Matter Expert (SME) to present Executive Briefing Conferences to Cisco Customers \n \n► Selected to lead the Cisco IT Availability Management program across all of Cisco IT Business Continuity Disaster Recovery Consultant Anderson Project Management Services May 2010  – Present (5 years 4 months) Aptos, CA Business Continuity and Disaster Recovery consultant providing resiliency planning with comprehensive solutions for people and data. Plan to prevent, mitigate, survive, respond, recover, and restore normal services as soon as possible. Planning to respond together encourages teamwork that improves daily operations and morale. \n \nDISASTER SURVIVAL AND RESPONSE PLANS, TRAINING, AND SUPPORT \n \n► Designed and developed content for Disaster Recovery and Business Continuity web sites including: www.seascapecert.org and www.santacruzready.org.  \n \n► Developed these Disaster Survival, Response, Recover, and Restore Services training/response materials:  \n \n► Santa Cruz County Disaster Survival PowerPoint  \n \n► Household, street, office, and neighborhood disaster surveys vetted and approved for disaster reporting  \n \n► Disaster Survival planning, response, recovery, and restoration of services documents.  \n \n► Designed www.seascapecert.org web site, managed development of web site, and wrote content on the site. Business Continuity Disaster Recovery Consultant Anderson Project Management Services May 2010  – Present (5 years 4 months) Aptos, CA Business Continuity and Disaster Recovery consultant providing resiliency planning with comprehensive solutions for people and data. Plan to prevent, mitigate, survive, respond, recover, and restore normal services as soon as possible. Planning to respond together encourages teamwork that improves daily operations and morale. \n \nDISASTER SURVIVAL AND RESPONSE PLANS, TRAINING, AND SUPPORT \n \n► Designed and developed content for Disaster Recovery and Business Continuity web sites including: www.seascapecert.org and www.santacruzready.org.  \n \n► Developed these Disaster Survival, Response, Recover, and Restore Services training/response materials:  \n \n► Santa Cruz County Disaster Survival PowerPoint  \n \n► Household, street, office, and neighborhood disaster surveys vetted and approved for disaster reporting  \n \n► Disaster Survival planning, response, recovery, and restoration of services documents.  \n \n► Designed www.seascapecert.org web site, managed development of web site, and wrote content on the site. Disaster Planning & Response Project Manager - Seascape CERT US Department of Homeland Security October 2001  – Present (13 years 11 months) Aptos, CA Leadership role in Community Emergency Response Team (CERT) that prepares and trains our Seascape community to respond and recover quickly from emergency incidents or disasters.  \n \nKEY CONTRIBUTIONS: \n \n► Developed and provided free disaster planning toolkits for community members.  \n \n► Designed and developed content for disaster recovery and business continuity website (SeascapeCERT.org)  \n \n► Contributed to growth of trained team that was recognized as two-time champions of CERT competitions Disaster Planning & Response Project Manager - Seascape CERT US Department of Homeland Security October 2001  – Present (13 years 11 months) Aptos, CA Leadership role in Community Emergency Response Team (CERT) that prepares and trains our Seascape community to respond and recover quickly from emergency incidents or disasters.  \n \nKEY CONTRIBUTIONS: \n \n► Developed and provided free disaster planning toolkits for community members.  \n \n► Designed and developed content for disaster recovery and business continuity website (SeascapeCERT.org)  \n \n► Contributed to growth of trained team that was recognized as two-time champions of CERT competitions Business Continuity / Disaster Recovery Program Manager Cisco 2010  –  2012  (2 years) San Jose, CA As overall Program Manager at Cisco (through CH Reynolds), oversaw program schedule, resources, and costing; capacity planning; risk assessment and mitigation; testing; project gate approvals; and data center builds. \n \nManaged development and deployment of standard best-in-class BC/DR solutions, including: \n \n► Cisco IT Data Center Application Resiliency Recovery and Compliance Validation Plans \n \n► Cisco IT Data Center Middleware Recovery and Compliance Validation Plans \n \n► Cisco IT internal and external Resiliency Recovery and Compliance Validation Plans \n \n► Cisco IT BC/DR Resiliency Compliance Validation Test Cases that minimize production down time \n \n \nKEY CONTRIBUTIONS: \n \n► Served as Cisco IT Program Testing Manager for multi-million dollar BC/DR program, overseeing builds and resiliency compliance validations for best-in-class innovative re-use data center including VMware, Oracle, NetApp, EMC, and Cisco UCS and networking. \n \n► Validated the BC/DR re-use data center disaster recovery solution and the Cisco disaster response plan from incident start through restoration of services in the data center \n \n► Trained member of the Cisco Disaster Incident Response Team; First Aid and CPR certified Business Continuity / Disaster Recovery Program Manager Cisco 2010  –  2012  (2 years) San Jose, CA As overall Program Manager at Cisco (through CH Reynolds), oversaw program schedule, resources, and costing; capacity planning; risk assessment and mitigation; testing; project gate approvals; and data center builds. \n \nManaged development and deployment of standard best-in-class BC/DR solutions, including: \n \n► Cisco IT Data Center Application Resiliency Recovery and Compliance Validation Plans \n \n► Cisco IT Data Center Middleware Recovery and Compliance Validation Plans \n \n► Cisco IT internal and external Resiliency Recovery and Compliance Validation Plans \n \n► Cisco IT BC/DR Resiliency Compliance Validation Test Cases that minimize production down time \n \n \nKEY CONTRIBUTIONS: \n \n► Served as Cisco IT Program Testing Manager for multi-million dollar BC/DR program, overseeing builds and resiliency compliance validations for best-in-class innovative re-use data center including VMware, Oracle, NetApp, EMC, and Cisco UCS and networking. \n \n► Validated the BC/DR re-use data center disaster recovery solution and the Cisco disaster response plan from incident start through restoration of services in the data center \n \n► Trained member of the Cisco Disaster Incident Response Team; First Aid and CPR certified Disaster Recovery Business Representative & Program Manager Santa Cruz County Emergency Coordinating Committee 2007  –  2011  (4 years) Santa Cruz, CA Participated in management and coordination of disaster planning for disaster mitigation and recovery for all County public safety agencies. Project manager for team who developed free emergency services information portal (SantaCruzReady.com). Developed disaster survival planning, response, recovery, and restoration of services training/response materials including Santa Cruz County disaster survival PowerPoint. Disaster Recovery Business Representative & Program Manager Santa Cruz County Emergency Coordinating Committee 2007  –  2011  (4 years) Santa Cruz, CA Participated in management and coordination of disaster planning for disaster mitigation and recovery for all County public safety agencies. Project manager for team who developed free emergency services information portal (SantaCruzReady.com). Developed disaster survival planning, response, recovery, and restoration of services training/response materials including Santa Cruz County disaster survival PowerPoint. Senior Data Center Operations Project Manager Adify Corporation October 2008  –  July 2010  (1 year 10 months) San Bruno, CA Managed operations projects in redundant data centers, processing millions of ad clicks and impressions for this online media advertising company. With oversight for deployment, testing, and updating of major platform releases, assessed and addressed release risks for project stakeholders and implemented best-practice plans and processes to drive on-time completion of projects. \n \nGuided the implementation of diverse initiatives, including: \n \n► BC/DR Data Center Operations Program & Projects \n \n► Data Center Systems Software & Hardware Upgrades \n \n► NetOPS Wiki/Shared Storage Content Projects\t \n \n► Online Media Audit Project \n \n \nKEY CONTRIBUTIONS: \n \n► Designed, developed, and implemented disaster recovery/business continuity program for data center platform operations, providing protection for the Adify revenue-generating platform in all data centers \n \n► Managed corporate-wide audit project enabling Adify to pass multiple industry audits for the first time ever \n \n► Created and integrated cohesive software release launch policies and procedures for the Adify platform  \n \n► Engineered deployment system for release test environments across 10 online media ad platform development networks and for multiple IT groups (engineering, QA, API development, pre-production, etc.) Senior Data Center Operations Project Manager Adify Corporation October 2008  –  July 2010  (1 year 10 months) San Bruno, CA Managed operations projects in redundant data centers, processing millions of ad clicks and impressions for this online media advertising company. With oversight for deployment, testing, and updating of major platform releases, assessed and addressed release risks for project stakeholders and implemented best-practice plans and processes to drive on-time completion of projects. \n \nGuided the implementation of diverse initiatives, including: \n \n► BC/DR Data Center Operations Program & Projects \n \n► Data Center Systems Software & Hardware Upgrades \n \n► NetOPS Wiki/Shared Storage Content Projects\t \n \n► Online Media Audit Project \n \n \nKEY CONTRIBUTIONS: \n \n► Designed, developed, and implemented disaster recovery/business continuity program for data center platform operations, providing protection for the Adify revenue-generating platform in all data centers \n \n► Managed corporate-wide audit project enabling Adify to pass multiple industry audits for the first time ever \n \n► Created and integrated cohesive software release launch policies and procedures for the Adify platform  \n \n► Engineered deployment system for release test environments across 10 online media ad platform development networks and for multiple IT groups (engineering, QA, API development, pre-production, etc.) Disaster Recovery / Business Continuity Program Manager Community Action Board of Santa Cruz County October 2007  –  October 2008  (1 year 1 month) Santa Cruz, CA Developed DR/BC program including an overall corporate disaster plan and custom plans for 7 diverse agencies. Program scope included staff DR/BC workshop, custom Incident Command System (ICS), and corporate Community Emergency Response Team (CERT). Established business continuity policies and procedures for corporate and all 7 agencies that included asset inventory, emergency contacts, damage assessment, recovery, and community outreach. Disaster Recovery / Business Continuity Program Manager Community Action Board of Santa Cruz County October 2007  –  October 2008  (1 year 1 month) Santa Cruz, CA Developed DR/BC program including an overall corporate disaster plan and custom plans for 7 diverse agencies. Program scope included staff DR/BC workshop, custom Incident Command System (ICS), and corporate Community Emergency Response Team (CERT). Established business continuity policies and procedures for corporate and all 7 agencies that included asset inventory, emergency contacts, damage assessment, recovery, and community outreach. Project Manager / Technical Business Analyst SHOP•COM August 2006  –  May 2008  (1 year 10 months) Project Manager for online shopping standard policies and procedures project including accounting and billing inputs, reporting analysis, and standardization of data fields for reports. Developed Payment Card Industry (PCI) Data Security compliance policies and procedures for PCI audit. Defined and managed all project deliverables. Project Manager / Technical Business Analyst SHOP•COM August 2006  –  May 2008  (1 year 10 months) Project Manager for online shopping standard policies and procedures project including accounting and billing inputs, reporting analysis, and standardization of data fields for reports. Developed Payment Card Industry (PCI) Data Security compliance policies and procedures for PCI audit. Defined and managed all project deliverables. Senior Project Manager & Content Developer Anderson Writing Services February 1988  –  January 2008  (20 years) As a certified Project Manager, managed content development and product development programs in deadline-driven and rapidly changing environments, delivering quality results on schedule. technical content development consulting services. Senior Project Manager & Content Developer Anderson Writing Services February 1988  –  January 2008  (20 years) As a certified Project Manager, managed content development and product development programs in deadline-driven and rapidly changing environments, delivering quality results on schedule. technical content development consulting services. Graduate and Alumni Leadership Santa Cruz County 2006  –  2007  (1 year) Project Manager for project team who developed the Disaster Recovery and Business Continuity plan, contributed disaster supplies, successfully deployed the plan for the Aptos Chamber of Commerce, and trained the staff. Graduate and Alumni Leadership Santa Cruz County 2006  –  2007  (1 year) Project Manager for project team who developed the Disaster Recovery and Business Continuity plan, contributed disaster supplies, successfully deployed the plan for the Aptos Chamber of Commerce, and trained the staff. Content Project Lead Microsoft TV 2005  –  May 2006  (1 year) As Content Project Lead for MSTV's Foundation Project Team, held responsibility for entire content release deliverable including designing, launching, installing, and configuring networks for Microsoft TV products. Developed MSTV/Comcast data center operations policies and procedures for Planning, Backup/Restore, Monitoring/Troubleshooting, Operations Reference, Disaster Recovery/Business Continuity, and Security. Content Project Lead Microsoft TV 2005  –  May 2006  (1 year) As Content Project Lead for MSTV's Foundation Project Team, held responsibility for entire content release deliverable including designing, launching, installing, and configuring networks for Microsoft TV products. Developed MSTV/Comcast data center operations policies and procedures for Planning, Backup/Restore, Monitoring/Troubleshooting, Operations Reference, Disaster Recovery/Business Continuity, and Security. Author Lighthouse Publishing 2000  –  2005  (5 years) Published author of the empowering “Hannah & Niki Mysteries” for 10- to 14-year-old girls. Author Lighthouse Publishing 2000  –  2005  (5 years) Published author of the empowering “Hannah & Niki Mysteries” for 10- to 14-year-old girls. Portal Project Manager Cisco August 2001  –  June 2002  (11 months) As part of the Cisco Hosted Applications Initiative team, managed design, development, launch, and updates of Cisco project web site and wrote most of the content with technical and business SMEs. Managed remote web development team and successfully consolidated all critical project information with efficient access and retrieval for Cisco internal and external partners, resulting in improved project satisfaction and performance metrics. \n \nPrimary deliverables included: \n \n► Cisco project web site including project, technical and business content \n \n► Technology and business White Papers on hosted applications project / business approach \n \n► Standard specification templates used by internal / external engineers and business partners \n \n► Internal design and functional technical specifications for the hosted applications project Portal Project Manager Cisco August 2001  –  June 2002  (11 months) As part of the Cisco Hosted Applications Initiative team, managed design, development, launch, and updates of Cisco project web site and wrote most of the content with technical and business SMEs. Managed remote web development team and successfully consolidated all critical project information with efficient access and retrieval for Cisco internal and external partners, resulting in improved project satisfaction and performance metrics. \n \nPrimary deliverables included: \n \n► Cisco project web site including project, technical and business content \n \n► Technology and business White Papers on hosted applications project / business approach \n \n► Standard specification templates used by internal / external engineers and business partners \n \n► Internal design and functional technical specifications for the hosted applications project Senior Technical Writer Palm 1998  –  2001  (3 years) Developed Software Development Kit (SDK) and Conduit Development Kit (CDK) documentation for external development partners. Senior Technical Writer Palm 1998  –  2001  (3 years) Developed Software Development Kit (SDK) and Conduit Development Kit (CDK) documentation for external development partners. Lead Technical Writer 3Com Corporation 1985  –  2000  (15 years) Developed extensive technical content for U.S. and international customers for multiple 3Com products. Applied networking expertise and award-winning writing skills to make direct contributions to increased sales, higher customer satisfaction, and decreased customer support costs. Project team content lead and managed documentation deliverables for the project. Honored with international writing awards for technical manuals, earning publicity and increasing sales for 3Com. \n \nPrimary deliverables included: \n \n► Quick Starts  \n \n► Help Systems \n \n► ENG Specifications  \n \n► Web Content  \n \n► Software Applications Content  \n \n► Developer Content Lead Technical Writer 3Com Corporation 1985  –  2000  (15 years) Developed extensive technical content for U.S. and international customers for multiple 3Com products. Applied networking expertise and award-winning writing skills to make direct contributions to increased sales, higher customer satisfaction, and decreased customer support costs. Project team content lead and managed documentation deliverables for the project. Honored with international writing awards for technical manuals, earning publicity and increasing sales for 3Com. \n \nPrimary deliverables included: \n \n► Quick Starts  \n \n► Help Systems \n \n► ENG Specifications  \n \n► Web Content  \n \n► Software Applications Content  \n \n► Developer Content Senior Technical Writer Cisco 1998  –  1999  (1 year) Developed highly technical Cisco IOS release content for System Administrators, deployment launch staff, and Cisco release training. Senior Technical Writer Cisco 1998  –  1999  (1 year) Developed highly technical Cisco IOS release content for System Administrators, deployment launch staff, and Cisco release training. American Red Cross Disaster Services Leadership American Red Cross January 1982  –  1995  (13 years) USA RED CROSS DISASTER RESPONSE LEADERSHIP ROLES \n \n► American Red Cross (ARC) Emergency Services Chairperson - San Mateo County  \n \n► American Red Cross (ARC) San Mateo County Board of Directors \n \n► American Red Cross (ARC) SFO Disaster Action Team Leader \n \n► American Red Cross (ARC) Disaster Action Team Leader \n \n► American Red Cross (ARC) Santa Cruz County Board of Directors \n \n \nRED CROSS DISASTER RESPONSE TRAINING DEVELOPMENT \n \nDeveloped these Red Cross Disaster Survival, Response, Recover, & Restore Services training/response materials:  \n \n► San Mateo County American Red Cross Disaster Response Plan  \n \n► San Mateo American Red Cross Disaster Action Team Response Training  \n \n► San Mateo American Red Cross Disaster Action Team Response Handbook  \n \n► San Mateo American Red Cross Air Crash Disaster Training and Air Crash Disaster Handbook  \n \n► San Mateo American Red Cross Disaster Shelter Manager Guide update.  \n \n \nAMERICAN RED CROSS DISASTER RESPONSE LEADERSHIP EXPERIENCE  \n \n► Santa Cruz Floods – Red Cross Disaster Services Administration, Damage Assessment, Mass Care  \n \n► Alviso Floods - Mobile Canteen  \n \n► Civil Air Patrol Search and Rescue - Mass Care for Drills - Alturas  \n \n► Lexington Fires Los Gatos High School - Shelter Manager  \n \n► SFO Airport Disaster Drills  \n \n► Loma Prieta Earthquake - Santa Cruz Civic Center Shelter Manager  \n \n► Silicon Valley Team Project Manager: American Red Cross Disaster Reporting Database American Red Cross Disaster Services Leadership American Red Cross January 1982  –  1995  (13 years) USA RED CROSS DISASTER RESPONSE LEADERSHIP ROLES \n \n► American Red Cross (ARC) Emergency Services Chairperson - San Mateo County  \n \n► American Red Cross (ARC) San Mateo County Board of Directors \n \n► American Red Cross (ARC) SFO Disaster Action Team Leader \n \n► American Red Cross (ARC) Disaster Action Team Leader \n \n► American Red Cross (ARC) Santa Cruz County Board of Directors \n \n \nRED CROSS DISASTER RESPONSE TRAINING DEVELOPMENT \n \nDeveloped these Red Cross Disaster Survival, Response, Recover, & Restore Services training/response materials:  \n \n► San Mateo County American Red Cross Disaster Response Plan  \n \n► San Mateo American Red Cross Disaster Action Team Response Training  \n \n► San Mateo American Red Cross Disaster Action Team Response Handbook  \n \n► San Mateo American Red Cross Air Crash Disaster Training and Air Crash Disaster Handbook  \n \n► San Mateo American Red Cross Disaster Shelter Manager Guide update.  \n \n \nAMERICAN RED CROSS DISASTER RESPONSE LEADERSHIP EXPERIENCE  \n \n► Santa Cruz Floods – Red Cross Disaster Services Administration, Damage Assessment, Mass Care  \n \n► Alviso Floods - Mobile Canteen  \n \n► Civil Air Patrol Search and Rescue - Mass Care for Drills - Alturas  \n \n► Lexington Fires Los Gatos High School - Shelter Manager  \n \n► SFO Airport Disaster Drills  \n \n► Loma Prieta Earthquake - Santa Cruz Civic Center Shelter Manager  \n \n► Silicon Valley Team Project Manager: American Red Cross Disaster Reporting Database Languages   Skills Disaster Recovery Program Management Data Center Security Business Continuity Project Management Integration IT Service Management Software Documentation Cross-functional Team... Cisco Technologies Leadership Vendor Management Management System Administration Strategy VMware Project Planning Team Building Information Technology Quality Assurance IT Management Networking Cloud Computing Incident Management Analysis Software Development IT Strategy SDLC PMO Technical Writing Risk Management PMP Policy Databases Testing Project Portfolio... Juniper Leadership Development Training Business Analysis Business Continuity... Governance Business Process... Enterprise Software Storage Strategic Leadership Team Leadership ITIL Visio See 35+     See less Skills  Disaster Recovery Program Management Data Center Security Business Continuity Project Management Integration IT Service Management Software Documentation Cross-functional Team... Cisco Technologies Leadership Vendor Management Management System Administration Strategy VMware Project Planning Team Building Information Technology Quality Assurance IT Management Networking Cloud Computing Incident Management Analysis Software Development IT Strategy SDLC PMO Technical Writing Risk Management PMP Policy Databases Testing Project Portfolio... Juniper Leadership Development Training Business Analysis Business Continuity... Governance Business Process... Enterprise Software Storage Strategic Leadership Team Leadership ITIL Visio See 35+     See less Disaster Recovery Program Management Data Center Security Business Continuity Project Management Integration IT Service Management Software Documentation Cross-functional Team... Cisco Technologies Leadership Vendor Management Management System Administration Strategy VMware Project Planning Team Building Information Technology Quality Assurance IT Management Networking Cloud Computing Incident Management Analysis Software Development IT Strategy SDLC PMO Technical Writing Risk Management PMP Policy Databases Testing Project Portfolio... Juniper Leadership Development Training Business Analysis Business Continuity... Governance Business Process... Enterprise Software Storage Strategic Leadership Team Leadership ITIL Visio See 35+     See less Disaster Recovery Program Management Data Center Security Business Continuity Project Management Integration IT Service Management Software Documentation Cross-functional Team... Cisco Technologies Leadership Vendor Management Management System Administration Strategy VMware Project Planning Team Building Information Technology Quality Assurance IT Management Networking Cloud Computing Incident Management Analysis Software Development IT Strategy SDLC PMO Technical Writing Risk Management PMP Policy Databases Testing Project Portfolio... Juniper Leadership Development Training Business Analysis Business Continuity... Governance Business Process... Enterprise Software Storage Strategic Leadership Team Leadership ITIL Visio See 35+     See less Education University of California, Santa Cruz Project Management 1988  – 1988 Activities and Societies:  Career Advice Network - Mentor Saint Mary's College of California BA,  Management 1983  – 1988 Merrimack College Psychology 1971  – 1972 East Orange Catholic Girls High School High School,  Graduated 1967  – 1971 Cabrillo College Program and Project Management 2008 Activities and Societies:  Program and Project Management Leadership Santa Cruz County Leadership Ultimate PMP Course Project Management Professional,  Project Management University of California, Santa Cruz Project Management 1988  – 1988 Activities and Societies:  Career Advice Network - Mentor University of California, Santa Cruz Project Management 1988  – 1988 Activities and Societies:  Career Advice Network - Mentor University of California, Santa Cruz Project Management 1988  – 1988 Activities and Societies:  Career Advice Network - Mentor Saint Mary's College of California BA,  Management 1983  – 1988 Saint Mary's College of California BA,  Management 1983  – 1988 Saint Mary's College of California BA,  Management 1983  – 1988 Merrimack College Psychology 1971  – 1972 Merrimack College Psychology 1971  – 1972 Merrimack College Psychology 1971  – 1972 East Orange Catholic Girls High School High School,  Graduated 1967  – 1971 East Orange Catholic Girls High School High School,  Graduated 1967  – 1971 East Orange Catholic Girls High School High School,  Graduated 1967  – 1971 Cabrillo College Program and Project Management 2008 Activities and Societies:  Program and Project Management Cabrillo College Program and Project Management 2008 Activities and Societies:  Program and Project Management Cabrillo College Program and Project Management 2008 Activities and Societies:  Program and Project Management Leadership Santa Cruz County Leadership Leadership Santa Cruz County Leadership Leadership Santa Cruz County Leadership Ultimate PMP Course Project Management Professional,  Project Management Ultimate PMP Course Project Management Professional,  Project Management Ultimate PMP Course Project Management Professional,  Project Management Honors & Awards Cisco Achievement Program award for Business Continuity and Disaster Recovery in Cisco IT Cisco January 2013 Cisco Achievement Program award for innovative Business Continuity and Disaster Recovery data center client engagement with standard repeatable process development, contributions to BC/DR data center enabling technologies, and designing and managing deployment of the new BC/DR operations training center in Cisco IT. Connected Recognition: You Inspire 3 Award Cisco April 2014 Connected Recognition: You Inspire 3 Award - IT Resiliency Operations Service IT Service Manager. Connected Recognition: You Amaze Award Cisco Management March 2014 Connected Recognition: You Amaze Award - for FY15 Planning and IT Resiliency Operations Service strategic development. You Amaze Me 2 Change the World Award Cisco June 2015 This is to recognize your outstanding accomplishment achieving your Certified Business Continuity Auditor certification. You are a true expert in your field adding immense value to Cisco, and ultimately our customers. Additional Honors & Awards ★ Aptos Chamber of Commerce Community Enhancement Award  \n \n★ Disaster Preparedness Leadership Volunteer Honors \n \n★ Alviso Floods - Mobile Canteen – American Red Cross Appreciation Certificate \n \n★ Civil Air Patrol Search and Rescue - Mass Care - Appreciation Certificate \n \n★ Lexington Fires - Shelter Manager – American Red Cross Appreciation Certificate \n \n★ SFO Airport Disaster Drills Leader American Red Cross Appreciation Certificate \n \n★ Loma Prieta Earthquake - Shelter Manager - American Red Cross Appreciation Certificate  \n \n★ American Red Cross Meritorious Volunteer Leadership Award \n \n★ American Red Cross Volunteer of the Year - San Mateo County \n \n★ California Senate Certificate of Recognition. \n \n \nPROFESSIONAL WRITING AWARDS \n \n★ Society for Technical Communication International Writing Award \n \n★ PC Computing MVP Award \n \n★ Computer Retail Week Editor’s Choice Award \n \n★ Society for Technical Communication Distinguished Writing Award \n \n★ Society for Technical Communication Achievement Writing Award Cisco Achievement Program award for Business Continuity and Disaster Recovery in Cisco IT Cisco January 2013 Cisco Achievement Program award for innovative Business Continuity and Disaster Recovery data center client engagement with standard repeatable process development, contributions to BC/DR data center enabling technologies, and designing and managing deployment of the new BC/DR operations training center in Cisco IT. Cisco Achievement Program award for Business Continuity and Disaster Recovery in Cisco IT Cisco January 2013 Cisco Achievement Program award for innovative Business Continuity and Disaster Recovery data center client engagement with standard repeatable process development, contributions to BC/DR data center enabling technologies, and designing and managing deployment of the new BC/DR operations training center in Cisco IT. Cisco Achievement Program award for Business Continuity and Disaster Recovery in Cisco IT Cisco January 2013 Cisco Achievement Program award for innovative Business Continuity and Disaster Recovery data center client engagement with standard repeatable process development, contributions to BC/DR data center enabling technologies, and designing and managing deployment of the new BC/DR operations training center in Cisco IT. Connected Recognition: You Inspire 3 Award Cisco April 2014 Connected Recognition: You Inspire 3 Award - IT Resiliency Operations Service IT Service Manager. Connected Recognition: You Inspire 3 Award Cisco April 2014 Connected Recognition: You Inspire 3 Award - IT Resiliency Operations Service IT Service Manager. Connected Recognition: You Inspire 3 Award Cisco April 2014 Connected Recognition: You Inspire 3 Award - IT Resiliency Operations Service IT Service Manager. Connected Recognition: You Amaze Award Cisco Management March 2014 Connected Recognition: You Amaze Award - for FY15 Planning and IT Resiliency Operations Service strategic development. Connected Recognition: You Amaze Award Cisco Management March 2014 Connected Recognition: You Amaze Award - for FY15 Planning and IT Resiliency Operations Service strategic development. Connected Recognition: You Amaze Award Cisco Management March 2014 Connected Recognition: You Amaze Award - for FY15 Planning and IT Resiliency Operations Service strategic development. You Amaze Me 2 Change the World Award Cisco June 2015 This is to recognize your outstanding accomplishment achieving your Certified Business Continuity Auditor certification. You are a true expert in your field adding immense value to Cisco, and ultimately our customers. You Amaze Me 2 Change the World Award Cisco June 2015 This is to recognize your outstanding accomplishment achieving your Certified Business Continuity Auditor certification. You are a true expert in your field adding immense value to Cisco, and ultimately our customers. You Amaze Me 2 Change the World Award Cisco June 2015 This is to recognize your outstanding accomplishment achieving your Certified Business Continuity Auditor certification. You are a true expert in your field adding immense value to Cisco, and ultimately our customers. Additional Honors & Awards ★ Aptos Chamber of Commerce Community Enhancement Award  \n \n★ Disaster Preparedness Leadership Volunteer Honors \n \n★ Alviso Floods - Mobile Canteen – American Red Cross Appreciation Certificate \n \n★ Civil Air Patrol Search and Rescue - Mass Care - Appreciation Certificate \n \n★ Lexington Fires - Shelter Manager – American Red Cross Appreciation Certificate \n \n★ SFO Airport Disaster Drills Leader American Red Cross Appreciation Certificate \n \n★ Loma Prieta Earthquake - Shelter Manager - American Red Cross Appreciation Certificate  \n \n★ American Red Cross Meritorious Volunteer Leadership Award \n \n★ American Red Cross Volunteer of the Year - San Mateo County \n \n★ California Senate Certificate of Recognition. \n \n \nPROFESSIONAL WRITING AWARDS \n \n★ Society for Technical Communication International Writing Award \n \n★ PC Computing MVP Award \n \n★ Computer Retail Week Editor’s Choice Award \n \n★ Society for Technical Communication Distinguished Writing Award \n \n★ Society for Technical Communication Achievement Writing Award Additional Honors & Awards ★ Aptos Chamber of Commerce Community Enhancement Award  \n \n★ Disaster Preparedness Leadership Volunteer Honors \n \n★ Alviso Floods - Mobile Canteen – American Red Cross Appreciation Certificate \n \n★ Civil Air Patrol Search and Rescue - Mass Care - Appreciation Certificate \n \n★ Lexington Fires - Shelter Manager – American Red Cross Appreciation Certificate \n \n★ SFO Airport Disaster Drills Leader American Red Cross Appreciation Certificate \n \n★ Loma Prieta Earthquake - Shelter Manager - American Red Cross Appreciation Certificate  \n \n★ American Red Cross Meritorious Volunteer Leadership Award \n \n★ American Red Cross Volunteer of the Year - San Mateo County \n \n★ California Senate Certificate of Recognition. \n \n \nPROFESSIONAL WRITING AWARDS \n \n★ Society for Technical Communication International Writing Award \n \n★ PC Computing MVP Award \n \n★ Computer Retail Week Editor’s Choice Award \n \n★ Society for Technical Communication Distinguished Writing Award \n \n★ Society for Technical Communication Achievement Writing Award Additional Honors & Awards ★ Aptos Chamber of Commerce Community Enhancement Award  \n \n★ Disaster Preparedness Leadership Volunteer Honors \n \n★ Alviso Floods - Mobile Canteen – American Red Cross Appreciation Certificate \n \n★ Civil Air Patrol Search and Rescue - Mass Care - Appreciation Certificate \n \n★ Lexington Fires - Shelter Manager – American Red Cross Appreciation Certificate \n \n★ SFO Airport Disaster Drills Leader American Red Cross Appreciation Certificate \n \n★ Loma Prieta Earthquake - Shelter Manager - American Red Cross Appreciation Certificate  \n \n★ American Red Cross Meritorious Volunteer Leadership Award \n \n★ American Red Cross Volunteer of the Year - San Mateo County \n \n★ California Senate Certificate of Recognition. \n \n \nPROFESSIONAL WRITING AWARDS \n \n★ Society for Technical Communication International Writing Award \n \n★ PC Computing MVP Award \n \n★ Computer Retail Week Editor’s Choice Award \n \n★ Society for Technical Communication Distinguished Writing Award \n \n★ Society for Technical Communication Achievement Writing Award ", "Summary \tA Result Oriented Professional with 8+ years of experience in Technical writing, Content writing and Website management  \n\tExposure working with different verticals - Information Technology (Product/Service Based Organization), Retail, Telecommunications, Education, Pharmaceutical and Health Care. \n\tExposure to working with multi-cultural and cross-cultural business environment  \n\tExcellent inter-personal, communication, presentation & conceptualization skills \n\tGood analytical and problem solving skills \n\tAbility to work either in a team or independently Specialties:Technical writing, Content writing Summary \tA Result Oriented Professional with 8+ years of experience in Technical writing, Content writing and Website management  \n\tExposure working with different verticals - Information Technology (Product/Service Based Organization), Retail, Telecommunications, Education, Pharmaceutical and Health Care. \n\tExposure to working with multi-cultural and cross-cultural business environment  \n\tExcellent inter-personal, communication, presentation & conceptualization skills \n\tGood analytical and problem solving skills \n\tAbility to work either in a team or independently Specialties:Technical writing, Content writing \tA Result Oriented Professional with 8+ years of experience in Technical writing, Content writing and Website management  \n\tExposure working with different verticals - Information Technology (Product/Service Based Organization), Retail, Telecommunications, Education, Pharmaceutical and Health Care. \n\tExposure to working with multi-cultural and cross-cultural business environment  \n\tExcellent inter-personal, communication, presentation & conceptualization skills \n\tGood analytical and problem solving skills \n\tAbility to work either in a team or independently Specialties:Technical writing, Content writing \tA Result Oriented Professional with 8+ years of experience in Technical writing, Content writing and Website management  \n\tExposure working with different verticals - Information Technology (Product/Service Based Organization), Retail, Telecommunications, Education, Pharmaceutical and Health Care. \n\tExposure to working with multi-cultural and cross-cultural business environment  \n\tExcellent inter-personal, communication, presentation & conceptualization skills \n\tGood analytical and problem solving skills \n\tAbility to work either in a team or independently Specialties:Technical writing, Content writing Experience Lead Technical Writer Cisco Systems August 2012  – Present (3 years 1 month) Cessna Business Park, ORR, Bangalore Technical Writer Samsung India Software Operations March 2011  –  July 2012  (1 year 5 months) Technical Writer Nokia Siemens Networks July 2008  –  June 2010  (2 years) Content Writer and Technical Writer Freelancing Work January 2005  –  June 2008  (3 years 6 months) Ahmedabad, India Companies that I worked with: \n \nEUTHENICS SOLUTIONS [www.euthenicsit.com] \nKLADOS SOLUTIONS PVT. (UK) LTD. [www.klados.com] \nCYBERSURF INDIA PVT. LTD. [www.cybersurfindia.com] \nFOURTH-MEDIA INTERACTIVE SOLUTIONS [www.fourthmedia.co.in] \nSHREE AERODYNAMICS PRODUCTS [www.sapindia.in] Lead Technical Writer Cisco Systems August 2012  – Present (3 years 1 month) Cessna Business Park, ORR, Bangalore Lead Technical Writer Cisco Systems August 2012  – Present (3 years 1 month) Cessna Business Park, ORR, Bangalore Technical Writer Samsung India Software Operations March 2011  –  July 2012  (1 year 5 months) Technical Writer Samsung India Software Operations March 2011  –  July 2012  (1 year 5 months) Technical Writer Nokia Siemens Networks July 2008  –  June 2010  (2 years) Technical Writer Nokia Siemens Networks July 2008  –  June 2010  (2 years) Content Writer and Technical Writer Freelancing Work January 2005  –  June 2008  (3 years 6 months) Ahmedabad, India Companies that I worked with: \n \nEUTHENICS SOLUTIONS [www.euthenicsit.com] \nKLADOS SOLUTIONS PVT. (UK) LTD. [www.klados.com] \nCYBERSURF INDIA PVT. LTD. [www.cybersurfindia.com] \nFOURTH-MEDIA INTERACTIVE SOLUTIONS [www.fourthmedia.co.in] \nSHREE AERODYNAMICS PRODUCTS [www.sapindia.in] Content Writer and Technical Writer Freelancing Work January 2005  –  June 2008  (3 years 6 months) Ahmedabad, India Companies that I worked with: \n \nEUTHENICS SOLUTIONS [www.euthenicsit.com] \nKLADOS SOLUTIONS PVT. (UK) LTD. [www.klados.com] \nCYBERSURF INDIA PVT. LTD. [www.cybersurfindia.com] \nFOURTH-MEDIA INTERACTIVE SOLUTIONS [www.fourthmedia.co.in] \nSHREE AERODYNAMICS PRODUCTS [www.sapindia.in] Languages English Professional working proficiency Hindi Native or bilingual proficiency French Elementary proficiency English Professional working proficiency Hindi Native or bilingual proficiency French Elementary proficiency English Professional working proficiency Hindi Native or bilingual proficiency French Elementary proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills Technical Writing Content Writing Skills  Technical Writing Content Writing Technical Writing Content Writing Technical Writing Content Writing Education K.S. School Of Business Management M.Sc. I.T.,  Computers 2000  – 2005 K.S. School Of Business Management M.Sc. I.T.,  Computers 2000  – 2005 K.S. School Of Business Management M.Sc. I.T.,  Computers 2000  – 2005 K.S. School Of Business Management M.Sc. I.T.,  Computers 2000  – 2005 ", "Experience Senior Technical Writer NetApp March 2014  – Present (1 year 6 months) Sunnyvale Senior Technical Writer Juniper Networks July 2013  –  March 2014  (9 months) Sunnyvale, CA Project Manager Cisco Systems 1998  –  2013  (15 years) Led cross-functional teams in developing and implementing Cisco-wide projects. \n \n• Streamlined Cisco’s global customer migration from IPv4 to IPv6, delivering integrated content sets \n• Delivered an IPv6 Knowledge Base Portal, providing a one-stop shop for access to IPv6-related content \n• Managed the Cisco World IPv6 Launch through review and analysis of web-based content  \n• Implemented a single-source content delivery model for multiple major Cisco software releases Documentation Lead Cisco Systems 1998  –  2013  (15 years) Defined strategy and provided leadership for major software releases and product introductions. \n \n• Led writers in delivery of multiple major software releases each quarter \n• Defined XML content reuse requirements across documentation groups \n• Led the introduction of Cisco’s IOS XE operating system, defining strategy and deliverables \n• Improved documentation quality through definition and implementation of quality metrics Senior Technical Writer Cisco Systems 1998  –  2013  (15 years) Authored configuration and command (CLI) content supporting Cisco’s software features and releases. \n \n• Wrote configuration and CLI content supporting new features for Cisco technologies:  \n- IP Routing and Addressing: IPv4, IPv6, BGP, OSPF, OSPFv3, MPLS, NAT, PAM \n- Security: AAA, ACLs, Firewall, Intrusion Detection, SSH, RADIUS \n- Management: SNMP, Embedded Syslog \n- High Availability: Stateful Switchover, Non-Stop Forwarding, In-Service Software Upgrade \n• Wrote and published documentation sets supporting Cisco releases:  \n- Cisco IOS Security Configuration Guide \n- Cisco IOS High Availability Configuration Guide \n- Cisco IOS Embedded Syslog Manager Configuration Guide \n- Cisco IOS Embedded Menu Manager Configuration \n• Developed a hands-on lab for training writers in managing and single-sourcing commands \n• Converted content using DITA XML authoring and CMS tools Manager/Writer, Engineering Auspex Systems, Inc. June 1991  –  December 1997  (6 years 7 months) Santa Clara, CA Built and led the Documentation team for this start-up company, delivering content for Auspex’ line of high-performance, UNIX- and DOS-based network file servers. \n \n● Wrote hardware installation, maintenance, and UNIX-based system administration guides. \n● Worked directly with engineering, marketing, and manufacturing teams to deliver award winning content \n● Planned, scheduled, and budgeted department projects and resources. \n● Improved customer satisfaction and enhanced the user documentation experience through development and delivery of a two-tiered system of configuration instructions Lead Technical Writer 3Com Corporation January 1988  –  May 1991  (3 years 5 months) Santa Clara, CA Led a team of writers and wrote content for 3Com’s line of enterprise routers. Senior Technical Writer NetApp March 2014  – Present (1 year 6 months) Sunnyvale Senior Technical Writer NetApp March 2014  – Present (1 year 6 months) Sunnyvale Senior Technical Writer Juniper Networks July 2013  –  March 2014  (9 months) Sunnyvale, CA Senior Technical Writer Juniper Networks July 2013  –  March 2014  (9 months) Sunnyvale, CA Project Manager Cisco Systems 1998  –  2013  (15 years) Led cross-functional teams in developing and implementing Cisco-wide projects. \n \n• Streamlined Cisco’s global customer migration from IPv4 to IPv6, delivering integrated content sets \n• Delivered an IPv6 Knowledge Base Portal, providing a one-stop shop for access to IPv6-related content \n• Managed the Cisco World IPv6 Launch through review and analysis of web-based content  \n• Implemented a single-source content delivery model for multiple major Cisco software releases Project Manager Cisco Systems 1998  –  2013  (15 years) Led cross-functional teams in developing and implementing Cisco-wide projects. \n \n• Streamlined Cisco’s global customer migration from IPv4 to IPv6, delivering integrated content sets \n• Delivered an IPv6 Knowledge Base Portal, providing a one-stop shop for access to IPv6-related content \n• Managed the Cisco World IPv6 Launch through review and analysis of web-based content  \n• Implemented a single-source content delivery model for multiple major Cisco software releases Documentation Lead Cisco Systems 1998  –  2013  (15 years) Defined strategy and provided leadership for major software releases and product introductions. \n \n• Led writers in delivery of multiple major software releases each quarter \n• Defined XML content reuse requirements across documentation groups \n• Led the introduction of Cisco’s IOS XE operating system, defining strategy and deliverables \n• Improved documentation quality through definition and implementation of quality metrics Documentation Lead Cisco Systems 1998  –  2013  (15 years) Defined strategy and provided leadership for major software releases and product introductions. \n \n• Led writers in delivery of multiple major software releases each quarter \n• Defined XML content reuse requirements across documentation groups \n• Led the introduction of Cisco’s IOS XE operating system, defining strategy and deliverables \n• Improved documentation quality through definition and implementation of quality metrics Senior Technical Writer Cisco Systems 1998  –  2013  (15 years) Authored configuration and command (CLI) content supporting Cisco’s software features and releases. \n \n• Wrote configuration and CLI content supporting new features for Cisco technologies:  \n- IP Routing and Addressing: IPv4, IPv6, BGP, OSPF, OSPFv3, MPLS, NAT, PAM \n- Security: AAA, ACLs, Firewall, Intrusion Detection, SSH, RADIUS \n- Management: SNMP, Embedded Syslog \n- High Availability: Stateful Switchover, Non-Stop Forwarding, In-Service Software Upgrade \n• Wrote and published documentation sets supporting Cisco releases:  \n- Cisco IOS Security Configuration Guide \n- Cisco IOS High Availability Configuration Guide \n- Cisco IOS Embedded Syslog Manager Configuration Guide \n- Cisco IOS Embedded Menu Manager Configuration \n• Developed a hands-on lab for training writers in managing and single-sourcing commands \n• Converted content using DITA XML authoring and CMS tools Senior Technical Writer Cisco Systems 1998  –  2013  (15 years) Authored configuration and command (CLI) content supporting Cisco’s software features and releases. \n \n• Wrote configuration and CLI content supporting new features for Cisco technologies:  \n- IP Routing and Addressing: IPv4, IPv6, BGP, OSPF, OSPFv3, MPLS, NAT, PAM \n- Security: AAA, ACLs, Firewall, Intrusion Detection, SSH, RADIUS \n- Management: SNMP, Embedded Syslog \n- High Availability: Stateful Switchover, Non-Stop Forwarding, In-Service Software Upgrade \n• Wrote and published documentation sets supporting Cisco releases:  \n- Cisco IOS Security Configuration Guide \n- Cisco IOS High Availability Configuration Guide \n- Cisco IOS Embedded Syslog Manager Configuration Guide \n- Cisco IOS Embedded Menu Manager Configuration \n• Developed a hands-on lab for training writers in managing and single-sourcing commands \n• Converted content using DITA XML authoring and CMS tools Manager/Writer, Engineering Auspex Systems, Inc. June 1991  –  December 1997  (6 years 7 months) Santa Clara, CA Built and led the Documentation team for this start-up company, delivering content for Auspex’ line of high-performance, UNIX- and DOS-based network file servers. \n \n● Wrote hardware installation, maintenance, and UNIX-based system administration guides. \n● Worked directly with engineering, marketing, and manufacturing teams to deliver award winning content \n● Planned, scheduled, and budgeted department projects and resources. \n● Improved customer satisfaction and enhanced the user documentation experience through development and delivery of a two-tiered system of configuration instructions Manager/Writer, Engineering Auspex Systems, Inc. June 1991  –  December 1997  (6 years 7 months) Santa Clara, CA Built and led the Documentation team for this start-up company, delivering content for Auspex’ line of high-performance, UNIX- and DOS-based network file servers. \n \n● Wrote hardware installation, maintenance, and UNIX-based system administration guides. \n● Worked directly with engineering, marketing, and manufacturing teams to deliver award winning content \n● Planned, scheduled, and budgeted department projects and resources. \n● Improved customer satisfaction and enhanced the user documentation experience through development and delivery of a two-tiered system of configuration instructions Lead Technical Writer 3Com Corporation January 1988  –  May 1991  (3 years 5 months) Santa Clara, CA Led a team of writers and wrote content for 3Com’s line of enterprise routers. Lead Technical Writer 3Com Corporation January 1988  –  May 1991  (3 years 5 months) Santa Clara, CA Led a team of writers and wrote content for 3Com’s line of enterprise routers. Skills Structured Authoring DITA Online Help XMetal FrameMaker RoboHelp Technical Writing Single Sourcing Unix Technical Communication Software Documentation Project Management XML Content Management Technical Documentation Adobe Acrobat Content Strategy Wikis Leadership Release Notes Networking CMS DITA XML Manuals WebEx Content Development User Experience SnagIt Cisco Technologies Information Architecture Program Management Cross-functional Team... See 17+     See less Skills  Structured Authoring DITA Online Help XMetal FrameMaker RoboHelp Technical Writing Single Sourcing Unix Technical Communication Software Documentation Project Management XML Content Management Technical Documentation Adobe Acrobat Content Strategy Wikis Leadership Release Notes Networking CMS DITA XML Manuals WebEx Content Development User Experience SnagIt Cisco Technologies Information Architecture Program Management Cross-functional Team... See 17+     See less Structured Authoring DITA Online Help XMetal FrameMaker RoboHelp Technical Writing Single Sourcing Unix Technical Communication Software Documentation Project Management XML Content Management Technical Documentation Adobe Acrobat Content Strategy Wikis Leadership Release Notes Networking CMS DITA XML Manuals WebEx Content Development User Experience SnagIt Cisco Technologies Information Architecture Program Management Cross-functional Team... See 17+     See less Structured Authoring DITA Online Help XMetal FrameMaker RoboHelp Technical Writing Single Sourcing Unix Technical Communication Software Documentation Project Management XML Content Management Technical Documentation Adobe Acrobat Content Strategy Wikis Leadership Release Notes Networking CMS DITA XML Manuals WebEx Content Development User Experience SnagIt Cisco Technologies Information Architecture Program Management Cross-functional Team... See 17+     See less Education St. Mary's College of California St. Mary's College of California St. Mary's College of California St. Mary's College of California ", "Summary I have spent my career among words. I am at home in technical, business, or creative writing. After 25 years of teaching writing in colleges and secondary schools, I moved into the business sector as a technical editor/writer and quality administrator. Summary I have spent my career among words. I am at home in technical, business, or creative writing. After 25 years of teaching writing in colleges and secondary schools, I moved into the business sector as a technical editor/writer and quality administrator. I have spent my career among words. I am at home in technical, business, or creative writing. After 25 years of teaching writing in colleges and secondary schools, I moved into the business sector as a technical editor/writer and quality administrator. I have spent my career among words. I am at home in technical, business, or creative writing. After 25 years of teaching writing in colleges and secondary schools, I moved into the business sector as a technical editor/writer and quality administrator. Experience Lead Technical Writer Cisco Systems Inc (Apex Systems Inc) August 2014  – Present (1 year 1 month) Research Triangle Park, NC • Lead the technical documentation team for large banking client with Cloud and Managed Services (CMS) \n• Coordinate with team managers to facilitate current and future documentation efforts  \n• Assign team members writing assignments and tasks based on current resource needs \n• Prepare customer and internal presentation collateral \n• Manage and administrate documentation content management systems, SharePoints, and team web pages \n• Ensure ISO compliance for all documents created Technical Writer Cisco Systems (Apex Systems Inc) March 2013  – Present (2 years 6 months) Raleigh, NC I am a contract technical writer at Cisco where I support high profile projects for Bank of America and The Home Depot. I write technical processes, administrate the teams' WebEx Social sites, and provide document control. Data Designer Boeing defence systems October 2010  –  June 2012  (1 year 9 months) Ridley Park, PA At Boeing I wrote various documents, particularly operating instructions, edited in XML and SGML, performed data management, and acted as Linguistic Manager and Technical Editor for Acrolinx IQ, editing and terminology software. English Instructor Delaware Technical & Community College January 2006  –  August 2011  (5 years 8 months) Taught Technical Communication and various other reading and writing classes Technical Editor and Quality Auditor Alliant Techsystems Inc (ATK) August 2005  –  October 2010  (5 years 3 months) Edited hundreds of documents, including reports, specifications, proposals, presentations, and white papers. Wrote CMMI training materials. Conducted CMMI and ISO audits. Conducted safety audits. Participated as CMMI Appraisal Team member. Lead Technical Writer Cisco Systems Inc (Apex Systems Inc) August 2014  – Present (1 year 1 month) Research Triangle Park, NC • Lead the technical documentation team for large banking client with Cloud and Managed Services (CMS) \n• Coordinate with team managers to facilitate current and future documentation efforts  \n• Assign team members writing assignments and tasks based on current resource needs \n• Prepare customer and internal presentation collateral \n• Manage and administrate documentation content management systems, SharePoints, and team web pages \n• Ensure ISO compliance for all documents created Lead Technical Writer Cisco Systems Inc (Apex Systems Inc) August 2014  – Present (1 year 1 month) Research Triangle Park, NC • Lead the technical documentation team for large banking client with Cloud and Managed Services (CMS) \n• Coordinate with team managers to facilitate current and future documentation efforts  \n• Assign team members writing assignments and tasks based on current resource needs \n• Prepare customer and internal presentation collateral \n• Manage and administrate documentation content management systems, SharePoints, and team web pages \n• Ensure ISO compliance for all documents created Technical Writer Cisco Systems (Apex Systems Inc) March 2013  – Present (2 years 6 months) Raleigh, NC I am a contract technical writer at Cisco where I support high profile projects for Bank of America and The Home Depot. I write technical processes, administrate the teams' WebEx Social sites, and provide document control. Technical Writer Cisco Systems (Apex Systems Inc) March 2013  – Present (2 years 6 months) Raleigh, NC I am a contract technical writer at Cisco where I support high profile projects for Bank of America and The Home Depot. I write technical processes, administrate the teams' WebEx Social sites, and provide document control. Data Designer Boeing defence systems October 2010  –  June 2012  (1 year 9 months) Ridley Park, PA At Boeing I wrote various documents, particularly operating instructions, edited in XML and SGML, performed data management, and acted as Linguistic Manager and Technical Editor for Acrolinx IQ, editing and terminology software. Data Designer Boeing defence systems October 2010  –  June 2012  (1 year 9 months) Ridley Park, PA At Boeing I wrote various documents, particularly operating instructions, edited in XML and SGML, performed data management, and acted as Linguistic Manager and Technical Editor for Acrolinx IQ, editing and terminology software. English Instructor Delaware Technical & Community College January 2006  –  August 2011  (5 years 8 months) Taught Technical Communication and various other reading and writing classes English Instructor Delaware Technical & Community College January 2006  –  August 2011  (5 years 8 months) Taught Technical Communication and various other reading and writing classes Technical Editor and Quality Auditor Alliant Techsystems Inc (ATK) August 2005  –  October 2010  (5 years 3 months) Edited hundreds of documents, including reports, specifications, proposals, presentations, and white papers. Wrote CMMI training materials. Conducted CMMI and ISO audits. Conducted safety audits. Participated as CMMI Appraisal Team member. Technical Editor and Quality Auditor Alliant Techsystems Inc (ATK) August 2005  –  October 2010  (5 years 3 months) Edited hundreds of documents, including reports, specifications, proposals, presentations, and white papers. Wrote CMMI training materials. Conducted CMMI and ISO audits. Conducted safety audits. Participated as CMMI Appraisal Team member. Skills Technical Editing Technical Writing Teaching Quality Auditing Coaching College counseling Public Speaking Research Newsletters Proposal Writing Internal Communications Microsoft Office Press Releases Editing Microsoft Word Training Program Management See 2+     See less Skills  Technical Editing Technical Writing Teaching Quality Auditing Coaching College counseling Public Speaking Research Newsletters Proposal Writing Internal Communications Microsoft Office Press Releases Editing Microsoft Word Training Program Management See 2+     See less Technical Editing Technical Writing Teaching Quality Auditing Coaching College counseling Public Speaking Research Newsletters Proposal Writing Internal Communications Microsoft Office Press Releases Editing Microsoft Word Training Program Management See 2+     See less Technical Editing Technical Writing Teaching Quality Auditing Coaching College counseling Public Speaking Research Newsletters Proposal Writing Internal Communications Microsoft Office Press Releases Editing Microsoft Word Training Program Management See 2+     See less Education Penn State University Master of Fine Arts (M.F.A.),  English (Fiction Writing emphasis) 1984  – 1986 Penn State University Master of Arts (M.A.),  English (Technical Writing emphasis) 1982  – 1984 Penn State University Master of Fine Arts (M.F.A.),  English (Fiction Writing emphasis) 1984  – 1986 Penn State University Master of Fine Arts (M.F.A.),  English (Fiction Writing emphasis) 1984  – 1986 Penn State University Master of Fine Arts (M.F.A.),  English (Fiction Writing emphasis) 1984  – 1986 Penn State University Master of Arts (M.A.),  English (Technical Writing emphasis) 1982  – 1984 Penn State University Master of Arts (M.A.),  English (Technical Writing emphasis) 1982  – 1984 Penn State University Master of Arts (M.A.),  English (Technical Writing emphasis) 1982  – 1984 Honors & Awards ATK Excellence Award ATK Mission Systems Division April 2009 Annual, division-wide, $10K awarded to the proposal team for winning a $120M NASA contract. I served as the technical editor on the project. ATK Excellence Award ATK Mission Systems Division March 2010 Annual, division-wide, $10K award given to the CMMI certification team for earning certification as required to retain a $160M NASA contract. I served as an Appraisal team member, trainer, and internal auditor for the program. I wrote and delivered 16 training modules, as well as many other documents required for certification. ATK Excellence Award ATK Mission Systems Division April 2009 Annual, division-wide, $10K awarded to the proposal team for winning a $120M NASA contract. I served as the technical editor on the project. ATK Excellence Award ATK Mission Systems Division April 2009 Annual, division-wide, $10K awarded to the proposal team for winning a $120M NASA contract. I served as the technical editor on the project. ATK Excellence Award ATK Mission Systems Division April 2009 Annual, division-wide, $10K awarded to the proposal team for winning a $120M NASA contract. I served as the technical editor on the project. ATK Excellence Award ATK Mission Systems Division March 2010 Annual, division-wide, $10K award given to the CMMI certification team for earning certification as required to retain a $160M NASA contract. I served as an Appraisal team member, trainer, and internal auditor for the program. I wrote and delivered 16 training modules, as well as many other documents required for certification. ATK Excellence Award ATK Mission Systems Division March 2010 Annual, division-wide, $10K award given to the CMMI certification team for earning certification as required to retain a $160M NASA contract. I served as an Appraisal team member, trainer, and internal auditor for the program. I wrote and delivered 16 training modules, as well as many other documents required for certification. ATK Excellence Award ATK Mission Systems Division March 2010 Annual, division-wide, $10K award given to the CMMI certification team for earning certification as required to retain a $160M NASA contract. I served as an Appraisal team member, trainer, and internal auditor for the program. I wrote and delivered 16 training modules, as well as many other documents required for certification. ", "Summary Leadership | Program Management | Communications | Software Development \n \nCertified Project-Management Professional (PMP) \n \nHolder of one patent -- see below. \n \nExpertise: \nProgram management \nProject management \nRelease management \nProduct teams \nDocumentation teams \nCross-team facilitation \nDocumentation projects \nContent publishing \nTechnical content \nProduct documentation Summary Leadership | Program Management | Communications | Software Development \n \nCertified Project-Management Professional (PMP) \n \nHolder of one patent -- see below. \n \nExpertise: \nProgram management \nProject management \nRelease management \nProduct teams \nDocumentation teams \nCross-team facilitation \nDocumentation projects \nContent publishing \nTechnical content \nProduct documentation Leadership | Program Management | Communications | Software Development \n \nCertified Project-Management Professional (PMP) \n \nHolder of one patent -- see below. \n \nExpertise: \nProgram management \nProject management \nRelease management \nProduct teams \nDocumentation teams \nCross-team facilitation \nDocumentation projects \nContent publishing \nTechnical content \nProduct documentation Leadership | Program Management | Communications | Software Development \n \nCertified Project-Management Professional (PMP) \n \nHolder of one patent -- see below. \n \nExpertise: \nProgram management \nProject management \nRelease management \nProduct teams \nDocumentation teams \nCross-team facilitation \nDocumentation projects \nContent publishing \nTechnical content \nProduct documentation Experience Senior Program Manager Cisco Systems September 2010  –  October 2014  (4 years 2 months) Greater Seattle Area Conceived, planned, scheduled, and managed lab-validated enterprise network design projects that supported business-unit marketing strategies, supported partner sales, eased customer implementations, and accelerated adoption of newer Cisco products and services. \n \n• Developed business use-cases for many Cisco products – including ASA Adaptive Security Appliances, Identity Services Engine, AnyConnect, ScanSafe, Web Security Appliance, Email Security Appliance, Cisco Integrated Services Routers, Cisco Catalyst Switches, Cisco Nexus Data Center Switches, and Cisco Unified Computing System – in order to enable enterprise solution development projects. \n \n• Provided the process, tools, and oversight that enabled a team of network engineers to create Cisco Validated Design guides with lower operating costs, improved quality, tripled team capacity, and quadrupled production speed. \n \n• Defined requirements for and led development of an authoring environment that enabled network architects to work faster and more comfortably. \n \n• Created, communicated, monitored, and optimized business processes that lowered the development cost and tripled the team output of enterprise network designs. \n \n• Oversaw business relationship with primary service vendor, including detailed service-level agreements, resulting in higher quality work at 75% cost reduction. \n \n• Developed and implemented innovative information architecture and guide designs that improved reader comprehension of enterprise network designs. \n \n• Coordinated editing, illustration, production, and publishing that resulted in on-time and under-budget delivery of guides. \n \n• Designed and oversaw the production and delivery of go-to-market giveaways that raised awareness of Cisco Validated Designs and Cisco Smart Business Architecture. \n Lead Technical Writer Cisco Systems May 2007  –  October 2010  (3 years 6 months) Greater Seattle Area Managed documentation projects for data-center switching software, ensuring on-time product documentation and online help for flagship data-center switching products. \n \n• Planned, scheduled, monitored, and reported status for Cisco NX-OS and Data Center Network Manager documentation projects that provided the product teams with worry-free completion of documentation requirements. \n \n• Created a single-source content strategy that improved efficiency and lowered costs. \n \n• Wrote documentation for security features, including access-control list and layer-2 security, which provided customers with accurate, complete, and comprehensible information. \n \n• Defined requirements for and led user-acceptance testing of a DITA XML content management system enabling the IT group to build a useful and usable system. \n \n• Developed XML writing guidelines that provided many writing teams with a common style that eased reader comprehension. Senior Technical Writer Microsoft February 2006  –  May 2007  (1 year 4 months) Redmond, WA Wrote documentation for Forefront Client Security, enabling customer success with customizing and implementing a centrally managed, policy-based anti-malware solution. \n \n• Wrote administration, operations, and security guides that aided customers in the understanding and operation of the product. \n \n• Controlled GUI text in product dashboard and alert messages that improved user experience and raised customer satisfaction. \n \n• Participated in creation of a malware submission process that made the product more useful and better protected users from malware. Lead Technical Writer Cisco Systems March 2000  –  February 2006  (6 years) Urbana-Champaign, Illinois Area Led product documentation teams for network security software and built tools enabling the efficient creation and delivery of product documentation. \n \n• Managed the creation and delivery of Cisco Secure ACS and ASA Adaptive Security Appliance documentation, ensuring customer success with securing network services.  \n \n• Documented the first release of Network Admission Control, helping partners and customers understand and deploy a complicated new security service. \n \n• Designed, built, and implemented an XML content-management system that remained in production for over ten years. \n \n• Developed XSLT to transform XML to publishable outputs, enabling developers and technical writers to create documentation faster and at less expense. \n \n• Wrote and published in December of 2000 the first XML-based user documentation released by Cisco Systems, proving the feasibility and the fundamental value of the technology to documentation teams within the company. Configuration Engineer Eclipsys January 1998  –  March 2000  (2 years 3 months) Tempe, AZ Enabled the development, testing, and delivery of healthcare software. \n \n• Rose to team lead within a year of accepting the configuration engineer position. \n \n• Created and maintained configuration-management systems used by developers. \n \n• Performed integration builds and verification tests for UNIX applications, enabling the system test and development teams to proceed with ongoing projects. \n \n• Built software releases and patches for customer sites in support of new sales, site upgrades, and technical-assistance cases. \n \n• Designed, built, tested, and enhanced a web-based timesheet system that simplified billing for contracting services and significantly reduced administration costs. Technical Writer Motorola April 1996  –  January 1998  (1 year 10 months) Tempe, AZ •\tWrote and revised software documentation for users and engineers \n \n•\tDeveloped and maintained company documentation standards Technical Writer Blood Systems, Inc June 1993  –  April 1996  (2 years 11 months) Scottsdale, AZ •\tSupervised data processing department technical writing staff \n \n•\tMaintained audit trails per FDA regulations \n \n•\tMaintained mainframe online documentation and help text \n \n•\tPlanned pilot of document management software \n \n•\tCoordinated & edited multiple projects in highly regulated environment \n \n•\tDeveloped, wrote, implemented & tracked department policy manual \n \n•\tCreated document control system for department policy manual Senior Program Manager Cisco Systems September 2010  –  October 2014  (4 years 2 months) Greater Seattle Area Conceived, planned, scheduled, and managed lab-validated enterprise network design projects that supported business-unit marketing strategies, supported partner sales, eased customer implementations, and accelerated adoption of newer Cisco products and services. \n \n• Developed business use-cases for many Cisco products – including ASA Adaptive Security Appliances, Identity Services Engine, AnyConnect, ScanSafe, Web Security Appliance, Email Security Appliance, Cisco Integrated Services Routers, Cisco Catalyst Switches, Cisco Nexus Data Center Switches, and Cisco Unified Computing System – in order to enable enterprise solution development projects. \n \n• Provided the process, tools, and oversight that enabled a team of network engineers to create Cisco Validated Design guides with lower operating costs, improved quality, tripled team capacity, and quadrupled production speed. \n \n• Defined requirements for and led development of an authoring environment that enabled network architects to work faster and more comfortably. \n \n• Created, communicated, monitored, and optimized business processes that lowered the development cost and tripled the team output of enterprise network designs. \n \n• Oversaw business relationship with primary service vendor, including detailed service-level agreements, resulting in higher quality work at 75% cost reduction. \n \n• Developed and implemented innovative information architecture and guide designs that improved reader comprehension of enterprise network designs. \n \n• Coordinated editing, illustration, production, and publishing that resulted in on-time and under-budget delivery of guides. \n \n• Designed and oversaw the production and delivery of go-to-market giveaways that raised awareness of Cisco Validated Designs and Cisco Smart Business Architecture. \n Senior Program Manager Cisco Systems September 2010  –  October 2014  (4 years 2 months) Greater Seattle Area Conceived, planned, scheduled, and managed lab-validated enterprise network design projects that supported business-unit marketing strategies, supported partner sales, eased customer implementations, and accelerated adoption of newer Cisco products and services. \n \n• Developed business use-cases for many Cisco products – including ASA Adaptive Security Appliances, Identity Services Engine, AnyConnect, ScanSafe, Web Security Appliance, Email Security Appliance, Cisco Integrated Services Routers, Cisco Catalyst Switches, Cisco Nexus Data Center Switches, and Cisco Unified Computing System – in order to enable enterprise solution development projects. \n \n• Provided the process, tools, and oversight that enabled a team of network engineers to create Cisco Validated Design guides with lower operating costs, improved quality, tripled team capacity, and quadrupled production speed. \n \n• Defined requirements for and led development of an authoring environment that enabled network architects to work faster and more comfortably. \n \n• Created, communicated, monitored, and optimized business processes that lowered the development cost and tripled the team output of enterprise network designs. \n \n• Oversaw business relationship with primary service vendor, including detailed service-level agreements, resulting in higher quality work at 75% cost reduction. \n \n• Developed and implemented innovative information architecture and guide designs that improved reader comprehension of enterprise network designs. \n \n• Coordinated editing, illustration, production, and publishing that resulted in on-time and under-budget delivery of guides. \n \n• Designed and oversaw the production and delivery of go-to-market giveaways that raised awareness of Cisco Validated Designs and Cisco Smart Business Architecture. \n Lead Technical Writer Cisco Systems May 2007  –  October 2010  (3 years 6 months) Greater Seattle Area Managed documentation projects for data-center switching software, ensuring on-time product documentation and online help for flagship data-center switching products. \n \n• Planned, scheduled, monitored, and reported status for Cisco NX-OS and Data Center Network Manager documentation projects that provided the product teams with worry-free completion of documentation requirements. \n \n• Created a single-source content strategy that improved efficiency and lowered costs. \n \n• Wrote documentation for security features, including access-control list and layer-2 security, which provided customers with accurate, complete, and comprehensible information. \n \n• Defined requirements for and led user-acceptance testing of a DITA XML content management system enabling the IT group to build a useful and usable system. \n \n• Developed XML writing guidelines that provided many writing teams with a common style that eased reader comprehension. Lead Technical Writer Cisco Systems May 2007  –  October 2010  (3 years 6 months) Greater Seattle Area Managed documentation projects for data-center switching software, ensuring on-time product documentation and online help for flagship data-center switching products. \n \n• Planned, scheduled, monitored, and reported status for Cisco NX-OS and Data Center Network Manager documentation projects that provided the product teams with worry-free completion of documentation requirements. \n \n• Created a single-source content strategy that improved efficiency and lowered costs. \n \n• Wrote documentation for security features, including access-control list and layer-2 security, which provided customers with accurate, complete, and comprehensible information. \n \n• Defined requirements for and led user-acceptance testing of a DITA XML content management system enabling the IT group to build a useful and usable system. \n \n• Developed XML writing guidelines that provided many writing teams with a common style that eased reader comprehension. Senior Technical Writer Microsoft February 2006  –  May 2007  (1 year 4 months) Redmond, WA Wrote documentation for Forefront Client Security, enabling customer success with customizing and implementing a centrally managed, policy-based anti-malware solution. \n \n• Wrote administration, operations, and security guides that aided customers in the understanding and operation of the product. \n \n• Controlled GUI text in product dashboard and alert messages that improved user experience and raised customer satisfaction. \n \n• Participated in creation of a malware submission process that made the product more useful and better protected users from malware. Senior Technical Writer Microsoft February 2006  –  May 2007  (1 year 4 months) Redmond, WA Wrote documentation for Forefront Client Security, enabling customer success with customizing and implementing a centrally managed, policy-based anti-malware solution. \n \n• Wrote administration, operations, and security guides that aided customers in the understanding and operation of the product. \n \n• Controlled GUI text in product dashboard and alert messages that improved user experience and raised customer satisfaction. \n \n• Participated in creation of a malware submission process that made the product more useful and better protected users from malware. Lead Technical Writer Cisco Systems March 2000  –  February 2006  (6 years) Urbana-Champaign, Illinois Area Led product documentation teams for network security software and built tools enabling the efficient creation and delivery of product documentation. \n \n• Managed the creation and delivery of Cisco Secure ACS and ASA Adaptive Security Appliance documentation, ensuring customer success with securing network services.  \n \n• Documented the first release of Network Admission Control, helping partners and customers understand and deploy a complicated new security service. \n \n• Designed, built, and implemented an XML content-management system that remained in production for over ten years. \n \n• Developed XSLT to transform XML to publishable outputs, enabling developers and technical writers to create documentation faster and at less expense. \n \n• Wrote and published in December of 2000 the first XML-based user documentation released by Cisco Systems, proving the feasibility and the fundamental value of the technology to documentation teams within the company. Lead Technical Writer Cisco Systems March 2000  –  February 2006  (6 years) Urbana-Champaign, Illinois Area Led product documentation teams for network security software and built tools enabling the efficient creation and delivery of product documentation. \n \n• Managed the creation and delivery of Cisco Secure ACS and ASA Adaptive Security Appliance documentation, ensuring customer success with securing network services.  \n \n• Documented the first release of Network Admission Control, helping partners and customers understand and deploy a complicated new security service. \n \n• Designed, built, and implemented an XML content-management system that remained in production for over ten years. \n \n• Developed XSLT to transform XML to publishable outputs, enabling developers and technical writers to create documentation faster and at less expense. \n \n• Wrote and published in December of 2000 the first XML-based user documentation released by Cisco Systems, proving the feasibility and the fundamental value of the technology to documentation teams within the company. Configuration Engineer Eclipsys January 1998  –  March 2000  (2 years 3 months) Tempe, AZ Enabled the development, testing, and delivery of healthcare software. \n \n• Rose to team lead within a year of accepting the configuration engineer position. \n \n• Created and maintained configuration-management systems used by developers. \n \n• Performed integration builds and verification tests for UNIX applications, enabling the system test and development teams to proceed with ongoing projects. \n \n• Built software releases and patches for customer sites in support of new sales, site upgrades, and technical-assistance cases. \n \n• Designed, built, tested, and enhanced a web-based timesheet system that simplified billing for contracting services and significantly reduced administration costs. Configuration Engineer Eclipsys January 1998  –  March 2000  (2 years 3 months) Tempe, AZ Enabled the development, testing, and delivery of healthcare software. \n \n• Rose to team lead within a year of accepting the configuration engineer position. \n \n• Created and maintained configuration-management systems used by developers. \n \n• Performed integration builds and verification tests for UNIX applications, enabling the system test and development teams to proceed with ongoing projects. \n \n• Built software releases and patches for customer sites in support of new sales, site upgrades, and technical-assistance cases. \n \n• Designed, built, tested, and enhanced a web-based timesheet system that simplified billing for contracting services and significantly reduced administration costs. Technical Writer Motorola April 1996  –  January 1998  (1 year 10 months) Tempe, AZ •\tWrote and revised software documentation for users and engineers \n \n•\tDeveloped and maintained company documentation standards Technical Writer Motorola April 1996  –  January 1998  (1 year 10 months) Tempe, AZ •\tWrote and revised software documentation for users and engineers \n \n•\tDeveloped and maintained company documentation standards Technical Writer Blood Systems, Inc June 1993  –  April 1996  (2 years 11 months) Scottsdale, AZ •\tSupervised data processing department technical writing staff \n \n•\tMaintained audit trails per FDA regulations \n \n•\tMaintained mainframe online documentation and help text \n \n•\tPlanned pilot of document management software \n \n•\tCoordinated & edited multiple projects in highly regulated environment \n \n•\tDeveloped, wrote, implemented & tracked department policy manual \n \n•\tCreated document control system for department policy manual Technical Writer Blood Systems, Inc June 1993  –  April 1996  (2 years 11 months) Scottsdale, AZ •\tSupervised data processing department technical writing staff \n \n•\tMaintained audit trails per FDA regulations \n \n•\tMaintained mainframe online documentation and help text \n \n•\tPlanned pilot of document management software \n \n•\tCoordinated & edited multiple projects in highly regulated environment \n \n•\tDeveloped, wrote, implemented & tracked department policy manual \n \n•\tCreated document control system for department policy manual Languages English English English Skills SQL Adobe Creative Suite Program Management Product Management Content Management Software Documentation Technical Writing Cisco Technologies Data Center Network Architecture Cloud Computing Technical Documentation Networking Unified Communications Security Network Security TCP/IP IP Network Design Enterprise Software Virtualization MPLS Wireless Ethernet Agile Methodologies SaaS Integration Wireless Networking Project Management FrameMaker Microsoft Office SDLC cGMP practices XML XSLT See 20+     See less Skills  SQL Adobe Creative Suite Program Management Product Management Content Management Software Documentation Technical Writing Cisco Technologies Data Center Network Architecture Cloud Computing Technical Documentation Networking Unified Communications Security Network Security TCP/IP IP Network Design Enterprise Software Virtualization MPLS Wireless Ethernet Agile Methodologies SaaS Integration Wireless Networking Project Management FrameMaker Microsoft Office SDLC cGMP practices XML XSLT See 20+     See less SQL Adobe Creative Suite Program Management Product Management Content Management Software Documentation Technical Writing Cisco Technologies Data Center Network Architecture Cloud Computing Technical Documentation Networking Unified Communications Security Network Security TCP/IP IP Network Design Enterprise Software Virtualization MPLS Wireless Ethernet Agile Methodologies SaaS Integration Wireless Networking Project Management FrameMaker Microsoft Office SDLC cGMP practices XML XSLT See 20+     See less SQL Adobe Creative Suite Program Management Product Management Content Management Software Documentation Technical Writing Cisco Technologies Data Center Network Architecture Cloud Computing Technical Documentation Networking Unified Communications Security Network Security TCP/IP IP Network Design Enterprise Software Virtualization MPLS Wireless Ethernet Agile Methodologies SaaS Integration Wireless Networking Project Management FrameMaker Microsoft Office SDLC cGMP practices XML XSLT See 20+     See less Education Arizona State University Master's Degree,  Fine Arts ,  Screenwriting Arizona State University Bachelor's Degree,  English Language and Literature/Letters Activities and Societies:  Magna cum Laude Arizona State University Master's Degree,  Fine Arts ,  Screenwriting Arizona State University Master's Degree,  Fine Arts ,  Screenwriting Arizona State University Master's Degree,  Fine Arts ,  Screenwriting Arizona State University Bachelor's Degree,  English Language and Literature/Letters Activities and Societies:  Magna cum Laude Arizona State University Bachelor's Degree,  English Language and Literature/Letters Activities and Societies:  Magna cum Laude Arizona State University Bachelor's Degree,  English Language and Literature/Letters Activities and Societies:  Magna cum Laude Honors & Awards ", "Summary I’m an award-winning communicator and a user experience lead with more than 10 years’ experience as a user advocate. Whether I’m writing a user guide or conducting a user test, my focus is on learning users’ habits and preferences to create products they enjoy. I love helping a company create great products that engage and delight customers.  \n \nSpecialties: user experience, usability testing, heuristic evaluation, user-centered design, user research, information architecture, HCI, persona creation, content strategy, task analysis, professional and business communications, content creation and curation Summary I’m an award-winning communicator and a user experience lead with more than 10 years’ experience as a user advocate. Whether I’m writing a user guide or conducting a user test, my focus is on learning users’ habits and preferences to create products they enjoy. I love helping a company create great products that engage and delight customers.  \n \nSpecialties: user experience, usability testing, heuristic evaluation, user-centered design, user research, information architecture, HCI, persona creation, content strategy, task analysis, professional and business communications, content creation and curation I’m an award-winning communicator and a user experience lead with more than 10 years’ experience as a user advocate. Whether I’m writing a user guide or conducting a user test, my focus is on learning users’ habits and preferences to create products they enjoy. I love helping a company create great products that engage and delight customers.  \n \nSpecialties: user experience, usability testing, heuristic evaluation, user-centered design, user research, information architecture, HCI, persona creation, content strategy, task analysis, professional and business communications, content creation and curation I’m an award-winning communicator and a user experience lead with more than 10 years’ experience as a user advocate. Whether I’m writing a user guide or conducting a user test, my focus is on learning users’ habits and preferences to create products they enjoy. I love helping a company create great products that engage and delight customers.  \n \nSpecialties: user experience, usability testing, heuristic evaluation, user-centered design, user research, information architecture, HCI, persona creation, content strategy, task analysis, professional and business communications, content creation and curation Experience User Experience Lead | Technical Writer Cisco 2008  – Present (7 years) Associate Staff Technical Writer Cisco Systems 2006  –  2008  (2 years) Senior Technical Writer Scientific Atlanta 2003  –  2006  (3 years) Instructional Design and Communications Consultant Consultant 1997  –  2003  (6 years) Representative clients include: \nThe Coca-Cola Company \nUnited Parcel Service of North America, Inc. (UPS) \nSchulmberger Limited Technical Writer Scientific Atlanta 1997  –  1997  (less than a year) Technical Writer Nordson Corporation 1995  –  1996  (1 year) Senior Communications Analyst Westinghouse Savannah River Company 1991  –  1995  (4 years) Technical Editor Westinghouse Savannah River Company 1989  –  1991  (2 years) User Experience Lead | Technical Writer Cisco 2008  – Present (7 years) User Experience Lead | Technical Writer Cisco 2008  – Present (7 years) Associate Staff Technical Writer Cisco Systems 2006  –  2008  (2 years) Associate Staff Technical Writer Cisco Systems 2006  –  2008  (2 years) Senior Technical Writer Scientific Atlanta 2003  –  2006  (3 years) Senior Technical Writer Scientific Atlanta 2003  –  2006  (3 years) Instructional Design and Communications Consultant Consultant 1997  –  2003  (6 years) Representative clients include: \nThe Coca-Cola Company \nUnited Parcel Service of North America, Inc. (UPS) \nSchulmberger Limited Instructional Design and Communications Consultant Consultant 1997  –  2003  (6 years) Representative clients include: \nThe Coca-Cola Company \nUnited Parcel Service of North America, Inc. (UPS) \nSchulmberger Limited Technical Writer Scientific Atlanta 1997  –  1997  (less than a year) Technical Writer Scientific Atlanta 1997  –  1997  (less than a year) Technical Writer Nordson Corporation 1995  –  1996  (1 year) Technical Writer Nordson Corporation 1995  –  1996  (1 year) Senior Communications Analyst Westinghouse Savannah River Company 1991  –  1995  (4 years) Senior Communications Analyst Westinghouse Savannah River Company 1991  –  1995  (4 years) Technical Editor Westinghouse Savannah River Company 1989  –  1991  (2 years) Technical Editor Westinghouse Savannah River Company 1989  –  1991  (2 years) Skills User Experience Usability Testing Human Computer... User Experience Design Usability Technical Documentation Technical Writing Online Help RoboHelp Cisco Technologies TCP/IP Telecommunications Ethernet IPTV FrameMaker SNMP Author-it Integration See 3+     See less Skills  User Experience Usability Testing Human Computer... User Experience Design Usability Technical Documentation Technical Writing Online Help RoboHelp Cisco Technologies TCP/IP Telecommunications Ethernet IPTV FrameMaker SNMP Author-it Integration See 3+     See less User Experience Usability Testing Human Computer... User Experience Design Usability Technical Documentation Technical Writing Online Help RoboHelp Cisco Technologies TCP/IP Telecommunications Ethernet IPTV FrameMaker SNMP Author-it Integration See 3+     See less User Experience Usability Testing Human Computer... User Experience Design Usability Technical Documentation Technical Writing Online Help RoboHelp Cisco Technologies TCP/IP Telecommunications Ethernet IPTV FrameMaker SNMP Author-it Integration See 3+     See less Education Iowa State University Certificate in Human Computer Interaction Master’s in Human Computer Interaction ongoing Georgia State University B.A., English Iowa State University Certificate in Human Computer Interaction Master’s in Human Computer Interaction ongoing Iowa State University Certificate in Human Computer Interaction Master’s in Human Computer Interaction ongoing Iowa State University Certificate in Human Computer Interaction Master’s in Human Computer Interaction ongoing Georgia State University B.A., English Georgia State University B.A., English Georgia State University B.A., English Honors & Awards International STC Award for Merit, 1999 Regional STC Awards • Distinguished, 1999  \n• Achievement, 1994, 1996, 1997  \n• Merit, 1992 Judge, 1993 South Carolina STC Competition International STC Award for Merit, 1999 International STC Award for Merit, 1999 International STC Award for Merit, 1999 Regional STC Awards • Distinguished, 1999  \n• Achievement, 1994, 1996, 1997  \n• Merit, 1992 Regional STC Awards • Distinguished, 1999  \n• Achievement, 1994, 1996, 1997  \n• Merit, 1992 Regional STC Awards • Distinguished, 1999  \n• Achievement, 1994, 1996, 1997  \n• Merit, 1992 Judge, 1993 South Carolina STC Competition Judge, 1993 South Carolina STC Competition Judge, 1993 South Carolina STC Competition ", "Experience Software Documentation Consultant Envision January 2012  –  September 2012  (9 months) Greater Seattle Area Contract Software Engineer Paladin Data Systems March 2010  –  May 2010  (3 months) Software Development Consultant Inventive Technology/MediaCAST March 2009  –  August 2009  (6 months) Broomfield, CO Software Developer SandCherry, Inc. February 2006  –  March 2009  (3 years 2 months) Software Engineer Sun Microsystems 2000  –  2004  (4 years) Software Documentation Consultant Envision January 2012  –  September 2012  (9 months) Greater Seattle Area Software Documentation Consultant Envision January 2012  –  September 2012  (9 months) Greater Seattle Area Contract Software Engineer Paladin Data Systems March 2010  –  May 2010  (3 months) Contract Software Engineer Paladin Data Systems March 2010  –  May 2010  (3 months) Software Development Consultant Inventive Technology/MediaCAST March 2009  –  August 2009  (6 months) Broomfield, CO Software Development Consultant Inventive Technology/MediaCAST March 2009  –  August 2009  (6 months) Broomfield, CO Software Developer SandCherry, Inc. February 2006  –  March 2009  (3 years 2 months) Software Developer SandCherry, Inc. February 2006  –  March 2009  (3 years 2 months) Software Engineer Sun Microsystems 2000  –  2004  (4 years) Software Engineer Sun Microsystems 2000  –  2004  (4 years) Skills Agile Methodologies Perl XML Software Development SQL Web Services HTML Linux Windows Java Technical Writing Program Management Six Sigma Process Improvement Business Process Quality Assurance Process Management Business Process... Statistical Modeling Cloud Computing Software Engineering Project Management SDLC Software Documentation Requirements Analysis Testing Software Project... See 12+     See less Skills  Agile Methodologies Perl XML Software Development SQL Web Services HTML Linux Windows Java Technical Writing Program Management Six Sigma Process Improvement Business Process Quality Assurance Process Management Business Process... Statistical Modeling Cloud Computing Software Engineering Project Management SDLC Software Documentation Requirements Analysis Testing Software Project... See 12+     See less Agile Methodologies Perl XML Software Development SQL Web Services HTML Linux Windows Java Technical Writing Program Management Six Sigma Process Improvement Business Process Quality Assurance Process Management Business Process... Statistical Modeling Cloud Computing Software Engineering Project Management SDLC Software Documentation Requirements Analysis Testing Software Project... See 12+     See less Agile Methodologies Perl XML Software Development SQL Web Services HTML Linux Windows Java Technical Writing Program Management Six Sigma Process Improvement Business Process Quality Assurance Process Management Business Process... Statistical Modeling Cloud Computing Software Engineering Project Management SDLC Software Documentation Requirements Analysis Testing Software Project... See 12+     See less Education University of Colorado at Boulder Master of Engineering (MEng),  Engineering/Industrial Management 2010  – 2013 Coursework for Six Sigma Black Belt certification completed Spring 2012 University of Colorado Boulder MA,  Cognitive Psychology 1987  – 1990 Iowa State University Bachelor of Science (BS),  Engineering Science University of Colorado at Boulder Master of Engineering (MEng),  Engineering/Industrial Management 2010  – 2013 Coursework for Six Sigma Black Belt certification completed Spring 2012 University of Colorado at Boulder Master of Engineering (MEng),  Engineering/Industrial Management 2010  – 2013 Coursework for Six Sigma Black Belt certification completed Spring 2012 University of Colorado at Boulder Master of Engineering (MEng),  Engineering/Industrial Management 2010  – 2013 Coursework for Six Sigma Black Belt certification completed Spring 2012 University of Colorado Boulder MA,  Cognitive Psychology 1987  – 1990 University of Colorado Boulder MA,  Cognitive Psychology 1987  – 1990 University of Colorado Boulder MA,  Cognitive Psychology 1987  – 1990 Iowa State University Bachelor of Science (BS),  Engineering Science Iowa State University Bachelor of Science (BS),  Engineering Science Iowa State University Bachelor of Science (BS),  Engineering Science ", "Languages   Skills Technical Writing Technical Documentation Information Technology Telecommunications Adobe Microsoft Word XML Functional... User Guide Creation SnagIt RoboHelp HTML Online Help Development Oral & Written... Number Portability DSL Set Top Box CMTS See 3+     See less Skills  Technical Writing Technical Documentation Information Technology Telecommunications Adobe Microsoft Word XML Functional... User Guide Creation SnagIt RoboHelp HTML Online Help Development Oral & Written... Number Portability DSL Set Top Box CMTS See 3+     See less Technical Writing Technical Documentation Information Technology Telecommunications Adobe Microsoft Word XML Functional... User Guide Creation SnagIt RoboHelp HTML Online Help Development Oral & Written... Number Portability DSL Set Top Box CMTS See 3+     See less Technical Writing Technical Documentation Information Technology Telecommunications Adobe Microsoft Word XML Functional... User Guide Creation SnagIt RoboHelp HTML Online Help Development Oral & Written... Number Portability DSL Set Top Box CMTS See 3+     See less Honors & Awards ", "Summary Extensive experience in documenting wired and wireless networking technologies for voice, video, data, routing, and switching Internet and internal network hardware and software products. This includes developing information delivery systems such as product CDs, Web content, online help, MAN pages, and paper books (back in the day). Currently assigned to Collaboration products, such as WebEx, WebEx Center, and MeetingPlace.  \n \nExperienced in using a variety of industry-standard authoring tools, including vi, WebWorks Publisher, WebWorks AutoMap, Xmetal, Astoria, RoboHelp, Framemaker, and Microsoft Word. Considered the \"Tools Person\" in the group, helping other Writers troubleshoot their tools, documents, and document delivery systems. (A bit-twiddling Geek at heart, solving problems is great fun and I get paid to do it.) \n \nWorked in Cloud, Apple Mac, Microsoft PC, Linux, and UNIX environments. While training for my degree in Computers and Networking I received some code training in C, PHP, HTML, XML, and Visual Basic.  \n \nIn addition to a degree in Journalism, I have a degree in Computers and Networking and have held multiple certifications in computer networking, routing, and switching, including a CCNA (Cisco Certified Networking Associate) and CCWNA (Cisco Certified Wireless Networking Associate).  \n \nIn my previous career I worked as a Freelance Feature Writer authoring magazine articles for publications such as East West Journal and Science and Mechanics. I also worked as a News Writer, writing broadcast news copy and producing on-air news reports for KXTV in Sacramento. Summary Extensive experience in documenting wired and wireless networking technologies for voice, video, data, routing, and switching Internet and internal network hardware and software products. This includes developing information delivery systems such as product CDs, Web content, online help, MAN pages, and paper books (back in the day). Currently assigned to Collaboration products, such as WebEx, WebEx Center, and MeetingPlace.  \n \nExperienced in using a variety of industry-standard authoring tools, including vi, WebWorks Publisher, WebWorks AutoMap, Xmetal, Astoria, RoboHelp, Framemaker, and Microsoft Word. Considered the \"Tools Person\" in the group, helping other Writers troubleshoot their tools, documents, and document delivery systems. (A bit-twiddling Geek at heart, solving problems is great fun and I get paid to do it.) \n \nWorked in Cloud, Apple Mac, Microsoft PC, Linux, and UNIX environments. While training for my degree in Computers and Networking I received some code training in C, PHP, HTML, XML, and Visual Basic.  \n \nIn addition to a degree in Journalism, I have a degree in Computers and Networking and have held multiple certifications in computer networking, routing, and switching, including a CCNA (Cisco Certified Networking Associate) and CCWNA (Cisco Certified Wireless Networking Associate).  \n \nIn my previous career I worked as a Freelance Feature Writer authoring magazine articles for publications such as East West Journal and Science and Mechanics. I also worked as a News Writer, writing broadcast news copy and producing on-air news reports for KXTV in Sacramento. Extensive experience in documenting wired and wireless networking technologies for voice, video, data, routing, and switching Internet and internal network hardware and software products. This includes developing information delivery systems such as product CDs, Web content, online help, MAN pages, and paper books (back in the day). Currently assigned to Collaboration products, such as WebEx, WebEx Center, and MeetingPlace.  \n \nExperienced in using a variety of industry-standard authoring tools, including vi, WebWorks Publisher, WebWorks AutoMap, Xmetal, Astoria, RoboHelp, Framemaker, and Microsoft Word. Considered the \"Tools Person\" in the group, helping other Writers troubleshoot their tools, documents, and document delivery systems. (A bit-twiddling Geek at heart, solving problems is great fun and I get paid to do it.) \n \nWorked in Cloud, Apple Mac, Microsoft PC, Linux, and UNIX environments. While training for my degree in Computers and Networking I received some code training in C, PHP, HTML, XML, and Visual Basic.  \n \nIn addition to a degree in Journalism, I have a degree in Computers and Networking and have held multiple certifications in computer networking, routing, and switching, including a CCNA (Cisco Certified Networking Associate) and CCWNA (Cisco Certified Wireless Networking Associate).  \n \nIn my previous career I worked as a Freelance Feature Writer authoring magazine articles for publications such as East West Journal and Science and Mechanics. I also worked as a News Writer, writing broadcast news copy and producing on-air news reports for KXTV in Sacramento. Extensive experience in documenting wired and wireless networking technologies for voice, video, data, routing, and switching Internet and internal network hardware and software products. This includes developing information delivery systems such as product CDs, Web content, online help, MAN pages, and paper books (back in the day). Currently assigned to Collaboration products, such as WebEx, WebEx Center, and MeetingPlace.  \n \nExperienced in using a variety of industry-standard authoring tools, including vi, WebWorks Publisher, WebWorks AutoMap, Xmetal, Astoria, RoboHelp, Framemaker, and Microsoft Word. Considered the \"Tools Person\" in the group, helping other Writers troubleshoot their tools, documents, and document delivery systems. (A bit-twiddling Geek at heart, solving problems is great fun and I get paid to do it.) \n \nWorked in Cloud, Apple Mac, Microsoft PC, Linux, and UNIX environments. While training for my degree in Computers and Networking I received some code training in C, PHP, HTML, XML, and Visual Basic.  \n \nIn addition to a degree in Journalism, I have a degree in Computers and Networking and have held multiple certifications in computer networking, routing, and switching, including a CCNA (Cisco Certified Networking Associate) and CCWNA (Cisco Certified Wireless Networking Associate).  \n \nIn my previous career I worked as a Freelance Feature Writer authoring magazine articles for publications such as East West Journal and Science and Mechanics. I also worked as a News Writer, writing broadcast news copy and producing on-air news reports for KXTV in Sacramento. Experience Lead Technical Writer Cisco Systems, Inc. July 1996  – Present (19 years 2 months) San Jose, CA Cisco Systems core business is developing and manufacturing a range of networking products, including routers, switches, and access points. In the past I have lead the documentation efforts for core products, such as routers and switches, used for voice, video, and data communications in wired and wireless environments. \n \nThe audience for these products varies from small business users with little networking experience to professional system administrators with extensive industry experience. (I even wrote some instructions for actual rocket scientists, as the Cisco 3200 Router has been used on the Mars probes and the space shuttle.) \n \nThe delivery systems for this content has ranged from MAN pages to GUI-based, context-sensitive online help. More recently I have been developing content in XML and DITA for Web publishing. \n \nThe hardware and software products for which I have developed documentation include: \n-- Cisco Configuration Assistant (CCA) \n-- CiscoWorks for Windows \n-- Cisco Router Web Setup (CRWS)  \n-- Cisco 3200, 1800, 800, and 500 Series wired and wireless routers \n-- Cisco Small Business 200, 300, and 500 series switches. \n-- Cisco Small Business 100, 200, and 300 series routers \n-- Cisco Small Business 500 series access points \n \nEarned Cisco Certified Network Associate (CCNA) and Cisco Certified Wireless LAN Support Specialist (CCWLSS), and trained six other staff members to pass their CCNA certifications.  \n \nNumerous outstanding performance awards and bonuses have been earned during my tenure at Cisco Systems, Inc. Senior Information Developer EDS Technologies May 1994  –  July 1996  (2 years 3 months) San Jose, CA EDS provided high-tech documentation solutions and technical writing services to other companies in the Silicon Valley. I was assigned to document high-end UNIX servers for Siemens Nexdorf. \n \nLed the Optional Software Products Documentation Group. We produced the software documentation for computer language development tools and network communications products. Documentation included: \n \n-- ANSI C Programmer's Guide \n-- Reliant Cluster Networking Guide \n-- MAN Pages (produced by using vi)  \n \nLed the EDS Technology Team that was charged with researching trends, implementing processes and maintaining the tools that would keep the company on the front edge of desktop publishing technologies. For example, we set up a system to automatically convert all Framemaker documentation to PDF, prepare it for delivery on a CD (a new idea at the time), and dynamically build an HTML front end that included global index links and catalog searches. Technical Writer and System Administrator Network Application Technologies (NAT) January 1993  –  June 1994  (1 year 6 months) Campbell, CA Network Application Technology was a start-up company that produced TCP/IP network monitoring hardware and software products, routers, switches, and bridges.  \n \nI wrote user guides for networking novices, including the EtherMeter/450 User Guide that won Communications Week annual MAC award in 1994. I also designed documents, templates, online help, and implemented other processes to maintain consistency between writers by using and style sheets and reusable data dictionaries.  \n \nAs a part-time System Administrator, I repaired and upgraded computers, managed the department network, and implemented archiving procedures that saved the company thousands of dollars when a server crash destroyed all technical publications on the main server. Lead Technical Writer Cisco Systems, Inc. July 1996  – Present (19 years 2 months) San Jose, CA Cisco Systems core business is developing and manufacturing a range of networking products, including routers, switches, and access points. In the past I have lead the documentation efforts for core products, such as routers and switches, used for voice, video, and data communications in wired and wireless environments. \n \nThe audience for these products varies from small business users with little networking experience to professional system administrators with extensive industry experience. (I even wrote some instructions for actual rocket scientists, as the Cisco 3200 Router has been used on the Mars probes and the space shuttle.) \n \nThe delivery systems for this content has ranged from MAN pages to GUI-based, context-sensitive online help. More recently I have been developing content in XML and DITA for Web publishing. \n \nThe hardware and software products for which I have developed documentation include: \n-- Cisco Configuration Assistant (CCA) \n-- CiscoWorks for Windows \n-- Cisco Router Web Setup (CRWS)  \n-- Cisco 3200, 1800, 800, and 500 Series wired and wireless routers \n-- Cisco Small Business 200, 300, and 500 series switches. \n-- Cisco Small Business 100, 200, and 300 series routers \n-- Cisco Small Business 500 series access points \n \nEarned Cisco Certified Network Associate (CCNA) and Cisco Certified Wireless LAN Support Specialist (CCWLSS), and trained six other staff members to pass their CCNA certifications.  \n \nNumerous outstanding performance awards and bonuses have been earned during my tenure at Cisco Systems, Inc. Lead Technical Writer Cisco Systems, Inc. July 1996  – Present (19 years 2 months) San Jose, CA Cisco Systems core business is developing and manufacturing a range of networking products, including routers, switches, and access points. In the past I have lead the documentation efforts for core products, such as routers and switches, used for voice, video, and data communications in wired and wireless environments. \n \nThe audience for these products varies from small business users with little networking experience to professional system administrators with extensive industry experience. (I even wrote some instructions for actual rocket scientists, as the Cisco 3200 Router has been used on the Mars probes and the space shuttle.) \n \nThe delivery systems for this content has ranged from MAN pages to GUI-based, context-sensitive online help. More recently I have been developing content in XML and DITA for Web publishing. \n \nThe hardware and software products for which I have developed documentation include: \n-- Cisco Configuration Assistant (CCA) \n-- CiscoWorks for Windows \n-- Cisco Router Web Setup (CRWS)  \n-- Cisco 3200, 1800, 800, and 500 Series wired and wireless routers \n-- Cisco Small Business 200, 300, and 500 series switches. \n-- Cisco Small Business 100, 200, and 300 series routers \n-- Cisco Small Business 500 series access points \n \nEarned Cisco Certified Network Associate (CCNA) and Cisco Certified Wireless LAN Support Specialist (CCWLSS), and trained six other staff members to pass their CCNA certifications.  \n \nNumerous outstanding performance awards and bonuses have been earned during my tenure at Cisco Systems, Inc. Senior Information Developer EDS Technologies May 1994  –  July 1996  (2 years 3 months) San Jose, CA EDS provided high-tech documentation solutions and technical writing services to other companies in the Silicon Valley. I was assigned to document high-end UNIX servers for Siemens Nexdorf. \n \nLed the Optional Software Products Documentation Group. We produced the software documentation for computer language development tools and network communications products. Documentation included: \n \n-- ANSI C Programmer's Guide \n-- Reliant Cluster Networking Guide \n-- MAN Pages (produced by using vi)  \n \nLed the EDS Technology Team that was charged with researching trends, implementing processes and maintaining the tools that would keep the company on the front edge of desktop publishing technologies. For example, we set up a system to automatically convert all Framemaker documentation to PDF, prepare it for delivery on a CD (a new idea at the time), and dynamically build an HTML front end that included global index links and catalog searches. Senior Information Developer EDS Technologies May 1994  –  July 1996  (2 years 3 months) San Jose, CA EDS provided high-tech documentation solutions and technical writing services to other companies in the Silicon Valley. I was assigned to document high-end UNIX servers for Siemens Nexdorf. \n \nLed the Optional Software Products Documentation Group. We produced the software documentation for computer language development tools and network communications products. Documentation included: \n \n-- ANSI C Programmer's Guide \n-- Reliant Cluster Networking Guide \n-- MAN Pages (produced by using vi)  \n \nLed the EDS Technology Team that was charged with researching trends, implementing processes and maintaining the tools that would keep the company on the front edge of desktop publishing technologies. For example, we set up a system to automatically convert all Framemaker documentation to PDF, prepare it for delivery on a CD (a new idea at the time), and dynamically build an HTML front end that included global index links and catalog searches. Technical Writer and System Administrator Network Application Technologies (NAT) January 1993  –  June 1994  (1 year 6 months) Campbell, CA Network Application Technology was a start-up company that produced TCP/IP network monitoring hardware and software products, routers, switches, and bridges.  \n \nI wrote user guides for networking novices, including the EtherMeter/450 User Guide that won Communications Week annual MAC award in 1994. I also designed documents, templates, online help, and implemented other processes to maintain consistency between writers by using and style sheets and reusable data dictionaries.  \n \nAs a part-time System Administrator, I repaired and upgraded computers, managed the department network, and implemented archiving procedures that saved the company thousands of dollars when a server crash destroyed all technical publications on the main server. Technical Writer and System Administrator Network Application Technologies (NAT) January 1993  –  June 1994  (1 year 6 months) Campbell, CA Network Application Technology was a start-up company that produced TCP/IP network monitoring hardware and software products, routers, switches, and bridges.  \n \nI wrote user guides for networking novices, including the EtherMeter/450 User Guide that won Communications Week annual MAC award in 1994. I also designed documents, templates, online help, and implemented other processes to maintain consistency between writers by using and style sheets and reusable data dictionaries.  \n \nAs a part-time System Administrator, I repaired and upgraded computers, managed the department network, and implemented archiving procedures that saved the company thousands of dollars when a server crash destroyed all technical publications on the main server. Skills Telephony Operating Systems Project Management Network Engineering Cisco Certified Technical Writing Cisco Routing &... Wireless Networking FrameMaker Web 2.0 Routing Protocols SaaS WiFi ClearCase Gateway CCNP Enterprise Software Pre-sales HTML DITA XML Pdf Router Configuration Single Sourcing Voice Networking Routers Technical Documentation Switchgear CCNA TCP/IP Network Architecture Online Help Cisco Routers Manuals Software Documentation XMetal Switches RoboHelp Networking Wireless Linux Cisco IOS Troubleshooting Unix System Administration QoS IPv6 IPSec SNMP Hardware See 35+     See less Skills  Telephony Operating Systems Project Management Network Engineering Cisco Certified Technical Writing Cisco Routing &... Wireless Networking FrameMaker Web 2.0 Routing Protocols SaaS WiFi ClearCase Gateway CCNP Enterprise Software Pre-sales HTML DITA XML Pdf Router Configuration Single Sourcing Voice Networking Routers Technical Documentation Switchgear CCNA TCP/IP Network Architecture Online Help Cisco Routers Manuals Software Documentation XMetal Switches RoboHelp Networking Wireless Linux Cisco IOS Troubleshooting Unix System Administration QoS IPv6 IPSec SNMP Hardware See 35+     See less Telephony Operating Systems Project Management Network Engineering Cisco Certified Technical Writing Cisco Routing &... Wireless Networking FrameMaker Web 2.0 Routing Protocols SaaS WiFi ClearCase Gateway CCNP Enterprise Software Pre-sales HTML DITA XML Pdf Router Configuration Single Sourcing Voice Networking Routers Technical Documentation Switchgear CCNA TCP/IP Network Architecture Online Help Cisco Routers Manuals Software Documentation XMetal Switches RoboHelp Networking Wireless Linux Cisco IOS Troubleshooting Unix System Administration QoS IPv6 IPSec SNMP Hardware See 35+     See less Telephony Operating Systems Project Management Network Engineering Cisco Certified Technical Writing Cisco Routing &... Wireless Networking FrameMaker Web 2.0 Routing Protocols SaaS WiFi ClearCase Gateway CCNP Enterprise Software Pre-sales HTML DITA XML Pdf Router Configuration Single Sourcing Voice Networking Routers Technical Documentation Switchgear CCNA TCP/IP Network Architecture Online Help Cisco Routers Manuals Software Documentation XMetal Switches RoboHelp Networking Wireless Linux Cisco IOS Troubleshooting Unix System Administration QoS IPv6 IPSec SNMP Hardware See 35+     See less Education Cabrillo College AS,  Computer and Networking Systems 2002  – 2008 As an extension of the Cisco certifications, I trained in a broad range of web, Internet, and networking skills. This included developing basic programming, database, security, and web page development and design skills. Activities and Societies:  Led a team of students to design a wireless network for the San Francisco Exploratorium. California State University-Sacramento BA,  Journalism and Communications 1978  – 1980 Graduated with a B. A. in Journalism. Wrote feature articles for the college paper. Started a family. Activities and Societies:  Dean's Honor List ,  National Ski Patrol La Sierra Activities and Societies:  Wrestling ,  Karate ,  and Skiing (National Ski Patrol) Cabrillo College AS,  Computer and Networking Systems 2002  – 2008 As an extension of the Cisco certifications, I trained in a broad range of web, Internet, and networking skills. This included developing basic programming, database, security, and web page development and design skills. Activities and Societies:  Led a team of students to design a wireless network for the San Francisco Exploratorium. Cabrillo College AS,  Computer and Networking Systems 2002  – 2008 As an extension of the Cisco certifications, I trained in a broad range of web, Internet, and networking skills. This included developing basic programming, database, security, and web page development and design skills. Activities and Societies:  Led a team of students to design a wireless network for the San Francisco Exploratorium. Cabrillo College AS,  Computer and Networking Systems 2002  – 2008 As an extension of the Cisco certifications, I trained in a broad range of web, Internet, and networking skills. This included developing basic programming, database, security, and web page development and design skills. Activities and Societies:  Led a team of students to design a wireless network for the San Francisco Exploratorium. California State University-Sacramento BA,  Journalism and Communications 1978  – 1980 Graduated with a B. A. in Journalism. Wrote feature articles for the college paper. Started a family. Activities and Societies:  Dean's Honor List ,  National Ski Patrol California State University-Sacramento BA,  Journalism and Communications 1978  – 1980 Graduated with a B. A. in Journalism. Wrote feature articles for the college paper. Started a family. Activities and Societies:  Dean's Honor List ,  National Ski Patrol California State University-Sacramento BA,  Journalism and Communications 1978  – 1980 Graduated with a B. A. in Journalism. Wrote feature articles for the college paper. Started a family. Activities and Societies:  Dean's Honor List ,  National Ski Patrol La Sierra Activities and Societies:  Wrestling ,  Karate ,  and Skiing (National Ski Patrol) La Sierra Activities and Societies:  Wrestling ,  Karate ,  and Skiing (National Ski Patrol) La Sierra Activities and Societies:  Wrestling ,  Karate ,  and Skiing (National Ski Patrol) Honors & Awards Additional Honors & Awards Cisco Certified Network Associate (CSCO10284765) \nCisco Certified Wireless LAN Support Specialist (CCWLSS) Additional Honors & Awards Cisco Certified Network Associate (CSCO10284765) \nCisco Certified Wireless LAN Support Specialist (CCWLSS) Additional Honors & Awards Cisco Certified Network Associate (CSCO10284765) \nCisco Certified Wireless LAN Support Specialist (CCWLSS) Additional Honors & Awards Cisco Certified Network Associate (CSCO10284765) \nCisco Certified Wireless LAN Support Specialist (CCWLSS) ", "Skills XMetal DITA FrameMaker Online Help RoboHelp Skills  XMetal DITA FrameMaker Online Help RoboHelp XMetal DITA FrameMaker Online Help RoboHelp XMetal DITA FrameMaker Online Help RoboHelp ", "Experience Lead Technical Writer Cisco May 2014  – Present (1 year 4 months) Manage team collaboration sites \nCollaborate with SMEs to create and update team documentation: \n• Run books \n• Operational Support Manuals \n• Troubleshooting guides \n• Onboarding Guides \n• Process flows Instructional Design Intern Design Harmonic January 2014  –  May 2014  (5 months) Created new hire training materials:  \n•Presentations \n•Documents \n•Assessments \nEdited and format existing documents Research Assistant North Carolina State University January 2014  –  May 2014  (5 months) Raleigh-Durham, North Carolina Area Managed data collection projects \nAssisted staff in revising surveys Communications Intern Park Scholarships at North Carolina State University August 2013  –  May 2014  (10 months) Conduct interviews with current scholars and alumni \nWrite stories for newsletters and publications \nFollow up with featured scholars to approve content for publication Lead Technical Writer Cisco May 2014  – Present (1 year 4 months) Manage team collaboration sites \nCollaborate with SMEs to create and update team documentation: \n• Run books \n• Operational Support Manuals \n• Troubleshooting guides \n• Onboarding Guides \n• Process flows Lead Technical Writer Cisco May 2014  – Present (1 year 4 months) Manage team collaboration sites \nCollaborate with SMEs to create and update team documentation: \n• Run books \n• Operational Support Manuals \n• Troubleshooting guides \n• Onboarding Guides \n• Process flows Instructional Design Intern Design Harmonic January 2014  –  May 2014  (5 months) Created new hire training materials:  \n•Presentations \n•Documents \n•Assessments \nEdited and format existing documents Instructional Design Intern Design Harmonic January 2014  –  May 2014  (5 months) Created new hire training materials:  \n•Presentations \n•Documents \n•Assessments \nEdited and format existing documents Research Assistant North Carolina State University January 2014  –  May 2014  (5 months) Raleigh-Durham, North Carolina Area Managed data collection projects \nAssisted staff in revising surveys Research Assistant North Carolina State University January 2014  –  May 2014  (5 months) Raleigh-Durham, North Carolina Area Managed data collection projects \nAssisted staff in revising surveys Communications Intern Park Scholarships at North Carolina State University August 2013  –  May 2014  (10 months) Conduct interviews with current scholars and alumni \nWrite stories for newsletters and publications \nFollow up with featured scholars to approve content for publication Communications Intern Park Scholarships at North Carolina State University August 2013  –  May 2014  (10 months) Conduct interviews with current scholars and alumni \nWrite stories for newsletters and publications \nFollow up with featured scholars to approve content for publication Languages German Professional working proficiency German Professional working proficiency German Professional working proficiency Professional working proficiency Skills Technical Writing Editing Social Media Facebook Customer Service Adobe Creative Suite Dreamweaver InDesign PowerPoint MadCap Flare Microsoft Excel Instructional Design Visio Photoshop Adobe Fireworks RoboHelp Java Captivate Eclipse Google Docs Microsoft Office Writing MS Excel Pivot Tables Research Newsletters Microsoft Word Communication See 12+     See less Skills  Technical Writing Editing Social Media Facebook Customer Service Adobe Creative Suite Dreamweaver InDesign PowerPoint MadCap Flare Microsoft Excel Instructional Design Visio Photoshop Adobe Fireworks RoboHelp Java Captivate Eclipse Google Docs Microsoft Office Writing MS Excel Pivot Tables Research Newsletters Microsoft Word Communication See 12+     See less Technical Writing Editing Social Media Facebook Customer Service Adobe Creative Suite Dreamweaver InDesign PowerPoint MadCap Flare Microsoft Excel Instructional Design Visio Photoshop Adobe Fireworks RoboHelp Java Captivate Eclipse Google Docs Microsoft Office Writing MS Excel Pivot Tables Research Newsletters Microsoft Word Communication See 12+     See less Technical Writing Editing Social Media Facebook Customer Service Adobe Creative Suite Dreamweaver InDesign PowerPoint MadCap Flare Microsoft Excel Instructional Design Visio Photoshop Adobe Fireworks RoboHelp Java Captivate Eclipse Google Docs Microsoft Office Writing MS Excel Pivot Tables Research Newsletters Microsoft Word Communication See 12+     See less Education North Carolina State University Bachelor of Arts (B.A.),  English: Language ,  Writing ,  and Rhetoric 2009  – 2016 Relevant coursework: Advanced Technical Writing, Editing and Document Design, Technical Document Design, Editing, Professional Internships, Rhetoric in Digital Media, Computing Environments, Introduction to Java, German North Carolina State University Bachelor of Arts (B.A.),  English: Language ,  Writing ,  and Rhetoric 2009  – 2016 Relevant coursework: Advanced Technical Writing, Editing and Document Design, Technical Document Design, Editing, Professional Internships, Rhetoric in Digital Media, Computing Environments, Introduction to Java, German North Carolina State University Bachelor of Arts (B.A.),  English: Language ,  Writing ,  and Rhetoric 2009  – 2016 Relevant coursework: Advanced Technical Writing, Editing and Document Design, Technical Document Design, Editing, Professional Internships, Rhetoric in Digital Media, Computing Environments, Introduction to Java, German North Carolina State University Bachelor of Arts (B.A.),  English: Language ,  Writing ,  and Rhetoric 2009  – 2016 Relevant coursework: Advanced Technical Writing, Editing and Document Design, Technical Document Design, Editing, Professional Internships, Rhetoric in Digital Media, Computing Environments, Introduction to Java, German Honors & Awards ", "Summary To summarize, I have been in Technical writing field for more than 14+ years. Currently, I am working with Sonus Networks as a Lead Technical Writer.  \n \nUse my technical skillset gained through CCNA/CCNP switch certifications and Cisco (Networking) and Symantec experience (Storage) to add more value towards providing useful solutions for highly complex concepts.  \n \nCollaborate with engineers and technical support team to provide solutions for complex storage/networking concepts. Pursue certifications related to product and work, which provides thorough understanding of the product and as a result would help in adding more value for documentation. \n \nAim to become a subject-matter expert for the particular product, which I am assigned by gaining knowledge at-par with Developers. \n \nBefore this worked with Symantec as Sr.Education Course Dev on Storage domain. Job responsibilities were to prepare certification material and lab material for storage product.  \n \nPreviously, I was with Cisco Systems for 4+ years. I have a unique skill set of Masters in English Literature and technical acumen through Cisco Certifications.  \n \nProvide quality documentation with technical accuracy which enables solving complex technicalities through crisp and easy-to-understand language. \n \nI have worked on hardware and software documentation. Range of guides, i have worked on are: Hardware installation guide, software configuration guide, command reference guide, feature guides, behavioural change docs, maintain and troubleshooting guide, and release notes.  \n \nI have worked on Wiki Confluence, JIRA, Adobe Framemaker, Adobe Acrobat Professional, Visio, Snagit, DITA, XMetal, MS office, Adobe Captivate, Adobe Presenter documentation tools. Summary To summarize, I have been in Technical writing field for more than 14+ years. Currently, I am working with Sonus Networks as a Lead Technical Writer.  \n \nUse my technical skillset gained through CCNA/CCNP switch certifications and Cisco (Networking) and Symantec experience (Storage) to add more value towards providing useful solutions for highly complex concepts.  \n \nCollaborate with engineers and technical support team to provide solutions for complex storage/networking concepts. Pursue certifications related to product and work, which provides thorough understanding of the product and as a result would help in adding more value for documentation. \n \nAim to become a subject-matter expert for the particular product, which I am assigned by gaining knowledge at-par with Developers. \n \nBefore this worked with Symantec as Sr.Education Course Dev on Storage domain. Job responsibilities were to prepare certification material and lab material for storage product.  \n \nPreviously, I was with Cisco Systems for 4+ years. I have a unique skill set of Masters in English Literature and technical acumen through Cisco Certifications.  \n \nProvide quality documentation with technical accuracy which enables solving complex technicalities through crisp and easy-to-understand language. \n \nI have worked on hardware and software documentation. Range of guides, i have worked on are: Hardware installation guide, software configuration guide, command reference guide, feature guides, behavioural change docs, maintain and troubleshooting guide, and release notes.  \n \nI have worked on Wiki Confluence, JIRA, Adobe Framemaker, Adobe Acrobat Professional, Visio, Snagit, DITA, XMetal, MS office, Adobe Captivate, Adobe Presenter documentation tools. To summarize, I have been in Technical writing field for more than 14+ years. Currently, I am working with Sonus Networks as a Lead Technical Writer.  \n \nUse my technical skillset gained through CCNA/CCNP switch certifications and Cisco (Networking) and Symantec experience (Storage) to add more value towards providing useful solutions for highly complex concepts.  \n \nCollaborate with engineers and technical support team to provide solutions for complex storage/networking concepts. Pursue certifications related to product and work, which provides thorough understanding of the product and as a result would help in adding more value for documentation. \n \nAim to become a subject-matter expert for the particular product, which I am assigned by gaining knowledge at-par with Developers. \n \nBefore this worked with Symantec as Sr.Education Course Dev on Storage domain. Job responsibilities were to prepare certification material and lab material for storage product.  \n \nPreviously, I was with Cisco Systems for 4+ years. I have a unique skill set of Masters in English Literature and technical acumen through Cisco Certifications.  \n \nProvide quality documentation with technical accuracy which enables solving complex technicalities through crisp and easy-to-understand language. \n \nI have worked on hardware and software documentation. Range of guides, i have worked on are: Hardware installation guide, software configuration guide, command reference guide, feature guides, behavioural change docs, maintain and troubleshooting guide, and release notes.  \n \nI have worked on Wiki Confluence, JIRA, Adobe Framemaker, Adobe Acrobat Professional, Visio, Snagit, DITA, XMetal, MS office, Adobe Captivate, Adobe Presenter documentation tools. To summarize, I have been in Technical writing field for more than 14+ years. Currently, I am working with Sonus Networks as a Lead Technical Writer.  \n \nUse my technical skillset gained through CCNA/CCNP switch certifications and Cisco (Networking) and Symantec experience (Storage) to add more value towards providing useful solutions for highly complex concepts.  \n \nCollaborate with engineers and technical support team to provide solutions for complex storage/networking concepts. Pursue certifications related to product and work, which provides thorough understanding of the product and as a result would help in adding more value for documentation. \n \nAim to become a subject-matter expert for the particular product, which I am assigned by gaining knowledge at-par with Developers. \n \nBefore this worked with Symantec as Sr.Education Course Dev on Storage domain. Job responsibilities were to prepare certification material and lab material for storage product.  \n \nPreviously, I was with Cisco Systems for 4+ years. I have a unique skill set of Masters in English Literature and technical acumen through Cisco Certifications.  \n \nProvide quality documentation with technical accuracy which enables solving complex technicalities through crisp and easy-to-understand language. \n \nI have worked on hardware and software documentation. Range of guides, i have worked on are: Hardware installation guide, software configuration guide, command reference guide, feature guides, behavioural change docs, maintain and troubleshooting guide, and release notes.  \n \nI have worked on Wiki Confluence, JIRA, Adobe Framemaker, Adobe Acrobat Professional, Visio, Snagit, DITA, XMetal, MS office, Adobe Captivate, Adobe Presenter documentation tools. Experience Lead Technical Writer Sonus Networks September 2013  – Present (2 years) Bengaluru Area, India -Provide documentation for an NMS product. \n-Range of guides include: Hardware and Software Installation and Configuration Guide, Quick Start Guides (QSGs), Resolve documentation bugs, pitch-in and guide team-members in crunch situations. \n-Other duties, involve scoping documentation for upcoming releases, schedule doc efforts and resources, track documentation completion for GA and Sustaining Releases, attend Meetings, and provide doc status as well as track any changes or updates related with schedule or doc assignments. \n-Practically install product to better understand the installation/upgrade procedure. \n-Well versed with Linux, SAN concepts, Networking, HPG8, IBM RAIDs. Sr.Education Course Developer Symantec August 2012  –  September 2013  (1 year 2 months) Develop course material on storage products for students. Worked on developing Instructor lead trainings (ILT) and Web based trainings. Install the product, configure the product, and perform lab simulations practically. Develop lab material for students. \n \nHands-on practical experience working on Storage Foundation (SF), SF cluster-file-system (SFCFS), and SFRAC. Technical Writer Cisco Systems, Inc August 2007  –  September 2011  (4 years 2 months) Working as Team Lead for documentation for one of the Cisco Routers series. Work involves working in fast paced environments, and communicating with engineers across the globe. Working on multiple guides at the same time and providing qualitative documentation. Technical Writer Cisco Systems 2007  –  2011  (4 years) -Responsible for documenting Hardware Installation Guides, SIP/SPA Software config guides, behavioral change documents, release notes. \n-Interacting with SMEs spread across the globe and understanding the feature thoroughly before writing for customers. \n-Document command reference guides, Regulatory compliance documents adhering to various NEBS standards. \n-Attend engineering and product meetings at various software development stages, example Concept Commit (CC), Execution Commit (EC), and before FCS. \n-Publish the content on cisco web site using the tools. Sr. Technical Writer Cybage Software Pvt Ltd August 2006  –  July 2007  (1 year) Worked on a Network and Security related product that deals with advanced networking concepts like High Availability, Layer 2 and Layer 3 concepts, VLAN, VPN, Ingress and Egress traffic, Port mirroring, various authentication types (Kerberos, Captive Portal, Dot1x, MAC, MAC + IP), DMZ, Protocol Anomaly, Behavior Anomaly, Virus, Worms; developing Signatures for Worms, daily updates of Signatures and threats, DoS and PoD attacks, and much more. I would be highly interested in working in Network and Security related world renowned companies.  \nCreated Administration Guide, Command Line Reference Guide, Release Notes, Application Notes, Troubleshooting and Error Message Guide, and Getting Started Guide documents. Technical writer Cimcon Software Pvt. Ltd. India July 2004  –  May 2006  (1 year 11 months) My work profile involves writing User Guides, Installation Guides, OQ's, IQ's in simple and easy to understand language. Work is allotted from US and we are required to upload the same everyday. I have also been writing Operational Qualification that is testing the verification of Functional Specification statements. I am required to create Web based Help using Dreamweaver and creating CHM help files using HTML Help Workshop. The products in our Company are Part11 Solutions compliant which is the requirement currently in US for Pharmaceutical companies - it's brief features include Electronic Signature, Audit Trail. Our products provide various Add-Inns (using VBA code) for Microsoft Office Products such as Excel, Access, Word, and Powerpoint. Our key products are eInfotree, which is similar to Visual Source Safe but apart from that it provides more features such as file comparison of different versions of a document. Technical writer Elitecore Technologies Ltd August 2001  –  June 2004  (2 years 11 months) - 3 Years \nDuring the span of 3 years; I have been involved in writing user and installation guides, Console Guide, Trouble Shooting Guide, Operational Flow for numerous software products listed on the following page. I have also created MS Power Point presentations for customers, describing our new software products. As I was the only Technical Writer initially I had created User Guides of almost all the Software prepared in our Company. Lead Technical Writer Sonus Networks September 2013  – Present (2 years) Bengaluru Area, India -Provide documentation for an NMS product. \n-Range of guides include: Hardware and Software Installation and Configuration Guide, Quick Start Guides (QSGs), Resolve documentation bugs, pitch-in and guide team-members in crunch situations. \n-Other duties, involve scoping documentation for upcoming releases, schedule doc efforts and resources, track documentation completion for GA and Sustaining Releases, attend Meetings, and provide doc status as well as track any changes or updates related with schedule or doc assignments. \n-Practically install product to better understand the installation/upgrade procedure. \n-Well versed with Linux, SAN concepts, Networking, HPG8, IBM RAIDs. Lead Technical Writer Sonus Networks September 2013  – Present (2 years) Bengaluru Area, India -Provide documentation for an NMS product. \n-Range of guides include: Hardware and Software Installation and Configuration Guide, Quick Start Guides (QSGs), Resolve documentation bugs, pitch-in and guide team-members in crunch situations. \n-Other duties, involve scoping documentation for upcoming releases, schedule doc efforts and resources, track documentation completion for GA and Sustaining Releases, attend Meetings, and provide doc status as well as track any changes or updates related with schedule or doc assignments. \n-Practically install product to better understand the installation/upgrade procedure. \n-Well versed with Linux, SAN concepts, Networking, HPG8, IBM RAIDs. Sr.Education Course Developer Symantec August 2012  –  September 2013  (1 year 2 months) Develop course material on storage products for students. Worked on developing Instructor lead trainings (ILT) and Web based trainings. Install the product, configure the product, and perform lab simulations practically. Develop lab material for students. \n \nHands-on practical experience working on Storage Foundation (SF), SF cluster-file-system (SFCFS), and SFRAC. Sr.Education Course Developer Symantec August 2012  –  September 2013  (1 year 2 months) Develop course material on storage products for students. Worked on developing Instructor lead trainings (ILT) and Web based trainings. Install the product, configure the product, and perform lab simulations practically. Develop lab material for students. \n \nHands-on practical experience working on Storage Foundation (SF), SF cluster-file-system (SFCFS), and SFRAC. Technical Writer Cisco Systems, Inc August 2007  –  September 2011  (4 years 2 months) Working as Team Lead for documentation for one of the Cisco Routers series. Work involves working in fast paced environments, and communicating with engineers across the globe. Working on multiple guides at the same time and providing qualitative documentation. Technical Writer Cisco Systems, Inc August 2007  –  September 2011  (4 years 2 months) Working as Team Lead for documentation for one of the Cisco Routers series. Work involves working in fast paced environments, and communicating with engineers across the globe. Working on multiple guides at the same time and providing qualitative documentation. Technical Writer Cisco Systems 2007  –  2011  (4 years) -Responsible for documenting Hardware Installation Guides, SIP/SPA Software config guides, behavioral change documents, release notes. \n-Interacting with SMEs spread across the globe and understanding the feature thoroughly before writing for customers. \n-Document command reference guides, Regulatory compliance documents adhering to various NEBS standards. \n-Attend engineering and product meetings at various software development stages, example Concept Commit (CC), Execution Commit (EC), and before FCS. \n-Publish the content on cisco web site using the tools. Technical Writer Cisco Systems 2007  –  2011  (4 years) -Responsible for documenting Hardware Installation Guides, SIP/SPA Software config guides, behavioral change documents, release notes. \n-Interacting with SMEs spread across the globe and understanding the feature thoroughly before writing for customers. \n-Document command reference guides, Regulatory compliance documents adhering to various NEBS standards. \n-Attend engineering and product meetings at various software development stages, example Concept Commit (CC), Execution Commit (EC), and before FCS. \n-Publish the content on cisco web site using the tools. Sr. Technical Writer Cybage Software Pvt Ltd August 2006  –  July 2007  (1 year) Worked on a Network and Security related product that deals with advanced networking concepts like High Availability, Layer 2 and Layer 3 concepts, VLAN, VPN, Ingress and Egress traffic, Port mirroring, various authentication types (Kerberos, Captive Portal, Dot1x, MAC, MAC + IP), DMZ, Protocol Anomaly, Behavior Anomaly, Virus, Worms; developing Signatures for Worms, daily updates of Signatures and threats, DoS and PoD attacks, and much more. I would be highly interested in working in Network and Security related world renowned companies.  \nCreated Administration Guide, Command Line Reference Guide, Release Notes, Application Notes, Troubleshooting and Error Message Guide, and Getting Started Guide documents. Sr. Technical Writer Cybage Software Pvt Ltd August 2006  –  July 2007  (1 year) Worked on a Network and Security related product that deals with advanced networking concepts like High Availability, Layer 2 and Layer 3 concepts, VLAN, VPN, Ingress and Egress traffic, Port mirroring, various authentication types (Kerberos, Captive Portal, Dot1x, MAC, MAC + IP), DMZ, Protocol Anomaly, Behavior Anomaly, Virus, Worms; developing Signatures for Worms, daily updates of Signatures and threats, DoS and PoD attacks, and much more. I would be highly interested in working in Network and Security related world renowned companies.  \nCreated Administration Guide, Command Line Reference Guide, Release Notes, Application Notes, Troubleshooting and Error Message Guide, and Getting Started Guide documents. Technical writer Cimcon Software Pvt. Ltd. India July 2004  –  May 2006  (1 year 11 months) My work profile involves writing User Guides, Installation Guides, OQ's, IQ's in simple and easy to understand language. Work is allotted from US and we are required to upload the same everyday. I have also been writing Operational Qualification that is testing the verification of Functional Specification statements. I am required to create Web based Help using Dreamweaver and creating CHM help files using HTML Help Workshop. The products in our Company are Part11 Solutions compliant which is the requirement currently in US for Pharmaceutical companies - it's brief features include Electronic Signature, Audit Trail. Our products provide various Add-Inns (using VBA code) for Microsoft Office Products such as Excel, Access, Word, and Powerpoint. Our key products are eInfotree, which is similar to Visual Source Safe but apart from that it provides more features such as file comparison of different versions of a document. Technical writer Cimcon Software Pvt. Ltd. India July 2004  –  May 2006  (1 year 11 months) My work profile involves writing User Guides, Installation Guides, OQ's, IQ's in simple and easy to understand language. Work is allotted from US and we are required to upload the same everyday. I have also been writing Operational Qualification that is testing the verification of Functional Specification statements. I am required to create Web based Help using Dreamweaver and creating CHM help files using HTML Help Workshop. The products in our Company are Part11 Solutions compliant which is the requirement currently in US for Pharmaceutical companies - it's brief features include Electronic Signature, Audit Trail. Our products provide various Add-Inns (using VBA code) for Microsoft Office Products such as Excel, Access, Word, and Powerpoint. Our key products are eInfotree, which is similar to Visual Source Safe but apart from that it provides more features such as file comparison of different versions of a document. Technical writer Elitecore Technologies Ltd August 2001  –  June 2004  (2 years 11 months) - 3 Years \nDuring the span of 3 years; I have been involved in writing user and installation guides, Console Guide, Trouble Shooting Guide, Operational Flow for numerous software products listed on the following page. I have also created MS Power Point presentations for customers, describing our new software products. As I was the only Technical Writer initially I had created User Guides of almost all the Software prepared in our Company. Technical writer Elitecore Technologies Ltd August 2001  –  June 2004  (2 years 11 months) - 3 Years \nDuring the span of 3 years; I have been involved in writing user and installation guides, Console Guide, Trouble Shooting Guide, Operational Flow for numerous software products listed on the following page. I have also created MS Power Point presentations for customers, describing our new software products. As I was the only Technical Writer initially I had created User Guides of almost all the Software prepared in our Company. Skills CCNA Certified CCNP Switch certified Storage Solutions Storage Management FrameMaker OSPF DITA XMetal Cisco Technologies Technical Writing CCNA Software Documentation Manuals EIGRP Routing Veritas Storage... Visio Documentation DITA XML Release Notes RIP STP GLBP HSRP Static routing Default routing 4 yrs Cisco Technical... Ether channel (link... zone based firewall ACL NAT/PAT/DNAT Adobe Framemaker SnagIt See 18+     See less Skills  CCNA Certified CCNP Switch certified Storage Solutions Storage Management FrameMaker OSPF DITA XMetal Cisco Technologies Technical Writing CCNA Software Documentation Manuals EIGRP Routing Veritas Storage... Visio Documentation DITA XML Release Notes RIP STP GLBP HSRP Static routing Default routing 4 yrs Cisco Technical... Ether channel (link... zone based firewall ACL NAT/PAT/DNAT Adobe Framemaker SnagIt See 18+     See less CCNA Certified CCNP Switch certified Storage Solutions Storage Management FrameMaker OSPF DITA XMetal Cisco Technologies Technical Writing CCNA Software Documentation Manuals EIGRP Routing Veritas Storage... Visio Documentation DITA XML Release Notes RIP STP GLBP HSRP Static routing Default routing 4 yrs Cisco Technical... Ether channel (link... zone based firewall ACL NAT/PAT/DNAT Adobe Framemaker SnagIt See 18+     See less CCNA Certified CCNP Switch certified Storage Solutions Storage Management FrameMaker OSPF DITA XMetal Cisco Technologies Technical Writing CCNA Software Documentation Manuals EIGRP Routing Veritas Storage... Visio Documentation DITA XML Release Notes RIP STP GLBP HSRP Static routing Default routing 4 yrs Cisco Technical... Ether channel (link... zone based firewall ACL NAT/PAT/DNAT Adobe Framemaker SnagIt See 18+     See less Education Gujarat University M.A.,  English Literature 1998  – 2000 Gujarat University Master of Arts,  English Literature 1998  – 2000 Gujarat University Bachelor of Arts,  English Literature 1995  – 1998 R.A.Bhavans College B.A.,  English 1995  – 1998 Bhavans College Ahmedabad B.A.,  English Literature 1994  – 1998 Gujarat University M.A.,  English Literature 1998  – 2000 Gujarat University M.A.,  English Literature 1998  – 2000 Gujarat University M.A.,  English Literature 1998  – 2000 Gujarat University Master of Arts,  English Literature 1998  – 2000 Gujarat University Master of Arts,  English Literature 1998  – 2000 Gujarat University Master of Arts,  English Literature 1998  – 2000 Gujarat University Bachelor of Arts,  English Literature 1995  – 1998 Gujarat University Bachelor of Arts,  English Literature 1995  – 1998 Gujarat University Bachelor of Arts,  English Literature 1995  – 1998 R.A.Bhavans College B.A.,  English 1995  – 1998 R.A.Bhavans College B.A.,  English 1995  – 1998 R.A.Bhavans College B.A.,  English 1995  – 1998 Bhavans College Ahmedabad B.A.,  English Literature 1994  – 1998 Bhavans College Ahmedabad B.A.,  English Literature 1994  – 1998 Bhavans College Ahmedabad B.A.,  English Literature 1994  – 1998 ", "Summary Project manager and team leader with over 7 years of project management experience in leading globally diverse teams in the achievement of successful delivery of customer documentation on extremely tight schedules and across global boundaries. Diversely skilled technical writer and project leader with over 22 years of technical writing experience for defense, broadcast, telecommunications, and internet industries across the complete spectrum of audiences from end-user to senior level executives. Adept learner who acquires knowledge of new tools, assimilates new technologies, and immerses into new industries rapidly. \n \nSpecialties: Project manager with knowledge in all project phases and processes per the Project Management Body of Knowledge (PMBOK). \n \nHighly skilled technical writer with experience in authoring site preparation plans, site installation plans, system operation guides, end-user guides, software operation manuals, hardware operation manuals, troubleshooting guides, installation, setup, and test guides, test plans, on-line help, telecom user manuals, telecom feature guides, and many others. Summary Project manager and team leader with over 7 years of project management experience in leading globally diverse teams in the achievement of successful delivery of customer documentation on extremely tight schedules and across global boundaries. Diversely skilled technical writer and project leader with over 22 years of technical writing experience for defense, broadcast, telecommunications, and internet industries across the complete spectrum of audiences from end-user to senior level executives. Adept learner who acquires knowledge of new tools, assimilates new technologies, and immerses into new industries rapidly. \n \nSpecialties: Project manager with knowledge in all project phases and processes per the Project Management Body of Knowledge (PMBOK). \n \nHighly skilled technical writer with experience in authoring site preparation plans, site installation plans, system operation guides, end-user guides, software operation manuals, hardware operation manuals, troubleshooting guides, installation, setup, and test guides, test plans, on-line help, telecom user manuals, telecom feature guides, and many others. Project manager and team leader with over 7 years of project management experience in leading globally diverse teams in the achievement of successful delivery of customer documentation on extremely tight schedules and across global boundaries. Diversely skilled technical writer and project leader with over 22 years of technical writing experience for defense, broadcast, telecommunications, and internet industries across the complete spectrum of audiences from end-user to senior level executives. Adept learner who acquires knowledge of new tools, assimilates new technologies, and immerses into new industries rapidly. \n \nSpecialties: Project manager with knowledge in all project phases and processes per the Project Management Body of Knowledge (PMBOK). \n \nHighly skilled technical writer with experience in authoring site preparation plans, site installation plans, system operation guides, end-user guides, software operation manuals, hardware operation manuals, troubleshooting guides, installation, setup, and test guides, test plans, on-line help, telecom user manuals, telecom feature guides, and many others. Project manager and team leader with over 7 years of project management experience in leading globally diverse teams in the achievement of successful delivery of customer documentation on extremely tight schedules and across global boundaries. Diversely skilled technical writer and project leader with over 22 years of technical writing experience for defense, broadcast, telecommunications, and internet industries across the complete spectrum of audiences from end-user to senior level executives. Adept learner who acquires knowledge of new tools, assimilates new technologies, and immerses into new industries rapidly. \n \nSpecialties: Project manager with knowledge in all project phases and processes per the Project Management Body of Knowledge (PMBOK). \n \nHighly skilled technical writer with experience in authoring site preparation plans, site installation plans, system operation guides, end-user guides, software operation manuals, hardware operation manuals, troubleshooting guides, installation, setup, and test guides, test plans, on-line help, telecom user manuals, telecom feature guides, and many others. Experience Principal Technical Writer Axway May 2014  – Present (1 year 4 months) Phoenix, Arizona Area Responsible for organizing, planning, and writing all customer documentation related to Axway’s SecureTransport product. Responsible for organizing, planning, and writing all customer documentation related to Axway’s Mobile Applications and Outlook Add-In. Responsible for assisting other technical writers on their assigned products. Responsible for providing documentation tool troubleshooting assistance to other team members. Responsible for mentoring and providing experience based knowledge to other team members. Senior Technical Writer Digital Reasoning Systems February 2012  –  February 2014  (2 years 1 month) Franklin, TN Organized, scheduled, and wrote all documentation related to Digital Reasoning’s Synthesys products. Conducted documentation reviews and edits. Wrote and contributed to multiple white-papers. Assisted in creating training materials. Used Confluence wiki to update and write documentation for Digital Reasoning’s products. Converted documentation from MS Word documents and Media wiki documents to Confluence wiki documents. Developed the CSS to export Confluence wiki into PDF documents for customer distribution. Wrote the documents for Digital Reasoning's Synthesys Cloud marketplace on the Amazon EC2 cloud. Program Manager Cisco Systems January 2010  –  July 2011  (1 year 7 months) Richardson, Texas Led and managed multiple global documentation teams and projects. Initiated, planned, monitored and controlled, and closed documentation projects for multiple Cisco products and solutions. Ensured documentation support for all stages of product life-cycle from concept to end-of-life. Lead Technical Writer Cisco Systems July 2005  –  December 2009  (4 years 6 months) Richardson, Texas Led the completion of multiple Cisco documentation product sets in a globally diverse team environment. Assigned team tasks and tracked the completion of the assigned tasks in addition to completing personal writing assignments and tasks. Wrote troubleshooting manuals and routing and translation manuals for multiple Cisco products. Led several releases and projects to successful completion and delivery. Coordinated projects and led members of the globally diverse documentation teams in the role of documentation lead writer. Made day-to-day project assignments and defect assignments. Converted specifications into end-user documentation sets and led the conversion of specifications into end-user documentation sets. Customer Support Engineer Cisco Systems November 2003  –  June 2005  (1 year 8 months) Richardson, Texas Wrote troubleshooting manuals to support and assist the customer in quickly resolving network problems. Managed the extended failure analysis of customer hardware and software defects. Troubleshoot and resolved issues with customer equipment and networks. Provided consultation to solve complex customer product and network problems. Provided systems and product training. Translated team goals into own work assignment. Used abilities to analyze, configure and troubleshoot medium to large networks. Test Engineer Cisco Systems June 2002  –  October 2003  (1 year 5 months) Richardson, Texas Tested and evaluated multiple software releases. Completed provisioning tests for multiple Cisco optical products. Completed network bridge and roll tests for multiple Cisco optical products. Wrote test case derived from software specifications and telecommunication standards for optical products. Helped team members complete additional test cases. Technical Writer Cisco Systems April 2000  –  May 2002  (2 years 2 months) Richardson, Texas Developed, wrote, and revised technical documents and documentation sets according to established standards. Identified, planned, and revised technical writing project requirements. Served as the lead writer for multiple product documentation sets. Assisted in the successful, on-time completion of several major system technical writing projects and documentation sets. Improved the quality and usability of multiple installation, setup, and test manuals. Tested and validated multiple installation, setup, and test manuals. Technical Writer CDI November 1999  –  April 2000  (6 months) Columbia, South Carolina Wrote system level technical manuals on contract to Cisco Systems. Technical Writer Quantum Resources August 1999  –  November 1999  (4 months) Huntsville, Alabama Developed, wrote, and revised technical specifications on contract to Lockheed Space and Defense. Participated in specification review meetings. Provided technical input to assist in technical problem resolution. Assisted in technical specification reviews. Technical Writer PESA May 1999  –  August 1999  (4 months) Huntsville, Alabama Produced system level documentation for a large-scale video switching system for Turner Broadcasting and AT&T on contract to Pesa. Technical Writer Manpower Technical October 1998  –  May 1999  (8 months) Columbia, Maryland Produced site survey reports for the Collocation Division of MCI World Com on contract to ABB Telecom Services. Gathered field data for documenting architectural, mechanical, electrical, fire detection, communication and equipment descriptions. Assessed sites to develop recommendations and defect corrections for inclusion in documents. Entered analyzed field data into collocation database. Supervised three other technical writers. Wrote, edited, and illustrated technical reports. Delivered technical reports to MCI World Com electronically via the Internet, on CD-ROM, and as hard copy. Provided final documents to management and collocation engineers for use in planning site expansions and future collocation hubs. Technical Writer Eaton SEO June 1998  –  October 1998  (5 months) Rockville, Maryland Wrote system level technical manuals for system programmers and integrated circuit (IC) engineers. Developed product support documentation including design specifications and field service technical data. Developed the procedures for servicing equipment, assembling equipment, and training personnel to operate the equipment. Interfaced with programmers and engineers to gather data on plasma, microwave, and hardware engineering. Acquired and documented the information on chemical mixes, robotics, and manufacturing processes. Produced manuals used by IC engineers to perfect the plasma and chemical processes used to ash and etch integrated circuits on silicon wafers and to modify robotic processes. Described graphical user interfaces. Assisted in the development of automated diagnostic, troubleshooting, and training procedures for use in multimedia documentation and computer-based training. Engineering Technical Writer PESA November 1994  –  June 1998  (3 years 8 months) Huntsville, Alabama Developed technical and service manuals and product support literature for technical and functional end users. Tested electronic equipment and the associated software programs. Interviewed engineers, programmers, and service technicians to gather relevant information. Reviewed schematics, assembly drawings, and other engineering documentation to develop data. Recommended organization and layout requirements on complex publication projects. Reviewed the technical literature prepared by internal staff for content, coverage, and clarity. Documented software descriptions and explanations of software functionality to the end users. Validated documentation against test results. Coordinated with software engineers and software programmers to improve graphical user interfaces. Compiled help files and on-line help for end users and internal software programmers. Technical Writer Advanced R&D August 1993  –  November 1994  (1 year 4 months) Huntsville, Alabama Prepared technical manuals for audio and video equipment manufactured by PESA. Wrote and illustrated operator, user, and maintenance technical manuals. Formatted manuals for delivery to printing activities. Wrote technical bulletins and sales brochures. Prepared engineering change orders. Technical Writer Loral Command and Control July 1989  –  August 1993  (4 years 2 months) Colorado Springs, Colorado Prepared installation engineering drawings and site installation plans for programs supported by the systems engineering team. Surveyed sites and developed installation plans for mainframe computer systems. Documented electrical routing, temperature controls, and equipment positions to produce installation plans. Interfaced with system engineers to develop requirements analysis for computer systems. Examined previous site surveys for errors and corrected documents as needed. Test and Measurement Laboratory Supervisor Ford Aerospace August 1986  –  July 1989  (3 years) Hanover, Maryland Supervised and mentored six test and measurement technicians. Tested and calibrated state of the art electronic equipment in a government test and measurement laboratory. Wrote and updated test and measurement procedures. Test Technician Austron November 1985  –  August 1986  (10 months) Austin, Texas Tested the time-code equipment manufactured by Austron. Assisted in updating the technical documentation. Test and Measurement Technician United States Air Force May 1979  –  November 1985  (6 years 7 months) Various Calibrated, tested, and repaired electronic test and measurement equipment. Led the calibration laboratory quality assurance program. Principal Technical Writer Axway May 2014  – Present (1 year 4 months) Phoenix, Arizona Area Responsible for organizing, planning, and writing all customer documentation related to Axway’s SecureTransport product. Responsible for organizing, planning, and writing all customer documentation related to Axway’s Mobile Applications and Outlook Add-In. Responsible for assisting other technical writers on their assigned products. Responsible for providing documentation tool troubleshooting assistance to other team members. Responsible for mentoring and providing experience based knowledge to other team members. Principal Technical Writer Axway May 2014  – Present (1 year 4 months) Phoenix, Arizona Area Responsible for organizing, planning, and writing all customer documentation related to Axway’s SecureTransport product. Responsible for organizing, planning, and writing all customer documentation related to Axway’s Mobile Applications and Outlook Add-In. Responsible for assisting other technical writers on their assigned products. Responsible for providing documentation tool troubleshooting assistance to other team members. Responsible for mentoring and providing experience based knowledge to other team members. Senior Technical Writer Digital Reasoning Systems February 2012  –  February 2014  (2 years 1 month) Franklin, TN Organized, scheduled, and wrote all documentation related to Digital Reasoning’s Synthesys products. Conducted documentation reviews and edits. Wrote and contributed to multiple white-papers. Assisted in creating training materials. Used Confluence wiki to update and write documentation for Digital Reasoning’s products. Converted documentation from MS Word documents and Media wiki documents to Confluence wiki documents. Developed the CSS to export Confluence wiki into PDF documents for customer distribution. Wrote the documents for Digital Reasoning's Synthesys Cloud marketplace on the Amazon EC2 cloud. Senior Technical Writer Digital Reasoning Systems February 2012  –  February 2014  (2 years 1 month) Franklin, TN Organized, scheduled, and wrote all documentation related to Digital Reasoning’s Synthesys products. Conducted documentation reviews and edits. Wrote and contributed to multiple white-papers. Assisted in creating training materials. Used Confluence wiki to update and write documentation for Digital Reasoning’s products. Converted documentation from MS Word documents and Media wiki documents to Confluence wiki documents. Developed the CSS to export Confluence wiki into PDF documents for customer distribution. Wrote the documents for Digital Reasoning's Synthesys Cloud marketplace on the Amazon EC2 cloud. Program Manager Cisco Systems January 2010  –  July 2011  (1 year 7 months) Richardson, Texas Led and managed multiple global documentation teams and projects. Initiated, planned, monitored and controlled, and closed documentation projects for multiple Cisco products and solutions. Ensured documentation support for all stages of product life-cycle from concept to end-of-life. Program Manager Cisco Systems January 2010  –  July 2011  (1 year 7 months) Richardson, Texas Led and managed multiple global documentation teams and projects. Initiated, planned, monitored and controlled, and closed documentation projects for multiple Cisco products and solutions. Ensured documentation support for all stages of product life-cycle from concept to end-of-life. Lead Technical Writer Cisco Systems July 2005  –  December 2009  (4 years 6 months) Richardson, Texas Led the completion of multiple Cisco documentation product sets in a globally diverse team environment. Assigned team tasks and tracked the completion of the assigned tasks in addition to completing personal writing assignments and tasks. Wrote troubleshooting manuals and routing and translation manuals for multiple Cisco products. Led several releases and projects to successful completion and delivery. Coordinated projects and led members of the globally diverse documentation teams in the role of documentation lead writer. Made day-to-day project assignments and defect assignments. Converted specifications into end-user documentation sets and led the conversion of specifications into end-user documentation sets. Lead Technical Writer Cisco Systems July 2005  –  December 2009  (4 years 6 months) Richardson, Texas Led the completion of multiple Cisco documentation product sets in a globally diverse team environment. Assigned team tasks and tracked the completion of the assigned tasks in addition to completing personal writing assignments and tasks. Wrote troubleshooting manuals and routing and translation manuals for multiple Cisco products. Led several releases and projects to successful completion and delivery. Coordinated projects and led members of the globally diverse documentation teams in the role of documentation lead writer. Made day-to-day project assignments and defect assignments. Converted specifications into end-user documentation sets and led the conversion of specifications into end-user documentation sets. Customer Support Engineer Cisco Systems November 2003  –  June 2005  (1 year 8 months) Richardson, Texas Wrote troubleshooting manuals to support and assist the customer in quickly resolving network problems. Managed the extended failure analysis of customer hardware and software defects. Troubleshoot and resolved issues with customer equipment and networks. Provided consultation to solve complex customer product and network problems. Provided systems and product training. Translated team goals into own work assignment. Used abilities to analyze, configure and troubleshoot medium to large networks. Customer Support Engineer Cisco Systems November 2003  –  June 2005  (1 year 8 months) Richardson, Texas Wrote troubleshooting manuals to support and assist the customer in quickly resolving network problems. Managed the extended failure analysis of customer hardware and software defects. Troubleshoot and resolved issues with customer equipment and networks. Provided consultation to solve complex customer product and network problems. Provided systems and product training. Translated team goals into own work assignment. Used abilities to analyze, configure and troubleshoot medium to large networks. Test Engineer Cisco Systems June 2002  –  October 2003  (1 year 5 months) Richardson, Texas Tested and evaluated multiple software releases. Completed provisioning tests for multiple Cisco optical products. Completed network bridge and roll tests for multiple Cisco optical products. Wrote test case derived from software specifications and telecommunication standards for optical products. Helped team members complete additional test cases. Test Engineer Cisco Systems June 2002  –  October 2003  (1 year 5 months) Richardson, Texas Tested and evaluated multiple software releases. Completed provisioning tests for multiple Cisco optical products. Completed network bridge and roll tests for multiple Cisco optical products. Wrote test case derived from software specifications and telecommunication standards for optical products. Helped team members complete additional test cases. Technical Writer Cisco Systems April 2000  –  May 2002  (2 years 2 months) Richardson, Texas Developed, wrote, and revised technical documents and documentation sets according to established standards. Identified, planned, and revised technical writing project requirements. Served as the lead writer for multiple product documentation sets. Assisted in the successful, on-time completion of several major system technical writing projects and documentation sets. Improved the quality and usability of multiple installation, setup, and test manuals. Tested and validated multiple installation, setup, and test manuals. Technical Writer Cisco Systems April 2000  –  May 2002  (2 years 2 months) Richardson, Texas Developed, wrote, and revised technical documents and documentation sets according to established standards. Identified, planned, and revised technical writing project requirements. Served as the lead writer for multiple product documentation sets. Assisted in the successful, on-time completion of several major system technical writing projects and documentation sets. Improved the quality and usability of multiple installation, setup, and test manuals. Tested and validated multiple installation, setup, and test manuals. Technical Writer CDI November 1999  –  April 2000  (6 months) Columbia, South Carolina Wrote system level technical manuals on contract to Cisco Systems. Technical Writer CDI November 1999  –  April 2000  (6 months) Columbia, South Carolina Wrote system level technical manuals on contract to Cisco Systems. Technical Writer Quantum Resources August 1999  –  November 1999  (4 months) Huntsville, Alabama Developed, wrote, and revised technical specifications on contract to Lockheed Space and Defense. Participated in specification review meetings. Provided technical input to assist in technical problem resolution. Assisted in technical specification reviews. Technical Writer Quantum Resources August 1999  –  November 1999  (4 months) Huntsville, Alabama Developed, wrote, and revised technical specifications on contract to Lockheed Space and Defense. Participated in specification review meetings. Provided technical input to assist in technical problem resolution. Assisted in technical specification reviews. Technical Writer PESA May 1999  –  August 1999  (4 months) Huntsville, Alabama Produced system level documentation for a large-scale video switching system for Turner Broadcasting and AT&T on contract to Pesa. Technical Writer PESA May 1999  –  August 1999  (4 months) Huntsville, Alabama Produced system level documentation for a large-scale video switching system for Turner Broadcasting and AT&T on contract to Pesa. Technical Writer Manpower Technical October 1998  –  May 1999  (8 months) Columbia, Maryland Produced site survey reports for the Collocation Division of MCI World Com on contract to ABB Telecom Services. Gathered field data for documenting architectural, mechanical, electrical, fire detection, communication and equipment descriptions. Assessed sites to develop recommendations and defect corrections for inclusion in documents. Entered analyzed field data into collocation database. Supervised three other technical writers. Wrote, edited, and illustrated technical reports. Delivered technical reports to MCI World Com electronically via the Internet, on CD-ROM, and as hard copy. Provided final documents to management and collocation engineers for use in planning site expansions and future collocation hubs. Technical Writer Manpower Technical October 1998  –  May 1999  (8 months) Columbia, Maryland Produced site survey reports for the Collocation Division of MCI World Com on contract to ABB Telecom Services. Gathered field data for documenting architectural, mechanical, electrical, fire detection, communication and equipment descriptions. Assessed sites to develop recommendations and defect corrections for inclusion in documents. Entered analyzed field data into collocation database. Supervised three other technical writers. Wrote, edited, and illustrated technical reports. Delivered technical reports to MCI World Com electronically via the Internet, on CD-ROM, and as hard copy. Provided final documents to management and collocation engineers for use in planning site expansions and future collocation hubs. Technical Writer Eaton SEO June 1998  –  October 1998  (5 months) Rockville, Maryland Wrote system level technical manuals for system programmers and integrated circuit (IC) engineers. Developed product support documentation including design specifications and field service technical data. Developed the procedures for servicing equipment, assembling equipment, and training personnel to operate the equipment. Interfaced with programmers and engineers to gather data on plasma, microwave, and hardware engineering. Acquired and documented the information on chemical mixes, robotics, and manufacturing processes. Produced manuals used by IC engineers to perfect the plasma and chemical processes used to ash and etch integrated circuits on silicon wafers and to modify robotic processes. Described graphical user interfaces. Assisted in the development of automated diagnostic, troubleshooting, and training procedures for use in multimedia documentation and computer-based training. Technical Writer Eaton SEO June 1998  –  October 1998  (5 months) Rockville, Maryland Wrote system level technical manuals for system programmers and integrated circuit (IC) engineers. Developed product support documentation including design specifications and field service technical data. Developed the procedures for servicing equipment, assembling equipment, and training personnel to operate the equipment. Interfaced with programmers and engineers to gather data on plasma, microwave, and hardware engineering. Acquired and documented the information on chemical mixes, robotics, and manufacturing processes. Produced manuals used by IC engineers to perfect the plasma and chemical processes used to ash and etch integrated circuits on silicon wafers and to modify robotic processes. Described graphical user interfaces. Assisted in the development of automated diagnostic, troubleshooting, and training procedures for use in multimedia documentation and computer-based training. Engineering Technical Writer PESA November 1994  –  June 1998  (3 years 8 months) Huntsville, Alabama Developed technical and service manuals and product support literature for technical and functional end users. Tested electronic equipment and the associated software programs. Interviewed engineers, programmers, and service technicians to gather relevant information. Reviewed schematics, assembly drawings, and other engineering documentation to develop data. Recommended organization and layout requirements on complex publication projects. Reviewed the technical literature prepared by internal staff for content, coverage, and clarity. Documented software descriptions and explanations of software functionality to the end users. Validated documentation against test results. Coordinated with software engineers and software programmers to improve graphical user interfaces. Compiled help files and on-line help for end users and internal software programmers. Engineering Technical Writer PESA November 1994  –  June 1998  (3 years 8 months) Huntsville, Alabama Developed technical and service manuals and product support literature for technical and functional end users. Tested electronic equipment and the associated software programs. Interviewed engineers, programmers, and service technicians to gather relevant information. Reviewed schematics, assembly drawings, and other engineering documentation to develop data. Recommended organization and layout requirements on complex publication projects. Reviewed the technical literature prepared by internal staff for content, coverage, and clarity. Documented software descriptions and explanations of software functionality to the end users. Validated documentation against test results. Coordinated with software engineers and software programmers to improve graphical user interfaces. Compiled help files and on-line help for end users and internal software programmers. Technical Writer Advanced R&D August 1993  –  November 1994  (1 year 4 months) Huntsville, Alabama Prepared technical manuals for audio and video equipment manufactured by PESA. Wrote and illustrated operator, user, and maintenance technical manuals. Formatted manuals for delivery to printing activities. Wrote technical bulletins and sales brochures. Prepared engineering change orders. Technical Writer Advanced R&D August 1993  –  November 1994  (1 year 4 months) Huntsville, Alabama Prepared technical manuals for audio and video equipment manufactured by PESA. Wrote and illustrated operator, user, and maintenance technical manuals. Formatted manuals for delivery to printing activities. Wrote technical bulletins and sales brochures. Prepared engineering change orders. Technical Writer Loral Command and Control July 1989  –  August 1993  (4 years 2 months) Colorado Springs, Colorado Prepared installation engineering drawings and site installation plans for programs supported by the systems engineering team. Surveyed sites and developed installation plans for mainframe computer systems. Documented electrical routing, temperature controls, and equipment positions to produce installation plans. Interfaced with system engineers to develop requirements analysis for computer systems. Examined previous site surveys for errors and corrected documents as needed. Technical Writer Loral Command and Control July 1989  –  August 1993  (4 years 2 months) Colorado Springs, Colorado Prepared installation engineering drawings and site installation plans for programs supported by the systems engineering team. Surveyed sites and developed installation plans for mainframe computer systems. Documented electrical routing, temperature controls, and equipment positions to produce installation plans. Interfaced with system engineers to develop requirements analysis for computer systems. Examined previous site surveys for errors and corrected documents as needed. Test and Measurement Laboratory Supervisor Ford Aerospace August 1986  –  July 1989  (3 years) Hanover, Maryland Supervised and mentored six test and measurement technicians. Tested and calibrated state of the art electronic equipment in a government test and measurement laboratory. Wrote and updated test and measurement procedures. Test and Measurement Laboratory Supervisor Ford Aerospace August 1986  –  July 1989  (3 years) Hanover, Maryland Supervised and mentored six test and measurement technicians. Tested and calibrated state of the art electronic equipment in a government test and measurement laboratory. Wrote and updated test and measurement procedures. Test Technician Austron November 1985  –  August 1986  (10 months) Austin, Texas Tested the time-code equipment manufactured by Austron. Assisted in updating the technical documentation. Test Technician Austron November 1985  –  August 1986  (10 months) Austin, Texas Tested the time-code equipment manufactured by Austron. Assisted in updating the technical documentation. Test and Measurement Technician United States Air Force May 1979  –  November 1985  (6 years 7 months) Various Calibrated, tested, and repaired electronic test and measurement equipment. Led the calibration laboratory quality assurance program. Test and Measurement Technician United States Air Force May 1979  –  November 1985  (6 years 7 months) Various Calibrated, tested, and repaired electronic test and measurement equipment. Led the calibration laboratory quality assurance program. Skills Technical Writing Online Help Testing FrameMaker Technical Communication DITA Unix Project Management RoboHelp Visio XML Hadoop Big Data Agile Methodologies Team Leadership Adobe Acrobat Dreamweaver Illustrator Pagemaker Access Excel MS Office Suite Power Point MS Project Project Planning Project Implementation Project Coordination Project Execution Project Delivery Word Astoria Trisoft WebPublisher API AutoCAD Doc-to-Help Eclipse HTML Java SnagIt WebEx Mac OS SunOS Windows 7 Windows Confluence CSS Wiki MadCap Flare See 34+     See less Skills  Technical Writing Online Help Testing FrameMaker Technical Communication DITA Unix Project Management RoboHelp Visio XML Hadoop Big Data Agile Methodologies Team Leadership Adobe Acrobat Dreamweaver Illustrator Pagemaker Access Excel MS Office Suite Power Point MS Project Project Planning Project Implementation Project Coordination Project Execution Project Delivery Word Astoria Trisoft WebPublisher API AutoCAD Doc-to-Help Eclipse HTML Java SnagIt WebEx Mac OS SunOS Windows 7 Windows Confluence CSS Wiki MadCap Flare See 34+     See less Technical Writing Online Help Testing FrameMaker Technical Communication DITA Unix Project Management RoboHelp Visio XML Hadoop Big Data Agile Methodologies Team Leadership Adobe Acrobat Dreamweaver Illustrator Pagemaker Access Excel MS Office Suite Power Point MS Project Project Planning Project Implementation Project Coordination Project Execution Project Delivery Word Astoria Trisoft WebPublisher API AutoCAD Doc-to-Help Eclipse HTML Java SnagIt WebEx Mac OS SunOS Windows 7 Windows Confluence CSS Wiki MadCap Flare See 34+     See less Technical Writing Online Help Testing FrameMaker Technical Communication DITA Unix Project Management RoboHelp Visio XML Hadoop Big Data Agile Methodologies Team Leadership Adobe Acrobat Dreamweaver Illustrator Pagemaker Access Excel MS Office Suite Power Point MS Project Project Planning Project Implementation Project Coordination Project Execution Project Delivery Word Astoria Trisoft WebPublisher API AutoCAD Doc-to-Help Eclipse HTML Java SnagIt WebEx Mac OS SunOS Windows 7 Windows Confluence CSS Wiki MadCap Flare See 34+     See less Education George Washington University Master Certification in Project Management,  Project Management 2007  – 2009 Stanford University Program Management 2007  – 2008 Colorado Tech Bachelor of Science (B.S.),  Systems Management - Technical Writing 1991  – 1993 United States Air Force Associate's degree,  Test and Measurement Certification 1979  – 1980 University of Kansas Pre-Med 1974  – 1974 George Washington University Master Certification in Project Management,  Project Management 2007  – 2009 George Washington University Master Certification in Project Management,  Project Management 2007  – 2009 George Washington University Master Certification in Project Management,  Project Management 2007  – 2009 Stanford University Program Management 2007  – 2008 Stanford University Program Management 2007  – 2008 Stanford University Program Management 2007  – 2008 Colorado Tech Bachelor of Science (B.S.),  Systems Management - Technical Writing 1991  – 1993 Colorado Tech Bachelor of Science (B.S.),  Systems Management - Technical Writing 1991  – 1993 Colorado Tech Bachelor of Science (B.S.),  Systems Management - Technical Writing 1991  – 1993 United States Air Force Associate's degree,  Test and Measurement Certification 1979  – 1980 United States Air Force Associate's degree,  Test and Measurement Certification 1979  – 1980 United States Air Force Associate's degree,  Test and Measurement Certification 1979  – 1980 University of Kansas Pre-Med 1974  – 1974 University of Kansas Pre-Med 1974  – 1974 University of Kansas Pre-Med 1974  – 1974 ", "Summary • I am a focused and energetic technical documentation leader. I have lead teams of up to eight documentation staff members; junior to senior writers, illustrators, desktop publishers \n• I develop Customer Documentation strategies, resource plans, and group goals; ensure team meets targets \n• I manage multiple software and hardware documentation projects for several different technologies simultaneously  \n• I ensure timely delivery of high-quality documentation suites for technically complex products in Agile and Waterfall environments \n• I thrive working with large multi-disciplined teams with tight deadlines \n• I am technically competent Summary • I am a focused and energetic technical documentation leader. I have lead teams of up to eight documentation staff members; junior to senior writers, illustrators, desktop publishers \n• I develop Customer Documentation strategies, resource plans, and group goals; ensure team meets targets \n• I manage multiple software and hardware documentation projects for several different technologies simultaneously  \n• I ensure timely delivery of high-quality documentation suites for technically complex products in Agile and Waterfall environments \n• I thrive working with large multi-disciplined teams with tight deadlines \n• I am technically competent • I am a focused and energetic technical documentation leader. I have lead teams of up to eight documentation staff members; junior to senior writers, illustrators, desktop publishers \n• I develop Customer Documentation strategies, resource plans, and group goals; ensure team meets targets \n• I manage multiple software and hardware documentation projects for several different technologies simultaneously  \n• I ensure timely delivery of high-quality documentation suites for technically complex products in Agile and Waterfall environments \n• I thrive working with large multi-disciplined teams with tight deadlines \n• I am technically competent • I am a focused and energetic technical documentation leader. I have lead teams of up to eight documentation staff members; junior to senior writers, illustrators, desktop publishers \n• I develop Customer Documentation strategies, resource plans, and group goals; ensure team meets targets \n• I manage multiple software and hardware documentation projects for several different technologies simultaneously  \n• I ensure timely delivery of high-quality documentation suites for technically complex products in Agile and Waterfall environments \n• I thrive working with large multi-disciplined teams with tight deadlines \n• I am technically competent Experience Lead, Technical Documentation Cisco Systems 2004  – Present (11 years) RTP, NC Senior Technical Writer Cisco Systems 1999  –  2004  (5 years) San Jose, Ca and RTP, NC Lead Technical Writer Thales Navigation (Formerly Magellan Corp) 1996  –  1999  (3 years) Sunnyvale, CA Senior Technical Writer VeriBest Corporation, a Divison of Intergraph February 1994  –  March 1996  (2 years 2 months) Mountain View, CA Project Manager Los Trancos Systems February 1994  –  March 1996  (2 years 2 months) Mountain View, CA Lead, Technical Documentation Cisco Systems 2004  – Present (11 years) RTP, NC Lead, Technical Documentation Cisco Systems 2004  – Present (11 years) RTP, NC Senior Technical Writer Cisco Systems 1999  –  2004  (5 years) San Jose, Ca and RTP, NC Senior Technical Writer Cisco Systems 1999  –  2004  (5 years) San Jose, Ca and RTP, NC Lead Technical Writer Thales Navigation (Formerly Magellan Corp) 1996  –  1999  (3 years) Sunnyvale, CA Lead Technical Writer Thales Navigation (Formerly Magellan Corp) 1996  –  1999  (3 years) Sunnyvale, CA Senior Technical Writer VeriBest Corporation, a Divison of Intergraph February 1994  –  March 1996  (2 years 2 months) Mountain View, CA Senior Technical Writer VeriBest Corporation, a Divison of Intergraph February 1994  –  March 1996  (2 years 2 months) Mountain View, CA Project Manager Los Trancos Systems February 1994  –  March 1996  (2 years 2 months) Mountain View, CA Project Manager Los Trancos Systems February 1994  –  March 1996  (2 years 2 months) Mountain View, CA Skills Team Leadership Developing and building... Documentation... Technical Documentation Management Mentoring Of Staff Software Documentation Technical Writing FrameMaker Microsoft Word Adobe Acrobat Online Help XML Doxygen Dreamweaver DITA RoboHelp Networking Cisco Technologies Cisco IOS Program Management Project Management Agile Methodologies Project Planning Manuals TCP/IP Microsoft Office Routers Telecommunications Precision GPS Mobility/MANET IP routing in space and... Technical Communication Cisco Secure... Hemophagocytic... Cisco Common Security... North Carolina Zoning Land Use Planning Transportation Planning Security Cross-functional Team... Leadership Training Testing Software Development Linux Integration Cloud Computing Hardware Unix See 35+     See less Skills  Team Leadership Developing and building... Documentation... Technical Documentation Management Mentoring Of Staff Software Documentation Technical Writing FrameMaker Microsoft Word Adobe Acrobat Online Help XML Doxygen Dreamweaver DITA RoboHelp Networking Cisco Technologies Cisco IOS Program Management Project Management Agile Methodologies Project Planning Manuals TCP/IP Microsoft Office Routers Telecommunications Precision GPS Mobility/MANET IP routing in space and... Technical Communication Cisco Secure... Hemophagocytic... Cisco Common Security... North Carolina Zoning Land Use Planning Transportation Planning Security Cross-functional Team... Leadership Training Testing Software Development Linux Integration Cloud Computing Hardware Unix See 35+     See less Team Leadership Developing and building... Documentation... Technical Documentation Management Mentoring Of Staff Software Documentation Technical Writing FrameMaker Microsoft Word Adobe Acrobat Online Help XML Doxygen Dreamweaver DITA RoboHelp Networking Cisco Technologies Cisco IOS Program Management Project Management Agile Methodologies Project Planning Manuals TCP/IP Microsoft Office Routers Telecommunications Precision GPS Mobility/MANET IP routing in space and... Technical Communication Cisco Secure... Hemophagocytic... Cisco Common Security... North Carolina Zoning Land Use Planning Transportation Planning Security Cross-functional Team... Leadership Training Testing Software Development Linux Integration Cloud Computing Hardware Unix See 35+     See less Team Leadership Developing and building... Documentation... Technical Documentation Management Mentoring Of Staff Software Documentation Technical Writing FrameMaker Microsoft Word Adobe Acrobat Online Help XML Doxygen Dreamweaver DITA RoboHelp Networking Cisco Technologies Cisco IOS Program Management Project Management Agile Methodologies Project Planning Manuals TCP/IP Microsoft Office Routers Telecommunications Precision GPS Mobility/MANET IP routing in space and... Technical Communication Cisco Secure... Hemophagocytic... Cisco Common Security... North Carolina Zoning Land Use Planning Transportation Planning Security Cross-functional Team... Leadership Training Testing Software Development Linux Integration Cloud Computing Hardware Unix See 35+     See less Education Michigan Technological University MS,  Geology 1991  – 1993 University of California, Santa Barbara BS,  Geology 1986  – 1990 Activities and Societies:  Distinction in Major University of California, Santa Cruz Certificates,  Project Management ,  Information Development Activities and Societies:  Certificate in Project and Program Management;\nCertificate in Managing the Development of Technical Information Michigan Technological University MS,  Geology 1991  – 1993 Michigan Technological University MS,  Geology 1991  – 1993 Michigan Technological University MS,  Geology 1991  – 1993 University of California, Santa Barbara BS,  Geology 1986  – 1990 Activities and Societies:  Distinction in Major University of California, Santa Barbara BS,  Geology 1986  – 1990 Activities and Societies:  Distinction in Major University of California, Santa Barbara BS,  Geology 1986  – 1990 Activities and Societies:  Distinction in Major University of California, Santa Cruz Certificates,  Project Management ,  Information Development Activities and Societies:  Certificate in Project and Program Management;\nCertificate in Managing the Development of Technical Information University of California, Santa Cruz Certificates,  Project Management ,  Information Development Activities and Societies:  Certificate in Project and Program Management;\nCertificate in Managing the Development of Technical Information University of California, Santa Cruz Certificates,  Project Management ,  Information Development Activities and Societies:  Certificate in Project and Program Management;\nCertificate in Managing the Development of Technical Information "]}