{"position": "Release Manager", "company": "Google", "profiles": ["Skills Project Management New Business Development Telecommunications Network Administration Marketing Vendor Management Professional Services Management Process Improvement Data Center Networking Network Design Sourcing Procurement Strategic Partnerships Strategic Planning Project Planning Managed Services Product Marketing Consulting Wireless Start-ups Sales Management Strategy Cross-functional Team... Sales VoIP Program Management WAN CRM Service Delivery Management Consulting Business Analysis Contract Negotiation Cisco Technologies Disaster Recovery Business Development Outsourcing Purchasing Integration Product Management Team Leadership Training Account Management Business Process... Cloud Computing PMO Unified Communications Business Intelligence Troubleshooting See 35+     See less Skills  Project Management New Business Development Telecommunications Network Administration Marketing Vendor Management Professional Services Management Process Improvement Data Center Networking Network Design Sourcing Procurement Strategic Partnerships Strategic Planning Project Planning Managed Services Product Marketing Consulting Wireless Start-ups Sales Management Strategy Cross-functional Team... Sales VoIP Program Management WAN CRM Service Delivery Management Consulting Business Analysis Contract Negotiation Cisco Technologies Disaster Recovery Business Development Outsourcing Purchasing Integration Product Management Team Leadership Training Account Management Business Process... Cloud Computing PMO Unified Communications Business Intelligence Troubleshooting See 35+     See less Project Management New Business Development Telecommunications Network Administration Marketing Vendor Management Professional Services Management Process Improvement Data Center Networking Network Design Sourcing Procurement Strategic Partnerships Strategic Planning Project Planning Managed Services Product Marketing Consulting Wireless Start-ups Sales Management Strategy Cross-functional Team... Sales VoIP Program Management WAN CRM Service Delivery Management Consulting Business Analysis Contract Negotiation Cisco Technologies Disaster Recovery Business Development Outsourcing Purchasing Integration Product Management Team Leadership Training Account Management Business Process... Cloud Computing PMO Unified Communications Business Intelligence Troubleshooting See 35+     See less Project Management New Business Development Telecommunications Network Administration Marketing Vendor Management Professional Services Management Process Improvement Data Center Networking Network Design Sourcing Procurement Strategic Partnerships Strategic Planning Project Planning Managed Services Product Marketing Consulting Wireless Start-ups Sales Management Strategy Cross-functional Team... Sales VoIP Program Management WAN CRM Service Delivery Management Consulting Business Analysis Contract Negotiation Cisco Technologies Disaster Recovery Business Development Outsourcing Purchasing Integration Product Management Team Leadership Training Account Management Business Process... Cloud Computing PMO Unified Communications Business Intelligence Troubleshooting See 35+     See less ", "Skills Web Development Cloud Computing User Experience Web 2.0 Cross-functional Team... Demand Generation Telecommunications Marketing Management Training Cisco Technologies Strategy SaaS Mobile Applications Skills  Web Development Cloud Computing User Experience Web 2.0 Cross-functional Team... Demand Generation Telecommunications Marketing Management Training Cisco Technologies Strategy SaaS Mobile Applications Web Development Cloud Computing User Experience Web 2.0 Cross-functional Team... Demand Generation Telecommunications Marketing Management Training Cisco Technologies Strategy SaaS Mobile Applications Web Development Cloud Computing User Experience Web 2.0 Cross-functional Team... Demand Generation Telecommunications Marketing Management Training Cisco Technologies Strategy SaaS Mobile Applications ", "Experience Project Manager Cisco Systems February 2012  – Present (3 years 7 months) Sophia Antipolis Project Manager Cisco Systems February 2012  – Present (3 years 7 months) Sophia Antipolis Project Manager Cisco Systems February 2012  – Present (3 years 7 months) Sophia Antipolis Skills RUP RAD UML ITIL Business Analysis Software Project... Agile Project Management MS Project Program Management Requirements Analysis Agile Change Management SDLC Business Process Project Implementation Rational Rose IT Management Project Planning IT Strategy Siebel Waterfall IT Governance Systems Analysis Business Process Design IT Service Management Service Management OOAD Requirements Gathering See 13+     See less Skills  RUP RAD UML ITIL Business Analysis Software Project... Agile Project Management MS Project Program Management Requirements Analysis Agile Change Management SDLC Business Process Project Implementation Rational Rose IT Management Project Planning IT Strategy Siebel Waterfall IT Governance Systems Analysis Business Process Design IT Service Management Service Management OOAD Requirements Gathering See 13+     See less RUP RAD UML ITIL Business Analysis Software Project... Agile Project Management MS Project Program Management Requirements Analysis Agile Change Management SDLC Business Process Project Implementation Rational Rose IT Management Project Planning IT Strategy Siebel Waterfall IT Governance Systems Analysis Business Process Design IT Service Management Service Management OOAD Requirements Gathering See 13+     See less RUP RAD UML ITIL Business Analysis Software Project... Agile Project Management MS Project Program Management Requirements Analysis Agile Change Management SDLC Business Process Project Implementation Rational Rose IT Management Project Planning IT Strategy Siebel Waterfall IT Governance Systems Analysis Business Process Design IT Service Management Service Management OOAD Requirements Gathering See 13+     See less ", "Summary Wide ranging IT and Business-related experience from programming to complex Program Management, and People Management. \nMy aim is to bring my skills to bear on complex projects, where I can make a real difference to the profitability of an organization. \n \nMost recently engaged to manage a number projects starting with creating the project charter, through requirements definition, through resource allocation, user acceptance testing and release planning.  \n \nSpecialties:  \n- Project Management \n- Business Analysis \n- Database and Data Warehouse Design \n- Outsourcing \n- Budget Management \n- People Management \n- Negotiation Summary Wide ranging IT and Business-related experience from programming to complex Program Management, and People Management. \nMy aim is to bring my skills to bear on complex projects, where I can make a real difference to the profitability of an organization. \n \nMost recently engaged to manage a number projects starting with creating the project charter, through requirements definition, through resource allocation, user acceptance testing and release planning.  \n \nSpecialties:  \n- Project Management \n- Business Analysis \n- Database and Data Warehouse Design \n- Outsourcing \n- Budget Management \n- People Management \n- Negotiation Wide ranging IT and Business-related experience from programming to complex Program Management, and People Management. \nMy aim is to bring my skills to bear on complex projects, where I can make a real difference to the profitability of an organization. \n \nMost recently engaged to manage a number projects starting with creating the project charter, through requirements definition, through resource allocation, user acceptance testing and release planning.  \n \nSpecialties:  \n- Project Management \n- Business Analysis \n- Database and Data Warehouse Design \n- Outsourcing \n- Budget Management \n- People Management \n- Negotiation Wide ranging IT and Business-related experience from programming to complex Program Management, and People Management. \nMy aim is to bring my skills to bear on complex projects, where I can make a real difference to the profitability of an organization. \n \nMost recently engaged to manage a number projects starting with creating the project charter, through requirements definition, through resource allocation, user acceptance testing and release planning.  \n \nSpecialties:  \n- Project Management \n- Business Analysis \n- Database and Data Warehouse Design \n- Outsourcing \n- Budget Management \n- People Management \n- Negotiation Experience Associate Principal Consultant Magenic Technologies April 2011  – Present (4 years 5 months) san francisco, california Senior Consultant specializing in Project Management and QA processes. \nWorking at several large clients (Credit Card company, Insurance Bureau, Pharmaceutical Manufacturer) on full life cycle project artifacts, including creation of engagement proposals, project plans, resource plans, budgeting, engagement plans, and managing the daily sprints. \nManaged a series of successful releases. Project Manager Cisco Systems April 2010  –  February 2011  (11 months) Project Manager, coordinating the overall project plan for the Systems and Technology Enterprise Architecture Practice. \nManaging Risks and Issues in Propel. \nOrganizing and Coordinating the QA activities for each release. \nAssisting with Org Adoption activities where needed. Contractor Ten Tenths Technologies August 2009  –  March 2010  (8 months) Livermore, CA Database Design work, Business Analysis and Project Management for local companies Consultant Cisco February 2007  –  March 2009  (2 years 2 months) San Jose, CA Project Manager in the Order-to-Book space. \nCoordinating the interface between the new Internet Commerce Workspace, and the Manufacturing teams. \nLeading the interface between QTC and the F2D team on the Integrated Commerce Workspace initiative. Project Manager Startup - MBSI June 2006  –  December 2006  (7 months) Developing the Project Plan, Business Requirements and Database Design for a proposed financial product. Project Manager Cisco Systems September 1997  –  May 2006  (8 years 9 months) Project Manager Cisco Systems - Sales Operations 2001  –  2005  (4 years) Analyst/Developer Lifescan August 1995  –  September 1997  (2 years 2 months) Data Warehouse Design, Database Design, Analyst/Developer National Rivers Authority 1990  –  1995  (5 years) Database Design, Oracle Forms Development, UNIX development, ETL script creation, Systems Analysis Programmer South West Water April 1987  –  August 1990  (3 years 5 months) Associate Principal Consultant Magenic Technologies April 2011  – Present (4 years 5 months) san francisco, california Senior Consultant specializing in Project Management and QA processes. \nWorking at several large clients (Credit Card company, Insurance Bureau, Pharmaceutical Manufacturer) on full life cycle project artifacts, including creation of engagement proposals, project plans, resource plans, budgeting, engagement plans, and managing the daily sprints. \nManaged a series of successful releases. Associate Principal Consultant Magenic Technologies April 2011  – Present (4 years 5 months) san francisco, california Senior Consultant specializing in Project Management and QA processes. \nWorking at several large clients (Credit Card company, Insurance Bureau, Pharmaceutical Manufacturer) on full life cycle project artifacts, including creation of engagement proposals, project plans, resource plans, budgeting, engagement plans, and managing the daily sprints. \nManaged a series of successful releases. Project Manager Cisco Systems April 2010  –  February 2011  (11 months) Project Manager, coordinating the overall project plan for the Systems and Technology Enterprise Architecture Practice. \nManaging Risks and Issues in Propel. \nOrganizing and Coordinating the QA activities for each release. \nAssisting with Org Adoption activities where needed. Project Manager Cisco Systems April 2010  –  February 2011  (11 months) Project Manager, coordinating the overall project plan for the Systems and Technology Enterprise Architecture Practice. \nManaging Risks and Issues in Propel. \nOrganizing and Coordinating the QA activities for each release. \nAssisting with Org Adoption activities where needed. Contractor Ten Tenths Technologies August 2009  –  March 2010  (8 months) Livermore, CA Database Design work, Business Analysis and Project Management for local companies Contractor Ten Tenths Technologies August 2009  –  March 2010  (8 months) Livermore, CA Database Design work, Business Analysis and Project Management for local companies Consultant Cisco February 2007  –  March 2009  (2 years 2 months) San Jose, CA Project Manager in the Order-to-Book space. \nCoordinating the interface between the new Internet Commerce Workspace, and the Manufacturing teams. \nLeading the interface between QTC and the F2D team on the Integrated Commerce Workspace initiative. Consultant Cisco February 2007  –  March 2009  (2 years 2 months) San Jose, CA Project Manager in the Order-to-Book space. \nCoordinating the interface between the new Internet Commerce Workspace, and the Manufacturing teams. \nLeading the interface between QTC and the F2D team on the Integrated Commerce Workspace initiative. Project Manager Startup - MBSI June 2006  –  December 2006  (7 months) Developing the Project Plan, Business Requirements and Database Design for a proposed financial product. Project Manager Startup - MBSI June 2006  –  December 2006  (7 months) Developing the Project Plan, Business Requirements and Database Design for a proposed financial product. Project Manager Cisco Systems September 1997  –  May 2006  (8 years 9 months) Project Manager Cisco Systems September 1997  –  May 2006  (8 years 9 months) Project Manager Cisco Systems - Sales Operations 2001  –  2005  (4 years) Project Manager Cisco Systems - Sales Operations 2001  –  2005  (4 years) Analyst/Developer Lifescan August 1995  –  September 1997  (2 years 2 months) Data Warehouse Design, Database Design, Analyst/Developer Lifescan August 1995  –  September 1997  (2 years 2 months) Data Warehouse Design, Database Design, Analyst/Developer National Rivers Authority 1990  –  1995  (5 years) Database Design, Oracle Forms Development, UNIX development, ETL script creation, Systems Analysis Analyst/Developer National Rivers Authority 1990  –  1995  (5 years) Database Design, Oracle Forms Development, UNIX development, ETL script creation, Systems Analysis Programmer South West Water April 1987  –  August 1990  (3 years 5 months) Programmer South West Water April 1987  –  August 1990  (3 years 5 months) Skills Business Analysis Program Management Budget Management Vendor Management Software Project... PMO Quality Assurance Project Portfolio... Project Planning Dashboards SDLC Agile Resource Management MS Project Business Intelligence IT Service Management Portals Visio Requirements Analysis Metrics Project Delivery Software Development... Cross-functional Team... Process Improvement Software Development Business Requirements Team Leadership Data Warehousing IT Management Business Process Design Virtual Teams Project Management Agile Methodologies Management Leadership E-commerce IT Strategy Business Process PMP Integration Enterprise Architecture Solution Architecture Agile Project Management See 28+     See less Skills  Business Analysis Program Management Budget Management Vendor Management Software Project... PMO Quality Assurance Project Portfolio... Project Planning Dashboards SDLC Agile Resource Management MS Project Business Intelligence IT Service Management Portals Visio Requirements Analysis Metrics Project Delivery Software Development... Cross-functional Team... Process Improvement Software Development Business Requirements Team Leadership Data Warehousing IT Management Business Process Design Virtual Teams Project Management Agile Methodologies Management Leadership E-commerce IT Strategy Business Process PMP Integration Enterprise Architecture Solution Architecture Agile Project Management See 28+     See less Business Analysis Program Management Budget Management Vendor Management Software Project... PMO Quality Assurance Project Portfolio... Project Planning Dashboards SDLC Agile Resource Management MS Project Business Intelligence IT Service Management Portals Visio Requirements Analysis Metrics Project Delivery Software Development... Cross-functional Team... Process Improvement Software Development Business Requirements Team Leadership Data Warehousing IT Management Business Process Design Virtual Teams Project Management Agile Methodologies Management Leadership E-commerce IT Strategy Business Process PMP Integration Enterprise Architecture Solution Architecture Agile Project Management See 28+     See less Business Analysis Program Management Budget Management Vendor Management Software Project... PMO Quality Assurance Project Portfolio... Project Planning Dashboards SDLC Agile Resource Management MS Project Business Intelligence IT Service Management Portals Visio Requirements Analysis Metrics Project Delivery Software Development... Cross-functional Team... Process Improvement Software Development Business Requirements Team Leadership Data Warehousing IT Management Business Process Design Virtual Teams Project Management Agile Methodologies Management Leadership E-commerce IT Strategy Business Process PMP Integration Enterprise Architecture Solution Architecture Agile Project Management See 28+     See less Education Exeter College Bachelor of Technology (BTech),  Computer Science Exeter College Bachelor of Technology (BTech),  Computer Science Exeter College Bachelor of Technology (BTech),  Computer Science Exeter College Bachelor of Technology (BTech),  Computer Science ", "Experience International Indirect Tax Business Process Program Manager Cisco Systems International BV October 2010  – Present (4 years 11 months) Amsterdam Area, Netherlands Project Manager Cisco Systems International BV Country Integration & Business Transformation Manager Cisco Systems International BV October 2007  –  October 2010  (3 years 1 month) Amsterdam Area, Netherlands Project Manager Cisco Systems International BV January 2006  –  October 2007  (1 year 10 months) Amsterdam Area, Netherlands Finance Business Analyst Oracle 11i implementation Cisco Systems International BV May 2000  –  January 2006  (5 years 9 months) Amsterdam Area, Netherlands Special Project Manager Cisco Systems International BV July 2000  –  May 2002  (1 year 11 months) Amsterdam Area, Netherlands Credit & Collections Analyst Cisco Systems International BV January 1997  –  July 2000  (3 years 7 months) Amsterdam Area, Netherlands International Indirect Tax Business Process Program Manager Cisco Systems International BV October 2010  – Present (4 years 11 months) Amsterdam Area, Netherlands International Indirect Tax Business Process Program Manager Cisco Systems International BV October 2010  – Present (4 years 11 months) Amsterdam Area, Netherlands Project Manager Cisco Systems International BV Project Manager Cisco Systems International BV Country Integration & Business Transformation Manager Cisco Systems International BV October 2007  –  October 2010  (3 years 1 month) Amsterdam Area, Netherlands Country Integration & Business Transformation Manager Cisco Systems International BV October 2007  –  October 2010  (3 years 1 month) Amsterdam Area, Netherlands Project Manager Cisco Systems International BV January 2006  –  October 2007  (1 year 10 months) Amsterdam Area, Netherlands Project Manager Cisco Systems International BV January 2006  –  October 2007  (1 year 10 months) Amsterdam Area, Netherlands Finance Business Analyst Oracle 11i implementation Cisco Systems International BV May 2000  –  January 2006  (5 years 9 months) Amsterdam Area, Netherlands Finance Business Analyst Oracle 11i implementation Cisco Systems International BV May 2000  –  January 2006  (5 years 9 months) Amsterdam Area, Netherlands Special Project Manager Cisco Systems International BV July 2000  –  May 2002  (1 year 11 months) Amsterdam Area, Netherlands Special Project Manager Cisco Systems International BV July 2000  –  May 2002  (1 year 11 months) Amsterdam Area, Netherlands Credit & Collections Analyst Cisco Systems International BV January 1997  –  July 2000  (3 years 7 months) Amsterdam Area, Netherlands Credit & Collections Analyst Cisco Systems International BV January 1997  –  July 2000  (3 years 7 months) Amsterdam Area, Netherlands Languages   Skills Project Management Business Process... Business Process... DMAIC Business Transformation Release Management Collaboration Communication Skills Shared Service Center Business Analysis Impact Assessment working global Program Management Skills  Project Management Business Process... Business Process... DMAIC Business Transformation Release Management Collaboration Communication Skills Shared Service Center Business Analysis Impact Assessment working global Program Management Project Management Business Process... Business Process... DMAIC Business Transformation Release Management Collaboration Communication Skills Shared Service Center Business Analysis Impact Assessment working global Program Management Project Management Business Process... Business Process... DMAIC Business Transformation Release Management Collaboration Communication Skills Shared Service Center Business Analysis Impact Assessment working global Program Management Education University of Amsterdam Master of Arts (M.A.),  Communications Science 1991  – 1996 Han Fortmann College Atheneum Degree 1985  – 1991 University of Amsterdam Master of Arts (M.A.),  Communications Science 1991  – 1996 University of Amsterdam Master of Arts (M.A.),  Communications Science 1991  – 1996 University of Amsterdam Master of Arts (M.A.),  Communications Science 1991  – 1996 Han Fortmann College Atheneum Degree 1985  – 1991 Han Fortmann College Atheneum Degree 1985  – 1991 Han Fortmann College Atheneum Degree 1985  – 1991 ", "Summary • Highly motivated and result-oriented Project/Program Manager (PMP) with 6+ years of Project Management experience.  \n•\tExperienced in leading large and complex projects across multiple domains. \n•\tExcellent time managing and communications skills. Well organized, positive, energetic and proactive. \n•\tAdept at managing stakeholder expectations. \n•\tSeasoned in assessing and mitigating issues and risks. \n \nSpecialties: Project Management, Program Management, Leadership, PMO, PLC, SDLC Waterfall project Model, Microsoft Office, Wiki, Sharepoint like applications Summary • Highly motivated and result-oriented Project/Program Manager (PMP) with 6+ years of Project Management experience.  \n•\tExperienced in leading large and complex projects across multiple domains. \n•\tExcellent time managing and communications skills. Well organized, positive, energetic and proactive. \n•\tAdept at managing stakeholder expectations. \n•\tSeasoned in assessing and mitigating issues and risks. \n \nSpecialties: Project Management, Program Management, Leadership, PMO, PLC, SDLC Waterfall project Model, Microsoft Office, Wiki, Sharepoint like applications • Highly motivated and result-oriented Project/Program Manager (PMP) with 6+ years of Project Management experience.  \n•\tExperienced in leading large and complex projects across multiple domains. \n•\tExcellent time managing and communications skills. Well organized, positive, energetic and proactive. \n•\tAdept at managing stakeholder expectations. \n•\tSeasoned in assessing and mitigating issues and risks. \n \nSpecialties: Project Management, Program Management, Leadership, PMO, PLC, SDLC Waterfall project Model, Microsoft Office, Wiki, Sharepoint like applications • Highly motivated and result-oriented Project/Program Manager (PMP) with 6+ years of Project Management experience.  \n•\tExperienced in leading large and complex projects across multiple domains. \n•\tExcellent time managing and communications skills. Well organized, positive, energetic and proactive. \n•\tAdept at managing stakeholder expectations. \n•\tSeasoned in assessing and mitigating issues and risks. \n \nSpecialties: Project Management, Program Management, Leadership, PMO, PLC, SDLC Waterfall project Model, Microsoft Office, Wiki, Sharepoint like applications Experience Project Manager at Cisco Systems Tata Consultancy Services March 2015  – Present (6 months) San Jose, CA Managing and driving multimillion initiative toward upgrade of Oracle 11g databases to Oracle 12c across Cisco IT as part of 12c upgrade PMO team. Program kicked-off in Mar 2015 and spans to 2 years. Goal is to get all the ~1,600 databases upgraded to Oracle 12c in next 2 years with a phased approach. \n \n•\tEngaged with the clients for upgrade of their databases and maintained the single repository for all the databases.  \n•\tDrove lengthy planning/architectural discussions towards upgrade and migration strategies. \n•\tPresentations to senior leadership around the approach and strategies. \n•\tMaintaining the Oracle 12c IWE page (wiki page) with periodic updates. \n•\tStatus reporting/readouts to senior leadership on weekly basis. \n•\tCollaborating with core team (comprising of Sys admins/compute/storage/network/ DBAs) on detailed analysis for DB upgrades. \n Program Manager at Cisco Systems Tata Consultancy Services January 2014  –  November 2014  (11 months) San Jose, CA As part of QA PMO team managed several CE (Country Enablement) Quarterly Releases viz. CE Russia and CE ROW. CE initiative is to upgrade the underlying EBS suite to R12 and incorporate new Business units to open more business for clients. \n \n•\tAs QA Manager, planned and managed the QA testing deliverables in concurrence with the IT and Business teams. \n•\tDefined the deliverables timelines and milestones as part of the detailed Project Plan. \n•\tDrove the daily DSR calls and ensured the defects/issues are discussed and closed on priority. Ensured that the defects are triaged effectively by arranging several ad hoc calls with the Development and the IT teams. \n•\tParticipated in all change scope discussions and kept track of all the scope changes as part of the release. \n•\tMaintained detailed issue tracker and socialized and discussed it with the teams on regular basis. \n•\tPublished daily status report to the leadership team. Project Manager at Cisco Systems Contractor - Cisco Webex May 2013  –  September 2013  (5 months) San Jose, CA Managed and coordinated the project delivery of SaaS Enablement Project Pilot for WebEx. This foundational release enabled the end-to-end quote to cash transactional capabilities for a true utility consumption SaaS model.  \n \n•\tManaged stakeholders’ expectation and issues conflict. \n•\tDrove the lengthy war room delivery sessions. Got various teams collaboratively carry out QA/BAT/UAT successfully with minimum turnaround time on the defects and issues. \n•\tEnsured each issue was tracked to closure by maintaining an exhaustive issue tracker. \n•\tCreated and maintained the project plan and delivery milestones and ensured the teams followed the proposed plan. \n•\tProvided periodic status reports to the leadership team. \n•\tDocumented and tracked the scope changes diligently. \n•\tWorked collaboratively with the cross-functional teams for the delivery. \n \n IT Lead/Project Coordinator at Cisco Systems Wipro Technologies March 2011  –  March 2012  (1 year 1 month) San Jose, CA Managed and coordinated the data center move for Cisco's Customer care IT Infrastructure for their Oracle E-Business Suite (EBS) Applications.  \nThe work involved- \n-Managing all the Infrastructure needs documentations, presenting them to the Infra Supply team as demand bundles and making sure the dev, testing, staging and Prod environment were delievered at the required time. \n-Keeping track of scope changes and getting them approved through CCB. \n-Maintaing risk register and issue log. \n-Managing stakeholders expectations via emails and meetings. Managing project close process. QA Lead at Cisco Systems Wipro Technologies June 2007  –  March 2011  (3 years 10 months) San Jose, CA Led QA team efforts for various projects like integrating Acquisition's data into Cisco business data systems and maintaining and upgrading the Oracle Business suite. \nThe work involved- \n•\tGathering, analyzing and finalizing the testing requirements and acceptance criteria from different stakeholders. \n•\tPreparation of quality documents viz. test plan, mitigation plan, test scenarios and test cases. \n•\tManaging test execution, bug reporting and getting the issues to closure. \n•\tCoordinating and attending daily defect status call, CCB meeting, Risk mitigation plan meeting \n•\tProject Managed waterfall SDLC project model. Senior Oracle Apps Technical Consultant Ricoh Company Ltd. January 2007  –  June 2007  (6 months) New Jersey • Worked extensively on the Accounts Receivables (AR) interfaces like Lock Box interface, AR Import Interface, AR Invoices, credit memos, debit memos, Payment scheduling and application, Receipt transactions, Charge backs, Adjustments, posting to GL. \n• Customized a few Concurrent Programs on Credit Card Receipts Reversal and Mismatch. Using SQL and PL/SQL. Oracle EBS Apps Technical Consultant at GE Commercial Finance Tata Consultancy Services April 2004  –  December 2005  (1 year 9 months) • Played a key role in maintaining General Ledger Interface, Configuration of General Ledger module like SOB, currency, calendar, Key Flex Fields, Descriptive Flex Fields, Profiles, Value Sets, and Lookups. \n• Developed and customized various applications and the related forms called GE Security module and Interface Engine. \n• Developed and validated the data in GL Interface, out bound interface like Auto validation file PO Extract. Software Engineer Mastek Ltd January 2004  –  April 2004  (4 months) Mumbai, India Worked on SQL Plus and TOAD and learnt forms and Reports. Project Manager at Cisco Systems Tata Consultancy Services March 2015  – Present (6 months) San Jose, CA Managing and driving multimillion initiative toward upgrade of Oracle 11g databases to Oracle 12c across Cisco IT as part of 12c upgrade PMO team. Program kicked-off in Mar 2015 and spans to 2 years. Goal is to get all the ~1,600 databases upgraded to Oracle 12c in next 2 years with a phased approach. \n \n•\tEngaged with the clients for upgrade of their databases and maintained the single repository for all the databases.  \n•\tDrove lengthy planning/architectural discussions towards upgrade and migration strategies. \n•\tPresentations to senior leadership around the approach and strategies. \n•\tMaintaining the Oracle 12c IWE page (wiki page) with periodic updates. \n•\tStatus reporting/readouts to senior leadership on weekly basis. \n•\tCollaborating with core team (comprising of Sys admins/compute/storage/network/ DBAs) on detailed analysis for DB upgrades. \n Project Manager at Cisco Systems Tata Consultancy Services March 2015  – Present (6 months) San Jose, CA Managing and driving multimillion initiative toward upgrade of Oracle 11g databases to Oracle 12c across Cisco IT as part of 12c upgrade PMO team. Program kicked-off in Mar 2015 and spans to 2 years. Goal is to get all the ~1,600 databases upgraded to Oracle 12c in next 2 years with a phased approach. \n \n•\tEngaged with the clients for upgrade of their databases and maintained the single repository for all the databases.  \n•\tDrove lengthy planning/architectural discussions towards upgrade and migration strategies. \n•\tPresentations to senior leadership around the approach and strategies. \n•\tMaintaining the Oracle 12c IWE page (wiki page) with periodic updates. \n•\tStatus reporting/readouts to senior leadership on weekly basis. \n•\tCollaborating with core team (comprising of Sys admins/compute/storage/network/ DBAs) on detailed analysis for DB upgrades. \n Program Manager at Cisco Systems Tata Consultancy Services January 2014  –  November 2014  (11 months) San Jose, CA As part of QA PMO team managed several CE (Country Enablement) Quarterly Releases viz. CE Russia and CE ROW. CE initiative is to upgrade the underlying EBS suite to R12 and incorporate new Business units to open more business for clients. \n \n•\tAs QA Manager, planned and managed the QA testing deliverables in concurrence with the IT and Business teams. \n•\tDefined the deliverables timelines and milestones as part of the detailed Project Plan. \n•\tDrove the daily DSR calls and ensured the defects/issues are discussed and closed on priority. Ensured that the defects are triaged effectively by arranging several ad hoc calls with the Development and the IT teams. \n•\tParticipated in all change scope discussions and kept track of all the scope changes as part of the release. \n•\tMaintained detailed issue tracker and socialized and discussed it with the teams on regular basis. \n•\tPublished daily status report to the leadership team. Program Manager at Cisco Systems Tata Consultancy Services January 2014  –  November 2014  (11 months) San Jose, CA As part of QA PMO team managed several CE (Country Enablement) Quarterly Releases viz. CE Russia and CE ROW. CE initiative is to upgrade the underlying EBS suite to R12 and incorporate new Business units to open more business for clients. \n \n•\tAs QA Manager, planned and managed the QA testing deliverables in concurrence with the IT and Business teams. \n•\tDefined the deliverables timelines and milestones as part of the detailed Project Plan. \n•\tDrove the daily DSR calls and ensured the defects/issues are discussed and closed on priority. Ensured that the defects are triaged effectively by arranging several ad hoc calls with the Development and the IT teams. \n•\tParticipated in all change scope discussions and kept track of all the scope changes as part of the release. \n•\tMaintained detailed issue tracker and socialized and discussed it with the teams on regular basis. \n•\tPublished daily status report to the leadership team. Project Manager at Cisco Systems Contractor - Cisco Webex May 2013  –  September 2013  (5 months) San Jose, CA Managed and coordinated the project delivery of SaaS Enablement Project Pilot for WebEx. This foundational release enabled the end-to-end quote to cash transactional capabilities for a true utility consumption SaaS model.  \n \n•\tManaged stakeholders’ expectation and issues conflict. \n•\tDrove the lengthy war room delivery sessions. Got various teams collaboratively carry out QA/BAT/UAT successfully with minimum turnaround time on the defects and issues. \n•\tEnsured each issue was tracked to closure by maintaining an exhaustive issue tracker. \n•\tCreated and maintained the project plan and delivery milestones and ensured the teams followed the proposed plan. \n•\tProvided periodic status reports to the leadership team. \n•\tDocumented and tracked the scope changes diligently. \n•\tWorked collaboratively with the cross-functional teams for the delivery. \n \n Project Manager at Cisco Systems Contractor - Cisco Webex May 2013  –  September 2013  (5 months) San Jose, CA Managed and coordinated the project delivery of SaaS Enablement Project Pilot for WebEx. This foundational release enabled the end-to-end quote to cash transactional capabilities for a true utility consumption SaaS model.  \n \n•\tManaged stakeholders’ expectation and issues conflict. \n•\tDrove the lengthy war room delivery sessions. Got various teams collaboratively carry out QA/BAT/UAT successfully with minimum turnaround time on the defects and issues. \n•\tEnsured each issue was tracked to closure by maintaining an exhaustive issue tracker. \n•\tCreated and maintained the project plan and delivery milestones and ensured the teams followed the proposed plan. \n•\tProvided periodic status reports to the leadership team. \n•\tDocumented and tracked the scope changes diligently. \n•\tWorked collaboratively with the cross-functional teams for the delivery. \n \n IT Lead/Project Coordinator at Cisco Systems Wipro Technologies March 2011  –  March 2012  (1 year 1 month) San Jose, CA Managed and coordinated the data center move for Cisco's Customer care IT Infrastructure for their Oracle E-Business Suite (EBS) Applications.  \nThe work involved- \n-Managing all the Infrastructure needs documentations, presenting them to the Infra Supply team as demand bundles and making sure the dev, testing, staging and Prod environment were delievered at the required time. \n-Keeping track of scope changes and getting them approved through CCB. \n-Maintaing risk register and issue log. \n-Managing stakeholders expectations via emails and meetings. Managing project close process. IT Lead/Project Coordinator at Cisco Systems Wipro Technologies March 2011  –  March 2012  (1 year 1 month) San Jose, CA Managed and coordinated the data center move for Cisco's Customer care IT Infrastructure for their Oracle E-Business Suite (EBS) Applications.  \nThe work involved- \n-Managing all the Infrastructure needs documentations, presenting them to the Infra Supply team as demand bundles and making sure the dev, testing, staging and Prod environment were delievered at the required time. \n-Keeping track of scope changes and getting them approved through CCB. \n-Maintaing risk register and issue log. \n-Managing stakeholders expectations via emails and meetings. Managing project close process. QA Lead at Cisco Systems Wipro Technologies June 2007  –  March 2011  (3 years 10 months) San Jose, CA Led QA team efforts for various projects like integrating Acquisition's data into Cisco business data systems and maintaining and upgrading the Oracle Business suite. \nThe work involved- \n•\tGathering, analyzing and finalizing the testing requirements and acceptance criteria from different stakeholders. \n•\tPreparation of quality documents viz. test plan, mitigation plan, test scenarios and test cases. \n•\tManaging test execution, bug reporting and getting the issues to closure. \n•\tCoordinating and attending daily defect status call, CCB meeting, Risk mitigation plan meeting \n•\tProject Managed waterfall SDLC project model. QA Lead at Cisco Systems Wipro Technologies June 2007  –  March 2011  (3 years 10 months) San Jose, CA Led QA team efforts for various projects like integrating Acquisition's data into Cisco business data systems and maintaining and upgrading the Oracle Business suite. \nThe work involved- \n•\tGathering, analyzing and finalizing the testing requirements and acceptance criteria from different stakeholders. \n•\tPreparation of quality documents viz. test plan, mitigation plan, test scenarios and test cases. \n•\tManaging test execution, bug reporting and getting the issues to closure. \n•\tCoordinating and attending daily defect status call, CCB meeting, Risk mitigation plan meeting \n•\tProject Managed waterfall SDLC project model. Senior Oracle Apps Technical Consultant Ricoh Company Ltd. January 2007  –  June 2007  (6 months) New Jersey • Worked extensively on the Accounts Receivables (AR) interfaces like Lock Box interface, AR Import Interface, AR Invoices, credit memos, debit memos, Payment scheduling and application, Receipt transactions, Charge backs, Adjustments, posting to GL. \n• Customized a few Concurrent Programs on Credit Card Receipts Reversal and Mismatch. Using SQL and PL/SQL. Senior Oracle Apps Technical Consultant Ricoh Company Ltd. January 2007  –  June 2007  (6 months) New Jersey • Worked extensively on the Accounts Receivables (AR) interfaces like Lock Box interface, AR Import Interface, AR Invoices, credit memos, debit memos, Payment scheduling and application, Receipt transactions, Charge backs, Adjustments, posting to GL. \n• Customized a few Concurrent Programs on Credit Card Receipts Reversal and Mismatch. Using SQL and PL/SQL. Oracle EBS Apps Technical Consultant at GE Commercial Finance Tata Consultancy Services April 2004  –  December 2005  (1 year 9 months) • Played a key role in maintaining General Ledger Interface, Configuration of General Ledger module like SOB, currency, calendar, Key Flex Fields, Descriptive Flex Fields, Profiles, Value Sets, and Lookups. \n• Developed and customized various applications and the related forms called GE Security module and Interface Engine. \n• Developed and validated the data in GL Interface, out bound interface like Auto validation file PO Extract. Oracle EBS Apps Technical Consultant at GE Commercial Finance Tata Consultancy Services April 2004  –  December 2005  (1 year 9 months) • Played a key role in maintaining General Ledger Interface, Configuration of General Ledger module like SOB, currency, calendar, Key Flex Fields, Descriptive Flex Fields, Profiles, Value Sets, and Lookups. \n• Developed and customized various applications and the related forms called GE Security module and Interface Engine. \n• Developed and validated the data in GL Interface, out bound interface like Auto validation file PO Extract. Software Engineer Mastek Ltd January 2004  –  April 2004  (4 months) Mumbai, India Worked on SQL Plus and TOAD and learnt forms and Reports. Software Engineer Mastek Ltd January 2004  –  April 2004  (4 months) Mumbai, India Worked on SQL Plus and TOAD and learnt forms and Reports. Skills Oracle Applications PL/SQL PMP PMO Business Analysis Managing cross... Managing virtual teams Planning Stakeholder Management Managing deliverables Virtual Teams Cross-functional Team... Project Planning SDLC Testing CRM Quality Assurance Project Management Program Management Management Requirements Analysis Oracle See 7+     See less Skills  Oracle Applications PL/SQL PMP PMO Business Analysis Managing cross... Managing virtual teams Planning Stakeholder Management Managing deliverables Virtual Teams Cross-functional Team... Project Planning SDLC Testing CRM Quality Assurance Project Management Program Management Management Requirements Analysis Oracle See 7+     See less Oracle Applications PL/SQL PMP PMO Business Analysis Managing cross... Managing virtual teams Planning Stakeholder Management Managing deliverables Virtual Teams Cross-functional Team... Project Planning SDLC Testing CRM Quality Assurance Project Management Program Management Management Requirements Analysis Oracle See 7+     See less Oracle Applications PL/SQL PMP PMO Business Analysis Managing cross... Managing virtual teams Planning Stakeholder Management Managing deliverables Virtual Teams Cross-functional Team... Project Planning SDLC Testing CRM Quality Assurance Project Management Program Management Management Requirements Analysis Oracle See 7+     See less Education S.P. Jain Institute of Management & Research PGDIT,  Information Technology University of Mumbai BE,  Electronics Engineering S.P. Jain Institute of Management & Research PGDIT,  Information Technology S.P. Jain Institute of Management & Research PGDIT,  Information Technology S.P. Jain Institute of Management & Research PGDIT,  Information Technology University of Mumbai BE,  Electronics Engineering University of Mumbai BE,  Electronics Engineering University of Mumbai BE,  Electronics Engineering Honors & Awards Additional Honors & Awards 1. Six Sigma Green Belt certified. \n2. Certificate of Appreciation for outstanding performance and lasting contribution at Cisco.  \n3. Feather in the cap award for exceptional performance at Wipro. Additional Honors & Awards 1. Six Sigma Green Belt certified. \n2. Certificate of Appreciation for outstanding performance and lasting contribution at Cisco.  \n3. Feather in the cap award for exceptional performance at Wipro. Additional Honors & Awards 1. Six Sigma Green Belt certified. \n2. Certificate of Appreciation for outstanding performance and lasting contribution at Cisco.  \n3. Feather in the cap award for exceptional performance at Wipro. Additional Honors & Awards 1. Six Sigma Green Belt certified. \n2. Certificate of Appreciation for outstanding performance and lasting contribution at Cisco.  \n3. Feather in the cap award for exceptional performance at Wipro. ", "Summary 16 years of enabling business change & transformation through the delivery of IT solutions at 4 leading global IT companies. \n \nTroy started his career at IBM before joining Cisco for 10 + years. In his last role at Cisco he worked as an IT manager, reporting into Cisco’s CIO for Emerging Markets. \n \nIn November 2011, he transitioned to BT Global Services as an IT Senior Programme Manager in the Business Development team. \n \nIn April 2015 he took the opportunity to join a leading global systems integrator, World Wide Technology, taking a lead role in the execution of a global IT change programme at one of the world's leading financial services companies. \n \nExtensive experience of leading global teams to deliver successful outcomes at pace. Committed to delivering technological innovation whilst safeguarding business continuity. Adopts a consultative approach, ensuring that clients understand and maximise the value of IT solutions to optimise their business. \n \nCore Competencies: \n \n- People management. Led Project Delivery Teams of up to 30 team members spread across multiple continents \n- Full program lifecycle management from tender, to contract, implementation, SLA and technology adoption \n- IT Infrastructure and Technology Delivery at Cisco, the world’s leading network company. (11 + years) \n- Program and Project management – PRINCE II (APM) Qualified Project Manager Practitioner, 10+ years experience \n- Senior stakeholder management. Presentation at board level and press release engagements \n- Professional Services (3 + years) \n- Budget Responsibility of £20 Million per annum (£5M Capex & £15M Opex) \n- IT Spend optimisation (£1.8 Million of annual savings realised supporting Cisco’s African Business operation) \n- IT Infrastructure, Data Centre, Virtualisation, WAN strategy, IP Telephony, Video and Collaboration Tools \n- Outsource delivery as provider (BT) and customer (Cisco) \n- European market (10+ years) & high growth Emerging Markets countries (5+ years) \n- Retail Banking Sector Summary 16 years of enabling business change & transformation through the delivery of IT solutions at 4 leading global IT companies. \n \nTroy started his career at IBM before joining Cisco for 10 + years. In his last role at Cisco he worked as an IT manager, reporting into Cisco’s CIO for Emerging Markets. \n \nIn November 2011, he transitioned to BT Global Services as an IT Senior Programme Manager in the Business Development team. \n \nIn April 2015 he took the opportunity to join a leading global systems integrator, World Wide Technology, taking a lead role in the execution of a global IT change programme at one of the world's leading financial services companies. \n \nExtensive experience of leading global teams to deliver successful outcomes at pace. Committed to delivering technological innovation whilst safeguarding business continuity. Adopts a consultative approach, ensuring that clients understand and maximise the value of IT solutions to optimise their business. \n \nCore Competencies: \n \n- People management. Led Project Delivery Teams of up to 30 team members spread across multiple continents \n- Full program lifecycle management from tender, to contract, implementation, SLA and technology adoption \n- IT Infrastructure and Technology Delivery at Cisco, the world’s leading network company. (11 + years) \n- Program and Project management – PRINCE II (APM) Qualified Project Manager Practitioner, 10+ years experience \n- Senior stakeholder management. Presentation at board level and press release engagements \n- Professional Services (3 + years) \n- Budget Responsibility of £20 Million per annum (£5M Capex & £15M Opex) \n- IT Spend optimisation (£1.8 Million of annual savings realised supporting Cisco’s African Business operation) \n- IT Infrastructure, Data Centre, Virtualisation, WAN strategy, IP Telephony, Video and Collaboration Tools \n- Outsource delivery as provider (BT) and customer (Cisco) \n- European market (10+ years) & high growth Emerging Markets countries (5+ years) \n- Retail Banking Sector 16 years of enabling business change & transformation through the delivery of IT solutions at 4 leading global IT companies. \n \nTroy started his career at IBM before joining Cisco for 10 + years. In his last role at Cisco he worked as an IT manager, reporting into Cisco’s CIO for Emerging Markets. \n \nIn November 2011, he transitioned to BT Global Services as an IT Senior Programme Manager in the Business Development team. \n \nIn April 2015 he took the opportunity to join a leading global systems integrator, World Wide Technology, taking a lead role in the execution of a global IT change programme at one of the world's leading financial services companies. \n \nExtensive experience of leading global teams to deliver successful outcomes at pace. Committed to delivering technological innovation whilst safeguarding business continuity. Adopts a consultative approach, ensuring that clients understand and maximise the value of IT solutions to optimise their business. \n \nCore Competencies: \n \n- People management. Led Project Delivery Teams of up to 30 team members spread across multiple continents \n- Full program lifecycle management from tender, to contract, implementation, SLA and technology adoption \n- IT Infrastructure and Technology Delivery at Cisco, the world’s leading network company. (11 + years) \n- Program and Project management – PRINCE II (APM) Qualified Project Manager Practitioner, 10+ years experience \n- Senior stakeholder management. Presentation at board level and press release engagements \n- Professional Services (3 + years) \n- Budget Responsibility of £20 Million per annum (£5M Capex & £15M Opex) \n- IT Spend optimisation (£1.8 Million of annual savings realised supporting Cisco’s African Business operation) \n- IT Infrastructure, Data Centre, Virtualisation, WAN strategy, IP Telephony, Video and Collaboration Tools \n- Outsource delivery as provider (BT) and customer (Cisco) \n- European market (10+ years) & high growth Emerging Markets countries (5+ years) \n- Retail Banking Sector 16 years of enabling business change & transformation through the delivery of IT solutions at 4 leading global IT companies. \n \nTroy started his career at IBM before joining Cisco for 10 + years. In his last role at Cisco he worked as an IT manager, reporting into Cisco’s CIO for Emerging Markets. \n \nIn November 2011, he transitioned to BT Global Services as an IT Senior Programme Manager in the Business Development team. \n \nIn April 2015 he took the opportunity to join a leading global systems integrator, World Wide Technology, taking a lead role in the execution of a global IT change programme at one of the world's leading financial services companies. \n \nExtensive experience of leading global teams to deliver successful outcomes at pace. Committed to delivering technological innovation whilst safeguarding business continuity. Adopts a consultative approach, ensuring that clients understand and maximise the value of IT solutions to optimise their business. \n \nCore Competencies: \n \n- People management. Led Project Delivery Teams of up to 30 team members spread across multiple continents \n- Full program lifecycle management from tender, to contract, implementation, SLA and technology adoption \n- IT Infrastructure and Technology Delivery at Cisco, the world’s leading network company. (11 + years) \n- Program and Project management – PRINCE II (APM) Qualified Project Manager Practitioner, 10+ years experience \n- Senior stakeholder management. Presentation at board level and press release engagements \n- Professional Services (3 + years) \n- Budget Responsibility of £20 Million per annum (£5M Capex & £15M Opex) \n- IT Spend optimisation (£1.8 Million of annual savings realised supporting Cisco’s African Business operation) \n- IT Infrastructure, Data Centre, Virtualisation, WAN strategy, IP Telephony, Video and Collaboration Tools \n- Outsource delivery as provider (BT) and customer (Cisco) \n- European market (10+ years) & high growth Emerging Markets countries (5+ years) \n- Retail Banking Sector Experience Senior Project Manager IT World Wide Technology April 2015  – Present (5 months) Oxfordshire, United Kingdom Senior Project Manager IT World Wide Technology April 2015  – Present (5 months) Oxfordshire, United Kingdom Senior Project Manager IT World Wide Technology April 2015  – Present (5 months) Oxfordshire, United Kingdom ", "Summary Thirty five years experience managing national and international projects delivering technology and business solutions using a variety of methodologies, approaches and techniques including Agile, Feature Driven Development, SCRUM, JIT, RAD, Object Oriented Analysis and Design, traditional waterfall and sashimi (overlapping waterfall). \n \nSpecialties: Project/Program/Release Management, Contract management, business process design, vendor management, localization and internalization of applications. \n \nI have worked with mutual fund, banking, mortgage origination/servicing, networking/technology, oil exploration/refining, golf equipment and securities trading companies in a variety of roles. \n \nProduct experience highlights: \n \nOracle R12 \nOracle 11i \nCommerce One \nAllen Communication's Learning Management System \nUpside Software's Contract Lifecycle Mgmt System \nMoodle \nSharepoint \nChangepoint \nPortera Summary Thirty five years experience managing national and international projects delivering technology and business solutions using a variety of methodologies, approaches and techniques including Agile, Feature Driven Development, SCRUM, JIT, RAD, Object Oriented Analysis and Design, traditional waterfall and sashimi (overlapping waterfall). \n \nSpecialties: Project/Program/Release Management, Contract management, business process design, vendor management, localization and internalization of applications. \n \nI have worked with mutual fund, banking, mortgage origination/servicing, networking/technology, oil exploration/refining, golf equipment and securities trading companies in a variety of roles. \n \nProduct experience highlights: \n \nOracle R12 \nOracle 11i \nCommerce One \nAllen Communication's Learning Management System \nUpside Software's Contract Lifecycle Mgmt System \nMoodle \nSharepoint \nChangepoint \nPortera Thirty five years experience managing national and international projects delivering technology and business solutions using a variety of methodologies, approaches and techniques including Agile, Feature Driven Development, SCRUM, JIT, RAD, Object Oriented Analysis and Design, traditional waterfall and sashimi (overlapping waterfall). \n \nSpecialties: Project/Program/Release Management, Contract management, business process design, vendor management, localization and internalization of applications. \n \nI have worked with mutual fund, banking, mortgage origination/servicing, networking/technology, oil exploration/refining, golf equipment and securities trading companies in a variety of roles. \n \nProduct experience highlights: \n \nOracle R12 \nOracle 11i \nCommerce One \nAllen Communication's Learning Management System \nUpside Software's Contract Lifecycle Mgmt System \nMoodle \nSharepoint \nChangepoint \nPortera Thirty five years experience managing national and international projects delivering technology and business solutions using a variety of methodologies, approaches and techniques including Agile, Feature Driven Development, SCRUM, JIT, RAD, Object Oriented Analysis and Design, traditional waterfall and sashimi (overlapping waterfall). \n \nSpecialties: Project/Program/Release Management, Contract management, business process design, vendor management, localization and internalization of applications. \n \nI have worked with mutual fund, banking, mortgage origination/servicing, networking/technology, oil exploration/refining, golf equipment and securities trading companies in a variety of roles. \n \nProduct experience highlights: \n \nOracle R12 \nOracle 11i \nCommerce One \nAllen Communication's Learning Management System \nUpside Software's Contract Lifecycle Mgmt System \nMoodle \nSharepoint \nChangepoint \nPortera Experience Principal SCN Consulting Services February 2015  – Present (7 months) San Ramon CA Contract position as Program Manager on the DSV Project at Cisco Systems on the Disti team. Sabbatical Home September 2014  –  January 2015  (5 months) Home Taking a break till the beginning of 2015. Project Scheduler Chevron February 2013  –  August 2014  (1 year 7 months) San Ramon, CA Using Chevron’s CPDEP structure, develop the standards, tools and methodology for tracking a multi-year, international data center migration project. Using MS Project 2010, develop and maintain the master schedule, and coordinate the creation and maintenance of eight major sub-projects owned by individual project schedulers/leads. Track and report SPI, Earned Value and overall project health, advising on the critical path, slack, resource loading and at-risk deliverables. Work with team leads to develop their workplans, resource requirements and look-ahead schedules. ERMO Release Manager Cisco Systems August 2012  –  January 2013  (6 months) Quarterly Release Manager responsible for scope, risks/issues, testing, transition, deployment and normalization of 30 cross-functional, global projects. Program Manager, GTMSS Shared Services Initiative Cisco Systems August 2011  –  August 2012  (1 year 1 month) San Jose, CA Contract position as Program Manager for GTMSS Shared Services Initiative PMO, managing track deliverables, timeline, risks, issues, budgets and program reporting. Release Manager Cisco Systems November 2010  –  July 2011  (9 months) San Jose, CA Contract position as Release Manager for Price Categorization PMO delivering the Q3FY12 Release. Responsible for all phases of the PMLC from requirements through normalization. Project Manager Cisco Systems August 2010  –  November 2010  (4 months) San Jose, CA Contract position as Project Manager for BASE team responsibile for strategic QA activities and deliverables. Program Manager Cisco Systems February 2010  –  August 2010  (7 months) Program Manager working on Acquisition Integrations for the Marketing Operations team. Cisco International Boundary Business Analyst Cisco February 2009  –  February 2010  (1 year 1 month) Boundary management on Cisco's STC 2.0 Release. IT Project Manager Cisco Systems May 2008  –  January 2009  (9 months) Manage E2E CCIT project deliverables for the Q2FY09 Release - Champion and Trade Collaborator Projects. Senior Project Manager Robert Half International May 2005  –  March 2008  (2 years 11 months) Manage enterprise wide projects for business and IT customers on web, telephony and internet technology platforms. Completed international Blackberry roll out, national Applicant Tracking (HR Candidate) System project. Currently engaged in an international Contract Lifecyle Management project to centralize contract repositories, automate creation/approval/review workflow, and manage the end-to-end contract lifecycle. Also managing an Enterprise Learning Management System project to help formalize RHI's approach to resource and employee training and development. Project Manager Cisco Systems May 2002  –  June 2005  (3 years 2 months) Contract with Cisco Systems as a Senior Project Manager managing the execution and planning of the transition phase for a global Oracle 10.7 to Oracle 11i implementation project, integrating business, IT and communications tasks to seamlessly implement the change while optimizing internal and external customer impact. Also held responsibility for the boundary systems track, analyzing the global internet commerce engine and cisco.com related projects. Working with both the technical and business participants, guided the owners of 150 distinct systems from thirteen global business units throughout the SDLC from ID & Assess to Post Production Review and Support. Managed timelines, deliverables, project tracking and reporting and issue resolution. IT Manager i2 Technologies December 2000  –  December 2001  (1 year 1 month) Managed and directed support staff providing services to 1,200 customers employing various operating systems, networks, desktops, servers, hardware platforms and software products. Prepared and established regional goals, budgets and initiatives. Managed projects with a staff of 30 administrators. Coordinated with IS support infrastructure and with business unit projects. Accountable for all project reporting and analysis, statistics and issues. Hands on experience administering/solving NT 4.0 Server/Desktop and Win 2k Server requests. Moderate exposure to Unix commands and features, Solaris 2.6-2.8. IT Manager/PM Corio July 1997  –  November 2000  (3 years 5 months) Provided software support to major accounts for E-Commerce products. Worked with Commerce One, Changepoint and Portera. Directed new projects from implementation through post-production. Presented and negotiated new business proposals to clients. Maintained vendor and publisher relationships. Developed and established standards and practices. \n \nManaged the company's IT Application and Network Services, including software applications, internet, extranet, desktop support, and help desk. Developed standards procedures for the network infrastructure. Designed the IT Roadmap and delivered services to the users and customers. Defined standards for the company's computer equipment and negotiated vendor agreements. Extensive hands on experience on NT 4.0 Server and Desktop platforms, and MS Exchange. Migrated Lotus Notes email platform to MS Exchange. IT Manager DSCI July 1997  –  November 2000  (3 years 5 months) Manager in the IT outsourcing offering of a professional services company headquartered in Silicon Valley. Backed by KPMG, the company morphed into Corio, one of the first full service ASPs to exist. IT Manager Alien Sport November 1995  –  June 1997  (1 year 8 months) Manage 30 node mixed Novell 3.12/4.0 network environment, provide Win 95/Win 3.1 desktop using 3Com 3C5x9 nics running on Category 5 10Base-T physical layer with HP AdvanceStack hubs. Installed and supported HP NetServer LF/LM servers with Micropolis Raidion stacks with ARCServe backup. Maintain ROLM 30e 9751 CBX based switch using EMML 6.2, CCMS and ROLM Phonemail 6.1 using Interalia DVR. Perform all physical device moves, adds and changes. Direct activities and projects of six contractors and vendors. Negotiate service and support contracts for data and voice systems. Develop and monitor $500,000 departmental budget. Project Manager Franklin Templeton Group 1993  –  1995  (2 years) Project Lead and developer, in Progress and Clipper, of mortgage and cash securities trading systems. IT Analyst Citicorp Mortgage 1986  –  1987  (1 year) Analyze, Design and Develop MIS Data and Reports for the Mortgage Loan Servicing Division. Principal SCN Consulting Services February 2015  – Present (7 months) San Ramon CA Contract position as Program Manager on the DSV Project at Cisco Systems on the Disti team. Principal SCN Consulting Services February 2015  – Present (7 months) San Ramon CA Contract position as Program Manager on the DSV Project at Cisco Systems on the Disti team. Sabbatical Home September 2014  –  January 2015  (5 months) Home Taking a break till the beginning of 2015. Sabbatical Home September 2014  –  January 2015  (5 months) Home Taking a break till the beginning of 2015. Project Scheduler Chevron February 2013  –  August 2014  (1 year 7 months) San Ramon, CA Using Chevron’s CPDEP structure, develop the standards, tools and methodology for tracking a multi-year, international data center migration project. Using MS Project 2010, develop and maintain the master schedule, and coordinate the creation and maintenance of eight major sub-projects owned by individual project schedulers/leads. Track and report SPI, Earned Value and overall project health, advising on the critical path, slack, resource loading and at-risk deliverables. Work with team leads to develop their workplans, resource requirements and look-ahead schedules. Project Scheduler Chevron February 2013  –  August 2014  (1 year 7 months) San Ramon, CA Using Chevron’s CPDEP structure, develop the standards, tools and methodology for tracking a multi-year, international data center migration project. Using MS Project 2010, develop and maintain the master schedule, and coordinate the creation and maintenance of eight major sub-projects owned by individual project schedulers/leads. Track and report SPI, Earned Value and overall project health, advising on the critical path, slack, resource loading and at-risk deliverables. Work with team leads to develop their workplans, resource requirements and look-ahead schedules. ERMO Release Manager Cisco Systems August 2012  –  January 2013  (6 months) Quarterly Release Manager responsible for scope, risks/issues, testing, transition, deployment and normalization of 30 cross-functional, global projects. ERMO Release Manager Cisco Systems August 2012  –  January 2013  (6 months) Quarterly Release Manager responsible for scope, risks/issues, testing, transition, deployment and normalization of 30 cross-functional, global projects. Program Manager, GTMSS Shared Services Initiative Cisco Systems August 2011  –  August 2012  (1 year 1 month) San Jose, CA Contract position as Program Manager for GTMSS Shared Services Initiative PMO, managing track deliverables, timeline, risks, issues, budgets and program reporting. Program Manager, GTMSS Shared Services Initiative Cisco Systems August 2011  –  August 2012  (1 year 1 month) San Jose, CA Contract position as Program Manager for GTMSS Shared Services Initiative PMO, managing track deliverables, timeline, risks, issues, budgets and program reporting. Release Manager Cisco Systems November 2010  –  July 2011  (9 months) San Jose, CA Contract position as Release Manager for Price Categorization PMO delivering the Q3FY12 Release. Responsible for all phases of the PMLC from requirements through normalization. Release Manager Cisco Systems November 2010  –  July 2011  (9 months) San Jose, CA Contract position as Release Manager for Price Categorization PMO delivering the Q3FY12 Release. Responsible for all phases of the PMLC from requirements through normalization. Project Manager Cisco Systems August 2010  –  November 2010  (4 months) San Jose, CA Contract position as Project Manager for BASE team responsibile for strategic QA activities and deliverables. Project Manager Cisco Systems August 2010  –  November 2010  (4 months) San Jose, CA Contract position as Project Manager for BASE team responsibile for strategic QA activities and deliverables. Program Manager Cisco Systems February 2010  –  August 2010  (7 months) Program Manager working on Acquisition Integrations for the Marketing Operations team. Program Manager Cisco Systems February 2010  –  August 2010  (7 months) Program Manager working on Acquisition Integrations for the Marketing Operations team. Cisco International Boundary Business Analyst Cisco February 2009  –  February 2010  (1 year 1 month) Boundary management on Cisco's STC 2.0 Release. Cisco International Boundary Business Analyst Cisco February 2009  –  February 2010  (1 year 1 month) Boundary management on Cisco's STC 2.0 Release. IT Project Manager Cisco Systems May 2008  –  January 2009  (9 months) Manage E2E CCIT project deliverables for the Q2FY09 Release - Champion and Trade Collaborator Projects. IT Project Manager Cisco Systems May 2008  –  January 2009  (9 months) Manage E2E CCIT project deliverables for the Q2FY09 Release - Champion and Trade Collaborator Projects. Senior Project Manager Robert Half International May 2005  –  March 2008  (2 years 11 months) Manage enterprise wide projects for business and IT customers on web, telephony and internet technology platforms. Completed international Blackberry roll out, national Applicant Tracking (HR Candidate) System project. Currently engaged in an international Contract Lifecyle Management project to centralize contract repositories, automate creation/approval/review workflow, and manage the end-to-end contract lifecycle. Also managing an Enterprise Learning Management System project to help formalize RHI's approach to resource and employee training and development. Senior Project Manager Robert Half International May 2005  –  March 2008  (2 years 11 months) Manage enterprise wide projects for business and IT customers on web, telephony and internet technology platforms. Completed international Blackberry roll out, national Applicant Tracking (HR Candidate) System project. Currently engaged in an international Contract Lifecyle Management project to centralize contract repositories, automate creation/approval/review workflow, and manage the end-to-end contract lifecycle. Also managing an Enterprise Learning Management System project to help formalize RHI's approach to resource and employee training and development. Project Manager Cisco Systems May 2002  –  June 2005  (3 years 2 months) Contract with Cisco Systems as a Senior Project Manager managing the execution and planning of the transition phase for a global Oracle 10.7 to Oracle 11i implementation project, integrating business, IT and communications tasks to seamlessly implement the change while optimizing internal and external customer impact. Also held responsibility for the boundary systems track, analyzing the global internet commerce engine and cisco.com related projects. Working with both the technical and business participants, guided the owners of 150 distinct systems from thirteen global business units throughout the SDLC from ID & Assess to Post Production Review and Support. Managed timelines, deliverables, project tracking and reporting and issue resolution. Project Manager Cisco Systems May 2002  –  June 2005  (3 years 2 months) Contract with Cisco Systems as a Senior Project Manager managing the execution and planning of the transition phase for a global Oracle 10.7 to Oracle 11i implementation project, integrating business, IT and communications tasks to seamlessly implement the change while optimizing internal and external customer impact. Also held responsibility for the boundary systems track, analyzing the global internet commerce engine and cisco.com related projects. Working with both the technical and business participants, guided the owners of 150 distinct systems from thirteen global business units throughout the SDLC from ID & Assess to Post Production Review and Support. Managed timelines, deliverables, project tracking and reporting and issue resolution. IT Manager i2 Technologies December 2000  –  December 2001  (1 year 1 month) Managed and directed support staff providing services to 1,200 customers employing various operating systems, networks, desktops, servers, hardware platforms and software products. Prepared and established regional goals, budgets and initiatives. Managed projects with a staff of 30 administrators. Coordinated with IS support infrastructure and with business unit projects. Accountable for all project reporting and analysis, statistics and issues. Hands on experience administering/solving NT 4.0 Server/Desktop and Win 2k Server requests. Moderate exposure to Unix commands and features, Solaris 2.6-2.8. IT Manager i2 Technologies December 2000  –  December 2001  (1 year 1 month) Managed and directed support staff providing services to 1,200 customers employing various operating systems, networks, desktops, servers, hardware platforms and software products. Prepared and established regional goals, budgets and initiatives. Managed projects with a staff of 30 administrators. Coordinated with IS support infrastructure and with business unit projects. Accountable for all project reporting and analysis, statistics and issues. Hands on experience administering/solving NT 4.0 Server/Desktop and Win 2k Server requests. Moderate exposure to Unix commands and features, Solaris 2.6-2.8. IT Manager/PM Corio July 1997  –  November 2000  (3 years 5 months) Provided software support to major accounts for E-Commerce products. Worked with Commerce One, Changepoint and Portera. Directed new projects from implementation through post-production. Presented and negotiated new business proposals to clients. Maintained vendor and publisher relationships. Developed and established standards and practices. \n \nManaged the company's IT Application and Network Services, including software applications, internet, extranet, desktop support, and help desk. Developed standards procedures for the network infrastructure. Designed the IT Roadmap and delivered services to the users and customers. Defined standards for the company's computer equipment and negotiated vendor agreements. Extensive hands on experience on NT 4.0 Server and Desktop platforms, and MS Exchange. Migrated Lotus Notes email platform to MS Exchange. IT Manager/PM Corio July 1997  –  November 2000  (3 years 5 months) Provided software support to major accounts for E-Commerce products. Worked with Commerce One, Changepoint and Portera. Directed new projects from implementation through post-production. Presented and negotiated new business proposals to clients. Maintained vendor and publisher relationships. Developed and established standards and practices. \n \nManaged the company's IT Application and Network Services, including software applications, internet, extranet, desktop support, and help desk. Developed standards procedures for the network infrastructure. Designed the IT Roadmap and delivered services to the users and customers. Defined standards for the company's computer equipment and negotiated vendor agreements. Extensive hands on experience on NT 4.0 Server and Desktop platforms, and MS Exchange. Migrated Lotus Notes email platform to MS Exchange. IT Manager DSCI July 1997  –  November 2000  (3 years 5 months) Manager in the IT outsourcing offering of a professional services company headquartered in Silicon Valley. Backed by KPMG, the company morphed into Corio, one of the first full service ASPs to exist. IT Manager DSCI July 1997  –  November 2000  (3 years 5 months) Manager in the IT outsourcing offering of a professional services company headquartered in Silicon Valley. Backed by KPMG, the company morphed into Corio, one of the first full service ASPs to exist. IT Manager Alien Sport November 1995  –  June 1997  (1 year 8 months) Manage 30 node mixed Novell 3.12/4.0 network environment, provide Win 95/Win 3.1 desktop using 3Com 3C5x9 nics running on Category 5 10Base-T physical layer with HP AdvanceStack hubs. Installed and supported HP NetServer LF/LM servers with Micropolis Raidion stacks with ARCServe backup. Maintain ROLM 30e 9751 CBX based switch using EMML 6.2, CCMS and ROLM Phonemail 6.1 using Interalia DVR. Perform all physical device moves, adds and changes. Direct activities and projects of six contractors and vendors. Negotiate service and support contracts for data and voice systems. Develop and monitor $500,000 departmental budget. IT Manager Alien Sport November 1995  –  June 1997  (1 year 8 months) Manage 30 node mixed Novell 3.12/4.0 network environment, provide Win 95/Win 3.1 desktop using 3Com 3C5x9 nics running on Category 5 10Base-T physical layer with HP AdvanceStack hubs. Installed and supported HP NetServer LF/LM servers with Micropolis Raidion stacks with ARCServe backup. Maintain ROLM 30e 9751 CBX based switch using EMML 6.2, CCMS and ROLM Phonemail 6.1 using Interalia DVR. Perform all physical device moves, adds and changes. Direct activities and projects of six contractors and vendors. Negotiate service and support contracts for data and voice systems. Develop and monitor $500,000 departmental budget. Project Manager Franklin Templeton Group 1993  –  1995  (2 years) Project Lead and developer, in Progress and Clipper, of mortgage and cash securities trading systems. Project Manager Franklin Templeton Group 1993  –  1995  (2 years) Project Lead and developer, in Progress and Clipper, of mortgage and cash securities trading systems. IT Analyst Citicorp Mortgage 1986  –  1987  (1 year) Analyze, Design and Develop MIS Data and Reports for the Mortgage Loan Servicing Division. IT Analyst Citicorp Mortgage 1986  –  1987  (1 year) Analyze, Design and Develop MIS Data and Reports for the Mortgage Loan Servicing Division. Languages Tagalog Elementary proficiency French Elementary proficiency Tagalog Elementary proficiency French Elementary proficiency Tagalog Elementary proficiency French Elementary proficiency Elementary proficiency Elementary proficiency Skills Vendor Management Business Process Design SharePoint Contract Management Banking Project Management Release Management Program Management SDLC PMLC Agile Methodologies Business Intelligence Enterprise Software Strategy Scrum Oracle Management Project Planning Project Portfolio... Quality Assurance PMP PMO Cross-functional Team... See 8+     See less Skills  Vendor Management Business Process Design SharePoint Contract Management Banking Project Management Release Management Program Management SDLC PMLC Agile Methodologies Business Intelligence Enterprise Software Strategy Scrum Oracle Management Project Planning Project Portfolio... Quality Assurance PMP PMO Cross-functional Team... See 8+     See less Vendor Management Business Process Design SharePoint Contract Management Banking Project Management Release Management Program Management SDLC PMLC Agile Methodologies Business Intelligence Enterprise Software Strategy Scrum Oracle Management Project Planning Project Portfolio... Quality Assurance PMP PMO Cross-functional Team... See 8+     See less Vendor Management Business Process Design SharePoint Contract Management Banking Project Management Release Management Program Management SDLC PMLC Agile Methodologies Business Intelligence Enterprise Software Strategy Scrum Oracle Management Project Planning Project Portfolio... Quality Assurance PMP PMO Cross-functional Team... See 8+     See less Honors & Awards Additional Honors & Awards The love of a terrific woman and the blessing of two wonderful kids. Additional Honors & Awards The love of a terrific woman and the blessing of two wonderful kids. Additional Honors & Awards The love of a terrific woman and the blessing of two wonderful kids. Additional Honors & Awards The love of a terrific woman and the blessing of two wonderful kids. ", "Summary Project Management Professional \n12+ years experience in Project Management \nExpert in Microsoft Suite \nWorking towards Six Sigma \nGlobal Projects Summary Project Management Professional \n12+ years experience in Project Management \nExpert in Microsoft Suite \nWorking towards Six Sigma \nGlobal Projects Project Management Professional \n12+ years experience in Project Management \nExpert in Microsoft Suite \nWorking towards Six Sigma \nGlobal Projects Project Management Professional \n12+ years experience in Project Management \nExpert in Microsoft Suite \nWorking towards Six Sigma \nGlobal Projects Experience Project Manager Cisco Systems December 2009  – Present (5 years 9 months) Customer Value Chain Management  \nQuebec Francisation Project (Compliance/Localization) Project Manager Cisco Systems, Inc December 2009  – Present (5 years 9 months) CVCM (Customer Value Chain Management) \nProject Manager for Quebec Francisation Language Charter Compliance Project \nEnsured translation of all products, documentation, labels, packaging for Province of Quebec from English verbiage to International French \nWorked cross-functionally to define stakeholders/owners for all Business Units and Channel Partners involved \nCreated Scope (Schedule, Resource Chart, Budgeting, Timeline) \nImplemented plan to reach compliance, creation of WBS (Work Breakdown Structure) \nMonitor & Control Project Manager Cisco Systems, Inc July 2009  –  September 2009  (3 months) GPS \nStreamlined process for updating News & Events for Global Sales team \nImplemented governance process and training \nDefined roles including: Bloggers, SME's, Forum moderators, Communities, and content distributors \nCreated a single location for all Cisco product, sales, news & event information in order to assist sales personnel when meeting with customers/clients \nUpdated Team Wiki Project Manager Cisco Systems, Inc. (Z Resources) December 2006  –  January 2009  (2 years 2 months) Leasing Service PM (Cisco Systems Capital) \nSupported account managers for Central Americas Division which included ensuring that all transactions were completed in a timely manner, creating all necessary documentation and performing lease administrative functions \nMonitored status of projects and communicated with customers, vendors and Account Managers \nPerformed credit uplifts and verified credit for clients desiring to lease products and maintenance Project and Program Manager Cisco Systems, Inc December 2007  –  December 2008  (1 year 1 month) Unified Network Management Systems, Enterprise Routing and Switching, SP Services and Applications, SP Mobile Wireless VT Programs \nImplemented new processes to increase participation and broaden communication channels for SE training content \nManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force \nOrganized global training events SEVT and Partner/Channels VT \nLead and participated in global team meetings (Webex, Video Conferencing) \nLead team in change management & cost savings initiative moving from physical program deliveries to 100% virtual program deliveries.Collaborated with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE's \nUpdated, Maintained and Monitored all Program Web/Wiki Pages (Enterprise, Unified, Service Provider, Verticals) for World Wide Sales Development Team via DreamWeaver \nDeveloped vSearch (Sales/Marketing Community) - Blogging, Presentation/Documentation storage, Downloadable Links, Training/Education Project Manager Cisco Systems December 1995  –  December 2007  (12 years 1 month) Customer Advocacy - Project Manager Cisco Systems, Inc October 2006  –  November 2007  (1 year 2 months) Participated in a daily Change Control Board for IT related projects (C3 Core Oracle System, Cisco.com, Corporate Email, Telephones, Data Centers, Cisco Network) \nReported list of critical projects the Executive Review Board on a weekly basis for Risk Assessment  \nParticipated in multiple internal projects within the CA/TS Organization Including: ASDM, PDC-Production Data Center, Synergy \nOrganized team and cross-functional discussions based on communication requirements \nApplication & System Dependency Mapping for IT organization \nUpdating Internal Wiki page for Technical Services Organization Project Coordinator / Project Manager Applied Computer Solutions October 2005  –  October 2006  (1 year 1 month) Assembled and supervised engineers on multiple projects throughout California \nManaged all aspects of all projects from conception to completion \nMaximized project profitability by creating and organizing price-points for products and services \nDatabase Development \nProcessed weekly billing and forecasting reports to corporate headquarters \nCreated Project Scope, EVM, QA, Risk Assessment Project Manager ONI Systems January 2000  –  January 2002  (2 years 1 month) Procurement Management, Vendor Relationships, Bidding Conferences \nResource schedule management, Risk Assessment, Contract Administration \nMonitored project status, budget, and completion of all active projects for North America \nTracked and compiled customer feedback to enhance service offerings (Lessons Learned) \nCVCM - Customer Value Chain Management - Looping customer feedback to R&D stage \nProcess Analysis Team Lead / Project Manager for Customer Advocacy / Advanced Services Cisco Systems, Inc January 1995  –  January 2000  (5 years 1 month) Maintained escalation point for 10+ individuals \nTraining Lead for all new employees - Implemented new group processes \nProvided support to high end customers with extensive service level contracts \nFull Project Life-cycle \nEvaluated discrepancies reported by customers and implemented resolution tactics \nQuoting transactional 1-100 site units \nNegotiating costs, Managing Partners, Vendor Relationships (NCR, Unisys)  \nManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects Jr. Project Manager Cisco Systems January 1996  –  January 1999  (3 years 1 month) Assisted multiple Regional Project Managers in organizing multi-site projects internationally \nTraveled to various customer locations to introduce On-Site Services \nBuilt key relationships with vendors \nMaintained escalation point for 10+ project coordinators \nManaged all aspects of all project life cycle from conception to completion Call Center Representative / Project Coordinator Cisco Systems January 1995  –  January 1996  (1 year 1 month) Coordinated with vendors and engineers worldwide to provide service to failed networks within a 4 hour time-frame (Internationally) \nReviewed small projects and assisted with contract administration \nImplemented new processes to cut down on call time and improve serviceability  \nMaintained monthly customer satisfaction reports for upper management \nLogistics and Customer Operations \nDemand Management and Planning Project Manager Cisco Systems December 2009  – Present (5 years 9 months) Customer Value Chain Management  \nQuebec Francisation Project (Compliance/Localization) Project Manager Cisco Systems December 2009  – Present (5 years 9 months) Customer Value Chain Management  \nQuebec Francisation Project (Compliance/Localization) Project Manager Cisco Systems, Inc December 2009  – Present (5 years 9 months) CVCM (Customer Value Chain Management) \nProject Manager for Quebec Francisation Language Charter Compliance Project \nEnsured translation of all products, documentation, labels, packaging for Province of Quebec from English verbiage to International French \nWorked cross-functionally to define stakeholders/owners for all Business Units and Channel Partners involved \nCreated Scope (Schedule, Resource Chart, Budgeting, Timeline) \nImplemented plan to reach compliance, creation of WBS (Work Breakdown Structure) \nMonitor & Control Project Manager Cisco Systems, Inc December 2009  – Present (5 years 9 months) CVCM (Customer Value Chain Management) \nProject Manager for Quebec Francisation Language Charter Compliance Project \nEnsured translation of all products, documentation, labels, packaging for Province of Quebec from English verbiage to International French \nWorked cross-functionally to define stakeholders/owners for all Business Units and Channel Partners involved \nCreated Scope (Schedule, Resource Chart, Budgeting, Timeline) \nImplemented plan to reach compliance, creation of WBS (Work Breakdown Structure) \nMonitor & Control Project Manager Cisco Systems, Inc July 2009  –  September 2009  (3 months) GPS \nStreamlined process for updating News & Events for Global Sales team \nImplemented governance process and training \nDefined roles including: Bloggers, SME's, Forum moderators, Communities, and content distributors \nCreated a single location for all Cisco product, sales, news & event information in order to assist sales personnel when meeting with customers/clients \nUpdated Team Wiki Project Manager Cisco Systems, Inc July 2009  –  September 2009  (3 months) GPS \nStreamlined process for updating News & Events for Global Sales team \nImplemented governance process and training \nDefined roles including: Bloggers, SME's, Forum moderators, Communities, and content distributors \nCreated a single location for all Cisco product, sales, news & event information in order to assist sales personnel when meeting with customers/clients \nUpdated Team Wiki Project Manager Cisco Systems, Inc. (Z Resources) December 2006  –  January 2009  (2 years 2 months) Leasing Service PM (Cisco Systems Capital) \nSupported account managers for Central Americas Division which included ensuring that all transactions were completed in a timely manner, creating all necessary documentation and performing lease administrative functions \nMonitored status of projects and communicated with customers, vendors and Account Managers \nPerformed credit uplifts and verified credit for clients desiring to lease products and maintenance Project Manager Cisco Systems, Inc. (Z Resources) December 2006  –  January 2009  (2 years 2 months) Leasing Service PM (Cisco Systems Capital) \nSupported account managers for Central Americas Division which included ensuring that all transactions were completed in a timely manner, creating all necessary documentation and performing lease administrative functions \nMonitored status of projects and communicated with customers, vendors and Account Managers \nPerformed credit uplifts and verified credit for clients desiring to lease products and maintenance Project and Program Manager Cisco Systems, Inc December 2007  –  December 2008  (1 year 1 month) Unified Network Management Systems, Enterprise Routing and Switching, SP Services and Applications, SP Mobile Wireless VT Programs \nImplemented new processes to increase participation and broaden communication channels for SE training content \nManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force \nOrganized global training events SEVT and Partner/Channels VT \nLead and participated in global team meetings (Webex, Video Conferencing) \nLead team in change management & cost savings initiative moving from physical program deliveries to 100% virtual program deliveries.Collaborated with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE's \nUpdated, Maintained and Monitored all Program Web/Wiki Pages (Enterprise, Unified, Service Provider, Verticals) for World Wide Sales Development Team via DreamWeaver \nDeveloped vSearch (Sales/Marketing Community) - Blogging, Presentation/Documentation storage, Downloadable Links, Training/Education Project and Program Manager Cisco Systems, Inc December 2007  –  December 2008  (1 year 1 month) Unified Network Management Systems, Enterprise Routing and Switching, SP Services and Applications, SP Mobile Wireless VT Programs \nImplemented new processes to increase participation and broaden communication channels for SE training content \nManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force \nOrganized global training events SEVT and Partner/Channels VT \nLead and participated in global team meetings (Webex, Video Conferencing) \nLead team in change management & cost savings initiative moving from physical program deliveries to 100% virtual program deliveries.Collaborated with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE's \nUpdated, Maintained and Monitored all Program Web/Wiki Pages (Enterprise, Unified, Service Provider, Verticals) for World Wide Sales Development Team via DreamWeaver \nDeveloped vSearch (Sales/Marketing Community) - Blogging, Presentation/Documentation storage, Downloadable Links, Training/Education Project Manager Cisco Systems December 1995  –  December 2007  (12 years 1 month) Project Manager Cisco Systems December 1995  –  December 2007  (12 years 1 month) Customer Advocacy - Project Manager Cisco Systems, Inc October 2006  –  November 2007  (1 year 2 months) Participated in a daily Change Control Board for IT related projects (C3 Core Oracle System, Cisco.com, Corporate Email, Telephones, Data Centers, Cisco Network) \nReported list of critical projects the Executive Review Board on a weekly basis for Risk Assessment  \nParticipated in multiple internal projects within the CA/TS Organization Including: ASDM, PDC-Production Data Center, Synergy \nOrganized team and cross-functional discussions based on communication requirements \nApplication & System Dependency Mapping for IT organization \nUpdating Internal Wiki page for Technical Services Organization Customer Advocacy - Project Manager Cisco Systems, Inc October 2006  –  November 2007  (1 year 2 months) Participated in a daily Change Control Board for IT related projects (C3 Core Oracle System, Cisco.com, Corporate Email, Telephones, Data Centers, Cisco Network) \nReported list of critical projects the Executive Review Board on a weekly basis for Risk Assessment  \nParticipated in multiple internal projects within the CA/TS Organization Including: ASDM, PDC-Production Data Center, Synergy \nOrganized team and cross-functional discussions based on communication requirements \nApplication & System Dependency Mapping for IT organization \nUpdating Internal Wiki page for Technical Services Organization Project Coordinator / Project Manager Applied Computer Solutions October 2005  –  October 2006  (1 year 1 month) Assembled and supervised engineers on multiple projects throughout California \nManaged all aspects of all projects from conception to completion \nMaximized project profitability by creating and organizing price-points for products and services \nDatabase Development \nProcessed weekly billing and forecasting reports to corporate headquarters \nCreated Project Scope, EVM, QA, Risk Assessment Project Coordinator / Project Manager Applied Computer Solutions October 2005  –  October 2006  (1 year 1 month) Assembled and supervised engineers on multiple projects throughout California \nManaged all aspects of all projects from conception to completion \nMaximized project profitability by creating and organizing price-points for products and services \nDatabase Development \nProcessed weekly billing and forecasting reports to corporate headquarters \nCreated Project Scope, EVM, QA, Risk Assessment Project Manager ONI Systems January 2000  –  January 2002  (2 years 1 month) Procurement Management, Vendor Relationships, Bidding Conferences \nResource schedule management, Risk Assessment, Contract Administration \nMonitored project status, budget, and completion of all active projects for North America \nTracked and compiled customer feedback to enhance service offerings (Lessons Learned) \nCVCM - Customer Value Chain Management - Looping customer feedback to R&D stage \nProcess Analysis Project Manager ONI Systems January 2000  –  January 2002  (2 years 1 month) Procurement Management, Vendor Relationships, Bidding Conferences \nResource schedule management, Risk Assessment, Contract Administration \nMonitored project status, budget, and completion of all active projects for North America \nTracked and compiled customer feedback to enhance service offerings (Lessons Learned) \nCVCM - Customer Value Chain Management - Looping customer feedback to R&D stage \nProcess Analysis Team Lead / Project Manager for Customer Advocacy / Advanced Services Cisco Systems, Inc January 1995  –  January 2000  (5 years 1 month) Maintained escalation point for 10+ individuals \nTraining Lead for all new employees - Implemented new group processes \nProvided support to high end customers with extensive service level contracts \nFull Project Life-cycle \nEvaluated discrepancies reported by customers and implemented resolution tactics \nQuoting transactional 1-100 site units \nNegotiating costs, Managing Partners, Vendor Relationships (NCR, Unisys)  \nManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects Team Lead / Project Manager for Customer Advocacy / Advanced Services Cisco Systems, Inc January 1995  –  January 2000  (5 years 1 month) Maintained escalation point for 10+ individuals \nTraining Lead for all new employees - Implemented new group processes \nProvided support to high end customers with extensive service level contracts \nFull Project Life-cycle \nEvaluated discrepancies reported by customers and implemented resolution tactics \nQuoting transactional 1-100 site units \nNegotiating costs, Managing Partners, Vendor Relationships (NCR, Unisys)  \nManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects Jr. Project Manager Cisco Systems January 1996  –  January 1999  (3 years 1 month) Assisted multiple Regional Project Managers in organizing multi-site projects internationally \nTraveled to various customer locations to introduce On-Site Services \nBuilt key relationships with vendors \nMaintained escalation point for 10+ project coordinators \nManaged all aspects of all project life cycle from conception to completion Jr. Project Manager Cisco Systems January 1996  –  January 1999  (3 years 1 month) Assisted multiple Regional Project Managers in organizing multi-site projects internationally \nTraveled to various customer locations to introduce On-Site Services \nBuilt key relationships with vendors \nMaintained escalation point for 10+ project coordinators \nManaged all aspects of all project life cycle from conception to completion Call Center Representative / Project Coordinator Cisco Systems January 1995  –  January 1996  (1 year 1 month) Coordinated with vendors and engineers worldwide to provide service to failed networks within a 4 hour time-frame (Internationally) \nReviewed small projects and assisted with contract administration \nImplemented new processes to cut down on call time and improve serviceability  \nMaintained monthly customer satisfaction reports for upper management \nLogistics and Customer Operations \nDemand Management and Planning Call Center Representative / Project Coordinator Cisco Systems January 1995  –  January 1996  (1 year 1 month) Coordinated with vendors and engineers worldwide to provide service to failed networks within a 4 hour time-frame (Internationally) \nReviewed small projects and assisted with contract administration \nImplemented new processes to cut down on call time and improve serviceability  \nMaintained monthly customer satisfaction reports for upper management \nLogistics and Customer Operations \nDemand Management and Planning Education University of Phoenix BS,  Business Management 2007  – 2010 University of Phoenix BS,  Business Management University of Phoenix BS,  Business Management 2007  – 2010 University of Phoenix BS,  Business Management 2007  – 2010 University of Phoenix BS,  Business Management 2007  – 2010 University of Phoenix BS,  Business Management University of Phoenix BS,  Business Management University of Phoenix BS,  Business Management ", "Languages Hindi, Gujarati, Marathi Hindi, Gujarati, Marathi Hindi, Gujarati, Marathi Skills Cloud Computing Vendor Management Cross-functional Team... Program Management SDLC Integration Business Intelligence Cisco Technologies Process Improvement CRM Perl Salesforce.com Project Management PMO Change Management Software Project... SaaS Solution Architecture IT Strategy Enterprise Software Enterprise Architecture See 6+     See less Skills  Cloud Computing Vendor Management Cross-functional Team... Program Management SDLC Integration Business Intelligence Cisco Technologies Process Improvement CRM Perl Salesforce.com Project Management PMO Change Management Software Project... SaaS Solution Architecture IT Strategy Enterprise Software Enterprise Architecture See 6+     See less Cloud Computing Vendor Management Cross-functional Team... Program Management SDLC Integration Business Intelligence Cisco Technologies Process Improvement CRM Perl Salesforce.com Project Management PMO Change Management Software Project... SaaS Solution Architecture IT Strategy Enterprise Software Enterprise Architecture See 6+     See less Cloud Computing Vendor Management Cross-functional Team... Program Management SDLC Integration Business Intelligence Cisco Technologies Process Improvement CRM Perl Salesforce.com Project Management PMO Change Management Software Project... SaaS Solution Architecture IT Strategy Enterprise Software Enterprise Architecture See 6+     See less ", "Summary Program and Project Manager for several years at Fortune 500 companies. Core competency spans general program management, change management and process improvement. Functions well in high ambiguity programs and relating functions and capabilities for consumption by part-time hourly worker up through C-suite executives.  \n \nExtensive work in Silicon Valley, Chicago and Southern California based clients emphasizing on projects including Workday, SAP, Oracle and customized applications. Also conducted process mapping and change management initiatives conducted on a global scale for similar sets of clients. Summary Program and Project Manager for several years at Fortune 500 companies. Core competency spans general program management, change management and process improvement. Functions well in high ambiguity programs and relating functions and capabilities for consumption by part-time hourly worker up through C-suite executives.  \n \nExtensive work in Silicon Valley, Chicago and Southern California based clients emphasizing on projects including Workday, SAP, Oracle and customized applications. Also conducted process mapping and change management initiatives conducted on a global scale for similar sets of clients. Program and Project Manager for several years at Fortune 500 companies. Core competency spans general program management, change management and process improvement. Functions well in high ambiguity programs and relating functions and capabilities for consumption by part-time hourly worker up through C-suite executives.  \n \nExtensive work in Silicon Valley, Chicago and Southern California based clients emphasizing on projects including Workday, SAP, Oracle and customized applications. Also conducted process mapping and change management initiatives conducted on a global scale for similar sets of clients. Program and Project Manager for several years at Fortune 500 companies. Core competency spans general program management, change management and process improvement. Functions well in high ambiguity programs and relating functions and capabilities for consumption by part-time hourly worker up through C-suite executives.  \n \nExtensive work in Silicon Valley, Chicago and Southern California based clients emphasizing on projects including Workday, SAP, Oracle and customized applications. Also conducted process mapping and change management initiatives conducted on a global scale for similar sets of clients. Experience Change Management Consultant, Project Manager eBay Inc May 2014  – Present (1 year 4 months) San Jose, CA Business Development Ulixes Consulting January 2011  – Present (4 years 8 months) Palo Alto, CA Cisco Partner Annuity Initiative - Program Manager Cisco Systems August 2013  –  May 2014  (10 months) San Francisco Bay Area Cisco Partner Annuity Initiative — Opportunity Management Project Manager Cisco Systems July 2011  –  August 2013  (2 years 2 months) Services Operation — TANDBERG Acquisition and Integration Project Manager Cisco Systems May 2011  –  July 2011  (3 months) Corporate Development Integration — Product Portfolio Acquisition and Integration Project Manager Cisco Systems January 2011  –  May 2011  (5 months) Management Consultant Accenture September 2005  –  January 2009  (3 years 5 months) San Francisco Bay Area SAP Implementation — Communication Lead Ingram Micro April 2008  –  October 2008  (7 months) Project One Up — FP&A Training Lead PepsiCo September 2007  –  March 2008  (7 months) Communication Lead/Material Manager Accenture August 2007  –  September 2007  (2 months) Oracle Implementation Communication Lead Cisco Systems March 2007  –  August 2007  (6 months) Data Center Deployment Communication Co-Lead Cisco Systems April 2006  –  March 2007  (1 year) HR Transformation Integration Consultant Cisco Systems September 2005  –  April 2006  (8 months) Change Management Consultant, Project Manager eBay Inc May 2014  – Present (1 year 4 months) San Jose, CA Change Management Consultant, Project Manager eBay Inc May 2014  – Present (1 year 4 months) San Jose, CA Business Development Ulixes Consulting January 2011  – Present (4 years 8 months) Palo Alto, CA Business Development Ulixes Consulting January 2011  – Present (4 years 8 months) Palo Alto, CA Cisco Partner Annuity Initiative - Program Manager Cisco Systems August 2013  –  May 2014  (10 months) San Francisco Bay Area Cisco Partner Annuity Initiative - Program Manager Cisco Systems August 2013  –  May 2014  (10 months) San Francisco Bay Area Cisco Partner Annuity Initiative — Opportunity Management Project Manager Cisco Systems July 2011  –  August 2013  (2 years 2 months) Cisco Partner Annuity Initiative — Opportunity Management Project Manager Cisco Systems July 2011  –  August 2013  (2 years 2 months) Services Operation — TANDBERG Acquisition and Integration Project Manager Cisco Systems May 2011  –  July 2011  (3 months) Services Operation — TANDBERG Acquisition and Integration Project Manager Cisco Systems May 2011  –  July 2011  (3 months) Corporate Development Integration — Product Portfolio Acquisition and Integration Project Manager Cisco Systems January 2011  –  May 2011  (5 months) Corporate Development Integration — Product Portfolio Acquisition and Integration Project Manager Cisco Systems January 2011  –  May 2011  (5 months) Management Consultant Accenture September 2005  –  January 2009  (3 years 5 months) San Francisco Bay Area Management Consultant Accenture September 2005  –  January 2009  (3 years 5 months) San Francisco Bay Area SAP Implementation — Communication Lead Ingram Micro April 2008  –  October 2008  (7 months) SAP Implementation — Communication Lead Ingram Micro April 2008  –  October 2008  (7 months) Project One Up — FP&A Training Lead PepsiCo September 2007  –  March 2008  (7 months) Project One Up — FP&A Training Lead PepsiCo September 2007  –  March 2008  (7 months) Communication Lead/Material Manager Accenture August 2007  –  September 2007  (2 months) Communication Lead/Material Manager Accenture August 2007  –  September 2007  (2 months) Oracle Implementation Communication Lead Cisco Systems March 2007  –  August 2007  (6 months) Oracle Implementation Communication Lead Cisco Systems March 2007  –  August 2007  (6 months) Data Center Deployment Communication Co-Lead Cisco Systems April 2006  –  March 2007  (1 year) Data Center Deployment Communication Co-Lead Cisco Systems April 2006  –  March 2007  (1 year) HR Transformation Integration Consultant Cisco Systems September 2005  –  April 2006  (8 months) HR Transformation Integration Consultant Cisco Systems September 2005  –  April 2006  (8 months) Languages Spanish Spanish Spanish Skills Marketing Communications Management Internal Communications Project Planning Marketing Project Management Strategic Planning Press Releases Social Media Strategic Communications Product Management Strategy Marketing Strategy Business Strategy Corporate Communications Customer Service Social Media Marketing Public Relations Product Marketing Event Management Microsoft Office Program Management Management Consulting Leadership Change Management Cross-functional Team... Training Process Improvement Integration Analysis Software Documentation Project Portfolio... Stakeholder Management PMO Proposal Writing Entrepreneurship Business Development PMP See 23+     See less Skills  Marketing Communications Management Internal Communications Project Planning Marketing Project Management Strategic Planning Press Releases Social Media Strategic Communications Product Management Strategy Marketing Strategy Business Strategy Corporate Communications Customer Service Social Media Marketing Public Relations Product Marketing Event Management Microsoft Office Program Management Management Consulting Leadership Change Management Cross-functional Team... Training Process Improvement Integration Analysis Software Documentation Project Portfolio... Stakeholder Management PMO Proposal Writing Entrepreneurship Business Development PMP See 23+     See less Marketing Communications Management Internal Communications Project Planning Marketing Project Management Strategic Planning Press Releases Social Media Strategic Communications Product Management Strategy Marketing Strategy Business Strategy Corporate Communications Customer Service Social Media Marketing Public Relations Product Marketing Event Management Microsoft Office Program Management Management Consulting Leadership Change Management Cross-functional Team... Training Process Improvement Integration Analysis Software Documentation Project Portfolio... Stakeholder Management PMO Proposal Writing Entrepreneurship Business Development PMP See 23+     See less Marketing Communications Management Internal Communications Project Planning Marketing Project Management Strategic Planning Press Releases Social Media Strategic Communications Product Management Strategy Marketing Strategy Business Strategy Corporate Communications Customer Service Social Media Marketing Public Relations Product Marketing Event Management Microsoft Office Program Management Management Consulting Leadership Change Management Cross-functional Team... Training Process Improvement Integration Analysis Software Documentation Project Portfolio... Stakeholder Management PMO Proposal Writing Entrepreneurship Business Development PMP See 23+     See less ", "Experience Advanced Services Project Manager Cisco Systems, Inc. February 2010  – Present (5 years 7 months) Advanced Services Project Manager Cisco Systems, Inc. February 2010  – Present (5 years 7 months) Advanced Services Project Manager Cisco Systems, Inc. February 2010  – Present (5 years 7 months) Skills SaaS Call Center PMP Program Management Business Analysis Professional Services Cross-functional Team... Outsourcing Data Center Telecommunications Pre-sales Product Management Team Leadership Call Centers Project Management Leadership Process Improvement Customer Satisfaction Management Cloud Computing Forecasting Human Resources Service Delivery Access Vendor Management VoIP Integration Enterprise Software Wireless Unified Communications CRM Salesforce.com Managed Services Strategy Mobile Devices Strategic Partnerships See 21+     See less Skills  SaaS Call Center PMP Program Management Business Analysis Professional Services Cross-functional Team... Outsourcing Data Center Telecommunications Pre-sales Product Management Team Leadership Call Centers Project Management Leadership Process Improvement Customer Satisfaction Management Cloud Computing Forecasting Human Resources Service Delivery Access Vendor Management VoIP Integration Enterprise Software Wireless Unified Communications CRM Salesforce.com Managed Services Strategy Mobile Devices Strategic Partnerships See 21+     See less SaaS Call Center PMP Program Management Business Analysis Professional Services Cross-functional Team... Outsourcing Data Center Telecommunications Pre-sales Product Management Team Leadership Call Centers Project Management Leadership Process Improvement Customer Satisfaction Management Cloud Computing Forecasting Human Resources Service Delivery Access Vendor Management VoIP Integration Enterprise Software Wireless Unified Communications CRM Salesforce.com Managed Services Strategy Mobile Devices Strategic Partnerships See 21+     See less SaaS Call Center PMP Program Management Business Analysis Professional Services Cross-functional Team... Outsourcing Data Center Telecommunications Pre-sales Product Management Team Leadership Call Centers Project Management Leadership Process Improvement Customer Satisfaction Management Cloud Computing Forecasting Human Resources Service Delivery Access Vendor Management VoIP Integration Enterprise Software Wireless Unified Communications CRM Salesforce.com Managed Services Strategy Mobile Devices Strategic Partnerships See 21+     See less Education Simmons College - Simmons School of Management MBA,  Business Administration 1994  – 1996 University of California, Berkeley Simmons College - Simmons School of Management MBA,  Business Administration 1994  – 1996 Simmons College - Simmons School of Management MBA,  Business Administration 1994  – 1996 Simmons College - Simmons School of Management MBA,  Business Administration 1994  – 1996 University of California, Berkeley University of California, Berkeley University of California, Berkeley ", "Summary Software Project Manager at Cisco Systems Norway, creating software for video conference endpoints. Particularly interested in User Experience. \n \nPast experience also includes host and journalist for national TV show on popular science. \n \nSpecialties: C, C++, Java, Linux, Qt, Avid, Final Cut Pro, science journalism Summary Software Project Manager at Cisco Systems Norway, creating software for video conference endpoints. Particularly interested in User Experience. \n \nPast experience also includes host and journalist for national TV show on popular science. \n \nSpecialties: C, C++, Java, Linux, Qt, Avid, Final Cut Pro, science journalism Software Project Manager at Cisco Systems Norway, creating software for video conference endpoints. Particularly interested in User Experience. \n \nPast experience also includes host and journalist for national TV show on popular science. \n \nSpecialties: C, C++, Java, Linux, Qt, Avid, Final Cut Pro, science journalism Software Project Manager at Cisco Systems Norway, creating software for video conference endpoints. Particularly interested in User Experience. \n \nPast experience also includes host and journalist for national TV show on popular science. \n \nSpecialties: C, C++, Java, Linux, Qt, Avid, Final Cut Pro, science journalism Experience Software Project Manager Cisco Systems October 2012  – Present (2 years 11 months) Oslo Area, Norway System Developer Cisco Systems July 2010  –  September 2012  (2 years 3 months) System Developer TANDBERG June 2008  –  June 2010  (2 years 1 month) Science journalist / TV host NRK June 2005  –  June 2008  (3 years 1 month) System Developer Conceptual Development AS June 2003  –  June 2005  (2 years 1 month) Prototype Developer Institute for Energy Technology June 2002  –  December 2002  (7 months) Redaktør Student-TV 2002  –  2002  (less than a year) Software Project Manager Cisco Systems October 2012  – Present (2 years 11 months) Oslo Area, Norway Software Project Manager Cisco Systems October 2012  – Present (2 years 11 months) Oslo Area, Norway System Developer Cisco Systems July 2010  –  September 2012  (2 years 3 months) System Developer Cisco Systems July 2010  –  September 2012  (2 years 3 months) System Developer TANDBERG June 2008  –  June 2010  (2 years 1 month) System Developer TANDBERG June 2008  –  June 2010  (2 years 1 month) Science journalist / TV host NRK June 2005  –  June 2008  (3 years 1 month) Science journalist / TV host NRK June 2005  –  June 2008  (3 years 1 month) System Developer Conceptual Development AS June 2003  –  June 2005  (2 years 1 month) System Developer Conceptual Development AS June 2003  –  June 2005  (2 years 1 month) Prototype Developer Institute for Energy Technology June 2002  –  December 2002  (7 months) Prototype Developer Institute for Energy Technology June 2002  –  December 2002  (7 months) Redaktør Student-TV 2002  –  2002  (less than a year) Redaktør Student-TV 2002  –  2002  (less than a year) Skills C++ Software Project... Skills  C++ Software Project... C++ Software Project... C++ Software Project... Education Norwegian University of Science and Technology (NTNU) 1998  – 2004 Norwegian University of Science and Technology (NTNU) 1998  – 2004 Norwegian University of Science and Technology (NTNU) 1998  – 2004 Norwegian University of Science and Technology (NTNU) 1998  – 2004 ", "Skills ERP Business Transformation Program Management Quality Assurance Project Management Data Warehousing IT Service Management Process Improvement Solution Architecture IT Strategy SDLC CRM Vendor Management SOA Agile Methodologies Consulting Resource Management Business Analysis Scrum Enterprise Software PMP MS Project Software Project... Information Technology Enterprise Architecture Business Development Cross-functional Team... Cloud Computing Telecommunications Business Intelligence SQL Business Process Project Portfolio... Strategy Software Development Web Services Professional Services Team Leadership Team Management Talent Acquisition Product Management Visio Project Planning Change Management IT Outsourcing PMO Outsourcing Management Business Process... Java Enterprise Edition See 35+     See less Skills  ERP Business Transformation Program Management Quality Assurance Project Management Data Warehousing IT Service Management Process Improvement Solution Architecture IT Strategy SDLC CRM Vendor Management SOA Agile Methodologies Consulting Resource Management Business Analysis Scrum Enterprise Software PMP MS Project Software Project... Information Technology Enterprise Architecture Business Development Cross-functional Team... Cloud Computing Telecommunications Business Intelligence SQL Business Process Project Portfolio... Strategy Software Development Web Services Professional Services Team Leadership Team Management Talent Acquisition Product Management Visio Project Planning Change Management IT Outsourcing PMO Outsourcing Management Business Process... Java Enterprise Edition See 35+     See less ERP Business Transformation Program Management Quality Assurance Project Management Data Warehousing IT Service Management Process Improvement Solution Architecture IT Strategy SDLC CRM Vendor Management SOA Agile Methodologies Consulting Resource Management Business Analysis Scrum Enterprise Software PMP MS Project Software Project... Information Technology Enterprise Architecture Business Development Cross-functional Team... Cloud Computing Telecommunications Business Intelligence SQL Business Process Project Portfolio... Strategy Software Development Web Services Professional Services Team Leadership Team Management Talent Acquisition Product Management Visio Project Planning Change Management IT Outsourcing PMO Outsourcing Management Business Process... Java Enterprise Edition See 35+     See less ERP Business Transformation Program Management Quality Assurance Project Management Data Warehousing IT Service Management Process Improvement Solution Architecture IT Strategy SDLC CRM Vendor Management SOA Agile Methodologies Consulting Resource Management Business Analysis Scrum Enterprise Software PMP MS Project Software Project... Information Technology Enterprise Architecture Business Development Cross-functional Team... Cloud Computing Telecommunications Business Intelligence SQL Business Process Project Portfolio... Strategy Software Development Web Services Professional Services Team Leadership Team Management Talent Acquisition Product Management Visio Project Planning Change Management IT Outsourcing PMO Outsourcing Management Business Process... Java Enterprise Edition See 35+     See less ", "Skills Software Project... Master Data Management CRM ERP Program Management B2B Enterprise Architecture SAP R/3 New Business Development IT Strategy Solution Architecture Cross-functional Team... Enterprise Software Cloud Computing Pre-sales Skills  Software Project... Master Data Management CRM ERP Program Management B2B Enterprise Architecture SAP R/3 New Business Development IT Strategy Solution Architecture Cross-functional Team... Enterprise Software Cloud Computing Pre-sales Software Project... Master Data Management CRM ERP Program Management B2B Enterprise Architecture SAP R/3 New Business Development IT Strategy Solution Architecture Cross-functional Team... Enterprise Software Cloud Computing Pre-sales Software Project... Master Data Management CRM ERP Program Management B2B Enterprise Architecture SAP R/3 New Business Development IT Strategy Solution Architecture Cross-functional Team... Enterprise Software Cloud Computing Pre-sales ", "Skills Requirements Analysis Testing Quality Assurance Program Management Cross-functional Team... Business Process Oracle Product Management Management Strategy Project Planning Analysis Software Project... Vendor Management SDLC PMP Databases Unix Project Management PMO See 5+     See less Skills  Requirements Analysis Testing Quality Assurance Program Management Cross-functional Team... Business Process Oracle Product Management Management Strategy Project Planning Analysis Software Project... Vendor Management SDLC PMP Databases Unix Project Management PMO See 5+     See less Requirements Analysis Testing Quality Assurance Program Management Cross-functional Team... Business Process Oracle Product Management Management Strategy Project Planning Analysis Software Project... Vendor Management SDLC PMP Databases Unix Project Management PMO See 5+     See less Requirements Analysis Testing Quality Assurance Program Management Cross-functional Team... Business Process Oracle Product Management Management Strategy Project Planning Analysis Software Project... Vendor Management SDLC PMP Databases Unix Project Management PMO See 5+     See less ", "Summary My goal is to help clients identify opportunities that will allow them to become more efficient and profitable leveraging innovative technological solutions. Summary My goal is to help clients identify opportunities that will allow them to become more efficient and profitable leveraging innovative technological solutions. My goal is to help clients identify opportunities that will allow them to become more efficient and profitable leveraging innovative technological solutions. My goal is to help clients identify opportunities that will allow them to become more efficient and profitable leveraging innovative technological solutions. Experience Owner Perfectec S.A. de C.V. June 2013  – Present (2 years 3 months) Mexico Perfectec ofrece servicios de Consultoría, Desarrollo e Inteligencia de Negocios enfocada en la industria de Tecnología de Información y Comunicaciones (TIC). \n \nNuestra misión es ayudar a nuestros clientes a identificar oportunidades que permitan hacer mas eficientes sus operaciones e incrementar su utilidad a través de soluciones tecnológicas innovadoras. Sr. Merchandising Manager Dell August 2010  –  June 2013  (2 years 11 months) Managed the Consumer Services P&L including sales, product marketing, placement and promotions. Directly responsible for delivering on the Services financial forecast for revenue, units, and margin. Common responsibilities in this role include, developing pricing, promotional roadmaps, placement, executing new product launches, tracking daily business performance, and adjusting marketing plans as needed to exceed business goals. Product Manager Dell Inc. August 2006  –  October 2010  (4 years 3 months) Managed the strategy, planning, development and launch for the consumer and small business segments worldwide in the following categories: \n \n•Security Software (11/09 to 6/10)  \n•Local Backup & Media replacement (9/09 to 10/09) \n•Online Backup (08/06 to 08/08) \n \nCommon responsibilities for the roles above include: \n \n•Evaluated opportunities and advised all levels of management on pursuit strategy for product under my responsibility \n•Developed and implemented new product offerings, including local/online backup services and security software in the consumer and small business segments  \n•Collaborated cross-functionally with Services Architecture, Engineering, Manufacturing, Sales, Partner Marketing, and Support to validate new product concepts  \n•Established relationships with partners/vendors in the data protection business through Dell RFP/RFQ process in order to align strategic procurement requirements with Dell Product Group goals \n•Developed comprehensive go to market plans to help sales management worldwide for effective sales launch and marketing implementation  \n•Successfully launched Dell DataSafe Online Backup, Dell DataSafe Local Backup, McAfee SecurityCenter, Trend Internet Security, Trend Worry-Free Security Services, My Dell Downloads Web Site \n•Represented Dell at various media and product launch events \n•Advised and led marketing campaigns with an advertising agency to drive sales and global product awareness  \n•Drove growth in our distribution channels (direct, retail, tech support) Business Analyst Cisco Systems November 2005  –  July 2006  (9 months) Provided data and business skills to enhance Cisco’s online services & support \n \nPerformed ROI analyses to help executives understand the potential savings/revenue from undertaking various projects  \n \nPerformed data gathering & analysis to identify the strategic technologies to focus resources to make the strongest impact to customer satisfaction & Service Request (SR) avoidance \n \nCreated an objective standard to measure the link between customer behavior on Cisco’s Technical Support Web Site and Service Request (SR) avoidance  \n \nDeveloped and implemented the operational metrics needed to track key business drivers in Cisco’s online services & support operations – Tech Support Balanced Scorecard Content Engineer/Project Manager Cisco Systems October 2004  –  October 2005  (1 year 1 month) In Cisco’s online services & support operations, increased productivity and improved quality/accuracy of results by creating, redesigning and outsourcing processes \n \nManaged a team of sixteen SMEs locally & internationally in the following initiatives and accomplishments: \n \nReduced Knowledge Management (KM) Cycle Time (period from Service Request closure to content published online) in TSWeb Content Operations from 9 months to 2-3 months  \n \nAnalyzed the current vendor outsourcing situation, calculated the costs of doing business, identified the main cost drivers to redesign the existing Statement of Work (SOW) and re-negotiated a more appropriate Service Level Agreement (SLA) – Savings of 120K/year \n \nPerformed a resource allocation analysis to estimate the resources needed in India and Mexico to handle Cisco’s online Content Operations  \n \nOutsourced TSWeb Content Operations to India & Mexico Content Engineer/Project Manager Cisco Systems August 2003  –  October 2004  (1 year 3 months) Developed processes and measurements in the TSWeb Content Operations team to ensure the weekly/monthly/quarterly roles and responsibilities of the Subject Matter Experts (SMEs) were performed consistently across all technology domains \n \nLed Cisco Online Content Operations for Security/VPN \n \nProvided technical expertise on knowledge management best practices to facilitate online customer troubleshooting and avoid Service Request escalations to the Technical Assistance Center (TAC) \n \nTrained and mentored other engineers on knowledge management best practices \n \nProduced technical documents and white papers to support and solve complex product problems in customer networks \n \nActed as the TSWeb Point of Contact (POC) with the Product Supportability Engineering (PSE) organization to interact cross-functionally in several projects/initiatives Subject Matter Expert/Project Manager Cisco Systems August 2002  –  August 2003  (1 year 1 month) Managed a group of worldwide SMEs in various technology domains to reduce the cost associated with faulty hardware returns by implementing process improvements and raising awareness both internally and externally (Customers and Partners). Initial savings target for this project was set to $1.6M and the actual savings were $7.5M Subject Matter Expert/Customer Support Engineer III Cisco Systems September 2000  –  August 2002  (2 years) Led Cisco’s Online Content Operations for the following technologies:  \n \nAccess-Dial, Router & IOS Architecture, Storage Networking \n \nWorked cross-functionally with the Technical Assistance Center (TAC), Product Supportability Engineering (PSE) and Business Units (BUs) to reduce Service Request inflow to the TAC and improve customer satisfaction Customer Support Engineer I & II Cisco Systems July 1999  –  September 2000  (1 year 3 months) Provided worldwide technical support to customers on a broad range of company networking products. Specific job duties consisted of troubleshooting customer networks, locating defects and working with development engineers to fix products Owner Perfectec S.A. de C.V. June 2013  – Present (2 years 3 months) Mexico Perfectec ofrece servicios de Consultoría, Desarrollo e Inteligencia de Negocios enfocada en la industria de Tecnología de Información y Comunicaciones (TIC). \n \nNuestra misión es ayudar a nuestros clientes a identificar oportunidades que permitan hacer mas eficientes sus operaciones e incrementar su utilidad a través de soluciones tecnológicas innovadoras. Owner Perfectec S.A. de C.V. June 2013  – Present (2 years 3 months) Mexico Perfectec ofrece servicios de Consultoría, Desarrollo e Inteligencia de Negocios enfocada en la industria de Tecnología de Información y Comunicaciones (TIC). \n \nNuestra misión es ayudar a nuestros clientes a identificar oportunidades que permitan hacer mas eficientes sus operaciones e incrementar su utilidad a través de soluciones tecnológicas innovadoras. Sr. Merchandising Manager Dell August 2010  –  June 2013  (2 years 11 months) Managed the Consumer Services P&L including sales, product marketing, placement and promotions. Directly responsible for delivering on the Services financial forecast for revenue, units, and margin. Common responsibilities in this role include, developing pricing, promotional roadmaps, placement, executing new product launches, tracking daily business performance, and adjusting marketing plans as needed to exceed business goals. Sr. Merchandising Manager Dell August 2010  –  June 2013  (2 years 11 months) Managed the Consumer Services P&L including sales, product marketing, placement and promotions. Directly responsible for delivering on the Services financial forecast for revenue, units, and margin. Common responsibilities in this role include, developing pricing, promotional roadmaps, placement, executing new product launches, tracking daily business performance, and adjusting marketing plans as needed to exceed business goals. Product Manager Dell Inc. August 2006  –  October 2010  (4 years 3 months) Managed the strategy, planning, development and launch for the consumer and small business segments worldwide in the following categories: \n \n•Security Software (11/09 to 6/10)  \n•Local Backup & Media replacement (9/09 to 10/09) \n•Online Backup (08/06 to 08/08) \n \nCommon responsibilities for the roles above include: \n \n•Evaluated opportunities and advised all levels of management on pursuit strategy for product under my responsibility \n•Developed and implemented new product offerings, including local/online backup services and security software in the consumer and small business segments  \n•Collaborated cross-functionally with Services Architecture, Engineering, Manufacturing, Sales, Partner Marketing, and Support to validate new product concepts  \n•Established relationships with partners/vendors in the data protection business through Dell RFP/RFQ process in order to align strategic procurement requirements with Dell Product Group goals \n•Developed comprehensive go to market plans to help sales management worldwide for effective sales launch and marketing implementation  \n•Successfully launched Dell DataSafe Online Backup, Dell DataSafe Local Backup, McAfee SecurityCenter, Trend Internet Security, Trend Worry-Free Security Services, My Dell Downloads Web Site \n•Represented Dell at various media and product launch events \n•Advised and led marketing campaigns with an advertising agency to drive sales and global product awareness  \n•Drove growth in our distribution channels (direct, retail, tech support) Product Manager Dell Inc. August 2006  –  October 2010  (4 years 3 months) Managed the strategy, planning, development and launch for the consumer and small business segments worldwide in the following categories: \n \n•Security Software (11/09 to 6/10)  \n•Local Backup & Media replacement (9/09 to 10/09) \n•Online Backup (08/06 to 08/08) \n \nCommon responsibilities for the roles above include: \n \n•Evaluated opportunities and advised all levels of management on pursuit strategy for product under my responsibility \n•Developed and implemented new product offerings, including local/online backup services and security software in the consumer and small business segments  \n•Collaborated cross-functionally with Services Architecture, Engineering, Manufacturing, Sales, Partner Marketing, and Support to validate new product concepts  \n•Established relationships with partners/vendors in the data protection business through Dell RFP/RFQ process in order to align strategic procurement requirements with Dell Product Group goals \n•Developed comprehensive go to market plans to help sales management worldwide for effective sales launch and marketing implementation  \n•Successfully launched Dell DataSafe Online Backup, Dell DataSafe Local Backup, McAfee SecurityCenter, Trend Internet Security, Trend Worry-Free Security Services, My Dell Downloads Web Site \n•Represented Dell at various media and product launch events \n•Advised and led marketing campaigns with an advertising agency to drive sales and global product awareness  \n•Drove growth in our distribution channels (direct, retail, tech support) Business Analyst Cisco Systems November 2005  –  July 2006  (9 months) Provided data and business skills to enhance Cisco’s online services & support \n \nPerformed ROI analyses to help executives understand the potential savings/revenue from undertaking various projects  \n \nPerformed data gathering & analysis to identify the strategic technologies to focus resources to make the strongest impact to customer satisfaction & Service Request (SR) avoidance \n \nCreated an objective standard to measure the link between customer behavior on Cisco’s Technical Support Web Site and Service Request (SR) avoidance  \n \nDeveloped and implemented the operational metrics needed to track key business drivers in Cisco’s online services & support operations – Tech Support Balanced Scorecard Business Analyst Cisco Systems November 2005  –  July 2006  (9 months) Provided data and business skills to enhance Cisco’s online services & support \n \nPerformed ROI analyses to help executives understand the potential savings/revenue from undertaking various projects  \n \nPerformed data gathering & analysis to identify the strategic technologies to focus resources to make the strongest impact to customer satisfaction & Service Request (SR) avoidance \n \nCreated an objective standard to measure the link between customer behavior on Cisco’s Technical Support Web Site and Service Request (SR) avoidance  \n \nDeveloped and implemented the operational metrics needed to track key business drivers in Cisco’s online services & support operations – Tech Support Balanced Scorecard Content Engineer/Project Manager Cisco Systems October 2004  –  October 2005  (1 year 1 month) In Cisco’s online services & support operations, increased productivity and improved quality/accuracy of results by creating, redesigning and outsourcing processes \n \nManaged a team of sixteen SMEs locally & internationally in the following initiatives and accomplishments: \n \nReduced Knowledge Management (KM) Cycle Time (period from Service Request closure to content published online) in TSWeb Content Operations from 9 months to 2-3 months  \n \nAnalyzed the current vendor outsourcing situation, calculated the costs of doing business, identified the main cost drivers to redesign the existing Statement of Work (SOW) and re-negotiated a more appropriate Service Level Agreement (SLA) – Savings of 120K/year \n \nPerformed a resource allocation analysis to estimate the resources needed in India and Mexico to handle Cisco’s online Content Operations  \n \nOutsourced TSWeb Content Operations to India & Mexico Content Engineer/Project Manager Cisco Systems October 2004  –  October 2005  (1 year 1 month) In Cisco’s online services & support operations, increased productivity and improved quality/accuracy of results by creating, redesigning and outsourcing processes \n \nManaged a team of sixteen SMEs locally & internationally in the following initiatives and accomplishments: \n \nReduced Knowledge Management (KM) Cycle Time (period from Service Request closure to content published online) in TSWeb Content Operations from 9 months to 2-3 months  \n \nAnalyzed the current vendor outsourcing situation, calculated the costs of doing business, identified the main cost drivers to redesign the existing Statement of Work (SOW) and re-negotiated a more appropriate Service Level Agreement (SLA) – Savings of 120K/year \n \nPerformed a resource allocation analysis to estimate the resources needed in India and Mexico to handle Cisco’s online Content Operations  \n \nOutsourced TSWeb Content Operations to India & Mexico Content Engineer/Project Manager Cisco Systems August 2003  –  October 2004  (1 year 3 months) Developed processes and measurements in the TSWeb Content Operations team to ensure the weekly/monthly/quarterly roles and responsibilities of the Subject Matter Experts (SMEs) were performed consistently across all technology domains \n \nLed Cisco Online Content Operations for Security/VPN \n \nProvided technical expertise on knowledge management best practices to facilitate online customer troubleshooting and avoid Service Request escalations to the Technical Assistance Center (TAC) \n \nTrained and mentored other engineers on knowledge management best practices \n \nProduced technical documents and white papers to support and solve complex product problems in customer networks \n \nActed as the TSWeb Point of Contact (POC) with the Product Supportability Engineering (PSE) organization to interact cross-functionally in several projects/initiatives Content Engineer/Project Manager Cisco Systems August 2003  –  October 2004  (1 year 3 months) Developed processes and measurements in the TSWeb Content Operations team to ensure the weekly/monthly/quarterly roles and responsibilities of the Subject Matter Experts (SMEs) were performed consistently across all technology domains \n \nLed Cisco Online Content Operations for Security/VPN \n \nProvided technical expertise on knowledge management best practices to facilitate online customer troubleshooting and avoid Service Request escalations to the Technical Assistance Center (TAC) \n \nTrained and mentored other engineers on knowledge management best practices \n \nProduced technical documents and white papers to support and solve complex product problems in customer networks \n \nActed as the TSWeb Point of Contact (POC) with the Product Supportability Engineering (PSE) organization to interact cross-functionally in several projects/initiatives Subject Matter Expert/Project Manager Cisco Systems August 2002  –  August 2003  (1 year 1 month) Managed a group of worldwide SMEs in various technology domains to reduce the cost associated with faulty hardware returns by implementing process improvements and raising awareness both internally and externally (Customers and Partners). Initial savings target for this project was set to $1.6M and the actual savings were $7.5M Subject Matter Expert/Project Manager Cisco Systems August 2002  –  August 2003  (1 year 1 month) Managed a group of worldwide SMEs in various technology domains to reduce the cost associated with faulty hardware returns by implementing process improvements and raising awareness both internally and externally (Customers and Partners). Initial savings target for this project was set to $1.6M and the actual savings were $7.5M Subject Matter Expert/Customer Support Engineer III Cisco Systems September 2000  –  August 2002  (2 years) Led Cisco’s Online Content Operations for the following technologies:  \n \nAccess-Dial, Router & IOS Architecture, Storage Networking \n \nWorked cross-functionally with the Technical Assistance Center (TAC), Product Supportability Engineering (PSE) and Business Units (BUs) to reduce Service Request inflow to the TAC and improve customer satisfaction Subject Matter Expert/Customer Support Engineer III Cisco Systems September 2000  –  August 2002  (2 years) Led Cisco’s Online Content Operations for the following technologies:  \n \nAccess-Dial, Router & IOS Architecture, Storage Networking \n \nWorked cross-functionally with the Technical Assistance Center (TAC), Product Supportability Engineering (PSE) and Business Units (BUs) to reduce Service Request inflow to the TAC and improve customer satisfaction Customer Support Engineer I & II Cisco Systems July 1999  –  September 2000  (1 year 3 months) Provided worldwide technical support to customers on a broad range of company networking products. Specific job duties consisted of troubleshooting customer networks, locating defects and working with development engineers to fix products Customer Support Engineer I & II Cisco Systems July 1999  –  September 2000  (1 year 3 months) Provided worldwide technical support to customers on a broad range of company networking products. Specific job duties consisted of troubleshooting customer networks, locating defects and working with development engineers to fix products Languages Spanish Spanish Spanish Skills Go-to-market Strategy Product Lifecycle... Networking Market Analysis Data Management Pricing Product Management Sales Enablement Enterprise Software Cloud Computing Cross-functional Team... Analytics Product Launch Product Marketing SaaS Demand Generation Multi-channel Marketing Business Analysis Vendor Management Business Intelligence Program Management Business Development Competitive Analysis Management Product Development Business Strategy Process Improvement Marketing Strategy Outsourcing Marketing Sales Management Sales Strategic Partnerships Solution Selling Strategic Planning Salesforce.com Analysis Channel Partners See 23+     See less Skills  Go-to-market Strategy Product Lifecycle... Networking Market Analysis Data Management Pricing Product Management Sales Enablement Enterprise Software Cloud Computing Cross-functional Team... Analytics Product Launch Product Marketing SaaS Demand Generation Multi-channel Marketing Business Analysis Vendor Management Business Intelligence Program Management Business Development Competitive Analysis Management Product Development Business Strategy Process Improvement Marketing Strategy Outsourcing Marketing Sales Management Sales Strategic Partnerships Solution Selling Strategic Planning Salesforce.com Analysis Channel Partners See 23+     See less Go-to-market Strategy Product Lifecycle... Networking Market Analysis Data Management Pricing Product Management Sales Enablement Enterprise Software Cloud Computing Cross-functional Team... Analytics Product Launch Product Marketing SaaS Demand Generation Multi-channel Marketing Business Analysis Vendor Management Business Intelligence Program Management Business Development Competitive Analysis Management Product Development Business Strategy Process Improvement Marketing Strategy Outsourcing Marketing Sales Management Sales Strategic Partnerships Solution Selling Strategic Planning Salesforce.com Analysis Channel Partners See 23+     See less Go-to-market Strategy Product Lifecycle... Networking Market Analysis Data Management Pricing Product Management Sales Enablement Enterprise Software Cloud Computing Cross-functional Team... Analytics Product Launch Product Marketing SaaS Demand Generation Multi-channel Marketing Business Analysis Vendor Management Business Intelligence Program Management Business Development Competitive Analysis Management Product Development Business Strategy Process Improvement Marketing Strategy Outsourcing Marketing Sales Management Sales Strategic Partnerships Solution Selling Strategic Planning Salesforce.com Analysis Channel Partners See 23+     See less Education The University of Texas at Austin MBA,  Business Administration 2003  – 2006 The University of Texas at Austin - Red McCombs School of Business MBA,  Business Administration 2003  – 2006 The University of Texas at Austin MBA,  Business Administration 2003  – 2006 The University of Texas at Austin MBA,  Business Administration 2003  – 2006 The University of Texas at Austin MBA,  Business Administration 2003  – 2006 The University of Texas at Austin - Red McCombs School of Business MBA,  Business Administration 2003  – 2006 The University of Texas at Austin - Red McCombs School of Business MBA,  Business Administration 2003  – 2006 The University of Texas at Austin - Red McCombs School of Business MBA,  Business Administration 2003  – 2006 Honors & Awards Additional Honors & Awards Dell Product Group Excellence Award – In appreciation for extraordinary contribution to the successful launch of Dell DataSafe Online (www.Dell.com/DataSafe) \n \nCisco Achievement Program (CAP) Award - Identified the main cost drivers in the Content Improvement Process to successfully redesign the Statement of Work with Getronics, Inc.  \n \nCAP Award - Outstanding performance in contract negotiations with Getronics, Inc.  \n \nMcCombs School of Business: Capstone Business Plan/Presentation Challenge - Finalist \n \nMember of the varsity tennis team at The University of Texas (NCAA Division I) \n \nWho’s Who Among Students in American Colleges and Universities \n \nNational Dean’s List Additional Honors & Awards Dell Product Group Excellence Award – In appreciation for extraordinary contribution to the successful launch of Dell DataSafe Online (www.Dell.com/DataSafe) \n \nCisco Achievement Program (CAP) Award - Identified the main cost drivers in the Content Improvement Process to successfully redesign the Statement of Work with Getronics, Inc.  \n \nCAP Award - Outstanding performance in contract negotiations with Getronics, Inc.  \n \nMcCombs School of Business: Capstone Business Plan/Presentation Challenge - Finalist \n \nMember of the varsity tennis team at The University of Texas (NCAA Division I) \n \nWho’s Who Among Students in American Colleges and Universities \n \nNational Dean’s List Additional Honors & Awards Dell Product Group Excellence Award – In appreciation for extraordinary contribution to the successful launch of Dell DataSafe Online (www.Dell.com/DataSafe) \n \nCisco Achievement Program (CAP) Award - Identified the main cost drivers in the Content Improvement Process to successfully redesign the Statement of Work with Getronics, Inc.  \n \nCAP Award - Outstanding performance in contract negotiations with Getronics, Inc.  \n \nMcCombs School of Business: Capstone Business Plan/Presentation Challenge - Finalist \n \nMember of the varsity tennis team at The University of Texas (NCAA Division I) \n \nWho’s Who Among Students in American Colleges and Universities \n \nNational Dean’s List Additional Honors & Awards Dell Product Group Excellence Award – In appreciation for extraordinary contribution to the successful launch of Dell DataSafe Online (www.Dell.com/DataSafe) \n \nCisco Achievement Program (CAP) Award - Identified the main cost drivers in the Content Improvement Process to successfully redesign the Statement of Work with Getronics, Inc.  \n \nCAP Award - Outstanding performance in contract negotiations with Getronics, Inc.  \n \nMcCombs School of Business: Capstone Business Plan/Presentation Challenge - Finalist \n \nMember of the varsity tennis team at The University of Texas (NCAA Division I) \n \nWho’s Who Among Students in American Colleges and Universities \n \nNational Dean’s List ", "Summary A seasoned professional with more than 14+ years of Information Technology Experience. Excellent track record of Project Management, Quality Assurance, Release Management activities. In-depth knowledge of Time Management, Risk Management, Cost Management. Expert in working with cross-functional teams, cross-cultural to manage the combined portfolios in alignment with business and IT imperatives. Possesses keen aptitude to build strong relationships with stakeholders to ensure the client satisfaction and drive execution roadmaps to successful completion. Eager to learn, self-taught with technology, self-reliant, excellent team player. All skills are backed with excellent project management, effective communication and leadership skills. Exceptional ability to align with vision and business goals. Provide leadership, strategy and focus to get things done in timely manner. Demonstrated several initiatives & process improvements ideas and implemented most of them. \n \nSpecialties:  \n•\tProject Management \n•\tQuality Assurance \n•\tRelease Management \n•\tGAP analysis  \n•\tRelease Management \n•\tTime Management  \n•\tERP(Oracle apps) \n•\tRisk Management \n•\tCost Management \n•\tChange Management \n Summary A seasoned professional with more than 14+ years of Information Technology Experience. Excellent track record of Project Management, Quality Assurance, Release Management activities. In-depth knowledge of Time Management, Risk Management, Cost Management. Expert in working with cross-functional teams, cross-cultural to manage the combined portfolios in alignment with business and IT imperatives. Possesses keen aptitude to build strong relationships with stakeholders to ensure the client satisfaction and drive execution roadmaps to successful completion. Eager to learn, self-taught with technology, self-reliant, excellent team player. All skills are backed with excellent project management, effective communication and leadership skills. Exceptional ability to align with vision and business goals. Provide leadership, strategy and focus to get things done in timely manner. Demonstrated several initiatives & process improvements ideas and implemented most of them. \n \nSpecialties:  \n•\tProject Management \n•\tQuality Assurance \n•\tRelease Management \n•\tGAP analysis  \n•\tRelease Management \n•\tTime Management  \n•\tERP(Oracle apps) \n•\tRisk Management \n•\tCost Management \n•\tChange Management \n A seasoned professional with more than 14+ years of Information Technology Experience. Excellent track record of Project Management, Quality Assurance, Release Management activities. In-depth knowledge of Time Management, Risk Management, Cost Management. Expert in working with cross-functional teams, cross-cultural to manage the combined portfolios in alignment with business and IT imperatives. Possesses keen aptitude to build strong relationships with stakeholders to ensure the client satisfaction and drive execution roadmaps to successful completion. Eager to learn, self-taught with technology, self-reliant, excellent team player. All skills are backed with excellent project management, effective communication and leadership skills. Exceptional ability to align with vision and business goals. Provide leadership, strategy and focus to get things done in timely manner. Demonstrated several initiatives & process improvements ideas and implemented most of them. \n \nSpecialties:  \n•\tProject Management \n•\tQuality Assurance \n•\tRelease Management \n•\tGAP analysis  \n•\tRelease Management \n•\tTime Management  \n•\tERP(Oracle apps) \n•\tRisk Management \n•\tCost Management \n•\tChange Management \n A seasoned professional with more than 14+ years of Information Technology Experience. Excellent track record of Project Management, Quality Assurance, Release Management activities. In-depth knowledge of Time Management, Risk Management, Cost Management. Expert in working with cross-functional teams, cross-cultural to manage the combined portfolios in alignment with business and IT imperatives. Possesses keen aptitude to build strong relationships with stakeholders to ensure the client satisfaction and drive execution roadmaps to successful completion. Eager to learn, self-taught with technology, self-reliant, excellent team player. All skills are backed with excellent project management, effective communication and leadership skills. Exceptional ability to align with vision and business goals. Provide leadership, strategy and focus to get things done in timely manner. Demonstrated several initiatives & process improvements ideas and implemented most of them. \n \nSpecialties:  \n•\tProject Management \n•\tQuality Assurance \n•\tRelease Management \n•\tGAP analysis  \n•\tRelease Management \n•\tTime Management  \n•\tERP(Oracle apps) \n•\tRisk Management \n•\tCost Management \n•\tChange Management \n Experience Project Manager Cisco systems September 2014  – Present (1 year) Hyderabad Area, India Working from offshore to support & execute E2E process for SOT PMO team.  \nSOT PMO team drives unified testing approach for SOT program. Consolidate test execution timeline and milestone. Unified defect management process.  \n \n•\tWork closely with internal team of planning the execution of PMO deliverables and a proper handshake scenario for better execution of PMO team. \n•\tEnsure to close on order creation requirements by the team in order to avoid delay in OC deliverables. \n•\tConduct DSR calls. The entire cross functional teams participated in the DSR calls and provided the status update. Escalation related to defects, order delivery is addressed and action plan for resolving the issues is taken during the call.  \n•\tCommunicate to functional QA leads, PM’s & Cross-Initiatives across all test phases and issues. \n•\tConduct meetings and group chat and work towards resolution of defects/ issues.  \n•\tAct as a liaison for downstream and upstream for defect resolution. \n•\tConducted Sunset call to take the current status of execution and action plan for the teams working during PST hours \n \n \n \n \n Project Manager Cisco systems January 2013  –  June 2014  (1 year 6 months) sanjose Project Manger in ERMO Release Quality team. ERMO is the enterprise release management organization. All the major releases for Cisco are organized and managed by this organization. Release quality team of ERMO is one of the functions who works with the GSQS testing team and provide the reports and status of the release. \n \n•\tHandled Quarterly releases, first NGRM release where the governance was reformed from waterfall methodology to accommodate agile projects. \n•\tQ2O Pilot- This initiative was to drive the test time loss experience due to environment issues of the Q2O organization for a given release. Had to work with the team to retrieve the data, analyze and validate. Provided the visibility to the management through different graphs the impact to the test by infra vs development challenges. This help is RCA of the repetitive issues and finding out long/short term solutions. \n•\tTOCT Tool enhancement – Had to gather the requirement from clients and work with the development team and ensure that the implementation is as per the requirement \n•\tOC Pilot – GSQS Order creation team faces different challenges in a test environment which impacts their order creation. OC team is in China. Had to work with the team to retrieve the data, analyze and validate. Generated various reports and provided visibility to the management regarding various problem statements that caused the issue. Gave prominence of training issue, lack of adequate information, development issue and infra issue. This helped management to provided solutions in various areas. \n•\tRally Pilot in Q4FY14 to toil with team/GBP whose projects are not pursued in Quality Center and tracked in different testing tools Release Manager/Project Manager Cisco Systems April 2011  –  January 2013  (1 year 10 months) Handled quarterly as well as monthly releases for the CDAS Group as a Release Manager. The IT Connected Decision Advantage Services (CDAS) community provides insight to our services ranging from operation of the Enterprise Data Warehouse to the delivery of Identity Services, Master Data Services, Business Intelligence, Pricing and Offer Services, and Enterprise B2B solutions. Our environment is designed for sharing and disseminating relevant information by leveraging a clear framework including key messages and communication with our leadership team. We connect with our members through personal and professional networking facilitating cross-functional collaboration. CDAS group has multiple applications (core/non-core) under it. That includes TERADATA, IF, MDM, CPR, PHV.  \n \n•\tODYSSEY Migration was a major milestone successfully achieved with all the support of cross-functional teams. \n•\tWorked closely with sponsoring team of NGCCRM (Enabler) to resolve ODYSSEY and NGCCRM dependency which was a high risk for the ODYSSEY project. \n•\tWorked with QACC and ensure to have one POC for RMO/ERMO for all the applications of CDAS. \n•\tDemonstrated excellent leadership qualities in mitigating the risks, issues & escalation all through releases. \n•\tAddressed the PRA feedback of IT Project managers, QA, Transition & Operations and worked with the management to improve the process. \n•\tWorked with QA, Transition, Operations and Arch in consolidating the redundant requirements which was a major challenge for Teradata Dev Team. \n•\t1PCC process improvements with CDAS team and cross functional teams. \n QACC Core- QA Project Manager -Period Close /SOX Cisco Systems August 2010  –  March 2011  (8 months)  QACC Core PM for Period close, SOX , Metrics for the success migration of Cash Rover project. (GDCP) \nCash Rover a cross-functional initiative that migrate and upgrade the Quote-to-Cash (QTC) systems that manage 100 percent of Cisco’s revenue.  \n•\tSuccessful completion of Period Close activities. \n•\tDemonstrated the leadership qualities in leveraging the delivery of orders to the cross- functional teams in a timely manner from order creation team. \n•\tAchieved Certificate from QACC & IT PM for outstanding contribution for this project. \n \n \n WIB QA Lead Analyst Wells Fargo September 2009  –  September 2010  (1 year 1 month) San Francisco Bay Area It is and ISG group and WIB QA main goal is to develope brand strategy and statistics for QA Test plan & strategy development for the Wavovia and WellsFargo Merger. QA Specialist Cisco Systems September 2007  –  September 2009  (2 years 1 month) Description : ERMO \nProject Description : Metrics \nEnterprise Release Management Organization is a group in CISCO who handles the wide releases within Cisco and provides the various metrics about projects and their accurate testing status.  \nResponsibilities: \nGathering requirements from each group and analyze the impact on other groups on the implementation of requirements. Handle accordingly the implementation of the requirements and ensure that other teams would are not be impacted with the implementation. \nConduct QC Board meetings and prepare notes and preso for the meeting. \nAttend release meeting, QA meeting and transition meetings and accordingly prepare the preso for the meeting and take the notes of the concern of the teams and try to resolve it before the next week meeting \nPrepare the presentations for Readiness Review, Steering Committee and QC board meetings. \nWas involved and a key decision maker in the process set up for Quality Center which is one source of truth for the status of the release \nCustomization in QC for easily report in Business Objects. \nInteracting with the Project teams for the changes in their goals and test cases. Also co-ordinate and setup the new projects in the quality center to collect the metrics \nWorked as a Quality center administrator and communicate/co-ordinate with offshore teams to implement new enhancements for the QA managers/teams \nResponsible for Admin Maintenance tasks/Security with in the quality center. There are 7000 users which will be using the tool on day to day basis. \nImproved the Metrics reports accuracy by establishing and co-ordinate with teams to apply those standards. \nGenerated the various reports for defect summary, Test Execution summary, Priority test execution summary by project wise, consolidated summary/detail reports, overall test execution reports using Business Objects. \nEnvironment: Quality center, Business Objects, Toad, MS Word, MS Excel and Trans IT. Project Manager Cisco systems September 2014  – Present (1 year) Hyderabad Area, India Working from offshore to support & execute E2E process for SOT PMO team.  \nSOT PMO team drives unified testing approach for SOT program. Consolidate test execution timeline and milestone. Unified defect management process.  \n \n•\tWork closely with internal team of planning the execution of PMO deliverables and a proper handshake scenario for better execution of PMO team. \n•\tEnsure to close on order creation requirements by the team in order to avoid delay in OC deliverables. \n•\tConduct DSR calls. The entire cross functional teams participated in the DSR calls and provided the status update. Escalation related to defects, order delivery is addressed and action plan for resolving the issues is taken during the call.  \n•\tCommunicate to functional QA leads, PM’s & Cross-Initiatives across all test phases and issues. \n•\tConduct meetings and group chat and work towards resolution of defects/ issues.  \n•\tAct as a liaison for downstream and upstream for defect resolution. \n•\tConducted Sunset call to take the current status of execution and action plan for the teams working during PST hours \n \n \n \n \n Project Manager Cisco systems September 2014  – Present (1 year) Hyderabad Area, India Working from offshore to support & execute E2E process for SOT PMO team.  \nSOT PMO team drives unified testing approach for SOT program. Consolidate test execution timeline and milestone. Unified defect management process.  \n \n•\tWork closely with internal team of planning the execution of PMO deliverables and a proper handshake scenario for better execution of PMO team. \n•\tEnsure to close on order creation requirements by the team in order to avoid delay in OC deliverables. \n•\tConduct DSR calls. The entire cross functional teams participated in the DSR calls and provided the status update. Escalation related to defects, order delivery is addressed and action plan for resolving the issues is taken during the call.  \n•\tCommunicate to functional QA leads, PM’s & Cross-Initiatives across all test phases and issues. \n•\tConduct meetings and group chat and work towards resolution of defects/ issues.  \n•\tAct as a liaison for downstream and upstream for defect resolution. \n•\tConducted Sunset call to take the current status of execution and action plan for the teams working during PST hours \n \n \n \n \n Project Manager Cisco systems January 2013  –  June 2014  (1 year 6 months) sanjose Project Manger in ERMO Release Quality team. ERMO is the enterprise release management organization. All the major releases for Cisco are organized and managed by this organization. Release quality team of ERMO is one of the functions who works with the GSQS testing team and provide the reports and status of the release. \n \n•\tHandled Quarterly releases, first NGRM release where the governance was reformed from waterfall methodology to accommodate agile projects. \n•\tQ2O Pilot- This initiative was to drive the test time loss experience due to environment issues of the Q2O organization for a given release. Had to work with the team to retrieve the data, analyze and validate. Provided the visibility to the management through different graphs the impact to the test by infra vs development challenges. This help is RCA of the repetitive issues and finding out long/short term solutions. \n•\tTOCT Tool enhancement – Had to gather the requirement from clients and work with the development team and ensure that the implementation is as per the requirement \n•\tOC Pilot – GSQS Order creation team faces different challenges in a test environment which impacts their order creation. OC team is in China. Had to work with the team to retrieve the data, analyze and validate. Generated various reports and provided visibility to the management regarding various problem statements that caused the issue. Gave prominence of training issue, lack of adequate information, development issue and infra issue. This helped management to provided solutions in various areas. \n•\tRally Pilot in Q4FY14 to toil with team/GBP whose projects are not pursued in Quality Center and tracked in different testing tools Project Manager Cisco systems January 2013  –  June 2014  (1 year 6 months) sanjose Project Manger in ERMO Release Quality team. ERMO is the enterprise release management organization. All the major releases for Cisco are organized and managed by this organization. Release quality team of ERMO is one of the functions who works with the GSQS testing team and provide the reports and status of the release. \n \n•\tHandled Quarterly releases, first NGRM release where the governance was reformed from waterfall methodology to accommodate agile projects. \n•\tQ2O Pilot- This initiative was to drive the test time loss experience due to environment issues of the Q2O organization for a given release. Had to work with the team to retrieve the data, analyze and validate. Provided the visibility to the management through different graphs the impact to the test by infra vs development challenges. This help is RCA of the repetitive issues and finding out long/short term solutions. \n•\tTOCT Tool enhancement – Had to gather the requirement from clients and work with the development team and ensure that the implementation is as per the requirement \n•\tOC Pilot – GSQS Order creation team faces different challenges in a test environment which impacts their order creation. OC team is in China. Had to work with the team to retrieve the data, analyze and validate. Generated various reports and provided visibility to the management regarding various problem statements that caused the issue. Gave prominence of training issue, lack of adequate information, development issue and infra issue. This helped management to provided solutions in various areas. \n•\tRally Pilot in Q4FY14 to toil with team/GBP whose projects are not pursued in Quality Center and tracked in different testing tools Release Manager/Project Manager Cisco Systems April 2011  –  January 2013  (1 year 10 months) Handled quarterly as well as monthly releases for the CDAS Group as a Release Manager. The IT Connected Decision Advantage Services (CDAS) community provides insight to our services ranging from operation of the Enterprise Data Warehouse to the delivery of Identity Services, Master Data Services, Business Intelligence, Pricing and Offer Services, and Enterprise B2B solutions. Our environment is designed for sharing and disseminating relevant information by leveraging a clear framework including key messages and communication with our leadership team. We connect with our members through personal and professional networking facilitating cross-functional collaboration. CDAS group has multiple applications (core/non-core) under it. That includes TERADATA, IF, MDM, CPR, PHV.  \n \n•\tODYSSEY Migration was a major milestone successfully achieved with all the support of cross-functional teams. \n•\tWorked closely with sponsoring team of NGCCRM (Enabler) to resolve ODYSSEY and NGCCRM dependency which was a high risk for the ODYSSEY project. \n•\tWorked with QACC and ensure to have one POC for RMO/ERMO for all the applications of CDAS. \n•\tDemonstrated excellent leadership qualities in mitigating the risks, issues & escalation all through releases. \n•\tAddressed the PRA feedback of IT Project managers, QA, Transition & Operations and worked with the management to improve the process. \n•\tWorked with QA, Transition, Operations and Arch in consolidating the redundant requirements which was a major challenge for Teradata Dev Team. \n•\t1PCC process improvements with CDAS team and cross functional teams. \n Release Manager/Project Manager Cisco Systems April 2011  –  January 2013  (1 year 10 months) Handled quarterly as well as monthly releases for the CDAS Group as a Release Manager. The IT Connected Decision Advantage Services (CDAS) community provides insight to our services ranging from operation of the Enterprise Data Warehouse to the delivery of Identity Services, Master Data Services, Business Intelligence, Pricing and Offer Services, and Enterprise B2B solutions. Our environment is designed for sharing and disseminating relevant information by leveraging a clear framework including key messages and communication with our leadership team. We connect with our members through personal and professional networking facilitating cross-functional collaboration. CDAS group has multiple applications (core/non-core) under it. That includes TERADATA, IF, MDM, CPR, PHV.  \n \n•\tODYSSEY Migration was a major milestone successfully achieved with all the support of cross-functional teams. \n•\tWorked closely with sponsoring team of NGCCRM (Enabler) to resolve ODYSSEY and NGCCRM dependency which was a high risk for the ODYSSEY project. \n•\tWorked with QACC and ensure to have one POC for RMO/ERMO for all the applications of CDAS. \n•\tDemonstrated excellent leadership qualities in mitigating the risks, issues & escalation all through releases. \n•\tAddressed the PRA feedback of IT Project managers, QA, Transition & Operations and worked with the management to improve the process. \n•\tWorked with QA, Transition, Operations and Arch in consolidating the redundant requirements which was a major challenge for Teradata Dev Team. \n•\t1PCC process improvements with CDAS team and cross functional teams. \n QACC Core- QA Project Manager -Period Close /SOX Cisco Systems August 2010  –  March 2011  (8 months)  QACC Core PM for Period close, SOX , Metrics for the success migration of Cash Rover project. (GDCP) \nCash Rover a cross-functional initiative that migrate and upgrade the Quote-to-Cash (QTC) systems that manage 100 percent of Cisco’s revenue.  \n•\tSuccessful completion of Period Close activities. \n•\tDemonstrated the leadership qualities in leveraging the delivery of orders to the cross- functional teams in a timely manner from order creation team. \n•\tAchieved Certificate from QACC & IT PM for outstanding contribution for this project. \n \n \n QACC Core- QA Project Manager -Period Close /SOX Cisco Systems August 2010  –  March 2011  (8 months)  QACC Core PM for Period close, SOX , Metrics for the success migration of Cash Rover project. (GDCP) \nCash Rover a cross-functional initiative that migrate and upgrade the Quote-to-Cash (QTC) systems that manage 100 percent of Cisco’s revenue.  \n•\tSuccessful completion of Period Close activities. \n•\tDemonstrated the leadership qualities in leveraging the delivery of orders to the cross- functional teams in a timely manner from order creation team. \n•\tAchieved Certificate from QACC & IT PM for outstanding contribution for this project. \n \n \n WIB QA Lead Analyst Wells Fargo September 2009  –  September 2010  (1 year 1 month) San Francisco Bay Area It is and ISG group and WIB QA main goal is to develope brand strategy and statistics for QA Test plan & strategy development for the Wavovia and WellsFargo Merger. WIB QA Lead Analyst Wells Fargo September 2009  –  September 2010  (1 year 1 month) San Francisco Bay Area It is and ISG group and WIB QA main goal is to develope brand strategy and statistics for QA Test plan & strategy development for the Wavovia and WellsFargo Merger. QA Specialist Cisco Systems September 2007  –  September 2009  (2 years 1 month) Description : ERMO \nProject Description : Metrics \nEnterprise Release Management Organization is a group in CISCO who handles the wide releases within Cisco and provides the various metrics about projects and their accurate testing status.  \nResponsibilities: \nGathering requirements from each group and analyze the impact on other groups on the implementation of requirements. Handle accordingly the implementation of the requirements and ensure that other teams would are not be impacted with the implementation. \nConduct QC Board meetings and prepare notes and preso for the meeting. \nAttend release meeting, QA meeting and transition meetings and accordingly prepare the preso for the meeting and take the notes of the concern of the teams and try to resolve it before the next week meeting \nPrepare the presentations for Readiness Review, Steering Committee and QC board meetings. \nWas involved and a key decision maker in the process set up for Quality Center which is one source of truth for the status of the release \nCustomization in QC for easily report in Business Objects. \nInteracting with the Project teams for the changes in their goals and test cases. Also co-ordinate and setup the new projects in the quality center to collect the metrics \nWorked as a Quality center administrator and communicate/co-ordinate with offshore teams to implement new enhancements for the QA managers/teams \nResponsible for Admin Maintenance tasks/Security with in the quality center. There are 7000 users which will be using the tool on day to day basis. \nImproved the Metrics reports accuracy by establishing and co-ordinate with teams to apply those standards. \nGenerated the various reports for defect summary, Test Execution summary, Priority test execution summary by project wise, consolidated summary/detail reports, overall test execution reports using Business Objects. \nEnvironment: Quality center, Business Objects, Toad, MS Word, MS Excel and Trans IT. QA Specialist Cisco Systems September 2007  –  September 2009  (2 years 1 month) Description : ERMO \nProject Description : Metrics \nEnterprise Release Management Organization is a group in CISCO who handles the wide releases within Cisco and provides the various metrics about projects and their accurate testing status.  \nResponsibilities: \nGathering requirements from each group and analyze the impact on other groups on the implementation of requirements. Handle accordingly the implementation of the requirements and ensure that other teams would are not be impacted with the implementation. \nConduct QC Board meetings and prepare notes and preso for the meeting. \nAttend release meeting, QA meeting and transition meetings and accordingly prepare the preso for the meeting and take the notes of the concern of the teams and try to resolve it before the next week meeting \nPrepare the presentations for Readiness Review, Steering Committee and QC board meetings. \nWas involved and a key decision maker in the process set up for Quality Center which is one source of truth for the status of the release \nCustomization in QC for easily report in Business Objects. \nInteracting with the Project teams for the changes in their goals and test cases. Also co-ordinate and setup the new projects in the quality center to collect the metrics \nWorked as a Quality center administrator and communicate/co-ordinate with offshore teams to implement new enhancements for the QA managers/teams \nResponsible for Admin Maintenance tasks/Security with in the quality center. There are 7000 users which will be using the tool on day to day basis. \nImproved the Metrics reports accuracy by establishing and co-ordinate with teams to apply those standards. \nGenerated the various reports for defect summary, Test Execution summary, Priority test execution summary by project wise, consolidated summary/detail reports, overall test execution reports using Business Objects. \nEnvironment: Quality center, Business Objects, Toad, MS Word, MS Excel and Trans IT. Skills Oracle Requirements Analysis Quality Center Quality Assurance Testing Software Quality... Test Cases Microsoft SQL Server Release Management PMO Java Business Objects SDLC Agile Methodologies Test Planning PMP JavaScript Test Automation Cisco Technologies Software Project... ITIL Unix Agile Project Management HP Quality Center Enterprise Software Integration See 11+     See less Skills  Oracle Requirements Analysis Quality Center Quality Assurance Testing Software Quality... Test Cases Microsoft SQL Server Release Management PMO Java Business Objects SDLC Agile Methodologies Test Planning PMP JavaScript Test Automation Cisco Technologies Software Project... ITIL Unix Agile Project Management HP Quality Center Enterprise Software Integration See 11+     See less Oracle Requirements Analysis Quality Center Quality Assurance Testing Software Quality... Test Cases Microsoft SQL Server Release Management PMO Java Business Objects SDLC Agile Methodologies Test Planning PMP JavaScript Test Automation Cisco Technologies Software Project... ITIL Unix Agile Project Management HP Quality Center Enterprise Software Integration See 11+     See less Oracle Requirements Analysis Quality Center Quality Assurance Testing Software Quality... Test Cases Microsoft SQL Server Release Management PMO Java Business Objects SDLC Agile Methodologies Test Planning PMP JavaScript Test Automation Cisco Technologies Software Project... ITIL Unix Agile Project Management HP Quality Center Enterprise Software Integration See 11+     See less Education Osmania University Masters,  MIS 1994  – 1997 Osmania University Masters,  MIS 1994  – 1997 Osmania University Masters,  MIS 1994  – 1997 Osmania University Masters,  MIS 1994  – 1997 ", "Experience Project Manager Cisco Systems May 2013  – Present (2 years 4 months) Manager Advanced Services Cisco Systems January 2010  –  April 2013  (3 years 4 months) Business Development Manager Cisco Systems January 2005  –  December 2009  (5 years) Project Manager Cisco Systems May 2000  –  December 2004  (4 years 8 months) Project Manager IBM January 1996  –  April 2000  (4 years 4 months) Project Manager Getronics January 1989  –  December 1995  (7 years) Network Engineer Getronics January 1987  –  December 1988  (2 years) Project Manager Cisco Systems May 2013  – Present (2 years 4 months) Project Manager Cisco Systems May 2013  – Present (2 years 4 months) Manager Advanced Services Cisco Systems January 2010  –  April 2013  (3 years 4 months) Manager Advanced Services Cisco Systems January 2010  –  April 2013  (3 years 4 months) Business Development Manager Cisco Systems January 2005  –  December 2009  (5 years) Business Development Manager Cisco Systems January 2005  –  December 2009  (5 years) Project Manager Cisco Systems May 2000  –  December 2004  (4 years 8 months) Project Manager Cisco Systems May 2000  –  December 2004  (4 years 8 months) Project Manager IBM January 1996  –  April 2000  (4 years 4 months) Project Manager IBM January 1996  –  April 2000  (4 years 4 months) Project Manager Getronics January 1989  –  December 1995  (7 years) Project Manager Getronics January 1989  –  December 1995  (7 years) Network Engineer Getronics January 1987  –  December 1988  (2 years) Network Engineer Getronics January 1987  –  December 1988  (2 years) Skills Unified Communications Cisco Technologies Data Center Business Development Cloud Computing Skills  Unified Communications Cisco Technologies Data Center Business Development Cloud Computing Unified Communications Cisco Technologies Data Center Business Development Cloud Computing Unified Communications Cisco Technologies Data Center Business Development Cloud Computing Education Amsterdam University of Applied Sciences 1986  – 1992 Amsterdam University of Applied Sciences 1986  – 1992 Amsterdam University of Applied Sciences 1986  – 1992 Amsterdam University of Applied Sciences 1986  – 1992 ", "Summary •\tPMP Certified  \n•\tAbility to work cross-functionally / Globally \n•\tVendor Management \n•\tManaging all aspects of the project life cycle  \n•\tAbility to manage project deliverables on time and within budget \n•\tLocalization / Globalization \n•\tCorporate travel (Globally) \n•\tExperience in Manufacturing, Operations, Engineering builds \n•\tEvent Planning –Local/Global, Physical/Virtual, 300+ participants, 5 day duration, Video/Audio set-up, Food & Beverage set-up, and all event detail Project Management \n•\tGlobal Mission Trips and Fundraising for a non-profit Christian organization \n•\tYouth Group Leader for Jubilee Christian Center Summary •\tPMP Certified  \n•\tAbility to work cross-functionally / Globally \n•\tVendor Management \n•\tManaging all aspects of the project life cycle  \n•\tAbility to manage project deliverables on time and within budget \n•\tLocalization / Globalization \n•\tCorporate travel (Globally) \n•\tExperience in Manufacturing, Operations, Engineering builds \n•\tEvent Planning –Local/Global, Physical/Virtual, 300+ participants, 5 day duration, Video/Audio set-up, Food & Beverage set-up, and all event detail Project Management \n•\tGlobal Mission Trips and Fundraising for a non-profit Christian organization \n•\tYouth Group Leader for Jubilee Christian Center •\tPMP Certified  \n•\tAbility to work cross-functionally / Globally \n•\tVendor Management \n•\tManaging all aspects of the project life cycle  \n•\tAbility to manage project deliverables on time and within budget \n•\tLocalization / Globalization \n•\tCorporate travel (Globally) \n•\tExperience in Manufacturing, Operations, Engineering builds \n•\tEvent Planning –Local/Global, Physical/Virtual, 300+ participants, 5 day duration, Video/Audio set-up, Food & Beverage set-up, and all event detail Project Management \n•\tGlobal Mission Trips and Fundraising for a non-profit Christian organization \n•\tYouth Group Leader for Jubilee Christian Center •\tPMP Certified  \n•\tAbility to work cross-functionally / Globally \n•\tVendor Management \n•\tManaging all aspects of the project life cycle  \n•\tAbility to manage project deliverables on time and within budget \n•\tLocalization / Globalization \n•\tCorporate travel (Globally) \n•\tExperience in Manufacturing, Operations, Engineering builds \n•\tEvent Planning –Local/Global, Physical/Virtual, 300+ participants, 5 day duration, Video/Audio set-up, Food & Beverage set-up, and all event detail Project Management \n•\tGlobal Mission Trips and Fundraising for a non-profit Christian organization \n•\tYouth Group Leader for Jubilee Christian Center Experience Engineering Project Specialist Apple July 2013  – Present (2 years 2 months) Cupertino, CA The System EPS' Mission is to provide best in class project support to our engineering, Ops and cross functional partners with the company's best interest in mind. We will execute this by providing precise communication, along with quality and timeliness implementation. \n \nWe are a value driven group and our eight core values include the following: \n• Precise communication \n• Excellent organization \n• Accurate implementation \n• Critical thinkers \n• Being innovative \n• Building strong relationships \n• Being flexible \n• Demonstrating accountability Localization Project Manager Welocalize April 2013  –  July 2013  (4 months) San Mateo •\tLocalization Producer/Project Manager for all iCloud/iTunes/Western Union accounts \n•\tManage translation process for 33+ Languages/Countries \n•\tWorldServer \n•\tAccount/Vendor Management Globalization Project Manager Apple March 2011  –  March 2012  (1 year 1 month) Cupertino, CA Apple Inc. (Experis) – San Jose, CA\tMarch - Present \nProject Manager- Globalization Project Manager (Global Retail Training) \n•\tLocalization Producer/Project Manager for all Global Retail Training content \n•\tCollaboration with instructional ID’s, designers, external translation vendors, internal linguists, and international validators \n•\t11 Languages/Countries \n•\tWorldServer process improvement to enhance and develop workflows Localization Project Manager Cisco Systems October 2009  –  September 2011  (2 years) San Jose, CA Project Manager- CVCM (Localization/Compliance) \n•\tCollaborated with Engineers, Product Managers, Content Authors, Language Specialists, and Marketing Managers to deliver Cisco’s international site content and products on time and with high linguistic quality \n•\tEnsured translation for: Products, documentation, labels, packaging, shipping documents, customer-facing applications, and pointer cards \n•\tFull project life cycle for Quebec Francisation efforts (Scope, WBS, Budget, Timeline) \n•\tWorked collaboratively with the global localization team to drive efficiency and effectiveness of the localization process \n•\tCompleted department initiatives including: Translation quality, process improvements, vendor strategy, and tools improvements Project Manager Apple Inc. 2011  –  2011  (less than a year) Project Manager- Business Process Re-engineering (Supply Chain Management) \n•\tAutomation of GSM Forecasting and Supplier commit/supply plans \n•\tClear to Build Automation Project (Automate supply, demand process for GSM, iPhone, MacBook, Apple Manufacturers) \n•\tiPhone: Automation of Manufacturing Ship requests to Apple Suppliers \n•\tWeekly meetings with Apple’s Off-shore Manufacturers to outline new process and perform data validation \n•\tWorked collaboratively with IT to create enhancements to Automation Application Localization Project Manager PayPal 2011  –  2011  (less than a year) San Jose, CA Project Manager- L10n Global Localization \n•\tLocalization Project Lead for 25 languages \n•\tWorked collaboratively with external translation vendors and internal linguists \n• Process Documentation for new and emerging projects \n• Worked with engineering team to automate current graphic bug process \n•\tPoint of contact for bug resolution during LQA Project Manager Cisco Systems, Inc December 2007  –  September 2009  (1 year 10 months) San Jose, CA Project/ Program Manager - World Wide Sales Enablement \nEnterprise Wireless, Unified Network Management Systems, Enterprise Routing and Switching, SP Mobile Wireless VT Programs \n•\tImplemented new processes to increase participation and broaden communication channels for SE training content \n•\tManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force \n•\tLead team in change management & cost savings initiative moving from physical program deliveries to 100% virtual program deliveries. Collaborated with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE’s \n•\tUpdated, Maintained and Monitored all Program Web/Wiki Pages (Enterprise, Unified, Service Provider, Verticals) for World Wide Sales Development Team via Dreamweaver \n•\tDeveloped vSearch (Sales/Marketing Community) – Blogging, Presentation/Documentation storage, Downloadable Links, Training/Education \n•\tOrganized global training events SEVT and Partner/Channels V \n\tCoordinated all aspects of events including promotion, registration process, audio/visual, food and beverage, staffing, scheduling, on-site set up and logistics, Management of documents/PPT presentations \n\tDeveloped and distributed pre and post event summaries including qualitative feedback to evaluate program/event success.  \n\tManaged event budget and all supporting materials and timelines Project Specialist Cisco Systems December 2007  –  November 2008  (1 year) Project Specialist for: Enterprise wireless, Unified Network Management Systems, Enterprise Routing & Switching, SP Services & Applications, SP Mobile Wireless VT Programs \n•\tManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force as well as the organization of the training events -Internally & Externally (Partners/Channels) \n•\tLead and participate in global team meetings (Webex, Meeting Place) \n•\tDeveloped strong partnerships cross-functionally. \n•\tCollaborate with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE’s. \n•\tMaintain communication channels – Web Site, E-mail, News Articles, etc. \n•\tUpdate, Maintain and Monitor all Program Pages (Enterprise, Unified, Service Provider, Verticals) for WWSE Team. \n•\tMaintained, updated, monitored, and organized internal documentation storage area (Live Link). Project Manager Cisco Systems, Inc 2008  –  2008  (less than a year) San Jose, CA CVCM (Customer Value Chain Management) \nProject Managed Quebec Francisation Language Charter Complaince Project \nEnsured translation of all products, documentation, labels, packaging for Province of Quebec from English verbiage to International French \nWorked cross-functionally to define stakeholders/owners for all Business Units and Channel Partners involved \nCreated Scope (Schedule, Resource Chart, Budgeting, Timeline) \nImplemented plan to reach compliance \nMonitor & Control Project Manager COMSYS 2007  –  2008  (1 year) Customer Advocacy - Jr. Project Manager Cisco Systems, Inc October 2006  –  November 2007  (1 year 2 months) Participated in a daily Change Control Board for IT related projects (C3 Core Oracle System, Cisco.com, Corporate Email, Telephones, Data Centers, Cisco Network) \nReported list of critical projects the Executive Review Board on a weekly basis for Risk Assessment  \nParticipated in multiple internal projects within the CA/TS Organization Including: ASDM, PDC-Production Data Center, Synergy \nOrganized team and cross-functional discussions based on communication requirements \nApplication & System Dependency Mapping for IT organization \nUpdating Internal Wiki page for Technical Services Organization Project Manager Artizen 2006  –  2007  (1 year) Process Engineering Leasing Specialist Z Resources December 2005  –  November 2006  (1 year) Leasing Service PM (Cisco Systems Capital) \nSupported account managers for Central Americas Division which included ensuring that all transactions were completed in a timely manner, creating all necessary documentation and performing lease administrative functions \nMonitored status of projects and communicated with customers, vendors and Account Managers \nPerformed credit uplifts and verified credit for clients desiring to lease products and maintenance Project Coordinator / Project Manager Applied Computer Solutions October 2005  –  October 2006  (1 year 1 month) Assembled and supervised engineers on multiple projects throughout California \nManaged all aspects of all projects from conception to completion \nMaximized project profitability by creating and organizing price-points for products and services \nDatabase Development \nProcessed weekly billing and forecasting reports to corporate headquarters \nCreated Project Scope, EVM, QA, Risk Assessment Project Manager ACS 2002  –  2003  (1 year) Managed internal Field Service Engineers \nManaged project full life cycle \nBudget and forecasting \nProcess improvement Project Manager ONI Systems January 2000  –  January 2002  (2 years 1 month) Procurement Management, Vendor Relationships, Bidding Conferences \nResource schedule management, Risk Assessment, Contract Administration \nMonitored project status, budget, and completion of all active projects for North America \nTracked and compiled customer feedback to enhance service offerings (Lessons Learned) \nCVCM - Customer Value Chain Management - Looping customer feedback to R&D stage \nProcess Analysis Team Lead Project Manager Cisco Systems October 1995  –  December 2000  (5 years 3 months) Maintained escalation point for 10+ individuals \nTraining Lead for all new employees - Implemented new group processes \nProvided support to high end customers with extensive service level contracts \nFull Project Life-cycle \nEvaluated discrepancies reported by customers and implemented resolution tacticst \nQuoting transactional 1-100 site units \n \nNegotiating costs, Managing Partners, Vendor Relationships (NCR, Unisys)  \nManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects Project Coordinator / Team Lead Cisco Systems January 1995  –  January 2000  (5 years 1 month) San Jose, CA Team Lead / Project Manager for Customer Advocacy / Advanced Services \n•\tMaintained escalation point for 15+ individuals \n•\tTraining Lead for all new employees - Implemented new group processes \n•\tProvided support to high end customers with extensive service level contracts \n•\tFull Project Life-cycle - Quoting transactional 1-100 site units  \n•\tManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects \n \nJr. Project Manager (CA)\t1996-1999 \n•\tAssisted multiple Regional Project Managers in organizing multi-site projects internationally \n•\tTraveled to various customer locations to introduce On-Site Services \n•\tBuilt key relationships with vendors \n•\tManaged all aspects of all project life cycle from conception to completion Jr. Project Manager Cisco Systems January 1996  –  January 1999  (3 years 1 month) Assisted multiple Regional Project Managers in organizing multi-site projects internationally \nTraveled to various customer locations to introduce On-Site Services \nBuilt key relationships with vendors \nMaintained escalation point for 10+ project coordinators \nManaged all aspects of all project life cycle from conception to completion Engineering Project Specialist Apple July 2013  – Present (2 years 2 months) Cupertino, CA The System EPS' Mission is to provide best in class project support to our engineering, Ops and cross functional partners with the company's best interest in mind. We will execute this by providing precise communication, along with quality and timeliness implementation. \n \nWe are a value driven group and our eight core values include the following: \n• Precise communication \n• Excellent organization \n• Accurate implementation \n• Critical thinkers \n• Being innovative \n• Building strong relationships \n• Being flexible \n• Demonstrating accountability Engineering Project Specialist Apple July 2013  – Present (2 years 2 months) Cupertino, CA The System EPS' Mission is to provide best in class project support to our engineering, Ops and cross functional partners with the company's best interest in mind. We will execute this by providing precise communication, along with quality and timeliness implementation. \n \nWe are a value driven group and our eight core values include the following: \n• Precise communication \n• Excellent organization \n• Accurate implementation \n• Critical thinkers \n• Being innovative \n• Building strong relationships \n• Being flexible \n• Demonstrating accountability Localization Project Manager Welocalize April 2013  –  July 2013  (4 months) San Mateo •\tLocalization Producer/Project Manager for all iCloud/iTunes/Western Union accounts \n•\tManage translation process for 33+ Languages/Countries \n•\tWorldServer \n•\tAccount/Vendor Management Localization Project Manager Welocalize April 2013  –  July 2013  (4 months) San Mateo •\tLocalization Producer/Project Manager for all iCloud/iTunes/Western Union accounts \n•\tManage translation process for 33+ Languages/Countries \n•\tWorldServer \n•\tAccount/Vendor Management Globalization Project Manager Apple March 2011  –  March 2012  (1 year 1 month) Cupertino, CA Apple Inc. (Experis) – San Jose, CA\tMarch - Present \nProject Manager- Globalization Project Manager (Global Retail Training) \n•\tLocalization Producer/Project Manager for all Global Retail Training content \n•\tCollaboration with instructional ID’s, designers, external translation vendors, internal linguists, and international validators \n•\t11 Languages/Countries \n•\tWorldServer process improvement to enhance and develop workflows Globalization Project Manager Apple March 2011  –  March 2012  (1 year 1 month) Cupertino, CA Apple Inc. (Experis) – San Jose, CA\tMarch - Present \nProject Manager- Globalization Project Manager (Global Retail Training) \n•\tLocalization Producer/Project Manager for all Global Retail Training content \n•\tCollaboration with instructional ID’s, designers, external translation vendors, internal linguists, and international validators \n•\t11 Languages/Countries \n•\tWorldServer process improvement to enhance and develop workflows Localization Project Manager Cisco Systems October 2009  –  September 2011  (2 years) San Jose, CA Project Manager- CVCM (Localization/Compliance) \n•\tCollaborated with Engineers, Product Managers, Content Authors, Language Specialists, and Marketing Managers to deliver Cisco’s international site content and products on time and with high linguistic quality \n•\tEnsured translation for: Products, documentation, labels, packaging, shipping documents, customer-facing applications, and pointer cards \n•\tFull project life cycle for Quebec Francisation efforts (Scope, WBS, Budget, Timeline) \n•\tWorked collaboratively with the global localization team to drive efficiency and effectiveness of the localization process \n•\tCompleted department initiatives including: Translation quality, process improvements, vendor strategy, and tools improvements Localization Project Manager Cisco Systems October 2009  –  September 2011  (2 years) San Jose, CA Project Manager- CVCM (Localization/Compliance) \n•\tCollaborated with Engineers, Product Managers, Content Authors, Language Specialists, and Marketing Managers to deliver Cisco’s international site content and products on time and with high linguistic quality \n•\tEnsured translation for: Products, documentation, labels, packaging, shipping documents, customer-facing applications, and pointer cards \n•\tFull project life cycle for Quebec Francisation efforts (Scope, WBS, Budget, Timeline) \n•\tWorked collaboratively with the global localization team to drive efficiency and effectiveness of the localization process \n•\tCompleted department initiatives including: Translation quality, process improvements, vendor strategy, and tools improvements Project Manager Apple Inc. 2011  –  2011  (less than a year) Project Manager- Business Process Re-engineering (Supply Chain Management) \n•\tAutomation of GSM Forecasting and Supplier commit/supply plans \n•\tClear to Build Automation Project (Automate supply, demand process for GSM, iPhone, MacBook, Apple Manufacturers) \n•\tiPhone: Automation of Manufacturing Ship requests to Apple Suppliers \n•\tWeekly meetings with Apple’s Off-shore Manufacturers to outline new process and perform data validation \n•\tWorked collaboratively with IT to create enhancements to Automation Application Project Manager Apple Inc. 2011  –  2011  (less than a year) Project Manager- Business Process Re-engineering (Supply Chain Management) \n•\tAutomation of GSM Forecasting and Supplier commit/supply plans \n•\tClear to Build Automation Project (Automate supply, demand process for GSM, iPhone, MacBook, Apple Manufacturers) \n•\tiPhone: Automation of Manufacturing Ship requests to Apple Suppliers \n•\tWeekly meetings with Apple’s Off-shore Manufacturers to outline new process and perform data validation \n•\tWorked collaboratively with IT to create enhancements to Automation Application Localization Project Manager PayPal 2011  –  2011  (less than a year) San Jose, CA Project Manager- L10n Global Localization \n•\tLocalization Project Lead for 25 languages \n•\tWorked collaboratively with external translation vendors and internal linguists \n• Process Documentation for new and emerging projects \n• Worked with engineering team to automate current graphic bug process \n•\tPoint of contact for bug resolution during LQA Localization Project Manager PayPal 2011  –  2011  (less than a year) San Jose, CA Project Manager- L10n Global Localization \n•\tLocalization Project Lead for 25 languages \n•\tWorked collaboratively with external translation vendors and internal linguists \n• Process Documentation for new and emerging projects \n• Worked with engineering team to automate current graphic bug process \n•\tPoint of contact for bug resolution during LQA Project Manager Cisco Systems, Inc December 2007  –  September 2009  (1 year 10 months) San Jose, CA Project/ Program Manager - World Wide Sales Enablement \nEnterprise Wireless, Unified Network Management Systems, Enterprise Routing and Switching, SP Mobile Wireless VT Programs \n•\tImplemented new processes to increase participation and broaden communication channels for SE training content \n•\tManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force \n•\tLead team in change management & cost savings initiative moving from physical program deliveries to 100% virtual program deliveries. Collaborated with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE’s \n•\tUpdated, Maintained and Monitored all Program Web/Wiki Pages (Enterprise, Unified, Service Provider, Verticals) for World Wide Sales Development Team via Dreamweaver \n•\tDeveloped vSearch (Sales/Marketing Community) – Blogging, Presentation/Documentation storage, Downloadable Links, Training/Education \n•\tOrganized global training events SEVT and Partner/Channels V \n\tCoordinated all aspects of events including promotion, registration process, audio/visual, food and beverage, staffing, scheduling, on-site set up and logistics, Management of documents/PPT presentations \n\tDeveloped and distributed pre and post event summaries including qualitative feedback to evaluate program/event success.  \n\tManaged event budget and all supporting materials and timelines Project Manager Cisco Systems, Inc December 2007  –  September 2009  (1 year 10 months) San Jose, CA Project/ Program Manager - World Wide Sales Enablement \nEnterprise Wireless, Unified Network Management Systems, Enterprise Routing and Switching, SP Mobile Wireless VT Programs \n•\tImplemented new processes to increase participation and broaden communication channels for SE training content \n•\tManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force \n•\tLead team in change management & cost savings initiative moving from physical program deliveries to 100% virtual program deliveries. Collaborated with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE’s \n•\tUpdated, Maintained and Monitored all Program Web/Wiki Pages (Enterprise, Unified, Service Provider, Verticals) for World Wide Sales Development Team via Dreamweaver \n•\tDeveloped vSearch (Sales/Marketing Community) – Blogging, Presentation/Documentation storage, Downloadable Links, Training/Education \n•\tOrganized global training events SEVT and Partner/Channels V \n\tCoordinated all aspects of events including promotion, registration process, audio/visual, food and beverage, staffing, scheduling, on-site set up and logistics, Management of documents/PPT presentations \n\tDeveloped and distributed pre and post event summaries including qualitative feedback to evaluate program/event success.  \n\tManaged event budget and all supporting materials and timelines Project Specialist Cisco Systems December 2007  –  November 2008  (1 year) Project Specialist for: Enterprise wireless, Unified Network Management Systems, Enterprise Routing & Switching, SP Services & Applications, SP Mobile Wireless VT Programs \n•\tManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force as well as the organization of the training events -Internally & Externally (Partners/Channels) \n•\tLead and participate in global team meetings (Webex, Meeting Place) \n•\tDeveloped strong partnerships cross-functionally. \n•\tCollaborate with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE’s. \n•\tMaintain communication channels – Web Site, E-mail, News Articles, etc. \n•\tUpdate, Maintain and Monitor all Program Pages (Enterprise, Unified, Service Provider, Verticals) for WWSE Team. \n•\tMaintained, updated, monitored, and organized internal documentation storage area (Live Link). Project Specialist Cisco Systems December 2007  –  November 2008  (1 year) Project Specialist for: Enterprise wireless, Unified Network Management Systems, Enterprise Routing & Switching, SP Services & Applications, SP Mobile Wireless VT Programs \n•\tManaged logistical requirements involved with the development of the training for the Global Field Engineering Sales Force as well as the organization of the training events -Internally & Externally (Partners/Channels) \n•\tLead and participate in global team meetings (Webex, Meeting Place) \n•\tDeveloped strong partnerships cross-functionally. \n•\tCollaborate with Instructional Designers/Learning Consultants to support the design and to develop training programs for SE’s. \n•\tMaintain communication channels – Web Site, E-mail, News Articles, etc. \n•\tUpdate, Maintain and Monitor all Program Pages (Enterprise, Unified, Service Provider, Verticals) for WWSE Team. \n•\tMaintained, updated, monitored, and organized internal documentation storage area (Live Link). Project Manager Cisco Systems, Inc 2008  –  2008  (less than a year) San Jose, CA CVCM (Customer Value Chain Management) \nProject Managed Quebec Francisation Language Charter Complaince Project \nEnsured translation of all products, documentation, labels, packaging for Province of Quebec from English verbiage to International French \nWorked cross-functionally to define stakeholders/owners for all Business Units and Channel Partners involved \nCreated Scope (Schedule, Resource Chart, Budgeting, Timeline) \nImplemented plan to reach compliance \nMonitor & Control Project Manager Cisco Systems, Inc 2008  –  2008  (less than a year) San Jose, CA CVCM (Customer Value Chain Management) \nProject Managed Quebec Francisation Language Charter Complaince Project \nEnsured translation of all products, documentation, labels, packaging for Province of Quebec from English verbiage to International French \nWorked cross-functionally to define stakeholders/owners for all Business Units and Channel Partners involved \nCreated Scope (Schedule, Resource Chart, Budgeting, Timeline) \nImplemented plan to reach compliance \nMonitor & Control Project Manager COMSYS 2007  –  2008  (1 year) Project Manager COMSYS 2007  –  2008  (1 year) Customer Advocacy - Jr. Project Manager Cisco Systems, Inc October 2006  –  November 2007  (1 year 2 months) Participated in a daily Change Control Board for IT related projects (C3 Core Oracle System, Cisco.com, Corporate Email, Telephones, Data Centers, Cisco Network) \nReported list of critical projects the Executive Review Board on a weekly basis for Risk Assessment  \nParticipated in multiple internal projects within the CA/TS Organization Including: ASDM, PDC-Production Data Center, Synergy \nOrganized team and cross-functional discussions based on communication requirements \nApplication & System Dependency Mapping for IT organization \nUpdating Internal Wiki page for Technical Services Organization Customer Advocacy - Jr. Project Manager Cisco Systems, Inc October 2006  –  November 2007  (1 year 2 months) Participated in a daily Change Control Board for IT related projects (C3 Core Oracle System, Cisco.com, Corporate Email, Telephones, Data Centers, Cisco Network) \nReported list of critical projects the Executive Review Board on a weekly basis for Risk Assessment  \nParticipated in multiple internal projects within the CA/TS Organization Including: ASDM, PDC-Production Data Center, Synergy \nOrganized team and cross-functional discussions based on communication requirements \nApplication & System Dependency Mapping for IT organization \nUpdating Internal Wiki page for Technical Services Organization Project Manager Artizen 2006  –  2007  (1 year) Process Engineering Project Manager Artizen 2006  –  2007  (1 year) Process Engineering Leasing Specialist Z Resources December 2005  –  November 2006  (1 year) Leasing Service PM (Cisco Systems Capital) \nSupported account managers for Central Americas Division which included ensuring that all transactions were completed in a timely manner, creating all necessary documentation and performing lease administrative functions \nMonitored status of projects and communicated with customers, vendors and Account Managers \nPerformed credit uplifts and verified credit for clients desiring to lease products and maintenance Leasing Specialist Z Resources December 2005  –  November 2006  (1 year) Leasing Service PM (Cisco Systems Capital) \nSupported account managers for Central Americas Division which included ensuring that all transactions were completed in a timely manner, creating all necessary documentation and performing lease administrative functions \nMonitored status of projects and communicated with customers, vendors and Account Managers \nPerformed credit uplifts and verified credit for clients desiring to lease products and maintenance Project Coordinator / Project Manager Applied Computer Solutions October 2005  –  October 2006  (1 year 1 month) Assembled and supervised engineers on multiple projects throughout California \nManaged all aspects of all projects from conception to completion \nMaximized project profitability by creating and organizing price-points for products and services \nDatabase Development \nProcessed weekly billing and forecasting reports to corporate headquarters \nCreated Project Scope, EVM, QA, Risk Assessment Project Coordinator / Project Manager Applied Computer Solutions October 2005  –  October 2006  (1 year 1 month) Assembled and supervised engineers on multiple projects throughout California \nManaged all aspects of all projects from conception to completion \nMaximized project profitability by creating and organizing price-points for products and services \nDatabase Development \nProcessed weekly billing and forecasting reports to corporate headquarters \nCreated Project Scope, EVM, QA, Risk Assessment Project Manager ACS 2002  –  2003  (1 year) Managed internal Field Service Engineers \nManaged project full life cycle \nBudget and forecasting \nProcess improvement Project Manager ACS 2002  –  2003  (1 year) Managed internal Field Service Engineers \nManaged project full life cycle \nBudget and forecasting \nProcess improvement Project Manager ONI Systems January 2000  –  January 2002  (2 years 1 month) Procurement Management, Vendor Relationships, Bidding Conferences \nResource schedule management, Risk Assessment, Contract Administration \nMonitored project status, budget, and completion of all active projects for North America \nTracked and compiled customer feedback to enhance service offerings (Lessons Learned) \nCVCM - Customer Value Chain Management - Looping customer feedback to R&D stage \nProcess Analysis Project Manager ONI Systems January 2000  –  January 2002  (2 years 1 month) Procurement Management, Vendor Relationships, Bidding Conferences \nResource schedule management, Risk Assessment, Contract Administration \nMonitored project status, budget, and completion of all active projects for North America \nTracked and compiled customer feedback to enhance service offerings (Lessons Learned) \nCVCM - Customer Value Chain Management - Looping customer feedback to R&D stage \nProcess Analysis Team Lead Project Manager Cisco Systems October 1995  –  December 2000  (5 years 3 months) Maintained escalation point for 10+ individuals \nTraining Lead for all new employees - Implemented new group processes \nProvided support to high end customers with extensive service level contracts \nFull Project Life-cycle \nEvaluated discrepancies reported by customers and implemented resolution tacticst \nQuoting transactional 1-100 site units \n \nNegotiating costs, Managing Partners, Vendor Relationships (NCR, Unisys)  \nManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects Team Lead Project Manager Cisco Systems October 1995  –  December 2000  (5 years 3 months) Maintained escalation point for 10+ individuals \nTraining Lead for all new employees - Implemented new group processes \nProvided support to high end customers with extensive service level contracts \nFull Project Life-cycle \nEvaluated discrepancies reported by customers and implemented resolution tacticst \nQuoting transactional 1-100 site units \n \nNegotiating costs, Managing Partners, Vendor Relationships (NCR, Unisys)  \nManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects Project Coordinator / Team Lead Cisco Systems January 1995  –  January 2000  (5 years 1 month) San Jose, CA Team Lead / Project Manager for Customer Advocacy / Advanced Services \n•\tMaintained escalation point for 15+ individuals \n•\tTraining Lead for all new employees - Implemented new group processes \n•\tProvided support to high end customers with extensive service level contracts \n•\tFull Project Life-cycle - Quoting transactional 1-100 site units  \n•\tManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects \n \nJr. Project Manager (CA)\t1996-1999 \n•\tAssisted multiple Regional Project Managers in organizing multi-site projects internationally \n•\tTraveled to various customer locations to introduce On-Site Services \n•\tBuilt key relationships with vendors \n•\tManaged all aspects of all project life cycle from conception to completion Project Coordinator / Team Lead Cisco Systems January 1995  –  January 2000  (5 years 1 month) San Jose, CA Team Lead / Project Manager for Customer Advocacy / Advanced Services \n•\tMaintained escalation point for 15+ individuals \n•\tTraining Lead for all new employees - Implemented new group processes \n•\tProvided support to high end customers with extensive service level contracts \n•\tFull Project Life-cycle - Quoting transactional 1-100 site units  \n•\tManaged upgrade projects, Implementations, Large Deployments, Internal AS Projects \n \nJr. Project Manager (CA)\t1996-1999 \n•\tAssisted multiple Regional Project Managers in organizing multi-site projects internationally \n•\tTraveled to various customer locations to introduce On-Site Services \n•\tBuilt key relationships with vendors \n•\tManaged all aspects of all project life cycle from conception to completion Jr. Project Manager Cisco Systems January 1996  –  January 1999  (3 years 1 month) Assisted multiple Regional Project Managers in organizing multi-site projects internationally \nTraveled to various customer locations to introduce On-Site Services \nBuilt key relationships with vendors \nMaintained escalation point for 10+ project coordinators \nManaged all aspects of all project life cycle from conception to completion Jr. Project Manager Cisco Systems January 1996  –  January 1999  (3 years 1 month) Assisted multiple Regional Project Managers in organizing multi-site projects internationally \nTraveled to various customer locations to introduce On-Site Services \nBuilt key relationships with vendors \nMaintained escalation point for 10+ project coordinators \nManaged all aspects of all project life cycle from conception to completion Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Cross-functional Team... Program Management Process Improvement Project Management MS Project Management Quality Assurance PMP Vendor Management Forecasting Event Management Localization Mac OS Leadership Business Process Software Documentation SDLC Change Management Training Data Center See 5+     See less Skills  Cross-functional Team... Program Management Process Improvement Project Management MS Project Management Quality Assurance PMP Vendor Management Forecasting Event Management Localization Mac OS Leadership Business Process Software Documentation SDLC Change Management Training Data Center See 5+     See less Cross-functional Team... Program Management Process Improvement Project Management MS Project Management Quality Assurance PMP Vendor Management Forecasting Event Management Localization Mac OS Leadership Business Process Software Documentation SDLC Change Management Training Data Center See 5+     See less Cross-functional Team... Program Management Process Improvement Project Management MS Project Management Quality Assurance PMP Vendor Management Forecasting Event Management Localization Mac OS Leadership Business Process Software Documentation SDLC Change Management Training Data Center See 5+     See less Education Jubilee School of Supernatural Ministry Theology/Theological Studies 2010  – 2012 Revivalist: a believer who is focused, passionate, willing to pay any price to live in purity and power because they are loved by God and love Him - whose manifest presence transforms lives and cultures. Activities and Societies:  House to House Ministry ,  Homeless Outreach ,  Missionary ,  Youth Group Leader ,  Prophetic Art ,  Prayer Team. Project Management Institute Project Management Institute,  Project Management (PMP) 2007  – 2009 Certified PMP Activities and Societies:  PMI Silicon Valley Chapter University of Phoenix BS,  Business Management 2006  – 2008 Jubilee School of Supernatural Ministry Theology/Theological Studies 2010  – 2012 Revivalist: a believer who is focused, passionate, willing to pay any price to live in purity and power because they are loved by God and love Him - whose manifest presence transforms lives and cultures. Activities and Societies:  House to House Ministry ,  Homeless Outreach ,  Missionary ,  Youth Group Leader ,  Prophetic Art ,  Prayer Team. Jubilee School of Supernatural Ministry Theology/Theological Studies 2010  – 2012 Revivalist: a believer who is focused, passionate, willing to pay any price to live in purity and power because they are loved by God and love Him - whose manifest presence transforms lives and cultures. Activities and Societies:  House to House Ministry ,  Homeless Outreach ,  Missionary ,  Youth Group Leader ,  Prophetic Art ,  Prayer Team. Jubilee School of Supernatural Ministry Theology/Theological Studies 2010  – 2012 Revivalist: a believer who is focused, passionate, willing to pay any price to live in purity and power because they are loved by God and love Him - whose manifest presence transforms lives and cultures. Activities and Societies:  House to House Ministry ,  Homeless Outreach ,  Missionary ,  Youth Group Leader ,  Prophetic Art ,  Prayer Team. Project Management Institute Project Management Institute,  Project Management (PMP) 2007  – 2009 Certified PMP Activities and Societies:  PMI Silicon Valley Chapter Project Management Institute Project Management Institute,  Project Management (PMP) 2007  – 2009 Certified PMP Activities and Societies:  PMI Silicon Valley Chapter Project Management Institute Project Management Institute,  Project Management (PMP) 2007  – 2009 Certified PMP Activities and Societies:  PMI Silicon Valley Chapter University of Phoenix BS,  Business Management 2006  – 2008 University of Phoenix BS,  Business Management 2006  – 2008 University of Phoenix BS,  Business Management 2006  – 2008 ", "Summary Seventeen year professional with proven experience managing people, customer relationships, and projects. Strong history of leadership, quickly building relationships, gaining credibility, and partnering with a large variety of customers and stakeholders. Certified Project Management Professional (PMP) with a wide range of project management experience in development, support, and implementation. Innovative & solution oriented with analytical and common sense approach to problem solving. Effective communicator with strong interpersonal and customer service skills. Demonstrated ability to achieve superior results as a leader, an individual contributor, and as a member of a team. Summary Seventeen year professional with proven experience managing people, customer relationships, and projects. Strong history of leadership, quickly building relationships, gaining credibility, and partnering with a large variety of customers and stakeholders. Certified Project Management Professional (PMP) with a wide range of project management experience in development, support, and implementation. Innovative & solution oriented with analytical and common sense approach to problem solving. Effective communicator with strong interpersonal and customer service skills. Demonstrated ability to achieve superior results as a leader, an individual contributor, and as a member of a team. Seventeen year professional with proven experience managing people, customer relationships, and projects. Strong history of leadership, quickly building relationships, gaining credibility, and partnering with a large variety of customers and stakeholders. Certified Project Management Professional (PMP) with a wide range of project management experience in development, support, and implementation. Innovative & solution oriented with analytical and common sense approach to problem solving. Effective communicator with strong interpersonal and customer service skills. Demonstrated ability to achieve superior results as a leader, an individual contributor, and as a member of a team. Seventeen year professional with proven experience managing people, customer relationships, and projects. Strong history of leadership, quickly building relationships, gaining credibility, and partnering with a large variety of customers and stakeholders. Certified Project Management Professional (PMP) with a wide range of project management experience in development, support, and implementation. Innovative & solution oriented with analytical and common sense approach to problem solving. Effective communicator with strong interpersonal and customer service skills. Demonstrated ability to achieve superior results as a leader, an individual contributor, and as a member of a team. Experience Business Development Manager Cisco Systems February 2012  – Present (3 years 7 months) As a Business Development Manager, Joel successfully drives services business growth and increases relevance of services globally. He partners and collaborates with account teams, sales teams, and customers, from individual contributors through executive level. He drives highly complex, global deals that leverage multiple technologies in order to achieve customers’ business objectives. Project Manager Cisco Systems October 2010  –  February 2012  (1 year 5 months) Managed multiple large, strategic, customer facing network projects taking a leadership role. Projects valued at $14M annually. \n \nCreated project schedules and plans with financial, resource, and material requirements. Successfully managed projects from start to completion. \n \nOwned the end to end engagement process including influencing account team & customer in the assessment, planning, and management of any critical issues. Relationship Manager Cisco Systems May 2005  –  October 2010  (5 years 6 months) Owned lifecycle case management, handling critical escalations, case analysis, trending, and root cause analysis. \n \nServed as Team Lead contributing on team guidance, mentoring, escalation assistance, situational leadership, process continuity. \n \nSupported large enterprise fortune 100 customers including Verizon, EDS-Bank of America, and Ernst and Young. \n \nSubject matter expert for areas and tools in Customer Satisfaction, Data Mining, Escalations, and Reporting. IT Analyst / Project Manager Cisco Systems April 2004  –  May 2005  (1 year 2 months) Managed the Everest release Support and Transition team consisting of ~10 global developers, maintaining and executing the overall project plan. \nOracle 11i release ‘Everest’ included upgrading pricing, order management, billing and collections applications to Oracle’s 11i E-Business suite, affecting 200+ applications and over 10,000 internal users. \nDeveloped and Implemented the support strategy including a thorough vendor selection process, go-live support plan, risk mitigation, quality assurance, knowledge transfer, and contingency plan. IT Analyst / Project Manager Cisco Systems January 2002  –  April 2004  (2 years 4 months) Managed the Maintenance and Enhancements team consisting of ~20 global developers. \nDesigned and implemented a Prioritization process for incoming requests, and established a monthly release schedule. \nMajor participant in Quarter end / Quarter close activities for Cisco. Managed highly confidential Quarter end financial information. Sent daily executive level updates on quarter end issues and progress. IT Analyst / Engineer Cisco Systems November 1998  –  January 2002  (3 years 3 months) Perl/CGI/Java developer and support for Worldwide TAC managers and Internet Commerce applications. Network Support Engineer Nortel Networks May 1997  –  November 1998  (1 year 7 months) Responsible for installation, support, and customer relationship/expectations for global customers including Telstra, Bell Atlantic, Southwest Bell, BellSouth. Business Development Manager Cisco Systems February 2012  – Present (3 years 7 months) As a Business Development Manager, Joel successfully drives services business growth and increases relevance of services globally. He partners and collaborates with account teams, sales teams, and customers, from individual contributors through executive level. He drives highly complex, global deals that leverage multiple technologies in order to achieve customers’ business objectives. Business Development Manager Cisco Systems February 2012  – Present (3 years 7 months) As a Business Development Manager, Joel successfully drives services business growth and increases relevance of services globally. He partners and collaborates with account teams, sales teams, and customers, from individual contributors through executive level. He drives highly complex, global deals that leverage multiple technologies in order to achieve customers’ business objectives. Project Manager Cisco Systems October 2010  –  February 2012  (1 year 5 months) Managed multiple large, strategic, customer facing network projects taking a leadership role. Projects valued at $14M annually. \n \nCreated project schedules and plans with financial, resource, and material requirements. Successfully managed projects from start to completion. \n \nOwned the end to end engagement process including influencing account team & customer in the assessment, planning, and management of any critical issues. Project Manager Cisco Systems October 2010  –  February 2012  (1 year 5 months) Managed multiple large, strategic, customer facing network projects taking a leadership role. Projects valued at $14M annually. \n \nCreated project schedules and plans with financial, resource, and material requirements. Successfully managed projects from start to completion. \n \nOwned the end to end engagement process including influencing account team & customer in the assessment, planning, and management of any critical issues. Relationship Manager Cisco Systems May 2005  –  October 2010  (5 years 6 months) Owned lifecycle case management, handling critical escalations, case analysis, trending, and root cause analysis. \n \nServed as Team Lead contributing on team guidance, mentoring, escalation assistance, situational leadership, process continuity. \n \nSupported large enterprise fortune 100 customers including Verizon, EDS-Bank of America, and Ernst and Young. \n \nSubject matter expert for areas and tools in Customer Satisfaction, Data Mining, Escalations, and Reporting. Relationship Manager Cisco Systems May 2005  –  October 2010  (5 years 6 months) Owned lifecycle case management, handling critical escalations, case analysis, trending, and root cause analysis. \n \nServed as Team Lead contributing on team guidance, mentoring, escalation assistance, situational leadership, process continuity. \n \nSupported large enterprise fortune 100 customers including Verizon, EDS-Bank of America, and Ernst and Young. \n \nSubject matter expert for areas and tools in Customer Satisfaction, Data Mining, Escalations, and Reporting. IT Analyst / Project Manager Cisco Systems April 2004  –  May 2005  (1 year 2 months) Managed the Everest release Support and Transition team consisting of ~10 global developers, maintaining and executing the overall project plan. \nOracle 11i release ‘Everest’ included upgrading pricing, order management, billing and collections applications to Oracle’s 11i E-Business suite, affecting 200+ applications and over 10,000 internal users. \nDeveloped and Implemented the support strategy including a thorough vendor selection process, go-live support plan, risk mitigation, quality assurance, knowledge transfer, and contingency plan. IT Analyst / Project Manager Cisco Systems April 2004  –  May 2005  (1 year 2 months) Managed the Everest release Support and Transition team consisting of ~10 global developers, maintaining and executing the overall project plan. \nOracle 11i release ‘Everest’ included upgrading pricing, order management, billing and collections applications to Oracle’s 11i E-Business suite, affecting 200+ applications and over 10,000 internal users. \nDeveloped and Implemented the support strategy including a thorough vendor selection process, go-live support plan, risk mitigation, quality assurance, knowledge transfer, and contingency plan. IT Analyst / Project Manager Cisco Systems January 2002  –  April 2004  (2 years 4 months) Managed the Maintenance and Enhancements team consisting of ~20 global developers. \nDesigned and implemented a Prioritization process for incoming requests, and established a monthly release schedule. \nMajor participant in Quarter end / Quarter close activities for Cisco. Managed highly confidential Quarter end financial information. Sent daily executive level updates on quarter end issues and progress. IT Analyst / Project Manager Cisco Systems January 2002  –  April 2004  (2 years 4 months) Managed the Maintenance and Enhancements team consisting of ~20 global developers. \nDesigned and implemented a Prioritization process for incoming requests, and established a monthly release schedule. \nMajor participant in Quarter end / Quarter close activities for Cisco. Managed highly confidential Quarter end financial information. Sent daily executive level updates on quarter end issues and progress. IT Analyst / Engineer Cisco Systems November 1998  –  January 2002  (3 years 3 months) Perl/CGI/Java developer and support for Worldwide TAC managers and Internet Commerce applications. IT Analyst / Engineer Cisco Systems November 1998  –  January 2002  (3 years 3 months) Perl/CGI/Java developer and support for Worldwide TAC managers and Internet Commerce applications. Network Support Engineer Nortel Networks May 1997  –  November 1998  (1 year 7 months) Responsible for installation, support, and customer relationship/expectations for global customers including Telstra, Bell Atlantic, Southwest Bell, BellSouth. Network Support Engineer Nortel Networks May 1997  –  November 1998  (1 year 7 months) Responsible for installation, support, and customer relationship/expectations for global customers including Telstra, Bell Atlantic, Southwest Bell, BellSouth. Skills Business Innovation Business Relationship... Performance Metrics Collaborative Problem... Release Management Business Development Risk Management Customer Service Customer Satisfaction Strategy Strategic Influence Building Customer... Cross-functional Team... Cloud Computing Networking Data Center Software Development Project Management Project Planning Cisco Technologies Leadership Quality Assurance SaaS Vendor Management Unified Communications Go-to-market Strategy Enterprise Software Professional Services Solution Selling Managed Services E-commerce See 16+     See less Skills  Business Innovation Business Relationship... Performance Metrics Collaborative Problem... Release Management Business Development Risk Management Customer Service Customer Satisfaction Strategy Strategic Influence Building Customer... Cross-functional Team... Cloud Computing Networking Data Center Software Development Project Management Project Planning Cisco Technologies Leadership Quality Assurance SaaS Vendor Management Unified Communications Go-to-market Strategy Enterprise Software Professional Services Solution Selling Managed Services E-commerce See 16+     See less Business Innovation Business Relationship... Performance Metrics Collaborative Problem... Release Management Business Development Risk Management Customer Service Customer Satisfaction Strategy Strategic Influence Building Customer... Cross-functional Team... Cloud Computing Networking Data Center Software Development Project Management Project Planning Cisco Technologies Leadership Quality Assurance SaaS Vendor Management Unified Communications Go-to-market Strategy Enterprise Software Professional Services Solution Selling Managed Services E-commerce See 16+     See less Business Innovation Business Relationship... Performance Metrics Collaborative Problem... Release Management Business Development Risk Management Customer Service Customer Satisfaction Strategy Strategic Influence Building Customer... Cross-functional Team... Cloud Computing Networking Data Center Software Development Project Management Project Planning Cisco Technologies Leadership Quality Assurance SaaS Vendor Management Unified Communications Go-to-market Strategy Enterprise Software Professional Services Solution Selling Managed Services E-commerce See 16+     See less Education Project Management Institute Project Management Professional (PMP) 2007  – 2007 North Carolina State University Bachelors of Science,  Computer Science 1992  – 1997 Project Management Institute Project Management Professional (PMP) 2007  – 2007 Project Management Institute Project Management Professional (PMP) 2007  – 2007 Project Management Institute Project Management Professional (PMP) 2007  – 2007 North Carolina State University Bachelors of Science,  Computer Science 1992  – 1997 North Carolina State University Bachelors of Science,  Computer Science 1992  – 1997 North Carolina State University Bachelors of Science,  Computer Science 1992  – 1997 ", "Skills Employee Relations HR Service Delivery Performance Management Project Management Human Resources Personnel Management Talent Management Employee Engagement Employee Benefits Conflict Resolution Vendor Management Management Workforce Planning Program Management Process Improvement Strategy See 1+     See less Skills  Employee Relations HR Service Delivery Performance Management Project Management Human Resources Personnel Management Talent Management Employee Engagement Employee Benefits Conflict Resolution Vendor Management Management Workforce Planning Program Management Process Improvement Strategy See 1+     See less Employee Relations HR Service Delivery Performance Management Project Management Human Resources Personnel Management Talent Management Employee Engagement Employee Benefits Conflict Resolution Vendor Management Management Workforce Planning Program Management Process Improvement Strategy See 1+     See less Employee Relations HR Service Delivery Performance Management Project Management Human Resources Personnel Management Talent Management Employee Engagement Employee Benefits Conflict Resolution Vendor Management Management Workforce Planning Program Management Process Improvement Strategy See 1+     See less "]}