{"position": "Sales Engineering Manager", "company": "Google", "profiles": ["Summary Committed to delivering innovative business solutions through the use of network architectures, leveraging a highly skilled, energized and collaborative team of systems engineers and Cisco Partners. \n \nDriving to connect the un-connected to accelerate the quality of how humanity works, lives, learns and plays. Summary Committed to delivering innovative business solutions through the use of network architectures, leveraging a highly skilled, energized and collaborative team of systems engineers and Cisco Partners. \n \nDriving to connect the un-connected to accelerate the quality of how humanity works, lives, learns and plays. Committed to delivering innovative business solutions through the use of network architectures, leveraging a highly skilled, energized and collaborative team of systems engineers and Cisco Partners. \n \nDriving to connect the un-connected to accelerate the quality of how humanity works, lives, learns and plays. Committed to delivering innovative business solutions through the use of network architectures, leveraging a highly skilled, energized and collaborative team of systems engineers and Cisco Partners. \n \nDriving to connect the un-connected to accelerate the quality of how humanity works, lives, learns and plays. Experience Systems Engineering Manager Cisco Systems October 2012  – Present (2 years 11 months) Raleigh-Durham, North Carolina Area US Commercial, Carolinas Select Manager, Cisco-on-Cisco for Sales Cisco Systems 2010  –  2012  (2 years) Enabling the Global Cisco Sales force with the latest Collaboration, Data Center, Security, Wireless, and Mobility solutions. Sr, Operations Mgr Cisco Systems 2006  –  2010  (4 years) Sr. Marketing Manager Cisco Systems 2004  –  2006  (2 years) Systems Engineering Manager Cisco Systems 2000  –  2004  (4 years) Systems Engineer Cisco Systems 1997  –  2000  (3 years) Account Manager Cisco Systems 1995  –  1997  (2 years) Research Engineer Defence Science and Technology Organisation 1991  –  1994  (3 years) Research into an early warning detection device for helicopters using vibration analysis to predict a catastrophic failure of the helicopters gear box. Systems Engineering Manager Cisco Systems October 2012  – Present (2 years 11 months) Raleigh-Durham, North Carolina Area US Commercial, Carolinas Select Systems Engineering Manager Cisco Systems October 2012  – Present (2 years 11 months) Raleigh-Durham, North Carolina Area US Commercial, Carolinas Select Manager, Cisco-on-Cisco for Sales Cisco Systems 2010  –  2012  (2 years) Enabling the Global Cisco Sales force with the latest Collaboration, Data Center, Security, Wireless, and Mobility solutions. Manager, Cisco-on-Cisco for Sales Cisco Systems 2010  –  2012  (2 years) Enabling the Global Cisco Sales force with the latest Collaboration, Data Center, Security, Wireless, and Mobility solutions. Sr, Operations Mgr Cisco Systems 2006  –  2010  (4 years) Sr, Operations Mgr Cisco Systems 2006  –  2010  (4 years) Sr. Marketing Manager Cisco Systems 2004  –  2006  (2 years) Sr. Marketing Manager Cisco Systems 2004  –  2006  (2 years) Systems Engineering Manager Cisco Systems 2000  –  2004  (4 years) Systems Engineering Manager Cisco Systems 2000  –  2004  (4 years) Systems Engineer Cisco Systems 1997  –  2000  (3 years) Systems Engineer Cisco Systems 1997  –  2000  (3 years) Account Manager Cisco Systems 1995  –  1997  (2 years) Account Manager Cisco Systems 1995  –  1997  (2 years) Research Engineer Defence Science and Technology Organisation 1991  –  1994  (3 years) Research into an early warning detection device for helicopters using vibration analysis to predict a catastrophic failure of the helicopters gear box. Research Engineer Defence Science and Technology Organisation 1991  –  1994  (3 years) Research into an early warning detection device for helicopters using vibration analysis to predict a catastrophic failure of the helicopters gear box. Skills Cisco Technologies Telepresence Routing Network Architecture Business Intelligence Unified Communications QoS Data Center Cisco IOS MPLS Ethernet IP CCNP VoIP Cloud Computing Network Design WAN Switches See 3+     See less Skills  Cisco Technologies Telepresence Routing Network Architecture Business Intelligence Unified Communications QoS Data Center Cisco IOS MPLS Ethernet IP CCNP VoIP Cloud Computing Network Design WAN Switches See 3+     See less Cisco Technologies Telepresence Routing Network Architecture Business Intelligence Unified Communications QoS Data Center Cisco IOS MPLS Ethernet IP CCNP VoIP Cloud Computing Network Design WAN Switches See 3+     See less Cisco Technologies Telepresence Routing Network Architecture Business Intelligence Unified Communications QoS Data Center Cisco IOS MPLS Ethernet IP CCNP VoIP Cloud Computing Network Design WAN Switches See 3+     See less Education Royal Melbourne Institute of Technology Aeronautical Engineering 1986  – 1990 Presbyterian Ladies College (PLC), Melbourne, Australia Royal Melbourne Institute of Technology Aeronautical Engineering 1986  – 1990 Royal Melbourne Institute of Technology Aeronautical Engineering 1986  – 1990 Royal Melbourne Institute of Technology Aeronautical Engineering 1986  – 1990 Presbyterian Ladies College (PLC), Melbourne, Australia Presbyterian Ladies College (PLC), Melbourne, Australia Presbyterian Ladies College (PLC), Melbourne, Australia ", "Skills Cisco Technologies Routing Team Leadership Unified Communications Virtualization Data Center VoIP Cloud Computing Network Design Cisco IOS Network Architecture Telecommunications CCNP Managed Services Solution Selling Mobile Phone Apps Strategic Thinking High Performance Teams Managing Distribution... Presenter Solid Presentation... Creative Problem Solving Wireless MPLS Ethernet Channel Partners Strategy IP WAN SIP Network Engineering Cisco Nexus Network Security Switches LAN-WAN Telephony Routers TCP/IP Firewalls Wireless Networking Sales Engineering Private Cloud Hybrid Cloud Partner Development Distribution Strategies Distributors Technical Demonstrations Mobile Devices Mobile Applications Mobile Technology See 35+     See less Skills  Cisco Technologies Routing Team Leadership Unified Communications Virtualization Data Center VoIP Cloud Computing Network Design Cisco IOS Network Architecture Telecommunications CCNP Managed Services Solution Selling Mobile Phone Apps Strategic Thinking High Performance Teams Managing Distribution... Presenter Solid Presentation... Creative Problem Solving Wireless MPLS Ethernet Channel Partners Strategy IP WAN SIP Network Engineering Cisco Nexus Network Security Switches LAN-WAN Telephony Routers TCP/IP Firewalls Wireless Networking Sales Engineering Private Cloud Hybrid Cloud Partner Development Distribution Strategies Distributors Technical Demonstrations Mobile Devices Mobile Applications Mobile Technology See 35+     See less Cisco Technologies Routing Team Leadership Unified Communications Virtualization Data Center VoIP Cloud Computing Network Design Cisco IOS Network Architecture Telecommunications CCNP Managed Services Solution Selling Mobile Phone Apps Strategic Thinking High Performance Teams Managing Distribution... Presenter Solid Presentation... Creative Problem Solving Wireless MPLS Ethernet Channel Partners Strategy IP WAN SIP Network Engineering Cisco Nexus Network Security Switches LAN-WAN Telephony Routers TCP/IP Firewalls Wireless Networking Sales Engineering Private Cloud Hybrid Cloud Partner Development Distribution Strategies Distributors Technical Demonstrations Mobile Devices Mobile Applications Mobile Technology See 35+     See less Cisco Technologies Routing Team Leadership Unified Communications Virtualization Data Center VoIP Cloud Computing Network Design Cisco IOS Network Architecture Telecommunications CCNP Managed Services Solution Selling Mobile Phone Apps Strategic Thinking High Performance Teams Managing Distribution... Presenter Solid Presentation... Creative Problem Solving Wireless MPLS Ethernet Channel Partners Strategy IP WAN SIP Network Engineering Cisco Nexus Network Security Switches LAN-WAN Telephony Routers TCP/IP Firewalls Wireless Networking Sales Engineering Private Cloud Hybrid Cloud Partner Development Distribution Strategies Distributors Technical Demonstrations Mobile Devices Mobile Applications Mobile Technology See 35+     See less ", "Skills Cisco Technologies Network Architecture Unified Communications Data Center Routing VoIP Cloud Computing IP Network Design Telepresence CISSP Security Systems Engineering Network Security Leadership Development Sales Management Diversity Champion Customer Service Customer Relations See 4+     See less Skills  Cisco Technologies Network Architecture Unified Communications Data Center Routing VoIP Cloud Computing IP Network Design Telepresence CISSP Security Systems Engineering Network Security Leadership Development Sales Management Diversity Champion Customer Service Customer Relations See 4+     See less Cisco Technologies Network Architecture Unified Communications Data Center Routing VoIP Cloud Computing IP Network Design Telepresence CISSP Security Systems Engineering Network Security Leadership Development Sales Management Diversity Champion Customer Service Customer Relations See 4+     See less Cisco Technologies Network Architecture Unified Communications Data Center Routing VoIP Cloud Computing IP Network Design Telepresence CISSP Security Systems Engineering Network Security Leadership Development Sales Management Diversity Champion Customer Service Customer Relations See 4+     See less ", "Summary Specialties:Cisco CCIE #18450 (R&S) \nMicrosoft MCSE (W2K) \nA+, Network+, Server+ Summary Specialties:Cisco CCIE #18450 (R&S) \nMicrosoft MCSE (W2K) \nA+, Network+, Server+ Specialties:Cisco CCIE #18450 (R&S) \nMicrosoft MCSE (W2K) \nA+, Network+, Server+ Specialties:Cisco CCIE #18450 (R&S) \nMicrosoft MCSE (W2K) \nA+, Network+, Server+ Experience Sr. Systems Engineering Manager Cisco August 2014  – Present (1 year 1 month) Sr. SEM for State, Local, and Education Wireless, western half of U.S. Sr. Systems Engineering Manager Cisco Systems May 2013  –  July 2014  (1 year 3 months) Sr. SEM for Federal Security & Wireless. Systems Engineering Manager Cisco Systems September 2010  –  May 2013  (2 years 9 months) Borderless Networks SEM, responsible for Federal Security Consulting Systems Engineer Cisco July 2009  –  August 2010  (1 year 2 months) Systems Engineer Cisco Systems September 2006  –  July 2009  (2 years 11 months) Systems Engineer Applied Information Systems August 2005  –  September 2006  (1 year 2 months) Contractor for Anheuser Busch. Systems Engineer NetEffects Inc. July 2004  –  August 2005  (1 year 2 months) Contractor for Anheuser Busch. Systems Engineer CSC January 2003  –  June 2004  (1 year 6 months) Contractor for USAF Presales Support Manager CDW 1998  –  2002  (4 years) Sr. Systems Engineering Manager Cisco August 2014  – Present (1 year 1 month) Sr. SEM for State, Local, and Education Wireless, western half of U.S. Sr. Systems Engineering Manager Cisco August 2014  – Present (1 year 1 month) Sr. SEM for State, Local, and Education Wireless, western half of U.S. Sr. Systems Engineering Manager Cisco Systems May 2013  –  July 2014  (1 year 3 months) Sr. SEM for Federal Security & Wireless. Sr. Systems Engineering Manager Cisco Systems May 2013  –  July 2014  (1 year 3 months) Sr. SEM for Federal Security & Wireless. Systems Engineering Manager Cisco Systems September 2010  –  May 2013  (2 years 9 months) Borderless Networks SEM, responsible for Federal Security Systems Engineering Manager Cisco Systems September 2010  –  May 2013  (2 years 9 months) Borderless Networks SEM, responsible for Federal Security Consulting Systems Engineer Cisco July 2009  –  August 2010  (1 year 2 months) Consulting Systems Engineer Cisco July 2009  –  August 2010  (1 year 2 months) Systems Engineer Cisco Systems September 2006  –  July 2009  (2 years 11 months) Systems Engineer Cisco Systems September 2006  –  July 2009  (2 years 11 months) Systems Engineer Applied Information Systems August 2005  –  September 2006  (1 year 2 months) Contractor for Anheuser Busch. Systems Engineer Applied Information Systems August 2005  –  September 2006  (1 year 2 months) Contractor for Anheuser Busch. Systems Engineer NetEffects Inc. July 2004  –  August 2005  (1 year 2 months) Contractor for Anheuser Busch. Systems Engineer NetEffects Inc. July 2004  –  August 2005  (1 year 2 months) Contractor for Anheuser Busch. Systems Engineer CSC January 2003  –  June 2004  (1 year 6 months) Contractor for USAF Systems Engineer CSC January 2003  –  June 2004  (1 year 6 months) Contractor for USAF Presales Support Manager CDW 1998  –  2002  (4 years) Presales Support Manager CDW 1998  –  2002  (4 years) Skills Network Architecture Cisco Technologies Data Center Network Security Switches Wireless Cisco IOS Virtualization Cloud Computing VMware Routing Network Engineering Disaster Recovery VoIP VPN Pre-sales CCIE A+ Network+ Server+ CCDP CCNP Active Directory Windows Server Leadership Technological Innovation Management See 12+     See less Skills  Network Architecture Cisco Technologies Data Center Network Security Switches Wireless Cisco IOS Virtualization Cloud Computing VMware Routing Network Engineering Disaster Recovery VoIP VPN Pre-sales CCIE A+ Network+ Server+ CCDP CCNP Active Directory Windows Server Leadership Technological Innovation Management See 12+     See less Network Architecture Cisco Technologies Data Center Network Security Switches Wireless Cisco IOS Virtualization Cloud Computing VMware Routing Network Engineering Disaster Recovery VoIP VPN Pre-sales CCIE A+ Network+ Server+ CCDP CCNP Active Directory Windows Server Leadership Technological Innovation Management See 12+     See less Network Architecture Cisco Technologies Data Center Network Security Switches Wireless Cisco IOS Virtualization Cloud Computing VMware Routing Network Engineering Disaster Recovery VoIP VPN Pre-sales CCIE A+ Network+ Server+ CCDP CCNP Active Directory Windows Server Leadership Technological Innovation Management See 12+     See less Education University of Illinois at Urbana-Champaign Bachelor of Arts (BA),  Economics 1994  – 1998 Activities and Societies:  Rugby University of Illinois at Urbana-Champaign Bachelor of Arts (BA),  Economics 1994  – 1998 Activities and Societies:  Rugby University of Illinois at Urbana-Champaign Bachelor of Arts (BA),  Economics 1994  – 1998 Activities and Societies:  Rugby University of Illinois at Urbana-Champaign Bachelor of Arts (BA),  Economics 1994  – 1998 Activities and Societies:  Rugby ", "Skills Network Design Telecommunications Telephony Routing Protocols IP Cisco Nexus WAN Engineering Management Sales Management IP Networking Cisco Switches Servers Networking Enterprise Software Unified Communications Routing Network Architecture Data Center Network Engineering Telepresence Unix CCIE QoS Cisco Technologies See 9+     See less Skills  Network Design Telecommunications Telephony Routing Protocols IP Cisco Nexus WAN Engineering Management Sales Management IP Networking Cisco Switches Servers Networking Enterprise Software Unified Communications Routing Network Architecture Data Center Network Engineering Telepresence Unix CCIE QoS Cisco Technologies See 9+     See less Network Design Telecommunications Telephony Routing Protocols IP Cisco Nexus WAN Engineering Management Sales Management IP Networking Cisco Switches Servers Networking Enterprise Software Unified Communications Routing Network Architecture Data Center Network Engineering Telepresence Unix CCIE QoS Cisco Technologies See 9+     See less Network Design Telecommunications Telephony Routing Protocols IP Cisco Nexus WAN Engineering Management Sales Management IP Networking Cisco Switches Servers Networking Enterprise Software Unified Communications Routing Network Architecture Data Center Network Engineering Telepresence Unix CCIE QoS Cisco Technologies See 9+     See less Honors & Awards Manager Excellence Multiple Manager Excellence awards Additional Honors & Awards CCIE #1854 Manager Excellence Multiple Manager Excellence awards Manager Excellence Multiple Manager Excellence awards Manager Excellence Multiple Manager Excellence awards Additional Honors & Awards CCIE #1854 Additional Honors & Awards CCIE #1854 Additional Honors & Awards CCIE #1854 ", "Skills Unified Communications Cisco Technologies Data Center Cloud Computing Routing Network Architecture Telepresence VoIP Virtualization Network Design Wireless Network Security Leadership Leadership Development Cross-functional Team... Mentoring Coaching Sales Presentations Influence At All Levels Influence Without... Thought Leadership Authenticity Navy System Integrators Commercial Sales Sales Management Salesforce.com Technical Leadership Solution Selling Ethernet Managed Services SIP Security Sales Engineering Switches Networking IP Cisco IOS Pre-sales Channel Partners Sales Enablement Video Conferencing Go-to-market Strategy Program Management Enterprise Software QoS MPLS Professional Services WAN SaaS See 35+     See less Skills  Unified Communications Cisco Technologies Data Center Cloud Computing Routing Network Architecture Telepresence VoIP Virtualization Network Design Wireless Network Security Leadership Leadership Development Cross-functional Team... Mentoring Coaching Sales Presentations Influence At All Levels Influence Without... Thought Leadership Authenticity Navy System Integrators Commercial Sales Sales Management Salesforce.com Technical Leadership Solution Selling Ethernet Managed Services SIP Security Sales Engineering Switches Networking IP Cisco IOS Pre-sales Channel Partners Sales Enablement Video Conferencing Go-to-market Strategy Program Management Enterprise Software QoS MPLS Professional Services WAN SaaS See 35+     See less Unified Communications Cisco Technologies Data Center Cloud Computing Routing Network Architecture Telepresence VoIP Virtualization Network Design Wireless Network Security Leadership Leadership Development Cross-functional Team... Mentoring Coaching Sales Presentations Influence At All Levels Influence Without... Thought Leadership Authenticity Navy System Integrators Commercial Sales Sales Management Salesforce.com Technical Leadership Solution Selling Ethernet Managed Services SIP Security Sales Engineering Switches Networking IP Cisco IOS Pre-sales Channel Partners Sales Enablement Video Conferencing Go-to-market Strategy Program Management Enterprise Software QoS MPLS Professional Services WAN SaaS See 35+     See less Unified Communications Cisco Technologies Data Center Cloud Computing Routing Network Architecture Telepresence VoIP Virtualization Network Design Wireless Network Security Leadership Leadership Development Cross-functional Team... Mentoring Coaching Sales Presentations Influence At All Levels Influence Without... Thought Leadership Authenticity Navy System Integrators Commercial Sales Sales Management Salesforce.com Technical Leadership Solution Selling Ethernet Managed Services SIP Security Sales Engineering Switches Networking IP Cisco IOS Pre-sales Channel Partners Sales Enablement Video Conferencing Go-to-market Strategy Program Management Enterprise Software QoS MPLS Professional Services WAN SaaS See 35+     See less ", "Summary I am a Leader with over 20 years of Networking experience both as a user of techonology and a seller. I have direct sales and Partner sales experience. I enjoy helping individuals futher their careers by acting as both a mentor and an example. Summary I am a Leader with over 20 years of Networking experience both as a user of techonology and a seller. I have direct sales and Partner sales experience. I enjoy helping individuals futher their careers by acting as both a mentor and an example. I am a Leader with over 20 years of Networking experience both as a user of techonology and a seller. I have direct sales and Partner sales experience. I enjoy helping individuals futher their careers by acting as both a mentor and an example. I am a Leader with over 20 years of Networking experience both as a user of techonology and a seller. I have direct sales and Partner sales experience. I enjoy helping individuals futher their careers by acting as both a mentor and an example. Skills Mentoring Team Leadership Teamwork Wireless Channel Cisco Technologies Network Architecture Solution Selling Telecommunications Sales Enablement Channel Partners Sales Engineering Networking Cross-functional Team... Strategy Telephony Management Network Security Ethernet Unified Communications Switches Cisco IOS VoIP Data Center MPLS QoS WAN Virtualization Direct Sales SIP Network Engineering Firewalls Professional Services Network Design Enterprise Software Managed Services VMware Disaster Recovery TCP/IP Telepresence Cloud Computing SaaS Integration Security Routing Storage Go-to-market Strategy Leadership Network Administration IP See 35+     See less Skills  Mentoring Team Leadership Teamwork Wireless Channel Cisco Technologies Network Architecture Solution Selling Telecommunications Sales Enablement Channel Partners Sales Engineering Networking Cross-functional Team... Strategy Telephony Management Network Security Ethernet Unified Communications Switches Cisco IOS VoIP Data Center MPLS QoS WAN Virtualization Direct Sales SIP Network Engineering Firewalls Professional Services Network Design Enterprise Software Managed Services VMware Disaster Recovery TCP/IP Telepresence Cloud Computing SaaS Integration Security Routing Storage Go-to-market Strategy Leadership Network Administration IP See 35+     See less Mentoring Team Leadership Teamwork Wireless Channel Cisco Technologies Network Architecture Solution Selling Telecommunications Sales Enablement Channel Partners Sales Engineering Networking Cross-functional Team... Strategy Telephony Management Network Security Ethernet Unified Communications Switches Cisco IOS VoIP Data Center MPLS QoS WAN Virtualization Direct Sales SIP Network Engineering Firewalls Professional Services Network Design Enterprise Software Managed Services VMware Disaster Recovery TCP/IP Telepresence Cloud Computing SaaS Integration Security Routing Storage Go-to-market Strategy Leadership Network Administration IP See 35+     See less Mentoring Team Leadership Teamwork Wireless Channel Cisco Technologies Network Architecture Solution Selling Telecommunications Sales Enablement Channel Partners Sales Engineering Networking Cross-functional Team... Strategy Telephony Management Network Security Ethernet Unified Communications Switches Cisco IOS VoIP Data Center MPLS QoS WAN Virtualization Direct Sales SIP Network Engineering Firewalls Professional Services Network Design Enterprise Software Managed Services VMware Disaster Recovery TCP/IP Telepresence Cloud Computing SaaS Integration Security Routing Storage Go-to-market Strategy Leadership Network Administration IP See 35+     See less Education Marist College BS,  Computer Science 1985  – 1989 Activities and Societies:  Track Team - 1985 Marist College BS,  Computer Science 1985  – 1989 Activities and Societies:  Track Team - 1985 Marist College BS,  Computer Science 1985  – 1989 Activities and Societies:  Track Team - 1985 Marist College BS,  Computer Science 1985  – 1989 Activities and Societies:  Track Team - 1985 Honors & Awards ", "Languages English English English Skills Transformational Leader Wireless Microsoft Exchange CCNP Systems Engineering OSPF Cisco Technologies Telephony MPLS BGP Data Center Firewalls Network Architecture Network Security Networking ATM networks CCDP Cisco IOS Cloud Computing Computer Network... Cross-functional Team... EIGRP Frame Relay LAN-WAN Managed Services Network Design Routers Routing SDH Security Solution Selling Telecommunications Telepresence Unified Communications VPN Sales Engineering IP VoIP WAN SIP QoS Switches Network Engineering Enterprise Architecture Solution Architecture Team Leadership Transformational... See 32+     See less Skills  Transformational Leader Wireless Microsoft Exchange CCNP Systems Engineering OSPF Cisco Technologies Telephony MPLS BGP Data Center Firewalls Network Architecture Network Security Networking ATM networks CCDP Cisco IOS Cloud Computing Computer Network... Cross-functional Team... EIGRP Frame Relay LAN-WAN Managed Services Network Design Routers Routing SDH Security Solution Selling Telecommunications Telepresence Unified Communications VPN Sales Engineering IP VoIP WAN SIP QoS Switches Network Engineering Enterprise Architecture Solution Architecture Team Leadership Transformational... See 32+     See less Transformational Leader Wireless Microsoft Exchange CCNP Systems Engineering OSPF Cisco Technologies Telephony MPLS BGP Data Center Firewalls Network Architecture Network Security Networking ATM networks CCDP Cisco IOS Cloud Computing Computer Network... Cross-functional Team... EIGRP Frame Relay LAN-WAN Managed Services Network Design Routers Routing SDH Security Solution Selling Telecommunications Telepresence Unified Communications VPN Sales Engineering IP VoIP WAN SIP QoS Switches Network Engineering Enterprise Architecture Solution Architecture Team Leadership Transformational... See 32+     See less Transformational Leader Wireless Microsoft Exchange CCNP Systems Engineering OSPF Cisco Technologies Telephony MPLS BGP Data Center Firewalls Network Architecture Network Security Networking ATM networks CCDP Cisco IOS Cloud Computing Computer Network... Cross-functional Team... EIGRP Frame Relay LAN-WAN Managed Services Network Design Routers Routing SDH Security Solution Selling Telecommunications Telepresence Unified Communications VPN Sales Engineering IP VoIP WAN SIP QoS Switches Network Engineering Enterprise Architecture Solution Architecture Team Leadership Transformational... See 32+     See less ", "Summary •\tHave 20+ years experience in SW development, QA, research and business development. \n•\tSecure broad scope knowledge and experiences in diverse areas/disciplines.  \n•\tHold different managerial positions in different areas with various sizes of companies. \n•\tCisco WLAN, Mobile, Telepresence, video QA. Solution testing, Escalation and customer solution integration and support.  \n•\tVodafone CTO and CSO staff for new technology, research, network, architecture and business opportunities evaluation. Assess and develop company vision and strategy on key technology/network evolution/revolution. \n•\tLead many international projects with local and international business partners, vendors, research labs, Universities and customers on network architecture, development, operation, evaluation and optimization. \n•\tLead country wide network deployment and operation for rapid growing GSM markets. \n•\tWork with customers and partners on defining products/solutions, and strategy/vision on new technologies/services/products/business impact.  \n•\tSuccessfully lead cross-functional teams on diversified projects (research, system architecture, network operation and optimization, HW/SW development/testing, product management and development, business valuation, system integration, system evaluation/testing, standard, customer support and solution, strategy and services).  \n•\tTen patents granted, three pending and over 50+ technical papers published in journals, books and conferences. Specialties:SW Development & Test/QA \nWireless Communications, WLAN, 3G, LTE, CDMA, GSM \nWireless Network Deployment, Operation, Optimization \nWireless Network Architect \nMerger and Acquisition \nMobile video and video conferencing \nNetworking  \nMobile operators and vendors \nTeam management and project management Summary •\tHave 20+ years experience in SW development, QA, research and business development. \n•\tSecure broad scope knowledge and experiences in diverse areas/disciplines.  \n•\tHold different managerial positions in different areas with various sizes of companies. \n•\tCisco WLAN, Mobile, Telepresence, video QA. Solution testing, Escalation and customer solution integration and support.  \n•\tVodafone CTO and CSO staff for new technology, research, network, architecture and business opportunities evaluation. Assess and develop company vision and strategy on key technology/network evolution/revolution. \n•\tLead many international projects with local and international business partners, vendors, research labs, Universities and customers on network architecture, development, operation, evaluation and optimization. \n•\tLead country wide network deployment and operation for rapid growing GSM markets. \n•\tWork with customers and partners on defining products/solutions, and strategy/vision on new technologies/services/products/business impact.  \n•\tSuccessfully lead cross-functional teams on diversified projects (research, system architecture, network operation and optimization, HW/SW development/testing, product management and development, business valuation, system integration, system evaluation/testing, standard, customer support and solution, strategy and services).  \n•\tTen patents granted, three pending and over 50+ technical papers published in journals, books and conferences. Specialties:SW Development & Test/QA \nWireless Communications, WLAN, 3G, LTE, CDMA, GSM \nWireless Network Deployment, Operation, Optimization \nWireless Network Architect \nMerger and Acquisition \nMobile video and video conferencing \nNetworking  \nMobile operators and vendors \nTeam management and project management •\tHave 20+ years experience in SW development, QA, research and business development. \n•\tSecure broad scope knowledge and experiences in diverse areas/disciplines.  \n•\tHold different managerial positions in different areas with various sizes of companies. \n•\tCisco WLAN, Mobile, Telepresence, video QA. Solution testing, Escalation and customer solution integration and support.  \n•\tVodafone CTO and CSO staff for new technology, research, network, architecture and business opportunities evaluation. Assess and develop company vision and strategy on key technology/network evolution/revolution. \n•\tLead many international projects with local and international business partners, vendors, research labs, Universities and customers on network architecture, development, operation, evaluation and optimization. \n•\tLead country wide network deployment and operation for rapid growing GSM markets. \n•\tWork with customers and partners on defining products/solutions, and strategy/vision on new technologies/services/products/business impact.  \n•\tSuccessfully lead cross-functional teams on diversified projects (research, system architecture, network operation and optimization, HW/SW development/testing, product management and development, business valuation, system integration, system evaluation/testing, standard, customer support and solution, strategy and services).  \n•\tTen patents granted, three pending and over 50+ technical papers published in journals, books and conferences. Specialties:SW Development & Test/QA \nWireless Communications, WLAN, 3G, LTE, CDMA, GSM \nWireless Network Deployment, Operation, Optimization \nWireless Network Architect \nMerger and Acquisition \nMobile video and video conferencing \nNetworking  \nMobile operators and vendors \nTeam management and project management •\tHave 20+ years experience in SW development, QA, research and business development. \n•\tSecure broad scope knowledge and experiences in diverse areas/disciplines.  \n•\tHold different managerial positions in different areas with various sizes of companies. \n•\tCisco WLAN, Mobile, Telepresence, video QA. Solution testing, Escalation and customer solution integration and support.  \n•\tVodafone CTO and CSO staff for new technology, research, network, architecture and business opportunities evaluation. Assess and develop company vision and strategy on key technology/network evolution/revolution. \n•\tLead many international projects with local and international business partners, vendors, research labs, Universities and customers on network architecture, development, operation, evaluation and optimization. \n•\tLead country wide network deployment and operation for rapid growing GSM markets. \n•\tWork with customers and partners on defining products/solutions, and strategy/vision on new technologies/services/products/business impact.  \n•\tSuccessfully lead cross-functional teams on diversified projects (research, system architecture, network operation and optimization, HW/SW development/testing, product management and development, business valuation, system integration, system evaluation/testing, standard, customer support and solution, strategy and services).  \n•\tTen patents granted, three pending and over 50+ technical papers published in journals, books and conferences. Specialties:SW Development & Test/QA \nWireless Communications, WLAN, 3G, LTE, CDMA, GSM \nWireless Network Deployment, Operation, Optimization \nWireless Network Architect \nMerger and Acquisition \nMobile video and video conferencing \nNetworking  \nMobile operators and vendors \nTeam management and project management Experience Sr. Engineering manager Cisco Systems March 2008  – Present (7 years 6 months) TXBU  \nResponsible for QA (feature, automation, integration and solution test) of Telepresence services by emulating customer set ups. Working closely with vendors, other BUs, customers and OPS to ensure requirements and TTM are met with high quality. Sr. Engineering manager Cisco Systems April 2006  –  March 2008  (2 years) S3BU  \nLed devtest group (30 people at prime) on strategy, plan, infrastructure set up, methodology, tools, solution and test execution for 1st responder system. Focused on automation, feature and solution testing, interBU IOT, innovations and efficiency. Sr Engineering Manager Cisco Systems April 2006  –  March 2008  (2 years) Mobile Video, MESH and PWLAN Solution Manager - Global Mobile Vertical \nWork with industry, customers and filed in different countries, identify potential big bet solution, formed and drove the solution efforts with local markets, partners and BUs. Works include define solution architecture, identify features and timeline, pull internal and external teams on development, IOT and Beach Mobile Solution manager Cisco Systems February 2005  –  February 2005  (1 month) Sr. Engineering Manager Wireless Network Business Unit February 2001  –  February 2005  (4 years 1 month) Build and manage the WNBU centralized testing group cross geographically distributed locations. Functions include feature testing, escalation, EFT support, release management, regression, voice, tools, certification, automation, RCA, large scale system testing, simulation, system test lab and project testing. Work closely with TAC, SE, CA, DE, marketing and customers on identifying and providing solution to field issues. Develop centralized engineering facility and process to improve the system test efficiency, coverage and feedback loop from field to testing. Successfully drive several initiatives that involve communicating concept, process, methodology and securing commitment from internal and external teams. VP Exio Communications December 2000  –  February 2001  (3 months) System Integration, Customer Advocacy and Product Management \nWorked closely with customers, partners and HW/SW development teams on product and system requirements/specifications. Involved in system architecture, system integration/testing, business evaluation with strategic partners and customers, RFI/RFP responses, product/field trial support, lab/demo, product development and migration strategy and plan, customer and partner relationship and business plan for the company. Director Vodafone Group Plc October 1998  –  November 2000  (2 years 2 months) Group Technology Strategy \nLed representatives from Vodafone markets from different countries and vendors on the evaluation (marketing, product, business, risk assessment, regulatory and technology) of 2G and 3G technologies and network migration strategy/plan for CTO office. Evaluated and recommended with joint efforts from Vodafone markets and vendors on migration strategy/plan for voice to data transition for Vodafone CTO office. Was member of patent review committee. \nLed business development team (20+ members form international and local business partners that have diversified cultures, functions, skills and objectives) on potential M&A opportunities and network evaluations. Markets included Taiwan (GSM; . Business evaluation team included members from finance, regulatory, auditing, marketing, IT, customer care, engineering and sale. \nDeveloped migration strategy, deployment guideline and conduct 3G-technology trials in LA and some of the European markets. \nLed small diversified team with different expertise on valuation of new start ups (from chip set, infrastructure, handset, network, applications and services) on both technology and business potentials. Director AirTouch Vodafone October 1997  –  October 1998  (1 year 1 month) Led cross-functional team on domestic cellular network capacity evolution strategy development and business analysis. Identified, negotiated, architect and deployed innovative, low cost network and enhanced service platforms. Served as technical lead in the development of cost-benefit modeling on introducing new products and services. Participated in the 3G/IP(TR45.5, TR45.6, MWIF) standards development in the physical, MAC, requirements and architecture areas. Member of the core team on evaluating potential business opportunities in China and Hong Kong.  \nMaintained and developed core skills in all major global wireless communication technologies (GSM, CDMA, 3G) to support Corporate and business unit planning and decision making on key issues and initiatives. Managing and directing medium to large telecommunications projects and programs. Modeled, tested, business analyzed and trialed leading edge network technologies. Was responsible for network engineering prototyping, field and lab measurement, network operation and system optimization. Conducted new technology assessment and economical analysis for different markets and technologies. Director AirTouch International October 1996  –  October 1997  (1 year 1 month) Network Engineering for Romania (GSM) \nLed 60+ engineers on the RFP, vendor selection, contract negotiation, procurement, design, deployment and optimization of the nation wide GSM network. Managed the relationships with vendors, government, partners and external and internal customers. Was responsible for substantial amount of capital and operation budget. Developed the process and procedures for daily business operation and formed strategic group on developing future strategy and plan. Developed process and tools for technology transfer to local operation. Principle Engineer AirTouch August 1993  –  October 1996  (3 years 3 months) Managed new technology and network engineering prototype group. New technologies include: smart antenna, super-conducting LNA, repeater, CDPD system capacity and performance analysis, network planning, CDPD and CDMA data network roll out and optimization and intelligent cell (MicroCell). Led network and SW engineers on defining, managing, planning, developing, vendor negotiating, budgeting, FCC filing, analyzing network modeling and evaluation of new network technologies and products. Responsible for the joint research projects with local universities (SJSU, UC Hayward, UC Davis and Berkeley). Led these projects with cross-organizational experts from Corporate, markets and vendors to ensure projects are heading in the direction that best fits AirTouch's interests in a most economical manner. Manager AirTouch October 1991  –  August 1993  (1 year 11 months) Software Development (Network Planning and Network Management Systems)  \nLed 30+ SW and RF engineers on the development/testing/marketing support of network engineering and optimization tool. These tools are graphic intensive with interactive simulation capability. RF propagation, capacity simulation and network optimization algorithms were invented under intense and extremely aggressive schedule. This is an application running on SUN workstation, written in C++ under UNIX, using INFORMIX, X-Windows and HPGL. Project Lead Motorola Corporation July 1990  –  September 1991  (1 year 3 months) Worked on the architecture of the Motorola GSM/PCN system. Responsible for service definition, requirement, implementation, network performance analysis, system integration and testing on the GSM Air and Abis interfaces. Led performance analysis effort on call processing and connectivity among the GSM OMC, MSC, BSC, and BTS. Conducted protocol performance analysis on ISDN vs. SS7 for MSC BSC interface, MTS AT&T Bell Labs June 1986  –  June 1990  (4 years 1 month) MTS - Worked on real time UNIX and the next generation packet based 5ESS ISDN, SS7 (IN), call processing, architecture and supplementary services implementation. Evaluated the BT network architecture. Defined customer requirements for the Terminal Maintenance (TM), Operation, Administrative and Maintenance (OA&M), and call processing for ISDN and IN. Involved in the OSI X.25 protocol implementation on 5ESS. Developed NMS and FTAM modules for transmitting billing, operation and control information from 5ESS switch to Data Processing Center. Worked on switch configuration, network performance and customer database. Evaluated OMC multi-session connectivity and performance. Involved in retrofitting several switches at customer sites and the first international 5ESS ISDN phone call at Taiwan. Involved in the methodology development and implementation for SW development and QA, load build, system integration and automated testing. Sr. Engineering manager Cisco Systems March 2008  – Present (7 years 6 months) TXBU  \nResponsible for QA (feature, automation, integration and solution test) of Telepresence services by emulating customer set ups. Working closely with vendors, other BUs, customers and OPS to ensure requirements and TTM are met with high quality. Sr. Engineering manager Cisco Systems March 2008  – Present (7 years 6 months) TXBU  \nResponsible for QA (feature, automation, integration and solution test) of Telepresence services by emulating customer set ups. Working closely with vendors, other BUs, customers and OPS to ensure requirements and TTM are met with high quality. Sr. Engineering manager Cisco Systems April 2006  –  March 2008  (2 years) S3BU  \nLed devtest group (30 people at prime) on strategy, plan, infrastructure set up, methodology, tools, solution and test execution for 1st responder system. Focused on automation, feature and solution testing, interBU IOT, innovations and efficiency. Sr. Engineering manager Cisco Systems April 2006  –  March 2008  (2 years) S3BU  \nLed devtest group (30 people at prime) on strategy, plan, infrastructure set up, methodology, tools, solution and test execution for 1st responder system. Focused on automation, feature and solution testing, interBU IOT, innovations and efficiency. Sr Engineering Manager Cisco Systems April 2006  –  March 2008  (2 years) Mobile Video, MESH and PWLAN Solution Manager - Global Mobile Vertical \nWork with industry, customers and filed in different countries, identify potential big bet solution, formed and drove the solution efforts with local markets, partners and BUs. Works include define solution architecture, identify features and timeline, pull internal and external teams on development, IOT and Beach Sr Engineering Manager Cisco Systems April 2006  –  March 2008  (2 years) Mobile Video, MESH and PWLAN Solution Manager - Global Mobile Vertical \nWork with industry, customers and filed in different countries, identify potential big bet solution, formed and drove the solution efforts with local markets, partners and BUs. Works include define solution architecture, identify features and timeline, pull internal and external teams on development, IOT and Beach Mobile Solution manager Cisco Systems February 2005  –  February 2005  (1 month) Mobile Solution manager Cisco Systems February 2005  –  February 2005  (1 month) Sr. Engineering Manager Wireless Network Business Unit February 2001  –  February 2005  (4 years 1 month) Build and manage the WNBU centralized testing group cross geographically distributed locations. Functions include feature testing, escalation, EFT support, release management, regression, voice, tools, certification, automation, RCA, large scale system testing, simulation, system test lab and project testing. Work closely with TAC, SE, CA, DE, marketing and customers on identifying and providing solution to field issues. Develop centralized engineering facility and process to improve the system test efficiency, coverage and feedback loop from field to testing. Successfully drive several initiatives that involve communicating concept, process, methodology and securing commitment from internal and external teams. Sr. Engineering Manager Wireless Network Business Unit February 2001  –  February 2005  (4 years 1 month) Build and manage the WNBU centralized testing group cross geographically distributed locations. Functions include feature testing, escalation, EFT support, release management, regression, voice, tools, certification, automation, RCA, large scale system testing, simulation, system test lab and project testing. Work closely with TAC, SE, CA, DE, marketing and customers on identifying and providing solution to field issues. Develop centralized engineering facility and process to improve the system test efficiency, coverage and feedback loop from field to testing. Successfully drive several initiatives that involve communicating concept, process, methodology and securing commitment from internal and external teams. VP Exio Communications December 2000  –  February 2001  (3 months) System Integration, Customer Advocacy and Product Management \nWorked closely with customers, partners and HW/SW development teams on product and system requirements/specifications. Involved in system architecture, system integration/testing, business evaluation with strategic partners and customers, RFI/RFP responses, product/field trial support, lab/demo, product development and migration strategy and plan, customer and partner relationship and business plan for the company. VP Exio Communications December 2000  –  February 2001  (3 months) System Integration, Customer Advocacy and Product Management \nWorked closely with customers, partners and HW/SW development teams on product and system requirements/specifications. Involved in system architecture, system integration/testing, business evaluation with strategic partners and customers, RFI/RFP responses, product/field trial support, lab/demo, product development and migration strategy and plan, customer and partner relationship and business plan for the company. Director Vodafone Group Plc October 1998  –  November 2000  (2 years 2 months) Group Technology Strategy \nLed representatives from Vodafone markets from different countries and vendors on the evaluation (marketing, product, business, risk assessment, regulatory and technology) of 2G and 3G technologies and network migration strategy/plan for CTO office. Evaluated and recommended with joint efforts from Vodafone markets and vendors on migration strategy/plan for voice to data transition for Vodafone CTO office. Was member of patent review committee. \nLed business development team (20+ members form international and local business partners that have diversified cultures, functions, skills and objectives) on potential M&A opportunities and network evaluations. Markets included Taiwan (GSM; . Business evaluation team included members from finance, regulatory, auditing, marketing, IT, customer care, engineering and sale. \nDeveloped migration strategy, deployment guideline and conduct 3G-technology trials in LA and some of the European markets. \nLed small diversified team with different expertise on valuation of new start ups (from chip set, infrastructure, handset, network, applications and services) on both technology and business potentials. Director Vodafone Group Plc October 1998  –  November 2000  (2 years 2 months) Group Technology Strategy \nLed representatives from Vodafone markets from different countries and vendors on the evaluation (marketing, product, business, risk assessment, regulatory and technology) of 2G and 3G technologies and network migration strategy/plan for CTO office. Evaluated and recommended with joint efforts from Vodafone markets and vendors on migration strategy/plan for voice to data transition for Vodafone CTO office. Was member of patent review committee. \nLed business development team (20+ members form international and local business partners that have diversified cultures, functions, skills and objectives) on potential M&A opportunities and network evaluations. Markets included Taiwan (GSM; . Business evaluation team included members from finance, regulatory, auditing, marketing, IT, customer care, engineering and sale. \nDeveloped migration strategy, deployment guideline and conduct 3G-technology trials in LA and some of the European markets. \nLed small diversified team with different expertise on valuation of new start ups (from chip set, infrastructure, handset, network, applications and services) on both technology and business potentials. Director AirTouch Vodafone October 1997  –  October 1998  (1 year 1 month) Led cross-functional team on domestic cellular network capacity evolution strategy development and business analysis. Identified, negotiated, architect and deployed innovative, low cost network and enhanced service platforms. Served as technical lead in the development of cost-benefit modeling on introducing new products and services. Participated in the 3G/IP(TR45.5, TR45.6, MWIF) standards development in the physical, MAC, requirements and architecture areas. Member of the core team on evaluating potential business opportunities in China and Hong Kong.  \nMaintained and developed core skills in all major global wireless communication technologies (GSM, CDMA, 3G) to support Corporate and business unit planning and decision making on key issues and initiatives. Managing and directing medium to large telecommunications projects and programs. Modeled, tested, business analyzed and trialed leading edge network technologies. Was responsible for network engineering prototyping, field and lab measurement, network operation and system optimization. Conducted new technology assessment and economical analysis for different markets and technologies. Director AirTouch Vodafone October 1997  –  October 1998  (1 year 1 month) Led cross-functional team on domestic cellular network capacity evolution strategy development and business analysis. Identified, negotiated, architect and deployed innovative, low cost network and enhanced service platforms. Served as technical lead in the development of cost-benefit modeling on introducing new products and services. Participated in the 3G/IP(TR45.5, TR45.6, MWIF) standards development in the physical, MAC, requirements and architecture areas. Member of the core team on evaluating potential business opportunities in China and Hong Kong.  \nMaintained and developed core skills in all major global wireless communication technologies (GSM, CDMA, 3G) to support Corporate and business unit planning and decision making on key issues and initiatives. Managing and directing medium to large telecommunications projects and programs. Modeled, tested, business analyzed and trialed leading edge network technologies. Was responsible for network engineering prototyping, field and lab measurement, network operation and system optimization. Conducted new technology assessment and economical analysis for different markets and technologies. Director AirTouch International October 1996  –  October 1997  (1 year 1 month) Network Engineering for Romania (GSM) \nLed 60+ engineers on the RFP, vendor selection, contract negotiation, procurement, design, deployment and optimization of the nation wide GSM network. Managed the relationships with vendors, government, partners and external and internal customers. Was responsible for substantial amount of capital and operation budget. Developed the process and procedures for daily business operation and formed strategic group on developing future strategy and plan. Developed process and tools for technology transfer to local operation. Director AirTouch International October 1996  –  October 1997  (1 year 1 month) Network Engineering for Romania (GSM) \nLed 60+ engineers on the RFP, vendor selection, contract negotiation, procurement, design, deployment and optimization of the nation wide GSM network. Managed the relationships with vendors, government, partners and external and internal customers. Was responsible for substantial amount of capital and operation budget. Developed the process and procedures for daily business operation and formed strategic group on developing future strategy and plan. Developed process and tools for technology transfer to local operation. Principle Engineer AirTouch August 1993  –  October 1996  (3 years 3 months) Managed new technology and network engineering prototype group. New technologies include: smart antenna, super-conducting LNA, repeater, CDPD system capacity and performance analysis, network planning, CDPD and CDMA data network roll out and optimization and intelligent cell (MicroCell). Led network and SW engineers on defining, managing, planning, developing, vendor negotiating, budgeting, FCC filing, analyzing network modeling and evaluation of new network technologies and products. Responsible for the joint research projects with local universities (SJSU, UC Hayward, UC Davis and Berkeley). Led these projects with cross-organizational experts from Corporate, markets and vendors to ensure projects are heading in the direction that best fits AirTouch's interests in a most economical manner. Principle Engineer AirTouch August 1993  –  October 1996  (3 years 3 months) Managed new technology and network engineering prototype group. New technologies include: smart antenna, super-conducting LNA, repeater, CDPD system capacity and performance analysis, network planning, CDPD and CDMA data network roll out and optimization and intelligent cell (MicroCell). Led network and SW engineers on defining, managing, planning, developing, vendor negotiating, budgeting, FCC filing, analyzing network modeling and evaluation of new network technologies and products. Responsible for the joint research projects with local universities (SJSU, UC Hayward, UC Davis and Berkeley). Led these projects with cross-organizational experts from Corporate, markets and vendors to ensure projects are heading in the direction that best fits AirTouch's interests in a most economical manner. Manager AirTouch October 1991  –  August 1993  (1 year 11 months) Software Development (Network Planning and Network Management Systems)  \nLed 30+ SW and RF engineers on the development/testing/marketing support of network engineering and optimization tool. These tools are graphic intensive with interactive simulation capability. RF propagation, capacity simulation and network optimization algorithms were invented under intense and extremely aggressive schedule. This is an application running on SUN workstation, written in C++ under UNIX, using INFORMIX, X-Windows and HPGL. Manager AirTouch October 1991  –  August 1993  (1 year 11 months) Software Development (Network Planning and Network Management Systems)  \nLed 30+ SW and RF engineers on the development/testing/marketing support of network engineering and optimization tool. These tools are graphic intensive with interactive simulation capability. RF propagation, capacity simulation and network optimization algorithms were invented under intense and extremely aggressive schedule. This is an application running on SUN workstation, written in C++ under UNIX, using INFORMIX, X-Windows and HPGL. Project Lead Motorola Corporation July 1990  –  September 1991  (1 year 3 months) Worked on the architecture of the Motorola GSM/PCN system. Responsible for service definition, requirement, implementation, network performance analysis, system integration and testing on the GSM Air and Abis interfaces. Led performance analysis effort on call processing and connectivity among the GSM OMC, MSC, BSC, and BTS. Conducted protocol performance analysis on ISDN vs. SS7 for MSC BSC interface, Project Lead Motorola Corporation July 1990  –  September 1991  (1 year 3 months) Worked on the architecture of the Motorola GSM/PCN system. Responsible for service definition, requirement, implementation, network performance analysis, system integration and testing on the GSM Air and Abis interfaces. Led performance analysis effort on call processing and connectivity among the GSM OMC, MSC, BSC, and BTS. Conducted protocol performance analysis on ISDN vs. SS7 for MSC BSC interface, MTS AT&T Bell Labs June 1986  –  June 1990  (4 years 1 month) MTS - Worked on real time UNIX and the next generation packet based 5ESS ISDN, SS7 (IN), call processing, architecture and supplementary services implementation. Evaluated the BT network architecture. Defined customer requirements for the Terminal Maintenance (TM), Operation, Administrative and Maintenance (OA&M), and call processing for ISDN and IN. Involved in the OSI X.25 protocol implementation on 5ESS. Developed NMS and FTAM modules for transmitting billing, operation and control information from 5ESS switch to Data Processing Center. Worked on switch configuration, network performance and customer database. Evaluated OMC multi-session connectivity and performance. Involved in retrofitting several switches at customer sites and the first international 5ESS ISDN phone call at Taiwan. Involved in the methodology development and implementation for SW development and QA, load build, system integration and automated testing. MTS AT&T Bell Labs June 1986  –  June 1990  (4 years 1 month) MTS - Worked on real time UNIX and the next generation packet based 5ESS ISDN, SS7 (IN), call processing, architecture and supplementary services implementation. Evaluated the BT network architecture. Defined customer requirements for the Terminal Maintenance (TM), Operation, Administrative and Maintenance (OA&M), and call processing for ISDN and IN. Involved in the OSI X.25 protocol implementation on 5ESS. Developed NMS and FTAM modules for transmitting billing, operation and control information from 5ESS switch to Data Processing Center. Worked on switch configuration, network performance and customer database. Evaluated OMC multi-session connectivity and performance. Involved in retrofitting several switches at customer sites and the first international 5ESS ISDN phone call at Taiwan. Involved in the methodology development and implementation for SW development and QA, load build, system integration and automated testing. Education Stanford University Advanced Management College 1999 University of Phoenix MBA 1999 Illinois Institute of Technology Ph.D,  Computer Science 1996 Illinois Institute of Technology M.S,  Computer Science 1986 Thesis - 3G CDMA System Capacity National Cheng Kung University B.S,  Electrical Engineering 1983 Stanford University Advanced Management College 1999 Stanford University Advanced Management College 1999 Stanford University Advanced Management College 1999 University of Phoenix MBA 1999 University of Phoenix MBA 1999 University of Phoenix MBA 1999 Illinois Institute of Technology Ph.D,  Computer Science 1996 Illinois Institute of Technology Ph.D,  Computer Science 1996 Illinois Institute of Technology Ph.D,  Computer Science 1996 Illinois Institute of Technology M.S,  Computer Science 1986 Thesis - 3G CDMA System Capacity Illinois Institute of Technology M.S,  Computer Science 1986 Thesis - 3G CDMA System Capacity Illinois Institute of Technology M.S,  Computer Science 1986 Thesis - 3G CDMA System Capacity National Cheng Kung University B.S,  Electrical Engineering 1983 National Cheng Kung University B.S,  Electrical Engineering 1983 National Cheng Kung University B.S,  Electrical Engineering 1983 ", "Summary Seasoned software executive with strong leadership skills, broad technical expertise with deep understanding of security, uc (voice/video), routing/switching and virtualization, excellent teamwork and people management ability and impactful insights into business and product strategy. \n \nWinner of \"Cisco Pioneer Award in 2001 & 2011\" and holders of 5 patents. \n \nSpecialties:  \n \nSecurity: PKI, TLS/SSL, IPSec, MacSec, Threat Defense IDS/IPS, Application Firewall, Malware/Virus Protection, Cyber Security \nNetworking: TCP/UDP/IP, MPLS, PPP, Frame Relay, VPN, Software Defined Networking, NFV \nVoIP: RTP/RTCP, SIP, H323, MGCP, H248, Telephony/TDM signaling \nVideo and Audio Compressions G.711/729/H320/H263/H264 \nVirtualization: Linux KVM, LXC, Hypervisors, VM Management \nWeb: REST, SOAP, HTTP, JSON, XML \nBig Data: Hadoop techniques, Kafka/Storm, Graph, Cassandra, NOSQL \nMulti-core CPU (network processors) for line card designs, high speed forwarding & switching \nProven user centric, system level design and architecture skills \nTrailblazers in network deployment with countless customer success engagements Summary Seasoned software executive with strong leadership skills, broad technical expertise with deep understanding of security, uc (voice/video), routing/switching and virtualization, excellent teamwork and people management ability and impactful insights into business and product strategy. \n \nWinner of \"Cisco Pioneer Award in 2001 & 2011\" and holders of 5 patents. \n \nSpecialties:  \n \nSecurity: PKI, TLS/SSL, IPSec, MacSec, Threat Defense IDS/IPS, Application Firewall, Malware/Virus Protection, Cyber Security \nNetworking: TCP/UDP/IP, MPLS, PPP, Frame Relay, VPN, Software Defined Networking, NFV \nVoIP: RTP/RTCP, SIP, H323, MGCP, H248, Telephony/TDM signaling \nVideo and Audio Compressions G.711/729/H320/H263/H264 \nVirtualization: Linux KVM, LXC, Hypervisors, VM Management \nWeb: REST, SOAP, HTTP, JSON, XML \nBig Data: Hadoop techniques, Kafka/Storm, Graph, Cassandra, NOSQL \nMulti-core CPU (network processors) for line card designs, high speed forwarding & switching \nProven user centric, system level design and architecture skills \nTrailblazers in network deployment with countless customer success engagements Seasoned software executive with strong leadership skills, broad technical expertise with deep understanding of security, uc (voice/video), routing/switching and virtualization, excellent teamwork and people management ability and impactful insights into business and product strategy. \n \nWinner of \"Cisco Pioneer Award in 2001 & 2011\" and holders of 5 patents. \n \nSpecialties:  \n \nSecurity: PKI, TLS/SSL, IPSec, MacSec, Threat Defense IDS/IPS, Application Firewall, Malware/Virus Protection, Cyber Security \nNetworking: TCP/UDP/IP, MPLS, PPP, Frame Relay, VPN, Software Defined Networking, NFV \nVoIP: RTP/RTCP, SIP, H323, MGCP, H248, Telephony/TDM signaling \nVideo and Audio Compressions G.711/729/H320/H263/H264 \nVirtualization: Linux KVM, LXC, Hypervisors, VM Management \nWeb: REST, SOAP, HTTP, JSON, XML \nBig Data: Hadoop techniques, Kafka/Storm, Graph, Cassandra, NOSQL \nMulti-core CPU (network processors) for line card designs, high speed forwarding & switching \nProven user centric, system level design and architecture skills \nTrailblazers in network deployment with countless customer success engagements Seasoned software executive with strong leadership skills, broad technical expertise with deep understanding of security, uc (voice/video), routing/switching and virtualization, excellent teamwork and people management ability and impactful insights into business and product strategy. \n \nWinner of \"Cisco Pioneer Award in 2001 & 2011\" and holders of 5 patents. \n \nSpecialties:  \n \nSecurity: PKI, TLS/SSL, IPSec, MacSec, Threat Defense IDS/IPS, Application Firewall, Malware/Virus Protection, Cyber Security \nNetworking: TCP/UDP/IP, MPLS, PPP, Frame Relay, VPN, Software Defined Networking, NFV \nVoIP: RTP/RTCP, SIP, H323, MGCP, H248, Telephony/TDM signaling \nVideo and Audio Compressions G.711/729/H320/H263/H264 \nVirtualization: Linux KVM, LXC, Hypervisors, VM Management \nWeb: REST, SOAP, HTTP, JSON, XML \nBig Data: Hadoop techniques, Kafka/Storm, Graph, Cassandra, NOSQL \nMulti-core CPU (network processors) for line card designs, high speed forwarding & switching \nProven user centric, system level design and architecture skills \nTrailblazers in network deployment with countless customer success engagements Experience Director of Engineering, Network Security and Threat Defense Group Cisco July 2014  – Present (1 year 2 months) San Francisco Bay Area Overall, 10+ years of line management and senior management experience, last 3 years as a Director in Enterprise Network Security, handling multiple areas of product definition, development, test and delivery on Enterprise Class Routers (ISR and ASR lines), totaling ~200 engineers and $800M run-rate revenue, demonstrating leadership and operational excellence in these primary areas of responsibility: \n \nSecure LAN, WAN Connectivity and Threat Defense on ISR and ASR1K routers covering foundational technology capability such as: \n \n-\tPKI, SSL/TLS, X509 Certificate Authority, IPSEC and MACSec encryption \n-\tHardware Crypto Engines from Intel, AMD, Cavium and ARM \n-\tVarious NVF in Cloud Web Security solutions, data protection, VPN and Cloud-delivered VPN \n-\tIntrusion Detection/Prevention System (IDS/IPS), including virtualized solution based on Open Snort and SourceFire \n-\tAdvanced (NG) Firewall, WebCat (reputation) URL Filtering, Malware and Virus protection, Sandbox, NAT, Segmentation, Identity and Access and Policy Control – creating a full-stack Unified Threat Defense portfolio \n-\tThreat Information Big Data Analytics, Graph Visualization and Event Management (SIEM) \n \n \nUnified Collaborations and Communications portfolio: \n \n-\tSession Border Controller (SBC) with high-speed forwarding \n-\tCloud delivered SBC and SIP Proxy \n-\tCall Control Agents \n-\tMGCP/SIP/H323 VoIP Gateways with TDM Digital and Analog CO/PBX Interfaces \n-\tDigital Signal Processing for Transcoding and Conferencing Codecs (G711, G723, G729, Wideband audio and several video codecs such as H264) \n-\tIP Phones \n \nInternet of Things product portfolio including compute environment for cisco \"fog computing\", data analytics and virtual cloud connectors for manufacturing floors and transportation industry. Director of Engineering, Enterprise Networking Group Cisco Systems July 2013  – Present (2 years 2 months) Product lead for Voice/Video/VoIP Gateways, SIP Proxy Servers, Unified Communication, Hosted/Cloud Collaboration, Session Border Controller (SBC), Media Gateways, DSP, Modular Interfaces for Routers/Gateways \n \nISR G1/G2 and ASR1K \n \nIncubator of Internet of Things Application Framework and Delivery Senior Software Engineering Manager Cisco Systems, Inc. 2002  – Present (13 years) Voice/Video Technology, Unified Communication, VoIP, Signaling, TDM, IP PBX Engineering Manager Cisco Systems 2000  –  2002  (2 years) San Jose VoFR, VoATM, Multi-service Access Router Sr. Software Engineer Cisco Systems 1997  –  2000  (3 years) Software Engineer Ardent Communications, Cisco Acquisition June 1997  –  August 1997  (3 months) Software Engineer Octel Communications, Lucent Acquisition 1992  –  1997  (5 years) Director of Engineering, Network Security and Threat Defense Group Cisco July 2014  – Present (1 year 2 months) San Francisco Bay Area Overall, 10+ years of line management and senior management experience, last 3 years as a Director in Enterprise Network Security, handling multiple areas of product definition, development, test and delivery on Enterprise Class Routers (ISR and ASR lines), totaling ~200 engineers and $800M run-rate revenue, demonstrating leadership and operational excellence in these primary areas of responsibility: \n \nSecure LAN, WAN Connectivity and Threat Defense on ISR and ASR1K routers covering foundational technology capability such as: \n \n-\tPKI, SSL/TLS, X509 Certificate Authority, IPSEC and MACSec encryption \n-\tHardware Crypto Engines from Intel, AMD, Cavium and ARM \n-\tVarious NVF in Cloud Web Security solutions, data protection, VPN and Cloud-delivered VPN \n-\tIntrusion Detection/Prevention System (IDS/IPS), including virtualized solution based on Open Snort and SourceFire \n-\tAdvanced (NG) Firewall, WebCat (reputation) URL Filtering, Malware and Virus protection, Sandbox, NAT, Segmentation, Identity and Access and Policy Control – creating a full-stack Unified Threat Defense portfolio \n-\tThreat Information Big Data Analytics, Graph Visualization and Event Management (SIEM) \n \n \nUnified Collaborations and Communications portfolio: \n \n-\tSession Border Controller (SBC) with high-speed forwarding \n-\tCloud delivered SBC and SIP Proxy \n-\tCall Control Agents \n-\tMGCP/SIP/H323 VoIP Gateways with TDM Digital and Analog CO/PBX Interfaces \n-\tDigital Signal Processing for Transcoding and Conferencing Codecs (G711, G723, G729, Wideband audio and several video codecs such as H264) \n-\tIP Phones \n \nInternet of Things product portfolio including compute environment for cisco \"fog computing\", data analytics and virtual cloud connectors for manufacturing floors and transportation industry. Director of Engineering, Network Security and Threat Defense Group Cisco July 2014  – Present (1 year 2 months) San Francisco Bay Area Overall, 10+ years of line management and senior management experience, last 3 years as a Director in Enterprise Network Security, handling multiple areas of product definition, development, test and delivery on Enterprise Class Routers (ISR and ASR lines), totaling ~200 engineers and $800M run-rate revenue, demonstrating leadership and operational excellence in these primary areas of responsibility: \n \nSecure LAN, WAN Connectivity and Threat Defense on ISR and ASR1K routers covering foundational technology capability such as: \n \n-\tPKI, SSL/TLS, X509 Certificate Authority, IPSEC and MACSec encryption \n-\tHardware Crypto Engines from Intel, AMD, Cavium and ARM \n-\tVarious NVF in Cloud Web Security solutions, data protection, VPN and Cloud-delivered VPN \n-\tIntrusion Detection/Prevention System (IDS/IPS), including virtualized solution based on Open Snort and SourceFire \n-\tAdvanced (NG) Firewall, WebCat (reputation) URL Filtering, Malware and Virus protection, Sandbox, NAT, Segmentation, Identity and Access and Policy Control – creating a full-stack Unified Threat Defense portfolio \n-\tThreat Information Big Data Analytics, Graph Visualization and Event Management (SIEM) \n \n \nUnified Collaborations and Communications portfolio: \n \n-\tSession Border Controller (SBC) with high-speed forwarding \n-\tCloud delivered SBC and SIP Proxy \n-\tCall Control Agents \n-\tMGCP/SIP/H323 VoIP Gateways with TDM Digital and Analog CO/PBX Interfaces \n-\tDigital Signal Processing for Transcoding and Conferencing Codecs (G711, G723, G729, Wideband audio and several video codecs such as H264) \n-\tIP Phones \n \nInternet of Things product portfolio including compute environment for cisco \"fog computing\", data analytics and virtual cloud connectors for manufacturing floors and transportation industry. Director of Engineering, Enterprise Networking Group Cisco Systems July 2013  – Present (2 years 2 months) Product lead for Voice/Video/VoIP Gateways, SIP Proxy Servers, Unified Communication, Hosted/Cloud Collaboration, Session Border Controller (SBC), Media Gateways, DSP, Modular Interfaces for Routers/Gateways \n \nISR G1/G2 and ASR1K \n \nIncubator of Internet of Things Application Framework and Delivery Director of Engineering, Enterprise Networking Group Cisco Systems July 2013  – Present (2 years 2 months) Product lead for Voice/Video/VoIP Gateways, SIP Proxy Servers, Unified Communication, Hosted/Cloud Collaboration, Session Border Controller (SBC), Media Gateways, DSP, Modular Interfaces for Routers/Gateways \n \nISR G1/G2 and ASR1K \n \nIncubator of Internet of Things Application Framework and Delivery Senior Software Engineering Manager Cisco Systems, Inc. 2002  – Present (13 years) Voice/Video Technology, Unified Communication, VoIP, Signaling, TDM, IP PBX Senior Software Engineering Manager Cisco Systems, Inc. 2002  – Present (13 years) Voice/Video Technology, Unified Communication, VoIP, Signaling, TDM, IP PBX Engineering Manager Cisco Systems 2000  –  2002  (2 years) San Jose VoFR, VoATM, Multi-service Access Router Engineering Manager Cisco Systems 2000  –  2002  (2 years) San Jose VoFR, VoATM, Multi-service Access Router Sr. Software Engineer Cisco Systems 1997  –  2000  (3 years) Sr. Software Engineer Cisco Systems 1997  –  2000  (3 years) Software Engineer Ardent Communications, Cisco Acquisition June 1997  –  August 1997  (3 months) Software Engineer Ardent Communications, Cisco Acquisition June 1997  –  August 1997  (3 months) Software Engineer Octel Communications, Lucent Acquisition 1992  –  1997  (5 years) Software Engineer Octel Communications, Lucent Acquisition 1992  –  1997  (5 years) Skills H.323 SIP VoIP Router Platform Designs... Multicore Forwarding CPU CPU Architecture TDM Systems Customer Focus and... Team Builder Routing MGCP QoS Cisco Technologies Routers MPLS Virtualization Cisco Call Manager Security Networking Ethernet Switches Unified Communications Team Building VPN Product Management TCP/IP Telephony IP Network Architecture Cisco IOS IPv6 Routing Protocols Cloud Computing Software Engineering Linux WAN Distributed Systems RTP Unix Device Drivers Network Design Telecommunications Network Engineering High Availability See 29+     See less Skills  H.323 SIP VoIP Router Platform Designs... Multicore Forwarding CPU CPU Architecture TDM Systems Customer Focus and... Team Builder Routing MGCP QoS Cisco Technologies Routers MPLS Virtualization Cisco Call Manager Security Networking Ethernet Switches Unified Communications Team Building VPN Product Management TCP/IP Telephony IP Network Architecture Cisco IOS IPv6 Routing Protocols Cloud Computing Software Engineering Linux WAN Distributed Systems RTP Unix Device Drivers Network Design Telecommunications Network Engineering High Availability See 29+     See less H.323 SIP VoIP Router Platform Designs... Multicore Forwarding CPU CPU Architecture TDM Systems Customer Focus and... Team Builder Routing MGCP QoS Cisco Technologies Routers MPLS Virtualization Cisco Call Manager Security Networking Ethernet Switches Unified Communications Team Building VPN Product Management TCP/IP Telephony IP Network Architecture Cisco IOS IPv6 Routing Protocols Cloud Computing Software Engineering Linux WAN Distributed Systems RTP Unix Device Drivers Network Design Telecommunications Network Engineering High Availability See 29+     See less H.323 SIP VoIP Router Platform Designs... Multicore Forwarding CPU CPU Architecture TDM Systems Customer Focus and... Team Builder Routing MGCP QoS Cisco Technologies Routers MPLS Virtualization Cisco Call Manager Security Networking Ethernet Switches Unified Communications Team Building VPN Product Management TCP/IP Telephony IP Network Architecture Cisco IOS IPv6 Routing Protocols Cloud Computing Software Engineering Linux WAN Distributed Systems RTP Unix Device Drivers Network Design Telecommunications Network Engineering High Availability See 29+     See less Education California Polytechnic State University-San Luis Obispo Master of Science,  Computer Science University of California, Davis Bachelor of Science,  Computer Science California Polytechnic State University-San Luis Obispo Master of Science,  Computer Science California Polytechnic State University-San Luis Obispo Master of Science,  Computer Science California Polytechnic State University-San Luis Obispo Master of Science,  Computer Science University of California, Davis Bachelor of Science,  Computer Science University of California, Davis Bachelor of Science,  Computer Science University of California, Davis Bachelor of Science,  Computer Science ", "Summary I have a unique combination of deep technical knowledge, the ability to find creative solutions to complex problems, and an understanding of how businesses operate and their needs. I use these skills to develop strategies for success. Summary I have a unique combination of deep technical knowledge, the ability to find creative solutions to complex problems, and an understanding of how businesses operate and their needs. I use these skills to develop strategies for success. I have a unique combination of deep technical knowledge, the ability to find creative solutions to complex problems, and an understanding of how businesses operate and their needs. I use these skills to develop strategies for success. I have a unique combination of deep technical knowledge, the ability to find creative solutions to complex problems, and an understanding of how businesses operate and their needs. I use these skills to develop strategies for success. Experience Director of Strategy & Operations, WW Systems Engineering and Technology Cisco June 2015  – Present (3 months) Greater St. Louis Area Senior Systems Engineering Manager Cisco Systems May 2012  – Present (3 years 4 months) Greater St. Louis Area Systems Engineering Manager Cisco Systems October 2009  –  May 2012  (2 years 8 months) As a Systems Engineering Manager at Cisco, I lead a diverse team of engineers across four states and six cities. I have developed skills in bringing teams of individuals, who are separated by great distances, together through technology to work towards common goals. I currently manage a team responsible for $80 Million+ in annual revenue. Bringing together multiple business units, to resolve critical customer technical issues is another critical component of my role. Additionally, I'm responsible for reviewing and analyzing metrics such as customer satisfaction, resource utilization, and pipeline to identify trends. Systems Engineer Cisco Systems May 2005  –  October 2009  (4 years 6 months) Developed solutions to solve complex business problems and meet technical requirements. Developed relationship as trusted advisor relationship with key customers. Mentored partner pre-sales SEs to develop Cisco sales skills. Developed multiple partners and resellers in Unified Communications. Worked with partner executives to improve the profitability of projects and decrease risk. Created on-boarding training materials for new pre-sales and post-sales partner engineers. Worked with Cisco development teams to resolve problems identified in service provider labs. Developed relationships with service provider engineering teams and worked on inserting Cisco technology into their environment. Sr. Systems Engineer Alexander Open Systems June 2002  –  May 2005  (3 years) Field engineer specializing in Unified Communications and Information Security. Led teams of field engineers on Information Security and Unified Communications Projects. Learned problem solving and maintaining composure under extreme distress Director of Operations Bridge Dialog January 2002  –  May 2002  (5 months) Responsible for developing and managing online operations for an organization that specialized in VXML application development and delivery. Network Engineer Geo Access 2001  –  2002  (1 year) Network Engineer NetSales 2000  –  2001  (1 year) Director of Strategy & Operations, WW Systems Engineering and Technology Cisco June 2015  – Present (3 months) Greater St. Louis Area Director of Strategy & Operations, WW Systems Engineering and Technology Cisco June 2015  – Present (3 months) Greater St. Louis Area Senior Systems Engineering Manager Cisco Systems May 2012  – Present (3 years 4 months) Greater St. Louis Area Senior Systems Engineering Manager Cisco Systems May 2012  – Present (3 years 4 months) Greater St. Louis Area Systems Engineering Manager Cisco Systems October 2009  –  May 2012  (2 years 8 months) As a Systems Engineering Manager at Cisco, I lead a diverse team of engineers across four states and six cities. I have developed skills in bringing teams of individuals, who are separated by great distances, together through technology to work towards common goals. I currently manage a team responsible for $80 Million+ in annual revenue. Bringing together multiple business units, to resolve critical customer technical issues is another critical component of my role. Additionally, I'm responsible for reviewing and analyzing metrics such as customer satisfaction, resource utilization, and pipeline to identify trends. Systems Engineering Manager Cisco Systems October 2009  –  May 2012  (2 years 8 months) As a Systems Engineering Manager at Cisco, I lead a diverse team of engineers across four states and six cities. I have developed skills in bringing teams of individuals, who are separated by great distances, together through technology to work towards common goals. I currently manage a team responsible for $80 Million+ in annual revenue. Bringing together multiple business units, to resolve critical customer technical issues is another critical component of my role. Additionally, I'm responsible for reviewing and analyzing metrics such as customer satisfaction, resource utilization, and pipeline to identify trends. Systems Engineer Cisco Systems May 2005  –  October 2009  (4 years 6 months) Developed solutions to solve complex business problems and meet technical requirements. Developed relationship as trusted advisor relationship with key customers. Mentored partner pre-sales SEs to develop Cisco sales skills. Developed multiple partners and resellers in Unified Communications. Worked with partner executives to improve the profitability of projects and decrease risk. Created on-boarding training materials for new pre-sales and post-sales partner engineers. Worked with Cisco development teams to resolve problems identified in service provider labs. Developed relationships with service provider engineering teams and worked on inserting Cisco technology into their environment. Systems Engineer Cisco Systems May 2005  –  October 2009  (4 years 6 months) Developed solutions to solve complex business problems and meet technical requirements. Developed relationship as trusted advisor relationship with key customers. Mentored partner pre-sales SEs to develop Cisco sales skills. Developed multiple partners and resellers in Unified Communications. Worked with partner executives to improve the profitability of projects and decrease risk. Created on-boarding training materials for new pre-sales and post-sales partner engineers. Worked with Cisco development teams to resolve problems identified in service provider labs. Developed relationships with service provider engineering teams and worked on inserting Cisco technology into their environment. Sr. Systems Engineer Alexander Open Systems June 2002  –  May 2005  (3 years) Field engineer specializing in Unified Communications and Information Security. Led teams of field engineers on Information Security and Unified Communications Projects. Learned problem solving and maintaining composure under extreme distress Sr. Systems Engineer Alexander Open Systems June 2002  –  May 2005  (3 years) Field engineer specializing in Unified Communications and Information Security. Led teams of field engineers on Information Security and Unified Communications Projects. Learned problem solving and maintaining composure under extreme distress Director of Operations Bridge Dialog January 2002  –  May 2002  (5 months) Responsible for developing and managing online operations for an organization that specialized in VXML application development and delivery. Director of Operations Bridge Dialog January 2002  –  May 2002  (5 months) Responsible for developing and managing online operations for an organization that specialized in VXML application development and delivery. Network Engineer Geo Access 2001  –  2002  (1 year) Network Engineer Geo Access 2001  –  2002  (1 year) Network Engineer NetSales 2000  –  2001  (1 year) Network Engineer NetSales 2000  –  2001  (1 year) Skills Virtual Teams Cross-functional Team... Project Management Cisco Technologies Unified Communications Data Center Cloud Computing Network Design Network Architecture Getting The Job Done Leadership Creativity Public Speaking QoS Solution Selling Routing WAN Strategy Virtualization Networking IP Management CCNP Switches Firewalls Software Development Pre-sales Cisco IOS VoIP MPLS Wireless Security Ethernet See 18+     See less Skills  Virtual Teams Cross-functional Team... Project Management Cisco Technologies Unified Communications Data Center Cloud Computing Network Design Network Architecture Getting The Job Done Leadership Creativity Public Speaking QoS Solution Selling Routing WAN Strategy Virtualization Networking IP Management CCNP Switches Firewalls Software Development Pre-sales Cisco IOS VoIP MPLS Wireless Security Ethernet See 18+     See less Virtual Teams Cross-functional Team... Project Management Cisco Technologies Unified Communications Data Center Cloud Computing Network Design Network Architecture Getting The Job Done Leadership Creativity Public Speaking QoS Solution Selling Routing WAN Strategy Virtualization Networking IP Management CCNP Switches Firewalls Software Development Pre-sales Cisco IOS VoIP MPLS Wireless Security Ethernet See 18+     See less Virtual Teams Cross-functional Team... Project Management Cisco Technologies Unified Communications Data Center Cloud Computing Network Design Network Architecture Getting The Job Done Leadership Creativity Public Speaking QoS Solution Selling Routing WAN Strategy Virtualization Networking IP Management CCNP Switches Firewalls Software Development Pre-sales Cisco IOS VoIP MPLS Wireless Security Ethernet See 18+     See less Education University of Missouri-Saint Louis Masters of Business Administration,  Masters of Business Administration 2010  – 2012 The University of Kansas Mathematics 1995  – 1998 MidAmerica Nazarene University BA,  Management and Human Relations University of Missouri-Saint Louis Masters of Business Administration,  Masters of Business Administration 2010  – 2012 University of Missouri-Saint Louis Masters of Business Administration,  Masters of Business Administration 2010  – 2012 University of Missouri-Saint Louis Masters of Business Administration,  Masters of Business Administration 2010  – 2012 The University of Kansas Mathematics 1995  – 1998 The University of Kansas Mathematics 1995  – 1998 The University of Kansas Mathematics 1995  – 1998 MidAmerica Nazarene University BA,  Management and Human Relations MidAmerica Nazarene University BA,  Management and Human Relations MidAmerica Nazarene University BA,  Management and Human Relations ", "Summary 13+ years of combined work experience in product development and engineering management. Currently, as an Sr. H/W Engineering Manager at Cisco Systems. \n \nI have wide range of knowledge in optical communication, media technology, hardware design and testing, software architecture design, real-time OS and embedded firmware development. Furthermore, I also have profound insight on CATV transmission system architecture and future technology trend. \n \n10+ years project management experience. I managed multiple projects, from concept to manufacturing launch. I am proficient in oversea project planning, scheduling and execution. Offering outstanding talents in resource loading, resource leveling, team building, team consensus, employee coaching, budget management, and customer/vendor relationship. \n \nHigh efficiency and hands-on practice are my working principles. Self-motivation and being a team player are my basic profession attitude. I am a decisive and yet creative thinker; action-oriented and results-focused; driven by new challenges and desire to be successful in endeavors. \n \nVision + Execution  \nPassionate + Persistent + Proud Summary 13+ years of combined work experience in product development and engineering management. Currently, as an Sr. H/W Engineering Manager at Cisco Systems. \n \nI have wide range of knowledge in optical communication, media technology, hardware design and testing, software architecture design, real-time OS and embedded firmware development. Furthermore, I also have profound insight on CATV transmission system architecture and future technology trend. \n \n10+ years project management experience. I managed multiple projects, from concept to manufacturing launch. I am proficient in oversea project planning, scheduling and execution. Offering outstanding talents in resource loading, resource leveling, team building, team consensus, employee coaching, budget management, and customer/vendor relationship. \n \nHigh efficiency and hands-on practice are my working principles. Self-motivation and being a team player are my basic profession attitude. I am a decisive and yet creative thinker; action-oriented and results-focused; driven by new challenges and desire to be successful in endeavors. \n \nVision + Execution  \nPassionate + Persistent + Proud 13+ years of combined work experience in product development and engineering management. Currently, as an Sr. H/W Engineering Manager at Cisco Systems. \n \nI have wide range of knowledge in optical communication, media technology, hardware design and testing, software architecture design, real-time OS and embedded firmware development. Furthermore, I also have profound insight on CATV transmission system architecture and future technology trend. \n \n10+ years project management experience. I managed multiple projects, from concept to manufacturing launch. I am proficient in oversea project planning, scheduling and execution. Offering outstanding talents in resource loading, resource leveling, team building, team consensus, employee coaching, budget management, and customer/vendor relationship. \n \nHigh efficiency and hands-on practice are my working principles. Self-motivation and being a team player are my basic profession attitude. I am a decisive and yet creative thinker; action-oriented and results-focused; driven by new challenges and desire to be successful in endeavors. \n \nVision + Execution  \nPassionate + Persistent + Proud 13+ years of combined work experience in product development and engineering management. Currently, as an Sr. H/W Engineering Manager at Cisco Systems. \n \nI have wide range of knowledge in optical communication, media technology, hardware design and testing, software architecture design, real-time OS and embedded firmware development. Furthermore, I also have profound insight on CATV transmission system architecture and future technology trend. \n \n10+ years project management experience. I managed multiple projects, from concept to manufacturing launch. I am proficient in oversea project planning, scheduling and execution. Offering outstanding talents in resource loading, resource leveling, team building, team consensus, employee coaching, budget management, and customer/vendor relationship. \n \nHigh efficiency and hands-on practice are my working principles. Self-motivation and being a team player are my basic profession attitude. I am a decisive and yet creative thinker; action-oriented and results-focused; driven by new challenges and desire to be successful in endeavors. \n \nVision + Execution  \nPassionate + Persistent + Proud Experience Sr.Engineering Manager Cisco Systems June 2014  – Present (1 year 3 months) Shanghai City, China Hardware Development @ Common Hardware Group, Core Platforms Sr.Engineering Manager Cisco Systems July 2009  –  May 2014  (4 years 11 months) Shanghai City, China Hardware Development @ CABU, SPVTG Engineering Manager Cisco Systems March 2006  –  June 2009  (3 years 4 months) Shanghai City, China Hardware Development @ ANBU \nCisco Acquired Scientific Atlanta in Feb,2006 Engineering Manager Scientific Atlanta of Shanghai Co., Ltd June 2005  –  February 2006  (9 months) Shanghai City, China Sr. Hardware Engineer Scientific Atlanta of Shanghai Co., Ltd November 2003  –  May 2005  (1 year 7 months) Shanghai City, China Hardware Engineer Scientific Atlanta of Shanghai Co., Ltd October 2001  –  October 2003  (2 years 1 month) Shanghai City, China Sr.Engineering Manager Cisco Systems June 2014  – Present (1 year 3 months) Shanghai City, China Hardware Development @ Common Hardware Group, Core Platforms Sr.Engineering Manager Cisco Systems June 2014  – Present (1 year 3 months) Shanghai City, China Hardware Development @ Common Hardware Group, Core Platforms Sr.Engineering Manager Cisco Systems July 2009  –  May 2014  (4 years 11 months) Shanghai City, China Hardware Development @ CABU, SPVTG Sr.Engineering Manager Cisco Systems July 2009  –  May 2014  (4 years 11 months) Shanghai City, China Hardware Development @ CABU, SPVTG Engineering Manager Cisco Systems March 2006  –  June 2009  (3 years 4 months) Shanghai City, China Hardware Development @ ANBU \nCisco Acquired Scientific Atlanta in Feb,2006 Engineering Manager Cisco Systems March 2006  –  June 2009  (3 years 4 months) Shanghai City, China Hardware Development @ ANBU \nCisco Acquired Scientific Atlanta in Feb,2006 Engineering Manager Scientific Atlanta of Shanghai Co., Ltd June 2005  –  February 2006  (9 months) Shanghai City, China Engineering Manager Scientific Atlanta of Shanghai Co., Ltd June 2005  –  February 2006  (9 months) Shanghai City, China Sr. Hardware Engineer Scientific Atlanta of Shanghai Co., Ltd November 2003  –  May 2005  (1 year 7 months) Shanghai City, China Sr. Hardware Engineer Scientific Atlanta of Shanghai Co., Ltd November 2003  –  May 2005  (1 year 7 months) Shanghai City, China Hardware Engineer Scientific Atlanta of Shanghai Co., Ltd October 2001  –  October 2003  (2 years 1 month) Shanghai City, China Hardware Engineer Scientific Atlanta of Shanghai Co., Ltd October 2001  –  October 2003  (2 years 1 month) Shanghai City, China Skills Engineering Management Best Execution Motivated self-starter Leverage Resource System Architecture Technical Presentations New Product Launch New Business Development WiFi Product Development SIP Cloud Computing Product Management IP TCP/IP Wireless QoS Cross-functional Team... Ethernet Cisco Technologies Embedded Systems Routing SNMP Testing Integration See 10+     See less Skills  Engineering Management Best Execution Motivated self-starter Leverage Resource System Architecture Technical Presentations New Product Launch New Business Development WiFi Product Development SIP Cloud Computing Product Management IP TCP/IP Wireless QoS Cross-functional Team... Ethernet Cisco Technologies Embedded Systems Routing SNMP Testing Integration See 10+     See less Engineering Management Best Execution Motivated self-starter Leverage Resource System Architecture Technical Presentations New Product Launch New Business Development WiFi Product Development SIP Cloud Computing Product Management IP TCP/IP Wireless QoS Cross-functional Team... Ethernet Cisco Technologies Embedded Systems Routing SNMP Testing Integration See 10+     See less Engineering Management Best Execution Motivated self-starter Leverage Resource System Architecture Technical Presentations New Product Launch New Business Development WiFi Product Development SIP Cloud Computing Product Management IP TCP/IP Wireless QoS Cross-functional Team... Ethernet Cisco Technologies Embedded Systems Routing SNMP Testing Integration See 10+     See less Education Shanghai Jiao Tong University Master's degree,  Project Management 2006  – 2009 East China Normal University Bachelor's degree,  Optoelectronics Technology [Communication Engineering] 1997  – 2001 Excellent Thesis (Top5%) Shanghai Jiao Tong University Master's degree,  Project Management 2006  – 2009 Shanghai Jiao Tong University Master's degree,  Project Management 2006  – 2009 Shanghai Jiao Tong University Master's degree,  Project Management 2006  – 2009 East China Normal University Bachelor's degree,  Optoelectronics Technology [Communication Engineering] 1997  – 2001 Excellent Thesis (Top5%) East China Normal University Bachelor's degree,  Optoelectronics Technology [Communication Engineering] 1997  – 2001 Excellent Thesis (Top5%) East China Normal University Bachelor's degree,  Optoelectronics Technology [Communication Engineering] 1997  – 2001 Excellent Thesis (Top5%) ", "Skills Problem Solving Product Development Engineering Management Team Leadership Engineering Analysis Cost Reduction Leadership Product Design Program Management Engineering Semiconductors Routing Cisco Technologies Data Center Pro Engineer Manufacturing Mechanical Engineering Sheet Metal Manufacturing... Cross-functional Team... Product Lifecycle... Testing Six Sigma Design of Experiments PCB design Electronics See 11+     See less Skills  Problem Solving Product Development Engineering Management Team Leadership Engineering Analysis Cost Reduction Leadership Product Design Program Management Engineering Semiconductors Routing Cisco Technologies Data Center Pro Engineer Manufacturing Mechanical Engineering Sheet Metal Manufacturing... Cross-functional Team... Product Lifecycle... Testing Six Sigma Design of Experiments PCB design Electronics See 11+     See less Problem Solving Product Development Engineering Management Team Leadership Engineering Analysis Cost Reduction Leadership Product Design Program Management Engineering Semiconductors Routing Cisco Technologies Data Center Pro Engineer Manufacturing Mechanical Engineering Sheet Metal Manufacturing... Cross-functional Team... Product Lifecycle... Testing Six Sigma Design of Experiments PCB design Electronics See 11+     See less Problem Solving Product Development Engineering Management Team Leadership Engineering Analysis Cost Reduction Leadership Product Design Program Management Engineering Semiconductors Routing Cisco Technologies Data Center Pro Engineer Manufacturing Mechanical Engineering Sheet Metal Manufacturing... Cross-functional Team... Product Lifecycle... Testing Six Sigma Design of Experiments PCB design Electronics See 11+     See less ", "Skills Data Center Cisco Technologies Storage Area Networks Cloud Computing Network Architecture Virtualization Cisco UCS Routing Storage VMware Team Leadership Network Design Enterprise Solution... Channel Partner... Storage Virtualization Go-to-market Strategy Consulting FCoE IT as a Service VDI CCNP Telepresence Fibre Channel MPLS Unified Communications Big Data Analytics See 11+     See less Skills  Data Center Cisco Technologies Storage Area Networks Cloud Computing Network Architecture Virtualization Cisco UCS Routing Storage VMware Team Leadership Network Design Enterprise Solution... Channel Partner... Storage Virtualization Go-to-market Strategy Consulting FCoE IT as a Service VDI CCNP Telepresence Fibre Channel MPLS Unified Communications Big Data Analytics See 11+     See less Data Center Cisco Technologies Storage Area Networks Cloud Computing Network Architecture Virtualization Cisco UCS Routing Storage VMware Team Leadership Network Design Enterprise Solution... Channel Partner... Storage Virtualization Go-to-market Strategy Consulting FCoE IT as a Service VDI CCNP Telepresence Fibre Channel MPLS Unified Communications Big Data Analytics See 11+     See less Data Center Cisco Technologies Storage Area Networks Cloud Computing Network Architecture Virtualization Cisco UCS Routing Storage VMware Team Leadership Network Design Enterprise Solution... Channel Partner... Storage Virtualization Go-to-market Strategy Consulting FCoE IT as a Service VDI CCNP Telepresence Fibre Channel MPLS Unified Communications Big Data Analytics See 11+     See less ", "Experience Systems Engineering Manager, Security - SLED West Cisco July 2014  – Present (1 year 2 months) San Jose, CA Systems Engineering Manager, Enterprise Networking and Security - SLED West Cisco Systems February 2013  –  July 2014  (1 year 6 months) San Jose, CA Systems Engineering Manager, Borderless Networks Security and Unified Access - Federal Civilian Cisco Systems August 2012  –  February 2013  (7 months) San Jose, CA Systems Engineering Manager, Borderless Networks Content Security Cisco Systems January 2008  –  August 2012  (4 years 8 months) San Bruno, CA Systems Engineer, Western USA Cisco Systems June 2007  –  January 2008  (8 months) San Bruno, CA Systems Engineer, Western USA IronPort Systems April 2006  –  June 2007  (1 year 3 months) San Bruno, CA Lead, Customer Support Engineer IronPort Systems July 2004  –  April 2006  (1 year 10 months) System Administrator / Network Engineer Iron Speed, Inc. (formely Buckaroo.com) July 2000  –  July 2004  (4 years 1 month) Mountain View, CA Systems Engineering Manager, Security - SLED West Cisco July 2014  – Present (1 year 2 months) San Jose, CA Systems Engineering Manager, Security - SLED West Cisco July 2014  – Present (1 year 2 months) San Jose, CA Systems Engineering Manager, Enterprise Networking and Security - SLED West Cisco Systems February 2013  –  July 2014  (1 year 6 months) San Jose, CA Systems Engineering Manager, Enterprise Networking and Security - SLED West Cisco Systems February 2013  –  July 2014  (1 year 6 months) San Jose, CA Systems Engineering Manager, Borderless Networks Security and Unified Access - Federal Civilian Cisco Systems August 2012  –  February 2013  (7 months) San Jose, CA Systems Engineering Manager, Borderless Networks Security and Unified Access - Federal Civilian Cisco Systems August 2012  –  February 2013  (7 months) San Jose, CA Systems Engineering Manager, Borderless Networks Content Security Cisco Systems January 2008  –  August 2012  (4 years 8 months) San Bruno, CA Systems Engineering Manager, Borderless Networks Content Security Cisco Systems January 2008  –  August 2012  (4 years 8 months) San Bruno, CA Systems Engineer, Western USA Cisco Systems June 2007  –  January 2008  (8 months) San Bruno, CA Systems Engineer, Western USA Cisco Systems June 2007  –  January 2008  (8 months) San Bruno, CA Systems Engineer, Western USA IronPort Systems April 2006  –  June 2007  (1 year 3 months) San Bruno, CA Systems Engineer, Western USA IronPort Systems April 2006  –  June 2007  (1 year 3 months) San Bruno, CA Lead, Customer Support Engineer IronPort Systems July 2004  –  April 2006  (1 year 10 months) Lead, Customer Support Engineer IronPort Systems July 2004  –  April 2006  (1 year 10 months) System Administrator / Network Engineer Iron Speed, Inc. (formely Buckaroo.com) July 2000  –  July 2004  (4 years 1 month) Mountain View, CA System Administrator / Network Engineer Iron Speed, Inc. (formely Buckaroo.com) July 2000  –  July 2004  (4 years 1 month) Mountain View, CA Skills Skills     ", "Skills Unified Communications Routing Cisco Technologies Data Center Telepresence Network Architecture QoS Network Security MPLS CCNP Ethernet Team Leadership IP Switches VoIP Managed Services Cisco IOS Network Design Leadership See 4+     See less Skills  Unified Communications Routing Cisco Technologies Data Center Telepresence Network Architecture QoS Network Security MPLS CCNP Ethernet Team Leadership IP Switches VoIP Managed Services Cisco IOS Network Design Leadership See 4+     See less Unified Communications Routing Cisco Technologies Data Center Telepresence Network Architecture QoS Network Security MPLS CCNP Ethernet Team Leadership IP Switches VoIP Managed Services Cisco IOS Network Design Leadership See 4+     See less Unified Communications Routing Cisco Technologies Data Center Telepresence Network Architecture QoS Network Security MPLS CCNP Ethernet Team Leadership IP Switches VoIP Managed Services Cisco IOS Network Design Leadership See 4+     See less ", "Experience Senior Systems Engineering Manager Cisco Systems February 1999  – Present (16 years 7 months) Senior Systems Engineering Manager \nAir Force and Defense Headquarters Operation Systems Engineering Manager Cisco Systems November 2008  –  June 2011  (2 years 8 months) Orlando, Florida Area Systems Engineering Manager for the Department of Defense Operation covering the EMEA Region which consisted of all DoD business in Europe, Middle East and Africa. The regional also supported CENTCOM as well as it's subordinate commands (AFCENT, NAVCENT, ARCENT, MARCENT). Network Consulting Engineer (DoD Tech Lead) Cisco Systems January 2004  –  November 2008  (4 years 11 months) Orlando, Florida Area Responsible for the support and delivery of services to Cisco’s major Federal accounts. Helps set strategic direction for GGSG-AS best practices for network design and performance engineering. Provide backup support for other NCE accounts. Leverage and generate technical “best practices” white papers within virtual team. Provides training to other NCE’s as well as real-time escalation response for support issues. Cross functional contribution and impact with development engineering on product development and serviceability design. Technology Consultant AT&T October 2002  –  December 2003  (1 year 3 months) Orlando, Florida Area Provide engineering support for large Enterprise customers (Sears Roebuck, Morgan Stanley, Discover Card, Case New Holland, and Certegy). Provide all engineering design specifications, including detail logical and physical designs for transport and hardware procurement. Consulting support to both the presale organization and other design teams for existing and new network designs. Provide lifecycle account support by conducting network assessments, capacity planning, maintenance, detailed physical and logical design documentation. Act as an escalation point for the Managed Services Support Centers (MSSC) in troubleshooting production network issues. Technical Marketing Engineer Cisco Systems June 2002  –  October 2002  (5 months) Research Triangle Park, NC Primarily responsible for creating technical solutions, architectures and concepts to market Cisco Router technologies (primarily MPLS). Work with field and technology groups to define and drive technology agenda through customer interaction, technical collateral and assistance with critical account situations. Perform advanced competitive analysis, based on testing. Routing Protocols TAC Team Lead Cisco Systems May 2000  –  June 2002  (2 years 2 months) Research Triangle Park, NC Primary function as the team lead was to provide technical escalation for the Cisco TAC (Technical Assistance Center). Other responsibilities included working with both the Business Units on manufacturing issues and with Software Development on IOS issues. Led technical design/architecture reviews for large-scale network rollouts. Provided training, guidance and career development for a team of 15 engineers. Customer Support Engineer Cisco Systems April 1999  –  May 2000  (1 year 2 months) Research Triangle Park, NC Provided second line phone/email/fax consultation to troubleshoot complex network systems problems. Managed workload and other assignments efficiently while being able to resolve time-critical situations reliably and professionally. Acted as a focal point for large accounts during problem resolution. Provided systems/product training and also helped mentor other engineers. Utilized test equipment for simulations of real customer’s problems. Helped document problems and solutions on case notes and bug reports. Senior Systems Engineering Manager Cisco Systems February 1999  – Present (16 years 7 months) Senior Systems Engineering Manager \nAir Force and Defense Headquarters Operation Senior Systems Engineering Manager Cisco Systems February 1999  – Present (16 years 7 months) Senior Systems Engineering Manager \nAir Force and Defense Headquarters Operation Systems Engineering Manager Cisco Systems November 2008  –  June 2011  (2 years 8 months) Orlando, Florida Area Systems Engineering Manager for the Department of Defense Operation covering the EMEA Region which consisted of all DoD business in Europe, Middle East and Africa. The regional also supported CENTCOM as well as it's subordinate commands (AFCENT, NAVCENT, ARCENT, MARCENT). Systems Engineering Manager Cisco Systems November 2008  –  June 2011  (2 years 8 months) Orlando, Florida Area Systems Engineering Manager for the Department of Defense Operation covering the EMEA Region which consisted of all DoD business in Europe, Middle East and Africa. The regional also supported CENTCOM as well as it's subordinate commands (AFCENT, NAVCENT, ARCENT, MARCENT). Network Consulting Engineer (DoD Tech Lead) Cisco Systems January 2004  –  November 2008  (4 years 11 months) Orlando, Florida Area Responsible for the support and delivery of services to Cisco’s major Federal accounts. Helps set strategic direction for GGSG-AS best practices for network design and performance engineering. Provide backup support for other NCE accounts. Leverage and generate technical “best practices” white papers within virtual team. Provides training to other NCE’s as well as real-time escalation response for support issues. Cross functional contribution and impact with development engineering on product development and serviceability design. Network Consulting Engineer (DoD Tech Lead) Cisco Systems January 2004  –  November 2008  (4 years 11 months) Orlando, Florida Area Responsible for the support and delivery of services to Cisco’s major Federal accounts. Helps set strategic direction for GGSG-AS best practices for network design and performance engineering. Provide backup support for other NCE accounts. Leverage and generate technical “best practices” white papers within virtual team. Provides training to other NCE’s as well as real-time escalation response for support issues. Cross functional contribution and impact with development engineering on product development and serviceability design. Technology Consultant AT&T October 2002  –  December 2003  (1 year 3 months) Orlando, Florida Area Provide engineering support for large Enterprise customers (Sears Roebuck, Morgan Stanley, Discover Card, Case New Holland, and Certegy). Provide all engineering design specifications, including detail logical and physical designs for transport and hardware procurement. Consulting support to both the presale organization and other design teams for existing and new network designs. Provide lifecycle account support by conducting network assessments, capacity planning, maintenance, detailed physical and logical design documentation. Act as an escalation point for the Managed Services Support Centers (MSSC) in troubleshooting production network issues. Technology Consultant AT&T October 2002  –  December 2003  (1 year 3 months) Orlando, Florida Area Provide engineering support for large Enterprise customers (Sears Roebuck, Morgan Stanley, Discover Card, Case New Holland, and Certegy). Provide all engineering design specifications, including detail logical and physical designs for transport and hardware procurement. Consulting support to both the presale organization and other design teams for existing and new network designs. Provide lifecycle account support by conducting network assessments, capacity planning, maintenance, detailed physical and logical design documentation. Act as an escalation point for the Managed Services Support Centers (MSSC) in troubleshooting production network issues. Technical Marketing Engineer Cisco Systems June 2002  –  October 2002  (5 months) Research Triangle Park, NC Primarily responsible for creating technical solutions, architectures and concepts to market Cisco Router technologies (primarily MPLS). Work with field and technology groups to define and drive technology agenda through customer interaction, technical collateral and assistance with critical account situations. Perform advanced competitive analysis, based on testing. Technical Marketing Engineer Cisco Systems June 2002  –  October 2002  (5 months) Research Triangle Park, NC Primarily responsible for creating technical solutions, architectures and concepts to market Cisco Router technologies (primarily MPLS). Work with field and technology groups to define and drive technology agenda through customer interaction, technical collateral and assistance with critical account situations. Perform advanced competitive analysis, based on testing. Routing Protocols TAC Team Lead Cisco Systems May 2000  –  June 2002  (2 years 2 months) Research Triangle Park, NC Primary function as the team lead was to provide technical escalation for the Cisco TAC (Technical Assistance Center). Other responsibilities included working with both the Business Units on manufacturing issues and with Software Development on IOS issues. Led technical design/architecture reviews for large-scale network rollouts. Provided training, guidance and career development for a team of 15 engineers. Routing Protocols TAC Team Lead Cisco Systems May 2000  –  June 2002  (2 years 2 months) Research Triangle Park, NC Primary function as the team lead was to provide technical escalation for the Cisco TAC (Technical Assistance Center). Other responsibilities included working with both the Business Units on manufacturing issues and with Software Development on IOS issues. Led technical design/architecture reviews for large-scale network rollouts. Provided training, guidance and career development for a team of 15 engineers. Customer Support Engineer Cisco Systems April 1999  –  May 2000  (1 year 2 months) Research Triangle Park, NC Provided second line phone/email/fax consultation to troubleshoot complex network systems problems. Managed workload and other assignments efficiently while being able to resolve time-critical situations reliably and professionally. Acted as a focal point for large accounts during problem resolution. Provided systems/product training and also helped mentor other engineers. Utilized test equipment for simulations of real customer’s problems. Helped document problems and solutions on case notes and bug reports. Customer Support Engineer Cisco Systems April 1999  –  May 2000  (1 year 2 months) Research Triangle Park, NC Provided second line phone/email/fax consultation to troubleshoot complex network systems problems. Managed workload and other assignments efficiently while being able to resolve time-critical situations reliably and professionally. Acted as a focal point for large accounts during problem resolution. Provided systems/product training and also helped mentor other engineers. Utilized test equipment for simulations of real customer’s problems. Helped document problems and solutions on case notes and bug reports. Skills CCIE R&S Routing Protocols Router Architecture SE Developement Tactical Military... Architectural Selling Enterprise Architectures Service Provider... Transformational... OSPF Network Architecture Cisco Technologies Data Center CCIE Unified Communications Network Design Routing Enterprise Architecture Troubleshooting Cloud Computing Switches CCNP WAN Managed Services Cross-functional Team... QoS Networking BGP Pre-sales IP Network Security Network Engineering Cisco IOS See 18+     See less Skills  CCIE R&S Routing Protocols Router Architecture SE Developement Tactical Military... Architectural Selling Enterprise Architectures Service Provider... Transformational... OSPF Network Architecture Cisco Technologies Data Center CCIE Unified Communications Network Design Routing Enterprise Architecture Troubleshooting Cloud Computing Switches CCNP WAN Managed Services Cross-functional Team... QoS Networking BGP Pre-sales IP Network Security Network Engineering Cisco IOS See 18+     See less CCIE R&S Routing Protocols Router Architecture SE Developement Tactical Military... Architectural Selling Enterprise Architectures Service Provider... Transformational... OSPF Network Architecture Cisco Technologies Data Center CCIE Unified Communications Network Design Routing Enterprise Architecture Troubleshooting Cloud Computing Switches CCNP WAN Managed Services Cross-functional Team... QoS Networking BGP Pre-sales IP Network Security Network Engineering Cisco IOS See 18+     See less CCIE R&S Routing Protocols Router Architecture SE Developement Tactical Military... Architectural Selling Enterprise Architectures Service Provider... Transformational... OSPF Network Architecture Cisco Technologies Data Center CCIE Unified Communications Network Design Routing Enterprise Architecture Troubleshooting Cloud Computing Switches CCNP WAN Managed Services Cross-functional Team... QoS Networking BGP Pre-sales IP Network Security Network Engineering Cisco IOS See 18+     See less Education University of Central Florida Bachelor of Science, Electrical Engineering Technology,  Digital Design 1993  – 1996 University of Central Florida Bachelor of Science, Electrical Engineering Technology,  Digital Design 1993  – 1996 University of Central Florida Bachelor of Science, Electrical Engineering Technology,  Digital Design 1993  – 1996 University of Central Florida Bachelor of Science, Electrical Engineering Technology,  Digital Design 1993  – 1996 ", "Summary 20+ years of Systems Administration/Engineering/Management, Network Operations, and Data/Voice Communications. \n \n15+ years of Technical Consulting and Sales. \n \n10+ years of Personnel Recruiting and Management. \n \nExperience with top Financial, Legal, Manufacturing, Communications, and Service Provider (IT) companies. \n \nGraduate of Carnegie Mellon University. Summary 20+ years of Systems Administration/Engineering/Management, Network Operations, and Data/Voice Communications. \n \n15+ years of Technical Consulting and Sales. \n \n10+ years of Personnel Recruiting and Management. \n \nExperience with top Financial, Legal, Manufacturing, Communications, and Service Provider (IT) companies. \n \nGraduate of Carnegie Mellon University. 20+ years of Systems Administration/Engineering/Management, Network Operations, and Data/Voice Communications. \n \n15+ years of Technical Consulting and Sales. \n \n10+ years of Personnel Recruiting and Management. \n \nExperience with top Financial, Legal, Manufacturing, Communications, and Service Provider (IT) companies. \n \nGraduate of Carnegie Mellon University. 20+ years of Systems Administration/Engineering/Management, Network Operations, and Data/Voice Communications. \n \n15+ years of Technical Consulting and Sales. \n \n10+ years of Personnel Recruiting and Management. \n \nExperience with top Financial, Legal, Manufacturing, Communications, and Service Provider (IT) companies. \n \nGraduate of Carnegie Mellon University. Experience Senior Systems Engineering Manager Cisco Systems July 2014  – Present (1 year 2 months) Greater Philadelphia Area Senior SE Manager for the mobility operation within a sales area that covers one of the largest Wireless and Wireline service providers in the US. Systems Engineering Manager Cisco Systems January 2012  –  June 2014  (2 years 6 months) Greater Philadelphia Area SE Manager for a team of pre-sales engineers covering a large US mobile wireless Service Provider. Systems Engineering Manager Cisco Systems January 2008  –  December 2011  (4 years) SE Manager for a large IT group covering a major Service Provider (telecommunications) customer in the US. Consulting Systems Engineer Cisco Systems August 2001  –  December 2007  (6 years 5 months) Senior field engineer, specializing in NMS/OSS, assigned to sales support for major Wireless and Wireline Service Providers. Network Support Engineer Cisco Systems October 2000  –  July 2001  (10 months) Field engineer responsible for NMS/OSS work at major US Service Providers (telco and internet). Lead Analyst Siemens Medical Solutions September 1997  –  October 2000  (3 years 2 months) Developed, implemented and supported remote Enterprise Systems Management services for hospitals across the US. Supervisor of End User Services (IT) Sanofi Bio-Industries, Inc. October 1993  –  September 1997  (4 years) Managed the Help Desk, Network Operations, and IT Training staff for 8 locations in the US and Puerto Rico. Manager of End User Services SKW Nature Products 1995  –  1997  (2 years) Managed the Help Desk, Network Operations (Data/Voice), and IT Training staff for 8 locations in the US and Puerto Rico. Systems Programmer Becket and Watkins Law Offices February 1991  –  October 1993  (2 years 9 months) Provided network operations, database management, and help desk support. Senior Systems Engineering Manager Cisco Systems July 2014  – Present (1 year 2 months) Greater Philadelphia Area Senior SE Manager for the mobility operation within a sales area that covers one of the largest Wireless and Wireline service providers in the US. Senior Systems Engineering Manager Cisco Systems July 2014  – Present (1 year 2 months) Greater Philadelphia Area Senior SE Manager for the mobility operation within a sales area that covers one of the largest Wireless and Wireline service providers in the US. Systems Engineering Manager Cisco Systems January 2012  –  June 2014  (2 years 6 months) Greater Philadelphia Area SE Manager for a team of pre-sales engineers covering a large US mobile wireless Service Provider. Systems Engineering Manager Cisco Systems January 2012  –  June 2014  (2 years 6 months) Greater Philadelphia Area SE Manager for a team of pre-sales engineers covering a large US mobile wireless Service Provider. Systems Engineering Manager Cisco Systems January 2008  –  December 2011  (4 years) SE Manager for a large IT group covering a major Service Provider (telecommunications) customer in the US. Systems Engineering Manager Cisco Systems January 2008  –  December 2011  (4 years) SE Manager for a large IT group covering a major Service Provider (telecommunications) customer in the US. Consulting Systems Engineer Cisco Systems August 2001  –  December 2007  (6 years 5 months) Senior field engineer, specializing in NMS/OSS, assigned to sales support for major Wireless and Wireline Service Providers. Consulting Systems Engineer Cisco Systems August 2001  –  December 2007  (6 years 5 months) Senior field engineer, specializing in NMS/OSS, assigned to sales support for major Wireless and Wireline Service Providers. Network Support Engineer Cisco Systems October 2000  –  July 2001  (10 months) Field engineer responsible for NMS/OSS work at major US Service Providers (telco and internet). Network Support Engineer Cisco Systems October 2000  –  July 2001  (10 months) Field engineer responsible for NMS/OSS work at major US Service Providers (telco and internet). Lead Analyst Siemens Medical Solutions September 1997  –  October 2000  (3 years 2 months) Developed, implemented and supported remote Enterprise Systems Management services for hospitals across the US. Lead Analyst Siemens Medical Solutions September 1997  –  October 2000  (3 years 2 months) Developed, implemented and supported remote Enterprise Systems Management services for hospitals across the US. Supervisor of End User Services (IT) Sanofi Bio-Industries, Inc. October 1993  –  September 1997  (4 years) Managed the Help Desk, Network Operations, and IT Training staff for 8 locations in the US and Puerto Rico. Supervisor of End User Services (IT) Sanofi Bio-Industries, Inc. October 1993  –  September 1997  (4 years) Managed the Help Desk, Network Operations, and IT Training staff for 8 locations in the US and Puerto Rico. Manager of End User Services SKW Nature Products 1995  –  1997  (2 years) Managed the Help Desk, Network Operations (Data/Voice), and IT Training staff for 8 locations in the US and Puerto Rico. Manager of End User Services SKW Nature Products 1995  –  1997  (2 years) Managed the Help Desk, Network Operations (Data/Voice), and IT Training staff for 8 locations in the US and Puerto Rico. Systems Programmer Becket and Watkins Law Offices February 1991  –  October 1993  (2 years 9 months) Provided network operations, database management, and help desk support. Systems Programmer Becket and Watkins Law Offices February 1991  –  October 1993  (2 years 9 months) Provided network operations, database management, and help desk support. Skills Service Providers Cisco Technologies Telecommunications Cloud Computing Ethernet Computer Network... Unified Communications Data Center Network Administration Network Architecture QoS Wireless IP MPLS Pre-sales Skills  Service Providers Cisco Technologies Telecommunications Cloud Computing Ethernet Computer Network... Unified Communications Data Center Network Administration Network Architecture QoS Wireless IP MPLS Pre-sales Service Providers Cisco Technologies Telecommunications Cloud Computing Ethernet Computer Network... Unified Communications Data Center Network Administration Network Architecture QoS Wireless IP MPLS Pre-sales Service Providers Cisco Technologies Telecommunications Cloud Computing Ethernet Computer Network... Unified Communications Data Center Network Administration Network Architecture QoS Wireless IP MPLS Pre-sales Education Carnegie Mellon University Managerial Economics,  Information Systems 1986  – 1990 Activities and Societies:  Sigma Alpha Epsilon ,  Council of Fraternity Presidents ,  H&SS Student Advisory Board ,  Football ,  Rugby Carnegie Mellon University Managerial Economics,  Information Systems 1986  – 1990 Activities and Societies:  Sigma Alpha Epsilon ,  Council of Fraternity Presidents ,  H&SS Student Advisory Board ,  Football ,  Rugby Carnegie Mellon University Managerial Economics,  Information Systems 1986  – 1990 Activities and Societies:  Sigma Alpha Epsilon ,  Council of Fraternity Presidents ,  H&SS Student Advisory Board ,  Football ,  Rugby Carnegie Mellon University Managerial Economics,  Information Systems 1986  – 1990 Activities and Societies:  Sigma Alpha Epsilon ,  Council of Fraternity Presidents ,  H&SS Student Advisory Board ,  Football ,  Rugby ", "Summary CCIE #8107 (Routing & Switching, Security) \nCISSP #57480 Summary CCIE #8107 (Routing & Switching, Security) \nCISSP #57480 CCIE #8107 (Routing & Switching, Security) \nCISSP #57480 CCIE #8107 (Routing & Switching, Security) \nCISSP #57480 Experience Systems Engineering Manager Cisco Systems October 2013  – Present (1 year 11 months) Federal Healthcare Provider Region Consulting Systems Architect Cisco Systems August 2012  –  October 2013  (1 year 3 months) Federal Healthcare and Scientific Operation Systems Engineering Manager Cisco Systems January 2012  –  August 2012  (8 months) Federal Scientifc Region Consulting Systems Architect Cisco Systems August 2008  –  December 2011  (3 years 5 months) Consulting Systems Engineer Cisco Systems August 2002  –  December 2006  (4 years 5 months) Systems Engineer Cisco Systems October 1999  –  August 2002  (2 years 11 months) Systems Engineering Manager Cisco Systems October 2013  – Present (1 year 11 months) Federal Healthcare Provider Region Systems Engineering Manager Cisco Systems October 2013  – Present (1 year 11 months) Federal Healthcare Provider Region Consulting Systems Architect Cisco Systems August 2012  –  October 2013  (1 year 3 months) Federal Healthcare and Scientific Operation Consulting Systems Architect Cisco Systems August 2012  –  October 2013  (1 year 3 months) Federal Healthcare and Scientific Operation Systems Engineering Manager Cisco Systems January 2012  –  August 2012  (8 months) Federal Scientifc Region Systems Engineering Manager Cisco Systems January 2012  –  August 2012  (8 months) Federal Scientifc Region Consulting Systems Architect Cisco Systems August 2008  –  December 2011  (3 years 5 months) Consulting Systems Architect Cisco Systems August 2008  –  December 2011  (3 years 5 months) Consulting Systems Engineer Cisco Systems August 2002  –  December 2006  (4 years 5 months) Consulting Systems Engineer Cisco Systems August 2002  –  December 2006  (4 years 5 months) Systems Engineer Cisco Systems October 1999  –  August 2002  (2 years 11 months) Systems Engineer Cisco Systems October 1999  –  August 2002  (2 years 11 months) Skills Security CISSP CCIE CCNP Cloud Computing QoS Cisco Technologies Cisco IOS Data Center Firewalls Network Security Telepresence Enterprise Architecture VPN IP Virtualization Computer Security Routing Protocols Thought Leadership Selling OSPF IP Networking LAN Switching Cisco Security Cyber Security Federal Government Consultative Selling Photography Public Sector Office Space DMVPN Leadership Healthcare Information... Healthcare Routing Network Architecture Unified Communications Network Design See 23+     See less Skills  Security CISSP CCIE CCNP Cloud Computing QoS Cisco Technologies Cisco IOS Data Center Firewalls Network Security Telepresence Enterprise Architecture VPN IP Virtualization Computer Security Routing Protocols Thought Leadership Selling OSPF IP Networking LAN Switching Cisco Security Cyber Security Federal Government Consultative Selling Photography Public Sector Office Space DMVPN Leadership Healthcare Information... Healthcare Routing Network Architecture Unified Communications Network Design See 23+     See less Security CISSP CCIE CCNP Cloud Computing QoS Cisco Technologies Cisco IOS Data Center Firewalls Network Security Telepresence Enterprise Architecture VPN IP Virtualization Computer Security Routing Protocols Thought Leadership Selling OSPF IP Networking LAN Switching Cisco Security Cyber Security Federal Government Consultative Selling Photography Public Sector Office Space DMVPN Leadership Healthcare Information... Healthcare Routing Network Architecture Unified Communications Network Design See 23+     See less Security CISSP CCIE CCNP Cloud Computing QoS Cisco Technologies Cisco IOS Data Center Firewalls Network Security Telepresence Enterprise Architecture VPN IP Virtualization Computer Security Routing Protocols Thought Leadership Selling OSPF IP Networking LAN Switching Cisco Security Cyber Security Federal Government Consultative Selling Photography Public Sector Office Space DMVPN Leadership Healthcare Information... Healthcare Routing Network Architecture Unified Communications Network Design See 23+     See less Education University of Tennessee-Knoxville B.S. Business Administration,  Accounting 1989  – 1994 University of Tennessee-Knoxville B.S. Business Administration,  Accounting 1989  – 1994 University of Tennessee-Knoxville B.S. Business Administration,  Accounting 1989  – 1994 University of Tennessee-Knoxville B.S. Business Administration,  Accounting 1989  – 1994 ", "Skills Security Networking Routing Business Development Network Security Cisco Technologies Team Leadership Leadership Sales Wireless Networking Network Design Solution Selling Systems Engineering Wireless Cisco IOS Skills  Security Networking Routing Business Development Network Security Cisco Technologies Team Leadership Leadership Sales Wireless Networking Network Design Solution Selling Systems Engineering Wireless Cisco IOS Security Networking Routing Business Development Network Security Cisco Technologies Team Leadership Leadership Sales Wireless Networking Network Design Solution Selling Systems Engineering Wireless Cisco IOS Security Networking Routing Business Development Network Security Cisco Technologies Team Leadership Leadership Sales Wireless Networking Network Design Solution Selling Systems Engineering Wireless Cisco IOS ", "Summary I’m a Data Center Infrastructure Manager who responsibility is define, lead the infrastructure lab and virtualization related projects within the key CMBU engineering locations around the world, including San Jose, Seattle, India, Ireland and Shanghai. I’m also responsible for design, implement, and manage infrastructure projects, lab staffs, budget planning, and delivery all kind of challenging lab services to development and QA engineers, such as VDI environment, provide cloud, DMZ, HA virtualized test bed, automation in virtualization etc. Moreover, I’m leading a team who developed a in-house Cisco automation software called RAPID (Resource Automation & Productivity Integration Dashboard), which is a J2EE-based VM provisioning tool widely adopted by QA/Dev across different business units; streamlined the deployment and automated installation of Cisco products on more than 10,000 VMs. Summary I’m a Data Center Infrastructure Manager who responsibility is define, lead the infrastructure lab and virtualization related projects within the key CMBU engineering locations around the world, including San Jose, Seattle, India, Ireland and Shanghai. I’m also responsible for design, implement, and manage infrastructure projects, lab staffs, budget planning, and delivery all kind of challenging lab services to development and QA engineers, such as VDI environment, provide cloud, DMZ, HA virtualized test bed, automation in virtualization etc. Moreover, I’m leading a team who developed a in-house Cisco automation software called RAPID (Resource Automation & Productivity Integration Dashboard), which is a J2EE-based VM provisioning tool widely adopted by QA/Dev across different business units; streamlined the deployment and automated installation of Cisco products on more than 10,000 VMs. I’m a Data Center Infrastructure Manager who responsibility is define, lead the infrastructure lab and virtualization related projects within the key CMBU engineering locations around the world, including San Jose, Seattle, India, Ireland and Shanghai. I’m also responsible for design, implement, and manage infrastructure projects, lab staffs, budget planning, and delivery all kind of challenging lab services to development and QA engineers, such as VDI environment, provide cloud, DMZ, HA virtualized test bed, automation in virtualization etc. Moreover, I’m leading a team who developed a in-house Cisco automation software called RAPID (Resource Automation & Productivity Integration Dashboard), which is a J2EE-based VM provisioning tool widely adopted by QA/Dev across different business units; streamlined the deployment and automated installation of Cisco products on more than 10,000 VMs. I’m a Data Center Infrastructure Manager who responsibility is define, lead the infrastructure lab and virtualization related projects within the key CMBU engineering locations around the world, including San Jose, Seattle, India, Ireland and Shanghai. I’m also responsible for design, implement, and manage infrastructure projects, lab staffs, budget planning, and delivery all kind of challenging lab services to development and QA engineers, such as VDI environment, provide cloud, DMZ, HA virtualized test bed, automation in virtualization etc. Moreover, I’m leading a team who developed a in-house Cisco automation software called RAPID (Resource Automation & Productivity Integration Dashboard), which is a J2EE-based VM provisioning tool widely adopted by QA/Dev across different business units; streamlined the deployment and automated installation of Cisco products on more than 10,000 VMs. Experience Business Operations Manager Cisco May 2014  – Present (1 year 4 months) San Jose Engineering Manager Cisco September 2011  – Present (4 years) San Jose Software Engineering Manager Cisco October 2011  –  October 2013  (2 years 1 month) Milpitas, CA •\tResponsible for coordinating and driving the team to provide the lab infrastructure and service delivery for UCBU, utilizing virtualization, high availability, and other industry best practices. \n•\tDelivering high quality, state of the art virtual infrastructure, and take pride and ownership in the delivery of the environment. \n•\tCollaborate with other engineering teams to identify requirements and needs. \n•\tResponsible for managing lifecycle of lab and infrastructure, as well as future planning. Technical Lead Engineer Cisco December 2010  –  October 2011  (11 months) Milpitas, CA •\tBeing the team lead to execute lab and infrastructure projects. \n•\tParticipate an important role in designing and minimizing risk impacts on projects and programs  \n•\tContinuously lead the team to improve quality and service provided by our labs. \n•\tParticipate/Lead a team to develop an enterprise Java tool. Senior Software Development Engineer Cisco July 2005  –  December 2010  (5 years 6 months) Milpitas, CA •\tUse InstallAnywhere to design, develop, and enhance Installer for a variety of types of projects including release, upgrade, patch and hotfix. \n•\tMaking special system alterations by designing and developing InstallAnywhere custom code using Java, Perl and Shell script. \n•\tDesign and implement rollback strategy in InstallAnywhere to ensure complete system restore back to previous stage. \n•\tDevelop automated build scripts using Ant and mange daily build process among various projects to provide hands-free and on time installation packages efficiently.  \n•\tResponsible for versioning and labeling projects using ClearCase and Perforce to ensure software package accuracy and allow regeneration of software package from different timeframes.  \n•\tDesign and create customized RedHat Enterprise Linux Kickstart Installation disk. \n•\tGenerate customized system iso image by making and repackaging RPMs, and bundle them to the Linux Installation disk. \n•\tEnhance Linux system security by configuring firewall, SSH, & CSA (Cisco Security Agent). \n•\tCreate customized look-and-feel of the operating system by modifying boot-up options. \n•\tCreate and modify running Linux services to ensure system compatibility. \n•\tTroubleshoot application problems in Linux environment. \n•\tConfigure and troubleshoot hardware platform of high-end servers such as systems with multiple Xeon CPUs with RAID. Business Operations Manager Cisco May 2014  – Present (1 year 4 months) San Jose Business Operations Manager Cisco May 2014  – Present (1 year 4 months) San Jose Engineering Manager Cisco September 2011  – Present (4 years) San Jose Engineering Manager Cisco September 2011  – Present (4 years) San Jose Software Engineering Manager Cisco October 2011  –  October 2013  (2 years 1 month) Milpitas, CA •\tResponsible for coordinating and driving the team to provide the lab infrastructure and service delivery for UCBU, utilizing virtualization, high availability, and other industry best practices. \n•\tDelivering high quality, state of the art virtual infrastructure, and take pride and ownership in the delivery of the environment. \n•\tCollaborate with other engineering teams to identify requirements and needs. \n•\tResponsible for managing lifecycle of lab and infrastructure, as well as future planning. Software Engineering Manager Cisco October 2011  –  October 2013  (2 years 1 month) Milpitas, CA •\tResponsible for coordinating and driving the team to provide the lab infrastructure and service delivery for UCBU, utilizing virtualization, high availability, and other industry best practices. \n•\tDelivering high quality, state of the art virtual infrastructure, and take pride and ownership in the delivery of the environment. \n•\tCollaborate with other engineering teams to identify requirements and needs. \n•\tResponsible for managing lifecycle of lab and infrastructure, as well as future planning. Technical Lead Engineer Cisco December 2010  –  October 2011  (11 months) Milpitas, CA •\tBeing the team lead to execute lab and infrastructure projects. \n•\tParticipate an important role in designing and minimizing risk impacts on projects and programs  \n•\tContinuously lead the team to improve quality and service provided by our labs. \n•\tParticipate/Lead a team to develop an enterprise Java tool. Technical Lead Engineer Cisco December 2010  –  October 2011  (11 months) Milpitas, CA •\tBeing the team lead to execute lab and infrastructure projects. \n•\tParticipate an important role in designing and minimizing risk impacts on projects and programs  \n•\tContinuously lead the team to improve quality and service provided by our labs. \n•\tParticipate/Lead a team to develop an enterprise Java tool. Senior Software Development Engineer Cisco July 2005  –  December 2010  (5 years 6 months) Milpitas, CA •\tUse InstallAnywhere to design, develop, and enhance Installer for a variety of types of projects including release, upgrade, patch and hotfix. \n•\tMaking special system alterations by designing and developing InstallAnywhere custom code using Java, Perl and Shell script. \n•\tDesign and implement rollback strategy in InstallAnywhere to ensure complete system restore back to previous stage. \n•\tDevelop automated build scripts using Ant and mange daily build process among various projects to provide hands-free and on time installation packages efficiently.  \n•\tResponsible for versioning and labeling projects using ClearCase and Perforce to ensure software package accuracy and allow regeneration of software package from different timeframes.  \n•\tDesign and create customized RedHat Enterprise Linux Kickstart Installation disk. \n•\tGenerate customized system iso image by making and repackaging RPMs, and bundle them to the Linux Installation disk. \n•\tEnhance Linux system security by configuring firewall, SSH, & CSA (Cisco Security Agent). \n•\tCreate customized look-and-feel of the operating system by modifying boot-up options. \n•\tCreate and modify running Linux services to ensure system compatibility. \n•\tTroubleshoot application problems in Linux environment. \n•\tConfigure and troubleshoot hardware platform of high-end servers such as systems with multiple Xeon CPUs with RAID. Senior Software Development Engineer Cisco July 2005  –  December 2010  (5 years 6 months) Milpitas, CA •\tUse InstallAnywhere to design, develop, and enhance Installer for a variety of types of projects including release, upgrade, patch and hotfix. \n•\tMaking special system alterations by designing and developing InstallAnywhere custom code using Java, Perl and Shell script. \n•\tDesign and implement rollback strategy in InstallAnywhere to ensure complete system restore back to previous stage. \n•\tDevelop automated build scripts using Ant and mange daily build process among various projects to provide hands-free and on time installation packages efficiently.  \n•\tResponsible for versioning and labeling projects using ClearCase and Perforce to ensure software package accuracy and allow regeneration of software package from different timeframes.  \n•\tDesign and create customized RedHat Enterprise Linux Kickstart Installation disk. \n•\tGenerate customized system iso image by making and repackaging RPMs, and bundle them to the Linux Installation disk. \n•\tEnhance Linux system security by configuring firewall, SSH, & CSA (Cisco Security Agent). \n•\tCreate customized look-and-feel of the operating system by modifying boot-up options. \n•\tCreate and modify running Linux services to ensure system compatibility. \n•\tTroubleshoot application problems in Linux environment. \n•\tConfigure and troubleshoot hardware platform of high-end servers such as systems with multiple Xeon CPUs with RAID. Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency Cantonese Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Cantonese Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Cantonese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills TCP/IP Cloud Computing Cisco Technologies Unified Communications SIP Linux Data Center Perl Virtualization Ethernet Cisco UCS Cisco Nexus Cisco Interconnect Cisco IOS VMware OpenStack SAN Storage Java EJB J2EE Java Enterprise Edition Storage Area Networks Integration SAN Enterprise Software See 10+     See less Skills  TCP/IP Cloud Computing Cisco Technologies Unified Communications SIP Linux Data Center Perl Virtualization Ethernet Cisco UCS Cisco Nexus Cisco Interconnect Cisco IOS VMware OpenStack SAN Storage Java EJB J2EE Java Enterprise Edition Storage Area Networks Integration SAN Enterprise Software See 10+     See less TCP/IP Cloud Computing Cisco Technologies Unified Communications SIP Linux Data Center Perl Virtualization Ethernet Cisco UCS Cisco Nexus Cisco Interconnect Cisco IOS VMware OpenStack SAN Storage Java EJB J2EE Java Enterprise Edition Storage Area Networks Integration SAN Enterprise Software See 10+     See less TCP/IP Cloud Computing Cisco Technologies Unified Communications SIP Linux Data Center Perl Virtualization Ethernet Cisco UCS Cisco Nexus Cisco Interconnect Cisco IOS VMware OpenStack SAN Storage Java EJB J2EE Java Enterprise Edition Storage Area Networks Integration SAN Enterprise Software See 10+     See less Education San Jose State University Bachelor of Science (B.S.),  Computer Science with honors cum laude San Jose State University Master of Engineering (M.Eng.),  Client/Server Computing Program San Jose State University Bachelor of Science (B.S.),  Computer Science with honors cum laude San Jose State University Bachelor of Science (B.S.),  Computer Science with honors cum laude San Jose State University Bachelor of Science (B.S.),  Computer Science with honors cum laude San Jose State University Master of Engineering (M.Eng.),  Client/Server Computing Program San Jose State University Master of Engineering (M.Eng.),  Client/Server Computing Program San Jose State University Master of Engineering (M.Eng.),  Client/Server Computing Program ", "Summary Specialties: Product Security, Security Development Lifecycle, Internet Of Things (IoT), test automation, tools, test, ODM/JDM model Summary Specialties: Product Security, Security Development Lifecycle, Internet Of Things (IoT), test automation, tools, test, ODM/JDM model Specialties: Product Security, Security Development Lifecycle, Internet Of Things (IoT), test automation, tools, test, ODM/JDM model Specialties: Product Security, Security Development Lifecycle, Internet Of Things (IoT), test automation, tools, test, ODM/JDM model Experience Technical Leader, Cisco Security Development Lifecycle Cisco Systems September 2013  – Present (2 years) Austin, Texas Area Lead CSDL (Cisco Security Development Lifecycle) for IoT (Internet Of Things) group. Responsibilities including security requirements definition, SDLC (Security Development Life Cycle) definition and training, security test planning and execution. Also contribute to Cisco CSDL as a whole as member of a 14 person team of experts. Tools used include Codenomicon Defensics, Wurldtech Achilles Test Platform and IBM AppScan. Senior Engineering Manager Cisco May 2005  – Present (10 years 4 months) Manager of a System Test AKA Quality Assurance group Technical Leader, Cisco Security Development Lifecycle Cisco Systems September 2013  – Present (2 years) Austin, Texas Area Lead CSDL (Cisco Security Development Lifecycle) for IoT (Internet Of Things) group. Responsibilities including security requirements definition, SDLC (Security Development Life Cycle) definition and training, security test planning and execution. Also contribute to Cisco CSDL as a whole as member of a 14 person team of experts. Tools used include Codenomicon Defensics, Wurldtech Achilles Test Platform and IBM AppScan. Technical Leader, Cisco Security Development Lifecycle Cisco Systems September 2013  – Present (2 years) Austin, Texas Area Lead CSDL (Cisco Security Development Lifecycle) for IoT (Internet Of Things) group. Responsibilities including security requirements definition, SDLC (Security Development Life Cycle) definition and training, security test planning and execution. Also contribute to Cisco CSDL as a whole as member of a 14 person team of experts. Tools used include Codenomicon Defensics, Wurldtech Achilles Test Platform and IBM AppScan. Senior Engineering Manager Cisco May 2005  – Present (10 years 4 months) Manager of a System Test AKA Quality Assurance group Senior Engineering Manager Cisco May 2005  – Present (10 years 4 months) Manager of a System Test AKA Quality Assurance group Skills Testing SS7 VoIP Software Project... Release Management Test Automation Test Strategy Telecommunications Perl Embedded Systems Software Quality... Leadership TCL Routing Quality Assurance Shell Scripting Integration System Testing Telephony System Architecture RTP Unified Communications Linux Regression Testing Requirements Analysis Cisco Technologies Product Management MGCP Switches Manual Testing Unix SIP Security Networking WiFi TCP/IP SDLC Test Planning IP Organizational... Managerial Skills Organizational... Cross-functional Team... Security Management See 29+     See less Skills  Testing SS7 VoIP Software Project... Release Management Test Automation Test Strategy Telecommunications Perl Embedded Systems Software Quality... Leadership TCL Routing Quality Assurance Shell Scripting Integration System Testing Telephony System Architecture RTP Unified Communications Linux Regression Testing Requirements Analysis Cisco Technologies Product Management MGCP Switches Manual Testing Unix SIP Security Networking WiFi TCP/IP SDLC Test Planning IP Organizational... Managerial Skills Organizational... Cross-functional Team... Security Management See 29+     See less Testing SS7 VoIP Software Project... Release Management Test Automation Test Strategy Telecommunications Perl Embedded Systems Software Quality... Leadership TCL Routing Quality Assurance Shell Scripting Integration System Testing Telephony System Architecture RTP Unified Communications Linux Regression Testing Requirements Analysis Cisco Technologies Product Management MGCP Switches Manual Testing Unix SIP Security Networking WiFi TCP/IP SDLC Test Planning IP Organizational... Managerial Skills Organizational... Cross-functional Team... Security Management See 29+     See less Testing SS7 VoIP Software Project... Release Management Test Automation Test Strategy Telecommunications Perl Embedded Systems Software Quality... Leadership TCL Routing Quality Assurance Shell Scripting Integration System Testing Telephony System Architecture RTP Unified Communications Linux Regression Testing Requirements Analysis Cisco Technologies Product Management MGCP Switches Manual Testing Unix SIP Security Networking WiFi TCP/IP SDLC Test Planning IP Organizational... Managerial Skills Organizational... Cross-functional Team... Security Management See 29+     See less ", "Experience Systems Engineering Manager - SLED Illinois Cisco July 2014  – Present (1 year 2 months) Rosemont, IL Systems Engineering Manager for Cisco Systems, supporting Public Sector in Illinois. K-12, Higher Education, State/Local Government. Systems Engineering Manager-Commercial Cisco Systems July 2013  –  July 2014  (1 year 1 month) Greater Chicago Area Systems Engineering Manager for Cisco Systems, US Commercial Central Public Sector. Focusing on K-12, Higher Education and Local Government. Program Manager - Cisco November 2006  –  July 2013  (6 years 9 months) Greater Chicago Area Managed the Customer Briefing Center in Chicago. Delivered relevant briefings to our customers through technology presentations and demonstrations. Systems Engineering Manager - Wisconsin Enterprise Cisco Systems February 2005  –  November 2006  (1 year 10 months) Greater Milwaukee Area Manager Network Implementation and Operations Zurich North America 2003  –  2005  (2 years) Network Ops & Implementation Manager Galileo International 2001  –  2005  (4 years) Managed teams of Network Technicians and Engineers responsible for network trouble isolation and LAN / WAN implementations. Manager Network Ops and Network Coverage United Airlines 1986  –  2003  (17 years) Systems Engineering Manager - SLED Illinois Cisco July 2014  – Present (1 year 2 months) Rosemont, IL Systems Engineering Manager for Cisco Systems, supporting Public Sector in Illinois. K-12, Higher Education, State/Local Government. Systems Engineering Manager - SLED Illinois Cisco July 2014  – Present (1 year 2 months) Rosemont, IL Systems Engineering Manager for Cisco Systems, supporting Public Sector in Illinois. K-12, Higher Education, State/Local Government. Systems Engineering Manager-Commercial Cisco Systems July 2013  –  July 2014  (1 year 1 month) Greater Chicago Area Systems Engineering Manager for Cisco Systems, US Commercial Central Public Sector. Focusing on K-12, Higher Education and Local Government. Systems Engineering Manager-Commercial Cisco Systems July 2013  –  July 2014  (1 year 1 month) Greater Chicago Area Systems Engineering Manager for Cisco Systems, US Commercial Central Public Sector. Focusing on K-12, Higher Education and Local Government. Program Manager - Cisco November 2006  –  July 2013  (6 years 9 months) Greater Chicago Area Managed the Customer Briefing Center in Chicago. Delivered relevant briefings to our customers through technology presentations and demonstrations. Program Manager - Cisco November 2006  –  July 2013  (6 years 9 months) Greater Chicago Area Managed the Customer Briefing Center in Chicago. Delivered relevant briefings to our customers through technology presentations and demonstrations. Systems Engineering Manager - Wisconsin Enterprise Cisco Systems February 2005  –  November 2006  (1 year 10 months) Greater Milwaukee Area Systems Engineering Manager - Wisconsin Enterprise Cisco Systems February 2005  –  November 2006  (1 year 10 months) Greater Milwaukee Area Manager Network Implementation and Operations Zurich North America 2003  –  2005  (2 years) Manager Network Implementation and Operations Zurich North America 2003  –  2005  (2 years) Network Ops & Implementation Manager Galileo International 2001  –  2005  (4 years) Managed teams of Network Technicians and Engineers responsible for network trouble isolation and LAN / WAN implementations. Network Ops & Implementation Manager Galileo International 2001  –  2005  (4 years) Managed teams of Network Technicians and Engineers responsible for network trouble isolation and LAN / WAN implementations. Manager Network Ops and Network Coverage United Airlines 1986  –  2003  (17 years) Manager Network Ops and Network Coverage United Airlines 1986  –  2003  (17 years) Skills Networking Enterprise Software Data Center Cisco Technologies Cloud Computing VoIP Network Architecture Routing Unified Communications Network Design Virtualization TCP/IP Managed Services Switches IP Vendor Management MPLS Telecommunications WAN Wireless See 5+     See less Skills  Networking Enterprise Software Data Center Cisco Technologies Cloud Computing VoIP Network Architecture Routing Unified Communications Network Design Virtualization TCP/IP Managed Services Switches IP Vendor Management MPLS Telecommunications WAN Wireless See 5+     See less Networking Enterprise Software Data Center Cisco Technologies Cloud Computing VoIP Network Architecture Routing Unified Communications Network Design Virtualization TCP/IP Managed Services Switches IP Vendor Management MPLS Telecommunications WAN Wireless See 5+     See less Networking Enterprise Software Data Center Cisco Technologies Cloud Computing VoIP Network Architecture Routing Unified Communications Network Design Virtualization TCP/IP Managed Services Switches IP Vendor Management MPLS Telecommunications WAN Wireless See 5+     See less Education Roosevelt University 1984  – 1988 Roosevelt University 1984  – 1988 Roosevelt University 1984  – 1988 Roosevelt University 1984  – 1988 ", "Skills Cisco Technologies Unified Communications Managed Services Channel Program Management Go-to-market Strategy Data Center Cloud Computing Business Development Virtualization VoIP Network Security Security Wireless Cisco IOS Switches Telecommunications Firewalls Storage Routers TCP/IP VMware Networking IP Strategic Partnerships Network Architecture Professional Services Strategy Integration See 14+     See less Skills  Cisco Technologies Unified Communications Managed Services Channel Program Management Go-to-market Strategy Data Center Cloud Computing Business Development Virtualization VoIP Network Security Security Wireless Cisco IOS Switches Telecommunications Firewalls Storage Routers TCP/IP VMware Networking IP Strategic Partnerships Network Architecture Professional Services Strategy Integration See 14+     See less Cisco Technologies Unified Communications Managed Services Channel Program Management Go-to-market Strategy Data Center Cloud Computing Business Development Virtualization VoIP Network Security Security Wireless Cisco IOS Switches Telecommunications Firewalls Storage Routers TCP/IP VMware Networking IP Strategic Partnerships Network Architecture Professional Services Strategy Integration See 14+     See less Cisco Technologies Unified Communications Managed Services Channel Program Management Go-to-market Strategy Data Center Cloud Computing Business Development Virtualization VoIP Network Security Security Wireless Cisco IOS Switches Telecommunications Firewalls Storage Routers TCP/IP VMware Networking IP Strategic Partnerships Network Architecture Professional Services Strategy Integration See 14+     See less "]}