{"position": "Software Annuity Specialist", "company": "Google", "profiles": ["Summary I have +25 years multinational experience in Computing & Information Technology. \nI have excellent Services Business Development, Project Management, Consultant and Customer facing skills.  \n \nFluent in: English, Italian, and Spanish \n \nSpecialties: Services, Business Development, Financials, Contract Management, Security, Routing&Switching, Collaboration, Unified Communications, Contact Center, Italian, Spanish, English and Project Management.  Summary I have +25 years multinational experience in Computing & Information Technology. \nI have excellent Services Business Development, Project Management, Consultant and Customer facing skills.  \n \nFluent in: English, Italian, and Spanish \n \nSpecialties: Services, Business Development, Financials, Contract Management, Security, Routing&Switching, Collaboration, Unified Communications, Contact Center, Italian, Spanish, English and Project Management.  I have +25 years multinational experience in Computing & Information Technology. \nI have excellent Services Business Development, Project Management, Consultant and Customer facing skills.  \n \nFluent in: English, Italian, and Spanish \n \nSpecialties: Services, Business Development, Financials, Contract Management, Security, Routing&Switching, Collaboration, Unified Communications, Contact Center, Italian, Spanish, English and Project Management.  I have +25 years multinational experience in Computing & Information Technology. \nI have excellent Services Business Development, Project Management, Consultant and Customer facing skills.  \n \nFluent in: English, Italian, and Spanish \n \nSpecialties: Services, Business Development, Financials, Contract Management, Security, Routing&Switching, Collaboration, Unified Communications, Contact Center, Italian, Spanish, English and Project Management.  Experience Borderless Network Architecture and Enterprise Social Software - EMEAR Advanced Services BDM Cisco Systems Security - Advanced Services Business Development Manager Cisco Systems August 2013  – Present (2 years 1 month) Barcelona Area, Spain Advanced Services - Unified Communications Business Development Manager Cisco Systems August 2010  –  January 2012  (1 year 6 months) My primary role as an Advanced Services Business Development Manager (BDM) for Collaboration (Unified Communications, Unified Contact Center, QUAD) is to provide sizing and scoping support to the local Services Sales organizations in Europe for Collaboration Advanced Services deals, Collaboration empowerment and enablement of the local Business Development Managers, development of new Collaboration service offerings, participating in customer facing key meetings. Advanced Services - Business Development Manager Cisco Systems Spain 2006  –  2010  (4 years) My primary role as an Advanced Services Business Development Manager (BDM) is to assist in sizing and scoping of Advanced Services deals, review engagement profitability, and provide delivery support to my Area teams (Service Account Managers in Spain, Andorra, Portugal, Greece, Cyprus, Malta and Israel). Focus includes segmentation, sales alignment, and delivery engagement. I am also responsible for capturing new field opportunities and/or enlarging services scope while working in customer engagements. Advanced Services - Project/Program Manager at Cisco Systems Spain Cisco October 2004  –  July 2006  (1 year 10 months) Responsible for the management of all aspects of the Cisco Project Management Framework and the successful delivery of customer projects as defined in the Project Plan document and Customer Statement of Work Document. I was involved in all phases of the project lifecycle: Feasibility, Planning, Design, Execution, Handover and Close phases. Within the key responsibilities I also acted as an AS Business Development Mgr assisting the CA Sales force during the preparation, qualification and presentation of Customer Proposals/Statements of Work. Activity was focused on the major SP and larger Enterprices in Spain, Greece, Portugal, Turkey, Israel and Cyprus. Service Account Manager at Cisco Systems Italy Cisco January 2000  –  October 2004  (4 years 10 months) Services Account Manager, responsible for selling services and support into the Telco Service Provider environment, such as maintenance support, Professional Services, and Advanced Support Services/Solutions (turn-key project requirements definition, scoping, sizing, resourcing, Service Level Agreement definition, pricing, margin analysis, creation of Statements of Work, delivery of outline plan, negotiation and closure of deal), in a highly matrixed environment (Account Management, System Engineering, Services Marketing, Partner Ecosystem, etc…), with strategic account management and good understanding of legal contracts and financial concepts. Sale activity was focused on the following major New Service Providers: Wind, Tiscali Italy, Tiscali International Network BV, Acantho, Autostrade, Edisontel. Since 2001 I had the responsibility for all major Greek Service Provider customers (Net One, Vodafone Greece, OTE Globe, OSE Railways, etc…) and Tiscali at Global level. Technical Project/Program Manager Alcatel April 1994  –  January 2000  (5 years 10 months) 4 years as Technical Project/Program Manager in the O&M TMN group. \nPlace of employment: Oslo, Norway, 2 years and a half; Strasbourg, France, half year; Vimercate (MI), Italy, 1 year. \n \n1 year as Software Designer and Developer in the O&M TMN group, designing and implementing products for the management systems of the public switching network of TELECOM Italia. Work place: Milan. Campus Network Manager Politecnico di Milano February 1990  –  April 1994  (4 years 3 months) Network Manager for the Polytechnic campus data communication network Laureando Università degli Studi di Milano 1990  –  1991  (1 year) Borderless Network Architecture and Enterprise Social Software - EMEAR Advanced Services BDM Cisco Systems Borderless Network Architecture and Enterprise Social Software - EMEAR Advanced Services BDM Cisco Systems Security - Advanced Services Business Development Manager Cisco Systems August 2013  – Present (2 years 1 month) Barcelona Area, Spain Security - Advanced Services Business Development Manager Cisco Systems August 2013  – Present (2 years 1 month) Barcelona Area, Spain Advanced Services - Unified Communications Business Development Manager Cisco Systems August 2010  –  January 2012  (1 year 6 months) My primary role as an Advanced Services Business Development Manager (BDM) for Collaboration (Unified Communications, Unified Contact Center, QUAD) is to provide sizing and scoping support to the local Services Sales organizations in Europe for Collaboration Advanced Services deals, Collaboration empowerment and enablement of the local Business Development Managers, development of new Collaboration service offerings, participating in customer facing key meetings. Advanced Services - Unified Communications Business Development Manager Cisco Systems August 2010  –  January 2012  (1 year 6 months) My primary role as an Advanced Services Business Development Manager (BDM) for Collaboration (Unified Communications, Unified Contact Center, QUAD) is to provide sizing and scoping support to the local Services Sales organizations in Europe for Collaboration Advanced Services deals, Collaboration empowerment and enablement of the local Business Development Managers, development of new Collaboration service offerings, participating in customer facing key meetings. Advanced Services - Business Development Manager Cisco Systems Spain 2006  –  2010  (4 years) My primary role as an Advanced Services Business Development Manager (BDM) is to assist in sizing and scoping of Advanced Services deals, review engagement profitability, and provide delivery support to my Area teams (Service Account Managers in Spain, Andorra, Portugal, Greece, Cyprus, Malta and Israel). Focus includes segmentation, sales alignment, and delivery engagement. I am also responsible for capturing new field opportunities and/or enlarging services scope while working in customer engagements. Advanced Services - Business Development Manager Cisco Systems Spain 2006  –  2010  (4 years) My primary role as an Advanced Services Business Development Manager (BDM) is to assist in sizing and scoping of Advanced Services deals, review engagement profitability, and provide delivery support to my Area teams (Service Account Managers in Spain, Andorra, Portugal, Greece, Cyprus, Malta and Israel). Focus includes segmentation, sales alignment, and delivery engagement. I am also responsible for capturing new field opportunities and/or enlarging services scope while working in customer engagements. Advanced Services - Project/Program Manager at Cisco Systems Spain Cisco October 2004  –  July 2006  (1 year 10 months) Responsible for the management of all aspects of the Cisco Project Management Framework and the successful delivery of customer projects as defined in the Project Plan document and Customer Statement of Work Document. I was involved in all phases of the project lifecycle: Feasibility, Planning, Design, Execution, Handover and Close phases. Within the key responsibilities I also acted as an AS Business Development Mgr assisting the CA Sales force during the preparation, qualification and presentation of Customer Proposals/Statements of Work. Activity was focused on the major SP and larger Enterprices in Spain, Greece, Portugal, Turkey, Israel and Cyprus. Advanced Services - Project/Program Manager at Cisco Systems Spain Cisco October 2004  –  July 2006  (1 year 10 months) Responsible for the management of all aspects of the Cisco Project Management Framework and the successful delivery of customer projects as defined in the Project Plan document and Customer Statement of Work Document. I was involved in all phases of the project lifecycle: Feasibility, Planning, Design, Execution, Handover and Close phases. Within the key responsibilities I also acted as an AS Business Development Mgr assisting the CA Sales force during the preparation, qualification and presentation of Customer Proposals/Statements of Work. Activity was focused on the major SP and larger Enterprices in Spain, Greece, Portugal, Turkey, Israel and Cyprus. Service Account Manager at Cisco Systems Italy Cisco January 2000  –  October 2004  (4 years 10 months) Services Account Manager, responsible for selling services and support into the Telco Service Provider environment, such as maintenance support, Professional Services, and Advanced Support Services/Solutions (turn-key project requirements definition, scoping, sizing, resourcing, Service Level Agreement definition, pricing, margin analysis, creation of Statements of Work, delivery of outline plan, negotiation and closure of deal), in a highly matrixed environment (Account Management, System Engineering, Services Marketing, Partner Ecosystem, etc…), with strategic account management and good understanding of legal contracts and financial concepts. Sale activity was focused on the following major New Service Providers: Wind, Tiscali Italy, Tiscali International Network BV, Acantho, Autostrade, Edisontel. Since 2001 I had the responsibility for all major Greek Service Provider customers (Net One, Vodafone Greece, OTE Globe, OSE Railways, etc…) and Tiscali at Global level. Service Account Manager at Cisco Systems Italy Cisco January 2000  –  October 2004  (4 years 10 months) Services Account Manager, responsible for selling services and support into the Telco Service Provider environment, such as maintenance support, Professional Services, and Advanced Support Services/Solutions (turn-key project requirements definition, scoping, sizing, resourcing, Service Level Agreement definition, pricing, margin analysis, creation of Statements of Work, delivery of outline plan, negotiation and closure of deal), in a highly matrixed environment (Account Management, System Engineering, Services Marketing, Partner Ecosystem, etc…), with strategic account management and good understanding of legal contracts and financial concepts. Sale activity was focused on the following major New Service Providers: Wind, Tiscali Italy, Tiscali International Network BV, Acantho, Autostrade, Edisontel. Since 2001 I had the responsibility for all major Greek Service Provider customers (Net One, Vodafone Greece, OTE Globe, OSE Railways, etc…) and Tiscali at Global level. Technical Project/Program Manager Alcatel April 1994  –  January 2000  (5 years 10 months) 4 years as Technical Project/Program Manager in the O&M TMN group. \nPlace of employment: Oslo, Norway, 2 years and a half; Strasbourg, France, half year; Vimercate (MI), Italy, 1 year. \n \n1 year as Software Designer and Developer in the O&M TMN group, designing and implementing products for the management systems of the public switching network of TELECOM Italia. Work place: Milan. Technical Project/Program Manager Alcatel April 1994  –  January 2000  (5 years 10 months) 4 years as Technical Project/Program Manager in the O&M TMN group. \nPlace of employment: Oslo, Norway, 2 years and a half; Strasbourg, France, half year; Vimercate (MI), Italy, 1 year. \n \n1 year as Software Designer and Developer in the O&M TMN group, designing and implementing products for the management systems of the public switching network of TELECOM Italia. Work place: Milan. Campus Network Manager Politecnico di Milano February 1990  –  April 1994  (4 years 3 months) Network Manager for the Polytechnic campus data communication network Campus Network Manager Politecnico di Milano February 1990  –  April 1994  (4 years 3 months) Network Manager for the Polytechnic campus data communication network Laureando Università degli Studi di Milano 1990  –  1991  (1 year) Laureando Università degli Studi di Milano 1990  –  1991  (1 year) Skills Contact Centers Business Development Professional Services Management Unified Communications Data Center Cisco Technologies Pre-sales Project Management Networking Account Management Security Network Architecture Cloud Computing Skills  Contact Centers Business Development Professional Services Management Unified Communications Data Center Cisco Technologies Pre-sales Project Management Networking Account Management Security Network Architecture Cloud Computing Contact Centers Business Development Professional Services Management Unified Communications Data Center Cisco Technologies Pre-sales Project Management Networking Account Management Security Network Architecture Cloud Computing Contact Centers Business Development Professional Services Management Unified Communications Data Center Cisco Technologies Pre-sales Project Management Networking Account Management Security Network Architecture Cloud Computing Education Università degli Studi di Milano 107/110,  MSc in Computer Science 1986  – 1991 Corso di Laurea in Scienze dell'Informazione Activities and Societies:  Thesis on logic and computational linguistics.\nTitle: «A prototype of syntactical analyser based on Kamp’s DR theory». Liceo Scientifico High School , 52/60 1980  – 1985 Liceo Scientifico Federigo Enriques Università degli Studi di Milano 107/110,  MSc in Computer Science 1986  – 1991 Corso di Laurea in Scienze dell'Informazione Activities and Societies:  Thesis on logic and computational linguistics.\nTitle: «A prototype of syntactical analyser based on Kamp’s DR theory». Università degli Studi di Milano 107/110,  MSc in Computer Science 1986  – 1991 Corso di Laurea in Scienze dell'Informazione Activities and Societies:  Thesis on logic and computational linguistics.\nTitle: «A prototype of syntactical analyser based on Kamp’s DR theory». Università degli Studi di Milano 107/110,  MSc in Computer Science 1986  – 1991 Corso di Laurea in Scienze dell'Informazione Activities and Societies:  Thesis on logic and computational linguistics.\nTitle: «A prototype of syntactical analyser based on Kamp’s DR theory». Liceo Scientifico High School , 52/60 1980  – 1985 Liceo Scientifico Federigo Enriques Liceo Scientifico High School , 52/60 1980  – 1985 Liceo Scientifico Federigo Enriques Liceo Scientifico High School , 52/60 1980  – 1985 Liceo Scientifico Federigo Enriques ", "Summary Experienced business leader with multicultural background. Experience in strategy, business development and strategic partnerships. Worked closely with customers and partners to drive and develop new business models.  \nExperienced in working in different aspects of the business (Sales, Product Management and Operations).  \nStrong quantitative background, proven leadership experience and advanced public speaking skills.  \nExperience in starting companies (running a P&L) and corporate leadership.  \nStrong passion for mathematics, statistics and probability.  \nTechnology and science enthusiast. Domain expertise in Business Transformation, Web Conferencing, Collaboration, Video Conferencing and Cloud. \n \nSpecialties: Business Development, Sales Leadership, Product Marketing/Management, Financial analysis, Building ROI models, Entrepreneurship, Business Development, Sales Business Development, IP Telephony, Collaboration, Web Conferencing, Video Conferencing, Cloud, Contact Centers and Service Providers. Summary Experienced business leader with multicultural background. Experience in strategy, business development and strategic partnerships. Worked closely with customers and partners to drive and develop new business models.  \nExperienced in working in different aspects of the business (Sales, Product Management and Operations).  \nStrong quantitative background, proven leadership experience and advanced public speaking skills.  \nExperience in starting companies (running a P&L) and corporate leadership.  \nStrong passion for mathematics, statistics and probability.  \nTechnology and science enthusiast. Domain expertise in Business Transformation, Web Conferencing, Collaboration, Video Conferencing and Cloud. \n \nSpecialties: Business Development, Sales Leadership, Product Marketing/Management, Financial analysis, Building ROI models, Entrepreneurship, Business Development, Sales Business Development, IP Telephony, Collaboration, Web Conferencing, Video Conferencing, Cloud, Contact Centers and Service Providers. Experienced business leader with multicultural background. Experience in strategy, business development and strategic partnerships. Worked closely with customers and partners to drive and develop new business models.  \nExperienced in working in different aspects of the business (Sales, Product Management and Operations).  \nStrong quantitative background, proven leadership experience and advanced public speaking skills.  \nExperience in starting companies (running a P&L) and corporate leadership.  \nStrong passion for mathematics, statistics and probability.  \nTechnology and science enthusiast. Domain expertise in Business Transformation, Web Conferencing, Collaboration, Video Conferencing and Cloud. \n \nSpecialties: Business Development, Sales Leadership, Product Marketing/Management, Financial analysis, Building ROI models, Entrepreneurship, Business Development, Sales Business Development, IP Telephony, Collaboration, Web Conferencing, Video Conferencing, Cloud, Contact Centers and Service Providers. Experienced business leader with multicultural background. Experience in strategy, business development and strategic partnerships. Worked closely with customers and partners to drive and develop new business models.  \nExperienced in working in different aspects of the business (Sales, Product Management and Operations).  \nStrong quantitative background, proven leadership experience and advanced public speaking skills.  \nExperience in starting companies (running a P&L) and corporate leadership.  \nStrong passion for mathematics, statistics and probability.  \nTechnology and science enthusiast. Domain expertise in Business Transformation, Web Conferencing, Collaboration, Video Conferencing and Cloud. \n \nSpecialties: Business Development, Sales Leadership, Product Marketing/Management, Financial analysis, Building ROI models, Entrepreneurship, Business Development, Sales Business Development, IP Telephony, Collaboration, Web Conferencing, Video Conferencing, Cloud, Contact Centers and Service Providers. Experience Director of Business Development Akamai Technologies September 2014  – Present (1 year) Greater Boston Area Channel Development \nTechnical Partnerships \nM&A Senior Business Development Manager, Collaboration Solutions Cisco May 2014  – Present (1 year 4 months) Greater Boston Area • Head of GTM for Cisco's 3rd Party phone portfolio \n• Lead business development of Cisco’s collaboration business in key markets \n• Nominated by leadership team to take part in Cisco's Leadership Pipeline Program (top 2% of Cisco's talent) \n• Q2FY14 Achiever Award Co-founder Basepair.io October 2013  –  July 2014  (10 months) Increasing efficiency of next generation sequencing (NGS) technology is driving innovation in biology and medicine but data analysis is now becoming the bottleneck. We have started Basepair to make NGS analysis accessible and easy, even to non programmers. We believe our users should focus on the science and never worry about server maintenance or running out of storage space. Business Development Lead, Collaboration Solutions Cisco Systems 2013  –  May 2014  (1 year) Greater Boston Area • Led business development of Cisco’s collaboration business in key markets (Canada, Russia, Turkey, South Africa, Saudi Arabia, Israel and Eastern Europe) valued at more than $400M/year in revenue \n• Nominated by leadership team to take part in Cisco's Leadership Pipeline Program (top 2% of Cisco's talent)  \n• Strategy lead for video conferencing, video as a service and virtual meeting rooms for market development organization \n• Developed strategy and GTM for Cisco's 3rd Party phone portfolio \n• Awards: FY13 Excellence Award; 1HFY13 Cross Functional Leadership Award Regional Sales Manager Cisco Systems August 2012  –  2013  (1 year) Moscow, Russian Federation • Led a team of product sales specialists in Collaboration (IP Telephony//UC/Video/WebEx Sales) \n• Led a team of product sales specialists in Collaboration; Hired, trained and enabled new sales specialists \n• Responsible for Collaboration sales direct quota (over $130M/year), led customer engagements and deal negotiations \n• Ran vertical reviews, account planning and long range planning \n• Awards: Sales Achiever FY12; Team Excellence Award Q1FY13 Sales Business Development Manager Cisco Systems 2011  –  2012  (1 year) Greater Boston Area • Lead business development of Cisco’s Collaboration business in Key Markets (Russia, Turkey, RSA, Israel and Eastern Europe) valued at more than $250M/year in revenues \n• Drove expansion of addressable markets by building channel capacity for new Mid-Market offering in Emerging Markets \n• Received top performer award (Rock Star, first half FY12) for outstanding performance and cross functional collaboration \n• Received top performer award for outstanding performance in Q4 FY12 Partner/Co-founder TechBee 2011  –  2012  (1 year) Greater Boston Area • Co-Founded with a fellow MIT Sloan graduate after recognizing a major need in the space of software recruiting: finding the best talent for a specialized industry.  \n• Developed a novel technological process to hone in on the top talent in different technical  \n• Build a team of 7 professionals (sales and marketing)  \n• Achieved profitability after 6 months Business Development Manager Cisco Systems 2010  –  2011  (1 year) Greater Boston Area • Drove expansion of addressable markets by building channel capacity for new SMB offering in Emerging Markets \n• Pitched a new feature development for Russian market to the senior leadership team at Cisco (Russia board) to secure funding and address a $90M opportunity \n• Led market expansion into key global market and vertical solution development in the business video space \n• Managed Cisco WebEx resale partnerships with local service providers in Russia \n• Conducted market research and feature analysis to develop a new BRIC focused solution (high density analog gateway) to accelerate Analog to IPT migration and drive $200M in future revenue \n• Awards: Rock Star, 1HFY11, FY11, and Q4FY12; Cross Functional Leadership Award, Q3FY12 Program Manager, Business Development Cisco 2009  –  2010  (1 year) Greater Boston Area • Lead business development of Cisco’s Collaboration business in Eastern and Central Europe, valued at more than $100M/year in revenues \n• Pitched a new feature development for Russian market to the senior leadership team at Cisco (Russia board) to secure funding and address a $90M opportunity \n• Conducted market research and feature analysis to develop a new BRIC focused solution (high density analog gateway) to accelerate Analog to IPT migration and drive $200M in future revenues \n• Led jointly with a Cisco partner (dimension data) a market expansion into key global market and vertical solution development in the business video space \n• Received top performer award (Rock Star, first half FY11) for outstanding performance and was promoted to next grade \n• Led Collaboration Sales in Russia, account planning, customer presentations and deal negotiation \n• Developed a $2M global sales incentive program for a global competitive take-out initiative  \n• Conducted regular business reviews with senior executives for the Collaboration business in Co-Founder GeoSapia September 2008  –  March 2009  (7 months) Greater Boston Area • Started a real estate search engine company with two postdocs from MIT \n• Company adopted a unique technology from the cancer genetics field to find properties using individual (subjective) criteria \n• 2nd runner up in the MIT $100K competition (web technology track) Product Management Cisco June 2008  –  August 2008  (3 months) • Developed Go-to-Market strategy to support the business unit’s $1B annual revenue expectations by estimating the video storage market, analyzing technology, and evaluating vendors \n• Presented market evaluation and recommendations to the group’s GM/VP and Executive Team, resulting in decision to enter market with an expected $100M in annual revenue in 2 years Project Lead, Lieutenant Intelligence Corps- I.D.F 2005  –  2007  (2 years) • Led team of 10 to develop innovative video surveillance system that resulted in reduction of 6,000 man hours per year \n• Managed team of 5 in development of a technological solution to remove atmospheric haze in long range surveillance system, increasing effectiveness of the systems by 20% \n• Created roadmap for conversion of commercial technologies to military use, roadmap approved and became best practice Project Officer, Lieutenant Intelligence Corps- I.D.F 2004  –  2005  (1 year) • Managed team of 5 in development of a technological solution to remove atmospheric haze in long range surveillance system, increasing effectiveness of the systems by 20% \n• Created roadmap for conversion of commercial technologies to military use, roadmap approved and became best practice Director of Business Development Akamai Technologies September 2014  – Present (1 year) Greater Boston Area Channel Development \nTechnical Partnerships \nM&A Director of Business Development Akamai Technologies September 2014  – Present (1 year) Greater Boston Area Channel Development \nTechnical Partnerships \nM&A Senior Business Development Manager, Collaboration Solutions Cisco May 2014  – Present (1 year 4 months) Greater Boston Area • Head of GTM for Cisco's 3rd Party phone portfolio \n• Lead business development of Cisco’s collaboration business in key markets \n• Nominated by leadership team to take part in Cisco's Leadership Pipeline Program (top 2% of Cisco's talent) \n• Q2FY14 Achiever Award Senior Business Development Manager, Collaboration Solutions Cisco May 2014  – Present (1 year 4 months) Greater Boston Area • Head of GTM for Cisco's 3rd Party phone portfolio \n• Lead business development of Cisco’s collaboration business in key markets \n• Nominated by leadership team to take part in Cisco's Leadership Pipeline Program (top 2% of Cisco's talent) \n• Q2FY14 Achiever Award Co-founder Basepair.io October 2013  –  July 2014  (10 months) Increasing efficiency of next generation sequencing (NGS) technology is driving innovation in biology and medicine but data analysis is now becoming the bottleneck. We have started Basepair to make NGS analysis accessible and easy, even to non programmers. We believe our users should focus on the science and never worry about server maintenance or running out of storage space. Co-founder Basepair.io October 2013  –  July 2014  (10 months) Increasing efficiency of next generation sequencing (NGS) technology is driving innovation in biology and medicine but data analysis is now becoming the bottleneck. We have started Basepair to make NGS analysis accessible and easy, even to non programmers. We believe our users should focus on the science and never worry about server maintenance or running out of storage space. Business Development Lead, Collaboration Solutions Cisco Systems 2013  –  May 2014  (1 year) Greater Boston Area • Led business development of Cisco’s collaboration business in key markets (Canada, Russia, Turkey, South Africa, Saudi Arabia, Israel and Eastern Europe) valued at more than $400M/year in revenue \n• Nominated by leadership team to take part in Cisco's Leadership Pipeline Program (top 2% of Cisco's talent)  \n• Strategy lead for video conferencing, video as a service and virtual meeting rooms for market development organization \n• Developed strategy and GTM for Cisco's 3rd Party phone portfolio \n• Awards: FY13 Excellence Award; 1HFY13 Cross Functional Leadership Award Business Development Lead, Collaboration Solutions Cisco Systems 2013  –  May 2014  (1 year) Greater Boston Area • Led business development of Cisco’s collaboration business in key markets (Canada, Russia, Turkey, South Africa, Saudi Arabia, Israel and Eastern Europe) valued at more than $400M/year in revenue \n• Nominated by leadership team to take part in Cisco's Leadership Pipeline Program (top 2% of Cisco's talent)  \n• Strategy lead for video conferencing, video as a service and virtual meeting rooms for market development organization \n• Developed strategy and GTM for Cisco's 3rd Party phone portfolio \n• Awards: FY13 Excellence Award; 1HFY13 Cross Functional Leadership Award Regional Sales Manager Cisco Systems August 2012  –  2013  (1 year) Moscow, Russian Federation • Led a team of product sales specialists in Collaboration (IP Telephony//UC/Video/WebEx Sales) \n• Led a team of product sales specialists in Collaboration; Hired, trained and enabled new sales specialists \n• Responsible for Collaboration sales direct quota (over $130M/year), led customer engagements and deal negotiations \n• Ran vertical reviews, account planning and long range planning \n• Awards: Sales Achiever FY12; Team Excellence Award Q1FY13 Regional Sales Manager Cisco Systems August 2012  –  2013  (1 year) Moscow, Russian Federation • Led a team of product sales specialists in Collaboration (IP Telephony//UC/Video/WebEx Sales) \n• Led a team of product sales specialists in Collaboration; Hired, trained and enabled new sales specialists \n• Responsible for Collaboration sales direct quota (over $130M/year), led customer engagements and deal negotiations \n• Ran vertical reviews, account planning and long range planning \n• Awards: Sales Achiever FY12; Team Excellence Award Q1FY13 Sales Business Development Manager Cisco Systems 2011  –  2012  (1 year) Greater Boston Area • Lead business development of Cisco’s Collaboration business in Key Markets (Russia, Turkey, RSA, Israel and Eastern Europe) valued at more than $250M/year in revenues \n• Drove expansion of addressable markets by building channel capacity for new Mid-Market offering in Emerging Markets \n• Received top performer award (Rock Star, first half FY12) for outstanding performance and cross functional collaboration \n• Received top performer award for outstanding performance in Q4 FY12 Sales Business Development Manager Cisco Systems 2011  –  2012  (1 year) Greater Boston Area • Lead business development of Cisco’s Collaboration business in Key Markets (Russia, Turkey, RSA, Israel and Eastern Europe) valued at more than $250M/year in revenues \n• Drove expansion of addressable markets by building channel capacity for new Mid-Market offering in Emerging Markets \n• Received top performer award (Rock Star, first half FY12) for outstanding performance and cross functional collaboration \n• Received top performer award for outstanding performance in Q4 FY12 Partner/Co-founder TechBee 2011  –  2012  (1 year) Greater Boston Area • Co-Founded with a fellow MIT Sloan graduate after recognizing a major need in the space of software recruiting: finding the best talent for a specialized industry.  \n• Developed a novel technological process to hone in on the top talent in different technical  \n• Build a team of 7 professionals (sales and marketing)  \n• Achieved profitability after 6 months Partner/Co-founder TechBee 2011  –  2012  (1 year) Greater Boston Area • Co-Founded with a fellow MIT Sloan graduate after recognizing a major need in the space of software recruiting: finding the best talent for a specialized industry.  \n• Developed a novel technological process to hone in on the top talent in different technical  \n• Build a team of 7 professionals (sales and marketing)  \n• Achieved profitability after 6 months Business Development Manager Cisco Systems 2010  –  2011  (1 year) Greater Boston Area • Drove expansion of addressable markets by building channel capacity for new SMB offering in Emerging Markets \n• Pitched a new feature development for Russian market to the senior leadership team at Cisco (Russia board) to secure funding and address a $90M opportunity \n• Led market expansion into key global market and vertical solution development in the business video space \n• Managed Cisco WebEx resale partnerships with local service providers in Russia \n• Conducted market research and feature analysis to develop a new BRIC focused solution (high density analog gateway) to accelerate Analog to IPT migration and drive $200M in future revenue \n• Awards: Rock Star, 1HFY11, FY11, and Q4FY12; Cross Functional Leadership Award, Q3FY12 Business Development Manager Cisco Systems 2010  –  2011  (1 year) Greater Boston Area • Drove expansion of addressable markets by building channel capacity for new SMB offering in Emerging Markets \n• Pitched a new feature development for Russian market to the senior leadership team at Cisco (Russia board) to secure funding and address a $90M opportunity \n• Led market expansion into key global market and vertical solution development in the business video space \n• Managed Cisco WebEx resale partnerships with local service providers in Russia \n• Conducted market research and feature analysis to develop a new BRIC focused solution (high density analog gateway) to accelerate Analog to IPT migration and drive $200M in future revenue \n• Awards: Rock Star, 1HFY11, FY11, and Q4FY12; Cross Functional Leadership Award, Q3FY12 Program Manager, Business Development Cisco 2009  –  2010  (1 year) Greater Boston Area • Lead business development of Cisco’s Collaboration business in Eastern and Central Europe, valued at more than $100M/year in revenues \n• Pitched a new feature development for Russian market to the senior leadership team at Cisco (Russia board) to secure funding and address a $90M opportunity \n• Conducted market research and feature analysis to develop a new BRIC focused solution (high density analog gateway) to accelerate Analog to IPT migration and drive $200M in future revenues \n• Led jointly with a Cisco partner (dimension data) a market expansion into key global market and vertical solution development in the business video space \n• Received top performer award (Rock Star, first half FY11) for outstanding performance and was promoted to next grade \n• Led Collaboration Sales in Russia, account planning, customer presentations and deal negotiation \n• Developed a $2M global sales incentive program for a global competitive take-out initiative  \n• Conducted regular business reviews with senior executives for the Collaboration business in Program Manager, Business Development Cisco 2009  –  2010  (1 year) Greater Boston Area • Lead business development of Cisco’s Collaboration business in Eastern and Central Europe, valued at more than $100M/year in revenues \n• Pitched a new feature development for Russian market to the senior leadership team at Cisco (Russia board) to secure funding and address a $90M opportunity \n• Conducted market research and feature analysis to develop a new BRIC focused solution (high density analog gateway) to accelerate Analog to IPT migration and drive $200M in future revenues \n• Led jointly with a Cisco partner (dimension data) a market expansion into key global market and vertical solution development in the business video space \n• Received top performer award (Rock Star, first half FY11) for outstanding performance and was promoted to next grade \n• Led Collaboration Sales in Russia, account planning, customer presentations and deal negotiation \n• Developed a $2M global sales incentive program for a global competitive take-out initiative  \n• Conducted regular business reviews with senior executives for the Collaboration business in Co-Founder GeoSapia September 2008  –  March 2009  (7 months) Greater Boston Area • Started a real estate search engine company with two postdocs from MIT \n• Company adopted a unique technology from the cancer genetics field to find properties using individual (subjective) criteria \n• 2nd runner up in the MIT $100K competition (web technology track) Co-Founder GeoSapia September 2008  –  March 2009  (7 months) Greater Boston Area • Started a real estate search engine company with two postdocs from MIT \n• Company adopted a unique technology from the cancer genetics field to find properties using individual (subjective) criteria \n• 2nd runner up in the MIT $100K competition (web technology track) Product Management Cisco June 2008  –  August 2008  (3 months) • Developed Go-to-Market strategy to support the business unit’s $1B annual revenue expectations by estimating the video storage market, analyzing technology, and evaluating vendors \n• Presented market evaluation and recommendations to the group’s GM/VP and Executive Team, resulting in decision to enter market with an expected $100M in annual revenue in 2 years Product Management Cisco June 2008  –  August 2008  (3 months) • Developed Go-to-Market strategy to support the business unit’s $1B annual revenue expectations by estimating the video storage market, analyzing technology, and evaluating vendors \n• Presented market evaluation and recommendations to the group’s GM/VP and Executive Team, resulting in decision to enter market with an expected $100M in annual revenue in 2 years Project Lead, Lieutenant Intelligence Corps- I.D.F 2005  –  2007  (2 years) • Led team of 10 to develop innovative video surveillance system that resulted in reduction of 6,000 man hours per year \n• Managed team of 5 in development of a technological solution to remove atmospheric haze in long range surveillance system, increasing effectiveness of the systems by 20% \n• Created roadmap for conversion of commercial technologies to military use, roadmap approved and became best practice Project Lead, Lieutenant Intelligence Corps- I.D.F 2005  –  2007  (2 years) • Led team of 10 to develop innovative video surveillance system that resulted in reduction of 6,000 man hours per year \n• Managed team of 5 in development of a technological solution to remove atmospheric haze in long range surveillance system, increasing effectiveness of the systems by 20% \n• Created roadmap for conversion of commercial technologies to military use, roadmap approved and became best practice Project Officer, Lieutenant Intelligence Corps- I.D.F 2004  –  2005  (1 year) • Managed team of 5 in development of a technological solution to remove atmospheric haze in long range surveillance system, increasing effectiveness of the systems by 20% \n• Created roadmap for conversion of commercial technologies to military use, roadmap approved and became best practice Project Officer, Lieutenant Intelligence Corps- I.D.F 2004  –  2005  (1 year) • Managed team of 5 in development of a technological solution to remove atmospheric haze in long range surveillance system, increasing effectiveness of the systems by 20% \n• Created roadmap for conversion of commercial technologies to military use, roadmap approved and became best practice Languages Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Product Management Business Development Product Marketing Cross-functional Team... Business Strategy Go-to-market Strategy Program Management Video Conferencing Start-ups Sales Presentations Global Business... Webinars Strategy Management Entrepreneurship Python Matlab Leadership Strategic Partnerships Cloud Computing See 5+     See less Skills  Product Management Business Development Product Marketing Cross-functional Team... Business Strategy Go-to-market Strategy Program Management Video Conferencing Start-ups Sales Presentations Global Business... Webinars Strategy Management Entrepreneurship Python Matlab Leadership Strategic Partnerships Cloud Computing See 5+     See less Product Management Business Development Product Marketing Cross-functional Team... Business Strategy Go-to-market Strategy Program Management Video Conferencing Start-ups Sales Presentations Global Business... Webinars Strategy Management Entrepreneurship Python Matlab Leadership Strategic Partnerships Cloud Computing See 5+     See less Product Management Business Development Product Marketing Cross-functional Team... Business Strategy Go-to-market Strategy Program Management Video Conferencing Start-ups Sales Presentations Global Business... Webinars Strategy Management Entrepreneurship Python Matlab Leadership Strategic Partnerships Cloud Computing See 5+     See less Education Massachusetts Institute of Technology - Sloan School of Management MBA (GMAT: 730),  General Management 2007  – 2009 • Elected head Teaching Assistant for Data, Models, and Decisions for Managers \n• Semi-finalist in the MIT $100K Business Plan Competition; Led Clean Energy Panel at MIT VC Conference Tel Aviv University M.Sc,  Biomedical Engineering 2005  – 2007 • Engineering faculty scholarship for academic excellence while serving full time in the military Tel Aviv University B.Sc,  Electrical Engineering 2000  – 2004 • Captain of the Varsity Soccer Team, led weekly practices and participation in national tournaments \n• Full scholarship from the Israeli Defense Force Massachusetts Institute of Technology - Sloan School of Management MBA (GMAT: 730),  General Management 2007  – 2009 • Elected head Teaching Assistant for Data, Models, and Decisions for Managers \n• Semi-finalist in the MIT $100K Business Plan Competition; Led Clean Energy Panel at MIT VC Conference Massachusetts Institute of Technology - Sloan School of Management MBA (GMAT: 730),  General Management 2007  – 2009 • Elected head Teaching Assistant for Data, Models, and Decisions for Managers \n• Semi-finalist in the MIT $100K Business Plan Competition; Led Clean Energy Panel at MIT VC Conference Massachusetts Institute of Technology - Sloan School of Management MBA (GMAT: 730),  General Management 2007  – 2009 • Elected head Teaching Assistant for Data, Models, and Decisions for Managers \n• Semi-finalist in the MIT $100K Business Plan Competition; Led Clean Energy Panel at MIT VC Conference Tel Aviv University M.Sc,  Biomedical Engineering 2005  – 2007 • Engineering faculty scholarship for academic excellence while serving full time in the military Tel Aviv University M.Sc,  Biomedical Engineering 2005  – 2007 • Engineering faculty scholarship for academic excellence while serving full time in the military Tel Aviv University M.Sc,  Biomedical Engineering 2005  – 2007 • Engineering faculty scholarship for academic excellence while serving full time in the military Tel Aviv University B.Sc,  Electrical Engineering 2000  – 2004 • Captain of the Varsity Soccer Team, led weekly practices and participation in national tournaments \n• Full scholarship from the Israeli Defense Force Tel Aviv University B.Sc,  Electrical Engineering 2000  – 2004 • Captain of the Varsity Soccer Team, led weekly practices and participation in national tournaments \n• Full scholarship from the Israeli Defense Force Tel Aviv University B.Sc,  Electrical Engineering 2000  – 2004 • Captain of the Varsity Soccer Team, led weekly practices and participation in national tournaments \n• Full scholarship from the Israeli Defense Force Honors & Awards Additional Honors & Awards Recipient of Market Development top performer award (Rock Star Award, FY11 full year) for outstanding performance. 2010/2011 \nRecipient of Market Development top performer award (Rock Star Award, FY11 first half) for outstanding performance. 2010 Additional Honors & Awards Recipient of Market Development top performer award (Rock Star Award, FY11 full year) for outstanding performance. 2010/2011 \nRecipient of Market Development top performer award (Rock Star Award, FY11 first half) for outstanding performance. 2010 Additional Honors & Awards Recipient of Market Development top performer award (Rock Star Award, FY11 full year) for outstanding performance. 2010/2011 \nRecipient of Market Development top performer award (Rock Star Award, FY11 first half) for outstanding performance. 2010 Additional Honors & Awards Recipient of Market Development top performer award (Rock Star Award, FY11 full year) for outstanding performance. 2010/2011 \nRecipient of Market Development top performer award (Rock Star Award, FY11 first half) for outstanding performance. 2010 ", "Languages German Native or bilingual proficiency English Full professional proficiency German Native or bilingual proficiency English Full professional proficiency German Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Channel Go-to-market Strategy Service Providers Channel Partners Partner Management Resellers Demand Generation Cisco Technologies Channel Sales Strategic Partnerships Partner Development Channel Strategy Pre-sales SMB Business Development WebEx Sales Process Unified Communications Managed Services Strategy Cloud Computing Business Alliances Telepresence Sales Enablement Solution Selling Product Management Data Center Network Architecture Enterprise Software EMEA Multi-channel Marketing Collaboration Solutions VoIP Storage Video Conferencing Strategic Alliances See 21+     See less Skills  Channel Go-to-market Strategy Service Providers Channel Partners Partner Management Resellers Demand Generation Cisco Technologies Channel Sales Strategic Partnerships Partner Development Channel Strategy Pre-sales SMB Business Development WebEx Sales Process Unified Communications Managed Services Strategy Cloud Computing Business Alliances Telepresence Sales Enablement Solution Selling Product Management Data Center Network Architecture Enterprise Software EMEA Multi-channel Marketing Collaboration Solutions VoIP Storage Video Conferencing Strategic Alliances See 21+     See less Channel Go-to-market Strategy Service Providers Channel Partners Partner Management Resellers Demand Generation Cisco Technologies Channel Sales Strategic Partnerships Partner Development Channel Strategy Pre-sales SMB Business Development WebEx Sales Process Unified Communications Managed Services Strategy Cloud Computing Business Alliances Telepresence Sales Enablement Solution Selling Product Management Data Center Network Architecture Enterprise Software EMEA Multi-channel Marketing Collaboration Solutions VoIP Storage Video Conferencing Strategic Alliances See 21+     See less Channel Go-to-market Strategy Service Providers Channel Partners Partner Management Resellers Demand Generation Cisco Technologies Channel Sales Strategic Partnerships Partner Development Channel Strategy Pre-sales SMB Business Development WebEx Sales Process Unified Communications Managed Services Strategy Cloud Computing Business Alliances Telepresence Sales Enablement Solution Selling Product Management Data Center Network Architecture Enterprise Software EMEA Multi-channel Marketing Collaboration Solutions VoIP Storage Video Conferencing Strategic Alliances See 21+     See less ", "Experience Business Development Manager, IoT/IoE Vertical and Solutions Group Cisco June 2015  – Present (3 months) London, United Kingdom Head of Business Development for Connected Lighting in EMEAR Business Development Manager - Innovation & IoE Cisco December 2012  –  June 2015  (2 years 7 months) London, United Kingdom I am currently focused on the key mega trend, Internet of Everything, which extends the widely known Internet of Things concept. Specifically my responsibility includes the creation of tangible use cases and developing an innovation ecosystem which is comprised of customers, traditional and non-traditional Cisco partners, early stage start-ups, and Industry boards. \n \nI am also the Operational Lead for the National Virtual Incubator (NVI) Alliance and a member of the Governing Board. The NVI is an alliance of universities/academia, research and science parks, local government partnerships, and innovation centres focused nurturing and developing entrepreneurship in the UK. (www.nvinetwork.com) \n \nPreviously I was the Cisco lead for IDEALondon (a partnership with University College London and DC Thomson), where I was on the Operational Board and Governing Board. IDEALondon is an innovation and incubation centre which has been jointly created with UCL and DC Thomson. I was part of the founding team which developed the centre from concept to launch. (www.idea-london.co.uk) \n \nIn parallel to the above, I am part of the core team which has developed Cisco UK&I's headline innovation programme, known as the British Innovation Gateway (BIG). This is a key strategic initiative which was created during our sponsorship of the London 2012 Olympic & Paralympic Games. Sales Business Development Manager - London 2012 Cisco Systems July 2011  –  December 2013  (2 years 6 months) London, United Kingdom Co-led the business development of all London 2012 related and adjacent business opportunities stemming from sponsorship of London 2012 Olympic and Paralympic Games. My responsibilities included customer engagements through executive briefings, close partnering with senior management from the London Organising Committee of the Olympic and Paralympic Games (LOCOG), development of case studies and sales enablement collateral, and evangelising at industry conferences. \n \nPost Games responsibilities included the creation of a strategy to address the Physical Legacy (equipment resale) through a sales programme and brokering strategic deals for community projects aligning to the overall Legacy of skills, learning, and innovation. Technical Account Manager / Sales Engineer Cisco January 2008  –  July 2011  (3 years 7 months) London, United Kingdom Technical account manager/pre-sales engineer assigned to named accounts in the Financial Sector and Mobile Service Provider accounts. Specialised in Core & Edge, Finance (enterprise), and Mobile service providers. \n \nI was responsible for the technical sales for a key strategic EMEAR mobile service provider, and then transitioned into a UK role focused on top tier UK financial accounts, where I developed trusted relationships with key technical stakeholders and senior management. Network Consulting Engineer Cisco April 2006  –  January 2008  (1 year 10 months) Reading, United Kingdom I worked as a technical consultant as part of the Advanced Services (Professional Services) division focused on Mobile and Service Provider Accounts in the UK& Ireland. In this role my responsibilities included: consultancy in design & operational processes, software life-cycle management, design reviews, software management reviews, informal training, configuration best practices, and testing support. Software Engineer Cisco January 2001  –  December 2005  (5 years) Sydney Area, Australia Part of the all-star development team working on the operating system (Cisco IOS) for the Cisco 7200, 7300, and 7400 routers. Responsibilities included lead engineer for GE device drivers (code: C and assembler), root cause analysis for key customer accounts, platform release migration/porting, IOS software maintenance and bug fixing, new product / embedded system development and quality assurance, and mentoring engineers in India and San Jose. Internship & Thesis Motorola November 1999  –  October 2000  (1 year) Sydney Area, Australia Chosen by Motorola Australia Research Centre to undertake a summer internship which developed into a sponsored final year (undergrad) thesis/dissertation. Areas of research and development: IPv6 zero configuration and Bluetooth Applications. Final year thesis was the creation of the first ever working Bluetooth keyboard and mouse. Business Development Manager, IoT/IoE Vertical and Solutions Group Cisco June 2015  – Present (3 months) London, United Kingdom Head of Business Development for Connected Lighting in EMEAR Business Development Manager, IoT/IoE Vertical and Solutions Group Cisco June 2015  – Present (3 months) London, United Kingdom Head of Business Development for Connected Lighting in EMEAR Business Development Manager - Innovation & IoE Cisco December 2012  –  June 2015  (2 years 7 months) London, United Kingdom I am currently focused on the key mega trend, Internet of Everything, which extends the widely known Internet of Things concept. Specifically my responsibility includes the creation of tangible use cases and developing an innovation ecosystem which is comprised of customers, traditional and non-traditional Cisco partners, early stage start-ups, and Industry boards. \n \nI am also the Operational Lead for the National Virtual Incubator (NVI) Alliance and a member of the Governing Board. The NVI is an alliance of universities/academia, research and science parks, local government partnerships, and innovation centres focused nurturing and developing entrepreneurship in the UK. (www.nvinetwork.com) \n \nPreviously I was the Cisco lead for IDEALondon (a partnership with University College London and DC Thomson), where I was on the Operational Board and Governing Board. IDEALondon is an innovation and incubation centre which has been jointly created with UCL and DC Thomson. I was part of the founding team which developed the centre from concept to launch. (www.idea-london.co.uk) \n \nIn parallel to the above, I am part of the core team which has developed Cisco UK&I's headline innovation programme, known as the British Innovation Gateway (BIG). This is a key strategic initiative which was created during our sponsorship of the London 2012 Olympic & Paralympic Games. Business Development Manager - Innovation & IoE Cisco December 2012  –  June 2015  (2 years 7 months) London, United Kingdom I am currently focused on the key mega trend, Internet of Everything, which extends the widely known Internet of Things concept. Specifically my responsibility includes the creation of tangible use cases and developing an innovation ecosystem which is comprised of customers, traditional and non-traditional Cisco partners, early stage start-ups, and Industry boards. \n \nI am also the Operational Lead for the National Virtual Incubator (NVI) Alliance and a member of the Governing Board. The NVI is an alliance of universities/academia, research and science parks, local government partnerships, and innovation centres focused nurturing and developing entrepreneurship in the UK. (www.nvinetwork.com) \n \nPreviously I was the Cisco lead for IDEALondon (a partnership with University College London and DC Thomson), where I was on the Operational Board and Governing Board. IDEALondon is an innovation and incubation centre which has been jointly created with UCL and DC Thomson. I was part of the founding team which developed the centre from concept to launch. (www.idea-london.co.uk) \n \nIn parallel to the above, I am part of the core team which has developed Cisco UK&I's headline innovation programme, known as the British Innovation Gateway (BIG). This is a key strategic initiative which was created during our sponsorship of the London 2012 Olympic & Paralympic Games. Sales Business Development Manager - London 2012 Cisco Systems July 2011  –  December 2013  (2 years 6 months) London, United Kingdom Co-led the business development of all London 2012 related and adjacent business opportunities stemming from sponsorship of London 2012 Olympic and Paralympic Games. My responsibilities included customer engagements through executive briefings, close partnering with senior management from the London Organising Committee of the Olympic and Paralympic Games (LOCOG), development of case studies and sales enablement collateral, and evangelising at industry conferences. \n \nPost Games responsibilities included the creation of a strategy to address the Physical Legacy (equipment resale) through a sales programme and brokering strategic deals for community projects aligning to the overall Legacy of skills, learning, and innovation. Sales Business Development Manager - London 2012 Cisco Systems July 2011  –  December 2013  (2 years 6 months) London, United Kingdom Co-led the business development of all London 2012 related and adjacent business opportunities stemming from sponsorship of London 2012 Olympic and Paralympic Games. My responsibilities included customer engagements through executive briefings, close partnering with senior management from the London Organising Committee of the Olympic and Paralympic Games (LOCOG), development of case studies and sales enablement collateral, and evangelising at industry conferences. \n \nPost Games responsibilities included the creation of a strategy to address the Physical Legacy (equipment resale) through a sales programme and brokering strategic deals for community projects aligning to the overall Legacy of skills, learning, and innovation. Technical Account Manager / Sales Engineer Cisco January 2008  –  July 2011  (3 years 7 months) London, United Kingdom Technical account manager/pre-sales engineer assigned to named accounts in the Financial Sector and Mobile Service Provider accounts. Specialised in Core & Edge, Finance (enterprise), and Mobile service providers. \n \nI was responsible for the technical sales for a key strategic EMEAR mobile service provider, and then transitioned into a UK role focused on top tier UK financial accounts, where I developed trusted relationships with key technical stakeholders and senior management. Technical Account Manager / Sales Engineer Cisco January 2008  –  July 2011  (3 years 7 months) London, United Kingdom Technical account manager/pre-sales engineer assigned to named accounts in the Financial Sector and Mobile Service Provider accounts. Specialised in Core & Edge, Finance (enterprise), and Mobile service providers. \n \nI was responsible for the technical sales for a key strategic EMEAR mobile service provider, and then transitioned into a UK role focused on top tier UK financial accounts, where I developed trusted relationships with key technical stakeholders and senior management. Network Consulting Engineer Cisco April 2006  –  January 2008  (1 year 10 months) Reading, United Kingdom I worked as a technical consultant as part of the Advanced Services (Professional Services) division focused on Mobile and Service Provider Accounts in the UK& Ireland. In this role my responsibilities included: consultancy in design & operational processes, software life-cycle management, design reviews, software management reviews, informal training, configuration best practices, and testing support. Network Consulting Engineer Cisco April 2006  –  January 2008  (1 year 10 months) Reading, United Kingdom I worked as a technical consultant as part of the Advanced Services (Professional Services) division focused on Mobile and Service Provider Accounts in the UK& Ireland. In this role my responsibilities included: consultancy in design & operational processes, software life-cycle management, design reviews, software management reviews, informal training, configuration best practices, and testing support. Software Engineer Cisco January 2001  –  December 2005  (5 years) Sydney Area, Australia Part of the all-star development team working on the operating system (Cisco IOS) for the Cisco 7200, 7300, and 7400 routers. Responsibilities included lead engineer for GE device drivers (code: C and assembler), root cause analysis for key customer accounts, platform release migration/porting, IOS software maintenance and bug fixing, new product / embedded system development and quality assurance, and mentoring engineers in India and San Jose. Software Engineer Cisco January 2001  –  December 2005  (5 years) Sydney Area, Australia Part of the all-star development team working on the operating system (Cisco IOS) for the Cisco 7200, 7300, and 7400 routers. Responsibilities included lead engineer for GE device drivers (code: C and assembler), root cause analysis for key customer accounts, platform release migration/porting, IOS software maintenance and bug fixing, new product / embedded system development and quality assurance, and mentoring engineers in India and San Jose. Internship & Thesis Motorola November 1999  –  October 2000  (1 year) Sydney Area, Australia Chosen by Motorola Australia Research Centre to undertake a summer internship which developed into a sponsored final year (undergrad) thesis/dissertation. Areas of research and development: IPv6 zero configuration and Bluetooth Applications. Final year thesis was the creation of the first ever working Bluetooth keyboard and mouse. Internship & Thesis Motorola November 1999  –  October 2000  (1 year) Sydney Area, Australia Chosen by Motorola Australia Research Centre to undertake a summer internship which developed into a sponsored final year (undergrad) thesis/dissertation. Areas of research and development: IPv6 zero configuration and Bluetooth Applications. Final year thesis was the creation of the first ever working Bluetooth keyboard and mouse. Languages Hindi Hindi Hindi Skills Cisco Technologies Internet of Things Innovation Entrepreneurship Cisco IOS Network Architecture Routing IP Data Center MPLS Unified Communications Telepresence Wireless Mobile Broadband Cloud Computing Virtualization CCIE See 2+     See less Skills  Cisco Technologies Internet of Things Innovation Entrepreneurship Cisco IOS Network Architecture Routing IP Data Center MPLS Unified Communications Telepresence Wireless Mobile Broadband Cloud Computing Virtualization CCIE See 2+     See less Cisco Technologies Internet of Things Innovation Entrepreneurship Cisco IOS Network Architecture Routing IP Data Center MPLS Unified Communications Telepresence Wireless Mobile Broadband Cloud Computing Virtualization CCIE See 2+     See less Cisco Technologies Internet of Things Innovation Entrepreneurship Cisco IOS Network Architecture Routing IP Data Center MPLS Unified Communications Telepresence Wireless Mobile Broadband Cloud Computing Virtualization CCIE See 2+     See less Education University of New South Wales Bachelor of Computer Engineering,  Computer Systems Networking and Telecommunications , 1st Class Honors 1997  – 2000 Activities and Societies:  Tutor for Digital Systems and Design\nNote taker for student with disabilities\nTechnical support team member for University ISP (Dis<>connect) Sydney Boys High School Selective School University of New South Wales Bachelor of Computer Engineering,  Computer Systems Networking and Telecommunications , 1st Class Honors 1997  – 2000 Activities and Societies:  Tutor for Digital Systems and Design\nNote taker for student with disabilities\nTechnical support team member for University ISP (Dis<>connect) University of New South Wales Bachelor of Computer Engineering,  Computer Systems Networking and Telecommunications , 1st Class Honors 1997  – 2000 Activities and Societies:  Tutor for Digital Systems and Design\nNote taker for student with disabilities\nTechnical support team member for University ISP (Dis<>connect) University of New South Wales Bachelor of Computer Engineering,  Computer Systems Networking and Telecommunications , 1st Class Honors 1997  – 2000 Activities and Societies:  Tutor for Digital Systems and Design\nNote taker for student with disabilities\nTechnical support team member for University ISP (Dis<>connect) Sydney Boys High School Selective School Sydney Boys High School Selective School Sydney Boys High School Selective School ", "Experience Europe, Middle East, Africa & Russia: Business Development Manager Cisco Systems International BV, The Netherlands June 2012  – Present (3 years 3 months) Europe, Middle East, Africa & Russia Europe, Business Development Manager Cisco Systems International BV, The Netherlands January 2010  –  June 2012  (2 years 6 months) The Netherlands Emerging Markets East: Program Manager, Free Flow of Goods Cisco Systems International BV, The Netherlands July 2008  –  December 2009  (1 year 6 months) Cisco Systems International BV, The Netherlands Europe, Middle East, Africa: Vendor Manager: Third Party Logistics Cisco Systems International BV, The Netherlands November 2005  –  July 2008  (2 years 9 months) Cisco Systems International BV, The Netherlands Europe, Middle East, Africa Customer Relationship Manager – Benelux region + Distributor Cisco Systems International BV, The Netherlands 2005  –  2005  (less than a year) Global Customer Relationship Manager – Service provider + Systems Integrator Cisco Systems International BV, The Netherlands 2001  –  2005  (4 years) Europe, Middle East, Africa Customer Relationship Manager – Service providers Cisco Systems International BV, The Netherlands August 2000  –  2001  (1 year) Commodity Trader Xanthos, Malta 1999  –  2000  (1 year) Europe, Middle East, Africa & Russia: Business Development Manager Cisco Systems International BV, The Netherlands June 2012  – Present (3 years 3 months) Europe, Middle East, Africa & Russia Europe, Middle East, Africa & Russia: Business Development Manager Cisco Systems International BV, The Netherlands June 2012  – Present (3 years 3 months) Europe, Middle East, Africa & Russia Europe, Business Development Manager Cisco Systems International BV, The Netherlands January 2010  –  June 2012  (2 years 6 months) The Netherlands Europe, Business Development Manager Cisco Systems International BV, The Netherlands January 2010  –  June 2012  (2 years 6 months) The Netherlands Emerging Markets East: Program Manager, Free Flow of Goods Cisco Systems International BV, The Netherlands July 2008  –  December 2009  (1 year 6 months) Cisco Systems International BV, The Netherlands Emerging Markets East: Program Manager, Free Flow of Goods Cisco Systems International BV, The Netherlands July 2008  –  December 2009  (1 year 6 months) Cisco Systems International BV, The Netherlands Europe, Middle East, Africa: Vendor Manager: Third Party Logistics Cisco Systems International BV, The Netherlands November 2005  –  July 2008  (2 years 9 months) Cisco Systems International BV, The Netherlands Europe, Middle East, Africa: Vendor Manager: Third Party Logistics Cisco Systems International BV, The Netherlands November 2005  –  July 2008  (2 years 9 months) Cisco Systems International BV, The Netherlands Europe, Middle East, Africa Customer Relationship Manager – Benelux region + Distributor Cisco Systems International BV, The Netherlands 2005  –  2005  (less than a year) Europe, Middle East, Africa Customer Relationship Manager – Benelux region + Distributor Cisco Systems International BV, The Netherlands 2005  –  2005  (less than a year) Global Customer Relationship Manager – Service provider + Systems Integrator Cisco Systems International BV, The Netherlands 2001  –  2005  (4 years) Global Customer Relationship Manager – Service provider + Systems Integrator Cisco Systems International BV, The Netherlands 2001  –  2005  (4 years) Europe, Middle East, Africa Customer Relationship Manager – Service providers Cisco Systems International BV, The Netherlands August 2000  –  2001  (1 year) Europe, Middle East, Africa Customer Relationship Manager – Service providers Cisco Systems International BV, The Netherlands August 2000  –  2001  (1 year) Commodity Trader Xanthos, Malta 1999  –  2000  (1 year) Commodity Trader Xanthos, Malta 1999  –  2000  (1 year) Languages English Native or bilingual proficiency Japanese Elementary proficiency French Elementary proficiency Italian Elementary proficiency Dutch Elementary proficiency Malay Elementary proficiency Maltese Elementary proficiency English Native or bilingual proficiency Japanese Elementary proficiency French Elementary proficiency Italian Elementary proficiency Dutch Elementary proficiency Malay Elementary proficiency Maltese Elementary proficiency English Native or bilingual proficiency Japanese Elementary proficiency French Elementary proficiency Italian Elementary proficiency Dutch Elementary proficiency Malay Elementary proficiency Maltese Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Elementary proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills Business Development Channel Strategy Vendor Management CRM Cross-functional Team... Supply Chain Management Collaboration Project Management Management Business Process Business Strategy Change Management Analysis Product Development B2B Project Planning Negotiation Sales See 4+     See less Skills  Business Development Channel Strategy Vendor Management CRM Cross-functional Team... Supply Chain Management Collaboration Project Management Management Business Process Business Strategy Change Management Analysis Product Development B2B Project Planning Negotiation Sales See 4+     See less Business Development Channel Strategy Vendor Management CRM Cross-functional Team... Supply Chain Management Collaboration Project Management Management Business Process Business Strategy Change Management Analysis Product Development B2B Project Planning Negotiation Sales See 4+     See less Business Development Channel Strategy Vendor Management CRM Cross-functional Team... Supply Chain Management Collaboration Project Management Management Business Process Business Strategy Change Management Analysis Product Development B2B Project Planning Negotiation Sales See 4+     See less Education University of Durham BSc 1995  – 1999 St Monica college malta University of Durham BSc 1995  – 1999 University of Durham BSc 1995  – 1999 University of Durham BSc 1995  – 1999 St Monica college malta St Monica college malta St Monica college malta Honors & Awards Additional Honors & Awards Several CAP awards within Cisco Additional Honors & Awards Several CAP awards within Cisco Additional Honors & Awards Several CAP awards within Cisco Additional Honors & Awards Several CAP awards within Cisco ", "Languages English Spanish Portuguese English Spanish Portuguese English Spanish Portuguese Skills Computer Hardware Computer Security Social Networking Microsoft Mac expertise Business Analysis International Business... Language Skills Cultural Diversity Cultural Awareness Business Intelligence Business Planning Home Networking Operating Systems Wireless Networking IP Networking Data Center International Sales IP Cisco Technologies Program Management Strategy Business Development Security Pre-sales Language Development Channel Partners Management Networking Solution Selling Switches Unified Communications Integration Network Design Storage Cloud Computing Go-to-market Strategy Network Architecture Network Security Routing Sales Operations Telepresence Virtualization VoIP See 29+     See less Skills  Computer Hardware Computer Security Social Networking Microsoft Mac expertise Business Analysis International Business... Language Skills Cultural Diversity Cultural Awareness Business Intelligence Business Planning Home Networking Operating Systems Wireless Networking IP Networking Data Center International Sales IP Cisco Technologies Program Management Strategy Business Development Security Pre-sales Language Development Channel Partners Management Networking Solution Selling Switches Unified Communications Integration Network Design Storage Cloud Computing Go-to-market Strategy Network Architecture Network Security Routing Sales Operations Telepresence Virtualization VoIP See 29+     See less Computer Hardware Computer Security Social Networking Microsoft Mac expertise Business Analysis International Business... Language Skills Cultural Diversity Cultural Awareness Business Intelligence Business Planning Home Networking Operating Systems Wireless Networking IP Networking Data Center International Sales IP Cisco Technologies Program Management Strategy Business Development Security Pre-sales Language Development Channel Partners Management Networking Solution Selling Switches Unified Communications Integration Network Design Storage Cloud Computing Go-to-market Strategy Network Architecture Network Security Routing Sales Operations Telepresence Virtualization VoIP See 29+     See less Computer Hardware Computer Security Social Networking Microsoft Mac expertise Business Analysis International Business... Language Skills Cultural Diversity Cultural Awareness Business Intelligence Business Planning Home Networking Operating Systems Wireless Networking IP Networking Data Center International Sales IP Cisco Technologies Program Management Strategy Business Development Security Pre-sales Language Development Channel Partners Management Networking Solution Selling Switches Unified Communications Integration Network Design Storage Cloud Computing Go-to-market Strategy Network Architecture Network Security Routing Sales Operations Telepresence Virtualization VoIP See 29+     See less ", "Experience Cloud and IoE Lead EMEAR Distribution Cisco August 2014  – Present (1 year 1 month) UK Business Development Manager, EMEAR Cisco Systems August 2011  – Present (4 years 1 month) Sales Business Development Manager, Europe Cisco May 2010  –  August 2011  (1 year 4 months) Sales Business Development Manager, Europe Cisco Systems 2004  –  April 2010  (6 years) Product Manager, CDN EMEA Cisco Systems 2002  –  2004  (2 years) Consulting Systems Engineer Cisco Systems 2000  –  2002  (2 years) Service Provider Systems Engineer Cisco Systems 1998  –  2001  (3 years) European Marketing Manager Shiva 1997  –  1998  (1 year) Product Manager Gandalf 1987  –  1997  (10 years) Network Engineer Strathclyde Regional Council 1982  –  1987  (5 years) Cloud and IoE Lead EMEAR Distribution Cisco August 2014  – Present (1 year 1 month) UK Cloud and IoE Lead EMEAR Distribution Cisco August 2014  – Present (1 year 1 month) UK Business Development Manager, EMEAR Cisco Systems August 2011  – Present (4 years 1 month) Business Development Manager, EMEAR Cisco Systems August 2011  – Present (4 years 1 month) Sales Business Development Manager, Europe Cisco May 2010  –  August 2011  (1 year 4 months) Sales Business Development Manager, Europe Cisco May 2010  –  August 2011  (1 year 4 months) Sales Business Development Manager, Europe Cisco Systems 2004  –  April 2010  (6 years) Sales Business Development Manager, Europe Cisco Systems 2004  –  April 2010  (6 years) Product Manager, CDN EMEA Cisco Systems 2002  –  2004  (2 years) Product Manager, CDN EMEA Cisco Systems 2002  –  2004  (2 years) Consulting Systems Engineer Cisco Systems 2000  –  2002  (2 years) Consulting Systems Engineer Cisco Systems 2000  –  2002  (2 years) Service Provider Systems Engineer Cisco Systems 1998  –  2001  (3 years) Service Provider Systems Engineer Cisco Systems 1998  –  2001  (3 years) European Marketing Manager Shiva 1997  –  1998  (1 year) European Marketing Manager Shiva 1997  –  1998  (1 year) Product Manager Gandalf 1987  –  1997  (10 years) Product Manager Gandalf 1987  –  1997  (10 years) Network Engineer Strathclyde Regional Council 1982  –  1987  (5 years) Network Engineer Strathclyde Regional Council 1982  –  1987  (5 years) Skills Enterprise Software Business Development Product Marketing Cloud Computing Telecommunications Value Propositions Marketing Pre-sales Cisco Technologies Product Management Managed Services Cross-functional Team... Skills  Enterprise Software Business Development Product Marketing Cloud Computing Telecommunications Value Propositions Marketing Pre-sales Cisco Technologies Product Management Managed Services Cross-functional Team... Enterprise Software Business Development Product Marketing Cloud Computing Telecommunications Value Propositions Marketing Pre-sales Cisco Technologies Product Management Managed Services Cross-functional Team... Enterprise Software Business Development Product Marketing Cloud Computing Telecommunications Value Propositions Marketing Pre-sales Cisco Technologies Product Management Managed Services Cross-functional Team... ", "Skills Business Development Vendor Management Strategy Program Management Team Building Cross-functional Team... Leadership Business Process... Management Go-to-market Strategy VoIP Business Intelligence Relationship Management Strategic Sourcing Operations Management Change Management Cloud Computing Research SaaS Strategic Partnerships See 5+     See less Skills  Business Development Vendor Management Strategy Program Management Team Building Cross-functional Team... Leadership Business Process... Management Go-to-market Strategy VoIP Business Intelligence Relationship Management Strategic Sourcing Operations Management Change Management Cloud Computing Research SaaS Strategic Partnerships See 5+     See less Business Development Vendor Management Strategy Program Management Team Building Cross-functional Team... Leadership Business Process... Management Go-to-market Strategy VoIP Business Intelligence Relationship Management Strategic Sourcing Operations Management Change Management Cloud Computing Research SaaS Strategic Partnerships See 5+     See less Business Development Vendor Management Strategy Program Management Team Building Cross-functional Team... Leadership Business Process... Management Go-to-market Strategy VoIP Business Intelligence Relationship Management Strategic Sourcing Operations Management Change Management Cloud Computing Research SaaS Strategic Partnerships See 5+     See less ", "Summary Twenty plus years in the networking industry with multiple leadership roles in sales, business development, sales operations, engineering and product related functions. Expertise in networking infrastructure, services, software technologies, cloud and XaaS solutions in both established and emerging markets across corporate and field organizations. Focus on development of large strategic engagements with the ability to understand technology advances and map to business transformation while exceeding revenue and engagement goals.\t \n \nSpecialties: high-tech sales and business development, IP networking, collaboration, SaaS, cloud, data center virtualization, sales engineering, sales operations Summary Twenty plus years in the networking industry with multiple leadership roles in sales, business development, sales operations, engineering and product related functions. Expertise in networking infrastructure, services, software technologies, cloud and XaaS solutions in both established and emerging markets across corporate and field organizations. Focus on development of large strategic engagements with the ability to understand technology advances and map to business transformation while exceeding revenue and engagement goals.\t \n \nSpecialties: high-tech sales and business development, IP networking, collaboration, SaaS, cloud, data center virtualization, sales engineering, sales operations Twenty plus years in the networking industry with multiple leadership roles in sales, business development, sales operations, engineering and product related functions. Expertise in networking infrastructure, services, software technologies, cloud and XaaS solutions in both established and emerging markets across corporate and field organizations. Focus on development of large strategic engagements with the ability to understand technology advances and map to business transformation while exceeding revenue and engagement goals.\t \n \nSpecialties: high-tech sales and business development, IP networking, collaboration, SaaS, cloud, data center virtualization, sales engineering, sales operations Twenty plus years in the networking industry with multiple leadership roles in sales, business development, sales operations, engineering and product related functions. Expertise in networking infrastructure, services, software technologies, cloud and XaaS solutions in both established and emerging markets across corporate and field organizations. Focus on development of large strategic engagements with the ability to understand technology advances and map to business transformation while exceeding revenue and engagement goals.\t \n \nSpecialties: high-tech sales and business development, IP networking, collaboration, SaaS, cloud, data center virtualization, sales engineering, sales operations Experience Senior Business Development Manager Cisco Systems 2012  – Present (3 years) Austin, Texas Area WORLDWIDE BUSINESS DEVELOPMENT LEAD: Worldwide responsibility with focus on the Americas for the business development activities for the Connected Industry and Energy Services Unit (CIESU). Responsible for demand generation, prospecting, pipeline, forecasting and capture of direct and partner led opportunities in the Internet of Things market. Closed 25 engagements ranging in deal size from $50K to $3M while exceeding fiscal goals. \nOPPORTUNITY DEVELOPMENT AND CLOSURE: Business lead for CIESU in the development and closure of service opportunities. Interfaced with account teams, subject matter experts, engineering, legal and partners to drive identified opportunities to closure. Led customer meetings, RFP responses and developed proposals for the team. Scoped, created, priced, negotiated and executed statements of work (SOWs). \nPIPELINE, FORECAST AND BOOKINGS: Worldwide responsibility for maintaining pipeline and forecast data in Salesforce.com. Tracked 60+ opportunities with a pipeline of $30M. Responsible for prioritizing opportunities to meet and exceed quarterly and fiscal booking goals.  \nSOLUTION DEVELOPMENT: Participated in the development of solutions for Cisco’s Internet of Things initiative. Contributed in the solution creation process by providing customer and field perspectives and market needs. Identified new strategic and tactical opportunities and revenue streams. Drove and executed on technical and business deliverables. Senior Business Development Manager Cisco Systems 2011  –  2012  (1 year) BUSINESS TRANSFORMATION: Defined and supported high touch, consultative selling model that engaged directly with sales account teams and end customers. Responsible for working with transformation clients with focus on driving business value propositions and revenue generation. \nPARTNER STRATEGY LEAD: Defined and orchestrated an integrated go-to-market strategy with System Integrator and resell partners with focus on growing industry relevance, solutions, joint customer engagements and revenue. Scaled team by coordinating strategy with the vertical, field sales, channel, and marketing teams. Defined and executed on partnerships with Accenture, Deloitte, Comstor, Dimension Data, Verizon and other Cisco partners. \nSALES OPERATIONS: Provided tactical support to meet and exceed revenue goal of $1.5B and 25% annual revenue growth for the manufacturing vertical. Defined and drove tools needed to scale and track the business to meet both engagement and financial goals. Sales Business Development Manager / Partner Account Manager Cisco Systems 2006  –  2011  (5 years) BUSINESS DEVELOPMENT STRATEGY LEAD: Responsible for determining and executing strategy for the Raytheon account team. Built relationships and engaged with Raytheon CXOs and executives to capture joint business opportunities worth $1M to $20M to Cisco in the areas of cyber security, data center virtualization, cloud and SaaS/collaboration. \nCHANNEL MANAGER LEAD: Team lead responsible for channel relationship with Boeing Defense, Space and Security (BDS). Maintained and grew relationship responsible for program capture and delivery of technology solutions to the United States federal government in the DoD, Intelligence, NASA and International markets. Supported federal sales organization’s strategy and advance technology initiatives by expanding program business and pipeline with engagements ranging from $100K to $200M to Cisco. \nEXCEEDED QUOTA: Exceeded quota in fiscal years 2008, 2009 and 2010. Awarded Sales Champion for fiscal year 2009 by being among the top 10% of Cisco’s worldwide sales organization in quota attainment. Received Sales Achiever award in fiscal years 2008 and 2010. \nDEFINED AND GREW STRATEGIC ALLIANCE: Built and grew strategic alliance between Cisco and Boeing BDS. Identified, developed and delivered on relationships at all levels of Boeing while building thought leadership. Called on and met with line of business Presidents and senior Boeing executives to build awareness and define alliance strategies and priorities. Implemented alliance initiatives defined by the alliance advisory board. Increased awareness of alliance programs through marketing campaigns. \nDROVE ADVANCE TECHNOLOGY AND ADJACENT MARKETS: Expanded Cisco footprint by growing advance technology practices inside Boeing BDS and Raytheon. Practices included collaboration/SaaS, data center virtualization, cloud, physical security, cyber security and connected real estate. Worked with Cisco partners VMware, EMC and World Wide Technology to increase Cisco revenue. Senior Advance Services Consultant / Consulting Engineer Cisco Systems 2003  –  2006  (3 years) BUSINESS DEVELOPMENT MANAGER: Responsible for the development and capture of business for Cisco’s consulting services in the federal government area with focus on large system integrators. Worked with the federal channel sales teams, Internet Business Solutions Group and Global Defense Space and Security group to develop and drive business.  \nTEAM LEAD, NETWORK CONSULTING PRACTICE FOR PROFIT: Led team responsible for providing network consulting services to large US defense system integrator. Team consisted of three for profit consultants plus six support engineers from internal business unit. \nDEFINED AND DROVE STRATEGY: Worked with team members to understand both the system integrator and end customer requirements. Defined and drove strategy to educate system integrator in the areas of data networking and Cisco technology. Successfully defended Cisco technologies against traditional and non-traditional competitors in trade studies. Mapped end customer requirements to refine system integrator's strategy for the program. Worked to expand consulting presence into other programs inside the system integrator.  \nCAPTURED REVENUE AND MINDSHARE: Identified and increased both hardware and services revenue for Cisco beyond the original consulting fees for the program. Expanded hardware revenue opportunity from $1M to $10M. Also expanded services revenue from $1.8M to greater than $12M with potential of over $200M over life of the program. Accomplished by positioning Cisco as the sole provider of routing and switching technology for the program. \nORGANIZED AND MANAGED INTERNAL RESOURCES: Organized and managed the internal support team needed to capture the business. Worked directly with executive management, internal development groups, legal and contracts, business development and federal sales organizations to close the business. Worked to resolve challenges on both the business and technology side of the opportunity. Business Development Manager Cisco Systems 1999  –  2003  (4 years) CUSTOMER / SALES ENGAGEMENT: Provided customer-facing sales support for Operations Support Systems (OSS) and Business Support Systems (BSS) product sales. Supported account teams in customer engagements and presentations, lab demonstrations, proposal / RFP responses, network configuration and design and system pricing. Geographic responsibility for North American and Latin American markets. \nDEFINED AND DROVE STRATEGY: Defined and drove Cisco’s OSS strategy in the areas of Metro Ethernet, IPVPN and MPLS technologies. Participated and spoke at industry seminars regarding strategy. \nFIELD ADVOCATE: Provided field thoughts and requirements into business unit projects and meetings. Worked with account teams to define end customer needs. Authored and drove plans for solutions to meet the needs while assisting in the closing of business. Able to bring both internal and external organizations together to meet customer needs. Manager, Field Marketing Cisco Systems 1998  –  1999  (1 year) CUSTOMER / SALES ENGAGEMENT: Led team that provided account team support for the selling of Cisco Systems products totaling over $130M annually into the IXC market. Led a team of field marketing managers who supported account teams in customer engagement and presentation, lab demonstrations and proposal / RFP response. \nFIELD LIAISON: Gathered and presented requirements of the IXC sells area to corporate engineering and marketing groups. Worked with corporate marketing to develop field services and revenue enhancement programs. \nSOLUTION DEVELOPMENT: Drove individually customized business development efforts for Cisco’s top next-generation service providers around technology solutions. Solutions included Voice over IP, IP core and access, broadband access, frame relay, ATM, optical transport and managed data services.  \nJOINT REVENUE PROGRAMS: Worked with Cisco Powered Network carriers in the development of joint revenue programs through the introduction of data services based on the Internet / IP and traditional frame relay and ATM offerings. Technical Sales Specialist Cisco Systems 1998  –  1998  (less than a year) SENIOR SALES OVERLAY SALES ENGINEERING: Responsible for working with account teams on strategic sales opportunities in the operation. Provided subject matter expert support in voice/data/video convergence, advanced IP services and ATM services. Presented Cisco’s architecture, strategy and vision to service providers to include executive level, engineering, marketing and sales personnel. \nBUSINESS DEVELOPMENT/PARTNER PROGRAMS: Worked with service providers to develop and jointly implement partner programs to drive revenue to both Cisco and the provider. Worked with both marketing and engineering organizations within the service provider.  \nSTRATEGIC PLANNING: Provided and consulted to sales management on account strategy and planning. Drove technical architectural strategy across the sales operation. \nCORPORATE ENGINEERING LIAISON: Worked with corporate engineering teams to define complete end-to-end service solutions and product strategies for carrier customer base. System Engineer Cisco Systems 1997  –  1998  (1 year) SALES ENGINEERING: Teamed with business development account manager responsible for engineering unique networking solutions and executing sales strategy to uncover and secure new business for Cisco Systems. \nPARTNERSHIPS: Successful in securing a strategic partnership between Sprint and Cisco Systems. \nDESIGN AND IMPLEMENTATION: Worked with Sprint on the preliminary designs for the Sprint ION and other Sprint strategic projects. Projects based on converged voice/video/data services across an ATM backbone. Also worked with Sprint on the early development of broadband access technologies to include xDSL and fixed broadband wireless. System Engineer FORE Systems 1995  –  1997  (2 years) TECHNOLOGY EVANGELIST: Primary responsibilities encompassed working in the carrier market with the goal of advancing ATM networks. Focus geared towards end-to-end solutions and legacy network integration. Worked with FORE's carrier customers in the research, design and implementation of ATM networks; both service and infrastructure. \nCHANNEL SALES SUPPORT: Provided product and technical support for FORE products. Conducted basic ATM classes for carrier field sales and network engineers. Classes consisted of ATM theory, signaling and LAN emulation. \nSALES ENGINEERING: Worked with public carriers in the advancement of ATM networking. Provided support for CPE resell, ATM service definition, network design and implementations. Product Manager, ATM Services Sprint Nextel 1994  –  1995  (1 year) TECHNICAL SERVICE DEFINITION: Continuing design, improvement and implementation of Sprint's public ATM network to meet the demands of the marketplace. Provided technical knowledge and documentation related to service. Worked with both commercial and government customers to resolve and implement high speed applications on Sprint's ATM network. \nMARKETING LIAISON TO NETWORK ENGINEERING AND RESEARCH: Worked extensively with Sprint's research, engineering and operations groups to meet the product requirements as defined by product marketing. Evaluated and contributed to the design of Sprint's ATM services.  \nSTANDARDS SUPPORT: Interface with industry groups and associations for the standardization and advancement of broadband networks that include the ATM Forum, IETF and ITU. Attended ATM Forum meetings and represented Sprint in the Services Aspect and Application technical work group. International Sales Manager Sprint International / Alcatel Data Networks 1988  –  1994  (6 years) International Sales Manager, Americas - ACCOUNT MANAGEMENT and TERRITORY EXPANSION \n \nSales Engineer, Americas - SALES SUPPORT \n \nMember of Technical Staff - FIRMWARE DEVELOPMENT Senior Business Development Manager Cisco Systems 2012  – Present (3 years) Austin, Texas Area WORLDWIDE BUSINESS DEVELOPMENT LEAD: Worldwide responsibility with focus on the Americas for the business development activities for the Connected Industry and Energy Services Unit (CIESU). Responsible for demand generation, prospecting, pipeline, forecasting and capture of direct and partner led opportunities in the Internet of Things market. Closed 25 engagements ranging in deal size from $50K to $3M while exceeding fiscal goals. \nOPPORTUNITY DEVELOPMENT AND CLOSURE: Business lead for CIESU in the development and closure of service opportunities. Interfaced with account teams, subject matter experts, engineering, legal and partners to drive identified opportunities to closure. Led customer meetings, RFP responses and developed proposals for the team. Scoped, created, priced, negotiated and executed statements of work (SOWs). \nPIPELINE, FORECAST AND BOOKINGS: Worldwide responsibility for maintaining pipeline and forecast data in Salesforce.com. Tracked 60+ opportunities with a pipeline of $30M. Responsible for prioritizing opportunities to meet and exceed quarterly and fiscal booking goals.  \nSOLUTION DEVELOPMENT: Participated in the development of solutions for Cisco’s Internet of Things initiative. Contributed in the solution creation process by providing customer and field perspectives and market needs. Identified new strategic and tactical opportunities and revenue streams. Drove and executed on technical and business deliverables. Senior Business Development Manager Cisco Systems 2012  – Present (3 years) Austin, Texas Area WORLDWIDE BUSINESS DEVELOPMENT LEAD: Worldwide responsibility with focus on the Americas for the business development activities for the Connected Industry and Energy Services Unit (CIESU). Responsible for demand generation, prospecting, pipeline, forecasting and capture of direct and partner led opportunities in the Internet of Things market. Closed 25 engagements ranging in deal size from $50K to $3M while exceeding fiscal goals. \nOPPORTUNITY DEVELOPMENT AND CLOSURE: Business lead for CIESU in the development and closure of service opportunities. Interfaced with account teams, subject matter experts, engineering, legal and partners to drive identified opportunities to closure. Led customer meetings, RFP responses and developed proposals for the team. Scoped, created, priced, negotiated and executed statements of work (SOWs). \nPIPELINE, FORECAST AND BOOKINGS: Worldwide responsibility for maintaining pipeline and forecast data in Salesforce.com. Tracked 60+ opportunities with a pipeline of $30M. Responsible for prioritizing opportunities to meet and exceed quarterly and fiscal booking goals.  \nSOLUTION DEVELOPMENT: Participated in the development of solutions for Cisco’s Internet of Things initiative. Contributed in the solution creation process by providing customer and field perspectives and market needs. Identified new strategic and tactical opportunities and revenue streams. Drove and executed on technical and business deliverables. Senior Business Development Manager Cisco Systems 2011  –  2012  (1 year) BUSINESS TRANSFORMATION: Defined and supported high touch, consultative selling model that engaged directly with sales account teams and end customers. Responsible for working with transformation clients with focus on driving business value propositions and revenue generation. \nPARTNER STRATEGY LEAD: Defined and orchestrated an integrated go-to-market strategy with System Integrator and resell partners with focus on growing industry relevance, solutions, joint customer engagements and revenue. Scaled team by coordinating strategy with the vertical, field sales, channel, and marketing teams. Defined and executed on partnerships with Accenture, Deloitte, Comstor, Dimension Data, Verizon and other Cisco partners. \nSALES OPERATIONS: Provided tactical support to meet and exceed revenue goal of $1.5B and 25% annual revenue growth for the manufacturing vertical. Defined and drove tools needed to scale and track the business to meet both engagement and financial goals. Senior Business Development Manager Cisco Systems 2011  –  2012  (1 year) BUSINESS TRANSFORMATION: Defined and supported high touch, consultative selling model that engaged directly with sales account teams and end customers. Responsible for working with transformation clients with focus on driving business value propositions and revenue generation. \nPARTNER STRATEGY LEAD: Defined and orchestrated an integrated go-to-market strategy with System Integrator and resell partners with focus on growing industry relevance, solutions, joint customer engagements and revenue. Scaled team by coordinating strategy with the vertical, field sales, channel, and marketing teams. Defined and executed on partnerships with Accenture, Deloitte, Comstor, Dimension Data, Verizon and other Cisco partners. \nSALES OPERATIONS: Provided tactical support to meet and exceed revenue goal of $1.5B and 25% annual revenue growth for the manufacturing vertical. Defined and drove tools needed to scale and track the business to meet both engagement and financial goals. Sales Business Development Manager / Partner Account Manager Cisco Systems 2006  –  2011  (5 years) BUSINESS DEVELOPMENT STRATEGY LEAD: Responsible for determining and executing strategy for the Raytheon account team. Built relationships and engaged with Raytheon CXOs and executives to capture joint business opportunities worth $1M to $20M to Cisco in the areas of cyber security, data center virtualization, cloud and SaaS/collaboration. \nCHANNEL MANAGER LEAD: Team lead responsible for channel relationship with Boeing Defense, Space and Security (BDS). Maintained and grew relationship responsible for program capture and delivery of technology solutions to the United States federal government in the DoD, Intelligence, NASA and International markets. Supported federal sales organization’s strategy and advance technology initiatives by expanding program business and pipeline with engagements ranging from $100K to $200M to Cisco. \nEXCEEDED QUOTA: Exceeded quota in fiscal years 2008, 2009 and 2010. Awarded Sales Champion for fiscal year 2009 by being among the top 10% of Cisco’s worldwide sales organization in quota attainment. Received Sales Achiever award in fiscal years 2008 and 2010. \nDEFINED AND GREW STRATEGIC ALLIANCE: Built and grew strategic alliance between Cisco and Boeing BDS. Identified, developed and delivered on relationships at all levels of Boeing while building thought leadership. Called on and met with line of business Presidents and senior Boeing executives to build awareness and define alliance strategies and priorities. Implemented alliance initiatives defined by the alliance advisory board. Increased awareness of alliance programs through marketing campaigns. \nDROVE ADVANCE TECHNOLOGY AND ADJACENT MARKETS: Expanded Cisco footprint by growing advance technology practices inside Boeing BDS and Raytheon. Practices included collaboration/SaaS, data center virtualization, cloud, physical security, cyber security and connected real estate. Worked with Cisco partners VMware, EMC and World Wide Technology to increase Cisco revenue. Sales Business Development Manager / Partner Account Manager Cisco Systems 2006  –  2011  (5 years) BUSINESS DEVELOPMENT STRATEGY LEAD: Responsible for determining and executing strategy for the Raytheon account team. Built relationships and engaged with Raytheon CXOs and executives to capture joint business opportunities worth $1M to $20M to Cisco in the areas of cyber security, data center virtualization, cloud and SaaS/collaboration. \nCHANNEL MANAGER LEAD: Team lead responsible for channel relationship with Boeing Defense, Space and Security (BDS). Maintained and grew relationship responsible for program capture and delivery of technology solutions to the United States federal government in the DoD, Intelligence, NASA and International markets. Supported federal sales organization’s strategy and advance technology initiatives by expanding program business and pipeline with engagements ranging from $100K to $200M to Cisco. \nEXCEEDED QUOTA: Exceeded quota in fiscal years 2008, 2009 and 2010. Awarded Sales Champion for fiscal year 2009 by being among the top 10% of Cisco’s worldwide sales organization in quota attainment. Received Sales Achiever award in fiscal years 2008 and 2010. \nDEFINED AND GREW STRATEGIC ALLIANCE: Built and grew strategic alliance between Cisco and Boeing BDS. Identified, developed and delivered on relationships at all levels of Boeing while building thought leadership. Called on and met with line of business Presidents and senior Boeing executives to build awareness and define alliance strategies and priorities. Implemented alliance initiatives defined by the alliance advisory board. Increased awareness of alliance programs through marketing campaigns. \nDROVE ADVANCE TECHNOLOGY AND ADJACENT MARKETS: Expanded Cisco footprint by growing advance technology practices inside Boeing BDS and Raytheon. Practices included collaboration/SaaS, data center virtualization, cloud, physical security, cyber security and connected real estate. Worked with Cisco partners VMware, EMC and World Wide Technology to increase Cisco revenue. Senior Advance Services Consultant / Consulting Engineer Cisco Systems 2003  –  2006  (3 years) BUSINESS DEVELOPMENT MANAGER: Responsible for the development and capture of business for Cisco’s consulting services in the federal government area with focus on large system integrators. Worked with the federal channel sales teams, Internet Business Solutions Group and Global Defense Space and Security group to develop and drive business.  \nTEAM LEAD, NETWORK CONSULTING PRACTICE FOR PROFIT: Led team responsible for providing network consulting services to large US defense system integrator. Team consisted of three for profit consultants plus six support engineers from internal business unit. \nDEFINED AND DROVE STRATEGY: Worked with team members to understand both the system integrator and end customer requirements. Defined and drove strategy to educate system integrator in the areas of data networking and Cisco technology. Successfully defended Cisco technologies against traditional and non-traditional competitors in trade studies. Mapped end customer requirements to refine system integrator's strategy for the program. Worked to expand consulting presence into other programs inside the system integrator.  \nCAPTURED REVENUE AND MINDSHARE: Identified and increased both hardware and services revenue for Cisco beyond the original consulting fees for the program. Expanded hardware revenue opportunity from $1M to $10M. Also expanded services revenue from $1.8M to greater than $12M with potential of over $200M over life of the program. Accomplished by positioning Cisco as the sole provider of routing and switching technology for the program. \nORGANIZED AND MANAGED INTERNAL RESOURCES: Organized and managed the internal support team needed to capture the business. Worked directly with executive management, internal development groups, legal and contracts, business development and federal sales organizations to close the business. Worked to resolve challenges on both the business and technology side of the opportunity. Senior Advance Services Consultant / Consulting Engineer Cisco Systems 2003  –  2006  (3 years) BUSINESS DEVELOPMENT MANAGER: Responsible for the development and capture of business for Cisco’s consulting services in the federal government area with focus on large system integrators. Worked with the federal channel sales teams, Internet Business Solutions Group and Global Defense Space and Security group to develop and drive business.  \nTEAM LEAD, NETWORK CONSULTING PRACTICE FOR PROFIT: Led team responsible for providing network consulting services to large US defense system integrator. Team consisted of three for profit consultants plus six support engineers from internal business unit. \nDEFINED AND DROVE STRATEGY: Worked with team members to understand both the system integrator and end customer requirements. Defined and drove strategy to educate system integrator in the areas of data networking and Cisco technology. Successfully defended Cisco technologies against traditional and non-traditional competitors in trade studies. Mapped end customer requirements to refine system integrator's strategy for the program. Worked to expand consulting presence into other programs inside the system integrator.  \nCAPTURED REVENUE AND MINDSHARE: Identified and increased both hardware and services revenue for Cisco beyond the original consulting fees for the program. Expanded hardware revenue opportunity from $1M to $10M. Also expanded services revenue from $1.8M to greater than $12M with potential of over $200M over life of the program. Accomplished by positioning Cisco as the sole provider of routing and switching technology for the program. \nORGANIZED AND MANAGED INTERNAL RESOURCES: Organized and managed the internal support team needed to capture the business. Worked directly with executive management, internal development groups, legal and contracts, business development and federal sales organizations to close the business. Worked to resolve challenges on both the business and technology side of the opportunity. Business Development Manager Cisco Systems 1999  –  2003  (4 years) CUSTOMER / SALES ENGAGEMENT: Provided customer-facing sales support for Operations Support Systems (OSS) and Business Support Systems (BSS) product sales. Supported account teams in customer engagements and presentations, lab demonstrations, proposal / RFP responses, network configuration and design and system pricing. Geographic responsibility for North American and Latin American markets. \nDEFINED AND DROVE STRATEGY: Defined and drove Cisco’s OSS strategy in the areas of Metro Ethernet, IPVPN and MPLS technologies. Participated and spoke at industry seminars regarding strategy. \nFIELD ADVOCATE: Provided field thoughts and requirements into business unit projects and meetings. Worked with account teams to define end customer needs. Authored and drove plans for solutions to meet the needs while assisting in the closing of business. Able to bring both internal and external organizations together to meet customer needs. Business Development Manager Cisco Systems 1999  –  2003  (4 years) CUSTOMER / SALES ENGAGEMENT: Provided customer-facing sales support for Operations Support Systems (OSS) and Business Support Systems (BSS) product sales. Supported account teams in customer engagements and presentations, lab demonstrations, proposal / RFP responses, network configuration and design and system pricing. Geographic responsibility for North American and Latin American markets. \nDEFINED AND DROVE STRATEGY: Defined and drove Cisco’s OSS strategy in the areas of Metro Ethernet, IPVPN and MPLS technologies. Participated and spoke at industry seminars regarding strategy. \nFIELD ADVOCATE: Provided field thoughts and requirements into business unit projects and meetings. Worked with account teams to define end customer needs. Authored and drove plans for solutions to meet the needs while assisting in the closing of business. Able to bring both internal and external organizations together to meet customer needs. Manager, Field Marketing Cisco Systems 1998  –  1999  (1 year) CUSTOMER / SALES ENGAGEMENT: Led team that provided account team support for the selling of Cisco Systems products totaling over $130M annually into the IXC market. Led a team of field marketing managers who supported account teams in customer engagement and presentation, lab demonstrations and proposal / RFP response. \nFIELD LIAISON: Gathered and presented requirements of the IXC sells area to corporate engineering and marketing groups. Worked with corporate marketing to develop field services and revenue enhancement programs. \nSOLUTION DEVELOPMENT: Drove individually customized business development efforts for Cisco’s top next-generation service providers around technology solutions. Solutions included Voice over IP, IP core and access, broadband access, frame relay, ATM, optical transport and managed data services.  \nJOINT REVENUE PROGRAMS: Worked with Cisco Powered Network carriers in the development of joint revenue programs through the introduction of data services based on the Internet / IP and traditional frame relay and ATM offerings. Manager, Field Marketing Cisco Systems 1998  –  1999  (1 year) CUSTOMER / SALES ENGAGEMENT: Led team that provided account team support for the selling of Cisco Systems products totaling over $130M annually into the IXC market. Led a team of field marketing managers who supported account teams in customer engagement and presentation, lab demonstrations and proposal / RFP response. \nFIELD LIAISON: Gathered and presented requirements of the IXC sells area to corporate engineering and marketing groups. Worked with corporate marketing to develop field services and revenue enhancement programs. \nSOLUTION DEVELOPMENT: Drove individually customized business development efforts for Cisco’s top next-generation service providers around technology solutions. Solutions included Voice over IP, IP core and access, broadband access, frame relay, ATM, optical transport and managed data services.  \nJOINT REVENUE PROGRAMS: Worked with Cisco Powered Network carriers in the development of joint revenue programs through the introduction of data services based on the Internet / IP and traditional frame relay and ATM offerings. Technical Sales Specialist Cisco Systems 1998  –  1998  (less than a year) SENIOR SALES OVERLAY SALES ENGINEERING: Responsible for working with account teams on strategic sales opportunities in the operation. Provided subject matter expert support in voice/data/video convergence, advanced IP services and ATM services. Presented Cisco’s architecture, strategy and vision to service providers to include executive level, engineering, marketing and sales personnel. \nBUSINESS DEVELOPMENT/PARTNER PROGRAMS: Worked with service providers to develop and jointly implement partner programs to drive revenue to both Cisco and the provider. Worked with both marketing and engineering organizations within the service provider.  \nSTRATEGIC PLANNING: Provided and consulted to sales management on account strategy and planning. Drove technical architectural strategy across the sales operation. \nCORPORATE ENGINEERING LIAISON: Worked with corporate engineering teams to define complete end-to-end service solutions and product strategies for carrier customer base. Technical Sales Specialist Cisco Systems 1998  –  1998  (less than a year) SENIOR SALES OVERLAY SALES ENGINEERING: Responsible for working with account teams on strategic sales opportunities in the operation. Provided subject matter expert support in voice/data/video convergence, advanced IP services and ATM services. Presented Cisco’s architecture, strategy and vision to service providers to include executive level, engineering, marketing and sales personnel. \nBUSINESS DEVELOPMENT/PARTNER PROGRAMS: Worked with service providers to develop and jointly implement partner programs to drive revenue to both Cisco and the provider. Worked with both marketing and engineering organizations within the service provider.  \nSTRATEGIC PLANNING: Provided and consulted to sales management on account strategy and planning. Drove technical architectural strategy across the sales operation. \nCORPORATE ENGINEERING LIAISON: Worked with corporate engineering teams to define complete end-to-end service solutions and product strategies for carrier customer base. System Engineer Cisco Systems 1997  –  1998  (1 year) SALES ENGINEERING: Teamed with business development account manager responsible for engineering unique networking solutions and executing sales strategy to uncover and secure new business for Cisco Systems. \nPARTNERSHIPS: Successful in securing a strategic partnership between Sprint and Cisco Systems. \nDESIGN AND IMPLEMENTATION: Worked with Sprint on the preliminary designs for the Sprint ION and other Sprint strategic projects. Projects based on converged voice/video/data services across an ATM backbone. Also worked with Sprint on the early development of broadband access technologies to include xDSL and fixed broadband wireless. System Engineer Cisco Systems 1997  –  1998  (1 year) SALES ENGINEERING: Teamed with business development account manager responsible for engineering unique networking solutions and executing sales strategy to uncover and secure new business for Cisco Systems. \nPARTNERSHIPS: Successful in securing a strategic partnership between Sprint and Cisco Systems. \nDESIGN AND IMPLEMENTATION: Worked with Sprint on the preliminary designs for the Sprint ION and other Sprint strategic projects. Projects based on converged voice/video/data services across an ATM backbone. Also worked with Sprint on the early development of broadband access technologies to include xDSL and fixed broadband wireless. System Engineer FORE Systems 1995  –  1997  (2 years) TECHNOLOGY EVANGELIST: Primary responsibilities encompassed working in the carrier market with the goal of advancing ATM networks. Focus geared towards end-to-end solutions and legacy network integration. Worked with FORE's carrier customers in the research, design and implementation of ATM networks; both service and infrastructure. \nCHANNEL SALES SUPPORT: Provided product and technical support for FORE products. Conducted basic ATM classes for carrier field sales and network engineers. Classes consisted of ATM theory, signaling and LAN emulation. \nSALES ENGINEERING: Worked with public carriers in the advancement of ATM networking. Provided support for CPE resell, ATM service definition, network design and implementations. System Engineer FORE Systems 1995  –  1997  (2 years) TECHNOLOGY EVANGELIST: Primary responsibilities encompassed working in the carrier market with the goal of advancing ATM networks. Focus geared towards end-to-end solutions and legacy network integration. Worked with FORE's carrier customers in the research, design and implementation of ATM networks; both service and infrastructure. \nCHANNEL SALES SUPPORT: Provided product and technical support for FORE products. Conducted basic ATM classes for carrier field sales and network engineers. Classes consisted of ATM theory, signaling and LAN emulation. \nSALES ENGINEERING: Worked with public carriers in the advancement of ATM networking. Provided support for CPE resell, ATM service definition, network design and implementations. Product Manager, ATM Services Sprint Nextel 1994  –  1995  (1 year) TECHNICAL SERVICE DEFINITION: Continuing design, improvement and implementation of Sprint's public ATM network to meet the demands of the marketplace. Provided technical knowledge and documentation related to service. Worked with both commercial and government customers to resolve and implement high speed applications on Sprint's ATM network. \nMARKETING LIAISON TO NETWORK ENGINEERING AND RESEARCH: Worked extensively with Sprint's research, engineering and operations groups to meet the product requirements as defined by product marketing. Evaluated and contributed to the design of Sprint's ATM services.  \nSTANDARDS SUPPORT: Interface with industry groups and associations for the standardization and advancement of broadband networks that include the ATM Forum, IETF and ITU. Attended ATM Forum meetings and represented Sprint in the Services Aspect and Application technical work group. Product Manager, ATM Services Sprint Nextel 1994  –  1995  (1 year) TECHNICAL SERVICE DEFINITION: Continuing design, improvement and implementation of Sprint's public ATM network to meet the demands of the marketplace. Provided technical knowledge and documentation related to service. Worked with both commercial and government customers to resolve and implement high speed applications on Sprint's ATM network. \nMARKETING LIAISON TO NETWORK ENGINEERING AND RESEARCH: Worked extensively with Sprint's research, engineering and operations groups to meet the product requirements as defined by product marketing. Evaluated and contributed to the design of Sprint's ATM services.  \nSTANDARDS SUPPORT: Interface with industry groups and associations for the standardization and advancement of broadband networks that include the ATM Forum, IETF and ITU. Attended ATM Forum meetings and represented Sprint in the Services Aspect and Application technical work group. International Sales Manager Sprint International / Alcatel Data Networks 1988  –  1994  (6 years) International Sales Manager, Americas - ACCOUNT MANAGEMENT and TERRITORY EXPANSION \n \nSales Engineer, Americas - SALES SUPPORT \n \nMember of Technical Staff - FIRMWARE DEVELOPMENT International Sales Manager Sprint International / Alcatel Data Networks 1988  –  1994  (6 years) International Sales Manager, Americas - ACCOUNT MANAGEMENT and TERRITORY EXPANSION \n \nSales Engineer, Americas - SALES SUPPORT \n \nMember of Technical Staff - FIRMWARE DEVELOPMENT Skills Cloud Computing Unified Communications New Business Development Go-to-market Strategy Enterprise Software Strategic Partnerships SaaS VoIP Strategy MPLS Solution Selling Skills  Cloud Computing Unified Communications New Business Development Go-to-market Strategy Enterprise Software Strategic Partnerships SaaS VoIP Strategy MPLS Solution Selling Cloud Computing Unified Communications New Business Development Go-to-market Strategy Enterprise Software Strategic Partnerships SaaS VoIP Strategy MPLS Solution Selling Cloud Computing Unified Communications New Business Development Go-to-market Strategy Enterprise Software Strategic Partnerships SaaS VoIP Strategy MPLS Solution Selling Education Virginia Polytechnic Institute and State University BS,  Computer Science 1984  – 1988 Virginia Polytechnic Institute and State University BS,  Computer Science 1984  – 1988 Virginia Polytechnic Institute and State University BS,  Computer Science 1984  – 1988 Virginia Polytechnic Institute and State University BS,  Computer Science 1984  – 1988 ", "Experience Business Development - Manager, Service Quality EMEAR Cisco July 2012  – Present (3 years 2 months) Amsterdam Area, Netherlands Business Development Manager - Benelux, Austria and Poland Cisco November 2010  –  June 2012  (1 year 8 months) Amsterdam Area, Netherlands Business Development Manager - DACH Region Cisco January 2009  –  October 2010  (1 year 10 months) Amsterdam Area, Netherlands Manager, Territory Support Team Europe Cisco July 2007  –  December 2008  (1 year 6 months) Emerging Markets Territory Support Manager, Central Eastern Europe (CEE) Cisco June 2006  –  July 2007  (1 year 2 months) Vendor Management Cisco August 2004  –  June 2006  (1 year 11 months) Project Management Cisco October 2002  –  August 2004  (1 year 11 months) Logistics Service Center Cisco August 2000  –  October 2002  (2 years 3 months) Sales Support Manager Eicon Technology November 1998  –  August 2000  (1 year 10 months) Business Development - Manager, Service Quality EMEAR Cisco July 2012  – Present (3 years 2 months) Amsterdam Area, Netherlands Business Development - Manager, Service Quality EMEAR Cisco July 2012  – Present (3 years 2 months) Amsterdam Area, Netherlands Business Development Manager - Benelux, Austria and Poland Cisco November 2010  –  June 2012  (1 year 8 months) Amsterdam Area, Netherlands Business Development Manager - Benelux, Austria and Poland Cisco November 2010  –  June 2012  (1 year 8 months) Amsterdam Area, Netherlands Business Development Manager - DACH Region Cisco January 2009  –  October 2010  (1 year 10 months) Amsterdam Area, Netherlands Business Development Manager - DACH Region Cisco January 2009  –  October 2010  (1 year 10 months) Amsterdam Area, Netherlands Manager, Territory Support Team Europe Cisco July 2007  –  December 2008  (1 year 6 months) Manager, Territory Support Team Europe Cisco July 2007  –  December 2008  (1 year 6 months) Emerging Markets Territory Support Manager, Central Eastern Europe (CEE) Cisco June 2006  –  July 2007  (1 year 2 months) Emerging Markets Territory Support Manager, Central Eastern Europe (CEE) Cisco June 2006  –  July 2007  (1 year 2 months) Vendor Management Cisco August 2004  –  June 2006  (1 year 11 months) Vendor Management Cisco August 2004  –  June 2006  (1 year 11 months) Project Management Cisco October 2002  –  August 2004  (1 year 11 months) Project Management Cisco October 2002  –  August 2004  (1 year 11 months) Logistics Service Center Cisco August 2000  –  October 2002  (2 years 3 months) Logistics Service Center Cisco August 2000  –  October 2002  (2 years 3 months) Sales Support Manager Eicon Technology November 1998  –  August 2000  (1 year 10 months) Sales Support Manager Eicon Technology November 1998  –  August 2000  (1 year 10 months) ", "Skills Sales Solution Selling SaaS Cloud Computing Salesforce.com Enterprise Software Strategic Partnerships Unified Communications Go-to-market Strategy Product Management Channel Partners Lead Generation Direct Sales Business Development Account Management CRM Product Marketing Start-ups Demand Generation Sales Process Channel See 6+     See less Skills  Sales Solution Selling SaaS Cloud Computing Salesforce.com Enterprise Software Strategic Partnerships Unified Communications Go-to-market Strategy Product Management Channel Partners Lead Generation Direct Sales Business Development Account Management CRM Product Marketing Start-ups Demand Generation Sales Process Channel See 6+     See less Sales Solution Selling SaaS Cloud Computing Salesforce.com Enterprise Software Strategic Partnerships Unified Communications Go-to-market Strategy Product Management Channel Partners Lead Generation Direct Sales Business Development Account Management CRM Product Marketing Start-ups Demand Generation Sales Process Channel See 6+     See less Sales Solution Selling SaaS Cloud Computing Salesforce.com Enterprise Software Strategic Partnerships Unified Communications Go-to-market Strategy Product Management Channel Partners Lead Generation Direct Sales Business Development Account Management CRM Product Marketing Start-ups Demand Generation Sales Process Channel See 6+     See less ", "Languages German French Russian German French Russian German French Russian Skills Sales Management Business Planning Coaching Go-to-market Strategy Channel Solution Selling Business Alliances Partner Management New Business Development Business Strategy Strategic Partnerships Professional Services Cross-functional Team... Strategy Program Management Consulting Business Development Management Integration Leadership Management Consulting Security Channel Partners See 8+     See less Skills  Sales Management Business Planning Coaching Go-to-market Strategy Channel Solution Selling Business Alliances Partner Management New Business Development Business Strategy Strategic Partnerships Professional Services Cross-functional Team... Strategy Program Management Consulting Business Development Management Integration Leadership Management Consulting Security Channel Partners See 8+     See less Sales Management Business Planning Coaching Go-to-market Strategy Channel Solution Selling Business Alliances Partner Management New Business Development Business Strategy Strategic Partnerships Professional Services Cross-functional Team... Strategy Program Management Consulting Business Development Management Integration Leadership Management Consulting Security Channel Partners See 8+     See less Sales Management Business Planning Coaching Go-to-market Strategy Channel Solution Selling Business Alliances Partner Management New Business Development Business Strategy Strategic Partnerships Professional Services Cross-functional Team... Strategy Program Management Consulting Business Development Management Integration Leadership Management Consulting Security Channel Partners See 8+     See less Honors & Awards Cisco Chairman´s Club Císco November 2007 Chairman's Club membership is awarded to the best 1% of Cisco´s worldwide salesforce. It is a week-long event set in paradise at a prestigious Resort in Hawaii and designed with exquisite detail to honor both the winners and a guest of their choice. A total of 200 top-performing individual contributors and their spouses or partners are invited each year. Cisco Chairman´s Club Císco November 2007 Chairman's Club membership is awarded to the best 1% of Cisco´s worldwide salesforce. It is a week-long event set in paradise at a prestigious Resort in Hawaii and designed with exquisite detail to honor both the winners and a guest of their choice. A total of 200 top-performing individual contributors and their spouses or partners are invited each year. Cisco Chairman´s Club Císco November 2007 Chairman's Club membership is awarded to the best 1% of Cisco´s worldwide salesforce. It is a week-long event set in paradise at a prestigious Resort in Hawaii and designed with exquisite detail to honor both the winners and a guest of their choice. A total of 200 top-performing individual contributors and their spouses or partners are invited each year. Cisco Chairman´s Club Císco November 2007 Chairman's Club membership is awarded to the best 1% of Cisco´s worldwide salesforce. It is a week-long event set in paradise at a prestigious Resort in Hawaii and designed with exquisite detail to honor both the winners and a guest of their choice. A total of 200 top-performing individual contributors and their spouses or partners are invited each year. ", "Summary Specialties:Data Center & Cloud Solutions \nChannel Sales \nChannel Marketing \nChannel Development \nSMB Marketing \nDistribution Sales & Marketing Summary Specialties:Data Center & Cloud Solutions \nChannel Sales \nChannel Marketing \nChannel Development \nSMB Marketing \nDistribution Sales & Marketing Specialties:Data Center & Cloud Solutions \nChannel Sales \nChannel Marketing \nChannel Development \nSMB Marketing \nDistribution Sales & Marketing Specialties:Data Center & Cloud Solutions \nChannel Sales \nChannel Marketing \nChannel Development \nSMB Marketing \nDistribution Sales & Marketing Experience Sr Sales / Business Development Manager Cisco February 2014  – Present (1 year 7 months) San Jose, CA Senior Marketing Manager - Global Strategic Partner Marketing Cisco May 2010  –  February 2014  (3 years 10 months) San Jose, CA Senior Marketing Manager - WW Solutions Marketing Lead Cisco April 2009  –  May 2010  (1 year 2 months) San Jose, CA Senior Marketing Manager - WW Distribution Marketing Lead Cisco November 2006  –  April 2009  (2 years 6 months) San Jose, CA Marketing Manager, WW Commercial Segment Partner Marketing Cisco October 2004  –  November 2006  (2 years 2 months) San Jose, CA Marketing Manager, Strategic Parnter Manager Cisco September 2003  –  October 2004  (1 year 2 months) San Jose, CA Business Development Manager Cisco January 2000  –  September 2003  (3 years 9 months) San Jose, CA Manager, Channels & Distribution Viasoft 1998  –  2000  (2 years) Manager, Sales & Marketing Operations US Web 1996  –  1998  (2 years) Manager MicroAge / Pinacor 1990  –  1996  (6 years) Sales ComputerLand 1989  –  1994  (5 years) Sr Sales / Business Development Manager Cisco February 2014  – Present (1 year 7 months) San Jose, CA Sr Sales / Business Development Manager Cisco February 2014  – Present (1 year 7 months) San Jose, CA Senior Marketing Manager - Global Strategic Partner Marketing Cisco May 2010  –  February 2014  (3 years 10 months) San Jose, CA Senior Marketing Manager - Global Strategic Partner Marketing Cisco May 2010  –  February 2014  (3 years 10 months) San Jose, CA Senior Marketing Manager - WW Solutions Marketing Lead Cisco April 2009  –  May 2010  (1 year 2 months) San Jose, CA Senior Marketing Manager - WW Solutions Marketing Lead Cisco April 2009  –  May 2010  (1 year 2 months) San Jose, CA Senior Marketing Manager - WW Distribution Marketing Lead Cisco November 2006  –  April 2009  (2 years 6 months) San Jose, CA Senior Marketing Manager - WW Distribution Marketing Lead Cisco November 2006  –  April 2009  (2 years 6 months) San Jose, CA Marketing Manager, WW Commercial Segment Partner Marketing Cisco October 2004  –  November 2006  (2 years 2 months) San Jose, CA Marketing Manager, WW Commercial Segment Partner Marketing Cisco October 2004  –  November 2006  (2 years 2 months) San Jose, CA Marketing Manager, Strategic Parnter Manager Cisco September 2003  –  October 2004  (1 year 2 months) San Jose, CA Marketing Manager, Strategic Parnter Manager Cisco September 2003  –  October 2004  (1 year 2 months) San Jose, CA Business Development Manager Cisco January 2000  –  September 2003  (3 years 9 months) San Jose, CA Business Development Manager Cisco January 2000  –  September 2003  (3 years 9 months) San Jose, CA Manager, Channels & Distribution Viasoft 1998  –  2000  (2 years) Manager, Channels & Distribution Viasoft 1998  –  2000  (2 years) Manager, Sales & Marketing Operations US Web 1996  –  1998  (2 years) Manager, Sales & Marketing Operations US Web 1996  –  1998  (2 years) Manager MicroAge / Pinacor 1990  –  1996  (6 years) Manager MicroAge / Pinacor 1990  –  1996  (6 years) Sales ComputerLand 1989  –  1994  (5 years) Sales ComputerLand 1989  –  1994  (5 years) Skills Channel Multi-channel Marketing Channel Sales Go-to-market Strategy Sales Enablement Demand Generation Channel Partners Cloud Computing Partner Management Business Alliances Unified Communications Solution Selling SMB Partner Development Managed Services Enterprise Software Service Providers Data Center Strategic Partnerships See 4+     See less Skills  Channel Multi-channel Marketing Channel Sales Go-to-market Strategy Sales Enablement Demand Generation Channel Partners Cloud Computing Partner Management Business Alliances Unified Communications Solution Selling SMB Partner Development Managed Services Enterprise Software Service Providers Data Center Strategic Partnerships See 4+     See less Channel Multi-channel Marketing Channel Sales Go-to-market Strategy Sales Enablement Demand Generation Channel Partners Cloud Computing Partner Management Business Alliances Unified Communications Solution Selling SMB Partner Development Managed Services Enterprise Software Service Providers Data Center Strategic Partnerships See 4+     See less Channel Multi-channel Marketing Channel Sales Go-to-market Strategy Sales Enablement Demand Generation Channel Partners Cloud Computing Partner Management Business Alliances Unified Communications Solution Selling SMB Partner Development Managed Services Enterprise Software Service Providers Data Center Strategic Partnerships See 4+     See less Education Arizona State University 1983  – 1987 Arizona State University 1983  – 1987 Arizona State University 1983  – 1987 Arizona State University 1983  – 1987 ", "Experience Sr. Sales Business Development Mgr: Microsoft Initiatives Cisco September 2014  – Present (1 year) Greater Boston Area Engaged and aligned to Microsoft and their System Integrator Channel in building new Go-To-Market strategies to establish net new revenue streams for Cisco. Senior Sales Business Development Manager Cisco Systems August 2012  – Present (3 years 1 month) Boston, Massachusetts Americas Business Development Lead for Cisco Smart Solutions ( BYOD, Enterprise Mobility, and Unified Workspace ), Member of Americas Partner Management Organization. Focus on Key Partner Enablement and Go To Market Strategies. Senior Sales Business Development Manager Cisco Systems April 2010  –  July 2012  (2 years 4 months) Boston, Massachusetts Americas Business Development Responsibilities for Cisco Collaboration (Unified Communications) Architecture. Focus on Cisco Global Partners. Member of Americas Partner Management Organizations. Partner Director, Global Accounts TANDBERG (Aquired By Cisco Systems) October 2007  –  April 2010  (2 years 7 months) Boston, Massachusetts 2009 Channel Account Manager of the Year in Americas Region, Elected to Presidents Club Manager, Contact Center Business Unit, Partner Development Cisco Systems March 2007  –  September 2007  (7 months) Boston, Ma Director of Sales, New England Nortel Networks September 2004  –  March 2007  (2 years 7 months) Boston, Massachusetts Vice President Business Development EarthLink, formally One Communications June 1998  –  October 2002  (4 years 5 months) Boston, Massachusetts Regional Vice President of Sales Williams Company January 1996  –  December 1996  (1 year) Boston, Massachusetts Senior Vice President of Network Integration Comlink Network Services March 1985  –  January 1996  (10 years 11 months) Boston, Massachusetts Acquired by Williams Communications in January 1996 Sr. Sales Business Development Mgr: Microsoft Initiatives Cisco September 2014  – Present (1 year) Greater Boston Area Engaged and aligned to Microsoft and their System Integrator Channel in building new Go-To-Market strategies to establish net new revenue streams for Cisco. Sr. Sales Business Development Mgr: Microsoft Initiatives Cisco September 2014  – Present (1 year) Greater Boston Area Engaged and aligned to Microsoft and their System Integrator Channel in building new Go-To-Market strategies to establish net new revenue streams for Cisco. Senior Sales Business Development Manager Cisco Systems August 2012  – Present (3 years 1 month) Boston, Massachusetts Americas Business Development Lead for Cisco Smart Solutions ( BYOD, Enterprise Mobility, and Unified Workspace ), Member of Americas Partner Management Organization. Focus on Key Partner Enablement and Go To Market Strategies. Senior Sales Business Development Manager Cisco Systems August 2012  – Present (3 years 1 month) Boston, Massachusetts Americas Business Development Lead for Cisco Smart Solutions ( BYOD, Enterprise Mobility, and Unified Workspace ), Member of Americas Partner Management Organization. Focus on Key Partner Enablement and Go To Market Strategies. Senior Sales Business Development Manager Cisco Systems April 2010  –  July 2012  (2 years 4 months) Boston, Massachusetts Americas Business Development Responsibilities for Cisco Collaboration (Unified Communications) Architecture. Focus on Cisco Global Partners. Member of Americas Partner Management Organizations. Senior Sales Business Development Manager Cisco Systems April 2010  –  July 2012  (2 years 4 months) Boston, Massachusetts Americas Business Development Responsibilities for Cisco Collaboration (Unified Communications) Architecture. Focus on Cisco Global Partners. Member of Americas Partner Management Organizations. Partner Director, Global Accounts TANDBERG (Aquired By Cisco Systems) October 2007  –  April 2010  (2 years 7 months) Boston, Massachusetts 2009 Channel Account Manager of the Year in Americas Region, Elected to Presidents Club Partner Director, Global Accounts TANDBERG (Aquired By Cisco Systems) October 2007  –  April 2010  (2 years 7 months) Boston, Massachusetts 2009 Channel Account Manager of the Year in Americas Region, Elected to Presidents Club Manager, Contact Center Business Unit, Partner Development Cisco Systems March 2007  –  September 2007  (7 months) Boston, Ma Manager, Contact Center Business Unit, Partner Development Cisco Systems March 2007  –  September 2007  (7 months) Boston, Ma Director of Sales, New England Nortel Networks September 2004  –  March 2007  (2 years 7 months) Boston, Massachusetts Director of Sales, New England Nortel Networks September 2004  –  March 2007  (2 years 7 months) Boston, Massachusetts Vice President Business Development EarthLink, formally One Communications June 1998  –  October 2002  (4 years 5 months) Boston, Massachusetts Vice President Business Development EarthLink, formally One Communications June 1998  –  October 2002  (4 years 5 months) Boston, Massachusetts Regional Vice President of Sales Williams Company January 1996  –  December 1996  (1 year) Boston, Massachusetts Regional Vice President of Sales Williams Company January 1996  –  December 1996  (1 year) Boston, Massachusetts Senior Vice President of Network Integration Comlink Network Services March 1985  –  January 1996  (10 years 11 months) Boston, Massachusetts Acquired by Williams Communications in January 1996 Senior Vice President of Network Integration Comlink Network Services March 1985  –  January 1996  (10 years 11 months) Boston, Massachusetts Acquired by Williams Communications in January 1996 Skills Telepresence Channel Partners Cisco Technologies Partner Management Sales Management Business Development Networking Video Emerging Technologies Unified Communications Video Conferencing Managed Services Channel Solution Selling VoIP Direct Sales Network Security Go-to-market Strategy Sales Enablement Pre-sales Wireless Virtualization Collaboration Solutions Channel Strategy Professional Services Strategic Partnerships Contact Centers WAN Telephony Telecommunications SaaS Data Center Cloud Computing SIP BYOD Service Providers Network Architecture IP See 23+     See less Skills  Telepresence Channel Partners Cisco Technologies Partner Management Sales Management Business Development Networking Video Emerging Technologies Unified Communications Video Conferencing Managed Services Channel Solution Selling VoIP Direct Sales Network Security Go-to-market Strategy Sales Enablement Pre-sales Wireless Virtualization Collaboration Solutions Channel Strategy Professional Services Strategic Partnerships Contact Centers WAN Telephony Telecommunications SaaS Data Center Cloud Computing SIP BYOD Service Providers Network Architecture IP See 23+     See less Telepresence Channel Partners Cisco Technologies Partner Management Sales Management Business Development Networking Video Emerging Technologies Unified Communications Video Conferencing Managed Services Channel Solution Selling VoIP Direct Sales Network Security Go-to-market Strategy Sales Enablement Pre-sales Wireless Virtualization Collaboration Solutions Channel Strategy Professional Services Strategic Partnerships Contact Centers WAN Telephony Telecommunications SaaS Data Center Cloud Computing SIP BYOD Service Providers Network Architecture IP See 23+     See less Telepresence Channel Partners Cisco Technologies Partner Management Sales Management Business Development Networking Video Emerging Technologies Unified Communications Video Conferencing Managed Services Channel Solution Selling VoIP Direct Sales Network Security Go-to-market Strategy Sales Enablement Pre-sales Wireless Virtualization Collaboration Solutions Channel Strategy Professional Services Strategic Partnerships Contact Centers WAN Telephony Telecommunications SaaS Data Center Cloud Computing SIP BYOD Service Providers Network Architecture IP See 23+     See less Education Providence College Bachelor of Science,  Business Management ,  History Providence College Bachelor of Science,  Business Management ,  History Providence College Bachelor of Science,  Business Management ,  History Providence College Bachelor of Science,  Business Management ,  History ", "Summary I am a senior professional with a rich multicultural experience and extensive background in developing projects in the ICT industry, from conception till sales, delivery and operation. My experience over the past 20 years has been focused in Portugal, and prior to that in Brazil, United States and Germany, successfully building customer and partner relationships and creating value for many stakeholders.  \nSpecializing in Business Development, my main expertise areas are in business consulting and planning for the introduction of new products in the marketplace, sales and marketing, partner and channel development, project and people management. I deliver results that coincide with business objectives in complex markets and projects. Summary I am a senior professional with a rich multicultural experience and extensive background in developing projects in the ICT industry, from conception till sales, delivery and operation. My experience over the past 20 years has been focused in Portugal, and prior to that in Brazil, United States and Germany, successfully building customer and partner relationships and creating value for many stakeholders.  \nSpecializing in Business Development, my main expertise areas are in business consulting and planning for the introduction of new products in the marketplace, sales and marketing, partner and channel development, project and people management. I deliver results that coincide with business objectives in complex markets and projects. I am a senior professional with a rich multicultural experience and extensive background in developing projects in the ICT industry, from conception till sales, delivery and operation. My experience over the past 20 years has been focused in Portugal, and prior to that in Brazil, United States and Germany, successfully building customer and partner relationships and creating value for many stakeholders.  \nSpecializing in Business Development, my main expertise areas are in business consulting and planning for the introduction of new products in the marketplace, sales and marketing, partner and channel development, project and people management. I deliver results that coincide with business objectives in complex markets and projects. I am a senior professional with a rich multicultural experience and extensive background in developing projects in the ICT industry, from conception till sales, delivery and operation. My experience over the past 20 years has been focused in Portugal, and prior to that in Brazil, United States and Germany, successfully building customer and partner relationships and creating value for many stakeholders.  \nSpecializing in Business Development, my main expertise areas are in business consulting and planning for the introduction of new products in the marketplace, sales and marketing, partner and channel development, project and people management. I deliver results that coincide with business objectives in complex markets and projects. Experience Business Development Manager - Cloud Services Cisco Systems 2010  – Present (5 years) Responsible for developing a Cloud strategy with strategic partners, from vision to delivery. Leading a virtual team of persons with different backgrounds and origins, I have been able to approve the investment for launching the first wave of services, from IaaS to SaaS. This project has given me the capability of assuming different roles and managing initiatives that required different skills like business consulting, business and technical architect, Go-To-Market strategist and project manager. Business Development Manager - SMB Services Cisco Systems 2008  –  2009  (1 year) Business Development Manager - Managed Services Cisco Systems August 2004  –  2007  (3 years) Consulting Engineer Cisco Systems June 2001  –  July 2004  (3 years 2 months) Team Leader - Systems engineering team Cisco Systems September 2000  –  June 2001  (10 months) Systems Engineer Cisco Systems August 1999  –  August 2000  (1 year 1 month) Product Manager, Project Manager, SW architect and engineer Alcatel February 1992  –  July 1999  (7 years 6 months) Business Development Manager - Cloud Services Cisco Systems 2010  – Present (5 years) Responsible for developing a Cloud strategy with strategic partners, from vision to delivery. Leading a virtual team of persons with different backgrounds and origins, I have been able to approve the investment for launching the first wave of services, from IaaS to SaaS. This project has given me the capability of assuming different roles and managing initiatives that required different skills like business consulting, business and technical architect, Go-To-Market strategist and project manager. Business Development Manager - Cloud Services Cisco Systems 2010  – Present (5 years) Responsible for developing a Cloud strategy with strategic partners, from vision to delivery. Leading a virtual team of persons with different backgrounds and origins, I have been able to approve the investment for launching the first wave of services, from IaaS to SaaS. This project has given me the capability of assuming different roles and managing initiatives that required different skills like business consulting, business and technical architect, Go-To-Market strategist and project manager. Business Development Manager - SMB Services Cisco Systems 2008  –  2009  (1 year) Business Development Manager - SMB Services Cisco Systems 2008  –  2009  (1 year) Business Development Manager - Managed Services Cisco Systems August 2004  –  2007  (3 years) Business Development Manager - Managed Services Cisco Systems August 2004  –  2007  (3 years) Consulting Engineer Cisco Systems June 2001  –  July 2004  (3 years 2 months) Consulting Engineer Cisco Systems June 2001  –  July 2004  (3 years 2 months) Team Leader - Systems engineering team Cisco Systems September 2000  –  June 2001  (10 months) Team Leader - Systems engineering team Cisco Systems September 2000  –  June 2001  (10 months) Systems Engineer Cisco Systems August 1999  –  August 2000  (1 year 1 month) Systems Engineer Cisco Systems August 1999  –  August 2000  (1 year 1 month) Product Manager, Project Manager, SW architect and engineer Alcatel February 1992  –  July 1999  (7 years 6 months) Product Manager, Project Manager, SW architect and engineer Alcatel February 1992  –  July 1999  (7 years 6 months) Languages English Full professional proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Product Management Telecommunications Business Development Project and Program... People Management Coaching Managed Services Cloud Computing Cloud Services Service Providers Mid Market and SMB Manage Client... Channel Developer Partner Development Customer-facing Customer Driven Management Cisco Technologies Strategy Unified Communications VoIP Enterprise Software Go-to-market Strategy Strategic Planning Mobile Devices SaaS Pre-sales CRM Management Consulting Team Leadership IP Project Management Wireless Project Planning See 19+     See less Skills  Product Management Telecommunications Business Development Project and Program... People Management Coaching Managed Services Cloud Computing Cloud Services Service Providers Mid Market and SMB Manage Client... Channel Developer Partner Development Customer-facing Customer Driven Management Cisco Technologies Strategy Unified Communications VoIP Enterprise Software Go-to-market Strategy Strategic Planning Mobile Devices SaaS Pre-sales CRM Management Consulting Team Leadership IP Project Management Wireless Project Planning See 19+     See less Product Management Telecommunications Business Development Project and Program... People Management Coaching Managed Services Cloud Computing Cloud Services Service Providers Mid Market and SMB Manage Client... Channel Developer Partner Development Customer-facing Customer Driven Management Cisco Technologies Strategy Unified Communications VoIP Enterprise Software Go-to-market Strategy Strategic Planning Mobile Devices SaaS Pre-sales CRM Management Consulting Team Leadership IP Project Management Wireless Project Planning See 19+     See less Product Management Telecommunications Business Development Project and Program... People Management Coaching Managed Services Cloud Computing Cloud Services Service Providers Mid Market and SMB Manage Client... Channel Developer Partner Development Customer-facing Customer Driven Management Cisco Technologies Strategy Unified Communications VoIP Enterprise Software Go-to-market Strategy Strategic Planning Mobile Devices SaaS Pre-sales CRM Management Consulting Team Leadership IP Project Management Wireless Project Planning See 19+     See less Education Universidade Nova de Lisboa Post-Grad,  Business Management 2006  – 2006 Instituto Superior Técnico Electrotecnic Engineering 1986  – 1991 Computer Science specialization. Universidade Nova de Lisboa Post-Grad,  Business Management 2006  – 2006 Universidade Nova de Lisboa Post-Grad,  Business Management 2006  – 2006 Universidade Nova de Lisboa Post-Grad,  Business Management 2006  – 2006 Instituto Superior Técnico Electrotecnic Engineering 1986  – 1991 Computer Science specialization. Instituto Superior Técnico Electrotecnic Engineering 1986  – 1991 Computer Science specialization. Instituto Superior Técnico Electrotecnic Engineering 1986  – 1991 Computer Science specialization. ", "Summary Raised in the Bronx, New York, now living in the splendid Roman and Georgian city of Bath. I can explain why the sky is blue, how a star shines, and what makes the Internet work! \n \nMy career highlights include working on the 1st generation of Internet Security products, the 1st generation of ADSL technology, designing and driving a business with a partner to over $40M in annual sales, and then back full circle to Security raising awareness of Cyber Security. \n \nAfter 18 years in this business I'm still driven by my lifelong passion for learning combined with a desire to put that learning to practical use. Summary Raised in the Bronx, New York, now living in the splendid Roman and Georgian city of Bath. I can explain why the sky is blue, how a star shines, and what makes the Internet work! \n \nMy career highlights include working on the 1st generation of Internet Security products, the 1st generation of ADSL technology, designing and driving a business with a partner to over $40M in annual sales, and then back full circle to Security raising awareness of Cyber Security. \n \nAfter 18 years in this business I'm still driven by my lifelong passion for learning combined with a desire to put that learning to practical use. Raised in the Bronx, New York, now living in the splendid Roman and Georgian city of Bath. I can explain why the sky is blue, how a star shines, and what makes the Internet work! \n \nMy career highlights include working on the 1st generation of Internet Security products, the 1st generation of ADSL technology, designing and driving a business with a partner to over $40M in annual sales, and then back full circle to Security raising awareness of Cyber Security. \n \nAfter 18 years in this business I'm still driven by my lifelong passion for learning combined with a desire to put that learning to practical use. Raised in the Bronx, New York, now living in the splendid Roman and Georgian city of Bath. I can explain why the sky is blue, how a star shines, and what makes the Internet work! \n \nMy career highlights include working on the 1st generation of Internet Security products, the 1st generation of ADSL technology, designing and driving a business with a partner to over $40M in annual sales, and then back full circle to Security raising awareness of Cyber Security. \n \nAfter 18 years in this business I'm still driven by my lifelong passion for learning combined with a desire to put that learning to practical use. Experience Business Development Manager - Security Solutions Cisco November 2014  – Present (10 months) Bath, United Kingdom Manager - Cyber Security Solutions Cisco February 2014  –  November 2014  (10 months) EMEAR Strategic Partner Manager - Security Solutions Cisco Systems April 2011  –  March 2014  (3 years) EMEAR Leading the focus and acceleration of Cisco's Security Strategy across all of Central, North and Western Europe. Includes special emphasis on 3 of Cisco's largest and strategic global security partners. Responsibilities include defining routes to market, partner enablement and strategic vision for Security solutions. Sales Business Development Manager Cisco Systems, Ltd. July 2006  –  April 2011  (4 years 10 months) •\tEnvision and develop propositions and solutions to meet customer business needs.  \n•\tBuild and maintain senior level relationships with key stakeholders. \n•\tDrive adoption of Cisco architectures and products onto customer portfolio. \n•\tDefine and develop new Managed Services solutions with partners; ensure success and growth of existing services.  \n•\tDefine and execute GTM strategy with customer/partner. \n•\tCollaborate with sales, engineering and service teams to develop strategies and account plans. \n•\tLeverage and lead virtual teams in completion of key initiatives. Systems Engineer Cisco Systems June 2000  –  June 2006  (6 years 1 month) •\tDesigned and maintained principal technical authority for European Service Providers managed services and solutions, covering a broad range of technologies including Security, Optical, MPLS, ADSL and ATM. \n•\tTrained and managed a 6-man technical team in the Customer Engineering Group. \n•\tLed all technical pre-sales activities including customer updates on technology and Cisco products, workshops and design meetings, and Beta trial programs. \n•\tGained broad range of experience across varied teams and markets including Service Provider Infrastructure, Channel/Partner and Global. Quality Assurance Engineer Cisco Systems November 1998  –  May 2000  (1 year 7 months) •\tDesigned ADSL access networks for major Telecoms clients. \n•\tLed QA team on several major projects including test definitions, scripts, test cases, environments and success criteria. \n•\tProvided leadership in determining test tools and required methodologies. Primary evaluator of vendor test products. \n•\tTrained and mentored junior QA engineers on Cisco technologies and platforms. Senior LAN/WAN Administrator Westfield Group October 1997  –  October 1998  (1 year 1 month) •\tDesigned, administered and supported a Cisco Powered 44-site Frame Relay WAN. \n•\tAdministered a WAN/LAN of 550 users including Remote Access, Security Policies and Procedures, Internet Access (through both a Proxy server and PIX Firewall), and Videoconferencing. \n•\tDesigned and implemented a TCP/IP LAN (IPX migration) and a Windows NT 4.0 Domain server farm. \n•\tLed the IS Department help-desk. Third-Tier technical support for all corporate users. Network Administrator Ogilvy & Mather June 1996  –  August 1997  (1 year 3 months) •\tAdministered LAN of multi-OS servers for 200 users. \n•\tDeveloped and administered Remote Access and Internet Access for 150 users. \n•\tTeam lead for 2-man technical support staff. Business Development Manager - Security Solutions Cisco November 2014  – Present (10 months) Bath, United Kingdom Business Development Manager - Security Solutions Cisco November 2014  – Present (10 months) Bath, United Kingdom Manager - Cyber Security Solutions Cisco February 2014  –  November 2014  (10 months) EMEAR Manager - Cyber Security Solutions Cisco February 2014  –  November 2014  (10 months) EMEAR Strategic Partner Manager - Security Solutions Cisco Systems April 2011  –  March 2014  (3 years) EMEAR Leading the focus and acceleration of Cisco's Security Strategy across all of Central, North and Western Europe. Includes special emphasis on 3 of Cisco's largest and strategic global security partners. Responsibilities include defining routes to market, partner enablement and strategic vision for Security solutions. Strategic Partner Manager - Security Solutions Cisco Systems April 2011  –  March 2014  (3 years) EMEAR Leading the focus and acceleration of Cisco's Security Strategy across all of Central, North and Western Europe. Includes special emphasis on 3 of Cisco's largest and strategic global security partners. Responsibilities include defining routes to market, partner enablement and strategic vision for Security solutions. Sales Business Development Manager Cisco Systems, Ltd. July 2006  –  April 2011  (4 years 10 months) •\tEnvision and develop propositions and solutions to meet customer business needs.  \n•\tBuild and maintain senior level relationships with key stakeholders. \n•\tDrive adoption of Cisco architectures and products onto customer portfolio. \n•\tDefine and develop new Managed Services solutions with partners; ensure success and growth of existing services.  \n•\tDefine and execute GTM strategy with customer/partner. \n•\tCollaborate with sales, engineering and service teams to develop strategies and account plans. \n•\tLeverage and lead virtual teams in completion of key initiatives. Sales Business Development Manager Cisco Systems, Ltd. July 2006  –  April 2011  (4 years 10 months) •\tEnvision and develop propositions and solutions to meet customer business needs.  \n•\tBuild and maintain senior level relationships with key stakeholders. \n•\tDrive adoption of Cisco architectures and products onto customer portfolio. \n•\tDefine and develop new Managed Services solutions with partners; ensure success and growth of existing services.  \n•\tDefine and execute GTM strategy with customer/partner. \n•\tCollaborate with sales, engineering and service teams to develop strategies and account plans. \n•\tLeverage and lead virtual teams in completion of key initiatives. Systems Engineer Cisco Systems June 2000  –  June 2006  (6 years 1 month) •\tDesigned and maintained principal technical authority for European Service Providers managed services and solutions, covering a broad range of technologies including Security, Optical, MPLS, ADSL and ATM. \n•\tTrained and managed a 6-man technical team in the Customer Engineering Group. \n•\tLed all technical pre-sales activities including customer updates on technology and Cisco products, workshops and design meetings, and Beta trial programs. \n•\tGained broad range of experience across varied teams and markets including Service Provider Infrastructure, Channel/Partner and Global. Systems Engineer Cisco Systems June 2000  –  June 2006  (6 years 1 month) •\tDesigned and maintained principal technical authority for European Service Providers managed services and solutions, covering a broad range of technologies including Security, Optical, MPLS, ADSL and ATM. \n•\tTrained and managed a 6-man technical team in the Customer Engineering Group. \n•\tLed all technical pre-sales activities including customer updates on technology and Cisco products, workshops and design meetings, and Beta trial programs. \n•\tGained broad range of experience across varied teams and markets including Service Provider Infrastructure, Channel/Partner and Global. Quality Assurance Engineer Cisco Systems November 1998  –  May 2000  (1 year 7 months) •\tDesigned ADSL access networks for major Telecoms clients. \n•\tLed QA team on several major projects including test definitions, scripts, test cases, environments and success criteria. \n•\tProvided leadership in determining test tools and required methodologies. Primary evaluator of vendor test products. \n•\tTrained and mentored junior QA engineers on Cisco technologies and platforms. Quality Assurance Engineer Cisco Systems November 1998  –  May 2000  (1 year 7 months) •\tDesigned ADSL access networks for major Telecoms clients. \n•\tLed QA team on several major projects including test definitions, scripts, test cases, environments and success criteria. \n•\tProvided leadership in determining test tools and required methodologies. Primary evaluator of vendor test products. \n•\tTrained and mentored junior QA engineers on Cisco technologies and platforms. Senior LAN/WAN Administrator Westfield Group October 1997  –  October 1998  (1 year 1 month) •\tDesigned, administered and supported a Cisco Powered 44-site Frame Relay WAN. \n•\tAdministered a WAN/LAN of 550 users including Remote Access, Security Policies and Procedures, Internet Access (through both a Proxy server and PIX Firewall), and Videoconferencing. \n•\tDesigned and implemented a TCP/IP LAN (IPX migration) and a Windows NT 4.0 Domain server farm. \n•\tLed the IS Department help-desk. Third-Tier technical support for all corporate users. Senior LAN/WAN Administrator Westfield Group October 1997  –  October 1998  (1 year 1 month) •\tDesigned, administered and supported a Cisco Powered 44-site Frame Relay WAN. \n•\tAdministered a WAN/LAN of 550 users including Remote Access, Security Policies and Procedures, Internet Access (through both a Proxy server and PIX Firewall), and Videoconferencing. \n•\tDesigned and implemented a TCP/IP LAN (IPX migration) and a Windows NT 4.0 Domain server farm. \n•\tLed the IS Department help-desk. Third-Tier technical support for all corporate users. Network Administrator Ogilvy & Mather June 1996  –  August 1997  (1 year 3 months) •\tAdministered LAN of multi-OS servers for 200 users. \n•\tDeveloped and administered Remote Access and Internet Access for 150 users. \n•\tTeam lead for 2-man technical support staff. Network Administrator Ogilvy & Mather June 1996  –  August 1997  (1 year 3 months) •\tAdministered LAN of multi-OS servers for 200 users. \n•\tDeveloped and administered Remote Access and Internet Access for 150 users. \n•\tTeam lead for 2-man technical support staff. Languages Russian Russian Russian Skills Sales Management New Business Development Managing Partner... Cisco Technologies Network Security Problem Solving Physics Mathematics Astrophysics Creative Solutions Data Center Strategy Routers Managed Services Go-to-market Strategy Routing Security Pre-sales Product Management CCNP IP VoIP Channel Partners Networking Ethernet Cloud Computing WAN Enterprise Software CRM IPSec Solution Selling QoS Virtualization SaaS Telecommunications Network Architecture SIP Business Development Unified Communications IPv6 MPLS Cisco IOS LAN-WAN Wireless Professional Services TCP/IP Computer Security Service Providers Sales Enablement Firewalls See 35+     See less Skills  Sales Management New Business Development Managing Partner... Cisco Technologies Network Security Problem Solving Physics Mathematics Astrophysics Creative Solutions Data Center Strategy Routers Managed Services Go-to-market Strategy Routing Security Pre-sales Product Management CCNP IP VoIP Channel Partners Networking Ethernet Cloud Computing WAN Enterprise Software CRM IPSec Solution Selling QoS Virtualization SaaS Telecommunications Network Architecture SIP Business Development Unified Communications IPv6 MPLS Cisco IOS LAN-WAN Wireless Professional Services TCP/IP Computer Security Service Providers Sales Enablement Firewalls See 35+     See less Sales Management New Business Development Managing Partner... Cisco Technologies Network Security Problem Solving Physics Mathematics Astrophysics Creative Solutions Data Center Strategy Routers Managed Services Go-to-market Strategy Routing Security Pre-sales Product Management CCNP IP VoIP Channel Partners Networking Ethernet Cloud Computing WAN Enterprise Software CRM IPSec Solution Selling QoS Virtualization SaaS Telecommunications Network Architecture SIP Business Development Unified Communications IPv6 MPLS Cisco IOS LAN-WAN Wireless Professional Services TCP/IP Computer Security Service Providers Sales Enablement Firewalls See 35+     See less Sales Management New Business Development Managing Partner... Cisco Technologies Network Security Problem Solving Physics Mathematics Astrophysics Creative Solutions Data Center Strategy Routers Managed Services Go-to-market Strategy Routing Security Pre-sales Product Management CCNP IP VoIP Channel Partners Networking Ethernet Cloud Computing WAN Enterprise Software CRM IPSec Solution Selling QoS Virtualization SaaS Telecommunications Network Architecture SIP Business Development Unified Communications IPv6 MPLS Cisco IOS LAN-WAN Wireless Professional Services TCP/IP Computer Security Service Providers Sales Enablement Firewalls See 35+     See less Education University of California, Los Angeles MS,  Astrophysics 1994  – 1996 Astrophysics Graduate student involved in researching the early stages of how stars form. Activities and Societies:  Delivered/Lectured at Astro Nights - Public viewings of Planets ,  Stars and Galaxies using UCLA Telescopes Boston University BA,  Physics and Astronomy 1990  – 1994 Studied! Also, learning how computers and computer networks worked, how to get along in large social groups, discovered a love of history. Activities and Societies:  Ballroom Dance club ,  Racquetball team ,  English-as-a-Foreign-Language charity for European and African immigrants ISC2 CISSP,  Certified Information Systems Security Professional University of California, Los Angeles MS,  Astrophysics 1994  – 1996 Astrophysics Graduate student involved in researching the early stages of how stars form. Activities and Societies:  Delivered/Lectured at Astro Nights - Public viewings of Planets ,  Stars and Galaxies using UCLA Telescopes University of California, Los Angeles MS,  Astrophysics 1994  – 1996 Astrophysics Graduate student involved in researching the early stages of how stars form. Activities and Societies:  Delivered/Lectured at Astro Nights - Public viewings of Planets ,  Stars and Galaxies using UCLA Telescopes University of California, Los Angeles MS,  Astrophysics 1994  – 1996 Astrophysics Graduate student involved in researching the early stages of how stars form. Activities and Societies:  Delivered/Lectured at Astro Nights - Public viewings of Planets ,  Stars and Galaxies using UCLA Telescopes Boston University BA,  Physics and Astronomy 1990  – 1994 Studied! Also, learning how computers and computer networks worked, how to get along in large social groups, discovered a love of history. Activities and Societies:  Ballroom Dance club ,  Racquetball team ,  English-as-a-Foreign-Language charity for European and African immigrants Boston University BA,  Physics and Astronomy 1990  – 1994 Studied! Also, learning how computers and computer networks worked, how to get along in large social groups, discovered a love of history. Activities and Societies:  Ballroom Dance club ,  Racquetball team ,  English-as-a-Foreign-Language charity for European and African immigrants Boston University BA,  Physics and Astronomy 1990  – 1994 Studied! Also, learning how computers and computer networks worked, how to get along in large social groups, discovered a love of history. Activities and Societies:  Ballroom Dance club ,  Racquetball team ,  English-as-a-Foreign-Language charity for European and African immigrants ISC2 CISSP,  Certified Information Systems Security Professional ISC2 CISSP,  Certified Information Systems Security Professional ISC2 CISSP,  Certified Information Systems Security Professional ", "Experience Business Development Manager, CEE, Enterprise and Security Architectures Cisco September 2013  – Present (2 years) Business Development Manager, EMEAR Central, BN Core Team Cisco Systems September 2011  –  August 2013  (2 years) Senior Manager, Systems Engineering, BN Architectures, Emerging Markets, East Cisco Systems August 2010  –  September 2011  (1 year 2 months) Regional Manager, Channel and Commercial Business Cisco Systems August 2009  –  July 2010  (1 year) Regional Manager, Channel and Business Development Cisco Systems October 2008  –  July 2009  (10 months) Senior Manager, Systems Engineering, Czech Cisco Systems August 2003  –  September 2008  (5 years 2 months) Manager, Systems Engineering, Czech and Slovak Cisco Systems August 1999  –  July 2003  (4 years) Systems Engineer Cisco Systems September 1997  –  July 1999  (1 year 11 months) Network Consulting Engineer Digital Equiupment Corporation (DEC) January 1995  –  August 1997  (2 years 8 months) Systems Engineer, VMS Operating System Digital Equipment Corporation (DEC) January 1992  –  December 1994  (3 years) Business Development Manager, CEE, Enterprise and Security Architectures Cisco September 2013  – Present (2 years) Business Development Manager, CEE, Enterprise and Security Architectures Cisco September 2013  – Present (2 years) Business Development Manager, EMEAR Central, BN Core Team Cisco Systems September 2011  –  August 2013  (2 years) Business Development Manager, EMEAR Central, BN Core Team Cisco Systems September 2011  –  August 2013  (2 years) Senior Manager, Systems Engineering, BN Architectures, Emerging Markets, East Cisco Systems August 2010  –  September 2011  (1 year 2 months) Senior Manager, Systems Engineering, BN Architectures, Emerging Markets, East Cisco Systems August 2010  –  September 2011  (1 year 2 months) Regional Manager, Channel and Commercial Business Cisco Systems August 2009  –  July 2010  (1 year) Regional Manager, Channel and Commercial Business Cisco Systems August 2009  –  July 2010  (1 year) Regional Manager, Channel and Business Development Cisco Systems October 2008  –  July 2009  (10 months) Regional Manager, Channel and Business Development Cisco Systems October 2008  –  July 2009  (10 months) Senior Manager, Systems Engineering, Czech Cisco Systems August 2003  –  September 2008  (5 years 2 months) Senior Manager, Systems Engineering, Czech Cisco Systems August 2003  –  September 2008  (5 years 2 months) Manager, Systems Engineering, Czech and Slovak Cisco Systems August 1999  –  July 2003  (4 years) Manager, Systems Engineering, Czech and Slovak Cisco Systems August 1999  –  July 2003  (4 years) Systems Engineer Cisco Systems September 1997  –  July 1999  (1 year 11 months) Systems Engineer Cisco Systems September 1997  –  July 1999  (1 year 11 months) Network Consulting Engineer Digital Equiupment Corporation (DEC) January 1995  –  August 1997  (2 years 8 months) Network Consulting Engineer Digital Equiupment Corporation (DEC) January 1995  –  August 1997  (2 years 8 months) Systems Engineer, VMS Operating System Digital Equipment Corporation (DEC) January 1992  –  December 1994  (3 years) Systems Engineer, VMS Operating System Digital Equipment Corporation (DEC) January 1992  –  December 1994  (3 years) Education Czech Technical University, Prague Faculty of Electrical Engineering , Technical Cybernetics 1981  – 1986 Czech Technical University, Prague Faculty of Electrical Engineering , Technical Cybernetics 1981  – 1986 Czech Technical University, Prague Faculty of Electrical Engineering , Technical Cybernetics 1981  – 1986 Czech Technical University, Prague Faculty of Electrical Engineering , Technical Cybernetics 1981  – 1986 ", "Skills Go-to-market Strategy Partner Management Business Alliances Sales Enablement Channel Strategic Partnerships Cisco Technologies Strategic Alliances Integration Security Channel Partners Program Management Business Development Enterprise Software SaaS Management Solution Selling Leadership Cloud Computing See 4+     See less Skills  Go-to-market Strategy Partner Management Business Alliances Sales Enablement Channel Strategic Partnerships Cisco Technologies Strategic Alliances Integration Security Channel Partners Program Management Business Development Enterprise Software SaaS Management Solution Selling Leadership Cloud Computing See 4+     See less Go-to-market Strategy Partner Management Business Alliances Sales Enablement Channel Strategic Partnerships Cisco Technologies Strategic Alliances Integration Security Channel Partners Program Management Business Development Enterprise Software SaaS Management Solution Selling Leadership Cloud Computing See 4+     See less Go-to-market Strategy Partner Management Business Alliances Sales Enablement Channel Strategic Partnerships Cisco Technologies Strategic Alliances Integration Security Channel Partners Program Management Business Development Enterprise Software SaaS Management Solution Selling Leadership Cloud Computing See 4+     See less ", "Languages Ukrainian Ukrainian Ukrainian Skills Go-to-market Strategy Unified Communications Strategic Partnerships Channel Partners Channel Business Alliances Telepresence Cloud Computing SaaS Business Development Solution Selling Partner Management Professional Services Managed Services Sales Enablement Data Center Demand Generation Enterprise Software Cisco Technologies VoIP Sales Management Strategy Cross-functional Team... CRM Start-ups Sales Operations Program Management Management Sales Management... Integration Strategic Alliances Leadership Consulting Sales Pre-sales Partner Development See 21+     See less Skills  Go-to-market Strategy Unified Communications Strategic Partnerships Channel Partners Channel Business Alliances Telepresence Cloud Computing SaaS Business Development Solution Selling Partner Management Professional Services Managed Services Sales Enablement Data Center Demand Generation Enterprise Software Cisco Technologies VoIP Sales Management Strategy Cross-functional Team... CRM Start-ups Sales Operations Program Management Management Sales Management... Integration Strategic Alliances Leadership Consulting Sales Pre-sales Partner Development See 21+     See less Go-to-market Strategy Unified Communications Strategic Partnerships Channel Partners Channel Business Alliances Telepresence Cloud Computing SaaS Business Development Solution Selling Partner Management Professional Services Managed Services Sales Enablement Data Center Demand Generation Enterprise Software Cisco Technologies VoIP Sales Management Strategy Cross-functional Team... CRM Start-ups Sales Operations Program Management Management Sales Management... Integration Strategic Alliances Leadership Consulting Sales Pre-sales Partner Development See 21+     See less Go-to-market Strategy Unified Communications Strategic Partnerships Channel Partners Channel Business Alliances Telepresence Cloud Computing SaaS Business Development Solution Selling Partner Management Professional Services Managed Services Sales Enablement Data Center Demand Generation Enterprise Software Cisco Technologies VoIP Sales Management Strategy Cross-functional Team... CRM Start-ups Sales Operations Program Management Management Sales Management... Integration Strategic Alliances Leadership Consulting Sales Pre-sales Partner Development See 21+     See less ", "Summary I have spent over 25 years in Bio Tech and High Tech working in product, sales and marketing for both large and small companies. \n \nToday I enjoy being a part of the great Worldwide Partner Organization team at Cisco. \n \nIn that role I work with Cisco sales, product development and partner teams to drive the Enterprise Networking go-to-market strategy for Cisco's channel partners, \n \nI specialize in: \n* Identifying the key results that need to be delivered  \n* Bringing together the needed resources \n* Team-building, leadership, clear communication \n* Building a well-though out plan \n* Driving to completion \n \nI would describe myself as a \"non-practicing geek\" - Today I focus more on soft people-skills than hard technical knowledge. Learning technology is easy, getting a project successfully completed is much more difficult and certainly more interesting.  \n \nI can see both the big picture as well as the granular details and understand that they both are important when it comes to success. Failure to clearly see both can be painful. Summary I have spent over 25 years in Bio Tech and High Tech working in product, sales and marketing for both large and small companies. \n \nToday I enjoy being a part of the great Worldwide Partner Organization team at Cisco. \n \nIn that role I work with Cisco sales, product development and partner teams to drive the Enterprise Networking go-to-market strategy for Cisco's channel partners, \n \nI specialize in: \n* Identifying the key results that need to be delivered  \n* Bringing together the needed resources \n* Team-building, leadership, clear communication \n* Building a well-though out plan \n* Driving to completion \n \nI would describe myself as a \"non-practicing geek\" - Today I focus more on soft people-skills than hard technical knowledge. Learning technology is easy, getting a project successfully completed is much more difficult and certainly more interesting.  \n \nI can see both the big picture as well as the granular details and understand that they both are important when it comes to success. Failure to clearly see both can be painful. I have spent over 25 years in Bio Tech and High Tech working in product, sales and marketing for both large and small companies. \n \nToday I enjoy being a part of the great Worldwide Partner Organization team at Cisco. \n \nIn that role I work with Cisco sales, product development and partner teams to drive the Enterprise Networking go-to-market strategy for Cisco's channel partners, \n \nI specialize in: \n* Identifying the key results that need to be delivered  \n* Bringing together the needed resources \n* Team-building, leadership, clear communication \n* Building a well-though out plan \n* Driving to completion \n \nI would describe myself as a \"non-practicing geek\" - Today I focus more on soft people-skills than hard technical knowledge. Learning technology is easy, getting a project successfully completed is much more difficult and certainly more interesting.  \n \nI can see both the big picture as well as the granular details and understand that they both are important when it comes to success. Failure to clearly see both can be painful. I have spent over 25 years in Bio Tech and High Tech working in product, sales and marketing for both large and small companies. \n \nToday I enjoy being a part of the great Worldwide Partner Organization team at Cisco. \n \nIn that role I work with Cisco sales, product development and partner teams to drive the Enterprise Networking go-to-market strategy for Cisco's channel partners, \n \nI specialize in: \n* Identifying the key results that need to be delivered  \n* Bringing together the needed resources \n* Team-building, leadership, clear communication \n* Building a well-though out plan \n* Driving to completion \n \nI would describe myself as a \"non-practicing geek\" - Today I focus more on soft people-skills than hard technical knowledge. Learning technology is easy, getting a project successfully completed is much more difficult and certainly more interesting.  \n \nI can see both the big picture as well as the granular details and understand that they both are important when it comes to success. Failure to clearly see both can be painful. Experience Sales Business Development Manager Cisco December 2013  – Present (1 year 9 months) San Jose, CA Focused on the WW Channels GTM for Enterprise Networking Sales Business Development Manager - WW Channels Unified Fabric Cisco Systems February 2013  –  December 2013  (11 months) San Jose, CA Responsible for the WW Channels GTM for Cisco's Unified Fabric Portfolio including Cisco Nexus and MDS solutions. Sales Business Development Manager - WW Channels DC Switching Cisco Systems December 2009  –  February 2013  (3 years 3 months) SJ, CA Responsible for the WW Channels GTM for Data Center Switching including Nexus Sales Business Development Manager - WW Channels Storage Networking Cisco Systems December 2007  –  December 2009  (2 years 1 month) SJ, CA Responsible for the WW Channels GTM for Storage Networking Sales Business Development Manager - WW Channels Optical Solutions Cisco Systems December 2005  –  December 2007  (2 years 1 month) SJ, CA Responsible for the WW Channels GTM for Optical Solutions PTMO Marketing Manager - Enterprise Optical Cisco Systems December 2003  –  December 2005  (2 years 1 month) Petaluma,CA Responsible for effective and measurable outbound marketing efforts for Cisco’s enterprise optical solutions. Owned developed and delivered marketing message, press plans, product launches and collateral development. ONG Marketing Manager – Optical Managed Services Cisco Systems December 2002  –  December 2003  (1 year 1 month) Petaluma, CA Determined and drove key marketing deliverables to support sale of optical networking platforms through our top managed service partners. This included the development and delivery of multiple joint marketing events, collateral pieces including success stories and white papers, as well as “packaged” trainings and field marketing events. OTBU Strategic Marketing Manager – AT&T & Canada Cisco Systems November 2000  –  December 2002  (2 years 2 months) Petaluma, CA Worked with key account stakeholders to assure their success. Amongst numerous activities this included setting up annual sales training summits, supporting RFP responses and in-person customer presentations.  \nAdditionally during this time I also co-led the optical competitive team, headed up market research and ran monthly BU operations meetings. Sr. Product Marketing Manager Sybase December 1997  –  November 2000  (3 years) Emeryville, CA Responsible for product marketing for Sybase’s Business Intelligence data management product, Adaptive Server IQ. Managed and drove marketing efforts including online campaigns, joint marketing, marketing collateral, press releases, product presentations, and trade shows. Managed creative and production staff as well as junior staff members. Sales and Marketing Manager Glyko, Inc. 1992  –  1997  (5 years) Novato, CA Managed the sales and marketing of biotech analysis instrumentation \n \nSales – Trained field reps, developed sales training materials, provided field sales support and trained overseas distributors. \nMarketing – Led all marketing efforts including advertising, tradeshows, website and collateral development. Software Development Manager Glyko, Inc. 1991  –  1992  (1 year) Novato, CA Led the development and maintenance of image analysis software for biotech instrumentation. Scientific Software Engineer Biosearch Technologies 1988  –  1991  (3 years) San Rafael, CA Development and maintenance of software applications for the user interface and control of biotech instrumentation. Sales Business Development Manager Cisco December 2013  – Present (1 year 9 months) San Jose, CA Focused on the WW Channels GTM for Enterprise Networking Sales Business Development Manager Cisco December 2013  – Present (1 year 9 months) San Jose, CA Focused on the WW Channels GTM for Enterprise Networking Sales Business Development Manager - WW Channels Unified Fabric Cisco Systems February 2013  –  December 2013  (11 months) San Jose, CA Responsible for the WW Channels GTM for Cisco's Unified Fabric Portfolio including Cisco Nexus and MDS solutions. Sales Business Development Manager - WW Channels Unified Fabric Cisco Systems February 2013  –  December 2013  (11 months) San Jose, CA Responsible for the WW Channels GTM for Cisco's Unified Fabric Portfolio including Cisco Nexus and MDS solutions. Sales Business Development Manager - WW Channels DC Switching Cisco Systems December 2009  –  February 2013  (3 years 3 months) SJ, CA Responsible for the WW Channels GTM for Data Center Switching including Nexus Sales Business Development Manager - WW Channels DC Switching Cisco Systems December 2009  –  February 2013  (3 years 3 months) SJ, CA Responsible for the WW Channels GTM for Data Center Switching including Nexus Sales Business Development Manager - WW Channels Storage Networking Cisco Systems December 2007  –  December 2009  (2 years 1 month) SJ, CA Responsible for the WW Channels GTM for Storage Networking Sales Business Development Manager - WW Channels Storage Networking Cisco Systems December 2007  –  December 2009  (2 years 1 month) SJ, CA Responsible for the WW Channels GTM for Storage Networking Sales Business Development Manager - WW Channels Optical Solutions Cisco Systems December 2005  –  December 2007  (2 years 1 month) SJ, CA Responsible for the WW Channels GTM for Optical Solutions Sales Business Development Manager - WW Channels Optical Solutions Cisco Systems December 2005  –  December 2007  (2 years 1 month) SJ, CA Responsible for the WW Channels GTM for Optical Solutions PTMO Marketing Manager - Enterprise Optical Cisco Systems December 2003  –  December 2005  (2 years 1 month) Petaluma,CA Responsible for effective and measurable outbound marketing efforts for Cisco’s enterprise optical solutions. Owned developed and delivered marketing message, press plans, product launches and collateral development. PTMO Marketing Manager - Enterprise Optical Cisco Systems December 2003  –  December 2005  (2 years 1 month) Petaluma,CA Responsible for effective and measurable outbound marketing efforts for Cisco’s enterprise optical solutions. Owned developed and delivered marketing message, press plans, product launches and collateral development. ONG Marketing Manager – Optical Managed Services Cisco Systems December 2002  –  December 2003  (1 year 1 month) Petaluma, CA Determined and drove key marketing deliverables to support sale of optical networking platforms through our top managed service partners. This included the development and delivery of multiple joint marketing events, collateral pieces including success stories and white papers, as well as “packaged” trainings and field marketing events. ONG Marketing Manager – Optical Managed Services Cisco Systems December 2002  –  December 2003  (1 year 1 month) Petaluma, CA Determined and drove key marketing deliverables to support sale of optical networking platforms through our top managed service partners. This included the development and delivery of multiple joint marketing events, collateral pieces including success stories and white papers, as well as “packaged” trainings and field marketing events. OTBU Strategic Marketing Manager – AT&T & Canada Cisco Systems November 2000  –  December 2002  (2 years 2 months) Petaluma, CA Worked with key account stakeholders to assure their success. Amongst numerous activities this included setting up annual sales training summits, supporting RFP responses and in-person customer presentations.  \nAdditionally during this time I also co-led the optical competitive team, headed up market research and ran monthly BU operations meetings. OTBU Strategic Marketing Manager – AT&T & Canada Cisco Systems November 2000  –  December 2002  (2 years 2 months) Petaluma, CA Worked with key account stakeholders to assure their success. Amongst numerous activities this included setting up annual sales training summits, supporting RFP responses and in-person customer presentations.  \nAdditionally during this time I also co-led the optical competitive team, headed up market research and ran monthly BU operations meetings. Sr. Product Marketing Manager Sybase December 1997  –  November 2000  (3 years) Emeryville, CA Responsible for product marketing for Sybase’s Business Intelligence data management product, Adaptive Server IQ. Managed and drove marketing efforts including online campaigns, joint marketing, marketing collateral, press releases, product presentations, and trade shows. Managed creative and production staff as well as junior staff members. Sr. Product Marketing Manager Sybase December 1997  –  November 2000  (3 years) Emeryville, CA Responsible for product marketing for Sybase’s Business Intelligence data management product, Adaptive Server IQ. Managed and drove marketing efforts including online campaigns, joint marketing, marketing collateral, press releases, product presentations, and trade shows. Managed creative and production staff as well as junior staff members. Sales and Marketing Manager Glyko, Inc. 1992  –  1997  (5 years) Novato, CA Managed the sales and marketing of biotech analysis instrumentation \n \nSales – Trained field reps, developed sales training materials, provided field sales support and trained overseas distributors. \nMarketing – Led all marketing efforts including advertising, tradeshows, website and collateral development. Sales and Marketing Manager Glyko, Inc. 1992  –  1997  (5 years) Novato, CA Managed the sales and marketing of biotech analysis instrumentation \n \nSales – Trained field reps, developed sales training materials, provided field sales support and trained overseas distributors. \nMarketing – Led all marketing efforts including advertising, tradeshows, website and collateral development. Software Development Manager Glyko, Inc. 1991  –  1992  (1 year) Novato, CA Led the development and maintenance of image analysis software for biotech instrumentation. Software Development Manager Glyko, Inc. 1991  –  1992  (1 year) Novato, CA Led the development and maintenance of image analysis software for biotech instrumentation. Scientific Software Engineer Biosearch Technologies 1988  –  1991  (3 years) San Rafael, CA Development and maintenance of software applications for the user interface and control of biotech instrumentation. Scientific Software Engineer Biosearch Technologies 1988  –  1991  (3 years) San Rafael, CA Development and maintenance of software applications for the user interface and control of biotech instrumentation. Languages French Spanish French Spanish French Spanish Skills Channel Management Channel Marketing Cross-functional Team... Channel Product Marketing Data Center Cisco Switches Go-to-market Strategy Channel Partners Sales Enablement Service Providers Partner Management Managed Services Competitive Analysis Product Management Cisco Technologies Business Development Unified Communications Product Launch Cloud Computing Multi-channel Marketing See 7+     See less Skills  Channel Management Channel Marketing Cross-functional Team... Channel Product Marketing Data Center Cisco Switches Go-to-market Strategy Channel Partners Sales Enablement Service Providers Partner Management Managed Services Competitive Analysis Product Management Cisco Technologies Business Development Unified Communications Product Launch Cloud Computing Multi-channel Marketing See 7+     See less Channel Management Channel Marketing Cross-functional Team... Channel Product Marketing Data Center Cisco Switches Go-to-market Strategy Channel Partners Sales Enablement Service Providers Partner Management Managed Services Competitive Analysis Product Management Cisco Technologies Business Development Unified Communications Product Launch Cloud Computing Multi-channel Marketing See 7+     See less Channel Management Channel Marketing Cross-functional Team... Channel Product Marketing Data Center Cisco Switches Go-to-market Strategy Channel Partners Sales Enablement Service Providers Partner Management Managed Services Competitive Analysis Product Management Cisco Technologies Business Development Unified Communications Product Launch Cloud Computing Multi-channel Marketing See 7+     See less Education UC Davis BS,  BioChemistry 1983  – 1985 Biochemistry BS California State University-Hayward BS,  Computer Science 1985  – 1987 Computer Science BS UC Davis BS,  BioChemistry 1983  – 1985 Biochemistry BS UC Davis BS,  BioChemistry 1983  – 1985 Biochemistry BS UC Davis BS,  BioChemistry 1983  – 1985 Biochemistry BS California State University-Hayward BS,  Computer Science 1985  – 1987 Computer Science BS California State University-Hayward BS,  Computer Science 1985  – 1987 Computer Science BS California State University-Hayward BS,  Computer Science 1985  – 1987 Computer Science BS Honors & Awards Additional Honors & Awards Cisco FY13 Rock Star Award - Worldwide Channels \nCisco FY10 Sales Champion - Worldwide Channels  \nCisco FY09 Sales Champion - Worldwide Channels \nCisco FY03 Advanced Technologies - Contributor Award (Received at Cisco Annual Sales Meeting) Additional Honors & Awards Cisco FY13 Rock Star Award - Worldwide Channels \nCisco FY10 Sales Champion - Worldwide Channels  \nCisco FY09 Sales Champion - Worldwide Channels \nCisco FY03 Advanced Technologies - Contributor Award (Received at Cisco Annual Sales Meeting) Additional Honors & Awards Cisco FY13 Rock Star Award - Worldwide Channels \nCisco FY10 Sales Champion - Worldwide Channels  \nCisco FY09 Sales Champion - Worldwide Channels \nCisco FY03 Advanced Technologies - Contributor Award (Received at Cisco Annual Sales Meeting) Additional Honors & Awards Cisco FY13 Rock Star Award - Worldwide Channels \nCisco FY10 Sales Champion - Worldwide Channels  \nCisco FY09 Sales Champion - Worldwide Channels \nCisco FY03 Advanced Technologies - Contributor Award (Received at Cisco Annual Sales Meeting) ", "Skills CISSP CCNP CCNA CCIE CCDP CCSP CCDA Business Development PMP CISA Pre-sales Cloud Computing Business Alliances Channel Partners Data Center Unified Communications Go-to-market Strategy Managed Services Solution Selling Cisco Technologies See 5+     See less Skills  CISSP CCNP CCNA CCIE CCDP CCSP CCDA Business Development PMP CISA Pre-sales Cloud Computing Business Alliances Channel Partners Data Center Unified Communications Go-to-market Strategy Managed Services Solution Selling Cisco Technologies See 5+     See less CISSP CCNP CCNA CCIE CCDP CCSP CCDA Business Development PMP CISA Pre-sales Cloud Computing Business Alliances Channel Partners Data Center Unified Communications Go-to-market Strategy Managed Services Solution Selling Cisco Technologies See 5+     See less CISSP CCNP CCNA CCIE CCDP CCSP CCDA Business Development PMP CISA Pre-sales Cloud Computing Business Alliances Channel Partners Data Center Unified Communications Go-to-market Strategy Managed Services Solution Selling Cisco Technologies See 5+     See less ", "Skills Cisco Technologies Program Management Cross-functional Team... Strategy Telecommunications Strategic Partnerships Management Demand Generation Leadership Marketing Strategy Channel Partners Marketing Project Management Business Development Marketing Management Business Process Integrated Marketing Go-to-market Strategy Training Product Management Solution Selling SaaS Product Marketing Sales Consulting Salesforce.com See 11+     See less Skills  Cisco Technologies Program Management Cross-functional Team... Strategy Telecommunications Strategic Partnerships Management Demand Generation Leadership Marketing Strategy Channel Partners Marketing Project Management Business Development Marketing Management Business Process Integrated Marketing Go-to-market Strategy Training Product Management Solution Selling SaaS Product Marketing Sales Consulting Salesforce.com See 11+     See less Cisco Technologies Program Management Cross-functional Team... Strategy Telecommunications Strategic Partnerships Management Demand Generation Leadership Marketing Strategy Channel Partners Marketing Project Management Business Development Marketing Management Business Process Integrated Marketing Go-to-market Strategy Training Product Management Solution Selling SaaS Product Marketing Sales Consulting Salesforce.com See 11+     See less Cisco Technologies Program Management Cross-functional Team... Strategy Telecommunications Strategic Partnerships Management Demand Generation Leadership Marketing Strategy Channel Partners Marketing Project Management Business Development Marketing Management Business Process Integrated Marketing Go-to-market Strategy Training Product Management Solution Selling SaaS Product Marketing Sales Consulting Salesforce.com See 11+     See less Honors & Awards Leadership Award for The Cisco Partner Annuity Program Cisco April 2013 Advanced Program Management & Strategic Leadership Stanford University April 2015 Additional Honors & Awards Prince 2, Major in International Marketing, European Trade/Commercial Law and Finance. \n \nHold a double Degree from the California State University in International Management and Business Economics. \n \nCompleted several Project Managment courses within Cisco for completion on major projects. Leadership Award for The Cisco Partner Annuity Program Cisco April 2013 Leadership Award for The Cisco Partner Annuity Program Cisco April 2013 Leadership Award for The Cisco Partner Annuity Program Cisco April 2013 Advanced Program Management & Strategic Leadership Stanford University April 2015 Advanced Program Management & Strategic Leadership Stanford University April 2015 Advanced Program Management & Strategic Leadership Stanford University April 2015 Additional Honors & Awards Prince 2, Major in International Marketing, European Trade/Commercial Law and Finance. \n \nHold a double Degree from the California State University in International Management and Business Economics. \n \nCompleted several Project Managment courses within Cisco for completion on major projects. Additional Honors & Awards Prince 2, Major in International Marketing, European Trade/Commercial Law and Finance. \n \nHold a double Degree from the California State University in International Management and Business Economics. \n \nCompleted several Project Managment courses within Cisco for completion on major projects. Additional Honors & Awards Prince 2, Major in International Marketing, European Trade/Commercial Law and Finance. \n \nHold a double Degree from the California State University in International Management and Business Economics. \n \nCompleted several Project Managment courses within Cisco for completion on major projects. ", "Languages Spanish Spanish Spanish Skills Service Providers Cloud Computing Physical Security Wireless Networking Cisco Routing &... Data Center Sales Business Development Wireless Mobility Channel Partners Ethernet Strategy Competitive Analysis Managed Services Cisco Technologies Marketing Management Routers Team Leadership QoS Sales Operations Network Architecture Enterprise Software SaaS Cisco Routers Routing VoIP WAN Account Management Telecommunications IP Juniper Go-to-market Strategy Product Development Unified Communications Humor Networking Sales Enablement MPLS Network Design Network Security Security Cross-functional Team... Management Solution Selling See 29+     See less Skills  Service Providers Cloud Computing Physical Security Wireless Networking Cisco Routing &... Data Center Sales Business Development Wireless Mobility Channel Partners Ethernet Strategy Competitive Analysis Managed Services Cisco Technologies Marketing Management Routers Team Leadership QoS Sales Operations Network Architecture Enterprise Software SaaS Cisco Routers Routing VoIP WAN Account Management Telecommunications IP Juniper Go-to-market Strategy Product Development Unified Communications Humor Networking Sales Enablement MPLS Network Design Network Security Security Cross-functional Team... Management Solution Selling See 29+     See less Service Providers Cloud Computing Physical Security Wireless Networking Cisco Routing &... Data Center Sales Business Development Wireless Mobility Channel Partners Ethernet Strategy Competitive Analysis Managed Services Cisco Technologies Marketing Management Routers Team Leadership QoS Sales Operations Network Architecture Enterprise Software SaaS Cisco Routers Routing VoIP WAN Account Management Telecommunications IP Juniper Go-to-market Strategy Product Development Unified Communications Humor Networking Sales Enablement MPLS Network Design Network Security Security Cross-functional Team... Management Solution Selling See 29+     See less Service Providers Cloud Computing Physical Security Wireless Networking Cisco Routing &... Data Center Sales Business Development Wireless Mobility Channel Partners Ethernet Strategy Competitive Analysis Managed Services Cisco Technologies Marketing Management Routers Team Leadership QoS Sales Operations Network Architecture Enterprise Software SaaS Cisco Routers Routing VoIP WAN Account Management Telecommunications IP Juniper Go-to-market Strategy Product Development Unified Communications Humor Networking Sales Enablement MPLS Network Design Network Security Security Cross-functional Team... Management Solution Selling See 29+     See less ", "Summary Filippo Galimberti has several years of experience the context of Service Providers. \n \nCurrently at Cisco, as Business Development Manager, he's focusing on Software Defined Networking (SDN) and Network function Virtualization (NfV) for EMEA Service Providers teams. \n \n \nFilippo focus in developing business through innovation of SDN and NfV, supporting SPs evolution Carrier WAN on innovation and Operations toward agility and optimization through SDN. \n \nHe is also collaborating with the Cisco Engineering Department to develop the next generation of Cisco products and strategy. \n \nHe has MsC degree in Electric Engineering. Before joining Cisco he has been working with major European Service Providers designing Software Architectures and Network Operations. \n \nSpecialties: \nMarketing, Business Development \nSoftware Defined Networking (SDN) and Network function Virtualization (NfV) \nOperations, NMS/OSS \nUltra BroadBand, Next Generation Access \n \nSales Negotiation \nService Providers \nPre-Sales Support \nPre-Sales Consulting \nSolution Architecture and Design \nRequirements definition \n \nTelecom Italia, British Telecom, France Telecom, Deutsche Telekom, Vodafone, Fastweb, Wind, Telefonica, Telia Sonera Summary Filippo Galimberti has several years of experience the context of Service Providers. \n \nCurrently at Cisco, as Business Development Manager, he's focusing on Software Defined Networking (SDN) and Network function Virtualization (NfV) for EMEA Service Providers teams. \n \n \nFilippo focus in developing business through innovation of SDN and NfV, supporting SPs evolution Carrier WAN on innovation and Operations toward agility and optimization through SDN. \n \nHe is also collaborating with the Cisco Engineering Department to develop the next generation of Cisco products and strategy. \n \nHe has MsC degree in Electric Engineering. Before joining Cisco he has been working with major European Service Providers designing Software Architectures and Network Operations. \n \nSpecialties: \nMarketing, Business Development \nSoftware Defined Networking (SDN) and Network function Virtualization (NfV) \nOperations, NMS/OSS \nUltra BroadBand, Next Generation Access \n \nSales Negotiation \nService Providers \nPre-Sales Support \nPre-Sales Consulting \nSolution Architecture and Design \nRequirements definition \n \nTelecom Italia, British Telecom, France Telecom, Deutsche Telekom, Vodafone, Fastweb, Wind, Telefonica, Telia Sonera Filippo Galimberti has several years of experience the context of Service Providers. \n \nCurrently at Cisco, as Business Development Manager, he's focusing on Software Defined Networking (SDN) and Network function Virtualization (NfV) for EMEA Service Providers teams. \n \n \nFilippo focus in developing business through innovation of SDN and NfV, supporting SPs evolution Carrier WAN on innovation and Operations toward agility and optimization through SDN. \n \nHe is also collaborating with the Cisco Engineering Department to develop the next generation of Cisco products and strategy. \n \nHe has MsC degree in Electric Engineering. Before joining Cisco he has been working with major European Service Providers designing Software Architectures and Network Operations. \n \nSpecialties: \nMarketing, Business Development \nSoftware Defined Networking (SDN) and Network function Virtualization (NfV) \nOperations, NMS/OSS \nUltra BroadBand, Next Generation Access \n \nSales Negotiation \nService Providers \nPre-Sales Support \nPre-Sales Consulting \nSolution Architecture and Design \nRequirements definition \n \nTelecom Italia, British Telecom, France Telecom, Deutsche Telekom, Vodafone, Fastweb, Wind, Telefonica, Telia Sonera Filippo Galimberti has several years of experience the context of Service Providers. \n \nCurrently at Cisco, as Business Development Manager, he's focusing on Software Defined Networking (SDN) and Network function Virtualization (NfV) for EMEA Service Providers teams. \n \n \nFilippo focus in developing business through innovation of SDN and NfV, supporting SPs evolution Carrier WAN on innovation and Operations toward agility and optimization through SDN. \n \nHe is also collaborating with the Cisco Engineering Department to develop the next generation of Cisco products and strategy. \n \nHe has MsC degree in Electric Engineering. Before joining Cisco he has been working with major European Service Providers designing Software Architectures and Network Operations. \n \nSpecialties: \nMarketing, Business Development \nSoftware Defined Networking (SDN) and Network function Virtualization (NfV) \nOperations, NMS/OSS \nUltra BroadBand, Next Generation Access \n \nSales Negotiation \nService Providers \nPre-Sales Support \nPre-Sales Consulting \nSolution Architecture and Design \nRequirements definition \n \nTelecom Italia, British Telecom, France Telecom, Deutsche Telekom, Vodafone, Fastweb, Wind, Telefonica, Telia Sonera Experience Business Development Manager EMEA Service Provider - SDN Cisco October 2012  – Present (2 years 11 months) Business development focusing on SDN and NfV to develop the Service Provider Segment \n \n \n- Drive business strategy in EMEA, synergy with local Account Teams \n- Interlock with Corporate Engineering \n- Partners Development \n- Leading a pan-European Virtual Team \n \nFocusing on Software Defined Networking (SDN) and Network function Virtualization with the objective of successfully deliver Cisco IP NGN network architectures. \nDeveloping business around the change of Carrier WAN and Operations toward agility and optimization through SDN. \n \nClear understanding of business rationales along with telecommunications technical understanding and crisp Operations, Cloud and Network Management know how. \n \nQuota carrying. \nThe approach is end-to-end from business analysis, requirements gathering, high touch discussions to architecture finalization. \nMy activity has a strong focus on telecommunications business and architectures. Head of Ultra BroadBand initiative Cisco Systems June 2009  –  August 2013  (4 years 3 months) Milan Area, Italy Business Development Manager EMEA Service Provider Architectures Cisco Systems July 2009  –  September 2012  (3 years 3 months) Milan Area, Italy Business Development Manager Cisco Systems September 2004  –  July 2009  (4 years 11 months) Milan Area, Italy Consulting System Engineer Cisco Systems April 2000  –  August 2004  (4 years 5 months) Consultant Microsoft April 1999  –  April 2000  (1 year 1 month) Chief Project Manager 9 telecom (Telecom Italia group) May 1998  –  April 1999  (1 year) System Engineer – Software Architect Sirti spa - Telecom Italia Group January 1995  –  May 1998  (3 years 5 months) Software Engineer I.A.N. srl June 1993  –  January 1996  (2 years 8 months) Business Development Manager EMEA Service Provider - SDN Cisco October 2012  – Present (2 years 11 months) Business development focusing on SDN and NfV to develop the Service Provider Segment \n \n \n- Drive business strategy in EMEA, synergy with local Account Teams \n- Interlock with Corporate Engineering \n- Partners Development \n- Leading a pan-European Virtual Team \n \nFocusing on Software Defined Networking (SDN) and Network function Virtualization with the objective of successfully deliver Cisco IP NGN network architectures. \nDeveloping business around the change of Carrier WAN and Operations toward agility and optimization through SDN. \n \nClear understanding of business rationales along with telecommunications technical understanding and crisp Operations, Cloud and Network Management know how. \n \nQuota carrying. \nThe approach is end-to-end from business analysis, requirements gathering, high touch discussions to architecture finalization. \nMy activity has a strong focus on telecommunications business and architectures. Business Development Manager EMEA Service Provider - SDN Cisco October 2012  – Present (2 years 11 months) Business development focusing on SDN and NfV to develop the Service Provider Segment \n \n \n- Drive business strategy in EMEA, synergy with local Account Teams \n- Interlock with Corporate Engineering \n- Partners Development \n- Leading a pan-European Virtual Team \n \nFocusing on Software Defined Networking (SDN) and Network function Virtualization with the objective of successfully deliver Cisco IP NGN network architectures. \nDeveloping business around the change of Carrier WAN and Operations toward agility and optimization through SDN. \n \nClear understanding of business rationales along with telecommunications technical understanding and crisp Operations, Cloud and Network Management know how. \n \nQuota carrying. \nThe approach is end-to-end from business analysis, requirements gathering, high touch discussions to architecture finalization. \nMy activity has a strong focus on telecommunications business and architectures. Head of Ultra BroadBand initiative Cisco Systems June 2009  –  August 2013  (4 years 3 months) Milan Area, Italy Head of Ultra BroadBand initiative Cisco Systems June 2009  –  August 2013  (4 years 3 months) Milan Area, Italy Business Development Manager EMEA Service Provider Architectures Cisco Systems July 2009  –  September 2012  (3 years 3 months) Milan Area, Italy Business Development Manager EMEA Service Provider Architectures Cisco Systems July 2009  –  September 2012  (3 years 3 months) Milan Area, Italy Business Development Manager Cisco Systems September 2004  –  July 2009  (4 years 11 months) Milan Area, Italy Business Development Manager Cisco Systems September 2004  –  July 2009  (4 years 11 months) Milan Area, Italy Consulting System Engineer Cisco Systems April 2000  –  August 2004  (4 years 5 months) Consulting System Engineer Cisco Systems April 2000  –  August 2004  (4 years 5 months) Consultant Microsoft April 1999  –  April 2000  (1 year 1 month) Consultant Microsoft April 1999  –  April 2000  (1 year 1 month) Chief Project Manager 9 telecom (Telecom Italia group) May 1998  –  April 1999  (1 year) Chief Project Manager 9 telecom (Telecom Italia group) May 1998  –  April 1999  (1 year) System Engineer – Software Architect Sirti spa - Telecom Italia Group January 1995  –  May 1998  (3 years 5 months) System Engineer – Software Architect Sirti spa - Telecom Italia Group January 1995  –  May 1998  (3 years 5 months) Software Engineer I.A.N. srl June 1993  –  January 1996  (2 years 8 months) Software Engineer I.A.N. srl June 1993  –  January 1996  (2 years 8 months) Languages Italian Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Italian Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Italian Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Telecommunications IP Go-to-market Strategy Solution Architecture Cisco Technologies Pre-sales Strategy Enterprise Software Data Center Cloud Computing VoIP Product Management Networking Wireless Network Administration Business Development Management Product Marketing SaaS Start-ups Business Strategy Architecture Unified Communications Network Architecture SDN Cisco NfV NMS/OSS Service Providers software defined... IP NGN OpenFlow Mobile Devices Broadband Managed Services See 20+     See less Skills  Telecommunications IP Go-to-market Strategy Solution Architecture Cisco Technologies Pre-sales Strategy Enterprise Software Data Center Cloud Computing VoIP Product Management Networking Wireless Network Administration Business Development Management Product Marketing SaaS Start-ups Business Strategy Architecture Unified Communications Network Architecture SDN Cisco NfV NMS/OSS Service Providers software defined... IP NGN OpenFlow Mobile Devices Broadband Managed Services See 20+     See less Telecommunications IP Go-to-market Strategy Solution Architecture Cisco Technologies Pre-sales Strategy Enterprise Software Data Center Cloud Computing VoIP Product Management Networking Wireless Network Administration Business Development Management Product Marketing SaaS Start-ups Business Strategy Architecture Unified Communications Network Architecture SDN Cisco NfV NMS/OSS Service Providers software defined... IP NGN OpenFlow Mobile Devices Broadband Managed Services See 20+     See less Telecommunications IP Go-to-market Strategy Solution Architecture Cisco Technologies Pre-sales Strategy Enterprise Software Data Center Cloud Computing VoIP Product Management Networking Wireless Network Administration Business Development Management Product Marketing SaaS Start-ups Business Strategy Architecture Unified Communications Network Architecture SDN Cisco NfV NMS/OSS Service Providers software defined... IP NGN OpenFlow Mobile Devices Broadband Managed Services See 20+     See less "]}