{"position": "Administrative Associate", "company": "Stanford University", "profiles": ["Summary I am a highly skilled office administrator, particularly with record-keeping and data accuracy, passing audits and complying with regulations. I am proficient at using all the administrative software applications required for my job, including internet browsers, iProcurement, OrderIT, iSpace, Sunflower, MS Word & Excel, Eudora & Zimbra email, and moderate desktop/printer troubleshooting skills. I am a creative-problem solver and will always find a way, usually the best/fastest/most efficient way, to get the job done. My goals are: \n1) to keep my department's space inventory and equipment inventory as accurate as possible so that we pass our annual and biennial audits. \n2) keep my department provisioned with telecom services by submitting orders for them. \n3) expertly coordinate the ad hoc projects which are assigned to me. \n4) general administrative excellence in written communications (both individual emails and mass emails), record-keeping, organization of my desk, emails and files, and my extensive institutional memory gained thru nearly 20 years experience with my employer. Summary I am a highly skilled office administrator, particularly with record-keeping and data accuracy, passing audits and complying with regulations. I am proficient at using all the administrative software applications required for my job, including internet browsers, iProcurement, OrderIT, iSpace, Sunflower, MS Word & Excel, Eudora & Zimbra email, and moderate desktop/printer troubleshooting skills. I am a creative-problem solver and will always find a way, usually the best/fastest/most efficient way, to get the job done. My goals are: \n1) to keep my department's space inventory and equipment inventory as accurate as possible so that we pass our annual and biennial audits. \n2) keep my department provisioned with telecom services by submitting orders for them. \n3) expertly coordinate the ad hoc projects which are assigned to me. \n4) general administrative excellence in written communications (both individual emails and mass emails), record-keeping, organization of my desk, emails and files, and my extensive institutional memory gained thru nearly 20 years experience with my employer. I am a highly skilled office administrator, particularly with record-keeping and data accuracy, passing audits and complying with regulations. I am proficient at using all the administrative software applications required for my job, including internet browsers, iProcurement, OrderIT, iSpace, Sunflower, MS Word & Excel, Eudora & Zimbra email, and moderate desktop/printer troubleshooting skills. I am a creative-problem solver and will always find a way, usually the best/fastest/most efficient way, to get the job done. My goals are: \n1) to keep my department's space inventory and equipment inventory as accurate as possible so that we pass our annual and biennial audits. \n2) keep my department provisioned with telecom services by submitting orders for them. \n3) expertly coordinate the ad hoc projects which are assigned to me. \n4) general administrative excellence in written communications (both individual emails and mass emails), record-keeping, organization of my desk, emails and files, and my extensive institutional memory gained thru nearly 20 years experience with my employer. I am a highly skilled office administrator, particularly with record-keeping and data accuracy, passing audits and complying with regulations. I am proficient at using all the administrative software applications required for my job, including internet browsers, iProcurement, OrderIT, iSpace, Sunflower, MS Word & Excel, Eudora & Zimbra email, and moderate desktop/printer troubleshooting skills. I am a creative-problem solver and will always find a way, usually the best/fastest/most efficient way, to get the job done. My goals are: \n1) to keep my department's space inventory and equipment inventory as accurate as possible so that we pass our annual and biennial audits. \n2) keep my department provisioned with telecom services by submitting orders for them. \n3) expertly coordinate the ad hoc projects which are assigned to me. \n4) general administrative excellence in written communications (both individual emails and mass emails), record-keeping, organization of my desk, emails and files, and my extensive institutional memory gained thru nearly 20 years experience with my employer. Experience Administrative Associate Stanford University School of Medicine - Cardiovascular Institute April 2014  – Present (1 year 5 months) San Francisco Bay Area Administrative Associate for the Cardiovascular Institute and to Dr. Joseph Wu, Director of the Cardiovascular Institute. Administrative Associate Stanford University School of Medicine - Neurosurgery November 2013  –  March 2014  (5 months) San Francisco Bay Area Temporary assignment as a Faculty Affairs Administrator, processing appointments for Clinician Educators and Visiting Scholars. Collect paperwork from candidates and references, complete forms, assemble appointment packets & submit to dean. Submit J-1 Visa requests. Administrative Associate Stanford University School of Medicine - Mathematics November 2013  –  November 2013  (1 month) San Francisco Bay Area Temporary 3-day assignment processing a backlog of travel reimbursement transactions in iOU for Mathematics faculty & visitors. Submitted 28 transactions in three 7-hr days. Administrative Associate Stanford University School of Medicine - Psychiatry February 1998  –  February 2013  (15 years 1 month) San Francisco Bay Area Wide variety of administrative functions over the years, including Department Property Administrator (EIS, CAMS, Sunflower); Space Coordinator (iSpace), and STAR (CSO, OrderIT). Facilities Coordinator. Order office keys from security, copier/fax maintenance & billing in iJournals, liaison with outside vendors, contractors, Stanford & non-stanford project managers. Support 250+ Voluntary Clinical Faculty (now known as ACF), using FileMaker Pro database, and paper files. Light desktop computer support (troubleshooting, printing problems, email problems). Originate and approve purchase orders in iProcurement. Answer main phone line as back-up. Coordinate large and small construction and move projects. Communicate and liaison with affected end users via mass emails. Administrative Assistant Stanford University School of Medicine - Radiology June 1992  –  November 1994  (2 years 6 months) Stanford, CA Routine office support including filing, typing, sort mail, make copies, send faxes, room scheduling, answer phones, coordinate travel for various Radiology faculty, type dictation, maintain calendar, update CV's, become familiar with relevant medical terminology, order supplies (SNAP purchasing), maintain and organize supply cabinet, run errands around campus, fill in for other co-workers. Administrative Associate Stanford University School of Medicine - Cardiovascular Institute April 2014  – Present (1 year 5 months) San Francisco Bay Area Administrative Associate for the Cardiovascular Institute and to Dr. Joseph Wu, Director of the Cardiovascular Institute. Administrative Associate Stanford University School of Medicine - Cardiovascular Institute April 2014  – Present (1 year 5 months) San Francisco Bay Area Administrative Associate for the Cardiovascular Institute and to Dr. Joseph Wu, Director of the Cardiovascular Institute. Administrative Associate Stanford University School of Medicine - Neurosurgery November 2013  –  March 2014  (5 months) San Francisco Bay Area Temporary assignment as a Faculty Affairs Administrator, processing appointments for Clinician Educators and Visiting Scholars. Collect paperwork from candidates and references, complete forms, assemble appointment packets & submit to dean. Submit J-1 Visa requests. Administrative Associate Stanford University School of Medicine - Neurosurgery November 2013  –  March 2014  (5 months) San Francisco Bay Area Temporary assignment as a Faculty Affairs Administrator, processing appointments for Clinician Educators and Visiting Scholars. Collect paperwork from candidates and references, complete forms, assemble appointment packets & submit to dean. Submit J-1 Visa requests. Administrative Associate Stanford University School of Medicine - Mathematics November 2013  –  November 2013  (1 month) San Francisco Bay Area Temporary 3-day assignment processing a backlog of travel reimbursement transactions in iOU for Mathematics faculty & visitors. Submitted 28 transactions in three 7-hr days. Administrative Associate Stanford University School of Medicine - Mathematics November 2013  –  November 2013  (1 month) San Francisco Bay Area Temporary 3-day assignment processing a backlog of travel reimbursement transactions in iOU for Mathematics faculty & visitors. Submitted 28 transactions in three 7-hr days. Administrative Associate Stanford University School of Medicine - Psychiatry February 1998  –  February 2013  (15 years 1 month) San Francisco Bay Area Wide variety of administrative functions over the years, including Department Property Administrator (EIS, CAMS, Sunflower); Space Coordinator (iSpace), and STAR (CSO, OrderIT). Facilities Coordinator. Order office keys from security, copier/fax maintenance & billing in iJournals, liaison with outside vendors, contractors, Stanford & non-stanford project managers. Support 250+ Voluntary Clinical Faculty (now known as ACF), using FileMaker Pro database, and paper files. Light desktop computer support (troubleshooting, printing problems, email problems). Originate and approve purchase orders in iProcurement. Answer main phone line as back-up. Coordinate large and small construction and move projects. Communicate and liaison with affected end users via mass emails. Administrative Associate Stanford University School of Medicine - Psychiatry February 1998  –  February 2013  (15 years 1 month) San Francisco Bay Area Wide variety of administrative functions over the years, including Department Property Administrator (EIS, CAMS, Sunflower); Space Coordinator (iSpace), and STAR (CSO, OrderIT). Facilities Coordinator. Order office keys from security, copier/fax maintenance & billing in iJournals, liaison with outside vendors, contractors, Stanford & non-stanford project managers. Support 250+ Voluntary Clinical Faculty (now known as ACF), using FileMaker Pro database, and paper files. Light desktop computer support (troubleshooting, printing problems, email problems). Originate and approve purchase orders in iProcurement. Answer main phone line as back-up. Coordinate large and small construction and move projects. Communicate and liaison with affected end users via mass emails. Administrative Assistant Stanford University School of Medicine - Radiology June 1992  –  November 1994  (2 years 6 months) Stanford, CA Routine office support including filing, typing, sort mail, make copies, send faxes, room scheduling, answer phones, coordinate travel for various Radiology faculty, type dictation, maintain calendar, update CV's, become familiar with relevant medical terminology, order supplies (SNAP purchasing), maintain and organize supply cabinet, run errands around campus, fill in for other co-workers. Administrative Assistant Stanford University School of Medicine - Radiology June 1992  –  November 1994  (2 years 6 months) Stanford, CA Routine office support including filing, typing, sort mail, make copies, send faxes, room scheduling, answer phones, coordinate travel for various Radiology faculty, type dictation, maintain calendar, update CV's, become familiar with relevant medical terminology, order supplies (SNAP purchasing), maintain and organize supply cabinet, run errands around campus, fill in for other co-workers. Languages English Czech English Czech English Czech Skills Asset Management Facilities Management Project Coordination Office Management Microsoft Office Microsoft Excel Microsoft Word Data Analysis Administrative... Filing Accurate Data Entry Sunflower iSpace Eudora Internal Audit OrderIT Internet Office & Industrial... See 3+     See less Skills  Asset Management Facilities Management Project Coordination Office Management Microsoft Office Microsoft Excel Microsoft Word Data Analysis Administrative... Filing Accurate Data Entry Sunflower iSpace Eudora Internal Audit OrderIT Internet Office & Industrial... See 3+     See less Asset Management Facilities Management Project Coordination Office Management Microsoft Office Microsoft Excel Microsoft Word Data Analysis Administrative... Filing Accurate Data Entry Sunflower iSpace Eudora Internal Audit OrderIT Internet Office & Industrial... See 3+     See less Asset Management Facilities Management Project Coordination Office Management Microsoft Office Microsoft Excel Microsoft Word Data Analysis Administrative... Filing Accurate Data Entry Sunflower iSpace Eudora Internal Audit OrderIT Internet Office & Industrial... See 3+     See less Education San Jose State University Aviation/Airway Management and Operations 2002  – 2002 Evergreen Valley College 1994  – 1994 San Jose State University Aviation/Airway Management and Operations 2002  – 2002 San Jose State University Aviation/Airway Management and Operations 2002  – 2002 San Jose State University Aviation/Airway Management and Operations 2002  – 2002 Evergreen Valley College 1994  – 1994 Evergreen Valley College 1994  – 1994 Evergreen Valley College 1994  – 1994 ", "Experience Administrative Associate Stanford University, Vaden Health Center February 2015  –  July 2015  (6 months) Stanford, CA •Working with Vaden Health Center Administration and Quality Control Council to prepare for Accreditation Association for Ambulatory Healthcare (AAAHC) onsite re-accreditation survey. \n•Redesigned and created Campus Emergency Response Plan (CMRP) for Vaden Department Operations Center (DOC) for use during an emergency operational period. Created in accordance with FEMA and Hospital Incident Command System guidelines and ambulatory response center recommendations. \n•Redesigned and created DOC emergency information reference and DOC committee contact information cards. \n• Created a center emergency contact information data base for contacting employees and their families during a personal or campus emergency. \n•Designed and created new management forms for use in center departments for more efficient information gathering and procedural use. \n•Updated and reformatted department policies for AAAHC accreditation. Administrative Associate Stanford University School of Medicine October 2014  –  February 2015  (5 months) Stanford, CA •Worked with a search committee on the recruitment of Senior Leadership for the Surgery, Ophthalmology, and Pathology Department at Stanford University School of Medicine. \n•Completed and provided research and information to assist in developing recruitment materials for the search committee. \n•Managed candidate agendas and scheduling of candidate meetings with university faculty and staff. \n•Assisted in arranging traveling, transportation and lodging itineraries for position candidates. Law Clerk Santa Clara County October 2014  –  February 2015  (5 months) San Jose, California •Organize discovery/case files, create case binders and evidence logs, and redact information from case files \n•Review case discovery Front Office Assistant Stanford University Environmental Health & Safety Center December 2014  –  December 2014  (1 month) Stanford, California •Completed clerical work, front desk reception, data entry, patient/client intake, set up and clean up of offices and conference rooms, letter writing, mail sorting, sending and receiving of packages. Leadership Facilitator University of California, Riverside Challenge Course & Mobile Climbing Wall June 2012  –  August 2014  (2 years 3 months) Riverside, California •Designed, planned, and lead activities that enabled individuals and teams to explore; communication, group dynamics, decision-making, team spirit and facilitated; trust, cooperation, motivation, creativity and conflict resolution through debriefings and peer evaluations \n•Created and maintained a physically and emotionally safe environment for successful achievement of individual and team objectives \n•Facilitated groups through the elements of the Challenge Course to enable leadership, teamwork, confidence, communication and problem solving skills while providing a meaningful experience \n•Certified in CPR, First Aid and climbing instruction \n•Trained in set up, maintenance and proper operation of Challenge Course and Mobile Climbing Wall equipment and supervision of climbers and participants Research Assistant Law Offices of Carpenter & Mayfield March 2013  –  March 2013  (1 month) San Jose, California •Visited different geographic and demographic areas of the city of San Jose to poll the public for research pertaining to an upcoming criminal trial case. \n•Compiled and presented data from the research survey results to the lead attorney. Administrative Associate / Intern Senator Bill Emmerson September 2011  –  March 2012  (7 months) Riverside, California •Actively worked constituent cases through the process of receiving and evaluating the request, designation of appropriate agency jurisdiction, contact and monitoring of progress and final resolution  \n•Researched, developed and monitored a “Student of the Month” program at the Elementary, Junior High, and High School levels within the district \n•Prepared and presented certificates and letters of recognition honoring various citizen accomplishments \n•Represented the Senator at public events such as Town Hall and Chamber of Commerce meetings \n•Created and maintained outreach and contact lists for Senator’s constituents Swimming Instructor Southwest YMCA April 2010  –  September 2010  (6 months) Saratoga, California •Created and implemented basic to advanced level swimming instruction programs for adults and children \n•Instructed and coached beginning to advanced swimmers  \n•Communicated daily progress and provided constructive feedback to students, parents, and Aquatics Director by way of Evaluation Forms and verbal feedback Administrative Associate Stanford University, Vaden Health Center February 2015  –  July 2015  (6 months) Stanford, CA •Working with Vaden Health Center Administration and Quality Control Council to prepare for Accreditation Association for Ambulatory Healthcare (AAAHC) onsite re-accreditation survey. \n•Redesigned and created Campus Emergency Response Plan (CMRP) for Vaden Department Operations Center (DOC) for use during an emergency operational period. Created in accordance with FEMA and Hospital Incident Command System guidelines and ambulatory response center recommendations. \n•Redesigned and created DOC emergency information reference and DOC committee contact information cards. \n• Created a center emergency contact information data base for contacting employees and their families during a personal or campus emergency. \n•Designed and created new management forms for use in center departments for more efficient information gathering and procedural use. \n•Updated and reformatted department policies for AAAHC accreditation. Administrative Associate Stanford University, Vaden Health Center February 2015  –  July 2015  (6 months) Stanford, CA •Working with Vaden Health Center Administration and Quality Control Council to prepare for Accreditation Association for Ambulatory Healthcare (AAAHC) onsite re-accreditation survey. \n•Redesigned and created Campus Emergency Response Plan (CMRP) for Vaden Department Operations Center (DOC) for use during an emergency operational period. Created in accordance with FEMA and Hospital Incident Command System guidelines and ambulatory response center recommendations. \n•Redesigned and created DOC emergency information reference and DOC committee contact information cards. \n• Created a center emergency contact information data base for contacting employees and their families during a personal or campus emergency. \n•Designed and created new management forms for use in center departments for more efficient information gathering and procedural use. \n•Updated and reformatted department policies for AAAHC accreditation. Administrative Associate Stanford University School of Medicine October 2014  –  February 2015  (5 months) Stanford, CA •Worked with a search committee on the recruitment of Senior Leadership for the Surgery, Ophthalmology, and Pathology Department at Stanford University School of Medicine. \n•Completed and provided research and information to assist in developing recruitment materials for the search committee. \n•Managed candidate agendas and scheduling of candidate meetings with university faculty and staff. \n•Assisted in arranging traveling, transportation and lodging itineraries for position candidates. Administrative Associate Stanford University School of Medicine October 2014  –  February 2015  (5 months) Stanford, CA •Worked with a search committee on the recruitment of Senior Leadership for the Surgery, Ophthalmology, and Pathology Department at Stanford University School of Medicine. \n•Completed and provided research and information to assist in developing recruitment materials for the search committee. \n•Managed candidate agendas and scheduling of candidate meetings with university faculty and staff. \n•Assisted in arranging traveling, transportation and lodging itineraries for position candidates. Law Clerk Santa Clara County October 2014  –  February 2015  (5 months) San Jose, California •Organize discovery/case files, create case binders and evidence logs, and redact information from case files \n•Review case discovery Law Clerk Santa Clara County October 2014  –  February 2015  (5 months) San Jose, California •Organize discovery/case files, create case binders and evidence logs, and redact information from case files \n•Review case discovery Front Office Assistant Stanford University Environmental Health & Safety Center December 2014  –  December 2014  (1 month) Stanford, California •Completed clerical work, front desk reception, data entry, patient/client intake, set up and clean up of offices and conference rooms, letter writing, mail sorting, sending and receiving of packages. Front Office Assistant Stanford University Environmental Health & Safety Center December 2014  –  December 2014  (1 month) Stanford, California •Completed clerical work, front desk reception, data entry, patient/client intake, set up and clean up of offices and conference rooms, letter writing, mail sorting, sending and receiving of packages. Leadership Facilitator University of California, Riverside Challenge Course & Mobile Climbing Wall June 2012  –  August 2014  (2 years 3 months) Riverside, California •Designed, planned, and lead activities that enabled individuals and teams to explore; communication, group dynamics, decision-making, team spirit and facilitated; trust, cooperation, motivation, creativity and conflict resolution through debriefings and peer evaluations \n•Created and maintained a physically and emotionally safe environment for successful achievement of individual and team objectives \n•Facilitated groups through the elements of the Challenge Course to enable leadership, teamwork, confidence, communication and problem solving skills while providing a meaningful experience \n•Certified in CPR, First Aid and climbing instruction \n•Trained in set up, maintenance and proper operation of Challenge Course and Mobile Climbing Wall equipment and supervision of climbers and participants Leadership Facilitator University of California, Riverside Challenge Course & Mobile Climbing Wall June 2012  –  August 2014  (2 years 3 months) Riverside, California •Designed, planned, and lead activities that enabled individuals and teams to explore; communication, group dynamics, decision-making, team spirit and facilitated; trust, cooperation, motivation, creativity and conflict resolution through debriefings and peer evaluations \n•Created and maintained a physically and emotionally safe environment for successful achievement of individual and team objectives \n•Facilitated groups through the elements of the Challenge Course to enable leadership, teamwork, confidence, communication and problem solving skills while providing a meaningful experience \n•Certified in CPR, First Aid and climbing instruction \n•Trained in set up, maintenance and proper operation of Challenge Course and Mobile Climbing Wall equipment and supervision of climbers and participants Research Assistant Law Offices of Carpenter & Mayfield March 2013  –  March 2013  (1 month) San Jose, California •Visited different geographic and demographic areas of the city of San Jose to poll the public for research pertaining to an upcoming criminal trial case. \n•Compiled and presented data from the research survey results to the lead attorney. Research Assistant Law Offices of Carpenter & Mayfield March 2013  –  March 2013  (1 month) San Jose, California •Visited different geographic and demographic areas of the city of San Jose to poll the public for research pertaining to an upcoming criminal trial case. \n•Compiled and presented data from the research survey results to the lead attorney. Administrative Associate / Intern Senator Bill Emmerson September 2011  –  March 2012  (7 months) Riverside, California •Actively worked constituent cases through the process of receiving and evaluating the request, designation of appropriate agency jurisdiction, contact and monitoring of progress and final resolution  \n•Researched, developed and monitored a “Student of the Month” program at the Elementary, Junior High, and High School levels within the district \n•Prepared and presented certificates and letters of recognition honoring various citizen accomplishments \n•Represented the Senator at public events such as Town Hall and Chamber of Commerce meetings \n•Created and maintained outreach and contact lists for Senator’s constituents Administrative Associate / Intern Senator Bill Emmerson September 2011  –  March 2012  (7 months) Riverside, California •Actively worked constituent cases through the process of receiving and evaluating the request, designation of appropriate agency jurisdiction, contact and monitoring of progress and final resolution  \n•Researched, developed and monitored a “Student of the Month” program at the Elementary, Junior High, and High School levels within the district \n•Prepared and presented certificates and letters of recognition honoring various citizen accomplishments \n•Represented the Senator at public events such as Town Hall and Chamber of Commerce meetings \n•Created and maintained outreach and contact lists for Senator’s constituents Swimming Instructor Southwest YMCA April 2010  –  September 2010  (6 months) Saratoga, California •Created and implemented basic to advanced level swimming instruction programs for adults and children \n•Instructed and coached beginning to advanced swimmers  \n•Communicated daily progress and provided constructive feedback to students, parents, and Aquatics Director by way of Evaluation Forms and verbal feedback Swimming Instructor Southwest YMCA April 2010  –  September 2010  (6 months) Saratoga, California •Created and implemented basic to advanced level swimming instruction programs for adults and children \n•Instructed and coached beginning to advanced swimmers  \n•Communicated daily progress and provided constructive feedback to students, parents, and Aquatics Director by way of Evaluation Forms and verbal feedback Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills PowerPoint Public Speaking Community Outreach Teaching Editing Microsoft Word Program Management Leadership Development Event Planning Administrative... Microsoft Excel Team Building Volunteering Volunteer Recruiting Time Management Interpersonal Skills Presentations See 2+     See less Skills  PowerPoint Public Speaking Community Outreach Teaching Editing Microsoft Word Program Management Leadership Development Event Planning Administrative... Microsoft Excel Team Building Volunteering Volunteer Recruiting Time Management Interpersonal Skills Presentations See 2+     See less PowerPoint Public Speaking Community Outreach Teaching Editing Microsoft Word Program Management Leadership Development Event Planning Administrative... Microsoft Excel Team Building Volunteering Volunteer Recruiting Time Management Interpersonal Skills Presentations See 2+     See less PowerPoint Public Speaking Community Outreach Teaching Editing Microsoft Word Program Management Leadership Development Event Planning Administrative... Microsoft Excel Team Building Volunteering Volunteer Recruiting Time Management Interpersonal Skills Presentations See 2+     See less Education University of Denver Master’s Degree,  International Administration 2015  – 2017 University of California, Riverside Bachelor's Degree,  Political Science and Government 2010  – 2014 Activities and Societies:  Phi Gamma Delta Fraternity ,  UCR Student Honor Society Prospect High School High School,  College Preparation 2006  – 2010 Activities and Societies:  Varsity Swim Team ,  Varsity Wrestling Team ,  AVID Homework Tutor University of Denver Master’s Degree,  International Administration 2015  – 2017 University of Denver Master’s Degree,  International Administration 2015  – 2017 University of Denver Master’s Degree,  International Administration 2015  – 2017 University of California, Riverside Bachelor's Degree,  Political Science and Government 2010  – 2014 Activities and Societies:  Phi Gamma Delta Fraternity ,  UCR Student Honor Society University of California, Riverside Bachelor's Degree,  Political Science and Government 2010  – 2014 Activities and Societies:  Phi Gamma Delta Fraternity ,  UCR Student Honor Society University of California, Riverside Bachelor's Degree,  Political Science and Government 2010  – 2014 Activities and Societies:  Phi Gamma Delta Fraternity ,  UCR Student Honor Society Prospect High School High School,  College Preparation 2006  – 2010 Activities and Societies:  Varsity Swim Team ,  Varsity Wrestling Team ,  AVID Homework Tutor Prospect High School High School,  College Preparation 2006  – 2010 Activities and Societies:  Varsity Swim Team ,  Varsity Wrestling Team ,  AVID Homework Tutor Prospect High School High School,  College Preparation 2006  – 2010 Activities and Societies:  Varsity Swim Team ,  Varsity Wrestling Team ,  AVID Homework Tutor Honors & Awards Eagle Scout Boy Scouts of America January 2010 To earn the Eagle Scout rank, the highest advancement rank in Scouting, a Boy Scout must fulfill requirements in the areas of leadership, service, and outdoor skills. Although many options are available to demonstrate proficiency in these areas, a number of specific skills are required to advance through the ranks—Tenderfoot, Second Class, First Class, Star, Life, and Eagle. To advance, a Boy Scout must pass specific tests that are organized by requirements and merit badges. Master Councilor International Order of DeMolay September 2010 The Master Councilor is the head of the Chapter. He is elected by members of his Chapter and is usually among the older members of the group. He sits as chair for meetings, official representative of chapter to outside persons and organizations. Second Degree Black Belt Ernie Reyes West Coast World Martial Arts Association November 2005 Eagle Scout Boy Scouts of America January 2010 To earn the Eagle Scout rank, the highest advancement rank in Scouting, a Boy Scout must fulfill requirements in the areas of leadership, service, and outdoor skills. Although many options are available to demonstrate proficiency in these areas, a number of specific skills are required to advance through the ranks—Tenderfoot, Second Class, First Class, Star, Life, and Eagle. To advance, a Boy Scout must pass specific tests that are organized by requirements and merit badges. Eagle Scout Boy Scouts of America January 2010 To earn the Eagle Scout rank, the highest advancement rank in Scouting, a Boy Scout must fulfill requirements in the areas of leadership, service, and outdoor skills. Although many options are available to demonstrate proficiency in these areas, a number of specific skills are required to advance through the ranks—Tenderfoot, Second Class, First Class, Star, Life, and Eagle. To advance, a Boy Scout must pass specific tests that are organized by requirements and merit badges. Eagle Scout Boy Scouts of America January 2010 To earn the Eagle Scout rank, the highest advancement rank in Scouting, a Boy Scout must fulfill requirements in the areas of leadership, service, and outdoor skills. Although many options are available to demonstrate proficiency in these areas, a number of specific skills are required to advance through the ranks—Tenderfoot, Second Class, First Class, Star, Life, and Eagle. To advance, a Boy Scout must pass specific tests that are organized by requirements and merit badges. Master Councilor International Order of DeMolay September 2010 The Master Councilor is the head of the Chapter. He is elected by members of his Chapter and is usually among the older members of the group. He sits as chair for meetings, official representative of chapter to outside persons and organizations. Master Councilor International Order of DeMolay September 2010 The Master Councilor is the head of the Chapter. He is elected by members of his Chapter and is usually among the older members of the group. He sits as chair for meetings, official representative of chapter to outside persons and organizations. Master Councilor International Order of DeMolay September 2010 The Master Councilor is the head of the Chapter. He is elected by members of his Chapter and is usually among the older members of the group. He sits as chair for meetings, official representative of chapter to outside persons and organizations. Second Degree Black Belt Ernie Reyes West Coast World Martial Arts Association November 2005 Second Degree Black Belt Ernie Reyes West Coast World Martial Arts Association November 2005 Second Degree Black Belt Ernie Reyes West Coast World Martial Arts Association November 2005 ", "Summary •An administrative professional with over 15 years of experience. \n•Possesses over 10 years of event planning experience. \n•Self-motivated and dedicated to providing the highest quality of service.  \n•Works well independently and is also an excellent team player. \n•Attended vocational classes and seminars at San Jose City College. \n \nSpecialties: Operating Systems: Windows XP/Vista/7; Mac OS X Yosemite \n \nSoftware & Browsers: Microsoft Office (Word, Excel, Power Point); Open Office; Keynote; Internet Explorer; Google Chrome; Safari; Mozilla Firefox; Opera Browser; Adobe Acrobat; Adobe Photoshop; Microsoft Outlook; IDX; Chartscript; Surveymonkey, Qualtrics, Drupal \n \nStanford-Specific Systems: Reportmart1; Reportmart3; Sunflower; iProcurement; Expense reports; P-card iJournals \n \nLanguages: English (fluently) Summary •An administrative professional with over 15 years of experience. \n•Possesses over 10 years of event planning experience. \n•Self-motivated and dedicated to providing the highest quality of service.  \n•Works well independently and is also an excellent team player. \n•Attended vocational classes and seminars at San Jose City College. \n \nSpecialties: Operating Systems: Windows XP/Vista/7; Mac OS X Yosemite \n \nSoftware & Browsers: Microsoft Office (Word, Excel, Power Point); Open Office; Keynote; Internet Explorer; Google Chrome; Safari; Mozilla Firefox; Opera Browser; Adobe Acrobat; Adobe Photoshop; Microsoft Outlook; IDX; Chartscript; Surveymonkey, Qualtrics, Drupal \n \nStanford-Specific Systems: Reportmart1; Reportmart3; Sunflower; iProcurement; Expense reports; P-card iJournals \n \nLanguages: English (fluently) •An administrative professional with over 15 years of experience. \n•Possesses over 10 years of event planning experience. \n•Self-motivated and dedicated to providing the highest quality of service.  \n•Works well independently and is also an excellent team player. \n•Attended vocational classes and seminars at San Jose City College. \n \nSpecialties: Operating Systems: Windows XP/Vista/7; Mac OS X Yosemite \n \nSoftware & Browsers: Microsoft Office (Word, Excel, Power Point); Open Office; Keynote; Internet Explorer; Google Chrome; Safari; Mozilla Firefox; Opera Browser; Adobe Acrobat; Adobe Photoshop; Microsoft Outlook; IDX; Chartscript; Surveymonkey, Qualtrics, Drupal \n \nStanford-Specific Systems: Reportmart1; Reportmart3; Sunflower; iProcurement; Expense reports; P-card iJournals \n \nLanguages: English (fluently) •An administrative professional with over 15 years of experience. \n•Possesses over 10 years of event planning experience. \n•Self-motivated and dedicated to providing the highest quality of service.  \n•Works well independently and is also an excellent team player. \n•Attended vocational classes and seminars at San Jose City College. \n \nSpecialties: Operating Systems: Windows XP/Vista/7; Mac OS X Yosemite \n \nSoftware & Browsers: Microsoft Office (Word, Excel, Power Point); Open Office; Keynote; Internet Explorer; Google Chrome; Safari; Mozilla Firefox; Opera Browser; Adobe Acrobat; Adobe Photoshop; Microsoft Outlook; IDX; Chartscript; Surveymonkey, Qualtrics, Drupal \n \nStanford-Specific Systems: Reportmart1; Reportmart3; Sunflower; iProcurement; Expense reports; P-card iJournals \n \nLanguages: English (fluently) Experience Graduate Diversity Administrative Associate Stanford University September 2008  – Present (7 years) Stanford University Vice Provost of Graduate Education \n•Directly supports the Assistant Dean within Graduate and Undergraduate Studies \n•Coordinates the planning and administration for university-wide recruiting events, including arranging travel, accommodations, participant communication, and other logistics (e.g. Graduate Recruitment and Diversity Day and STANDOUT-Centers of Influence). \n•Organizes student applications, sends out and gathers invitations for the students accepted into the program. \n•Provide administrative support for university-wide graduate diversity planning meetings and other initiatives. \n•Collaborates regularly with Council members and others working on graduate diversity initiatives from across the university. \n•Manage orders, payments, reimbursements and travel card administration. Track budgets. \n•Maintain and update the Council website and mailing lists. Monitor group email accounts. Create and administer surveys. \n•Create well-organized, documented, and maintained files. Coordinate documentation and archiving for university-wide graduate diversity initiatives. \n•Coordinate the design and acquisition of university-wide recruitment materials. Black Community Services Center Administrative Associate Stanford University August 2006  – Present (9 years 1 month) Stanford University Black Community Services Center \n•Provides full administrative support to the Director and Assistant Director. \n•Manages all day-to-day logistics for the community center; greets all students, staff and alumni that have questions regarding any upcoming events. \n•Processes all staff personnel information. \n•Manages multiple calendars, and arranged travel for visiting speakers and alumni. \n•Creates and processes all financial transactions, as well as approves procurement card purchases. Administrative Associate Stanford Prevention Research Center October 2011  –  September 2013  (2 years) Stanford University •Support the research and teaching efforts of a Marcia L. Stefanick, Ph.D. investigating both older women’s and men’s health issues and biological sex differences. \n•Managing calendars, preparation and submission of research grant proposals, maintaining faculty profile and bio-sketch for publications and grant proposals, research data entry, and purchasing and processing reimbursements. \n•Taking and distributing minutes from monthly conference calls of investigators.  \n•Supports professor’s teaching commitments with preparation of class materials, tracking student papers and grading exams Land, Buildings and Real Estate Administrative Associate Stanford University May 2009  –  April 2010  (1 year) Land, Building and Real Estate \nAdministrative Associate \n•Supported the Director of Technology by managing his calendar, scheduling meetings with on and off-campus attendees, and coordinate meeting logistics and confirm arrangements. \n•Maintained files of vendor contracts and routine office communications. \n•Placed and tracked orders for computer equipment, software, and office supplies. \n•Coordinated travel arrangements. Developmental Biology Administrative Associate Stanford University November 2007  –  June 2008  (8 months) Developmental Biology  \nAdministrative Associate \n•Provided full administrative support to Principal Investigator David M. Kingsley, Ph.D, and his research lab. \n•Ordered all equipment, supplies and miscellaneous goods as well as generated purchase orders to pay invoices and reconciled expenditure statements verify accuracy of expenses. \n•Responsible for sorting the mail and distributed monthly checks to lab personnel. Administrative Associate Stanford University School of Medicine March 2005  –  February 2006  (1 year) Cardiothoracic Surgery \n•Provided a high-level executive support to the Chief of the Division of Thoracic Surgery within the Dept of Cardiothoracic Surgery and 3 faculty members. \n•Managed complex calendars, travel, scheduled meetings and professional obligations both within and outside the University. \n•Coordinated projects, screened phone calls, mail and email. \n•Effectively communicated with a large population of patients and physicians. \n•Respond and redirect inquiries to the appropriate staff as needed. \n•Maintained highly confidential information, patient charts, and core documents. Department Property Administrator Stanford University School of Medicine December 2002  –  March 2005  (2 years 4 months) Cardiothoracic Surgery \n•Department STAR & DPA, maintained report logs, general files and literature files. \n•Provided support to the receptionist as needed. \n•Coordinated meetings and calendar for the Director of Finance and Accounting. \n•Processed travel reimbursements and other administrative duties for 2 faculty members within the department. \n•Department liaison for building maintenance, office machines, and other miscellaneous duties. Receptionist Stanford University School of Medicine August 2000  –  December 2002  (2 years 5 months) Cardiothoracic Surgery \n•Provided customer service for the department, took messages, directed calls, and independently. answered questions when appropriate based on familiarity with organization and /or supervisors approval.  \n•Handled delivery logs from UPS, Fed Ex, Airborne Express, Corporate Express and Fisher Scientific. \n•Maintained department mailing list, directory, and calendars. Graduate Diversity Administrative Associate Stanford University September 2008  – Present (7 years) Stanford University Vice Provost of Graduate Education \n•Directly supports the Assistant Dean within Graduate and Undergraduate Studies \n•Coordinates the planning and administration for university-wide recruiting events, including arranging travel, accommodations, participant communication, and other logistics (e.g. Graduate Recruitment and Diversity Day and STANDOUT-Centers of Influence). \n•Organizes student applications, sends out and gathers invitations for the students accepted into the program. \n•Provide administrative support for university-wide graduate diversity planning meetings and other initiatives. \n•Collaborates regularly with Council members and others working on graduate diversity initiatives from across the university. \n•Manage orders, payments, reimbursements and travel card administration. Track budgets. \n•Maintain and update the Council website and mailing lists. Monitor group email accounts. Create and administer surveys. \n•Create well-organized, documented, and maintained files. Coordinate documentation and archiving for university-wide graduate diversity initiatives. \n•Coordinate the design and acquisition of university-wide recruitment materials. Graduate Diversity Administrative Associate Stanford University September 2008  – Present (7 years) Stanford University Vice Provost of Graduate Education \n•Directly supports the Assistant Dean within Graduate and Undergraduate Studies \n•Coordinates the planning and administration for university-wide recruiting events, including arranging travel, accommodations, participant communication, and other logistics (e.g. Graduate Recruitment and Diversity Day and STANDOUT-Centers of Influence). \n•Organizes student applications, sends out and gathers invitations for the students accepted into the program. \n•Provide administrative support for university-wide graduate diversity planning meetings and other initiatives. \n•Collaborates regularly with Council members and others working on graduate diversity initiatives from across the university. \n•Manage orders, payments, reimbursements and travel card administration. Track budgets. \n•Maintain and update the Council website and mailing lists. Monitor group email accounts. Create and administer surveys. \n•Create well-organized, documented, and maintained files. Coordinate documentation and archiving for university-wide graduate diversity initiatives. \n•Coordinate the design and acquisition of university-wide recruitment materials. Black Community Services Center Administrative Associate Stanford University August 2006  – Present (9 years 1 month) Stanford University Black Community Services Center \n•Provides full administrative support to the Director and Assistant Director. \n•Manages all day-to-day logistics for the community center; greets all students, staff and alumni that have questions regarding any upcoming events. \n•Processes all staff personnel information. \n•Manages multiple calendars, and arranged travel for visiting speakers and alumni. \n•Creates and processes all financial transactions, as well as approves procurement card purchases. Black Community Services Center Administrative Associate Stanford University August 2006  – Present (9 years 1 month) Stanford University Black Community Services Center \n•Provides full administrative support to the Director and Assistant Director. \n•Manages all day-to-day logistics for the community center; greets all students, staff and alumni that have questions regarding any upcoming events. \n•Processes all staff personnel information. \n•Manages multiple calendars, and arranged travel for visiting speakers and alumni. \n•Creates and processes all financial transactions, as well as approves procurement card purchases. Administrative Associate Stanford Prevention Research Center October 2011  –  September 2013  (2 years) Stanford University •Support the research and teaching efforts of a Marcia L. Stefanick, Ph.D. investigating both older women’s and men’s health issues and biological sex differences. \n•Managing calendars, preparation and submission of research grant proposals, maintaining faculty profile and bio-sketch for publications and grant proposals, research data entry, and purchasing and processing reimbursements. \n•Taking and distributing minutes from monthly conference calls of investigators.  \n•Supports professor’s teaching commitments with preparation of class materials, tracking student papers and grading exams Administrative Associate Stanford Prevention Research Center October 2011  –  September 2013  (2 years) Stanford University •Support the research and teaching efforts of a Marcia L. Stefanick, Ph.D. investigating both older women’s and men’s health issues and biological sex differences. \n•Managing calendars, preparation and submission of research grant proposals, maintaining faculty profile and bio-sketch for publications and grant proposals, research data entry, and purchasing and processing reimbursements. \n•Taking and distributing minutes from monthly conference calls of investigators.  \n•Supports professor’s teaching commitments with preparation of class materials, tracking student papers and grading exams Land, Buildings and Real Estate Administrative Associate Stanford University May 2009  –  April 2010  (1 year) Land, Building and Real Estate \nAdministrative Associate \n•Supported the Director of Technology by managing his calendar, scheduling meetings with on and off-campus attendees, and coordinate meeting logistics and confirm arrangements. \n•Maintained files of vendor contracts and routine office communications. \n•Placed and tracked orders for computer equipment, software, and office supplies. \n•Coordinated travel arrangements. Land, Buildings and Real Estate Administrative Associate Stanford University May 2009  –  April 2010  (1 year) Land, Building and Real Estate \nAdministrative Associate \n•Supported the Director of Technology by managing his calendar, scheduling meetings with on and off-campus attendees, and coordinate meeting logistics and confirm arrangements. \n•Maintained files of vendor contracts and routine office communications. \n•Placed and tracked orders for computer equipment, software, and office supplies. \n•Coordinated travel arrangements. Developmental Biology Administrative Associate Stanford University November 2007  –  June 2008  (8 months) Developmental Biology  \nAdministrative Associate \n•Provided full administrative support to Principal Investigator David M. Kingsley, Ph.D, and his research lab. \n•Ordered all equipment, supplies and miscellaneous goods as well as generated purchase orders to pay invoices and reconciled expenditure statements verify accuracy of expenses. \n•Responsible for sorting the mail and distributed monthly checks to lab personnel. Developmental Biology Administrative Associate Stanford University November 2007  –  June 2008  (8 months) Developmental Biology  \nAdministrative Associate \n•Provided full administrative support to Principal Investigator David M. Kingsley, Ph.D, and his research lab. \n•Ordered all equipment, supplies and miscellaneous goods as well as generated purchase orders to pay invoices and reconciled expenditure statements verify accuracy of expenses. \n•Responsible for sorting the mail and distributed monthly checks to lab personnel. Administrative Associate Stanford University School of Medicine March 2005  –  February 2006  (1 year) Cardiothoracic Surgery \n•Provided a high-level executive support to the Chief of the Division of Thoracic Surgery within the Dept of Cardiothoracic Surgery and 3 faculty members. \n•Managed complex calendars, travel, scheduled meetings and professional obligations both within and outside the University. \n•Coordinated projects, screened phone calls, mail and email. \n•Effectively communicated with a large population of patients and physicians. \n•Respond and redirect inquiries to the appropriate staff as needed. \n•Maintained highly confidential information, patient charts, and core documents. Administrative Associate Stanford University School of Medicine March 2005  –  February 2006  (1 year) Cardiothoracic Surgery \n•Provided a high-level executive support to the Chief of the Division of Thoracic Surgery within the Dept of Cardiothoracic Surgery and 3 faculty members. \n•Managed complex calendars, travel, scheduled meetings and professional obligations both within and outside the University. \n•Coordinated projects, screened phone calls, mail and email. \n•Effectively communicated with a large population of patients and physicians. \n•Respond and redirect inquiries to the appropriate staff as needed. \n•Maintained highly confidential information, patient charts, and core documents. Department Property Administrator Stanford University School of Medicine December 2002  –  March 2005  (2 years 4 months) Cardiothoracic Surgery \n•Department STAR & DPA, maintained report logs, general files and literature files. \n•Provided support to the receptionist as needed. \n•Coordinated meetings and calendar for the Director of Finance and Accounting. \n•Processed travel reimbursements and other administrative duties for 2 faculty members within the department. \n•Department liaison for building maintenance, office machines, and other miscellaneous duties. Department Property Administrator Stanford University School of Medicine December 2002  –  March 2005  (2 years 4 months) Cardiothoracic Surgery \n•Department STAR & DPA, maintained report logs, general files and literature files. \n•Provided support to the receptionist as needed. \n•Coordinated meetings and calendar for the Director of Finance and Accounting. \n•Processed travel reimbursements and other administrative duties for 2 faculty members within the department. \n•Department liaison for building maintenance, office machines, and other miscellaneous duties. Receptionist Stanford University School of Medicine August 2000  –  December 2002  (2 years 5 months) Cardiothoracic Surgery \n•Provided customer service for the department, took messages, directed calls, and independently. answered questions when appropriate based on familiarity with organization and /or supervisors approval.  \n•Handled delivery logs from UPS, Fed Ex, Airborne Express, Corporate Express and Fisher Scientific. \n•Maintained department mailing list, directory, and calendars. Receptionist Stanford University School of Medicine August 2000  –  December 2002  (2 years 5 months) Cardiothoracic Surgery \n•Provided customer service for the department, took messages, directed calls, and independently. answered questions when appropriate based on familiarity with organization and /or supervisors approval.  \n•Handled delivery logs from UPS, Fed Ex, Airborne Express, Corporate Express and Fisher Scientific. \n•Maintained department mailing list, directory, and calendars. Skills Microsoft Office Event Planning Microsoft Excel Outlook PowerPoint Microsoft Word Social Networking Event Management Data Entry Administrative... Human Resources Customer Service Recruiting Management Research Skills  Microsoft Office Event Planning Microsoft Excel Outlook PowerPoint Microsoft Word Social Networking Event Management Data Entry Administrative... Human Resources Customer Service Recruiting Management Research Microsoft Office Event Planning Microsoft Excel Outlook PowerPoint Microsoft Word Social Networking Event Management Data Entry Administrative... Human Resources Customer Service Recruiting Management Research Microsoft Office Event Planning Microsoft Excel Outlook PowerPoint Microsoft Word Social Networking Event Management Data Entry Administrative... Human Resources Customer Service Recruiting Management Research Education San Jose City College General 2005  – 2009 Willow Glen High School High School Diploma,  General 1997  – 2000 San Jose City College General 2005  – 2009 San Jose City College General 2005  – 2009 San Jose City College General 2005  – 2009 Willow Glen High School High School Diploma,  General 1997  – 2000 Willow Glen High School High School Diploma,  General 1997  – 2000 Willow Glen High School High School Diploma,  General 1997  – 2000 ", "Summary I grew up in Los Angeles but moved to San Francisco three years ago. As far as my educational background, I am a MBA graduate of California Lutheran University and hold Bachelors degrees in the Social Sciences and Music from Mount Saint Mary's College. Most recently, I was an Administrative Assistant for the IBM Corporation, and I currently volunteer as a grant writer for nonprofits in need of assistance. I am now an Administrative Associate for Stanford University. From 2011 to 2012, I worked as a contracts analyst and business opportunity specialist for the federal government. I have extensive experience in web design, editing documents, scheduling, grant writing, tax preparation, contract analysis, event planning, working with nonprofits, and many types of computer software. Summary I grew up in Los Angeles but moved to San Francisco three years ago. As far as my educational background, I am a MBA graduate of California Lutheran University and hold Bachelors degrees in the Social Sciences and Music from Mount Saint Mary's College. Most recently, I was an Administrative Assistant for the IBM Corporation, and I currently volunteer as a grant writer for nonprofits in need of assistance. I am now an Administrative Associate for Stanford University. From 2011 to 2012, I worked as a contracts analyst and business opportunity specialist for the federal government. I have extensive experience in web design, editing documents, scheduling, grant writing, tax preparation, contract analysis, event planning, working with nonprofits, and many types of computer software. I grew up in Los Angeles but moved to San Francisco three years ago. As far as my educational background, I am a MBA graduate of California Lutheran University and hold Bachelors degrees in the Social Sciences and Music from Mount Saint Mary's College. Most recently, I was an Administrative Assistant for the IBM Corporation, and I currently volunteer as a grant writer for nonprofits in need of assistance. I am now an Administrative Associate for Stanford University. From 2011 to 2012, I worked as a contracts analyst and business opportunity specialist for the federal government. I have extensive experience in web design, editing documents, scheduling, grant writing, tax preparation, contract analysis, event planning, working with nonprofits, and many types of computer software. I grew up in Los Angeles but moved to San Francisco three years ago. As far as my educational background, I am a MBA graduate of California Lutheran University and hold Bachelors degrees in the Social Sciences and Music from Mount Saint Mary's College. Most recently, I was an Administrative Assistant for the IBM Corporation, and I currently volunteer as a grant writer for nonprofits in need of assistance. I am now an Administrative Associate for Stanford University. From 2011 to 2012, I worked as a contracts analyst and business opportunity specialist for the federal government. I have extensive experience in web design, editing documents, scheduling, grant writing, tax preparation, contract analysis, event planning, working with nonprofits, and many types of computer software. Experience Administrative Associate Stanford University March 2015  – Present (6 months) Redwood City, California Provide administrative support to eleven Stanford faculty, including assisting with grant writing and proposal editing, large-scale photocopy jobs, formatting of articles for presentation to scientific journals, web design and editing of Stanford online faculty profiles, processing of reimbursement requests, and other duties as required \nBook domestic and foreign travel for Stanford faculty \nProcess pcard transactions as required and send supporting documentation to appropriate departments; maintain records of expenses charged to each faculty account \nAnswer main phone line for faculty offices \nSort all incoming and outgoing mail \nSort all incoming faxes and ensure distribution to the proper personnel, including maintaining HIPAA compliance in electronic transmissions \nPurchase office supplies using the iProcurement system and ensure that the correct PTAE is used and correct department is charged \nResponsible for making sure all faculty, residents, and fellows are in compliance legally with California’s CURES system, including handling notarizations for the CURES system on a daily basis and tracking compliance with new state legislation \nResponsible for developing a space management plan to facilitate the onboarding of fourteen medical students and high schoolers for the summer \nMake sure all faculty supported are up to date with Stanford’s requirements for human research protocol and fill out the necessary paperwork to remedy noncompliance \nTasked with onboarding multiple high schoolers for the summer, including handling the setup of payroll, security attestations, training, and providing ongoing mentorship during their time in the department \nActive notary for the department; handle any paperwork requiring notarization and review paperwork to make sure it is in compliance with Stanford’s set financial protocol \nEvent planning as required, including for a large-scale retreat in Fall 2015 \n Contractor Option 1 Staffing Services, Inc. October 2014  –  March 2015  (6 months) Redwood City, CA I was a temporary Administrative Associate at Stanford University. Contractor ManpowerGroup November 2012  –  October 2014  (2 years) San Francisco, California Assigned by agency to Right Management Consultants to cover receptionist duties \nWorked at Hotwire corporate office as an assistant to the Facilities Manager \nMost recently on a full-time contract with the IBM Corporation Administrative Assistant IBM January 2013  –  May 2014  (1 year 5 months) San Francisco, California I was most recently an Administrative Assistant at the IBM Corporation. I handled scheduling, meetings, and personal files maintained on-site, as well as duties for the Real Estate Site Operations Unit. I specialized in reconciling freight and utility statements, shipping, programming for the company's internal website, database creation and maintenance, and customer service. I was the person IBM personnel speak to when they needed to facilitate a meeting in San Francisco and have questions and answered all incoming calls for the site. Consultant and Social Media Designer Nationwide Career Events December 2011  –  September 2012  (10 months) Los Angeles, California Acted as resume consultant for all job seekers attending career fair \nLiaison to vendors \nCreated and maintained company website, Facebook, and Twitter pages Business Opportunity Specialist United States Small Business Administration August 2011  –  February 2012  (7 months) San Francisco, California Assisted senior staff in the 8(a) Department of Program Certification and Eligibility \nContacted constituents via phone and e-mail regarding certifying economically and socially disadvantaged small business owners to be eligible for the awarding of government contracts \nHandled office mailing duties \nScreened cases and developed initial case analysis documents \nAnswered all office phones Database Creator and Library Manager S.G. Flute, Inc. October 2006  –  June 2011  (4 years 9 months) Pacific Palisades, California Created and maintained 4,000 piece CD database and storage system \nDesigned extensive sheet music filing system including groupings by category, artist, etc. \nDeveloped filing system for Chamber Music Palisades grants and paperwork Arts Management/PR and Technical Specialist San Fernando Valley Symphony Orchestra May 2000  –  June 2011  (11 years 2 months) Woodland Hills, California Completed twelve grant proposals for awards ranging from $500 to $5000 \nFacilitated all artist (soloist) relations with orchestra, including artist (personal) needs \nProvided digital photography for all performances \nCreated and maintained orchestra website \nFormatted all soloist biographies for both the website and distribution at performances \nHandled media relations, including distribution of press releases to local newspapers and television stations \nDeveloped public relations with symphony patrons \nStage management for each performance Consultant Art and Soul Studios June 2010  –  August 2010  (3 months) Ventura, California Created new marketing plan \nAdvised on condition of legal documents \nDrafted financial report based on tax statements Grant Writer Chamber Music Palisades May 2007  –  May 2008  (1 year 1 month) Pacific Palisades, California Completed three grant proposals at the county and venture capital levels Administrative Intern Office of Councilman Dennis P. Zine April 2001  –  April 2002  (1 year 1 month) Reseda, California Assisted deputies in office \nContacted constituents via phone and e-mail \nDrafted requests for assistance to city departments Administrative Associate Stanford University March 2015  – Present (6 months) Redwood City, California Provide administrative support to eleven Stanford faculty, including assisting with grant writing and proposal editing, large-scale photocopy jobs, formatting of articles for presentation to scientific journals, web design and editing of Stanford online faculty profiles, processing of reimbursement requests, and other duties as required \nBook domestic and foreign travel for Stanford faculty \nProcess pcard transactions as required and send supporting documentation to appropriate departments; maintain records of expenses charged to each faculty account \nAnswer main phone line for faculty offices \nSort all incoming and outgoing mail \nSort all incoming faxes and ensure distribution to the proper personnel, including maintaining HIPAA compliance in electronic transmissions \nPurchase office supplies using the iProcurement system and ensure that the correct PTAE is used and correct department is charged \nResponsible for making sure all faculty, residents, and fellows are in compliance legally with California’s CURES system, including handling notarizations for the CURES system on a daily basis and tracking compliance with new state legislation \nResponsible for developing a space management plan to facilitate the onboarding of fourteen medical students and high schoolers for the summer \nMake sure all faculty supported are up to date with Stanford’s requirements for human research protocol and fill out the necessary paperwork to remedy noncompliance \nTasked with onboarding multiple high schoolers for the summer, including handling the setup of payroll, security attestations, training, and providing ongoing mentorship during their time in the department \nActive notary for the department; handle any paperwork requiring notarization and review paperwork to make sure it is in compliance with Stanford’s set financial protocol \nEvent planning as required, including for a large-scale retreat in Fall 2015 \n Administrative Associate Stanford University March 2015  – Present (6 months) Redwood City, California Provide administrative support to eleven Stanford faculty, including assisting with grant writing and proposal editing, large-scale photocopy jobs, formatting of articles for presentation to scientific journals, web design and editing of Stanford online faculty profiles, processing of reimbursement requests, and other duties as required \nBook domestic and foreign travel for Stanford faculty \nProcess pcard transactions as required and send supporting documentation to appropriate departments; maintain records of expenses charged to each faculty account \nAnswer main phone line for faculty offices \nSort all incoming and outgoing mail \nSort all incoming faxes and ensure distribution to the proper personnel, including maintaining HIPAA compliance in electronic transmissions \nPurchase office supplies using the iProcurement system and ensure that the correct PTAE is used and correct department is charged \nResponsible for making sure all faculty, residents, and fellows are in compliance legally with California’s CURES system, including handling notarizations for the CURES system on a daily basis and tracking compliance with new state legislation \nResponsible for developing a space management plan to facilitate the onboarding of fourteen medical students and high schoolers for the summer \nMake sure all faculty supported are up to date with Stanford’s requirements for human research protocol and fill out the necessary paperwork to remedy noncompliance \nTasked with onboarding multiple high schoolers for the summer, including handling the setup of payroll, security attestations, training, and providing ongoing mentorship during their time in the department \nActive notary for the department; handle any paperwork requiring notarization and review paperwork to make sure it is in compliance with Stanford’s set financial protocol \nEvent planning as required, including for a large-scale retreat in Fall 2015 \n Contractor Option 1 Staffing Services, Inc. October 2014  –  March 2015  (6 months) Redwood City, CA I was a temporary Administrative Associate at Stanford University. Contractor Option 1 Staffing Services, Inc. October 2014  –  March 2015  (6 months) Redwood City, CA I was a temporary Administrative Associate at Stanford University. Contractor ManpowerGroup November 2012  –  October 2014  (2 years) San Francisco, California Assigned by agency to Right Management Consultants to cover receptionist duties \nWorked at Hotwire corporate office as an assistant to the Facilities Manager \nMost recently on a full-time contract with the IBM Corporation Contractor ManpowerGroup November 2012  –  October 2014  (2 years) San Francisco, California Assigned by agency to Right Management Consultants to cover receptionist duties \nWorked at Hotwire corporate office as an assistant to the Facilities Manager \nMost recently on a full-time contract with the IBM Corporation Administrative Assistant IBM January 2013  –  May 2014  (1 year 5 months) San Francisco, California I was most recently an Administrative Assistant at the IBM Corporation. I handled scheduling, meetings, and personal files maintained on-site, as well as duties for the Real Estate Site Operations Unit. I specialized in reconciling freight and utility statements, shipping, programming for the company's internal website, database creation and maintenance, and customer service. I was the person IBM personnel speak to when they needed to facilitate a meeting in San Francisco and have questions and answered all incoming calls for the site. Administrative Assistant IBM January 2013  –  May 2014  (1 year 5 months) San Francisco, California I was most recently an Administrative Assistant at the IBM Corporation. I handled scheduling, meetings, and personal files maintained on-site, as well as duties for the Real Estate Site Operations Unit. I specialized in reconciling freight and utility statements, shipping, programming for the company's internal website, database creation and maintenance, and customer service. I was the person IBM personnel speak to when they needed to facilitate a meeting in San Francisco and have questions and answered all incoming calls for the site. Consultant and Social Media Designer Nationwide Career Events December 2011  –  September 2012  (10 months) Los Angeles, California Acted as resume consultant for all job seekers attending career fair \nLiaison to vendors \nCreated and maintained company website, Facebook, and Twitter pages Consultant and Social Media Designer Nationwide Career Events December 2011  –  September 2012  (10 months) Los Angeles, California Acted as resume consultant for all job seekers attending career fair \nLiaison to vendors \nCreated and maintained company website, Facebook, and Twitter pages Business Opportunity Specialist United States Small Business Administration August 2011  –  February 2012  (7 months) San Francisco, California Assisted senior staff in the 8(a) Department of Program Certification and Eligibility \nContacted constituents via phone and e-mail regarding certifying economically and socially disadvantaged small business owners to be eligible for the awarding of government contracts \nHandled office mailing duties \nScreened cases and developed initial case analysis documents \nAnswered all office phones Business Opportunity Specialist United States Small Business Administration August 2011  –  February 2012  (7 months) San Francisco, California Assisted senior staff in the 8(a) Department of Program Certification and Eligibility \nContacted constituents via phone and e-mail regarding certifying economically and socially disadvantaged small business owners to be eligible for the awarding of government contracts \nHandled office mailing duties \nScreened cases and developed initial case analysis documents \nAnswered all office phones Database Creator and Library Manager S.G. Flute, Inc. October 2006  –  June 2011  (4 years 9 months) Pacific Palisades, California Created and maintained 4,000 piece CD database and storage system \nDesigned extensive sheet music filing system including groupings by category, artist, etc. \nDeveloped filing system for Chamber Music Palisades grants and paperwork Database Creator and Library Manager S.G. Flute, Inc. October 2006  –  June 2011  (4 years 9 months) Pacific Palisades, California Created and maintained 4,000 piece CD database and storage system \nDesigned extensive sheet music filing system including groupings by category, artist, etc. \nDeveloped filing system for Chamber Music Palisades grants and paperwork Arts Management/PR and Technical Specialist San Fernando Valley Symphony Orchestra May 2000  –  June 2011  (11 years 2 months) Woodland Hills, California Completed twelve grant proposals for awards ranging from $500 to $5000 \nFacilitated all artist (soloist) relations with orchestra, including artist (personal) needs \nProvided digital photography for all performances \nCreated and maintained orchestra website \nFormatted all soloist biographies for both the website and distribution at performances \nHandled media relations, including distribution of press releases to local newspapers and television stations \nDeveloped public relations with symphony patrons \nStage management for each performance Arts Management/PR and Technical Specialist San Fernando Valley Symphony Orchestra May 2000  –  June 2011  (11 years 2 months) Woodland Hills, California Completed twelve grant proposals for awards ranging from $500 to $5000 \nFacilitated all artist (soloist) relations with orchestra, including artist (personal) needs \nProvided digital photography for all performances \nCreated and maintained orchestra website \nFormatted all soloist biographies for both the website and distribution at performances \nHandled media relations, including distribution of press releases to local newspapers and television stations \nDeveloped public relations with symphony patrons \nStage management for each performance Consultant Art and Soul Studios June 2010  –  August 2010  (3 months) Ventura, California Created new marketing plan \nAdvised on condition of legal documents \nDrafted financial report based on tax statements Consultant Art and Soul Studios June 2010  –  August 2010  (3 months) Ventura, California Created new marketing plan \nAdvised on condition of legal documents \nDrafted financial report based on tax statements Grant Writer Chamber Music Palisades May 2007  –  May 2008  (1 year 1 month) Pacific Palisades, California Completed three grant proposals at the county and venture capital levels Grant Writer Chamber Music Palisades May 2007  –  May 2008  (1 year 1 month) Pacific Palisades, California Completed three grant proposals at the county and venture capital levels Administrative Intern Office of Councilman Dennis P. Zine April 2001  –  April 2002  (1 year 1 month) Reseda, California Assisted deputies in office \nContacted constituents via phone and e-mail \nDrafted requests for assistance to city departments Administrative Intern Office of Councilman Dennis P. Zine April 2001  –  April 2002  (1 year 1 month) Reseda, California Assisted deputies in office \nContacted constituents via phone and e-mail \nDrafted requests for assistance to city departments Skills Receptionist Duties Account Reconciliation Shipping Grant Writing Contract Management Management Consulting Financial Analysis Organizational... Public Relations Web Design Archiving Marketing Communications Customer Service... Press Releases Customer Service Marketing Strategy Social Media Social Media Marketing Social Networking Corporate Social... Government Event Planning See 7+     See less Skills  Receptionist Duties Account Reconciliation Shipping Grant Writing Contract Management Management Consulting Financial Analysis Organizational... Public Relations Web Design Archiving Marketing Communications Customer Service... Press Releases Customer Service Marketing Strategy Social Media Social Media Marketing Social Networking Corporate Social... Government Event Planning See 7+     See less Receptionist Duties Account Reconciliation Shipping Grant Writing Contract Management Management Consulting Financial Analysis Organizational... Public Relations Web Design Archiving Marketing Communications Customer Service... Press Releases Customer Service Marketing Strategy Social Media Social Media Marketing Social Networking Corporate Social... Government Event Planning See 7+     See less Receptionist Duties Account Reconciliation Shipping Grant Writing Contract Management Management Consulting Financial Analysis Organizational... Public Relations Web Design Archiving Marketing Communications Customer Service... Press Releases Customer Service Marketing Strategy Social Media Social Media Marketing Social Networking Corporate Social... Government Event Planning See 7+     See less Education California Lutheran University MBA,  Management and Organizational Behavior 2007  – 2011 Mount Saint Mary's College California BA,  Social Sciences 2003  – 2007 Mount Saint Mary's College California Bachelor of Arts (B.A.),  Music Performance , General 2003  – 2007 California Lutheran University MBA,  Management and Organizational Behavior 2007  – 2011 California Lutheran University MBA,  Management and Organizational Behavior 2007  – 2011 California Lutheran University MBA,  Management and Organizational Behavior 2007  – 2011 Mount Saint Mary's College California BA,  Social Sciences 2003  – 2007 Mount Saint Mary's College California BA,  Social Sciences 2003  – 2007 Mount Saint Mary's College California BA,  Social Sciences 2003  – 2007 Mount Saint Mary's College California Bachelor of Arts (B.A.),  Music Performance , General 2003  – 2007 Mount Saint Mary's College California Bachelor of Arts (B.A.),  Music Performance , General 2003  – 2007 Mount Saint Mary's College California Bachelor of Arts (B.A.),  Music Performance , General 2003  – 2007 ", "Experience Site Represenative-Mail Canon Business Solutions March 2011  – Present (4 years 6 months) Administrative Associate Stanford University January 2010  –  April 2010  (4 months) Chemical Engineering Administrative Associate Stanford University October 2008  –  June 2009  (9 months) Chemical Engineering Administrative Associate Stanford University October 2000  –  April 2008  (7 years 7 months) Registrar's Office Mail Deliverer Stanford University September 1999  –  October 2000  (1 year 2 months) ID Mail Site Represenative-Mail Canon Business Solutions March 2011  – Present (4 years 6 months) Site Represenative-Mail Canon Business Solutions March 2011  – Present (4 years 6 months) Administrative Associate Stanford University January 2010  –  April 2010  (4 months) Chemical Engineering Administrative Associate Stanford University January 2010  –  April 2010  (4 months) Chemical Engineering Administrative Associate Stanford University October 2008  –  June 2009  (9 months) Chemical Engineering Administrative Associate Stanford University October 2008  –  June 2009  (9 months) Chemical Engineering Administrative Associate Stanford University October 2000  –  April 2008  (7 years 7 months) Registrar's Office Administrative Associate Stanford University October 2000  –  April 2008  (7 years 7 months) Registrar's Office Mail Deliverer Stanford University September 1999  –  October 2000  (1 year 2 months) ID Mail Mail Deliverer Stanford University September 1999  –  October 2000  (1 year 2 months) ID Mail Skills Event Planning Customer Service Non-profits Administration Microsoft Office Microsoft Office 2007 Skills  Event Planning Customer Service Non-profits Administration Microsoft Office Microsoft Office 2007 Event Planning Customer Service Non-profits Administration Microsoft Office Microsoft Office 2007 Event Planning Customer Service Non-profits Administration Microsoft Office Microsoft Office 2007 Education Menlo College B.A,  Business Management 2003  – 2005 Menlo College B.A,  Business Management 2003  – 2005 Menlo College B.A,  Business Management 2003  – 2005 Menlo College B.A,  Business Management 2003  – 2005 ", "Languages English Full professional proficiency Chinese Native or bilingual proficiency Japanese Limited working proficiency French Limited working proficiency English Full professional proficiency Chinese Native or bilingual proficiency Japanese Limited working proficiency French Limited working proficiency English Full professional proficiency Chinese Native or bilingual proficiency Japanese Limited working proficiency French Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Product Management Cross-functional Team... Direct Marketing Team Management Problem Solving Product Marketing Market Analysis Market Research Management Account Management Selling New Business Development B2B Sales Management CRM Customer Service Direct Sales Health Seminars Business Coaching Competitive Analysis Pricing Start-ups Product Development Channel Partners Solution Selling Strategic Partnerships Salesforce.com Sales Operations Go-to-market Strategy Product Launch Sales Process SaaS Enterprise Software Business Development Lead Generation Mobile Devices Business Alliances Sales See 23+     See less Skills  Product Management Cross-functional Team... Direct Marketing Team Management Problem Solving Product Marketing Market Analysis Market Research Management Account Management Selling New Business Development B2B Sales Management CRM Customer Service Direct Sales Health Seminars Business Coaching Competitive Analysis Pricing Start-ups Product Development Channel Partners Solution Selling Strategic Partnerships Salesforce.com Sales Operations Go-to-market Strategy Product Launch Sales Process SaaS Enterprise Software Business Development Lead Generation Mobile Devices Business Alliances Sales See 23+     See less Product Management Cross-functional Team... Direct Marketing Team Management Problem Solving Product Marketing Market Analysis Market Research Management Account Management Selling New Business Development B2B Sales Management CRM Customer Service Direct Sales Health Seminars Business Coaching Competitive Analysis Pricing Start-ups Product Development Channel Partners Solution Selling Strategic Partnerships Salesforce.com Sales Operations Go-to-market Strategy Product Launch Sales Process SaaS Enterprise Software Business Development Lead Generation Mobile Devices Business Alliances Sales See 23+     See less Product Management Cross-functional Team... Direct Marketing Team Management Problem Solving Product Marketing Market Analysis Market Research Management Account Management Selling New Business Development B2B Sales Management CRM Customer Service Direct Sales Health Seminars Business Coaching Competitive Analysis Pricing Start-ups Product Development Channel Partners Solution Selling Strategic Partnerships Salesforce.com Sales Operations Go-to-market Strategy Product Launch Sales Process SaaS Enterprise Software Business Development Lead Generation Mobile Devices Business Alliances Sales See 23+     See less ", "Summary Summary: Professional Administrative Associate with extensive experience. Strong problem-solving skills, customer service oriented, excellent oral and written communication skills. Well versed in Stanford University policies. Highly organized, detail oriented, with event planning background, supervisory skills, and the ability to interact effectively at all levels with patience and professionalism. Specialties:accounting systems, pagemaker, dreamweaver, e-commerce, editing, email, event management, filemaker pro, finance, human resources, illustrator, indesign, internet explorer, leadership, macintosh, marketing, materials management, meeting facilitation, microsoft excel, microsoft office, microsoft word, oracle financials, payroll processing, peoplesoft, printers, procurement, promotional materials, research, telephone skills, troubleshooting, website production, Summary Summary: Professional Administrative Associate with extensive experience. Strong problem-solving skills, customer service oriented, excellent oral and written communication skills. Well versed in Stanford University policies. Highly organized, detail oriented, with event planning background, supervisory skills, and the ability to interact effectively at all levels with patience and professionalism. Specialties:accounting systems, pagemaker, dreamweaver, e-commerce, editing, email, event management, filemaker pro, finance, human resources, illustrator, indesign, internet explorer, leadership, macintosh, marketing, materials management, meeting facilitation, microsoft excel, microsoft office, microsoft word, oracle financials, payroll processing, peoplesoft, printers, procurement, promotional materials, research, telephone skills, troubleshooting, website production, Summary: Professional Administrative Associate with extensive experience. Strong problem-solving skills, customer service oriented, excellent oral and written communication skills. Well versed in Stanford University policies. Highly organized, detail oriented, with event planning background, supervisory skills, and the ability to interact effectively at all levels with patience and professionalism. Specialties:accounting systems, pagemaker, dreamweaver, e-commerce, editing, email, event management, filemaker pro, finance, human resources, illustrator, indesign, internet explorer, leadership, macintosh, marketing, materials management, meeting facilitation, microsoft excel, microsoft office, microsoft word, oracle financials, payroll processing, peoplesoft, printers, procurement, promotional materials, research, telephone skills, troubleshooting, website production, Summary: Professional Administrative Associate with extensive experience. Strong problem-solving skills, customer service oriented, excellent oral and written communication skills. Well versed in Stanford University policies. Highly organized, detail oriented, with event planning background, supervisory skills, and the ability to interact effectively at all levels with patience and professionalism. Specialties:accounting systems, pagemaker, dreamweaver, e-commerce, editing, email, event management, filemaker pro, finance, human resources, illustrator, indesign, internet explorer, leadership, macintosh, marketing, materials management, meeting facilitation, microsoft excel, microsoft office, microsoft word, oracle financials, payroll processing, peoplesoft, printers, procurement, promotional materials, research, telephone skills, troubleshooting, website production, Experience Administrative Associate Stanford University June 2011  – Present (4 years 3 months) Earth Systems Program - School of Earth Sciences - Act as P-card and T-card custodian \n- Reconcile and verify all p-card and t-card transactions \n- Process all program purchase orders, IOU’s and travel expenses and reimbursements \n- Program STAR \n- Coordinate and organize all program events, meetings and gatherings \n- Order, maintain and put away all program supplies \n- Maintain program blanket maintenance orders/and subscriptions \n- Maintain all program equipment (computers, copier, printer and fax machine) \n- Process work orders \n- Maintain program roster/calendar \n- Make travel arrangements \n- Keep equipment/supply inventory up to date \n- Assist the Associate Director with space needs \n- Provide administrative support to the program staff and faculty \n- Assist Associate Director with special projects \n- Maintain and update Administrative Guide as needed \n- Assist with all program mailings \n- Coordinate recycling for the program office Academic Services Specialist Stanford University October 2010  –  June 2011  (9 months) Electrical Engineering at Stanford University - Faculty Affairs \n- Research/Collect professional & educational information \n- Event Coordinator \n- Scheduled meetings and appointments \n- Travel Arrangements \n- Student Services \n- Course Scheduling \n- Bulletin \n- Review Sessions \n- Room Assignments \n- Lecturer Appointments \n- Summer Session Program Coordinator (Administrative Associate) Stanford University Stanford Publishing Courses April 2001  –  December 2009  (8 years 9 months) Manage event coordination and planning for four large professional publishing courses per year with annual revenues of $250K. \nCollaborate with Director to develop a marketing plan for each program and work with designer/printer/mail house to produce and mail promotional materials. \nOversee online applications, registrations and payment for  \n500 participants (both U.S. and International). \nResearch, edit and create course materials (binders & confirmation \npackets) for participants and faculty. \nServe as main liaison for vendors, both on and off campus (ie. Stanford Catering, Summer Conference Office, Event & Labor Services etc.) \nOversee all financials and their fulfillment using Stanford accounting \nsystems; process credit card and all other payments via Oracle Financials. \nCoordinate travel and accommodations for speakers and participants. \nManage all phone inquiries regarding course details; market course via phone and Web content contributions. \nCompare department financial records with SU financial reports. \nSupervise 10 summer staff to ensure effective and timely coordination of program. \nMaintain and update department website. \nResponsible for setting up new hires; payroll, sunetid, building access, email sponsorship etc. \nResponsible for all on-site trouble shooting during meetings – both on and off campus. \nMaintain Alumni Directory listing from past participants. Systems Administrator Stanford University March 1997  –  April 2001  (4 years 2 months) Managed payroll, petty cash, human resources requirements, paid bills \nvia SNAP, and organized employee team-building activities to motivate  \n7X24 staff. \nWorked with outside and Stanford vendors (ie. Event Services etc.) \nManaged department move due to renovation. \nAssisted with critical code calls from Stanford Hospital. Telecommunications Attendant III (Lead Operator) Stanford University June 1994  –  March 1997  (2 years 10 months) In addition to operator responsibilities, I responded to and managed customer complains and supervised 15 operators. Telecommunications Attendant I & II Stanford University December 1989  –  June 1994  (4 years 7 months) Answered multiple calls on a console (40,000 calls a month) from within Stanford and around the world. \nHandled diverse queries: directions, phone numbers, event information, and managed after-hours calls for Facility Operations. Administrative Associate Stanford University June 2011  – Present (4 years 3 months) Earth Systems Program - School of Earth Sciences - Act as P-card and T-card custodian \n- Reconcile and verify all p-card and t-card transactions \n- Process all program purchase orders, IOU’s and travel expenses and reimbursements \n- Program STAR \n- Coordinate and organize all program events, meetings and gatherings \n- Order, maintain and put away all program supplies \n- Maintain program blanket maintenance orders/and subscriptions \n- Maintain all program equipment (computers, copier, printer and fax machine) \n- Process work orders \n- Maintain program roster/calendar \n- Make travel arrangements \n- Keep equipment/supply inventory up to date \n- Assist the Associate Director with space needs \n- Provide administrative support to the program staff and faculty \n- Assist Associate Director with special projects \n- Maintain and update Administrative Guide as needed \n- Assist with all program mailings \n- Coordinate recycling for the program office Administrative Associate Stanford University June 2011  – Present (4 years 3 months) Earth Systems Program - School of Earth Sciences - Act as P-card and T-card custodian \n- Reconcile and verify all p-card and t-card transactions \n- Process all program purchase orders, IOU’s and travel expenses and reimbursements \n- Program STAR \n- Coordinate and organize all program events, meetings and gatherings \n- Order, maintain and put away all program supplies \n- Maintain program blanket maintenance orders/and subscriptions \n- Maintain all program equipment (computers, copier, printer and fax machine) \n- Process work orders \n- Maintain program roster/calendar \n- Make travel arrangements \n- Keep equipment/supply inventory up to date \n- Assist the Associate Director with space needs \n- Provide administrative support to the program staff and faculty \n- Assist Associate Director with special projects \n- Maintain and update Administrative Guide as needed \n- Assist with all program mailings \n- Coordinate recycling for the program office Academic Services Specialist Stanford University October 2010  –  June 2011  (9 months) Electrical Engineering at Stanford University - Faculty Affairs \n- Research/Collect professional & educational information \n- Event Coordinator \n- Scheduled meetings and appointments \n- Travel Arrangements \n- Student Services \n- Course Scheduling \n- Bulletin \n- Review Sessions \n- Room Assignments \n- Lecturer Appointments \n- Summer Session Academic Services Specialist Stanford University October 2010  –  June 2011  (9 months) Electrical Engineering at Stanford University - Faculty Affairs \n- Research/Collect professional & educational information \n- Event Coordinator \n- Scheduled meetings and appointments \n- Travel Arrangements \n- Student Services \n- Course Scheduling \n- Bulletin \n- Review Sessions \n- Room Assignments \n- Lecturer Appointments \n- Summer Session Program Coordinator (Administrative Associate) Stanford University Stanford Publishing Courses April 2001  –  December 2009  (8 years 9 months) Manage event coordination and planning for four large professional publishing courses per year with annual revenues of $250K. \nCollaborate with Director to develop a marketing plan for each program and work with designer/printer/mail house to produce and mail promotional materials. \nOversee online applications, registrations and payment for  \n500 participants (both U.S. and International). \nResearch, edit and create course materials (binders & confirmation \npackets) for participants and faculty. \nServe as main liaison for vendors, both on and off campus (ie. Stanford Catering, Summer Conference Office, Event & Labor Services etc.) \nOversee all financials and their fulfillment using Stanford accounting \nsystems; process credit card and all other payments via Oracle Financials. \nCoordinate travel and accommodations for speakers and participants. \nManage all phone inquiries regarding course details; market course via phone and Web content contributions. \nCompare department financial records with SU financial reports. \nSupervise 10 summer staff to ensure effective and timely coordination of program. \nMaintain and update department website. \nResponsible for setting up new hires; payroll, sunetid, building access, email sponsorship etc. \nResponsible for all on-site trouble shooting during meetings – both on and off campus. \nMaintain Alumni Directory listing from past participants. Program Coordinator (Administrative Associate) Stanford University Stanford Publishing Courses April 2001  –  December 2009  (8 years 9 months) Manage event coordination and planning for four large professional publishing courses per year with annual revenues of $250K. \nCollaborate with Director to develop a marketing plan for each program and work with designer/printer/mail house to produce and mail promotional materials. \nOversee online applications, registrations and payment for  \n500 participants (both U.S. and International). \nResearch, edit and create course materials (binders & confirmation \npackets) for participants and faculty. \nServe as main liaison for vendors, both on and off campus (ie. Stanford Catering, Summer Conference Office, Event & Labor Services etc.) \nOversee all financials and their fulfillment using Stanford accounting \nsystems; process credit card and all other payments via Oracle Financials. \nCoordinate travel and accommodations for speakers and participants. \nManage all phone inquiries regarding course details; market course via phone and Web content contributions. \nCompare department financial records with SU financial reports. \nSupervise 10 summer staff to ensure effective and timely coordination of program. \nMaintain and update department website. \nResponsible for setting up new hires; payroll, sunetid, building access, email sponsorship etc. \nResponsible for all on-site trouble shooting during meetings – both on and off campus. \nMaintain Alumni Directory listing from past participants. Systems Administrator Stanford University March 1997  –  April 2001  (4 years 2 months) Managed payroll, petty cash, human resources requirements, paid bills \nvia SNAP, and organized employee team-building activities to motivate  \n7X24 staff. \nWorked with outside and Stanford vendors (ie. Event Services etc.) \nManaged department move due to renovation. \nAssisted with critical code calls from Stanford Hospital. Systems Administrator Stanford University March 1997  –  April 2001  (4 years 2 months) Managed payroll, petty cash, human resources requirements, paid bills \nvia SNAP, and organized employee team-building activities to motivate  \n7X24 staff. \nWorked with outside and Stanford vendors (ie. Event Services etc.) \nManaged department move due to renovation. \nAssisted with critical code calls from Stanford Hospital. Telecommunications Attendant III (Lead Operator) Stanford University June 1994  –  March 1997  (2 years 10 months) In addition to operator responsibilities, I responded to and managed customer complains and supervised 15 operators. Telecommunications Attendant III (Lead Operator) Stanford University June 1994  –  March 1997  (2 years 10 months) In addition to operator responsibilities, I responded to and managed customer complains and supervised 15 operators. Telecommunications Attendant I & II Stanford University December 1989  –  June 1994  (4 years 7 months) Answered multiple calls on a console (40,000 calls a month) from within Stanford and around the world. \nHandled diverse queries: directions, phone numbers, event information, and managed after-hours calls for Facility Operations. Telecommunications Attendant I & II Stanford University December 1989  –  June 1994  (4 years 7 months) Answered multiple calls on a console (40,000 calls a month) from within Stanford and around the world. \nHandled diverse queries: directions, phone numbers, event information, and managed after-hours calls for Facility Operations. Languages Spanish Spanish Spanish Skills Mac Editing Event Management Telephone Skills Microsoft Word Microsoft Excel Community Building Organizational... Event Planning Microsoft Office Filemaker Pro Promotions InDesign Illustrator Dreamweaver PeopleSoft Procurement Oracle Financials E-commerce Internet Explorer Pagemaker Payroll Processing Photoshop Adobe Acrobat Adobe Creative Suite Troubleshooting Marketing Materials Outlook Flash HTML Copywriting Access Public Speaking Social Media Leadership Copy Editing See 21+     See less Skills  Mac Editing Event Management Telephone Skills Microsoft Word Microsoft Excel Community Building Organizational... Event Planning Microsoft Office Filemaker Pro Promotions InDesign Illustrator Dreamweaver PeopleSoft Procurement Oracle Financials E-commerce Internet Explorer Pagemaker Payroll Processing Photoshop Adobe Acrobat Adobe Creative Suite Troubleshooting Marketing Materials Outlook Flash HTML Copywriting Access Public Speaking Social Media Leadership Copy Editing See 21+     See less Mac Editing Event Management Telephone Skills Microsoft Word Microsoft Excel Community Building Organizational... Event Planning Microsoft Office Filemaker Pro Promotions InDesign Illustrator Dreamweaver PeopleSoft Procurement Oracle Financials E-commerce Internet Explorer Pagemaker Payroll Processing Photoshop Adobe Acrobat Adobe Creative Suite Troubleshooting Marketing Materials Outlook Flash HTML Copywriting Access Public Speaking Social Media Leadership Copy Editing See 21+     See less Mac Editing Event Management Telephone Skills Microsoft Word Microsoft Excel Community Building Organizational... Event Planning Microsoft Office Filemaker Pro Promotions InDesign Illustrator Dreamweaver PeopleSoft Procurement Oracle Financials E-commerce Internet Explorer Pagemaker Payroll Processing Photoshop Adobe Acrobat Adobe Creative Suite Troubleshooting Marketing Materials Outlook Flash HTML Copywriting Access Public Speaking Social Media Leadership Copy Editing See 21+     See less Education McAllen High School 1981  – 1985 McAllen High School 1981  – 1985 McAllen High School 1981  – 1985 McAllen High School 1981  – 1985 ", "", "Experience Finance Associate Stanford University April 2015  – Present (5 months) 435 Lasuen Mall, Stanford, CA 94305 Event Assistant American Beethoven Society 2010  – Present (5 years) San Jose, CA Finance and Operations Coordinator Stanford University December 2014  –  April 2015  (5 months) 328 Lomita Drive, Stanford CA 94305 Administrative Associate Stanford University October 2014  –  December 2014  (3 months) 397 Panama Mall, Stanford, CA 94305 Temporary Administrator Medallia September 2014  –  September 2014  (1 month) Palo Alto, CA Survey Team Member Traffic Research Associates September 2014  –  September 2014  (1 month) San Leandro, CA Administrative Associate Stanford University April 2014  –  September 2014  (6 months) 482 Galvez Mall, Stanford, CA Operations Manager The Choral Project October 2012  –  April 2014  (1 year 7 months) San Jose, CA Administrative Assistant The Village Gardener February 2013  –  January 2014  (1 year) San Carlos, CA Survey Team Member Traffic Research Associates May 2012  –  June 2012  (2 months) San Leandro, CA Sales Associate Macy's June 2008  –  November 2011  (3 years 6 months) Santa Clara, CA Shift Leader Sodexo June 2007  –  August 2007  (3 months) Davis CA Student Manager Sodexo April 2004  –  August 2006  (2 years 5 months) Davis, CA Finance Associate Stanford University April 2015  – Present (5 months) 435 Lasuen Mall, Stanford, CA 94305 Finance Associate Stanford University April 2015  – Present (5 months) 435 Lasuen Mall, Stanford, CA 94305 Event Assistant American Beethoven Society 2010  – Present (5 years) San Jose, CA Event Assistant American Beethoven Society 2010  – Present (5 years) San Jose, CA Finance and Operations Coordinator Stanford University December 2014  –  April 2015  (5 months) 328 Lomita Drive, Stanford CA 94305 Finance and Operations Coordinator Stanford University December 2014  –  April 2015  (5 months) 328 Lomita Drive, Stanford CA 94305 Administrative Associate Stanford University October 2014  –  December 2014  (3 months) 397 Panama Mall, Stanford, CA 94305 Administrative Associate Stanford University October 2014  –  December 2014  (3 months) 397 Panama Mall, Stanford, CA 94305 Temporary Administrator Medallia September 2014  –  September 2014  (1 month) Palo Alto, CA Temporary Administrator Medallia September 2014  –  September 2014  (1 month) Palo Alto, CA Survey Team Member Traffic Research Associates September 2014  –  September 2014  (1 month) San Leandro, CA Survey Team Member Traffic Research Associates September 2014  –  September 2014  (1 month) San Leandro, CA Administrative Associate Stanford University April 2014  –  September 2014  (6 months) 482 Galvez Mall, Stanford, CA Administrative Associate Stanford University April 2014  –  September 2014  (6 months) 482 Galvez Mall, Stanford, CA Operations Manager The Choral Project October 2012  –  April 2014  (1 year 7 months) San Jose, CA Operations Manager The Choral Project October 2012  –  April 2014  (1 year 7 months) San Jose, CA Administrative Assistant The Village Gardener February 2013  –  January 2014  (1 year) San Carlos, CA Administrative Assistant The Village Gardener February 2013  –  January 2014  (1 year) San Carlos, CA Survey Team Member Traffic Research Associates May 2012  –  June 2012  (2 months) San Leandro, CA Survey Team Member Traffic Research Associates May 2012  –  June 2012  (2 months) San Leandro, CA Sales Associate Macy's June 2008  –  November 2011  (3 years 6 months) Santa Clara, CA Sales Associate Macy's June 2008  –  November 2011  (3 years 6 months) Santa Clara, CA Shift Leader Sodexo June 2007  –  August 2007  (3 months) Davis CA Shift Leader Sodexo June 2007  –  August 2007  (3 months) Davis CA Student Manager Sodexo April 2004  –  August 2006  (2 years 5 months) Davis, CA Student Manager Sodexo April 2004  –  August 2006  (2 years 5 months) Davis, CA Languages English Full professional proficiency Spanish Limited working proficiency English Full professional proficiency Spanish Limited working proficiency English Full professional proficiency Spanish Limited working proficiency Full professional proficiency Limited working proficiency Skills Microsoft Excel Microsoft Office QuickBooks Event Planning Nonprofits Budget Forecasts Project Management Adaptability Customer Support Project Coordination Analysis Friendly Personality Calendaring Program Management Program Coordination Data Cleaning Vlookup Microsoft Outlook Drafting Proposals Managing Database Reports Microsoft Word Customer Service Outlook See 9+     See less Skills  Microsoft Excel Microsoft Office QuickBooks Event Planning Nonprofits Budget Forecasts Project Management Adaptability Customer Support Project Coordination Analysis Friendly Personality Calendaring Program Management Program Coordination Data Cleaning Vlookup Microsoft Outlook Drafting Proposals Managing Database Reports Microsoft Word Customer Service Outlook See 9+     See less Microsoft Excel Microsoft Office QuickBooks Event Planning Nonprofits Budget Forecasts Project Management Adaptability Customer Support Project Coordination Analysis Friendly Personality Calendaring Program Management Program Coordination Data Cleaning Vlookup Microsoft Outlook Drafting Proposals Managing Database Reports Microsoft Word Customer Service Outlook See 9+     See less Microsoft Excel Microsoft Office QuickBooks Event Planning Nonprofits Budget Forecasts Project Management Adaptability Customer Support Project Coordination Analysis Friendly Personality Calendaring Program Management Program Coordination Data Cleaning Vlookup Microsoft Outlook Drafting Proposals Managing Database Reports Microsoft Word Customer Service Outlook See 9+     See less Education San Jose State University Bachelor of Arts (B.A.) 2006  – 2012 Foothill College 2013  – 2014 UC Davis 2003  – 2005 Davis Senior High School San Jose State University Bachelor of Arts (B.A.) 2006  – 2012 San Jose State University Bachelor of Arts (B.A.) 2006  – 2012 San Jose State University Bachelor of Arts (B.A.) 2006  – 2012 Foothill College 2013  – 2014 Foothill College 2013  – 2014 Foothill College 2013  – 2014 UC Davis 2003  – 2005 UC Davis 2003  – 2005 UC Davis 2003  – 2005 Davis Senior High School Davis Senior High School Davis Senior High School Honors & Awards ", "Experience Administrative Associate Stanford University December 2014  – Present (9 months) The Center on Food Security and the Environment Administrative Associate Stanford University May 2014  –  November 2014  (7 months) The Freeman Spogli Institute for International Studies Plan travel itinerary including organizing air and ground transportation, securing lodging, arranging meetings, and observing special domestic and international travel requirements for the center director. \nSupport new programs and events for the International Policy Implementation Lab, including organizing for special guests, maintaining conference room calendars and assisting with long-term goals. \nSupport newly formed working groups on health policy, including planning for meeting, scheduling guest speakers and writing and maintaining logistical documents. \nProcess reimbursements for purchasing and travel cards.  \nCalendar recurring and special meetings for the center director. \nProvide assistance for maintaining new and existing faculty files under the direction of the executive director. Psychology Research Assistant Duke University May 2013  –  October 2013  (6 months) Duke University Ran participants under necessary conditions and organized participant responses in mimicry study \nCreated and maintained a database for tracking participants, participant responses and video recordings of interviews \nCreated new surveys with Qualtrics, an online tool for developing and maintaining surveys Au Pair Herrn family June 2011  –  May 2012  (1 year) Munich, Germany Assisted in daily activities and English language acquisition of two young children (ages 2-3 and 5-6) \nProvided regular lessons in grammar, spelling and writing appropriate for each child Intern The Carolyn Lipshy Galerstein Women's Center January 2011  –  May 2011  (5 months) University of Texas at Dallas Expanded student use of MentorNet, a mentorship system that connects women and minority students with similar-identity mentors in Science, Technology, Engineering and Mathematics (STEM) fields \nResearched and organized lab projects for Introduce a Girl to Engineering Day, an annual event for local students to encourage women to pursue engineering \nProvided a review for student usage, impact and projected university budget of MentorNet Community Organizer Texas Campaign for the Environment June 2010  –  August 2010  (3 months) Dallas, Tx Worked as a community organizer to raise funds for environmental research and promote grass-roots democracy with letter-writing campaigns Facilitator/Intern director Center for American and International Law May 2009  –  June 2009  (2 months) Plano, Tx Directed a team of 7 interns in daily tasks necessary to organize international lawyers in academy events, including organizing for classes, lunches, and cultural excursions \nManaged budget pertaining to academy events  \nAssisted international lawyers with cultural immersion and supported diversity promotion Legal Secretary and Intern Coordinator 23rd Judicial District Attorney’s Office August 2006  –  July 2007  (1 year) Led a team of two interns on long-term projects, such as re-organizing felony case filings and creating a computerized log to track video-recorded evidence on open cases \nCreated and filed misdemeanor and felony cases \nProvided general support to three attorneys Administrative Associate Stanford University December 2014  – Present (9 months) The Center on Food Security and the Environment Administrative Associate Stanford University December 2014  – Present (9 months) The Center on Food Security and the Environment Administrative Associate Stanford University May 2014  –  November 2014  (7 months) The Freeman Spogli Institute for International Studies Plan travel itinerary including organizing air and ground transportation, securing lodging, arranging meetings, and observing special domestic and international travel requirements for the center director. \nSupport new programs and events for the International Policy Implementation Lab, including organizing for special guests, maintaining conference room calendars and assisting with long-term goals. \nSupport newly formed working groups on health policy, including planning for meeting, scheduling guest speakers and writing and maintaining logistical documents. \nProcess reimbursements for purchasing and travel cards.  \nCalendar recurring and special meetings for the center director. \nProvide assistance for maintaining new and existing faculty files under the direction of the executive director. Administrative Associate Stanford University May 2014  –  November 2014  (7 months) The Freeman Spogli Institute for International Studies Plan travel itinerary including organizing air and ground transportation, securing lodging, arranging meetings, and observing special domestic and international travel requirements for the center director. \nSupport new programs and events for the International Policy Implementation Lab, including organizing for special guests, maintaining conference room calendars and assisting with long-term goals. \nSupport newly formed working groups on health policy, including planning for meeting, scheduling guest speakers and writing and maintaining logistical documents. \nProcess reimbursements for purchasing and travel cards.  \nCalendar recurring and special meetings for the center director. \nProvide assistance for maintaining new and existing faculty files under the direction of the executive director. Psychology Research Assistant Duke University May 2013  –  October 2013  (6 months) Duke University Ran participants under necessary conditions and organized participant responses in mimicry study \nCreated and maintained a database for tracking participants, participant responses and video recordings of interviews \nCreated new surveys with Qualtrics, an online tool for developing and maintaining surveys Psychology Research Assistant Duke University May 2013  –  October 2013  (6 months) Duke University Ran participants under necessary conditions and organized participant responses in mimicry study \nCreated and maintained a database for tracking participants, participant responses and video recordings of interviews \nCreated new surveys with Qualtrics, an online tool for developing and maintaining surveys Au Pair Herrn family June 2011  –  May 2012  (1 year) Munich, Germany Assisted in daily activities and English language acquisition of two young children (ages 2-3 and 5-6) \nProvided regular lessons in grammar, spelling and writing appropriate for each child Au Pair Herrn family June 2011  –  May 2012  (1 year) Munich, Germany Assisted in daily activities and English language acquisition of two young children (ages 2-3 and 5-6) \nProvided regular lessons in grammar, spelling and writing appropriate for each child Intern The Carolyn Lipshy Galerstein Women's Center January 2011  –  May 2011  (5 months) University of Texas at Dallas Expanded student use of MentorNet, a mentorship system that connects women and minority students with similar-identity mentors in Science, Technology, Engineering and Mathematics (STEM) fields \nResearched and organized lab projects for Introduce a Girl to Engineering Day, an annual event for local students to encourage women to pursue engineering \nProvided a review for student usage, impact and projected university budget of MentorNet Intern The Carolyn Lipshy Galerstein Women's Center January 2011  –  May 2011  (5 months) University of Texas at Dallas Expanded student use of MentorNet, a mentorship system that connects women and minority students with similar-identity mentors in Science, Technology, Engineering and Mathematics (STEM) fields \nResearched and organized lab projects for Introduce a Girl to Engineering Day, an annual event for local students to encourage women to pursue engineering \nProvided a review for student usage, impact and projected university budget of MentorNet Community Organizer Texas Campaign for the Environment June 2010  –  August 2010  (3 months) Dallas, Tx Worked as a community organizer to raise funds for environmental research and promote grass-roots democracy with letter-writing campaigns Community Organizer Texas Campaign for the Environment June 2010  –  August 2010  (3 months) Dallas, Tx Worked as a community organizer to raise funds for environmental research and promote grass-roots democracy with letter-writing campaigns Facilitator/Intern director Center for American and International Law May 2009  –  June 2009  (2 months) Plano, Tx Directed a team of 7 interns in daily tasks necessary to organize international lawyers in academy events, including organizing for classes, lunches, and cultural excursions \nManaged budget pertaining to academy events  \nAssisted international lawyers with cultural immersion and supported diversity promotion Facilitator/Intern director Center for American and International Law May 2009  –  June 2009  (2 months) Plano, Tx Directed a team of 7 interns in daily tasks necessary to organize international lawyers in academy events, including organizing for classes, lunches, and cultural excursions \nManaged budget pertaining to academy events  \nAssisted international lawyers with cultural immersion and supported diversity promotion Legal Secretary and Intern Coordinator 23rd Judicial District Attorney’s Office August 2006  –  July 2007  (1 year) Led a team of two interns on long-term projects, such as re-organizing felony case filings and creating a computerized log to track video-recorded evidence on open cases \nCreated and filed misdemeanor and felony cases \nProvided general support to three attorneys Legal Secretary and Intern Coordinator 23rd Judicial District Attorney’s Office August 2006  –  July 2007  (1 year) Led a team of two interns on long-term projects, such as re-organizing felony case filings and creating a computerized log to track video-recorded evidence on open cases \nCreated and filed misdemeanor and felony cases \nProvided general support to three attorneys Languages English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Oracle E-Business Suite Microsoft Excel Microsoft Office Calendaring Travel Planning Coordinating Events International Law English Skills  Oracle E-Business Suite Microsoft Excel Microsoft Office Calendaring Travel Planning Coordinating Events International Law English Oracle E-Business Suite Microsoft Excel Microsoft Office Calendaring Travel Planning Coordinating Events International Law English Oracle E-Business Suite Microsoft Excel Microsoft Office Calendaring Travel Planning Coordinating Events International Law English Education Duke University MA Humanities 2012  – 2013 The University of Texas at Dallas 2007  – 2011 Duke University MA Humanities 2012  – 2013 Duke University MA Humanities 2012  – 2013 Duke University MA Humanities 2012  – 2013 The University of Texas at Dallas 2007  – 2011 The University of Texas at Dallas 2007  – 2011 The University of Texas at Dallas 2007  – 2011 ", "Summary Seeking to acquire a position as an administrative assistant that will utilize my computer knowledge, strong people skills, organizational skills, and business experience. Summary Seeking to acquire a position as an administrative assistant that will utilize my computer knowledge, strong people skills, organizational skills, and business experience. Seeking to acquire a position as an administrative assistant that will utilize my computer knowledge, strong people skills, organizational skills, and business experience. Seeking to acquire a position as an administrative assistant that will utilize my computer knowledge, strong people skills, organizational skills, and business experience. Experience Administrative Associate Stanford University School of Medicine August 2012  – Present (3 years 1 month) Stanford, CA Joined the finance team in Anesthesia and carryout the following duties: Verify P cards for 13 faculty members and one Research Supervisor in Anesthesia, prepare travel reimbursements. Assisted in the financial coordination of the Medicine X Conference held yearly (300 registrants), prepare advances, honorariums, place orders through procurement, and pay invoices. Administrative Associate Dept. of Anesthesia, Stanford University August 2012  –  August 2013  (1 year 1 month) Administrative Associate Stanford University School of Medicine March 2011  –  August 2012  (1 year 6 months) Stanford, CA Provide office management support for senior level faculty within the Department of Anesthesia. Screen correspondence and independently respond to inquiries. Manage complex calendar of meetings. Process expense reports for reimbursements. Establish and maintain close control of deadlines for correspondence, reports, grants, abstracts. Assist in the preparation of grants, contract proposals, abstracts, manuscripts and book chapters for final submission to publishers. Arrange complex travel itineraries for senior level faculty and potential faculty/fellow applicants; process payments and travel reimbursements. Creates purchase orders, order and maintain supplies. Assist with the preparation and planning of Medicine X. Administrative Assistant J. David Gladstone Institutes November 2004  –  August 2008  (3 years 10 months) San Francisco, CA Composed letters, assisted in the preparation of National Institutes of Health grants, managed complicated calendars using MsOutlook. Arranged complicated domestic and international travel plans using Worldmate® Travel Companion software. Responsible for preparing scientific manuscripts for journals, prepared expense reports, petty cash vouchers, travel advances, and purchase orders, scheduled weekly lab meetings, and weekly journal club meetings. Prepared minutes from teleconference calls related to setting up clinical trials in Peru, Thailand, South Africa, Brazil, Argentina, and Ecuador. Senior Administrative Assistant Howard Hughes Medical Institute at Columbia University September 2001  –  June 2004  (2 years 10 months) New York, NY Prepared lectures (via Dictaphone) for audiences with scientific backgrounds, manuscripts, grants, reports, letters, chapters for the Principles for Neural Science book for medical students, and autobiography chapters for an autobiography of a prominent Nobel laureate’s life (now in book stores) in this fast-paced, highly visible research facility. Responsible for updating the professor’s curriculum vitae, retrieving information via the internet which entailed downloading information and forms, composed letters to be sent via email with attachments. Senior Administrative Assistant for CEO Arbor Vita Corporation June 2000  –  March 2001  (10 months) Fremont, CA Acted as Human Resources Manager, Purchasing Coordinator, Payroll Manager for this biotechnology start-up company. Responsible for preparing business correspondence, arranging the CEO’s travel plans, scheduled appointments. Maintained vacation records for personnel using Excel. Used QuickBooks for ordering scientific, office supplies, which often required dealing with vendors directly. Administrative Associate Stanford University School of Medicine August 2012  – Present (3 years 1 month) Stanford, CA Joined the finance team in Anesthesia and carryout the following duties: Verify P cards for 13 faculty members and one Research Supervisor in Anesthesia, prepare travel reimbursements. Assisted in the financial coordination of the Medicine X Conference held yearly (300 registrants), prepare advances, honorariums, place orders through procurement, and pay invoices. Administrative Associate Stanford University School of Medicine August 2012  – Present (3 years 1 month) Stanford, CA Joined the finance team in Anesthesia and carryout the following duties: Verify P cards for 13 faculty members and one Research Supervisor in Anesthesia, prepare travel reimbursements. Assisted in the financial coordination of the Medicine X Conference held yearly (300 registrants), prepare advances, honorariums, place orders through procurement, and pay invoices. Administrative Associate Dept. of Anesthesia, Stanford University August 2012  –  August 2013  (1 year 1 month) Administrative Associate Dept. of Anesthesia, Stanford University August 2012  –  August 2013  (1 year 1 month) Administrative Associate Stanford University School of Medicine March 2011  –  August 2012  (1 year 6 months) Stanford, CA Provide office management support for senior level faculty within the Department of Anesthesia. Screen correspondence and independently respond to inquiries. Manage complex calendar of meetings. Process expense reports for reimbursements. Establish and maintain close control of deadlines for correspondence, reports, grants, abstracts. Assist in the preparation of grants, contract proposals, abstracts, manuscripts and book chapters for final submission to publishers. Arrange complex travel itineraries for senior level faculty and potential faculty/fellow applicants; process payments and travel reimbursements. Creates purchase orders, order and maintain supplies. Assist with the preparation and planning of Medicine X. Administrative Associate Stanford University School of Medicine March 2011  –  August 2012  (1 year 6 months) Stanford, CA Provide office management support for senior level faculty within the Department of Anesthesia. Screen correspondence and independently respond to inquiries. Manage complex calendar of meetings. Process expense reports for reimbursements. Establish and maintain close control of deadlines for correspondence, reports, grants, abstracts. Assist in the preparation of grants, contract proposals, abstracts, manuscripts and book chapters for final submission to publishers. Arrange complex travel itineraries for senior level faculty and potential faculty/fellow applicants; process payments and travel reimbursements. Creates purchase orders, order and maintain supplies. Assist with the preparation and planning of Medicine X. Administrative Assistant J. David Gladstone Institutes November 2004  –  August 2008  (3 years 10 months) San Francisco, CA Composed letters, assisted in the preparation of National Institutes of Health grants, managed complicated calendars using MsOutlook. Arranged complicated domestic and international travel plans using Worldmate® Travel Companion software. Responsible for preparing scientific manuscripts for journals, prepared expense reports, petty cash vouchers, travel advances, and purchase orders, scheduled weekly lab meetings, and weekly journal club meetings. Prepared minutes from teleconference calls related to setting up clinical trials in Peru, Thailand, South Africa, Brazil, Argentina, and Ecuador. Administrative Assistant J. David Gladstone Institutes November 2004  –  August 2008  (3 years 10 months) San Francisco, CA Composed letters, assisted in the preparation of National Institutes of Health grants, managed complicated calendars using MsOutlook. Arranged complicated domestic and international travel plans using Worldmate® Travel Companion software. Responsible for preparing scientific manuscripts for journals, prepared expense reports, petty cash vouchers, travel advances, and purchase orders, scheduled weekly lab meetings, and weekly journal club meetings. Prepared minutes from teleconference calls related to setting up clinical trials in Peru, Thailand, South Africa, Brazil, Argentina, and Ecuador. Senior Administrative Assistant Howard Hughes Medical Institute at Columbia University September 2001  –  June 2004  (2 years 10 months) New York, NY Prepared lectures (via Dictaphone) for audiences with scientific backgrounds, manuscripts, grants, reports, letters, chapters for the Principles for Neural Science book for medical students, and autobiography chapters for an autobiography of a prominent Nobel laureate’s life (now in book stores) in this fast-paced, highly visible research facility. Responsible for updating the professor’s curriculum vitae, retrieving information via the internet which entailed downloading information and forms, composed letters to be sent via email with attachments. Senior Administrative Assistant Howard Hughes Medical Institute at Columbia University September 2001  –  June 2004  (2 years 10 months) New York, NY Prepared lectures (via Dictaphone) for audiences with scientific backgrounds, manuscripts, grants, reports, letters, chapters for the Principles for Neural Science book for medical students, and autobiography chapters for an autobiography of a prominent Nobel laureate’s life (now in book stores) in this fast-paced, highly visible research facility. Responsible for updating the professor’s curriculum vitae, retrieving information via the internet which entailed downloading information and forms, composed letters to be sent via email with attachments. Senior Administrative Assistant for CEO Arbor Vita Corporation June 2000  –  March 2001  (10 months) Fremont, CA Acted as Human Resources Manager, Purchasing Coordinator, Payroll Manager for this biotechnology start-up company. Responsible for preparing business correspondence, arranging the CEO’s travel plans, scheduled appointments. Maintained vacation records for personnel using Excel. Used QuickBooks for ordering scientific, office supplies, which often required dealing with vendors directly. Senior Administrative Assistant for CEO Arbor Vita Corporation June 2000  –  March 2001  (10 months) Fremont, CA Acted as Human Resources Manager, Purchasing Coordinator, Payroll Manager for this biotechnology start-up company. Responsible for preparing business correspondence, arranging the CEO’s travel plans, scheduled appointments. Maintained vacation records for personnel using Excel. Used QuickBooks for ordering scientific, office supplies, which often required dealing with vendors directly. Skills MsWord, Outlook,... Office Management Invoicing Management Research Proposal Writing Project Planning Medicine Procurement Finance Grants Legal Writing Administrative... Data Entry Editing Outlook Event Planning Calendaring Publishing PowerPoint Nonprofits See 6+     See less Skills  MsWord, Outlook,... Office Management Invoicing Management Research Proposal Writing Project Planning Medicine Procurement Finance Grants Legal Writing Administrative... Data Entry Editing Outlook Event Planning Calendaring Publishing PowerPoint Nonprofits See 6+     See less MsWord, Outlook,... Office Management Invoicing Management Research Proposal Writing Project Planning Medicine Procurement Finance Grants Legal Writing Administrative... Data Entry Editing Outlook Event Planning Calendaring Publishing PowerPoint Nonprofits See 6+     See less MsWord, Outlook,... Office Management Invoicing Management Research Proposal Writing Project Planning Medicine Procurement Finance Grants Legal Writing Administrative... Data Entry Editing Outlook Event Planning Calendaring Publishing PowerPoint Nonprofits See 6+     See less Education Phillips Jr. College State of California Certification (no degree given),  Court Reporting/Court Reporter 1992  – 1996 Phillips Jr. College State of California Certification (no degree given),  Court Reporting/Court Reporter 1992  – 1996 Phillips Jr. College State of California Certification (no degree given),  Court Reporting/Court Reporter 1992  – 1996 Phillips Jr. College State of California Certification (no degree given),  Court Reporting/Court Reporter 1992  – 1996 ", "Languages Spa Spa Spa Skills Software Documentation Research PowerPoint Event Planning Microsoft Office Microsoft Excel Data Analysis Microsoft Word Community Outreach Outlook Skills  Software Documentation Research PowerPoint Event Planning Microsoft Office Microsoft Excel Data Analysis Microsoft Word Community Outreach Outlook Software Documentation Research PowerPoint Event Planning Microsoft Office Microsoft Excel Data Analysis Microsoft Word Community Outreach Outlook Software Documentation Research PowerPoint Event Planning Microsoft Office Microsoft Excel Data Analysis Microsoft Word Community Outreach Outlook ", "Summary Over 11 years experience as an Administrative Associate at Stanford University, providing thorough support with a variety of responsibilities including training coordination, faculty appointments,drafting and editing correspondence for audiences within and outside the university, scheduling appointments for visiting faculty candidates and serving as first point of contact during their visits. Have also processed reimbursements and purchase orders for faculty and staff using Oracle financial systems. Ready and able to assist with whatever needs to get done. \n \nComputer skills include MS Word, Excel, PowerPoint, Outlook, Adobe Acrobat and Contribute, and Apple Pages. \n \nSpecialties: Drafting various documents, including meeting minutes, correspondence, and grant applications, editing, proofreading, administrative support, scheduling, updating web pages and databases, and community outreach. Summary Over 11 years experience as an Administrative Associate at Stanford University, providing thorough support with a variety of responsibilities including training coordination, faculty appointments,drafting and editing correspondence for audiences within and outside the university, scheduling appointments for visiting faculty candidates and serving as first point of contact during their visits. Have also processed reimbursements and purchase orders for faculty and staff using Oracle financial systems. Ready and able to assist with whatever needs to get done. \n \nComputer skills include MS Word, Excel, PowerPoint, Outlook, Adobe Acrobat and Contribute, and Apple Pages. \n \nSpecialties: Drafting various documents, including meeting minutes, correspondence, and grant applications, editing, proofreading, administrative support, scheduling, updating web pages and databases, and community outreach. Over 11 years experience as an Administrative Associate at Stanford University, providing thorough support with a variety of responsibilities including training coordination, faculty appointments,drafting and editing correspondence for audiences within and outside the university, scheduling appointments for visiting faculty candidates and serving as first point of contact during their visits. Have also processed reimbursements and purchase orders for faculty and staff using Oracle financial systems. Ready and able to assist with whatever needs to get done. \n \nComputer skills include MS Word, Excel, PowerPoint, Outlook, Adobe Acrobat and Contribute, and Apple Pages. \n \nSpecialties: Drafting various documents, including meeting minutes, correspondence, and grant applications, editing, proofreading, administrative support, scheduling, updating web pages and databases, and community outreach. Over 11 years experience as an Administrative Associate at Stanford University, providing thorough support with a variety of responsibilities including training coordination, faculty appointments,drafting and editing correspondence for audiences within and outside the university, scheduling appointments for visiting faculty candidates and serving as first point of contact during their visits. Have also processed reimbursements and purchase orders for faculty and staff using Oracle financial systems. Ready and able to assist with whatever needs to get done. \n \nComputer skills include MS Word, Excel, PowerPoint, Outlook, Adobe Acrobat and Contribute, and Apple Pages. \n \nSpecialties: Drafting various documents, including meeting minutes, correspondence, and grant applications, editing, proofreading, administrative support, scheduling, updating web pages and databases, and community outreach. Experience Administrative Associate Stanford University January 2014  – Present (1 year 8 months) Sexual Harassment Policy Office (SHPO) Outreach Volunteer/Office Assistant Sunnyvale Community Services April 2010  –  February 2013  (2 years 11 months) Sunnyvale, CA Administrative Associate Stanford University August 2012  –  January 2013  (6 months) Department of Electrical Engineering Temporary employee Hallmark Personnel November 2011  –  December 2011  (2 months) Palo Alto, CA Volunteer West Valley Community Services April 2010  –  December 2010  (9 months) Academic Affairs Associate Stanford University September 2009  –  February 2010  (6 months) Stanford, CA Administrative Associate/Faculty Affairs Coordinator Stanford University January 2002  –  September 2009  (7 years 9 months) Stanford, CA Technical Writer Portal Software June 2000  –  May 2001  (1 year) Public Affairs Writer Hoover Institution at Stanford University January 1999  –  June 2000  (1 year 6 months) Copy Editor/Staff Writer Las Vegas Sun 1986  –  1988  (2 years) Administrative Associate Stanford University January 2014  – Present (1 year 8 months) Sexual Harassment Policy Office (SHPO) Administrative Associate Stanford University January 2014  – Present (1 year 8 months) Sexual Harassment Policy Office (SHPO) Outreach Volunteer/Office Assistant Sunnyvale Community Services April 2010  –  February 2013  (2 years 11 months) Sunnyvale, CA Outreach Volunteer/Office Assistant Sunnyvale Community Services April 2010  –  February 2013  (2 years 11 months) Sunnyvale, CA Administrative Associate Stanford University August 2012  –  January 2013  (6 months) Department of Electrical Engineering Administrative Associate Stanford University August 2012  –  January 2013  (6 months) Department of Electrical Engineering Temporary employee Hallmark Personnel November 2011  –  December 2011  (2 months) Palo Alto, CA Temporary employee Hallmark Personnel November 2011  –  December 2011  (2 months) Palo Alto, CA Volunteer West Valley Community Services April 2010  –  December 2010  (9 months) Volunteer West Valley Community Services April 2010  –  December 2010  (9 months) Academic Affairs Associate Stanford University September 2009  –  February 2010  (6 months) Stanford, CA Academic Affairs Associate Stanford University September 2009  –  February 2010  (6 months) Stanford, CA Administrative Associate/Faculty Affairs Coordinator Stanford University January 2002  –  September 2009  (7 years 9 months) Stanford, CA Administrative Associate/Faculty Affairs Coordinator Stanford University January 2002  –  September 2009  (7 years 9 months) Stanford, CA Technical Writer Portal Software June 2000  –  May 2001  (1 year) Technical Writer Portal Software June 2000  –  May 2001  (1 year) Public Affairs Writer Hoover Institution at Stanford University January 1999  –  June 2000  (1 year 6 months) Public Affairs Writer Hoover Institution at Stanford University January 1999  –  June 2000  (1 year 6 months) Copy Editor/Staff Writer Las Vegas Sun 1986  –  1988  (2 years) Copy Editor/Staff Writer Las Vegas Sun 1986  –  1988  (2 years) Skills Training Coordination Administrative Support Training & Development Community Outreach Editing Software Documentation Newsletters PowerPoint Event Planning Data Entry Human Resources Microsoft Excel Administrative... Writing Documentation Proofreading Organizing Scheduling Event Coverage Apple Pages Word Excel Outlook Microsoft Word See 9+     See less Skills  Training Coordination Administrative Support Training & Development Community Outreach Editing Software Documentation Newsletters PowerPoint Event Planning Data Entry Human Resources Microsoft Excel Administrative... Writing Documentation Proofreading Organizing Scheduling Event Coverage Apple Pages Word Excel Outlook Microsoft Word See 9+     See less Training Coordination Administrative Support Training & Development Community Outreach Editing Software Documentation Newsletters PowerPoint Event Planning Data Entry Human Resources Microsoft Excel Administrative... Writing Documentation Proofreading Organizing Scheduling Event Coverage Apple Pages Word Excel Outlook Microsoft Word See 9+     See less Training Coordination Administrative Support Training & Development Community Outreach Editing Software Documentation Newsletters PowerPoint Event Planning Data Entry Human Resources Microsoft Excel Administrative... Writing Documentation Proofreading Organizing Scheduling Event Coverage Apple Pages Word Excel Outlook Microsoft Word See 9+     See less Education University of Nevada-Las Vegas BA University of Nevada-Las Vegas BA University of Nevada-Las Vegas BA University of Nevada-Las Vegas BA Honors & Awards Additional Honors & Awards Certificate of Special Congressional Recognition for Outstanding and Invaluable Service to the Community. Received from Rep. Anna Eshoo on May 5, 2011. Additional Honors & Awards Certificate of Special Congressional Recognition for Outstanding and Invaluable Service to the Community. Received from Rep. Anna Eshoo on May 5, 2011. Additional Honors & Awards Certificate of Special Congressional Recognition for Outstanding and Invaluable Service to the Community. Received from Rep. Anna Eshoo on May 5, 2011. Additional Honors & Awards Certificate of Special Congressional Recognition for Outstanding and Invaluable Service to the Community. Received from Rep. Anna Eshoo on May 5, 2011. ", "Experience Administrative Associate Stanford University School of Medicine October 2014  – Present (11 months) Stanford Ear Institute Division of Audiology & Programs Administrative Associate Stanford University September 2012  – Present (3 years) Administrative Associate to: \nDivision of Pediatric-OHNS \nDivision of Audiology \n801 Welch Road  \nStanford, CA 94305-5739 Executive Administrative Associate Stanford University January 2010  –  September 2012  (2 years 9 months) Executive Associate to: \nRobert K. Jackler, MD \nSewall Professor and Chair \nStanford Otolaryngology - Head & Neck Surgery \n801 Welch Road \nStanford, CA 94305-5739 Office Assistant Research Compliance April 2004  –  December 2010  (6 years 9 months) Stanford Mail Courier/Office Clerk Research Management Group August 2002  –  April 2004  (1 year 9 months) Stanford Administrative Associate Stanford University School of Medicine October 2014  – Present (11 months) Stanford Ear Institute Division of Audiology & Programs Administrative Associate Stanford University School of Medicine October 2014  – Present (11 months) Stanford Ear Institute Division of Audiology & Programs Administrative Associate Stanford University September 2012  – Present (3 years) Administrative Associate to: \nDivision of Pediatric-OHNS \nDivision of Audiology \n801 Welch Road  \nStanford, CA 94305-5739 Administrative Associate Stanford University September 2012  – Present (3 years) Administrative Associate to: \nDivision of Pediatric-OHNS \nDivision of Audiology \n801 Welch Road  \nStanford, CA 94305-5739 Executive Administrative Associate Stanford University January 2010  –  September 2012  (2 years 9 months) Executive Associate to: \nRobert K. Jackler, MD \nSewall Professor and Chair \nStanford Otolaryngology - Head & Neck Surgery \n801 Welch Road \nStanford, CA 94305-5739 Executive Administrative Associate Stanford University January 2010  –  September 2012  (2 years 9 months) Executive Associate to: \nRobert K. Jackler, MD \nSewall Professor and Chair \nStanford Otolaryngology - Head & Neck Surgery \n801 Welch Road \nStanford, CA 94305-5739 Office Assistant Research Compliance April 2004  –  December 2010  (6 years 9 months) Stanford Office Assistant Research Compliance April 2004  –  December 2010  (6 years 9 months) Stanford Mail Courier/Office Clerk Research Management Group August 2002  –  April 2004  (1 year 9 months) Stanford Mail Courier/Office Clerk Research Management Group August 2002  –  April 2004  (1 year 9 months) Stanford Skills Research ENT PowerPoint Microsoft Excel Higher Education Microsoft Office Outlook Event Planning Nonprofits Microsoft Word Access Administrative... Fundraising Administration Administrative... Skills  Research ENT PowerPoint Microsoft Excel Higher Education Microsoft Office Outlook Event Planning Nonprofits Microsoft Word Access Administrative... Fundraising Administration Administrative... Research ENT PowerPoint Microsoft Excel Higher Education Microsoft Office Outlook Event Planning Nonprofits Microsoft Word Access Administrative... Fundraising Administration Administrative... Research ENT PowerPoint Microsoft Excel Higher Education Microsoft Office Outlook Event Planning Nonprofits Microsoft Word Access Administrative... Fundraising Administration Administrative... Education University of Phoenix Bachelors of Science,  Business/Finance 2008  – 2014 Woodside High School High School Diploma 1999  – 2002 Selby Lane University of Phoenix Bachelors of Science,  Business/Finance 2008  – 2014 University of Phoenix Bachelors of Science,  Business/Finance 2008  – 2014 University of Phoenix Bachelors of Science,  Business/Finance 2008  – 2014 Woodside High School High School Diploma 1999  – 2002 Woodside High School High School Diploma 1999  – 2002 Woodside High School High School Diploma 1999  – 2002 Selby Lane Selby Lane Selby Lane ", "Summary I am a people person with a unique blend of experience and skills including: Executive Assistance, Project Coordination, Office Management, Liaison Activities and Event Planning. \n \n \n* Relating effectively to all types of people from varied backgrounds. \n* Solving problems in multitasking, time-sensitive environments. \n* Detail and customer service oriented. \n* Proficient in MS Office (Excel, Outlook, PowerPoint, Word); Oracle Financials (iOU, iProcurement, iJournals) Summary I am a people person with a unique blend of experience and skills including: Executive Assistance, Project Coordination, Office Management, Liaison Activities and Event Planning. \n \n \n* Relating effectively to all types of people from varied backgrounds. \n* Solving problems in multitasking, time-sensitive environments. \n* Detail and customer service oriented. \n* Proficient in MS Office (Excel, Outlook, PowerPoint, Word); Oracle Financials (iOU, iProcurement, iJournals) I am a people person with a unique blend of experience and skills including: Executive Assistance, Project Coordination, Office Management, Liaison Activities and Event Planning. \n \n \n* Relating effectively to all types of people from varied backgrounds. \n* Solving problems in multitasking, time-sensitive environments. \n* Detail and customer service oriented. \n* Proficient in MS Office (Excel, Outlook, PowerPoint, Word); Oracle Financials (iOU, iProcurement, iJournals) I am a people person with a unique blend of experience and skills including: Executive Assistance, Project Coordination, Office Management, Liaison Activities and Event Planning. \n \n \n* Relating effectively to all types of people from varied backgrounds. \n* Solving problems in multitasking, time-sensitive environments. \n* Detail and customer service oriented. \n* Proficient in MS Office (Excel, Outlook, PowerPoint, Word); Oracle Financials (iOU, iProcurement, iJournals) Experience Administrative Associate Stanford University School of Medicine January 2013  – Present (2 years 8 months) Stanford Hospital Assistant to Section Chief and one additional research clinician \nProvide support to associated lab personnel \nReconcile monthly expenditures for government and privately funded grants \nCoordinate projects for Section Chief \nExecute special event planning Mechanical/Electrical/Plumbing Special Projects Coordinator Lands, Buildings and Real Estate, Stanford University January 2008  –  October 2012  (4 years 10 months) Stanford, CA •Assistant to Department Manager \n•Completed projects for Manager, Supervisor and 6 Maintenance Project Coordinators (i.e. created Capital Plan and Mission/Vision statement, oversaw renovation of Plumbing Shop) \n•Performed all hiring activities not handled by Human Resources (initiate Request to Hire/Job Movement forms, schedule interviews and complete Trovix dispositions for each candidate) \n•Collaborated with Stanford Health Improvement Program to develop Work Well, a wellness program targeted at special needs of the Bargaining Unit \n•Guided department through implementation of a new asset management system (eAM) \n•Executed special event planning – All Work Well Program activities plus others as needed \n•Compiled annual Accomplishments Binder which captured all MEP activities each fiscal year. \n•Coordinated all department capital purchasing \n•Liaison to Risk Management for all vehicle incidents/accidents \n•Coordinated projects for 3 shop specific Administrative Associates HVAC Administrative Associate Lands, Buildings and Real Estate, Stanford University October 2004  –  January 2008  (3 years 4 months) Stanford, CA •Provided administrative services for HVAC Supervisor, Leads and 30 Bargaining Unit technicians \n•Documented and streamlined Freeze Protection process for faster response \n•Managed Temporary Cooling on campus during the three week heat wave in 2006. This involved the rental of approximately 100 portable cooling units that were relocated multiple times, according to need, over the course of the crisis \n•Assisted with the integration of the HVAC, Preventive Maintenance shops into one group \n•Coordinated all travel and associated reimbursement \n•Processed all time card entries Fleet Garage Administrative Associate Lands, Buildings and Real Estate, Stanford University March 1999  –  October 2004  (5 years 8 months) Stanford, CA •Provided administrative services for Fleet Garage Supervisor, Leads and 11 Bargaining Unit technicians \n•Guided supervisor, and staff, through implementation of a new work order management system (FAMIS) \n•Coordinated the installation of first computerized fuel delivery/chip key system on campus and educated campus clients in the use of the new system \n•Facilitated the purchase of new vehicles by departments \n•Scheduled routine service for 500+ University owned vehicles \n•Coordinated fuel deliveries to campus pump stations \n•Coordinated all travel and associated reimbursement \n•Processed all time card entries Electric Shop Administrative Associate Land, Buildings and Real Estate, Stanford University April 1996  –  March 1999  (3 years) Stanford, CA •Provided administrative services for Electric Shop Supervisor, Leads and 16 Bargaining Unit technicians \n•Processed payment for all materials used on jobs \n•Processed timecards and inventory materials charges \n•Coordinated all travel and associated reimbursement Dermatology Research Administrative Associate Stanford University School of Medicine October 1993  –  April 1996  (2 years 7 months) Stanford, CA •Assisted three research faculty members and their laboratories \n•Produced NIH grant applications, presentations, the department newsletter and other documents as needed \n•Maintained records of Continuing Medical Education credits and professional organization dues, etc \n•Coordinated all travel and associated reimbursement Administrative Associate Stanford University School of Medicine January 2013  – Present (2 years 8 months) Stanford Hospital Assistant to Section Chief and one additional research clinician \nProvide support to associated lab personnel \nReconcile monthly expenditures for government and privately funded grants \nCoordinate projects for Section Chief \nExecute special event planning Administrative Associate Stanford University School of Medicine January 2013  – Present (2 years 8 months) Stanford Hospital Assistant to Section Chief and one additional research clinician \nProvide support to associated lab personnel \nReconcile monthly expenditures for government and privately funded grants \nCoordinate projects for Section Chief \nExecute special event planning Mechanical/Electrical/Plumbing Special Projects Coordinator Lands, Buildings and Real Estate, Stanford University January 2008  –  October 2012  (4 years 10 months) Stanford, CA •Assistant to Department Manager \n•Completed projects for Manager, Supervisor and 6 Maintenance Project Coordinators (i.e. created Capital Plan and Mission/Vision statement, oversaw renovation of Plumbing Shop) \n•Performed all hiring activities not handled by Human Resources (initiate Request to Hire/Job Movement forms, schedule interviews and complete Trovix dispositions for each candidate) \n•Collaborated with Stanford Health Improvement Program to develop Work Well, a wellness program targeted at special needs of the Bargaining Unit \n•Guided department through implementation of a new asset management system (eAM) \n•Executed special event planning – All Work Well Program activities plus others as needed \n•Compiled annual Accomplishments Binder which captured all MEP activities each fiscal year. \n•Coordinated all department capital purchasing \n•Liaison to Risk Management for all vehicle incidents/accidents \n•Coordinated projects for 3 shop specific Administrative Associates Mechanical/Electrical/Plumbing Special Projects Coordinator Lands, Buildings and Real Estate, Stanford University January 2008  –  October 2012  (4 years 10 months) Stanford, CA •Assistant to Department Manager \n•Completed projects for Manager, Supervisor and 6 Maintenance Project Coordinators (i.e. created Capital Plan and Mission/Vision statement, oversaw renovation of Plumbing Shop) \n•Performed all hiring activities not handled by Human Resources (initiate Request to Hire/Job Movement forms, schedule interviews and complete Trovix dispositions for each candidate) \n•Collaborated with Stanford Health Improvement Program to develop Work Well, a wellness program targeted at special needs of the Bargaining Unit \n•Guided department through implementation of a new asset management system (eAM) \n•Executed special event planning – All Work Well Program activities plus others as needed \n•Compiled annual Accomplishments Binder which captured all MEP activities each fiscal year. \n•Coordinated all department capital purchasing \n•Liaison to Risk Management for all vehicle incidents/accidents \n•Coordinated projects for 3 shop specific Administrative Associates HVAC Administrative Associate Lands, Buildings and Real Estate, Stanford University October 2004  –  January 2008  (3 years 4 months) Stanford, CA •Provided administrative services for HVAC Supervisor, Leads and 30 Bargaining Unit technicians \n•Documented and streamlined Freeze Protection process for faster response \n•Managed Temporary Cooling on campus during the three week heat wave in 2006. This involved the rental of approximately 100 portable cooling units that were relocated multiple times, according to need, over the course of the crisis \n•Assisted with the integration of the HVAC, Preventive Maintenance shops into one group \n•Coordinated all travel and associated reimbursement \n•Processed all time card entries HVAC Administrative Associate Lands, Buildings and Real Estate, Stanford University October 2004  –  January 2008  (3 years 4 months) Stanford, CA •Provided administrative services for HVAC Supervisor, Leads and 30 Bargaining Unit technicians \n•Documented and streamlined Freeze Protection process for faster response \n•Managed Temporary Cooling on campus during the three week heat wave in 2006. This involved the rental of approximately 100 portable cooling units that were relocated multiple times, according to need, over the course of the crisis \n•Assisted with the integration of the HVAC, Preventive Maintenance shops into one group \n•Coordinated all travel and associated reimbursement \n•Processed all time card entries Fleet Garage Administrative Associate Lands, Buildings and Real Estate, Stanford University March 1999  –  October 2004  (5 years 8 months) Stanford, CA •Provided administrative services for Fleet Garage Supervisor, Leads and 11 Bargaining Unit technicians \n•Guided supervisor, and staff, through implementation of a new work order management system (FAMIS) \n•Coordinated the installation of first computerized fuel delivery/chip key system on campus and educated campus clients in the use of the new system \n•Facilitated the purchase of new vehicles by departments \n•Scheduled routine service for 500+ University owned vehicles \n•Coordinated fuel deliveries to campus pump stations \n•Coordinated all travel and associated reimbursement \n•Processed all time card entries Fleet Garage Administrative Associate Lands, Buildings and Real Estate, Stanford University March 1999  –  October 2004  (5 years 8 months) Stanford, CA •Provided administrative services for Fleet Garage Supervisor, Leads and 11 Bargaining Unit technicians \n•Guided supervisor, and staff, through implementation of a new work order management system (FAMIS) \n•Coordinated the installation of first computerized fuel delivery/chip key system on campus and educated campus clients in the use of the new system \n•Facilitated the purchase of new vehicles by departments \n•Scheduled routine service for 500+ University owned vehicles \n•Coordinated fuel deliveries to campus pump stations \n•Coordinated all travel and associated reimbursement \n•Processed all time card entries Electric Shop Administrative Associate Land, Buildings and Real Estate, Stanford University April 1996  –  March 1999  (3 years) Stanford, CA •Provided administrative services for Electric Shop Supervisor, Leads and 16 Bargaining Unit technicians \n•Processed payment for all materials used on jobs \n•Processed timecards and inventory materials charges \n•Coordinated all travel and associated reimbursement Electric Shop Administrative Associate Land, Buildings and Real Estate, Stanford University April 1996  –  March 1999  (3 years) Stanford, CA •Provided administrative services for Electric Shop Supervisor, Leads and 16 Bargaining Unit technicians \n•Processed payment for all materials used on jobs \n•Processed timecards and inventory materials charges \n•Coordinated all travel and associated reimbursement Dermatology Research Administrative Associate Stanford University School of Medicine October 1993  –  April 1996  (2 years 7 months) Stanford, CA •Assisted three research faculty members and their laboratories \n•Produced NIH grant applications, presentations, the department newsletter and other documents as needed \n•Maintained records of Continuing Medical Education credits and professional organization dues, etc \n•Coordinated all travel and associated reimbursement Dermatology Research Administrative Associate Stanford University School of Medicine October 1993  –  April 1996  (2 years 7 months) Stanford, CA •Assisted three research faculty members and their laboratories \n•Produced NIH grant applications, presentations, the department newsletter and other documents as needed \n•Maintained records of Continuing Medical Education credits and professional organization dues, etc \n•Coordinated all travel and associated reimbursement Skills Administrative... Administrative Office... Communication Outstanding verbal Creative Writing Customer Oriented Teamwork Work Well Independently Microsoft Office Dependable Team Player People-oriented Goal Oriented Public Speaking Microsoft Word Time Management Microsoft Excel PowerPoint Human Resources Project Coordination Event Planning Customer Service Management See 7+     See less Skills  Administrative... Administrative Office... Communication Outstanding verbal Creative Writing Customer Oriented Teamwork Work Well Independently Microsoft Office Dependable Team Player People-oriented Goal Oriented Public Speaking Microsoft Word Time Management Microsoft Excel PowerPoint Human Resources Project Coordination Event Planning Customer Service Management See 7+     See less Administrative... Administrative Office... Communication Outstanding verbal Creative Writing Customer Oriented Teamwork Work Well Independently Microsoft Office Dependable Team Player People-oriented Goal Oriented Public Speaking Microsoft Word Time Management Microsoft Excel PowerPoint Human Resources Project Coordination Event Planning Customer Service Management See 7+     See less Administrative... Administrative Office... Communication Outstanding verbal Creative Writing Customer Oriented Teamwork Work Well Independently Microsoft Office Dependable Team Player People-oriented Goal Oriented Public Speaking Microsoft Word Time Management Microsoft Excel PowerPoint Human Resources Project Coordination Event Planning Customer Service Management See 7+     See less Education Menlo College Bachelor of Arts (B.A.),  Business Management and Human Resources 2005  – 2007 Graduated Magna Cum Laude Menlo College Bachelor of Arts (B.A.),  Business Management and Human Resources 2005  – 2007 Graduated Magna Cum Laude Menlo College Bachelor of Arts (B.A.),  Business Management and Human Resources 2005  – 2007 Graduated Magna Cum Laude Menlo College Bachelor of Arts (B.A.),  Business Management and Human Resources 2005  – 2007 Graduated Magna Cum Laude ", "Experience Administrative Associate Stanford University January 2012  – Present (3 years 8 months) Office of Community Standards, (formerly, Judicial Affairs) Administrative Associate Stanford University August 2008  –  January 2012  (3 years 6 months) Office of Undergraduate Admissions Data Entry Clerk Stanford University January 2008  –  March 2008  (3 months) Office of Undergraduate Admissions Administrative Associate Stanford University January 2012  – Present (3 years 8 months) Office of Community Standards, (formerly, Judicial Affairs) Administrative Associate Stanford University January 2012  – Present (3 years 8 months) Office of Community Standards, (formerly, Judicial Affairs) Administrative Associate Stanford University August 2008  –  January 2012  (3 years 6 months) Office of Undergraduate Admissions Administrative Associate Stanford University August 2008  –  January 2012  (3 years 6 months) Office of Undergraduate Admissions Data Entry Clerk Stanford University January 2008  –  March 2008  (3 months) Office of Undergraduate Admissions Data Entry Clerk Stanford University January 2008  –  March 2008  (3 months) Office of Undergraduate Admissions ", "Experience Administrative Associate Stanford University September 2013  – Present (2 years) Stanford, CA Supporting the Office of Development and the Stanford Alumni Association as a member of the Alumni and Development Information Systems team, reporting to Rainer Bullinger, CIO. Administrative Associate Stanford University September 2013  – Present (2 years) Stanford, CA Supporting the Office of Development and the Stanford Alumni Association as a member of the Alumni and Development Information Systems team, reporting to Rainer Bullinger, CIO. Administrative Associate Stanford University September 2013  – Present (2 years) Stanford, CA Supporting the Office of Development and the Stanford Alumni Association as a member of the Alumni and Development Information Systems team, reporting to Rainer Bullinger, CIO. Languages French French French Skills Project Coordination Event Management Office Management Access Event Planning Non-profits Nonprofits Microsoft Excel Microsoft Office Entrepreneurship Skills  Project Coordination Event Management Office Management Access Event Planning Non-profits Nonprofits Microsoft Excel Microsoft Office Entrepreneurship Project Coordination Event Management Office Management Access Event Planning Non-profits Nonprofits Microsoft Excel Microsoft Office Entrepreneurship Project Coordination Event Management Office Management Access Event Planning Non-profits Nonprofits Microsoft Excel Microsoft Office Entrepreneurship Education Notre Dame de Namur University Master of Public Administration (MPA),  Public Administration 2014  – 2016 De Anza College French 2004  – 2006 University of California, Santa Cruz Anthropology and Women's Studies,  African Women ,  Race and Ethnicity in America 1995  – 2000 University of Ghana 1997  – 1998 Notre Dame de Namur University Master of Public Administration (MPA),  Public Administration 2014  – 2016 Notre Dame de Namur University Master of Public Administration (MPA),  Public Administration 2014  – 2016 Notre Dame de Namur University Master of Public Administration (MPA),  Public Administration 2014  – 2016 De Anza College French 2004  – 2006 De Anza College French 2004  – 2006 De Anza College French 2004  – 2006 University of California, Santa Cruz Anthropology and Women's Studies,  African Women ,  Race and Ethnicity in America 1995  – 2000 University of California, Santa Cruz Anthropology and Women's Studies,  African Women ,  Race and Ethnicity in America 1995  – 2000 University of California, Santa Cruz Anthropology and Women's Studies,  African Women ,  Race and Ethnicity in America 1995  – 2000 University of Ghana 1997  – 1998 University of Ghana 1997  – 1998 University of Ghana 1997  – 1998 "]}