{"position": "Administrative Assistant", "company": "Intel Corporation", "profiles": ["Skills PowerPoint Accounts Payable Accounts Receivable Invoicing Databases Telecommunications Vendor Management Customer Experience Call Centers Wireless Team Leadership Customer Service Team Building Cross-functional Team... Office Management Skills  PowerPoint Accounts Payable Accounts Receivable Invoicing Databases Telecommunications Vendor Management Customer Experience Call Centers Wireless Team Leadership Customer Service Team Building Cross-functional Team... Office Management PowerPoint Accounts Payable Accounts Receivable Invoicing Databases Telecommunications Vendor Management Customer Experience Call Centers Wireless Team Leadership Customer Service Team Building Cross-functional Team... Office Management PowerPoint Accounts Payable Accounts Receivable Invoicing Databases Telecommunications Vendor Management Customer Experience Call Centers Wireless Team Leadership Customer Service Team Building Cross-functional Team... Office Management ", "Summary • Strong and proactive team member in both individual contributor and people manager roles. Exemplary feedback from managers in individual contributor roles and from direct reports as a manager. \n• Demonstrated ability to follow through; take projects from concept to completion. \n• Proficient in all common office software; MS Office Suite including Outlook, Word, Excel, PowerPoint, SharePoint, several online meeting resources. Summary • Strong and proactive team member in both individual contributor and people manager roles. Exemplary feedback from managers in individual contributor roles and from direct reports as a manager. \n• Demonstrated ability to follow through; take projects from concept to completion. \n• Proficient in all common office software; MS Office Suite including Outlook, Word, Excel, PowerPoint, SharePoint, several online meeting resources. • Strong and proactive team member in both individual contributor and people manager roles. Exemplary feedback from managers in individual contributor roles and from direct reports as a manager. \n• Demonstrated ability to follow through; take projects from concept to completion. \n• Proficient in all common office software; MS Office Suite including Outlook, Word, Excel, PowerPoint, SharePoint, several online meeting resources. • Strong and proactive team member in both individual contributor and people manager roles. Exemplary feedback from managers in individual contributor roles and from direct reports as a manager. \n• Demonstrated ability to follow through; take projects from concept to completion. \n• Proficient in all common office software; MS Office Suite including Outlook, Word, Excel, PowerPoint, SharePoint, several online meeting resources. Experience Administrative Assistant Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Provide support for three directors in the Networking Division of the Internal Architecture Group. US Corporate Affairs Admin Intel Corporation February 2012  –  December 2013  (1 year 11 months) Hillsboro, OR Brought in as a contract worker, hired as a full-time permanent employee after three months to provide project management, budget tracking, grant administration, and general support services to three Executives: the US Region Director, NW Region Director, and US Teach Manager. Executive Assistant to the President and CEO Quantum-Group Consulting, Ltd. November 2009  –  February 2012  (2 years 4 months) Portland, Oregon Area Responsible for calendar management for high-energy Executive with complex domestic and international travel. Responsible for all travel arrangements including air/ground transportation and hotels. Managed workflow, light accounting, internet research, design and maintenance of the company web site. Executive Assistant to the President Cambridge Real Estate Services June 2009  –  November 2009  (6 months) Portland, Oregon Area Responsible for calendaring and travel. Created and coordinated written and verbal internal and external communications. Responsible for the corporate monthly newsletter including layout, content, editing, printing and e-distribution. Redesigned and maintained the company intranet for communication of company policies, procedures, manuals, brochures, news and information across four states. Responsible for planning corporate events including theme, venue, speakers, catering, equipment rentals and purchases. Executive Assistant to the President Maxtek January 2007  –  January 2009  (2 years 1 month) Beaverton Oregon Area Detail oriented position responsible for calendaring, travel and expense reporting. Managed company events including material preparation, site location and set-up, catering, sound and projection equipment operation. Responsible for final preparation of company confidential presentations to parent company. Managed small front office staff and budget. Executive Assistant to the Vice President Operations ESI July 1995  –  January 2007  (11 years 7 months) Portland, Oregon Area While at ESI my performance was consistently rated as superior with exemplary comments on technical skills. Awarded key contributor bonuses on a number of occasions. Assigned to several projects including coordinating move logistics for 300+ engineers and managers, co-lead team for development and implementation of intranet, created and implemented travel authorization process, saving the company $1M in 2002. \nResponsible for extensive calendaring; creating, editing and monitoring email and voicemail; complex domestic and international travel and expense reporting. Planned and executed division and corporate events. Responsible for assembly and distribution of PowerPoint presentation materials for internal and external senior management and Board of Directors. Responsible for final proof and posting of corporate press and earnings releases. Administrative Assistant Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Provide support for three directors in the Networking Division of the Internal Architecture Group. Administrative Assistant Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, OR Provide support for three directors in the Networking Division of the Internal Architecture Group. US Corporate Affairs Admin Intel Corporation February 2012  –  December 2013  (1 year 11 months) Hillsboro, OR Brought in as a contract worker, hired as a full-time permanent employee after three months to provide project management, budget tracking, grant administration, and general support services to three Executives: the US Region Director, NW Region Director, and US Teach Manager. US Corporate Affairs Admin Intel Corporation February 2012  –  December 2013  (1 year 11 months) Hillsboro, OR Brought in as a contract worker, hired as a full-time permanent employee after three months to provide project management, budget tracking, grant administration, and general support services to three Executives: the US Region Director, NW Region Director, and US Teach Manager. Executive Assistant to the President and CEO Quantum-Group Consulting, Ltd. November 2009  –  February 2012  (2 years 4 months) Portland, Oregon Area Responsible for calendar management for high-energy Executive with complex domestic and international travel. Responsible for all travel arrangements including air/ground transportation and hotels. Managed workflow, light accounting, internet research, design and maintenance of the company web site. Executive Assistant to the President and CEO Quantum-Group Consulting, Ltd. November 2009  –  February 2012  (2 years 4 months) Portland, Oregon Area Responsible for calendar management for high-energy Executive with complex domestic and international travel. Responsible for all travel arrangements including air/ground transportation and hotels. Managed workflow, light accounting, internet research, design and maintenance of the company web site. Executive Assistant to the President Cambridge Real Estate Services June 2009  –  November 2009  (6 months) Portland, Oregon Area Responsible for calendaring and travel. Created and coordinated written and verbal internal and external communications. Responsible for the corporate monthly newsletter including layout, content, editing, printing and e-distribution. Redesigned and maintained the company intranet for communication of company policies, procedures, manuals, brochures, news and information across four states. Responsible for planning corporate events including theme, venue, speakers, catering, equipment rentals and purchases. Executive Assistant to the President Cambridge Real Estate Services June 2009  –  November 2009  (6 months) Portland, Oregon Area Responsible for calendaring and travel. Created and coordinated written and verbal internal and external communications. Responsible for the corporate monthly newsletter including layout, content, editing, printing and e-distribution. Redesigned and maintained the company intranet for communication of company policies, procedures, manuals, brochures, news and information across four states. Responsible for planning corporate events including theme, venue, speakers, catering, equipment rentals and purchases. Executive Assistant to the President Maxtek January 2007  –  January 2009  (2 years 1 month) Beaverton Oregon Area Detail oriented position responsible for calendaring, travel and expense reporting. Managed company events including material preparation, site location and set-up, catering, sound and projection equipment operation. Responsible for final preparation of company confidential presentations to parent company. Managed small front office staff and budget. Executive Assistant to the President Maxtek January 2007  –  January 2009  (2 years 1 month) Beaverton Oregon Area Detail oriented position responsible for calendaring, travel and expense reporting. Managed company events including material preparation, site location and set-up, catering, sound and projection equipment operation. Responsible for final preparation of company confidential presentations to parent company. Managed small front office staff and budget. Executive Assistant to the Vice President Operations ESI July 1995  –  January 2007  (11 years 7 months) Portland, Oregon Area While at ESI my performance was consistently rated as superior with exemplary comments on technical skills. Awarded key contributor bonuses on a number of occasions. Assigned to several projects including coordinating move logistics for 300+ engineers and managers, co-lead team for development and implementation of intranet, created and implemented travel authorization process, saving the company $1M in 2002. \nResponsible for extensive calendaring; creating, editing and monitoring email and voicemail; complex domestic and international travel and expense reporting. Planned and executed division and corporate events. Responsible for assembly and distribution of PowerPoint presentation materials for internal and external senior management and Board of Directors. Responsible for final proof and posting of corporate press and earnings releases. Executive Assistant to the Vice President Operations ESI July 1995  –  January 2007  (11 years 7 months) Portland, Oregon Area While at ESI my performance was consistently rated as superior with exemplary comments on technical skills. Awarded key contributor bonuses on a number of occasions. Assigned to several projects including coordinating move logistics for 300+ engineers and managers, co-lead team for development and implementation of intranet, created and implemented travel authorization process, saving the company $1M in 2002. \nResponsible for extensive calendaring; creating, editing and monitoring email and voicemail; complex domestic and international travel and expense reporting. Planned and executed division and corporate events. Responsible for assembly and distribution of PowerPoint presentation materials for internal and external senior management and Board of Directors. Responsible for final proof and posting of corporate press and earnings releases. Skills Event Planning SharePoint Training Human Resources Confidentiality Product Marketing Project Management Microsoft Excel Access Management Administrative... SAP Budgets Analysis Skills  Event Planning SharePoint Training Human Resources Confidentiality Product Marketing Project Management Microsoft Excel Access Management Administrative... SAP Budgets Analysis Event Planning SharePoint Training Human Resources Confidentiality Product Marketing Project Management Microsoft Excel Access Management Administrative... SAP Budgets Analysis Event Planning SharePoint Training Human Resources Confidentiality Product Marketing Project Management Microsoft Excel Access Management Administrative... SAP Budgets Analysis Honors & Awards ", "Experience Bookeeper The Acting Company January 2012  – Present (3 years 8 months) Provide outside accounting service to non-profit organization. Manage all payable records timely and efficiently. Senior Administrative Assistant Intel Corporation August 2013  –  December 2013  (5 months) Administrative Assistant Intel Corporation August 2013  –  December 2013  (5 months) Folsom Provides excellent support to teams globally. Handles fast past multi-tasking well. Experienced with new hire and office setup processes. Coordinates the CW network for the GBS team including the outsourcing. Experienced with purchase order requests for Lab supplies, Software, and quarterly Contingent worker PO’s. Supports managers with the interview process of scheduling interview panels and candidate travel arrangments. \nOffice Management: Responsible for managing team administrative logistics for an Organization of over 200 Employees. Responsibilities included: meeting schedule and agenda management, Off-Site meetings coordination with Vendors and 3rd Party representative.  \nInventory Tracking: Responsible for managing on hand inventory of a multi GEO automation lab which comprised of hardware and software material. Responsibilities included: meeting with management, engineering department, support staff and managing milestone dates for the lab. \nEmployee Hiring Facilitator: Responsible for employee office setup and equipment maintenance, new employee orientation and training. Worked with management and engineering teams on employee hiring strategies for milestone upticks. \nTravel Logistics: Coordinate a travel calendar and arrangements for teams traveling domestically as well as internationally including but not limited to arranging flight itineraries, hotel stays and ground transportation. As well as assisting with the Visa and Passport process.  \nCommunication: Communicates effectively with multiple departments and teams. Established strong relationships with peers to gain support and effectively achieve results. Administrative Assistant Yuba College January 2012  –  August 2013  (1 year 8 months) Administrative Assistant Yuba College District Office of Foundation & Grants January 2012  –  January 2013  (1 year 1 month) Earned excellent marks on performance reviews, with citations for excellence in areas including work volume, accuracy and quality; ability to learn and master new concepts; positive work ethic; and commitment to providing unsurpassed service. \nOffice Management: Overhauled recordkeeping system from manual to computer-based, creating a user-friendly and systematic information management system and reducing data-retrieval time. \nTravel Logistics: Coordinate a travel calendar and arrangements for Executive Administrator \nCommunication: Communicated effectively with multiple departments. Established strong relationships to gain support and effectively achieve results. Administrative Assistant Newton Saw & Tool, Inc January 2005  –  January 2009  (4 years 1 month) Handled multifaceted, clerical tasks (e.g., data entry, filing, records management and billing) as the assistant to the Owners. Coordinated travel arrangements, maintained database and ensured the delivery of premium service to customers. Quickly became a trusted assistant known for “can-do” attitude, flexibility and high-quality work \nOffice Management: Entrusted to manage office in the owner/supervisor’s absence and prepared weekly bank deposits. \nCommunication: Provided timely, courteous and knowledgeable response to information requests; screened and transferred calls; Bookeeper The Acting Company January 2012  – Present (3 years 8 months) Provide outside accounting service to non-profit organization. Manage all payable records timely and efficiently. Bookeeper The Acting Company January 2012  – Present (3 years 8 months) Provide outside accounting service to non-profit organization. Manage all payable records timely and efficiently. Senior Administrative Assistant Intel Corporation August 2013  –  December 2013  (5 months) Senior Administrative Assistant Intel Corporation August 2013  –  December 2013  (5 months) Administrative Assistant Intel Corporation August 2013  –  December 2013  (5 months) Folsom Provides excellent support to teams globally. Handles fast past multi-tasking well. Experienced with new hire and office setup processes. Coordinates the CW network for the GBS team including the outsourcing. Experienced with purchase order requests for Lab supplies, Software, and quarterly Contingent worker PO’s. Supports managers with the interview process of scheduling interview panels and candidate travel arrangments. \nOffice Management: Responsible for managing team administrative logistics for an Organization of over 200 Employees. Responsibilities included: meeting schedule and agenda management, Off-Site meetings coordination with Vendors and 3rd Party representative.  \nInventory Tracking: Responsible for managing on hand inventory of a multi GEO automation lab which comprised of hardware and software material. Responsibilities included: meeting with management, engineering department, support staff and managing milestone dates for the lab. \nEmployee Hiring Facilitator: Responsible for employee office setup and equipment maintenance, new employee orientation and training. Worked with management and engineering teams on employee hiring strategies for milestone upticks. \nTravel Logistics: Coordinate a travel calendar and arrangements for teams traveling domestically as well as internationally including but not limited to arranging flight itineraries, hotel stays and ground transportation. As well as assisting with the Visa and Passport process.  \nCommunication: Communicates effectively with multiple departments and teams. Established strong relationships with peers to gain support and effectively achieve results. Administrative Assistant Intel Corporation August 2013  –  December 2013  (5 months) Folsom Provides excellent support to teams globally. Handles fast past multi-tasking well. Experienced with new hire and office setup processes. Coordinates the CW network for the GBS team including the outsourcing. Experienced with purchase order requests for Lab supplies, Software, and quarterly Contingent worker PO’s. Supports managers with the interview process of scheduling interview panels and candidate travel arrangments. \nOffice Management: Responsible for managing team administrative logistics for an Organization of over 200 Employees. Responsibilities included: meeting schedule and agenda management, Off-Site meetings coordination with Vendors and 3rd Party representative.  \nInventory Tracking: Responsible for managing on hand inventory of a multi GEO automation lab which comprised of hardware and software material. Responsibilities included: meeting with management, engineering department, support staff and managing milestone dates for the lab. \nEmployee Hiring Facilitator: Responsible for employee office setup and equipment maintenance, new employee orientation and training. Worked with management and engineering teams on employee hiring strategies for milestone upticks. \nTravel Logistics: Coordinate a travel calendar and arrangements for teams traveling domestically as well as internationally including but not limited to arranging flight itineraries, hotel stays and ground transportation. As well as assisting with the Visa and Passport process.  \nCommunication: Communicates effectively with multiple departments and teams. Established strong relationships with peers to gain support and effectively achieve results. Administrative Assistant Yuba College January 2012  –  August 2013  (1 year 8 months) Administrative Assistant Yuba College January 2012  –  August 2013  (1 year 8 months) Administrative Assistant Yuba College District Office of Foundation & Grants January 2012  –  January 2013  (1 year 1 month) Earned excellent marks on performance reviews, with citations for excellence in areas including work volume, accuracy and quality; ability to learn and master new concepts; positive work ethic; and commitment to providing unsurpassed service. \nOffice Management: Overhauled recordkeeping system from manual to computer-based, creating a user-friendly and systematic information management system and reducing data-retrieval time. \nTravel Logistics: Coordinate a travel calendar and arrangements for Executive Administrator \nCommunication: Communicated effectively with multiple departments. Established strong relationships to gain support and effectively achieve results. Administrative Assistant Yuba College District Office of Foundation & Grants January 2012  –  January 2013  (1 year 1 month) Earned excellent marks on performance reviews, with citations for excellence in areas including work volume, accuracy and quality; ability to learn and master new concepts; positive work ethic; and commitment to providing unsurpassed service. \nOffice Management: Overhauled recordkeeping system from manual to computer-based, creating a user-friendly and systematic information management system and reducing data-retrieval time. \nTravel Logistics: Coordinate a travel calendar and arrangements for Executive Administrator \nCommunication: Communicated effectively with multiple departments. Established strong relationships to gain support and effectively achieve results. Administrative Assistant Newton Saw & Tool, Inc January 2005  –  January 2009  (4 years 1 month) Handled multifaceted, clerical tasks (e.g., data entry, filing, records management and billing) as the assistant to the Owners. Coordinated travel arrangements, maintained database and ensured the delivery of premium service to customers. Quickly became a trusted assistant known for “can-do” attitude, flexibility and high-quality work \nOffice Management: Entrusted to manage office in the owner/supervisor’s absence and prepared weekly bank deposits. \nCommunication: Provided timely, courteous and knowledgeable response to information requests; screened and transferred calls; Administrative Assistant Newton Saw & Tool, Inc January 2005  –  January 2009  (4 years 1 month) Handled multifaceted, clerical tasks (e.g., data entry, filing, records management and billing) as the assistant to the Owners. Coordinated travel arrangements, maintained database and ensured the delivery of premium service to customers. Quickly became a trusted assistant known for “can-do” attitude, flexibility and high-quality work \nOffice Management: Entrusted to manage office in the owner/supervisor’s absence and prepared weekly bank deposits. \nCommunication: Provided timely, courteous and knowledgeable response to information requests; screened and transferred calls; Education Yuba College Associates of Science,  Business Administration 2011  – 2013 Yuba College Associates of Science,  Accounting 2011  – 2012 Completed 90-Units, with focus on business data processing, software applications, computerized accounting, financial accounting, managerial accounting, business communications and business law. Yuba College Associates of Science,  Business Administration 2011  – 2013 Yuba College Associates of Science,  Business Administration 2011  – 2013 Yuba College Associates of Science,  Business Administration 2011  – 2013 Yuba College Associates of Science,  Accounting 2011  – 2012 Completed 90-Units, with focus on business data processing, software applications, computerized accounting, financial accounting, managerial accounting, business communications and business law. Yuba College Associates of Science,  Accounting 2011  – 2012 Completed 90-Units, with focus on business data processing, software applications, computerized accounting, financial accounting, managerial accounting, business communications and business law. Yuba College Associates of Science,  Accounting 2011  – 2012 Completed 90-Units, with focus on business data processing, software applications, computerized accounting, financial accounting, managerial accounting, business communications and business law. ", "Experience Administrative Assistant Intel Corporation September 1999  – Present (16 years) Sr. Administrative Assistant Intel Corporation September 1999  – Present (16 years) Chandler, AZ Calendar management using Microsoft Outlook, travel arrangement (foreign and domestic), visa/passport processing, expense report processing, office supply procurement, mail distribution, purchase orders, special event coordination (both on and off-site/out of state). Have worked in marketing, engineering, finance, and HR depts. Personnel Technician United States Air Force January 1977  –  February 1997  (20 years 2 months) Administrative Assistant Intel Corporation September 1999  – Present (16 years) Administrative Assistant Intel Corporation September 1999  – Present (16 years) Sr. Administrative Assistant Intel Corporation September 1999  – Present (16 years) Chandler, AZ Calendar management using Microsoft Outlook, travel arrangement (foreign and domestic), visa/passport processing, expense report processing, office supply procurement, mail distribution, purchase orders, special event coordination (both on and off-site/out of state). Have worked in marketing, engineering, finance, and HR depts. Sr. Administrative Assistant Intel Corporation September 1999  – Present (16 years) Chandler, AZ Calendar management using Microsoft Outlook, travel arrangement (foreign and domestic), visa/passport processing, expense report processing, office supply procurement, mail distribution, purchase orders, special event coordination (both on and off-site/out of state). Have worked in marketing, engineering, finance, and HR depts. Personnel Technician United States Air Force January 1977  –  February 1997  (20 years 2 months) Personnel Technician United States Air Force January 1977  –  February 1997  (20 years 2 months) Skills Administrative Support Calendars PowerPoint Data Entry Fax Office Management Administration Expenses Problem Solving Teamwork Typing Research Windows Customer Relations Event Planning Adobe Acrobat Purchasing Coordination Database Administration Telephone Skills Prioritization SAP Internet Explorer Data Analysis Event Management Troubleshooting Team Oriented Administrative... Outlook Process Scheduler Office Administration Time Management Access Organization &... Administrative... Team-oriented See 21+     See less Skills  Administrative Support Calendars PowerPoint Data Entry Fax Office Management Administration Expenses Problem Solving Teamwork Typing Research Windows Customer Relations Event Planning Adobe Acrobat Purchasing Coordination Database Administration Telephone Skills Prioritization SAP Internet Explorer Data Analysis Event Management Troubleshooting Team Oriented Administrative... Outlook Process Scheduler Office Administration Time Management Access Organization &... Administrative... Team-oriented See 21+     See less Administrative Support Calendars PowerPoint Data Entry Fax Office Management Administration Expenses Problem Solving Teamwork Typing Research Windows Customer Relations Event Planning Adobe Acrobat Purchasing Coordination Database Administration Telephone Skills Prioritization SAP Internet Explorer Data Analysis Event Management Troubleshooting Team Oriented Administrative... Outlook Process Scheduler Office Administration Time Management Access Organization &... Administrative... Team-oriented See 21+     See less Administrative Support Calendars PowerPoint Data Entry Fax Office Management Administration Expenses Problem Solving Teamwork Typing Research Windows Customer Relations Event Planning Adobe Acrobat Purchasing Coordination Database Administration Telephone Skills Prioritization SAP Internet Explorer Data Analysis Event Management Troubleshooting Team Oriented Administrative... Outlook Process Scheduler Office Administration Time Management Access Organization &... Administrative... Team-oriented See 21+     See less Education Pierce College AA-General Office Mgmt 1997  – 1999 Pierce College AA-General Office Mgmt 1997  – 1999 Pierce College AA-General Office Mgmt 1997  – 1999 Pierce College AA-General Office Mgmt 1997  – 1999 ", "Experience Sr. Administrative Assistant Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Executive Administrative Assistant Intel Corporation / OnCue Verizon August 2013  – Present (2 years 1 month) Santa Clara, CA Administrative Coordinator Morrison & Foerster LLP June 2012  –  July 2013  (1 year 2 months) Administrative Assistant Cambridge Associates April 2008  –  May 2012  (4 years 2 months) Project Analyst Franklin Templeton Investments March 2007  –  April 2008  (1 year 2 months) Legal Secretary Law Offices of Gray & Prouty April 2005  –  October 2006  (1 year 7 months) South San Francisco, CA Administrative Assistant & Accounts Receivables Awender Chiropractic October 2000  –  April 2005  (4 years 7 months) Redwood City, CA Sr. Administrative Assistant Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Sr. Administrative Assistant Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Executive Administrative Assistant Intel Corporation / OnCue Verizon August 2013  – Present (2 years 1 month) Santa Clara, CA Executive Administrative Assistant Intel Corporation / OnCue Verizon August 2013  – Present (2 years 1 month) Santa Clara, CA Administrative Coordinator Morrison & Foerster LLP June 2012  –  July 2013  (1 year 2 months) Administrative Coordinator Morrison & Foerster LLP June 2012  –  July 2013  (1 year 2 months) Administrative Assistant Cambridge Associates April 2008  –  May 2012  (4 years 2 months) Administrative Assistant Cambridge Associates April 2008  –  May 2012  (4 years 2 months) Project Analyst Franklin Templeton Investments March 2007  –  April 2008  (1 year 2 months) Project Analyst Franklin Templeton Investments March 2007  –  April 2008  (1 year 2 months) Legal Secretary Law Offices of Gray & Prouty April 2005  –  October 2006  (1 year 7 months) South San Francisco, CA Legal Secretary Law Offices of Gray & Prouty April 2005  –  October 2006  (1 year 7 months) South San Francisco, CA Administrative Assistant & Accounts Receivables Awender Chiropractic October 2000  –  April 2005  (4 years 7 months) Redwood City, CA Administrative Assistant & Accounts Receivables Awender Chiropractic October 2000  –  April 2005  (4 years 7 months) Redwood City, CA Languages Polish Polish Polish Skills Administrative Work Administrative... Office Administration Executive... Administrative Functions General Administrative... Executive Level... Administrative Office... Human Resources Human Resource... Marketing Events Corporate Events Events Coordination Coordinating Events Events Organisation Managing Events Invoice Processing Expenses Expense Management Expense Reports Expense Allocation Meeting Planning Meeting Scheduling Leading Meetings Business Meetings Live Meeting Organizing Meetings Coordinate Meetings Microsoft Office Microsoft Excel Microsoft Word Spreadsheets Office Management Administrative... Administration See 21+     See less Skills  Administrative Work Administrative... Office Administration Executive... Administrative Functions General Administrative... Executive Level... Administrative Office... Human Resources Human Resource... Marketing Events Corporate Events Events Coordination Coordinating Events Events Organisation Managing Events Invoice Processing Expenses Expense Management Expense Reports Expense Allocation Meeting Planning Meeting Scheduling Leading Meetings Business Meetings Live Meeting Organizing Meetings Coordinate Meetings Microsoft Office Microsoft Excel Microsoft Word Spreadsheets Office Management Administrative... Administration See 21+     See less Administrative Work Administrative... Office Administration Executive... Administrative Functions General Administrative... Executive Level... Administrative Office... Human Resources Human Resource... Marketing Events Corporate Events Events Coordination Coordinating Events Events Organisation Managing Events Invoice Processing Expenses Expense Management Expense Reports Expense Allocation Meeting Planning Meeting Scheduling Leading Meetings Business Meetings Live Meeting Organizing Meetings Coordinate Meetings Microsoft Office Microsoft Excel Microsoft Word Spreadsheets Office Management Administrative... Administration See 21+     See less Administrative Work Administrative... Office Administration Executive... Administrative Functions General Administrative... Executive Level... Administrative Office... Human Resources Human Resource... Marketing Events Corporate Events Events Coordination Coordinating Events Events Organisation Managing Events Invoice Processing Expenses Expense Management Expense Reports Expense Allocation Meeting Planning Meeting Scheduling Leading Meetings Business Meetings Live Meeting Organizing Meetings Coordinate Meetings Microsoft Office Microsoft Excel Microsoft Word Spreadsheets Office Management Administrative... Administration See 21+     See less Education San Jose State University Bachelor of Science (B.S.) 2011  – 2013 College of San Mateo Associate of Science (A.S.) 2008  – 2011 Hillsdale High School San Jose State University Bachelor of Science (B.S.) 2011  – 2013 San Jose State University Bachelor of Science (B.S.) 2011  – 2013 San Jose State University Bachelor of Science (B.S.) 2011  – 2013 College of San Mateo Associate of Science (A.S.) 2008  – 2011 College of San Mateo Associate of Science (A.S.) 2008  – 2011 College of San Mateo Associate of Science (A.S.) 2008  – 2011 Hillsdale High School Hillsdale High School Hillsdale High School ", "Experience Sr Administrative Assistant Intel Corporation February 2011  – Present (4 years 7 months) Hillsboro, OR Sales Coordinator / Office Administrator ViaWest February 2010  –  February 2011  (1 year 1 month) Sr Administrative Assistant Intel Corporation July 1995  –  October 1998  (3 years 4 months) Sr Administrative Assistant Intel Corporation February 2011  – Present (4 years 7 months) Hillsboro, OR Sr Administrative Assistant Intel Corporation February 2011  – Present (4 years 7 months) Hillsboro, OR Sales Coordinator / Office Administrator ViaWest February 2010  –  February 2011  (1 year 1 month) Sales Coordinator / Office Administrator ViaWest February 2010  –  February 2011  (1 year 1 month) Sr Administrative Assistant Intel Corporation July 1995  –  October 1998  (3 years 4 months) Sr Administrative Assistant Intel Corporation July 1995  –  October 1998  (3 years 4 months) Skills Account Management System Administration Management Managed Hosting Troubleshooting Salesforce.com Windows Time Management Program Management Networking Data Center Software Documentation Vendor Management Process Improvement Sales Team Building Cloud Computing See 2+     See less Skills  Account Management System Administration Management Managed Hosting Troubleshooting Salesforce.com Windows Time Management Program Management Networking Data Center Software Documentation Vendor Management Process Improvement Sales Team Building Cloud Computing See 2+     See less Account Management System Administration Management Managed Hosting Troubleshooting Salesforce.com Windows Time Management Program Management Networking Data Center Software Documentation Vendor Management Process Improvement Sales Team Building Cloud Computing See 2+     See less Account Management System Administration Management Managed Hosting Troubleshooting Salesforce.com Windows Time Management Program Management Networking Data Center Software Documentation Vendor Management Process Improvement Sales Team Building Cloud Computing See 2+     See less ", "Summary Updated June 2013: I have enjoying working at Intel intermittently in an administrative capacity over the past 20 years, and for 5 years in Washington, D.C. for several state representatives. I also have experience in college admissions and property management. Summary Updated June 2013: I have enjoying working at Intel intermittently in an administrative capacity over the past 20 years, and for 5 years in Washington, D.C. for several state representatives. I also have experience in college admissions and property management. Updated June 2013: I have enjoying working at Intel intermittently in an administrative capacity over the past 20 years, and for 5 years in Washington, D.C. for several state representatives. I also have experience in college admissions and property management. Updated June 2013: I have enjoying working at Intel intermittently in an administrative capacity over the past 20 years, and for 5 years in Washington, D.C. for several state representatives. I also have experience in college admissions and property management. Experience Sr. Administrative Assistant Intel Corporation February 2010  – Present (5 years 7 months) Sr. Administrative Assistant to Tom Marieb, the Director of TD/Mfg Q&R. Responsible for maintaining Director's calendar; scheduling meetings and events; travel arrangements; project management; monthly reports; managing special projects and volunteer team events. Sr. Administrative Assistant Intel Corporation July 2008  –  September 2009  (1 year 3 months) Sr. Administrative Assistant Intel Corporation February 2010  – Present (5 years 7 months) Sr. Administrative Assistant to Tom Marieb, the Director of TD/Mfg Q&R. Responsible for maintaining Director's calendar; scheduling meetings and events; travel arrangements; project management; monthly reports; managing special projects and volunteer team events. Sr. Administrative Assistant Intel Corporation February 2010  – Present (5 years 7 months) Sr. Administrative Assistant to Tom Marieb, the Director of TD/Mfg Q&R. Responsible for maintaining Director's calendar; scheduling meetings and events; travel arrangements; project management; monthly reports; managing special projects and volunteer team events. Sr. Administrative Assistant Intel Corporation July 2008  –  September 2009  (1 year 3 months) Sr. Administrative Assistant Intel Corporation July 2008  –  September 2009  (1 year 3 months) Skills Project Management Time Management Outlook Team Building Microsoft Word Program Management PowerPoint Customer Service Management Teaching Microsoft Excel Teamwork Logistics SharePoint Microsoft Office Skills  Project Management Time Management Outlook Team Building Microsoft Word Program Management PowerPoint Customer Service Management Teaching Microsoft Excel Teamwork Logistics SharePoint Microsoft Office Project Management Time Management Outlook Team Building Microsoft Word Program Management PowerPoint Customer Service Management Teaching Microsoft Excel Teamwork Logistics SharePoint Microsoft Office Project Management Time Management Outlook Team Building Microsoft Word Program Management PowerPoint Customer Service Management Teaching Microsoft Excel Teamwork Logistics SharePoint Microsoft Office Education University of Phoenix Master of Art,  Management - Human Relations & Organizational Behavior 1988  – 1990 Activities and Societies:  Coordinator for annual graduation ceremonies University of Phoenix Master of Art,  Management - Human Relations & Organizational Behavior 1988  – 1990 Activities and Societies:  Coordinator for annual graduation ceremonies University of Phoenix Master of Art,  Management - Human Relations & Organizational Behavior 1988  – 1990 Activities and Societies:  Coordinator for annual graduation ceremonies University of Phoenix Master of Art,  Management - Human Relations & Organizational Behavior 1988  – 1990 Activities and Societies:  Coordinator for annual graduation ceremonies ", "Experience Administrative Assistant Intel Corporation August 2011  – Present (4 years 1 month) Hillsboro, Oregon Administrative Assistant. Cal Lab Administrative Assistant Intel Corporation June 2011  –  September 2011  (4 months) Administrative Assistant Salem Engineering Group, Inc. February 2011  –  May 2011  (4 months) Construction Inspection Administrative Assistant Moore Twining Associates, Inc. December 2006  –  February 2011  (4 years 3 months) Administrative Assistant Krazan & Associates, Inc. August 2005  –  December 2006  (1 year 5 months) Administrative Assistant Manpower Inc. November 2004  –  August 2005  (10 months) Business Analyst Intel August 2000  –  September 2003  (3 years 2 months) Administrative Assistant Intel Corporation August 2011  – Present (4 years 1 month) Hillsboro, Oregon Administrative Assistant. Administrative Assistant Intel Corporation August 2011  – Present (4 years 1 month) Hillsboro, Oregon Administrative Assistant. Cal Lab Administrative Assistant Intel Corporation June 2011  –  September 2011  (4 months) Cal Lab Administrative Assistant Intel Corporation June 2011  –  September 2011  (4 months) Administrative Assistant Salem Engineering Group, Inc. February 2011  –  May 2011  (4 months) Administrative Assistant Salem Engineering Group, Inc. February 2011  –  May 2011  (4 months) Construction Inspection Administrative Assistant Moore Twining Associates, Inc. December 2006  –  February 2011  (4 years 3 months) Construction Inspection Administrative Assistant Moore Twining Associates, Inc. December 2006  –  February 2011  (4 years 3 months) Administrative Assistant Krazan & Associates, Inc. August 2005  –  December 2006  (1 year 5 months) Administrative Assistant Krazan & Associates, Inc. August 2005  –  December 2006  (1 year 5 months) Administrative Assistant Manpower Inc. November 2004  –  August 2005  (10 months) Administrative Assistant Manpower Inc. November 2004  –  August 2005  (10 months) Business Analyst Intel August 2000  –  September 2003  (3 years 2 months) Business Analyst Intel August 2000  –  September 2003  (3 years 2 months) Skills Administrative... Online Research Calendars Data Entry Spreadsheets SharePoint Business Travel Expenses Lotus Notes Microsoft Office Customer Service Microsoft Word Microsoft Excel PowerPoint Contract Management Program Management Access Event Management Teamwork Process Scheduler Administrative... Office Management Calendaring See 8+     See less Skills  Administrative... Online Research Calendars Data Entry Spreadsheets SharePoint Business Travel Expenses Lotus Notes Microsoft Office Customer Service Microsoft Word Microsoft Excel PowerPoint Contract Management Program Management Access Event Management Teamwork Process Scheduler Administrative... Office Management Calendaring See 8+     See less Administrative... Online Research Calendars Data Entry Spreadsheets SharePoint Business Travel Expenses Lotus Notes Microsoft Office Customer Service Microsoft Word Microsoft Excel PowerPoint Contract Management Program Management Access Event Management Teamwork Process Scheduler Administrative... Office Management Calendaring See 8+     See less Administrative... Online Research Calendars Data Entry Spreadsheets SharePoint Business Travel Expenses Lotus Notes Microsoft Office Customer Service Microsoft Word Microsoft Excel PowerPoint Contract Management Program Management Access Event Management Teamwork Process Scheduler Administrative... Office Management Calendaring See 8+     See less Education Portland Community College Computer Applications and Office Systems , A 2013  – 2015 Portland Community College Computer Applications and Office Systems , A 2013  – 2015 Portland Community College Computer Applications and Office Systems , A 2013  – 2015 Portland Community College Computer Applications and Office Systems , A 2013  – 2015 ", "Experience Sr. Administrative Assistant Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon Sr. Administrative Assistant in the Data Center Group (DCG) Program office supporting the Business Executive Technical Adviser and the DCG GM Executive Assistant. Responsible for heavy calendaring, complex meeting arrangements, domestic and international travel, event coordination, operational tasks. Interacts daily with customers and internal execs. Excellent communication skills, strong strategic thinker, proven program management skills and able to perform with little direction. Sr Administrative Assistant Intel Corporation August 2009  –  September 2014  (5 years 2 months) Hillsboro, Oregon Currently Sr. Administrative Assistant in the Datacenter Software Division supporting the VP and other members of his staff. Responsible for heavy calendaring, complex travel, event coordination, Admin team lead, operational tasks, etc. Interacts daily with customers and internal execs. Excellent communication skills, strong strategic thinker, proven program management skills and able to perform with little direction. Previously provided admin support to the VP of the Visual Products Group. Members Services Manager WiMAX Forum July 2006  –  August 2009  (3 years 2 months) As the Membership Services Manager I was responsible for Membership Growth for the WiMAX Forum, including defining a business plan to reach yearly goals, renewal calls, membership application reviews for submission to the Board of Directors, new member assimilation into the WiMAX Forum, value prop collateral development associated with membership, monthly newsletters, registration for three yearly membership conferences, and providing data for the various working groups, members and board. Attended and manned booths at several trade shows and events world wide. Provided detailed and accurate forecasts on membership growth trends. I provided a high degree of attention to detail, set up systems and processes around the various tasks associated with the role, and provided a high level of customer support to the members of the WiMax Forum. Also hired and acted as supervisor to the Office Manager. Sr. Administrative Assistant Intel Corporation September 1988  –  July 2006  (17 years 11 months) Hillsboro, OR From 1985 thru 1992, I was an admin assistant in Staffing supporting Internal Transfers, College Recruiting, and the Summer Internship Program. In 1992 I moved to the Test Develpment Engineering group, providing admin support for a large engineering team which included calendar and travel support for three managers. I also acted as TDE Lab Manger for two years. Duties also included interview and hiring support, webdsite management, purchasing, and other general admin duties. In 1996 I became the Sr. Administrative Assistant supporting the GM of Systems Manufacturing and Technology Development I supported the GM and his Biz Ops manager, lead an admin team of 15, was the co-webmaster for our organization, chaired safety committee meetings, and was highly involved in event planning.. In 2004, I moved on to support the VP of the Mobile Communications Group. I supported the VP and his biz ops manager, co-lead a cross site admin team of 20. Sr. Administrative Assistant Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon Sr. Administrative Assistant in the Data Center Group (DCG) Program office supporting the Business Executive Technical Adviser and the DCG GM Executive Assistant. Responsible for heavy calendaring, complex meeting arrangements, domestic and international travel, event coordination, operational tasks. Interacts daily with customers and internal execs. Excellent communication skills, strong strategic thinker, proven program management skills and able to perform with little direction. Sr. Administrative Assistant Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon Sr. Administrative Assistant in the Data Center Group (DCG) Program office supporting the Business Executive Technical Adviser and the DCG GM Executive Assistant. Responsible for heavy calendaring, complex meeting arrangements, domestic and international travel, event coordination, operational tasks. Interacts daily with customers and internal execs. Excellent communication skills, strong strategic thinker, proven program management skills and able to perform with little direction. Sr Administrative Assistant Intel Corporation August 2009  –  September 2014  (5 years 2 months) Hillsboro, Oregon Currently Sr. Administrative Assistant in the Datacenter Software Division supporting the VP and other members of his staff. Responsible for heavy calendaring, complex travel, event coordination, Admin team lead, operational tasks, etc. Interacts daily with customers and internal execs. Excellent communication skills, strong strategic thinker, proven program management skills and able to perform with little direction. Previously provided admin support to the VP of the Visual Products Group. Sr Administrative Assistant Intel Corporation August 2009  –  September 2014  (5 years 2 months) Hillsboro, Oregon Currently Sr. Administrative Assistant in the Datacenter Software Division supporting the VP and other members of his staff. Responsible for heavy calendaring, complex travel, event coordination, Admin team lead, operational tasks, etc. Interacts daily with customers and internal execs. Excellent communication skills, strong strategic thinker, proven program management skills and able to perform with little direction. Previously provided admin support to the VP of the Visual Products Group. Members Services Manager WiMAX Forum July 2006  –  August 2009  (3 years 2 months) As the Membership Services Manager I was responsible for Membership Growth for the WiMAX Forum, including defining a business plan to reach yearly goals, renewal calls, membership application reviews for submission to the Board of Directors, new member assimilation into the WiMAX Forum, value prop collateral development associated with membership, monthly newsletters, registration for three yearly membership conferences, and providing data for the various working groups, members and board. Attended and manned booths at several trade shows and events world wide. Provided detailed and accurate forecasts on membership growth trends. I provided a high degree of attention to detail, set up systems and processes around the various tasks associated with the role, and provided a high level of customer support to the members of the WiMax Forum. Also hired and acted as supervisor to the Office Manager. Members Services Manager WiMAX Forum July 2006  –  August 2009  (3 years 2 months) As the Membership Services Manager I was responsible for Membership Growth for the WiMAX Forum, including defining a business plan to reach yearly goals, renewal calls, membership application reviews for submission to the Board of Directors, new member assimilation into the WiMAX Forum, value prop collateral development associated with membership, monthly newsletters, registration for three yearly membership conferences, and providing data for the various working groups, members and board. Attended and manned booths at several trade shows and events world wide. Provided detailed and accurate forecasts on membership growth trends. I provided a high degree of attention to detail, set up systems and processes around the various tasks associated with the role, and provided a high level of customer support to the members of the WiMax Forum. Also hired and acted as supervisor to the Office Manager. Sr. Administrative Assistant Intel Corporation September 1988  –  July 2006  (17 years 11 months) Hillsboro, OR From 1985 thru 1992, I was an admin assistant in Staffing supporting Internal Transfers, College Recruiting, and the Summer Internship Program. In 1992 I moved to the Test Develpment Engineering group, providing admin support for a large engineering team which included calendar and travel support for three managers. I also acted as TDE Lab Manger for two years. Duties also included interview and hiring support, webdsite management, purchasing, and other general admin duties. In 1996 I became the Sr. Administrative Assistant supporting the GM of Systems Manufacturing and Technology Development I supported the GM and his Biz Ops manager, lead an admin team of 15, was the co-webmaster for our organization, chaired safety committee meetings, and was highly involved in event planning.. In 2004, I moved on to support the VP of the Mobile Communications Group. I supported the VP and his biz ops manager, co-lead a cross site admin team of 20. Sr. Administrative Assistant Intel Corporation September 1988  –  July 2006  (17 years 11 months) Hillsboro, OR From 1985 thru 1992, I was an admin assistant in Staffing supporting Internal Transfers, College Recruiting, and the Summer Internship Program. In 1992 I moved to the Test Develpment Engineering group, providing admin support for a large engineering team which included calendar and travel support for three managers. I also acted as TDE Lab Manger for two years. Duties also included interview and hiring support, webdsite management, purchasing, and other general admin duties. In 1996 I became the Sr. Administrative Assistant supporting the GM of Systems Manufacturing and Technology Development I supported the GM and his Biz Ops manager, lead an admin team of 15, was the co-webmaster for our organization, chaired safety committee meetings, and was highly involved in event planning.. In 2004, I moved on to support the VP of the Mobile Communications Group. I supported the VP and his biz ops manager, co-lead a cross site admin team of 20. Skills Outlook Windows PowerPoint Microsoft Word Microsoft Excel Customer Service English Research HTML Public Speaking Marketing Program Management Project Management Event Planning Management Leadership Cross-functional Team... Process Improvement Product Marketing Product Management Microsoft Office See 6+     See less Skills  Outlook Windows PowerPoint Microsoft Word Microsoft Excel Customer Service English Research HTML Public Speaking Marketing Program Management Project Management Event Planning Management Leadership Cross-functional Team... Process Improvement Product Marketing Product Management Microsoft Office See 6+     See less Outlook Windows PowerPoint Microsoft Word Microsoft Excel Customer Service English Research HTML Public Speaking Marketing Program Management Project Management Event Planning Management Leadership Cross-functional Team... Process Improvement Product Marketing Product Management Microsoft Office See 6+     See less Outlook Windows PowerPoint Microsoft Word Microsoft Excel Customer Service English Research HTML Public Speaking Marketing Program Management Project Management Event Planning Management Leadership Cross-functional Team... Process Improvement Product Marketing Product Management Microsoft Office See 6+     See less Education Hillsboro High School Highschool Diploma 1976  – 1978 Was the Feature Editor for Hill Hilites, performed in several school plays, active in the Future Teachers of America club, tutored other students in English and Math. Activities and Societies:  Future Teachers of America ,  Honor Roll Student (graduated top 10% in Oregon) ,  Member of the Thespians ,  Features Editor of the School newspaper Hillsboro High School Highschool Diploma 1976  – 1978 Was the Feature Editor for Hill Hilites, performed in several school plays, active in the Future Teachers of America club, tutored other students in English and Math. Activities and Societies:  Future Teachers of America ,  Honor Roll Student (graduated top 10% in Oregon) ,  Member of the Thespians ,  Features Editor of the School newspaper Hillsboro High School Highschool Diploma 1976  – 1978 Was the Feature Editor for Hill Hilites, performed in several school plays, active in the Future Teachers of America club, tutored other students in English and Math. Activities and Societies:  Future Teachers of America ,  Honor Roll Student (graduated top 10% in Oregon) ,  Member of the Thespians ,  Features Editor of the School newspaper Hillsboro High School Highschool Diploma 1976  – 1978 Was the Feature Editor for Hill Hilites, performed in several school plays, active in the Future Teachers of America club, tutored other students in English and Math. Activities and Societies:  Future Teachers of America ,  Honor Roll Student (graduated top 10% in Oregon) ,  Member of the Thespians ,  Features Editor of the School newspaper ", "Experience Senior Administrative Assistant Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon Administrative Assistant Intel Corporation April 2008  –  July 2013  (5 years 4 months) Hillsboro, Oregon Administrative assistant for the Director of Cloud Computing Marketing, Director of Datacenter Marketing Operations and the Director of Mission Critical Marketing and their direct line staff. Cordination of meetings for senior level Intel executives as well as external executive management. Office Support Specialist II Oregon State Police Medical Examiner’s Office December 2007  –  April 2008  (5 months) Clackamas, Oregon Supported the Oregon State Medical Examiner and Forensic Administrator. Responsible for records requests for families, government agencies, county medical examiners/physicians & hospitals, law firms and insurance companies nationwide. Maintain filing system including autopsy, toxicology and medical examiner reports. Assist the Forensic Administrator with travel expense reports, fiscal billing and the on-call schedules. Cross-trained on death certificates, report amendments, deposits and file archives Legal Secretary Preston Bunnell & Flynn, LLP June 2004  –  December 2006  (2 years 7 months) Portland, Oregon Provided assistance to Partner and Of-Council Attorneys. Drafted complaints and summons. Transcribed legal proceedings. Composed dictation letters. Created new client databases/files. Set appointments for attorneys with opposing council, judges, medical professionals, and clients. Retrieved and coordinated medical records Content Coordinator Microsoft Corporation January 2001  –  January 2002  (1 year 1 month) Tigard, Oregon Managed production of technical specifications of network hardware for development into Microsoft products. Projects included coordinating manufacturers to submit proper specifications of hardware for product description, physical dimension, data and digital images. Packaged specifications and shipped to developers, processed returns, forwarded completed solutions to development staff. Senior Administrative Assistant Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon Senior Administrative Assistant Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, Oregon Administrative Assistant Intel Corporation April 2008  –  July 2013  (5 years 4 months) Hillsboro, Oregon Administrative assistant for the Director of Cloud Computing Marketing, Director of Datacenter Marketing Operations and the Director of Mission Critical Marketing and their direct line staff. Cordination of meetings for senior level Intel executives as well as external executive management. Administrative Assistant Intel Corporation April 2008  –  July 2013  (5 years 4 months) Hillsboro, Oregon Administrative assistant for the Director of Cloud Computing Marketing, Director of Datacenter Marketing Operations and the Director of Mission Critical Marketing and their direct line staff. Cordination of meetings for senior level Intel executives as well as external executive management. Office Support Specialist II Oregon State Police Medical Examiner’s Office December 2007  –  April 2008  (5 months) Clackamas, Oregon Supported the Oregon State Medical Examiner and Forensic Administrator. Responsible for records requests for families, government agencies, county medical examiners/physicians & hospitals, law firms and insurance companies nationwide. Maintain filing system including autopsy, toxicology and medical examiner reports. Assist the Forensic Administrator with travel expense reports, fiscal billing and the on-call schedules. Cross-trained on death certificates, report amendments, deposits and file archives Office Support Specialist II Oregon State Police Medical Examiner’s Office December 2007  –  April 2008  (5 months) Clackamas, Oregon Supported the Oregon State Medical Examiner and Forensic Administrator. Responsible for records requests for families, government agencies, county medical examiners/physicians & hospitals, law firms and insurance companies nationwide. Maintain filing system including autopsy, toxicology and medical examiner reports. Assist the Forensic Administrator with travel expense reports, fiscal billing and the on-call schedules. Cross-trained on death certificates, report amendments, deposits and file archives Legal Secretary Preston Bunnell & Flynn, LLP June 2004  –  December 2006  (2 years 7 months) Portland, Oregon Provided assistance to Partner and Of-Council Attorneys. Drafted complaints and summons. Transcribed legal proceedings. Composed dictation letters. Created new client databases/files. Set appointments for attorneys with opposing council, judges, medical professionals, and clients. Retrieved and coordinated medical records Legal Secretary Preston Bunnell & Flynn, LLP June 2004  –  December 2006  (2 years 7 months) Portland, Oregon Provided assistance to Partner and Of-Council Attorneys. Drafted complaints and summons. Transcribed legal proceedings. Composed dictation letters. Created new client databases/files. Set appointments for attorneys with opposing council, judges, medical professionals, and clients. Retrieved and coordinated medical records Content Coordinator Microsoft Corporation January 2001  –  January 2002  (1 year 1 month) Tigard, Oregon Managed production of technical specifications of network hardware for development into Microsoft products. Projects included coordinating manufacturers to submit proper specifications of hardware for product description, physical dimension, data and digital images. Packaged specifications and shipped to developers, processed returns, forwarded completed solutions to development staff. Content Coordinator Microsoft Corporation January 2001  –  January 2002  (1 year 1 month) Tigard, Oregon Managed production of technical specifications of network hardware for development into Microsoft products. Projects included coordinating manufacturers to submit proper specifications of hardware for product description, physical dimension, data and digital images. Packaged specifications and shipped to developers, processed returns, forwarded completed solutions to development staff. Skills Office Management Marketing Project Management Team Leadership Senior Administration Events Coordination Positive Team Player Organization &... Cross-functional Team... Legal Administration Management Skills  Office Management Marketing Project Management Team Leadership Senior Administration Events Coordination Positive Team Player Organization &... Cross-functional Team... Legal Administration Management Office Management Marketing Project Management Team Leadership Senior Administration Events Coordination Positive Team Player Organization &... Cross-functional Team... Legal Administration Management Office Management Marketing Project Management Team Leadership Senior Administration Events Coordination Positive Team Player Organization &... Cross-functional Team... Legal Administration Management Education Western Business College Associate of Applied Science,  Paralegal 2003  – 2005 Franklin College General Studies 1999  – 2000 Activities and Societies:  Pi Beta Phi Western Business College Associate of Applied Science,  Paralegal 2003  – 2005 Western Business College Associate of Applied Science,  Paralegal 2003  – 2005 Western Business College Associate of Applied Science,  Paralegal 2003  – 2005 Franklin College General Studies 1999  – 2000 Activities and Societies:  Pi Beta Phi Franklin College General Studies 1999  – 2000 Activities and Societies:  Pi Beta Phi Franklin College General Studies 1999  – 2000 Activities and Societies:  Pi Beta Phi ", "Experience Sr. Administrative Assistant Intel Corporation April 2011  – Present (4 years 5 months) Administrative Assistant to VP in Intel Labs, Director of Security and Privacy Research Youth Minister Life Teen 2013  –  2015  (2 years) St John Fisher Support and guide youth under the direction of the youth Director: in discussions and primarily in service to the community. Parent Involved Beaverton School District 2001  –  2014  (13 years) Executive Assistant / Office Manager SpectraWatt Inc. December 2008  –  January 2011  (2 years 2 months) Primary support for the: CEO, CFO, COO, VP of Business Development and HR. Sr Admninistrative Assistant Nike April 2007  –  2008  (1 year) Worked for Asia Pacific HR Director and team as well as supporting the Asia Pacific Strategic Planning Director / Asia Pacific Kids Manager. Sr Administrative Assistant Intel Corporation May 2000  –  April 2007  (7 years) Sr. Administrator for the Director of Education and three Sr./Directors: international and domestic travel arrangements; VISA acquisitions; event planning (logistics, procure hotel, catering, and meeting space): large groups including worldwide counterparts as well as annual Higher Ed PhD Forum and Fellowship Forums System Information Manager (strong customer service base) Nordstrom March 1981  –  March 2000  (19 years 1 month) Managed store inventory level/loss prevention \nAssistant Store Manager - Assisted in daily activities in retail: inventory control; worked closely with HR regarding employee issues; maintained seamless environment to the customer; OSHA Rep for the store; Store event coordinator \nAssistant Buyer/Assistant Merchandiser- train new buyers on Open to Buy(OTB); report recognized trends to Buyer and Merchandiser Sr. Administrative Assistant Intel Corporation April 2011  – Present (4 years 5 months) Administrative Assistant to VP in Intel Labs, Director of Security and Privacy Research Sr. Administrative Assistant Intel Corporation April 2011  – Present (4 years 5 months) Administrative Assistant to VP in Intel Labs, Director of Security and Privacy Research Youth Minister Life Teen 2013  –  2015  (2 years) St John Fisher Support and guide youth under the direction of the youth Director: in discussions and primarily in service to the community. Youth Minister Life Teen 2013  –  2015  (2 years) St John Fisher Support and guide youth under the direction of the youth Director: in discussions and primarily in service to the community. Parent Involved Beaverton School District 2001  –  2014  (13 years) Parent Involved Beaverton School District 2001  –  2014  (13 years) Executive Assistant / Office Manager SpectraWatt Inc. December 2008  –  January 2011  (2 years 2 months) Primary support for the: CEO, CFO, COO, VP of Business Development and HR. Executive Assistant / Office Manager SpectraWatt Inc. December 2008  –  January 2011  (2 years 2 months) Primary support for the: CEO, CFO, COO, VP of Business Development and HR. Sr Admninistrative Assistant Nike April 2007  –  2008  (1 year) Worked for Asia Pacific HR Director and team as well as supporting the Asia Pacific Strategic Planning Director / Asia Pacific Kids Manager. Sr Admninistrative Assistant Nike April 2007  –  2008  (1 year) Worked for Asia Pacific HR Director and team as well as supporting the Asia Pacific Strategic Planning Director / Asia Pacific Kids Manager. Sr Administrative Assistant Intel Corporation May 2000  –  April 2007  (7 years) Sr. Administrator for the Director of Education and three Sr./Directors: international and domestic travel arrangements; VISA acquisitions; event planning (logistics, procure hotel, catering, and meeting space): large groups including worldwide counterparts as well as annual Higher Ed PhD Forum and Fellowship Forums Sr Administrative Assistant Intel Corporation May 2000  –  April 2007  (7 years) Sr. Administrator for the Director of Education and three Sr./Directors: international and domestic travel arrangements; VISA acquisitions; event planning (logistics, procure hotel, catering, and meeting space): large groups including worldwide counterparts as well as annual Higher Ed PhD Forum and Fellowship Forums System Information Manager (strong customer service base) Nordstrom March 1981  –  March 2000  (19 years 1 month) Managed store inventory level/loss prevention \nAssistant Store Manager - Assisted in daily activities in retail: inventory control; worked closely with HR regarding employee issues; maintained seamless environment to the customer; OSHA Rep for the store; Store event coordinator \nAssistant Buyer/Assistant Merchandiser- train new buyers on Open to Buy(OTB); report recognized trends to Buyer and Merchandiser System Information Manager (strong customer service base) Nordstrom March 1981  –  March 2000  (19 years 1 month) Managed store inventory level/loss prevention \nAssistant Store Manager - Assisted in daily activities in retail: inventory control; worked closely with HR regarding employee issues; maintained seamless environment to the customer; OSHA Rep for the store; Store event coordinator \nAssistant Buyer/Assistant Merchandiser- train new buyers on Open to Buy(OTB); report recognized trends to Buyer and Merchandiser Skills Human Resources Public Speaking Onboarding Event Planning Microsoft Excel Skills  Human Resources Public Speaking Onboarding Event Planning Microsoft Excel Human Resources Public Speaking Onboarding Event Planning Microsoft Excel Human Resources Public Speaking Onboarding Event Planning Microsoft Excel Education Portland Community College Associate of Arts (AA),  Associates 1975  – 1977 St Mary's Academy, Portland OR High School 1971  – 1975 Portland State University - School of Business Business STM Portland Community College Associate of Arts (AA),  Associates 1975  – 1977 Portland Community College Associate of Arts (AA),  Associates 1975  – 1977 Portland Community College Associate of Arts (AA),  Associates 1975  – 1977 St Mary's Academy, Portland OR High School 1971  – 1975 St Mary's Academy, Portland OR High School 1971  – 1975 St Mary's Academy, Portland OR High School 1971  – 1975 Portland State University - School of Business Business Portland State University - School of Business Business Portland State University - School of Business Business STM STM STM ", "Experience Administrative Assistant Intel Corporation March 2011  – Present (4 years 6 months) Held assignments with Intel Corporation as well as various long term temporary assignments. Tasks include supporting executive level managers, preparing travel arrangements, scheduling appointments and setting up large meetings and offsite events.  \nHeld position for City of Cupertino. Supported the Traffic Department; performed high volume data entry; interacted with customers to update registration to obtain permits for private city parking. Admin. Assistant Kelly Temporary Services March 2007  – Present (8 years 6 months) Office Specialist Santa Clara Valley Water District January 2012  –  September 2012  (9 months) San Jose Interactive development with other city, county agencies, representatives of other water districts. Coordinate meetings with elected officials including mayors, council members, and other high level government staff, plus public organizations and private companies. Temporary contract through Johnson Service Group Assistant Salon Manager / Marketing / Sales Coordinator Shear Heaven Salon March 2008  –  January 2012  (3 years 11 months) Support business owner of elite salon which serves clients in a wide range services, including hair cuts, extensions and color; market business services through event parties and events; also generate sales of related products and jewelry. Provide assistance as a Personal Assistant as needed. \nProvide high energy, motivation and strong marketing efforts to increase clients with proven results of increasing sales revenue. Provide utmost high level customer service. \nAssist to schedule client appointments for three hair stylists. Prepare for shop opening daily. \nSet up and manage special events, including trade shows, in-house workshops and seminars, and special services including lucrative Botox parties. Plan and coordinate holiday and town events. \nProvide friendly and upbeat customer service to assist walk in clients; convey thorough product knowledge on variety of services offered with results of retaining new clients. \nGo the extra mile to develop rapport with customers to ensure satisfaction of services as well as to fulfill special requests. Meet product vendors, place orders, negotiate price and delivery. \nMaintain attractive appearance of salon decorations and cleanliness in a professional atmosphere. \nAs a former model, always maintain highest standards of dress and appearance. \nTake initiative to observe business needs or potential problems and implement effective solutions. \nMaintain all client communications including email, Facebook, Event Evite and daily scheduling.  \nArrange store merchandise displays: maintain stock inventory and well maintained visual floor. \nProcess customer sales and perform light accounting, such as make daily bank deposits. Sales/Marketing Coordinator Shear Heaven Salon March 2008  –  August 2011  (3 years 6 months) Administrative Assistant Intel Corporation December 1989  –  December 2007  (18 years 1 month) Sr. Administrative Assistant Intel Corporation January 1991  –  January 2007  (16 years 1 month) Supported the Director and VP of the Marketing and Sales and their staff. Handled heavy calendar management, worldwide meeting arrangements and marketing needs. Worked with Director and outside professors from Stanford to coordinate logistics of meeting arrangements \nPrepared domestic and international travel itineraries; processed expense reports.  \nProcessed purchase orders, expense reports and maintained office supplies.  \nDeveloped a departmental phone list, tracked and maintained non-disclosure agreements and retrieved personnel files. Assisted HR in various tasks including preparing hiring packages; maintained organization charts and communicated benefit options.  \nCreated and implemented office protocols to be utilized by other admin staff. Sr. Administrative Assistant Photonic Technology Group January 1991  –  January 2006  (15 years 1 month) Supported the GM, his direct reports of eight program managers and staff of 156.  \nProvided international communications with personnel in Beijing, Japan, Bangalore and Denmark to coordinate meetings, as well as obtain VISA.  \nCoordinated and communicated throughout cross-organizational departments to streamline work tasks, including external meetings. Scheduled and tracked manager training classes.  \nAssisted HR in various tasks, including return and closing of accounts on phone use. Participated in the hiring process of administrative personnel.  \n \nWorked closely with installers to design office layouts used to set up and install technical equipment, including computers, printers, and copiers; this also included layouts for conference rooms.  \nMaintained department budget to ensure strict spending guidelines including travel arrangements, office supplies, hardware, furniture and additional expenses, such as office moves. \nUpdated department on upcoming events and procedures. Participated and coordinated volunteer programs for company activities and community events.  \n \nACCOMPLISHMENTS:  \n \nInitiated innovative ideas incorporated throughout the company for other administrative staff; this included creating \"the Live Meeting' which enabled all sites to view meeting simultaneously.  \nCreated a discretionary spending sheet incorporated department wide for all administrative staff utilized to effectively track spending. Administrative Assistant Intel Corporation March 2011  – Present (4 years 6 months) Held assignments with Intel Corporation as well as various long term temporary assignments. Tasks include supporting executive level managers, preparing travel arrangements, scheduling appointments and setting up large meetings and offsite events.  \nHeld position for City of Cupertino. Supported the Traffic Department; performed high volume data entry; interacted with customers to update registration to obtain permits for private city parking. Administrative Assistant Intel Corporation March 2011  – Present (4 years 6 months) Held assignments with Intel Corporation as well as various long term temporary assignments. Tasks include supporting executive level managers, preparing travel arrangements, scheduling appointments and setting up large meetings and offsite events.  \nHeld position for City of Cupertino. Supported the Traffic Department; performed high volume data entry; interacted with customers to update registration to obtain permits for private city parking. Admin. Assistant Kelly Temporary Services March 2007  – Present (8 years 6 months) Admin. Assistant Kelly Temporary Services March 2007  – Present (8 years 6 months) Office Specialist Santa Clara Valley Water District January 2012  –  September 2012  (9 months) San Jose Interactive development with other city, county agencies, representatives of other water districts. Coordinate meetings with elected officials including mayors, council members, and other high level government staff, plus public organizations and private companies. Temporary contract through Johnson Service Group Office Specialist Santa Clara Valley Water District January 2012  –  September 2012  (9 months) San Jose Interactive development with other city, county agencies, representatives of other water districts. Coordinate meetings with elected officials including mayors, council members, and other high level government staff, plus public organizations and private companies. Temporary contract through Johnson Service Group Assistant Salon Manager / Marketing / Sales Coordinator Shear Heaven Salon March 2008  –  January 2012  (3 years 11 months) Support business owner of elite salon which serves clients in a wide range services, including hair cuts, extensions and color; market business services through event parties and events; also generate sales of related products and jewelry. Provide assistance as a Personal Assistant as needed. \nProvide high energy, motivation and strong marketing efforts to increase clients with proven results of increasing sales revenue. Provide utmost high level customer service. \nAssist to schedule client appointments for three hair stylists. Prepare for shop opening daily. \nSet up and manage special events, including trade shows, in-house workshops and seminars, and special services including lucrative Botox parties. Plan and coordinate holiday and town events. \nProvide friendly and upbeat customer service to assist walk in clients; convey thorough product knowledge on variety of services offered with results of retaining new clients. \nGo the extra mile to develop rapport with customers to ensure satisfaction of services as well as to fulfill special requests. Meet product vendors, place orders, negotiate price and delivery. \nMaintain attractive appearance of salon decorations and cleanliness in a professional atmosphere. \nAs a former model, always maintain highest standards of dress and appearance. \nTake initiative to observe business needs or potential problems and implement effective solutions. \nMaintain all client communications including email, Facebook, Event Evite and daily scheduling.  \nArrange store merchandise displays: maintain stock inventory and well maintained visual floor. \nProcess customer sales and perform light accounting, such as make daily bank deposits. Assistant Salon Manager / Marketing / Sales Coordinator Shear Heaven Salon March 2008  –  January 2012  (3 years 11 months) Support business owner of elite salon which serves clients in a wide range services, including hair cuts, extensions and color; market business services through event parties and events; also generate sales of related products and jewelry. Provide assistance as a Personal Assistant as needed. \nProvide high energy, motivation and strong marketing efforts to increase clients with proven results of increasing sales revenue. Provide utmost high level customer service. \nAssist to schedule client appointments for three hair stylists. Prepare for shop opening daily. \nSet up and manage special events, including trade shows, in-house workshops and seminars, and special services including lucrative Botox parties. Plan and coordinate holiday and town events. \nProvide friendly and upbeat customer service to assist walk in clients; convey thorough product knowledge on variety of services offered with results of retaining new clients. \nGo the extra mile to develop rapport with customers to ensure satisfaction of services as well as to fulfill special requests. Meet product vendors, place orders, negotiate price and delivery. \nMaintain attractive appearance of salon decorations and cleanliness in a professional atmosphere. \nAs a former model, always maintain highest standards of dress and appearance. \nTake initiative to observe business needs or potential problems and implement effective solutions. \nMaintain all client communications including email, Facebook, Event Evite and daily scheduling.  \nArrange store merchandise displays: maintain stock inventory and well maintained visual floor. \nProcess customer sales and perform light accounting, such as make daily bank deposits. Sales/Marketing Coordinator Shear Heaven Salon March 2008  –  August 2011  (3 years 6 months) Sales/Marketing Coordinator Shear Heaven Salon March 2008  –  August 2011  (3 years 6 months) Administrative Assistant Intel Corporation December 1989  –  December 2007  (18 years 1 month) Administrative Assistant Intel Corporation December 1989  –  December 2007  (18 years 1 month) Sr. Administrative Assistant Intel Corporation January 1991  –  January 2007  (16 years 1 month) Supported the Director and VP of the Marketing and Sales and their staff. Handled heavy calendar management, worldwide meeting arrangements and marketing needs. Worked with Director and outside professors from Stanford to coordinate logistics of meeting arrangements \nPrepared domestic and international travel itineraries; processed expense reports.  \nProcessed purchase orders, expense reports and maintained office supplies.  \nDeveloped a departmental phone list, tracked and maintained non-disclosure agreements and retrieved personnel files. Assisted HR in various tasks including preparing hiring packages; maintained organization charts and communicated benefit options.  \nCreated and implemented office protocols to be utilized by other admin staff. Sr. Administrative Assistant Intel Corporation January 1991  –  January 2007  (16 years 1 month) Supported the Director and VP of the Marketing and Sales and their staff. Handled heavy calendar management, worldwide meeting arrangements and marketing needs. Worked with Director and outside professors from Stanford to coordinate logistics of meeting arrangements \nPrepared domestic and international travel itineraries; processed expense reports.  \nProcessed purchase orders, expense reports and maintained office supplies.  \nDeveloped a departmental phone list, tracked and maintained non-disclosure agreements and retrieved personnel files. Assisted HR in various tasks including preparing hiring packages; maintained organization charts and communicated benefit options.  \nCreated and implemented office protocols to be utilized by other admin staff. Sr. Administrative Assistant Photonic Technology Group January 1991  –  January 2006  (15 years 1 month) Supported the GM, his direct reports of eight program managers and staff of 156.  \nProvided international communications with personnel in Beijing, Japan, Bangalore and Denmark to coordinate meetings, as well as obtain VISA.  \nCoordinated and communicated throughout cross-organizational departments to streamline work tasks, including external meetings. Scheduled and tracked manager training classes.  \nAssisted HR in various tasks, including return and closing of accounts on phone use. Participated in the hiring process of administrative personnel.  \n \nWorked closely with installers to design office layouts used to set up and install technical equipment, including computers, printers, and copiers; this also included layouts for conference rooms.  \nMaintained department budget to ensure strict spending guidelines including travel arrangements, office supplies, hardware, furniture and additional expenses, such as office moves. \nUpdated department on upcoming events and procedures. Participated and coordinated volunteer programs for company activities and community events.  \n \nACCOMPLISHMENTS:  \n \nInitiated innovative ideas incorporated throughout the company for other administrative staff; this included creating \"the Live Meeting' which enabled all sites to view meeting simultaneously.  \nCreated a discretionary spending sheet incorporated department wide for all administrative staff utilized to effectively track spending. Sr. Administrative Assistant Photonic Technology Group January 1991  –  January 2006  (15 years 1 month) Supported the GM, his direct reports of eight program managers and staff of 156.  \nProvided international communications with personnel in Beijing, Japan, Bangalore and Denmark to coordinate meetings, as well as obtain VISA.  \nCoordinated and communicated throughout cross-organizational departments to streamline work tasks, including external meetings. Scheduled and tracked manager training classes.  \nAssisted HR in various tasks, including return and closing of accounts on phone use. Participated in the hiring process of administrative personnel.  \n \nWorked closely with installers to design office layouts used to set up and install technical equipment, including computers, printers, and copiers; this also included layouts for conference rooms.  \nMaintained department budget to ensure strict spending guidelines including travel arrangements, office supplies, hardware, furniture and additional expenses, such as office moves. \nUpdated department on upcoming events and procedures. Participated and coordinated volunteer programs for company activities and community events.  \n \nACCOMPLISHMENTS:  \n \nInitiated innovative ideas incorporated throughout the company for other administrative staff; this included creating \"the Live Meeting' which enabled all sites to view meeting simultaneously.  \nCreated a discretionary spending sheet incorporated department wide for all administrative staff utilized to effectively track spending. Skills Administrative... Calendars Office Management Outlook Event Management Human Resources Training Program Management Recruiting Customer Service Skills  Administrative... Calendars Office Management Outlook Event Management Human Resources Training Program Management Recruiting Customer Service Administrative... Calendars Office Management Outlook Event Management Human Resources Training Program Management Recruiting Customer Service Administrative... Calendars Office Management Outlook Event Management Human Resources Training Program Management Recruiting Customer Service ", "Experience Event Coordinator (Human Resources, Diversity & Inclusion) Intel Corporation July 2015  – Present (2 months) Executive Administrative Assistant Intel Corporation January 2012  – Present (3 years 8 months) Provided administrative support to the Chief Marketing Officer and Technical Assistant \nExcellent management of executive’s and technical assistant’s complex calendar and scheduling requirements \nCoordinated domestic and international travel \nStrong ability to be flexible and calm in ever-changing environment. \nLead team of 13+ administrative assistants and developed monthly meetings and planned relevant agendas to strengthen the team’s skills and knowledge. . \nProvided support to Technical Assistant with preparation of keynotes, speeches and presentations \nProcessed and tracked expense report activity \nUpdate organizational charts \nSpace management \nPlanned events quarterly group events and also provided on-site support at corporate events (CES,Sales Conference and Marketing Summit events) Executive Administrative Assistant Intel Corporation November 2008  –  January 2012  (3 years 3 months) Provided administrative support to the Consumer Channels Vice President/Director Marketing and the Excellence and Operations Manager. Executive Administrative Assistant Intel Corporation March 2007  –  November 2008  (1 year 9 months) Provided administrative support to Intel’s Corporate Council / Corporate Secretary and the Intel Board of Directors. Executive Administrative Assistant Intel Corporation October 2004  –  March 2007  (2 years 6 months) Provided administrative support to Vice President and General Manager in Sales and Marketing and in the Digital Home Group. Senior Admin Support Specialist Intel Corporation August 2003  –  October 2004  (1 year 3 months) Provided administrative support to Technical Assist (TA) to the President/Chief Operating Officer and provided continuous coverage for administrative assistant of President/Chief Operating Officer. Senior Admin Support Specialist Intel Corporation June 2001  –  August 2003  (2 years 3 months) Senior Administrative Assistant Solutions Market Development GroupIntel Corporation November 1999  –  June 2001  (1 year 8 months) IA-64 Program Office Office Manager SENAH, Inc October 1996  –  November 1999  (3 years 2 months) Human Resources Administrative Assistant / Transportation Coordinator Philips Semiconductors June 1995  –  January 1996  (8 months) Executive Secretary Philips Semiconductors August 1990  –  June 1995  (4 years 11 months) Administrative Assistant ESCO Associates September 1989  –  August 1990  (1 year) Inside Sales Representative E.R.I December 1986  –  September 1989  (2 years 10 months) Inside Sales Clerk Icore International January 1985  –  December 1986  (2 years) Event Coordinator (Human Resources, Diversity & Inclusion) Intel Corporation July 2015  – Present (2 months) Event Coordinator (Human Resources, Diversity & Inclusion) Intel Corporation July 2015  – Present (2 months) Executive Administrative Assistant Intel Corporation January 2012  – Present (3 years 8 months) Provided administrative support to the Chief Marketing Officer and Technical Assistant \nExcellent management of executive’s and technical assistant’s complex calendar and scheduling requirements \nCoordinated domestic and international travel \nStrong ability to be flexible and calm in ever-changing environment. \nLead team of 13+ administrative assistants and developed monthly meetings and planned relevant agendas to strengthen the team’s skills and knowledge. . \nProvided support to Technical Assistant with preparation of keynotes, speeches and presentations \nProcessed and tracked expense report activity \nUpdate organizational charts \nSpace management \nPlanned events quarterly group events and also provided on-site support at corporate events (CES,Sales Conference and Marketing Summit events) Executive Administrative Assistant Intel Corporation January 2012  – Present (3 years 8 months) Provided administrative support to the Chief Marketing Officer and Technical Assistant \nExcellent management of executive’s and technical assistant’s complex calendar and scheduling requirements \nCoordinated domestic and international travel \nStrong ability to be flexible and calm in ever-changing environment. \nLead team of 13+ administrative assistants and developed monthly meetings and planned relevant agendas to strengthen the team’s skills and knowledge. . \nProvided support to Technical Assistant with preparation of keynotes, speeches and presentations \nProcessed and tracked expense report activity \nUpdate organizational charts \nSpace management \nPlanned events quarterly group events and also provided on-site support at corporate events (CES,Sales Conference and Marketing Summit events) Executive Administrative Assistant Intel Corporation November 2008  –  January 2012  (3 years 3 months) Provided administrative support to the Consumer Channels Vice President/Director Marketing and the Excellence and Operations Manager. Executive Administrative Assistant Intel Corporation November 2008  –  January 2012  (3 years 3 months) Provided administrative support to the Consumer Channels Vice President/Director Marketing and the Excellence and Operations Manager. Executive Administrative Assistant Intel Corporation March 2007  –  November 2008  (1 year 9 months) Provided administrative support to Intel’s Corporate Council / Corporate Secretary and the Intel Board of Directors. Executive Administrative Assistant Intel Corporation March 2007  –  November 2008  (1 year 9 months) Provided administrative support to Intel’s Corporate Council / Corporate Secretary and the Intel Board of Directors. Executive Administrative Assistant Intel Corporation October 2004  –  March 2007  (2 years 6 months) Provided administrative support to Vice President and General Manager in Sales and Marketing and in the Digital Home Group. Executive Administrative Assistant Intel Corporation October 2004  –  March 2007  (2 years 6 months) Provided administrative support to Vice President and General Manager in Sales and Marketing and in the Digital Home Group. Senior Admin Support Specialist Intel Corporation August 2003  –  October 2004  (1 year 3 months) Provided administrative support to Technical Assist (TA) to the President/Chief Operating Officer and provided continuous coverage for administrative assistant of President/Chief Operating Officer. Senior Admin Support Specialist Intel Corporation August 2003  –  October 2004  (1 year 3 months) Provided administrative support to Technical Assist (TA) to the President/Chief Operating Officer and provided continuous coverage for administrative assistant of President/Chief Operating Officer. Senior Admin Support Specialist Intel Corporation June 2001  –  August 2003  (2 years 3 months) Senior Admin Support Specialist Intel Corporation June 2001  –  August 2003  (2 years 3 months) Senior Administrative Assistant Solutions Market Development GroupIntel Corporation November 1999  –  June 2001  (1 year 8 months) IA-64 Program Office Senior Administrative Assistant Solutions Market Development GroupIntel Corporation November 1999  –  June 2001  (1 year 8 months) IA-64 Program Office Office Manager SENAH, Inc October 1996  –  November 1999  (3 years 2 months) Office Manager SENAH, Inc October 1996  –  November 1999  (3 years 2 months) Human Resources Administrative Assistant / Transportation Coordinator Philips Semiconductors June 1995  –  January 1996  (8 months) Human Resources Administrative Assistant / Transportation Coordinator Philips Semiconductors June 1995  –  January 1996  (8 months) Executive Secretary Philips Semiconductors August 1990  –  June 1995  (4 years 11 months) Executive Secretary Philips Semiconductors August 1990  –  June 1995  (4 years 11 months) Administrative Assistant ESCO Associates September 1989  –  August 1990  (1 year) Administrative Assistant ESCO Associates September 1989  –  August 1990  (1 year) Inside Sales Representative E.R.I December 1986  –  September 1989  (2 years 10 months) Inside Sales Representative E.R.I December 1986  –  September 1989  (2 years 10 months) Inside Sales Clerk Icore International January 1985  –  December 1986  (2 years) Inside Sales Clerk Icore International January 1985  –  December 1986  (2 years) Skills Semiconductors Microsoft Office Project Management Event Planning Program Management Social Media Outlook PowerPoint Marketing Access Event Management Human Resources Contract Negotiation Leadership Microsoft Excel Marketing Strategy See 1+     See less Skills  Semiconductors Microsoft Office Project Management Event Planning Program Management Social Media Outlook PowerPoint Marketing Access Event Management Human Resources Contract Negotiation Leadership Microsoft Excel Marketing Strategy See 1+     See less Semiconductors Microsoft Office Project Management Event Planning Program Management Social Media Outlook PowerPoint Marketing Access Event Management Human Resources Contract Negotiation Leadership Microsoft Excel Marketing Strategy See 1+     See less Semiconductors Microsoft Office Project Management Event Planning Program Management Social Media Outlook PowerPoint Marketing Access Event Management Human Resources Contract Negotiation Leadership Microsoft Excel Marketing Strategy See 1+     See less ", "Experience Sr. Administrative Assistant Intel Corporation January 2014  – Present (1 year 8 months) DuPont WA Sr. Administrative Assistant Intel Corporation July 2013  –  September 2013  (3 months) DuPont WA Sr. Administrative Assistant Intel Corporation July 1996  –  January 2013  (16 years 7 months) DuPont WA Accounts Payable and Sales Assistant KCPQ-TV Q13 FOX July 1992  –  November 1995  (3 years 5 months) Sales Assistant \nAssisted local and national sales managers with clients and prospective clients; monitored and maintained client contracts; maintained electronic calendar management; performed a variety of clerical and office functions; coordinated company activities and catering; assumed manager’s responsibilities in his absence and covered for the receptionist and operated a multiple phone line system. \nAccounts Payable \nMaintained company accounts; payroll distribution and processed checks, performed a variety of clerical and office functions. Responsible for checking the daily log to make sure all the programs and commercials aired on time and without complications. Sr. Administrative Assistant Intel Corporation January 2014  – Present (1 year 8 months) DuPont WA Sr. Administrative Assistant Intel Corporation January 2014  – Present (1 year 8 months) DuPont WA Sr. Administrative Assistant Intel Corporation July 2013  –  September 2013  (3 months) DuPont WA Sr. Administrative Assistant Intel Corporation July 2013  –  September 2013  (3 months) DuPont WA Sr. Administrative Assistant Intel Corporation July 1996  –  January 2013  (16 years 7 months) DuPont WA Sr. Administrative Assistant Intel Corporation July 1996  –  January 2013  (16 years 7 months) DuPont WA Accounts Payable and Sales Assistant KCPQ-TV Q13 FOX July 1992  –  November 1995  (3 years 5 months) Sales Assistant \nAssisted local and national sales managers with clients and prospective clients; monitored and maintained client contracts; maintained electronic calendar management; performed a variety of clerical and office functions; coordinated company activities and catering; assumed manager’s responsibilities in his absence and covered for the receptionist and operated a multiple phone line system. \nAccounts Payable \nMaintained company accounts; payroll distribution and processed checks, performed a variety of clerical and office functions. Responsible for checking the daily log to make sure all the programs and commercials aired on time and without complications. Accounts Payable and Sales Assistant KCPQ-TV Q13 FOX July 1992  –  November 1995  (3 years 5 months) Sales Assistant \nAssisted local and national sales managers with clients and prospective clients; monitored and maintained client contracts; maintained electronic calendar management; performed a variety of clerical and office functions; coordinated company activities and catering; assumed manager’s responsibilities in his absence and covered for the receptionist and operated a multiple phone line system. \nAccounts Payable \nMaintained company accounts; payroll distribution and processed checks, performed a variety of clerical and office functions. Responsible for checking the daily log to make sure all the programs and commercials aired on time and without complications. Skills Executive... Invertory Control Buyer Accounts Payable Accounts Receivable Payroll Microsoft Office SharePoint SharePoint Designer InfoPath Outlook Office Management Data Entry Administrative... Time Management Training Management See 2+     See less Skills  Executive... Invertory Control Buyer Accounts Payable Accounts Receivable Payroll Microsoft Office SharePoint SharePoint Designer InfoPath Outlook Office Management Data Entry Administrative... Time Management Training Management See 2+     See less Executive... Invertory Control Buyer Accounts Payable Accounts Receivable Payroll Microsoft Office SharePoint SharePoint Designer InfoPath Outlook Office Management Data Entry Administrative... Time Management Training Management See 2+     See less Executive... Invertory Control Buyer Accounts Payable Accounts Receivable Payroll Microsoft Office SharePoint SharePoint Designer InfoPath Outlook Office Management Data Entry Administrative... Time Management Training Management See 2+     See less Education Pierce College at Puyallup Associate's degree,  Accounting 1989  – 1992 Pierce College at Puyallup Associate's degree,  Accounting 1989  – 1992 Pierce College at Puyallup Associate's degree,  Accounting 1989  – 1992 Pierce College at Puyallup Associate's degree,  Accounting 1989  – 1992 ", "Experience Senior Administrative Assistant Intel Corporation February 2005  – Present (10 years 7 months) Hillsboro, OR Senior Administrative Assistant Intel Corporation March 1997  –  October 2002  (5 years 8 months) Hillsboro, Oregon Secretary Pacific University January 1978  –  April 1992  (14 years 4 months) Forest Grove, OR Senior Administrative Assistant Intel Corporation February 2005  – Present (10 years 7 months) Hillsboro, OR Senior Administrative Assistant Intel Corporation February 2005  – Present (10 years 7 months) Hillsboro, OR Senior Administrative Assistant Intel Corporation March 1997  –  October 2002  (5 years 8 months) Hillsboro, Oregon Senior Administrative Assistant Intel Corporation March 1997  –  October 2002  (5 years 8 months) Hillsboro, Oregon Secretary Pacific University January 1978  –  April 1992  (14 years 4 months) Forest Grove, OR Secretary Pacific University January 1978  –  April 1992  (14 years 4 months) Forest Grove, OR Skills Calendars Administrative... Expenses Spreadsheets Office Management Administrative Work Expense Reports Confidentiality Office Administration Invoicing Organization &... Travel Arrangements Concur Calendaring Customer Service Microsoft Office Microsoft Excel Microsoft Word PowerPoint Administrative... See 5+     See less Skills  Calendars Administrative... Expenses Spreadsheets Office Management Administrative Work Expense Reports Confidentiality Office Administration Invoicing Organization &... Travel Arrangements Concur Calendaring Customer Service Microsoft Office Microsoft Excel Microsoft Word PowerPoint Administrative... See 5+     See less Calendars Administrative... Expenses Spreadsheets Office Management Administrative Work Expense Reports Confidentiality Office Administration Invoicing Organization &... Travel Arrangements Concur Calendaring Customer Service Microsoft Office Microsoft Excel Microsoft Word PowerPoint Administrative... See 5+     See less Calendars Administrative... Expenses Spreadsheets Office Management Administrative Work Expense Reports Confidentiality Office Administration Invoicing Organization &... Travel Arrangements Concur Calendaring Customer Service Microsoft Office Microsoft Excel Microsoft Word PowerPoint Administrative... See 5+     See less Education Banks High School 1974  – 1978 Banks High School 1974  – 1978 Banks High School 1974  – 1978 Banks High School 1974  – 1978 ", "Languages   Skills Management Training Coaching Customer Service Salesforce.com Budgets Quality Assurance PowerPoint Computer Hardware SharePoint Project Management E-commerce Team Building Microsoft Office Software Development Human Resources Microsoft Word Microsoft Excel Sales Operations Business Analysis Team Leadership Time Management Visio Sales Applicant Tracking... Project Planning Enterprise Software MS Project Wordpress Program Management Windows HTML Troubleshooting Process Improvement Negotiation Access Photoshop Lead Generation Leadership Vendor Management Account Management Security Outlook System Administration Databases Software Documentation Adobe Acrobat Analysis Integration CRM See 35+     See less Skills  Management Training Coaching Customer Service Salesforce.com Budgets Quality Assurance PowerPoint Computer Hardware SharePoint Project Management E-commerce Team Building Microsoft Office Software Development Human Resources Microsoft Word Microsoft Excel Sales Operations Business Analysis Team Leadership Time Management Visio Sales Applicant Tracking... Project Planning Enterprise Software MS Project Wordpress Program Management Windows HTML Troubleshooting Process Improvement Negotiation Access Photoshop Lead Generation Leadership Vendor Management Account Management Security Outlook System Administration Databases Software Documentation Adobe Acrobat Analysis Integration CRM See 35+     See less Management Training Coaching Customer Service Salesforce.com Budgets Quality Assurance PowerPoint Computer Hardware SharePoint Project Management E-commerce Team Building Microsoft Office Software Development Human Resources Microsoft Word Microsoft Excel Sales Operations Business Analysis Team Leadership Time Management Visio Sales Applicant Tracking... Project Planning Enterprise Software MS Project Wordpress Program Management Windows HTML Troubleshooting Process Improvement Negotiation Access Photoshop Lead Generation Leadership Vendor Management Account Management Security Outlook System Administration Databases Software Documentation Adobe Acrobat Analysis Integration CRM See 35+     See less Management Training Coaching Customer Service Salesforce.com Budgets Quality Assurance PowerPoint Computer Hardware SharePoint Project Management E-commerce Team Building Microsoft Office Software Development Human Resources Microsoft Word Microsoft Excel Sales Operations Business Analysis Team Leadership Time Management Visio Sales Applicant Tracking... Project Planning Enterprise Software MS Project Wordpress Program Management Windows HTML Troubleshooting Process Improvement Negotiation Access Photoshop Lead Generation Leadership Vendor Management Account Management Security Outlook System Administration Databases Software Documentation Adobe Acrobat Analysis Integration CRM See 35+     See less Honors & Awards ", "Skills Outlook Microsoft Office Procurement Administrative Support Word Excel PowerPoint PeopleSoft Database Administration Spreadsheets Contract Management Problem Solving SAP Adobe Acrobat Purchasing Administrative... Administrative... Microsoft Excel See 3+     See less Skills  Outlook Microsoft Office Procurement Administrative Support Word Excel PowerPoint PeopleSoft Database Administration Spreadsheets Contract Management Problem Solving SAP Adobe Acrobat Purchasing Administrative... Administrative... Microsoft Excel See 3+     See less Outlook Microsoft Office Procurement Administrative Support Word Excel PowerPoint PeopleSoft Database Administration Spreadsheets Contract Management Problem Solving SAP Adobe Acrobat Purchasing Administrative... Administrative... Microsoft Excel See 3+     See less Outlook Microsoft Office Procurement Administrative Support Word Excel PowerPoint PeopleSoft Database Administration Spreadsheets Contract Management Problem Solving SAP Adobe Acrobat Purchasing Administrative... Administrative... Microsoft Excel See 3+     See less ", "Summary A highly organized, talented and detailed oriented Executive/Administrative Assistant with over 15 years of experience in performing thorough administrative and skillful support for various unit/department and Senior Executive leadership in both the public and private sector. Dedicated and focused; able to prioritize and complete multiple tasks and follow through to achieve strict project goals with minimal guidance. An independent and self-motivated professional with excellent communication and coordination skills; able to grow strong positive relationships with clients and colleagues at all organizational levels. Summary A highly organized, talented and detailed oriented Executive/Administrative Assistant with over 15 years of experience in performing thorough administrative and skillful support for various unit/department and Senior Executive leadership in both the public and private sector. Dedicated and focused; able to prioritize and complete multiple tasks and follow through to achieve strict project goals with minimal guidance. An independent and self-motivated professional with excellent communication and coordination skills; able to grow strong positive relationships with clients and colleagues at all organizational levels. A highly organized, talented and detailed oriented Executive/Administrative Assistant with over 15 years of experience in performing thorough administrative and skillful support for various unit/department and Senior Executive leadership in both the public and private sector. Dedicated and focused; able to prioritize and complete multiple tasks and follow through to achieve strict project goals with minimal guidance. An independent and self-motivated professional with excellent communication and coordination skills; able to grow strong positive relationships with clients and colleagues at all organizational levels. A highly organized, talented and detailed oriented Executive/Administrative Assistant with over 15 years of experience in performing thorough administrative and skillful support for various unit/department and Senior Executive leadership in both the public and private sector. Dedicated and focused; able to prioritize and complete multiple tasks and follow through to achieve strict project goals with minimal guidance. An independent and self-motivated professional with excellent communication and coordination skills; able to grow strong positive relationships with clients and colleagues at all organizational levels. Experience Sr. Administrative Assistant Intel Corporation August 2012  – Present (3 years 1 month) Folsom, CA Administrative Assistant Intel Corporation (via Kelly Services) March 2011  –  August 2012  (1 year 6 months) Folsom, CA Operation Manager/Executive Assistant to President/Owner VDM Development Corporation June 2008  –  March 2010  (1 year 10 months) Loomis, CA (Remote) Executive Assistant/Transaction Coordinator Weichert Realtors January 2007  –  June 2008  (1 year 6 months) Folsom, CA Executive Assistant to the Vice President/Managing Director Organic February 1998  –  February 2000  (2 years 1 month) San Francisco Bay Area Sr. Administrative Assistant Intel Corporation August 2012  – Present (3 years 1 month) Folsom, CA Sr. Administrative Assistant Intel Corporation August 2012  – Present (3 years 1 month) Folsom, CA Administrative Assistant Intel Corporation (via Kelly Services) March 2011  –  August 2012  (1 year 6 months) Folsom, CA Administrative Assistant Intel Corporation (via Kelly Services) March 2011  –  August 2012  (1 year 6 months) Folsom, CA Operation Manager/Executive Assistant to President/Owner VDM Development Corporation June 2008  –  March 2010  (1 year 10 months) Loomis, CA (Remote) Operation Manager/Executive Assistant to President/Owner VDM Development Corporation June 2008  –  March 2010  (1 year 10 months) Loomis, CA (Remote) Executive Assistant/Transaction Coordinator Weichert Realtors January 2007  –  June 2008  (1 year 6 months) Folsom, CA Executive Assistant/Transaction Coordinator Weichert Realtors January 2007  –  June 2008  (1 year 6 months) Folsom, CA Executive Assistant to the Vice President/Managing Director Organic February 1998  –  February 2000  (2 years 1 month) San Francisco Bay Area Executive Assistant to the Vice President/Managing Director Organic February 1998  –  February 2000  (2 years 1 month) San Francisco Bay Area Skills Customer Service Microsoft Office Microsoft Excel Outlook Microsoft Word Marketing Strategy Process Improvement Time Management Windows Team Leadership Budgets Human Resources Social Media Marketing Employee Relations Management Leadership Cross-functional Team... See 2+     See less Skills  Customer Service Microsoft Office Microsoft Excel Outlook Microsoft Word Marketing Strategy Process Improvement Time Management Windows Team Leadership Budgets Human Resources Social Media Marketing Employee Relations Management Leadership Cross-functional Team... See 2+     See less Customer Service Microsoft Office Microsoft Excel Outlook Microsoft Word Marketing Strategy Process Improvement Time Management Windows Team Leadership Budgets Human Resources Social Media Marketing Employee Relations Management Leadership Cross-functional Team... See 2+     See less Customer Service Microsoft Office Microsoft Excel Outlook Microsoft Word Marketing Strategy Process Improvement Time Management Windows Team Leadership Budgets Human Resources Social Media Marketing Employee Relations Management Leadership Cross-functional Team... See 2+     See less ", "Experience Administrative Specialists II Washington County Dept. of Housing Homeless Program October 2012  –  June 2013  (9 months) Hillsboro OR Temporary position as Assistant to Homeless Program Coordinator at Washington County Dept. of Housing. Performing a number of different tasks including compiling data from reports, liaison between Washington County Tree of Giving and non-profits, and taking minutes at meetings. Administrative Assistant Intel Corporation 2007  –  June 2010  (3 years) Supported 2 managers and their staffs of 100 people. \n•\tAdministrator for the group’s Windows SharePoint website.  \n•\tTravel arrangements & assisted with obtaining VISAs & passports. \n•\tResponsible for proactive calendar management included scheduling and/or coordinating logistics for meetings both internal and external \n•\tAssisted with interviewing/hiring as manager representative. \n•\tLead role in on-boarding 12 international interns who required unique status and special handling. Administrative Assistant Intel Corporation 2004  –  2007  (3 years) Supported Worldwide Director, 5 managers, and 10 individual contributors. \n•\tAdministrator for the group’s Windows SharePoint website. \n•\tManaged contracts/agreements from time of verbal agreement with external company to sending to permanent storage. \n•\tAssisted with international relocation of employee. \n•\tMade travel arrangements and assisted with obtaining VISAs and passports. \n•\tResponsible for proactive calendar management, which included scheduling and/or coordinating logistics for meetings with internal and external participants. Administrative Assistant Intel Corporation 2003  –  2004  (1 year) Supported Program Director, 2 Investment Managers, 2 Assistant Treasurers, and 2 Attorneys.\t \n•\tWorked with Legal and Finance departments to develop and document a process for tracking invoices and contract signature management.  \n•\tTook ownership of the tracking and management of contracts for deals in the close process as well as PO management for the major outside vendor. \n•\tCombined 16 lists in different formats from various events to create one master in preparation for CEO Summit ’03. Administrative Assistant Intel Corporation 2001  –  2003  (2 years) Supported for an Attorney, Assistant Treasurer, and 3-5 Integration Managers. \n•\tArranged for off-site facilities for confidential meetings between companies. \n•\tMade travel arrangements and assisted with obtaining VISAs and passports. \n•\tScheduled meetings from 1:1s up to 30 or more participants with both external and internal attendees.  \n•\tResponsible for proactive calendar management, which included scheduling and/or coordinating logistics for meetings with internal and external participants Program Administrator Intel Corporation 2000  –  2001  (1 year) Assisted with database coordination and implementation. \n•\tPlanned and facilitated consolidation of two databases consisting of over 6,000 records. Planned and implemented permissions and privilege changes to the database. \n•\tPlanned, scheduled, and documented database administrator meetings; implemented database changes. \n•\tCompiled charts and graphs using Excel and Tracker providing a visual display of data for management to use to measure progress of software development. Champion Coordinator Intel Corporation 1997  –  2000  (3 years) Year 2000 Product Program office mission was to ensure all products provided to customers were year 2000 capable to reduce the risk of any legal liability. Corporate wide initiative. \n•\tFacilitated communication between groups ensuring uniform awareness of policies and procedures. Achieved this through: \n•\tComposed “Briefly” newsletter; circulated to key personnel. \n•\tCoordinated Disposition Review Board, which reviewed all exceptions to policy.  \n•\tRevised Champions' Workbook and Champions' Guide. \n•\tArchived all documentation for legal department use. Collected inventory of over 3,000 software packages used for product development. Primarily responsible for determining which were capable and unlikely to cause an interruption of business. Administrative Assistant Intel Corporation 1995  –  1997  (2 years) Supported software engineering manager, staff, and group of 90 engineers\t \n•\tConducted software bug review meetings to rank priority of problems to be corrected. \n•\tCompiled program indicators to measure progress of software development. \n•\tCoordinated move and 30% work space compression of over 90 employees within first 90 days.  \n•\tOrganized recognition events for 70 - 500 people. Administrative Assistant Intergraph Corporation 1986  –  1995  (9 years) Supported Regional Technical Manager \nOrganized budget numbers from various databases to be used to evaluate budget vs actual expenses. \nCoordinated off-site training of 5 classes for over 120 employees at 4 sites within a 13 state region to educate technical staff on new company procedure. \nCollected materials and compiled into one reference manual for use within the region. Administrative Assistant Accutest 1980  –  1985  (5 years) Administrative Specialists II Washington County Dept. of Housing Homeless Program October 2012  –  June 2013  (9 months) Hillsboro OR Temporary position as Assistant to Homeless Program Coordinator at Washington County Dept. of Housing. Performing a number of different tasks including compiling data from reports, liaison between Washington County Tree of Giving and non-profits, and taking minutes at meetings. Administrative Specialists II Washington County Dept. of Housing Homeless Program October 2012  –  June 2013  (9 months) Hillsboro OR Temporary position as Assistant to Homeless Program Coordinator at Washington County Dept. of Housing. Performing a number of different tasks including compiling data from reports, liaison between Washington County Tree of Giving and non-profits, and taking minutes at meetings. Administrative Assistant Intel Corporation 2007  –  June 2010  (3 years) Supported 2 managers and their staffs of 100 people. \n•\tAdministrator for the group’s Windows SharePoint website.  \n•\tTravel arrangements & assisted with obtaining VISAs & passports. \n•\tResponsible for proactive calendar management included scheduling and/or coordinating logistics for meetings both internal and external \n•\tAssisted with interviewing/hiring as manager representative. \n•\tLead role in on-boarding 12 international interns who required unique status and special handling. Administrative Assistant Intel Corporation 2007  –  June 2010  (3 years) Supported 2 managers and their staffs of 100 people. \n•\tAdministrator for the group’s Windows SharePoint website.  \n•\tTravel arrangements & assisted with obtaining VISAs & passports. \n•\tResponsible for proactive calendar management included scheduling and/or coordinating logistics for meetings both internal and external \n•\tAssisted with interviewing/hiring as manager representative. \n•\tLead role in on-boarding 12 international interns who required unique status and special handling. Administrative Assistant Intel Corporation 2004  –  2007  (3 years) Supported Worldwide Director, 5 managers, and 10 individual contributors. \n•\tAdministrator for the group’s Windows SharePoint website. \n•\tManaged contracts/agreements from time of verbal agreement with external company to sending to permanent storage. \n•\tAssisted with international relocation of employee. \n•\tMade travel arrangements and assisted with obtaining VISAs and passports. \n•\tResponsible for proactive calendar management, which included scheduling and/or coordinating logistics for meetings with internal and external participants. Administrative Assistant Intel Corporation 2004  –  2007  (3 years) Supported Worldwide Director, 5 managers, and 10 individual contributors. \n•\tAdministrator for the group’s Windows SharePoint website. \n•\tManaged contracts/agreements from time of verbal agreement with external company to sending to permanent storage. \n•\tAssisted with international relocation of employee. \n•\tMade travel arrangements and assisted with obtaining VISAs and passports. \n•\tResponsible for proactive calendar management, which included scheduling and/or coordinating logistics for meetings with internal and external participants. Administrative Assistant Intel Corporation 2003  –  2004  (1 year) Supported Program Director, 2 Investment Managers, 2 Assistant Treasurers, and 2 Attorneys.\t \n•\tWorked with Legal and Finance departments to develop and document a process for tracking invoices and contract signature management.  \n•\tTook ownership of the tracking and management of contracts for deals in the close process as well as PO management for the major outside vendor. \n•\tCombined 16 lists in different formats from various events to create one master in preparation for CEO Summit ’03. Administrative Assistant Intel Corporation 2003  –  2004  (1 year) Supported Program Director, 2 Investment Managers, 2 Assistant Treasurers, and 2 Attorneys.\t \n•\tWorked with Legal and Finance departments to develop and document a process for tracking invoices and contract signature management.  \n•\tTook ownership of the tracking and management of contracts for deals in the close process as well as PO management for the major outside vendor. \n•\tCombined 16 lists in different formats from various events to create one master in preparation for CEO Summit ’03. Administrative Assistant Intel Corporation 2001  –  2003  (2 years) Supported for an Attorney, Assistant Treasurer, and 3-5 Integration Managers. \n•\tArranged for off-site facilities for confidential meetings between companies. \n•\tMade travel arrangements and assisted with obtaining VISAs and passports. \n•\tScheduled meetings from 1:1s up to 30 or more participants with both external and internal attendees.  \n•\tResponsible for proactive calendar management, which included scheduling and/or coordinating logistics for meetings with internal and external participants Administrative Assistant Intel Corporation 2001  –  2003  (2 years) Supported for an Attorney, Assistant Treasurer, and 3-5 Integration Managers. \n•\tArranged for off-site facilities for confidential meetings between companies. \n•\tMade travel arrangements and assisted with obtaining VISAs and passports. \n•\tScheduled meetings from 1:1s up to 30 or more participants with both external and internal attendees.  \n•\tResponsible for proactive calendar management, which included scheduling and/or coordinating logistics for meetings with internal and external participants Program Administrator Intel Corporation 2000  –  2001  (1 year) Assisted with database coordination and implementation. \n•\tPlanned and facilitated consolidation of two databases consisting of over 6,000 records. Planned and implemented permissions and privilege changes to the database. \n•\tPlanned, scheduled, and documented database administrator meetings; implemented database changes. \n•\tCompiled charts and graphs using Excel and Tracker providing a visual display of data for management to use to measure progress of software development. Program Administrator Intel Corporation 2000  –  2001  (1 year) Assisted with database coordination and implementation. \n•\tPlanned and facilitated consolidation of two databases consisting of over 6,000 records. Planned and implemented permissions and privilege changes to the database. \n•\tPlanned, scheduled, and documented database administrator meetings; implemented database changes. \n•\tCompiled charts and graphs using Excel and Tracker providing a visual display of data for management to use to measure progress of software development. Champion Coordinator Intel Corporation 1997  –  2000  (3 years) Year 2000 Product Program office mission was to ensure all products provided to customers were year 2000 capable to reduce the risk of any legal liability. Corporate wide initiative. \n•\tFacilitated communication between groups ensuring uniform awareness of policies and procedures. Achieved this through: \n•\tComposed “Briefly” newsletter; circulated to key personnel. \n•\tCoordinated Disposition Review Board, which reviewed all exceptions to policy.  \n•\tRevised Champions' Workbook and Champions' Guide. \n•\tArchived all documentation for legal department use. Collected inventory of over 3,000 software packages used for product development. Primarily responsible for determining which were capable and unlikely to cause an interruption of business. Champion Coordinator Intel Corporation 1997  –  2000  (3 years) Year 2000 Product Program office mission was to ensure all products provided to customers were year 2000 capable to reduce the risk of any legal liability. Corporate wide initiative. \n•\tFacilitated communication between groups ensuring uniform awareness of policies and procedures. Achieved this through: \n•\tComposed “Briefly” newsletter; circulated to key personnel. \n•\tCoordinated Disposition Review Board, which reviewed all exceptions to policy.  \n•\tRevised Champions' Workbook and Champions' Guide. \n•\tArchived all documentation for legal department use. Collected inventory of over 3,000 software packages used for product development. Primarily responsible for determining which were capable and unlikely to cause an interruption of business. Administrative Assistant Intel Corporation 1995  –  1997  (2 years) Supported software engineering manager, staff, and group of 90 engineers\t \n•\tConducted software bug review meetings to rank priority of problems to be corrected. \n•\tCompiled program indicators to measure progress of software development. \n•\tCoordinated move and 30% work space compression of over 90 employees within first 90 days.  \n•\tOrganized recognition events for 70 - 500 people. Administrative Assistant Intel Corporation 1995  –  1997  (2 years) Supported software engineering manager, staff, and group of 90 engineers\t \n•\tConducted software bug review meetings to rank priority of problems to be corrected. \n•\tCompiled program indicators to measure progress of software development. \n•\tCoordinated move and 30% work space compression of over 90 employees within first 90 days.  \n•\tOrganized recognition events for 70 - 500 people. Administrative Assistant Intergraph Corporation 1986  –  1995  (9 years) Supported Regional Technical Manager \nOrganized budget numbers from various databases to be used to evaluate budget vs actual expenses. \nCoordinated off-site training of 5 classes for over 120 employees at 4 sites within a 13 state region to educate technical staff on new company procedure. \nCollected materials and compiled into one reference manual for use within the region. Administrative Assistant Intergraph Corporation 1986  –  1995  (9 years) Supported Regional Technical Manager \nOrganized budget numbers from various databases to be used to evaluate budget vs actual expenses. \nCoordinated off-site training of 5 classes for over 120 employees at 4 sites within a 13 state region to educate technical staff on new company procedure. \nCollected materials and compiled into one reference manual for use within the region. Administrative Assistant Accutest 1980  –  1985  (5 years) Administrative Assistant Accutest 1980  –  1985  (5 years) Skills Microsoft Excel Program Management Software Documentation Training Strategic Partnerships Cross-functional Team... Management Product Marketing Semiconductors Product Management Skills  Microsoft Excel Program Management Software Documentation Training Strategic Partnerships Cross-functional Team... Management Product Marketing Semiconductors Product Management Microsoft Excel Program Management Software Documentation Training Strategic Partnerships Cross-functional Team... Management Product Marketing Semiconductors Product Management Microsoft Excel Program Management Software Documentation Training Strategic Partnerships Cross-functional Team... Management Product Marketing Semiconductors Product Management Education Portland State University - School of Business Certificate of Professional Deveopment,  Human Resource Management University of North Texas BBA,  Business Administration Portland State University - School of Business Certificate of Professional Deveopment,  Human Resource Management Portland State University - School of Business Certificate of Professional Deveopment,  Human Resource Management Portland State University - School of Business Certificate of Professional Deveopment,  Human Resource Management University of North Texas BBA,  Business Administration University of North Texas BBA,  Business Administration University of North Texas BBA,  Business Administration ", "Experience Senior Administrative Assistant Intel Corporation January 2015  – Present (8 months) Hillsboro, Oregon Support: \nBrian Gonzalez, Director, Intel Education End User & Gov’t Influencing \nRandy Reina \nWayne Grant \n Senior Administrative Assistant Intel Corporation April 2006  –  January 2015  (8 years 10 months) Hillsboro, Oregon Senior Administrative Assistant support for Joel Christensen (CCMO GM), John Deatherage (CCMO Product Marketing Director), and Mark Shipman (CCMO Product & Commercial Business Development Director).  \nManage CCMO CPU requests internally and externally. \nManage CCMO WHC contract requests. \nContact for PCCG Microsoft Project Server requests. Administrative Assistant Kelly Services March 2006  –  February 2007  (1 year) Worked at Intel Report Technician Great Lakes Data Center (GLDC) June 2004  –  September 2005  (1 year 4 months) Lorain, Ohio Monitor and correct reports Administrative Secretary Lorain Public Library System 2000  –  2003  (3 years) Lorain, Ohio Manager National Association of College Stores March 1991  –  January 2000  (8 years 11 months) Last position within NACS I managed a technical support center for an EDI software product used by over 30 publishers and 3000 bookstores (includes college and trade stores.) Senior Administrative Assistant Intel Corporation January 2015  – Present (8 months) Hillsboro, Oregon Support: \nBrian Gonzalez, Director, Intel Education End User & Gov’t Influencing \nRandy Reina \nWayne Grant \n Senior Administrative Assistant Intel Corporation January 2015  – Present (8 months) Hillsboro, Oregon Support: \nBrian Gonzalez, Director, Intel Education End User & Gov’t Influencing \nRandy Reina \nWayne Grant \n Senior Administrative Assistant Intel Corporation April 2006  –  January 2015  (8 years 10 months) Hillsboro, Oregon Senior Administrative Assistant support for Joel Christensen (CCMO GM), John Deatherage (CCMO Product Marketing Director), and Mark Shipman (CCMO Product & Commercial Business Development Director).  \nManage CCMO CPU requests internally and externally. \nManage CCMO WHC contract requests. \nContact for PCCG Microsoft Project Server requests. Senior Administrative Assistant Intel Corporation April 2006  –  January 2015  (8 years 10 months) Hillsboro, Oregon Senior Administrative Assistant support for Joel Christensen (CCMO GM), John Deatherage (CCMO Product Marketing Director), and Mark Shipman (CCMO Product & Commercial Business Development Director).  \nManage CCMO CPU requests internally and externally. \nManage CCMO WHC contract requests. \nContact for PCCG Microsoft Project Server requests. Administrative Assistant Kelly Services March 2006  –  February 2007  (1 year) Worked at Intel Administrative Assistant Kelly Services March 2006  –  February 2007  (1 year) Worked at Intel Report Technician Great Lakes Data Center (GLDC) June 2004  –  September 2005  (1 year 4 months) Lorain, Ohio Monitor and correct reports Report Technician Great Lakes Data Center (GLDC) June 2004  –  September 2005  (1 year 4 months) Lorain, Ohio Monitor and correct reports Administrative Secretary Lorain Public Library System 2000  –  2003  (3 years) Lorain, Ohio Administrative Secretary Lorain Public Library System 2000  –  2003  (3 years) Lorain, Ohio Manager National Association of College Stores March 1991  –  January 2000  (8 years 11 months) Last position within NACS I managed a technical support center for an EDI software product used by over 30 publishers and 3000 bookstores (includes college and trade stores.) Manager National Association of College Stores March 1991  –  January 2000  (8 years 11 months) Last position within NACS I managed a technical support center for an EDI software product used by over 30 publishers and 3000 bookstores (includes college and trade stores.) Education Portland State University - School of Business BS,  Business Administration - Management & Leadership 2010  – 2015 Lorain County Community College Associate of Applied Business in CIS -,  Software Development , Network Communications Technology 2003  – 2004 Graduated with two degrees and Honors. Also worked on Associate of Applied Business degree in E-business Technology Portland State University - School of Business BS,  Business Administration - Management & Leadership 2010  – 2015 Portland State University - School of Business BS,  Business Administration - Management & Leadership 2010  – 2015 Portland State University - School of Business BS,  Business Administration - Management & Leadership 2010  – 2015 Lorain County Community College Associate of Applied Business in CIS -,  Software Development , Network Communications Technology 2003  – 2004 Graduated with two degrees and Honors. Also worked on Associate of Applied Business degree in E-business Technology Lorain County Community College Associate of Applied Business in CIS -,  Software Development , Network Communications Technology 2003  – 2004 Graduated with two degrees and Honors. Also worked on Associate of Applied Business degree in E-business Technology Lorain County Community College Associate of Applied Business in CIS -,  Software Development , Network Communications Technology 2003  – 2004 Graduated with two degrees and Honors. Also worked on Associate of Applied Business degree in E-business Technology ", "Experience Administrative Assistant Intel Corporation Sr. Administrative Assistant Intel Corporation August 1995  – Present (20 years 1 month) Perform various administrative and project-related activities in support of an individual or group varying in size. Typical duties may include but are not limited to the following: Drafts, composes, types, and proofs correspondence using current office software applications; creates and sustains systems for retention, protection, retrieval, transfer and disposal of confidential information; schedules and coordinates logistics for meetings and events; organizes and manages calendar schedule(s) for manager and/or department; makes travel arrangements and prepares expense reports; maintains office supplies; manages departmental recognition, tracks headcount and spending; serves as an information resource/communication channel for policies and procedures; and is a resource for office related software applications. Assignments are complex and diversified in nature and require working within a globally dispersed team. Work performed within generally defined parameters. Administrative Assistant Intel Corporation Administrative Assistant Intel Corporation Sr. Administrative Assistant Intel Corporation August 1995  – Present (20 years 1 month) Perform various administrative and project-related activities in support of an individual or group varying in size. Typical duties may include but are not limited to the following: Drafts, composes, types, and proofs correspondence using current office software applications; creates and sustains systems for retention, protection, retrieval, transfer and disposal of confidential information; schedules and coordinates logistics for meetings and events; organizes and manages calendar schedule(s) for manager and/or department; makes travel arrangements and prepares expense reports; maintains office supplies; manages departmental recognition, tracks headcount and spending; serves as an information resource/communication channel for policies and procedures; and is a resource for office related software applications. Assignments are complex and diversified in nature and require working within a globally dispersed team. Work performed within generally defined parameters. Sr. Administrative Assistant Intel Corporation August 1995  – Present (20 years 1 month) Perform various administrative and project-related activities in support of an individual or group varying in size. Typical duties may include but are not limited to the following: Drafts, composes, types, and proofs correspondence using current office software applications; creates and sustains systems for retention, protection, retrieval, transfer and disposal of confidential information; schedules and coordinates logistics for meetings and events; organizes and manages calendar schedule(s) for manager and/or department; makes travel arrangements and prepares expense reports; maintains office supplies; manages departmental recognition, tracks headcount and spending; serves as an information resource/communication channel for policies and procedures; and is a resource for office related software applications. Assignments are complex and diversified in nature and require working within a globally dispersed team. Work performed within generally defined parameters. Skills Compilers Cross-functional Team... Program Management Product Marketing Electronics Visio Supply Management Skills  Compilers Cross-functional Team... Program Management Product Marketing Electronics Visio Supply Management Compilers Cross-functional Team... Program Management Product Marketing Electronics Visio Supply Management Compilers Cross-functional Team... Program Management Product Marketing Electronics Visio Supply Management Education West Virginia University West Virginia University West Virginia University West Virginia University "]}