{"position": "Advisory Information Developer", "company": "IBM", "profiles": ["Summary Retired Summary Retired Retired Retired Experience Advisory Information Developer IBM March 1969  –  February 2004  (35 years) Kingston NY and Charlotte NC product publications Commanding Officer, Combat Engineer Company US Army January 1967  –  December 1968  (2 years) 237th Engr Bn, Heilbronn, Germany Advisory Information Developer IBM March 1969  –  February 2004  (35 years) Kingston NY and Charlotte NC product publications Advisory Information Developer IBM March 1969  –  February 2004  (35 years) Kingston NY and Charlotte NC product publications Commanding Officer, Combat Engineer Company US Army January 1967  –  December 1968  (2 years) 237th Engr Bn, Heilbronn, Germany Commanding Officer, Combat Engineer Company US Army January 1967  –  December 1968  (2 years) 237th Engr Bn, Heilbronn, Germany Skills Enjoying retirement Skills  Enjoying retirement Enjoying retirement Enjoying retirement Education Penn State University Bachelor of Science (BS),  Geology/Earth Science 1962  – 1966 Penn State University Bachelor of Science (BS),  Geology/Earth Science 1962  – 1966 Penn State University Bachelor of Science (BS),  Geology/Earth Science 1962  – 1966 Penn State University Bachelor of Science (BS),  Geology/Earth Science 1962  – 1966 ", "Summary Certified tech writer, instructional designer, business analyst. Extensive experience at every level of writing/instruction both nationally and internationally. Specialties:Validation, SAP, CFR, SCM, eCTD, UML, SOX, 508, CMM, ISO, Six Sigma, MS Office, Visio, Flash, DreamWeaver, RoboHelp, Office, Captivate, Simulations, Conference Presentations, WBT, CBT, FrameMaker. Summary Certified tech writer, instructional designer, business analyst. Extensive experience at every level of writing/instruction both nationally and internationally. Specialties:Validation, SAP, CFR, SCM, eCTD, UML, SOX, 508, CMM, ISO, Six Sigma, MS Office, Visio, Flash, DreamWeaver, RoboHelp, Office, Captivate, Simulations, Conference Presentations, WBT, CBT, FrameMaker. Certified tech writer, instructional designer, business analyst. Extensive experience at every level of writing/instruction both nationally and internationally. Specialties:Validation, SAP, CFR, SCM, eCTD, UML, SOX, 508, CMM, ISO, Six Sigma, MS Office, Visio, Flash, DreamWeaver, RoboHelp, Office, Captivate, Simulations, Conference Presentations, WBT, CBT, FrameMaker. Certified tech writer, instructional designer, business analyst. Extensive experience at every level of writing/instruction both nationally and internationally. Specialties:Validation, SAP, CFR, SCM, eCTD, UML, SOX, 508, CMM, ISO, Six Sigma, MS Office, Visio, Flash, DreamWeaver, RoboHelp, Office, Captivate, Simulations, Conference Presentations, WBT, CBT, FrameMaker. Experience Sr. Instructional Designer/Tech Writer Eli Lilly & Company October 2003  –  June 2006  (2 years 9 months) Sr. Technical Writer GlaxoSmithKline Pharmaceuticals 2002  –  2003  (1 year) Sr. Technical Writer/Instructional Designer ABB 2000  –  2002  (2 years) Advisory Information Developer IBM 1985  –  1995  (10 years) Sr. Instructional Designer/Tech Writer Eli Lilly & Company October 2003  –  June 2006  (2 years 9 months) Sr. Instructional Designer/Tech Writer Eli Lilly & Company October 2003  –  June 2006  (2 years 9 months) Sr. Technical Writer GlaxoSmithKline Pharmaceuticals 2002  –  2003  (1 year) Sr. Technical Writer GlaxoSmithKline Pharmaceuticals 2002  –  2003  (1 year) Sr. Technical Writer/Instructional Designer ABB 2000  –  2002  (2 years) Sr. Technical Writer/Instructional Designer ABB 2000  –  2002  (2 years) Advisory Information Developer IBM 1985  –  1995  (10 years) Advisory Information Developer IBM 1985  –  1995  (10 years) Education Pace University-Pleasantville/Briarcliff Campus Graduate Certificate 1991  – 1991 Pace University-Pleasantville/Briarcliff Campus Graduate Certificate 1991  – 1991 Pace University-Pleasantville/Briarcliff Campus Graduate Certificate 1991  – 1991 Pace University-Pleasantville/Briarcliff Campus Graduate Certificate 1991  – 1991 ", "Summary Leader, trainer, mentor, and subject matter expert. Excellent relationship management across multi-disciplinary teams whose members are both local and remote. Skilled in interpreting and distilling customer and product requirements into comprehensive and accurate plans, schedules, and staffing estimates. Continuous learner of the latest technical innovations in products based on journalistic skills to research, evaluate, and synthesize information. Proficient in the creation and promotion of procedures and processes in support of improved product quality and the customer experience. Specialties:Composed under the pressure of plan, design, and staffing changes in the middle or near the end of a development cycle. A person who understands the importance of being focused on the removal of barriers or roadblocks that impede success for teams or individuals. Experienced with DITA and SGML tagging in the development of content for Eclipse-based Information Centers using information architecture techniques. Summary Leader, trainer, mentor, and subject matter expert. Excellent relationship management across multi-disciplinary teams whose members are both local and remote. Skilled in interpreting and distilling customer and product requirements into comprehensive and accurate plans, schedules, and staffing estimates. Continuous learner of the latest technical innovations in products based on journalistic skills to research, evaluate, and synthesize information. Proficient in the creation and promotion of procedures and processes in support of improved product quality and the customer experience. Specialties:Composed under the pressure of plan, design, and staffing changes in the middle or near the end of a development cycle. A person who understands the importance of being focused on the removal of barriers or roadblocks that impede success for teams or individuals. Experienced with DITA and SGML tagging in the development of content for Eclipse-based Information Centers using information architecture techniques. Leader, trainer, mentor, and subject matter expert. Excellent relationship management across multi-disciplinary teams whose members are both local and remote. Skilled in interpreting and distilling customer and product requirements into comprehensive and accurate plans, schedules, and staffing estimates. Continuous learner of the latest technical innovations in products based on journalistic skills to research, evaluate, and synthesize information. Proficient in the creation and promotion of procedures and processes in support of improved product quality and the customer experience. Specialties:Composed under the pressure of plan, design, and staffing changes in the middle or near the end of a development cycle. A person who understands the importance of being focused on the removal of barriers or roadblocks that impede success for teams or individuals. Experienced with DITA and SGML tagging in the development of content for Eclipse-based Information Centers using information architecture techniques. Leader, trainer, mentor, and subject matter expert. Excellent relationship management across multi-disciplinary teams whose members are both local and remote. Skilled in interpreting and distilling customer and product requirements into comprehensive and accurate plans, schedules, and staffing estimates. Continuous learner of the latest technical innovations in products based on journalistic skills to research, evaluate, and synthesize information. Proficient in the creation and promotion of procedures and processes in support of improved product quality and the customer experience. Specialties:Composed under the pressure of plan, design, and staffing changes in the middle or near the end of a development cycle. A person who understands the importance of being focused on the removal of barriers or roadblocks that impede success for teams or individuals. Experienced with DITA and SGML tagging in the development of content for Eclipse-based Information Centers using information architecture techniques. Experience Senior Business Systems Analyst RBC July 2010  – Present (5 years 2 months) Requirements management, use case development, specifications definiton, project team management. Tutor Oxford Learning Centre - Unionville September 2008  –  June 2009  (10 months) Working with several ESL students three nights a week and Saturdays. Advisory Information Developer IBM Toronto Software Development Lab 2002  –  February 2009  (7 years) On a \"by release\" basis, responsible for: strategic team leadership, managing client-facing product deliverables, and directing development teams of 12 to 20+ staff. Also responsible for initiatives in information architecture, business processes and procedures, prototype creation and testing, and strategic delivery of usable, quality information. Advisory Information Developer IBM Canada Ltd. 2002  –  2009  (7 years) Staff Information Developer IBM Toronto Software Development Lab 1993  –  2002  (9 years) Developed release content for the Administration Guide. Planned and prioritized cross-department team deliverables, schedules, and goals; lead cross-department team; contributed process improvements and quality goals; performed status reporting; acted as audit representative. Project Manager IBM Toronto Software Development Lab 1989  –  1992  (3 years) Project Manager for the SQL/DS (now called DB2 for VM and VSE) with a department of 16 Education Specialist Honeywell Institute for Continuing Studies January 1982  –  December 1983  (2 years) Course developer and instructor in an intensive private adult education environment. Teaching subjects included: Basic, FORTRAN, and COBOL programming languages; database design; business system analysis. Senior Business Systems Analyst RBC July 2010  – Present (5 years 2 months) Requirements management, use case development, specifications definiton, project team management. Senior Business Systems Analyst RBC July 2010  – Present (5 years 2 months) Requirements management, use case development, specifications definiton, project team management. Tutor Oxford Learning Centre - Unionville September 2008  –  June 2009  (10 months) Working with several ESL students three nights a week and Saturdays. Tutor Oxford Learning Centre - Unionville September 2008  –  June 2009  (10 months) Working with several ESL students three nights a week and Saturdays. Advisory Information Developer IBM Toronto Software Development Lab 2002  –  February 2009  (7 years) On a \"by release\" basis, responsible for: strategic team leadership, managing client-facing product deliverables, and directing development teams of 12 to 20+ staff. Also responsible for initiatives in information architecture, business processes and procedures, prototype creation and testing, and strategic delivery of usable, quality information. Advisory Information Developer IBM Toronto Software Development Lab 2002  –  February 2009  (7 years) On a \"by release\" basis, responsible for: strategic team leadership, managing client-facing product deliverables, and directing development teams of 12 to 20+ staff. Also responsible for initiatives in information architecture, business processes and procedures, prototype creation and testing, and strategic delivery of usable, quality information. Advisory Information Developer IBM Canada Ltd. 2002  –  2009  (7 years) Advisory Information Developer IBM Canada Ltd. 2002  –  2009  (7 years) Staff Information Developer IBM Toronto Software Development Lab 1993  –  2002  (9 years) Developed release content for the Administration Guide. Planned and prioritized cross-department team deliverables, schedules, and goals; lead cross-department team; contributed process improvements and quality goals; performed status reporting; acted as audit representative. Staff Information Developer IBM Toronto Software Development Lab 1993  –  2002  (9 years) Developed release content for the Administration Guide. Planned and prioritized cross-department team deliverables, schedules, and goals; lead cross-department team; contributed process improvements and quality goals; performed status reporting; acted as audit representative. Project Manager IBM Toronto Software Development Lab 1989  –  1992  (3 years) Project Manager for the SQL/DS (now called DB2 for VM and VSE) with a department of 16 Project Manager IBM Toronto Software Development Lab 1989  –  1992  (3 years) Project Manager for the SQL/DS (now called DB2 for VM and VSE) with a department of 16 Education Specialist Honeywell Institute for Continuing Studies January 1982  –  December 1983  (2 years) Course developer and instructor in an intensive private adult education environment. Teaching subjects included: Basic, FORTRAN, and COBOL programming languages; database design; business system analysis. Education Specialist Honeywell Institute for Continuing Studies January 1982  –  December 1983  (2 years) Course developer and instructor in an intensive private adult education environment. Teaching subjects included: Basic, FORTRAN, and COBOL programming languages; database design; business system analysis. Skills Technical Writing Business Analysis Relational Databases DITA XML Visio Mentoring Planning Project Planning Software Documentation Information Architecture Requirements Gathering Testing Systems Analysis Process Improvement Usability Testing Database Design Team Leadership DB2 Requirements Analysis See 5+     See less Skills  Technical Writing Business Analysis Relational Databases DITA XML Visio Mentoring Planning Project Planning Software Documentation Information Architecture Requirements Gathering Testing Systems Analysis Process Improvement Usability Testing Database Design Team Leadership DB2 Requirements Analysis See 5+     See less Technical Writing Business Analysis Relational Databases DITA XML Visio Mentoring Planning Project Planning Software Documentation Information Architecture Requirements Gathering Testing Systems Analysis Process Improvement Usability Testing Database Design Team Leadership DB2 Requirements Analysis See 5+     See less Technical Writing Business Analysis Relational Databases DITA XML Visio Mentoring Planning Project Planning Software Documentation Information Architecture Requirements Gathering Testing Systems Analysis Process Improvement Usability Testing Database Design Team Leadership DB2 Requirements Analysis See 5+     See less Education University of Toronto BEd,  English and ESL 1978  – 1979 Faculty of Education, U of T University of Toronto at Scarborough BA,  English 1974  – 1978 Honours Degree in English Activities and Societies:  Inter-Varsity Christian Fellowship University of Toronto BEd,  English and ESL 1978  – 1979 Faculty of Education, U of T University of Toronto BEd,  English and ESL 1978  – 1979 Faculty of Education, U of T University of Toronto BEd,  English and ESL 1978  – 1979 Faculty of Education, U of T University of Toronto at Scarborough BA,  English 1974  – 1978 Honours Degree in English Activities and Societies:  Inter-Varsity Christian Fellowship University of Toronto at Scarborough BA,  English 1974  – 1978 Honours Degree in English Activities and Societies:  Inter-Varsity Christian Fellowship University of Toronto at Scarborough BA,  English 1974  – 1978 Honours Degree in English Activities and Societies:  Inter-Varsity Christian Fellowship ", "Summary I am an experienced technical writer and educator with strong writing, project management, leadership, and instructional skills. I thrive on learning new technology and thinking about the best ways to make it easy for customers to use and understand. Summary I am an experienced technical writer and educator with strong writing, project management, leadership, and instructional skills. I thrive on learning new technology and thinking about the best ways to make it easy for customers to use and understand. I am an experienced technical writer and educator with strong writing, project management, leadership, and instructional skills. I thrive on learning new technology and thinking about the best ways to make it easy for customers to use and understand. I am an experienced technical writer and educator with strong writing, project management, leadership, and instructional skills. I thrive on learning new technology and thinking about the best ways to make it easy for customers to use and understand. Experience Senior Manager, Training and Documentation Rhiza April 2015  – Present (5 months) Pittsburgh Adjunct Instructor Carnegie Mellon University January 2009  – Present (6 years 8 months) (1) Teach graduate and undergraduate Software Documentation course, with focus on \ntopic-based, single-sourced authoring in XML and DITA. \n \n- Develop and implement curriculum to prepare students for a career in \nsoftware documentation, with an emphasis on quality writing and task \norientation and a push for user-centered focus. \n \n- Design and evaluate assignments meant to familiarize students with \nindustry-standard authoring paradigms and tools while teaching best \npractices for writing and organizing technical information. \n \n(2) Teach core Communications for Software Engineers course for the Master of \nSoftware Engineering program. \n \n(3) Taught graduate Web Design course, with focus on information architecture and \ndesign. Course culminated in students delivering high-fidelity website prototypes to \nAllegheny Health Network’s Women in Medicine organization. Advisory Information Developer IBM October 1999  –  April 2015  (15 years 7 months) Greater Pittsburgh Area Senior member of the information development team, with information architecture, \nwriting, and leadership roles. \n \nStrong focus on delivering high-quality user assistance for enterprise-level middleware product with multiple, disparate users. User assistance is in the form of Knowledge Center articles (topic-based, single sourced, DITA authoring), videos, and embedded assistance in the product UI. \n \nDedication to customer satisfaction: strong user advocacy in product design meetings; beta advocate for Raymond James; education sessions for internal (support, development) and external customers. \n \nAbility to excel and to lead peers in a complex, fast-moving agile environment. Technical Writer Transarc/IBM October 1996  –  October 2000  (4 years 1 month) As part of a writing team, planned, developed, and maintained large set of end-user documentation for Encina and TXSeries products. Focused heavily on user testing our documents; worked closely with system test and development to ensure high-quality products and documentation. Tech writer Imperative 1995  –  1996  (1 year) Greater Pittsburgh Area Sole writer at a small startup that delivered the first version of MapQuest. Responsible for all written content, including web site and marketing materials, white papers, end-user documentation. Thrived in the chaos and excitement of a small, new company that was on the verge of providing great new technology. Intern Software Engineering Institute (SEI) 1995  –  1995  (less than a year) Senior Manager, Training and Documentation Rhiza April 2015  – Present (5 months) Pittsburgh Senior Manager, Training and Documentation Rhiza April 2015  – Present (5 months) Pittsburgh Adjunct Instructor Carnegie Mellon University January 2009  – Present (6 years 8 months) (1) Teach graduate and undergraduate Software Documentation course, with focus on \ntopic-based, single-sourced authoring in XML and DITA. \n \n- Develop and implement curriculum to prepare students for a career in \nsoftware documentation, with an emphasis on quality writing and task \norientation and a push for user-centered focus. \n \n- Design and evaluate assignments meant to familiarize students with \nindustry-standard authoring paradigms and tools while teaching best \npractices for writing and organizing technical information. \n \n(2) Teach core Communications for Software Engineers course for the Master of \nSoftware Engineering program. \n \n(3) Taught graduate Web Design course, with focus on information architecture and \ndesign. Course culminated in students delivering high-fidelity website prototypes to \nAllegheny Health Network’s Women in Medicine organization. Adjunct Instructor Carnegie Mellon University January 2009  – Present (6 years 8 months) (1) Teach graduate and undergraduate Software Documentation course, with focus on \ntopic-based, single-sourced authoring in XML and DITA. \n \n- Develop and implement curriculum to prepare students for a career in \nsoftware documentation, with an emphasis on quality writing and task \norientation and a push for user-centered focus. \n \n- Design and evaluate assignments meant to familiarize students with \nindustry-standard authoring paradigms and tools while teaching best \npractices for writing and organizing technical information. \n \n(2) Teach core Communications for Software Engineers course for the Master of \nSoftware Engineering program. \n \n(3) Taught graduate Web Design course, with focus on information architecture and \ndesign. Course culminated in students delivering high-fidelity website prototypes to \nAllegheny Health Network’s Women in Medicine organization. Advisory Information Developer IBM October 1999  –  April 2015  (15 years 7 months) Greater Pittsburgh Area Senior member of the information development team, with information architecture, \nwriting, and leadership roles. \n \nStrong focus on delivering high-quality user assistance for enterprise-level middleware product with multiple, disparate users. User assistance is in the form of Knowledge Center articles (topic-based, single sourced, DITA authoring), videos, and embedded assistance in the product UI. \n \nDedication to customer satisfaction: strong user advocacy in product design meetings; beta advocate for Raymond James; education sessions for internal (support, development) and external customers. \n \nAbility to excel and to lead peers in a complex, fast-moving agile environment. Advisory Information Developer IBM October 1999  –  April 2015  (15 years 7 months) Greater Pittsburgh Area Senior member of the information development team, with information architecture, \nwriting, and leadership roles. \n \nStrong focus on delivering high-quality user assistance for enterprise-level middleware product with multiple, disparate users. User assistance is in the form of Knowledge Center articles (topic-based, single sourced, DITA authoring), videos, and embedded assistance in the product UI. \n \nDedication to customer satisfaction: strong user advocacy in product design meetings; beta advocate for Raymond James; education sessions for internal (support, development) and external customers. \n \nAbility to excel and to lead peers in a complex, fast-moving agile environment. Technical Writer Transarc/IBM October 1996  –  October 2000  (4 years 1 month) As part of a writing team, planned, developed, and maintained large set of end-user documentation for Encina and TXSeries products. Focused heavily on user testing our documents; worked closely with system test and development to ensure high-quality products and documentation. Technical Writer Transarc/IBM October 1996  –  October 2000  (4 years 1 month) As part of a writing team, planned, developed, and maintained large set of end-user documentation for Encina and TXSeries products. Focused heavily on user testing our documents; worked closely with system test and development to ensure high-quality products and documentation. Tech writer Imperative 1995  –  1996  (1 year) Greater Pittsburgh Area Sole writer at a small startup that delivered the first version of MapQuest. Responsible for all written content, including web site and marketing materials, white papers, end-user documentation. Thrived in the chaos and excitement of a small, new company that was on the verge of providing great new technology. Tech writer Imperative 1995  –  1996  (1 year) Greater Pittsburgh Area Sole writer at a small startup that delivered the first version of MapQuest. Responsible for all written content, including web site and marketing materials, white papers, end-user documentation. Thrived in the chaos and excitement of a small, new company that was on the verge of providing great new technology. Intern Software Engineering Institute (SEI) 1995  –  1995  (less than a year) Intern Software Engineering Institute (SEI) 1995  –  1995  (less than a year) Languages English Native or bilingual proficiency Mandarin Elementary proficiency French Limited working proficiency English Native or bilingual proficiency Mandarin Elementary proficiency French Limited working proficiency English Native or bilingual proficiency Mandarin Elementary proficiency French Limited working proficiency Native or bilingual proficiency Elementary proficiency Limited working proficiency Skills Technical Writing Software Documentation Teaching Information Architecture Editing User-centered Design Communication Intercultural... DITA DITA XML Wire Framing Team Leadership Telecommuting Working on... MadCap Flare Oxygen XML Editor User Experience User Stories User Assistance Writing See 5+     See less Skills  Technical Writing Software Documentation Teaching Information Architecture Editing User-centered Design Communication Intercultural... DITA DITA XML Wire Framing Team Leadership Telecommuting Working on... MadCap Flare Oxygen XML Editor User Experience User Stories User Assistance Writing See 5+     See less Technical Writing Software Documentation Teaching Information Architecture Editing User-centered Design Communication Intercultural... DITA DITA XML Wire Framing Team Leadership Telecommuting Working on... MadCap Flare Oxygen XML Editor User Experience User Stories User Assistance Writing See 5+     See less Technical Writing Software Documentation Teaching Information Architecture Editing User-centered Design Communication Intercultural... DITA DITA XML Wire Framing Team Leadership Telecommuting Working on... MadCap Flare Oxygen XML Editor User Experience User Stories User Assistance Writing See 5+     See less Education Carnegie Mellon University MA,  Technical writing 1994  – 1995 Duquesne University BA,  English ,  Corporate Communications 1990  – 1994 Carnegie Mellon University MA,  Technical writing 1994  – 1995 Carnegie Mellon University MA,  Technical writing 1994  – 1995 Carnegie Mellon University MA,  Technical writing 1994  – 1995 Duquesne University BA,  English ,  Corporate Communications 1990  – 1994 Duquesne University BA,  English ,  Corporate Communications 1990  – 1994 Duquesne University BA,  English ,  Corporate Communications 1990  – 1994 ", "Experience Advisory Information Developer IBM (Silicon Valley Lab) Advisory Information Developer IBM (Silicon Valley Lab) Advisory Information Developer IBM (Silicon Valley Lab) ", "Experience Advisory Information Developer IBM Corporation April 2004  – Present (11 years 5 months) Senior Information Developer Candle Corporation 1997  –  2004  (7 years) Technical Writer Consultant 1984  –  1997  (13 years) Advisory Information Developer IBM Corporation April 2004  – Present (11 years 5 months) Advisory Information Developer IBM Corporation April 2004  – Present (11 years 5 months) Senior Information Developer Candle Corporation 1997  –  2004  (7 years) Senior Information Developer Candle Corporation 1997  –  2004  (7 years) Technical Writer Consultant 1984  –  1997  (13 years) Technical Writer Consultant 1984  –  1997  (13 years) Skills DB2 Agile Methodologies WebSphere Application... Enterprise Architecture Software Development JavaScript Cloud Computing SOA Linux Unix Enterprise Software Technical Writing Software Project... Solution Architecture XML DITA Java Eclipse Requirements Analysis Virtualization Project Management Windows IT Service Management Shell Scripting Integration Perl SQL Databases Program Management Java Enterprise Edition Data Center SaaS See 17+     See less Skills  DB2 Agile Methodologies WebSphere Application... Enterprise Architecture Software Development JavaScript Cloud Computing SOA Linux Unix Enterprise Software Technical Writing Software Project... Solution Architecture XML DITA Java Eclipse Requirements Analysis Virtualization Project Management Windows IT Service Management Shell Scripting Integration Perl SQL Databases Program Management Java Enterprise Edition Data Center SaaS See 17+     See less DB2 Agile Methodologies WebSphere Application... Enterprise Architecture Software Development JavaScript Cloud Computing SOA Linux Unix Enterprise Software Technical Writing Software Project... Solution Architecture XML DITA Java Eclipse Requirements Analysis Virtualization Project Management Windows IT Service Management Shell Scripting Integration Perl SQL Databases Program Management Java Enterprise Edition Data Center SaaS See 17+     See less DB2 Agile Methodologies WebSphere Application... Enterprise Architecture Software Development JavaScript Cloud Computing SOA Linux Unix Enterprise Software Technical Writing Software Project... Solution Architecture XML DITA Java Eclipse Requirements Analysis Virtualization Project Management Windows IT Service Management Shell Scripting Integration Perl SQL Databases Program Management Java Enterprise Edition Data Center SaaS See 17+     See less ", "Summary As an employee and as a contractor, I have written and delivered technical documentation for a variety of audiences. As an early product user and user advocate, my contributions include exploratory and ad hoc quality assurance testing and feedback on software usability. I am experienced in all aspects of the software and documentation development cycles, including Agile methodology. Summary As an employee and as a contractor, I have written and delivered technical documentation for a variety of audiences. As an early product user and user advocate, my contributions include exploratory and ad hoc quality assurance testing and feedback on software usability. I am experienced in all aspects of the software and documentation development cycles, including Agile methodology. As an employee and as a contractor, I have written and delivered technical documentation for a variety of audiences. As an early product user and user advocate, my contributions include exploratory and ad hoc quality assurance testing and feedback on software usability. I am experienced in all aspects of the software and documentation development cycles, including Agile methodology. As an employee and as a contractor, I have written and delivered technical documentation for a variety of audiences. As an early product user and user advocate, my contributions include exploratory and ad hoc quality assurance testing and feedback on software usability. I am experienced in all aspects of the software and documentation development cycles, including Agile methodology. Experience Principal Technical Writer edX 2014  – Present (1 year) Founder Colibris Consulting LLC August 2004  –  January 2014  (9 years 6 months) I delivered high quality documentation products to the high tech industry on a short-term, contract basis.  \nClients included IBM, Commonwealth Informatics, Phase Forward (acquired by Oracle Corp.), Quattro Wireless (acquired by Apple), and Resolve Technology (acquired by CoStar Group). Advisory Information Developer IBM December 2012  –  December 2013  (1 year 1 month) Waltham, MA At IBM, I worked with international teams to develop--and constantly improve--information deliverables. Principal Technical Writer Lincoln Technologies, Inc. February 2004  –  March 2005  (1 year 2 months) I wrote online help, installation guides, and release notes for data mining software and data products used at pharmaceutical companies and regulatory agencies. Lincoln Technologies was purchased by Phase Forward Inc. in August 2005; which was in turn acquired by Oracle Corp. in August 2010. Senior Technical Writer Pingtel Corp. July 1999  –  February 2004  (4 years 8 months) At Pingtel I documented internet telephony hardware and software products. Pingtel was acquired by Nortel Inc. in August 2008. Senior Technical Writer PPD Inc. February 1996  –  July 1999  (3 years 6 months) I wrote documentation for clinical trial data management software used in the pharmaceutical industry. I was hired by Belmont Research, Inc., which was later acquired by PPDI. Principal Technical Writer Belmont Research 1996  –  1999  (3 years) Working in collaboration with colleagues at Domain Pharma, I designed and wrote on-line help and user guides for clinical trial data management software products. Manager, Electronic Publishing Systems SR Research, Inc. (Cortera Inc.) February 1994  –  February 1996  (2 years 1 month) I performed all documentation-related functions for SR Research, which offered credit risk management software to Fortune 500 companies. SR Research, Inc. was renamed eCredit, and in 2008 was named Cortera, Inc. Senior Technical Writer National Computer Systems (SunGard) January 1987  –  February 1994  (7 years 2 months) At NCS I worked variously in technical publications, product management, and customer service on trust accounting, participant accounting, and pension payment and reporting software. I was hired by National Computer Systems, Inc., which was later acquired by SunGard. Assistant Manager Provident Institution for Savings June 1982  –  November 1986  (4 years 6 months) After college I worked in a series of jobs with increasing responsibility, from teller to head teller to assistant manager, at the Provident Institution for Savings. Principal Technical Writer edX 2014  – Present (1 year) Principal Technical Writer edX 2014  – Present (1 year) Founder Colibris Consulting LLC August 2004  –  January 2014  (9 years 6 months) I delivered high quality documentation products to the high tech industry on a short-term, contract basis.  \nClients included IBM, Commonwealth Informatics, Phase Forward (acquired by Oracle Corp.), Quattro Wireless (acquired by Apple), and Resolve Technology (acquired by CoStar Group). Founder Colibris Consulting LLC August 2004  –  January 2014  (9 years 6 months) I delivered high quality documentation products to the high tech industry on a short-term, contract basis.  \nClients included IBM, Commonwealth Informatics, Phase Forward (acquired by Oracle Corp.), Quattro Wireless (acquired by Apple), and Resolve Technology (acquired by CoStar Group). Advisory Information Developer IBM December 2012  –  December 2013  (1 year 1 month) Waltham, MA At IBM, I worked with international teams to develop--and constantly improve--information deliverables. Advisory Information Developer IBM December 2012  –  December 2013  (1 year 1 month) Waltham, MA At IBM, I worked with international teams to develop--and constantly improve--information deliverables. Principal Technical Writer Lincoln Technologies, Inc. February 2004  –  March 2005  (1 year 2 months) I wrote online help, installation guides, and release notes for data mining software and data products used at pharmaceutical companies and regulatory agencies. Lincoln Technologies was purchased by Phase Forward Inc. in August 2005; which was in turn acquired by Oracle Corp. in August 2010. Principal Technical Writer Lincoln Technologies, Inc. February 2004  –  March 2005  (1 year 2 months) I wrote online help, installation guides, and release notes for data mining software and data products used at pharmaceutical companies and regulatory agencies. Lincoln Technologies was purchased by Phase Forward Inc. in August 2005; which was in turn acquired by Oracle Corp. in August 2010. Senior Technical Writer Pingtel Corp. July 1999  –  February 2004  (4 years 8 months) At Pingtel I documented internet telephony hardware and software products. Pingtel was acquired by Nortel Inc. in August 2008. Senior Technical Writer Pingtel Corp. July 1999  –  February 2004  (4 years 8 months) At Pingtel I documented internet telephony hardware and software products. Pingtel was acquired by Nortel Inc. in August 2008. Senior Technical Writer PPD Inc. February 1996  –  July 1999  (3 years 6 months) I wrote documentation for clinical trial data management software used in the pharmaceutical industry. I was hired by Belmont Research, Inc., which was later acquired by PPDI. Senior Technical Writer PPD Inc. February 1996  –  July 1999  (3 years 6 months) I wrote documentation for clinical trial data management software used in the pharmaceutical industry. I was hired by Belmont Research, Inc., which was later acquired by PPDI. Principal Technical Writer Belmont Research 1996  –  1999  (3 years) Working in collaboration with colleagues at Domain Pharma, I designed and wrote on-line help and user guides for clinical trial data management software products. Principal Technical Writer Belmont Research 1996  –  1999  (3 years) Working in collaboration with colleagues at Domain Pharma, I designed and wrote on-line help and user guides for clinical trial data management software products. Manager, Electronic Publishing Systems SR Research, Inc. (Cortera Inc.) February 1994  –  February 1996  (2 years 1 month) I performed all documentation-related functions for SR Research, which offered credit risk management software to Fortune 500 companies. SR Research, Inc. was renamed eCredit, and in 2008 was named Cortera, Inc. Manager, Electronic Publishing Systems SR Research, Inc. (Cortera Inc.) February 1994  –  February 1996  (2 years 1 month) I performed all documentation-related functions for SR Research, which offered credit risk management software to Fortune 500 companies. SR Research, Inc. was renamed eCredit, and in 2008 was named Cortera, Inc. Senior Technical Writer National Computer Systems (SunGard) January 1987  –  February 1994  (7 years 2 months) At NCS I worked variously in technical publications, product management, and customer service on trust accounting, participant accounting, and pension payment and reporting software. I was hired by National Computer Systems, Inc., which was later acquired by SunGard. Senior Technical Writer National Computer Systems (SunGard) January 1987  –  February 1994  (7 years 2 months) At NCS I worked variously in technical publications, product management, and customer service on trust accounting, participant accounting, and pension payment and reporting software. I was hired by National Computer Systems, Inc., which was later acquired by SunGard. Assistant Manager Provident Institution for Savings June 1982  –  November 1986  (4 years 6 months) After college I worked in a series of jobs with increasing responsibility, from teller to head teller to assistant manager, at the Provident Institution for Savings. Assistant Manager Provident Institution for Savings June 1982  –  November 1986  (4 years 6 months) After college I worked in a series of jobs with increasing responsibility, from teller to head teller to assistant manager, at the Provident Institution for Savings. Skills FrameMaker RoboHelp Adobe Acrobat Word SnagIt Online Help Paint Shop Pro Visio DITA HTML Help Arbortext Software Documentation AuthorIT Release Notes Technical Writing Technical Communication Guides Online Help Development Technical Documentation Editing Documentation Author-it HTML Content Management Manuals Microsoft Word Content Development Copy Editing Information Architecture Information Design User Interface Design Quality Assurance Product Management Content Strategy Agile Methodologies See 20+     See less Skills  FrameMaker RoboHelp Adobe Acrobat Word SnagIt Online Help Paint Shop Pro Visio DITA HTML Help Arbortext Software Documentation AuthorIT Release Notes Technical Writing Technical Communication Guides Online Help Development Technical Documentation Editing Documentation Author-it HTML Content Management Manuals Microsoft Word Content Development Copy Editing Information Architecture Information Design User Interface Design Quality Assurance Product Management Content Strategy Agile Methodologies See 20+     See less FrameMaker RoboHelp Adobe Acrobat Word SnagIt Online Help Paint Shop Pro Visio DITA HTML Help Arbortext Software Documentation AuthorIT Release Notes Technical Writing Technical Communication Guides Online Help Development Technical Documentation Editing Documentation Author-it HTML Content Management Manuals Microsoft Word Content Development Copy Editing Information Architecture Information Design User Interface Design Quality Assurance Product Management Content Strategy Agile Methodologies See 20+     See less FrameMaker RoboHelp Adobe Acrobat Word SnagIt Online Help Paint Shop Pro Visio DITA HTML Help Arbortext Software Documentation AuthorIT Release Notes Technical Writing Technical Communication Guides Online Help Development Technical Documentation Editing Documentation Author-it HTML Content Management Manuals Microsoft Word Content Development Copy Editing Information Architecture Information Design User Interface Design Quality Assurance Product Management Content Strategy Agile Methodologies See 20+     See less Education University of Rochester BA,  English September 1978  – May 1982 cum laude, with departmental distinction Shenendehowa 1968  – 1978 University of Rochester BA,  English September 1978  – May 1982 cum laude, with departmental distinction University of Rochester BA,  English September 1978  – May 1982 cum laude, with departmental distinction University of Rochester BA,  English September 1978  – May 1982 cum laude, with departmental distinction Shenendehowa 1968  – 1978 Shenendehowa 1968  – 1978 Shenendehowa 1968  – 1978 ", "Experience Advisory Information Developer IBM 2003  – Present (12 years) Israel Consultant/contract technical writer Navarro Communications May 2000  –  May 2003  (3 years 1 month) Northern California (Silicon Valley) Manager, software tools technical publications Intel Corporation July 1990  –  July 1999  (9 years 1 month) Santa Clara, California Learning Products Specialist Hewlett-Packard July 1985  –  July 1990  (5 years 1 month) Senior technical writer Intel Corporation July 1983  –  August 1985  (2 years 2 months) Santa Clara, California Advisory Information Developer IBM 2003  – Present (12 years) Israel Advisory Information Developer IBM 2003  – Present (12 years) Israel Consultant/contract technical writer Navarro Communications May 2000  –  May 2003  (3 years 1 month) Northern California (Silicon Valley) Consultant/contract technical writer Navarro Communications May 2000  –  May 2003  (3 years 1 month) Northern California (Silicon Valley) Manager, software tools technical publications Intel Corporation July 1990  –  July 1999  (9 years 1 month) Santa Clara, California Manager, software tools technical publications Intel Corporation July 1990  –  July 1999  (9 years 1 month) Santa Clara, California Learning Products Specialist Hewlett-Packard July 1985  –  July 1990  (5 years 1 month) Learning Products Specialist Hewlett-Packard July 1985  –  July 1990  (5 years 1 month) Senior technical writer Intel Corporation July 1983  –  August 1985  (2 years 2 months) Santa Clara, California Senior technical writer Intel Corporation July 1983  –  August 1985  (2 years 2 months) Santa Clara, California Education Renssaeler Polytechnic Institute MS,  Technical Communication 1982  – 1983 University of Pennsylvania BA 1977  – 1981 Renssaeler Polytechnic Institute MS,  Technical Communication 1982  – 1983 Renssaeler Polytechnic Institute MS,  Technical Communication 1982  – 1983 Renssaeler Polytechnic Institute MS,  Technical Communication 1982  – 1983 University of Pennsylvania BA 1977  – 1981 University of Pennsylvania BA 1977  – 1981 University of Pennsylvania BA 1977  – 1981 ", "Summary Technical writer with 19 years experience of writing and publishing technical, user, and sales and marketing documentation for cyber security, software testing, core banking, payments, telecommunications, internet banking, web publishing, and FX trading systems. \n \nSpecialties: \n• Creating and rolling out documentation strategies, methodologies, and processes. \n• Recruiting, mentoring, and supervising other technical writers in onshore and offshore locations. Summary Technical writer with 19 years experience of writing and publishing technical, user, and sales and marketing documentation for cyber security, software testing, core banking, payments, telecommunications, internet banking, web publishing, and FX trading systems. \n \nSpecialties: \n• Creating and rolling out documentation strategies, methodologies, and processes. \n• Recruiting, mentoring, and supervising other technical writers in onshore and offshore locations. Technical writer with 19 years experience of writing and publishing technical, user, and sales and marketing documentation for cyber security, software testing, core banking, payments, telecommunications, internet banking, web publishing, and FX trading systems. \n \nSpecialties: \n• Creating and rolling out documentation strategies, methodologies, and processes. \n• Recruiting, mentoring, and supervising other technical writers in onshore and offshore locations. Technical writer with 19 years experience of writing and publishing technical, user, and sales and marketing documentation for cyber security, software testing, core banking, payments, telecommunications, internet banking, web publishing, and FX trading systems. \n \nSpecialties: \n• Creating and rolling out documentation strategies, methodologies, and processes. \n• Recruiting, mentoring, and supervising other technical writers in onshore and offshore locations. Experience Senior Technical Author BAE Systems Applied Intelligence June 2014  – Present (1 year 3 months) Guildford, United Kingdom • Lone technical writer for Cyber business unit. \n• Responsible for delivery of product documentation for all Cyber software products. \n• Initial focus on CyberReveal product. Advisory Information Developer IBM July 2011  –  May 2014  (2 years 11 months) London, United Kingdom • In July 2011, joined Green Hat as a lone technical author, which provided testing solutions for SOA, BPM, and other integration technologies and platforms. \n• In January 2012, Green Hat was acquired by IBM. \n• Worked as an advisory information developer for IBM Software Group (Rational). \n \nMain responsibilities: \n• Researching, writing, and illustrating user assistance for Rational Integration Tester (part of Rational Test Workbench), Rational Performance Test Server, and Rational Test Virtualization Server. Lead Technical Writer Misys May 2006  –  April 2011  (5 years) London, United Kingdom • Misys sells software and services to banks and other financial institutions. \n• Worked as lead technical writer for Midas, which is a wholesale banking solution. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing and technical documentation for Midas. \n• Building a pipeline of work for the Midas documentation team and supervising other team members. \n• Initiating and driving process improvements for Midas documentation. \n• Mentoring Summit FT technical writers in offshore location. \n \nMain achievements: \n• Introduced project management to the production of Midas documentation. \n• Synchronised documentation delivery with software delivery. \n• Recruited a combined onshore/offshore team to work alongside me on Midas documentation. \n• Initiated projects to address quality problems in legacy documentation. \n• Built strong relationships between the Midas documentation team and other departments across the company. \n• Created a writing skills test for Midas technical writer recruitment, which was subsequently used for global technical writer recruitment at Misys. Technical Writer Trintech February 2003  –  May 2006  (3 years 4 months) Dublin, Ireland • During my time with the company, Trintech specialised in payment technologies, including point-of-sale, mobile commerce, payment settlement, dispute resolution, fraud management, card management, and chargeback processing; and funds management systems. \n• Worked as a lone technical writer in the Enterprise Banking division and later the Global Services Group in the Payments division. \n• Was also a member of the engineering management team in the Enterprise Banking division and later the management team in the Global Services Group. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing documentation for enterprise systems. \n \nMain achievements: \n• Delivered high-quality user documentation for various products (both hardware and software) in the Payments division. \n• Updated processes and templates used to produce user documentation. \n• Coached two South American technical writers to produce clear, concise user documentation quickly and effectively. \n• Assisted with the production of white papers and specifications. \n• Provided software quality assurance services to a major software engineering project. Senior Technical Writer Logica March 2001  –  July 2002  (1 year 5 months) Dublin, Ireland Worked as a senior technical writer in two different teams in the Customer Services Group in the Engineering Directorate of Logica Mobile Networks, which was the mobile telecommunications division of Logica, the IT services company. \n \n(1) Initially worked in the Training & Documentation department, which was responsible for delivering training courses and user documentation to customers and which included technical writers, trainers, a courseware developer, and a technical editor. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing documentation for wireless data products. \n• Supervised the work of junior writers in the department. \n \nMain achievements: \n• Used my online help skills and training skills to build and deploy customised WebWorks Publisher templates for use with FrameMaker to allow other technical writers in the company to publish HTML versions of customer-facing documents. \n• Gained a lot of experience of working in an ISO 9000-certified environment. \n \n(2) After four months, transferred to the newly formed Market Readiness team, which was a cross-functional team that included engineers/testers, programme managers, and administrators and which was responsible for the rollout of new products and enhancements and for ensuring quick certifcation of products by customers. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer acceptance test (CAT) plans.  \n \nMain achievements: \n• Used my research, writing, and publishing skills to define and implement new standards for writing and publishing CAT plans in the company. \n• Used my mentoring experience and writing skills to improve the writing skills of other team members. Technical Writer (Contractor) Enba July 2000  –  November 2000  (5 months) Dublin, Ireland • Worked in Enba's Factor-e division, which produced software for internet banking. Sister companies, First-e UK and First-e Germany, were its two main customers. \n• Was the technical writer for a cross-functional team in the Dublin Delivery Centre that included business analysts, programmers, testers, architects, and programme managers. \n \nMain responsibilities: \n• Knowledge management. \n• Making the writing and publishing of project documentation more professional. \n \nMain achievements: \n• Used my knowledge management skills and web production skills to set up and webmaster two intranets. \n• Used my writing skills and graphic design skills to rewrite and add content to the technical documentation for several development projects. \n• Used my proficiency with Word and Visio to define new standards for technical architecture documentation in the company. Technical Writer Local Ireland June 1999  –  July 2000  (1 year 2 months) Dublin, Ireland • Local Ireland was an online newspaper and a sister company of Nua, the internet consultancy. At that time, both companies were heavily involved in knowledge management projects and e-commerce projects. \n• Was a senior member of the company’s Research & Development department, which included programmers, classification experts, a project manager, and a tester. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing all technical and user documentation in the company. \n \nMain achievements: \n• Used my writing skills and project management skills to define and implement a publications-development process and a company style guide. \n• Gained a lot of experience of audience analysis and of developing project plans for publications. \n• Used my online help skills to develop several different forms of HTML Help for web applications. \n• Used my web production skills and project management skills to webmaster the Local Ireland/Nua intranet. \n• Mentored a technical/proposal writer in another department in the company. \n• Participated in many company-wide projects, including GUI design for web applications, search engine optimisation techniques, and a common language initiative. Technical Writer International Financial Systems July 1997  –  June 1999  (2 years) Dublin, Ireland • International Financial Systems (IFS) produced FX trading software. It specialised in collateralised trading systems. IFS’ clients included many well-known banks in Europe, the Middle East, North America, and Asia. IFS is now owned by Integral, a US-based company. \n• Held three positions in the company concurrently: technical writer, research officer (focusing on process improvements across the company), and Health & Safety officer. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing all technical and user documentation in the company. \n \nMain achievements: \n• Set up and managed a documentation department, so gained a lot of experience of budgeting, scheduling, and dealing with printing vendors as well as defining and implementing a publications-development process and a company style guide. \n• Produced a variety of documents: from use-case reports to white papers, from RFPs to user guides, from training guides to release notes, from installation guides to database reference guides. \n• Set up and maintained company templates. \n• Used my QA experience to assist with software testing work. \n• Used my usability knowledge and skills to assist developers with GUI design work. \n• Assisted with responses to RFPs. Instructional Designer Interactive Services November 1996  –  July 1997  (9 months) Dublin, Ireland • Interactive Services is an e-learning company. \n• Worked in a cross-functional team that included another writer, graphic designers, a programmer, and a project manager. \n• Was also a member of the Technical Writing team. \n• Wrote scripts for computer-based training (CBT) courses. \n• Specialised in courses about Cisco Routers, Novell NetWare, and C++. \n• The main audience for these courses was engineers employed by customers. Senior Technical Author BAE Systems Applied Intelligence June 2014  – Present (1 year 3 months) Guildford, United Kingdom • Lone technical writer for Cyber business unit. \n• Responsible for delivery of product documentation for all Cyber software products. \n• Initial focus on CyberReveal product. Senior Technical Author BAE Systems Applied Intelligence June 2014  – Present (1 year 3 months) Guildford, United Kingdom • Lone technical writer for Cyber business unit. \n• Responsible for delivery of product documentation for all Cyber software products. \n• Initial focus on CyberReveal product. Advisory Information Developer IBM July 2011  –  May 2014  (2 years 11 months) London, United Kingdom • In July 2011, joined Green Hat as a lone technical author, which provided testing solutions for SOA, BPM, and other integration technologies and platforms. \n• In January 2012, Green Hat was acquired by IBM. \n• Worked as an advisory information developer for IBM Software Group (Rational). \n \nMain responsibilities: \n• Researching, writing, and illustrating user assistance for Rational Integration Tester (part of Rational Test Workbench), Rational Performance Test Server, and Rational Test Virtualization Server. Advisory Information Developer IBM July 2011  –  May 2014  (2 years 11 months) London, United Kingdom • In July 2011, joined Green Hat as a lone technical author, which provided testing solutions for SOA, BPM, and other integration technologies and platforms. \n• In January 2012, Green Hat was acquired by IBM. \n• Worked as an advisory information developer for IBM Software Group (Rational). \n \nMain responsibilities: \n• Researching, writing, and illustrating user assistance for Rational Integration Tester (part of Rational Test Workbench), Rational Performance Test Server, and Rational Test Virtualization Server. Lead Technical Writer Misys May 2006  –  April 2011  (5 years) London, United Kingdom • Misys sells software and services to banks and other financial institutions. \n• Worked as lead technical writer for Midas, which is a wholesale banking solution. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing and technical documentation for Midas. \n• Building a pipeline of work for the Midas documentation team and supervising other team members. \n• Initiating and driving process improvements for Midas documentation. \n• Mentoring Summit FT technical writers in offshore location. \n \nMain achievements: \n• Introduced project management to the production of Midas documentation. \n• Synchronised documentation delivery with software delivery. \n• Recruited a combined onshore/offshore team to work alongside me on Midas documentation. \n• Initiated projects to address quality problems in legacy documentation. \n• Built strong relationships between the Midas documentation team and other departments across the company. \n• Created a writing skills test for Midas technical writer recruitment, which was subsequently used for global technical writer recruitment at Misys. Lead Technical Writer Misys May 2006  –  April 2011  (5 years) London, United Kingdom • Misys sells software and services to banks and other financial institutions. \n• Worked as lead technical writer for Midas, which is a wholesale banking solution. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing and technical documentation for Midas. \n• Building a pipeline of work for the Midas documentation team and supervising other team members. \n• Initiating and driving process improvements for Midas documentation. \n• Mentoring Summit FT technical writers in offshore location. \n \nMain achievements: \n• Introduced project management to the production of Midas documentation. \n• Synchronised documentation delivery with software delivery. \n• Recruited a combined onshore/offshore team to work alongside me on Midas documentation. \n• Initiated projects to address quality problems in legacy documentation. \n• Built strong relationships between the Midas documentation team and other departments across the company. \n• Created a writing skills test for Midas technical writer recruitment, which was subsequently used for global technical writer recruitment at Misys. Technical Writer Trintech February 2003  –  May 2006  (3 years 4 months) Dublin, Ireland • During my time with the company, Trintech specialised in payment technologies, including point-of-sale, mobile commerce, payment settlement, dispute resolution, fraud management, card management, and chargeback processing; and funds management systems. \n• Worked as a lone technical writer in the Enterprise Banking division and later the Global Services Group in the Payments division. \n• Was also a member of the engineering management team in the Enterprise Banking division and later the management team in the Global Services Group. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing documentation for enterprise systems. \n \nMain achievements: \n• Delivered high-quality user documentation for various products (both hardware and software) in the Payments division. \n• Updated processes and templates used to produce user documentation. \n• Coached two South American technical writers to produce clear, concise user documentation quickly and effectively. \n• Assisted with the production of white papers and specifications. \n• Provided software quality assurance services to a major software engineering project. Technical Writer Trintech February 2003  –  May 2006  (3 years 4 months) Dublin, Ireland • During my time with the company, Trintech specialised in payment technologies, including point-of-sale, mobile commerce, payment settlement, dispute resolution, fraud management, card management, and chargeback processing; and funds management systems. \n• Worked as a lone technical writer in the Enterprise Banking division and later the Global Services Group in the Payments division. \n• Was also a member of the engineering management team in the Enterprise Banking division and later the management team in the Global Services Group. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing documentation for enterprise systems. \n \nMain achievements: \n• Delivered high-quality user documentation for various products (both hardware and software) in the Payments division. \n• Updated processes and templates used to produce user documentation. \n• Coached two South American technical writers to produce clear, concise user documentation quickly and effectively. \n• Assisted with the production of white papers and specifications. \n• Provided software quality assurance services to a major software engineering project. Senior Technical Writer Logica March 2001  –  July 2002  (1 year 5 months) Dublin, Ireland Worked as a senior technical writer in two different teams in the Customer Services Group in the Engineering Directorate of Logica Mobile Networks, which was the mobile telecommunications division of Logica, the IT services company. \n \n(1) Initially worked in the Training & Documentation department, which was responsible for delivering training courses and user documentation to customers and which included technical writers, trainers, a courseware developer, and a technical editor. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing documentation for wireless data products. \n• Supervised the work of junior writers in the department. \n \nMain achievements: \n• Used my online help skills and training skills to build and deploy customised WebWorks Publisher templates for use with FrameMaker to allow other technical writers in the company to publish HTML versions of customer-facing documents. \n• Gained a lot of experience of working in an ISO 9000-certified environment. \n \n(2) After four months, transferred to the newly formed Market Readiness team, which was a cross-functional team that included engineers/testers, programme managers, and administrators and which was responsible for the rollout of new products and enhancements and for ensuring quick certifcation of products by customers. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer acceptance test (CAT) plans.  \n \nMain achievements: \n• Used my research, writing, and publishing skills to define and implement new standards for writing and publishing CAT plans in the company. \n• Used my mentoring experience and writing skills to improve the writing skills of other team members. Senior Technical Writer Logica March 2001  –  July 2002  (1 year 5 months) Dublin, Ireland Worked as a senior technical writer in two different teams in the Customer Services Group in the Engineering Directorate of Logica Mobile Networks, which was the mobile telecommunications division of Logica, the IT services company. \n \n(1) Initially worked in the Training & Documentation department, which was responsible for delivering training courses and user documentation to customers and which included technical writers, trainers, a courseware developer, and a technical editor. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer-facing documentation for wireless data products. \n• Supervised the work of junior writers in the department. \n \nMain achievements: \n• Used my online help skills and training skills to build and deploy customised WebWorks Publisher templates for use with FrameMaker to allow other technical writers in the company to publish HTML versions of customer-facing documents. \n• Gained a lot of experience of working in an ISO 9000-certified environment. \n \n(2) After four months, transferred to the newly formed Market Readiness team, which was a cross-functional team that included engineers/testers, programme managers, and administrators and which was responsible for the rollout of new products and enhancements and for ensuring quick certifcation of products by customers. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing customer acceptance test (CAT) plans.  \n \nMain achievements: \n• Used my research, writing, and publishing skills to define and implement new standards for writing and publishing CAT plans in the company. \n• Used my mentoring experience and writing skills to improve the writing skills of other team members. Technical Writer (Contractor) Enba July 2000  –  November 2000  (5 months) Dublin, Ireland • Worked in Enba's Factor-e division, which produced software for internet banking. Sister companies, First-e UK and First-e Germany, were its two main customers. \n• Was the technical writer for a cross-functional team in the Dublin Delivery Centre that included business analysts, programmers, testers, architects, and programme managers. \n \nMain responsibilities: \n• Knowledge management. \n• Making the writing and publishing of project documentation more professional. \n \nMain achievements: \n• Used my knowledge management skills and web production skills to set up and webmaster two intranets. \n• Used my writing skills and graphic design skills to rewrite and add content to the technical documentation for several development projects. \n• Used my proficiency with Word and Visio to define new standards for technical architecture documentation in the company. Technical Writer (Contractor) Enba July 2000  –  November 2000  (5 months) Dublin, Ireland • Worked in Enba's Factor-e division, which produced software for internet banking. Sister companies, First-e UK and First-e Germany, were its two main customers. \n• Was the technical writer for a cross-functional team in the Dublin Delivery Centre that included business analysts, programmers, testers, architects, and programme managers. \n \nMain responsibilities: \n• Knowledge management. \n• Making the writing and publishing of project documentation more professional. \n \nMain achievements: \n• Used my knowledge management skills and web production skills to set up and webmaster two intranets. \n• Used my writing skills and graphic design skills to rewrite and add content to the technical documentation for several development projects. \n• Used my proficiency with Word and Visio to define new standards for technical architecture documentation in the company. Technical Writer Local Ireland June 1999  –  July 2000  (1 year 2 months) Dublin, Ireland • Local Ireland was an online newspaper and a sister company of Nua, the internet consultancy. At that time, both companies were heavily involved in knowledge management projects and e-commerce projects. \n• Was a senior member of the company’s Research & Development department, which included programmers, classification experts, a project manager, and a tester. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing all technical and user documentation in the company. \n \nMain achievements: \n• Used my writing skills and project management skills to define and implement a publications-development process and a company style guide. \n• Gained a lot of experience of audience analysis and of developing project plans for publications. \n• Used my online help skills to develop several different forms of HTML Help for web applications. \n• Used my web production skills and project management skills to webmaster the Local Ireland/Nua intranet. \n• Mentored a technical/proposal writer in another department in the company. \n• Participated in many company-wide projects, including GUI design for web applications, search engine optimisation techniques, and a common language initiative. Technical Writer Local Ireland June 1999  –  July 2000  (1 year 2 months) Dublin, Ireland • Local Ireland was an online newspaper and a sister company of Nua, the internet consultancy. At that time, both companies were heavily involved in knowledge management projects and e-commerce projects. \n• Was a senior member of the company’s Research & Development department, which included programmers, classification experts, a project manager, and a tester. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing all technical and user documentation in the company. \n \nMain achievements: \n• Used my writing skills and project management skills to define and implement a publications-development process and a company style guide. \n• Gained a lot of experience of audience analysis and of developing project plans for publications. \n• Used my online help skills to develop several different forms of HTML Help for web applications. \n• Used my web production skills and project management skills to webmaster the Local Ireland/Nua intranet. \n• Mentored a technical/proposal writer in another department in the company. \n• Participated in many company-wide projects, including GUI design for web applications, search engine optimisation techniques, and a common language initiative. Technical Writer International Financial Systems July 1997  –  June 1999  (2 years) Dublin, Ireland • International Financial Systems (IFS) produced FX trading software. It specialised in collateralised trading systems. IFS’ clients included many well-known banks in Europe, the Middle East, North America, and Asia. IFS is now owned by Integral, a US-based company. \n• Held three positions in the company concurrently: technical writer, research officer (focusing on process improvements across the company), and Health & Safety officer. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing all technical and user documentation in the company. \n \nMain achievements: \n• Set up and managed a documentation department, so gained a lot of experience of budgeting, scheduling, and dealing with printing vendors as well as defining and implementing a publications-development process and a company style guide. \n• Produced a variety of documents: from use-case reports to white papers, from RFPs to user guides, from training guides to release notes, from installation guides to database reference guides. \n• Set up and maintained company templates. \n• Used my QA experience to assist with software testing work. \n• Used my usability knowledge and skills to assist developers with GUI design work. \n• Assisted with responses to RFPs. Technical Writer International Financial Systems July 1997  –  June 1999  (2 years) Dublin, Ireland • International Financial Systems (IFS) produced FX trading software. It specialised in collateralised trading systems. IFS’ clients included many well-known banks in Europe, the Middle East, North America, and Asia. IFS is now owned by Integral, a US-based company. \n• Held three positions in the company concurrently: technical writer, research officer (focusing on process improvements across the company), and Health & Safety officer. \n \nMain responsibilities: \n• Researching, writing, illustrating, editing, and project managing all technical and user documentation in the company. \n \nMain achievements: \n• Set up and managed a documentation department, so gained a lot of experience of budgeting, scheduling, and dealing with printing vendors as well as defining and implementing a publications-development process and a company style guide. \n• Produced a variety of documents: from use-case reports to white papers, from RFPs to user guides, from training guides to release notes, from installation guides to database reference guides. \n• Set up and maintained company templates. \n• Used my QA experience to assist with software testing work. \n• Used my usability knowledge and skills to assist developers with GUI design work. \n• Assisted with responses to RFPs. Instructional Designer Interactive Services November 1996  –  July 1997  (9 months) Dublin, Ireland • Interactive Services is an e-learning company. \n• Worked in a cross-functional team that included another writer, graphic designers, a programmer, and a project manager. \n• Was also a member of the Technical Writing team. \n• Wrote scripts for computer-based training (CBT) courses. \n• Specialised in courses about Cisco Routers, Novell NetWare, and C++. \n• The main audience for these courses was engineers employed by customers. Instructional Designer Interactive Services November 1996  –  July 1997  (9 months) Dublin, Ireland • Interactive Services is an e-learning company. \n• Worked in a cross-functional team that included another writer, graphic designers, a programmer, and a project manager. \n• Was also a member of the Technical Writing team. \n• Wrote scripts for computer-based training (CBT) courses. \n• Specialised in courses about Cisco Routers, Novell NetWare, and C++. \n• The main audience for these courses was engineers employed by customers. Languages English Native or bilingual proficiency French Elementary proficiency German Limited working proficiency English Native or bilingual proficiency French Elementary proficiency German Limited working proficiency English Native or bilingual proficiency French Elementary proficiency German Limited working proficiency Native or bilingual proficiency Elementary proficiency Limited working proficiency Skills Technical Writing Visio FrameMaker RoboHelp Documentations Manuals Management Technical editing HTML Supervising other... Documentation project... DITA Business Analysis Online Help Development JavaScript UML Windows Adobe Acrobat Unix Operating Systems Adobe FrameMaker Adobe RoboHelp Microsoft Word Microsoft Excel Microsoft PowerPoint Microsoft Visio Microsoft Access Quadralay WebWorks... PTC Arbortext Testing Technical Documentation DITA XML Unix Documentation See 18+     See less Skills  Technical Writing Visio FrameMaker RoboHelp Documentations Manuals Management Technical editing HTML Supervising other... Documentation project... DITA Business Analysis Online Help Development JavaScript UML Windows Adobe Acrobat Unix Operating Systems Adobe FrameMaker Adobe RoboHelp Microsoft Word Microsoft Excel Microsoft PowerPoint Microsoft Visio Microsoft Access Quadralay WebWorks... PTC Arbortext Testing Technical Documentation DITA XML Unix Documentation See 18+     See less Technical Writing Visio FrameMaker RoboHelp Documentations Manuals Management Technical editing HTML Supervising other... Documentation project... DITA Business Analysis Online Help Development JavaScript UML Windows Adobe Acrobat Unix Operating Systems Adobe FrameMaker Adobe RoboHelp Microsoft Word Microsoft Excel Microsoft PowerPoint Microsoft Visio Microsoft Access Quadralay WebWorks... PTC Arbortext Testing Technical Documentation DITA XML Unix Documentation See 18+     See less Technical Writing Visio FrameMaker RoboHelp Documentations Manuals Management Technical editing HTML Supervising other... Documentation project... DITA Business Analysis Online Help Development JavaScript UML Windows Adobe Acrobat Unix Operating Systems Adobe FrameMaker Adobe RoboHelp Microsoft Word Microsoft Excel Microsoft PowerPoint Microsoft Visio Microsoft Access Quadralay WebWorks... PTC Arbortext Testing Technical Documentation DITA XML Unix Documentation See 18+     See less Education University of Limerick Graduate Diploma,  Technical Communication 1995  – 1996 University College Dublin M.Sc.,  Economics 1991  – 1992 Activities and Societies:  Official Tutor for Economics Department (taught intermediate microeconomics to B.Comm undergraduates) University College Dublin B.Comm,  Economics 1989  – 1991 Activities and Societies:  AIESEC ,  German Society ,  Commerce & Economics Society ,  Literary & Historical Society ,  Law Society University of Limerick Graduate Diploma,  Technical Communication 1995  – 1996 University of Limerick Graduate Diploma,  Technical Communication 1995  – 1996 University of Limerick Graduate Diploma,  Technical Communication 1995  – 1996 University College Dublin M.Sc.,  Economics 1991  – 1992 Activities and Societies:  Official Tutor for Economics Department (taught intermediate microeconomics to B.Comm undergraduates) University College Dublin M.Sc.,  Economics 1991  – 1992 Activities and Societies:  Official Tutor for Economics Department (taught intermediate microeconomics to B.Comm undergraduates) University College Dublin M.Sc.,  Economics 1991  – 1992 Activities and Societies:  Official Tutor for Economics Department (taught intermediate microeconomics to B.Comm undergraduates) University College Dublin B.Comm,  Economics 1989  – 1991 Activities and Societies:  AIESEC ,  German Society ,  Commerce & Economics Society ,  Literary & Historical Society ,  Law Society University College Dublin B.Comm,  Economics 1989  – 1991 Activities and Societies:  AIESEC ,  German Society ,  Commerce & Economics Society ,  Literary & Historical Society ,  Law Society University College Dublin B.Comm,  Economics 1989  – 1991 Activities and Societies:  AIESEC ,  German Society ,  Commerce & Economics Society ,  Literary & Historical Society ,  Law Society ", "Languages Some reading knowledge of French Some reading knowledge of French Some reading knowledge of French Skills Library Archives Cataloging Metadata Information Literacy Circulation Library Science Academic Libraries Dublin Core Skills  Library Archives Cataloging Metadata Information Literacy Circulation Library Science Academic Libraries Dublin Core Library Archives Cataloging Metadata Information Literacy Circulation Library Science Academic Libraries Dublin Core Library Archives Cataloging Metadata Information Literacy Circulation Library Science Academic Libraries Dublin Core Honors & Awards ", "Skills Content Management Technical Communication Web 2.0 Content Analytics Enterprise Search Software Documentation Web Content Management Content Development Information Architecture Knowledge Management Usability Testing Online Help Enterprise Content... Usability User Experience Technical Writing Media Analysis Content Strategy Agile Methodologies DITA HTML Writing CMS RoboHelp See 9+     See less Skills  Content Management Technical Communication Web 2.0 Content Analytics Enterprise Search Software Documentation Web Content Management Content Development Information Architecture Knowledge Management Usability Testing Online Help Enterprise Content... Usability User Experience Technical Writing Media Analysis Content Strategy Agile Methodologies DITA HTML Writing CMS RoboHelp See 9+     See less Content Management Technical Communication Web 2.0 Content Analytics Enterprise Search Software Documentation Web Content Management Content Development Information Architecture Knowledge Management Usability Testing Online Help Enterprise Content... Usability User Experience Technical Writing Media Analysis Content Strategy Agile Methodologies DITA HTML Writing CMS RoboHelp See 9+     See less Content Management Technical Communication Web 2.0 Content Analytics Enterprise Search Software Documentation Web Content Management Content Development Information Architecture Knowledge Management Usability Testing Online Help Enterprise Content... Usability User Experience Technical Writing Media Analysis Content Strategy Agile Methodologies DITA HTML Writing CMS RoboHelp See 9+     See less ", "Experience Advisory Information Developer IBM Canada Ltd. September 2005  – Present (10 years) Senior Technical Writer Danfoss Turbocor February 2000  –  September 2005  (5 years 8 months) Technical Documentation Manager Memotec August 1997  –  February 2000  (2 years 7 months) Team Leader West End (Newbridge Networks) January 1995  –  August 1997  (2 years 8 months) Flight simulator publications group leader CAE November 1978  –  January 1995  (16 years 3 months) Advisory Information Developer IBM Canada Ltd. September 2005  – Present (10 years) Advisory Information Developer IBM Canada Ltd. September 2005  – Present (10 years) Senior Technical Writer Danfoss Turbocor February 2000  –  September 2005  (5 years 8 months) Senior Technical Writer Danfoss Turbocor February 2000  –  September 2005  (5 years 8 months) Technical Documentation Manager Memotec August 1997  –  February 2000  (2 years 7 months) Technical Documentation Manager Memotec August 1997  –  February 2000  (2 years 7 months) Team Leader West End (Newbridge Networks) January 1995  –  August 1997  (2 years 8 months) Team Leader West End (Newbridge Networks) January 1995  –  August 1997  (2 years 8 months) Flight simulator publications group leader CAE November 1978  –  January 1995  (16 years 3 months) Flight simulator publications group leader CAE November 1978  –  January 1995  (16 years 3 months) Skills DITA Single Sourcing Skills  DITA Single Sourcing DITA Single Sourcing DITA Single Sourcing Education Concordia University Software development for WWW certificate, .NET programming certificate 1998  – 2006 Concordia University Software development for WWW certificate, .NET programming certificate 1998  – 2006 Concordia University Software development for WWW certificate, .NET programming certificate 1998  – 2006 Concordia University Software development for WWW certificate, .NET programming certificate 1998  – 2006 ", "Experience Advisory Information Developer IBM Exhibitor Cat Fanciers' Association, Inc 2012  – Present (3 years) Member/Show Manager/Entry Clerk/Master Clerk/etc. The International Cat Association (TICA) 1992  – Present (23 years) Advisory Information Developer IBM 1983  – Present (32 years) Responsible to create the technical documentation in support of IBM software products. Advisory Information Developer IBM Advisory Information Developer IBM Exhibitor Cat Fanciers' Association, Inc 2012  – Present (3 years) Exhibitor Cat Fanciers' Association, Inc 2012  – Present (3 years) Member/Show Manager/Entry Clerk/Master Clerk/etc. The International Cat Association (TICA) 1992  – Present (23 years) Member/Show Manager/Entry Clerk/Master Clerk/etc. The International Cat Association (TICA) 1992  – Present (23 years) Advisory Information Developer IBM 1983  – Present (32 years) Responsible to create the technical documentation in support of IBM software products. Advisory Information Developer IBM 1983  – Present (32 years) Responsible to create the technical documentation in support of IBM software products. Skills Microsoft Excel Online Help Technical Writing Software Documentation Technical Communication Agile Methodologies Manuals Content Management Requirements Analysis Management DITA Wikis Technical Documentation Social Media XML Project Management Editing Information Architecture Software Project... HTML Software Development Team Leadership Program Management Event Planning See 9+     See less Skills  Microsoft Excel Online Help Technical Writing Software Documentation Technical Communication Agile Methodologies Manuals Content Management Requirements Analysis Management DITA Wikis Technical Documentation Social Media XML Project Management Editing Information Architecture Software Project... HTML Software Development Team Leadership Program Management Event Planning See 9+     See less Microsoft Excel Online Help Technical Writing Software Documentation Technical Communication Agile Methodologies Manuals Content Management Requirements Analysis Management DITA Wikis Technical Documentation Social Media XML Project Management Editing Information Architecture Software Project... HTML Software Development Team Leadership Program Management Event Planning See 9+     See less Microsoft Excel Online Help Technical Writing Software Documentation Technical Communication Agile Methodologies Manuals Content Management Requirements Analysis Management DITA Wikis Technical Documentation Social Media XML Project Management Editing Information Architecture Software Project... HTML Software Development Team Leadership Program Management Event Planning See 9+     See less Education University of Florida 1979  – 1983 University of Florida 1979  – 1983 University of Florida 1979  – 1983 University of Florida 1979  – 1983 ", "Summary Technical writing, information architecture - emphasis on enterprise software \nMarketing - enterprise software \n \nFellow, Society for Technical Communication Summary Technical writing, information architecture - emphasis on enterprise software \nMarketing - enterprise software \n \nFellow, Society for Technical Communication Technical writing, information architecture - emphasis on enterprise software \nMarketing - enterprise software \n \nFellow, Society for Technical Communication Technical writing, information architecture - emphasis on enterprise software \nMarketing - enterprise software \n \nFellow, Society for Technical Communication Experience Information Architect / Project Manager Systems Documentation Inc. (SDI) 2007  – Present (8 years) Raleigh-Durham, North Carolina Area We provide technical documentation consultancy and services, with emphasis in information architecture, structured authoring, and DITA. Instructor Duke University January 2003  – Present (12 years 8 months) Teaching \"Managing the Information Development Process,\" part of the Technical Communication certification program at Duke University Continuing Studies. Senior Information Developer Symantec Corp. October 2002  –  February 2007  (4 years 5 months) Formerly VERITAS Software Corp. \nDeveloped documentation for enterprise-level storage management software Advisory Information Developer IBM January 2000  –  July 2002  (2 years 7 months) Led and participated on teams that developed customer documentation for middleware software products. Marketing Communications IBM 1996  –  2000  (4 years) Developed customer-facing website and magazine \nWrote profiles of reference customers member, board of directors Society for Technical Communication 1992  –  1998  (6 years) Two stints as a voting board member: 1992-1994 and 2008. Also served as Assistant to the President for Professional Development 1994-1998. Information Architect / Project Manager Systems Documentation Inc. (SDI) 2007  – Present (8 years) Raleigh-Durham, North Carolina Area We provide technical documentation consultancy and services, with emphasis in information architecture, structured authoring, and DITA. Information Architect / Project Manager Systems Documentation Inc. (SDI) 2007  – Present (8 years) Raleigh-Durham, North Carolina Area We provide technical documentation consultancy and services, with emphasis in information architecture, structured authoring, and DITA. Instructor Duke University January 2003  – Present (12 years 8 months) Teaching \"Managing the Information Development Process,\" part of the Technical Communication certification program at Duke University Continuing Studies. Instructor Duke University January 2003  – Present (12 years 8 months) Teaching \"Managing the Information Development Process,\" part of the Technical Communication certification program at Duke University Continuing Studies. Senior Information Developer Symantec Corp. October 2002  –  February 2007  (4 years 5 months) Formerly VERITAS Software Corp. \nDeveloped documentation for enterprise-level storage management software Senior Information Developer Symantec Corp. October 2002  –  February 2007  (4 years 5 months) Formerly VERITAS Software Corp. \nDeveloped documentation for enterprise-level storage management software Advisory Information Developer IBM January 2000  –  July 2002  (2 years 7 months) Led and participated on teams that developed customer documentation for middleware software products. Advisory Information Developer IBM January 2000  –  July 2002  (2 years 7 months) Led and participated on teams that developed customer documentation for middleware software products. Marketing Communications IBM 1996  –  2000  (4 years) Developed customer-facing website and magazine \nWrote profiles of reference customers Marketing Communications IBM 1996  –  2000  (4 years) Developed customer-facing website and magazine \nWrote profiles of reference customers member, board of directors Society for Technical Communication 1992  –  1998  (6 years) Two stints as a voting board member: 1992-1994 and 2008. Also served as Assistant to the President for Professional Development 1994-1998. member, board of directors Society for Technical Communication 1992  –  1998  (6 years) Two stints as a voting board member: 1992-1994 and 2008. Also served as Assistant to the President for Professional Development 1994-1998. Languages   Skills Technical Communication Software Documentation Content Management Information Architecture DITA Technical Training Content Strategy Editing Strategic Planning Leadership Information Development Technical Writing Content Development Technical Documentation Online Help Single Sourcing Structured Authoring Writing Project Management Instructor-led Training Manuals Information Design CMS Marketing Communications Knowledge Management Management Usability Testing SnagIt FrameMaker Instructional Design Product Marketing Training E-Learning Agile Project Management Training Delivery Document Management Proposal Writing Needs Analysis Learning Management Usability User Experience Desktop Publishing Enterprise Software XMetal See 29+     See less Skills  Technical Communication Software Documentation Content Management Information Architecture DITA Technical Training Content Strategy Editing Strategic Planning Leadership Information Development Technical Writing Content Development Technical Documentation Online Help Single Sourcing Structured Authoring Writing Project Management Instructor-led Training Manuals Information Design CMS Marketing Communications Knowledge Management Management Usability Testing SnagIt FrameMaker Instructional Design Product Marketing Training E-Learning Agile Project Management Training Delivery Document Management Proposal Writing Needs Analysis Learning Management Usability User Experience Desktop Publishing Enterprise Software XMetal See 29+     See less Technical Communication Software Documentation Content Management Information Architecture DITA Technical Training Content Strategy Editing Strategic Planning Leadership Information Development Technical Writing Content Development Technical Documentation Online Help Single Sourcing Structured Authoring Writing Project Management Instructor-led Training Manuals Information Design CMS Marketing Communications Knowledge Management Management Usability Testing SnagIt FrameMaker Instructional Design Product Marketing Training E-Learning Agile Project Management Training Delivery Document Management Proposal Writing Needs Analysis Learning Management Usability User Experience Desktop Publishing Enterprise Software XMetal See 29+     See less Technical Communication Software Documentation Content Management Information Architecture DITA Technical Training Content Strategy Editing Strategic Planning Leadership Information Development Technical Writing Content Development Technical Documentation Online Help Single Sourcing Structured Authoring Writing Project Management Instructor-led Training Manuals Information Design CMS Marketing Communications Knowledge Management Management Usability Testing SnagIt FrameMaker Instructional Design Product Marketing Training E-Learning Agile Project Management Training Delivery Document Management Proposal Writing Needs Analysis Learning Management Usability User Experience Desktop Publishing Enterprise Software XMetal See 29+     See less Education William & Mary AB,  English ,  Philosophy 1974  – 1978 Activities and Societies:  Phi Beta Kappa\nIntervarsity Christian Fellowship The George Washington University Masters certificate,  Project Management William & Mary AB,  English ,  Philosophy 1974  – 1978 Activities and Societies:  Phi Beta Kappa\nIntervarsity Christian Fellowship William & Mary AB,  English ,  Philosophy 1974  – 1978 Activities and Societies:  Phi Beta Kappa\nIntervarsity Christian Fellowship William & Mary AB,  English ,  Philosophy 1974  – 1978 Activities and Societies:  Phi Beta Kappa\nIntervarsity Christian Fellowship The George Washington University Masters certificate,  Project Management The George Washington University Masters certificate,  Project Management The George Washington University Masters certificate,  Project Management Honors & Awards Additional Honors & Awards Fellow, Society for Technical Communication (STC) Additional Honors & Awards Fellow, Society for Technical Communication (STC) Additional Honors & Awards Fellow, Society for Technical Communication (STC) Additional Honors & Awards Fellow, Society for Technical Communication (STC) ", "Experience Principal Technical Writer CA Technologies October 2004  – Present (10 years 11 months) I create and edit documentation for end users and programmers, including APIs in C++, Java, c#, and Perl. Principal Technical Writer CA Technologies October 2004  – Present (10 years 11 months) I create and edit documentation for end users and programmers, including APIs in C++, Java, c#, and Perl. Principal Technical Writer CA Technologies October 2004  – Present (10 years 11 months) I create and edit documentation for end users and programmers, including APIs in C++, Java, c#, and Perl. Skills C++ Technical Writing Software Documentation Skills  C++ Technical Writing Software Documentation C++ Technical Writing Software Documentation C++ Technical Writing Software Documentation Education Harvard University Master of Theological Studies (MTS) State University of New York at Stony Brook BA University of California, Berkeley Extension School Harvard University Master of Theological Studies (MTS) Harvard University Master of Theological Studies (MTS) Harvard University Master of Theological Studies (MTS) State University of New York at Stony Brook BA State University of New York at Stony Brook BA State University of New York at Stony Brook BA University of California, Berkeley Extension School University of California, Berkeley Extension School University of California, Berkeley Extension School ", "Experience Advisory Information Developer IBM Tivoli Software Advisory Information Developer IBM 2004  – Present (11 years) Advisory Information Developer IBM Tivoli Software Advisory Information Developer IBM Tivoli Software Advisory Information Developer IBM 2004  – Present (11 years) Advisory Information Developer IBM 2004  – Present (11 years) "]}